{"id": 339, "title": "Doctor Strange", "starring": ["Benedict Cumberbatch", "Chiwetel Ejiofor"], "runtime": 115, "genre": ["Action", "Adventure", "Fantasy"], "description": "After his career is destroyed, a brilliant but arrogant surgeon gets a new lease on life when a sorcerer takes him under her wing and trains him to defend the world against evil.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/uGBVj3bEbCoZbDjjl9wTxcygko1.jpg", "categories": {"plot": 8.14, "acting": 8.361702127659575, "ending": 8.0, "soundtrack": 8.0, "cinematography": 8.0, "familyFriendly": 6.0, "funny": 8.222222222222221, "action": 8.26086956521739}, "reviews": [{"rating": "10", "text": "To some, it is an explosion of impeccable animation, CGI, and special effects. To some a hearty movie enjoyed by the family. But to me, this is all that story-telling should be. Marvel never ceases to elevate their standards even to a character that doesn't have much fame and appeal to some folks out there.\r Throughout the movie, you'll find yourself engaged with the light humor they've added especially the limitless action and thrill that comprise every scene, not to forget the gigantic smear of imagination on the side of the plate.\r Unlike any other movie, this one you would want to watch on the big screen. The motive is yours but I urge you for the experience of it all. You won't ever regret your dollars spent."}, {"rating": "7", "text": "DOCTOR STRANGE REVIEW\r Doctor Strange is here. This is one of the most unique Marvel properties, and the first MCU Property that Marvel had to go full magic with. Lot of the other characters that should have been using magic in the MCU has not really done so, and was always able to be explained through science and technology. That buck stops here with Doctor Strange, first magical character to grace the Marvel Cinematic Universe. And it is brought to life by one of the most talented actors in Hollywood right now. And for the most part it works, it is entertaining and fun and that's great but it doesn't really go above that factor.\r This is going to be strange sounding but Doctor Strange to me seems almost like a remake of Iron Man,  with another skin over it, there are a ton of similarities between the two movies which I am not going to spoil here, but they are not hard to see.  Cumberbatch as Stephen Strange is really good and really manages to bring the wonder to the character even though his American accent is a bit hard to stomache at times, it does not detract from his performance as Stephen Strange. And this is not his fault, but with the screenplay he was given, he had to channel another Marvel hero quite a bit, which at least for me was a bit detracting.  Without spoiling anything that wasn't already seen in the trailer, Stephen Strange is a doctor that gets thrust into world of magic after an accident, and this is where he meets the Ancient One played by multi talented Tilda Swinton. And she is also more than capable of carrying her part even though the character of Ancient One in the comic books is an elderly Asian guy, that does not detract from the mission she had in the movie.\r Other characters in this movie involve Mads Mikkelsen of Hannibal and James Bond fame as the pseudo-villain of the movie which rejected the Ancient One's training and is trying to create a cult of his own, and again with what he was given he was alright but not much was given to him to do. Entire threat that Doctor Strange needs to face throughout the movie are like five or ten magical users, and the movie again does an Avenger trope of hey lets beat up on the minions until we get to the main boss.  Problem is there never really seems to be a much of a threat here.  Chiwetel Eijofor is also in this movie as Mordo, and well again he was not really given much to do, he is a trainer for Strange, and a guardian for him.\r This movie was directed by Scott Derickson of Sinister fame (or infamy) for others, and I was really hoping he would bring that visual flair that he brought to Sinister, not so much make it a horror movie, but for the movie have that feeling of impending darkness and dwelling of doom from time to time. And I don't know if this was intentional or not, but when we were supposed to be coming to those parts movie actually turned to another movie from another franchise back in 1997 which I will not name but it does involve Bats and Birds (*wink wink*). And I found that a bit distracting.\r Visually movie looks great with use of magic and some of the fights are spectacular to watch. I have not seen the movie in 3D, and part of me wishes that I did and the other part is very very glad I did not, as a lot of the scenes are very Inception like, but in a sense it is Inception to the nth degree where the confusion can set into place, and lot of it looks like you are watching a movie through a Kaledioscope, which looks beautiful don't get me wrong, but prolonged exposure can give you headaches!\r And more thing that is worth mentioning is costume design in this movie is phenomenal and they could not have made Doctor Strange's cloak and full costume any better!\r There are 2 post credit scenes that I won't spoil, but one of them I sure you can guess what it is, if you are familiar with the comics at all.\r Overall movie is enjoyable watch, its not nearly the best Marvel movie and is far from being the worst one as well, if you can overlook the similarities between this and the other Marvel movie that proceeded it, you might be able to enjoy the story little bit more than me. Just make sure you understand that is in origin story and same with any origin story, there is a ton of exposition where they try to bombard you with information you may or may not need to have. Visuals are fun to watch, even sometimes distracting, and movie is definetely worth watching for Cumberbatch's and Swinton's performances which are alone worth price of admission. Just get past his American accent.\r 2.75 out of 4"}, {"rating": "7", "text": "The latest offering from the MCU, Benedict Cumberbatch takes on the titular role quite well I must say. He makes great and humorous use of his character which is always nice to have in a Marvel film. The rest of the talented supporting cast with the likes of Chiwetel Ejiofor, Rachel McAdams, Mads Mikkelson, and Tilda Swinton were all fun to watch as well. In addition, we're presented with what's easily Marvel's trippiest film yet! The effects are dazzling and truly a sight to behold, but admittedly did get a bit too colorful and all over the place at times for my liking. Overall, in terms of the MCU it's certainly no game-changer and while I enjoyed Civil War earlier this year significantly more, this is still what I'd consider to be a fun and entertaining addition that makes me look forward to seeing Cumberbatch return in the next Avengers film."}, {"rating": "8", "text": "Wonderful movie with all the action and VFX will blow your mind. Benedict 's acting also really good and . One again Marvel recipes for super Heroes movie had success. But sadly weak vigilante seem like still their weakness"}, {"rating": "8", "text": "Sitting through Doctor Strange was a fantastic experience. Marvel brings to the screen a new superhero it has never evoked before and it doesn't disappoint at all. The story of the arrogant neurosurgeon turned into a mystical superhero might sound cliché, but with strong performances from Benedict Cumberbatch (damn, he truly killed it, but then again, he always does, doesn't he?) and Tilda Swinton, and outstanding visual effets and cinematography backing it up, the story really builds and takes twists and turns and comes to a totally rational and applausable conclusion. Though one of the main flaws is that Rachel McAdams should've appeared more throughout the scenes, watching this film was very enjoyable and pleasurable. Waiting for the next Marvel release!"}, {"rating": "7", "text": "At this point anything with the name Marvel attached to it, is box office gold, as is evident by their latest film, Doctor Strange. The Doctor is perhaps one of the least known out of all of their characters, yet he is still pulling in huge numbers. The big question is whether or not the film lives up to the hype, and I can honestly say, I'm not really sure. Dr. Steven Strange (Benedict Cumberbatch) is a world renowned surgeon, who is badly injured in a car accident. When modern medicine fails him, Strange starts looking for alternative treatments and finds a bizarre ancient group, that claims they can teach him how to heal himself, and do a whole lot more. The big appeal of this movie, at least for me was the special effects. I knew the effects would be good, but Marvel really out did themselves this time. I watch close to three hundred films a year, and I'm not often impressed by special effects, but the effects in this movie really blew me away. That being said, this is just one of those film you have to shell out the extra money to see in 3D. It's a completely different experience in 3D and you really will be amazed by some of the things they can do. As for the story, it really is the same thing that Marvel keeps doing over and over again. I've really enjoyed the Marvel films and while they are all unique in their own way, the underlying theme always seems to be the same. Someone gets hurt, they lose the girl they love, they find someone or a group of someones who help make them extraordinary, then they fight the bad guys and in the process get the girl. It's a formula that is in every single one of their films and it's getting a little tiresome. The bottom line, Doctor Strange is pure Marvel. What I mean by that is, it's the expected story, with unique traits specific to this character, a Stan Lee cameo, a cast full of superstars, two scenes after the credits, and perhaps the best special effects you'll ever see. If you're a fan of these films, you won't be disappointed by Doctor Strange."}, {"rating": "8", "text": "Cumberbatch does a fantastic job as the title character. The plot is action packed, Fast paced and plenty interesting to watch. There's no real major flaws to it other than the often hit n miss humor."}, {"rating": "8", "text": "This is pretty much everything I would have wanted...scratch that, have wanted from a Doctor Strange movie for years. It had great special effects, great acting, and a great plot, along with plenty of jokes, as all Marvel movies do."}, {"rating": "8", "text": "There's not much more to add to the superlatives slung at this Marvelicious movie.  Fun, engaging, lighthearted in all the right places...but serious and introspective upon reflection.  To all this I would add that the violence is restrained and appropriate for younger viewers.  There's surgical blood and shadowed silhouettes of a grisly end, but on the whole it's just barely in PG-13 territory."}, {"rating": "10", "text": "This is great! All this house twisting made my brain both hurt and pleased :) Acting was awesome, I really liked Dr.Strange, Ceaelicius (awesome face) and Tilda Swinton as First Sorceress (I'm huge fan of hers). 10 of 10."}, {"rating": "8", "text": "\"Doctor Strange\" was an amazing, fantastic, and incredible movie, the embodiment of this mystical character in the comics, was very good and I liked the performances of Cumberbatch, McAdams, Ejiofor, Wong, Mikkelsen and why not ?, the Swinton, excelled, the cameos of Thor and teacher Stan Lee, great, the story was entertaining and spectacular, this proves to me, as one of my favorite Marvel and why not the year, BvS, Civil War and Suicide Squad, were in the past, the new trend in the world of comics fandom now, Doctor Strange."}, {"rating": "8", "text": "First movie I've seen worth seeing in 3D. And not that the story wasn't good, but the effects alone make the movie worth watching. Overall it was a very fun, unique movie with a very interesting premise and the areas the franchise could take Dr. Strange in the future range from horror to fantasy which get me excited for a sequel. The movie however doesn't come without some faults. I was hoping for just a little more depth to each of the characters and wished Dormammu brought a little more of the horror element out of the movie. Other than that the movie was solid, and I definitely recommend it."}, {"rating": "8", "text": "Doctor Strange yet again shows how Marvel Studios has been taking some of their most bizarre comic book characters and turning them into great movies. The movie has good writing with enough serious notes while still full of laughs. The action and effects are really great, adding a unique flavour never seen before in a Marvel movie. And the casting choices are solid as well, with all the main characters giving good performances. I wish Mads Mikkelsen's character could have been fleshed out a bit more, but other than that its a well done superhero movie."}, {"rating": "10", "text": "For all intents and purposes, a superhero film focusing on the character Doctor Strange would be difficult to pull off, but one of the movie's spectacular qualities is it blends together many different elements in a seamless narrative. Dr. Stephen Strange is initially narcissistic and arrogant; traits similar to other Marvel cinematic heroes like Iron Man. However, Benedict Cumberbatch's performance is subtle and engaging. He is a deeply flawed hero, but an engaging one nonetheless. What I most enjoyed about this film is its attention to Strange's character and his journey to understand more about the world. The effects were also visually interesting and I felt they connected to the themes of spirituality and resourcefulness present in the main character. Though this is technically an origins film, it defies typical norms found in usual movies of the same degree, and tense action meets satisfying drama in this astounding cinematic debut."}, {"rating": "8", "text": "Сюжет 7/10 графоний 10/10. Слишком много юмора даже для мурвел, злодей вообще никакой.Сцена с Дормамму спасла этот фильм"}, {"rating": "8", "text": "Doctor Strange, directed by Scott Derrickson, is not only the fourteenth installment in the Marvel Cinematic Universe, but a film that brings in a whole new perspective of magic and sorcery in the franchise. What you are given is a spectacular tale of a man who defies all odds, to learn the art and craft of magic, who is magnificently played by the great Benedict Cumberbatch. Other than Benedict, the film boasts a stellar cast with the likes of Mads Mikkelsen, Tilda Swinton, Rachael McAdams and Chiwetel Ejiofor, who all play their parts great as well. Accompanied by top-quality visuals, interesting origin stories and one of most fascinating music scores in Marvel history, you are giving one of the better Marvel films in recent memory.With 2016 slowly drawing to a close, the year of movies hasn't been the most satisfying as major blockbusters haven't been able to reach the heights we wished they would. I have been slightly disappointed with what has come out so far this year, with the likes of Batman v Superman: Dawn of Justice, X-Men Apocalypse and Jason Bourne failing to live up to the hype. I believe Doctor Strange is up there with some of the best this year, which include Captain America: Civl War, Finding Dory, Zootopia, Deadpool and the Jungle Book. Not only do the visuals take your mind away, but it shows that Marvel still has what it takes to make good films (especially with so many superhero movies coming out in the next couple of years). It also proves that Marvel is capable of placing unknown directors with big blockbuster movies, like what they did with James Gunn in Guardians of the Galaxy and Scott Derrickson with this movie. It also sets up the character well for future movies as Benedict has confirmed he will take part in Avengers: Infinity Wars and possibly other Marvel movies.If I were to make one criticism for the movie, it'll have to be the overuse and forcefulness of humor, especially when the movie started to get more serious. But, it did make the audience laugh in some moments, so it isn't much of a concern. To finish off, we are taken on a visually impressive journey throughout Doctor Strange's world and how he prepares to enter the Marvel Cinematic Universe in a big way."}, {"rating": "10", "text": "This film is very good and you must watch this film .Magic and Adventures in this film.Strange is very popular doctor but after He is very powerful magicen"}, {"rating": "7", "text": "Perfectly enjoyable fun. Sound familiar? Doctor Strange being adifferent kind of hero doesn't really excuse most of this film'sconventional plotting.There's a much more interesting film in here, one in which MadsMikkelsen isn't the main villain (yet) and getting in the way of thehero's journey and in which Tilda Swinton is even more ambiguous. Her obvious parallels to Stephen are perfectly apt and yet not allowed enough time to breathe and spin. It's all a last minute reveal and then a call to arms because plot and all is well because plot.A lot has been made of the \"trippy\" special effects, and I guess theyare compared to the traditional visuals employed in these types ofmovies. But let's not get carried away. Besides the travels throughspace and mind it's mostly buildings moving around like they're inInception.I didn't buy the last end credits scene. Useless and not earned. I'msick of hero's with photographic memories. Let the hero be exceptional on their own merits. Action scenes could be less choppily edited. But still, it's fun in ways other recent Marvel movies haven't been."}, {"rating": "10", "text": "Simply brilliant! The special effects is crazy good! I was captivated from start to end. Much better than expected. Love the acting by the male lead, the head sorceress and the scary-cat lady doctor."}, {"rating": "7", "text": "The decade old formula of these Marvel movies is starting to wear a little thin these days to be honest but it's hard to deny that Doctor Strange does still makes for an entertaining couple of hours for Super Hero fans. Some of the scenes, such as the one where everything around the protagonists is moving backwards in time, are absolutely spectacular and there is as ever plenty of comical and light hearted moments. Maybe we'll one day see a movie that truly does something different but for now this is what we have and I can't imagine to many people will be disappointed with what they see."}, {"rating": "8", "text": "Doctor Strange is a Marvel film that's following their post-Avengers formula. There's a love interest that feels forced, which drains storytelling from the main plot. There's also extremely awkward, cheesy humor that's obviously used to garner reactions from really young and really old people. Though these moments are more frequent than I'd like, it isn't particularly intrusive. The visuals are incredible. If you want to see a prime example of visual effects this year, check out Doctor Strange."}, {"rating": "9", "text": "Wow, a Marvel movie with impeccable storytelling, great CGI, tons of action, I thought they just couldn't do it, but they can and they did. They should have made more movies like this over what they've been turning out lately."}, {"rating": "8", "text": "Marvel picked the perfect actor for Doctor Strange,because Benedict Cumberbatch was born for the role. I watched the film last night, and I was blown away with the visuals/CGI effects. This is one of best looking Marvel films, probably the best looking one so far. The story has a decent pace to it, but the introduction with Doctor Strange felt rushed. I was a bit disappointed with the villain, even though the fight scenes were great, I still wanted more from the villain. Doctor Strange is very unique, and different compared to the previous Marvel films. Being different in this case is totally fine, something I want to see more from Marvel."}, {"rating": "7", "text": "Structural familiarity aside, Marvel's \"Doctor Strange\" does manage to serve up enough innovative visual tricks and concepts to keep the audience members in its pocket. And, after witnessing the film's incredibly well-constructed third act, I can say the overall experience left a big smile on my face."}, {"rating": "8", "text": "When a science person was the chosen one in the spiritual world!You would have not expected it from this director if you had seen his previous films. This was based on the Marvel comics that I haven't touched. So basically I had high expectation to witness another side of Marvel universe with another set of (super)heroes. And surprisingly, it was very entertaining, nothing like other Marvel's heroes/story, except the possession of superpower to fight evil forces.Firstly, Benedict Cumberbatch in the lead in a Marvel film, I did not think it would work. All I knew is he was a great sidekick, but that image has changed here. He was wonderful, definitely I'll be looking forward to its sequel as they had confirmed at the end. The theme wise, it is similar to most of the superhero tales, but some new concepts were added to it, I mean the superpower and that's what made it so unique.Just like 'Thor', this film as well had taken the spiritual believes only for the basic platform. The rest of the developments are the clear mix of fantasy (illusion) and science. So it means the film is for theists and atheists. I am one of those who did not like 'Inception', which I think an ordinary action film with multiple layers. But this one was so awesome and it is for the people like me who think 'Inception' failed.Visually spectacular. I regret missing it out in digital 3D. Its Academy Awards nominee in the category of Best VFX tells the story. There will be a tough contest, even I'm up for 'Jungle Book', but I won't be sad if this wins. The success story of Marvel continues. Not everybody reads comic books, but film goers are the majority. So adaptations like this are people like me. Let them keep coming, I love this format better. This film is not just for the youngsters, but old, families, as well as kids can enjoy, so I hope you won't miss it.8/10"}, {"rating": "7", "text": "TThe effects are mind blowing the acting is perfect the paste and narrative work and along with marvel balance of humour cool action and high stakes this one delivers the marvel formula with some new material to go with it all while building up to something els and not forgetting that it has its own fitting ground"}, {"rating": "8", "text": "As all Marvel movies, it could've been better, even though, after Loki, Kaecilius had the best developing process of the whole Marvel movies universe, but, unfortunatelly, it doesn't exploit Mads Mikkelson's full potential. The plot was reasonably good. Benedict Cumberbatch, once again, at his best. It's quite safe to say this Marvel's finnest work until now."}, {"rating": "8", "text": "A fun rollercoaster ride with a hefty dose of metaphysical teachings that actually get things right. Those who like some substance with their fluff will certainly enjoy this well-executed fusion of meaningful teachings with a rollicking good time. Admittedly, the fight sequences go on a little long at times, there are some pacing issues in the last 45 minutes and Chiwetel Ejiofor's hammy overacting becomes progressively tedious as the story unfolds, but a well-written script, superb special effects and fine performances by all of the other principals make this worthwhile viewing."}, {"rating": "7", "text": "It is, as I predicted, the best Marvel movie since Iron(pronounced I-Ron) Man 3. The past ones were made bad by excessive numbing action and lack of any real danger(can you think of any major character thats died?) among other things. But Dr S's best feature is how visually stunning it is. I like to think of how well classic weird fiction writers would have thought of the dark(actually quite colorful dark dimension. And there are some funny parts in there as well. The best one involves beyonce. Well, I guess I'll have to wait till 2019 till another good marvel movie comes out:Captain freaking Marvel. She's Brie Larson. But thankfully, I'll have DC movies(and other wonderful entertainment.Think Mass Effect Andromeda) to fill the time."}, {"rating": "8", "text": "Doctor Strange: I hate going to the movie theater nowadays. It isn't that the experience is so much worse than it was back in the good old days when men were men, children were well behaved and people dressed for going out in public. It simply is that my home theater experience is gotten so much better. Surround sound, my own snacks, my own choice of company and a decent 4k OLED screen make for a mighty fine home viewing experience. Sometimes though a movie comes out that makes we wish I had seen it in the theater. Doctor Strange is one such movie. The special effects and design are so wonderfully trippy. The story is your standard origin story with the put-upon love interest (an underused Rachel McAdams), A cocky self-assured millionaire learning a life lesson, and even a touch of ye olde chosen one. It’s all the other wonderful stuff that makes the movie. Director Scott Derrickson isn’t afraid to let his imagination run wild everything from acid trips to body horror to Inception called and they want their movie back is featured.While this movie is not peak Marvel it is better than it had to be and certainly better than it could have been. A fun visually impressive well acted movie."}, {"rating": "8", "text": "Inception fights scenes are met with gorgeous spell graphics and a strong lead. The clever humor can fall flat sometimes and the side characters are largely forgettable. But it doesn't hold the movie back from being a fun feast for the eyes."}, {"rating": "7", "text": "Visually, Doctor Strange is the best Marvel film to date with it's gorgeous and trippy special effects. In terms of storytelling, the film isn't great because of a lot of rushed moments. But overall, Doctor Strange is another enjoyable movie in the Marvel Cinematic Universe that is certainly worth watching."}, {"rating": "10", "text": "Holy **** this is the best marvel movie since ever literally. I totally thought this movie was gana be garbage... Turns out its one of the best movies ive ever seen im my life....amazing visually... Way better then any marvel movie ever holy crap..."}, {"rating": "4", "text": "There are just those movies that are good, but you in particular cannot like, Doctor Strange is that movie for me. I am not a fan of Benedict Cumberbatch so my expectations weren't high but this still just wasn't a movie for me. I thought the first act was pretty good but it went downhill from there for me. This is easily my least favorite Marvel movie even if I would consider it better than most objectively."}, {"rating": "7", "text": "Good movie, quite interesting, great acting from main characters, but I did find it quite generic after watching so many superhero movies in last few years and also tv series. I mean I hoped this will be something much more different from everything else as they put it before, while promoting the movie. But in the end it didn't feel that much different, of course there were some interesting plot points and the whole effects and CGI reminds me of Inception but on a larger scale. Anyway, good movie, nothing much more"}, {"rating": "9", "text": "What a spectacular film. I had my doubts as a lot of people because Marvel was taking a risk with this one and oh boy did it exceed my expectations. The movie was surprisingly funny, well paced, and had a great score. It also had fantastic acting especially from Benedict Cumberbatch. The action was top notch as expected from Marvel and of course the CGI/Visual effects which were great. Mads Mikkelsen's villain character was very intriguing and interesting, but did feel a little underdeveloped."}, {"rating": "8", "text": "Who: Benedict Cumberbatch, Sinead O'Connor, 12 Years a Slave, and the sh*tty version of Hannibal Lecter as, Kaecilius\rWhat: Ant-Man meets Harry Potter meets MC Escher\rWhere: The consistently amazing Marvel Cinematic Universe\rWhen (can I watch again): A couple months\rWhy: Though this is a traditional Marvel plot, the visuals in this film stand far and above any other contribution to the franchise to date."}, {"rating": "8", "text": "Dr. Strange is, appropriately enough, a strange movie. It is both something new and yet the exact same thing we've come to expect from Marvel Origin Movies lately.\r The story of Steven Strange is one tread upon repeatedly, using what I like to call the Marvel Origin Movie Formula: Person has a problem, finds solution via gaining/making powers, training montage of improving those abilities, enter main villain, small fight with villain leading up to bigger fight with villain. There are, however, several points that this movie vastly breaks away from the mold. The first point is the setting. Magic might have been touched upon in Thor, but they go head first into the deep end of using magic in this movie. It helps it to stand out from the other films. Second is the climax. It's a clever change from the usual ultimate battle finale we've come to expect from these films, having Strange use his brain instead of his power to win.\r The characters are, unfortunately, total retreads as well. Dr. Strange particularly feels like another Tony Stark. A lot of the character development is easy to see coming, though I have to say there are a few scenes that, again, help to break away from the usual for Marvel. The villain of the picture has a nice monologue that, gasp, gives him character. Not a lot, but it's more than usual for many Marvel movie villains. Unfortunately, he and a particular other villain seem to be cast aside, but thankfully there's a chance left open for both of them to come back rather than just outright crossing them off. There's a touching and interesting scene with the mentor of the film, and it's nice that, in a refreshing change of pace, everyone is willing to call out the main character for his...Stark-ness.\r The action in this movie is pretty damn cool, mostly because of said effects being incorporated into it. There is one particular shot in the movie that I think was meant to be the big \"HELL YEAH\" moment, and I am so very, very glad that it wasn't spoiled in advertising because it made that shot all the more glamorous.\r The long and short of the film is this: If you love the Marvel Origin Movie formula, you'll love this movie. If you're getting tired of the formula, you'll be pleasantly surprised with a couple of things in the film and enjoy the new atmosphere made by being immersed in the magical side of the MCU. Strange is a good addition to the MCU, but it's hard to look past the fact that Marvel's kinda stuck in a rut with the formula. Here's hoping Spider-Man and Black Panther will break the mold."}, {"rating": "10", "text": "Definitely one of the best movies of the year. The visuals are stunning and \"eye\" blowing. I think Cummberbatch did a perfect job portraying Doctor Strange."}, {"rating": "8", "text": "I liked this movie.  I was largely unfamiliar with this character, aside from some appearances in Avengers and Spiderman cartoons years ago.  The premise is cool, and I see how he would fit well in the MCU.  Well worth the cost of admission.  Really excellent special effects and good potential for other films and crossovers due to the multiverse aspects.  Seems well cast"}, {"rating": "8", "text": "Doctor Strange, may have strange in the title, but doesn't really step outside the usual Marvel fair, don't get me wrong the film is good and enjoyable. Honestly one of the better stand alone Marvel films recently, but like I said this film is the average Marvel film, with some added advantages. First off the best part of the film are it's visuals, the film looks spectacular, especially in it's dimension bending, and reality changing scenes (Recommend seeing the film in IMAX), the performances are all very well done. Bennedict Cumberbatch being a great Doctor Strange, and the rest of the cast doing their parts well enough. The films ultimate flaw is, as I said, it's a little to predictable and average. The action's better than most Marvel movies, but it all feels the same, the villain isn't awful, but like most isn't all that memorable or menacing. Doctor Strange is one of the better MCU  films but still has the flaws that the rest of the MCU is plagued with. The performances are good, The Visuals are freaking amazing, but just doesn't have have enough new things to bring to the table to make it really rise up from the MCU"}, {"rating": "10", "text": "I may get hate from this but this is Marvel's best.  (Still crappy villains though).  I cannot praise this movie enough.  Such good acting, CGI, plot, jokes, this movie has everything.  A must watch for comic book fans and non fans alike."}, {"rating": "9", "text": "Benedict Cumberbatch is the perfect choice for Doctor Seven Strange character. His performance was A1 and same with Tilda Swinton. I really enjoyed Tilda Swinton performance as the Ancient One. Her performance was bad ass! Other casts performance was good but I wish the writers pushed them a little bit more. The visuals in this movie is mind blowing and I recommend you to see it in 3D. Mads Mikkelsen performance was good also but the story of the villain decent at finest. Sense of humor is a hit and miss. I mostly safetied most of it. Wow! Doctor Strange really exceed my expectations a lot."}, {"rating": "9", "text": "Doctor Strange brings to theaters a different movie from Marvel, and that's good, because the movie manages to escape the sameness that are the films of heroes origins. Above all, the film stands out in its beautiful visual effects and in great interpretations of its star cast. Benedict Cumberbatch is simply perfect in the role of Stephen Strange, Tilda Swinton is marvelous with her Ancient One and all of her co-stars, Benedict Wong, Chiwetel Ejiofor and Rachel McAdams, this devalued, go well in their roles. Marvel, unfortunately, misses an undeveloped villain again, but Mads Mikkelsen manages to deliver a good performance, nonetheless. In addition, notable is the improvement on director Scott Derrickson, known for horror movies. Overall, Doctor Strange is a fun, charismatic movie that does not disappoint in fight scenes, and proves that the good can still improve."}, {"rating": "9", "text": "Great movie! A lot of fun, drama, action, and absolutely great visual effects! A story well balanced, very good actors, and an astonishing ending. And it gives us hints about what can be done in Avengers: Infinity War. The possibilities are endless!"}, {"rating": "7", "text": "The stylish explosion of reality bending visuals in Doctor Strange is truly awe-inspiring, and manages to successfully offset the generic 'world is about to be destroyed' storyline. It's also genuinely funny."}, {"rating": "8", "text": "I have never read a Doctor Strange comic. There, I said it. I am an enormous comic book fan, but I have never even deigned to pick up an issue. The reason being this; Strange has always been too well, strange for me. His immense, and undefinable power has never attracted my interest, and I've often wondered how a \"sorcerer supreme\" could be the source of any decent storytelling. Well, thanks to Scott Derrickson, I wonder no longer.\r While bearing many of the telltale signs of the MCU, Dr. Strange is a rather unique organism. While an orgin story, it is not one of physical strength, or endowment of immense power, but one of magical study. Yes, that's right, magic. Not science we don't understand yet, pure, honest-to-goodness. abra-cadabra, hocus-pocus, magic. Dr. Strange, a self-absorbed medical genius, is confronted with an existential crisis, in which he must humble himself, and learn an entirely new profession. Cumberbatch plays excellently, a man who's entire world comes crashing down upon him, and who must remake himself as a new man.\r The love interest, a crucial component of any Marvel origin story, surprisingly turns out to be one of the most compelling parts of the film. Christine, Strange's ex-lover, is there the entire film, not as a romantic counterpart, but as a friend, and several times as a savior. There is love between the two of them, but divergent from the Marvel norm, the kiss at the end of the movie, is one on the cheek.\r The movie is though, carried almost solely by its action. This is the most unique and entertaining part of the film. Buildings fold in upon themselves, capes put men in chokeholds, and portals are used as a weapon in combat. But in my humble opinion, the best action sequence s the scene in which while being operated upon, Dr. Strange engages in astral combat with his enemy. It encompasses the movie perfectly. It is brutal and unrelenting, and totally unseen by the world we live in. It is hard to understand, and confusing; the physics of the astral world are left mostly unexplained, and the viewer must figure out for themself what the combatants will or won't pass through. Most of all, its funny. Christine's baffled expressions as objects crash around the room are hysterical.\r Like I said before, I had no expectation of enjoying Doctor Strange, but I did, Immensely. Simply because it is so delightfully different. Marvel has realized that in this golden age of comic book movies, a tonal differentiation is required for a movie to be fresh and engaging. This is an excellent call on their part. While Doctor Strange's manipulation of reality as a cinematic technique can be a bit shticky at times, its definitely fun to watch."}, {"rating": "8", "text": "Rex Reed hates it so it HAS to be good. I mean, how do you start a review (a probably well paid \"critic's\" review, mind you) with a declaration that you already went into the film with the plan to hate on it?"}, {"rating": "10", "text": "Undeniably awesome: Excellent casting. There isn't a single actor in this movie that doesn't hit it out of the park, just great performances all-round. Excellent special effects that actually gave me a slight bout of vertigo even without 3D goggles! A great story with high (and believable) stakes. A villain that is both a great actor and has a believable motive: I found myself sympathising entirely with his approach to the \"problem\" (minor theme spoiler: avoiding death).Doctor Strange manages to compress an exciting origin story into two hours with tons of character development flawlessly, all the while ending with a nice humorous little connection to the MCU's other superheroes."}, {"rating": "9", "text": "Wonderful movie. Few, minor, flaws. High quality Marvel movie as usual. Would recommend. Diffidently one to see in a movie theater. Just look at the user review ratio and that should tell you it's worthwhile. Always going to be those that can not be satisfied, but don't let them scare you off from enjoying this film."}], "recommendations": ["the_fly", "the_fifth_element", "thor", "avengers_age_of_ultron", "maleficent_mistress_of_evil", "oz_the_great_and_powerful", "fantastic_beasts_the_crimes_of_grindelwald", "thor_the_dark_world", "super_8", "indiana_jones_and_the_temple_of_doom", "eternals", "oblivion", "the_hunger_games_catching_fire", "twelve_monkeys", "rise_of_the_planet_of_the_apes", "hellboy", "color_out_of_space", "valerian_and_the_city_of_a_thousand_planets", "finch", "fantastic_beasts_and_where_to_find_them", "upgrade", "spider_man_far_from_home", "alita_battle_angel", "looper", "kung_fu_panda_3"]}