{"id": 4315, "title": "DodgeBall: A True Underdog Story", "starring": ["Vince Vaughn", "Christine Taylor"], "runtime": 92, "genre": ["Comedy"], "description": "When megalomaniacal White Goodman, the owner of a trendy, high-end fitness center, makes a move to take over the struggling local gym run by happy-go-lucky Pete La Fleur, there's only one way for La Fleur to fight back: dodgeball. Aided by a dodgeball guru and Goodman's attorney, La Fleur and his rag-tag team of underdogs launch a knock-down, drag-out battle in which the winner takes all.", "releaseYear": "2004", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/r8KbNHkkwFXLjV1suGwm0Qjure5.jpg", "categories": {"plot": 5.947368421052632, "acting": 5.5, "ending": 4.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.729166666666667, "action": 5.0}, "reviews": [{"rating": "7", "text": "This movie is stupid but in a good way that will keep you glued to the screen."}, {"rating": "7", "text": "In a S**tstorm of horrendous new comedies to come out at the beginning of the millenium (aside from \"Meet the Parents\") some where memorable yet very forgetable, then Came \"Dodgeball\" and suddenly i fell in love with a sport i barely knew existed and a comedy where Ben Stiller just shined.\r \"Dodgeball\" is literally your Average Joe movie, featuring dumb yet very lovable main \"Joes\" against the eccentric nutball \"Cobras\" (the funny thing is that there are too much people nowdays who are fitness nuts like the \"Cobras\").\r But really if you came to find clever and witiness in this movie switch it off now, cause really if you're like everyone else you wanna see some DODGEBALL!, the Hits in this movie make me cry with laughter and with names like \"Skillz that Killz\" and the \"Las Vegas P.D.\", the film knows what it is and just has fun with itself.\r Vince Vaughn is a very likable character and then you got Rip Torn who i feel dishes out insults just as well as Seargent Hartmman did in \"Full Metal Jacket\".\r Final Verdict: Add mulitple hilarious yet pointless cameo's from the likes of Lance Armstrong, William Shatner, David Hasselhoff and CHUCK NORRIS, \"Dodgeball\" just gets more nuts everytime i see it.\r Final Verdict: Dodge, Duck, Dip, Dive and... Dodge"}, {"rating": "6", "text": "The Underdogs grab life by the balls.\rDodgeball: A True Underdog Story is an extremely idiotic, overdone, but yet miraculously hilarious story. The actors save the scripts nutty hijinks from being a complete train wreck by selling what their given."}, {"rating": "4", "text": "I really didn' get what all the comic fuss was about. It had its moments and is certainly very quotable but it's not the kind of film I'll remember when I'm old and grey. This isn't clever comedy this is cash-in comedy. Vaughan seems to be ready to recieve his cheque from scene 1. I'm dodging this film next time it is suggested to me."}, {"rating": "7", "text": "Dodgeball A True Underdog Story is an enjoyable and funny movie even if the two mains Ben Stiller and Vince Vaughn are the worst, correction weakest, members of the cast. However Justin Long and Alan Tudyk 2 of the supporting cast are hilarious and make the movie extremely entertaining."}, {"rating": "1", "text": "One of my friends told me it was the funniest movies he'd ever seen. After I saw it, I realized my friend is stupid. The only good part of the entire movie was Chuck Norris's cameo. Other than that, the whole movie was stupid."}, {"rating": "10", "text": "Funny, crazy and entertaining. Anyone expecting tear-summoning acting or awe-inspiring plots needs to redefine their ideas of the comedy genre. It's funny and you can watch it over and over again. Simply fantastic."}, {"rating": "0", "text": "Faecal, even for a Ben Stiller film. He has really crossed the line from mildly amusing to tiresome and completely uninventive. Not worth any credit."}, {"rating": "0", "text": "Probably the worst movie I have ever seen."}, {"rating": "0", "text": "Totally Rubbish! Very unoriginal & tacky! Rubiish punchlines, Don't waste your time, go walk the dog or something."}, {"rating": "8", "text": "I have watched this film countless times and I still find it funny. Its original, Solid acting, and its funny from start to finish. I would totally recommend this."}, {"rating": "8", "text": "This movie has so many different concepts thrown into one comedy, and it all surprisingly works, the entire cast for the most part works extremely well together, while some elements aren't all perfect you will still have a blast watching this and laugh a lot."}, {"rating": "7", "text": "Its a hilarious, original comedy with a good cast that does their part well. The huge flaw of the film? Its gets insanely sappy and generic in the last 30 mins of the film and it ruins the film quite a bit. Its still hilarious though and I would highly recommend it if you want a good laugh."}, {"rating": "10", "text": "this is by far my favorite movie comon man it aint a 55 get a life and enjoy the little things...........................................................................................................................................................................................................................k.............................................................bye"}, {"rating": "5", "text": "This movie was hilarious. Sure, dodgeball will probably never be an actual sport, it still has a funny sense that will make you want to play dodgeball."}, {"rating": "9", "text": "It has it's fair share of laughs and celebrity appearances, this heartwarming story about a battle that is actually (kind of) going on right now: Corporate vs Small business. The corporate gym wants to take over the local gym by stopping them from winning the $50,000 dollars ,needed  to repay loans on the business, in a dodgeball tourney. This funny, and relatable movie will have you feeling every feeling man has ever known."}, {"rating": "9", "text": "'Dodgeball: A True Underdog Story' is a movie that made me laugh hysterically with its slapstick, sometimes crude and strange out-of-this-world humor. It's a movie that filled me with a lot of positive feelings and a comedy that I strongly recommend.\r White Goodman (Ben Stiller) is an egotistical gym owner, he owns and runs a successful gymnasium called \"Globo Gym\" which is where business is going pretty good thanks to its high quality machinery and facilities. Over on the other side lies \"Average Joe's\" Gymnasium, owned by Peter LaFleur (Vince Vaughn), and is more of a run-down gym and only has few members. When Peter meets Katie Veach (Christine Taylor) and she tells him that all his bills are overdue, he then finds out that White of Globo Gym wants to buy Average Joe's leaving him in a difficult financial situation.\r Peter, along with his crew including; Justin (Justin Long), Gordon (Stephen Root), Steve (Alan Tudyk), Owen (Joel Moore) and Dwight (Chris Williams) must find different ways to make money in order to keep the gym. They then hear about a Dodgeball tournament in Las Vegas where there is a cash prize that they can use to keep the gym and not let White get anywhere near it.\r When it seems that they are not able to get the gym and their Dodgeball skills are not quite up to standards, Peter then bumps into Dodgeball legend Patches O'Houlihan (Rip Torn) and he teaches them, in a series of funny methods, how to play professional Dodgeball and win the Las Vegas tournament.\r This is a very fast-paced and wacky comedy, Ben Stiller is great at playing the annoying, egotistical and sometimes elaborate White Goodman. All of the comedy is also perfectly timed to know when it's the right time to be funny. The physical humor including seeing a number of men getting hit by Dodgeballs never gets tiring.\r To put it short, 'Dodgeball: A True Underdog Story' is worth your time."}, {"rating": "10", "text": "First of all, it's a crazy comedy film, keep that in mind, it never pretended to be anything else. Got it? Good. For what it is, it's glorious! For its class, it's one of the best. Usually crazy comedies are poorly written, don't bother with plot and are generally offensive to every one of the senses. This is one is a crafty, lovingly made film with the right amounts of quips and jokes, even the gratuitous slutty girls. Every casting choice was perfect, even the insufferable Me'shell. Rewatched this probably 10 times by now with 10 more coming in the near future."}, {"rating": "10", "text": "I would have given it a 0, but Chuck Norris would kill me."}, {"rating": "7", "text": "The loathsome P.C. mindset of the modern American can't even facilitate the queer jokes in this movie into the 'harmless humor' category. Me and my dad snuck into this after seeing Fahrenheit 9/11 (so full of liberal spin and bulls..t I pitied those uninformed on Michael Moore's agenda) and Spiderman 2 (UNBELIVABLE!) and enjoyed it. There are enough laugh-out-loud bits to warrant a viewing. Hell, the cameos alone are worth a ticket purchase. Stay till the VERY END for a line from Ben Stiller that may be the best line in any movie this year (it had me laughing to the parking lot-Chuck Norris anyone?). Go see it and ease your mind for a good 2 hours. Enjoy!"}, {"rating": "10", "text": "Loved It!!!!!!!!"}, {"rating": "9", "text": "This movie is simply hilarious. It's silly and wierd, and that's the point. Don't expect a deep, thoughtful flick here. But the jokes are still great, far better than average."}, {"rating": "5", "text": "It's not a good movie...but it is very fun to watch. With a comedy, thats all I care about."}, {"rating": "10", "text": "Don't listen to metacritic this time. I was expecting it to be at least higher than 80. It should have been a hundred. !0 out of 10. Great movie!"}, {"rating": "10", "text": "Simply the funniest film I have ever seen!"}, {"rating": "10", "text": "Oh god I love this film. I Love Ben Stiller (in a totally non-sextual way), I loved the Steve the Pirate guy. It was so funny I almost hyperventilated (I'm not kidding)."}, {"rating": "5", "text": "Looking at both the user reviews, the professional reviews, and just from what I hear from my friends, Dodgeball is a very hit or miss movie. You either love it or you dont. Truth be told, I did not. This comedy is geared more towards the slapstick fans and not quite so much for the verbal bits. Since slapstick was never my thing, I sat through the entire movie with a blank face. What's sad is that the funniest bits of the movie were all put in the trailer, so there's really no reason to waste your time on this one."}, {"rating": "8", "text": "The movie may just seem like a dodgeball movie, but its more than that. Its funny throughout and the characters each have their own chunk of personality to contribute to the story."}, {"rating": "7", "text": "Stupid funny is a good way to describe this movie. Stiller's character is so overblown  that if you can't laugh at it, you might be dead-check your pulse. \"If you can dodge a wrench you can dodge a ball.\""}, {"rating": "8", "text": "This is great Stiller. He's not just funny, he's electrifyingly hilarious. Dodgeball's his best work since Zoolander."}, {"rating": "8", "text": "\"Dodgeball\" turns out to be a healthy showcase of all kinds of humor from an interesting cast of characters."}, {"rating": "8", "text": "The movie is funny,entertaining and not that bad acted what else would you ask for?But, sure there is some minor plot holes and some unbelievable scenes but it's a modern comedy…Don't expect too much logic in it."}, {"rating": "4", "text": "Stiller is a dangerous animal, I think he is probably the only one with enough potential to mock the film he lives in.Dodgeball - A True Underdog StoryRobert Marshall Thurber, the writer and director, is a passionate filmmaker. Often the comedy genre is taken lightly. Though he does not. But also that is not to say that he sticks by the rhythm that he not only develops but succeeds on. There is this questionable urge of his to end all the jokes with a pinch of drama that is to ground all the tomfoolery acts they live by. This lawyer nature of the film comes off pretentious, obviously, but also stinks of desperation. Desperation to reach the higher value than it can sum up, even in a problem simple as such and stakes lower as such. Yet, what saves him, is his first instinct itself.The tendency to turn the cartoonish characters to 11. And for the most part of the film the characterization of those characters that is branched out in the editing process smartly (in the script itself) and not taken as an uncalled detour just for the maker's pleasure. The only sequence where it fails poorly is the training montage where our amateur heroes prepare for the ultimate tournament. Now, usually those are the best elements in a comedy film.But their work is, frankly, lazy. Those series of snippets is nothing but mindless hits and punches and misthrown beats and physical errors, that never for a frame goes innovative. Which, if I may, would describe the entire track of that team. They never live up to the ferocity with which Ben Stiller challenges them. There is no way anything in the film could match his unflinching promise to the character let alone other characters hovering around minding their sub plots and petty issues. He doesn't care about the plot points, jokes, opposite cast or even Dodgeball - A True Underdog Story."}, {"rating": "5", "text": "Just another sports comedy ...This film is a slapstick-like comedy that brings us a little-known \"sport\": dodgeball, a game that, for us in Europe, is more connoted with childhood and school than with the world of professional and federated sports. Here in Portugal it is called \"Queimada\" or \"Game of the Forest\".The script is based on the boundless rivalry between Peter La Fleur, the owner of a small gym, and White Goodman, the owner of a gym corporation, who opens yet another establishment, right outside the door of La Fleur's gym. Things get worse when La Fleur is truly in danger of losing its small gym to its direct competitor. To pay what they owe, they decide to participate in the National Dodgeball Championship, where Goodman is already registered.This movie is nothing new or original. The exposed plot is similar in everything to dozens of other sports-themed films, where the good ones try to beat the bad guys within four lines, while the bad guys try to use all means, including cheating, to win. It's a markedly humorous movie, with jokes all the time ... some of which are really funny while others not so much. It is a style of humor that does not appeal to everyone, but it will appeal to those who already like this genre.Ben Stiller is an actor with a lot of experience in this type of comedy, where he fits perfectly, and he is responsible for most of the jokes, with a strongly cartoon character and with touches of social criticism. I liked the work of the actor, he really steals attention for himself and not always (almost never) had anyone to shoulder with him. Vince Vaughn was up to the character and gave him a touch of honesty and sincerity, but is too serious to make him laugh. Christine Taylor is the girl in the movie, but it doesn't do much more than be a presumed future romantic pair of Vaughn's character. The rest of the cast gives the essential support and is funny when it has to be. In addition, we have small cameos from Lance Armstrong (it was not yet known how he truly won the Tour), Chuck Norris, David Hasselhoff and other well-known names.This movie is funny ... it doesn't make us laugh until it hurts, because many of the jokes used are not particularly elegant, but entertain the weather quite well and do not disappoint us."}, {"rating": "7", "text": "This movie honestly reminds me of Year 11 dodgeball, quite fun to be honest."}, {"rating": "4", "text": "Not very funny alright in some parts and a few laughs not much though    ."}, {"rating": "5", "text": "About what one can expect from a Vaughn & Stiller comedy, but the dodgeball scenes + commentary deliver a few good laughs."}, {"rating": "8", "text": "Dodgeball is a sport that kind of sucks. But this movie makes dodgeball goofier and funny."}, {"rating": "7", "text": "Some parts of Dodgeball are predictable, but its hilarious jokes and cast, especially the undeniable Ben Stiller can make up for all of it. The story is also encouraging too."}], "recommendations": ["zoolander", "get_hard", "masterminds", "tower_heist", "the_wedding_ringer", "neighbors", "paul_blart_mall_cop", "the_longest_yard", "identity_thief", "ted", "step_brothers", "central_intelligence", "forgetting_sarah_marshall", "due_date", "wanderlust", "thunder_force", "a_million_ways_to_die_in_the_west", "spy", "30_minutes_or_less", "dirty_grandpa", "dinner_for_schmucks", "the_other_guys", "horrible_bosses_2", "zack_and_miri_make_a_porno", "little_fockers"]}