{
  "id": 1590,
  "title": "Dolittle",
  "starring": [
    "Robert Downey Jr.",
    "Antonio Banderas"
  ],
  "runtime": 101,
  "genre": [
    "Family",
    "Fantasy",
    "Adventure"
  ],
  "description": "After losing his wife seven years earlier, the eccentric Dr. John Dolittle, famed doctor and veterinarian of Queen Victoria’s England, hermits himself away behind the high walls of Dolittle Manor with only his menagerie of exotic animals for company. But when the young queen falls gravely ill, a reluctant Dolittle is forced to set sail on an epic adventure to a mythical island in search of a cure, regaining his wit and courage as he crosses old adversaries and discovers wondrous creatures.",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uoplwswBDy7gsOyrbGuKyPFoPCs.jpg",
  "categories": {
    "plot": 2.5555555555555554,
    "acting": 2.689655172413793,
    "ending": 2.75,
    "soundtrack": 2.3333333333333335,
    "cinematography": 3.3333333333333335,
    "familyFriendly": 4.0,
    "funny": 5.363636363636363,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "I'm not gonna lie, but I thought this would be an ok-ish movie, but... I'm very angry, bored and disappointed. CGI isn't bad, but it could be better. Robert Downey Jr's performance is a little bit worse than in Avengers: Endgame. A story is cool at first, but then it's getting more embarrassing in every minute. Also, a scene with dragon [Also it isn't he, but she] was one of the worst things I ever have seen in cinematography history because it looked like a fetish/porn or whatever it is [I'm a fan of dragons and this moment offends me.]. Overall an original book and first movie based on this book are much better than this sh*t."
    },
    {
      "rating": "0",
      "text": "This movie is utterly boring with no redeeming qualities. Hosting a forgettable cast and lackluster plot, this is a movie that will be enjoyed and remembered by no one."
    },
    {
      "rating": "2",
      "text": "I know that this movie is for kids but seriously,i think that even kids would hate this **** horiblle."
    },
    {
      "rating": "2",
      "text": "“We've no choice but to embark on this perilous journey.” - Me walking into the auditorium.‘Dolittle’...oh boy. I actually watched this movie a month early when I went to Australia for a family holiday, because it was released early over there for some reason. I kept quiet for awhile cause I didn’t want to warn people about the storm that was coming. The storm of Dolittle. I watched this in a full house with plenty of children and couple of adults. There was a little kid and his grandma sitting next to me and throughout the movie the kid would constantly ask his grandma that he wanted to go home, but was pinned down to sit through it until the end. Poor kid.This is Robert Downey, Jr.'s first non-Iron Man role since ‘The Judge’ back in 2014, which is quite embarrassing. I can tell Downey is so into the role, because he’s doing five different accents all at once. Welsh, Scottish, Irish, English and South Africa. Even Downey himself couldn’t hold this mess together and it’s a strange follow up to the highest grossing movie of all time ‘Endgame’. However the one thing I hated the most were the animals themselves. Like, I freaking hated all the animals. Every single one of them has an annoying character trait. I wish only death on them. I hope the fox gets skinned alive and hung up on a tree, but quickly gets forgotten, so days past and now it’s rotten and covered in flies. I hope the giraffe gets decapitated just like the giraffe in ‘The Hangover Part III’. I hope the squirrel becomes roadkill after a car runs over his irritating little body, but I guess it has to be either a horses hoof or somebody’s shoe since cars weren’t around that time. I hope the dog gets put down since he’s “not feeling so good”. I hope the parrot chokes on a peanut after mistaking it for something else. I hope the duck suddenly gets depressed and turns itself into a duck sandwich, just so I can buy it and throw it in the bin. I hope the ostrich shoves it’s head up someone’s ass and breaks its own **** neck. I hope the polar bear gets smothered to death by his stupid winter hat, and then his body gets nuked and paints the Arctic snow in red, because it’s justice to all the seals he killed in the past. Rest in peaces, bro. I hope the gorilla dies of a heart attack, since he’s so frightened of everything. There’s a straightforward message for children about how being brave is all fine and dandy, but being scared is nothing to be ashamed of. In reality, I wanted to yell out “quit being wuss and help them out you **** but since I was in a screen filled with family and children, I kept my inner demons to myself.The only animal I liked was a Tiger named Barry, voiced by Ralph Fiennes. If I was Barry, I too would try to kill Dolittle. I find it ironic that a British actor is trying to kill an American who’s attempting to do the whole United Kingdoms accent. The visual effects looked really unfinished and stuck out like a sore thumb whenever it interreacted with human beings. Perhaps it needed more time to be worked on, I guess.The movie is kind of boring as well, because none of the characters were developed enough for me to be engrossed in this world or the actual story, so I checked out very early on. It lacks imagination all across the board and you can predict everything that’s going to happen. Also why is there a dragon in a Dolittle movie? And why dose Dolittle shoves his whole arm up the dragons ass? Not very family friendly at all. There even made a movie reference to ‘The Godfather’ as a terrible joke that dosen’t make any sense when you really break it down. This takes place in 19th-century England, years and years before the movie was made and released, so already that’s confusing for both kids and even adults. Overall rating: I hated the movie, but at the same time I admire in away. How can a movie that was so expensive to make filled with Oscar nominees and winners with a acclaim director Stephen Gaghan can feel so amateur."
    },
    {
      "rating": "4",
      "text": "Abusan del CGI, el argumento es muy infantil y mal estructurado. Si bien Downey Jr. actúa genial como siempre, el guión es asqueroso."
    },
    {
      "rating": "1",
      "text": "This might be the worst film that I have ever seen in theaters, and if not, it is still definitely in the bottom three. It seemed that nobody involved with the making of this film really cared at all. Robert Downey completely half-assed his performance, which included a frustratingly inconsistent \"British\" accent which at most points sounded like somebody doing a bad Scottish accent. All the animals in the film were completely forgettable or incredibly annoying. The squirrel character in particular was painful to watch because of how unfunny he was. The presentation of this film was completely forgettable. The cinematography might have been impressive at some points if the film wasn't so engulfed in CGI, but for the most part it was bland. I literally don't remember anything about the music of this film. The plot was pretty dumb as well. The pirate captain character went from hating Dolittle's guts to helping Dolittle on his journey in the span of around 5 minutes, and as far as I know, there was no reason for this change of heart except that it was needed to progress the plot. The climax of the story is utterly stupid, and culminated in a ridiculously juvenile scene involving a dragon. There were tons of little inconsistencies in the film as well, and things were very poorly explained throughout, but I can't be compelled to go into depth about them here because I don't feel like dedicating any more effort to thinking about this dumb film. I'd probably recommend it for children, but even then, there are hundreds of children's films that are better than Dolittle."
    },
    {
      "rating": "3",
      "text": "The movie was barely watchable. More of a time filler really. Neither good or bad. I found myself not invested in the story or characters."
    },
    {
      "rating": "4",
      "text": "I feel like I've just witnessed Robert Downey Jr have a mental break down from start to finish in this movie."
    },
    {
      "rating": "1",
      "text": "This movie is awful! its so bad that i regret wasting my time watching this disgusting and horrific movie!"
    },
    {
      "rating": "0",
      "text": "This is basically the worst movie of 2020 that has just begun... The studio that made this movie must be very sorry for investing in this ****"
    },
    {
      "rating": "3",
      "text": "Not good. Eddie Murphy version is better IMO. This was boring and the farcicle story is incomprehesable. I kept thinking Downeys voice was voiced over by another actor. Little kids should enjoy it."
    },
    {
      "rating": "2",
      "text": "AwfulWith a great cast, Dolittle had everything going for it, But sadly, It is one of the worst family movies I’ve seen the last few years."
    },
    {
      "rating": "3",
      "text": "One big problem I think this movie has is the sound mix. There is an almost non stop music score that is in constant competition with the dialog (meaning the music and he dialog are at the same volume and it was hard to differentiate the two). That with the sound effects made it an actual cacophony. I watched the credits to see where the film's sound was mixed and was blown away to see it was done buy Skywalker sound sound which is the best in the business. It was just weird. I could hardly understand Downey's dialog half the time. Also there was a gag every second, it was just too much. There was just no down time to listen to any story or character development. I think re-edited it could be better to the point of it being an \"okay\" film but as it is wasn't very good. Too bad because I wanted to like it."
    },
    {
      "rating": "3",
      "text": "Why would RDJ essentially GIVE UP playing the role of Iron Man, to make a reboot of a '90s film, that was at best, decent back then?"
    },
    {
      "rating": "1",
      "text": "After seeing Cats and Dolittle back to back, I am quite convinced that movies about animals should never be made ever again.Dolittle suffers from bad CGI, badly written dialogue, badly developed and utilized characters, and RDJ's really bad accent. This movie is supposed to be an inoffensive kids film, but a dragon enema occurs very abruptly and without warning at the end of the movie. Yes, you read that correctly. Unfortunately, Dolittle is not a movie I hope to ever see again."
    },
    {
      "rating": "2",
      "text": "Even though Dolittle is a chaotic mess with a puzzling performance by Robert Downey Jr., at the end of the day it's a harmless flick that the kiddos will enjoy."
    },
    {
      "rating": "4",
      "text": "This reiteration of the doctor who can talk to animals stars Robert Downey Jr., using a weirdly soft voice that sounds like he dubbed the dialogue in the studio. Considering his star power, he's the least interesting thing in the movie. His character sets out on an adventure with a young apprentice and a menagerie of personable animals to acquire a special cure for the Queen of England. What children will enjoy most (and yes, this is a film for kids) is the animals. A stellar lineup of actors are voicing them, often with enjoyable personalities. It's a bit sad that the writers felt necessary to cater to today's style, by dropping modern cultural references and even contemporary slang. Still, the creature comments provide the only fun in this ungainly escapade."
    },
    {
      "rating": "5",
      "text": "More misguided and uninspired than it is just plain \"bad\" in my opinion, Stephen Gaghan's \"Dolittle\" represents the textbook case of a studio pouring funds into an adaptation of a shaky IP, not being pleased with the results, and then hacking it to bits in order to cut the runtime so it can get screened more often in theaters. The greatest shame, however, lies not in the questionable effects, iffy plotting, or spotty performance work. The greatest shame is that, I think there was something \"there\" with this one -- a potentially pleasant story, with satisfying ,emotional undertones and a great sense of whimsy to it. It's just that this movie didn't know what it wanted to be. It has the soul of a PG-13 film (see Robert Downey Jr.'s misanthropic, bitter turn as the titular veterinarian and widower) and the frills and feathers of a G-rated romp (see. . .everything else). Do I feel particularly bad for those involved? Not necessarily. It's a misfire, but I'm certain everyone involved will work once more. I just hope they've taken any/all creative lessons they've learned from this experience to heart."
    },
    {
      "rating": "2",
      "text": "There are myriad occasions throughout 'Dolittle' in which Robert Downey’s eyes seem to glaze over with apathy and boredom as he “interacts” with the green screen animals.  There are twice as many occasions in which the audience's eyes undoubtedly do the same.Between 1967's 'Doctor Dolittle,' 1998's 'Dr. Dolittle' starring Eddie Murphy, and now Robert Downey Jr.'s 'Dolittle,' this most recent version is easily the worst of the lot."
    },
    {
      "rating": "4",
      "text": "This felt like a mixture of Sherlock Holmes, Fantastic Beasts and Where to Find Them, Jungle Book and Land of the Lost and didn't land in any of its attempts.Downey Jr. will attract the audiences but this was quite disappointing.The voice work was pretty good though."
    },
    {
      "rating": "7",
      "text": "Considering it's a character from children's books, I must say \"Dolittle\" follows the same line and ends up being a totally enjoyable film. It isn't the eighth wonder of the world but it makes you laugh a lot and have a good time. Yes, I recommend to go and see it."
    },
    {
      "rating": "0",
      "text": "Dolittle is an infuriating concoction of hatred, pain, and misery. Do not see it, it is not worth your time at ALL."
    },
    {
      "rating": "5",
      "text": "Dolittle is a passable film with a concrete plot and vast, colorful settings. While the film may not have the same appeal for adults, the animals are well done and the comedy is simple which should make the movie a good time for younger audiences. Robert Downey Jr. as the titular Dolittle felt underutilized as a whole, and no other performances really stuck out."
    },
    {
      "rating": "1",
      "text": "One of the most over rated movies of all time. Yes the CGI was good but that's it. Pretentious actors, storyline and acting not worthy of a b-lister. Sorry, but Eddie Murphy's version continues to rule the roost while this recent, pointless, remake will never be watched again when the Blu-ray comes out exactly the same story like the recent Jumanji and Dumbo movie. We came home after watching that garbage and watched Walt Disney's original animated movie and we all agreed how magical and timeless it was.Producers need to go back to creating original work rather than destroying timeless classics just to make a quick buck."
    },
    {
      "rating": "2",
      "text": "Dolittle boasts an all-time great (predominantly voice) cast, but wastes its talent on an all-time abhorrent script. It will likely do enough to keep your kids entertained, but the lazy jokes and awkward performances will prove a chore to sit through for the rest of us."
    },
    {
      "rating": "4",
      "text": "Having grown up with Dolittle I had great expectations that possibly Hollywood would be true to the original. Ok, reality check... nope! Animation has come a long way and I appreciate the rendering work but that alone does not make it a good movie. Robert Downey Jr. does nothing to make the movie better if any more annoying. Better money spent going to a zoo, then again zoo's are no better either. Save your pennies, read the book."
    },
    {
      "rating": "10",
      "text": "I mainly watched this movie because it Robert Downey jr, Tom Holland and Selena Gomez"
    },
    {
      "rating": "0",
      "text": "This movie is of the wall bad I mean some of the worst Cgi ever it's really boring the story isnt good nothing about this movie is good they wasted Robert downey junior"
    },
    {
      "rating": "1",
      "text": "Animals can talk? Apparently a meerkat can write a script too. I hope they hire a llama to write the sequel."
    },
    {
      "rating": "10",
      "text": "This movie was awesome! Had me laughing the whole time. I love the concept and the characters. I hope they make a second one"
    },
    {
      "rating": "7",
      "text": "i watched it recently and it is of course not of Oscar quality but it didn't pretend to be.  It's basically a fun family oriented movie with good special effects and 2 hrs of fun.for those who overthink and over analyse movies, best to stay at home, save your money and watch it online."
    },
    {
      "rating": "8",
      "text": "THIS IS NOT A FAKE REVIEW. I thoroughly enjoyed this movie! Mr. Downey's character was interesting and quirky, there was some funny moments, it was a rich adventure. Imaginative and clever. Genuine touching moments throughout the film regarding him and later his father-in-law missing his wife. I do NOT understand so many critical reviews. Rich quality movie. Thank you to the Downey Duo for making this cool movie!"
    },
    {
      "rating": "1",
      "text": "Dolittle is simultaneously my favorite and least favorite film of 2020. Dolittle shows that having a talented cast but giving them nothing to work with can have disastrous effects. I think Robert Downey Jr. is a great actor but what was he thinking with this movie. In fact, what was any of the actors thinking when they signed on. Most of these actors are Oscar nominees or Oscar winners and they choose to do this. All of their performances are terrible especially Downey which really sucks. He has just a smidge of charm but it’s overshadowed by his terrible accent and dialogue. He puts on this Welsh accent and you can hardly make out a word he is saying. The script only makes his awkward accent even worse. The dialogue is very unnatural and awkward and doesn’t allow for jokes to be clever but instead forced. The humor for this film is awful. It all comes down to fart jokes and getting hit in the groin jokes. It’s incredibly unfunny and really took me out of the film. What really made me change my score was a joke involving a Dragon and a release of gas. I completely gave up on the film at that point. All of the other characters present are dull and obnoxious. The characters don’t get developed at all. They have one flaw/character trait that defines them. They have character arcs but they are all resolved in one or two scenes. The visual effects aren’t terrible but they aren’t that great. In some scenes, they look fine but in others they look pretty bad. The film is all around lifeless and boring. The only reason I can think of to Universal Pictures making this movie was to keep the license to the Dr. Dolittle property. I was bored out of my mind while watching this. The characters were unappealing so I wasn’t interested when any of them appeared on screen. The only time I wasn’t bored was the animation segment in the beginning of the film which looks nice but the voice over dialogue was terrible. At certain points in the film, a character will be saying something on screen but the dialogue would be completely different. It was incredibly obnoxious and distracting. Overall, Dolittle takes an impressive cast and completely wastes them on a soulless, boring, unfunny, and unappealing film."
    },
    {
      "rating": "10",
      "text": "I honestly enjoyed this movie,ALL PARTS OF IT, for it was interesting, unique and colorful. For those haters and \"critics\" out there, it is such a shame that your senses of entertainment and humor are not AT ALL functioning."
    },
    {
      "rating": "10",
      "text": "I really enjoyed this movie I hate it when a movie gets such a bad rap, even though it has such a good heart and had a lot of good humor, really liked it, highly recommend it."
    },
    {
      "rating": "9",
      "text": "Take the kids, they'll like it. Why are people rating this movie like it's an adult movie. This movie is to take the kids to. Sleep, nap, count to a million, watch... whatever."
    },
    {
      "rating": "10",
      "text": "I loved this movie!!! It was so good and so much like the original than the one with Eddy Murphey. I loved it."
    },
    {
      "rating": "10",
      "text": "Seems like fun journey, okay cgi. Maybe see it once if you're interested in Dolittle."
    },
    {
      "rating": "10",
      "text": "great effects, great action, everthing perfect, the voices mach perfectly!!!"
    },
    {
      "rating": "7",
      "text": "A much better movie than what the scores suggest. A fun, positive, upbeat adventure which stands out in the midst of negativity in media. It didn't try to be something fantastic, and succeeded in what it delivered. RDJ carried with great charisma, and the animals were so enjoyable. Kindness to animals is what is needed more in this world."
    },
    {
      "rating": "6",
      "text": "Light-hearted and good fun, Dolittle is cute, at best. Falling short of the Disney magic it seems to live up to, the movie's potential (and great cinematography and acting) is undermined by weak writing, a limited plot, and subpar visual effects. A bit overly juvenile at some points, the film feels like a bit of a waste (despite some, let's just say shocking scenes). Is it bad? Not by any means. It certainly accomplishes its goal of being a feel-good movie, but it's also the perfect movie to put on in the background while doing other (more important) things around the house."
    },
    {
      "rating": "5",
      "text": "Dolittle (2020)Sinopsis:El Dr. John Dolittle vive solo detrás de los muros de su exuberante mansión en la Inglaterra del siglo XIX. Su única compañía proviene de una variedad de animales exóticos con los que habla a diario. Pero cuando la joven reina Victoria se enferma gravemente, el médico excéntrico y sus amigos peludos se embarcan en una aventura épica en una isla mítica para encontrar la cura.Opinión:Debo confesar que no me gustó mucho, era la película que más esperaba ver este año y no me llenó, es entretenida, pero le falta, se siente apagada y sin una gota de cariño, los animales presentes, aunque sean hechos con efectos especiales, tienen lo suyo, pero en general no alcanza para llenar las expectativas, el ritmo de la película es monótono y las actuaciones son regulares, incluso Robert Downey Jr carece de todo carisma que lo caracteriza.No es infumable ni tan mala como dicen, pero si es completamente olvidable, para ver una sola vez y ya.Me dueles Robert, pero esto fue la primera decepción cinematográfica del año para mi"
    },
    {
      "rating": "5",
      "text": "So, this was not a good movie by any measure. However, it was not a terrible movie either. The story moved along a a fairly good clip. The animals and the special effects were fairly decent. However, anybody could have been plugged into Dolittle's character other than RDJ and it would still been the same. Watch it if you have nothing else to do and don't mind losing 90 minutes of your life. Cheers."
    },
    {
      "rating": "4",
      "text": "Why do all the animals have American accents? There are a few faults in the movie's story, and some of the acting performances were pretty poor. Robert Downey Jr showed he was definitely having fun, coming off of a long stint with the MCU, but you could tell this was a gap filler for the next big performance he will be apart of. Despite this, it was a decent, fun, family movie with a bit of comedy here and there, but became very predictable as the story developed. I wouldn't suggest going to the cinema to see the movie, but rather wait for it to come out on a streaming service and then watch it at home with the family."
    },
    {
      "rating": "10",
      "text": "The movie is great, funny and really enjoyable with amazing CGI and voice acting, i don't know why this movie got so negative rating..."
    },
    {
      "rating": "7",
      "text": "Filme bom, da pra passa o tempo, uma ou outra piada funciona, os animais são bem feitos, mas o filme é bobo e infantil ate demais"
    },
    {
      "rating": "10",
      "text": "Excellent, nothing is perfect. Different opinions. I don't know what else to say"
    },
    {
      "rating": "10",
      "text": "É muito bom esse filme, o lhigting é perfeito e as atuações são a melhor coisa desse filme !"
    },
    {
      "rating": "10",
      "text": "It was a great adventure! Good for the family I don't know why people didn't like it."
    },
    {
      "rating": "5",
      "text": "Il film l'ho visto oggi con mio figlio di 7 anni eni suoi amici e genitori. Un gran bel film per bambini e adulti, Downey è il solito carismatico attore che riesce ad intrattenerti con uno sguardo, film divertente, grandi risate, veloce, bellissime scenografie e così puro da farti sognare. Consigliatissimo"
    }
  ]
}