{"id": 4768, "title": "Dominion: Prequel to The Exorcist", "starring": ["Stellan Skarsgård", "Gabriel Mann"], "runtime": 117, "genre": ["Horror"], "description": "Haunted by terrible acts the Nazis forced him to participate in, the disenchanted Father Lankester Merrin focuses his energies on helping with an archaeological dig in the northern part of Kenya. There, the crew uncovers a church that predates Christian missions into the area, but the discovery also causes strange events to start occurring -- including physical changes to a young, disabled boy, whom Merrin grows to suspect has been possessed by a demon.", "releaseYear": "2005", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/3jIQOCB8ghrxvfWzSjzNv41LR9P.jpg", "categories": {"plot": 6.0, "acting": 8.0, "ending": 7.333333333333333, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "0", "text": "I'm sorry but I hate this film. It didn't interest me or scare me. In fact, it just made me bored and honestly, I like the other prequel a bit more."}, {"rating": "4", "text": "Dominion: Prequel to the Exorcist. and Exorcist: The Beginning are 2 different prequels to the Exorcist. Both prequels are bad,What's wrong with this film is that it is empty, slow, and has dumb moments. The other film was more complete, faster, but was a bit dumber and was a bit confusing.In the end, I like Exorcist: The Beginning a little bit more. I like the a bit entertaining horror and the story more than the unwelcoming simple but tame, dull film.Out of 100, I give Exorcist: The Beginning 41/100 and Dominion: Prequel to the Exorcist 40/100.However, I hate both prequels to be fair."}, {"rating": "4", "text": "A year after the first prequel, we see the version which was originally made. Unfortunately, horror has never been so pretentious. Long, self indulgent and extremely dull...this movie is only notable for the peformance of Skarsgard (Merrin) and a rather curious monologue by Satan himself. He spits. He grimaces. He snarls. He gesticulates. He talks...and talks...and talks. And we...get really bored."}, {"rating": "3", "text": "Better than the other prequel, but very, very dull. Could the exorcism have been any more anti-climatic?"}, {"rating": "10", "text": "A 10 of a horror movie!"}, {"rating": "8", "text": "Set in the years following the Second World War, DOMINION tells the tale of Father Merrin, a wayward priest who has turned to archaeology after his faith is shaken by the war. When Merrin uncovers an ancient church buried beneath the sands of East Africa, he will share his first encounter with the devil, who has possessed the body of a poor crippled boy. Despite being shelved immediately after production, Paul Schrader's prequel to THE EXORCIST was simply too good to be released to the general public. Instead of spinning heads and spewing soup, DOMINION takes a much more cerebral approach to evil. Interestingly, Schrader creates a complete reversal from the original film: the demon possesses the body of a sickly boy, it strengthens and repairs him rather than destroying him, and it uses its wicked tongue to rattle the nerve rather than shock the senses. Pazuzu taunts Merrin and attempts to destroy him both mentally and spiritually. Like the fallen angel Lucifer, it appears as the perfect being, an intellectual tempter with a sculpted body and androgynous beauty unlike the foul monster that Merrin would encounter years late. Pazuzu's evil spreads like a plague in the small African village, and turns man against man while the fallen priest works to regain his robes. The corruptive power of evil is felt in full force here, although Schrader takes slow but decisive steps to reach his final goal.\r While DOMINION has often been criticized for its unfinished effects, it is rarely hailed for its superior setting. The ancient Byzantine tomb is finely decorated, and serves as an ominous stage for the spiritual warfare. Given the studio's complete lack of faith and resources, the garish computerization must be overlooked in place of the stronger story elements. Stellan Skarsgård is very good as the younger counterpart to Max von Sydow's character, with an introspective approach to the character that is reserved without being underplayed. He gives us cracks in his otherwise stern performance that humanize him and allow us to empathize with his internal struggle. Like Skarsgård, Schrader pulls back as well, refusing to rely on simple shocks in this psychological thriller. His unwillingness to compromise in creating a \"studio\" picture may have hurt the returns, but in the end, he delivers a much stronger film.\r Renny Harlin would be brought on to re-write and re-shoot the entire picture after Morgan Creek decided to pull the project for its lack of marketability, but between the two versions, DOMINION is the preferrable prequel to THE EXORCIST.\r -Carl Manes\rI Like Horror Movies"}, {"rating": "10", "text": "saw it years ago, it blew everyone away, (in my theatre at least), after a dismal renny harlin-directed \"film\" of 2004, this was quite a bounce back to the high standards that the original exorcist set"}, {"rating": "10", "text": "A far superior film to beginning, though the ending exorcism is a little, you know, uninteresting, it is still a great film, i recommend it to anyone who loves the odd horror flick"}, {"rating": "10", "text": "The only film in the series that does the first one justice."}, {"rating": "4", "text": "This film is the personal Paul Schrader's version of the prequel \"The Exorcist: The Beginning\", that he had envisioned before being removed from the direction of this film. So, it was a film shot by vanity. In any case, there is no doubt that this director is much superior, in quality and competence, than the man who found him to replace him in \"Beginning\", and this is reflected in the comparison between both films. Which of the directors copied the other is that I don't know because they made two movies that are practically Siamese twins surgically separated. This film also tells of the first confrontation between the devil Pazuzu and Father Merrin, is also a prequel to \"The Exorcist\", it also includes a Byzantine chapel buried in Africa (even bad ideas were maintained by both, since the Byzantines have never been in Kenya and neither does the chapel seem Byzantine) and also includes Stellan Skarsgård in the lead role. However, this film is superior in the way the plot is developed and closed, and in the way the horror is presented: drier, less fanciful and visual, with more containment and care in the special effects and a greater attention to the suspense, so necessary in horror. The film also attempts to weave several theological and philosophical ideas opposing the Catholic faith, the native beliefs, the skepticism of science and the occult and supernatural forces, in a broth of ideas that ends up not having a clear orientation nor carrying an evident idea or message. It's generally better than \"Beginning\", but it's still a long way from being a really good movie."}], "recommendations": ["village_of_the_damned", "annihilation", "the_girl_with_all_the_gifts", "the_remaining", "alien_covenant", "constantine", "dark_city", "the_first_purge", "the_howling", "the_rite", "the_autopsy_of_jane_doe", "high_life", "exodus_gods_and_kings", "exorcist_the_beginning", "amulet", "arrival", "scary_stories_to_tell_in_the_dark", "annabelle_comes_home", "a_clockwork_orange", "the_killing_of_a_sacred_deer", "eden_lake", "the_ninth_gate", "the_legend_of_la_llorona", "his_house", "dark_waters"]}