{
  "id": 2797,
  "title": "Don Jon",
  "starring": [
    "Joseph Gordon-Levitt",
    "Scarlett Johansson"
  ],
  "runtime": 90,
  "genre": [
    "Romance",
    "Comedy",
    "Drama"
  ],
  "description": "A New Jersey guy dedicated to his family, friends, and church, develops unrealistic expectations from watching porn and works to find happiness and intimacy with his potential true love.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uh8bwvgGXeUKzdL4oSul9zxyTcd.jpg",
  "categories": {
    "plot": 6.548387096774194,
    "acting": 6.029411764705882,
    "ending": 7.111111111111111,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 6.235294117647059,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "This movie is not for the feint of heart or the \"grown up\"-minded. It's probably not for church goers. It's probably not REALLY for main-stream consumers, macho boys and candy princess girls. It's not for any of these because it is, at it's heart, an attempt to savage the values that all these groups hold dear. It shines a hot and otherwise absentee light the cancer of over-sexualization. It shows, subtly at times and baldly at others, how consumer driven, sexualized, culture has reached it's tendrils into every-day life, down even into the language we use, how we think and what we think we need. No character is safe, even the heroine, who chastises the male lead for being \"addicted to porn\" does so while lighting a joint. Entertaining, lighthearted and even touching, this movie, like it's main character, seems dumb on the outside but turns out to be intelligent after all. In fact it's really intelligent, which will hurt it's reviews. It's irreverence (which I love) makes it's target market small and it's high bar of entry (most people won't \"get it\") makes it's target audience smaller still. I took off a point the ending feeling rushed, but truly, I laughed my head off the whole time. If you're not in any of those listed groups, or if you're genuinely interested in gender roles, feminism, or sociology, you need to see this."
    },
    {
      "rating": "4",
      "text": "Despite moments that were amusing, this is a pretty stupid movie. I find it strange that Gordon-Levitt would choose to direct a movie like this for his directorial debut. Neither funny nor dramatic."
    },
    {
      "rating": "6",
      "text": "“Don Jon” is an ambitious but unfortunately unsuccessful effort by actor Joseph Gordon-Levitt to expand his talents and capabilities by assuming the role of both writer and director in addition to playing the lead character. This is a film about an otherwise normal middle class guy who is addicted to watching porn on the internet and how it impacts and affects his other relationships. The film also stars Scarlett Johannson and Juliana Moore and a miscast Tony Danza as these actors struggle to make sense of this thin script and average direction, What could have been an interesting and insightful excursion into the mind and attitude of a porn addict becomes nothing more than a light overview of this potentially thought provoking subject.  I give the filma 6 and suggest that if something else is playing at the same time you are going to attend the movie, see the other film."
    },
    {
      "rating": "4",
      "text": "I really struggled to get through this one. If a douche bag is going to be at the center of a film, then he should be at least mildly amusing. I was not even mildly amused by Gordon-Levitt's douche bag, and frankly, after seeing Don Jon (which he also wrote) and some of his other movies (the awful Premium Rush, etc.), I'm starting to think that HE'S the douche bag.\rThe title should have been...Porn Addicted Gym Rat Meets Lonely 40-something with Dead Family and They Fall In Love....But Only After He Gets **** Whipped By Scarlett Doing Her Best Snookie.\rGood to see Tony Danza!"
    },
    {
      "rating": "4",
      "text": "Boy oh boy, I don't get it - I love sex, Gordon-Levitt, Johansson, Moore, like porn, and this movie did nothing for me. It not only has no substance, but it's last-ditch attempt to seriously address porn addiction is superficial. \"I want to lose myself in sex,\" say Jon, but what does that mean? Maybe he knows, maybe porn addicts know, I certainly didn't learn anything from this movie except Jon like porn, Johansson is beautiful but dumb, and Moore is beautiful and wise."
    },
    {
      "rating": "6",
      "text": "Don Jon is a nice, frothy, easy to watch flick about, uh, porn addiction. There were a few decent character twists and the easy charm of Gorden-Levitt cannot be faulted here. I also like that porn isn't treated like the devil but far more honestly. That said, a little more depth and a slightly less pat ending would have made Don Jon a bit more satisfying."
    },
    {
      "rating": "7",
      "text": "This is a solid directorial debut for Joseph Gordon-Levitt.  It was interesting to see how a guys porn addiction causes him to struggle in real relationships.  The film has its flaws but it's a solid debut.  B"
    },
    {
      "rating": "8",
      "text": "I thought it was a smart, funny, scathing, but ultimately kind indictment of douche bro society.\r The repetitiveness and shallowness of man child Jon's existence speaks loudly to my millenial sensibilities. A victim of a self centered father and over accommodating mother, Jon is a self centered douche bag, whose only goal in life is to have meaningless fun. The blank faces on Jon's family during church and his road rage on the way there speak towards the emptiness of being nominally religious. The meaningless confession of sins, the meaningless prayers, all contribute to Jon's status as a shallow guy who doesn't really care about anything but banging an equally shallow and ridiculously hot girl and then spanking it to some meticulously selected pornography.\r I think the fact that Barbara isn't actually a good person is a really important part of the film. That neither party in the Jon/Barbara relationship is actually that likable, despite both of them being very good looking, is pretty refreshing.\r I really liked that Jon isn't actually that likable. He's charming, but he's a self centered dick with nothing really to say. And then he grows and he's still kind of a dick and he doesn't really have that much to say, but he is less self centered and I think that's a lot more honest than most other films.\r I think attacking the tendency to be self centered through porn addiction was really clever. Self centeredness is kind of this internal thing with tons of symptoms, but it's really hard to pull at something and make a difference. With Barbara it manifests as manipulativeness, which I think is a really hard thing to make a person aware of in a meaningful way. With porn addiction it's a pretty straight shot to, you have a problem because you can't get off without porn.\r I enjoyed it, I liked watching Jon struggle and grow, I liked that the ultimate love interest is really screwed up for totally believable reasons, I liked that no one is actually that likable. It feels like reality, but slightly prettier, as opposed to fantasy."
    },
    {
      "rating": "4",
      "text": "I'm not really a Joseph Gordon-Levitt fan to begin with so why I watched this movie I don't know. The movie was fairly enjoyable at the first. I didn't care for Gordon-Levitt's cocky character but the film at least kept my attention. It seemed like this film was only good at the first because Scarlett Johansson saved it. As soon as Johansson left I lost my interest. The last thirty minutes were just brutal and it felt a lot longer than it actually was. If you aren't a Levitt fan don't bother with Don Jon."
    },
    {
      "rating": "8",
      "text": "Joseph Gordon-Levitt wrote, directed and stars as a character who looks and acts like he stepped out of \"Jersey Shore:\" brusque, muscular, shallow, sexy and a total stud. When he meets the girl of his dreams (Scarlett Johannson who embodies the tough, slutty borough girl), his obsession with pornography becomes an issue. This is a fast-paced, quick-witted character study about a man who's more of a mess than he seems. Gordon-Levitt has fully immersed himself in the character and it's a winner. His scenes of dinner with his dad (Tony Danza) are great fun. It's a bit raunchy, if you have a problem with that and not all that deep, but it's entertaining as hell and bodes well for his hyphenate  talent."
    },
    {
      "rating": "5",
      "text": "I honestly couldn't tell if I was watching a bad softcore porno or jersey shore. There were some laughs, but most of it was just watching some guys hit on girls and curse/bust each others balls, jacking off to porn, working out, and praying forgiveness for his sins. There were some laughs, and some serious notes about porn addiction, but other than that the movie was very meh. Worth seeing if you like Jersey Shore, otherwise maybe a visit to the red box (or alternative sources of movies)"
    },
    {
      "rating": "1",
      "text": "I decided to watch this movie based on the casting. This was my mistake. I found it rather pointless and repetitive. Maybe a teenager would enjoy this film, but I found it rather empty and boring. Sorry, I tried!"
    },
    {
      "rating": "10",
      "text": "In the end, Gordon-Levitt offers something that is funny, witty, honest and eventually heartfelt, without having to pander to the saccharine fantasies or gross-out raunch humor that have become the two main lanes of rom-com cinema. This is a date movie whose boldness, edge and careful handling of some volatile material truly makes it balanced and engaging to both sides of the gender spectrum. By the time the credits roll, you won’t just leave the theater feeling entertained  you’ll leave with something to talk about. And for a first-timer, crafting a film that gets people talking is quite an accomplishment."
    },
    {
      "rating": "1",
      "text": "As a mature male that enjoys movies,  attending 1-2 every week, I blanched every time I saw the preview to the upcoming Don Jon. All I got from it was a movie about porn addiction, period. Mentally I wrote it off. Today I made a critical mistake. I normally don’t read the reviews of movies I know don’t give me a single spark of interest, only the sparky ones. Alas, the reviews were surprisingly  acceptable and I went to a morning matinee. What a waste. It was a movie  about porn addiction of course, but I assumed from the reviews there were many redeeming qualities and growth in the characters included. WRONG! Joseph Gordon-Levitt & his father Tony Danza were simply vacuous, crude, foul-mouthed and valueless all the way to the closing credits. There was zero empathy or sympathy and not a hint of anyone being a protagonist.  I not only did not care about the males in this film, I was repulsed by them. The Catholic sacrament of “confession” was treated like an irrelevant waste basket for immoral behavior rather than anything sacred or religious and demanding of sincere repentance as it does in real life.  Scarlett Johansson and Julianne Moore performances were very good actually. This movie had one theme and one theme only…promiscuitypornpromiscuityporn. I spent the last 30 minutes mentally flipping a coin on whether to just get up and leave. I stayed because I wanted to write an honest review on a complete product. On the way out a group of five in front of me complained out loud about their waste of time and money on that piece of trash. I chimed in with them as we left the theater."
    },
    {
      "rating": "8",
      "text": "It's a fun, honest date movie  yes, date movie, if you've got the guts, fellas. It's likely to provoke a few questions during, and after the movie.  But Levitt does a fine job in his direction, and against all odds, he integrates Julianne Moore into the proceedings in a refreshing way.  Great to see Tony Danza back on the scene.  And Jon's friends  the trumpet player from \"Treme\", and his shorter pal  are great for their words of wisdom and some comic relief.  Clearly, this won't win any awards, but it surpassed my not-so-modest expectations for it."
    },
    {
      "rating": "9",
      "text": "Don Jon shows an interesting view on how we as a society are products of what we watch and see everyday. Gordon-Levitt does an amazing job of illustrating this phenomenon with a great cast and superb writing."
    },
    {
      "rating": "7",
      "text": "While some of its more dramatic elements could be executed much better, Joseph Gordon-Levitt's first writer/directorial outing is a successful comedic drama with an admirable sense of honesty for its subject matter."
    },
    {
      "rating": "3",
      "text": "I was a long for the ride at the start, but as this movie went along, it fell apart for me. I do like Joseph Gordon-Levitt and would see another film directed by him, but this one fell flat for me."
    },
    {
      "rating": "2",
      "text": "Even for me, I found the sex and porn scenes repetitive and tasteless. There was so much you could take out. Joseph Gordon-Levitt should have made a short film about this, nothing more, but a whole lot less. The acting was par, but I found narration overused and the script far too bland for me to really sit and enjoy this movie."
    },
    {
      "rating": "6",
      "text": "Light treatment of a serious problem for too many men. Intimacy with women versus sex with women who have been objectified as sex objects by all forms of media. One benefit of this movie may be a better understanding that, given men's attitudes towards women as sex objects, that women shouldn't take it so seriously and personally if their man watches \"some\" porn. It's early, learned behaviour and as long as it doesn't become an obsession as it does to Don Jon, it's relatively meaningless.\rI thought the dialogue and relationship Don Jon had with Julianne Moore's character was artificial and hard to swallow as real, although it was key to the story.\r Worth seeing but could open a can of worms as a date movie. Drive with caution."
    },
    {
      "rating": "5",
      "text": "If you've seen the trailer for DON JON, then you've seen the film. In fact, the trailer is far better edited and paced than this first from the ever likable Joseph Gordon-Levitt. The comedy in DON JON never takes off and the film's more serious examination of porn obsession never takes off. The actors are all good but Scarlett Johansson totally commands the screen. Her character is gorgeous and awful but you just want her to come back. Ultimately, DON JON feels like a short film stretched to 90 minutes. But Gordon-Levitt clearly has a voice and this is his first."
    },
    {
      "rating": "1",
      "text": "October 2013\r The topic of porn addiction might be worth exploring in a movie. And certainly writers should be able to generate a few laughs out of it .Oddly the laughs are very few here except those lame ones at the expense of Catholics and Italians (undershirts at dinner really  The real problem here is casting .Bluntly Gordon-Levitt is an excellent actor but really doesn't have the drop dead \"look\" to play the super babe magnet of the movie lead. His exchanging glances with the best looking women in the bar and then running to bed with them is pretty much a fairy tale. This is easily explained of course by the director  writer choosing himself for the lead. Then it gets a little worse when about half the movie seems dedicated to loving closeups of the directors favorite actor. A self indulgent waste. Gets as much as a 4 only because every other actor is great."
    },
    {
      "rating": "8",
      "text": "I am a leader in men's groups. I thought this movie was purely excellent and very intelligent. There are many men in the world like the character Don John, as there are women like Scarlett Johansson's Barbara. The movie is funny at first...quite funny actually...and then it moves into a coming-of-age story for Don John, with his first discovery of what authentic intimacy looks like. Our culture is awash in pornography, and our young men of this generation grow up assaulted by images that distort reality and crassify culture. Jordan Leavitt's film placed a spotlight on this problem without preaching, and gave some welcome guidance as to the way out of that morass if you are a man stuck in that mode. It is an excellent film...look behind the genuine character comedy for the deeper message."
    },
    {
      "rating": "9",
      "text": "Probably the best film of 2013. I write this now, because whenever I think about it, this is the only film that still jumps out at me. Levitt took all his experience in the industry and put it towards crafting one of the most honest films in a while. It captures gender differences in such a tender and honest way, while at times lashing out at us for our hypocrite and scathing nature. It manages to scold without offending. Levitt himself plays the jersey shore douche with pitch point accuracy. Johansson nails her im above you nature perfectly, its too bad she isnt being recognized for her acting in this film. Julian moore is also fantastic, playing the sexy educational mom without ever once feeling creepy. The film is tender and great. If there's one movie you should watch from 2013, this is it."
    },
    {
      "rating": "6",
      "text": "The movie is somewhat repetitive and clearly way over the top, but Gordon Levitt does a solid job with his directing debut. The first hour was written pretty well but then the miscast of Juliana Moore deflates the film completely."
    },
    {
      "rating": "8",
      "text": "The trailer does this movie no justice as it makes you think this is a one subject movie. What this movie does is take you on a tour of Levitt's character as he matures from an early 20's kid into an adult. There are many issues along the way and the movie's light heartened approach is just perfect."
    },
    {
      "rating": "8",
      "text": "To be very honest, porn addiction is a real thing. Not a serious issue, but its very real. There are guys out there that do think like Don Jon. However, the problem is that when people see porn in a movie, its automatically disgusting. One thing I observed from watching this movie is that this is a guys movie. Certainly debatable if its a date movie, but its a mans movie. I'm sure going in, people were expecting the chick flick. Ya know, where the guy gets the girl, they briefly break-up, and guy does everything to get her back. It wasn't that. It ended differently, and it was fantastic. This is probably the most fun movie I've seen this year. I suggest that if you like good movies, you should put this on your must see list. The story is above the porn, its a real, down-to-earth story that can be enjoyed."
    },
    {
      "rating": "7",
      "text": "I was thinking the first century of the third millennium where the meaning of cinemas is rewrote. There's been lots of chances we can see and one of those were the beginning of adult-comedies. Recently 'Ted' made lots of waves among movie goers. So here comes the another one from the actor of '50/50' who also debuted as director. Making first is always challenging one, not many had tasted success but he handled very nicely his crew as well the co stars. It was a nice script based on today's world and the path the youngsters moving.\r The story centers around a character Jon who lives by his own principles. He does everything like every other guy like watching porn and masturbating. One day he meets his girl and begin to give his full commitment to it. Sometime he has to break his rules to obtain from opposite, so the remaining  portions explais how far he would go and sacrifice his life for a girl.\r Definitely it tells the unexpected truth to the older guys who are troubling to understand present technology that affecting people in a strange way. I was talking about online porns and this movie deals about the same theme. The trouble maker in a serious relationship, we can call it a new way of cheating. I believe this movie is not for everyone, if you are okay with adult theme as a comedy then it will be fine. I can call it a rare movie about online porn video addiction."
    },
    {
      "rating": "7",
      "text": "As a debut, Don Jon is pretty solid. It was really far from perfect, but again it's a debut. I liked it but really didn't love it as much as I expected I might. The porn gets a little annoying too."
    },
    {
      "rating": "8",
      "text": "In Joseph Gordon-Levitt's directorial debut, he has offered heart, witty humor and a great script that shows the view of one man's deception on porn and how it has affected his humanity. Overall, great job Joseph Gordon-Levitt. Be sure to check out my YouTube channel, \"TheMovieManLife\" for all things movies."
    },
    {
      "rating": "7",
      "text": "I was impressed with Gordon-Levitt's auteur film debut. I like the premise of the film. Porn is popular.\r What I didn't like about the film was Gordon-Levitt and Johansson performance.\r Joseph and Scarlett over acted. They did the Jersey thing too much. Which is a shame because they are good actors who did an otherwise good job in the film."
    },
    {
      "rating": "8",
      "text": "Joseph Gordon Levitt's first feature of Don Jon is funny, enjoyable, and entertaining about one man who struggles his life of being a cool dude for fantasizing women a lot."
    },
    {
      "rating": "6",
      "text": "Hard for most of us to imagine a guy who likes the fake sex of porn better than real sex with a woman. But it's an interesting issue, especially with porn proliferating everywhere. \"Don Jon's\" experience is a cautionary tale that you'd kind of like your teenage son to learn -- though perhaps not from this racy film! While Joseph G-L doesn't appeal to me, I've taken him seriously since the gravitas he showed in \"The Dark Knight Rises.\" In this movie, I don't quite buy him as a super-successful Jersey Shore-type Lothario (Travolta he's not) but I really like where he goes with Jon's story. And Tony Danza; Hilarious!"
    },
    {
      "rating": "8",
      "text": "Turns out that Joseph Gordon-Levitt behind the camera was a good idea after all. His directing is spot-on. The film editing is also great. The performances, especially of the three leads, is top-notch. The supporting cast is also very good.\r But the film's true strength is in the concept itself. It is a criticism of many aspects in society today, whether it's sexuality or religion. But in the end, it's actually a criticism of the predictability of romance movies themselves. I realized that in the ending (which was a bit rushed). After that i looked at the movie tagline (Everybody Loves A Happy Ending), and i finally understood it. It puzzled me in the beginning.\r This is a very intelligent film. Looking forward to more movies with Joseph Gordon-Levitt as director and writer."
    },
    {
      "rating": "8",
      "text": "Very solid movie. I think detractors missed the point on this. It is not simply a tale of porn addiction. It's also a story of a person and growing, becoming honest with himself, etc. More than that, I found it refreshingly original, both in story and in vibe, as well as solid acting by the entire cast. Well worth it, and a great first directorial outing from JGL."
    },
    {
      "rating": "7",
      "text": "Porn isn't real.  We all know it... but perhaps we never think about it?  This film explores that concept and more than anything makes you wonder how many other things in life are ruined by on-demand access to a never-ending stream of crap on every channel of our lives."
    },
    {
      "rating": "6",
      "text": "Jon Martello has earned himself the nickname ‘Don Jon’ amongst his buddies due to his ability to pick up virtually any woman he wants, unfortunately for him he gets more pleasure from watching porn than he does with any of the women he takes home. One night he meets the stunning Barbara Sugarman (Scarlett Johansson) and, having at first failed to go home with her, soon finds himself falling in love. Could she finally be the one to live up to his expectations?\r The writing and directorial debut of Joseph Gordon-Levitt Don Jon is slickly put together and certainly makes some interesting points about the way people’s expectations can warped by modern media, even if they are perhaps slightly exaggerated. The cast, including Gordon-Levitt, Johansson and the always reliable Julianne Moore are excellent throughout helping to keep things grounded.\r Despite these positives I did find that Don Jon made for a rather uncomfortable watch on a number of occasions (how many scenes do we need to see of someone masturbating?) and Don Jon doesn’t come across as a sympathetic, particularly early in the movie, making it difficult to really root for him. The ending also seems a little too rushed and neat to make for a truly satisfying climax to the story.\r Don Jon mat not be complete success but it is a promising start to Gordon-Levitt’s career behind the camera that, at the very least, shows he is willing to make movies that veer away from the mainstream."
    },
    {
      "rating": "10",
      "text": "That Joseph Gordon-Levitt is something. I love Don Jon. Very raunchy, it's not \"Zack and Miri 2.0.\" Playing a porn addicted ladies man who falls in love with a hot looking girlfriend who sees him watching porn. Oh my god! I love porn movies, I seriously do. Probably soon, he could make another movie called \"The Don Juan Porn Diaries.\" For me, this is one of the best comedies of 2013. Go on with your bad self, JGL! Pimpin' Ain't Easy."
    },
    {
      "rating": "7",
      "text": "I didn't want to watch this movie, based on its trailer. But I was very surprised! The movie is not boring, it has a lot of interesting parts. The director of the movie did a really good job for his first movie!"
    },
    {
      "rating": "5",
      "text": "As a native of northern New Jersey who grew up with many Italian working-class friends, I strongly resented the unnaturally thick Jersey accent as portrayed by Scarlett Johansson in her role as Barbara Sugarman. Sugarman is a Jewish name, as noted by the parents of Jon Martello (Joseph Gordon-Levitt) when he brings her home and introduces her to his Italian-American family, although in one scene Johansson sports a crucifix around her neck, so that detail was either a mistake or she was supposed to have had a Christian mother and a Jewish father. In any case, the film was directed and written by Gordon-Levitt, who is admittedly showing signs of youthful genius (but not necessarily in this film); however, Gordon-Levitt was born in Los Angeles, and like a lot of Hollywood actors and directors who did not grow up in industrialized northern New Jersey, his concept of a primitive, uncultured working class in New Jersey, especially of Italian origin, is highly exaggerated and misconceived. Yes, Ol' Blue Eyes came from Hoboken, and it is there that you will find the thickest so-called “Joisey” accent, but that is because of Hoboken's proximity to New York City, which is standing right there on the opposite shore of the Hudson. Indeed, that accent originates from the depths of Brooklyn, Queens, and Staten Island. It affects parts of New Jersey by association only. The erroneous concept that this accent originated in New Jersey goes hand-in-hand with the Hollywood belief that New Jersey is the cultural pits of the planet.\r For the record, I have never met a New Jerseyan who talks like that. As noted, it is only in limited parts of North and Central Jersey where the New York City dialect is spoken. The majority of the state can be found speaking the Philadelphia region dialect, where the word “Joisey” is unheard of. And certainly, Barbara Sugarman, who is shown to have been raised in a semi-affluent middle-class environment, would not have been speaking such a thick brogue. When Hollywood gets it wrong, they go over the top, and they love to go with the cliches.\r My next objection is the subject matter of the film, which again, stresses the primitive, if not positively elemental, level of culture that is presumed to exist in the State of New Jersey. (Remember Darren Aronofsky's The Wrestler? Also, over the top with its depiction of working-class New Jersey.) Jon Martello is not only mindlessly promiscuous to the point where dogs in the street are more discriminating than he is, but he is addicted to pornography and prefers pornography to genuine relations with real women. He watches pornography relentlessly, masturbates fiendishly, and confesses everything to the priest at his local church, where he then dutifully recites the number of Hail Mary's and Lord's Prayers he has to say to atone for his sins. (The number usually varies with the number of times he watched porn movies or had sex out of wedlock.) Just when Martello and Sugarman are becoming almost unbearably tedious, a breath of fresh air arrives in the form of Esther (Julianne Moore), who proceeds to lend some dignity and depth to the scenario. She is a much older woman for Jon Martello, characterized by the grief that she experienced in her recent past, which makes her extremely open and emotionally vulnerable but with a unique charm, a sort of latter-day Annie Hall. She is easy-going and forgiving, but also a wellspring of wisdom, and it is only through a rather odd coupling with her that Martello becomes humanized and stops acting like a beast gone mad in the woodlands.\r Moore almost saves the film, but the cartoonish characterizations that precede her entrance unfortunately predominate. Director/screenwriter Gordon-Levitt is still young, and he will have to work a little harder to do a truly sensitive film the next time around."
    },
    {
      "rating": "7",
      "text": "More philosophical and precise than I'd expected. It plays out like a very average story, but the content is important to young men (and women) and it is clear that it has been given serious thought. The ending took me by surprise and added a new dimension to the film which makes me want to see it in again from that perspective. It has something to say about relationships."
    },
    {
      "rating": "8",
      "text": "JGL’s director debut (also the writer and leading actor, a triple threat indeed in this case), DON JON, like (500) DAYS OF SUMMER (2009, 8/10), they are not your average rom-com and they are much better since they underpin certain realistic meanings. For DON JON, it is an anti-objectification to what Hollywood chronically implants into our generations’ minds about the veneer of romantic relationship. That is, man is looking for the perfect sex target to fulfill all his fantasies and woman is looking for a Mr. Perfect who is totally under her control. Both reek one-sided selfishness.\r Thanks to the invention of internet pornography and the discrepancy between man and woman on playing with oneself, for man, the more graphically related sexual demand can be easily actualized, so our protagonist Jon (Gordon-Levitt) is a porno-addicted gym jock, who has no difficulty hooking up the hottest girl in the nightclub, but when the eventual boy-meet-girl scenario happens, a smoking hot Barbara (Johansson) yet cannot drag him out to the cold turkey period, meanwhile, Barbara is far from picture-perfect and clearly has her own agenda of what kind of man she is seeking for, an inexorable clash sets them apart (although the history in the browser is a shoddy device). Later on, Jon starts to date an elder woman Esther (Moore) from the night school, who has just gone through a tragic accident in her life, nurtured by Esther’s sensible edification, Jon becomes clarified about what love is and accomplishes his rite of passage.\r DON JON is a genre-blender with indie comedy, romp romance and lighthearted drama, adorned by formulaic default of male chauvinism, female sexualization, boisterous Anglo-Italian family (Tony Danza is an embarrassing joke though), paint-by-number religious service and confession, while swarmed with repetition shots of making beds, gym, church, night school, sex-hunt in the club, and of course, porn stuff. Nevertheless as a novice in the director’s chair, JGL shows qualified competence in executing the story with slick pace and earnest passion, and as an actor, he is definitely a leading man material among his peers. Johansson and Moore are pitch-perfect in two different types of women who turn a boy into a man. Johansson amplifies her self-mocking fatuousness and control freaky possessiveness, injects immense credibility in a derogative character; Moore, is an on-screen goddess of mettle, shatters the twenty-years age difference, generates some wholesome chemistry with JGL despite it is not a challenging role for her at all.\r I give DON JON an reassuring 8/10, it is more than a cute feel-good flick to watch with your significant other, underneath its less-than-impressive script, the connotation it evokes is worth more wider reverberations other than an immediate suggestion “why not Jon just date a porn star if he is really into that?”. For me, it is a guilty pleasure not the least because Moore is in it."
    },
    {
      "rating": "7",
      "text": "An excellent trifecta from Joseph Gordon-Levitt! To write, direct and act is not often a success; but he's pulled it off. A story well-worth telling as well as watching, with strong performances from nearly all of its cast members."
    },
    {
      "rating": "9",
      "text": "In the interest of full disclosure, I love Joseph Gordon-Levitt. The man can do no wrong. This movie is no exception. It has an honest heart and impeccable performances from all involved. In all seriousness, there's not a single weak performance from any of the cast. Without spoiling anything I can say that this is a strong directorial debut from an already established young actor that explores the sexual identity of a new generation that is often oversimplified. This film takes a turn in the end that's unexpected, but very gratifying. Absolutely a must see."
    },
    {
      "rating": "6",
      "text": "For his first film, JGL did not do awful... it started off alright, it had its funny moments, you go through Don Jon's daily routines and see how they slowly change over the period he dates Barbara... pretty obvious analysis, but come one what was with Julianne Moore, I guess she was just the first person he truly connected with? And then he randomly just re-introduced her at the end so abruptly... just not the most amazing movie I have seen in awhile. What is happening to Cinema?"
    },
    {
      "rating": "7",
      "text": "The ending was a bit predictable from halfway through the movie, and it does feel like it's slightly repeated, but \"Don Jon\" delivers a number of funny scenes, great moments, and great acting from JGL and Scarlett Johansson."
    },
    {
      "rating": "9",
      "text": "Well done. Great camera work, great direction, great acting. While some plot points in the story seem to get rushed, ultimately, the things that weren't connected dot to dot became realistically foretold. Levitt painted a beauty here that doesn't get convoluted or trip over it's own words. Whether you agree or disagree with the premise or conclusion, this is a well-crafted film and very much worth watching."
    },
    {
      "rating": "7",
      "text": "Jon, in fondo, sarebbe un bravo ragazzo: sa tenere in ordine una casa, va a messa con regolarità confessandosi sempre (la sua accurata contabilità dei peccati gli costa penitenze che poi vengono scontate mentre fatica in palestra) e tutte le domeniche va a pranzo da mammà, i maschi di casa a tavola in canottiera mentre il televisore trasmette a ciclo continuo football americano di cui suo padre  fanatico. Il problema  che il giovanotto  un egocentrico impenitente  in ciò che ritiene importante c’è una sfilza di aggettivi possessivi  e, di conseguenza, nel rapporto con l’altro sesso ha la sensibilità di un quindicenne carico di testosterone: cataloga le donne dando loro un voto,  un seduttore seriale (da cui il nomignolo ‘Don’), ma la sua vera passione resta il porno, giudicato sempre più soddisfacente di qualsiasi rapporto reale. Quando incontra Barbara, la sua prospettiva parrebbe cambiare  e vorrei ben vedere, avendo lei le fattezze di Scarlett Johansson  tanto che si azzarda persino a presentarla in casa per la gioia di sua madre che non vede l’ora di diventare nonna. Ben presto, però, il meccanismo si inceppa, un po’ perché lui non riesce a rinunciare al sesso virtuale, un po’ perché lei  solo un’altra faccia di un atteggiamento egoista verso la vita: Barbara cerca di plasmare Jon a suo piacimento  la scuola serale, il divieto di fare le pulizie, le pellicole sdolcinate a ripetizione (Anne Hathaway e Cuba Gooding jr. cammei dei film nel film)   finchè la sorella di lui Monica non dice che il re  nudo nell’unica battuta che le  riservata, visto che per il resto del tempo  impegnata con il telefonino. Le lezioni forzate hanno però avuto almeno il pregio di far conoscere a Jon la sua compagna di corso Esther, una Julianne Moore che più lontana non potrebbe essere dai suoi ideali femminili: tra le braccia materne di questa vedova molto più vecchia di lui  gli fa il bagno e occhio anche al cambio di prospettiva sul preservativo  egli fa infine un passo verso la maturità, riuscendo per la prima volta a dare oltre che a ricevere. Per la sua prima regia, Joseph Gordon-Levitt scrive e dirige questa svelta (novanta minuti scarsi) commedia dal buon ritmo e puntellata da un più che discreto numero di battute: pur essendo un californiano di origine ebrea, la ambienta curiosamente in una famiglia italoamericana cattolica, ma questa sua versione di giovane Scorsese con il sorriso funziona assai meglio di quanto ci si potesse aspettare. Il merito va equamente diviso tra una scrittura che mostra davvero pochi passaggi da limare e un cast che sembra divertirsi: Gordon-Levitt  sempre in scena, anche se all’inizio non aveva pensato a se stesso come interprete, e attorno a lui gli altri attori riescono a caratterizzare con gusto i loro personaggi, compresi quelli minori come i genitori di Jon Tony Danza e Glenne Headly oppure gli amici tamarri come e più di lui Rob Brown e Jeremy Luke. Certo, tutto questo parlare di (e fare) sesso può dare fastidio a qualcuno, come  successo anche fra i sei che erano in sala con me durante la proiezione:  un peccato, però, perché l’argomento, pur scivoloso,  trattato cercando di evitare la volgarità e viene usato per rappresentare quell’eccesso di autoreferenzialità che caratterizza molti individui nella nostra società. Il tutto, comunque, senza prendersi troppo sul serio e, soprattutto, evitando i moralismi: se da una parte lo sguardo sul piccolo mondo che ruota attorno a Jon poteva essere più aggressivo, dall’altro il ‘lieto fine’ conclusivo risulta ben lungi dall’essere classico."
    },
    {
      "rating": "7",
      "text": "Don Jon's first hour is recognisably on the money with regards to sex and the male of the species. Some very funny comedic writing hits some great targets often with the sting of truth. A buffed up Joseph Gordon-Levitt is great fun as catholic boy Jon, more interested in internet porn than in sustaining long term relationships with any girl, including Scarlett Johansson who is great here. In fact, she hasn't been this good in years and looks fantastic into the bargain.\rUnfortunately, with the entry of a rather mis-cast and de glamourised Julianne Moore the film rather deflates. It's obvious that she and Levitt will get together, but this last act which is a shade unbelievable loses the laughs, becomes rather moralising, somewhat judgemental and is actually too simplistically concluded. All of which is a shame because there is so much to enjoy in the film's first hour.\rAmongst its other achievements the movie boasts a great original score. Alternating between lush romanticism and a playful cheekiness it enhances all the shenanigans taking place on screen, perfectly."
    },
    {
      "rating": "4",
      "text": "Shame was better.\r If you want to see a more realistic depiction of sex addiction, watch shame.  A better overall production/acting/cinematography.\r This movie was just so so.  As bad as the trailer.  JGL is not my cup of tea.  His acting/looks were cringeworthy most of the time.  We're supposed to believe this pencil neck, wife-beater wearing guy can pick up and draw attention of limitless hot women and easily turn them down for sex too.  Most of the characters are shallow and cliche.  Overacting at it's worst.  Characters not sympathetic.\r Girl picks guy up at a night club.  Guy immediately wants to **** her, she leaves.  Guy takes her to lunch says he wants to **** her.  Finally gets to **** her, but then she is appalled that he watches porn?  Makes him promise never to watch it again (year right!)...he lies...she breaks up with him over it....cmon.  A 10 yr old would have written garbage like that.  Characters were all unlikeable, other than the black friend and the Red head.  Not a very deep movie.  Not funny either (some claim it's comedy).  Tony Danza's character was annoying as ****  Maybe Jersey boys would relate to these douchebags.  I did not."
    }
  ],
  "recommendations": [
    "the_intern",
    "moonrise_kingdom",
    "pretty_woman",
    "hustlers",
    "booksmart",
    "young_adult",
    "the_perks_of_being_a_wallflower",
    "blue_jasmine",
    "silver_linings_playbook",
    "me_before_you",
    "closer",
    "the_spectacular_now",
    "i_feel_pretty",
    "savages",
    "chef",
    "what_women_want",
    "book_club",
    "the_upside",
    "me_and_earl_and_the_dying_girl",
    "the_edge_of_seventeen",
    "promising_young_woman",
    "the_blind_side",
    "magic_mikes_last_dance",
    "lady_bird",
    "the_witches_of_eastwick"
  ]
}