{
  "id": 2892,
  "title": "Doom",
  "starring": [
    "Karl Urban",
    "Dwayne Johnson"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Horror",
    "Science Fiction"
  ],
  "description": "A team of space marines known as the Rapid Response Tactical Squad, led by Sarge, is sent to a science facility on Mars after somebody reports a security breach. There, they learn that the alert came after a test subject, a mass murderer purposefully injected with alien DNA, broke free and began killing people. Dr. Grimm, who is related to team member Reaper, informs them all that the chromosome can mutate humans into monsters -- and is highly infectious.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/y50lH061yWOvEstoZRn7lYs0huk.jpg",
  "categories": {
    "plot": 5.882352941176471,
    "acting": 7.571428571428571,
    "ending": 7.285714285714286,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 6.9
  },
  "reviews": [
    {
      "rating": "5",
      "text": "The movie itself does not follow the games storyline at all which is rather disapointing but what makes this movie watchable is the witty humour, watching alien heads role and ofcourse to see the BFG (Big F***ing Gun). Not to mention the smart caption near the end when you are transported into the actors body and feel as if you are playing the game."
    },
    {
      "rating": "10",
      "text": "It was loosely based on the game, had some gore, some action, some good (and bad) acting, and a first-person scene! In other words :it's the best game adaption since... EVER!!!"
    },
    {
      "rating": "3",
      "text": "Play \"Doom 3\" instead and leave this movie alone. This movie is loosely based (I mean it) on the videogame of the same name. And they chose to exclude the part that made the videogame so truly creepy and frightening. Welcome to hell!!! I gave it a \"3\", beacuse of the first person scene which lasts 5 mins. top."
    },
    {
      "rating": "3",
      "text": "Not a good movie as far as I can tell. The movie is short, the plot is not that great, The Rock did die in the movie and the battle sequences does not feel like the one from the original Doom game. If this movie was based from Doom 3, that part should be acceptable, except this wasn't."
    },
    {
      "rating": "0",
      "text": "Some films are so bad they make you laugh. \"Doom\" is not one of these films. \"Doom\" is so bad it's thought provoking. My only thought leaving the theatre was \"what happened to cinema?\" Also, the comparison to the game is completely irrelivant. The film should be able to stand on it's own and it fails."
    },
    {
      "rating": "3",
      "text": "Abysmal! Every actor in this film should never work anywhere again. And whats makes it worse it has NOTHING to do with the game!? At least..... no Red Eye is still worse!"
    },
    {
      "rating": "10",
      "text": "Sure it wasn't 100% faithful to the game, but DOOM is a damn fine movie. I loved every moment of it. One of my favourites parts about the film was Dwayne Johnson. He gave a wonderful performance as Sarge. He was very creepy, authoritative and menacing. This is one of the most underrated movies of all time. My real rating would be an 9, but I'm giving it a 10 in order to boost the incredibly low 6.3 it currently has."
    },
    {
      "rating": "8",
      "text": "It actually has surprisingly little to do with the video game(s) it's supposedly based on. It trades the demons in for mutants and lone wolf protagonist for a team of space marines. The only similarities are that it takes place on mars in a facility visually reminiscent of Doom 3. To be honest it has more in common with Aliens.\r Does any of this make it a bad film? No, not really. I mean, don't get me wrong, this is far from the most intelligent sci-fi movie there. It's definitely filled to the brim with cheese at times, but I still found myself having a lot of fun with this campy, action-horror flick.\r Admittedly it's not that hard to think that we could've had a pretty great Aliens rip-off had the doubled down more on the horror and left the cheesier moments out. In typical video game movie fashion we get elements thrown in meant specifically for the teenage gaming crowd.\r There's a scene of gratuitous nudity and the dialog is far from Shakespearean. Mix that in with moments of intentionally goofy humor and you have a movie that doesn't always take itself seriously. There's also Dwayne \"The Rock\" Johnson's super over-the-top performance. However when it's firing on all cylinders and focusing on the great cast shooting up monsters in dark corridors it's hard to not enjoy yourself.\r The action itself is mostly well done. It gets a little too over-the-top at times with the way it occasionally sends it's character careening through the air in an unintentionally comical fashion, but it's suitably gory and can get pretty tense in that special action movie way. There's a sequence in the movie that takes place in first-person as a throwback to the games that's just awesome.\r While an extra dose of seriousness would have gone a long way, Doom is a pretty great movie. While the actual plot has little to do with the games, there are enough references to satisfy fans. Saying it's not as terrible as other video game movies isn't really saying much. However even when viewed outside of the video game movie spectrum it's still pretty great in it's own ways. The horror angle, while underutilized, did help give it a more serious tone to keep viewers invested longer. Not to mention it's got great action and a (mostly) stellar cast. Video game movies are rarely worth watching, but this one proves to be one of those rare exceptions to the rule. So long as you can put up with some camp and cheese that is."
    },
    {
      "rating": "8",
      "text": "I enjoyed this film! While a harsh critic of the sci-fi genre (my favorite), I tried not to take this film too seriously and tried to place myself within it's target audience. Oddly enough, this is one of Johnson's better roles and Urban does a fine job as well. I was totally convinced in each character and I loved the the Olduvai setting. Perhaps one of the best video game to film conversions I've seen."
    },
    {
      "rating": "4",
      "text": "I can consider myself one of the biggest fan of Doom, and i've seen this movie twice or three times.\rYou can see this movie with 2 points of view: as fan this movie is horrible, the plot doesn't follow the original  one and there isn't Flynn Taggart and a lot of monsters that can be used in the film; as not fan this is a good movie, with an interesting plot and action scenes. Advised only to notfan of the original game, because if you see it you'll be disappointed"
    },
    {
      "rating": "0",
      "text": "Doom done wrong! It is not based on Doom and it is very loosley based on Doom 3!EPIC FAIL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1111111111"
    },
    {
      "rating": "0",
      "text": "Estupidamente Imbecil sem graça,sem vida,sem sentido,sem propósito.Uma boa história transformada em matança sem fim até fantasmas de marte é mais foda com as cenas de trem com hard rock. Lixo."
    },
    {
      "rating": "10",
      "text": "Hahah, this movie rocked. Its got a nice lil plot and some awsome action. Coulda been waaaaaaay more developed, but I think its simplicity is what made it so fun to watch, and I liked the FPS scene."
    },
    {
      "rating": "0",
      "text": "If I lay my hands on that guy who made this so called movie I'll probably kill him. I am a fanatic DOOM games series fan since my childhood and when i go and see this movie i just want to beat that guy how is responsible for this abomination. First of all what original Doom has to do with this Gods forsaken peace of.  Second, even if you compare Doom with anything like this crap, you should go straight to mentally ill persons hospital or something. It's not even worth zero - I should give it minus hundred. In short, I AM MAD and I want to kick that bastard's ass for even messing with DOOM's name!"
    },
    {
      "rating": "8",
      "text": "Aside from an awful first person scene that drags on for FAR too long, this film is a pretty taught, nicely paced monster film. Much better than 'Resident Evil' and most other zombie films, for that matter. No... Not as good as Aliens."
    },
    {
      "rating": "4",
      "text": "You have DOOM. The game which always pulled my attation with pumping action and lots of cool enemy's. This is doom, a laugheble movie that ruins the BFG (blue gue ffs) and is based only on Doom 3, what's the wurst Doom out on the marked."
    },
    {
      "rating": "2",
      "text": "If you want the Doom experience please play"
    },
    {
      "rating": "7",
      "text": "This movie was good enough!"
    },
    {
      "rating": "4",
      "text": "Not bad...but,should try harder than that."
    },
    {
      "rating": "10",
      "text": "Sorry you didn't like it John D. but to me everything you were asking for was delivered in the movie. And if you started laughing at the end it may be because you really did like it. I laughed at the end as well but because I was satisfied with the experience."
    },
    {
      "rating": "10",
      "text": "It drives me crazy.. people that give 0 - 2 scores finish up by saying wait to watch it on DVD. If you are recommending people see the movie then why the low scores. If this genre isn't your cup of tea then you shouldn't be rating it at all...thats why I dont rate movies like North Country or Elizabethtown."
    },
    {
      "rating": "2",
      "text": "This movie is a mess. The first half was very good until they flushed the movie down the toilet. The story in this movie is not even close to the game! The first person part was kinda crazy (a first in movie history) but cool. I recomend that you should wait and see it on DVD and same a bunch of money!"
    },
    {
      "rating": "9",
      "text": "A recent NY Times review called this movie \"really just a formulaic shoot'em-up, with dead bodies amassing on the floor of an underground Martian laboratory\". Wasn't that most of what the game itself was? For those looking for a best picture nominee, don't waste your time with this movie; however that was clearly not its intention. This movie was made as a tribute to the grandaddy of one of the most popular game genres of all time, first person shooters, and Doom the game has been copied and mimicked in games more than Star Wars has in movies. So for those critics that watched this movie expecting an Oscar-worthy performance from the rock, try first looking at the source of this movie, the game itself, which was exactly what every FPS fan loved, and exactly what you'll find in this movie, nothing but a shoot 'em up. By the way I personally think Karl Urban did a great job in this movie, and my personal complaint would be that he should have taken more of a larger role in the script of the movie. If you are looking for a real heartwarming movie, this is a tribute to a gory video game; if you are looking for a recreation of a video game, this is limited by the fact that it is just a movie. With the understanding of the difficulties the director had in this balancing act, I was still very much entertained and would recommend it to any FPS fan."
    },
    {
      "rating": "9",
      "text": "It was way better then i expected i thought it was going to be just a first person view which i didnt realy care for and it turned out to be better then the game, even a bit longer lol."
    },
    {
      "rating": "5",
      "text": "The best part of the movie has to be the music score. I wished they had follow the game plot line."
    },
    {
      "rating": "10",
      "text": "This movie is the best, what is wrong with you guys?"
    },
    {
      "rating": "5",
      "text": "The best thing about Doom was that it dramatically increased my desire to play more of Doom 3, the intended effect of the movie, I suspect. Unfortunately, this was largely because I think the game is a much better, more entertaining effort than a film which, as usual, discards the more interesting story and graphic elements of the source material in favor of some lame screen writer and director's notions of what the game was about. On the plus side, it did have an interesting twist at the end that I thought was atypical of this sort of film, and it did evoke some of the look and feel of the game. If you want a better reflection of Doom, I suggest double-billing Hellraiser and Aliens."
    },
    {
      "rating": "1",
      "text": "What a bunchless movie. This movie way too long, ill conceived and boring. My special word is, awful. Whats the point the two company (id and Hollywood) wasted of their money to make such film like this? It suppose to be action 1st person shooter but where are their action? Nothing new. If u feel uncomfortable of this movie, i suggest u play Doom 3 on pc game. Dont watch this film, its not worth for your money."
    },
    {
      "rating": "2",
      "text": "Awful. All it needed to be was a plotless movie with cool guns and a lot of action. It had everything it shouldn't have had and lacked everything it needed. Boring, pointless, terrible."
    },
    {
      "rating": "0",
      "text": "Are you kidding me?!?! It was nothing like the games. THEY ARE FROM HELL NOT ALIENS!!! God I hate when people try to spice up something that is allready good. Hate this movie, Love the games."
    },
    {
      "rating": "7",
      "text": "I didn't hate this film, but I don't blame anyone who does. This film was only really likable because it was so bad it was funny and had a few decent action scenes to boot. I played the game, and doesn't capture the spirit of it, but it's a fun bad film to watch."
    },
    {
      "rating": "3",
      "text": "This movie was so-so won't look at it a second time, but did n't mind paying to look at it. Rock need to stop acting."
    },
    {
      "rating": "2",
      "text": "It's nothing like the games. At least nothing like doom 1 and 2 which is the only good doom-games. doom 3 is super-boring. The movie has three things that relate it to the games. The monsters are extremly boring, jeezuz. The endigs is 25% better than the rest og the movie, but all in all the movie is total s**t."
    },
    {
      "rating": "3",
      "text": "I love any film the Rock is in. This movie is only getting this score because I like him. I have to admit though that I didn't expect anything from this film. I expected a plot that a drunk Collage student could have come up with, and boy, was I not dissapointed. Now I played the original DOOM and where are the DEMONS? WHERE IS THE HELL PORTAL? What is all this 24th strain crap? I wanted to see thr Rock kick some demon ass and shut down hell! What a sad hollywood imitation of a great game."
    },
    {
      "rating": "10",
      "text": "Take it for what it is. A monster bashing flick much like 80's the thing. Great special effects and that little sequence toward the end brought back memories of terrifying monsters jumping from every corner in the game. Overall the movie did a good job at staying true to the games. I loved it."
    },
    {
      "rating": "10",
      "text": "Brilliant! Best Rock movie, best game-to-film film, Best movie set on mars, its great! Left a smile on my face for about an hour after the movie!"
    },
    {
      "rating": "9",
      "text": "This film was fantastic. I was able to see a prescreening. This is much better than tomb raider, without the hot chick."
    },
    {
      "rating": "4",
      "text": "Exactly what movies are CoD and MoH based off of? Saving Private Ryan? Not exactly. The only great movie to game adaptation was Goldeneye for the N64. The first great game to movie adaptation will arrive eventually, but not when Uwe Boll keeps getting work."
    },
    {
      "rating": "5",
      "text": "Not that bad for a video game made into a movie.. the rock is.. well.. the rock (with his eyebrow thing). good gore.. very weak scenario."
    },
    {
      "rating": "6",
      "text": "Not as bad as the critics make it out to be. In the mould of AVP; interesting twist at the end, turned out to be the opposite of what I expected."
    },
    {
      "rating": "5",
      "text": "The movie wasn't that good. I mean, it's a Video game to Movie. When are they ever good? I couldn't really figure out what in the hell was going on in the movie... Although in my theatre the Voice came 5 seconds after their mouths moved. Like the Godzilla movies dubbed. If you're hardcore into Doom, go see it. If you know nothing about it, don't bother."
    },
    {
      "rating": "10",
      "text": "The beginning was pretty slow, but it soon became interesting later in the movie when they went to search for the scientists. The action sequences were all superb and random jokes keep the movie going. Also.... BFG owns."
    },
    {
      "rating": "10",
      "text": "kicked ass loved this movie go see it now. great action"
    },
    {
      "rating": "10",
      "text": "This movie rocks ! With all the crummy critics basing this, it may not get the recognition it deserves. Makes a perfect start to a new movie franchise. Did everyone gripe about the inconsistencies in the Alien series with a creature that can grow from an egg to a massive monster within less than a day ? Bugger Ebert.... go watch this and get your friends on board too."
    },
    {
      "rating": "10",
      "text": "Great Video Game based movie! What did you critics expected from movie based on a video game about killing hundreds of monsters? Great plot or character development? gfy, this movie rocks!"
    },
    {
      "rating": "7",
      "text": "Good, mindless fun. If you haven't played Doom then you might be going \"Whaaaa?\", but just sit back and go with it. This is comic book stuff."
    },
    {
      "rating": "6",
      "text": "I had high hopes for this movie. It turned out not to be what I expected, or hoped. Doom was not the first video game based movie, and is certainly won't be the last. The story as it was portrayed was good. It had taken elements from the video game"
    },
    {
      "rating": "0",
      "text": "This was worse than \"Alone In The Dark\"! A plot a 12 year old could come up with, really fake looking weapons, and stupid looking creatures. The Rock was fine but it's not enough. Just a waste of time."
    },
    {
      "rating": "0",
      "text": "If you're going to make a movie, it should be a good movie. Doom is a decent game (I personally hate it, but whatever), but it should not be a movie! There was nothing to this film, much like the game. Also like the game, intelligent people will be finished with it way before they could possibly be entertained."
    },
    {
      "rating": "9",
      "text": "Blast of a film, exactly what I expected and I wasnt disappointed, great job of changing the story around and still giving the DOOM fans what they wanted, lots of action, great gore and the Rock kicking all kinds all over the place.....loved this flick and its definitely up there with some of my favorite action movies of all time."
    }
  ],
  "recommendations": [
    "hitman",
    "silent_hill",
    "resident_evil_damnation",
    "monster_hunter",
    "hitman_agent_47",
    "silent_hill_revelation_3d",
    "tomb_raider",
    "mortal_kombat",
    "spy_kids_3_d_game_over",
    "lara_croft_tomb_raider",
    "prince_of_persia_the_sands_of_time",
    "stay_alive",
    "mortal_kombat_annihilation",
    "gamer",
    "rampage",
    "polar",
    "yu_gi_oh_the_movie",
    "i_am_number_four",
    "final_fantasy_the_spirits_within",
    "resident_evil_apocalypse",
    "red_dawn",
    "underworld_blood_wars",
    "warcraft",
    "underworld_evolution",
    "uncharted"
  ]
}