{
  "id": 4090,
  "title": "Doomsday",
  "starring": [
    "Rhona Mitra",
    "Bob Hoskins"
  ],
  "runtime": 108,
  "genre": [
    "Action",
    "Thriller",
    "Science Fiction"
  ],
  "description": "The lethal Reaper virus spreads throughout Britain—infecting millions and killing hundreds of thousands. Authorities brutally and successfully quarantine the country but, three decades later, the virus resurfaces in a major city. An elite group of specialists is urgently dispatched into the still-quarantined country to retrieve a cure by any means necessary. Shut off from the rest of the world, the unit must battle through a landscape that has become a waking nightmare.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cKUmTyXgmhv8cMRCY9RYTKcAeTn.jpg",
  "categories": {
    "plot": 3.176470588235294,
    "acting": 4.0,
    "ending": 5.833333333333333,
    "soundtrack": 4.2,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.25,
    "action": 4.6923076923076925
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Mad Max and robin hood had a love child that turned out to be a bently GT. without a doubt the worst film iv ever seen. Idea for the film wasnt bad but just went in a farsical direction. Thot it would be like dog soldiers....i was wrong, very wrong."
    },
    {
      "rating": "5",
      "text": "Sort of a Mad Max meets Resident Evil. Plenty of action, but not very creative and unpleasant to watch. The cast is fair. Just another movie with a dismal view of the future."
    },
    {
      "rating": "0",
      "text": "I allowed my admiration for Marshall's \"Dog Soldiers\" and, even more, \"The Descent\" overcome my reluctance to see a movie that's not screened for critics. And you'd better believe I regret it. Just absolutely awful. This is the movie to beat for Worst of 2008."
    },
    {
      "rating": "3",
      "text": "I was very impressed by both of Marshall's previous films. Dog Soldiers was a very good addition to the often poorly served werewolf sub-genre and The Descent had some really good and realistic ideas for a horror film... until the cave monsters showed up and it went a bit further than necessary. Still, both were reasonably intelligent modern horror films that showed him to be a talent to watch. I saw this as a free screening due largely Marshall's other films. After seeing it, however, I really wish I had passed. It's little more than a mish-mash of much better films with little in the way of plot or character to fill in the moments between set-pieces and gratuitous moments: e.g. random topless girl, something blows up for no reason, something explodes in a cloud of blood... these occur left and right and entirely without reason or purpose. It blatantly rips off the plot from Escape from New York (a character is even named Carpenter in apparent homage), the set-up will be compared to 28 Days Later (though any \"massive viral outbreak in Britain\" plot will get that now), steals a lot of design and atmosphere from Mad Max and still manages to throw in some medieval nonsense in there as well. Fight scenes were of the terrible, overly-fast, shaky-cam, quick-cut style making them a jumbled mess and none of the effects really felt that impressive. Almost none of the plot has any semblance of sense with almost every action occurring for little to no reason and characters being encountered so randomly that the writing doesn't feel quite good enough to even be considered lazy. In all I really enjoyed most of the films this is derived from. Heck, I even enjoyed Escape from LA to a moderate degree. This, however, was a waste of time and money even as a free screening."
    },
    {
      "rating": "5",
      "text": "\"Mama, I'm coming home.\" Those words are never spoken in \"Doomsday\", but that's because this film is more Ozzy Osbourne than Josh Groban. Eden Sinclair(Rhona Mitra) was just a wee lass when the Glasgowian face melting began, and now the Scottish expatriate is returning to the bosom, commando style. If you pardon the cannibalism, \"Doomsday\" could be a Lifetime movie, if you pardon the bloodletting and car chases, too. This would be more readily apparent had Scotland not reinvented itself as a punk rock wonderland. If Eden wasn't looking for Kane(Malcolm McDonald), who English authorities think is in possession of the antidote that can cure the second wave of infections, this secretly Scottish woman would be looking for her mom. Don't let it escape your notice that badass Eden kept the momento which tells her who she is. The whole of Scotland is under quarantine by English decree, but \"Doomsday\" could've extrapolated with less coyness and blatantly declare the U.K.'s actions as totalitarian. The movie is also hampered by sloppy music choices during the ceremonial slayings, which leads to the nihilistic barbeque. Granted, Scottish bands like Simple Minds(\"Up on the Catwalk\" might've worked) and Orange Juice(they're hopeless; too twee, and that goes for all Postcard-era bands) aren't \"Warriors(The)\"-worthy(the 1979 Walter Hill film), but there's always Franz Ferdinand(instead of Adam and the Ants). \"Doomsday\" might just another neo-holocaust movie, but at least the dead stay dead. \"Doomsday\" chooses \"I Am Dead\" over \"I Am Legend\". Eden hardly bats an eyelid as colleague after colleague are picked off by this new breed of Scots, but the team leader would probably be bawling her eyes out if she crossed paths with mom. That's her achilees heel. She's an orphan. \"Doomsday\" is a chick-flick protected by a bullet-proof genre."
    },
    {
      "rating": "3",
      "text": "Derivative. poorly conceived. It is already becoming an easy formula. I am getting tired of it."
    },
    {
      "rating": "3",
      "text": "Couldn't decide what it wanted to be... just felt like every scene or gag or action scene was mistimed and limp. Big disappointment."
    },
    {
      "rating": "3",
      "text": "I thought Dog (Sh*t) Soldiers was rubbish and this despite having some money thrown at it is poor and loses it way leaving loose ends all over the shop. Rhona Mitra pulls off her end as the kick ass heroine(i wish she would mine! lol) but poor characters and Medevil Scotland with full costumes is hard to believe. Tries to be Aliens, Escape from New York, and Mad Max and ends up being more Waterworld meets 28 weeks later. Disappointing sorry."
    },
    {
      "rating": "0",
      "text": "This is the worst movie ever made , the story is unoriginal and it takes good ideas from over movies and turns it into crap, at one moment the group of resuers are in glasgow full of mad max like survivers wanting to kill them then they are next attacked by a bunch of lord of the rings like warriors , then after they find a bently then drive away in james bond like fashion , you could acctually make a list of what movies were used to make this film.you couldn't even make a spoof about this movie!"
    },
    {
      "rating": "5",
      "text": "The film is a good idea poorly executed. The inconsistencies are frustrating. I found myself wanting to like the movie but not able. If you like B movies you will love it as for the rest of us it leave a lot to be desired."
    },
    {
      "rating": "0",
      "text": "Absolutely terrible, hardly anything made sense in this movie. I never knew Bently made slow automobiles."
    },
    {
      "rating": "4",
      "text": "Take \"Mad Max\", \"28 Days Later\", and \"Escape From New York\", remove any semblance of plot, story structure, and all the interesting characters. Then add a heavy dose of contrived self-parody and camp and you have \"Doomsday\". This movie is absolutely dreadful. Mitra, although lovely as always, fails miserably while trying to pull off a female Snake Plissken. The usually reliable Hoskins tries to do his best with the pitiful role given him but comes up dry. The main villains are wholly unconvincing, BDSM-loving, cannabilistic carbon-copy Mad Max ripoffs while Malcolm McDowell leads a group of entirely superflous and totally useless medieval side-villains. I could drone on but honestly it's too painfully bad to try and reconvey here. I'm only giving it a solid 4 for the sheer comedic value. The excessive, cartoonish, 1970s exploitation film-style violence and gore is so delightfully bad it's good and the soundtrack is so incredibly campy and inappropriate it literally made my mouth gape wide open. I think the creators of this film started off trying to make a serious, badass post-apocalyptic movie and decided to just start goofing off halfway through filming. Definitely file this in the \"so bad it's good\" category."
    },
    {
      "rating": "2",
      "text": "Very bad!!!!!!!!!!!! i can't believe this was the guy who did the descent, that is such a good film! this is terrible! awful dialogue, script, acting...EVERYTYHING! it isn't even remotely scary! and i can't believe they played that 80's song when that punk guy was on stage! what was the song again? ne one? thatscene was awful! where as in the descent it was suspensful, intense, exciting and realistic or the similar movie 28 days later, which deeply taps into our fears of 'what would we do if this happened?' thanks to it's amazing direction, making it incredibly realistic and all the more fearful! here, the best attempt at tapping itno our deepest fears is a stereotypically cheesy punk guy on stage singing some cheesy 80's song while screaming and a mosh-pit crowd! ooh, how scary-80'S CHEESY POP SONG! DO NOT WATCH THIS MOVIE! it will be a complete waste of your time!"
    },
    {
      "rating": "0",
      "text": "Simply awful."
    },
    {
      "rating": "0",
      "text": "Honestly, I don't know what the suits saw in this script. Piss-poor."
    },
    {
      "rating": "0",
      "text": "A terrible waste of a ticket purchase. Garbage."
    },
    {
      "rating": "1",
      "text": "Utter sh*te, peices of some great movies, cut out and pasted randomly together into a huge horrible mess of drab crap."
    },
    {
      "rating": "4",
      "text": "This was an exciting movie. However, it lacked inspiration, good acting, and depth. I enjoyed it but I would never see it again."
    },
    {
      "rating": "2",
      "text": "It started off so promisingly. It had the potential to be absolutely fantastic - the premise was brilliant. But then the moment they arrived in Glasgow it turned into a shambolic display of idiocy, excess, and one of the worst Mad Max rip-offs in history. Where's the bitterness? The social and political issues that should have been there but weren't? I'll tell you something, it's blindingly obvious that Neil Marshall is English. And hasn't the vaguest idea of the resentment and anger that exists north of the border even WITHOUT a viral apocalypse. Is it possible for an entire society to be out-of-character?"
    },
    {
      "rating": "5",
      "text": "Starts promisingly but then proceeds to steal all the best bits from Mad Max, 28 Weeks Later, The Running Man, Waterworld (ahem). Good tongue in cheek moments but the futuristic Glasgow is unconvincing - if you've ever been you'll know it's always like that!"
    },
    {
      "rating": "2",
      "text": "The worst film I have seen in the last few years."
    },
    {
      "rating": "5",
      "text": "Shamelessly rips off Resident Evil (Not the best source of inspiration) and Sol (the antagonist) looks like Keith Flints stranger brother. I love the first 10 mins of the movie and if neil marshall had kept the quality up then I'd happily recommend this, however it falls flat after that, following the introduction of Snake Pliss.., I mean Eden Sinclair. Also medieval armor appears to be plentiful and is Scotland really that bad in that it degenerates in 28 or so years. It actually does somewhat stand up for what it's worth but when compared to Marshals previous and masterful film, The Descent it just falls flat. Also i haven't mentioned plot holes because I'm too afraid of leaving one out, there are literally dozens of them in the movie! It looks good and when it's only the charachters that aren't annoying or unintentionally hilarious talking it's really eerie (note beginning and going into Scotland) but from there it fails."
    },
    {
      "rating": "1",
      "text": "Someone role a die for every 20 minutes to determin what shoul come next as the theme. Worst plot ever!! Zombies, punkers, middle age and carchase.... Seriously one of the worst movies ever!!"
    },
    {
      "rating": "8",
      "text": "If you like films with gory fight scenes and suspense-filled chase scenes that keep you on the edge of your seat, then you’ll love Doomsday.\rDoomsday is about a killer virus which spreads through Scotland in 2008 and now, 30 years later, its come back.\rIn order to stop this virus from spreading to the rest of Britain, a wall was built along the English/Scottish border in 2008. At first this seemed to stop the virus from spreading but then in 2035 the virus came back and spread across London. Luckily survivors have been found in Scotland, which means there must be a cure. And now its up to a high ranking spy called Sinclair (Emma Cleasby) to lead a group of soldiers into Scotland to find this cure. But once inside Scotland, the survivors that the soldiers encounter aren’t very friendly and its not long before the group of soldiers are involved in a gory gun-fight, which leaves the viewer wondering not only if they’ll find a cure but also if they’ll make it out of Scotland alive.\rThe film gets you interested right from the start by introducing the virus as horrific and gory when we see an infected person with horrible skin mutations. As well as introducing the virus in a great way, Sinclair is also introduced in a great scene which shows just how well trained a spy she is. The special effects in this scene make the gun-fights seem gory and blood-filled.\rMy favourite scene in the film is the car chase at the end which is filled with comedy, action and gore. This is my favourite scene because it kept me on the edge of my seat and the special effects in this scene made the crashes look painful, realistic and explosive.\rI would recommend this film to anyone who loves gory action films with a bit of a funny side and I would rate this film 8/10."
    },
    {
      "rating": "9",
      "text": "This is a highly underrated film. Brilliant storyline, fantastic actors and I only wish they'd do a sequel!\r Watch it online for free: https://www.primewire.ag/watch-239-Doomsday-online-free"
    },
    {
      "rating": "0",
      "text": "No. Ultra garbage boring and confusing"
    },
    {
      "rating": "8",
      "text": "It's all about gore, violence, boobies, and a very cool, punk-rock sacrificial dance-number. If that's not your cup of tea than don't bother. If it is, get a bucket of popcorn, leave your criticism for the real world, and have a blast!"
    },
    {
      "rating": "3",
      "text": "I'm starting to believed that some of the public have gone totally insane! 10's and 9's, u cannot be serious, this movie began well but rapidly deteriorated to becoming the worse plot/story line i have ever seen! putting the 'can can' music in was the last straw 4 me! i have given it a 3 because of its gore and nothing more! the main character was an awful addition, who seemed to be james bond with the hulks strength, i cud barely watch as it was so far fetched! the director had moments of madness whilst making this appaling excuse 4 a movie n shud be shot for doing so!"
    },
    {
      "rating": "1",
      "text": "This movie was awful. The one is for Rhona Mitra, who is hot. Smokin' hot."
    },
    {
      "rating": "0",
      "text": "Did it really need music for every damn scene....i thought i was watching Mortal Kombat for a second...with that crappy ass techno music...no wait House of the Dead."
    },
    {
      "rating": "2",
      "text": "Great premise for a movie however. no effort has been put into preproduction or research, It had the feel of Madmax but without the originality, Not to mention the plot holes which i could have very easily drven the Bentley used in the later part of the film through. At several points I found my friends and I actually bored with the dialogue and having abit of a chat and contemplate a toilet break in the cinema. Just shows how A poorly written script, and direction can create something that i would recommend waiting till it was on weekly rental at your local rather than going and parting with your hard earned cash to see in the cinema. 28 days laterm V for vendetta potential but came of feeling like judge dread Yukky!"
    },
    {
      "rating": "2",
      "text": "This film was basically a bunch of emo warlords killing everything around them.. what was the point in this movie? It didnt even make sense."
    },
    {
      "rating": "0",
      "text": "This is by far the worst film I have seen in the last 5 years. It is as if they let some fourteen year old who likes violence and unrealistic badly directed action \"cos its cool\" and had him make a film with all the bits from his favorite movies in. There are biker boys, lord of the rings scenes, car chases and a hot female action hero. \"Yeah Cool\" I hear all the mindless idiots shout. No, it isn"
    },
    {
      "rating": "0",
      "text": "Longest state lottery funded car commercial I've ever seen. This movie was so bad I feel as though my braincells would have been better used drowning in arsenic. This movie should have been illegal. I can honestly say that some of the glaring plot holes and inexplicable random circumstances were actually the high points of this movie. Not since an Uwe Boll movie has such a huge (also state funded) budget produced such a steaming mountain of manure. Think I'm being too harsh? Let me give you some highlights of the plot: 25 years is long enough to degrade to feudal society complete with competent bowmen, blacksmiths, masons, tapestry weavers, list goes on. A small percentage of the population survives, just enough to have a hundred or so to kill in random scenes. Armored personnel carriers not only do not have bullet proof glass windows, but they don't have shatter proof glass windows. Crazy bloodlusting cannibal psychos in big ole steel trucks and roadsters are scared of tiny 2008 bentleys running into them, but the same psychos are not scared of taking on guys in full high-tech military armor with big huge automatic weapons when they themselves wield boards with nails in them. This movie was just too stupid for digestion. I wanted to like it, I wanted to believe it was camp, I wanted to just enjoy the action, but there was no way possible that I could even start to get into it. Not to mention the adhd quality of the plot, it's appallingly derivative nature or the complete lack of resolution. This was vomit on cellulose and I want that hour and 45 min of my life back. If anyone else would like to start a class action suit with me for damages and vitality wasted let me know. AVOID LIKE THE PLAGUE."
    },
    {
      "rating": "4",
      "text": "Some people need to realise that some movies are made for fun - despite the huge investment - especially future virus takes over Scotland type movies. For those of you who have never driven a Bentley in the Scottish Highlands or raced a steam train for that matter - this movie clearly started out as a computer game. That's why the Bentley goes so slow too, it has a speed limiter on it from the game \"I drive like an Asian'. If Swine Flu takes hold, I hope I find a passage under the mountain that has a box with a bike in it let alone a Bentley. Then when I go to the castle I can join them as a court jester....guys seriously you have to see this move for what it is - a truncated gore fest where nobody has any idea who says what and life exists in fast forward due to the only food being the insides of Scottish gentry. Can't wait for part 2 - Glasgow Rangers v Glasgow Celtic street soccer!"
    },
    {
      "rating": "9",
      "text": "Loved this film. Gory but satisfying. Mad Max meets 28 Weeks Later. Absolutely loved Rhona Mitra - she has it all over Lara Croft as posh birth who kicks butt. A great surprise."
    },
    {
      "rating": "0",
      "text": "Trite, boring, lame...vintage Neil Marshall"
    },
    {
      "rating": "0",
      "text": "It's hard to imagine that any movie could be worse than Marshall's \"The Descent\"...this one isn't, but it comes close. This guy is worse than Uwe Boll."
    },
    {
      "rating": "3",
      "text": "It's amazing to see that this movie with plotholes can get at least a 51 rating while the movie KNOWING which actually makes sense a far worse rating.Shame on you people!!!"
    },
    {
      "rating": "10",
      "text": "This pretty much sums Doomsday up. Suspend you disbelief a wee bit and sit back and enjoy. It"
    },
    {
      "rating": "10",
      "text": "Anyone who went to this movie and didn't like it is just stupid. Why are you in the theater at all?? Did you see the commercial and expect Dances With Wolves? The majority of us knew we were about to see a crazy action movie and that's exactly what we got! A 10 all the way. See it a hundred times then buy the unrated DVD! People who gave it a 0 should get their heads torn from their bodies with a jagged, dull, diseased sword and the firm grip of a hot, battle-hardened woman!"
    },
    {
      "rating": "9",
      "text": "A very entertaining movie - some great homages to Mad Max and Escape from New York, as well as some great music choices. Grab some beer and some friends and you won't go wrong."
    },
    {
      "rating": "8",
      "text": "Any fan of post-apocalyptic films should see this movie. Tons of explosive action, and a little touch of suspense. The only problem I had with the film was the overuse of violence and the storyline wasn't much, but I could watch Doomsday again and still enjoy it."
    },
    {
      "rating": "7",
      "text": "Guilty pleasure for sure. But it's a fun tribute to the Mad Max movies and Escape From LA. Rhona Mitra is hot in this movie. I admit that it does have so unintentional humor, but it's the kind of movie you will enjoy if you don't expect something of high art."
    },
    {
      "rating": "9",
      "text": "This is such a viscerally thrilling, super clever, post-modern throwdown."
    },
    {
      "rating": "7",
      "text": "Why people are giving this movie such negative reviews. i actually enjoyed the movie, it had a pretty good story line 2 it and the action was nonstop. Not as good at the decent but pretty close?"
    },
    {
      "rating": "8",
      "text": "While tonally very different from Marshall's critically-loved The Descent, this bears a good bit of the humor and the loving embrace of all things cool that Dog Soldiers exhibited, albeit on a much larger, extravagant scale. It's pretty clear that this wasn't shown to critics less because the studio thought it was a dud, and more because they aren't the audience for a movie like this - it's a giddy lovefest for both the director and genre fans to share and, really, if you can't appreciate the sheer joy this movie has plowing through apocalyptic punk, D&D fantasy, and unabashed irony-free late-70s/early-80s action then you simply came to the wrong film. Doomsday manages to provide the same level of kitschy badass that Tarantino/Rodriguez's Grindhouse did last year, except without all the film-school hipster winking-at-the-audience with fake lost-reels and digital film grain - it's an adoring collage that does exactly what it's designed to do."
    },
    {
      "rating": "7",
      "text": "Rodriguez and Tarantino crashed and burned with their indulgent \"Grindhouse\" experiment. Those were fun to watch, and for those who got it, a great time while while the reels rolled. Totally forgettable afterward though. Marshall reaches back into a little more recent genre period - the multi-plex,midnight movie 80's - for his nostalgia trip, and I think that since he doesn't hype his experimental time trip so much, it makes it more fun to discover the genre and movie rip-offs, hommages and cinematic playing arounds than Tarantino and Rodriguez thinking they were making another flick -that they seem to have thought everybody was going to give them another pat on the back for. Marshall does his best again with little - and he handles it all, production, action, casting - likes he's been doin' it for longer and better than others with only three movies to their credit. Hollywood is scrambling to pick up foreign directors who can do a lot with a little. I think with this, you'll see Marshall's name on a bigger tentpole flick soon."
    },
    {
      "rating": "9",
      "text": "Now I think a rating below 5 makes you markedly less intelligent because it is IMMEDIATELY apparent that you don't understand that this movie has a niche in which it is perfect. If it's not your type of movie, don't f*(&%ing rate it. Every so often, a movie comes around that is some person's brainchild and will be excruciatingly painful in the name of \"art\" (Babel comes to mind). You know these. They feel like over-acted high-school plays shot in black and white with vaseline on the screen. The end usually ends with \"fin\" in script. These movies suck, yet we all feel there's a greater meaning that requires donning this s*$% sandwich with an academy award or five. All I wanted tonight was a little action, a little (lot) gore, a little comedy, and a movie that's not completely predictable. \"Doomsday\" provided outstandingly on all fronts while evoking the nostalgia of \"Mad Max,\" \"28 days later,\" and strangely \"I am legend\" (which was ironically released AFTER Doomsday was shot). If you gave this movie a poor rating, perhaps you should learn the terms GENRE and NICHE understand why people may like the movie that you hated. If you like chick flicks, go watch those instead of plaguing us with your fanboy opinions about something you chose to watch knowing it wouldn't be enjoyable for you."
    },
    {
      "rating": "8",
      "text": "About as deep and substantive as a pudding cup, this is not a great movie. It is, however, a great movie to watch. It riffs on more post-apocalyptic movies than you can count, and you just don't care. It's worth watching, and lots of fun."
    }
  ],
  "recommendations": [
    "transformers_age_of_extinction",
    "underworld_blood_wars",
    "machete_kills",
    "geostorm",
    "frozen",
    "jurassic_world",
    "jurassic_world_fallen_kingdom",
    "snakes_on_a_plane",
    "battleship",
    "army_of_the_dead",
    "war_of_the_worlds",
    "shadow_in_the_cloud",
    "salt",
    "xxx_return_of_xander_cage",
    "machete",
    "47_meters_down",
    "teenage_mutant_ninja_turtles",
    "transformers_revenge_of_the_fallen",
    "the_predator",
    "olympus_has_fallen",
    "crawl",
    "the_meg",
    "transformers_the_last_knight",
    "polar",
    "ghost_rider_spirit_of_vengeance"
  ]
}