{
  "id": 2391,
  "title": "Double Impact",
  "starring": [
    "Jean-Claude Van Damme",
    "Geoffrey Lewis"
  ],
  "runtime": 110,
  "genre": [
    "Thriller",
    "Action",
    "Crime",
    "Drama"
  ],
  "description": "Jean Claude Van Damme plays a dual role as Alex and Chad, twins separated at the death of their parents. Chad is raised by a family retainer in Paris, Alex becomes a petty crook in Hong Kong. Seeing a picture of Alex, Chad rejoins him and convinces him that his rival in Hong Kong is also the man who killed their parents. Alex is suspicious of Chad, especially when it comes to his girlfriend.",
  "releaseYear": "1991",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tmzwvSqoMC37Tgqwj4mA2dHNSmw.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 10.0,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Double Impact is an action film mainly but incorporates crime and romance so it all blends together....Double Impact is a film made in1991 by director Sheldon Lettich.... Double Impact is very violent and full of explosions, shootouts, martial arts, gunfire and bad language..... Jean Claude Van Dammes plays twin brothers, one a bit sloppy and chilled out and the other wears a brown leather jacket and is very serious and smokes cigars.... When the twins parents are murdered at birth both twin brothers are kept safe until they are fully grown and one of them named Chad Wagner (Van Damme) is raised by Frank Avery (Geoffrey Lewis) and he treats him like he was his own... Frank Avery was well known to the twins father and was very trustworthy and liked by him... 25 years after their parents murder now fully grown adults, Chad Wagner and Alex Wagner who are both played by Van Damme team up with Frank Avery to avenge their parents murder... They go after the two responsible who are Raymond Zhang and another guy named Griffith (Alan Scarfe) and the other two villains are some tough female played by Corinna Everson and some Chinese or Jap dude heavily built played by Bolo Yeung.... In the end the twins get their revenge for the parents death and all the bad guys are dead so happy ending.... Alonna Shaw who plays Danielle who's Alex Wagners (Van Damme) girlfriend in Double Impact is beautiful with her blonde hair.... Double Impact has some of the best action scenes ever put on film, the short sex scenes are good, the fight scenes are at times funny and a bit dumb but beautifully made... The chemistry between the actors is sometimes uncomfortable but believable to a degree but all in all this film is violent and excellent plus you get double the Van dammage!!! Alonna Shaw is very sexy and what Double Impact does is introduce both style and substance and it never gets boring with a great story to boot... The shootout scenes are amazing too so if you want a decent film watch Double Impact and ignore the haters. It's one of Van Dammes best movies and certainly a violent classic... Aswell as all the violence and blood you also see different locations such as Hong Kong and some beautiful scenery throughout."
    },
    {
      "rating": "0",
      "text": "This \"film\" is easily one of the worst action movies I have ever subjected myself to.  All the action movie tropes, from cheesy one-liners and satisfying villain deaths are aped into oblivion.  The movie's just shy of two hours long, but I felt like it was about three hours because the whole time was a boring slog through mediocrity.  I still don't understand why Double van Damme's motivations for embarking on their... mission.  What was super disappointing was that one of the main villains was played by the police chief from John Woo's \"Hard Boiled\" (Which Metacritic does not have in its database, for some reason), so when he was onscreen I constantly wished I was watching that instead.If you want an entertaining corny action movie with a dual-role performance, I think The 6th Day with Schwarzenegger does a much better job (It's definantly not one of his best films, but \"Double Impact\" makes it look like \"Total Recall\" if we're comparing it using the same yardstick)."
    },
    {
      "rating": "1",
      "text": "Double Van Damme dans ce ‘Double Impact’ qui reprend le principe des jumeaux séparés à la naissance… ces derniers se retrouvent réunis à leur grand dam afin de botter le cul de la mafia locale (de Hongkong…) responsable de la mort de leurs parents…Sur ces entrefaites, Van Damme se dédouble, castagne et défouraille plus ou moins souvent dans ce gros navet des familles qui sent encore les années 80… bien qu’il date de 1991. Cela signifie donc une violence certaine et une réalisation tout à fait correcte avec même quelques ralentis ici et là mais d’une maladresse assez regrettable.L’humour entre les jumeaux sent nettement des pieds -pour ne pas dire pire- alors que Van Damme tente de faire l’acteur entre deux coups de tatane. Le reste de la distribution n’en mène pas large et compte des seconds et troisièmes couteaux à l’aune de ce navet qui n’a décidément pas bien vieilli… même si on peut (encore) trouver ou tomber sur bien pire… de nos jours !Cela ne nous rassure qu’à moitié, certes… cependant, la grande blonde est une bombasse atomiquasse et la méchante femme de main (on dit bien ‘homme de main’, alors…) pourrait ou aurait pu camper une Miss Hulk sans aucun souci, ma foi. Ce navet est fort longuet, souvent ramolli et très bêbête… et pas vraiment comestible en tout cas !"
    }
  ]
}