{
  "id": 2131,
  "title": "Downsizing",
  "starring": [
    "Matt Damon",
    "Christoph Waltz"
  ],
  "runtime": 135,
  "genre": [
    "Comedy",
    "Drama",
    "Science Fiction"
  ],
  "description": "A kindly occupational therapist undergoes a new procedure to be shrunken to four inches tall so that he and his wife can help save the planet and afford a nice lifestyle at the same time.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/l7iJoJBoP046hWyeeC2CQ6knOeK.jpg",
  "categories": {
    "plot": 5.033333333333333,
    "acting": 5.0476190476190474,
    "ending": 5.6923076923076925,
    "soundtrack": 4.5,
    "cinematography": 1.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "An interesting idea, but very badly incarnate. A lot of unnecessary scenes, superfluous words. Events are unnecessarily long. The semantic part of the film is vaguely expressed, although the authors had more than enough possibilities for this. Equally frustrating is the director's work. many scenes look ridiculous and unnatural"
    },
    {
      "rating": "3",
      "text": "Downsizing takes an interesting premise and turns it into one of the most boring, plodding blunders I have ever seen. The pacing of this movie is all over the place. Some scenes fly by so quickly you cannot understand what is happening, and others go by so slowly that you wonder when the movie will end. The movie is very liberal with scenes accompanied by music in which nothing happens. In an attempt to be artsy, these scenes come off as nothing more than poorly disguised attempts to pad the run time.The script is hit-or-miss at best and asinine at worst. Matt Damon does his best to give an honest performance, and he and Christoph Waltz are the only watchable parts of the movie. Downsizing is just a giant let down."
    },
    {
      "rating": "4",
      "text": "Unfortunately from a promising start this film devolved into a dull homily on \"helping people is what matters\".  I could see so many promising avenues this could have explored based on the premise of shrinking people to lessen their impact on the environment, and it touches very lightly on a few of them (for example the inherent conflicts between the \"smalls\" and the \"normals\", the notion that repressive governments would use the technology in repressive ways, the problems of borders dealing with humans who come in pint size, the obvious issue that even in Leisure Land somebody needs to clean the toilets), but then it wastes time in a drug-induced trance, and loses its way entirely by meandering off into the original small colony in Norway reacting to a potential doomsday scenario that makes absolutely no sense (it does make sense to plan for it in the long run, but there's no reason at all for the darn hurry).  Matt Damon is the most boring protagonist I can ever remember him being in any of his films, and even the always impressive Christoph Waltz and the bright newcomer Hong Chau couldn't pull the unfocused script back from the brink.  I did like how Matt Damon's character came full circle (from taking care of his ailing mother at the start), that's a neat thematic viewpoint, but I really wanted this film to do a lot more with its premise and the big ideas that came with that.  Heck, even just more of the interaction between tiny humans and the regular-sized world would have been more interesting, though that was the most superficial if funny aspect of the film.  As usual, science fiction remains best left to actual science fiction writers."
    },
    {
      "rating": "5",
      "text": "The most notable thing about Downsizing was I laughed a lot more than I ever expected to. I'm not about to urge you all to rush out and see this one. For one thing the trailer painted a slightly different picture than the one you end up getting. Not only that but there are a number of scenes that don't appear in the film at all. When a trailer about a topic as weird as this features a scene involving people 5 inches tall drinking out of a massive bottle of vodka and then doesn't appear in the film you can't help but notice that. It's not the best movie you'll see all year but it's so quirky and out there that you'll enjoy it in the moment and might even get some laughs out of it, I know I did.In a world where overpopulation is an issue the only feasible solution apparently is to undergo a permanent procedure called downsizing. This will greatly benefit the environment etc but more importantly your money will get you a lot more so you can afford to live like millionaires in a little perfect town and a huge house. Matt Damon fed up with his life, experiencing money problems and unable to afford a house decides the best option for him and his wife is to downsize and live the life they've always wanted. Well things don't go according to plan for poor Matt Damon and that's about the point where the movie decides to take a sharp turn in another direction. I wasn't relishing the idea of seeing a depressed mini Matt Damon for 2 hours 15 minutes so the introduction of Christoph Waltz and Hong Chau was exactly what the story needed. So although I feel the second half of the movie differs so much in tone it does feel like you're watching a whole new movie I enjoyed Downsizing for the most part. For all its problems and lack of focus it makes up for it with unexpected and random bursts of hilarity. Not the easiest rating I've ever given, I didn't love it but I didn't hate it. A great idea, with a very good script so I can't help but feel like it should have been better. Recommended if you're looking for something a little bit different."
    },
    {
      "rating": "5",
      "text": "What could've been an astounding social commentary piece ends up to be a multi-faceted disjointed disaster piece. Downsizing focuses on the good Samaritan character Paul Safranek as he ventures the downsized world with some realizations and disappointments without delving into any of the important societal issues, but simply stating them and moving into cliche stories of characters. Payne misses the mark with the great cast and occasional humor, ultimately dooming Downsizing the chance to become politically important."
    },
    {
      "rating": "6",
      "text": "In order to extend our planet's life span, a technique is invented that shrinks people down to 5\", so their energy usage and waste is greatly reduced. Matt Damon plays the man caught in this tiny world after his wife abandons him. Once the novelty of the small vs. large wears off, what's left is a forceful ecological lesson. Luckily, it includes his relationship with a Vietnamese woman (Hong Chau in a delightful and sometimes touching breakout performance). This adds a level of human responsibility and expands the message to compassion for one's fellow earthlings. There's virtually no humor, so what looks like it could be fun turns into a mildly involving drama and a heavy-handed tract on the foilables of human nature and the dangers of disregarding our planet's health."
    },
    {
      "rating": "5",
      "text": "While the first half of the film introduces plenty of interesting ideas, the second half fails to capitalize on those ideas, instead asking more vague questions that leaves a sense of confusion."
    },
    {
      "rating": "3",
      "text": "The movie is quite interesting all up to the point where they enter the tiny world (about 30 minutes in). Then it becomes a boring drama. I'd expected it to be a bit like \"Honey, I Shrunk the Kids\", but it is not - not even by a long shot.You don't even know they are in a tiny world during most of the movie. They have everything from TV's to coffee machines and busses. And basically NONE of it looks \"small\". It's just an ordinary coffee machine and an ordinary TV.I was interested in the tiny concept of the movie. But when that was removed, there was nothing left but a sluggish, sleep-inducing drama."
    },
    {
      "rating": "0",
      "text": "A strong contender for the worst film of all time, certainly the worst movie of 2017. The initial premise of the film is set up well, but after around thirty minutes the film becomes a total mess and seems to have no idea where it is going, jumping from idea to idea throughout the rest of the duration. A total waste of time, I actually watched it again as I couldn't believe how poor the film was and I wanted to give it a chance to redeem itself. It didn't. There is a very good video essay on youtube called \"How Downsizing Cheated You\" which sums it up in quite a humorous way."
    },
    {
      "rating": "7",
      "text": "The trailer does this movie a huge disservice.  The trailer tries to sell this movie as a silly comedy, like Matt Damon's \"Stuck On You.\"  While the movie does have some silly, comedic bits, it's main focus is a satirical take on modern consumerism.  If you go into the film expecting to be rolling on the floor laughing, you're going to be disappointed.\"Downsizing\" is to modern 21st century mass consumerism as Voltaire's \"Candide\" was to 18th Century Leibnizian Optimism.  Both works take the perspective of a generic everyman to illustrate the flaws in the times they live in and the mindset of the people around them.  And in both works, the main character starts off seemingly indoctrinated by the world around them and proceeds to live through experiences that cause disillusionment.  I won't spoil the ending, but if you didn't like \"Candide,\" you're probably not going to like \"Downsizing.\"It's not a comedy.  It's meant to be a thought-provoking, satirical commentary on rampant, self-destructive consumerism.  It does an acceptable job at that, though if you go into the movie blind like I did, you'll endure about an hour and a half of \"where is this movie going\" confusion."
    },
    {
      "rating": "7",
      "text": "Downsizing is a comedy that turns into a drama. By the end it felt more about how people jump on trends. Its tone becomes very disjointed as you descend from lightheartedness into end of the world stuff that never really feels like an actual problem in the movie."
    },
    {
      "rating": "8",
      "text": "I don’t get it, the negative reviews puzzle me. I really enjoyed this movie and I thought the performances were fantastic!"
    },
    {
      "rating": "3",
      "text": "Really terrible film, recapping it to my friends made me realise how poor the overall plot was. Just a few things stuck together. The only good bit was when Paul took some drugs... honestly everything else was terrible."
    },
    {
      "rating": "5",
      "text": "Yeah, the movie is disappointing but i don't think is bad. It has good acting, good jokes, the Visuals Effects of the tiny people are ok and the music is decent but the way is handle, how's the writing and which direction is going is really mediocre and is like the three acts are just changing the story. The idea is great, it would be better if the movie would be a satire sci-fic comedy-drama that could work, but it couldn't for the direction that Alexander Payne goes and also the writing of Jim Taylor and Alexander Payne. It could be better, but they waste the oportunnity, that's why is disappointing, even more disappointing than LEGO Ninjago."
    },
    {
      "rating": "5",
      "text": "why did this happen..DownsizingAn idea isn't everything and this movie is a fine example of it. Yes, it has its heart in the center of it and has genuine effort in writing and direction but it completely fails on offering the audience what they were promised. Surprisingly as we know, it has a premise of an animated feature and much like it, it is finely detailed as it had to create its own world (in a way) and this is the only note where the movie scores for these little amusing things are the only thing helping one survive this overlong script. Downsizing lacks a gripping screenplay, better editing, fast pacing and a particular palpable environment (it fluctuates a lot; the first act is completely different than the others, it doesn't quite fits in). Matt Damon and Christoph Waltz are equally good in it but surprisingly so is Hong Chau; she is perfect in her role. And in the end, Alexander Payne is the man responsible for all of it and as far his direction or execution is concerned he puts all his effort in each and every frame; one can completely see it, but on the writing part he fails to either surprise or entertain the audience. Downsizing is sweet and beautiful filled with hope (not for the viewers though) but has an overlong second act and a disappointing climax."
    },
    {
      "rating": "3",
      "text": "All over the place.  It had 5 different major themes and should have focused much more."
    },
    {
      "rating": "5",
      "text": "The first third of this film is brilliant and hilarious stuff. It's most everything you see in the trailers. Unfortunately, it settles into much more mundane, tedious sequences which lack humor. The final few scenes are satisfying, but they're not enough to rescue the film. Damon is generally solid in his \"every-man\" role, and Wiig is great, though her role is brief. Incidentally, the funniest bit in the trailer - the tapping massive vodka bottle - didn't make the final cut, which is a bummer."
    },
    {
      "rating": "1",
      "text": "This film was terrible. It lures you in with an interesting premise that is completely exhausted and ignored roughly 30% of the way in. What you are left with, is one of the most contrived spectacles I have ever had the misfortune to sit through. It takes a major turn for the worse around the same time Kristin Wig takes her leave. The dialogue at times is so ridiculously silly, it is literally painful to watch. What I can’t undertstand is out of all the people involved with this film, not a one of them spoke up and said “hey, this doesn't make a damn bit of sense” or “hey, this is probably some of the dumbest dialogue in the history of cinema. Where is the accountability? Matt Damon is a great actor and will rebound, but unfortunately I will forever see him as the main in this complete waste of resources and time. The writer and director as well as the producers should collectively be ashamed of themselves and especially Damon, whom I believe to know better than this. Each ticket should come with a complimentary cyanide capsule."
    },
    {
      "rating": "8",
      "text": "Wow this movie is a sleeper hit in my opinion. I initially watched this out of boredom expecting something goofy and fun akin to Honey I Shrunk the Kids but this movie is so much more!"
    },
    {
      "rating": "0",
      "text": "Ce film est un tour de force... en effet, comment peut-on avec un tel sujet passer complètement à côté de son sujet ?!... Avec des gens réduits à 12 ou 13 cm, on a pourtant tout un paquet de situations plus ou moins cocasses, voire dangereuses (!) que l'on pourrait imaginer !Au lieu de ça, on nous démoule un film tarte, concon et neuneu, gnangnan et chiant... oui, tout ça à la fois ! c'est hallucinant de voir ça, surtout avec les effets spéciaux et les moyens dont dispose le cinéma hollywoodien d'aujourd'hui...Je passe rapidement sur le problème \"Matt Damon\", car tourner avec \"Matt Damon\", c'est se coller un sacré boulet au pied, même en miniature. Il est mauvais et aussi charismatique qu'un balai à chiottes mais passons, car c'est ici le cadet des soucis de ce film.On a donc jamais l'impression qu'ils soient **** puisqu'ils vivent tout comme les \"grands\" dans leur petit monde où tout est reproduit à l'identique ; ils sont toujours aussi cons, ce qui démontre que la connerie ne rapetisse pas, hélas. Le film nous bassine évidemment avec sa morale écologique à deux balles et glisse dans son agenda les migrants clandestins... c'est tout ce qu'il a pu tirer comme conséquences directes du \"downsizing\" à la mode : une migrante vietnamienne éclopée.On passera aussi sur l'invraisemblance générale du film qui veut pourtant se la jouer \"réaliste\"... on a tout réduit pour nos super-nabots, y compris les animaux, les cigares, les médocs, et même les amphètes. Mais la marmotte, elle est où ? est-ce qu'elle emballe toujours le chocolat dans le papier alu ? répondez, les Français veulent savoir !Et donc, aucun géant pour marcher sur ces petites colonies, aucun enfant hyperactif pour jouer avec ces petites marionnettes humaines ? personne pour tomber de la table ? non, non, juste du blabla pontifiant de merde pour un film tout petit qui ne mérite que la note la plus petite... disponible."
    },
    {
      "rating": "6",
      "text": "Downsizing had a good idea. The story starts well and is funny until half of it. After that it's more a semi drama. I really loved the romance in the second half. It was funny and a bit more realistic then usual. The problem with this movie is that there is not treat to their lives in general, while almost everything would try to eat or attack them. Even the most aseptic of environments has failures. In that sens the movie only display some political, ethical, religion views of the situation but with no real danger...I give it a 60% because this was a great idea but the story in itself isn't very realistic and somewhat boring. Great acting from all the actors, I especially loved those actors/actress around Matt Damon."
    },
    {
      "rating": "0",
      "text": "Great idea. But its the worst film i've ever seen after \"War Planet Apes\". But unfortunately,i've spend 2 hours of my life on this..."
    },
    {
      "rating": "1",
      "text": "The problem with Downsizing comes down to everything in the script. The dialogue is unnatural and makes the actors seem awful. The story is pretentious, cramming in 2 seconds worth of commentary on different kinds of \"relevant\" topics. The only one that's important to the story is a \"Save the Environment\" message that's been done to death. The directing is on the level of an Adam Sandler film. The special effects are generic, the cinematography is uncreative, and the music makes me WANT blood to leak from my ears. I was hoping for something interesting in this movie, but all I found was a stupid, unamusing attempt at \"meaningful\" sci-fi."
    },
    {
      "rating": "2",
      "text": "I love Matt, but good gravy this movie was the most banal and boring movie I have ever sat through."
    },
    {
      "rating": "1",
      "text": "From The Bourne Identity to the The Boring Identity there is literally nothing redeeming about Damon or Downsizing aside from the basic concept. If you watch the trailer for this movie it promises you a fun, comedic jaunt about the trials and tribulations of being small in a big world. What you ended up with is a long-winded, boring guilt trip about being human and destroying the planet. I'm not sure how this movie was even listed as a comedy, as I can't recall a single laughable moment throughout the whole film. Everything from the storyline, to the dialogue, to the on-screen performances, felt like the cinematic equivalent of a valium induced coma. If you are considering seeing this movie, do yourself a favour, go down to the pet store, buy yourself a goldfish, and watch it swim around in its bowl for 2 hours. It will be far more entertaining and far less depressing."
    },
    {
      "rating": "6",
      "text": "This movie is hard to describe.  The premise is certainly interesting: miniaturizing people to save the planet.  The first part of the movie is about the discovery of the process and the eventual selling of the concept as we see Paul (Matt Damon) and wife Audrey getting the sales pitch for Leisure World, the place tou can live in a tiny mansion for a tiny amount of money.  The next thing we see is Paul’s life in Leisure World and meet his obnoxious neighbor played by Christoph Waltz.  At this point, the movie takes a left turn and becomes a whole different movie.  And, we meet a Vetnamese woman (Hong Chau) who becomes an important character.  There is het another plot twist before the end.  At this point, it begins to sound like a ride at Epcot.  Preachy and like a hippie love fest.  It sort of lost me sometime around this part.  It is entertaining, but not entirely enjoyable.  It is too unfocused for my taste."
    },
    {
      "rating": "3",
      "text": "One of the most uninteresting movies of the year. So much wasted potential and a pretty solid cast who just drag their feet through the whole thing ultimately accomplishing nothing."
    },
    {
      "rating": "0",
      "text": "For a critical acclaimed director, writer and producer, this film left me just puzzled and confused. There was no clear direction and the trailer essentially had nothing to do with the film! Matt Damon's performance was lackluster and just utter nonsense. And yeah sure, just let a Vietnamese-American actress play a stereotypical Vietnamese-American individual, nothing racist about that..... Downsizing is one of the worst film I've seen this year. I even prefer Jumanji  over this."
    },
    {
      "rating": "10",
      "text": "Plainly put, movies like this don't come around often enough. With a refreshingly adult take on the \"Indian in the Cupboard\" (and only marginally less-racist) this film will take you in for the entirety of it's runtime. Beautiful scenery, an encouraging take on classes in society and plenty of humor make this a comfy escape for a few hours."
    },
    {
      "rating": "9",
      "text": "I was completely caught off guard by where this went, but it was delightful. I have never liked Matt Damon more. It took some chances. And I appreciate that."
    },
    {
      "rating": "6",
      "text": "Downsizing is a solid, fun idea for movie. Sadly, the concept is better than the film itself. The first 40 minutes are downright boring, and the ending just felt odd. However, the concept is so strong that film makes you think about it for a while. The biggest highlight of the film is Hong Chau's performance; she's one to look out for."
    },
    {
      "rating": "6",
      "text": "Disappointing, especially coming from Alexander Payne. I think it's the most unfocused film of his career and despite dealing with quite interesting topics, he never manages to make them resonant or flashy, therefore the film falls and only manages to stay on put because Matt Damon has enough charisma to avoid it, even on front his simple acting.And to waste Christoph Waltz that way only adds fuel to the fire."
    },
    {
      "rating": "4",
      "text": "What did I just watch. Downsizing looked so good, its trailer was great and the first 30 (give or take) minutes where genuinely really great. The premise was so unique and they could have gone so far with it. But, by about the 30/40 minute mark it completely loses all focus. Its like someone stood  in an office with a bunch of executives and pitched them the concept of Downsizing but actually hadn't written a story that could back it up. The film ultimately leaves you confused to wear its going to go next and in the end its really not satisfying."
    },
    {
      "rating": "5",
      "text": "Intensity. This movie has none. It needs some badly. Somewhere anywhere. Long slow paced mildly very mildly entertaining movie. Unfortunately mildly entertaining is very easy to find these days. If ever a movie was a 5 out of 10 this is it. You can probably do better."
    },
    {
      "rating": "6",
      "text": "Downsizing gives us the once-in-a-while size-changing theme and a very rare shrinking feeling to it but for the absolutely wrong reasons. That is much of a shame of what I just saw as the final film because I expected more to come out of this one hence the R rating. It makes everyone's promises come true but then eventually forgets where to put them in the finalized film. I was expecting an actual unforgettable adventure like what I have been experiencing with my dreams lately with this movie's theme and feeling but instead what I just got is too much drama put onto the film. Whenever it comes to films like these, I don't think drama is the best genre to aim for since it'll just make the finalized film worse than the promised film I was expecting. How many years do we have to wait until we get another film that focuses on size change? I sure hope not any longer than four because I would be so disappointed if that was the case."
    },
    {
      "rating": "4",
      "text": "What a piece of crap. The first 50 minutes is decent. Matt Damon is an occupational therapist, who wants the good life. He's struggling with life and he's going through the hum drum of daily grind. There is no joy in this man's life, there are no smiles, just the world weariness of the unending grind. Downsizing, a process that allows people to get small and live a higher standard of life on the cheap. Throughout this process, is his passionless wife, a cutesy (but not pretty) plain jane, who abandoned him after he goes through the process. Now...this would be the perfect time and vehicle for the story to transition to a guy that only know mediocrity to find fun and passion in his life. A sex love story could have been introduced here with a happily ever after.NOPE. There is a divorce where a guy that had $150000 assets, which equals $12.5 million dollars in the \"little world\". After a divorce he works at a call center and loses his awesome mansion with a crappy apartment. I feel like their math is bad because even if he kept 10% of the money after his divorce he's still have over a million dollars, so what gives? This movie is slow and boring. I won't bore you because once it transitions to his life post divorce it slowed down to a crawl. In fact, it's so boring I can't even continue to review it. This piece of garbage isn't even worth putting any more effort into."
    },
    {
      "rating": "7",
      "text": "This movie is nothing like the trailer. The trailer makes you think it's a comedy and doesn't show anything about the Asian woman Matt Damon's character spends with after his wife Kristen Whig doesn't join him. It has its funny moments, but mostly in the first half. The second half is thought provoking about what is important about live. In the end, the answer is that what's important in life is different for everyone. But I knew that."
    },
    {
      "rating": "7",
      "text": "Downsizing is original. It isn't a sequel, remake/reboot, or comic book movie, which dominate these days. There's an interesting/humorous concept and the acting is solid. The subtle humor is great. Not sure why people wouldn't like Downsizing. Could be a result of the Marvel conquest of cinema. Unlike those movies, Downsizing has a soul."
    },
    {
      "rating": "10",
      "text": "An original movie with a quirky premise that really grew on me and took me on a thoroughly enjoyable ride. In a field of cookie-cutter, predictable movies Downsizing was refreshingly original."
    },
    {
      "rating": "10",
      "text": "I thought this movie was brilliant, a cult classic in the making. It uses a great sci-fi concept to mirror modern day society, offering a soberimg reflection on how easy social/political solutions are always bound to replicate old models, creating bigger problems. It reminded me of Terry Gilliam's Brazil and Joe Vs. The Volcano. Hong Chau gives a funny and endearing performance. This is really Alexander Payne's version of \"Make America Great Again\". Very underrated film."
    },
    {
      "rating": "7",
      "text": "“Downsizing” is a perfect example of why not to read critics before you go to see a movie. Go to a movie because you like the cast or the genre of what you saw in the trailers or, maybe, even word of mouth.Matt Damon’s last 2 movies bombed at the box office—“The Great Wall” deservedly, “Suburicon” not—but “Downsizing” is a good movie.I go to see any Matt Damon movie and, yes, he has made a few bad ones (Don’t see “The Great Wall”!) and, yes, the director Alexander Payne who also wrote the screenplay with Jim Taylor, doesn’t follow through on a few deep ideas but the premise is different, there are laughs, there are tears and just how they shrunk a 6 foot person to 5 inches and surrounded them with first the ‘tall world’ and then the ‘miniature’ world is in itself a reason to see the movie.While the main theme is human survival and why downsizing people will help with that there is also the problem of punishing dissidents by downsizing them and making them poor immigrants to wait on the new wealthy. Paul Safranek (Damon) is the married American everyman who is just gets by and becomes intrigued the more he hears about the Norwegian doctor, played by Rolf Lassgard, that his project of shrinking humans is successful plus he hears from others including some old friends that he didn’t know had gone through the project and has nothing but raves about it. When Paul learns what little money he has would be worth about $12 million in Leisureland where this new species of humans live in a perfect world.As Paul learns about this new world so do we and we follow him in his journey meeting his new friends two aging party guys, Christopher Waltz and Udo Kier, into booze, drugs, women playing and using them as if they were frat boys. One of the benefits of everything being small is made fun of with Kier owning a fully equipped yacht that he has Fedex’d where he goes to get there before him.We eventually meet Ngoc Lan, played by Hong Chau, while she cleans Waltz's apartment, right above Paul’s, who at one time was a famous Vietnam dissident, who now lives in a tenement world of various Third World people who are sick and ill-equipped to take care of themselves. Ngoc wears a prosthetic device, is direct taking no nonsense and spending her time before, during and after cleaning places taking care of others.Without giving away any spoilers Paul and Ngoc with her bossing him around and they eventually team up with Waltz and Kier going to Norway to hear about the next step in saving the world.While not getting too deep into the world situation but explaining enough plainly the journey Paul takes from being the normal guy then going through the shrinkage steps, which provides a few laughs, becoming adapted to being rich, taking a dead end job and a decision he has to make near the end is the arc of drama of the film.Matt Damon does an excellent job as Paul, Christopher Waltz and Udo Kier are a hoot as the two aging playboys but it is Hong Chau who steals the film and has a 4-5 minute bit using the ‘f’ word that, while funny also has a lot of feelings.There are cameos by Laura Dern, Margo Martindale, Neil Patrick Harris, Jason Sudeikis, Maribeth Monroe and James Van Der Beek among others while the aforementioned Rolf Lassgard along with Kristen Wiig offers strong support.“Downsizing” is the second film I have seen this week, the other being “The Greatest Showman”, that have been snubbed by the critics but which offer strong performances by the male lead, with the former also having an award worthy female lead, and is definitely worth seeing.Rated R for language, drug usage and frontal nudity."
    },
    {
      "rating": "9",
      "text": "I assumed Downsizing would be light entertainment to kill a couple of hours before meeting friends in the food court. Instead, it riveted my attention from the beginning.The silly premise of people, en masse, shrinking down to five inches is the vehicle for an existential work of art more akin to Camus' The Plague, or Kafka's The Metamorphosis, than 'Honey, I Shrank the Kids'. To reduce the human carbon footprint, a scientist discovers a way to shrink people down to five inches. Not only will small people consume less but their personal wealth will increase in inverse proportion to their new size as their tiny houses and other necessities of life will now cost pennies on the dollar. This increase in wealth is the marketing tool used to entice customers to downsize.   The movie opens at a scientific conference to announce the discovery of the transformational process. But the cutting-edge scientific tone soon shifts to a campy small town setting where the main character, Paul Safraneck, played by Matt Damon, is seen caring for his sick, aged mother. Both tone and settings kept ricocheting off in unexpected directions like marbles in a pinball machine. Worlds meld into worlds. A tunnel connects an idyllic small community to its dystopian counterpart of bleak carton-sized cement blocks of tiered units that house the poor and disenfranchized. Another tunnel is like the stuff of dreams, where the dreamer must choose to proceed one way or the other, forever sealing his fate depending on which way he goes. An Avatar-like forest filled with a lush extravagance of giant leaves and flowers seem magical from the perspective of people five inches tall. A scene of workplace banter among medical techs in a huge transformation plant seems mundane enough until a door opens and the giant head of a 'big' co-worker fills the doorway.   But rather than feeling disjointed, the constantly shifting tone and settings are more like the whorls and eddies in a swiftly flowing mountain stream, with Paul a leaf floating Zen-like atop the ever-changing current. Matt Damon's acting talent shines as Paul is repeatedly thrust into bewildering circumstances and meets them with an expression of pure receptivity, the receptivity usually seen in children who find themselves in a perplexing adult situation and stand, transfixed, soaking everything up like a sponge.  It's the receptivity to ever-changing circumstance and banishment of desires that's been timelessly advocated by Eastern mystics. I'd always assumed that by 'desire' these wisdom traditions meant desiring material things like cars and houses, or the more ephemeral desires of ambition and competition. But Paul not only has no interest in material wealth, which he shows by moving out of his tiny mansion into an apartment, neither does he have any 'What's in this for me?' or 'How do I get out of this mess?' personal agenda. He's neither self-pitying or rageful as his new small life goes unexpectedly wrong. He doesn't seem to desire anything - only to immerse himself in the flow of his new life, doing whatever is required of him in every shifting situation.   I never knew what the Zen virtue of egolessness looked like before. Now I do. It looks like Paul Safranek.   Paul has an unassuming presence. He runs like Forest Gump. His good nature is evident from the beginning when he rushes home from his job as an industrial occupational therapist to care for his sick mother. Only later do we learn the great sacrifice he made career-wise to move back home to care for her.   A number of highly creative scenes are memorable, like when Paul struggles to carry a beautiful normal sized rose as a gift to a neighbor. Or the eerily real dialogue when trapped in a car with a stranger, he's forced to make polite conversation immediately after receiving a devastating loss. Or the visually surreal ballet without music as hundreds of still anesthetized newly made small people are adeptly scooped up onto spatulas and placed in carts for transport by giant techs with all the precision and repetitive motion of workers on an assembly line. A wordless backward glance at an old man in a wheelchair chomping down on a cold piece of chicken says everything necessary about who Paul is, and what motivates him.   The only reason I didn't give Downsizing a 10 is because I found the role of Tran played by Hong Chou just a bit too abrasive.   As the movie neared the end, something made me look away from the screen and around the darkened theatre. It was something odd I sensed. Only about a dozen other people were there with me. But there was no crinkling of candy wrappers, no shifting in seats. There was an atmosphere of deep silence, a collective of mental energy inwardly focused, like in a church where only a handful of people are sitting or kneeling, intent only on their prayers. Not surprising, since Downsizing is ultimately a deeply spiritual movie."
    },
    {
      "rating": "5",
      "text": "“Downsizing” was directed by Alexander Payne who, with Jim Taylor, wrote the story and screenplay. The film stars Matt Damon, Christoph Waltz, Kristen Wiig and Hong Chau. I went to this film expecting to see an elaboration of a very tempting trailer but, unfortunately, the best part of the film was, in fact, all in the trailer itself. What starts out with a very intriguing concept, i.e. shrinking human beings to a height of 5 inches with a proportionate environment around them, loses itself in the first 30 minutes and travels in a number of different directions, most of which involve the writer’s political statements about climate change and the harm humans are doing to the planet. Also, to add another negative to the film is the role played by Thailand actress Hong Chau and what has to be the worst attempt ever made at imitating a Vietnamese émigré. Simply stated, she ruins each scene in which she appears with this ‘chalk on a blackboard” dialogue. Couple all of this with plot changes and ideas that make no sense and you have a disappointing and uncomfortable 135 minutes. I give the film a rating of 6.02 because of what it started out to be, and could have been, but unfortunately went downhill in mid reel. In summary, all of Mr. Payne’s efforts as director and co-writer of this film came up short (pun intended)."
    },
    {
      "rating": "1",
      "text": "Malísima esperaba encortar una película bien organizada de fantasía y esta llena de incoherencias y fallos en la escala de los objetos del mundo mini al normal"
    },
    {
      "rating": "10",
      "text": "The movie is proper entertainment. While it touches on some important topics such as environmental issues and overpopulation they are not the main theme. Actually, the main theme is hard to describe as it seems to change a few times but that doesn't ruin the movie at all.I feel like people get some expectations based on the trailer and get them shattered during the movie, hence the low rating so far. I expected nothing more than good acting when I saw the cast and was not disappointed at all."
    },
    {
      "rating": "0",
      "text": "Ethan's Review: Let me just start off by saying this is possibly the worst movie I have ever seen, the other movie that comes close to this movie by being the worst is \"Mother\", and that's saying something. The premise is what got me, along with Matt Damon. Who doesn't like Matt Damon? My friend Sequoyah after this movie (who will be typing his review after mine. Let's just say the only part of the movie I enjoyed was the Vietnamese character, only because of the racist stereotype that they show in this movie. To conclude, just don't watch this film. Don't even rent on redbox. Sequoyah's Review:If i could change history and choose between stopping 9/11 or stopping Matt Damon from acting in this movie, I would pick the latter in a heartbeat. This movie is like having pins shoved into my urethra and then someone poured lemonade on it, with nice salt and a garlic to finish it off. The only good thing about this movie is the philosophical question asked by the Vietnamese lady \"What kinda **** you give me?\", I spent 12.00 dollars on this... To sum it all up, this movie was terrible. Do not watch it."
    },
    {
      "rating": "10",
      "text": "I saw Downsizing last night and immediately after I would have given it a 6, but after letting it sink in, the film really resonated with me.  At this point I will give it a 10.  I'm going to make this a spoiler free review, in the hope that some people will see it based on my experience.  The film speaks to issues of global warming and who we should be spending our life with knowing that we're destroying our environment and possibly destroying ourselves as a species.  I really feel like I now have a better understanding of how I want to live my life in the face of climate change.  It also feels like a feature film version of a Black Mirror episode.  I love Black Mirror, so if you're a fan of that show you'll probably have a great time watching Downsizing."
    },
    {
      "rating": "7",
      "text": "To be honest, I was waiting for this movie for such a long time. The trailer itself suggested it's gonna be something very different. Among all the other tiny people movies we have watched so far such as Gulliver's Travel which focuses on comedy but Downsizing focuses on the feelings and emotions. If you liked the trailer definitely you gonna love the movie as well."
    },
    {
      "rating": "10",
      "text": "sound interesting ,  can't wait to see it. sci-fi movie my thing, but Matt in this kind of genre ... i don,t see you shining here son. you're better of with action"
    },
    {
      "rating": "4",
      "text": "Downsizing is a film with a very intriguing idea with promising world building, but ultimately fails to capitalize on its own concept and instead opts for a poorly executed political message that conflicts with its subject matter.I will say the first act of the movie does a great job of setting up its world building by having its dialogue grounded in its sci-fi premise of humanity able to shrink down to a few inches to create a whole new society where they only need a fraction of the resources they would consume as normal sized beings and effectively live a life of wealth. Unfortunately once the 2nd act, its entire premise becomes completely trivial, to the point where its Sci-Fi premise is practically meaningless. And it also doesn't help that the story we have now is driven by a main character who is completely bland and uninteresting, not to mention that he seemingly fails to make any meaningful decisions for himself until the very end to run back for a cheesy romance subplot that lacks any chemistry."
    }
  ],
  "recommendations": [
    "colossal",
    "chaos_walking",
    "the_adjustment_bureau",
    "limitless",
    "vivarium",
    "nerve",
    "the_lobster",
    "greenland",
    "what_happened_to_monday",
    "elysium",
    "contagion",
    "children_of_men",
    "lucy",
    "in_time",
    "eo",
    "the_hunger_games_mockingjay_part_1",
    "code_8",
    "predestination",
    "the_american",
    "the_butterfly_effect",
    "interstellar",
    "repo_men",
    "babel",
    "the_wolf_of_wall_street",
    "fifty_shades_darker"
  ]
}