{
  "id": 4330,
  "title": "Downton Abbey",
  "starring": [
    "Hugh Bonneville",
    "Laura Carmichael"
  ],
  "runtime": 122,
  "genre": [
    "Drama",
    "Romance",
    "History"
  ],
  "description": "The beloved Crawleys and their intrepid staff prepare for the most important moment of their lives. A royal visit from the King and Queen of England will unleash scandal, romance and intrigue that will leave the future of Downton hanging in the balance.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pWt1iRuhNpeVDNP2QiUT2C5OiBt.jpg",
  "categories": {
    "plot": 7.016129032258065,
    "acting": 6.703703703703703,
    "ending": 6.818181818181818,
    "soundtrack": 6.666666666666667,
    "cinematography": 7.0,
    "familyFriendly": 7.285714285714286,
    "funny": 8.166666666666666,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "As a big fan of \"Downton Abbey\", I expected to like this movie and did.  The characters are all so familiar and so well-written it felt like I was returning to my old neighborhood where friends and acquaintances abounded, and we picked up right where we left off. Nevertheless, the way the movie was written and directed, I do believe it stands on its own merits for anyone unfamiliar with the series.  Might even pique their interest in some of the back stories.There were times when the plot dragged a little and slowed, but that can happen in any movie, and it happened with the TV program at times as well.  Or perhaps the story's exposition seemed to unfold slowly because of our society's penchant for immediate responses, constant updates and instant gratification.  Story-telling by its very nature sometimes requires more time and attention than a text or email.The cast were all in fine form.  Maggie Smith had more delicious bon mots than usual.  With Penelope Wilton in equally good form, the repartee between the two was as delight as ever.  Michelle Dockery as Lady Mary is a standout and more than up to the task of what may be expected from her in future movies.  True, there were a good number of subplots but I enjoyed them all.  After all, everyone's real life has multiple subplots...ones of which we are aware and ones of which we are not.  The difference is that in the movie, we are aware of them all and Julian does a masterful job at tying them together.  These include Branson (with Allen Leech looking trimmer which becomes him) involved in a couple of subplots and Rob James-Collier's Barrow being humanized more, helping us to understand him better. Oddly enough, my biggest complaint was the larger budget.  I know this was the King and Queen of England visiting and the money was well spent, but for me it detracted from the story-telling.  This is such a well-written and developed plot, it did not need the excess.Must end this review on a positive note.  Although there were no \"cliffhangers\" (I detest those), there were a number of plot developments which set the stage quite neatly for future productions and I am looking forward to the next movie.  Well done Julian, and to all the cast and crew.  You've done another masterful job in bringing to life a bygone era while making the characters seem real and as fresh as if it all happened yesterday."
    },
    {
      "rating": "10",
      "text": "Absolutely splendid movie. Saw it in a packed theater on a Tuesday night. If you love the show, you'll love the movie. I know I did! Bravo, Julian Fellowes for a great script and for his wonderful cast vividly bringing his wonderful words to life."
    },
    {
      "rating": "1",
      "text": "the question, \"What were they thinking?\" can be answered easily: \"They weren't\". This is a waste of time, talent and viewers' time. Julian Fellowes, writer of this, the tv series from which this comes, and \"Gosford Park\", another, and far superior, insight into class, power and an anachronistic society long past its sell-by date.This film plods when it doesn't evaporate before your eyes.The characters' preoccupations help to clarify why this world vanished."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)A quite cloying sociologism, very James Ivory style, more unctuous than sumptuous but not worse than \"Parasite\"."
    },
    {
      "rating": "3",
      "text": "Watching this movie reminded me of a 20-year high school reunion. If you had seen the TV show, it was like meeting your old high school friends, talking for a few minutes, catching up, and then ready to move on. If you had never seen the show, it was like the spouse of the person who went to the high school. You didn't know anyone and nothing happened that made you ever want to know anyone. You just wanted to leave."
    },
    {
      "rating": "7",
      "text": "There were two kind of people in the audience: those who have seen every, or almost every, 52 episodes of \"Downton Abbey\" and those who never saw it or, like me, only saw, maybe 3-4 episodes, over the 6 seasons it was on PBS.You could tell people from the first category as they laughed at EVERYTHING Maggie Smith said, and did, funny or not, while those in the latter category might have smiled at one of her barbed witticisms but certainly didn't laugh out loud.This is a review looking at it as a stand alone movie while those who see it as an extension of the series most definitely would review it differently.The screenplay by Julian Fellowes introduces between 30-40 characters with about as many story lines involving 2 or 10 of them. Anyone who is a movie goer can see where most of them are heading but a couple fail to pay off and a couple just fizzle out while a major one had me going, \"So what's new? Knew that from the moment they came on screen!\"The opening segment sets the direction of all the  lush photographic scenes and rich looks, in more ways than one, of the costumes, jewelry, and the settings both in and out of Downton Abbey.The story revolves around the visit of King George V (Simon Jones) and Queen Mary (Geraldine James) who will be spending an evening at Downton Abbey, bringing their own staff of kitchen and servants which brings about a rebellion between the Royal's and Abbey's staffs offering about 5-6 story lines while there are many, some confusing, story lines regarding family members in all sorts of matches from mother and daughter to sister-in-laws.There are too many actors/characters to mention all but, yes, Maggie Smith is a delight and the encounters between her and Imelda Staunton are master classes in acting. I have been a fan of Elizabeth McGovern since I saw her in 1981 in \"Ragtime\" but I have a feeling her role in the TV series was larger and stronger. I recognized a few actors such as Jim Carter but the one who really made an impression, and getting the biggest laugh, is one I am unable to put a name with the face even looking through the cast credits--possibly Brendon Coyle--playing one of the major Abbey servant's.While \"Downton Abbey\" is a good example of the genre it is not as memorable as \"Howards End\" or, my favorite, \"A Room With A View\".  While the outdoor scenes are lush this sequel would have done better as a 'made for TV movie'.Am curious to hear from fans of the TV series as to what they thought of the movie."
    },
    {
      "rating": "10",
      "text": "It was wonderful! I want more. I'll see it at least 3 more times. Thank you for bringing this beautiful story back."
    },
    {
      "rating": "4",
      "text": "If you're a big Downton Abbey fan looking for Downton Abbey fan service, you'll probably like this movie.  (I've watched every episode of the TV series, and thought it was so-so.)  The biggest problem I had with the movie is that they try and cram waaayyyy too many subplots into it to the point of confusion, a decision which turns the movie into a series of random events, some of which are kind of pointless.  The second is that they flattened out all the characters.  The tension between characters that existed on the TV show has all but disappeared, and the tension between the classes has largely disappeared.  People's character flaws are also largely removed.  As a result, much of the drama is diminished.  Like I said, if you love Downton Abbey, you'll probably enjoy this movie.  But, if you're expecting a bigger, better cinematic version of Downton Abbey instead of a tamer two-hour long TV episode that mostly ties up a lot of loose ends, you're expecting too much."
    },
    {
      "rating": "8",
      "text": "“Downton Abbey” is the long awaited feature film version of the six season television series that was previously shown on PBS and, like its creator, was also written by Julian Fellows,The film was directed by Michael Engler and stars all of the usual suspects including Elizabeth Mc/Govern, Hugh Bonneville, Maggie Smith and Michelle Dockery. It is difficult to write a review of a film where this viewer, at least, has seen all prior television episodes. As a result, its  feature length counterpart  appears  to be more like another but longer episode of its parent television series.For those few unfamiliar with the series and its characters, I would assume that for them there is a problem in not understanding the true nature and history of the characters that past viewers had a chance to learn, absorb and understand over 6 years of television watching. To that extent those “uneducated”  viewers will be seeing an interesting and well acted film presentation with extremely high production values in a well written format..For those experienced veterans of the series, it will be like “old home week” seeing the beloved and respected group of noble persons and their staff as they encounter diverse and interesting plots and plot twists where the viewer is involved until the very end of the theatrical experience. The latter type of viewer, most of whom were in the audience in which I saw the film, acted much like a group of dedicated  groupies  at a music concert where the performers could do no wrong regardless of the performance.Factoring all of the above I give the film a rating of 8 because, when all is said and done, it is an enjoyable film to watch and despite its 2 hour and 15 minute length, the only watch you will look at is the one held in the hand of Lord Crawley as he awaits the call for dinner."
    },
    {
      "rating": "5",
      "text": "When a television series makes its transition from the small screen to the large screen, it needs to provide newcomers with enough back story to make the film understandable. Unfortunately, that's not the case with the movie version of the popular PBS series \"Downton Abbey.\" Having not seen the broadcast version, I came in cold and left the theater feeling the same way, but for very different reasons. The picture tries to cram far too much material into its runtime, including what are obviously many hanging story threads, as well as a new major one created just for the film. The result is a hurriedly executed story that's at times difficult to follow without the back story, mixed in with some plot devices that are just downright silly, almost juvenile, in nature. Despite the film's impeccable production values and its fine performances by Maggie Smith, Penelope Wilton and Imelda Staunton, it has little else to offer to viewers, except those who are for diehard fans, who are likely to love it, regardless of its many regrettable shortcomings. If you're unfamiliar with the material of this franchise, skip it; you'll save yourself boatloads of frustration, boredom and incredulity."
    },
    {
      "rating": "8",
      "text": "I have never seen the PBS Series but it has lasted a long time for a reason, people like it. I can count on one hand how many times an audience has clapped at the end of the showing of a movie recently, my audience did.  So if you are thinking about going and have never seen the series, I would say go for it.  It is full of fun if you just sit back and wonder what it was like to live like this 100 years ago.  That kind of escapism is what movies are all about.  If you think in those terms - you will go away happy."
    },
    {
      "rating": "10",
      "text": "I will not spoil it for everyone, but best 2 hours of fabulous characters, beautiful costumes, wonderful estates, best watching since show’s final episode. I laughed, I cried, meet King George V and Queen Mary! Who, as we all know is Queen Elizabeth II’s grandfather. Her uncle David was the King who abdicated his throne, her father became George VI. Her mother was Queen Elizabeth also but was Queen consort, not Queen Elizabeth II, monarch. Oh, enough I say. But movie was so, so, good. Tied up all of the things that I wondered about for the future of the Wonderful Crawley family! I am crossing fingers and toes for a Christmas at the Abbey! Sometime in a few years."
    },
    {
      "rating": "8",
      "text": "Fans of the TV series will swoon over the sumptuous big screen spectacle featuring the lovely estate and the equally luxurious costumes. The flurry of activity revolves around the preparation and visit of the King and Queen. The whole upstairs/downstairs gang has returned and almost every one of them gets a subplot that neatly ties up their story (almost a bit too tidy for my taste). The dialogue is typically crisp and the scenes are characteristically brief…keeping the pacing up and the complexity down. Without backstory explanations, Downton \"virgins\" are liable to be confused about the relationships , but they'll still be able to enjoy this elegant period excursion."
    },
    {
      "rating": "2",
      "text": "The ladies had marvelous hats. The men I couldn't tell apart. Really looked forward to this as a witty, intriguing parlor drama & was bored to tears. No bodice ripping, no (well, very little) comic relief, no wonderful storylines. Just people milling around an old manse & repeating tired old themes, just not very well. A wasted opportunity. Why wasn't the bad Irish guy invited into the household - that'd be good tension, he could have flirted with the women (& men), charmed everyone & been a snake in their midst spying. The gay story was too long & preachy. The \"maid\" story, ho-hum. And when Maggie Smith makes her big revelation, it was like, duh, are you really? What a shock. The boiler guy could have been randier. The \"abused wife\" -- what was the point of that dud? Same with the pregnant one. Just terrible & tedious. I thought it'd never end & it basically didn't have an ending. Even the soundtrack was uninspired. Just bad."
    },
    {
      "rating": "8",
      "text": "Sure this film is really more about tying up loose ends than actually developing a solid plot, but it's well shot and fun all the same. Of course Dame Maggie Smith steals every scene she is in."
    },
    {
      "rating": "0",
      "text": "Portrays open homosexuality and portrays the royal family with degraded values. It’s more of an lbgt propaganda piece. The writing is poor and it’s just not interesting like the series was."
    },
    {
      "rating": "8",
      "text": "The Downton Abbey film is a pleasure for fans, and an enjoyable film for some who hasn't been able to watch the tv show. It is not a perfect film, there are some characters that have nothing to do and are just there because they were in the tv show, some plots that were kind of unnecessary, but in the end, Downton is very entertaining, charming and funny enough to preserve the status that had when the show ended."
    },
    {
      "rating": "9",
      "text": "The effort to avoid looking like a long chapter for television is remarkable and appreciated. It's needless check out all the 6 long featured seasons for understanding the script that catches the full essence, including the soft, witty touches of humor."
    },
    {
      "rating": "10",
      "text": "A good job, which honors the original series.After an excellent TV series, Downton Abbey finally arrives at the cinema, after much insistence from the fans. The film maintains a lot of the series and resembles an extended episode. So, I'm not going to go into too much, I think the criticism I made for the series is perfectly suited for this film.The film takes up the story where the series ended in the late Twenties and revolves around a visit by the Royal Family to the Yorkshire region, where they will sleep and have a big dinner at the Crawley family mansion. For them, it is undoubtedly a moment of great anxiety and prestige, but for their usual servants, it will certainly be a headache and involve immense work, which everyone is happy to accept given the prospect of being able, in fact, serve the kings of your country. But as the Royal Family travels with a vast entourage of servers, the task will not be easy.The cast that marked the series is back, both in the salons and on the service floors. I will excuse myself to nominate the actors, but I believe that they are excellent and deserve all the recognition that they had with this work of perfect historical recreation. Yes, because if there is one thing that is notorious in this film, as well as in the series, it is the care and attention to details and in the reconstruction of the time and the environments that were portrayed. Of course, the use of good filming locations helped to make the series (and the film) more realistic and authentic, and there is no doubt that Highclere Castle, the house used to bring Downton Abbey to life and, in real life, belongs to the Lord Carnarvon, you are perfect for that.In addition to the excellent sets and costumes, the film has excellent production values: a very competent photograph with pleasant colors, a remarkable soundtrack imported from the original series, a good job of filming and editing.The script, in addition to a good story, adds some developments to the personal history of the characters we've been following since 1912: this was probably the farewell to Countess Violet, played by Maggie Smith, as well as Carson, the immortal butler who, for the last time, return to activity; Tom Branson looks ready for a new page in his life; Tom Barrow, for his part, is finally a pleasant character and worthy of our sympathy, after an entire series in which he was a villain and made a long journey of atonement. I will not say more, it is best to see the film. Worth it.Is this the farewell to Downton Abbey? After several seasons on TV, in one of the most addictive and elegant television programs of the decade, and a film full of quality that, certainly, pleased the diehard fans of the series, it is difficult to say. I personally would like to see more, but only if the quality of what comes to match the material already made. I wouldn't want to see Downton Abbey drag on and lose quality just because of fan pressure or industrial interests. There is a correct time to end. But only the future will tell if the Crawley mansion doors will open again for us."
    },
    {
      "rating": "7",
      "text": "The return of \"Downton Abbey\", finally!. The carachters are so interesting because of the fantastic interpetation of the cast. But this film wrong about the relation with the series.. it is a Big Episode; good the writing and the good the music... oh, fantastic the soundtrack! The best track, \"a royal command\" it is a masterpiece. Long life to Downton Abbey! Valutation: 7"
    },
    {
      "rating": "7",
      "text": "Be forewarned:  I’m one of the few people on the planet who did not watch a single episode of the “Downton Abbey” TV series (2010-2015) before deciding to attend the movie.  My first clue that this film might involve a kerfuffle was the opening ten minutes of exposition, where two of the actors narrated clips introducing all the major characters and their backstories.  My primary reaction was amazement at the breathless implausibility of it all.  My secondary reaction was incredulity at the number of storylines being maintained simultaneously.  In fairness, by this point, most of my fellow moviegoers, who had presumably followed the TV series, were nearly orgasmic with delight.As the movie trailer makes clear, the central storyline is that the lord of the manor receives a letter announcing the impending arrival of HRH King George V and Queen Mary for a parade through the town, dinner, dancing and an overnight stay. Mayhem ensues – apparently, the new butler in charge of the staff has been negligent in shining the silver.  I was aflutter worrying about what future events of equal consequence might occur.For the first half of the film, I was completely confused.  Apparently, aristocratic white men in wide-lapelled suits and broad-brimmed fedoras all look pretty much the same.However, by the second hour, I’d decided that “Downton Abbey” is an entertaining diversion, even for the uninitiated.  No big points are made, there’s no major social commentary (except a glancing blow regarding the plight of gays in the late 1920s).  The only “subtle” point is Writer Julian Fellowes’ support for the monarchy – if his adoration for the monarchy were a gymnast, it would fly off the balance beam, do three flips and two twists in the air, stick the landing and raise the King’s scepter in triumph.  In my recollection, there were no actors of color anywhere to be seen.Even so, this film won me over.  It’s as fluffy as finely-whisked meringue, but kind-hearted and quite sweet-spirited throughout.  While the dizzyingly intersecting storylines make “The Young and the Restless” seem straightforward by comparison, it’s all done with a charming earnest sincerity.  With a running time of two hours, “Downton Abbey” has the time to bring all these stories in for a landing.  There are chaste kisses, lingering looks, nods of understated satisfaction and lots and lots of stiff upper lips."
    },
    {
      "rating": "6",
      "text": "Downton Abbey is not without its flaws, and even ardent fans will likely have things they wished were handled differently. If they don’t end up making another film or series in ten or so years depicting the next generation of Crawleys on the eve of World War II, everyone is bound to be disappointed. But on the whole, this is a respectable, largely satisfying resolution to a show that charmed audiences for years."
    },
    {
      "rating": "6",
      "text": "I forgot how delightful it is to dive into a television show nine years too late and have absolutely no idea of anyone’s name. The last time I did this was watching Serenity with my dad without having any knowledge of the Firefly series and I remember loving how novel it felt to not have the set up to a sequel for a sci-fi film. This movie doesn’t give a **** if you know who anyone is, and it’s not about to explain **** so you spend most of the first twenty minutes playing detective to figure out who’s new and essential and who’s an artifice of the film’s storyline.Downton Abbey the show seems like it required like 18 characters for the plot to move, because there are actually two casts, the nobles and the staff. In Downton Abbey the movie, we need like 30 characters so that everyone has a rival, so to some extent it feels like a very, very fancy hall of mirrors.The best, most exciting plot (twist) is the one that the story spends the least amount of time on (the Irish guy’s allegiance)–Wife says. Most of the husband characters are pretty incidental, some of them don’t even bother showing up until the final scene of the film. I’m not sure if that’s how the show also dealt with having a cast that was bursting at the scenes, if they just spent most of their time off stage until the final showstopper or if there was legitimately too much plot to cover. None of the food looks appetizing. Because there are so many plates to keep spinning at any given time, there’s not really much time to devote to any single story before you have to toggle back to the wait staff or to the butler’s side quest. But I actually think that made for some interesting self-imposed storytelling limitations, because it necessitates a lot of these large ballroom scenes where the sound shifts in and out of different dinner party conversations in a single shot, or the transferring of the plot baton from one character to another through a single shot in the style of Birdman.SNL did a lovely job of cutting the movie to the quick by preying on its low stakes. Essentially the waitstaff’s conflict is that they have three days off but they want to work, which comes off as a little “dewy-eyed” (Wife’s term for their relationship with the system of landed aristocracy). For the noble family, there’s some shenanigans with a faraway manor that’s not entirely connected to Downton at all that seems only tangentially related to the aspirations of any of the children, but “gives Maggie Smith something to do,” as Wife put it. Maggie Smith, by the way, is the OG of this movie, except her ending is unnecessarily schmaltzy. If you’re looking for another movie where old people embrace being old but not being dead, maybe try Ian McKellan’s surprisingly awesome update to the Sherlock Holmes’s stories:Wife was meh on the movie after having followed the series for years and dragging me to it, but I was enamored. Maybe worth it if you are going in cold rather than if you have any “advantage or disadvantage of prior acquaintance,” as Tennessee Williams put it."
    },
    {
      "rating": "10",
      "text": "Very entertaining! Loved the characters and their various stories. I'd love to see a who done it story of murder in the castle. That should be very intense and intriguing!"
    },
    {
      "rating": "7",
      "text": "Listen i want it noted that Thomas Barrow’s plot is a 10 however I’m not allowed to rate only that and they made me sit through loads of het drama so, had to bring it down a bit x"
    },
    {
      "rating": "8",
      "text": "A Royal Visit to Downton AbbeyThe Stream: Better if you have some knowledge of the series, but enjoyable nonetheless.The Big Screen: The majesty and opulence of Downton Abbey in all its glory and that iconic theme gets stuck in your head.The Final Bill: A must-see for Downton Abbey fans, and not a bad couple hours for the general audience.Welcome back to Stream to Big Screen!  This week we bring to you a review of the popular PBS miniseries turned drama series brought to the big screen, Downton Abbey!It’s 1927, and Downton Abbey is still up and running. Not much seems to have changed since we last saw the Crawleys on the small screen. Lady Mary and, brother-in-law, Tom Branson are still running the business of the Abbey. Lady Edith is happily married although the life as Marchioness of Hexham is not as fulfilling as she had hoped. Robert and Cora continue blissful married life. The Dowager Countess is as quippy as ever. And, the staff keep the whole thing chugging along.After the series ended three years ago, other than pure fan service, the occasion that brings us back to Downton is that the King and Queen are coming to the Abbey for a royal luncheon, a parade and a dinner. It sends everyone in a tizzy, both upstairs and downstairs. It really just becomes pure fun to see the preparation for a royal visit – the food, the wardrobe changes, the pomp and circumstance. Beyond that, this cast of characters trading barbs and knowing glances is just what the Downton fan ordered. Each character gets his or her moment to shine. Maggie Smith is always a standout here. Julian Fellowes’ script is laced with one-liners and tender touches that are expected of the best Downton Abbey episode.There are a couple subplots to fill out the story that do not amount to much, but are fine diversions. Everything seems to work out in the end. Time goes by, but ultimately, it seems that Downton Abbey will endure.For the Downton fans, it is absolutely worth it to see in the theater. The sets and costumes never looked as good as they do on the big screen. Just being back at the dinner table amidst the back and forth of the Dowager Countess and Lady Isobel is enough for a 2 hour stay. The theme of Downton comes on and you’re just swept away. For those who did not watch the series, it is still a good movie. It is funny and light. The film is well-paced and beautiful to look at. The only slight hesitation is whether history of the characters is necessary for enjoyable viewing, but it’s good enough that without any foreknowledge of the history of the family someone willing to see Downton will enjoy it."
    }
  ]
}