{
  "id": 53,
  "title": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
  "starring": [
    "Peter Sellers",
    "George C. Scott"
  ],
  "runtime": 95,
  "genre": [
    "Drama",
    "Comedy",
    "War"
  ],
  "description": "After the insane General Jack D. Ripper initiates a nuclear strike on the Soviet Union, a war room full of politicians, generals and a Russian diplomat all frantically try to stop the nuclear strike.",
  "releaseYear": "1964",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7SixLzxcqezkZEYU8pcHZgbkmjp.jpg",
  "categories": {
    "plot": 8.4,
    "acting": 9.357142857142858,
    "ending": 7.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 8.0,
    "funny": 8.633333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A brilliant black comedy, one of the best ever. The performances are sublime, especially George C. Scott. The direction is so on target. The writing is among the best ever. Superb in every way."
    },
    {
      "rating": "10",
      "text": "Peter Sellers gave a great performance in all the roles he played in this movie, but George C. Scott stole the show. This movie is a great glimpse into the paranoia of the Cold War. It is an example of how powerful a comedy can be If done right."
    },
    {
      "rating": "10",
      "text": "A satirical masterpiece."
    },
    {
      "rating": "10",
      "text": "Being only fourteen years old, most of my friends found the movie dull. I, however, found the movie to be the greatest comedy I have ever seen, easily surpassing other critically-aclaimed works of other genres (cough... the Godfather). It makes a statement about the workings of our government which is as true now as it was in their time. (Truer? Bush.) The wit is still sharp, and the movie feels much less lethargic than other slow-moving classics (cough... the Godfather). You must see it."
    },
    {
      "rating": "10",
      "text": "The greatest movie ever made. Sorry Godfather & Citizen Kane, that's just the way it has to be."
    },
    {
      "rating": "9",
      "text": "A Hollywood classic, Kubrick is a movie mastermind there is so many redeeming qualities in this movie. The acting was above par and There is no other movie out there that takes itself so serious but not so serious at the same time, there is a lot of comedic values in here strung over a very serious plot, It's hard to tell exactly what it is. This movie will have you in awe one second and you will laugh the next. I have never seen anything like it and I doubt I ever will again. One of my favorite movies of all time."
    },
    {
      "rating": "10",
      "text": "Greatest satirical comedy film ever made, as well as the funniest death scene. **** Metacritic's outrageous rule of a minimum 150 characters.\r Kubrick is the ****"
    },
    {
      "rating": "10",
      "text": "It's not just one of Kubrick's best, it's one of the greatest comedies ever made. Black Comedy about Cold War Paranoia? Oh Come on. What else could you wan't from a film?"
    },
    {
      "rating": "10",
      "text": "Stanley Kurbrick's brillant satire on the cold war is widely considered one of the funniest movies in cinematic history. A lone general gone mad gives the green light launching an A-Bomb attack on Russia, and the President now (Sellers) must pull out all the stops to prevent this. This dark comedy is shot entirely in black and white with terrific production design. Astutely, Kubrick focuses on the actual nuclear event in itself, thus removing the issues of foreign politics. The films message simply put its this; man is not at the mercey of machines,but it in fact it's just the opposite. Petter Sellers is sensational playing several roles and the film has stood the test of time remaining undated."
    },
    {
      "rating": "10",
      "text": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb is just the best black comedy I've seen. One of Stanley Kubrick's best movies. After watching it, you begin to regret that after this film Kubrick went to make films on serious topics. Beautiful adaptation of the Cold War. A great comedy that makes fun of the meaninglessness of the confrontation of 2 superpowers. The film was shot more than 50 years ago, and is still relevant."
    },
    {
      "rating": "10",
      "text": "Stanley Kubrick is a genius. The film is excellent, the best, beautiful. Acts like the movie \"Full Metal Jacket\". One actor played three characters at once! Astonishing! The first time I didn't even notice. For the third day I have been watching a movie non-stop. He's perfect. Dr. Strangelove is the best character. \"Mein Führer, I can walk!\" One of my favorite films. David Lynch's hair dandruff madness. I would say 1/4 of that episode of the third season of Twin Peaks, where all the timing was showing special effects. But quite insane. Stanley Kubrick is a genius. He is a genius. Genius. I'm telling you. Vladimir Vladimirovich Putin President of the Russian Federation. I'm a dirty communist. I drink vodka, We communists don't drink water. And the water that you drink is poisoned by us. Do you understand? This is genius. And I am glad that I am very pleased to read. It is very good that I am a pleasure to read. And I am pleased to read you. This is genius."
    },
    {
      "rating": "10",
      "text": "Feels like 2 movies in 1, the segments on the plane and in the air force base are largely solemn and serious, the War room however is comical and insane. But this works well as it conveys what the film is about, the lunacy of politicians and the effects of beaurocracy. Dr Strangelove himself only appears in the latter half of the film but god does Peter Sellers do a good job! In all 3 of his roles. It's a pity everyone knows the ending though because it's been done to death in popular culture (Along with the famous line \"Mein Fuhrer! I can walk!\" one of the funniest in history. However I will say the 5 minutes before the famous segment with major Kong is i think one of the best 5 minutes in cinematic history, especially with the countdown, of sorts. It is truly one of the most tense few minutes I've ever seen and the acting is brilliant! The look on their faces as they approach the target in almost too real. It deserves all of the praise it gets without doubt! Peter Sellers, you are one of the greats! Along of course with Kubrick"
    },
    {
      "rating": "10",
      "text": "A film that is a true masterpiece. It has it all; comedy,suspense and a well told story. The film truly shows how silly people in goverment can be. Not trying to say this is what actually happened during the cold war although I do have a suspicion. Overall an unbelievable film which could never be created today because of people's longing of a happy ending."
    },
    {
      "rating": "4",
      "text": "I honestly don't get why this movie is being hyped so much. I watched it because everyone seems to be so positive about it, but this movie was so boring that I wanted to put it off halfways. It's absolutely NOT funny, or maybe I just don't have any humor...or maybe you're all jumping on the bandwagon. I know that there are a lot of Kubrick fans out there who love everything that he has made, just because he made it! If it had been made by somebody else everyone would have disliked this movie!"
    },
    {
      "rating": "5",
      "text": "What an over rated movie! I give it a 5 only because I love most of Kubrick's work. If you want the real deal, without the comedy, catch Sydney Lumet's Fail Safe."
    },
    {
      "rating": "1",
      "text": "One of the most overrated movies of all time. I think I chuckled or smiled once or twice. Mostly I was trying not to fall asleep."
    },
    {
      "rating": "1",
      "text": "Anyone who has given this a 10 must have no taste at all, or are followers to the point of being lemmings. I own this movie, and I have never made it all the way through because it is sooooooooo boring. Now now, before you go ape, I do enjoy most classic movies; but in the case of this pile, where is this \"black comedy\" everyone refers to? There is not a single funny moment in this movie. Who are you people that think this is laughable at any point? The funniest thing to me is how much people force themselves to love Kubrick. His movies are self important slop. Let the stones fly!"
    },
    {
      "rating": "2",
      "text": "This was the most disturbing movie, I have ever seen. The ending was quickly done, while some comedic elements existed, nothing to keep the movie going."
    },
    {
      "rating": "7",
      "text": "I was too confused to really like it. it didn't make sense, maybe it would to ppl who knew about the war and all that stuff back then, but i don't. i admired it alot though, and there was some very good genius moments of comedy. but like i said, maybe it would have been better and funnier to me if i knew what was so ironic, and the satirycal. its one of those films you just gotta see for yourself."
    },
    {
      "rating": "6",
      "text": "Dosen't deserve it's reputation."
    },
    {
      "rating": "7",
      "text": "Stanley Kubrick's black comedy about cold war paranoia.Peter Sellars is outstanding (I'm not a big fan) although mainly for President Muffley & Cpt Mandrake rather than Strangelove himself.The rest of the cast ham it up quite well but didn't think it was as funny as a lot of people make out."
    },
    {
      "rating": "7",
      "text": "Bottom Line: Kubrickâ"
    },
    {
      "rating": "6",
      "text": "Taking a look back at some of Kubrick's earlier looks I noticed that I didn't love this movie. I really wanted to love this movie, but it did kind of disappointed me. Here's the thing, the movie looks great on a technical level, Peter Sellars and George C. Scott are great in the movie, some of the war scenes looked really amazing, and it's funny at parts. However, I wasn't interested the rest of the characters aside from Sellars multiple performances and Scott's performance. I wasn't that too invested in the story until about halfway through. And there were parts that I simply did not laugh at. The movie, to me, only felt like it was suppose to be a comedy at parts. The rest felt to me that it was suppose to be drama. I guess the structure didn't feel like a true comedy to me. But like I said, the second half is what ultimately drew me into the story. I know lots of people love this political comedy, but personally it didn't work to its full benefit like I hoped it would. Overall, even with its lack in structure, the movie slowly builds to become more engaging the further you get into it even if it feels too late. I'll give \"Dr. Strangelove\" a B-!"
    },
    {
      "rating": "10",
      "text": "Using satire, Kubrick tackles the big question of the day - would the Americans and Russians wipe out the human race. Peter Sellers steals the show by portraying no less than three of the main characters simultaneously. The last, an ex-Nazi scientist, so broke up the cast and crew that Kubrick had to use parts of different takes."
    },
    {
      "rating": "10",
      "text": "Awesome."
    },
    {
      "rating": "10",
      "text": "If I were to recognize this film as a work of 'genius', then I would be making allusions to my own ability to identify genius, thus implying a capacity to relate to what it is to actually possess genius. It would hence be impossible for me to express my feelings on this film without seeming a bit pretentious. But is it not pretentious to fear appearing pretentious? In the end, I simply can't betray my desire to praise this film, even if it means I'm a pretentious genius. So be warned; watching this film will forever transform you into a pretentious genius (or a critic), if you are not already a member of that caste. It is that powerful. And there's absolutely nothing wrong with that."
    },
    {
      "rating": "10",
      "text": "Ok Kubrick is a marvellous director but please do not deny Sellers his just reward. He was the greatest comedy genius of all time and there will never be anybody like him again."
    },
    {
      "rating": "9",
      "text": "This was one of the funniest movies I have ever seen. It's a wonderful satire of cold war politics. One will really understand how ridiculous and dangerous the child-like political antics of the U.S. and the Soviet Union were in that time. Though almost 40 years old, the film is still relevant because it demonstrates today's government's faults. This movie makes you really think about the reality of nuclear warfare throughout the Cold War, and the idiocy of modern governments."
    },
    {
      "rating": "10",
      "text": "The reason I became a Kubrick fan in the first place. Who else could carry off \"nucular\" war as a satirical comedy. Numbr 2 on my all time favorite list, just behind Casablanca."
    },
    {
      "rating": "9",
      "text": "Flouridation!!!"
    },
    {
      "rating": "10",
      "text": "\"Like fryin' chickens in the barnyard!!\" I could strap in Clockwork Orange-style and watch this movie for the rest of my life."
    },
    {
      "rating": "10",
      "text": "To the reviewers who do not understand a classic satire, this film was FILMED in 1962-1963 during the PEAK of the Cold War. ITs a politically oriented film at the ludicrous idea of \"Total Thermonuclear Commitment\" of nuclear arms being spewed out by the Neo Conservative right wing of the Republican Party at the time. Please keep it in contexts to all the young dumbed down movie goers who don't know what GOOD is anymore. This movie is one of the ones who truly deserves a 10/10."
    },
    {
      "rating": "10",
      "text": "This was a great movie. Don't listen to lee b. werner von brauhn might have been german, but he was a great man, and led our country into the future of space exploration."
    },
    {
      "rating": "10",
      "text": "Dr Strangelove is the comedy version of the movie Failsafe,where a Churchillian typeNeoconservative advisor to the Defense Department(sound familer?)played by Walter Matthue advises an all out attack on the Soviet Union,when a B-52 mistakenly crosses into Russian airspace during a war game.Kuburick refreshingly does do the left-right cliches in Strangelove.The Red menace was rattling sabers all over the globe in that period,from erecting the Berlin Wall,Cuba,SothEast Asia.The famous German scientists-Von Braun,Dornberger,Oberth,Rudolf were always in the headlies while they ran NASA.We see the British officer protrayed hilariously by Sellersas well.The President is the personification of Adlai Stevenson.All of this makes the film both topical,and timeless."
    },
    {
      "rating": "10",
      "text": "A brilliant movie by Mr. Kubrick. Dr. Strangelove is a genuine black comedy that was crazy for that time and crazy for ours. The movie shines because of it's authenticity and the great and versatile acting by Peter Sellers. The movies name is a character in the movie obviously but he doesn't come into the picture until about an hour in. Dr. Strangelove is a extremely smart person but at the same time a nutter. He is from germany and mistakenly calls the president \" Mein Fuhrer\" a couple of times and his hand would start shooting up making the nazi hand gesture or signal if you will. Which did show the brilliant comedic virtues of Stanley Kubrick. Another fabulous adaptation from a novel."
    },
    {
      "rating": "10",
      "text": "Easily one the the best films of all time, and, THE best comedy ever made. Only Kubrick could have made this film."
    },
    {
      "rating": "10",
      "text": "For those of you too young to recall or to lazy research the height of the Cold War, the movie is technically very accurate (unlike Fail-Safe). In fact, the equivalent of \"Attack Plan R\" still exists today(and we're still flying the same bombers and tankers --scary). Those of you who miss the bone dry humor are missing out. I used to show the scene where Peter Sellers is captured to my troops, to show them how Americans are perceived, and I use quotes like -- \"I don't think it's fair to condemn an entire program because of a single slip up.\" -- in business all the time. So, the delicious script, the fantastic camera work and lighting and the terrific characterizations make this a winner Boys, the world was a different place then; you have to slip into the millieu."
    },
    {
      "rating": "10",
      "text": "This film is magnificent, somehow it is able to perfectly highlight the stupidity of mutually assured destruction, without showing pictures of ruined cities or people dying of radiation sickness. It never makes light of the situation and yet is able to remain funny, an extraordinary feat."
    },
    {
      "rating": "10",
      "text": "One of the great comedies of the 20th century. Absolutely perfect cast, superb acting. Regardless of what a few users have said, this movie is VERY funny. Of course it's not sex/fart/potty humor funny, which a suspect is why Charlie S, Arthur D, and JJ Moore did not like it. If you're into clever, satirical humor. . . If you appreciate good composition and framing. . . Strangelove is the movie for you. They don't make pictures like this anymore!"
    },
    {
      "rating": "10",
      "text": "Charlie S, Please view films completely before you comment. I feel very sorry for you, and your complete lack of humour!"
    },
    {
      "rating": "10",
      "text": "Razor Sharp. A country that can consider Sarah Palin, a gun-totin' loon that \"wouldn't blink\" at War With Russia, as a vice-presidential candidate, REALLY needs to revisit material like Dr Strangelove!"
    },
    {
      "rating": "10",
      "text": "A powerful message to mankind in any era."
    },
    {
      "rating": "10",
      "text": "Without a doubt *the* greatest satiric screenplay of the 20th Century, only less dark than the far more disturbing and blacker comedy of Silence of the Lambs. To understand Dr. Strangelove you have to understand a Cold War era when the likelihood of nuclear holocaust seemed imminent and anti-Communist paranoia was still running very high. You think Sarah Palin is bad? The script savagely lampoons the real post-McCarthy wing-nuttery of the age, from anti-fluoridation reactionary groups like the John Birch Society to real nuclear war advocates speaking flippantly of maximum body counts during a full-scale nuclear war. The script roasts them all and takes a good wide swing at a few other soft spots in American society -- the use of Nazi scientists (we got to the moon on the shoulders of non other than Verner von Braun's leadership), the anti-commie paranoia that bordered on psychosis (the McCarthy era was pretty bad), the euphemistic \"Peace is Our Profession\" whitewash of the DOD (which led us to millions of deaths in S.E. Asia) and so on. Strangelove takes it to the logical extreme in a sarcastic - even jugular - vein, demonstrating the inanity of anti-fluoridation paranoia via a psychotic general admitting his withholding ejaculation in defense of his precious bodily fluids. This is examined in relation to fluoridation and the various epigrammatic phrases peace on earth, preserve our essences and purity of essence also revealing to us the acronymic three-letter cipher prefix necessary to cancel the attack."
    },
    {
      "rating": "10",
      "text": "I would give it a 9.5, Dr. Strangelove should have appeared more in the movie. The acting is also awesome and the film have the black comedy, satirical and sometimes nonsense touch which is so difficult to find well placed in a movie nowadays."
    },
    {
      "rating": "10",
      "text": "One of the funniest movies I think I have ever seen, Dr Strangelove remains fresh and consistenly hilarious almost fourty years on. A must see, and definitely one of my personal faves. You must see it."
    },
    {
      "rating": "10",
      "text": "Perfect casting, perfect directing, brilliant camera work, superb script. Outstanding black comedy with some of the greatest scenes in cinema"
    },
    {
      "rating": "10",
      "text": "Freaking hilarious."
    },
    {
      "rating": "10",
      "text": "I saw the film in a theater in 1964 when I was a 17 year old high school senior. I've watched it countless times since its release on DVD, second only to \"Star Wars V: The Empire Strikes Back.\" Dr. Strangelove is, in fact, my number one movie of all time. Its incandescent black comedy is unsurpassed. No aspect of the film deserves less that a 10 rating: casting, acting, directing, staging, cinematography, editing, script -- all are virtually perfect. Kubrick's unflinching finale should shame many of today's film makers and cause the viewer to wonder what the appropriate response is: hopeless laughter or abject tears. Because of Kubrick's unmatched ability to produce period pieces that defy time, the film is as current today as it was 42 years ago. Even a casual movie buff should not miss this brilliiant but perfectly accessible masterpiece."
    },
    {
      "rating": "10",
      "text": "The most brilliant black comedy ever made. Features memorable performances by Sellers, George C. Scott, Sterling Hayden, and Slim Pickens. More classic scenes than I could count on both hands. A bizzare plot, but not as bizzare as the cold War doctrine of Mutually Assured Destruction (MAD) that it so effectively satirizes."
    },
    {
      "rating": "9",
      "text": "Stanley Kubrick's best film and one of my all time favs."
    }
  ]
}