{"id": 4049, "title": "Dragged Across Concrete", "starring": ["Mel Gibson", "Vince Vaughn"], "runtime": 159, "genre": ["Crime", "Action", "Thriller"], "description": "Two policemen, one an old-timer, the other his volatile younger partner, find themselves suspended when a video of their strong-arm tactics becomes the media's cause du jour. Low on cash and with no other options, these two embittered soldiers descend into the criminal underworld to gain their just due, but instead find far more than they wanted awaiting them in the shadows.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/dQ9EkVyPYJNVCfP5jWXRe4faUFA.jpg", "categories": {"plot": 7.2727272727272725, "acting": 7.333333333333333, "ending": 5.0, "soundtrack": 8.0, "cinematography": 8.0, "familyFriendly": 3.0, "funny": 7.0, "action": 7.5}, "reviews": [{"rating": "10", "text": "Great long and stretched movie, potrays realistic and brutal situations, funny and great performances, itter masterpiece, the director is a god"}, {"rating": "8", "text": "Wonderfully terrible. The entire time I was wondering if this was a happy accident or the result of great skill. Everything from the poor character development to the slow, rabbit hole like plot and the uncharacteristically seemingly poor acting was the best I've seen perhaps since The Room. I only hope this was intentional."}, {"rating": "7", "text": "Zahlers most ambitious movie to date and it almost delivers. The story is very simple but also highly effective. The pace is almost nonexistent, and most of the time its fine with the slow pacing. Its very brutal and graphic in its violence. To me this is better than cell block but not as good as Bone Tomahawk."}, {"rating": "10", "text": "This movie is fantastic. Everyone who is complaining about length and slow tempo is probably just shallow teen kid who needs superb action like fast and furious. Well no, this movie is for adult viewer and its tempo pays of. Great acting, great story, brilliant atmosphere."}, {"rating": "8", "text": "Ugly, crude, morally repugnant, very enjoyableDragged Across Concrete is the third film from writer/director S. Craig Zahler, after the superb horror-western Bone Tomahawk (2015) and the fatalistic but excellent prison drama Brawl in Cell Block 99 (2017). Synthesising disparate genres, and featuring sudden and often extreme violence, both are methodically paced and emotionally dark. In Dragged, the gore has been toned down (although not the violence), the nihilistic worldview is made more apparent, the genre mashup more complex, and the pace more languorous. It's also morally repugnant, ugly and stoical, exploitative and demoralising. And immensely enjoyable.Set in the fictional city of Bulwark, the film follows three stories. In one, Henry Johns (Tory Kittles) returns home from prison to find his mother (Vanessa Bell Calloway) turning tricks in her bedroom, whilst his younger brother (Myles Truitt) is kept quiet with videogames. In the second, Det. Brett Ridgeman (Mel Gibson) and Det. Anthony Lurasetti (Vince Vaughan) are suspended without pay after Ridgeman is filmed standing on the head of a Latino drug dealer during an arrest. Needing money to move his family out of the bad part of town in which they live, Ridgeman decides he's done playing by the rules. The third sees Kelly Summer (Jennifer Carpenter) reluctantly returning to work after maternity leave, despite suffering from severe separation anxiety.Narratively, although Dragged is easily Zahler's most densely plotted film, much like his previous work, it's predicated on character rather than story, spending a lot of time on conversations that do little to advance the plot, but add layers of character information (think the \"royale with cheese\" scene from Pulp Fiction). One subplot in particular benefits from this technique, so that when it erupts in sickening violence, the emotional impact is all the stronger; think of the character of Breedan (Dennis Haysbert) in Michael Mann's Heat (1995), a subplot that hits as emotionally hard as it does because Mann spends so much time introducing us to the character.Given what Zahler's films say about masculinity and violence, it's no surprise that he is seen as a quintessentially right-wing filmmaker in a very left-leaning Hollywood - although he claims he's not a Trump supporter, the Daily Beast still referred to him as \"the Hollywood filmmaker making movies for the MAGA crowd\", which is not only reductionist, it's not even accurate, as there is nothing in his films to suggest he subscribes to Trump's hateful and divisive rhetoric.That said, if he isn't engaging in socio-political commentary here, then he is baiting outrage culture. Who does he cast as the two racist cops who complain about political correctness and trial by social media, and who use (gun) violence to try to set their world to rights? Noted Hollywood conservatives Mel Gibson (he of the 2010 \"raped by a pack of n-----s\" comment), and Vince Vaughan, who rather amusingly believes the way to tackle gun violence in the US is to introduce more guns. One can see Zahler getting considerable satisfaction from watching SJWs losing their minds trying to parse the metatextuality.However, despite his claims that the film is apolitical, it's hard to deny that some of the dialogue has a political flavour. So, for example, the cops' boss, Lt. Calvert (Don Johnson, still effortlessly cool), states that \"being branded a racist in today's public forum is like being accused of being a communist in the 50s [...] The entertainment industry, formerly known as the news, needs villains,\" a comment which will call to mind Trump's refrain of \"fake news\". Another example is when Ridgeman's wife (Laurie Holden) says, \"I never thought I was a racist before living in this area.\" That's a hell of a loaded statement in a film that's apparently not interested in race relations. Moving away from racial issues, Ridgeman laments to Calvert, \"yesterday, after we stop a massive amount of drugs from getting into the school system, we get suspended because we didn't do it politely\", and it's hard not to hear Zahler behind such a sentiment; someone who believes (maybe correctly) that PC culture has gotten to a point of absurdity.The line between critical commentary and ideological endorsement is generally razor thin, and it's a line that Zahler walks throughout, in the first film he's made that's more likely to alienate audiences because of its ideology than its violence. Certainly more to the right than the vast majority of Hollywood, Zahler may be positioning himself as a conservative ideologue against cookie-cutter Hollywood political correctness. You may see it as shining a light on racial intolerance in law enforcement. Or as commenting on how women are expected to be mothers and full-time workers. Or as appallingly racist itself. Or as full of misogyny. And this ambiguity, more than anything else, speaks to its quality as a provocative work of art."}, {"rating": "7", "text": "Buenísima. Acción típica de policías y ladrones, con muertes muy buenas y sangrientas. La historia es redonda. El problema de la peli es que dura mucho, tiene escenas de más (1ra media hora), pero es para explicar la motivación de los personajes. Director nuevo, apenas su 3ra peli, (Excelente:Brawl in Cell Block 99)"}, {"rating": "9", "text": "After the bones are broken and the scores are settled, Dragged Across Concrete at the height of its power is an experience in every sense of the word. Zahler has already proven to be an essential voice in the modern wave of exploitation cinema. His genre-hopping projects and style, despite their flaws, are nonetheless passionate while scarring. While Concrete isn’t quite as lean as it’s predecessor, the ambitious scale of crime epic is another exciting chapter to witness."}, {"rating": "0", "text": "Dragged Across Concrete should have been titled My Genitals In A Blender, because that's how bad I feel after watching this 2h 39min experiment on how not to make a movie. Bad Editing, Bad Soundtrack, Bad Dialogue, Bad Acting, Bad Casting, Bad.....Oh, this film is awful. S. Craig Zahler has put enough time and effort in to create something so much better, but instead unloads this horrific piece that will be an embarrassment on anyone's resume."}, {"rating": "7", "text": "It's not bad, a bit slow, a bit heavy, ending a bit off. I've seen a lot worse recently, though I've seen considerably better too. Okay, nothing more. Wish I could 6 and half it, because that's what it is, almost a 7."}, {"rating": "0", "text": "I've rarely seen such a bad movie. Scenario and dialogues are from a 13 years old boy without any culture or imagination. It's flat, linear, boring. Besides I don't understand all the hype around that movie that is not even at TV level requirements."}, {"rating": "6", "text": "Brett (Mel Gibson) and Anthony (Vince Vaughan), two hard and gritty police detectives get suspended when a video of their unconventional methods appears all over the internet. Short on cash and fed up with their treatment for doing their job they take an opportunity to earn some extra money and end up involved in the criminal underworld in order to get what they feel they deserve.I really liked the idea for this film I just wasn’t happy with the execution. The pacing was much too slow. I wanted the tension to build the whole time and although there was a lot I liked about this film I just didn’t feel like it came together. It really felt like it wanted to take on more issues and subplots so perhaps a mini-series would have suited this story better. I just couldn’t get invested in the story because every time I did something else happened that just killed the atmosphere. It also isn’t afraid to hold back on the violence without being uber-violent for the sake of it. Another issue that I couldn’t get over was the fact that the sound effects were cranked up to one hundred. At one point Vince Vaughan eating a sandwich for what felt like an eternity was driving me absolutely insane, I just wanted to run out of the screen and not come back. And yes I understand why this was happening, two detectives on a stake out, they’re going to be getting on each other’s nerves and we’re supposed to feel this too but it was pushing me over the edge. Whether these extra loud sound effects was done on purpose to create a more gritty feel to it or it was a genuine mistake, either way it wasn’t working for me, it started off quite funny but quickly moved to annoying and eventually infuriating. The story and the acting was there, Gibson and Vaughan make a convincing pair though I really found it hard to empathize with their characters so I really wasn’t rooting for anyone in this film, honestly I was glad when it finally ended. If this is your first time with Director S. Craig Zahler then I wouldn’t recommend you start with Dragged Across Concrete, perhaps try Brawl in Cellblock 99 and go from there. Recommended for fans of the director’s previous films."}, {"rating": "3", "text": "so slow, and very gross at points! I don't understand why it got such a good rating!!!"}, {"rating": "1", "text": "They should have just named this movie dragged on.This must be one of the worst excuses for a Hollywood paycheck, this cast has done in some time.Really boring. Just plain waste of talent."}, {"rating": "8", "text": "Dragged Across Concrete Is a better movie on rewatch first I did not like all the kills they did I still don't the one major thing I still absolutely hate they killed off Mel Gibson character and Anthony character also Henry  is still a good character he is in the very beginning but than Mel Gibson is introduced so we are cared for Brett and Anthony so i was really annoyed when Henry killed Brett but it is reasonable I do like how slow it is So on rewatch this movie is better But not so much last time I gave this movie An d- Now I give it An B-"}, {"rating": "9", "text": "Bleak Neo Noir featuring rich dimensional characters on a collision course with fate. As with Zahler's other films there is violence which hits hard and brutal, played for impact not entertainment value (this is no MI/FF bullsh*t), but the film really sings in the dialogue. It's a long film that doesn't drag at all, taking its time building its threads before weaving them together. Diverse and refreshingly free of hackneyed identity politics, more like this please Hollywood."}, {"rating": "6", "text": "Did Zahler work as a butcher before ?!! based on his previous movie \"Bone Tomahawk\", he tends to show bodies explosions and guts, and here in this movie is same but different time & story. Also he likes to make unexpected ending, you couldn't guess the end with Zahler and that's cool but sometimes he made it so complicated which makes you feel confused.By the way, the movie was good but not perfect, i like the funny conversations between Mel & Vince, it gives the movie sense of humor which keep you attractive to the movie.In contrast, when i watched the killing scenes, i felt like am watching \"Scary Movie\", i didn't feel it was an action or crime movie, i think this back to the directing of these scenes, i was hoping to see more serious action and crime."}, {"rating": "8", "text": "S.Craig Zahler strikes back! Not his best movie, (that is Brawl in Cell Block 99) but close enough. Dry, slick, dark and shamelessly violent, that's the typical movie that coddled snowflakes and Twitterati love to hate. A great thriller that takes its own sweet time to develop its flawed but engrossing characters and then strikes at the jugular. In these sad times of Groupthink and Cancel Culture hooliganism We need more and more storytellers who are not afraid to push the boundaries of genre."}, {"rating": "0", "text": "Another \"Woke\" Hollywood movie. They had three black people in what could have been an all white cast. Great job again Hollywood Trump2024!!!!!"}, {"rating": "5", "text": "SPOILER: No one is dragged across concrete. This movie should be buried in it.I'd rate 4.5 but rounded to 5.0 because I had too. Mel is awesome. Vince and Tory are pretty decent. Everyone else is forgettable. The dialogue/acting is humorously cliche at times. The story is paced too slow and EASILY one full hour too long as the editor was apparently MIA. Also, the continuity errors are obvious throughout. How Mel got involved with the obviously beginner-grade off screen talent is a mystery."}, {"rating": "1", "text": "Overall this movie was trash. Some decent acting with a decent plot. I’m ok with a slow burn movie but this was overkill. Unlike others i don’t think it needed an hour cut from the run time but easily 30 minutes too long. And the editing was probably the worst i have ever seen. Not sure if anyone else noticed some of the horrible mistakes but i’ll bring up just one. Towards the end of the movie when the open up the garage you can clearly see it’s a Chevy Tahoe that is in the garage........when they cut to the next part of the scene where they load the back of the SUV they are loading a Dodge Durango ( just look at the taillights) and then when they hook the cop car up to be towed it’s clearly a Tahoe again.....who the hell missed that in editing this movie? I really wanted to turn this movie off after an hour and a half but was too far invested and had to see it through. Very rarely do i feel a movie was a waste of my time but this one was. I felt so strongly enough i am actually commenting on here for the first time."}, {"rating": "7", "text": "The story gets good pretty quickly, but there is a tonal mess towards the end. The greatest part about \"Dragged Across Concrete\" is its central character. They are despicable, racist, and very crooked, but the movie shows you how they operate, and what their concerns are. The visuals were absolutely fantastic."}, {"rating": "10", "text": "An intelligent, well-written, slow burn crime film about the struggles folks from all walks of life go through and the evil that populates our decaying society. Such an underrated film. Highly recommend."}, {"rating": "8", "text": "This Craig Zahler flick combines grindhouse and noir with good angles, colours and lighting. It manages to hold on to a classic feeling while still feeling fresh. It´s brutal yet it doesn´t stick around nor glorify its violence. How death comes is less important than loss of life itself. It also brings up the topic of image and social politics versus result and actions. It´s long but never felt long to me since the suspense held me on to the seat with minimal music that only plays in times of calm."}, {"rating": "7", "text": "This movie might feel painfully slow and overlong at times but it's indeed a good homage to 90's Mann's action movies. The first impression you have watching this for the first time is that this is totally inspired by \"Heat\"  and the result turns out to be very good. An homage to action and Pulp as you can't see anymore today."}], "recommendations": ["sicario_day_of_the_soldado", "red_sparrow", "a_history_of_violence", "guns_akimbo", "the_kingdom", "blackhat", "the_hateful_eight", "the_counselor", "anon", "brimstone", "end_of_watch", "the_american", "broken_city", "the_purge_election_year", "good_time", "the_equalizer_2", "bad_times_at_the_el_royale", "nerve", "what_happened_to_monday", "eastern_promises", "tenet", "zero_dark_thirty", "cold_pursuit", "drive", "the_green_knight"]}