{
  "id": 2050,
  "title": "Drag Me to Hell",
  "starring": [
    "Alison Lohman",
    "Justin Long"
  ],
  "runtime": 99,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "After denying a woman the extension she needs to keep her home, loan officer Christine Brown sees her once-promising life take a startling turn for the worse. Christine is convinced she's been cursed by a Gypsy, but her boyfriend is skeptical. Her only hope seems to lie in a psychic who claims he can help her lift the curse and keep her soul from being dragged straight to hell.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fdyejM5Zd6dsa0YyWa02ZAKwQzK.jpg",
  "categories": {
    "plot": 4.0588235294117645,
    "acting": 3.2857142857142856,
    "ending": 7.875,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.947368421052632,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Drag Me to Hell is a perfect example of why CRITICS know what the hell (pun intended) they're talking about. This is one of those rare instances where the critics are the ones who praise a film (I mean, holy crap ... this film has like a 96% approval rating on Rotten Tomatoes) while the general public completely pans it. Guess what? After seeing this film, I can definitely say without a shadow of a doubt that all of the critics are absolutely, 100% correct. This is easily one of the greatest horror-thrillers of all time, the scariest horror-thriller of all time, and by far the most well-directed horror-thriller of all time. It's amazing how many people claimed that this film wasn't \"scary\" at all, when in fact they were probably wetting their damn pants everytime something popped out out of nowhere after the misdirection/suspenseful build-up that happens throughout the entire movie. Cheap? Maybe. Does it work? Absolutely. This film now ties with The Mist as being my two favorite horror-thrillers of all time.  A great example of why critics are the only ones who should be making any comments about anything. Critics and myself, one of the few people who aren't a bunch of stupid morons who wouldn't know \"good\" from \"bad\" if their damn soul depended on it (another intended pun). Nearly ten major critics (from Entertainment Weekly to the Washington Post) gave this film a PERFECT score. Personally, I wouldn't give it higher than a 90/100 or a 9.0 out of 10 ... but it really sickens me to read what many of the movie-goers have said about this film. All those comments have done is prove just how stupid most people really are. The critics have it ... everyone else, kindly STFU\r It's interesting how a lot of people (and I don't just mean on here) claim that this film wasn't the least bit scary ... and then they turn right around and admit that there were plenty of \"jump scares\" (which I guess is the term people are using) throughout. Okay ... so if suspenseful music/tension and misdirection leading to an inevitable, shocking \"scare\" isn't what \"scary\" is, then I'd really like to know what IS.\r Of all of the horror thrillers I've seen in the last decade or so (1408, The Mist, The Others, Skeleton Key, The Descent, The Ring, 28 Weeks Later, Hills Have Eyes, Texas Chainsaw Massacre, House of Wax, etc., (too many more to name ... those are just off the top of my head)), Drag Me to Hell is BY FAR the scariest. If this film doesn't qualify as being \"scary,\" then I really don't know what else in the entire damn world would qualify as such, because every single one of those other movies I just named (and pretty much every horror film ever, especially slasher-types) watch like the Care Bears movie compared to Drag Me to Hell.\r Honestly, do people even THINK before they post reviews on sites like IMDB and Metacritic?\r Yes, the movie IS full of cheap, \"misdirect and then jump out at you\" shock-scares ... that's what SCARY IS!\r Of course, as with all horror thrillers, how \"scary\" it happens to be really depends on how, where, and when you watch it. For instance, if you watched this film with other people around during the daytime ... or even in a movie theater surrounded by other people, then it probably wouldn't come off that scary at all. I, on the other hand, watched this film by myself, in a dark room, in the middle of the night.  Big difference. I actually considered closing my eyes at one point, but then I realized that the scares would have been even worse, as the loud, out-of-nowhere SOUNDS in this film are half the scare. At least with my eyes open I could see the nasty, crusty, hag of an old woman pop out out of nowhere and be expecting the loud-ass shriek that accompanies it.\r It's one thing to NOT like the film, but to actually say that this movie wasn't scary is just plain ridiculous and stems from pure bias and spite. Because I can think of no other horror thriller in the last decade or two that even compares in terms of sheer fright and tension. If Drag Me to Hell isn't scary, then nothing in the world of cinema is. I pretty much cringed for the entire 100 minutes.\r And yeah, there are still people who classify this as part \"comedy,\" but until Sam Raimi himself openly says that (which he has NOT), I call bull. The fact of the matter is, a \"comedic\" horror film would be quite obvious in its tone and atmosphere. I've seen \"comedic\" horror films before, and this watches nothing like those. This was a film that took its plot very seriously,where exactly did it say \"spoof\" or \"parody\" to you? Drag Me to Hell was tense and unnerving the entire time. If you laughed during this, then that's something to get checked out. Because there was nothing even remotely funny about this movie. Disgusting, shocking, and terrifying? Yes.\r Bottomline is, most horror thrillers slightly entertain but do not end up impressing me much. This one shocked me to the core."
    },
    {
      "rating": "9",
      "text": "This movie was advertised as a scary jump out of your seat horror movie. I feel bad for those of you that wanted to o see another jumpy crappy predictable horror film, but for anyone who is a true fan of film and are familiar with Raimi's earlier works (the Evil Dead series in particular) then you should have expected what you got. To me this movie was great it had moments where it scared you but it also had moments that made me cry from laughing. Guys it's supposed to be cheesy, that's his style and I find Drag Me to Hell to be the most original horror film in some time. The only reason I gave it a 9 instead of a 10 was because of the false advertising."
    },
    {
      "rating": "9",
      "text": "drag me to hell is a movie who have seen and understand raimi movies because his style is just not like any other.his movies reach such acclaim because they try to make a point on the current status of the horror genre and he makes light of it. his best example of this is the evil dead 2. it delivers an amount of cheese that reminds me of his older movies. this movie is intentionally all cheese"
    },
    {
      "rating": "9",
      "text": "This movie is an incredible thrill ride. There are small laughs planted between and within the grand scares. Some dialogue is intentionally grin-inducing, and also some scares, too. The cheesy CGI isn't a con, because it perfectly fits in with the craziness of the film. Even all of that can't water down how truly terrifying this movie can be, though.\r It's campy, fun, and theatrical. A movie to watch with a group, because you'll all be laughing and freaking out and having a good time. But be warned: when the credits roll, you won't exactly feel good. The movie is haunting."
    },
    {
      "rating": "10",
      "text": "Holy crap, this one surprised me! I don't think a horror comedy has worked so well since... well, ever. This movie was as funny as it was scary and disgusting, and it truly felt like what I'd expect from a Raimi film. The acting was great, the cinematography was so crisp and nice to look at. The story was also pretty disturbing and creepy. I also liked how it poked fun at a few horror cliches like the bleeding nose thing. The ending, though, was so shocking and unexpected. I'm glad it wasn't another Hollywood ending where everything is alright because I love huge twists like that! I really loved this movie. I jumped and laughed and cringed too many times to count. I haven't had this much fun watching a movie in a long time."
    },
    {
      "rating": "0",
      "text": "This movie is a lot like church. Seemingly endless, full of people that don't belong in it, and it made me think about crucifying myself the whole time."
    },
    {
      "rating": "9",
      "text": "Wow, a real perl amon the horror movies. Logical story, cool effects, no nonsense and some comedian stuff included.\r Who says that a horror movie needs to be ultra violent?"
    },
    {
      "rating": "9",
      "text": "After the Spiderman trilogy, Sam Raimi returns to his roots, those of the horror genre, and in some form. An example that karma can sometimes attack like a fasting bear, in which horror and black humor are cleverly mixed. One of those that should be seen alone and with the light off. To watch as one hums See you in Hell by Grim Reaper and Straight to Hell by Ozzy Osbourne."
    },
    {
      "rating": "9",
      "text": "One of the best horror movies of it's time.A cleverly constructed thrill ride that is laced with some clever humour and unlike many horror movies is a pure joy to watch."
    },
    {
      "rating": "9",
      "text": "I love horror movies. Sam Raimi has always delivered the best jump scares and this movie is no different. I saw this movie in Los Angeles with my horror movie buddy right when it was released. It was incredible. The audio is very effective, and the situations in the movie sometimes remind me of Final Destination. The movie is constantly terrifying – it really does keep the energy up all the way through. And the final moments are crazy. Such a great flick."
    },
    {
      "rating": "0",
      "text": "\"Exorcist\" meets \"Pee Wees Big Adventure\" as imagined by a drunk third-grader. The only redeeming value of watching this movie was that I get to finally bump down \"Romeo and Juliet\" starring Leonardo DiCaprio as my worst movie of all time."
    },
    {
      "rating": "2",
      "text": "After all the hype about this film, i thought i was going to be in for a real treat, how wrong was i. The film was advertised as a horror however this it definately wasn't, it was ridiculous how stupid the film was i was laughing throughout at the stupidity, i mean how patronising can a person be to think that the audience would be scared of this mediocre dribble drabble of a film. i highly advise you not to watch this as a horror fan but more of a comedy \"shaun of the dead\" type fan, not that it's that good. So disappointed."
    },
    {
      "rating": "1",
      "text": "I'm dumbfounded by the 83 this movie received. I just really don't believe i watched the same movie. I did not think this movie is worth anyone's time and actually walked out an hour into the movie. Maybe it got good right after that?Terrible movie."
    },
    {
      "rating": "0",
      "text": "Really bad. Tries to be a so-gross-it's-funny, so-campy-it's-funny, so-bad-it's-funny movie but is only kinda gross in parts. Definitely not scary. Definitely not well-written (or well-cast -- the apple mac guy plays a college professor from a well-to-do family). The whole movie my friends and I were going \"huh? why? what? gross! was that supposed to be funny? how long is this movie?\" I tell you what--it cost a dollar to rent this from a red box and about 5 minutes to write this review and I feel this movie doesn't deserve either. Just skip it."
    },
    {
      "rating": "1",
      "text": "If you are expecting an evil-dead-like movie like i was, you should watch the first scene, the seance scene, and the last scene, and SKIP the rest. Nothing in this movie is as funny or scary, and every scene is dragged out so long it gets boring. Gypsies are still frequently the victims of violence and discrimination, so i feel they're portrayal in this movie was in bad taste. On the plus side this movie has a talking goat."
    },
    {
      "rating": "0",
      "text": "The main character murders a poor kitten in it.... made me sick to my stomach and I couldn't enjoy the rest of the movie. I have lost all respect for Raimi. Horrible movie."
    },
    {
      "rating": "0",
      "text": "THIS has GOT to be the WORST movie I have seen in the past 10 years... are you people kidding me?? Who in their right mind would give this movie a \"10\"??? (( or anything higher than a 1 for that matter? )) Get Real!! The only good thing about this film being at the bottom of the list, is it will NOW be keeping the movie \"BUGS\" company... as it too falls in the catagory of WORST P.O.S. I've seen in a LONG TIME!"
    },
    {
      "rating": "10",
      "text": "A masterpiece with first rate special effects. ........................................................"
    },
    {
      "rating": "10",
      "text": "****************************************************************************************************************"
    },
    {
      "rating": "10",
      "text": "Raimi has made the most crazy, fun, and terrifying horror movie in years. its the most amazing horror movie you will see! the cast leads stellar perfomances in their roles."
    },
    {
      "rating": "10",
      "text": "como solo raimi lo sabe hacer crea otra pelicula de horror con tintes de comedio la cual no importa de q angulo la mires siempre dara resultado  este es un gran regreso por parte de raimi al genero delterror"
    },
    {
      "rating": "10",
      "text": "Perfect mix! Its scary but also so funny, you can't take this serious.\rSo don't expect too much and you will be surprised!\rEvery second of this movie is great!"
    },
    {
      "rating": "8",
      "text": "It's scary, shocking, and excellently made.  I felt a different type of fear while watching this.  It's not your typical monster or possesion fright-fest.  With the exception of a few CG effects, everything works rather well and really creates a sense of dread and suspense.  One of the better horror movies I've seen in a while.  You might not want to watch it alone, or before going to bed."
    },
    {
      "rating": "8",
      "text": "Bottom Line: Supernatural horror with here-and-there touches of satire is an irresistible modern Halloween pick.\r Sam Raimiâ"
    },
    {
      "rating": "8",
      "text": "This is undoubtedly the best horror movie of the decade. I really was surprised when I read so many good reviews because I was absolutely convinced it would be the kind horror fans would praise but critics taunt... it was just the reverse. This shocked me. If you really appreciate horror movies, it's completely impossible this being a letdown."
    },
    {
      "rating": "8",
      "text": "Drag Me To Hell is one of my favourite horrors. Well, it is partially a comedy, too, but it can get pretty scary at times.I just love the fact that it's not the usual stupid horror: full of gore and nothing behind it. Drag Me To Hell has a compelling and very interesting story, some good acting and it just a straight-out good film. Definitely high entertainment value and I'd recommend anyone who likes good horrors to watch it. Yes, it is funny sometimes, but what's wrong with that? Can't a horror be also funny?! Definitely a great surprise of a film!"
    },
    {
      "rating": "0",
      "text": "My wife and I made it through the first 15 minutes and wrote off the $5 pay-per-view fee as a total loss. If you have a sudden desire to watch this movie, don't."
    },
    {
      "rating": "3",
      "text": "I can't believe the critics loved this one. It was a totally cheesy movie. A few scary scenes & a few funny ones, but overall a pretty stupid movie."
    },
    {
      "rating": "0",
      "text": "Worst crap I have ever seen. Please god, I wish I could erase this retarded trash from my memory. Do not see this!!"
    },
    {
      "rating": "2",
      "text": "The film is proclaimed as a horror movie, but right at the start I'm starting to feel that they got it wrong. Drag me to hell is a comedy, directed by someone who's weird enough to make fun of putting or spraying something on the mouth."
    },
    {
      "rating": "0",
      "text": "Seriously, has anyone ever read Thinner? Seriously?"
    },
    {
      "rating": "3",
      "text": "I'm at a complete loss to understand all the positive reviews from critics. This movie was completely predictable, often resorting to extreme loud noise in a desperate bid to elicit some sort of scare from the audience that will instead leave you constantly adjusting your volume. The characters are flat, unrealistic and incredibly stupid. Often failing to recognize things that are blatantly obvious to everyone in the audience. This movie is an unintentional parody of itself, watch it with that in mind."
    },
    {
      "rating": "9",
      "text": "I usually come here to read some critic and user comments before going to a movie. Just to give me an idea. Not to save money. Just to make sure I'll spend some good time sitting at the movie theatre. I didn't do it for this one. I wasn't even planning to go the movies. A totally spontaneous decision I took with my girlfriend on a rainy day. I barely had the time to watch the trailer. I went there only to saw a return to horror from Sam Raimi, only to realize two things. First, the trailer doesn't sell the movie at all and isn't representative of the movie really is. Second, this is a great movie that met perfectly my expectations of seeing the new flick by the guy who did Evil Dead. So many people worship the Evil Dead trilogy and most of them didn"
    },
    {
      "rating": "2",
      "text": "This movie was just terrible. I don't know if it was the directors cut that made it terrible or just the lame effects. The girl getting puked in the mouth multiple times was ultra-lame. I can't believe this movie has rated as well as it did."
    },
    {
      "rating": "9",
      "text": "la pelicula es entretenida y muy buena pero no le pongo el 10 por que no tiene tanto carisma silvya ganush que es la que le pone la maldicion y no sale tanto y podia haber tenido mucho mas juego con la pelicula ese personaje por lo demas es perfecta salvo eso pero no tiene muchos puntos que se podian mejorar pero en si es una pelicula buenisima y muy entrenida recomendada si quieres una pelicula de terror buena"
    },
    {
      "rating": "8",
      "text": "This is probably one of the scariest best directed and produced horror film in years. Sam Raimi has finally directed something worth seeing over and over again. The characters are so developed, intense scenes that I will never forget, and just pure fun. That description I can't say for many horror movies and it might not have been the scariest, but I give props for a developed story that wasn't cheesy, and Lorna Raver playing the evil Mrs. Ganush. It was a smart horror movie; that is uncommon for the horror genre."
    },
    {
      "rating": "0",
      "text": "I honestly think that is the worst dollar I have ever spent from red box in my life. I would have rather gotten a four piece from mcdonalds then to have bought this movie. I think the funniest part of the movie was when my friend farted on a leather seat and it echoed through the room. This is cheese. String cheese. I dont even think blaggy would have eaten this cheese. Raimi has made the most greasy, skunk, and diarrhea filled horror movie in years. I seriously could of taken a dump on a camera lens that people would rather see than this trash. I would rather have my fingernails pulled off with pliers or be forced to smell a used diaper filled with Indian food. Get em next Raimi ... McGrease out."
    },
    {
      "rating": "10",
      "text": "I saw this movie in theaters when it came out so my memory is a bit rusty... But after seeing the high score this got i have to call BS... first off the Gypsy woman put a curse on her... after not 1... not 2 but 3 house extensions and curses the girl in the film because she can't pay for her damn house and its the one time the girl decides to deny someone on a loan.... seriously this movie was down right horrible and deserves about a 4... it wasn't scary and was barely even funny just a poorly written story"
    },
    {
      "rating": "10",
      "text": "Funny and scary, well sam raimi is back to his roots. If you are looking for a typical horror ,you would be disappointed but if you like the 80s horror/ comedy then  This is definitely for you . The film reminded me of my position in a bank and I had to make similar decisions so I both disagree and sympathise Christine's situation.  Lorna Raver is absolutely great as Mrs Ganush and the fight between Christine and Mrs Ganush is priceless."
    },
    {
      "rating": "8",
      "text": "As a huge fan of the Evil Dead series I didn't expect much from the trailers I saw, and the fact that I haven't been impressed with much of what Raimi's done in the past decade or so. In turn I prepared myself to see another generic piece of crap (essentially nearly every horror movie of this decade), and that is likely what made this film so great. I enjoyed nearly every bit of it, and it felt like a glorious return-to-form for Raimi. However, I must say that the protgonist's acting was atrocious beyond stanard \"b\" type horror acting. I also personally felt she wasn't likable , but that is just my opinion because I don't care for protagonists that crave social acceptance. All-in-all I give Drag Me to Hell an 8 for being an overall fun movie to watch, despite the acting."
    },
    {
      "rating": "3",
      "text": "I had great expectations for this one but it failed miserably. Stiff performances from all actors, contrived storytelling and poor special effects, kitsch, not camp. It is a 'fun' movie, but only if you watch it to laugh at it and not with it."
    },
    {
      "rating": "8",
      "text": "Drag me to hell is one of my favorite horror movies with it's storyline, details and meaning. Seriously good horror/ thriller, 'Must watch' for sure! The only thing that was not okay and it's in complete disharmony with the whole movie - i think two scenes, that were ridiculous. But overall great story, acting, plot twist, especially at the end (amazing end in my opinion)."
    },
    {
      "rating": "4",
      "text": "I was really looking forward to this and it was such a big let down! It was watchable as a one-off, but I wouldn't watch it again. It was far more funny than scary. The ending was so obvious, my wife and I knew it was coming and so did everyone else in the cinema. I have seen worse, but this was very poor."
    },
    {
      "rating": "0",
      "text": "I will give this movie and the positive reviews the benefit of the doubt and assume it was much better in theatres. However, I watched it on HBO and it was frustratingly bad. The dialogue was superficial, seemingly written just to string together the story in between the screaming and supernatural events throughout. From the moment the the old women appears on screen in that trying-too-hard-to-be-creepy garb, I predicted that she was going to curse the main character. Everything that happens to the main character after that is just confusing and random. Many of the disturbances that plague the main character are, of course, not pleasant, you would not want them to happen to you. BUT finding a scarf in your throat and having to pull it out is not that terrifying. This and many other similar things happen just as fillers.The pace is ridiculous. The beginning is slow and drawn out yet it fails to establish an eerie vibe or build any suspense. When the random disturbances really start, they are almost non-stop until right before the ending. It is such overkill.The CGI effects are too cheap and unrealistic to be scary but not obviously cheesy enough to be funny. Whether it was meant to be funny/ cheesy or realistic/ scary, it did not look intentional. The girl is being taunted by a cartoon shadow. Seriously.The characters were total idiots with no substance. There is some random back story for the main character thrown in, more as a side note, toward the middle of the movie but it is irrelevant because that information is never really brought up again. She goes from young soft-spoken girl in business attire to flighty and confused to screeching one liners like \"That's yours **** and I don't believe any of it. The boyfriend character is just there to react to the girl's changing behavior by brushing it off until he finally sees something himself and is proven wrong. Again, very original. I could go on and on. Seriously, it was insulting."
    },
    {
      "rating": "4",
      "text": "A mediocre movie that pulls all of the same strings of bad, churned out American horror movies.\r After seeing this movie featured on several lists of top horror movies, I figured this might be the next 'The Orphan' on a trend to change my mind about Hollywood and horror.\r Instead what I got was cliches about 'foreign occult\", mediums that for some reason, speak in Spanish, endless hot and cold moments trying to build suspense before breaking off into nothing, and of course, the flat, \"twist\" ending, which was predictable to me (always check the most important things twice, especially when they're wrapped up).\r I'm more surprised by the positive ratings that this mediocre flick has received, though this may owe itself in no small part to the gradual slip of this industry, which thankfully I have missed."
    },
    {
      "rating": "8",
      "text": "This is the best horror flick I have seen in a while, and that is saying something, since I hardly watch horror at all (I get scared REALLY easily). A ton of moments made me go \"eww\" and \"O_O\", and those are reactions you are supposed to get in a good horror movie. Also, I was TOTALLY not expecting the ending."
    },
    {
      "rating": "7",
      "text": "I cannot understand why people didn't like this film. Ok, it is kind of trash but \"Drag me to Hell\" is overall entertaining and filled with something that current horror films are missing: a good script"
    },
    {
      "rating": "7",
      "text": "This is a hilarious film which is also scary in the right places. Sam Raimi knows what he is doing in the horror genre and I am glad that the film doesn't take itself too seriously. It has a clever plot with a slightly predictable twist but all in all everything works in Drag Me to Hell."
    },
    {
      "rating": "5",
      "text": "The movie tried to make it look itself as \"Evil Dead\"; With poor CG and weak character development, Sam Raimi's \"Drag me to Hell\" is a movie way cheesier than that."
    },
    {
      "rating": "7",
      "text": "This movie seems kinda like a mocking spin on the traditional horror movies we are use to in this day and age. The parts that were meant to be scary were scary with a little twist of humour. It was very entertaining and didn't feel like a complete waste of my time. So if you want a slightly cheesy, scary, and kinda funny horror movie pick this up."
    }
  ],
  "recommendations": [
    "cabin_fever",
    "the_messengers",
    "insidious",
    "the_cabin_in_the_woods",
    "malignant",
    "the_host",
    "the_hills_have_eyes",
    "the_grudge",
    "venom",
    "ouija",
    "scream_4",
    "dead_silence",
    "annabelle",
    "the_bye_bye_man",
    "countdown",
    "the_possession",
    "scouts_guide_to_the_zombie_apocalypse",
    "paranormal_activity",
    "saw",
    "friday_the_13th",
    "hostel",
    "hostel_part_ii",
    "house_of_1000_corpses",
    "the_collection",
    "the_grudge_2"
  ]
}