{
  "id": 377,
  "title": "Dreamcatcher",
  "starring": [
    "Morgan Freeman",
    "Thomas Jane"
  ],
  "runtime": 136,
  "genre": [
    "Drama",
    "Horror",
    "Science Fiction",
    "Thriller"
  ],
  "description": "Four boyhood pals perform a heroic act and are changed by the powers they gain in return. Years later, on a hunting trip in the Maine woods, they're overtaken by a vicious blizzard that harbors an ominous presence. Challenged to stop an alien force, the friends must first prevent the slaughter of innocent civilians by a military vigilante ... and then overcome a threat to the bond that unites the four of them.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3RtOffRhVHyST1d5BDVu5dnFI04.jpg",
  "categories": {
    "plot": 5.2631578947368425,
    "acting": 5.333333333333333,
    "ending": 3.4,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 2.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "How did my favorite Steven King book turn into this crap, the ending was a slap in the face?"
    },
    {
      "rating": "9",
      "text": "This movie and the story isn't that bad at all and seriously under evaluated. Not a masterpiece but really worth it if you like alien fiction.\rI wonder what people have in mind giving 10 to idea-free crap like The Gravity and 1 to Dreamcatcher. Well, that's how it is."
    },
    {
      "rating": "0",
      "text": "By far and away the worst experience of my life. 134 minutes just completely drained down the toilet, which according to this movie contains aliens that come and enter my ass. I have never been more irritated and unsatisfied as I was at the end of this movie. I went in thinking a movie starring Jason Lee, Morgan Freeman and Tom Sizemore based on a Stephen King would be a can't miss. WRONG. In fact I have never been more wrong; the down syndrome/ alien Donnie Wahlberg angle was the most misconceived subplot I have ever seen in a movie and I saw Gigli and Longshot. I threw my remote at the TV after this and it literally ruined my whole day. If you are really considering seeing this movie call me first I will personally shove a snake up your rearend and kick you in the family jewels while I tell you your were supposed to be an abortion and your parents feel they made the wrong decision. I am putting everyone that had anything to do with this movie on a temporary timeout."
    },
    {
      "rating": "8",
      "text": "This movie was actually pretty good and certain parts of it were really good. The aliens were creepy and scary and the characters were entertaining. I've been meaning to watch it ever since it came out. I actually tried to watch it in theatres but was turned away for being under 14 years old. Finally watched it today, and I'm glad that I did."
    },
    {
      "rating": "1",
      "text": "Another shi*** movie based on Stephen King's books (like Carrie, It). I haven't read the book, but probably won't like it like the movie. Nothing really special in the sense of a plot, an idea, a development. Super bad made and directed. Not interesting at all. 1/10 just for the try.."
    },
    {
      "rating": "7",
      "text": "1st Of All I Love Stephen King Movies!2nd Of All This Movie Is NOT For Everyone!3rd Of All This Is Fun To Watch And A Good Film.. But You Dont Feel The \"King\" Spark Like From His Other Films...It's Weird But Still Good...I Recomand This To Any Hard Core Stephen King Fan...."
    },
    {
      "rating": "0",
      "text": "Quite possibly the worst movie ever made!"
    },
    {
      "rating": "8",
      "text": "Just watched this movie in 2011, special effects not all that bad. Suspenseful and eery while maintaining a solid storyline. Haven't read the book. Entertaining movie."
    },
    {
      "rating": "8",
      "text": "The acting was good, it was entertaining and interesting and the special effects still hold up quite good today. Even though the movie is not like the Stephen King novel, I'd say that as a stand alone film, it's a good movie."
    },
    {
      "rating": "10",
      "text": "As can be said about many movies, this one is not for everyone. Some films have a broad appeal, this one does not. I love it. As with all Steven King novels/adaptations, it shows what people are capable of (good and bad) by putting them in extreme (read unbelievable) situations. The people in this movie are flawed but noble and offer a good window to the soul. Suspend reality, and commit yourself to the people more than the plot and you can enjoy it as well."
    },
    {
      "rating": "6",
      "text": "It's a stupid movie. A rather juvenile affair. You've got burping, farting, and aliens crawling out of people's buttholes. However, there is a sense of brilliance and imagination here. Deeper elements going on in the background to make it more mature than it otherwise seems. It really makes me wish I read the book. Unfortunately the movie seems to focus on the stupider elements of the Stephen King novel and leaves the more thoughtful ones to the wayside.\r Like most Stephen King stories, this is very character driven. Only it seems somebody forgot to tell the director that. There is painfully little context as to whose these people are or how their little catchphrases, nicknames, and shared insights originated. That's the issue with the movie. It's more intelligent material is left unexplained. It merely lays out the basic plot and asks viewers not to ask questions about the deeper fiction holding all together that was required for it to succeed in the first place. As far as the plot goes, it just leaves you wondering. Baffled as well.\r Yep, this body horror is all about the blood, guts, and bodily functions. The movie approaches all of these with a sense of glee and self-amusement. The results are surprisingly not terrible. I can't attest to how well it stays faithful to the source material, but one thing is certain and that's Stephen King certainly got imaginative with this one.\r It's all really bat crap crazy. Certainly one of the most unique and unpredictable movies I have ever seen. The cast seems totally committed, even if there is a certain hammy tone to each of their performances at times. It's the level of insanity on display that adds an entertaining nature to the film. It's hard to not be interested in what's going on even if you are just there to look for answers that will never come.\r I can't say I totally feel like I wasted my time on this one. I was certainly never bored with it. The plot and immaturity left me disappointed with the overall results, and it's certainly not scary in any way. That being said I still had fun with it even in it's childish of moments. Admittedly despite myself.\r Does that mean I can recommend it? Yes and no. If you are looking for a movie truly unlike anything else out there then it's definitely worth a look. It won't leave you completely satisfied with the end results, but at least it will get you thinking. However for those looking for genuine frights and thrills to go along with the gore, as well as a plot that won't leave you frustrated and clueless with it's more compelling elements, then you should likely look elsewhere. Dreamcatcher isn't exactly a bad film. It's definitely got it's enjoyable elements. It's just not exactly a good movie either. That's because it fails to touch on the more complex parts of King's story."
    },
    {
      "rating": "1",
      "text": "Recommended only to those few sadistic people who enjoy watching aliens pop out of butt-holes and bite off human genitalia, complemented by poorly animated martians with british accents. Artistically bankrupt. Pathetic acting. Avoid at all costs."
    },
    {
      "rating": "0",
      "text": "I think roughly 99% of the people that watched this movie did so to catch the 10 minute Animatrix movie before hand.  Dreamcatcher was terrible.  Morgan Freeman's eyebrows almost poked my eyes out.I did learn that you develop an English accent after having your body taken over by an alien.  That was interesting."
    },
    {
      "rating": "5",
      "text": "i remember always seeing the snowmobile part on tv when i was young.....can't believe i never watched it.....this movie essentially makes the halloween watch list...even tho the 2003 cg is good for its time it will always be 2003 cg and i cant change that...to remake this movie would be stupid too cuz this one is still good....i noticed that adult duddits looked kinda like stephen king....was it stephen king>? the only people who survive....ones of them named jonesy and the other thomas jane,,,,anyway i like that the ability of the aliens to shapeshift was in the movie...that being said why can they shapeshift yet do nothing else.?"
    },
    {
      "rating": "2",
      "text": "This film is so bad that if it was just a little bit worse I would consider it \"so bad that it's good\". But it's not. \"Dreamcatcher\" is like a student's film. It's clear that the filmmakers had some marvelous ideas. Unfortunately, they had no idea how to execute them."
    },
    {
      "rating": "10",
      "text": "I've seen alot of movies of practically every category and to this day this still one of my favorites, I'll admit that I've never read the book but from what I've seen NO movie/tv is ever as good as the book, anyways, I thought this movie had a really cool unique story. In a world of predictable movies and remakes i think this one is definitely worth watching, its also full of good actors"
    },
    {
      "rating": "5",
      "text": "Bizarre!! A man poops out an alien. Yep, you read that correctly. That is not the end of the madness. The dialogue is so strange and so is the direction. It is just a weird film. It is enjoyable though and it looked and sounded really nice. It is even a bit scary in some places. It reminded me of Slither (2006) but less funny and more odd. Strangeness is afoot."
    },
    {
      "rating": "0",
      "text": "The trailers for \"Dreamcatcher\" want you to believe that it's a psychological thriller combined with science fiction aliens. The movie is, sadly, not the case. \"Dreamcatcher\" is not a \"Signs\". It is a spectacle of vomiting proprotions...[Potential spoiler deleted]. Not only that, it is a poor adaptation full of cliches and pathetic acting. The military aspect of the movie was emphasised on too much and I found the storyline about the Down-syndrome kid a bit disturbing."
    },
    {
      "rating": "6",
      "text": "Somehow, Stephen King movies never follow the book with the films endings compared to the books. Dreamcatcher isn't necessarily a bad movie, but it isn't a good one. As it lagged through the middle of the movie, I found myself waiting, starring at my computer screen, waiting for the movie to pick up where it first started."
    },
    {
      "rating": "1",
      "text": "This film works FAR better as a book. They should have never adapted it for the screen. Many of the inner voice dialouges that worked so well in the novel just don't work in a movie like they were meant to be, and the movie often feels like a bad joke. Along with horrible acting, storytelling and plot development, Dreamcatcher is also horrible at entertaining the viewer. The CGI was overbearingly fake looking and the awful performances from the usually decent actors did nothing to rectify it. Two thumbs WAAAAYYYY down! The only reason i gave it a 1 is because my sister and I got SUCH a laugh out of this bad film that it was at least worth viewing once."
    },
    {
      "rating": "0",
      "text": "Sci-Fi / Horror genere has been always my favorite so naturally i'll try to get involved into it. Idea of movie was all i could desire but it wasn't perfect tough. Needless to say i enojyed watching it. I wasnt really happy with the cast plus characters were dull and boring but they did their job. I wasnt really satisfied with the enviroment either, there was nothing but snow so it was also dull and boring. Story was great in the other hand. With more effort and bigger budget this movie would have been awesome."
    },
    {
      "rating": "6",
      "text": "I am divided by this movie. I like what I see but often thought that I missed some context or a bit of information and this lessens the experience. I thought that they cut out some scenes or could not do all they wanted because of budgetary reasons. Also parts of the story or reveals feel unbelievable. However this could be just me to be fair but others complained about that too to be honest too. It is based on the Stephen King novel Duddits that I have not read. So I cant say if it is a good adaptation and you don't have to endure the unavoidable “The books are better” statement. Stephen King was mostly unlucky with his adaptation. For each Green Mile or Shawshank Redemption there are many poor adaptions of his works. This movie here has a good set up, fascinating ideas and concepts but also misses the higher marks and has some weaknesses too. Story: It is set in 2 time periods like other Stephen Kings stories and the past is told in flashbacks. In the past as children the friends Beaver, Jonesy, Pete and Henry saved the disabled boy Duddits from bullies. They received an incredible gift from him in return. Years later now as adults the four of them have a habit of making an annual hunting trip. However this time it will be something no one anticipated as strange things happen. With this set up the story starts and I keep it spoiler free. Like I already said I am divided. Parts of the story are great and others fail for me. For example the final reveal for Duddits got me immediately out of the immersion and I started to question myself how this is possible and be undetected. The storytelling lacks a bit of coherence. I always felt that I missed something or skipped a part with explanations. I should be a bit more ironed out and I see why others rated this lower. Also while I like the menacing situation I always felt they could do this better. The menace should easily win with their available tools and it reminded me of “Signs” were they do a similar stupid thing. So for the story it is a hit and miss at the same time. Actors / characters: I think we got a good cast with Thomas Jane, Jason Lee, Damian Lewis and Timothy Lewis as the four adult friends and Mikey Holekamp, Giacomo Baessato, Reece Thompson and Joel Palmer as their younger versions. Good performance by all of them and I saw no missteps. Of cause we have Morgan Freeman as Abraham Curtis in a really good performance. I repeat as in many other reviews that there is no bad performance or truly bad movie with Morgan Freeman. Other than those I liked Donnie Wahlberg / Andrew Robb as Duddits and Tom Sizemore as Owen Underhill. We got a good overall performance but those could not save the movie from the weaker storytelling. Presentation wise I thought the movie looked good. While most special effects worked really well there are some exceptions. Overall I see the potential of a better movie underneath the problems. It is not truly awful but also not great. Maybe to much mixture of genres and not enough focus on the strengths of the story like the set up, characters and menace."
    }
  ]
}