{
  "id": 3569,
  "title": "Dredd",
  "starring": [
    "Karl Urban",
    "Olivia Thirlby"
  ],
  "runtime": 95,
  "genre": [
    "Action",
    "Science Fiction"
  ],
  "description": "In the future, America is a dystopian wasteland. The latest scourge is Ma-Ma, a prostitute-turned-drug pusher with a dangerous new drug and aims to take over the city. The only possibility of stopping her is an elite group of urban police called Judges, who combine the duties of judge, jury and executioner to deliver a brutal brand of swift justice. But even the top-ranking Judge, Dredd, discovers that taking down Ma-Ma isn’t as easy as it seems in this explosive adaptation of the hugely popular comic series.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wLx65gtGVnUFCxceHWGszcruCZj.jpg",
  "categories": {
    "plot": 9.64102564102564,
    "acting": 9.64,
    "ending": 10.0,
    "soundtrack": 10.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 9.6,
    "action": 9.619047619047619
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Fantastic film! Karl Urban and Olivia Thirlby (must admit, never heard of her before) work really well together! Had the perfect mix of action and story/ character building. And the 3D was nicely done too. Didn't find it distracting at all and was used in just the right places.\r Bit weird seeing Lena Headey as a gritty character though, as used to her being the pretty one in film/ TV."
    },
    {
      "rating": "10",
      "text": "The critics giving this a bad review either decided they weren't paid enough to give it a good one or have an allergy to extreme badassery. This is the most accurate portrayal of Judge Dredd we could have hoped for. And as for \"no humour\". There humour but it requires a strong stomach. Much like... you know... the comic did."
    },
    {
      "rating": "10",
      "text": "No need to dread this Dredd.  Karl Urban nails the title character, and staying true to the comic book, that helmet never comes off.  The audience is introduced to Dredd's world through the eyes of Dredd's rookie partner Anderson, beautifully played by Olivia Thirlby.  The movie starts off with a bang, and doesn't let up.  Stylish and violent, this is one of the better comic adaptations this year."
    },
    {
      "rating": "10",
      "text": "One of my personal favorite movies of the year, Dredd delivers in every way. The story is pushed by Dredd's commitment to law and the rookie, he's a gruff badass that shines throughout. Karl Urban nailed the character, you can always tell there's something deeper with him, but he pushes the story with bloody and relentless violence. The cast is superb, I love the film quality, and there isn't one slow moment the entire film. It's some of the best action I've ever seen and a very hard R rating, but if you don't mind that, jaw dropping and absolutely brutal violence, with a smart and simple plot that flows on its own, you'll love Dredd."
    },
    {
      "rating": "10",
      "text": "Metacritic, I have to say, is a terrible review site for movies and games. The only part of this site I trust is the overal score given by users.\r Besides from constantly choosing critics who give truly crap games great scores, it is terribily flawed when it comes to movie reviews, Dredd, which was made in South Africa,  is a an example of this. Just prior to release in the United States, metacritic had 6 (6!) reviews of Dredd while rottentomatoes.com had more than 50 with a 90% approval rating. WTF? Why so behind in the sample base and those reviews on tr STILL haven't been included after its US release!\r Now, since it's release in the US, many American reviewers haven't the first clue what Dredd is about, the comic book history or that it is a satire on the political climate in both the UK and the US and the consumer-obsessed and often violent culture of the US, particularly in the 70s through 90s. This movie is an absolute hit in the United Kingdom and Canada. Yet, many American reviewers don't get the satire (see above) or they feel offended about Dredd's premise being set in a futuristic US - and its bleak outlook of the society and culture - and the movie's message about violence and US society. Either way, metacritic sucks balls and many American reviewers are thin-skinned, ignorant nationalists who buy into any soppy jingoistic American-made fluff pieces to get them through their pre-packaged, cotton-balled little worlds. My two cents."
    },
    {
      "rating": "10",
      "text": "Dredd, the final movie that be based on a comic book of this year, and what happen? The movie is awesome, have a great story with a really good development, the performances, the effects, all is incredible in this movie."
    },
    {
      "rating": "10",
      "text": "A nice simple action movie. Very stylish,easy to follow story,good effects. It does however have incredibly over the top violence so not one for the faint of heart."
    },
    {
      "rating": "10",
      "text": "Finally everyone's favourite scowling future lawman gets the movie he deserves. Karl Urban and his impressive chin give an awesome introduction to the character. The decision to make the movie an 18 was also awesome despite the reduction of market it resulted in, it allowed the brutality of Dredd and his world to be properly portrayed. And on top of all of this it looked amazing! I just wish more than about 4 people went to go and see it"
    },
    {
      "rating": "10",
      "text": "I was shocked to see how low rated this movie was.  It is one of my favorite films of all time.  Well directed, well written, well acted, with good chemistry between the leads, and a scary villain.  This is an excellent film all around, a good war story, and it rings true throughout.  Highly recommended."
    },
    {
      "rating": "10",
      "text": "Great film; it doesn't mess about. The plot is simple but well told and the production is really tight. In particular I loved the music score, I might actually buy the audio CD which I've never done for a film before. I saw Dredd in 3D and it worked really well.\r I doubt a sequel will happen but it would be amazing to see more of MegaCity1."
    },
    {
      "rating": "10",
      "text": "Man, what a thrill ride. Urban was perfect as Dredd. Like an idiot and lot of other people, I missed out on Dredd in the cinema. Apparently the 3D was mind blowing. And thank God this wasn't watered down to a child-friendly PG-rated joke. Like most adults, I'm not interesting in seeing kids movies. I'm praying for a sequel and a re-release of the original. Hopefully the massive DVD/Blu-ray sales will get it over the line."
    },
    {
      "rating": "10",
      "text": "After two and half years I finally saw Dredd the other night and I was right to want to see it, Karl Urban is a complete badass as Judge Dredd and Olivia Thirlby is just great as Anderson. The action is a true example of how action scenes should be done, brilliantly choreographed and when slow motion shots occur, they are breathtaking, things like blood hitting a wall look stunning at a tiny fraction of it's normal speed and glass flying look like diamonds. I can't say enough how happy I am after seeing this movie and it is probably one of the last good r rated movies that isn't dumbed down for kids to see which makes me disappointed in the industry now. Hopes of a sequel are all but impossible but if there ever is, I will be the first in line for the this art movie."
    },
    {
      "rating": "10",
      "text": "Simply put: I think this is the best comic book movie I have ever seen.As the credits rolled, I was left with a weird feeling inside: complete and total satisfaction, and not a single complaint.With a remarkably light budget, this film perfectly tells a story in the world of Dredd. It doesn't over-exaggerate the stakes: a drug lord is endangering the lives of ~10,000 people. She's breaking the law. So she cannot be allowed to continue.Dredd, gruff and unfeeling, shows up to dispense law and order, which just happens to coincide with justice. His helmet doesn't come off. There is no two-dimensional romance with Judge Anderson. There is a relationship and a mutual respect, but it stays PERFECTLY respectful to the source material.When all is said and done, with hundreds of criminals in this vast urban cityscape dead, and Dredd is asked by his commanding officer what happened, Urban perfectly captures everything Judge Dredd is with two simple, blunt, un-pretentious words: \"drug bust\".Just another day in the life of Dredd. God bless everyone involved in the making of this film, and here's hoping they scrounge up enough for the sequels."
    },
    {
      "rating": "9",
      "text": "My expectations were low but this was a largely succesful attempt at capturing the spirit and tone of the original comic with Karl Urban proving to be the perfect Dredd, giving his performance the requisite amount of cynicism with the occasional glimpse of humanity. Not usually a fan of action movies but i was gripped by this...the stylish cinematography especially evident during the slo-mo scenes that that have a dream-like quality and really suck you in.  Dark, unsentimental, with no attempt to pander to Hollywood tastes, i just hope there's a sequel despite the relatively disappointing box office showing."
    },
    {
      "rating": "10",
      "text": "This movie is amazing, I thought the reviews were underrated for this movie. Everything about this is epic and exhilarating and you'll want to stay till the very end but I would not recommend this movie to kids because of the violence, bad words, drug references and rape references."
    },
    {
      "rating": "9",
      "text": "Suprisingly good movie.  Good storyline and decent acting.  Go see it if you ever read Judge Dredd or if you enjoy action sci-fy flicks.  I especially liked the fact that it was believeable.  The designer drug was very smartly done."
    },
    {
      "rating": "10",
      "text": "This was a great movie. Anyone who likes action movies should love this. It has some of the same feel as the original Die Hard did. This is basically everything that a Judge Dredd movie should be.\r If you like action movies, you owe it to yourself to at least see this one once. I already consider it an instant classic and I definitely see it as something that will get a cult following as more people find out about it."
    },
    {
      "rating": "10",
      "text": "Dredd 3D is super awesome. Like The Raid, the film is crazily entertaining. Other  critically acclaimed films  are much appreciated but come on metascore, seriously! It's film is way beyond what you saw in the trailer. The critics NEED to get their eyeballs checked. This film was mind blowing,  everything was good about it! From the car crashes, to the gory action and to the wicked performances, Dredd 3D is the movie of the year! 10/10 MUST MUST MUST MUST MUST MUST WATCH......"
    },
    {
      "rating": "10",
      "text": "Dredd is action packed. It is full of gore. It kept me on the edge of my seat. This is non stop action. Disturbing at times but that just adds to the dark and sinister tone of the movie. Dredd is the best movie of 2012."
    },
    {
      "rating": "10",
      "text": "Somehow lots of really great and original action films get underrated, and this one is not the exception. You see, if it would had been directed by Cameron or Nolan, it would have been praised by critics."
    },
    {
      "rating": "9",
      "text": "Sometimes situations happen and you are required to either step up or step out.\r Dredd is that primaeval part of the human condition that only knows how to step up... and blow a big freakin' hole in the problem.\r The story, on the surface, is a simple one but it took me until the following day to really realise 'Damn...that WAS a really great film'. The reason is because Dredd is so stripped down compared to todays CGI laden, $200mil blockbusters it caught me off guard. Films like this don't really get made anymore. The filmakers have taken what they had to work with and have done no more or less than they should. I would challenge anyone to pause the film anytime and not appreciate that any frame of this film could have been pulled from the pages of a 2000AD prog, such is the calibre of the cinematography. Dredd is a near perfect example of solid SFX together with great story telling without the painful spoon-feeding that happens far to often in modern cinema. It's an education in good film-making.\r The character of Judge Dredd is refreshingly straightforward. The slight hint of a backstory presented to the audience when the character of Anderson is introduced is quite simply genius.\r In todays society, people too often look for extra recognition for their endeavours. The 'Look at me, look at me' syndrome. Dredd, however, after overcoming a brilliantly deadly situation; his report to the Chief Judge is simple: \"Drug bust...Perps were, uncooperative\" A good lesson in the lost art of understatement.\r !!!The Man in the Mask!!! Even Peter Weller got a good chunk of full face time in Robocop but with Dredd the studios needed an actor who was prepared to (quite rightly) cover the majority of their face for 100% of the film. Step up Karl Urban. The man was born to play this role. Dredd is not a muscle bound superhuman, just a bad ass with a badge. No voice, dialogue or down turned mouth has been so effective since Clint Eastwoods' 'Man with no name' from the Sergio Leone trilogy.\r A sequel would be a lovely thought (Please bring back the same main actors) but with box office takings poor the chances are slim. Who knows though? This film stands up on it's own and a bigger budget sequel might be a poison chalice to what is a truly remarkable accomplishment.\r DREDD is AWESOME"
    },
    {
      "rating": "9",
      "text": "Thoroughly enjoyable action film. Karl Urban is fantastic as Dredd...perfectly cast. The supporting cast is also excellent; I especially enjoyed Lena Headey's performance as the Villainous Ma-Ma.  Hope there is a sequel to this eventually."
    },
    {
      "rating": "9",
      "text": "The first Dredd movie starring Sylvester Stallone was just plain awful. I loved the extreme (in both comedy and violence) comic way back. I watched the new Dredd last night and did´nt have any expectations what so ever. I was just great fun. simple but clever story, great effects and Karl Urban does a brilliant job as Dredd. Highly recommendable."
    },
    {
      "rating": "10",
      "text": "Easily one of the greatest comic book films ever made, especially considering this film's meager budget. It was dark, it was gritty, it was complex enough to keep you interested but focused enough to not throw you off and get too distracted with itself.\r It was a very wise move on the part of Director Pete Travis to focus the attention of this film in one location rather than across the entirety of Megacity 1.\r Mama (Lena Headey) felt so true to the spirit of Judge Dredd as a gang-leader in the 2000AD universe that I could've sworn she was taken directly from the comic books.\r Karl Urban made a fantastic Judge Dredd, with a straight, autonomous, and unemotional by-the-book keeper of the law which, again, felt so faithful to the original comics.\r The shooting of the 'slow-mo' scenes were again so fantastically done and so entrancingly beautiful and cinematic that they really did paint the picture of the effects of this drug in this world.\r All in all, I would HIGHLY recommend this immensely underrated film to fans of the 2000AD comics, as well as fans of sci-fi action and comic book films in general."
    },
    {
      "rating": "9",
      "text": "Violent and gorgeous.  A pure, euphoric art-action movie.  Someone made a comparison to Drive....and I thought Dredd was better than Drive.  Far less pretentious.  This movie isn't for everyone, obviously.  If you are a gun-control spouting hippy...or a bearded, chin-scratching, professorial sociologist...or anyone else who carries sentiments along these lines...i.e. if you are a Nancy, then you will not like this film.  It was not made for you, so don't bother seeing it...or reviewing it.  For the rest of us who can appreciate this genre without succumbing to the desire to become violent ourselves....bon appetite!"
    },
    {
      "rating": "10",
      "text": "Wow what a great movie...and this was unexpected after i saw Stallone's Dredd. Urban absolutely nailed how Dredd is portrayed in the comics..He never takes his helmet off..and he's a complete hard ass. Even if your not a Dredd fan or never have read the comics, go see this movie! One of the best action flicks ive seen in a while! My only regret was not going to the theaters and watching it"
    },
    {
      "rating": "9",
      "text": "Solid, very solid.\r I come into action films like these expecting to enjoy most of the 'show', but often find there are a few scenes where it feels counter intuitive (characters doing stupid things or not making obvious choices) or lines of dialogue that just don't fit and can irk you out of the immersion. You want to root for the main character until they do something dumb, right? Dredd didn't do this for me and that's a victory unto itself. The production was excellent, everything looked and felt right, nuff said. I think 3D is rubbish, but I'm sure for those that like it the SLO-MO scenes will dazzle them and only add to the experience.\r I like a few would have liked a little more expansion on the main characters, but considering the very mysterious vibe around the two leads I think it probably would have detracted from the films atmosphere/direction. But, I think they've lined up a strong union between the main characters that would really lend to expanding on their backgrounds/working relationship for a future sequel.\r I'm not really comfortable commenting on the comic to film adaptation element as it's been over a decade since I've read any of the 2000AD comics. But, I think any fan with reasonable expectations (Knows how the film industry works/sucks) will be happily surprised.\r Bring on a sequel!"
    },
    {
      "rating": "9",
      "text": "If like me you are old enough to remember the old 2000AD comics that gave birth to Judge Dredd then you'll absolutely love this film.\rI think the only problem for this film is Stallone's very poor effort though I understand it has some weirdly cullt status was nothing about the Dredd charater. This film does get Dredd spot on. Dredd is not a super hero he is just a man with an extrodinary attitude and it's his conflited morality"
    },
    {
      "rating": "10",
      "text": "This was easily one of my favorite movies for 2012. I'm very familar with the Judge Dredd comic book and character. This movie nails the spirit of the character perfectly. Karl Urban's performance was excellent and I love how we never see him fully without the helmet, just like in the comics.\r The story is really intense and I was on the edge of my seat throughout the entire film. The 3D special effects are well done and impressive. I just can't say enough good things about this movie. It's easily one of the best and most accurate of all the comic book hero films."
    },
    {
      "rating": "10",
      "text": "Surprisingly good adaptation of Judge Dredd. Skip the 1995 film and give this one a watch, if you are a fan of the comic. I would recommend this movie to anyone that likes action movies with slick visuals."
    },
    {
      "rating": "9",
      "text": "What a surprise for me. This movie is very good. I like the dark, ugly Cyberpunk, so I like the world of Judge Dredd. The action was very good, the story also interesting."
    },
    {
      "rating": "9",
      "text": "This movie is fantastic and don't understand all the hate it gets from reviewers.  I was pleasantly surprised on how much I liked it because all the bad rap the first \"judge Dredd\" got, even though I haven't seen it.  The story is actually very simple, which is a good thing in this case, and is not convoluted at all.  It has one location in the story, again which is a good thing.  I thought Karl Urban was great as Dredd and seemed to play a seasoned badass that showed his skills well.  Some people think it's hard to cramn a multilayered story into an hour and a half, or even 2 hour, movie.  This took a single layered story and spread it out to an hour and a half but filled it with entertainment with hardly a dull moment.  Again this is a great film that should not be missed by action movie fans or fans of the comic."
    },
    {
      "rating": "10",
      "text": "Chemistry between Dredd and rookie is great to see on screen and acting is great in general. I like how this movie is action packed and heavy use of conventional effects are great for me! Kinda reminds me of old days of action movies with arnold and stallone tho Karl Urban was actually believable in his role. I justify giving this movie 10 because of the genre it represents that has almost died off in the reasent years. The plot is simple maybe too simple for some people but the movie is not about that its about the rookies and dredds onscreen chemistry and great action scenes. Truly amazing movie that sadly didnt do too well at the box office probably bacause of the bad advertising"
    },
    {
      "rating": "9",
      "text": "Dredd is the type of film which should be widely publicized and enjoyed by comic fans, action fans, and sci-fi fans, but gets overshadowed by inferior films such as Thor and Captain America and Man of Steel.  It is way better by far than most of the big name super hero films - the story is tighter, the action is tougher - it is just plain good."
    },
    {
      "rating": "9",
      "text": "Critics totally got it wrong for Dredd. With Stallone's awful portrayal of Judge Dredd before, there was reason to be worried about another Dredd film. Luckily, it turned out one of the best action films of the year. Brutally violent in the best ways possible, with awesome action pumping all the way through the film. The slo-mo drugs adds an ace colourful effect to scenes. Karl Urban nails his role as Dredd with helmet staying on all through the film, being dry and using deadpan humour excellently. Such an underrated movie. So easy to watch with friends over and over again. Dredd 2 pleaaaaeesee soon!"
    },
    {
      "rating": "10",
      "text": "This film was the Dredd film fans were waiting for, a  faithful adaptation of the Dredd world portrayed within the comics. The pacing, acting, effects and music were all spot on when creating the right atmosphere for this film to work not to mention Urban as Dredd was fantastic. 10/10 from a Dredd fan. 10/10 for not removing his helmet this time!"
    },
    {
      "rating": "10",
      "text": "This is what a Judge Dredd movie should be like. Great acting, beautiful cinematography, visually stunning action scenes and gritty violence. This is one of the best movies I've seen in a while."
    },
    {
      "rating": "10",
      "text": "I was pleasantly surprised with this movie. I was expecting a remake of the light hearted and silly Judge Dredd movie from 1995 but Dredd is nothing like that. It's a well made action/sci-fi film with an excellent cast, creative use of special effects and a more serious approach to the story without making it boring or cheesy. It's a great action movie, an instant fav for me."
    },
    {
      "rating": "10",
      "text": "An absolute pulse pounding thrill ride in all it's bloody glorious violence! Dredd constantly delivers on the non-stop action packed scenes delivered in brutal graphic fight scenes. The hero and villain both compliment each other and the setting is just right for a high stakes shoot out like no other. It's not your conventional superhero movie, but that just makes it better. First time viewers can skip over the probably forgotten original, and get a better imagining in this one. The Law don't need no restriction limits!"
    },
    {
      "rating": "10",
      "text": "So fresh, so gory, so badass, top notch aesthetics and visuals, good one liners, the story progression and breathing space between the action is spot on, story is simple but the is told is incredible satisfying and leaves much for the thought a sort of madmax fury road.\r There might big some missteps but these are too minor and correcting them might hurt other good aspects.. It's a perfect 10 for me I want to see a sequel!"
    },
    {
      "rating": "10",
      "text": "Forget the Stallone adaptation; forget that this is actually an adaptation of a comic book; if you're in for badassery and want a film enjoyable both for group or self, this fits the bill.\r It's efficient in the story telling and character development, not go overthetop or dwelling in elements, but understanding just how much it needs to give so that we the audience care about the characters and the plot.  Hypnotic imagery shows up, surprising considering the source material and what you would expect otherwise.  Cinematographic excellence is the single most surprising element in this movie, with a director who not understands storytelling, but how to visually display the story that is haunting, chilling, and entrancing.\r Get some friends, get some beer, and sit back and prepare your mind to be esploded."
    },
    {
      "rating": "9",
      "text": "I started watching not knowing what to expect besides being an action flick, it started well but almost lost me with the \"mutant power thingy\" but as the movie progressed it was used effectively and mantaining internal logic so it grew on me as Dredd character.As a movie in general it has it lows and highs but specifically as an action movie is great: gory (without being tasteless), great action scenes, great visuals and a couple of main characters that grew on you as the story develops, it doesn't unnecessarily prolongs like most movies these days so that is also a plus.It have the classic action moments where the hero should have died but they are few and easy to forgive.I will recommend it to anyone looking for an action flick without a doubt."
    },
    {
      "rating": "10",
      "text": "A Visceral and brilliant screen exploration of a dark and threatening character. I loved this movie and still enjoy watching it time after time. The music is fantastic, the characters believable and the pacing of the story gripping to the end."
    },
    {
      "rating": "10",
      "text": "Love this movie awesome affects Urban is a great actor for dred. Dred fans should love and appreciate this movie I  hope they make another dred movie."
    },
    {
      "rating": "10",
      "text": "Great film. True to the source material whilst being fun, interesting and accessible to those who don’t know the source material."
    },
    {
      "rating": "9",
      "text": "Finally, a movie worthy of the source material.  A brutal non-stop action flick that starts fast and keeps going.  It develops a simple and effective plot and doesn't shy away from brutal violence without feeling gratuitous.Karl Urban gets a lot of mileage out of a gravely voice and never seeing the bottom half of his face, as it should be."
    },
    {
      "rating": "10",
      "text": "My expectations were low going into the film, but here I am scoring a 10. Really surprised how much I enjoyed it, real good movie"
    },
    {
      "rating": "10",
      "text": "Simply the best sci-fi/action movie we´ve had in over a decade! The design of mega-city one is spectacular, detailed down to the smallest pieces. I am really hoping the generic advertising, and low box-office don´t kill the chances for a sequel."
    },
    {
      "rating": "10",
      "text": "Remember when olivia thirlby was cute?  Dredd remembers.Jokes aside, I absolutely loved this movie.  I admittedly never read any of the comics, but from what my father who did tells me - it wasn't particularly unfaithful to them.If you love 2 hours of nonstop violence, you'll get a huge kick out of this movie."
    },
    {
      "rating": "10",
      "text": "I absolutly loved this movie. Reminds me of the 80's action movies I used to love, robocop, terminator, predator, diehard. You cannot go wrong with seeing this movie. I took my girl friend to see it and she even liked it. Dredd is not a familiar comic book character in America, but honestly its one of my favorite comicbook to movie adaptions alongside the likes of Avengers and Batman. It has humour but its pretty dark, lots of violence and blood. Karl Urban nailed the character and the writing was very true to the comic book. It respected the characters and story. Dredd in the comics never ever took of his helmet and if he did, you dont see his face. This is actually very important to the Dredd character and the fact that Karl Urban never takes of his helmet in the movie gives the character more depth. Even the actress who played Judge Anderson was good for the role. The pacing was awsome, keeping my attention the whole time. I loved this movie and its sad it didnt do too well at the box office simply because its not based on a Marvel or DC supehero. I would love a sequel to be made. Im dying for the blu-Ray to come out. And this review is coming from someone who isnt familiar with the character. I never really followed the comics. But the movie in itself is good enough to make me a fan of the character. And its a movie Id proudly have alongside my avengers and Dark knight Blu-Ray collection."
    }
  ]
}