{"id": 805, "title": "Drive", "starring": ["Ryan Gosling", "Carey Mulligan"], "runtime": 100, "genre": ["Drama", "Thriller", "Crime"], "description": "Driver is a skilled Hollywood stuntman who moonlights as a getaway driver for criminals. Though he projects an icy exterior, lately he's been warming up to a pretty neighbor named Irene and her young son, Benicio. When Irene's husband gets out of jail, he enlists Driver's help in a million-dollar heist. The job goes horribly wrong, and Driver must risk his life to protect Irene and Benicio from the vengeful masterminds behind the robbery.", "releaseYear": "2011", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/602vevIURmpDfzbnv5Ubi6wIkQm.jpg", "categories": {"plot": 8.48936170212766, "acting": 8.659090909090908, "ending": 7.4, "soundtrack": 8.222222222222221, "cinematography": 8.142857142857142, "familyFriendly": 1.6666666666666667, "funny": 5.0, "action": 7.96969696969697}, "reviews": [{"rating": "10", "text": "Easily one of the best films of 2011. The opening 5 minutes of Drive are simply extraordinary: zero music and virtually no dialogue, just the Driver outrunning the cops after a burglary. If you aren't instantly drawn in by the opening chase sequence, your favorite movie is most likely Transformers and you do not deserve to see the greatness this film beholds. This raw and realistic film is falsely advertised by its trailers; they make it seem like a hardcore action flick, but it turns out to be an intensely character driven story with very minimal, but effective, dialogue that progresses the story at a continuously entertaining pace. The cinematography is some of the best I've seen in years: it seems effortlessly smooth and endlessly creative. The plot is simple, but Refn's execution is, in part, what makes the film ultimately stand out. Another crucial part to what makes this film so enticing is its ruthless depiction of violence. I KNOW that some (actually, a lot of) people are turned away, or dislike, Drive solely because of its graphic violence. These people are dumb; IT'S A MOVIE (not real). The violence is as realistic as it gets, without being over-exaggerated to the point of blood spraying 10 feet into the air in all directions when someone gets stabbed. There ARE some very graphic scenes, but I feel that it's a reflection of the characters (especially Albert Brook's and Ryan Gosling's characters). Most of the film is actually absent of action/violence, in which i was pleasantly surprised by. It's probably a 75/25 split. Overall, if you have any appreciation of good film, you definitely need to see this film. It's amazing and should win a handful of Oscars."}, {"rating": "10", "text": "You're either going to love or hate this movie, as you can see from the user reviews already. Fantastic film, great on so many levels. Thank God it wasn't a Hugh Jackman Fast and the Furious film, as it was planned before Ryan Gosling got the lead. In addition he personally chose director Nicolas Winding Refn.. However, more users would have liked it if Michael Bay directed and Hugh Jackman staring."}, {"rating": "10", "text": "Drive is like nothing I've ever seen before. Rarely will a movie saturate its first 45 minutes or so with a gentle love story and then escalate so quickly into the horrific, grizzly, B-Movie violence that is Drive. This is what makes it such a powerful film. Its formulaic use of silence and violence makes it work and makes it work well. Go see it but keep in mind, it is not for the faint of heart mainstream audiences."}, {"rating": "1", "text": "After seeing this movie, I was first a little taken aback to discover how popular it was among the critics. I then realized why- they were attracted to its very obvious qualities of artsy-ness. It is as \"TomProCritic\" says. They responded to its artsy qualities- a few: long pauses for no reason, hesitation, unique camera angels, the use of techno and modern music, a kid who is not very childish...etc. The movie was dull. If you don't respond to hollow artsy crap, it falls flat. I only give it credit for having some truly terrific actors."}, {"rating": "1", "text": "This film resembles a classic case of \"Bait Art\" common in contemporary filmmaking, especially among young directors. They lure in film critics who are overwhelmed by a wide range of intense hollywood cinema and give them something digestible- a slow moving, short scripted, uneventful film- market it as artsy and put in some artsy music and artsy shots to complete the picture. Drive, for the rest of us, is nothing more than a ridiculously forgettable movie with some great actors. The film is painfully slow, painfully cliche and above all overdramatic in delivery. It never feels real. Made for the elitist critics, not for people like us."}, {"rating": "0", "text": "\"listen2themovie\" and \"memphisfeast\" have it right. The artsy-ness of this movie tries to distract you from how lifeless the plot is but instead make things worse. It really is one of the worst cases imaginable of critics bait."}, {"rating": "9", "text": "This movie was amazing and Ryan Gosling gives a phenomenal performance from start to finish in this movie. Also, there is some amazing camera work in this movie and there is even some brilliant lighting used in this movie. Finally, this movie is a very bloody action movie which I really enjoyed and almost forgetting to mention that Ryan Gosling has got some great chemistry with most of the characters he meets on his way throughout this movie. Overall, this movie is really good and its surprised me on how good it really was, holy moly!!"}, {"rating": "10", "text": "Drive is a fairly sophisticated and barren piece of movie-art. The violence and crime progressively gets rather disturbing at the end but it is always appropriate and done in thoughtful style; the silent and laid-back main character (Driver) adds further authenticity which results in an even mood throughout the entire film and leaves you thinking that the Michael Bay or Gore Vorbiski type of movie should probably be worried as Drive might be a replacement for this; further installments will let us know."}, {"rating": "10", "text": "This is one of the best movie I have ever seen if not THE best. It is so refreshing to finally see something different. There is a lot of silent moments in the movie and all of them are pure gold. Here, pictures are more important than words. Gosling plays a character that you care about even if he barely speaks. The story is simple but, as I always say; what matter isn't the story but, the way you tell it. Don't watch that movie thinking it will be a fast and furious clone because you will end up posting a 0/10 review on metacritic. Everyone have their opinion  BUT, it doesn't mean that your opinion is true. If you don't like the movie, fine, enjoy fast and furious #56. Drive is a piece of art from start to finish. Watch it with your mind completely open and I am sure that it will be blown away."}, {"rating": "10", "text": "I have been a champion of Nicholas Winding Refn's films for a few years, and DRIVE is his best film yet and my new personal favorite film. The film is brutally intimate and subtly beautiful. Gosling's soft spoken almost silent protagonist reminded me of Robert de Niro in Taxi Driver. The amazing synth soundtrack, the long shots of characters faces as the director forces you to feel their emotions, to the amazing use of horrific violence that you a sense of real desperation, DRIVE is a perfect film."}, {"rating": "9", "text": "The director has made the duologue, or lack thereof, work throughout the movie. The camera work is well done. The action scenes aren't too over the top which makes things even better. The only thing I'm a little irked about is, nothing about how the driver knew all his tricks is revealed. But forgiving that minor detail, the movie is very thrilling and will keep you in your seat until the very end, guaranteed (You'll know what I mean if you watch the closing scenes)."}, {"rating": "8", "text": "This high-acclaimed black noir of our era has accumulated \"best-of-the-yearâ"}, {"rating": "10", "text": "Settle noir, intense violence, and a thrilling yet mysterious story. Though slow at first, the movie picks up right in the middle, and hardly lets up from there on. However, even the slow parts held my attention. It's unfortunate that this film probably will not get the credit it deserves as one of the best films of the year. Amazing performances from the entire cast, and it's a must see for the cult film followers."}, {"rating": "10", "text": "Unbelievable. I can't remember the last time a movie made me want to stand up and cheer when it was over. Heck, I wanted to stand up and cheer after the first five minutes. Everything here is top notch: the acting, the cinematography, the direction, and the action scenes. Don't go in expecting your traditional action movie though, you will probably not get it. This is borderline art house, from the cinematography to the lack of dialogue. This is a movie for people who love great movies or, more specifically, the art of cinema. If that doesn't appeal to you (or you're turned off by relentlessly graphic violence), stay away. Those who haven't been satisfied with giant robots and superheroes this summer should definitely check it out. I don't think you'll be disappointed."}, {"rating": "9", "text": "The first 5 minutes of \"Drive\" is Worth the price of admission ( 6 bucks, if your askin' ) stylish photography, tense, terse with several brilliant scenes within; but the \" Art House Gore\" in lieu of a more solid script mars the effort. Rated \"R\" ( Nudity, language, unsafe driving practices ) \"X\" for Violence;- - and never, EVER pose a threat to this young mans Girlfriend."}, {"rating": "9", "text": "Shot gorgeously, terrific acting, and compelling yet semi-believable chase scenes. I enjoyed the hell out of it. I don't know how this is too \"artsy\", except in comparison to crap like Transformers or Final Destination. I've seen movies that are too artsy, they definetly exist- most of them are pretentious film festival entries or indie dramas. Worst you could say about Drive is that there are some awkward silences. So yeah, awesome film."}, {"rating": "10", "text": "The Film is a masterpiece and the best movie of the year. This film has it all, a love story, great symbolism, suspense and a well paced out film. However what is so impressive about the film is the style it chose. The director chose an artsy style and tone to dominate the screen.  The film should be just another fast and the furious film but no it is much smarter and very well done. Ryan Gosling's performnace is one of the keys to the film. He stays true to his character the entire film. He does not speak often which emphacises all the words he does say. We don't learn about the driver through his words but instead through his actions."}, {"rating": "9", "text": "I thought it was fantastic. Great soundtrack, sleek, low-key, but powerful. Maybe a little over the top w/the violence. But Ryan Gosling was absolute perfection. I can see why some people wouldn't like it, but I personally loved it."}, {"rating": "10", "text": "Everything about the film Drive is good. From the lead actor, supporting actors, the script, the direction, the action, the drama, and the music. Drive is the most endearing film I've seen in a while."}, {"rating": "10", "text": "Not for fans of mindless big explosion movies. This isn't your typical action film. It's pretty artsy in terms of very well done cinematography, not much dialogue from the main character, very still scenes, but it's not bashing you in the face with that. So yes, I do feel like even people who don't really care for art films can still get into it. The movie is well paced and when the mood changes, that when you know **** just got real. It can be disturbing and shocking at times due to the ultraviolence which is quite typical of Refn is you've seen any of his other films, particularly Bronson. Even if you don't like the film you have to admit the acting is VERY well done by everyone."}, {"rating": "10", "text": "The way the film was directed caught my attention. I couldn't stop watching it had me hooked from the start! Plus Gosling is extremely good looking and his attitude in the film is irresistible."}, {"rating": "10", "text": "At its most basic level, Drive could be described as \"The Transporter with a brain\". If you yourself possess even half a brain, you'll realise that it is so much more. Drive is a beautiful, thematically rich and powerful film. The whole cast are superb, with Ryan Gosling imbuing The Driver with a deep, brooding emotion, and making him a very engaging protagonist despite him being a character of very few words. It's a true testament to Gosling's skill as an actor that he can communicate to the viewer so much about what his character is thinking through a single facial expression, or physical act. The Driver is also the epitome of cool, from his scorpion-emblazoned white jacket, sunglasses and Clint Eastwood-esque toothpick, to the leather driving gloves he dons and the unassuming analogue watch he fastens to his steering wheel when on a job. Carey Mulligan is also extremely believable as single mother Irene, and has great chemistry with Gosling. It is because this central relationship, this unlikely romance works that The Driver gains much of its emotional leverage, and with the addition of a surprisingly effective soundtrack of soppy electro-pop love songs, the few moments of intimacy that The Driver and Irene share, and the ultimate tragedy of their story, is all the more affecting. Bryan Cranston is brilliant as always as the crippled garage owner and low-level mob dealer Shannon, Ron Perlman is entertaining as Jewish mob heavy Nino and Albert Brooks is simply terrifying as Bernie Rose, the psychotic razor-wielding mob boss who serves as the film's primary antagonist. The film is about fractured identity, and about redemption through good deeds. This never more clear than through the characterisation of The Driver. He remains nameless throughout the film, only referred to in relation to his profession - he is a functional tool before he is a person. It is only through his steadily growing love for Irene and her young son Benicio, and through his quest for justice in punishing the Los Angeles criminal underworld that he finds his humanity, and symbolically saves his soul, proving himself to be a real person. Building on these philosophically heavy themes, Hossein Amini's script is deceptively simple, but effective - he gives his characters enough to say to communicate their feelings and map their growth over the course of the film, but pleasingly he doesn't fall into the trap of convoluted, inherently unrealistic dialogue purely designed to show audiences how clever the film is. These are real people, speaking (or not, in The Driver's case) as real people do, and the film's heady themes speak for themselves, and Amini knows this, and smartly doesn't resort to highlighting them in his dialogue, which would have made it heavy and laborious, rather than honest and minimalistic as it is. Drive is not just an achievement for clever writing, but also a visual triumph. Cinematographer Newton Thomas Sigel uses his experience working frequently with Bryan Singer extremely effectively here - like in X-Men or Valkyrie, he is demanded in Drive to adapt his filming style to a number of visually and tonally different sequences - whether it's an expansive aerial shot of the glittering L.A. skyline, or a frantic car chase, or a more mellow and intimate moment in Irene's apartment, Sigel always rises to the challenge and creates something visually striking. The cinematography, married with Matthew Newman's masterful editing and the effectively moody film noir lighting used throughout the film, Driver becomes a real thing of beauty. Nicholas Winding Refn continues to prove his talent as an extremely creative, intelligent director that isn't afraid to challenge his audience. He's also extremely adept at handling action, without reducing himself to mainstream drudgery - the car chases and shootouts are all entertaining, but aren't dumb and obvious, and have more in common with the work of Martin Scorsese than Michael Bay. Refn clearly knows that less is more, and is prepared to make you wait, to really rack up the tension before giving you a blood-soaked or tyre-smoke clouded payoff, and the set-pieces are far more powerful as a result. Drive is many things - a religious allegory, an intense psychodrama, a tender love story, a gangster-thriller, a film noir, and it even has much of the iconography and themes of a classic Western. It looks great, sounds great, is well-scripted, clever without being pretentious, packs a real emotional punch and is extremely well-acted, particularly by the mesmerising Gosling. Simply put, Drive is stunning."}, {"rating": "10", "text": "Tarantino's fan ? Watch this movie you're going to love it. Actors are brilliant. Maybe one of the best part for Ryan Gosling. For me, the best movie of 2011."}, {"rating": "5", "text": "I tried to give this movie a chance. I like films that do something different. The first five minutes were great. Then, the rest of the movie happened. The main character was so unrealistic when it came to human interaction it was painful to watch. It was like he was mentally handicapped or stunted, and that is to put it lightly. I am glad that I didn't pay to see this film in theaters. The action was so-so, but I was just glad it was only 100 minutes. I found myself almost asleep thirty minutes in. How this movie got critical acclaim is beyond me, and I am a movie guy who likes quirky films."}, {"rating": "4", "text": "Artistically, the film is impressive. However, I wouldn't recommend watching it with friends as a casual movie night thing. It's more of a film to be appreciated for its cinematography rather than its plot."}, {"rating": "2", "text": "Extremely over-hyped and disappointing as well. I do not understand why i find this moving so boring. It definitely has good actors but the plot really put me to sleep. I remember going to see this movie and people started leaving it mid way through. I sat through it only to be amused by the ending of the film. I understand the audience its targeted at, but its artistic silent vibe was not working for me. Most people I did show it to also got very disinterested in it as well."}, {"rating": "9", "text": "Although Gosling has been stronger, more dynamic in other films (Blue Valentine, Lars, Half Nelson), he brings such intensity and subtle emotion to what amounts to a relatively shallow character.  Without dwelling on the details of the film to any great extent, I don't think that I haven't seen a film since maybe Hurt Locker that has made my heart feel like it was going to beat out of my chest like this one did. I'm not a fan of Carey Mulligan at all - couldn't stand her in An Education - but she's terrific in an understated role. You never plummet the depths of the driver's soul, but that is unnecessary - I can't imagine anyone else doing what he did here.  Jason Statham?  Nope. Burt Reynolds?  Nah. There's something about the timber of Gosling's voice that just works in a role like this one."}, {"rating": "10", "text": "Drive is a milestone in filmmaking. There won't be a film like this in some time. Artistic, Brutal, Sweet, and Poignant. It will no doubt baffle many and I think that's its greatest quality. A maverick tour de force. I consider this film a Masterpiece. It is also in the running for my favorite film of all time."}, {"rating": "10", "text": "I was entranced by this film.  It was hypnotic from the beginning. All of the actors deliver and it is not as violent as some of the critics have said.  Ryan Gosling can do no wrong and he proves it for this director.  Albert Brooks is a thrill as a thug.  Great movie and comment on being a loner."}, {"rating": "8", "text": "Interesting look into a scarred anti-social individual who only feels alive, at first, when he exercises his automotive skills.  The lack of dialog between the two leads was hard for me to accept, but the attraction and distance they maintained seemed real.  Movie looked great, soundtrack unique, acting by all impressive.  Three excruciatingly violent scenes that only mirror the lack of humanity in the world these characters inhabit."}, {"rating": "10", "text": "Reading user reviews for this movie made me want to write a review. I just saw the movie tonight. It seems everyone is to wussy for all the violence this movie had. This is one of the best movies I have seen in a while. I really didn't know what was going to happen next. This isn't your typical action movie with car chases and everything blowing up. So don't expect the usual, but if you want something different give this movie a shot. While it does have action its just not done in a traditional way.The acting was great. Ryan gosling like you have never seem him before. The story was good, the camera angles and everything was just different. Don't listen to the people complain about violence, go see it. fantastic movie."}, {"rating": "10", "text": "I cannot comprehend how everyone can decry a movie because of its apparent 'artiness.' Movies are art, they are about more than just telling a story and seeing a guy's head implode. The silences are not without purpose, they are really quite powerful. That this move can be so great with so little dialogue says loads about the direction and acting. This is by no means a boring movie. I guess some people lack the intelligence to understand the subtleties of this truly brilliant movie."}, {"rating": "10", "text": "+Gosling is compelling. +The soundtrack is amazing. +Supporting cast is well-acted and adds to the realism.+It is subtle and not mainstream (which can be a good or bad thing depending on the type of movie-goer you are).-The story is good, but had more potential than it used.Overall: Highly recommended for people who can think beyond what's happening on the screen and actually have some intelligence."}, {"rating": "3", "text": "I found this movie to be highly overrated. It is decent to begin with and makes you wonder who the main protagonist is, but it slowly turns into a bland, boring, and way too long movie. The main problem I had was that the main character doesn't speak. You can't build a connection with him. There was also an excessive use of blood. I love action movies with blood, but this is way overboard. The only reason people watched it was because all girls go crazy over Ryan Gosling."}, {"rating": "2", "text": "A very bad cowboys movie with a script at best uninteresting  a beautiful cinematography and a horrible soundtrack. Just realized this movie looks in fact like a celebrity of our decade  nice looking, nothing to say, bad taste."}, {"rating": "5", "text": "Good christ.  I recall watching this film with a buddy of mine and reaching the credits only for both of us to look over at eachother with our mouths open wide in shock.  \"What the heck was that?  That was terrible.\"  My friend said loudly.  He was totally outraged at how bizzarely boring the whole film had been and I was utterly blown away by the fact that it was obvious someone had found a short story at some point before the first script was written and had tried to adapt it to a screenplay without realizing it was a total DOA mess.  The characters are dull, lifeless.  Ryan Goslings performance is lukewarm at best.  The soundtrack wasn't even memorable outside of one decent credit roller song at the end.  Though the action scenes are shot well, the rest of the film outside of those scenes just falls flat in terms of emotional conveyance.  The romance between the two main characters is unbelievable and creepy.  All of their scenes together are terribly awkward as well.  The main antagonists end up just being some old italian mob guys who just happen to be involved.  The plot is as shallow as they come and no elements seem to exist in \"Drive\" that would or could ever place it beyond or above completely mediocre.  Could've been made by a college film student with a smaller budget."}, {"rating": "10", "text": "Fantastic!  A true film.  Drive has meaning and heart, and the violence is justified by the story.  The cheesy scorpion jacket covered in blood says it all."}, {"rating": "2", "text": "I was really excited when I saw the preview for this film, an action thriller with a terrific cast is right up my ally, unfortunately, the three minutes of action in the trailer, showed the only decent action in the entire film. Ryan Gosling plays a Hollywood stunt man, who moonlights as a getaway driver, in a story that is both eerily similar to and nothing like The Transporter. The driver in this film is just as picky and OCD as Jason Statham's character in the Transporter, but that's where the similarities end. After a nice opening, this film quickly turns into some noir love story, that really focuses more on the conflicted driver, than on anything else, making this one boring film. How can a film company be allowed to put out an action fueled trailer for a film like this, which is anything but exciting. The clever advertising devils got me again, but facts are facts, and no trailer or good looking star can hide the fact that this movie was terrible."}, {"rating": "10", "text": "This movie has some of the greatest movie moments that I have seen in recent years. The cast is phenomenal, and Gosling was particularly fantastic. This movie should have been nominated for best picture. The fact that it was neglected makes me question the Academy's judgment."}, {"rating": "10", "text": "It's been a long time since I saw a movie that I fell in love with like this.  The movie grabbed a hold of me immediately; the opening sequence in this movie is one of the greatest beginnings to any movie I've ever seen.  It's extremetly suspenseful, and you can feel the tension through the entire 15 minute scene.  This is the way a \"driving\" movie should be, not that cornball Fast Five bulls***.  Once this scene ends, the real story gets underway.  Ryan Gosling plays the \"Driver\".  As his character puts it, (and I'm paraphrasing), \"You have me for 5 minutes.  If anything happens in that 5 minutes I'm yours.  After that, I'm gone.  I don't carry a gun, I drive.\"  He's a VERY quiet character, and I have no doubt that the biggest reason people may not like this movie is because of this.  There are some long scenes with no action and very little dialogue.  It sounds odd on paper, but it works beautifully.  The director (Nicolas Winding Refn) does a terrific job of creating an atmosphere, or a mood to convey the emotion of the characters.  The actors do a great job of backing up his vision as well, as they can covery their emotions very well despite having limited lines to work with.  Most of these scenes happen immediately following the opening sequence, and helps introduce and develop the characters.  Gosling starts to fall for the girl next door and her young son.  He learns that her husband is in prison, but when he unexpectedly is released early, Gosling is silently devastated.  This may sound like a love movie, but s*** hits the fan when Gosling finds the husband bloodied and beaten by gangsters looking to collect protection money from him while he was in prison.  The husband confides that he won't do the job they want him to do, but is considering it because the gangsters have threatened that they'll come for his wife and son next time.  Gosling decides he will step in to be the getaway driver on the job, and from there on out the movie turns into a high octane thriller.  There is an insane amount of violence in the 2nd half of the movie, so this movie isn't for the squeamish.  I won't say much more, because it may ruin the experience.  That's essentially what this movie is.... an experience like nothing I've seen before.  When's the last time you've seen a suspense/drama/thriller/love/crime/driving movie with a bad a$$ 80's synth pop soundtrack?  That's right... never.  This movie is completely original, and I'll even go as far as to call it a classic.  This movie will hold up VERY well over time.  If you don't like it, go watch Fast Five or Transformers or Twilight, you cornballs."}, {"rating": "10", "text": "Drive is by far the best movie I have seen the last few years! The 80's style works great, espacially the soundtrack is great. All the songs are made in the last 5 years but sound like they were made in the 80's. The combination of a great story, even better dialogue, a strong cast, strong camera work and one of the best soundtracks i have heard in a long time make's this a great movie. The dialogue between \"driver\" and Irene is feels awkward and stiff in a good way. A lot is said without using words. there is almost no back story of any character, its all about the story in the movie and not what happend in there past. Its good to see that between all the blockbusters made with large budgets there are stil movies beeing made like these. Its hard to describe why the movie is so good. I just can't get it out of my head! Just watch it! you won's regret it!"}, {"rating": "9", "text": "If anyone has not seen Drive yet, please go to your nearest RedBox and rent this movie.  Gossling does a fantastic job playing the lead roll as get-away/stunt driver in California.  Gosslings character, who is referred to only as \"the kid\" does not say much throughout the movie, which only adds to this unique film."}, {"rating": "10", "text": "Drive is perfectly executed for the type of movie that [in my opinion] it aimed to be. I can't find fault in it on any level and I believe that if one did not enjoy this movie it was probably due to the subject matter or graphic scenes."}, {"rating": "8", "text": "All the people saying they did not like this film were expecting a stupid action movie which is not what this is. If you thought The Avengers was the greatest movie ever made, then this is not for you because it requires an actual brain to watch it. Must see."}, {"rating": "9", "text": "Drive was my favorite movie of 2011. A superbly stylish movie with some incredible direction and a wonderful cast. Gosling and Mulligan are engaging in the lead roles, with Albert Brooks turning in one of the most surprising incredible villain performances in recent memory. Nicolas Winding Refn is one of the most interesting young directors working today, and I eagerly await more from him."}, {"rating": "9", "text": "Drive is a movie for smart people who know that it doesn't take explosive action or over-the-top stunts to make a good movie. It is a film that is devoted to characters and storytelling rather than shoving action into the viewer;s face. While there is some action here and there, the film is built around developing the characters and using silence to build a mood that I haven't seen or felt much in other movies. Ryan Gosling doesn't say much in the film, but his performance and attitude is what makes the film. Everyone else is either good or great, but Gosling steals the show. Overall, a great movie that should not be seen as what the trailers have shown."}, {"rating": "10", "text": "Drive is, in my opinion, the best film of the past couple of years. Better yet is that I wasn't expecting it... at all. With a title like Drive, and a pretty-boy star like Ryan Gosling (whom I had greatly underestimated until this film - poor judgment on my part), one would expect this to be a Hollywood blockbuster action movie with lots of cool chase scenes. Well it's not. In fact, there are only two chase scenes in the film, and while one is rather exciting and fits the standard bill, the other is a masterpiece. This chase opens the film, and it's not at all what you're expecting. It is slow, deliberate, and suspenseful; a driver attempts to avoid the police, on the moonlit streets of LA, not with speed and skill (though he does possess them), but with cunning. This scene sets the tone for the rest of the film: a cool, calculated, character-driven story, which doesn't say as much as it does - much like its protagonist.\r Lack of a name and lack of words make the driver a very mysterious character. We get absolutely no sense of who he was, or how he arrived at his current situation - no time lost to an over-complicated backstory. In a way, we are offered more of a description of his character than most movies would provide, but only through his actions. Stanley Kubrick was a huge believer in the importance of watching a film. It is evident in 2001: A Space Odyssey (10/10 in my book) that he urges his audience to watch rather than listen. In case you haven't seen it, the very first dialogue occurs about 25 minutes into the film, and the rest is sparse to say the least. Drive director Nicolas Winding Refn does the same, telling most of his story through body language, facial expressions, and brilliant camera work.\r Let me stop here and say that the cinematography in this film is among my favorite ever. This is possibly the most masterful aspect of the story: it unfolds so beautifully on screen.\r Refn also displays some brilliant qualities of another director, and this claim may be a bit unexpected: it's Quentin Tarantino. I'll have to clarify what I mean here. The great majority of a Tarantino film like Pulp Fiction, Reservoir Dogs, or Inglourious Basterds is character development. Tarantino accomplishes this with very long and seemingly inconsequential dialogues. The rest of the movie is generally violent; by this I mean sudden, shocking, sometimes appalling violence. This effectively makes a Tarantino film very gritty, when in fact a huge portion of it is friendly dialogue about Big Macs in France, for example. The character development in Drive is very different, because it is so visual. But the rest of the movie is, like Tarantino's, extremely gritty. Folks, this is some of the most disturbing violence out there, because the realism is so great, and because the camera does not shy away. I'm not trying to say it's a gore fest. It's nothing like that, in fact. It's just so real that it hurts. I happen to think it is superb, but it definitely makes me cringe. I'm warning you right now that some of it may not be pleasant - but that's the point.\r For a much more lengthy and in-depth review, see my blog at kofdrops.blogspot.com."}, {"rating": "10", "text": "Drive will have haters as all films do, yet it's hard to deny the sheer style on display here. Neon nights and steady gazes take up a sizeable chunk of the film and those looking for an action laden thriller may find the film's cruising pace more than a little bit frustrating. But Drive is not fot those people. Those looking for a stylish, shocking and slick thriller will find plenty to enjoy in Drive and it would not be going too far as to lable it one of the finest examples of stylish film making that audiences are likely to see this decade. And whilst the ultra violent second half may repulse many, it's hard to deny that by the time the film reaches this point, the character, and his story, are truly imbedded in our hearts."}, {"rating": "10", "text": "Absolutely the best film of 2011!  I just finished watching this movie for the second time, after almost a year in between.  I purposely delayed a second viewing, thinking there was no way it could stand up to the sheer exhilaration I felt the first time I watched it, but I was wrong.\rThis movie is unlike anything else I have ever seen.  The opening sequence of Driver performing his job, has a perfect musical score, and the way that the entire sequence follows the plays of the baseball game on the radio, up to and including the first of many beautiful and unexpected moments mini-climaxes are the first indications of this movies graceful, almost shy, but still intense perfection.  Many have called Driver (the unnamed protagonist) emotionless, but they clearly lack any understanding of the subtle shyness and think first speak later mentality that comes from being a lonely hermit.  Driver is a true hero, as the beautiful musical score states.  He is an archetype sorely missing in today's era of morally relative anti-heroes.  Not that I don't love the typical anti-hero, but despite the multiple grisly murders that Driver performs throughout the second half of the film, there is never any doubting his purity and heroic nature.  In the end, this is a film of contradiction.  A gritty violent crime drama mixed with a subtle, shy, and tender love story.  Brief but explosive action mixed into moments of pure serenity.  Slow detail oriented drama building to a climax of murder, mayhem, and old school cowboy heroics.  I simply don't understand how anyone could find this masterpiece of modern cinema to be anything short of perfection.  Drive is the closest thing to perfection you are likely to find on Netflix or Blu-Ray any time soon, so just go watch it.  You won't regret it."}, {"rating": "10", "text": "Drive is a perfect film.  From the acting to the look of the film to the soundtrack this film is one of my favorites of the year.  I appreciate the art house feel, but I also appreciate that there is the perfect amount of action as well."}], "recommendations": ["hanna", "tenet", "haywire", "the_equalizer_2", "sucker_punch", "hugo", "good_time", "hardcore_henry", "end_of_watch", "red_sparrow", "no_country_for_old_men", "miami_vice", "bad_times_at_the_el_royale", "a_history_of_violence", "blackhat", "the_rover", "the_american", "eastern_promises", "you_were_never_really_here", "bone_tomahawk", "inception", "top_gun", "gemini_man", "enemy", "sicario_day_of_the_soldado"]}