{"id": 4638, "title": "Drunk Parents", "starring": ["Alec Baldwin", "Salma Hayek"], "runtime": 97, "genre": ["Comedy"], "description": "Two drunk parents attempt to hide their ever increasing financial difficulties from their daughter and social circle through elaborate neighborhood schemes.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/AbcqkOVT4KrWWhoT18FzZZ73Puk.jpg", "categories": {"plot": 6.5, "acting": 2.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 1.6, "action": 5.0}, "reviews": [{"rating": "2", "text": "Lazy, cynical writing amounted to no laughs for me. Half way through, I started fast-forwarding because I did not laugh a single time up to that point.Baldwin's comic timing and delivery are always good, but it's lipstick on a pig; the script is just not funny. Dropping f-bombs does not a comedy make. And I don't know why Hayek was cast in this. She's even less funny than the script. And the comic ability of Jim Gaffigan was utterly wasted.The few attempts at warmth fell flat. You can't have your characters act like moronic, self-absorbed a-holes and expect the audience to have any emotional connection to them.Thoroughly disappointed by this movie."}, {"rating": "8", "text": "Maybe the funniest movie I've seen since Walk Hard of or Step Brothers, by being surgically stupid with some of the dumbest lines spoken with earnest and very well written and delivered mastery of being dumb as long as it's funny.A modern riches to rags story played-sometimes-straight-faced for effect by Hayek and Baldwin is ironically a perfect vehicle for the instances they encounter, that they subvert their own plot on purpose to the point of absurd, and it's good at it. If you like stupid-PHD style comedy, this is a very, very good one of those. The plot is secondary. And that's okay because each scene is a little universe of funny."}, {"rating": "0", "text": "Looks interesting but in reality lacks substance. Absolutely trashy lol, some funny bits here and but definitely not worth watching"}], "recommendations": ["baby_on_board", "zoolander_2", "the_heat", "pineapple_express", "anchorman_2_the_legend_continues", "the_five_year_engagement", "the_watch", "welcome_to_the_jungle", "the_hangover", "stuber", "keeping_up_with_the_joneses", "ride_along", "30_minutes_or_less", "the_wedding_ringer", "identity_thief", "horrible_bosses_2", "jexi", "get_smart", "get_hard", "zoolander", "forgetting_sarah_marshall", "dodgeball_a_true_underdog_story", "mortdecai", "this_is_the_end", "bachelorette"]}