{
  "id": 1144,
  "title": "Due Date",
  "starring": [
    "Robert Downey Jr.",
    "Zach Galifianakis"
  ],
  "runtime": 95,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "Peter Highman must scramble across the US in five days to be present for the birth of his first child. He gets off to a bad start when his wallet and luggage are stolen, and put on the 'no-fly' list. Peter embarks on a terrifying journey when he accepts a ride from an actor.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4dzo4uWmkgp20uwm0jpiduRtvju.jpg",
  "categories": {
    "plot": 6.571428571428571,
    "acting": 6.0,
    "ending": 7.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.871794871794871,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Todd Phillips follow up to the worldwide hit of the Hangover comes in the form of Due Date. Somehow this managed to evade my attention and after picking it up at a bargain price I have to wonder how i've managed to miss it! It's not the Hangover that's for sure, infact it's not as good as the Hangover but it is up their this is another awesome comedy from the maestro himself. Robert Downey Jr is absolutely brilliant in this alongside the ever dependable Zach Galafianakis as two men caught in a mix up which leaves Downey stranded and forced to take a roadtrip across America in order for him to get home for the birth of his child. Along the way there are some classic comedy LOL moments as expected but there are also some really great heartfelt and bromance moments. At times its just outrageous but that makes this flick all the better. One word of advice don't expect another Hangover because i'd imagine you might end up disappointed although I don't know how because Due Date has plenty on offer and is another gem from Phillips as the chemistry between Robert Downey Jr and Zach Galifianakis alone is worthy of a watch they are awesome, much like this movie!"
    },
    {
      "rating": "10",
      "text": "You do not give a movie this amazing anything below 90/100 or 9/10, so **** you u dicks! it has an original story line along with amazing acting and a well written script. Robert downey jr shows he can do more then just play a overly intelligent person who is massively arrogant, also Zach Galifianakis has been put into a role perfect for him again! the fact this go 51/100 and 5.2/10 makes me sick!"
    },
    {
      "rating": "7",
      "text": "The new film from Todd Phillips (\"Hangover\") pairs a serious Robert Downey Jr. with a super-flaky Zack Galifianakis for a cross-country road trip. Just like it's predeccesor, there are outrageous moments and crazy characters, but it's not as zany or hilarious. Still, Zack manages to make an absurd character entertainingly believable and there's enough mirth to make it worth the ride."
    },
    {
      "rating": "6",
      "text": "Funny enough to warrant the entry fee, even though virtually ALL the funny one liners are shown in the trailers.  Still an entertaining experience, but the Hangover, it sadly, is not."
    },
    {
      "rating": "6",
      "text": "Not nearly as good as The Hangover or Old School (2 classics), but it's still got plenty of laughs and heartwarming moments to make it worth seeing."
    },
    {
      "rating": "5",
      "text": "I guess you only get one chance to make a movie so hilariously funny at The Hangover. If you're expecting a comedy equal from the same director, alas no. As most have noted it's a sort of remake of the classic Trains, Planes and Automobiles, without the heart of John Candy. Sure there are laughs but I didn't find the characters believable. Robert Downey Jr. and Zach Galifianakis sound like a dream team. I loved him in the recent Its Kind of a Funny Story, here he's kind of annoying. And Downey is just too way too uptight. Oh well. Maybe next time."
    },
    {
      "rating": "8",
      "text": "If not quite as winning as last years The Hangover, Due Date is still comfortably the best comedy of the year so far.  Galifianakis and Downey Jr. make a terrific double-act, and produce some real moments of comedy gold.  Okay, Downey Jr.'s character can be unlikeable at times and very mean-spirited towards the lovable goofball played to perfection by The Hangover's stand-out comedian, but the situations he is forced to endure are so ridiculous and humiliating I can kind of understand his escalating frustration.  Some moments were so unexpected, non PC, and expertly played by the leads, that I literally could not stop chuckling.  Perhaps the last third of the movie is less impressive and a little derivative, but by this point I was totally won over and again Todd Phillips directs a great modern comedy."
    },
    {
      "rating": "0",
      "text": "This was so boring. So obvious and so basic. B.o.r.i.n.g. The Characters were dull and the movie was so monotonous. I would not recommend this movie. No Thrills here."
    },
    {
      "rating": "9",
      "text": "this is a great movie it has all the funny features of a classic comedy. When i first heard of this movie my first thought was it sound tacky and horrible but when my friends took me to see it i was shocked of how funny it was. The beginning of the movie it isn't all that great but later on it gets amazing. If you like the movie like the hangover then you will love this movie."
    },
    {
      "rating": "5",
      "text": "From the writer, director, and star of the Hangover, aka the funniest movie I've ever seen, comes Due Date! I can't tell you how excited I was to see this film. Unfortunately, if you've seen the preview, you've seen all the funny parts. Robert Downy is great as the moody, uptight, Peter. Zach Galifianakis however, was pretty bland. Metro-sexual Ethan didn't have the same shock value and loveable loser quality as Alan did, I didn't find him funny, I just felt sorry for him. The plot didn't help the film much either. How many times have you seen two strangers, thrown together by happenstance taking a road trip together? Due Date was OK, but it's been done, and they made the rookie mistake of putting everything good into the preview. Despite the great cast, I say pass on this one."
    },
    {
      "rating": "6",
      "text": "I liked the film and it did have quite a few funny moments. However its really the same old same old that we expect from Todd Phillips so dont expect to be blown away by it. Robert Downey Jr and Zach Galifanakis work great together and definently make the movie that much better."
    },
    {
      "rating": "8",
      "text": "Don't be fooled by its invisible title- 'Due Date' is a rare gem. No more than a comedy, but no less than it either, it is the movie you want to see if you miss laughing from your heart and brain, and if you want to remember that feeling for some time before its stolen by slapstick senselessness.\rThis comedy does not have a bucketful of curses, wise lines and pranks, nor needs it, for it has a forgotten true sense of humor and therefore-excellent rhythm between funny and serious. Most uniquely however, it has excavated humor's vital ingredient-a story from reality, extraordinary enough to tell, but that can befall us all.\rEveryone can identify with the tale of expecting to wake up to a normal day and easily fulfill one's plans, when the prankster of life suddenly makes it all go extremely wrong. And everyone can laugh at its tragic comedy, however often it has been told, especially when it is highlighted in a character who doesn't see it coming at all. A fully socially proper, politically correct and controlled, technologically supported and psychologically eloquent modern husband and careerist who even knows when his child will be exactly born.\rEspecially when he is played by Mr. Robert Downey Junior, who is so brilliant and believable in this role, that one takes it to be truly him. But for the excellently chosen subtle strangeness in his face and demeanor, that is eventually fully blown out by his co-star and co-traveler Mr. Galifianakis who excellently plays his annoying, ludicrous, socially intolerable and unconstrained opposite.\rEven though the film itself leads to the conclusion that it is all about their hilarious mismatch and misfortune of traveling together cross country that is forced on Robert Downey by Galifianakis, and that will end in life-changing friendship, this is a comedy that perhaps hides a deeper message. By causing utter havoc to one modern man's plans, it destroys his metrosexual mask, it dares to reveal his humanity and suppressed rage underneath it, with the falsehood of the signs of our times he every so often bumps into on his long  journey home. The words one must not utter in an airplane, the politically correct way of dealing with nasty children, and our wives' best friends writing them e-mails. After all, would the size of Juliette Lewis, Jamie Fox and Rza, appear in this movie for anything less?"
    },
    {
      "rating": "6",
      "text": "\"Due Date\" doesn't really have that much of a blast. It wasn't a movie that will blow your brains out with humor, but it will just....delight you."
    },
    {
      "rating": "4",
      "text": "Essentially a remake - probably unintended - of Trains, Planes and Automobiles, though while John Candy's heart of gold was wrapped around a recognizable caricature of the overfamiliar shlubby salesman, Galifianakis's is wrapped around an odd amalgamation of schticks: a breathtakingly naive, under-socialized stoned sycophant who alternates randomly from fawning to hostile behavior. It's not that funny."
    },
    {
      "rating": "8",
      "text": "This was just as funny as the hangover. i was laughing throughout the whole thing. Even though it was unoriginal, it was still funny. Iron Man and Fat Jesus worked perfectly in their roles"
    },
    {
      "rating": "8",
      "text": "If you want to see the dirty R rated version of Planes, Trains, and Automobiles, this is the movie for you. Robert Downey Jr. and Zach Galifianakis are a comedy duo that will brighten your day. With witty dialogue, and cameos by Jon Cryer, Charlie Sheen, Juliette Lewis, Danny McBride, and Jamie Foxx, this movie is a hilarious road trip comedy. On the downside, the trailers are misleading, leaving me to believe this is the funniest movie of 2010, while it barely cracked my top 20. Go see this movie if your looking for something that will make you laugh. It's even more quotable than The Hangover, by the way!"
    },
    {
      "rating": "9",
      "text": "Saw this today with my friends, and I thought it was really funny and and I loved it.  Robert Downey Jr and Zach Galifianakis play two great characters and the story takes many unexpected turns and is enjoyable from start to finish."
    },
    {
      "rating": "1",
      "text": "After the huge critical and commercial success of Todd Phillips'(Director of \"Old School\", â"
    },
    {
      "rating": "5",
      "text": "Some very funny stuff, but that is all I can say for it.  I can only hope that Philips will do something on or above the level of \"The Hangover\" in the future.  Without Zach this movie would be nothing."
    },
    {
      "rating": "6",
      "text": "ok saw the movie. and well it had some really funny parts but then it was missing something thast i still canÂ´t put my finger on. if you  want to have a good laugh and like to smoke marajauan you canÂ´t miss this movie.."
    },
    {
      "rating": "9",
      "text": "haven't seen it yet but i'm really psyched to. it just looks friggin hilarious. love RDJ, kind of \"meh\"! about Galifinakis. more than likely though will i pay to see this in the theater"
    },
    {
      "rating": "9",
      "text": "Probably Todd Phillips most underappreciated work. Earlier efforts like Old School and Road Trip might nowadays be regularly subjected to a sort of retroactive criticism as a result of the current standards of political correctness, but still stand out as two of the more recognizable pieces of early 2000s era raunch. Meanwhile the Hangover trilogy is straight-up iconic, and even War Dogs receives credit for marking a transition in the director's career into more serious material that quickly opened the door for him to make Joker. This however? It sits alongside School for Scoundrels as a movie no one ever really talks about much, and that's pretty sad.This is a better Hangover sequel than any of the actual Hangover sequels were. Zack Galifianakis is essentially playing the character of \"Alan\" again, only instead of being paired with Bradley Cooper and Ed Helms he's making life very hard for a high-strung version of Tony Stark, who instead of a cool flying supersuit has an expectant wife who's about ready to deliver that he has to get to. Naturally, unforseen consequences force them to drive across country together and plenty of hilarious misadventures ensue.The comedic material ranks among the best Philips has ever concocted. The surprising chemistry between the seemingly mismatched stars allows the angry (on Downey's part) dialog exchanges to land with particularly humorous effect, while the variety of crazy set pieces manage to avoid the laughter reducing overreliance on guns and legitimate danger that plagued so many other releases back in the 2010s (i.e. Identity Theft). The consequences, or actually lack thereof, of some of the more legally questionable exploits carry a noticeable lack of reality (you're telling me nobody put an APB out on that police vehicle stolen at the Mexico border?!), but it never prevents them from being funny.Largely dismissed and overlooked, this looks at first glance like the kind of middle-of-the-road effort so many filmmakers have put out to capitalize on their last big hit, especially given what proceeded it. That's an undeserved misconception however. Due Date held up incredibly well on this rewatch. The amusing concept leads to a lot of crazy scenarios that are adept at cracking you up. It's one of the more wild, riotous comedies I've seen that doesn't need to lean too heavily on sex humor to really push the envelope, just the dynamic of its two leads and the situation they're stuck in. Because of that it's a movie we should all give a collective second look."
    },
    {
      "rating": "6",
      "text": "An overly hyped film by Todd Phillips (Director of Hangover) who seemed to try to take advantage of his previous success with Hangover.  Due Date didn't have the same relish as Hangover, but the show is worthwhile and a good substitute until Hangover II."
    },
    {
      "rating": "0",
      "text": "This Movie Was Not That Good. Wasn't Funny, Horrible Story Line, Robert Downey Jr..... Spits On A Dog, And Seriously Who The Heck Created This Piece Of Trash."
    },
    {
      "rating": "6",
      "text": "\"Due Date\" uses the same template as John Hughes' \"Planes, Trains and Automobiles\", but the template is broken now, and it was a perfectly servicable template, even worse, 1987 called because the yesteryear wants its movie back. 1987 wants to know why every comedy being produced from the major studios pander to the lowest common denominator. \"Planes, Trains and Automobiles\", albeit formulaic through and through the entire running time, was able to telegraph its happy ending without the brazen disregard for plausibility that \"Due Date\" is guilty of. Peter Highman(Robert Downey Jr.) is such a city mouse, the a**hole of a city mouse, the filmmaker should just let him be, without having to worry about redeeming him, especially since he's teamed up with a country mouse, the a**hole of a country mouse, who doesn't seem like the same character after both men are asked to leave the plane. At the drop-off area, Ethan Trembly(Zach Galifinakas) is inscrutable; he makes eye contact with Peter, a nonchalance that seems exceedingly bold, coming so soon after the car he arrived in, ripped off the door of the architect's taxi. Later, while both men are standing together curbside, Ethan knocks over Peter's luggage and resigns himself from the common courtesy of picking it up. Once on the plane, Ethan walks to his seat as if the 747 was a yacht he personally owned, placing his carry-on luggage in the overhead compartment  without the slightest acknowledgement that he's fat and an owner of a hirsute belly, haphazardly concealed within a buttoned shirt, aligned strategically with Peter's face, a magnet, as it turns out. \"Due Date\" would have been a whole lot fresher had both men remained formidable opponents, but once they hit the road, the relationship turns hierarchical, in which Ethan stops playing \"dumb\", and Peter asserts himself as the sophisticate who doesn't suffer fools gladly. The words and actions that Peter unleashes on Ethan are so hurtful, so rooted in class consciousness, they practically blow away the \"Planes, Trains and Automobiles\" template to smithereens. The architect's contempt for the budding actor seems just too intense, going so far, at one point, as telling the \"Two and a Half Men\" enthusiast that he despises him \"on a cellular level\". On another occasion, Peter slams Ethan's permed head on a truck, almost hard enough to cause a concussion. In the 1987 John Hughes classic, Neal Page(Steve Martin) may have disliked his accidental companion immensely, but his aversion for Del(John Candy) never coalesced into full-blown hatred. It was John Hughes at his best that the moviegoer didn't mutter to himself, \"Yeah, right,\" when Neal invites the big lug over for Thanksgiving dinner. The late Hughes was a humanist with a pragmatic touch. With its over-reliance on a masturbating dog and drug-related humor for laughs, \"Due Date\" should have played off the sentimental tropes found in \"Planes, Trains and Automobiles\" rather than recast them in such a vulgarian context. It's hard to believe Peter when he says, \"I love you,\" to his fellow traveller, not after Peter spit in Ethan's dog's face and mocks the Arkansasian man for having the rube dream of making it big in Hollywood. He doesn't care about other people. The filmmaker establishes this fact early in the film, as Peter ignores the friendly driver who tries to engage him in a conversation during their jaunt to the airport. We get it. Peter only talks to people he deems worthwhile. A car figures in a later scene, where Peter has second thoughts about ditching his \"friend\" after forgetting to throw out the coffee can containing Ethan's father's ashes. Neal Page would turn around and go back, not Peter Highman, but he turns around anyway, because that's the formula, the steady progression from antagonists to friends, culminating in the scene at the Grand Canyon, where Peter seems exceedingly sensitive while encouraging Ethan to honor his father's last wish, and say goodbye. This is total bulls*it. It feels forced. This loser means nothing to him. But a formula is a formula, which makes you realize how a film like \"Planes, Trains and Automobile\" covers its tracks much better than \"Due Date\", a funny enough film that might have benefited even more had Ethan been allowed to be Peter's sparring partner, not whipping boy. That's the movie we see in the set-up. Interestingly enough, the sparring partner makes a cameo, soon after Ethan gets roughed up by Peter, when a loaded gun that the actor(remember: he's an actor) finds in the glove compartment, accidentally, of course, goes off, and hits the abusive architect in the leg. It's a taste of what \"Due Date\" could have been, and might have been in the original draft: a dark road comedy."
    },
    {
      "rating": "5",
      "text": "Due Date wasn't much funny as The Hangover or the remake of Plaines,Trains,& Automobiles. It's actually a descent comedy where two guys are heading to Los Angeles and one of the character wants to headed home so he can see his pregnant wife and another character wants to get high. Robert Downey Jr. and Zach Galifianakis wasn't half bad in the movie but in a different way that those two guys weren't much funny and I get complaint about Downey Jr for putting him in a so so movie with Zach in it. They have arguments the whole time and the lines aren't there yet (not to The Hangover funny lines). But there's Zach Galifianakis has three funny lines in the middle with spitting the dog line,the truck back line,and the waffles line,which we save him in this picture. But the movie slows down with lack that it refers to the Planes,Trains,and Automobile and it's nothing interesting with the whole cast that actually missing in the movie. But this comedy wasn't worthing to the classic of Road Trip,Old School,and the best box-office winner of The Hangover. You could probably stick to the John Hughes film of Planes,Trains,and Automobiles that it's more funny and it has hearts to those beloved actors of Steve Martin and John Candy at the same time,but this new one wasn't much special and I'm really sorry with those two actors in the movie like that,but it's a least bad you can tell."
    },
    {
      "rating": "4",
      "text": "The trailer was way much better than the film. I found the movie somewhat lacking in energy, with some plots running nowhere and with very light in laughs. Like Chandelierical said, it reminded me of \"Trains, Planes and Automobiles\"."
    },
    {
      "rating": "10",
      "text": "Funniest movie of the year by far!!!!!!!!!!!!!!Zach Galafinikis was funny throughout the whole movie. Robert Downey jr. also had his moments. It had it all. Car chases, pot, Two and a Half Men, and Jamie Foxx! Definetly as funny as the Hangover. The only downer was that it was very unoriginal and hard to believe, but hey that's comedy."
    },
    {
      "rating": "7",
      "text": "\"Due Date is satisfying & the leads are very likable and talented , but the film lacks in originality , some of the jokes fall flat , and is not on par with the hangover , but there were moments when i was laughing out loud! enough for me to Recommend it..\" .. B"
    },
    {
      "rating": "5",
      "text": "There are some funny moments, particularly some of the guffy Galifianakis moments, but neither Downey Jr, nor the celebrity supporting appearances of Foxx and Lewis make this a film to recommend, mostly due to the average material in hand."
    },
    {
      "rating": "4",
      "text": "Despite its promising cast and director, this film really could have been funnier and it seemed a bit rushed at times. It didnâ"
    },
    {
      "rating": "7",
      "text": "An enjoyable, albeit contrived, ripoff of \"Planes, Trains, and Automobiles\" that deserves to be commended for mining more humor out of \"Two and a Half Men\" than \"Two and a Half Men\" ever has."
    },
    {
      "rating": "7",
      "text": "It was better then I expected. Solid acting by the cast and it was worth the watch. Oddly though it wasnt that funny (as other films by the director were) as I expected but it was still good."
    },
    {
      "rating": "4",
      "text": "I suppose â"
    },
    {
      "rating": "4",
      "text": "A pretty half-assed effort on the part of the script.  The jokes were plain and simply not that funny.  The actors really had nothing to work with.  A DEFINITE rental not worth 10 bucks."
    },
    {
      "rating": "8",
      "text": "It was good, has the feeling of the Hangover and makes you laugh hard at points.... its more disappointing because you compare with the Hangover. But still Downey and Galafinakis deliver."
    },
    {
      "rating": "5",
      "text": "I was expecting more laughter from this movie. Sure there were funny lines and some scenes with Zach Galifianakis, but that was the only thing worth seeing for. The plot is simple, nothing deep, so you can easily predict what will happen at the end. The first time you will see it, you will laugh. The second time, you will be bored. There were enjoyable and funny moments and a few boring ones. If it wasn't for Zach's role (the funniest in the movie) '' Due Date '' would have been terrible."
    },
    {
      "rating": "5",
      "text": "if u watch this and thinks its funny then u will probably die watching the hangover the humor in this movie is kind of awkward and dark. it was a funny movie but cmon there's much better out there than this. Robert Downey Jr is really that funny and Zack glaskdfenerlfekis is a bit annoying"
    },
    {
      "rating": "6",
      "text": "This movie reminded me of the Hangover most of the time that I was watching it. It was entertaining but I was not so intrigued by it.  But it was funny thanks to Zach Galifianakis, but I din't like that the end didn't surprise me at all."
    },
    {
      "rating": "7",
      "text": "even though the storyline could be somewhat lacking at times the movie was brought together by the two leading actors which are big stars in the current cinema market. the movie also contains funny jokes in the script but i felt that the story could be very predictable at times but that just added to it in a way. but overall i think this movie is very enjoyable and well worth a trip to the cinema"
    },
    {
      "rating": "6",
      "text": "Great idea, great actors...i just dont know wtf happened...its just not so funny. interesting yes, lucid dialogs, comic events, dark funny approach, but...just not enough funny...:("
    },
    {
      "rating": "10",
      "text": "This movie was amazing! Todd Phillips is the best comedy directer ever. I could stop laughing throughout this movie. Zach Galifanakis is probably one of the greatest comedians alive. I went to go see this movie with my friend just to waste some time, and now this is my favorite movie. The movie had an excellent story line, just like the hangover. Whoever did not like this movie does not have a sense of humor. GO SEE THIS MOVIE!!"
    },
    {
      "rating": "8",
      "text": "This is one of those movies where you have to see for yourself. Don't believe the critics. You really have to see the movie to know what it's all about. It was hilarious! Though I must say the title sort of threw me off a bit. It's called Due Date, yet the movie was more in a road trip situation. Robert Downy Jr. and Zach Galifianakis are really a one of a kind pair. Together, playing total opposite roles, make this one to enjoy from start to end."
    },
    {
      "rating": "8",
      "text": "A film that contains some of the funniest gags of recent times, and a great product placement of the  2010 Subaru WRX Impreza, Due Date utilises the classic formula of polar opposites stuck in an undesirable situation. Although the chemistry (or rather counter-chemistry) between the two leaders doesn't match up with their oft-compared counterparts Steve Martin and John Candy of Planes, Trains and Automobiles, Due Date does win in the laugh out loud category. The film achieves that rare feat of  completely destroying those touching moments, without angering the viewer.\rThere are moments in this film where the writers attempt to emulate the hilariously over-the-top moments of The Hangover, but these moments seem unsuitable, annoying and largely unfunny. Aside from this one small complaint, Due Date is a very well written comedy.\rGafliankis is crack-up funny, but Robert Downey Jr is the highlight: his intensity dominates every scene. He plays his role, as expected, as usual, without fault."
    },
    {
      "rating": "2",
      "text": "Bad , bad, bad. It if wasn't for Robert Downey, Jr, I would have stopped watching the movie. It tries to be Planes, Trains and Automobiles. But unlike John Candy, Zack's character had no redeeming qualities. He was not lovable at all. The two main characters had no chemistry. Why is chemistry so hard for directors to see?  Clearly I'm not the target audience, but even so just not very well done. Mostly gross gags and alot of meanness.  It's the first time in a long time I've watched a movie where I could tell they were acting. Even good actors can have bad material. Maybe they just got lost in the editing process. Just a bad movie."
    },
    {
      "rating": "5",
      "text": "This is basically the ugly cousin of \"Planes, Trains and Automobiles\". Unfortunately, it's not even close to being as funny or as heartwarming, but it still has its moments.\"Due Date\" certainly provides some laughs, thanks mostly to Galifianakis, but I couldn't help but question its sincerity. The film has also been compared to director Todd Phillips' previous effort \"The Hangover\", another roadie film that I had major issues with. \"Due Date\" is just as good as \"The Hangover\" in my opinion.In the end, however, it isn't about much else besides being a funny movie, and that's what we got. So I did like it. I just wish the whole Mexico chapter didn't exist at all."
    },
    {
      "rating": "7",
      "text": "Two superbly acted lead roles mask what it an average road trip movie and escalate it into an hilarious roller coaster of fun. Downey shows, once again, that he can play comedy without acting like an idiot while Galifianakis is quickly rising into comedy stardom. Not likely to appear on any top ten lists but a solid movie with plenty of laughs right through."
    },
    {
      "rating": "9",
      "text": "Due Date Review.24th march Cast: Robert Downey Junior, Zac Galifianakis and Jamie Foxx Peter Highman (Robert Downey Jr) had a bad start to the day. To make it even better he was placed in front of the hilarious Ethan Trembley ( Zac Galifianakis). Ethan got them both kicked off the plan and put them on the â"
    },
    {
      "rating": "7",
      "text": "A+ for dark humor.A+ for the coffee can.B for the monkey.C for over all feeling.What a refreshing, twisted, comedic story! Yes, the movie is not for everyone. I can see how people wouldn't like it. However, I liked it. Has some flavor of What About Bob? - one of my favorite movies. So this man is trying to make it to the birth of his son - needs to travel from Atlanta to LA with limited time on hand. Ends up needing to pair up with a wacky d00d. They are complete opposites, yet strangely they need each other - they help each other to realize that being different isn't so bad and being perfect is over rated, they can make it through their demons/baggage, and, most importantly, they can forgive and love life.It was pretty hilarious and touching too in a dark, bizarre way. I could have done without some predictability and my over all feeling made my literal headache worse, but in a strange way I did enjoy the movie.I'm not into coffee but that whole thing was f*$&#%( funny!Gleenobly's rating: 7/10"
    },
    {
      "rating": "7",
      "text": "Though by no means ground breaking, or even slightly original, Robert Downey Jr and Zach Galifianakis have a vibe and presence lifts this bro(ad)-movie to a feel-good flick with a 90-ish twang....might not be a positive reference for most, or even a \"correct\" one, but it reminded me a lot of \"Father's Day\" where Robin Williams and Billy Crystal do some of the last innocent humour of modern times (it was 80-ish when it came out in 1997...).\r Worth mentioning is a great soundtrack, maybe a bit more music and a bit less fuzz around Zach's character would improve it, experiment"
    }
  ],
  "recommendations": [
    "wanderlust",
    "dodgeball_a_true_underdog_story",
    "spy",
    "identity_thief",
    "tower_heist",
    "tammy",
    "the_other_guys",
    "masterminds",
    "dirty_grandpa",
    "central_intelligence",
    "paul_blart_mall_cop",
    "the_boss",
    "forgetting_sarah_marshall",
    "a_million_ways_to_die_in_the_west",
    "the_wedding_ringer",
    "zoolander",
    "neighbors",
    "date_night",
    "get_hard",
    "thunder_force",
    "little_fockers",
    "logan_lucky",
    "wedding_crashers",
    "ted_2",
    "burn_after_reading"
  ]
}