{"id": 886, "title": "Dumb and Dumber To", "starring": ["Jim Carrey", "Jeff Daniels"], "runtime": 110, "genre": ["Comedy"], "description": "20 years since their first adventure, Lloyd and Harry go on a road trip to find Harry's newly discovered daughter, who was given up for adoption.", "releaseYear": "2014", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/b5sOa42AN7sTU9PCf7S8wI7jchB.jpg", "categories": {"plot": 3.642857142857143, "acting": 4.0, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.5, "funny": 4.694915254237288, "action": 5.0}, "reviews": [{"rating": "4", "text": "They're back, 20 years later and as dumb as ever. Unfortunately, not as funny. This time they set out to find Harry's long-lost daughter, but not without silly complications. There are a funny moments scattered around and the duo still brings plenty of goofy energy. It's just that more of the jokes fall flat than land a laff. At least they didn't stoop to the current trend in gross-outs gags, but went for the classic stupid characters."}, {"rating": "1", "text": "This resurrection of an originally abysmal film confirms the lack of new material for original comedies from the decaying hallways of Hollywood studio's. Dumb and Dumber To would be the perfect film to watch when you are feeling exceptionally happy and you would like to lower your mood to the depths of clinical depression. Go and decorate your home, sit down and watch the paint for hours until dry, it will definitely provide more laughs."}, {"rating": "2", "text": "Love the original, but this is beyond dumb. At least the first one wasn't trying to be dumb as much as it just was. This is forcibly dumb and it comes across like each joke was dissected by a room full of writers and execs. This sequel should have come out 10 years ago, much like the Anchorman sequel and severely lost the audience."}, {"rating": "10", "text": "Do not understand the hate this movie is receiving. In my humble opinion, the only thing not to like is if you just do not like jim carrey. Other then that, I laughed the entire time. No I am not affiliated in any way with the peeps whom made it, just like to support and encourage more comedies like this one."}, {"rating": "4", "text": "Well,I still laughed but the movie is just not what I expect.Jim Carrey & Jeff Daniels' chemistry of they're character are still fantastic but the plot and the jokes are just flat."}, {"rating": "7", "text": "This film was never going to be as good as the first Dumb and Dumber film so before I watched the second one I kept an open mind and didn't expect to much. There was always going to be a second film made it was just the case of when not if. So... to the film itself. There are some really funny moments and a lot of reminiscing from the first film which I feel was done really well. They play out scenes which are a slight copy cat of the first film but still makes you laugh. There is the odd moment where you do get a little bit bored but this only happens a few times. Its easy to compare this film to the first one and obviously this one isn't as good but I would still recommend watching as there are some really funny moments."}, {"rating": "7", "text": "Dumb and Dumber To isn't as funny as the first, but it has its moments.  Some parts of the movie are friggin' hilarious, while other parts it seems like Jim Carrey and Jeff Daniels are trying too hard.  Still worth going to see."}, {"rating": "7", "text": "I didnt think it was that bad people are too judgmental. It obviously not even compared to the first one but walking in I was not expecting that. It has lots of funny parts in the movie the story was not half bad."}, {"rating": "9", "text": "This is one of those rare instances where I strongly disagree with the Film Critics. Dumb and Dumber To is easily one of the funniest comedies I have seen in years. The Hangover, Horrible Bosses, 21 Jump Street, and other recent examples are limp by comparison. It may not be to everyone's taste, but it isn't trying to stray from the source material. The original was mean spirited, low-brow, over-the-top and at times, obnoxious. Why critics are using these things as points AGAINST this sequel is mind-boggling to me. Dumb and Dumber To is the sequel that the franchise deserved. It may not be nearly as good as the original but it is leaps and bounds better than Dumb and Dumberer, which is all any true fan could ask for. If you're hesitant to see the movie because of average reviews, ask yourself if the original film holds a place in your heart. If it does, get yourself to the theatre and expect to laugh from beginning to end."}, {"rating": "8", "text": "I really enjoyed the movie, I don't understand the harsh reviews. It was great to see Lloyd and harry back, I found myself laughing at their dumb antics. Its not the greatest comedy ever, but it is an enjoyable movie that I would have no problems watching again."}, {"rating": "1", "text": "One somber chuckle in almost two hours, you'd think you'd been watching drama. This unfunny sequel pays no homage to its cult predecessor, and you soon realise that the only thing that's dumb is the writing. Jim Carrey was also disappointing, exaggerating too much and resulting in a parody of himself - but the true blame for this colossal flop is definitely going to fall on the writers, who cheaply recycled the plot from the original and wrote one single funny scene.\r The rest are monotonous, century-old jokes."}, {"rating": "8", "text": "Out of all the movies I've seen recently, Dumb and Dumber To is the one that most frequently flashes through my memory with bright, pleasant images.  Whether it's technically great or not, it is a good-hearted sincere attempt to give the audience a good time, and that's really all I ask of any movie"}, {"rating": "4", "text": "I am such a huge fan of the original film but I was not expecting this one to be better than the original at all!! I left the theater very underwhelmed and feeling guilty that I didn't laugh more because I wanted it to be good so bad. This is not a terrible film by any means. It is awesome to see Harry and Lloyd back together again and I did laugh quite a bit but there were too many times where the jokes missed and the movie fell flat on its face. It also fell way to familiar to the original plot wise and just didn't have many clever jokes like the original did. All in all this is a very mediocre film and I would only recommend renting it"}, {"rating": "0", "text": "The first dumb and dumber was one of my favorite comedies. Dumb and dumber 2 is just so bad. I couldn't even watch the whole thing. I made it through only 35 minutes and just had to walk out."}, {"rating": "0", "text": "Just a terrible movie. The humor terribly dry and was not funny, and not worth making fun of. Maybe it would be funny for some 12 year old boys, but it was the stupidest thing. It was literally the worst movie I have seen to date. Parts that were meant to be funny were just awkward, and not in a good way. The movie was bad. Please just do not watch this movie."}, {"rating": "10", "text": "I loved it. As a long time Dumb and Dumber fan, I was satisfied. Sure I would have done some things differently but that is what happens when you become attached to someone else's art. Of course they aren't going to get it 100% right for everyone. BUT I THINK THEY GOT REALLY CLOSE. I went to the movie expecting to laugh, and I did. I loved it. The movie is dirtier than the first. So yes their innocence is a little gone but the US in general is dirtier than it was 20 yrs ago. Gas was 1.09 then its 3.09 now. Lloyd Christmas was always an opportunist at Harry Dunne's expense.\r Dumb and Dumber To is guilty pleasure humor. Its crass, racist, juvenile and dumb. The critics panned the original movie as well as this one, and as before THEY STILL DON'T KNOW ANYTHING! It is amazing and I really glad JC and JD reprised their original roles. It is just amazing that they really don't look that much different in this movie than the first. I would watch this movie again and I am planning on buying it on DVD."}, {"rating": "5", "text": "I literally felt dumb and dumber after walking out of this disappointing and mediocre 20-year reunion with Jim Carey and Jeff Daniel's two beloved cult characters from the ever superior first film. To sum it up shortly, I honestly only laughed out loud during one scene while the rest of the forced gags fell flat on their faces, not to mention they got a little more gross than I would've liked. Overall, while I was entertained for a majority of it, just go home and re-watch the first film because this one just simply isn't worth a trip to the theater if you ask me."}, {"rating": "0", "text": "Just awful. The first one hat at least some charm, and characters were innovative for tat time. This \"number two\" is just a way for the studio to earn some money. It's sad and stupid to watch. Maybe if you are 9 years old you would find some of the simple humor funny."}, {"rating": "5", "text": "Was this laugh out loud funny....no. Was it at least \"chuckleable?\" yes. Was it better than the first...resounding no. Hard to follow a near classic with another near classic....especially 20 years later. Many similarities of plot, scenes and even characters as in the first one. Movie moved at a good pace even had some good songs in the sound track. Good enough for one watch and forgetting about the outside world for the duration of this movie."}, {"rating": "8", "text": "Great original gags that will get you laughing. Nice throwback that gives an aura of watching a later 3 stooges short. Easily my fav silly comedy of the year. My only complaint is that it ends on a down note."}, {"rating": "8", "text": "The second film is as good as the first one, i believe this is the best comedy i saw this year, actually i dont like comedies so much but i will make an exception to dumb and dumber."}, {"rating": "10", "text": "Great movie, as always Jim Carrey is Hilarious as is Jeff Daniels.. Almost as good the first but time will only tell if people see it up above the first or not.. People just need to calm down with negativity here"}, {"rating": "10", "text": "If you liked the first movie, you will like this too! ... I had not laughed that much time with a film of Jim Carrey, the chemistry between him and Jeff Daniel is excellent!"}, {"rating": "7", "text": "Same type of gags and comedy. If you like the first one it's more of the same. Some really funny gags in it. It does drag a little towards the end. Overall pretty good."}, {"rating": "7", "text": "Started off not so great. Some of the humor wasn't funny in the beginning. However once they hit the road it gets a lot better. If there ever is a third movie though please ditch all the old gags. Never understand why they have to reuse them in different contexts. If the new generation want to see them, just repackage and resell the first movie."}, {"rating": "8", "text": "Predictable plot but I thought it was hilarious. I laughed through out and thought it did surprisingly well for a sequel to such a classic comedy. Honestly, Half the time I don't even agree with critic scores. They will praise the worst films and yet bash the decent ones. Dumb and Dumber To is a pretty enjoyable movie that is well worth the watch."}, {"rating": "8", "text": "Great movie! What the heck are all the critics **** about?! Consistantly funny from beginning to end. As good as the first? No, but that is asking a lot. Hope they make another."}, {"rating": "7", "text": "Watched this movie couple of weeks ago... forgot to review. Don't let those critic scores fool you! This movie is hillarious! Tons of funny scenes, decent story and great acting make the second part of Dumb and Dumer worse than the first one but diffenitely better than most of the comedies from the last couple of years!"}, {"rating": "1", "text": "A few years too late.\r Dumb and Dumber was a few years ago really good. It has really thrown away before laughing.\rNow comes very late to continue and this does not come across well. It's like a joke was told 20 years ago.\rCrappy more about it because the humor so old and \"out\". 10 years ago it would have worked."}, {"rating": "8", "text": "A really good nostalgic kick back to the time when comedy didn't equal rom-com but plain (brainless at moments, granted) fun. Went in expected much worse movie and was pleasantly surprised."}, {"rating": "7", "text": "What's the #1 thing I want out of comedies? Answer: to make me laugh my ass off! Dumb and Dumber To accomplishes this with ease, just like the first one. Am I saying the movie is as good the first one? No, but is it as enjoyable? Very close. Jim Carrey and Jeff Daniels reprise their iconic roles that everyone loved them for, and I swear, their acting and chemistry here is like they made the movie a day after the first one. I can't imagine the duo being any different. It's so great to see Carrey return to the roles he's always been good at.  Needless to say, these two kill it together. Of course, this is a DD movie, so the humour will be pretty dumb. I, myself, like this humour very much at times, which means I just adored the humour. Some parts even had me in stitches, and just like the pissing in a beer bottle and \"we called it a **** scene from the first one, there's some huge laughs here that I will remember for months. The humour doesn't always hit as hard as it should, but all the other big laughs mostly made up for that. If you love the first DD, you will enjoy this one. If you weren't really a big fan of it, you're not gonna enjoy this one. To be honest, the only hugely positive things I found out of this movie were the duo of Jeff Daniels and Jim Carrey and the humour/laughs. But isn't that all you ever want out of Dumb and Dumber films? In my mind, YES."}, {"rating": "0", "text": "This is just, just too dumb.\rWhen, I mean dumb, the word 'Imbecile' is even too good for this movie. Its garbage.\rI couldn't take it for about 5-10 minutes then I walked out from the cinema.\r I watched the movie because its Jim Carrey and Jeff Daniels, also I watched the first movie and it was so funny and good. While, this movie, I was shocking. Jeff Daniels was not suppose to act like that. He was so great in every single his movies. Jim Carrey should stop fool himself around. He can do better."}, {"rating": "7", "text": "A pretty good movie, I don't understand all the negative reviews on the critics side, well everyone has opinions. My only problem was at times the movie got a little boring but I'm pretty sure you'll enjoy it"}, {"rating": "7", "text": "When I watched Dumb and Dumber for the first time I was a child who was dying of laughs at the jokes of Jeff Daniels and especially the genius Jim Carrey. Surprisingly, 20 years later I still enjoy and put the movie easily on my personal list of the best comedies of all time. But what I felt with this Dumb and Dumber To was a feeling of helplessness. Jim Carrey and Jeff Daniels are still clean and the chemistry between the two is simply amazing. However, the film piece with holes in the script, forced moments and unnecessary clichés. Yet it is a good movie for fun, but it is absolutely less than the first film, even trying to copy the way blatantly."}, {"rating": "4", "text": "Sadly the charm of the original Dumb and Dumber wasn't replicated here. When the jokes work, they work pretty well. I think there were only a couple moments where I actually laughed out loud, though. When the jokes don't work however, its just embarrassing and awkward to watch. This movie just wasn't clever or funny enough to be warranted. It's not the triumphant return any of us hoped for. That being said, it can still be fun to watch Harry and Lloyd being idiots. If you're willing to take it for it's faults and just enjoy Jim Carrey and Jeff Daniels, then its worth a watch. I wouldn't spend money on it in theaters though."}, {"rating": "3", "text": "Two friends (Jeff Daniels and Jim Carrey) fool each other. Jim Carrey is fooling presumably for twenty years and Jeff Daniels for the duration of the movie. Absolute nonsense, no scenario, pretended acting from everybody, silly traditional gestures, nothing more to write, does not deserve more than three lines."}, {"rating": "7", "text": "'94 I saw a movie that hasn't aged a bit in my eyes, it's still one of the best comedies I've ever seen. This sequel is nowhere near it but it's still a great and wanted sequel. Loved it! It has a same chemistry and I had such a nostalgic feeling when those two idiots started to share their dialogues :) Guys have aged, and there are some over acting etc.. But it's a great film if you're a fan of the first film, and a good film if you just wanna see old school comedy with Jim Carrey."}, {"rating": "7", "text": "This movie reminded me of 'A Million ways to die in the West ' if you have seen it you know that is a stupid comedy, The kind of stupid comedy that some say  \"It lowers your I.Q\" well Dumb & Dumber 2 could be called one of those."}, {"rating": "0", "text": "Dumb and Dumber is one of my favorite comedies of all time so these characters really do mean something to me.  That's why after 20 years and many Farrelly brothers flops later I was worried that all the magic would be gone.  After seeing this lazy, unfunny, and cringe worthy movie my fears have been realized.  While Carrey and Daniels try to bring these characters back it's a total disaster mainly because of the Farrelly Brothers terrible story.  All the best jokes are in the trailer with that I didn't laugh once.  A train wreck from the start Dumb and Dumber To fails in every way that the first one succeded, making it the worst movie of 2014 so far.  F"}, {"rating": "0", "text": "One of the worst films that I have seen in many years. It was just crap, with a weak story line, and the jokes were poor, and I ended up 'clock watching'. One to avoid."}, {"rating": "0", "text": "This movie is awful.  The first one is funny with stupid humor  The 2nd is raunchy and bad acting.  A shame and a waste of money.  It is full of ridiculous \"dumb\" jokes that are a real let down from the first show.  It also is not a pg-13!!!!"}, {"rating": "6", "text": "You know It's not the best movie but its what I wanted. I wanted a stupid movie that at times is just too much, but that's what I wanted being a fan of the fist movie. So if you are a fan of the first that wants just grade A stupid you might like it, if not...don't bother."}, {"rating": "3", "text": "Jeff Daniels didn't disappoint.. I had a lot more faith in Jim Carrey than I should have though.. It felt like he took Lloyd from Dumb and Dumber and characterized him to an unbelievably ridiculous level where I cringed at every line of dialog. Maybe the big mistake was watching the first one prior to watching this one.. I hope that Jim can get the funny back."}, {"rating": "3", "text": "Dumb and Dumber To says all you need to know about the film in the title and yet still manages to be incredibly lazy, unfunny, and a cringe worthy movie. Just one big embarrassment of a film."}, {"rating": "2", "text": "Dyshpo's Law\r 1. When a film has more than 3 producers it shall suck.\r 2. When a film has more than 2 writers it will suck.\r 3. When a film has more than 1 director it will suck . (excluding animation)"}, {"rating": "2", "text": "This movie was an utter piece of crap... so much so that movies like this remind me why I stopped going to movies around 2011. The only reason I went to see this garbage movie was because my friend convinced me to go with him. We both are fans of the first movie and were holding out on the idea that maybe it wouldn't be a total loss. It was.\r It would be generous to say that there were a couple of chuckle-worthy jokes in the entirety of this movie. Other than that, it blows long.....and it blows HARD."}, {"rating": "6", "text": "Dumb and Dumber To underestimates the viewer's IQ. But this 109 mins long funfest is amusing yet disgusting, although humorous, I did not LOL not once throughout the whole movie."}, {"rating": "6", "text": "I have to say that the overall vibe I think most fans will take away from this movie is disappointment. It’s a funny movie, it’s great to see these characters back and a lot of their jokes do hit because Jeff Daniels and Jim Carrey work magic together. But is the movie as funny as the original? Probably not. It does feel a little bit forced. There are times when a lot of the jokes fall flat, especially in the third act and once they actually meet the girl they’re searching for, I think she was pretty much not funny at all."}, {"rating": "1", "text": "Just a poorly done movie the first one was good this was just a weak retry. I think there were a couple of well crafted sections but for the most part it lacked the great original comedy and creativity."}, {"rating": "10", "text": "WOW. The director to this fine, fine movie is a genius!! I like it how they put to instead of two. I was laughing before I ever had the pleasure to watch this movie! I went to the theaters my myself because I am lonely but I still had a good time! Fantastic!"}], "recommendations": ["hot_tub_time_machine", "the_dictator", "dumb_and_dumber", "the_watch", "the_three_stooges", "one_year_one_night", "the_hangover", "grown_ups", "a_haunted_house", "anchorman_2_the_legend_continues", "30_minutes_or_less", "hubie_halloween", "dinner_for_schmucks", "deuce_bigalow_european_gigolo", "ted_2", "yes_man", "grown_ups_2", "this_is_the_end", "tropic_thunder", "jackass_presents_bad_grandpa", "miss_march", "nacho_libre", "the_wrong_missy", "movie_43", "meet_the_spartans"]}