{"id": 2042, "title": "Dumb and Dumber", "starring": ["Jim Carrey", "Jeff Daniels"], "runtime": 107, "genre": ["Comedy"], "description": "Lloyd and Harry are two men whose stupidity is really indescribable. When Mary, a beautiful woman, loses an important suitcase with money before she leaves for Aspen, the two friends (who have found the suitcase) decide to return it to her. After some \"adventures\" they finally get to Aspen where, using the lost money they live it up and fight for Mary's heart.", "releaseYear": "1994", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/4LdpBXiCyGKkR8FGHgjKlphrfUc.jpg", "categories": {"plot": 6.571428571428571, "acting": 7.444444444444445, "ending": 5.0, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.903225806451613, "action": 5.0}, "reviews": [{"rating": "10", "text": "Why does it get a 39 Metascore? This is  hilarious! I'm glad these users are exposing the truth, by getting it a rating of \"universal acclaim\". In your face critics! This movie was hilarious, clever, and stupid. A must see for all Carey fans and anybody else really."}, {"rating": "10", "text": "Comedy Gold, there are so many humorous scenes in this movie if you do not laugh then you should see a doctor. The movie is a classic and it is worth your time seeing. Without Jeff Daniels and Jim Carrey this movie would have been a flop big time."}, {"rating": "8", "text": "Usually, I don't pay too much attention to what the critics have to say, but in this instance they are unquestionably wrong, wrong and did I mention... wrong! 'Dumb & Dumber' is a fine movie, but more importantly it is one of the funniest flicks I've personally ever had the pleasure of watching in my entire life. It is simply the KING of the buddy comedy genre, even almost eighteen years after it was originally released in movie theatres. Directed by the Farrelly brothers who excel at comedy and starring Jim Carrey, it's no wonder why this movie is great."}, {"rating": "8", "text": "It obviously wasn't destined to win an Oscar or anything like that but it's just so funny you can't help but laugh your head off."}, {"rating": "10", "text": "The funniest movie of all time!!! Jim carrey at his best! There is no better comedic duo.. i went to the theater w my dad when i was abt 13 years and it was just rib cracking fun! We laughed so hard we were in tears leaving the movie theater"}, {"rating": "8", "text": "Dumb and dumber is one of the greatests comedies i have ever saw, i dont know why it scored a so low rate in the critics review, it might be a little dumb but it's a great comedy."}, {"rating": "9", "text": "This movie was so hilarious! One of the funniest movies of all time. The storyline was good. The jokes were awesome! Jim Carrey and Jeff Daniels were great in this movie. The dialogue was funny. Dumb and Dumber is one of the best comedies of all time and you should definitely watch it."}, {"rating": "10", "text": "This is the funniest movie ever."}, {"rating": "10", "text": "This is the funniest movie I have seen, it will remain to be the greatest & funniest movie in the world forever."}, {"rating": "10", "text": "AWESOMLY SWEET!!!"}, {"rating": "10", "text": "Anyone who says this movie has any faults is just messing with themselves. This movie is a masterpiece comedy. I’ve seen it like 200000 times and it never ceases to amaze. I"}, {"rating": "10", "text": "It's kinda BS that this movie is only a \"39\" on this website from the critic views on this movie. It probably seems that critics don't comedy movies at all and they just negative reviews for the fun of it. This movie is funny and one of the best comedy movies off all time and the soundtrack is great too. Jim Carrey and Jeff Daniels make a great comedy duo and I wished that they make a great sequel to this movie."}, {"rating": "8", "text": "Dumb and dumber brings the laughs and the... well... laughs that makes this road trip comedy enjoyable, and by all means live up to It's name, literally."}, {"rating": "5", "text": "Even if you \"like\" this movie you have to admit its stupid. Beyond stupid, it's borderline atrocious. But it's impossible to hate on Carrey and anything that featured his 90's talent."}, {"rating": "0", "text": "What a waste of money and film. The movie is lam, is bad, bad taste, jokes that are not funny. It will be a classic of the bad, it will dissapear from the movie rentals IF get there."}, {"rating": "5", "text": "The title of the movie pretty much explains it all. The appeal of this road trip style buddy comedy is watching it's two leads (Daniels and Carrey) act like complete morons. The shear stupidity of their character can lead can lead to some funny moments. However pacing moments a quite a few failed gags bring the movie down.\r For one thing it feels like it goes on for much longer than it actually does. The gags in the middle portion of the film are where most of the misses take place. A few of them are lame gross out gags and fart jokes, but for the most part it relies on Jim Carrey making those stupid facial expressions of his. I, for one, have never found that funny of him.\r It's not hard to see why so many have enjoyed this. It's brainless sense of humor is sure to get some laughs from people. How to judge how much you'll enjoy this really just comes down to how big of a Jim Carrey fan you are. It really plays off of the type of humor he's known for. I am personally not a fan of his so this movie didn't really do much for me outside of a few chuckles.\r While it has struck the funny bone of so many people over the years I just couldn't get into it. There are plenty of better and smarter comedies out there, and ones that don't drag so much throughout their running time. You can defend the movie by saying being dumb is the point of it, however that doesn't mean it' going to resonate with everyone. While it does have some funny moments at the beginning and near the end, there's a lengthy middle section here that serves no purpose other than filling driving time in the plot. It's that time wasted that ultimately killed the movie for me."}, {"rating": "8", "text": "Dumb and Dumber revels in its juvenile and crude behaviour, it's the sort of film I sometimes feel ashamed to call side-splitting and brilliant, not from start to finish but it's various moments where it is utterly impossible not to roll over on tears of laughter for the stupidity you are seeing.\rJim Carrey and Jeff Daniels participate in the film that arguably kick started both their careers, they share a convincing comedic presence on screen, with a script that paints them as utter morons, thinking an Austrian accent qualifies to rhyme of a \"G'day mate.\" Or that Aspen is in California. These one-lined treasures rely on the timing of the actors, and they are timed with perfect precision. They take a road trip out of love and I'm turn get mixed up with some unsavoury people.\rThey take the trip to return a briefcase to Aspen where Lloyd's brief rendezvous with a rich woman has him head over heels.Their misadventures are the selling point of the film, taking wrong turns, having toilet relations and fooling blind children, the humour is ridiculous, but one can't help but laugh uncontrollably.\rJim Carrey brings to life the character of Lloyd, whose unorthodox personality and 'witty' ideas lead the film, while Jeff Daniels has his own moments, it's Carrey who steals the show. The stupidity can at times seem like a cover for an underlying sparkle of wit, purposely leaving it to the star power to make it good. One such case is a particular toilet scene, while flatulence can be no laughing matter, the scene relies on the facial expressions of Daniels, who does it with the upmost hilarity.\rThe characters they play paint a picture of buddies who never seem to take anything seriously, even at gunpoint, their quips and arrogance of situations make the film what it is.\rThe premise is simple and easy to follow, buts the performances and writing that push the envelope and make this a comedy that is hard to forget, it could be the era in which it came out or perhaps the talent involved, at almost 20 years old, the film still stands among viewers as one of the funniest to come along, with a sequel always sought after. Its the audience who speak, and this is one of those comedies that just works."}, {"rating": "6", "text": "This is a really funny movie with great actors but it doesn't hit my type of humor exactly and only because of that i point it not higher then 6 points."}, {"rating": "9", "text": "One of the funniest movies of all time, if you dont laugh at this you have no sense of humor, by far my favorite movie."}, {"rating": "10", "text": "There are no movies that come anywhere close to Dumb and Dumber. I can watch this over and over and still laugh my head off. I guess his next funniest is liar, liar."}, {"rating": "8", "text": "Screw what the stuck up critics have to say about comedies; they are usually way underrated just like this film. I have seen this roughly 40 times and still cannot get enough. It is a classic and if you have not seen it, go out and do so. I will warn you"}, {"rating": "10", "text": "one of the few films that i can watch more than once funny from the first to last second. ignore the critics this time they've missed the point completely this film isn't about complicated storylines."}, {"rating": "10", "text": "Probably the funniest movie ever made. I feel bad for anyone that can't enjoy comedy like this. It's filled with classic moments that never get old. It's hard to pick a favorite scene but I guess mine would be Lloyd's fantasy in the Chinese restaurant."}, {"rating": "10", "text": "If i could rate this movie an 11, i would. Funniest movie of all time, go see it now."}, {"rating": "9", "text": "'Dumb and Dumber' is a classic. The funniest movie of the 90's. With a close second being 'There's Something about Mary' Do not listen to the critics on this movie."}, {"rating": "10", "text": "This is probably my favorite comedy of all time. For some reason people who don't like it tend to say things like, \"too crude,\" \"its toilet humor\" and other architypically pompous criticisms. Personally I have a very silly childish sense of humor and I love it. It helps me see the funny side to everything in life even the most absurd of bad luck. And that's why I love this film, it perfectly reflects the futile struggle of growing up as a young male in this society, wanting all those things you'll probably just never get, and generally being down on your luck most of the time. But you know you'll look back at the crazy things that happen and having a good friend in the same position makes it all OK. I used to watch this with my best friend when we first started hanging out in our own flats and houses I have probably seen it about 30 times. I would go so far as to say that if someone doesn't like this film I probably wouldn't have anything in common with them and therefore would probably not want to hang around with them."}, {"rating": "10", "text": "Probably the funniest movie of all time if you haven't seen it go get a bunch of your buddies, a 12 pack, and get ready to laugh your ass off."}, {"rating": "10", "text": "What a classic. Lives up to its name and then some. Quite satirical when interpreted metaphorically."}, {"rating": "10", "text": "One of the best classic comedies ever made."}, {"rating": "10", "text": "very,very funny film that does not get bored no matter how many times you watch it. the critics must have done another film."}, {"rating": "10", "text": "An absolute classic comedy that's probably too much to handle for critics who would rather be watching Dodgeball or Starsky & Hutch. Carey and Daniels form one of the greatest comedy duos of the generation, no questions asked. Great supporting cast, cameos, and soundtrack all work to compliment a hilarious script and perfect deliveries by the film's stars."}, {"rating": "10", "text": "What a classic - Yes, when 99% of everyone I know my age (I'm 24) think this is one of the top five comedies of all time it means it's a classic. Even though I only know 3 other people (yes, I have a sibling), it's still embarrassing and discrediting for the critics to have given it such a low rating. This was the first and last movie review I'll read on this site."}, {"rating": "10", "text": "Classic humor. Don't listen to the critics on this one; they don't get it. One of my top three comedies of all time, up there with Holy Grail and Spinal Tap."}, {"rating": "10", "text": "My vote for funniest movie of all time. If only one of the many reviewers here can see the genius behind this movie, then maybe its a waste of time to collect opinions from these dummies (reference to the critics, not the many users)."}, {"rating": "10", "text": "Best (and funniest) movie ever made. Perfection from beginning to end."}, {"rating": "10", "text": "Dumb and Dumber is simply one of the funniest movies of all time."}, {"rating": "10", "text": "Not for the first metacritic rates a great movie with an absurdly low score... I wonder if meatcritic polled these critics/newspapers for an updated score given the movies longevity and cult status wouldn't the score be nearer 90."}, {"rating": "9", "text": "yes its stupid and yes its dumb like its title implies but its funny as hell. i laughed my ass off waching this movie. carey and danials do a bang up job as 2 dumb hapless idiots who find themselves on a adventure to return a womens briefcase. the comedy in this little adventure had me rolling on the floor. what i cant understand is ive wached this with some people who where laughing harder then i was to the point they where in tears . then wana stop waching it because they say its to stupid... that just doesnt make sense to me . you are laughing who cares how dumb it is . its doing it job. i see a comedy for only one reason thats to laugh i dont care about any thing els."}, {"rating": "10", "text": "Can't believe the poor meta score, this is legendary comedy... so many great lines. People shouldn't take it too seriously, it's meant to be stupid, that's the charm. Love it."}, {"rating": "8", "text": "Classic comedy about two inept losers who somehow bungle their way across the country to return a lost briefcase. The gags are quick and cheap, but you should expect nothing less from the Farrelly brothers, and the acting is spot on. It's still one of my favourite comedy movies after all this time."}, {"rating": "6", "text": "Does just enough to stay consistently funny though the first half is signficantly better than the second."}, {"rating": "9", "text": "This is probably the funniest film I have ever seen. Sure, the plot's lame, but whatever! It's a comedy! Come on, critics! A 39! Yes, this film could have been bad if not put in the hands of Carrey and Daniels, but guess what? It was!"}, {"rating": "10", "text": "This movie continues to persist as a quotable, road-trip relatable movie.\rThe user scores alone should be paid attention to here. It's a veritable cult classic now!\rIn summary, buy it for continued laughs or rent on Netflix for a shot of comedy. Good hang-out movie you can leave on and come back to half-way through and know exactly what's happening.\r\"Her name was Swammie, Sammie, Sonnie, Swannie, Swanson...\"Lloyd, check the briefcase...\"Samsonite, oh way off!\" Haha, never gets old."}, {"rating": "6", "text": "It had been more than a few years since I properly sat down and watched this, but looks like I wasn't missing much. It's funny, yes, but just a tad too silly for my likings. While I love Jim Carrey there are much better films of his out there and I can't say I was a fan of his early 90's work, but if you're after a little mindless fun then there's nothing wrong with popping this one on and having a chuckle, but for a quality film perhaps look elsewhere"}, {"rating": "8", "text": "The current critics score is misleading because over the past 20 years they've really warmed up to it.  It's hilarious, gross, endearing, and one of the most memorable comedies of all time.  The reason this (the original) worked so well while the prequel and new sequel didn't is because even though the characters are stupid, it's actually a pretty clever and witty movie.  There's some sort of brilliance here that might be impossible to duplicate.  It's not completely perfect of course, but it's great all the same."}, {"rating": "10", "text": "Funniest comedy i've ever seen! Dumb and Dumber is a masterpiece! Harry and Lloyd are going to boost your mod if you choose to watch it wether with friends or alone!"}, {"rating": "8", "text": "one of those films that will never age in its comedy, and will without a single doubt, leave you with very achy stomachs after all the laughing. Critics need to stop being so serious all the time, as there's nothing here to criticize except the two characters themselves who are there to be slightly awful, and for the comedy."}, {"rating": "8", "text": "A good classic comedy movie. This movie is filled with many good laughs. Seen this movie so many times but still laugh a lot especially at some memorable scenes. This is Jim Carreys best film in my opinion even though he has many good ones. Great chemistry with the 2 main actors and hilarious jokes make for a great movie."}, {"rating": "0", "text": "First one was novel and funny.  This one was way way way bad and the laughable silliness in the first film was replaced with just plain stupid silliness in this mess of a sequel.  Very disappointing --- no way this will be a trilogy, no way."}, {"rating": "0", "text": "I watched this movie and never laughed once. The plot is bad and stupid. It's not funny at all, I didn't laugh once! Its so bad and I cannot believe I wasted my money buying it."}], "recommendations": ["the_dictator", "dumb_and_dumber_to", "grown_ups", "hot_tub_time_machine", "the_hangover", "yes_man", "one_year_one_night", "step_brothers", "nacho_libre", "the_watch", "dinner_for_schmucks", "wild_hogs", "the_three_stooges", "a_haunted_house", "superhero_movie", "tropic_thunder", "anchorman_2_the_legend_continues", "this_is_the_end", "the_wedding_ringer", "ace_ventura_when_nature_calls", "norbit", "miss_march", "jackass_presents_bad_grandpa", "zoolander", "hot_fuzz"]}