{"id": 2608, "title": "Dumbo", "starring": ["Sterling Holloway", "Herman Bing"], "runtime": 64, "genre": ["Animation", "Family"], "description": "Dumbo is a baby elephant born with over-sized ears and a supreme lack of confidence. But thanks to his even more diminutive buddy Timothy the Mouse,  the pint-sized pachyderm learns to surmount all obstacles.", "releaseYear": "1941", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/4x9FmvdJ464Fg7A9XcbYSmxfVw3.jpg", "categories": {"plot": 5.162162162162162, "acting": 5.7894736842105265, "ending": 5.375, "soundtrack": 2.0, "cinematography": 2.0, "familyFriendly": 5.857142857142857, "funny": 2.0, "action": 5.7272727272727275}, "reviews": [{"rating": "3", "text": "Typical Hollywood adaptation of a Disney Classic.  For once it would be great to go to a movie and not get a lesson on social awareness issues.  For God's sake it is already about a flying elephant, do I really need to be scolded about animal cruelty and big corporations are evil.  Effects were cute. I would have rather seen the original adaptation with more animals talking and less human involvment."}, {"rating": "3", "text": "You've seen a horse fly, you've seen a dragon fly, you may even have seen a house fly, but you ain't ever seen an elephant fly. Well you have if you've seen the 1941 animated version, but these days Disney insists on remaking all their old classics because they're all out of ideas, they want to bring in a new generation of fans. In 2019 you can see Dumbo fly all over again in a live adaptation remake. A truly magical moment on the big screen again only with better effects, so does it hold up to the original animation? No, it doesn't. Sorry Tim Burton I'm a huge fan and all but this is nowhere near the standard it should be.Dumbo isn't exactly a film that needs an introduction but you're getting one anyway. It's a baby elephant with oversized ears that allow him to fly, which turns out to be a blessing for a struggling circus but also attracts the attention of the shady entrepreneur V.A. Vandevere (Michael Keaton). This remake or reimagining as they like to call it, for the most part is pretty much the same story with the addition of some new characters, Colin Farrell, Danny DeVito, Eva Green and Michael Keaton. Honestly if it wasn't for Farrell and DeVito this would be so much worse, their characters are interesting and time has been spent developing their characters. I can't exactly say the same for everyone else. Eva Green is just there to look pretty and the rest of the cast if I'm honest don't add much. It all feels very generic. Michael Keaton just went full on with this role, yes Michael we all know you play a great villain but perhaps you should have toned it down a notch, I understand as a children's film certain things are embellished slightly but there's a line and Keaton goes well beyond it. I've mentioned this before, if you're going to remake a film you should at least try to make some changes and add your own spin on it. Well this may have Tim Burton's name on it but it doesn't really feel like a Burton film. It has the signature Danny Elfman score sure but that's about it. Dumbo 2019 doesn't tug at the heart strings like the original 1941 version. If like me you haven't seen the original since you were a child then maybe give it another watch because there's a lot of dark themes within the story. Whereas this remake has little to no impact which makes you think what was the point. No seriously Disney I'm actually asking you, what is the point? Remake everything almost shot for shot, or else make another sequel to one of your many franchises, is that all we're getting now? At this rate the trend of Disney making a live adaptation of their old movies is going to get tiresome real quick. The Jungle Book and Beauty and the Beast have done well but with Aladdin, The Lion King and Mulan on the horizon it doesn't look like we're getting anything original for a while. Dumbo is not terrible, but it's not great either. Recommended for anyone needing to entertain your kids for a couple of hours."}, {"rating": "6", "text": "It's not a bad movie buuuttt it could have been much much better, I am disappointed. At first it is slow and boring, and I almost fell asleep; at 35 minutes it takes off and it gets a little bit interesting. Although it's the Disney movie that has the Tim Burton fingerprint of the 80's everywhere. OST reminds us a LOT of Edward Scissorhands. I can not say either that it's a good movie, is not up to the old one. It has the essence of the original but a lot of things are changed (I already said it, the Burton label). The villain (Michael Keaton) is horrendous, great actor wasted. Batman and the Penguin together again after almost 30 years, Burton made it possible. The elephants are VERY WELL MADE IN CGI. And \"Jumbo\" is REALLY cute."}, {"rating": "5", "text": "Admittedly, this was one of the few live action Disney remakes I was actually looking forward to. But what we ended up getting in Tim Burton's \"Dumbo\" is a movie that tries too hard to be different than the original animated effort. Whether it's Michael Keaton's evil carnival tycoon character, the financial integrity of his suspiciously anachronistic amusement park, or any of the other non-animal beings associated with the title character's plight, there's simply too much going on in here that either diverts too far from the source material, fails to entertain, or does both of these things. In fact, the only elements of this movie that do work are the few that are actually retained from the original. Dumbo is cute, you ache at the fact that he's lost his mother, and it is a joy to see him fly. What exactly are you trying to be, movie? A faithful retelling of a beloved children's tale or a more post-modern examination of the same events? Trying to be both of these at once is unwise, yes? Yet this is the film we're given; a moderately enjoyable yet frequently baffling mishmash of ideas that amounts to what I can easily say is the weakest of Disney's live action remake catalogue."}, {"rating": "5", "text": "This was nothing like the classic I remember from my childhood. It should have been called Milly and the baby elephant considering how much screen time she hogged. Gone are the mice and the crows and are now replaced by a subliminal message of feminism ringing throughout the movie. The boy actor was annoying too. Or he was just deliberately made a stupid character to prop up the character of Milly. De Vito was excellent. Farrel was meh. Rest of the characters were forgetful as well. Saving grace of the movie were the scenes of Dumbo and that's it. Disney really needs to keep SJW politics out of their movies."}, {"rating": "4", "text": "Dumbo is adorable and the film has tons of visual flare and amazing costumes. It also has dull almost lifeless characters (minus Danny Devito) and a poor excuse for creative storytelling. Aka Tim Burton the last 20-25 years!! Overall a middle 4 a C-."}, {"rating": "7", "text": "Dumbo is a cute film with an original story rather than a complete copy of the 1941 original masterpiece. Although the film loses a bit of magic because the animals don't speak, it still is heart warming enough to be enjoyable."}, {"rating": "7", "text": "So I didn't get around to rewatching the original 1941 animated film of this, so I won't really be able to compare the two here. However, I will say that from what little I do remember from the animated version, they did do a rather fine job of building upon the story and also adding to it and making it interesting and worthwhile with human characters, as there weren't really any in the animated version. It's got a stellar cast, including Colin Farrell, Michael Keaton, Eva Green, Danny DeVito, etc. all of whom give great performances. Furthermore, the visuals are a spectacle to behold, much like the circus and shows within the film. As for some minor cons, I wasn't sure what to think of the slightly darker tone in comparison to the animated version (though I should've known better since it's Tim Burton directing), but the more I think about it, the more I believe that his trademark style added a unique and worthwhile touch to the film for the most part, even if it did feel quite a bit like a sequel to 'Big Fish' often times (the fact that DeVito is in both films and Burton directed both only added to this feeling for me.) Overall, it's obviously nothing too fresh or new, and while I found it to be maybe not as solid as some of Disney's other live-action adaptations, it's still pretty dazzling and fun for the most part, making it just worthwhile enough."}, {"rating": "4", "text": "The 2019 live action remake of Dumbo helmed by Tim Burton falls short on almost every aspect. The plot of the original Dumbo takes up the entirety of the first act of the movie. The second and third acts of the film become a weird, meta commentary about Disney as a corporation, with a scenery-chewing Michael Keaton holding the audience's hand as he guides them through a diesel-punk capitalist nightmare. There's a lot of strange attempts by the movie to be \"woke\" about animal cruelty, but being \"woke\" about race or class is strikingly absent. Maybe this is intentional, as the original Dumbo is racially insensitive at best. While the movie isn't bad per se, it is disappointing, and left me with a feeling of \"so what?\" as the credits rolled."}, {"rating": "7", "text": "First of all, baby Dumbo is the cutest thing ever and whenever he was on screen I only paid attention to him. The special effects team had to make a cute baby elephant with big ears and they did just that. Now the acting in this film could’ve been better by certain people and others did their parts really well. One of those people was Colin Farrell, who played Holt Farrier. He stood out to me mainly because I really enjoyed his character and what he was going through and out of all of them I think he’s definitely the most relatable one. For the rest of the cast though I could tell they were trying but probably should’ve been recasted for example, Michael Keaton as V. A. Vandevere. I’ve seen Michael Keaton be a great actor in other works but this just didn’t suit him. The character seemed like it was created for Johnny Depp but Tim Burton couldn’t get him so he had to go with the second option. Also, I hate hating on kid actors because they’re kids but the daughter in this film was just bland. But then again this is her first movie ever so I’ll give her a break. I do love the set designs in this film though. I also love the message in this film and I think there’s actually two now that I think about it. Two things I would change if I could would be the pacing in the film and the ending. The pacing in this film felt slow until the end where it picked up way too quickly that it felt rushed. Which leads into how the ending was awkward and I didn’t feel like it was a good conclusion. In the end, Dumbo is a good kids film or for people who like Disney movies. For everybody else though it’s a slow burn at best."}, {"rating": "6", "text": "It's amazing that this film managed to make quite a mistake in such a basic element like the protagonism of the title character and that not only it showed that not all of Disney animated classics should have a live-action adaptation, it also reaffirmed that Tim Burton has remained in a devastating phase of complacency as a film director.And I'm not saying that Dumbo is a bad film but it's just a correct film. Visually attractive and certainly entertaining but there's no more.The rest of the cast is irrelevant and even so I think the biggest sin of this film is that it's called Dumbo and unfortunately Dumbo is not the star here and that is certainly unforgivable."}, {"rating": "4", "text": "Dumbo (2019): This movie tries way too hard to bring a \"serious\" story about an elephant that flies. For some reason the king of style over substance, Tim Burton, thought that an over-reliance on CGI and poor child acting would help."}, {"rating": "7", "text": "Tem algumas referencias ao filme original de 1941, não é  tão incrivel quanto o primeiro mais é um bom entreterimento"}, {"rating": "7", "text": "Entretenida, la escena de los elefantes rosas con todo el preámbulo de esta es lo mejor y vale de la peli. Desafortunadamente los personajes humanos no son carismáticos, los villanos son malos pq si al final, cuando a Keaton es el personaje emprendedor, innovador y visionario en pro del Circo. Es normal que Burton cuente su propia versión de personajes, lo hizo con Batman, guasón, gatubela y pingüino."}, {"rating": "7", "text": "Well, this Dumbo is quite a bit different from the original but it is quite entertaining. There are things some people won't like."}, {"rating": "4", "text": "Una película apresurada, sobreproducida, con escenas forzadas y que terminan dañando la historia original. Para mi, es mala, muy mala."}, {"rating": "5", "text": "It was a fine movie, not terrible but far from great. It was slow, boring and extremely predictable for the most part and the final act was when the movie started to get me invested. I'm glad that this is not a blatant remake shot-by-shot of the animated movie (like the live-action Beauty and the Beast) and I give it praise for showing a different perspective, too bad the writing wasn't good enough to make that perspective interesting or exciting.The references to the animated movie are soooo forced and serve no purpose to the plot, almost felt like their only purpose was just so adults that saw the animated movie as kids, go \"Awww, I remember that\". I mean, that was the marketing for this movie after all.Oh but we got a stellar cast: Michael Keaton as Michael Keaton, Danny DeVito as Danny DeVito and Colin Farrell as Colin Farrel, their acting was bland and it felt like watching three competent actors get wasted with bland and one-dimensional characters and the child actors were just not good."}, {"rating": "10", "text": "Any movie that makes my son and I smile as much as we did. Will always get a ten in my books."}, {"rating": "3", "text": "I was almost certain that Dumbo would buck the trend of \"copy-paste\" Disney remakes with new characters and an engaging different story, considering Dumbo's original run time is a mere one hour. Unfortunately, I was sorely let down, as this ends up being a poor effort by Disney. Main positives were the adorable elephant himself and a few circus sequences. Also it's hard to resist the charm of Danny DeVito and Michael Keaton in their roles. However, the film falters in most other regards, with a story that puts more emphasis on the lifeless, boring human characters instead of Dumbo, changing a lot of the main significance/themes from the original movie. Even with a longer running time, it still feels like the story is rushing out of its originally okay beginning to a lackluster second half. Because of this, character development feels rushed as well. Overall, while I do still appreciate Disney trying something different than just doing complete remakes of their old properties, this is not a good one."}, {"rating": "4", "text": "Dumbo is a sweet tale.  The movie has tons of visual flare and dazzling costume design.  But in typical Tim Burton style, everything is to excess and the story suffers as a result."}, {"rating": "3", "text": "A Flight Gone Awry.DumboBurton's live action Disney take on an emotionally driven circus act is profoundly dull. Probably, this has always been the risk that Tim Burton's (the director) sketchy cartoonish world comes with. Even looking at his previous projects, you can easily say that each of the visual galores could have gone wrong. But it is that fine analysation of emotion that Burton personifies on a screen with one dimensional characters; that makes it, against all odds, much better. So when you hear about the collaboration of Burton and Disney, you would think that it is a match made in heaven. Unfortunately, you are going to lose that bet, for carrying out such a wallop of drama, he has decided to surf above it, in fact hover around it, but will not and does not get his hand dirty.There is no string attached to the storytelling, no thread to link them all, ironically in a concept where everyone is rooting for one innocent character. You feel physically distant with this world, not when it tries to brag about its cookiness but when expresses the humane qualities. Although, for a brief period, it does get your feet taping in rhythm, but the credit goes to the \"teamwork\" theme that Disney has been endorsing since ages.The performance is decent coming from Danny DeVito as a goofy manager and Nico Parker as a sweet host of the storyline. And on the other hand, major contenders like Colin Farrell as an over brooding post war hero, Eva Green as the dame and Michael Keaton as a stereotypical evil billionaire fails to make our heart pump fast. Dumbo is not the example to put on a table full of love letters to Disney films, what humanized the animated version in the early 40s, is alienated vigorously by shattering our childhood memories."}, {"rating": "0", "text": "When was the last time Disney had an original idea? The only thing that they have done is buy other studios that are doing good work. This reminds me of the creatively bankrupt Disney that pumped out direct to video sequels in the 90s."}, {"rating": "0", "text": "Lazy and souless crashgrab. It's almost like Disney forgot what used to make them so great, and are letting their magic die. Hopefully these live action remakes will end sooner rather than later."}, {"rating": "4", "text": "Disney’s latest live action/CGI remake of a classic film is not good. You don’t get invested in the story at any points throughout the film once or ever and the acting isn’t a highlight. In fact, the acting can used as a complaint. Looks like Disney’s first live action fail."}, {"rating": "0", "text": "New story all about the kids not about dumbo horrible remake. I was really excited total change up."}, {"rating": "7", "text": "A magical and captivating remake/sequel to the 1946 original. Danny DeVito is especially fun and energetic in his role on screen!"}, {"rating": "9", "text": "This is a great movie and a light-hearted tale that would bring a lot of smiles on your face. My wife and I are both are 35+ adults with no kids and it managed to bring the inner kids out while enjoying it. The sets are 'huge' and 'big' and larger than life but that is the direction (and flaw) of Hollywood movies style in general, not this movie. The main character was well made, a memorable figure that has placed a soft corner in the heart. I personally don't think a comparison with the classic is right because the world,the audience has progressed 'a lot' and movie need to adjust to that."}, {"rating": "10", "text": "How can someone complain about lack of originality yet praise the fodder being released by Marvel year after year? This was a very sweet and emotional movie that was never boring and adapted the original in a very refreshing and exciting way. Tim Burton's style isn't for everyone but I recommend giving this movie a chance because it's definitely worth the watch if you're a long time fan of this classic."}, {"rating": "8", "text": "Just watched it in \"Worldmovieshd\" Site...Cannot describe how amazing it is..Visit Our \"WorldMoviesHd\"  Site to Watch new Hollywood Movies Online......"}, {"rating": "3", "text": "It's forgettable, I'm sorry, but it's garbage.The only good thing is the cast."}, {"rating": "8", "text": "It's about time we stop judging remakes based on their original counterparts... Disney's new Dumbo recreation is not only a technological marvel, it's a precious tale with heart and deep elements. The message of the original film still has failed to been heard and many horrible acts of torture exist on earth. This is why I was not mad about the plot pretty much being the same as it's animated counterpart. Anyways let's judge the actual movie for what it is. The film began pretty poorly to me, it's lousy editing and slow start discouraged me but that first flight gave me chills. The way they treated Dumbo's mom made my blood boil which means they really put shrill and real life elements into this flik. Danny Devito (Max Medici) and Nico Parker (Milly Farrier) were huge standouts to me. The heart and devotion they put into their characters was undeniable. Most of the other actors did amazing as well. It was hard to imagine them pulling off the dialogue as the original doesn't have much of it, but they do. But the third act is where the movie really peaked. I couldn't take my eyes away. It was so magnificent but horrifying at the same time. Overall this movie was good, the first 2 lousy acts were made up for with a magnificent finale."}, {"rating": "7", "text": "Although I put it on the list of my top 10 most anticipated movies of the year, I can't deny that I was very skeptical about this. From the moment I knew that the original 1941 animated classic would made into a live-action film, I was really worried how it would turn out. I mean, the beloved animated classic has a very simple story that could only work (at least as I thought) in an animation form. The original Dumbo alongside My Neighbor Totoro are the most \"innocent\" films I've seen in my life. Add to this the fact that it's directed by Tim Burton (one of my favourite filmmakers) whose adaptation of Alice in Wonderland wasn't the best thing it could be (although I liked it).To my surprise (and a lot of people's, I reckon), Burton's rendering of Dumbo marks Burton's return to his creative, unique vision he's always been known for. I can see Burton here at his brilliant. The eccentric visual panache that distinguish Burton's works are evidently present here and not only for its own sake. Burton's imaginative visuals that leap off the screen, as Dumbo's cuteness do, also add to the storytelling a great deal.What surprised me even more is when I found that this live-action remake isn't a \"remake\" per se. This is more like a movie that's inspired by the story of the original. Needless to say, the human characters here are way more richer and well-rounded than they were in the the animated film. Simply because: 1) most of them are new. 2) some of them are technically the protagonists of the story. And I can say that these characters are given a considerable amount of depth.The villain, played by Michael Keaton, is a bit over-the-top, but I think Keaton put his touch on it, and made me forget about that for the most part. Eva Green is just fine as always. Colin Farrell is just great as always. Danny DeVito is just likable as always. All the actors did a fine job, except for Nico Parker whose acting rubbed me the wrong way as well as her infuriatingly stereotypical character.Halfway through I thought the movie is pretty good, if certainly not as poignant and warm as the animated classic. At the third act, which is a bit overlong, the story became quite basic. It ends up treading very familiar territory. Even some characters have changed to fit the approach the movie took at the end, such as the villain who became even more over-the-top. For all that I couldn't help being less invested in the story, and the stretched denouement didn't help either. I also found how the things tuned out at the end a tad unsatisfying. And I believe that the moral at the end was slightly on-the-nose. That said, the messages that the movie conveys are well-woven into the fabric of the story. Mostly due to Burton's masterful visual storytelling techniques, including ingenious foreshadowing.The CGI isn't as good as I expected. I wasn't looking for something like what I saw in Favreau's The Jungle Book, but I hoped the rest of the animals would look as good as the elephants do, Dumbo in particular. Because if there is only one thing Burton did better than Favreau, it would be making the lovely baby elephant Dumbo as realistic as it's agonizingly cute. But unfortunately the CGI in general looks a bit outdated in comparison to what Hollywood has achieved in the recent years.All in all, I loved this version of Dumbo so much. And I think it's one of the best live-action remakes Disney has made so far. Also, now I can be pretty optimistic about Tim Burton's upcoming projects after I was quite disappointed from Miss Peregrine's Home for Peculiar Children.(7.5/10)"}, {"rating": "8", "text": "This film has done its job. He is very sweet and kind and causes pleasant feelings. In the film, only the children's acting is bad. An elephant flies before you, and you only opened your eyes wide!"}, {"rating": "0", "text": "This movie is a CGI mess, you can look at the movies wallpaper and you'll see that I'm right. Once again a movie that Disney has made that HAS NOT interested me, trust me when I say I like movies, I gave Spider-Verse a 10 score, but I don't like when a company (especially an entertainment company) is unoriginal. Have a good day everyone."}, {"rating": "10", "text": "I think that the movie should have a wayyy higher score. There's constantly new plots, and it does a great job at showing both sides of the story, so instead of \"surprise, this happened\", you become very invested and scared of what might happen. You get to see the movie from alot of perspectives, and you really live into the characters. Changing this and not getting the viewers stuck in one side of the story is really hard, but they did a great job with it."}, {"rating": "7", "text": "It’s simple, cute and fun. I think I actually like these Disney live-action redos better when they take liberties and aren’t shot-for-shot remakes..."}, {"rating": "9", "text": "This is one of my favorite movies of 2019, one of my favorite Disney movies, and one of my favorite movies of all time. This is not as good as the original but it still is pretty amazing. The acting was stupendous especially from Colin Farrell, Nicole N. Parker, Danny DeVito, Eva Green, Michael Keaton, Finley Hobbins, Deobia Oparei, and Sharon Rooney. The animation and visuals were spectacular especially Dumbo and the scenes where people were flying on him but the monkey was the only thing that didn't look totally real and believable. The costume designs were terrific especially Eva Greens costumes. The writing and screenplay were good but not great. Overall I really loved this movie not as much as the original but still I really loved it."}, {"rating": "7", "text": "It was actually better than I thought it would be. If you like Tim Burton films then you will be satisfied. We saw Dumbo in a 4DX theater. I would give that experience 5 out of 10. Most of the time the seat shaking just took me out of the film. The wind and tickle effects were really neat. They usually came at times that added to your surprise or experience of the scene."}, {"rating": "8", "text": "Thought this retelling was great. Removed the racist overtones, laughed, cryed, flew. What else could you ask for?"}, {"rating": "9", "text": "I will not see anything that is not 3D ! we loved it and got to see it in 3D ! The trailers ruined all the supersizes but it was still great . I just wish that 3D wasn't so hard to find . No 3D NO SELL !    ."}, {"rating": "10", "text": "In all basicness, 'Dumbo' is, arguably, the best Disney live action film. Before I go deeper, I just want to state a disclaimer, that being, I'm not fond of the live action remakes of classic Disney tales. 'Dumbo' blows it out of the park this time with Tim Burton's artistic and creative visual thoughts coming out onto the screen in shots so clean and pure. The story, very faithful to the Disney original, with the exception of one scene. The characters, yes a lot of them are human, but it's live action (touche to Disney). To an emotional scale, I am not one to actually break out in tears in the theater, being I'm very thick-skinned when watching a movie, but 'Dumbo' takes the very first time I broke out crying when \"Baby Mine\" is played. The scene itself, from the emotion, piling on itself numerous times in a matter of thirty seconds, just completes the movie, even though it's not even halfway through. So in all, 'Dumbo', to me, that is Disney. I look at Disney movies as somewhat of a checklist, emotional? Check. Witty and creative? Check. Family-friendly? Check. 10/10."}, {"rating": "9", "text": "It is a bit unthinkable that one of the best adaptations of Disney classics is Dumbo. An animated film with a short duration and not always charming in the plot, that now in this new adaptation embodies the mystical and the magic that Disney wants to project. Until now, many of the films turned out to be only replicas of their animated classics without reporting anything special in them. Yes, Disney may want to captivate a new public using the tools they used years ago, but it is not entirely fair not to innovate in the frames and only get to limit themselves to the superficial of their previous proposals.Dumbo is simply wonderful in every technical sense. Tim Burton is undoubtedly a master of inventiveness and imagination since the world created in this movie is simply spectacular. We know a director who is not always conventional and he surprises us with his films in terms of the plot and the effects, but here in Dumbo, I find it fascinating as he is a retailer and how honest his proposal is. It never feels like a movie without a heart. It is movable without really striving for it. On the other hand, the entire cast glimpses and the CGI used for Dumbo is first class.Hopefully, the next adaptations of Disney are at the level of this movie."}, {"rating": "1", "text": "My daughter hated this movie, and so did I. Hollywood, please, everything does not have to be like Dark Knight Rises. Children's movies must not be downers, dark, and filled with identity politics either."}, {"rating": "6", "text": "No tiene ni la mitad del encanto y carisma que tiene la película de 1941, sin mencionar la ausencia de Timothy, sin embargo la sola presencia de Dumbo, cuyo encanto y ternura lo convierte en un noble y maravilloso ser es todo lo que la película necesita, lo demás no genera mucha gracia y está demás.Lo bueno: Dumbo y Danny DeVitto.Lo malo: Demasiado relleno y poco cariño.No me decepcionó pero no estará entre las mejores sin duda alguna."}, {"rating": "8", "text": "Hmmm."}, {"rating": "2", "text": "The adorable circus animal who used his freakishly giant ears to fly may have been pure lovability, until Tim Burton’s “reimagining” proves even the cuddliest things can mark that assumption wrong. The new Dumbo embraces saturated marketing only to take advantage of the public, much like how a “sweet” family-friendly story features a hot wife for no reason besides to satisfy the male gaze. The typical person thinks that s/he wants to relive childhood memories temporarily, which of course leads the Disney studio to exploit classic Burton.The wicked imagination behind Beetlejuice, Batman, and other hits of abnormality brings only one scene of his trademark style as he directs totally demented pink elephant bubbles. Although it’s an incredibly pointless scene, made even worse when the editor cuts away too quickly for the audience to get a good look at the rosy bubbles. Henceforth, the intention of it being a creepy scene fails. Burton also attempts relevance by including the original cartoon Dumbo merchandise that is sold to patrons, which is still an old-fashioned, dumbed-down way of conveying the complex ideas of abusing stardom.The cast displays less talent than the CGI face on the delightful Casey Jr. train, with less time put into redeeming the corrupted flesh of the actors’ absent facial work, without so much as a smile nor gag in sight. I mean… does the widower father feel even a smidgen of survivor’s guilt? He never shows it. Any genuine feeling, particularly that of foulness, only comes out through the emotionally hollow way Jumbo Jr. gets his humiliating name. Then there’s Michael Keaton, whose funny overacting matches Indiana Jones and the Temple of Doom. Yeah, no comment.Now, for some lessons on Mouse House screenwriting 101:Pander early on by throwing in a lazy shot of field-working slaves for no reason.Neglect the details, don’t make it clear right away that it’s the ears that make the pipsqueak a freak.Don’t show anyone affected by the danger of a baby animal.Make sure when there’s a sad scene between animals, don’t show them crying, a lady playing on a ukulele will suffice.Reference an old Hollywood masterpiece, Raging Bull, by making Dumbo’s big top intro mimic a boxing match, with focus on the mike… to please genuine movie fans!Talk down to the PG-rated crowd.​With all these blaring issues, it goes to no surprise that nobody in the screenplay changes by the end, particularly the daughter, who hopes to pursue science outside the three rings. A key necklace is supposed to be a core component to her arc, yet it’s addressed exactly twice—nowhere near enough times! She almost positively hates being in the project, much like Colin Farrell, as he makes clear through his performance.There are those appropriately dark moments, ones with indistinguishable animal silhouettes in black fog, but they are so short and so sparse, it doesn’t redeem how little the adults behind this feature expect out  of young developing minds. It thinks children are inept at comprehending tragedy, just a lemur singing, “I like to move it, move it!” Yet in truth, as much as you try to sustain a crap circus for gullible minds to watch, the financial complications take over. These losers cannot bring the near-bankrupt circus back on top—they cannot manage money responsibly!Yet Disney still builds up the hype, as after their past hits across animation and Broadway won over the public, they now continually tarnish their reputation with awful photorealistic remakes. People have said good things about them so far, but it seems over time that lower faith will be found toward such a nostalgic studio as it becomes a victim of its own identity. Of everyone responsible for this train wreck, only Oscar legend Colleen Atwood meets her high standard as she allows the visual power of costumes to flourish.Surely you know yourself well enough to know that a movie where Morgan “God” Freeman gives Steve Carell ark-construction supplies is really only an excuse to make poop jokes. Surely you trust yourself enough to stop gullibly giving your money to an evil corporation despite all the signs from trailers and marketing saying to you, “we don’t care!” Do civilization a favor; ignore the pachyderm conga line at the Disney Corp. & Burton & Keaton Circus."}, {"rating": "1", "text": "I'm sorry, but this movie is pure garbage. Dumbo is lovely, but that's it. Nothing else is good in this movie."}, {"rating": "2", "text": "In the transfer to live-action, there are pros and cons. Burton’s world-building is transportive, with the aid of Ben Davis’ stunning, silhouette-adept cinematography which sends the heart soaring when Dumbo takes flight. There’s an enchanting bubble sequence that, albeit momentarily defies the grounded feel prior, feels like an ode to the wonder of Fantasia (the music from Danny Elfman, a frequent collaborator, is toe-tappingly excellent but lacks in walkaway power). But the same magic isn’t there. Dumbo is, in fact, an aerodynamic impossibility, there’s a scene where we’re supposed to believe Green’s character can’t see an airborne elephant around her, and Dreamland is a telling indicator that Disney have never heard the phrase, “check yourself before you wreck yourself”. And most hilariously of all, how can you really take a film seriously that has world-famous boxing announcer Michael Buffer shout “Let’s get ready for Dumbo”?"}, {"rating": "3", "text": "We were so excited to see the live-action/CGI remake of this classic. I have rarely been this disappointed. It started out well done, but then in Tim Burton's inimitable style, he goes deep dark and disturbing. Ruined the experience. Just simply destroyed any sense of enjoyment I could find watching the film. Why did Disney let him destroy the legacy of Dumbo?"}, {"rating": "2", "text": "A veces esta bueno hacer una historia diferente cuando se hace un live action de disney pero bien echa"}], "recommendations": ["the_bfg", "mowgli_legend_of_the_jungle", "the_call_of_the_wild", "cruella", "smurfs_the_lost_village", "corpse_bride", "the_nutcracker_and_the_four_realms", "atlantis_the_lost_empire", "bumblebee", "a_christmas_carol", "frankenweenie", "ferdinand", "pan", "how_to_train_your_dragon_2", "charlie_and_the_chocolate_factory", "the_lego_batman_movie", "spider_man_into_the_spider_verse", "maleficent_mistress_of_evil", "rio_2", "alice_through_the_looking_glass", "alice_in_wonderland", "the_witches", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "my_little_pony_the_movie", "the_lego_movie_2_the_second_part"]}