{
  "id": 1842,
  "title": "Dunkirk",
  "starring": [
    "Fionn Whitehead",
    "Tom Hardy"
  ],
  "runtime": 107,
  "genre": [
    "War",
    "Action",
    "Drama"
  ],
  "description": "The story of the miraculous evacuation of Allied soldiers from Belgium, Britain, Canada and France, who were cut off and surrounded by the German army from the beaches and harbour of Dunkirk between May 26th and June 4th 1940 during World War II.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ebSnODDg9lbsMIaWg2uAbjn7TO5.jpg",
  "categories": {
    "plot": 4.746031746031746,
    "acting": 4.816326530612245,
    "ending": 5.25,
    "soundtrack": 6.545454545454546,
    "cinematography": 3.75,
    "familyFriendly": 5.333333333333333,
    "funny": 5.5,
    "action": 8.291666666666666
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I have seen a surprising amount of great blockbuster films this year but none of them has been like Dunkirk. Giving a 10/10 to Dunkirk isn't enough. It's another flawless masterpiece from Nolan and such a unique experience. Easily the best movie I've seen all year and among the best films I've seen that were made in the last 17 years."
    },
    {
      "rating": "7",
      "text": "Unquestionably a very good film and worth seeing, but doesn't live up to the hype. Many people knock the lack of characterization but I had no problem with that, it is plot driven and a conscious statement about the smallness of individuals in a the largest war ever fought. Starts strong with a sense of immersion in the moment but becomes needlessly complex and distant as it goes on. An IMAX war film about 400,000 soldiers trapped by the Nazis is by definition a spectacle, but it never looks like more than a few hundred people are on screen at one time, and the climactic scene has what looks like a few dozen boats. I never thought I would say this, but this movie could have benefited from some gratuitous CGI to give it a feeling of scale. Instead the IMAX screen is filled with mostly empty beach. It feels intense for a handful of people but hardly epic. Spielberg may have had the same number of extras to work with, but he put them all on the screen at the same time and conveyed the immensity of the struggle. In my opinion Spielberg is best as an action cinematographer, he could never have made Memento. But Dunkirk shows Nolan is too cold and abstract to make an epic. Dunkirk was a small film with a lot of empty space on the screen. Patton was 70mm and balanced intense small scenes with battle scenes that used the expanded screen space to purposefully convey the epic scale of war as a human activity. Dunkirk is a smart and meaningful film, but misses the mark at being something greater due to an overly complex structure that adds nothing to the experience and poor use of screen space to depict a genuinely epic event from real life modern history."
    },
    {
      "rating": "9",
      "text": "Nolan gives us a war film that works not because of characters, but by atmosphere and an incredible sound design.  You learn nothing about any of the characters here, but for what Nolan was going for it makes perfect sense.  You feel like you're there with these men and Hans Zimmer's score is breathtaking.  Overall Dunkirk marks a familiar, yet new kind of Nolan film.  You see his finger prints all over it especially the finale, but to go with such little dialogue is foreign to him, he still nailed it.  A"
    },
    {
      "rating": "10",
      "text": "It's hard to find words for just how amazing Dunkirk is. It's one of my favorite pieces of history adapted into just a phenomenal feature film. The best part about the movie, in my opinion, was the score. Mr. Zimmer you have done it countless times throughout your fabled career, and I think Dunkirk may be your best score yet. The acting was top notch. It was refreshing to see a war film from a very different perspective. This was about about survival and living to fight another day. The different perspectives of our main characters all made me feel like I was right there with them. What amazing film. Oscar for sure."
    },
    {
      "rating": "3",
      "text": "booooring movie... I really don't understand what people see so good. Confusing and simplistic plot. Shallow characters. Want a good war movie goes see until the last man, because this is a noolan hype and nothing anymore"
    },
    {
      "rating": "10",
      "text": "Dunkirk is many things: it's a technical masterpiece--cinematography, sound, and its clock-ticking score; it's an intense thrill ride that feels like it is never going to stop; it's a brilliant innovation in regards to the way it tells its story; and it's a heart-wrenching journey into the psyches of the countless troops who are trapped in war and just want to go home. Any movie would be considered great if its director did one of these things, and Nolan does them all. It's a film that requires you to think in order that you can feel."
    },
    {
      "rating": "10",
      "text": "Dunkirk is a masterpiece of cinematography, acting, writing, score and editing. This is easily one of Christopher Nolan's greatest films and one of the greatest war films of all time."
    },
    {
      "rating": "10",
      "text": "IMAX fully recommended, extremely intense movie from the beginnning till the end, the sound effect and score is masterpiece. Big applause for Nolan, 'cause he succesfully blow my mind!"
    },
    {
      "rating": "10",
      "text": "Incredible film!!! I viewed it in IMAX and it took movie watching almost to a whole new level. A roller coaster ride from start to finish, I was mesmerized and choked up all at the same time. Demonstrates the horror of war as well as any other war movie classic by putting you right in the middle of it. I see that some critics/viewers criticize the film for lack of dialog...I just think that makes it more real since everything was all happening so quickly during this event on so many levels that most involved were probably just in a state of shock. Technically everything about this film is amazing and the soundtrack took my breath away. Highly recommend this movie!"
    },
    {
      "rating": "10",
      "text": "Best movie of the year! This suspenseful thriller Dunkirk, will bring some hard ware home, come award season! Best Picture, Score and Director! Thing is, Nolan never ceases to disapoint in his films, and best of all this is an intense history lesson! Tom Hardy wears masks so good and the cast were all aces. This movie will have one picking up history books after you leave the theater!"
    },
    {
      "rating": "3",
      "text": "Found the movie quite boring, and it was hard to follow sometimes, specifically with the pilots. Dunno how this movie is rating so well honestly. Been awhile since I found a movie so dull, I'd rather watch Wonder Woman again and that movie was meh."
    },
    {
      "rating": "10",
      "text": "I watched the movie last night and still i'm having that rare feeling when you wish the movie lasted longer...first and foremost - there is no a single CGI scene in the epic war movie ! All is real and all is breathtaking ! Next is music - that Zimmer guy simply won't miss a second to ease the grip, he pushes suspense scenes (and the whole movie is one big suspense scene) close to the edge...this movie is the best Nolan so far, there is no excuse to miss it !"
    },
    {
      "rating": "10",
      "text": "Awesome movie, and very intense from the beginning until the end. Dunkirk is a well-crafted film by a great director. The story might confuse some, but it's brilliant in my opinion. The score is intense, and fits well with every scene in the movie."
    },
    {
      "rating": "10",
      "text": "Christopher Nolan has done it again with Dunkirk. So intense and pulse bounding I was shaking after I left the theater. One note it would be realistic if it was rated r with blood but it's amazing with a war movie that's all about the meaning,\"War\". Nothing else. No time to talk about each character, just get into each character is wasting time, these men need to go home and escape. THIS IS A WAR MOVIE."
    },
    {
      "rating": "10",
      "text": "Great thrilling action and pulsing soundtrack. Unlike any war movie I've ever seen.See in IMAX!  I don't get the complaint that it lacks human emotion, it just presents it differently then people are used to."
    },
    {
      "rating": "10",
      "text": "Mr. Nolan has shown that details are not always elaboration, sometimes it's just a few strikes from a paintbrush of an artist that explains the whole world."
    },
    {
      "rating": "10",
      "text": "A masterpiece. Dunkirk is a thrilling, haunting picture of sound and cinematography. With little to no character development, and mostly drowned out dialogue, this movie is truly a spectacle of action, drama and at times, horror. Such an intense take on war has never been filmed before, and hasn’t had me so immersed in the cinema for many years. Christopher Nolan has once again created a film that has you drawing for breath by the end."
    },
    {
      "rating": "10",
      "text": "Pretty much every film that Christopher Nolan makes is a flat-out masterpiece as far as I'm concerned, and I'm more than happy to say that this film is no different! In fact, I think that this just may be the best war film I've ever seen (sorry to say it, but step aside 'Saving Private Ryan'). I honestly can't remember another as suspenseful or one that got my heart pounding and gave me goosebumps as much as this one did! From the very opening scene to the film's final moments, it never lets up, giving us an intense and nonstop look at the epic and historical moments and events that unfold throughout the film. The three-way narrative structure (land, sea, and air) is handled seamlessly, and the imagery/cinematography, sound, actors, etc. made this an all-around fantastic and unforgettable experience that fully immersed me in this great and historic moment in history, plain and simple! Overall, not only is this hands down the best film of the summer, but it's well on its way to maintaining its status as my favorite film all year long most likely! Mr. Nolan sir, you never cease to blow me away!"
    },
    {
      "rating": "3",
      "text": "Underwhelming. For me that's the only word can describe this movie. I saw this movie with my 73 year old father in law and we both had the same reaction to this movie. We really wanted to like it. We both love great  war movies. This movie was beautiful to watch, especially in IMAX.  The first 10 minutes or so was pretty good. After that, no real substance. No character development. Virtually no dialogue. It was so difficult to really care about any of the characters. Tom Hardy's character was pretty good, but still no depth. The timeline is a bit odd, but I didn't feel that it added anything to the movie. Nothing like Memento, my favorite Nolan movie.   The movie seemed so much longer than than the 107 minutes that it was. Pacing was awful. I have no idea how it gets so many 100 scores."
    },
    {
      "rating": "10",
      "text": "Hands down the movie of the year. Incredibly intense, powerful, and moving, and packs an amazing amount of stuff into a lean 100-minute runtime (doubly impressive considering how little dialogue there is). Massive props to Christopher Nolan for making a WW2 movie with an authentically British cast instead of doing the obnoxious modern forced-diversity thing, and for focusing on the courage and heroism of the Brits instead of demonizing German soldiers like Spielberg did in Saving Private Ryan.For my money this is hands down the best WW2 movie I've ever seen, even better than Mel's Hacksaw Ridge last year. If there's any justice this will take Best Picture at the Oscars."
    },
    {
      "rating": "2",
      "text": "How? How is this getting the 10/10's? Four of us saw this together - age ranging from 21 to 47, and all disliked it. The first few minutes are good, but after that - what a complete bore-fest. No characters that you care about, or gravitate to. No real story; 3 separate stories that are disjointedly strung together, but are worse for wear by the added time-jumps. The relentless score that literally wears you down. No blood (I'm not one for the gratuitous slo-mo violence of Hacksaw Ridge - far preferred the documentary feel of Saving Private Ryan), but no blood, when they have just been blown up by a bomb, pulled me straight out of the film.We all felt like it was 4 hours long, as the shots seemed to all look the same, repeating, over and over again. This is the first time in my life where I TRULY feel like the reviews have been bought. I reckon the studio executives watched it and thought \"How the hell is this going to appeal to a wide audience? We better buy some amazing reviews, or we'll never get our money back.\""
    },
    {
      "rating": "2",
      "text": "I pride myself on my judgement of movies and Metacritic nearly never fails me, yet it did this time. I am blown away by the \"professional\" critic reviews. It just does not make sense and I find myself sitting here wondering what is wrong with everyone. The other reviews below consistent question of \"was this the same movie I watched?\" ring so true. It was plain bad, and I cannot for the life of me understand why the \"critics\" thought it good. Were they paid off? Were they caught up in the Nolan hype? There were so many fallacies and inconsistencies in this movie that I do not want to cover them all, but I really felt the need to say... Please do not waste your money if you are an intelligent, analytical, deep, perceptive adult... This movie is not for you. If you are a teenage boy or someone who just needs to turn their brain off for two hours and watch stuff happen in front of them, this movie may be for you. It is not a logically executed, well written, or intellectually / emotionally stimulating movie. It is shallow, dry, and poor from start to finish. War is hell, and this movie did not have the emotional capacity or grit to show that reality."
    },
    {
      "rating": "10",
      "text": "The film creates this bleak engrossing apocalyptic world that leaves you spell bound for 100 mins.  In the end it's a film about heroism without the blood and guts of all other war movies."
    },
    {
      "rating": "2",
      "text": "Obviously I missed something here, a lot in fact.  I found this film to be boring, annoying (the highly intrusive score didn't help on that account) and, considering the potential of the material, strangely limp and lifeless."
    },
    {
      "rating": "10",
      "text": "Flyers drift into the streets dropped from above urging the Allies to surrender after they had been absolutely decimated instead many soldiers literally wiped their ass with it.*Let us begin with the way the story is shown by director Christopher Nolan which is simply incredible and gives way to the imagination of what was coming for the British and French army. Dunkirk gives this eerie feel to the elephant in the room; Hitler & the axis powers who are not shown on screen but leaves any viewer with some historical knowledge aware the Germans are looming over 400,000 soldiers who nervously wait hat in hand for their fate, all Hitler has to do is snap to cease the existence of Britain as we know it on the jaws of Dunkirk. Instead of taking the typical Hollywood route Nolan focuses on the evacuation, the imagery, the sheer enormity of the task at hand and leaves towering figures such as the likes of Churchill (who recently had his own terribly inaccurate biopic told for the tenth time) as merely a mention – this is a soldier’s story, a people’s story.Hans Zimmer brings back renditions of the Dark Knight with the soundtrack piercing into your eardrums as the skies roar above with the spray of spitfire bullets hitting the Luftwaffe like rattling drums. One cannot help but feel nervous and uncomfortable with the soundtrack and in a movie depicting such a terrible event and time there is nothing more fitting.Dunkirk makes you feel as small and helpless as every soldier felt that fateful day and effortlessly avoids pitfalls nearly every war movie makes to glorify the victory while hammering home the evil of Nazi Germany which takes away from the big picture that ALL war is evil. In war sides survive, nobody wins and seeing it depicted in ways like this goes along way for showing the humanity of one side to the other – imagine propaganda films in the early 1940’s showed a little more of that! Right in the cockpit is how one feels during one of several intense Dogfight scenes as we are kept up close. Just as impressive is historical accuracy keeping inline with what occurred as the real heroes of the RAF fought off the Luftwaffe much further away from the beach to allow the evacuations to even be a possibility and we stay focused on the evacuation not the full scale war.Tom Hardy who can do no wrong lately (fresh from Taboo - go see it!) is the all-star in stellar cast who once again blends in effortlessly to the picture instead of controlling it and this movies momentum builds as every actor keeps stride. As a period piece it is important a movie looks the part and aside from the colouring of the dropped leaflets Dunkirk is absolutely on point from uniform, to locations to planes all of this attention to small details will keep the harshest historians happy.Action is directed very smartly and replaces blood and guts with that distant feel and imagination asked of the viewer again and again. Darkly mesmerising is the only way to describe in my eyes the early bombing scene as a soldier cowers on the beach as each bomb hits, bam, bam, bam, boom till a soldier disappears near him and you are left to think of the horror laying just off screen, not see it.In closing go see this movie and when your children are of age show them movies like this and let them understand what happened all these years ago. It is hard to imagine that this really was one of the major turning points of the war and has given way for you and me to be where we are right now. No one knows exactly why Hitler chose to not annihilate the British Army and hold back for three days some even believe he wanted peace with Britain but whatever occurred many sacrifices where made at Dunkirk and it is the job of every film maker and company to do these sorts of films justice (we’re all sick of Hollywood bs) and I can gladly say this certainly was a Victory.5/5 pounds*historical fact leaflets dropped made good toilet paper for soldiers something we all take for granted now"
    },
    {
      "rating": "9",
      "text": "Is this even possible for a movie to score this high nowadays because I believe Dunkirk broke the record for possibly best movie of the year if other movies being released on this year aren't as powerful or memorable as this movie right here. No seriously, how am I supposed to find flaws in this amazingly-made movie? This remark on history is stronger and more powerful than I thought it would be."
    },
    {
      "rating": "1",
      "text": "If you want a 2-hour long extended version of its trailers, go see Dunkirk. If you have seen even one of them, you have already seen this movie. It is so dull and uninteresting that the best thing about this one is that it is not 2,5 hours like Nolan's other movies. It really fails on every level: it does not entertain (even the intended 'suspense' scenes are so cliché that they are a pain to sit through), it does not appeal to your senses (even Hans Zimmer's score is bad), it does not give you any sense of relief or achievement, nor does it paint a cruel and realistic picture about the horrors of war. If you want the story of Dunkirk, go with any of the documentaries, and forget about The Overrated Movie of the Century."
    },
    {
      "rating": "10",
      "text": "Dunkirk engages the audience from the first scene. The soldiers of the British army are being directed by their comrades to the beach at Dunkirk. Thousands of soldiers are lining up with great dignity to patiently await their rescue. Churchill has requisitioned civilian boats to pick them up.So, you ask with great anxiety about the result of the herculean effort to rescue and deliver the soldiers to Britain, did Harry Styles survive to the end of the movie? My answer is: go and see. The visual display,  the persistent and exciting percussion of the musical score, the booming zooms of the aircraft, bombs, gun fire, and other sounds of war immediately brought me to the beach at Dunkirk while my gut rumbled and vibrated in my seat. I became a soldier on that beach, a Spitfire pilot, and an officer of the Royal British Army. I felt excitement, desperation, patience, forgiveness, sacrifice, empathy, the thrill of the rescue effort, and the possible consequential joy of being able to go home. This movie is an artistically delivered rendition of what it means to be a soldier, a sailor, and an officer. Will you be rescued? Will the support of the Royal Air Force be enough to get you off that beach and back into your family kitchen at home? I urge you to experience what I felt in watching Dunkirk. It's a movie that dramatically emphasizes the importance of persistence, strategy, and humanity in the war against impossibility. Ten fingers.﻿"
    },
    {
      "rating": "10",
      "text": "Nolan's best movie, a crazy and incredibly tense ride through one of the turning point of WWII, put together in an almost silent way (very few dialogue in this movie)Incredible movie, incredible soundtrack as well"
    },
    {
      "rating": "3",
      "text": "While visually impressive, I found Dunkirk to be a mix of boredom and confusion. There is three different timelines that converge which only makes it confusing, and does not add weight to any of the scenes. It's difficult to tell any of the characters apart, especially with very limited dialog. I'm not sure people love this movie so much, it's a pretty forgettable war movie."
    },
    {
      "rating": "9",
      "text": "This is an experience like no other. Powerful imagery and emotional symbolism made one almost weep, because the scope of this war-epic is phenomenally crafted. It’s a dark film for sure, but it serves as a glimpse of light over and over, with a forever returning theme of truthfulness to humanity. This, combined with the realism and empathetic feel to the setting that C Nolan masterfully has achieved – will make even the dullest being emotional.Dunkirk is very different from Nolan’s previous achievements, mainly due to the very lack of character inside through dialogs. But, amazingly, we can still relate and understand their thinking through the surreal events and clever filmmaking. The scope is real. You feel the seriousness. You feel trapped, just like the young soldiers. This is done almost without any dialogs. The silence between the characters says it all. The ones that stand out from the pack of men are Commander Bolton, Mr. Dawson and Tommy; this is where most of the focus lies and where we get most character depth. The non-linear structure helped with this, it almost trapped the audience in a loop with different perspectives on the event of Dunkirk. And the whole movie is all about the event, not the specific characters. You feel like you’re in it so you care for the situation and the characters, even though you might not remember their names fully. All of this is very rare and not often seen on film. It really works in the film’s favor, and yes even more inside to characters could never hurt a film like this one. But this isn’t a flaw in this film. To relate to characters in this extent with so little talking – is an Oscar-worthy achievement.To follow these characters in Dunkirk is an exhausting and adrenaline-packed experience with realistic action that you will not question. The realism is stunningly shaped. It might be one of my most surreal film experiences ever. Hans Zimmer’s score boosted the experience by tenfold, it got this “ticking” feel to it, almost like a heart beating faster and faster throughout the film – Zimmer is a propulsive force that never stops to amaze. The camerawork is just as stunning; you fly like an aircraft and feel the full gravity of the situation! It’s a smooth, stylish and artistic direction from C Nolan and ‘Interstellar’ cinematographer Hoyte Van Hoytema.Some minor flaws do exist. The action is at a few places very identical as to what already has been seen in previous scenes, so it took the “wow-feel” down a bit. Some individuals will without any doubt attack the “too realistic” WW2 feel, because it’s not bold enough for them. But to create this movie isn’t about being bold. It’s about creating something real. And it is, very!It’s an epic experience filled with realism but also small acts of heroism, kindness and forgiveness. Dunkirk is as action-packed as ‘Mad Max: Fury Road’, and stunningly realistic as ‘Saving Private Ryan’ but with a bigger slam to it. It reveals the true nature of war, the men behind it and what the bigger picture of it can be.Dunkirk is a visual and emotional experience that will take the gasp out of you. Period.Personal rating: 92/100\u2028Critical rating: 96/100"
    },
    {
      "rating": "10",
      "text": "Christopher Nolan has surpassed himself with what I can almost say is a masterpiece. Even with its little dialogue, I found myself captivated from the time the movie started till the credits rolled. With the visuals, acting, and raw realism, 'Dunkirk' may be one of the best, if not the best, film of 2017."
    },
    {
      "rating": "10",
      "text": "\"Dunkirk\" earns the title of \"masterpiece\". It's a masterclass in suspense, a history lesson, and an inspiring story of heroism all rolled into one perfect package. See it on the biggest screen possible."
    },
    {
      "rating": "2",
      "text": "Even worse than expected.  There was no doubt the jackass critics herd perennially on auto pilot would laud praise upon a noble little known true war story put on screen by a massively over-rated pompous director because they all sensed it must be important purely based on the subject and pedigree.  They in their utter dishonesty and phony pretentious lack of any shred of integrity assume in order to be perceived as serious and smart must heap praise on something like this.  Venture to say, no matter what Christopher Nolan came out with the praise would be the same near unanimous nonsense it is.  They didn't see the actual movie.  They only saw the pretense.  For the last time:  subject matter is not primarily what you are reviewing idiots, the way it is executed is.Here's why it's not only not the great movie they exclaim, but a pretty bad movie!  There is no plot nor any character development, and there is no true suspense precisely because of this!  You can't be on the edge of your seat no matter what the action on screen if you are not invested in the characters.  This is an uninspired, stodgy, overly reverent trudge through a historic event with no invention working to transform such into a movie.  Hollywood movies are supposed to entertain.  Hey, that goes for whatever the content and no matter the tone.  If you want a dry history lesson on the event, go read a text book or watch a documentary (and nearly any fathomable documentary on this battle would be more interesting).Just imagine had James Cameron's \"Titanic\" not invented the fictional core love story and characters both modern day and past for that story in favor of pure, straight documented, totally accurate depiction of the historic event?  It would not resonate as the epic Hollywood classic it became in short time.  And it's not as though they blew off the historical accuracy which was painstakingly recreated in nearly every detail.  It's that Cameron understands what movies should be for the audience, not just himself.  The characters here are puppets whether real or imagined.  The spare acting caught on screen is devoid of performance which while realistic is dull and it's not the cast's fault.  There's no script!  Kenneth Branagh tries, but sorry a watery eye in one close up and looking up for a few seconds in alarm of coming doom is not all there is to acting.  If it is, then anyone can do the job on cue and to effect as professional actors must do.  Worse still, like his last lame pretentious effort \"Interstellar\", the sound mix is AWFUL again!  The freaking dialogue is mixed too low to the sound effects and even more so to the music!  It's bad enough these actors have mumbled hard to understand heavily accented deliveries, but to then self indulgently attempt to be more \"real\" by making the decision to compromise intelligibility is just plain asinine.  It's unprofessional.  It's downright incompetent!  Music is artificial to begin with, so his illogical argument last time about being more real to life experience is again just a fallacy here!The staged big screen aerial dog fight footage is how this movie initially seemed to showcase itself in advertising and is about the only worthy of attention aspect of the entire production.  So a few real flying shots of vintage WWII fighter planes from some unique angles with unnoticeable not overdone CGI is worth sitting bored out of your mind for two hours?  Ah, no.A-lister Nolan is a moviemaker who cares about the audience and the entertainment value he is delivering, but he is gravely mistaken in his efforts.  No question he is highly intelligent, creative in general, a scholar of cinema history, and understands all the technical mechanics of filmmaking as well or better than anyone.  What he is not is an artist who delivers genuine emotion.  That's what great movies and great art in general is truly about.  Nolan is a very cerebral writer/director not unlike say Kubrick who also fell short on emotion in all his work.  However, Kubrick was such a genius and brilliant designer of mind bending psychological exploration that the lack of emotion in his art is acceptable as the canvases are overflowing with inspiration as it is just on an intellectual and aesthetic level.  Nolan is only a pale imitation of that (though granted a better poser than say PT Anderson, another retro junkie also falling for old gimmicks of the medium over good storytelling).  The truth is he hasn't made any great films, only a few good ones, and the rest are all pretentious mediocre bores.  The only good thing about this thing is that surprisingly it is not overlong as is the stupid trend.  That's because the story is thin to begin with and padded out for running time.  If you must still go see it, go digital.  The film prints are literally half the resolution and quickly damaged by today's uncaring theaters!  Mr. Nolan the luddite is delusional in his denial of reality.  Passé tech 70mm is a hoax now!"
    },
    {
      "rating": "9",
      "text": "Dunkirk is a viceral masterpiece. The lack of character development and narrative is essential for inferencing the sheer scale of the situation. This isn't a story about individuals... this is a story about a narrowly avoided catastrophic military disaster. It is the chronology that is pure genius, although we should be accustomed to that with Christopher Nolan's work - and the music & sound design is awesome; barrages of deafening gunfire and plane fly-overs are followed almost immediately by near-silent expanses of hopelessness. Has to be seen in IMAX to be fully appreciated."
    },
    {
      "rating": "1",
      "text": "Do war movies need to have a script ?.......YES. Do war movies have to have characters ?......Yes again.....\"Dunkirk\" has neither script nor characters and as a result you rapidly lose interest in what becomes of any of the individuals we encounter because you never bond with them. In fact after a while they just seem very unlucky in their various attempts to get away!) This is a very cold film about an amazing event. Nolan seems far more interested in showing what bungled mess the Dunkirk experience was. He depicts the whole thing as futile, messy and basically more ANNOYING than anything else i.e., what a bunch of Losers! The result is a sort of yuppie take on WW2. And a rather desperate tossing in of Churchill's \"We shall never surrender\" speech in the final moments of the film doesn't make up for this film's fatal wrongheaded approach to its subject."
    },
    {
      "rating": "3",
      "text": "I've never given a movie such a low score but I have to this time to help lower the ridiculous overall score. While I appreciate this movie not going over the top, it just doesn't suck me into the story like other war movies. There is zero blood. It shows a guy getting bombed and he remains in one piece. The score was good but all it did was make everyone anxious. I know Zimmer wanted to create a sense of urgency since the film is about an evacuation but even the most simple, boring things, the music is going off the rails trying to rise up some suspense. It WILL drive you nuts. Take the music out of this movie and there's probably 20 minutes or less of dialogue and you're left with the most boring movie ever. I could give it a 5 but honestly I would never watch this twice. I don't know a single name of any of the characters. There's zero development once so ever so why give a crap about any of them. You can barely understand them also. Hacksaw Ridge was too Hollywood and too over the top but at least it was entertaining. This movie's only positive notes is the bone-chilling sound of German fighters about to dive bomb the soldiers. Nolan isn't a bad director but he's a terrible story teller. All of his movies are vague and confusing."
    },
    {
      "rating": "0",
      "text": "Nothing of substance. A tremendous waste of time and money. I am beyond flabbergasted on how the \"Nolan\" fanboys can defend such a mess of a movie. Pretentious af."
    },
    {
      "rating": "2",
      "text": "Probably one of the worst movies I've seen. The only thing stopping me from walking out was hope that it would get better - it didn't.I am dumbfounded how this even gets remotely close to an 9.0/10 average here and imdb. (Botted votes? Bribery?) Firstly the plot is empty, bland, boring, uneventful - I could go on all day...The character development is abysmal - non-existent. You feel detached the whole film except for the first minute (which are excellent bar the annoying background title text) and then it goes straight off the cliff into the dump. I was excited and enthralled expecting an amazingly engaging film - boy was I WRONG.Even watching Tom hardy blast away with his 10% accuracy is uninspiringly dull.The only good points are 'decent' cinematography(the best of which being the colours and contrasts which i actually enjoyed in some brief scenes), good sound effects, soundtrack is nice but overused and repetitive.In essence the film over-utilises cinematography and sound to form it's basis while leaving the lacklustre story and characters to support it instead of the opposite i.e developing a strong plot line and delving into the depth and breadth of characters while letting the cinematography and sound support them.Don't waste your time or money on this cash grab. 2/10 AT BEST!"
    },
    {
      "rating": "5",
      "text": "It is a good movie, but it could have been so much more. First off, roughly 900 vessels were involved in the Dunkirk evacuation and about 10 are shown. I understand not wanting to use excessive CGI, but it really detracts from what should be a turning point in the film. Numbers like 400,000 men are bandied about in the film, but all of 500 men are actually shown, even from a distance. Furthermore, Nolan sacrifices character depth and any kind of backstory - even going so far as to have most of the characters pretty much nameless - in order to showcase his artistic vision. The upshot is that I found it difficult to emotionally invest in any of the characters. Whilst his gritty portrayal is beautiful and it has its moving moments, of which the opening scene is particularly memorable, in general the film fails to capture the scale of Dunkirk and at the same time manages to underwhelm in character development. It isn't a bad film, but it is often boring and what really sucks is the squandered potential it had."
    },
    {
      "rating": "10",
      "text": "it is the best movie of this sdecade and to the comment of numcrun 2 , rex reed is only jealous, nothing else, you know if you are so intelligent, then you have to be a director, ( and i suppose, that your movie would have a a rating of 10(metacritic-critics rating) and would have no content contrary to this movie, which is the next Platoon, Apocalpyse Now, Full metal jacket of our generation. If you would have read Joseph Conrad's book, you would no longer write such comments(as also the other jealous guys here)."
    },
    {
      "rating": "3",
      "text": "Are there 2 different versions of this movie? The movie that all the \"experts\" are raving about is not the one I saw. Have they all lost a bet to Christopher Nolan or is there blackmail involved? What showed at my theater was not much more than a glorified movie of the week. There is almost no dialogue, and what little there is is drowned out by the soundtrack which tells us it's not important in the first place. There is no plot, no character development, no acting, confusing characters, and time jerks from dead of night to simultaneous broad daylight. There is no audience connection or identification with the characters or situation. Granted, this is a critical episode in a World War, but the movie is filmed as \"a day in the life.\" The \"experts\" claim the acting is fabulous, but there is no acting. Tom Hardy sits in the cramped cockpit of a plane with his face covered by a mask the entire time. 400,000 soldiers are stranded on the beach, and we see maybe 500. There is supposed to be a massive rescue flotilla and we see maybe 12 boats. The \"experts\" describe the movie as \"avant garde\" and a \"masterpiece\". What I saw was \"meh\". Although I found it difficult at times to watch, \"Saving Private Ryan\" was a war movie with intensity, plot, and characters. \"Dunkirk\" doesn't come close. And what is \"The Mole?\""
    },
    {
      "rating": "2",
      "text": "After many reviews I was looking forward to seeing the film but came out feeling rather dissapointed. It was dull, uninspiring and had no tension that really grabs and pulls you towards the film with further interest. I felt so detached from the film, I don't know where the good reviews are coming from, are we talking about the same movie here?The big actors in this film dissapoint because there is hardly any acting. Tom Hardy sits in a cockpit for the entire film (everyone could do that) and can't hit a barndoor with a machine gun, I can only see 2 eyes and a forehead.. At the end his plane runs out of fuel, hovers in the air but he seems to fly on forever. Cillian Murphy mumbles and walks around on a tugboat from time to time. There is no character development or interesting dialogue that makes you feel involved/connected and caring about the troops and their misery. Hardly any signs of fatigue, broken nerves/ shattered spirits and wounded men (except for a few men on stretchers). These scenes do not make me think that I wouldn't like to be in someone's shoes being stuck on a beach, not knowing what's coming next. The possibility of death/ becoming a prisoner or saved by a rescue operation, seeing so many struggles on a beach you can't imagine how you will get picked up..The beach in the film is very(!) clean (with some dead soldiers that's really impressive) and there seems to be no sign of chaos, fatigue, fear or despair. There is absolutely no equipment scattered over the beach that looks close to a scrapyard, no trash, discarded gear and no abandoned vehicles etc. About 3 to 400.000 soldiers were saved but I saw 500-750 in the film (they all looked the same btw, hair and face), also I saw 10 to 15 boats TOPS. More than 900 boats took part in this operation over the course of 9 days and that's a fact. The smaller boats were used to carry men off the beach and put them on bigger steamers/boats, didn't see that. This film could have improved significantly with an extra 30 minutes at the beginning of the film. Brief fighting/retreating around Dunkirk showing the peril, discussions in Churchill's HQ about the situation in France and trying to save the troops against staggering odds. Such dialogue could have made it gripping, showing wht was at stake in that part of the war. Show me how everyone in England came together with everything they had that could float, trying to save the troops. Tom Hardy would be better placed trying to hold off the Germans and surrender at the end when he knows many troops are saved. In real life many thousands and injured who could not be saved were sacrificed and stayed behind In to keep the Germans away. A dejected Murphy waits on a beach to be rescued, that role could have suited him. The dogfights were rather dull.I was confused because of the jarring cuts in time and the shift (too fast) between the 3 characters.  I can't believe some positive reviews here \"intense\", \"great acting\", \"best war film\" Someone even commented they couldn't find flaws, in the first 5 minutes by looking at the housing in the background and the tiling, didn't look like 1940. Look at the background when they filmed the beach from the sea, modern housing and lights, streetlamps, shipping containers and crains.Can't understand why Christopher Nolan couldn't just make a straightforward, linnear warfilm that tells a gripping (true)story without all this fancy colouring and artistic filming. I went to see this film for it's story and not for the way it was filmed, coloured or making many switches from one time to another. It doesn't focus on anything in particular except for rescue.I wish these (expert) reviewers watched some documentary's like the world at war that really grips you and then watch the film again. Heck, even look on google for Dunkirk equipment and such. Steven Spielberg should have made this as Nolan would film Saving private Ryan with no casualties and no dialogue.  Wouldn't want to see the film again."
    },
    {
      "rating": "2",
      "text": "The IMAX version, at least, is fully endorsed by the International Earplug Association. If you don't have tinnitus before you see this overrated disaster movie, you will when you walk out. Abusively, gratuitously loud, with a soundtrack designed to loosen your internal organs from your skeletal frame. I might have liked this movie but I couldn't tell; it's impossible to appreciate anything else about Dunkirk when your fillings are being vibrated out of your teeth. I suppose the point was to bludgeon me into knowing that war is hell, but somehow Spielberg managed to convey this with considerably more weight without causing me actual physical pain. Overwhelming the senses is apparently the film industry's way of creating a unique theatrical experience. If so, it's inducing me to the opposite: perhaps if I'd waited to watch at home with some control over my viewing experience I'd have appreciated it more."
    },
    {
      "rating": "1",
      "text": "Terrible script, unsympathetic characters, confusing plot sequences and corny story lines. Silliest bit is when soldiers try to stop their boat sinking by covering up the bullet holes with their hands; they only abandon ship when the hull is completely inundated with water. This is just completely ridiculous. Everything gets blown up around the central characters, who get out of a lot of narrow scrapes in a series of  sinking ships (I lost count in the end). They survive intact and unscathed, barring their blackened faces - a bit like Wile E Coyote in the Road Runner cartoons. The flotilla coming to the rescue looked like it was a handful of boats, so one of the most remarkable incidents of the war, the rescue of the British Expeditionary Force from the Nazis, comes across as an anti-climax. Trawler segment with Mark Rylance could have come straight out of the send-up in the recent comedy Their Finest (a much better film). I can only assume that the director has spent so much time making dumb action movies based on comic books he's completely lost his touch when it comes to creating engaging characters and plausible stories. There wasn't much of a script and the little dialogue was hard to make out. No wonder (spoiler alert) nobody spotted the French soldier earlier - as hardly anyone was saying anything! I'm not a scholar but the film seemed to overdo conflict between Brits and French, overlooking the fact that (according to Wikipedia), 139,000 French troops were evacuated from Dunkirk. I'd be interested in reading a historian's perspective."
    },
    {
      "rating": "1",
      "text": "The film is nothing more than a DVD release story line.  Very poor showing for something that was hyped by \"professional\" reviews.  If you are expecting an epic war movie (which i believe the true story line could show) then you will be disappointed.  Some big name actors do not perform, largely down to the poor directing.  Save yourself the cinema ticket."
    },
    {
      "rating": "0",
      "text": "I'm sorry, this movie was a piece of crap. There's no story, barely any dialogue, no character development, but it does have big AUDIO SCORE THAT BLASTS SO LOUD YOUR WANT TO SCREAM. There were apprx 25 people at the showing I just saw here in Los Angeles and over the course of the 90 mins... 4 people WALKED OUT."
    },
    {
      "rating": "0",
      "text": "Here's a short guide how to win an academy award: Step 1) Make a movie about the second World War (because nobody ever had *that* idea) Step 2) ???, Step 3: Profit."
    },
    {
      "rating": "5",
      "text": "After reading the reviews, I had high expectations for this film, but in the end was completely underwhelmed. It wasn't bad, but certainly not as good as what I had expected.  Overall, I found the fractured way the story was told, dialogue that I couldn't always decipher and an on-going struggle (this was probably just me) to figure out who was who (many of the characters were similar looking to me) took away from my overall enjoyment of this film."
    },
    {
      "rating": "5",
      "text": "Don't believe the hype. I saw it in Imax and a lot of the dialogue was indecipherable (Rex Reed makes the same point). There is surprisingly little dialogue and a lot of unnecessary time shifting. There are some decent action scenes sure, but the plot is a bit thin (yes I know it's a true story) and it's just OK overall. Rex Reed's review very closely matched my own views."
    }
  ]
}