{
  "id": 3887,
  "title": "Eagle Eye",
  "starring": [
    "Shia LaBeouf",
    "Michelle Monaghan"
  ],
  "runtime": 118,
  "genre": [
    "Mystery",
    "Thriller",
    "Action"
  ],
  "description": "Jerry Shaw and Rachel Holloman are two strangers whose lives are suddenly thrown into turmoil by a mysterious woman they have never met. Threatening their lives and family, the unseen caller uses everyday technology to control their actions and push them into increasing danger. As events escalate, Jerry and Rachel become the country's most-wanted fugitives and must figure out what is happening to them.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9KCOv0hL37IN3tWG3j86eZg3xDH.jpg",
  "categories": {
    "plot": 7.357142857142857,
    "acting": 7.214285714285714,
    "ending": 7.75,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 7.035714285714286
  },
  "reviews": [
    {
      "rating": "9",
      "text": "It's a good thing I never listen to film reviewers. Top notch film. LaBoeuf is engaging and the story is probably far more plausible than most of us actually know. I laughed. I cried. I was thrilled by the action. And the story gave pause for some reflection. What more could you ask?"
    },
    {
      "rating": "10",
      "text": "Sure, it wasn't believable, but since when does that make a great action flick? Eagle Eye is an incredibly fast paced movie that lasts for a solid two hours and doesn't disappoint."
    },
    {
      "rating": "6",
      "text": "DJ Caruso knows how to pace and direct an action film. However he has no idea how to infuse an action film with any semblance of emotion or character. Eagle Eye gets by because the action is enjoyable and the leads do their job well. However if they werenâ"
    },
    {
      "rating": "7",
      "text": "\"Eagle Eye\" é um bom filme de ação sobre o potencial de erros da política de defesa dos EUA e os possíveis efeitos. Tem um bom final e conta com um elenco aceitável.7/10"
    },
    {
      "rating": "4",
      "text": "No worth renting at all. Not creative &I couldn't wait for it to be over.It was ridiculous and not believable at all.I forced myself to watch & hoped the ending would make sense of everything but it didn't."
    },
    {
      "rating": "3",
      "text": "I didn't like this movie. it was scary and boring."
    },
    {
      "rating": "6",
      "text": "Eagle eyes was a lot like Enemy of the State with Will Smith. Labuff is no Will Smith. Otherwise the movie is at least entertaining but does get a little far fetched at times (I know what's far fetched about a giant computer controlling multiple peoples movements?). Outside of the crazy moments the movie was actually very entertaining and kept me interested. Not an amazing movie but over all entertaining and exciting."
    },
    {
      "rating": "7",
      "text": "Easy watching, nice entertainment."
    },
    {
      "rating": "10",
      "text": "I thought this movie was absolutely amazing. It had action and suspense and kept you on the edge of your seat. I love movies where the main characters always seem to be in immediate danger, and Eagle Eye had a lot of that. The acting was excellent, and Shia's just getting better in each movie that he's in. A couple scenes were a little unrealistic, but overall, the action and excitement that made the movie so entertaining, allowed people to push the unrealistic parts aside. Plenty of people have been saying that the ending wasn't \"good enough\" or it should have been better. I disagree. I think that the \"good guys\" won, even though plenty of people refer to them as the \"bad guys\". Having a main character die at the end would have added something more, but I think that the ending was good too. If you kill off a lead character, someone's going to be mad and then none of the women fans would buy the DVD! Overall, I think this movie was sweet. It had great acting, awesome action, kept you on the edge of your seat, and added a little bit of suspense. I would recommend it to anyone who likes action or suspense movies."
    },
    {
      "rating": "9",
      "text": "I have no idea what the critics are thinking. This movie was entertaining from start to finish. Why is everyone saying that its not believable? Is Terminator, or Heroes, or LOST believable? Why is this movie supposed to be believable? but even if, we talked about its believability, I would say that it \"could\" be possible. Who knows what kind of stuff the government keeps secret. I strongly recommend this film."
    },
    {
      "rating": "10",
      "text": "I give this movie a 10,000,000 because the movie has grrreat suspense and it kept me on the edge of my seat! the movie was so good my grandma loved it and she cant even hear! i think this movie should have get all of the credit that they deserve plus more."
    },
    {
      "rating": "9",
      "text": "This movie, surprisingly, was a lot better than most professional reviews lead on. Is this a must see movie? No, but it's a cool movie that I would recommend seeing if the previews catch your eyes.. it's definitely better than all the reviews I've seen. Granted, there are some corny parts, or events that you may think would've gone down differently, but it doesn't take away from the fact that this is a good movie."
    },
    {
      "rating": "8",
      "text": "I really liked this movie i will buy it the day it comes out. only part i didn't really like was the ending. it was worst then i am legends ending... which is why i dock it 2 points. you should still check it out though"
    },
    {
      "rating": "8",
      "text": "This movie is what it is supposed to be, an action movie about two people, forced to obey a voice who threatens to kill them while they try to learn more about the voice. The movie loses a little of its luster in a cheesy twist, making the voice into an omnitent computer. The movie recovers at the end when, although the computer is \"killed,\" the pieces are already in play and we get to see how the story could have played out had the \"voice\" really been somebody. The movie is saved by the slight depth and emotional angst provided in between the car chases and Billy Bob Thornton, who perfectly fit into his role. You will get exactly what you pay for."
    },
    {
      "rating": "9",
      "text": "Viewers who never saw the films this one... homages, will find good acting and a plot that miraculously came together in the end. Despite all the criticism I find it one of the few movies that are successful with this kind of plot."
    },
    {
      "rating": "7",
      "text": "Did not like the typical Hollywood propaganda showing that terrorists attack us because we killed the wrong people which are the same ones they routinely kill to terrorize the population. Do these writers think we are all as stupid as they may be?"
    },
    {
      "rating": "1",
      "text": "Absolutely no redeeming qualities. Every scene is a rip-off of other movies. It's like the makers of Epic Movie and Date Movie suddenly started making action flicks. Just watch Enemy of the State, North By Northwest, The Fugitive, and Die Hard instead."
    },
    {
      "rating": "8",
      "text": "Really enjoyable, lots of action and a plot following multiple paths that all come together in the end. Shia is great as always."
    },
    {
      "rating": "8",
      "text": "Yes, it ripped off a lot of other movies, but don't most. Hollywood hasn't come up with an original idea in a long time with the exception of Burn After Reading. But this movie was a lot of fun to watch and cements LeBoeuf as a plausible leading man."
    },
    {
      "rating": "8",
      "text": "I enjoyed it a lot. It's everything you expect it to be, a thrill-ride. A solid action picture, which is more than I can say about a lot of this year's releases."
    },
    {
      "rating": "9",
      "text": "I really liked this movie... and I think the acting done by Shia LaBeouf and Michelle Monaghan was done really well. (Plus, Shia is a very, very good looking young man!)"
    },
    {
      "rating": "8",
      "text": "I think the director had a very clear and firm picture in his/her mind but had a hard time of conveying the picture."
    },
    {
      "rating": "8",
      "text": "Saw this in IMAX format. The movie was loud, fast-paced, insane action from start to finish. The premise was entirely possible, however, the way the villain in the movie was portrayed was a bit outlandish. This movie did not have many slow spots. It's sort of like a rollercoaster ride from start to finish."
    },
    {
      "rating": "10",
      "text": "Action packed! Definitely has enough for a mixed male and female audience. Very entertaining, definitely got my monies worth."
    },
    {
      "rating": "10",
      "text": "One thing I really hate about some of the \"reviewers\" scores is they base it upon realism, whether high-grossing actors are in the movie or not, and originality. Things like that shouldn't be taken too seriously. One example: The Dark Night, one of the highest rated movies this year. But DC mainly just made the comic into a movie (so it's not entirely original), and really is realism perfect in THAT movie? The point is I'm trying to make is that some reviewers can't take a breather and just plain enjoy the movie. Which comes to my review of the movie in one word to describe it all: awesome. The action is excellent, the story will make you think throughout, the actors do their roles very well, and overall it's a great thriller. I honestly think this is one action movie that is definitely worth checking out."
    },
    {
      "rating": "10",
      "text": "By far this is one of the best action adventure movies I've seen. Critics are failed artists."
    },
    {
      "rating": "5",
      "text": "I recently went to the theaters and viewed a film titled Eagle Eye, directed by D J Caruso starring actors Shia Lebeouf and Billy Bob Thorton. Eagle Eye is a very action packed movie from beginning to end, there are action scenes. The whole plot is a bit strange. A man and a woman were destined to help the country by stopping a terrorist attack. They did succeed in stopping this attempt in a series of action packed scenes. I have to admit the film was very exciting. The main character is given a series of steps to follow and it seems like every time he listens to the advice he turns out okay. He continues to listen. The film felt like a psychological movie much like The Matrix. When I realized all the directions being given to laBeouf come from a computer program controlling the nation, I became more critical of the film. Some of the fictional aspects don"
    },
    {
      "rating": "10",
      "text": "The movie is great if you want to get your mind out of your life and see something that will keep you at the edge of your seat. For the critic reviews, if you saw a movie that was 100% realistic, we'd hear you whining that it was \"too\" realistic."
    },
    {
      "rating": "8",
      "text": "Good action movie and was fun to see! Go see this one!"
    },
    {
      "rating": "7",
      "text": "A fun movie despite all the flaws described by the critics. Yes, you'll have to swallow a healthy dose of 'suspension of disbelief' potion. Isn't that true of just about any action movie? I enjoyed trying to figure out what was really going on: by the time it was revealed I was pretty close but not exactly on target."
    },
    {
      "rating": "3",
      "text": "If you're under 25 and accustomed to action without meaning, then this mediocre film will satsify. This movie is unnecessarily derivative--I kept flashing back to Enemy of the State, I Robot, and even Mission: Impossible. If you have ever actually bothered to see a good film rather than just a popular one, then this film will leave you wishing that you could have your two hours back. Special effects do not equal substance. I am willing to suspend reality a little bit, but the power line scene and many others are so ridiculous that I could not imagine what the writer/director was thinking. Probably something like: \"Let's see how stupid we can be and still get some people to give us 10 stars on Metacritic.\""
    },
    {
      "rating": "8",
      "text": "I don't know why most of the critics banned it. Yes, it was a bit preposterous (as many movies today are) but it was what movies SHOULD BE --- entertaining. I thought it's \"cross between the book 1984 and the movie 2001\" was pretty intriging, not to mention some great chase scenes and action sequences!"
    },
    {
      "rating": "10",
      "text": "I'd watch a whole movie of Shia LeBeouf building a model airplane. The movie itself is so-so, but Shia is Yo Yo!"
    },
    {
      "rating": "10",
      "text": "non stop action! keeps you thinking the whole time"
    },
    {
      "rating": "3",
      "text": "I'm all for a fun, goofy action blockbuster where you have to put your mind on hold..but even those films have to develop the characters and have an emotional anchor. At no point during 'Eagle Eye' do you come to further understand or identify with the characters"
    },
    {
      "rating": "7",
      "text": "This movie is a movie about 2 people forced to do something by an unknown voice. The thing you don't realize is that something like this could really happen. The movie starts off really good, but after you get into it, the action slows down. (It was a disappointment what the voice turned out to be). Still this is a good movie and it is worth seeing at least once if you like movies."
    },
    {
      "rating": "10",
      "text": "HOLY F*CKING SH*T. What's with the bad reviews? I thought it was one of the best movies ever created! Amazing action scenes unrivaled by almost every movie I have ever seen, great acting, very, very good humor, meaningful, and scary. Wonderful, wonderful movie."
    },
    {
      "rating": "5",
      "text": "[***SPOILER***] Dude sounds like a lady; the voice on the phone, Hal, reborn as a female super-computer(Halle), who keeps Jerry(Shia LeBeouf), then Rachel(Michelle Monaghan), alive, as \"Eagle Eye\", a live-action cartoon that borrows liberally from Stanley Kubrick's \"2001: A Space Odyssey, among others, updates the tradition of the person in peril who answers pay phones for pertinent information about his next move. Back in the day, the hero would run from phone booth to phone booth to receive his directive from some guy who tracked his target without the benefit of a grid. He probably had a strong pair of binoculars. That was old school. This is the new school, and for my money, \"Eagle Eye\" is just too chaotic for its own good. The thriller can be described as \"The End of Violence\"(Wim Wenders) meets \"Shoot 'Em Up(Michael Davis). Whatever social commentary about the Patriot Act this filmmaker proposes to make, gets upstaged, time after time, by overblown action set pieces, like a short attention span theater of the absurd. In a nutshell, \"Eagle Eye\" is George Orwell gone retarded. This dystopia, an extrapolation on the intrustion that technology plays in our lives, hardly disturbs, just like how a video game is more of an outlet for visceral thrills than a means to provoke thought. It's pure escapism, which is an irony of sorts, since there is no escape from the government these days."
    },
    {
      "rating": "9",
      "text": "Kept me on the edge of my seat from beginning to end. Yeah, some of the computer stuff at the end was a little silly, but \"suspension of disbelief\" and I went along. It kept moving and was a lot of fun. Don't know what the critics thought they were going to see."
    },
    {
      "rating": "7",
      "text": "Sparked my brief interest, but lots of technical errors. But hey its an anti-American Hollywood. What can you do?"
    },
    {
      "rating": "8",
      "text": "Not the best movie ever, I'll say that right now. However, it's oddly compelling so that I wanted to see how it ended. In short, it's pretty good."
    },
    {
      "rating": "8",
      "text": "I'ts was really good it kept me entertained, a little predictable after u catch the main idea"
    },
    {
      "rating": "9",
      "text": "Its really fantastic movie,it would be better if u watch in theatre,it fastens your seat belts.worth a watch 2 or 3 teams."
    },
    {
      "rating": "7",
      "text": "It really grabs you for the first 2 thirds of the movie. I personally feel that it could have been much better without the last 3rd. It was just stupid. I know that isn't an excellent review but there really is no other way to describe it. I enjoyed the film, the last bit didn't ruin the movie...it was just stupid. Plain and simple."
    },
    {
      "rating": "5",
      "text": "Unremitting bombardment of implausibility for your science fiction viewing. Non-stop action means there is some entertainment to be had, but the movie needed to take place in the year 2075 to be believable."
    },
    {
      "rating": "10",
      "text": "I thought this movie was amazing! It has multiple plot twists, plenty of action, with a acceptable ending. Anyway, the critics are way to critical of this movie. I don't feel i have wasted my movie seeing this at all."
    },
    {
      "rating": "8",
      "text": "Obviously not the most realistic of movies, but based on pure entertainment someone may enjoy this movie. It's nice to see Shia take on bigger and bigger roles."
    },
    {
      "rating": "4",
      "text": "Although visually pleasing, this movie was just one rip off after another. The first half rips off the matrix, as can be seen in the trailer. In fact, that's why I saw it, to bolster my love for the matrix by being able to say \"yeah! even the first 10 minutes of the matrix is an idea someone can make an entire movie from! Just watch eagle eye!\" And it worked decently as that for a while which is why I gave this movie even a 4. But then suddenly making it turn out it was a smart super computer just ends up ripping off 2001 with HAL, and for that matter, every other ghost in the machine movie or tv show episode or whatever. It was just an incredibly uncreative move in the plot line that I could only walk away from the movie theater in disappointment."
    },
    {
      "rating": "6",
      "text": "I thought it was slightly crappy here and there, still alright for a Sunday afternoon rental but definitely not a Saturday rental."
    },
    {
      "rating": "10",
      "text": "If I plop down $8-10 for a movie I want it to entertain me. Eagle Eye did just that. I don't care if it borrows from several classic films - as long as it entertains. This movie did that. Some films are thought provoking, some are just for fun - and that's okay. A film doesn't have to be all things to all people."
    }
  ],
  "recommendations": [
    "i_am_number_four",
    "the_a_team",
    "bright",
    "furious_7",
    "polar",
    "next",
    "crank",
    "underworld_evolution",
    "pandorum",
    "vantage_point",
    "edge_of_tomorrow",
    "gemini_man",
    "rambo_last_blood",
    "glass",
    "terminator_genisys",
    "poseidon",
    "jumper",
    "venom_let_there_be_carnage",
    "transformers_dark_of_the_moon",
    "the_marine",
    "nobody",
    "salt",
    "gamer",
    "the_tax_collector",
    "hancock"
  ]
}