{
  "id": 4752,
  "title": "Eastern Promises",
  "starring": [
    "Viggo Mortensen",
    "Naomi Watts"
  ],
  "runtime": 101,
  "genre": [
    "Thriller",
    "Crime",
    "Mystery"
  ],
  "description": "A Russian teenager, living in London, dies during childbirth but leaves clues to a midwife in her journal, that could tie her child to a rape involving a violent Russian mob family.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dpiJWb4NrWgcOg2rusuLhDM0hTm.jpg",
  "categories": {
    "plot": 6.592592592592593,
    "acting": 6.631578947368421,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 7.6875
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is for an educated audience. (not for a supposed 8-year-old niece that can write a script about Russian organized crime as noted in a non-critical bashing review) The mind-set is for the R rating, maturity and international crime solving group. Viggo Mortensen received a long deserved Oscar nom for his ability to get into his character's skin on this one. Well worth the watch and will put you on the edge of your seat; as well as open-a closed mindset."
    },
    {
      "rating": "8",
      "text": "Flawed, yes. But it's both riveting and compelling. The primary reason I rate this movie as \"good\" to \"very good\" is that it brings to light some important issues and is entertaining. If you want highly authentic material however, this isn't the film."
    },
    {
      "rating": "10",
      "text": "Please ignore Murdoc. He has obviously never understood Cronenberg if he thinks this was a \"miss\". It's 100% DC and 100% great. Disturbing as all heck and brutal as can be. Ends somewhat abruptly (2 hours in I was happy to be sitting there for 1 more). Viggo absolutely has put his hat in the ring for best acting performance of the year with his turn as Nikolai."
    },
    {
      "rating": "8",
      "text": "I think the critics got this movie about right. The movie started out in typical Cronenberg fashion with stilted dialogue and characters but then it seemed to coalesce for the most of the rest of the movie around the plot and the character that Viggo Mortensen plays. Viggo does a great job of embodying this man, he seems like a guy who has been in a Russian prison and he overcomes his pretty boy looks to great effect. Naomi Watts is a little stereotyped as the nurse character and is not quite as believable though she is nice to look at and doesn't detract from the movie overall. This is more conventional than the usual Cronenberg movie and I think that in this case this was a good thing."
    },
    {
      "rating": "9",
      "text": "I don't know what movie the commentators below saw, but I have to vehemently disagree with the criticisms. Yes, there are certain gaps in the script that are never brought to light, but to focus only on that is to miss the entire point of the film. It's not attempting to be an episode of CSI. It's more of an exploration of the polarities between right and wrong. It reveals humanity in the most improbable places. People need to understand that THIS IS A MOVIE. A piece of art is not intended to immaculately recreate reality, but rather illuminate an underlying message. So, to anyone reading this, do yourself a favor and focus on the poignancy of the story as opposed to the forensic inconsistencies. This is a great, worthwhile film, with superb acting by Mortensen to boot."
    },
    {
      "rating": "9",
      "text": "Absolutely Excellent! Exciting, intense and visually stunning, I cannot believe anyone could find anything to criticize. This is a must-see!"
    },
    {
      "rating": "9",
      "text": "Better than A History of Violence. The shower knife fight scene was awesome and the story was really engaging. The only thing that turned me off was the first scene, which was a little unwatchable and I wanted a little more out of the ending. Still a must see for anyone who likes crime or gangster films. Or a must see for everyone"
    },
    {
      "rating": "8",
      "text": "After A History of Violence, David Cronenberg and Viggo Mortensen team up again for Eastern Promises and the results are even better this time. Mortensen has never been better and Naomi Watts is perfect. I may be jumpin' the gun on this one, but this could be the best actor/director collaboration since the hallowed days of Scorsese and Deniro. A must-see for all film lovers and Oscar watchers!! (you'll be hearing Easter Promises a few times come January.)"
    },
    {
      "rating": "10",
      "text": "Eastern Promises is truly a terrific piece of film-making. The writing is so precise and subtle, with hints of foreshadowing, brilliant dialogues, and outstanding character development for all the major players. The acting is superb all around, with Mortensen and Mueller-Stahl shining the most. The directing, too, is very precise, especially in scenes that you can tell are impossibly hard to convincingly piece together (i.e. the bath-house fight). Watching the film a second time, you can really pick up on many of the subtleties that reflect the complexity and brilliance of all the aspects of this film. Eastern promises has a great shot at getting Oscar nominations for Viggo Mortensen (actor), Mueller-Stahl (supporting actor), and original screenplay, but I wouldn't be surprised if it snagged a couple extras as well."
    },
    {
      "rating": "9",
      "text": "absolutely phenomenal film that incorporates great acting, errie cinematography, suspenseful direction and an engrossing plot to produce one of the best efforts of the year. a must-see for any fan of kronenburg, tarentino, haggis, or HBO; it incorporates all the elements of modern filmmaking that have been sacrificed for the sake of commercial success; a violent, edgy, character-driven dialogue-fest that impresses the viewer on multiple levels."
    },
    {
      "rating": "8",
      "text": "French and spectacular. This dazzling performance by Naomi Watts and Viggo Mortenson are sparkling with magnificence, excellent of drama watchers."
    },
    {
      "rating": "10",
      "text": "What a strange, brutal movie."
    },
    {
      "rating": "10",
      "text": "People are going to hear a lot about this, so I may as well begin with it: There's a fight scene in David Cronenberg's Russian mob thriller \"Eastern Promises\" that is sure to go down as a raw, brutal and pulse-pounding landmark in the history of fight scenes. It takes place in one room, with no props except for a couple knives. People in the audience at the screening I attended were flinching and gasping as if they were being punched in the face. Which, of course, is the idea. If a fight scene doesn't make you feel like you're part of it, so that it quickens your heartbeat and your breathing, then it's a failure. And Cronenberg's makes you realize how many movie fights are flops -- and how really hard it is to kill or immobilize a human being with your arms, legs, feet and hands. Literally and figuratively, \"Eastern Promises\" has guts. And in this sense, it reminds me of both the excruciatingly protracted struggle between Paul Newman and the Russian agent in \"Torn Curtain,\" and the knock-down, drag-out fist-fest between Keith David and Rowdy Roddy Piper in John Carpenter's \"They Live! Directed in a bold, graphic style similar to that of his previous film, \"A History of Violence,\" \"Eastern Promises\" is shockingly gorgeous, for all the ugliness it portrays. The film is set in London, and the colors are dark and heavy: gray skies, slick black streets, brandy, absinthe, venous blood. A hospital midwife (Naomi Watts) finds a patient's diary that gets her involved with Russian gangsters -- in particular, a shrewd and ambitious chauffeur played by \"History of Violence\" star Viggo Mortensen. It begins like a Cronenbergian horror movie, and becomes... a Cronenberg gangster movie -- an elemental struggle between good and evil, life and death, east and west, blood and money, trust and betrayal, commerce and morality, mind and body. Remember, that's \"elemental,\" not \"simplistic.\" There are... complications."
    },
    {
      "rating": "8",
      "text": "Psychologically dark, very good movie."
    },
    {
      "rating": "9",
      "text": "If there is one thing Cronenburg is so good at, its taking a movie beyond the limits of being just a movie. It is more a study of the human being, and their behaviors and nature, and how they act and who they are, and who they pretend to be. This movie takes you into the lives of the Russian mob, a very dark, disturbing place to be, and a family of a young woman (played by Naomi Watts), her uncle and aunt find themselves thrown into the chaos. They discover a diary of a young prostitute, and this diary has a lot of power in this movie. Muehller-Stahl, who plays the leader of the vory V Zakone brotherhood, is absolutely terrific, and can shoot one glance that could freeze you, and then cut you to pieces. He is menacing, not in his actions, but in his look alone. Also, Viggo Mortensen delivers the performance of his life, playing this mysterious, off-put, odd friend of the son of the brotherhood leader. He can exude both evil, and kindness in just a few different shots. The action in the movie is real, and it is haunting, and one scene in particular will most likely stick with you in your head for quite some time. This is a movie to be taken seriously, and deep, deep under its seemingly simple layers of story, lies a very interesting tale that leads through the cobwebs of the Russian mob, and just what happens when family is messed with. This is a very good piece on humanity, and it is something not to be missed at a time when all Hollywood can chock up are lame Dane Cook films and same-old same-old \"kill the zombie\" movies."
    },
    {
      "rating": "9",
      "text": "Oscar-winning performances here, you betcha! Masterly performances by Mortenson, Mueller-Stahl and Cassel with wonderfully complex characterizations. Go see it!"
    },
    {
      "rating": "9",
      "text": "i really enjoyed this movie. i was a little nervous coming in to watch it because i thought cronenberg's last movie, a history of violence, was a complete and utter waste of time and had way too much pointless sex and violence, however eastern promises seemed like a more interesting and story driven movie and i think naomi is a great actress so i bought the dvd and was extremely happy with my purchase. the acting is extremely good all around, but most notably cassel playing kirill was the best. the story was interesting and never bored me. The directing was good and there was never a dull camera angle. Overall this is my favorite mob/gangster movie. It definitely beats out goodfellas, casino, and the godfather. pick it up and watch it if you havent, but dont if you cant handle the violence and nudity"
    },
    {
      "rating": "9",
      "text": "This has got to be one of my favorite films of all time. A suspenseful crime drama encased in an almost surreal experience. With Viggo Mortensen giving another outstanding performance along side Vincent Cassel. While this movie does has its flaws, it is defiantly not for the A.D.D generation expecting non-stop action. Truly a film that only comes around once a life time."
    },
    {
      "rating": "9",
      "text": "Totally compelling, memorable, at times shocking. One of the year's best. You can't take your eyes off Viggo Mortensen in this Oscar-worthy role."
    },
    {
      "rating": "9",
      "text": "Excellent movie... easily one of the best I've seen this year!"
    },
    {
      "rating": "10",
      "text": "Scorsese hasn't made a movie this good in 20 years!"
    },
    {
      "rating": "10",
      "text": "This was the best film I have seen in months (and I see many). Worth whatever it costs, 10 times better than a History of Violence, hopefully it will get the award attention it deserves."
    },
    {
      "rating": "10",
      "text": "Excellent character study of a deeply scarred man. Interesting aspect of the movie is the barely-veiled homosexual relationship between two of the vory v zakone. The famous bathhouse fight scene is still jarring and visceral even when you are expecting it."
    },
    {
      "rating": "10",
      "text": "extraordinary view of evil and decency, malice and family, with an honest non-romatic view of gangsters, killers and the Russian mob."
    },
    {
      "rating": "9",
      "text": "Cronenberg's most conventional film to date. Of course by anyone else's standards, this would be a most unusual film. That doesn't make a lesser film though. It's a great entertainment with a number of interesting ideas bubbling underneath the surface. It's look at the strange world of the Russian mafia is fascinating and the deceptively simple narrative builds to a surprising final half hour. Climaxing with a brilliantly staged fight scene set in a public bath house. Mortensen is terrific and is deserving of some awards recognition. The well chosen supporting cast is perfect. 'Eastern Promises' is minor Cronenberg in the end-but that's still better than 95% of the stuff Hollywood churns out these days. Highly recommended-but not for the squeamish. It is D Cron after all."
    },
    {
      "rating": "10",
      "text": "Without a doubt the most thrilling and satisfying movie of the year thus far. Mortensen ridiculously good. A potential classic."
    },
    {
      "rating": "10",
      "text": "I have never submitted a vote to these sites but I did not want anyone to be misled into not seeing this movie. It's one of the best I've seen in years. A new classic. Amazing performances from the actors and a plot that will surprise even the most jaded movie watcher. I normally would not recommend Cronenberg for the squeamish, but this one everyone should see."
    },
    {
      "rating": "9",
      "text": "Honestly, this movie rivals Goodfellas as far as a great Mafia Movie.."
    },
    {
      "rating": "10",
      "text": "This movie pulls no punches, literally, and figuratively. It begins with a brutally violent scene, which demonstrates the compelling nature of a person following orders, against their own will, and ends quietly, with a scene reminiscent of the contemplation of Michael Corleone in Godfather II. An amazing cast, with mesmerizing performances by Mortensen, and Mueller-Stahl. The shower fight scene is a heart stopper. Naked, brutally graphic, gritty and bloody. More than just a gangster movie. A real insight into human nature."
    },
    {
      "rating": "8",
      "text": "I've always wanted to share my thoughts about movies since I watched Transformers, which in my opinion is one of the best action movies to come out this year. For someone who grew up watching the cartoon, the movie was a dream come true, and I also believe Michael Bay(the director) put a lot of us to shame by delivering a worthy product ... but I digress. My intention is to share thoughts on movies I love like the one I just saw, and ones I truly loathe and would gladly request for $9 back...case in point - \"The Reaping\" \"Eastern Promises\" is movie directed by David Cronenberg. You may remember him from \"A History of Violence\". Every one remembers that movie...Seeing Maria Bello in her cheer leader outfit alone was worth the price of admission... then there was the sex scene on the steps. I suggest you rent or purchase it immediately. Back to \"Eastern Promises\"...The main actors are Viggo Mortensen, Naomi Watts, Vincent Cassel and Armin Mueller-Stahl; I'll get to information about their performances soon enough. Without giving much away, the story is basically about a nurse who unfortunately witnesses a 14 year old Russian girl giving birth and dying during labor. She embarks on a quest to find out more about the girl's family and also have her diary translated. On the nurse's quest of discovery, she ends up getting involved with some really vile people, mainly the Russian crime family - Vory V Zakone. The rest of the movie unravels the mystery behind the dead girl, and eventually the father of the baby.Warning! If you are not a fan of violent movies, you will not enjoy this movie. There's enough extreme violence to make the toughest guy squirm. One scene in the steam room is particularly disturbing to watch. I was impressed by all the actors. Naomi Watts, who I last saw playing the love interest of a mega-sized gorilla, put on quite a performance. Her character is the nurse who drove the story, but this is not a role she'll be remembered for...Armin Mueller-Stahl plays the owner of a restaurant and is also affiliated with the Vory V Zakone. Vincent Cassel plays his crazy son Kirill, who much to his father's chagrin, is also rumored to be gay. The true star of the movie is Viggo, who plays Nikolai, a mysterious driver who definitely wants to move up in the family. His russian is fluent, and his accent is perfect. It's almost hard to imagine him speaking in another accent after this movie. He accent and grammar really did sound like his spoke a Slavic language natively. It was very interesting to watch him play his role so flawlessly. In all, this was a pretty good movie. I believe David Cronenberg and Viggo should make more movies together. They certainly have a formula that works."
    },
    {
      "rating": "9",
      "text": "'Eastern Promises,' the latest film from David Cronenberg"
    },
    {
      "rating": "7",
      "text": "Mortensen was mesmerising, so much so I almost forgot the farrago of LOTR. It wasn't the same person. He was effortlessly menacing, yet still human; the plot and all the rest of the actors moved around him in the shadows - except for Armin Mueller Stahl who was (literally) the only genuine Russian. Vincent Cassel gave his usual panto performance. Naomi Watts was weak and couldn't transcend the implausibility she was being asked to cover up for.Everything tailed away somewhat disappointingly after a powerful first half and I was left watching the closing credits wondering what kind of fool I'd just been taken for. But at least I watched the closing credits because I was still thinking about it."
    },
    {
      "rating": "0",
      "text": "How can this movie get such a high rating ? It was awful, unbearable to watch. The acting was absolutely appalling, I cannot believe that good actors such as Mortensen and Cassel would agree to be a part of this ridiculous mess. The opening scene was so bad, you know the film can only get worse if it starts out bad. Absolutely horrible."
    },
    {
      "rating": "1",
      "text": "I really can't believe how wrong all the critics were on this one. Most of it was a wanna-be gangster flick for the Russian mob. Bad accents, cliche upon cliche, and the climactic fight scene in the steam room was not that great, unless you really want to see Viggo's privates flying all around. I expected so much more from these actors and Cronenberg."
    },
    {
      "rating": "3",
      "text": "I only give this three out of my respect for the director. It was horrible. I hated this as well as History of Violence. The plot line was weak and the movie boring. This movie is no commentary on violence. For starters there is not much action/violence in it. Secondly the action scene the movie does have (the knife fight) is violent and exciting. I have a hard time believing it was meant to be anything more. Cronenberg loves to display violence and gore. He is not attempting to do anything more than entertain through violence. If you don't believe me go rewatch The Fly and Scanners and Rabid. The only problem with EA is he doe not create reinforce his plot or characters...its a true shame. This movie is an emperor with no clothes...nothing more."
    },
    {
      "rating": "2",
      "text": "How this got suck a high rating in Metacritic, i can only wonder. This is trash. I agree with everything SethR wrote in his user review. I'd have a lot more respect for the whole enterprise if the film just admitted the truth - it loves to mire in the violence, the thinly veiled homo-eroticism, the simplistic moral message, and the infatuation with priveledge, and basked in it, rather than trying to make some moralistic good over evil struggle of it. Don't waste your time on this trash."
    },
    {
      "rating": "4",
      "text": "Cliche, careless, completely unconvincing."
    },
    {
      "rating": "0",
      "text": "This movie was so bad and gory that I walked out fairly early - yuck!"
    },
    {
      "rating": "2",
      "text": "DO NOT WASTE YOUR TIME OR MONEY OR LISTEN TO THESE MAROONS!!!. For all of you who find enjoyment in this piece of garbage and try to defend it with comments about art and deeper meaning, I feel bad for you. You must really be simple minded-- There is nothing clever or artistic about this film and I can give you 5 reasons why this is movie is quite possibly the worst movi9e I have seen in a really long time: 5)- It isn't believable-- No one walks into a L&D ward and walks out with a baby, No one is allowed things like a diary aka record of events in that girls situation, by the way how did she escape?? Why bother trying to explain that? 4) It is filled with lame cliches about Russia-- The only 2 Russian cliches they forgot was Dolph Lundgren and Boris and Natasia from Rocky And Bullwinkle 3) It is filled with Homosexual inuendos-- Naked men fighting and dudes watching each other bone-- ri-frickin-diculous 2) it would be pointlessly disturbing at times if it wasn't so hilarious-- verbally- characters say randomly racist things and there is random gory parts that would be borderline gross but ends up looking silly- Like Leprechaun 2 Gore- so unbelievable it is funny but not in a good way. and the #1 reason is. IT IS BORING__ OH MAN IS IT BORING!!!! From bad lighting to juvenile dialog there isn't one thing uttered in this film that is memorable or poignant. I have seen adult films with better writing. Whata Hack, I hope if you haven't seen this I convinced you not to. ANd if you liked this film I whole-heartedly question the necessity of you on this planet."
    },
    {
      "rating": "1",
      "text": "Question: when you people who gave this rave reviews watched this movie, what crack were you smoking? I definitely should have visited my local dealer because watching this movie sober was absolutely disappointing. Not only is it gratuitously violent, misogynistic and unbearable (Mortensen and Cassell's accents are truly aggravating to listen to), but it's also mired by the director's unrelenting ADD. He doesn't tie in all of the issues he vaguely touched upon throughout the movie. The end result is complete lack of satisfaction. This is the most disappointing movie ever and it's truly indicative of the CRAP Hollywood's been putting out there for us. If this CRAP gets such a high rating like this, I'm not watching anything in theaters anymore."
    },
    {
      "rating": "5",
      "text": "The actors are great; the film is weak. Another overrated notch in Cronenberg's mediocre belt. It settles for suggesting an impressionistic, sensationalized portrayal of the Russian Mafia/human trafficking, where a more detailed and realistic view of this true and little-known underworld would have lent more credibility and suspense. Instead we get a comic book, like Cronenberg's last film, A History of Violence. The entire film is premised on the ridiculous notion of the Watts character actually going to a location mentioned in the diary of a young girl who died under very unusual circumstances, and then mentioning the diary--when she has people in her OWN FAMILY who are Russian and could translate it! Though the film itself is weak, all the actors turn in wonderful performances, and the story will hold your interest. It's not as entirely violent as some here say."
    },
    {
      "rating": "1",
      "text": "This move was terrible and I can't agree more that the critics really got it wrong with this one. Cliché's, bad accents and no definitive ending. Definitely one of the worst movies I have seen in a while. I applaud the actors for their efforts, but the direction and storyline was just abysmal. Cliché, cliché, cliché."
    },
    {
      "rating": "1",
      "text": "Cliché upon cliché, bad script and accents galore..cringworthy to say the least. I left the theatre somewhere around half time..just couldn't stand the James Bond-like villains any longer."
    },
    {
      "rating": "2",
      "text": "The biggest disappointment of the year. This film hides its lack of a plot, character development, and a script behind several scenes of graphic violence. Not worth renting much less paying to see!"
    },
    {
      "rating": "4",
      "text": "Interesting but way too much graphic violence, sex, nudity, and language. Is this what passes as mainstream these days?"
    },
    {
      "rating": "2",
      "text": "Crap. What happened to you Cronenberg? That's two misses in a row for my standards. Stop doing crap and drop Aragorn, he's a horrible actor. It's a 4, but scoring a 2 to offset the retards who liked it."
    },
    {
      "rating": "1",
      "text": "This movie was the WORST thing I have seen in the cinema since Blair Witch 2. I couldn't believe that a movie about the Russian Mafia could be so dull and boring. The story crawls along at a snail's pace then abruptly ends. THIS MOVIE IS TERRIBLE. DON'T BELIEVE THE RAVE REVIEWS."
    },
    {
      "rating": "0",
      "text": "I walked out of History of Violence because it sucked so bad, so I'm glad I read some of these reviews. Sounds like more of the same. History of Violence, to me, had no character development. I didn't give a crap about any of the characters, and then having to watch a ridiculously timed, lame sex scene on the stairs was the icing on the cake. I looked around in the theater and was like, \"Am I the only one who sees how weak the script and acting are?\" I bailed, since you never get back that 2 hours, even if you can't get your money back!"
    },
    {
      "rating": "3",
      "text": "Dull, dull, and duller. Apart from a good performance by Mortensen, the film could be a standard sub-par Hollywood action flick. Black merc SLs, black suits, shirts, and overcoats, this is cliche at it fullest. Terrible accents and background score round it off. Expected much more considering the hype."
    },
    {
      "rating": "5",
      "text": "Again the critics are out to lunch. While the film was an interesting look at the Russian Mafia - it seems to wallow in it's own violence that at times seems pointless. Watchable, but not particularly well done."
    }
  ]
}