{
  "id": 3636,
  "title": "Echelon Conspiracy",
  "starring": [
    "Shane West",
    "Edward Burns"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "Mysterious cell phone messages promise a young American engineer untold wealth - then make him the target of a deadly international plot. Dangerous security operatives chase the engineer across the globe, while a powerful government official pursues a mysterious agenda that threatens the stability of the entire world.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eQgT8kdjWJots3dX5Xy11le2vHk.jpg",
  "categories": {
    "plot": 2.5,
    "acting": 1.2,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 6.4
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Incredibly far fetched but it does have it's suspenseful moments and a few good action scenes. The cast is mediocre, Ed Burns is the most convincing. Good location filming. Still, there are far too many coincidences."
    },
    {
      "rating": "9",
      "text": "This movie has topped all the critics reviews I have been reading so far. Its opening very suspenseful and keeps the action going throughout. I have seen Eagle Eye before and can surely say: This one is much better. The story might sound similar, but there is also a kind of dreaming note to it and I could identify with the main cast ( Max), who as a regular guy suddenly gets the pleasures of a high-roller life. Definitely makes you dream again..."
    },
    {
      "rating": "3",
      "text": "Full of stupidity and contradictions. great idea only if it had been executed differently."
    },
    {
      "rating": "0",
      "text": "This movie is abysmal. To say that the twists in the plot are unbelievable is a gross understatement. The whole story is absolutely ludicrous to begin with. The acting is terrible. How the hell did Martin Sheen get in there? Is he the token 'guy with a name' actor for this movie? The only thing I concede is that it seems well produced. But then why would anyone waste a budget on a story and actors like this is beyond me... Who the hell is the guy in the main role? He has about as many facial expressions in his repertoire as Steven Seagal. By far the worst movie I've seen in a while. Stay away."
    },
    {
      "rating": "7",
      "text": "Agree with previous commenters that it's similar (more than that probably) to Eagle Eye, but both smarter and tones down the absurdity of the premise far more, which makes it easier to suspend disbelief and enjoy the film. Great move? No, but entertaining. Enjoyed the cast, as well."
    },
    {
      "rating": "6",
      "text": "For the first 40 minutes, I was mesmerized by this film. The beginning was as thrilling and intriguing as any film I'd seen all year, but after that, the big secret is revealed and it became almost a shot for shot remake of Eagle Eye. It was seriously ridiculous how the two stories became almost exactly alike. Realizing this, the writers decided to throw in a big twist at the end, that might have saved the film had it made even a single bit of sense. Echelon Conspiracy begins with computer programer, Max Petersen (Shane West), anonymously receiving a brand new, state of the art, cell phone in the mail. The phone gives him instructions which lead to him winning a lot of money. Everything is going great for Max, until he disobeys the phones wishes and the FBI shows up. Shane West was fantastic in this film, it really makes me wonder why he doesn't do more stuff like this. West seems to prefer romantic dramas, but is clearly missing his true calling. After seeing a performance like this, I'd easily put him at the top of the list for any major action film. West was paired in this film with Edward Burns who was terrific and Ving Rhames who was Ving Rhames. I say that, because sometimes he's the perfect fit for a role and other times, he couldn't be more out of place, a perfect example of which is his role in this film. As I said, this movie starts out great, but becomes exactly like Eagle Eye, I would venture to say that the two films are so much a like that the producers of Eagle Eye have a case for copyright infringement, it really was that close. Besides that, the film was a decent action film, with some nice performances. Had I not seen Eagle Eye, I may have thought more of this film, but as it stands, Echelon Conspiracy is just another low budget rip off of a semi-decent major motion picture and not much else."
    },
    {
      "rating": "0",
      "text": "Possibly the worst movie I have ever have the displeasure to experience. It was almost frightening how bad the acting was, not to mention the stunts. This my grandmother can run with more athleticism than the \"CIA operative\" in the film. This certainly did not live up to my expectations, as it COULD have been an interesting story plot, but ended up a catastrophe, so much so that I had to stop watching it halfway in an attempt to salvage whatever I had left of my evening. To be honest, I researched this movie after I watched it to see how others felt, and several agree with me.\r Don't waste a minute on this movie, and I am sincerely impressed by those who survived the entire film."
    }
  ]
}