{
  "id": 47,
  "title": "Ed Ruscha - Motorized Photographs of Sunset Blvd. and Other L.A. Streets",
  "starring": [
    "Ed Ruscha"
  ],
  "runtime": 2,
  "genre": [
    "Documentary"
  ],
  "description": "Commissioned by The Getty Museum on the occasion of their 2019 Getty Medal to the painter, draftsman, photographer, and bookmaker, Ed Ruscha. Utilizing The Getty Research Institute's preservation and digitization of over a million images from Ed's Streets of Los Angeles photo series, and excerpts from Jack Kerouac's \"On The Road,\" this film puts together two of Ed's major inspirations: Kerouac's text and the city of Los Angeles.",
  "releaseYear": "2019",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/i355u6490I0vsNrvORwfp0qvoqw.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.0,
    "ending": 9.0,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 7.0,
    "funny": 4.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Billy Wilder’s paramount triumph of film-noir melodrama, piercing through the Hollywood industry’s utter callousness and an over-the-hill silent era actress’ poignant illusion of a comeback to garner the spotlight.\r The film begins like DOUBLE INDEMNITY (1944, 8/10), our ill-fated protagonist Joe Gills (Holden), a 30 something hack writer for the Hollywood studio, narrates beyond his grave to reveal the tragedy ending - as shown in a majestic shot from the angle of the bottom of a swimming pool (a trick done by putting a mirror in the bottom and shot from its reflection), a man’s body is floating on the water, facing down, and for sharp eyes, it is obviously Joe himself.\rcontinue reading my review on my blog: google cinema omnivore, thanks"
    },
    {
      "rating": "8",
      "text": "It is damn near impossible to say something bad about Sunset Boulevard. A classic in every sense of the word, this one shows why Billy Wilder's work is so critically acclaimed. Brilliant directed, paced, written, and some great acting from William Holden and Gloria Swanson, come together to form one of the most well-known and popular film noirs of all-time. Riveting throughout, this one tells the story of Hollywood gone wrong and really all comes together well. The narration and identity of the narrator were both great, great touches that really worked wonders for the film. The characters are all well-written and, oddly, sympathetic. Overall, Sunset Boulevard is a really cool film that I cannot recommend enough. Though it may not be my favorite film ever obviously, it is still really, really good and you can easily see why it has gotten the praise it has over the years."
    },
    {
      "rating": "9",
      "text": "This is a great movie in classic cinema. Nearly the last noir film to come out this features a brilliant performance by Gloria Swanson who feels at time like a Dracula-esque movie monster."
    },
    {
      "rating": "8",
      "text": "Sunset Boulevard is yet another amazing Billy Wilder movie that has its place in cinematic history. The performances are all great, and the story is moving and emotional without being cheesy. What a wonderful movie."
    },
    {
      "rating": "0",
      "text": "On a déjà vu des films de ce genre qui traitent de vieilles gloires surannées du cinéma muet et qui n'ont pas passé le cap du parlant... et là blablabla... c'est le drame (si j'ose dire).A l'époque en 1950, peut-être que ça interpellait un certain public nostalgique mais de là à en faire une patate chaude de presque deux plombes, faudrait pas pousser Mamie dans les orties. Donc c'est William Holden qui s'y colle et je n'ai a priori rien contre lui, car ce n'est certainement pas le pire bellâtre de ce temps-là. Loin de là, même.Et William donc, scénariste minable devient gigolo à son insu ou pas totalement de la... (j'allais écrire la vieille bique, n'exagérons rien) de la vieille dame encore chouette mais pas tout-à-fait qui n'a pas encore imprimé que \"le changement, c'est maintenant\". La voix off tente de mettre du liant à cette histoire qui endormirait une tortue mais sans succès, hélas.Parce que de toute façon, pour blablater ça blablate, ça déblatère et on pique du nez à vitesse grand V. La mise en scène de poisson crevé dans le coma n'aide pas non plus à tenir la rampe tandis que la \"star\" du muet est décidément très loquace et une caricature totale, sans nuance et sans talent, y compris jusqu'à la fin grotesque.Remarquez, j'ai presque eu un film muet la plupart du temps : pendant qu'on accélére avec la télécommande, on entend plus leurs conneries. Ouf."
    },
    {
      "rating": "10",
      "text": "This is seriously my favorite movie of all time. The writing is sooo good, it seems impossible that it came from just two people. Gloria Swanson is amazing in this and deserved the Oscar, as did William Holden. I loved every frame of it."
    },
    {
      "rating": "10",
      "text": "One of the most extraordinary filmed works ever made. The writing, acting, direction and photography are first class. The connection between the real Gloria Swanson and Max the butler is worth researching."
    },
    {
      "rating": "9",
      "text": "Not exactly a hot take here, but this is nothing short of one of Billy Wilder's best works and one of the greatest film noirs ever made. The narrative, the structure, the dialogue, the acting, the camerawork - this is one of those impeccably rare occasions where every aspect of a film is so unbelievably well-executed that it really doesn't age. An easy, easy classic and one that should be seen by many, if not all, at one point or another."
    },
    {
      "rating": "7",
      "text": "Billy Wilder's scathing noir comedy,  features a landmark performance by Gloria Swanson.  Who is almost matched by William Holden.   Wilder makes fun of alot of Hollywood crapola and hypocrisy,  but at the same time,  offers fond bittersweet nostalgia for Hollywood's past."
    },
    {
      "rating": "9",
      "text": "That ending is one of the best scenes I've ever seen. Acting and music are sensational, and its writing and storytelling simply ahead of its time."
    }
  ]
}