{
  "id": 4309,
  "title": "Eddie the Eagle",
  "starring": [
    "Taron Egerton",
    "Hugh Jackman"
  ],
  "runtime": 106,
  "genre": [
    "Comedy",
    "Drama",
    "History",
    "Adventure"
  ],
  "description": "The feel-good story of Michael 'Eddie' Edwards, an unlikely but courageous British ski-jumper who never stopped believing in himself—even as an entire nation was counting him out. With the help of a rebellious and charismatic coach, Eddie takes on the establishment and wins the hearts of sports fans around the world by making an improbable and historic showing at the 1988 Calgary Winter Olympics.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/80fwjYfHmeDXobIErpNvCFCOAYd.jpg",
  "categories": {
    "plot": 7.513513513513513,
    "acting": 7.0,
    "ending": 7.0,
    "soundtrack": 6.666666666666667,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 7.8,
    "action": 8.25
  },
  "reviews": [
    {
      "rating": "7",
      "text": "There's a lot of cliched moments here, but I still got hooked.  Eddie the Eagle at heart is a story about one man's desire to never take no as an answer and to accomplish ones goal no matter what.  Standard yes but still a good time.  B+"
    },
    {
      "rating": "8",
      "text": "-Passion, perseverance and determination.-\r -Eddie the Eagle is a 2016 British-American biographical sports dramedy film directed by Dexter Fletcher. The film stars Taron Egerton as Eddie \"The Eagle\" Edwards, a British skier who in 1988 became the first competitor to represent Great Britain in Olympic ski jumping. Hugh Jackman and Christopher Walken also star. The film had its world premiere at the 2016 Sundance Film Festival on January 26, 2016.\r-The film was released by 20th Century Fox in the United States on February 26, 2016, and will be released by Lionsgate in the United Kingdom on March 28, 2016.\r --Critical response:\r -Eddie the Eagle received generally positive reviews. On Rotten Tomatoes, the film scored positively with 77%, based on 109 reviews, with an average rating of 6.5/10. The site's consensus reads, \"Eddie the Eagle's amiable sweetness can't disguise its story's many inspirational clichés – but for many viewers, it will be more than enough to make up for them.\" On Metacritic the film has a score of 53 out of 100, based on 33 critics, indicating \"mixed or average reviews\". Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale.\r -Alonso Duralde of TheWrap wrote, \"Eddie the Eagle is designed for audiences who will throw their weight behind the film’s schmaltz and sentimentality. Anyone unwilling to commit to the movie’s shamelessness will feel like they’ve hit the ground headfirst.\"\r --Filming:\r -Principal photography took place in Oberstdorf and Garmisch-Partenkirchen in Bavaria, in Seefeld in Tirol, at the Pinewood Studios and in London from March 9 to May 3, 2015."
    },
    {
      "rating": "7",
      "text": "This is a sports related comedy drama film based on a true story (aka with a biopic element), covering themes of hope and perserverance while  featuring a loveable underdog in the main role. Eddie comes across as quite naive but in an endearing way - someone who wouldn't let those around him force him to give up his dream. Yes its relatively cheesy/corny and the ending is relatively obvious but I found it to be an enjoyable watch regardless.I thought the music used was judged well for the most part in not being especially distracting or overpowering (i.e. loud), certainly in the first half of the film. It was fairly understated, somewhat subtle towards the start, although there were some synth-y segments but then that makes it sound quite 80s-ish, which of course makes sense in as much as the film is set in the 1980s. The use of songs becomes a bit more overstated and less subtle towards the end of the film, for fairly obvious reasons. Some scenes feature chart pop songs from the 80s and examples of such tracks played include Two Tracks by Frankie Goes To Hollywood, The Sky's The Limit by Nik Kershaw and Real Gone Kid by Deacon Blue.The dialogue seemed reasonable. There were some quite amusing moments, mainly between Eddie and Bronson. Its safe to say that egos are at play at times, although Eddie doesn't necessarily realise this.  Cast wise, Eddie is played by Jack Costello. Eddie both looks and sounds like a bit of a dreamer, being relatively naive (as I say) while also clearly passionate and you could say quite courageous as well. As a character, he appears somewhat geeky and reserved (shy) and as such I felt he was a character that was easy to wish the best for. I found his optimism rather uplifting (I did say it was a cheesy film!). The other main character is Bronson, played by Hugh Jackman. He comes across as very cocky and very dismissive of Eddie at first but also a warm, caring companion in time. He tries his best to be realistic and helpful in his coaching Eddie, while shielding him from some aspects and I'd say he is the sort of character that we'd all like to know. Other characters include Warren Sharp, played by Christopher Walken (although his is a brief appearance), Richmond the BOA official, played by Mark Benton and Dustin Target, played by Tim McInnerny.The film features some nice landscape shots of Canada and other mountainous areas Eddie obviously 'cuts his teeth on'. There are some nice shots of sunrise and sunset as well and generally I felt the camerawork was handled quite well - there are also some good examples of jumps shown from particularly good angles to demonstrate the distance covered. Content wise, the film contains some mild profanities, a few sex references by the coach but I imagine these would go over the head of particularly young kids (at a guess) and a few scenes of skiiers who have crash landings when attempting to jump. Otherwise there's nothing really to note - the film carries a PG rating to reflect this.I found myself with my head between my hands, feeling almost at the edge of my seat during the most nerve wracking scenes. Of course its easy to find out what happens but that doesn't make it seem any less nervewracking to watch the key jumping attempts and other key scenes, or so I found. I found it overall a very enjoyable film to watch, as I felt quite emotionally attached to Eddie for the loveable, if but rather childish, person he's portrayed to be. I could really feel for the character when he was doubting his ability and feeling his passion, his strength to want to prove people wrong.I felt his story was ultimately quite inspirational and it was a fairly heartwarming watch in general, one that should be suitable for the majority of a family to watch, so if your looking for something to entertain a few generations of a family then this may well be worth considering.Yes I'd recommend this film as I found it an entertaining and enjoyable watch. I thought the cast were good, there was some decent camerawork and the soundtrack was fun. It certainly is sentimental and cheesy but thats pretty much what you should expect of such a film really, isn't it?. For what it is, its not bad and so I'd recommend it."
    },
    {
      "rating": "10",
      "text": "This is one of the best movies I have ever seen. It is heartwarming and a movie to love. I highly recommend it to watch on a family movie night!"
    },
    {
      "rating": "5",
      "text": "Eddie the Eagle is heartwarming at some moments... and then heartbreaking... and then completely turns out to be complete nonsense mix-match other than those heartwarming and heartbreaking moments."
    },
    {
      "rating": "5",
      "text": "While it would be unduly critical to call this film \"bad\", it is most certainly not great.  It is mostly what one would expect from the genre:  a feel good, triumph over adversity story with a good heart.   But it also suffers from some of the limitations of the genre:  corny, predictable and manipulative.  Still, it is unoffensive, sweet and mostly based on a true story.  You could take kids to it or your mother.  Just don't have expectations that are too high."
    },
    {
      "rating": "5",
      "text": "This  movie was ok to be honest it got better with time however it was a heart felt movie.  I could have waited for the movie to come out on Blu ray but I saw it in the theater.  It's a great movie over all but not the best movie that I've seen in a few months."
    },
    {
      "rating": "10",
      "text": "If you have ever heard the name \"Eddie the Eagle\" or don't, you have a mandatory appointment in April to see the dramatic feat of the year so far.\r Personally, I think that the experience is much more enjoyable without knowing the story of real life.\rEddie Edwards was the first representative of Britain to participate in the Winter Olympics in 1988. This honest man tried different Olympic sports until he found the fabulous and adventurous ski jump, the surprising thing is that the guy not highlighted by being the best the the matter. The film is responsible for narrating the whole growth of Eddie in terms of sport while providing a dramatic and comic experience from beginning to end. I can only mention, I cried like a small child.\r Our boy \"Kingsman: The Secret Service\", Taron Egerton comes back to seven art, he introduce himself to 100% in his role, this time not as a super agent, this time with large glasses, hair blond and even a strange blonde moustache. Egerton fills his role as nuanced perfectly balanced tones allowing to see the pure soul of his interpretation. Hugh Jackman plays coach Eddie - a successful athlete champion ski jump that is forced by his heart to help this young man to succeed- . True, the film by Dexter Fletcher is a feast of cliches, but well-structured cliches, with chemistry, support and strength to take forward a true dramatic inspirational artwork. The project is a faithful proof that with less materials, better results. It was a surprise in the Sundance Film Festival and won gold, now, it was a surprise in the rest of the world and the chances of winning a gold more large increase exponentially.\r Dexter Fletcher has created his own cover letter. However, he knew who was dealing with a persevering man (who was not going to win gold medals) managed to capture history with a conventional double-edged weapon. A bullet from his gun was the comedy. The director was prone to cross the thin border of the comedy to become a mockery or joke based on story. He reached the exact point in the soup to create a succulent dish, excellent aggregation of sugar. Aim, fire. The second bullet is shot, the drama. The main reason was to tell all the mishaps economic, mental, physical and psychological that possessed the guy, for obvious reasons,, the biopic would have to be oriented to the guy, good aggregation of salt. What remains after together salt and sugar in a precise point? A real treat for the palate, in this case the visual palate.\r The visual presentation of the work was very professional and aesthetic. The cinematography of George Richmond is beautiful and elegant, making feel vertigo on the track of 15m, 30m, or 90m in the same way by using the camera and perfectly positioned angles. And to continue to grow, as it is typical of Hollywood, introduce a few seconds the short but symbolic appearance of Christopher Walken - the trainer of Hugh Jackman - to make it look even more professional.\r Eddie does not want women, he just wants to his mother, Eddie doesn't want fame, just wants to participate, Eddie does not want alcohol, he only wants to milk, Eddie does not want sex, he just wants love. These characteristics are completely emotional and  with a finish that I didn't expect, my tears simply fell for my eyes, but a factor that helped my sadness and joy at the same time, it was the self-identification with the character of Taron (Eddie), I think I saw my future on him. So, well done Egerton! task was made very well.\r It isn't a story more of the bunch where anything is possible. Dexter's film is sentimental and more deep than it seems, a guy that don't mind the standards of money, education or culture, a guy who fixed a dream in his head and managed to leave a huge mark on world history. \"Eddie the Eagle\"  will triumph in most festivals, I promise you. Boldly funny, very well presented, with a 100 in all its aspects, the movie has affected me for rest of my life. Everyone to the cinema already!\r \"The most important thing in the Olympic Games is not winning but taking part; the essential thing in life is not conquering but fighting well\"   Pierre de Coubertin."
    },
    {
      "rating": "7",
      "text": "Starring Taron Egerton, better known as Eggsy from Kingsman and Hugh Jackman. Telling the inspirational story of the British ski jumper, Eddie Edwards. Now who better to be your coach than Wolverine? These two have some great on screen chemistry and really carry the whole movie. Overall a feel good biopic/comedy, recommended."
    },
    {
      "rating": "7",
      "text": "Formulaic but solid and worth a watch.  Everything about the movie hits its mark: the  David Foster-inspired Matthew Margeson soundtrack, the almost-perfect retro 80s styling, the performances and direction, and the choices of scenery and cinematography.  This is a quintessentially British take on “Cool Runnings” - sure it’s been done before: we’ve seen these shots a thousand times over the years; we know we’re in for a hail-mary moment somewhere toward the end of the third act (this is a heroic sports movie, after all) but Fletcher pulls it off smoothly and with aplomb.  There’s no innovation here but the execution is perfect.  This is a sweet movie about British eccentricity that’s well worth its runtime."
    },
    {
      "rating": "7",
      "text": "Starting off with Eddie's childhood, Dexter Fletcher's directorial follow-up to Sunshine on Leith quickly establishes itself as a similarly optimistic, genuinely endearing, feelgood film. It doesn't push the pathos or heroics too far, with both Fletcher and lead actors Taron Egerton and Hugh Jackman keeping the film grounded as a peculiarly British homespun hero story. It felt like there was some sort of osmosis between this film and the likes of Local Hero or Gregory's Girl. The humour is subtle, but punchy enough to keep us interested. And props to the cast and crew for keeping things in PG terroritory!\r A beautifully presented, heartwarming tale of triumph (sort of) against the odds."
    },
    {
      "rating": "8",
      "text": "Keep dreaming brings nothing, need to go out and try to make it happen!\r The posters, teasers did not impress me at all. The thought the film going to be a flop. Surprisingly the film was much better than I anticipation. This is a biographical-sport film and very inspiring. The story of a British boy in the early 70s who dreamt to be an Olympian, but the problem is he has not found his sports. By the time in his 20s, he finally finds his interest and gives his best to make his long pending wish to come true. The remaining narration reveals his journey to the world's one of the big events where he aims to soar like an eagle.\r Hugh Jackman was not any terrific, he was awesome like usual, but in a supporting role. I think Taron Egerton will be the next British sensation. This film worth seeing for his phenomenal act. The real Eddie too appreciated that. The whole film revolved around these two characters and I think making it a comedy worked out so well. Nicely shot film in the beautiful places, especially those risky ski jump stunts were excellent and the direction was undoubtedly the best.\r This film is not particularly about the sport, it is about one showing his passion towards his undertaking. Eddie can be seen as a role model, no matter what he achieved, his fighting spirit is motivating. I think the youngsters should watch it, especially those who are after their dreams. Not just sport persons, but any field persons. I don't know about the repeat viewing, but watching once is enough for the confidence uplift. One of the must see film of the 2016.\r 8/10"
    },
    {
      "rating": "7",
      "text": "To conclude, I reckon you can go see Eddie the Eagle and have a good time. Taron Egertons performance will charm and drown out it's flawed core. As well as an epic, awe-inspiring conclusion, this film makes out for a grin-worthy time. My inner monologue was just a cycle of \"Bless his little heart!\""
    },
    {
      "rating": "9",
      "text": "This film is the perfect in what it tries to be; an 80s inspired, sports film that is fun for the whole family. Taron Egerton proves why he is one of the years brightest film stars as he truly captures the magic of Eddie Edwards in this beautifully directed biopic by Matthew Vaughn."
    },
    {
      "rating": "7",
      "text": "It's formula feel-good movie material, but extremely well-executed formula feel-good movie material. Taron Egerton delivers a terrific, faithful performance as the unlikely hero of the Calgary Winter Olympics, effectively portraying the infectious enthusiasm of someone whose desire to succeed against the odds outstrips any roadblocks that stand in his way. The film provides big fun, great cinematography and a wonderfully nostalgic look at the 80s. This one is definitely worth a view for those in need of a potent shot of adrenaline and encouragement."
    },
    {
      "rating": "6",
      "text": "I really want to love Eddie The Eagle, I really do, but at this point I can just say it’s an OK movie.  It’s biggest strength is the central performance from Taron Egerton which excels the film,I just don’t think this is the film for me.  I’m getting a bit bored of sports film cliches and I think this  film has cemented that for me.  It had some good humour in it, there is some decent acting and the period accuracy is pretty well done, but I know this film could have been so much better.  This film could have been the ‘feel good british comedy of the year’, but as it stands, it’s just one to play at Christmas when there is not much else on.  I think this film will appeal much more to people that experienced this event in the 80’s and want a bit more of an in depth analysis of what actually happened.  I can only really recommend this film to those people, anyone born from 1990 onwards, probably should skip it.  Don’t get me wrong, I don’t hate this movie, it’s just OK and I was highly entertained watching it, just not as much as I would have liked to have been."
    },
    {
      "rating": "7",
      "text": "Eddie the Eagle is the true definition of a feel-good movie and I honestly didn't expect that while going in (The movie had mixed reactions). This may be another one of those inspirational underdog stories that we usual get, but I'll give this one a pass, since this movie did leave a smile on my face and I can't recall being bored while watching it.\r Taron Egerton plays Eddie Edwards who's flawed, an outsider and always overlooked, and you can't help but like him. Taron Egerton did an excellent performance, as he was charming and very likable. Hugh Jackman was also great, as the best parts of this movie is with him and Taron. The movie is inspirational, delightful and the cinematography in this is just crazy good, I mean just wow.\r The problems I have for this movie has to be with some of the writing, as it felt kind of sloppy at times, but that's really it.\r Overall Eddie the Eagle isn't perfect, but I already know this movie has uplifted many moviegoers out there....even me."
    },
    {
      "rating": "7",
      "text": "To put it short; 'Eddie the Eagle' is a cliched underdog story, but that isn't enough to say that this movie isn't worth seeing. It has inspiration, it has heart, and, like its lead characters, is warm, fuzzy and aggressively likeable.\r The movie stars Taron Egerton ('Kingsman: The Secret Service') as Michael Eddie Edwards, who, since he was a young boy, wants to compete in the Olympics. As a child, he has had to have a brace attached to his left leg, which is very similar to the story of 'Forrest Gump' (1994), and as he gets older, he no longer needs them as his legs have fully formed and is able to walk without any support.\r He decides that he still wants to ski in the Winter Olympics, his loving mother always tries her best to support him and give him some confidence. However, his father is very discouraging and cynical, I couldn't help but feel that the movie was trying its hardest to make him an unlikeable character, but it didn't really work. He seemed like the typical parent that has no faith in any other movie protagonist.\r On the way, Eddie meets a man named Bronson Peary (Hugh Jackman), who he learns also did what he wanted to do, and they agree to help Eddie get to the best and compete in the Winter Olympics.\r The movie, directed by Dexter Fletcher is absolutely a fine piece of work, the acting is well committed and the story is a good story to tell. It is, like I said above, very cliched and pretty much like any other movie out there. It plays like 'Forrest Gump' (1994), the very idea of a nobody who quickly becomes a somebody despite the fact that many may have ridiculed this character from achieving their goals.\r Overall, this is a movie to watch if you like inspirational and underdog films, it's well worth your time to know who this \"Eddie the Eagle\" really is..."
    },
    {
      "rating": "10",
      "text": "Amazing movie - didn't know the story about the real Eddie The Eagle and still it was really amazing movie, well filmed, good actors, fun comedy parts and yet really inspiring and based on true events. One of the best movies I have watched in a long time. (Even though it has similarities to other similar type movies, I still think this one has to be one of the most inspiring ones)"
    },
    {
      "rating": "6",
      "text": "Good movie. Taron Egerton really brings \"Eddie the Eagle\" to life with another great performance. He has proven he is a up-incoming superstar in acting. And of course Hugh Jackman charming as ever. Really emotional some times and a great character you can really get behind. Great feel good movie to watch."
    },
    {
      "rating": "7",
      "text": "This film does what it says in the tin, and delivers it in spades. The heart-warming and occasionally cringeworthy spectacle of seeing Eddie, our hero, struggle his way to the Olympics is nicely paced and achieves the one thing all sport movies must; I cared about t the outcome. The performances are excellent, but there aren't any surprises here, though the affectionate tone and the earnestness of the portrayal is worth your time if you're after an uplifting experience. 7.87/10"
    },
    {
      "rating": "9",
      "text": "It is a sweet and funny story of an underdog's journey to the olympics, despite all the odds.  Eddie was very likable, and it was easy to want him to succeed. Also, I loved his mother's personality! It's pretty much what you would expect from the genre (no real surprises), but leaves you feeling happy."
    },
    {
      "rating": "6",
      "text": "I remember watching the Winter Olympics with Eddie the Eagle.  I also remember the Jamaican bobsled team.  While the story is interesting, the back story makes for a boring movie.  Does everyone in England have the same facial mannerisms or did this actor copy Sherlock from \"Elementary\"?"
    },
    {
      "rating": "7",
      "text": "Is it formulaic? Yes. Does it offer anything new? Not really. But Eddie the Eagle nonetheless is a heartwarming, funny and well made film anchored by great performances from Taron Egerton and Hugh Jackman. While it does follow the normal cliches you'd see in this type of film, by the time the credits were rolling, I had a big fat smile on my face."
    },
    {
      "rating": "7",
      "text": "This is a movie about fighting and overcoming... it's about believing in yourself when the rest of the world doesn't. It's not \"Chariot's of Fire\" ...but it's not supposed to be. It's fun, simple-stupid, comical and heartbreaking, it's losing and getting back up ...it's achievement and victory.  It also very clearly shows the jealousies and envy's that exist in peoples hearts... it also speaks of bravery, courage and of the power of loyalty and support. Not an oscar winner ...but a very uplifting, refreshing and challenging story."
    },
    {
      "rating": "7",
      "text": "If your feeling down an a cold windy day pop along and see this film.  The story line is formulaic but the lead actor plays the part very well, and because of history you know what happens.  The film reminds me of a 1980's feel good Disney movie but with a strong British angle.  The film has a good balance of emotional torment and leaves you with a positive mood on leaving the cinema.\r My respect for Eddie goes up a notch as any one brave enough to spend 300 ft in the air at 70mph deserves a film made after him."
    },
    {
      "rating": "7",
      "text": "I love freeze-frame endings with all my heart, so \"Eddie the Eagle\" was incredibly pleasing. This movie nails the 80s vibe and the actors knock it out of the park. Beautifully retro."
    },
    {
      "rating": "6",
      "text": "There isn't much to say about Eddie The Eagle; as it is exactly what you would expect from an underdog sports movie. It has lovable characters who do the impossible, cheesy music to get the feel of the era, and provides a warm- hearted feel to the audience. While Eddie attempts to go deeper into his interesting life, it mainly stays to the very predictable sports formula. The acting is fine and a few scenes are quite suspenseful. In addition, I liked how the tone was lighter and more playful over other films of the same type. Overall, while Eddie is charming and full of heart; it does have a very predictable and cliched sports plot. Unless you're a sucker for these type of feel- good sports movies, it's not really worth watching."
    },
    {
      "rating": "7",
      "text": "Eddie the Eagle is the inspirational story of Eddie Edwards played by Taron Egerton and is a movie about hopes and never giving up on it. As a kid, he always dreams of being an Olympic athlete and against the odds, it's up to him and Peary (Jackman) to make it a reality.Eddie as a character is compelling and over the top all by himself, and Egerton's performance as this weird and quirky athlete is far from everyone’s favorite Kingsman, which is something to look out for. Also, Jackman's role adds a huge impact on the lead character's development. But when the film tries to do humor, it deflates and creates an unfunny tone. The villain is also forced despite of the fact that it is based from real life.VERDICT: Although it did not ascend above the satisfactory of everyone, this film is still an entertaining biopic which gives tribute and respect to its source material."
    },
    {
      "rating": "8",
      "text": "One of the most underrated movies of 2016, the best feel-good and a great performance by the lead, one of my 5 favorite movies of the year along with Hell or High Water, Manchester, Sing Street and Rouge One"
    },
    {
      "rating": "6",
      "text": "I didn't like it as much, but it had some great moments. The acting was the strongest thing in this movie, everyone did a good job. The story started good, but went on for way to long, and that bored me. It is worth a watch anyway."
    },
    {
      "rating": "8",
      "text": "Eddie the Eagle. The story of a real athlete. Unfortunately, I am not familiar with the biography of Olympic athlete Michael David Edwards, but the way Taron Egerton showed him makes it clear that he was a real psycho of the sport (in the good sense of the word), who was ready to give his life to everything he believed in. The film itself is excellent. Beautiful views of snowy mountains and skiers who \"fly\" over them. The duet of Taron Egerton and Hugh Jackman perfectly showed all the chemistry between the characters. All the funny moments were in the theme, and these long jumps were breathtaking every time. I hope for many who are just starting their sports steps, this film will be instructive in some sense."
    },
    {
      "rating": "7",
      "text": "Honestly before seeing this film I had no idea who Michael \"Eddie\" Edwards was, even considering the approach of what I saw about the film I thought he was a famous sportsman and winner, which was my surprise when I realized that he was just an amateur athlete who on his own merits, managed to enter the Olympic Winter Games, he lost dramatically but it was an incredible case of self-love and the desire to fulfill his dream.The film is very simple but the good and animated performance of Taron Egerton as Edwards and the presence of the famous Hugh Jackman as his coach will undoubtedly put it on a different level.Eddie The Eagle is a feel good movie, a film about overcoming and all its elements lend themselves to it, from the design of the story, its narrative, its production and its music, although the visual effects at the time of the jumps it is too noticeable, the director achieved an interesting effect when they were going to fall to emphasize the danger of the jumps and what could mean falling badly. I recommend it because I liked it, its story is very simple and the film is simple, however its history and its protagonists do a very good job and are the elements that make it stand out."
    },
    {
      "rating": "7",
      "text": "It’s very hard not to enjoy Eddie The Eagle, as it is probably one of the most fun and entertaining films i know, however   despite it being a very enjoyable movie, it hasn't got much depth to it."
    },
    {
      "rating": "7",
      "text": "Taron Egerton is wonderfully awkward in this crowd-pleaser the likes of which don't seem to get made very often nowadays, at least not this succesfully.It's a nice little throwback to feel-good sport dramas like Rudy and especially Cool Runnings. Devoid of any cynisism and concerned only with leaving the audience cheering for the underdog.It's full of clichés, but also full of heart and positivity.A feel-good movie in the best sense."
    },
    {
      "rating": "7",
      "text": "Veľmi príjemný film, ale prirovnal by som ho k rodinnému filmu, ktorý by som pustil popri tom ako by som sa zhováral s návštevou. Kto vie ako by film pôsobil v podaní známejších hercov. Pre zistenie, či film v najbližšej dobe beží v TV slovenských alebo českých staníc, môžete pozrieť na https://program-tv.sk/film/orol-eddie/"
    }
  ],
  "recommendations": [
    "the_upside",
    "paddington_2",
    "me_and_earl_and_the_dying_girl",
    "rush",
    "the_secret_life_of_walter_mitty",
    "the_royal_tenenbaums",
    "yesterday",
    "the_edge_of_seventeen",
    "the_king_of_staten_island",
    "fighting_with_my_family",
    "eternal_sunshine_of_the_spotless_mind",
    "morning_glory",
    "chef",
    "groundhog_day",
    "the_terminal",
    "joy",
    "cinderella_man",
    "catch_me_if_you_can",
    "scent_of_a_woman",
    "the_disaster_artist",
    "the_intern",
    "a_beautiful_day_in_the_neighborhood",
    "the_blind_side",
    "the_second_best_exotic_marigold_hotel",
    "true_grit"
  ]
}