{
  "id": 2549,
  "title": "Eden Lake",
  "starring": [
    "Kelly Reilly",
    "Michael Fassbender"
  ],
  "runtime": 91,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Eden Lake is a relentlessly tense and immaculately paced horror-thriller about modern youth gone wild. When a young couple goes to a remote wooded lake for a romantic getaway, their quiet weekend is shattered by an aggressive group of local kids. Rowdiness quickly turns to rage as the teens terrorize the couple in unimaginable ways, and a weekend outing becomes a bloody battle for survival.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lotoZbXMJxyoxx4AS48bNMp5BjS.jpg",
  "categories": {
    "plot": 6.666666666666667,
    "acting": 7.071428571428571,
    "ending": 6.857142857142857,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 0.0,
    "action": 7.333333333333333
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Daft. If theres every a film which had me, and my friends screaming at the screen 'why' and 'as if you would do that' its this. From the very first moment where its anti northern slant kicked in , part of me died.Yes it did get tense later on but only because the set up so unprobable. Avoid."
    },
    {
      "rating": "2",
      "text": "This movie is completely unrealistic and poorly written.  The behavior of the kids is believable till the end of the first act where it just escalates to complete ridiculousness.  I was glad when it was over cause that's 90 minutes of my life I'll never get back."
    },
    {
      "rating": "0",
      "text": "Eden Lake try to mimic #TheDescent (same music, similar structure) but\rfailed to makes us caring about characters. We just want to kill them\rall. It's a sick cruel upsetting bad joke about stupids kids torturing\rpeople who dies at the end. Some maybe think that's \"a way to do\"\rcinema. Yes, I can cut the head of your mom and slap you with it and I\rsay: \"Hey did you like it?\" It's not cinema, it's an adolescent ego\rscreaming at our face and feeling happy that he initiate strong\rreaction by the audience. I think Watkins need more slaps to learn that\rthrowing horrors at our face is not that hard, any moron can do that.\r- Take some victims that we can rely a little, make them suffer from stupids young kids, defend themselves, then be tortured like if nothing never gonna hurt them, no police, just make bleed the tourists.\rIt's voyeurism, it's porn blood, it's inhumanity for the sake of entertainment. No message behind, except maybe that young male kids are brutal and deserve to be killed. Thank you for this nice lesson of life."
    },
    {
      "rating": "1",
      "text": "Awful. Things like this do happen in real life, and films like this may just add fuel to the fire (no pun intended). A useless film."
    },
    {
      "rating": "7",
      "text": "Eden Lake's underlying message may be a bit Daily Mail, but it remains an extremely effective British horror film. It's tense, scary, and well-performed (particularly by Kelly Reilly and the terrifying Jack O'Connell). Writer/director James Watkins skillfully contrasts the idyllic middle-class lifestyles of Jenny (Reilly) and Steve (Michael Fassbender) with the nightmarish wilderness in which they find themselves stranded and hunted by a gang of truly monstrous teenagers. The whole film has a feeling of steadily building dread, which doesn't abate even when we reach the film's excellently terrifying finale. Even the idea of demonic teenagers as a credible threat in a horror film works, and all the better since unrest we witnessed in the UK last year. Perhaps the film's beginning is a little too twee and drawn out, and you do find yourself feeling as though you're living inside a right-wing tabloid once the film really gets going. However, Eden Lake is just a horror film using British paranoia about unruly teeenagers to create something scary - it's not really endorsing the ridiculous sweeping statements about society that tabloids are often guilty of making. As a horror film, it succeeds - it's scary, it's tense, it's gruesome, and it's got a classic horror movie structure - city dwellers go to the country and have to fight for survival when they encounter some nasty locals - it's pure Texas Chainsaw Massacre! As a social commentary, you can't take it too seriously, but then again, I doubt that's what James Watkins ever intended his film to be. You'll certainly think twice before leaving the safety of your house and going camping in the wilderness again!"
    },
    {
      "rating": "7",
      "text": "Ooouch this hurts while watching!\rA helpless atmosphere and a exciting and nervous breakdown will haunt you after watching.\rDefinitely not fot the faint of heart!"
    },
    {
      "rating": "8",
      "text": "A truly hard-hitting piece of filming. When watching this my stomach was in knots, I couldn't believe just how it turned into such drastic consequences however after the film it was an unfortunate truth that events like this could actually happen. No matter who's characters shoes you put yourself in you can actually see how the chain of events led to the disastrous outcome. An amazing film and although it hurts to admit...realistic"
    },
    {
      "rating": "5",
      "text": "The angle with the kids is interesting, as they have great capacity for evil, especially in groups, under the wrong influences. The female lead is a teacher, and should know how to handle kids. This is a good angle that could have rendered an original horror-flick. Unfortunately, it gets cluttered with the typical mix found in too many horror-movies: The victims' irrational, illogical behavior, and utter lack of self-preservation instincts, as they keep messing up, doing the wrong things... and have some bad luck on top of that. This almost fully drows the message in this movie: How the last girl standing should have made different choices. This film is no more than mediocre. A good horror movie should have more going for it than just being painful to watch (which it was, and which may explain its high rating)."
    },
    {
      "rating": "9",
      "text": "characterization in the movie is done through keen observation.that's why its believable.I have seen the parents torturing psychology, their children to insanity and seen the kids slapping their parents on face.Its truly brilliant how the director caught the \"real\" culprit.kids are not born bad but the conditions and influences make them that way.behavior of parents is greatly affecting their mind and thinking.the result is what happened in this movie.they are terrorizing other for their happiness and might be beating their own parents when they cough loudly at the age of 90.one of the biggest responsibilities is to bring up the kids in right way.and this is where people fail.robbers and murderers would not have been fooling around if they would been caught up right in their youth by parents.this is the most shining aspect of the movie.to deliver a message is not an effort but to deliver it so believably so people can relate to it , is the remarkable job.which is done by this director."
    },
    {
      "rating": "8",
      "text": "Some plot inconsistencies aside a really believable film. She is just gorgeous and the ending, oh the ending.... Can't say anything about it as it will spoil. It's a bit like the youngsters losing their way and ending up arizona desert with some pyhico red-necks - British style. But unlike the American version this one is believable."
    },
    {
      "rating": "10",
      "text": "I completely disagree with the writer of this review that this kind of thing doesn't happen. Whilst this film might be extreme reality the fact is that anyone living in Britain would not be surprised if they read about this in the paper. Yes not all teenagers are knife wielding idiots but a lot of them are. I'm not an old fogey looking down on kids as I am one myself so I'm saying this with knowledge of the subject. Does this reviewer live in Britain full time because if they did they would know this isn't far from the truth."
    },
    {
      "rating": "10",
      "text": "Brilliant film... Up there with Martyrs and Let the Right One in for best horror films of the year. Reminded me of the Descent in many ways(David Julyan also did the score The Descent)."
    },
    {
      "rating": "6",
      "text": "Very gruesome, but also very compelling. Tense British horror film, good acting, great pace. Very good score and cinematography. The brutality of the film gets to you after awhile."
    },
    {
      "rating": "9",
      "text": "I was on the edge of my seat for the entire film. Don't read about it first, just go in blank. The surprises are what gives this film it's greatest suspense."
    },
    {
      "rating": "8",
      "text": "The film doesn't feed the tabloid 'feeding frenzy' on chavs, it feeds OFF it. And fair play, because that is valid horror subject matter. I would ask Mr Bennett of 'The Hollywood Reporter' whether he's actually been to Britain? You see we do have a bit of a problem. I'm afraid if you're labouring under the delusion that kids don't do stuff like this, you're sorely mistaken. I understand this doesn't go down well with bubble-wrapped ultra liberals, but that doesn't stop it from being the truth."
    },
    {
      "rating": "8",
      "text": "Good horror movie. Best British horror since The Descent (the director is going on to write The Descent 2). A really tough and brutal watch but if you can stomach it you will be rewarded with a tense and compelling film. I really liked the fact that there was no creepy monsters but that the couple are running from a bunch of kids. I think the reflection on society is quite valid, while it may pander to media scare mongering that doesn't stop it from being any more relevant."
    },
    {
      "rating": "10",
      "text": "Brutal, well-acted and terrifying at times. This film makes you think twice before going camping in the middle of nowhere. The killers are kids for gods sake. They're horrible, if i was stuck in sometihng like that, i'd run them over. Some parts make you cringe, and some cry, the ending will definitely affect you. IT'S EVIL!!!!"
    },
    {
      "rating": "5",
      "text": "I gace this film a 5 and not a zero because of the fine work of the actors, editors, cameramen and other technicians.In fact, even the directing is good for its purpose.  This kind of film puts me on the fence because the acting, directing, and editing are all very good in a lot of these kinds of films.  You believe its happening while you watch and you suspect this kind of thing could possibly happen... at least while the film's tension is making you grit your teeth.  On the other hand, the whole point of the film and what it suggests is what ruins it. This is torture porn or what I call \"The cruelty genre\" where humans have absolutely no regard for another human and behave in ways that are very unrealistic in the scope of real life situations.  The films character's become so focused on their cruel needs that nothing in the real world intercedes like hunger, boredom, fatigue, distractions, changes in loyalty the fact that someone might sneeze.  once the cruel characters start their mission they become demons that never faulter in their quest to inflict harm on the protagonists and this is just stupid.  We have seen films make a fine point with extreme violence and the social monsters we create in neglected environments (clockwork orange).  How many more of these films do we need to see where the only point is pure manipulation of the audience.  The only point is tension itself.  There is an old commercial made in the states for Dupont by the agency Young & Rubicam  where a voice over tells you how a material made by Dupont is incredibly temperature neutral.  They show a metal box made of this material.  they show a bunson burner boiling water.  they put a baby chick in the box and place the box holding the live chick in the boiling water and the voice over speaks very languidly about the product.  the tension is enormous as you feel you are watching this poor little chick die.  then they take the box out and the chick is perfectly fine.  They sold me. amazing.  what is this film selling me? fear and hatred toward the neglected class?  please.  How many more filmmakers are going to try and say the same thing using human cruelty as their medium.  if you need to see this message expressed watch \"Funny Games\"  it has a point and it makes you squirm. IT is probably the last film that should ever be made about callous and mindless cruelty."
    },
    {
      "rating": "8",
      "text": "Solid horror movie with an interesting angle - the antagonists are just typical unruly kids, rather than the typical cheesy supernatural horror villain.  Executes the premise pretty believably."
    },
    {
      "rating": "6",
      "text": "This is of a theme with the 00's European horror films. A fear of youths. Hoodie horror I've heard it called. Its roots are steeped in \"The Last House on the Left\" and \"I Spit on Your Grave\". Men get it here too. Growing up and becoming square is the ultimate evil.This movie and its ilk are clearly made by men who have grown up and haven't quite come to grips with how old they are yet. They feel young inside but are afraid of the actual young because they don't recognize them or their interests - they have nothing in common anymore. It's all the same from generation to generation but this generation just so happens to be the first truly weened on pop culture - specifically movies and TV telling them how important and special their childhoods were (see the 80's nostalgia parade that just won't end).There's a lot of good tension here but it's all in service of pure torture (also an 00's theme). Eden Lake is hurtful and mean and unrelenting in its nihilism. This is both good and bad. If it had more to say it might be good, but it's really a genre exercise about a final woman outsmarting these terrible kids (their inexplicable brutality just suddenly happens with little build-up or explanation - it lacks the surreal unknown of \"Them (Ils)\"). It all works but to what end? At a certain point you just start rolling your eyes when the main character does something like bury herself in a pile of poopy sludge."
    },
    {
      "rating": "3",
      "text": "Couple decide to have a romantic weekend in an old quarry (Eden Lake) before it gets turned into a modern housing estate.The usual ridiculous stupidity that leads to mayhem & grisly demise.Highly unoriginal although Jack O'Connell is very good as the leader of the scallywags. However, the very talented Thomas Turgoose is underused.In summary, it's sort of a Daily Mail \"What kids are like today\" film."
    },
    {
      "rating": "7",
      "text": "Stylish thriller/horror which starts slowly but builds into a mix between Straw Dogs and Hostel. Some moments of human stupidity under stress do detract from the fluidity at times. It is however graphic and entertaining."
    },
    {
      "rating": "2",
      "text": "The parents are to blame! That is the message of Eden Lake which tells the story of a London couple who are chased and hunted by a group of teenagers through the woods. Itâ"
    },
    {
      "rating": "0",
      "text": "God awful, depressing movie where good people die and the psycho gets away with it.  Maybe this is a more accurate portrayal of the reality of life but I for one hate this kind of movie.  I want to be entertained.  I want the good guys to come out on top and I really want the a#@ holes to really pay for their actions.  If you want that as well then stay the hell away from this flick."
    },
    {
      "rating": "9",
      "text": "Eden Lake, watched for the second time and still looks great.\rMost men and I suspect a lot of women will find the actions of the main characters frustrating.\rWhy go into a restricted area in the first place, why park your car a long way from where you want to be and why stick around unless you intend to really make a stand for yourself.\rLater in the film both main characters again seem to lose useful weapons such as a heavy stick and a large spanner, plus why go to such a remote area and put yourself and your best girl in a possible compromising situation?\rGreat film, very violent, excellently played by all the cast and I am sure a lot of peoples worst nightmare."
    },
    {
      "rating": "4",
      "text": "Absolutely gruesome, devastating and depressing picture. While it is very competently made and great acted (especially by Kelly Reilly) there is no beam of light or hope in it. It will left the viewer absolutely gutted. But what for? The movie would still hold its commentary without devastating ending."
    },
    {
      "rating": "7",
      "text": "This film is another one of those films where an unsuspecting couple, due to a trivial situation, becomes a victim of a mortal, scary and dangerous situation. We have already seen a lot of these, like the films \"You're Next\" or \"The Last House on the Left\", also based on the same premises, but that does not takes away, I think, the merit due to this film that, despite from failures, it manages to give us what it promises: entertainment under tension.The script shows how a couple sees their plans for a romantic weekend, on the shores of a beautiful secluded lake, spoiled by a group of threatening and dangerous teenagers led by a \"wannabe\" psychopath. The story starts well and develops in a crescendo of violence and brutality, and the way the characters present themselves allows us to establish a good empathy with the couple and want to see the punishment of that devilish brats. James Watkins, who signs the direction and the script, was able to do an excellent job and knew how to guide and develop his film in the best way. Its explicitly violent so its inadvisable for children, and even teenagers and young adults should view it with the some precautions. But that does not mean that it is not a good film... in fact, its one of the best films of its kind that I have seen.The excellent performance of the cast was decisive for the quality of the final product. On the one hand we have Kelly Reilly, absolutely convincing in her role and managing not to be histrionic and appear genuine. On the other hand, a huge Michael Fassbender, in one of the first cinema works of his career, opening the doors to higher flights. He was truly authentic and genuine. But the villains were not far behind! Jack O'Connell was scary in the role of leader Brett and Finn Atkins was also excellent and hateful. Unfortunately, the ending manages to disappoint us for not giving us what we want.Technically, it seemed like a regular film, we can even say that it was well done if we take into account the limited budget and the fact that it is an independent film. Cinematography offers us good scenery and an excellent choice of landscapes, in addition to the intelligent use of film drones for aerial view scenes. The costumes and effects also seemed convincing to me, especially that filthy trash can where that character has to hide, which even made me vomit."
    },
    {
      "rating": "2",
      "text": "Couple are harassed during a trip by an unbelievable group of kids who simply wouldn't exist in England."
    },
    {
      "rating": "8",
      "text": "If you can suspend your disbelief - that this film's cast of villains is exaggerated and borderline comical - then this film will leave you shaken to the core with its succulent doses of tensity.The film follows Michael Fassbender and Kelly Reilly acting it out as a couple looking to spend time together in a secluded lake. They arrive there, seeking to relax, and for Fassbender's character, it is the perfect time for him to push their relationship further with a special plan. As with other horror films of this nature, the couple's romantic trip derails quickly into violence as their collision with a group of teenagers (led by Brett, played by Jack O'Connell) fuels a fight for survival.Eden Lake operates on the same fundamental level as its contemporaries, fulfilling its role as dirty violence. The film is tense, gory, and conclusively upsetting, but that's what makes it work so well. Forget about moral complications and deeper thematic constructs. Maybe there's something interesting here with the way it tackles the moral decay of the working class and its unchecked youth. It's clear, however, that the film is less concerned with its ideas and is more geared towards serving a fine slasher horror. And that's where its strength lies.It's fun to have a film that can be both delicious in its bloody imagery and utterly dreadful in its bleak story. Kelly Reilly gives out a performance that allows much of the film's straightforward plot to remain engaging, as her role as the girlfriend leaves a memorable portrayal of one's thirst for survival. It's Reilly's performance that evokes an appeal that compliments O'Connell's unrelenting brutality. At the end of the day, the film is strictly linear in regards to following a conventional formula. But sometimes, it's all you need for this type of work. Besides, it is tightly executed and provides an explosive ending.If anything, Eden Lake packs a delicious sucker punch to the stomachs of its audience. And that - is good enough."
    }
  ]
}