{
  "id": 2868,
  "title": "Edge of the World",
  "starring": [
    "Jonathan Rhys Meyers",
    "Josie Ho"
  ],
  "runtime": 101,
  "genre": [
    "Drama",
    "Adventure",
    "History"
  ],
  "description": "Sarawak, in the northeast of the island of Borneo, 1839. Almost by chance, the British adventurer James Brooke is appointed rajah by the Sultan of Brunei, and as an independent ruler he embarks on a personal crusade to eradicate piracy, slavery and headhunting, while trying to curb the malevolent expansionist ambitions of the British Empire.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ySgG2FILLUnsYvbG07jgnEvqPNv.jpg",
  "categories": {
    "plot": 4.666666666666667,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "(Mauro Lanari)True story that tells the alleged idyllic, irenic, paradisiacal relationship of a man, Brooke, with the nature of Borneo and, in general, of humanity with Nature, finally freed from exploitation, parasitism, colonialism: addressed to fans of deep ecology, I wonder if the director Haussman knows the existence of a colonialism also authorial: was there a need to fill the movie with allusions to Willard and Kurtz?"
    },
    {
      "rating": "5",
      "text": "'Edge of the World' benefits from a entertaining formula. Some shots, especially some at the very beginning of the movie, are marvelous as they show the poetic beauty of a luxuriant nature. The end also sees visually great scenes. Lighting is terrific.But in between there is not much to be remembered. The cast is minimal, with less than three meaningful main characters. Some of them aren't even introduced, as Madame Lin. The plot is set really quickly with very few informative or contextual content, leaving me the impression of a movie full of lore and details. But in the end I can summarize that plot in one word : vengeance. However the danger and the issues are never explained nor showed until the last quarter of the feature where the events are accelerating.The overall artistic direction of the movie tried something that leaves a taste of unstructered efforts. It goes the same for the staging and the scenaristic choices. The narration from the first-person is questionnable and to me brought more questions than answers. Many sub-plots are useless and gives this movie nothing more than a messy feeling.I can't deny the notable yet inconsistent acting skills from Jonathan Rhys-Meyers as Sir James Brooke."
    }
  ],
  "recommendations": [
    "ex_machina",
    "the_dig",
    "the_guilty",
    "the_card_counter",
    "nocturnal_animals",
    "personal_shopper",
    "thoroughbreds",
    "sicario",
    "the_good_shepherd",
    "21_grams",
    "thelma",
    "first_man",
    "you_were_never_really_here",
    "incendies",
    "the_master",
    "anna",
    "the_killing_of_a_sacred_deer",
    "20th_century_women",
    "the_33",
    "the_rover",
    "the_secret_scripture",
    "dances_with_wolves",
    "the_last_duel",
    "beirut",
    "the_name_of_the_rose"
  ]
}