{
  "id": 2052,
  "title": "Edward Scissorhands",
  "starring": [
    "Johnny Depp",
    "Winona Ryder"
  ],
  "runtime": 105,
  "genre": [
    "Fantasy",
    "Drama",
    "Romance"
  ],
  "description": "A small suburban town receives a visit from a castaway unfinished science experiment named Edward.",
  "releaseYear": "1990",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/e0FqKFvGPdQNWG8tF9cZBtev9Em.jpg",
  "categories": {
    "plot": 8.421052631578947,
    "acting": 7.2631578947368425,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.625,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I think it combines a drama movie with a thriller movie in a perferct form, you can find some emotive and happy sequences, on the other side some horrible and dramatic sequences, everything is the performance of Johny Depp"
    },
    {
      "rating": "10",
      "text": "This is one of the best Tim Burton and Johnny Depp movies. The story of how a misfit is pulled into a consumerist over-the-top happy society (or does it just appear that way?) -- Kinda reminds me of being a misfit in the town of snobs I grew up in as a kid lol. I love this movie, I've scene it many times and have enjoyed it every time."
    },
    {
      "rating": "9",
      "text": "\"Edward Scissorhands\" is an indescribably beautiful, yet uncommonly simple fairy tale with memorable performances, an iconic soundtrack, and some unforgettable imagery."
    },
    {
      "rating": "10",
      "text": "This is an example of a perfect movie. Great story, brilliant acting, beautiful visuals and a wonderful soundtrack. I consider this movie Tim Burton's greatest masterpiece and my personal favorite movie"
    },
    {
      "rating": "10",
      "text": "I love this movie, it left a lump in my throat."
    },
    {
      "rating": "8",
      "text": "Tim Burton with his trademark dark, fairytale-like brilliance.Johnny Depp & Dianne Wiest are great & Winona, oh Winona what happened??Decent score by Danny Elfman despite going into the Simpsons & Batman now & again."
    },
    {
      "rating": "10",
      "text": "Edward Scissorhands is one of the best Christmas movies ever made. It's also Johnny Depp's best movie as well as Tim Burton's. An absolute cathartic joy, Edward Scissorhands is a beautiful modern fairytale for young and old alike. A true classic!"
    },
    {
      "rating": "10",
      "text": "Tim Burton has made a lot of good movies. This is one of them. Depp was great as Edward who was very sweet and quiet, which is why I liked him so much."
    },
    {
      "rating": "10",
      "text": "In this modern fairy tale, Edward is a gentle, naive creation with razor sharp scissors for hands. When he is taken home by a kindly Avon lady live with her family, his adventure in the pastel paradise of Suburbia begins!"
    },
    {
      "rating": "10",
      "text": "The only type of person that could not appreciate this film is the type that has never stepped outside their safety zone. It deals with so many topics and executes them all beautifully and wonderfully. Tim Burton has had magic from the beginning and has never lost it, but this film is where the true beauty shone thru."
    },
    {
      "rating": "9",
      "text": "The quintessential dark fairy tale. Besides \"The Nightmare Before Christmas\", and \"Beetlejuice\", nothing can compare to the dark, mysterious, yet frightfully funny and enjoyable romp of \"Edward Scissorhands\". Diane Weist and Alan Arkin mold there stock characters to a tee. Winona Ryder plays stupid and blonde like no ones business. And Johnny Depp disappears into a world without fingers, a feat no one will ever be able to rival."
    },
    {
      "rating": "10",
      "text": "I thought this movie was fab, it was touching and Edward was sweet. The only bad bit was because Edward and Kim never stayed together, it would have made it a better movie. I was crying at the end."
    },
    {
      "rating": "10",
      "text": "Great movie overall, very nice, especially how he actually was able to use the hands faster than humanly possible. One thing I dont understand is how he ate all those years that he was alone, what happened to the inventor's body, like the police coming and such."
    },
    {
      "rating": "10",
      "text": "I can't tell you how many times I have seen this movie, and yet, everytime I see it, it seems to get even better. I thought it was impossible to cry after you have seen a movie more than 5 times, but I seem to cry harder and harder with each time I see it. Johnny Depp is an all-around amazing actor. The power to creates sympathy without words is incredible."
    },
    {
      "rating": "10",
      "text": "Simply the most original and one of the best love stories ever told. Love the Depp/Burton combination."
    },
    {
      "rating": "10",
      "text": "Out of all Burton's films, I value this one very sentimentally, as I'm sure most of the Burton-heads do. I'm quite the sucker for the sensitive, slightly defenseless male lead. Puppy-dog eyes are my achilles heel, in other words. In the world of the absurd (and more specifically, the gothically absurd) Burton shines, and Depp's ability to just simply be anyone or anything makes this one perfect. No one can touch this one- I think it quite conclusively proves that Burton is the evil-genius we all hope he is."
    },
    {
      "rating": "10",
      "text": "A masterpiece. I was crying badly. Johnny Depp is great."
    },
    {
      "rating": "10",
      "text": "It was great but really sad. I CRIED!!!!!"
    },
    {
      "rating": "9",
      "text": "One of my favorite movies! It is the story of \"an uncommonly gentle man\" and has great storytelling, and best of all, JOHNNY DEPP!!!!"
    },
    {
      "rating": "10",
      "text": "One of the greatest master-pieces that I have ever seen. Great story-line, great plot, great actor/actress and director, it completely takes us into earlier days and reasserts in us the feelings for old stories told by our elders. Truely remarkable in every sense. Once I had watched it at a much younger age but still I could remember it fair enough but when I watched it again today I couldn't stop playing it till the end though I had other films waiting in line. I am writing for the first time for any movie, I couldn't stop myself."
    },
    {
      "rating": "10",
      "text": "A story seemingly simple yet heartbreaking and complete in itself. Comedy. Romance. Quirkiness. Satire. And overwhelming tragedy. Edward has scissors for hands, but the real monsters in this film are the \"normal\" people who taunt, use and reject him, refusing to appreciate his soul that is gentle, pure, and giving without asking anything back. The ultimate beautifully sad fairy tale that does not let go for days. R.D. and Ugly are right."
    },
    {
      "rating": "10",
      "text": "Great movie. If you like a darker yet heartfelt fairy tale then this is for you. For the idiots reviewing things like ITS NOT FUNNY or ITS NOT REALISTIC. Its a fairy tale last time i checked giants living in clouds and bears living in a house were pretty damn realistic like all fairy tales. *sarcastic* Oh and its not a comedy! If you couldn't tell from the cover of the movie. If you don't watch a movie genre you don't like ITS NOT THE FILMS FAULT"
    },
    {
      "rating": "8",
      "text": "Every single minute of this was wonderful, touching, and brilliant, and the ending was predictable but nevertheless emotional. As a whole, I really liked EDWARD SCISSORHANDS, and I really think that this is one of Johnny Depp's very, very best roles of all-time."
    },
    {
      "rating": "10",
      "text": "Johnny Depp and Tim Burton have become a profitable duo over the past two decades. The partnership began in 1990 with the creation of this modern fairy tale.  This is my favorite of Depp's performances, as well as my favorite of Burton's films. Edward is fragile and frightening in the very same breath; a creature from a warped and dark imagination stranded in a world of pastels."
    },
    {
      "rating": "7",
      "text": "I didn't love it, but Edward Scissorhands was still a good film overall. It had a good message to it and interesting characters in it. I just wasn't a big fan of the environment surrounding it and it kind of derived from the seriousness of this film at times. I guess i'm just not the biggest Tim Burton fan, but Johnny Depp did a good job playing Edward and I think that this film may still be worth watching."
    },
    {
      "rating": "10",
      "text": "A perfect score for a perfect movie from one of the perfect collaborations in Hollywood. No wonder Depp-Burton friendship has lasted this long, every time producing the most quirky, weird and all the while wonderful films. A salute to the uniqueness in all of us, this film is, I believe, Burton's chef d'oeuvre."
    },
    {
      "rating": "9",
      "text": "I'm not really into the Romance genre, but this is probably my favourite in the genre. I find this movie to be interesting, the characters and the backstory was quite cool. I like Edward because his character is nothing I have seen before. Now movies like this would have tons of cliches if it was made in this millennium."
    },
    {
      "rating": "10",
      "text": "Johnny Depp played Edward really well. Edward had a charming sweetness about him that grips out at me and pulls me in to watch more. I never get tired of this tragic fairy tale."
    },
    {
      "rating": "9",
      "text": "Great Johnny Depp acting and a great history. Emotional some times and funny other times make this movie required to everyone that is a huge cinema fan."
    },
    {
      "rating": "10",
      "text": "This is my all time favorite movie and I could go into how much I love it for hours. I will save reading and writing for that matter to keep this short and sweet. This movie is well acted, directed, and the score is just amazing. Every time my iPod plays the ice dance song I get chills. This is by far one of johnny's best performances and why I call him my favorite actor. If you haven't seen it give ti a watch, but if you have watch it again this movie merits re watches and I always catch something new that I didn't see the other times I watched it from the house getting bug bombed in the background to how well the sets and character comment on a slice of suburbia that I honestly can say i live in."
    },
    {
      "rating": "8",
      "text": "Charming, unique and pretty. You've got to love Edward and his scissor hands. Depp guided by Burton is great in this film and Burton's style of directing is exactly what this film needed to be great."
    },
    {
      "rating": "8",
      "text": "TIm Burton's \"Scissorhands\" flows smoothly with marvelous acting from Johnny Depp and creative direction by Burton himself. Possibly Depp+Burton combination is one of the best I've seen in years."
    },
    {
      "rating": "8",
      "text": "This film proves Burton has the ability to combine tragedy, comedy, satire and American culture all into one film. The chemistry between Depp and Ryder is wonderful and the story itself original."
    },
    {
      "rating": "0",
      "text": "OH MY GOSH! This was the WORST MOVIE I'VE EVER SEEN!!! And I'm not just saying that... I've seen my fair share of bad movies, but 'Edward Scissorhands' was literally the WORST OF ALL! The title itself practically gives away the whole dull plot of this terrible movie, and I must say that I have absolutely no idea why a man with Johnny Depp's talents would resort to acting in it, and why anyone would like this trash... Why is the user rating on metacritic so high!? 'Edward Scissorhands' is another work of utter garbage from a most dreadful director/screenwriter in Tim Burton, who has not as of yet (and most likely never will) created a movie that is enjoyable to watch in the slightest. How can he still be allowed to write and direct movies for Hollywood, and how can anyone possibly bear to give him any compliments for his works of complete and utter crap!? The first time I watched 'Charlie and the Chocolate Factory' (the original) I wasn't particularly impressed, but after watching Tim Burton's feeble attempt at it (why was Johnny Depp in this one as well? Does he feel sorry for Burton or are they so closely related that his parents won't let him refuse his offers or something), I thought of the original as quite a masterpiece. I like randomness, in fact I think it brings in an amusing factor that is often needed in a movie, but Tim Burton's 'random' just adds more boring to his already tedious and nonsensical story-lines. Wasn't Beetlejuice supposed to be a comedy/horror movie...? Those are the best two combination to keep a viewer interested, but I actually fell asleep after just 15 minutes... ...and I'd gotten 14 hours sleep the night before!!! What made 'Edward Scissorhands' all the worse for me was that, after viewing it at school (I would never have watched it otherwise), our whole English class had to explore into the movies' depths and find out how it was made and how different stupid things had hidden meanings (things that Tim Burton himself probably didn't even think about when writing it). Delving into the movie itself did nothing to make me enjoy it any more, in fact it made the dreary experience just as bad as when I watched it in the first place (I mean it couldn't possibly get any worse!), it just took a hell of a lot longer to get through. So overall, 'Edward Scissorhands', worst movie ever, pointless plot, overly colorful, completely unfunny, totally unrealistic (which ties in with my last point, if the unrealism had a little humor it would have been okay, but scissorhands...? Scissorhands!? That's like something a Primary School Child would think is cool, until they GROW UP!!!), awfully directed and written (I hate you Tim Burton!), and even completely disgusting at times (what was that woman doing to Depp in the back room?). I wouldn't recommend this atrocity of a film to anyone with at least half a brain."
    },
    {
      "rating": "0",
      "text": "Yep, nothing else to say. worst movie I ever wasted time on. it's films like these that drop the standard of today's American films."
    },
    {
      "rating": "1",
      "text": "Absolute and complete rubbish... can't believe I watched it... After watching 'Pirates of the Caribbean' I must say I'm pretty disappointed in you Johnny... But I could never hate you! You're still the best actor in the world!!!!!!!! The '1' was for you. Otherwise I hated the movie"
    },
    {
      "rating": "0",
      "text": "The lump in Jared K's throat was his balls. They obviously realized he was no longer a male. Can't imagine any actual males liking this complete shit. waste of acting talent."
    },
    {
      "rating": "0",
      "text": "Literally the worst movie i've ever seen. even johnny depp's acting talent was dulled by this atrocious excuse for a movie. tim burton is a man of absolutely no skill, and this was made painfully obvious by 'edward scissorhands'. absolute rubbish."
    },
    {
      "rating": "7",
      "text": "I think it's funny how jaque m didn't give a single decent reason why the movie was bad, he just review Charlie and the chocolate factory a little. I've never seen someone write so much and say absolutely nothing. The movie was okay, a little dull and it hasn't aged well, but a good attempt."
    },
    {
      "rating": "0",
      "text": "This was a fantastic movie! Oh, wait... i was thinking of something that wasn't this piece of crap. Terrible film and i'm going to have to agree with jaque and say that this was, honestly, the worst movie i've ever seen"
    },
    {
      "rating": "7",
      "text": "It definitely has one of the best scores ever created for film, but if you take away that, the film is just weird. Could had been much better. It has a bittersweet ending, which is something I greatly appreciate."
    },
    {
      "rating": "8",
      "text": "From the wild and wacky mind of Tim Burton comes Edward Scissorhands, a tragic and charming look at a man with scissors for hands. A film that only Burton could make, his direction is as sound as usual and he manages to evoke considerable sympathy for this tragic figure who is, otherwise, a normal man but cursed to live his days with scissors as hands. Johnny Depp does a great job bringing this man to life and brings a certain tenderness and has fantastic chemistry with Winona Ryder when it comes to the romantic element of the film. The writing is incredibly strong and, together with Burton's direction, keeps this one reined in and keeps it from getting out of control when it easily could have with such a crazy premise. The characters are well developed and truly multi-dimensional. Edward Scissorhands' portrayal of suburban life also feels delightfully and quintessentially late 80s, early 90s and really serves as a perfect backdrop for the introduction of such a weird and unique person. Though I may be one of the few to have never seen Edward Scissorhands, it is truly timeless and will live on for a long, long time due to its fairy tale and thematic elements that really are universal and its ability to be both unique, yet incredibly stirring, tragic, and moving. This one is Tim Burton at his very finest."
    },
    {
      "rating": "8",
      "text": "Edward Scissorhands, a beautifully made movie from the imagination of Tim Burton (Beetlejuice, Batman). A sort of comedy/romance kind of film starring Johnny Depp and Winona Ryder but will not give the story away because I'm sure most have seen it. However my opinion of this film is Winona Ryder as Kim looks beautiful in this film, infact she's the real highlight that stands out in the whole film for me!! Johnny Depp was clumsy but good as Edward Scissorhands and it's a funny but beautiful film. Great movie which would be good to watch at Christmas because of the scenes when it's snowing."
    },
    {
      "rating": "8",
      "text": "85%!The sound is there, the concept is there, just din't have the right technology to make it look better back then.  Compassion driven wisely, good quality of comedic elements.  Don't like Johnny Depp's facial expression though."
    },
    {
      "rating": "6",
      "text": "Typical Burton film, very strange and quirky but not particularly clever. Depp is good."
    },
    {
      "rating": "6",
      "text": "I feel like I can see a future genius honing his craft.  This movie has so much potential, but that something special about Tim Burton's best movies is just missing."
    },
    {
      "rating": "10",
      "text": "Um dos filmes de romance mais eficiente,funciona também como comédia,Brilhante feito de Tim Burton,Johnny Depp dar uma performance fenomenal quase só facial pois o personagem não fala muito,Dianne Wiest também é fenomenal,Winona Ryder está perfeita também"
    },
    {
      "rating": "8",
      "text": "Johnny Depp with a great performance, his Edward ist very sad and with low self confidence, a sympathetic character.The story is sad also and a bit unrealistic, but intentionally exaggerated, like a fairy tale. So dont take everything seriously. But the bottom line about the bourgeois is clear and surely true.The art design was a master piece earlier, today every film lover knows Tim Burton."
    },
    {
      "rating": "7",
      "text": "Edward Scissorhands is one of the first collaborations between director Tim Burton and Johnny Depp and the two have become a pretty successful duo in film. The movie is certainly shot differently than another film did before and the plot is so original and weird but the film is still a good watch and I think everyone should watch this movie even though it may be a bit dated now."
    },
    {
      "rating": "10",
      "text": "A fantastic movie no doubt about it.The best thing in the movie is the acting especially Johnny Depp's.He just used facial features to show emotion rather than words and it pays off.Burton put his heart and soul into this and it shows,it's just perfect.The best in my opinion is the score by Danny Elfman.It's one of his best and I watched the movie because of the soundtrack.It's beautiful.The movie is excellent definitely worth the time.It's beautiful."
    }
  ],
  "recommendations": [
    "eternal_sunshine_of_the_spotless_mind",
    "alice_in_wonderland",
    "dark_shadows",
    "stardust",
    "charlie_and_the_chocolate_factory",
    "beetlejuice",
    "the_royal_tenenbaums",
    "the_princess_bride",
    "best_sellers",
    "peter_pan",
    "corpse_bride",
    "cruella",
    "ghostbusters",
    "frankenweenie",
    "paddington_2",
    "oz_the_great_and_powerful",
    "a_cinderella_story",
    "the_green_mile",
    "let_me_in",
    "maleficent",
    "eddie_the_eagle",
    "ella_enchanted",
    "hook",
    "the_bfg",
    "the_disaster_artist"
  ]
}