{"id": 4291, "title": "Eiffel", "starring": ["Romain Duris", "Emma Mackey"], "runtime": 108, "genre": ["Romance", "Drama"], "description": "The government is asking Eiffel to design something spectacular for the 1889 Paris World Fair, but Eiffel simply wants to design the subway. Suddenly, everything changes when Eiffel crosses paths with a mysterious woman from his past.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/mrHx1eQpG7d0Qz3PUkt1ceEP6YK.jpg", "categories": {"plot": 6.0, "acting": 6.0, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "6", "text": "From the title it's obvious that this movie is about the famed engineer Gustave Eiffel, who created France's most famous landmark. This \"freely adapted\" drama follows his challenges to build the structure for 1889 Paris World Fair, despite protests and setbacks. Being that this is a French film, there's also a romance, which is meant to add depth to his dilemmas. While what is shown is interesting, the work on the tower lunges forward near the end without much additional exploration. His frustrated love affair doesn't add anything but time. If the filmmakers had focused more on the actual construction this might have been a fascinating historical chronicle. As it stands (pun intended), Eiffel is an attractive period piece that's only a ground-level look at the project."}, {"rating": "4", "text": "Martin Bourboulon cria um filme chato, de fotografia muito feia e que não consegue sequer emociona mesmo com a trilha. Eiffel, por outro lado, não é grosseiramente ruim, mas não sai do lugar comum.Para começar, Romain Duris até que atua bem e consegue passar a imagem de arquiteto visonário, mas com muito romantismo, literalmente. Os empresários são nada mais nada menos do que caricaturas, e de uma hora a outra embargam o empreendimento, o que faz com que seja uma busca idealista, meio que \"por amor\" ao projeto. Além disso, há um par romântico que torna tudo muito não orgânico na trama.A fotografia é tão monotônica, de uma escuridão esquisita, que somente nas cenas finais a gente lembra de estar na cidade das luzes.De toda a forma, a cena com os trabalhadores erguendo o empreendimento são razoáveis, e a história por trás (não sei até que ponto o filme se excedeu aqui) é muito interessante para pensarmos as relações internacionais na história geral. Tirando isso, o filme não entrega muita coisa, e rapidamente se tornará esquecível."}], "recommendations": ["spartacus", "blade_runner", "diego_maradona", "i_origins", "the_french_dispatch", "tulip_fever", "the_dig", "official_secrets", "agora", "gone_with_the_wind", "the_pianist", "apollo_11", "motherless_brooklyn", "denial", "darkest_hour", "a_la_mala", "das_boot", "the_lovers", "snowden", "loving_vincent", "tolkien", "close_encounters_of_the_third_kind", "anna_karenina", "the_monuments_men", "the_grand_budapest_hotel"]}