{"id": 2274, "title": "Eight Below", "starring": ["Paul Walker", "Bruce Greenwood"], "runtime": 120, "genre": ["Adventure", "Drama", "Family"], "description": "In the Antarctic, after an expedition with Dr. Davis McClaren, the sled dog trainer Jerry Shepherd has to leave the polar base with his colleagues due to the proximity of a heavy snow storm. He ties his dogs to be rescued after, but the mission is called-off and the dogs are left alone at their own fortune. For six months, Jerry tries to find a sponsor for a rescue mission.", "releaseYear": "2006", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/xAKEG2CemdK5M86GidaAE5nRWTW.jpg", "categories": {"plot": 7.5, "acting": 7.75, "ending": 9.0, "soundtrack": 6.333333333333333, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 5.0, "action": 7.0}, "reviews": [{"rating": "10", "text": "This movie totally melted me. .excuse the pun. Luckily I was in my room when watching this sad yet uplifting tale. A very sincere and honest movie that brings ones inner emotions totally to the fore .. .. . .you could really feel Walkers rapport with the dogs which made this such a wonderful visually tangible experience."}, {"rating": "9", "text": "In 1982's exploitation/ vigilante classic Class of 1984, Roddy McDowall's character, an alcoholic biology teacher in a seriously crime-ridden high school who makes the fatal mistake of bringing his animals to class, lifts a glass to them because they're far superior to people. This exciting, masterfully manipulative and surprisingly quite moving Disney adventure epic, the best movie so far in an admittedly young 2006, certainly bears McDowall's argument out. Moreover, even though dividing the world into \"dog people\" and \"cat people\" is most of the time a little too arbitrary (I'm both), Eight Below will most likely turn even your neighbor across the street who shares her house with eighteen felines into a dog person for two hours. The title characters are a team of heroic sled dogs who are forced to tough it out in brutally cold Antarctica, braving the elements as well as imminent starvation when their masters are forced to desert them and various combinations of circumstances prevent a quick return. While the dogs protect, take care of, and sacrifice for one another, the humans (with one exception) more or less rationalize their way out of feeling much real responsibility for relieving the dogs' plight, even though one of the scientists is mostly at fault for the whole situation. Spielberg associate Frank Marshall (who dealt with somewhat similar material in Alive--which thankfully isn't resolved here with quite the same methods--and, thank God, avoids the smarmily jokey tone that made his Congo so disgraceful) does a splendid job not only of staging and filming the canine action so you feel you know almost precisely what the dogs are barking to each other and even thinking, but even does a first-class job of detailing the animals' very different and distinctive personalities. (He's also very shrewd in the way he dispenses with both the Obligatory Penguin Footage and the Obligatory Paul Walker Shirtless Scene in the first ten minutes.) The dog material is so extraordinary that it's easy to understand criticisms that there's not enough of it and that too much screen time is spent on the humans trying to get back to them, but I thought Marshall's cutting back and forth between the dogs and the people built and heightened the suspense beautifully. And then there's the matter of Walker, who plays the most guilt-ridden of the scientific team--in films like The Fast and the Furious and Into the Blue, he's one of those bad actors who's nevertheless fun to watch because he habitually races through his dialogue, but working with the pooches really seems to have altered his acting style: he slows down and gives his warmest, most relaxed and likable performance ever. It's a long-held truism in the acting community that actors should never work with animals because the humans will invariably be upstaged, but perhaps in Walker's case he should go the opposite route and do nothing EXCEPT animal movies from now on!"}, {"rating": "10", "text": "The dogs were fantasatic! If you are a dog lover, this film will touch your heart. If you are not a dog lover, you WILL be after this film! There is an amazing \"human-like\" quality among the team of dogs. The show respect, love, and compassion for each other that makes all of them simply wonderful."}, {"rating": "10", "text": "This is a great movie! It moves quickly and has something to appeal to everyone. This movie relies on plot, talent, and a good ending rather than obsenity and nudity to attract an audience. Imagine that! A little inside trivia: Buck is played by a malemute from Kenai, Alaska. Three local dogs appear in the movie."}, {"rating": "8", "text": "This was a really good movie, I enjoyed it."}, {"rating": "1", "text": "Paul Walker is, without a question, the worst actor in Hollywood."}, {"rating": "8", "text": "Don't hate Paul Walker because he's beautiful. He has great chemistry with the dogs, though not so much with the humans."}, {"rating": "5", "text": "What can I say except the best actors in the movie were the pooches. I wished they showed more of their fight for surivival. I was impressed with the movies portrayal of these dogs as compassionate creatures. As for the humans, it may have been in part a weak script of dialogue but the acting was slightly below average. This movie had the potential to be so much more. I wish they stuck more to the actual history of the orginal true story of an Japanese outpost in the 1950's. This would have been more interesting to me but heaven forbid the masses can live without their Hollywood or Disney in this case. Overall it was not a total was of 2 hours."}, {"rating": "10", "text": "There were no bad guys, just a difficult situation. Paul Walker played a non-aggressive, but persistent character who knew what was the right thing to do and did not give up his quest. There was no subtext, but it was easy to think of one. How many people who work hard and give their all in our society are abandoned like dogs while those they help are given all the accolades?"}, {"rating": "10", "text": "I could watch this movie over and over again. It was wonderful."}, {"rating": "7", "text": "I was really torn about seeing this movie, because although I am a big dog lover, I hate the idea of paying to see a Paul Walker movie. Not only do the dogs deliver on their part, they somehow manage to lift Walker up so he gives a performance that isn't bad. Which when you think about it, might have been the most remarkable thing the dogs pulled off in this film. I also think the woman pilot showed genuine screen charisma."}, {"rating": "10", "text": "This movie broke my heart."}, {"rating": "9", "text": "saw this movie on Delta Airlines coming back from Atlanta....so gripping, moving, didn't even feel the turbulence in the air at times....I was that engrossed. I have four dogs of my own so it truly tugged at my heartstrings.....amazing how this movie showed the almost human side of these dogs...beautiful movie..."}, {"rating": "10", "text": "i thought it was fantastic very moving i thought paul walker did a great job int his film."}, {"rating": "3", "text": "The music persists on going over the top in this melodramatic and overly contrived remake of \"Antarctica.\" Even though that movie's dubbing over the Japanese is sometimes painful to listen to, that movie rings much more true and has a wonderful Vangelis soundtrack. Invest your viewing time there instead."}, {"rating": "2", "text": "I must be living in some parallel universe or maybe I love animals a lot more than most folks. **Spoiler Alert** I could not get past my extreme anger that all of those people left those dogs chained up and didn't come back to see about them for five months. The only right thing that Paul Walkers character should have done is to say \"I will get out of here when my dogs are by my side, and not a moment sooner."}, {"rating": "8", "text": "Just a heart-warming movie that's a pleasure to watch. Paul Walker is excellent in this kind of role, and unlike many movies of this kind, they don't set up \"the bad guy\" like I thought they would have. And the dogs are incredible! I was a little puzzled, however, by the fact that the line from the preview that went something like: \"Don't ever underestimate somebody's will to survive...Especially when he's with his family\" (referring to the dogs) - didn't even make the final cut of the film! I kept waiting for it. just a really solid film. And to my great surpise, like in Final Destination 3, there is one jump out of your seats moment that will scare the crap out of you, so keep a solid grip on that popcorn."}, {"rating": "10", "text": "Thank goodness we have a movie that teaches children that the future of our survival depends on learning from animals, not from destroying them. The animals and their trainers are the real stars of this movie. It is beautiful to witness their portrayal of teamwork, love, bravery, and devotion. We must hope that \"Eight Below\" and \"March of the Penguins\" mark the beginning of many more of this film genre."}, {"rating": "9", "text": "This movie is so wonderful, yet heartbreaking, I saw it twice. The dogs will steal your heart and make you use your kleenex. I hope they all will get an Oscar, at least a special Oscar for their performances. Inspired by a true story, I understand the original ends with more heartache than this one does. Do yourself a favor and see this movie. It's one of the few wonderful family movies out there today. Thanks Disney for a job well done. P.S. Don't listen to critics degrading this film. I've learned, over time, that if critics give it a low rating, go see it, because it means it's good."}, {"rating": "9", "text": "Needed more time with the dogs who were wonderful. My heart went out to them. Looking forward to the release of the DVD."}, {"rating": "10", "text": "Very enjoyable movie and suitable for all ages."}, {"rating": "10", "text": "Best movie I have seen in years! Am recommending it as a must see to everyone I talk to!"}, {"rating": "8", "text": "Very enjoyable, especially if you're an animal lover. The dogs are truly remarkable. Go see it."}, {"rating": "7", "text": "Never figured out why US companies feel compelled to appropriate and remake other nations' movies, when locally conceived US movies can be the best in the world. Leaving that puzzle aside, this is your better class of Disney fable, the kids will love it. The humans are ordinary, but the loyal canines are nigh on impeccable. Memo: no other food species for canines were (we sincerely trust) harmed in the making of this movie."}, {"rating": "9", "text": "Magnificent photography and some truly heart moving scenes. Highly recommended."}, {"rating": "5", "text": "Don't harm the dogs, by all means, but how about a little doggie make-up that would convey the long ardurous months these canines fended for themselves. These huskies look too fresh, which dillutes the impact of the reunion considerably. Of more interest, especially in the year of the gay cowboy, is the ambiguous relationship between Jerry(Paul Walker) and Charlie(Jason Biggs). Charlie has a girlfriend that might not exist, and guess who Jerry grabs first in excitement when the gang is reassembled for the rescue mission."}, {"rating": "7", "text": "My verdict: give me more dogs, less people. The cut-aways to the people really made this movie drag. When it was focused on the dogs, however, it worked brilliantly. I've belonged to several huskies for a number of years, and while the dog antics aren't always quite accurate, the dog actors are totally compelling."}, {"rating": "10", "text": "I give 8 below a 10 because it was a realy good movie and it was very heart warming.i loved the actors and most of all i love the dogs! love this movie and it is my favorite movie EVER!"}, {"rating": "8", "text": "You shouldn't rate a movie based one one character. What kind of name is esus anyways. This movie was great. It is an inspiration to everyone who watches it, especially kids who it is made for."}, {"rating": "10", "text": "Beautiful sensitive film, The dogs and the actors were fabulous. It appeared as a very professionally editted film. I wanted more when it was finished. It could have gone on and on to my pleasure. I wanted to know what was going to happen to all of them next."}, {"rating": "8", "text": "This movie may not be a cinematic masterpiece, but it is an emotional journey for anyone who can feel sadness. This movie has a great soundtrack, and whilst the story is not exactly ground-breaking, the execution and production is highly commended. The director, producer, all those involved, really made the most out of this no-future film manuscript. Excellent work."}, {"rating": "9", "text": "I enjoyed the **** out of this film, its no cinematic masterpiece but I enjoyed the **** out of it. It's the story of 8 sled dogs, all of whom show great range and depth as well as a fantastic performance by the late Paul Walker. Its a great, emotional film for dog lovers and a great film for families"}, {"rating": "8", "text": "This movie is just about perfect in every sense ---- the acting, the writing, the cinematography, the music --- combining to bring us a thrilling, absorbing and especially moving story about courage and determination."}, {"rating": "7", "text": "Eight Below is the many adventures of Paul Walker and the many huskies you can see in this movie. It's also fun to watch with your entire family as well as that boosts up the adventurousness up."}, {"rating": "8", "text": "This big budget American re-make of the Japanese “Antarctica” is quite special in its attention to detail and very obvious stylised production values. Director Frank Marshal pulls out all stops to bring this gripping tale to the screen through stunning photography and some strong casting – the best of these is the late, and at all times believable, Paul Walker (Flags of our Fathers ‘06) playing a guide for the National Science Foundation. He manages and nurtures the scientist’s Dog Team - a mixture of Alaskan Malamutes and Siberian Huskies. These highly intelligent animals are nothing short of astounding – as seen in the remarkable performances of their highly trained duties (a testimony to their trainers).Based on the ill-fated 1958 Japanese Antarctica expedition - it’s a semi-retelling of the original drama that allows more of the Dogs to survive than did originally (probably for family considerations) and takes us on a tour de force survival adventure, with some genuine shocks on the way!  Many inspirational situations help to overcome the coy addition of a comic type character in Jason Biggs but this has to be tolerated for the sake of ‘entertainment’/sales marketing - it might have been helpful to reduce this character’s screen time to bring down the movies overlong running time but, this will vary with personal choice. Mark Isham’s big music score is as vast as Don Burgess’ inspiring widescreen photography. Strong family entertainment on the fact-based dramatic side that’s curiously not run as often as it deserves. Fine DVD transfer."}, {"rating": "1", "text": "How the hell people like movie, where some **** left dogs in snow hell for so long?"}, {"rating": "10", "text": "One of the amazing remake movies. This movie would be good choice if you loved the original one."}], "recommendations": ["the_incredibles", "onward", "okja", "the_good_dinosaur", "finding_nemo", "the_iron_giant", "how_to_train_your_dragon_2", "soul", "up", "soul_surfer", "christopher_robin", "brave", "ratatouille", "bolt", "the_polar_express", "paddington_2", "the_art_of_racing_in_the_rain", "luca", "spider_man_into_the_spider_verse", "her", "moonrise_kingdom", "the_bfg", "finding_dory", "bicentennial_man", "the_call_of_the_wild"]}