{
  "id": 2352,
  "title": "El Camino: A Breaking Bad Movie",
  "starring": [
    "Aaron Paul",
    "Jesse Plemons"
  ],
  "runtime": 123,
  "genre": [
    "Crime",
    "Drama",
    "Thriller",
    "Action"
  ],
  "description": "In the wake of his dramatic escape from captivity, Jesse Pinkman must come to terms with his past in order to forge some kind of future.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ePXuKdXZuJx8hHMNr2yM4jY2L7Z.jpg",
  "categories": {
    "plot": 5.975609756097561,
    "acting": 6.65,
    "ending": 6.222222222222222,
    "soundtrack": 8.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 8.166666666666666,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Just unbelievable, it's real created by Vince Gilligan? No, no it can't be. What? Really? This is not creativity but some kind of drug addiction. Unnecessary, meaningless, foolish, not bringing anything new to the BB universe. Vince you can better, you can, right?Unfortunately this is not A Breaking Bad Movie, this is A Bad Fan Service based on the Breaking Bad series, Fan Service which created by Vince Gilligan for Vince Gilligan."
    },
    {
      "rating": "7",
      "text": "El Camino is entertaining, features great cinematography (that improves upon Breaking Bad) and a great acting performance from Aaron Paul (arguably better than in the series). It deals with some necessary realities an truths of the aftermath of Breaking Bad, especially in the first scene where Jesse discusses \"put[ing] things right\" and Mike reminds Jesse, \"that's the one thing you can never do.\" But by the end of El Camino, Jesse is essentially in the same place he was at the end of Breaking Bad - in terms of his arc and development, but just with fewer loose ends. It's a likable movie and not useless, as it certainly adds helpful details and answers some questions, but only if we consider it an addition to Jesse's story, rather than the final conclusion of Breaking Bad. Ultimately, you can make your own call - is Jesse's story better left with the question marks and uncertainty? I think nothing was going to beat his final scene in Breaking Bad and that was possibly the perfect conclusion for him, but I did not regret watching this."
    },
    {
      "rating": "8",
      "text": "Breaking Bad is the greatest show that has ever graced our TV screens, hands down. So I was both excited and EXTREMELY skeptical when this film was announced. Thankfully, most of my concerns were for nothing, as this is an extremely well put together production. While I absolutely adore the beauty and ambiguity of Jesse driving off, joyful tears in his eyes, at the end of the show, there is still more to Jesse’s journey that we didn’t get to see. Aaron Paul is as good here as he was in the best episodes of the show; he hasn’t skipped a beat, and he’s totally Oscar-worthy. It nails the look and feel of the show, and the cameos from characters are wholly satisfying and awesome. It may be a little overlong for how much plot there is; I could easily see this being condensed down into the length of an episode, but I was never bored. I do wonder if this would’ve been better if it was instead a little miniseries of maybe four or so hour-long episodes (something that Netflix has done before with Gilmore Girls; hopefully this would’ve turned out a little better than that did) instead of a single two hour chunk, but I’m still happy with what we got."
    },
    {
      "rating": "8",
      "text": "I was satisfied with that one.This is a great continuation of one of my all time favourite tv-shows."
    },
    {
      "rating": "7",
      "text": "El CaminoEl Camino takes place seconds after the series Finale. Jessie escapes Captivity and is on the run, He seeks shelter with some old friends. He comes to the conclusion that he needs to escape and forever by using the Vacuum cleaner repair man from the original series, in an episode where Saul tells Jessie about a guy that can make him disappear forever.Movie was not needed, Many people wanted to see Walter survive and continue the business but this did not happen, We do however get treated to a nice flashback scene of Walter and Jessie at a Denny's sometime around season 3 or 4 maybe. Walt and Jessie have one last argument and one last hurraw before the final curtain.Final Grade C-Movie was not Needed and probably not wanted from certain people, Plot was good but pointless, did not add anything new other than Jessie escaping and hatching a plan to disappear forever. Fans of the series will like and hate this film at the same time. If this was the real plot of the film Gilligan wanted to film than shame on him as it's not that great."
    },
    {
      "rating": "7",
      "text": "El Camino is a great epilogue to the Breaking Bad series. The movie doesn't stand well on it's own and requires the audience to watch the previous 5 seasons of breaking bad to fully grasp the nature of what's occurring in the movie. The movie is more a homage to the fans of breaking bad who want more. Aaron Pauls performance was excellent and the cinematography was above average but the story of Jesse after the events of Felina felt conflicted with the cluster of flashbacks which served little to no purpose at all and dint add much to the story. On the whole, if you're a fan of Breaking Bad you will most likely appreciate this Netflix Original. I gave this movie a 7 as it serves a solid epilogue and does a good job of rounding off the story of Jesse Pinkman."
    },
    {
      "rating": "9",
      "text": "In my opinion the movie as a stand alone is not the best but if you consider it as an epilogue or just an added episode it is excellent because it finally gives us good closure on Skinny Pete, Badger, and most importantly Jesse. Also I was very satisfied with the ending which plays a major factor in my rating."
    },
    {
      "rating": "10",
      "text": "Wow i am saddened by the weak Score. I Loved what they did with jesse. This was Just about Jesse and thats why i am Not Mad, that you didnt learn a lot about skinny pete and badger. I hope they get their own movie doe"
    },
    {
      "rating": "10",
      "text": "As a breaking Bad fan i would hate to see something going wrong with the perfect ending of show. This movie is what I totally wanted to see. This is what i wanted to happen. It is drama and badass at same the time. The typical dark comedy regime."
    },
    {
      "rating": "8",
      "text": "It's a very well shot and well paced movie, it fully completes Jessie's arc which was left to complete up to your own imagination at the finale of breaking bad, done in a very remarkable way consistent to Vince Gilligan's direction in Breaking Bad, but other than that the movie still doesn't offer more depth to the rest of the characters on the aftermath of the events of Breaking Bad aside from a few fanservice flashbacks such as kinda disappointing, as it's a movie that depends on the show, as a stand alone it doesn't hold up as much as only people who've watched the show will be able to appreciate what it is. But aside from that the movie is a excellent singular character focused story. The film properly offers closure to Jessie's story, and manages to keep bringing parallels to do he was before and who he is now. That he rejects the idea of throwing away his code of morality, evolving as a person while staying true to his heart."
    },
    {
      "rating": "10",
      "text": "Brilliant movie! Aaron Paul was phenomenal as always and it was so nice to see Jesse finally escape. Loved it! :)"
    },
    {
      "rating": "8",
      "text": "El Camino is a worthy addition to the Breaking Bad Universe. The movie picks up where Breaking Bad finished, following Jesse Pinkman after his great escape. The film is very much in the same tone as the series, dangerous but sprinkled with light and dark humour, and many great tension building scenes. There are also other returning characters from the show, most memorably Todd, aka Meth Damon. The movie is shot well, nice and crisp cinematography, lit with very neo-noir lighting. Flashbacks are used very well within the narrative, explaining Jesse's movements and motives, and foreshadowing future events. And just like the series, music is handled well, in particular, a scene involving Meth Damon and a truck. The movie satisfactorily concludes Jesse Pinkman's arc. I was delighted returning to the BB universe, and I'm happy with the way they chose to end it."
    },
    {
      "rating": "8",
      "text": "This is a very nice and well thought out closure for Jessi ark, delivers both nostalgia and tense moments we know from the show. A treat for every Breaking Bad fan."
    },
    {
      "rating": "8",
      "text": "It sure is Breaking Bad. It feels just like an extended episode, and when I say this, believe me, it's a very good thing. Besides what some people say, I don't believe the movie gives any kind of closure, it simply shows what happens to Jesse (Aaron Paul) right after the events of the finale. It also has a lot of flashbacks that are recieved with a certain feeling of nostalgia.The writting dosen't try to fly too high or be too creative and unfortunately when the topic is Breaking Bad the hype is real and I expected a more clever plot. It does create suspense in many ocasions and although it didn't match my expectations I consider the writting good enough. Maybe not as good as the best episodes of BB, like the train heist, but definetely as good as an averege episode. Just keep in mind that an average episode of Breaking Bad is better than the best espisodes of many, many other shows.Location scouting and scenarios really shine here. It's a very beatiful movie. The camera work is great and creative witch helps in creating imersion and suspense. The color grading is also very well done.It's very slow at times, but hey, it's Vince Gilligan, it's Breaking Bad, what else could you expect?If you are a fan of the show, it's a must watch. If you've never seen the show, the movie is great on it's own but I really recomend watching the show first. After all, it is a folow up."
    },
    {
      "rating": "8",
      "text": "This movie offers a comforting ending to a sequel we didn't know we needed, until we watched it."
    },
    {
      "rating": "6",
      "text": "Want to know what happens to Jesse Pinkman after the finale of Breaking Bad? Then here you will get to know-and the results may be quite satisfying but thats only because we have known the character for such a long time. In fact, maybe the best way to describe El Camino is by comparing it to going to your grandmas for lunch. Its safe, its comfortable, you know you love her soup, but nothing in there will surprise you or excite you beyond that. Getting to see old faces, seeing those beautiful shots of New Mexico and the sharp direction of Vince Gilligan is all good and takes you back to the days of the show, but there is just not enough of a story here to compensate. What ultimately happens in the story is what you would have probably guessed back then that Jesse would do to find a new leaf on his life. Furthermore, as cool as it may be to see other characters from the show, it turns out to be distracting  as well to see them not look as they used to 6 years ago when the show was running- an understandable thing considering people age, but since the story takes place immediately after the events of the finale, it is distracting nonetheless. For Breaking Bad fans, this is an insightful part of the story that shows more of Jesse and his struggles during his captivity and his means to freedom, and in that regard, considering it is on Netflix, it is an easy watch- but generally speaking, lets just say that there isn't much here to get excited about, and I may even call it, an unnecessary trip back to Albuquerque."
    },
    {
      "rating": "6",
      "text": "As a movie, it is decent. But as an extension of Breaking Bad, it is a complete failure. It is a story that relies almost entirely on flashbacks rather than on, you know, an actual story. If you are a Breaking Bad fan, you might as well watch it, but be warned that you will most likely be disappointed by the worst aspect of Vince Gilligan's universe. Seriously, even the worst BB and BCS episodes are still better than this."
    },
    {
      "rating": "3",
      "text": "El Camino is bad, and totally unnecessary. It spends 2 flashback-laden hours to inform you what any Breaking Bad fan already knew (Jesse headed for Alaska). The flashbacks are a total waste of time, walking about bloated, clearly aged versions of familiar faces, but to no real effect. Jesse's adventures with Todd are the biggest misstep, as somehow racist biker gang Todd apparently lives in a hip, modern apartment and employs a maid service (????!!!!!).  And when you're not getting the flashback \"fan service\" treatment, Jesse spends his time dealing with plot-point, nobody characters. All these 10 reviews are Breaking Bad fanboys over-excited to get any further glimpse of the universe, this sucked. Even if this had been made right after the end of the film it still would have been a bad idea.  Don't bother."
    },
    {
      "rating": "5",
      "text": "The only thing it added to Breaking Bad's ending was the confirmation that Walter White is dead, removing the enjoyable cliffhanger.I don't know if it really to be some weird motivational story, like, \"OH look this guy stopped being pushed around and took action so he's happy now\", but it felt 2 times longer than it should've been.The acting is great, the camerawork is great, but the movie is kinda pointless."
    },
    {
      "rating": "5",
      "text": "A lot of mostly the pointless flashback scenes. It's nice to see the performers again but they're all much older than they should be. Really slow movie with small bits of action here and there. No big surprises. I'd prefer more action or at least have a build up to something other than what we got. Honestly the movie just a little boring."
    },
    {
      "rating": "5",
      "text": "Wasn't worth the hype. This does not add anything to Breaking Bad, and barely would have passed for a single Breaking Bad episode. It was not 'unwatchable', but if it was a standalone movie that didn't rely on the success of Breaking Bad, it would have failed tremendously."
    },
    {
      "rating": "6",
      "text": "A well made, but ultimately unnecessary sequel. It's 45 - 50 minutes worth of plot stretched for two hours where little of note happens aside from Jesse Pinkman sneaking into places and a bunch of pointless suffering porn. It's nothing you couldn't have figured out by yourself after Breaking Bad ended. Aaron Paul is great, though."
    },
    {
      "rating": "3",
      "text": "Breaking Bad was very good. This movie is not. It feels like you watching the credits of the Pinkman story in slow motion. The story is very simple. Manhunt and how i get my money back with some flashbacks. No heights, basic tension and average acting. If it is sunday and you have nothing to watch and liked Breaking Bad then watch it. But don't expect much."
    },
    {
      "rating": "3",
      "text": "I'm at the 50 minute mark in this boring conceit of a film. This is bad. I loved Breaking Bad. This meandering, unfocused ode to Jesse Pinkman can't figure out where it's going and I no longer care."
    },
    {
      "rating": "3",
      "text": "While I was still wondering why this was made, or how can Vince Gilligan's art's quality drop so low, or why I just spent two hours watching what should have been a measly two episodes of the original cult classic TV show, El Camino (name of a vintage Chevrolet car) came in and went without making a bang or ruffling a few feathers, something that I was expecting it to do. TN."
    },
    {
      "rating": "6",
      "text": "didn't hurt the breaking bad ending, but didn't add much to it either.ok, just didn't have the stuff i wanted it to touch on.fat todd was too long a part of this movie."
    },
    {
      "rating": "6",
      "text": "I didn't really like this movie as much as I expect to watch. It's completely like a new finale episode for BB and can't even find the way to be on its own way. Even if we accept this as a finale for BB it wouldn't make it all right for El Camino. It looks like that Vince made this just to make money or to resposnd some kind of contract or sth like this."
    },
    {
      "rating": "5",
      "text": "I don't know where to start, but its pretty average to many flash backs, it didn't feel like he was on the run with the lack of a man hunt and cops. Just watch it."
    },
    {
      "rating": "5",
      "text": "A big disappointment , can't call it a movie just an extended episode with a satisfactory ending"
    },
    {
      "rating": "8",
      "text": "this movie doesn't manage to break expectations and you do need to watch breaking to understand what's going on. that said, this is an incredibly well done beautiful work that can only be complimented by jesse's great performance."
    },
    {
      "rating": "8",
      "text": "One thing El Camino skillfully achieves is keeping within the Breaking Bad montage aided by Gilligan’s ambition to write and direct. A snappy recap supplied by Netflix as well as Aaron Paul’s rendition on Jimmy Kimmel Live! was a refreshing reminder to fans of the show who don’t partake in an annual viewing. It’s no spoiler that Robert Forster makes an appearance which demands more of your attention to savour his character after the news of the actor’s untimely passing. Gilligan and Paul’s intention was simple; create a canon future and put to bed any speculation that fans cooked up for themselves, bringing resolve and justice to a dear a legendary television character who will always be forever in our memes."
    },
    {
      "rating": "0",
      "text": "There's something very fishy about the high scoring reviews both here and on IMDb.  I get it, people have different opinions, but even as a major Breaking Bad fan, this film left me completely cold, it's very very slow and nothing of note happens in it.  It was truly boring and genuinely badly acted and directed as well.  I was expecting something special based on the high scores.  Instead it is worse than average, it's just really poor."
    },
    {
      "rating": "3",
      "text": "A bit disappointed.Mayby my expectations were a bit high, but it felt like an average episode of the series. I kept waiting for something really good to happen... it didn't and all of a sudden it was the end."
    },
    {
      "rating": "4",
      "text": "ZERO tension or drama. Just Jesse on some scavenger hunt side missions and chock full of needless flashbacks, fan service, and wish fulfillment. Breaking Bad shouldn't make you feel warm and fuzzy. This is not Breaking Bad at all."
    },
    {
      "rating": "6",
      "text": "As a movie has little to say...but it works great as an epilogue for the series. A 2 hour long farewell to Jesse Pinkman, with correct execution and some emotional moments for fans. A bit underwhelming but it does its job...only if you are a fan of Breaking Bad."
    },
    {
      "rating": "0",
      "text": "as the everest of smugness, the ‘comedian’ Jerry Seinfeld, once says, reunions are never a blast. this one is no different. the only notable thing is actually the car. the el camino. all the rest is all extremely boring, totally predictable, but, mainly, completely useless. every characters looks tired, unfit, boiled. except Kristen Ritter. who’s literally shining for the couple of seconds she appears. the only other very pleasant footage is the snowy road in Alaska, which ends an agony of gigantic proportions"
    },
    {
      "rating": "1",
      "text": "The Series didn't need that end because it was so expected.Most of the movie was boring."
    },
    {
      "rating": "2",
      "text": "Anti climax ending with poor story telling,  overrated by the breaking bad fans"
    },
    {
      "rating": "8",
      "text": "El Camino is a nice ending for the fans of Breaking Bad. Aaron Paul did an fantastic job again as Jesse and the atmosphere made me miss the series again. I would like more but it we got our closure now. It seemed more like a long episode instead of a film though."
    },
    {
      "rating": "6",
      "text": "It's like a bad breaking bad chapter, but with a larger duration. Good direction, but unecesary to tell this story."
    },
    {
      "rating": "7",
      "text": "El Camino is ravishing, captivating in its every breath. A follow-up tale that keeps you strung on every beat as Jesse seeks freedom from the excess of his hell. But I wouldn't say it's the movie you expect, as it lingers far too long on flashbacks made simply to emphasize Jesse's pursuit in a film that's main story carries very little momentum for a feature length film. And the end the result just wasn't as emotionally endearing, mainly because there was not enough conflict or momentum focus between him and the police. The movie was a flachback throwback escapee film, but had Vince given us an adverserial police character, connected to the Walter White investigation months prior to Jesse's escape, it would've brought more resonance and a sense of intrigue rather than the forgettable hippies they gave us. And it would've forced the film to spend much more time in the moment than in the past. But in the end, El Camino is a breath of fresh air, a throwback and a solid Jesse Pinkman send-off tale, but it's certainly not the vivid thriller i was expecting."
    },
    {
      "rating": "0",
      "text": "I don't understand why Vine Gilligan decided to make this movie ...the only reason I can think of is to make more money from the Breaking Bad gravy train. Unfortunately, this movie ruined everything..for me at least. It was just so meaningless and dull."
    },
    {
      "rating": "8",
      "text": "Off course this site gives it less then it deserves it is a solid 8 not a 7.3 bunch of idiots."
    },
    {
      "rating": "9",
      "text": "Breaking Bad is Vince Gilligan. Vince Gilligan is Breaking Bad. There's just no other way to put it. And anyone who knows George Vincent Gilligan Jr. also knows that he'll produce pure brilliance regarding anything and everything to which he sets his brilliant mind.Breaking Bad the television show is often mentioned as being one of the greatest series of all time. Breaking Bad the movie should now be discussed in terms of being one of the greatest television-to-movie continuations of all time.Nobody should be surprised. Gilligan wrote, directed, and produced 'El Camino.' Throughout the film's masterful puppetry of drama, humor, and violence, we know it's Gilligan who is lording over it all, deftly manipulating the marionette strings.He's the reason why the show-and now the movie-exists as a tragicomedy that pirouettes at both ends of the tragedy-comedy spectrum. The same goes for David Chase's 'The Sopranos,' a show that similarly has its place on the Mount Rushmore of television. Perhaps Gilligan learned from Chase that humor makes the violence palatable and violence makes the humor essential.Regardless, Gilligan put his legacy on the line by endeavoring to make 'El Camino.' In doing so, Gilligan doubled down, wagering everything on himself. The result? Gilligan won. Again."
    },
    {
      "rating": "10",
      "text": "It’s a must for all BB fans.  Pieces of certain seasons where they might of been a gap they fill it in.  It’s a little confusing, at least it was for me I don’t have the best memory.  Really fun movie.  It’s what happened after Jessie broke thru the gates but more than that it fills in what happened prior to where he was captured by the Neo Nazi’s.  Loved it I need to watch it again.  Everyone give it a 10/10 people.  The fact they even granted us something is extraordinary.  Jessie is a badass."
    },
    {
      "rating": "6",
      "text": "[EMPTINESS]When I watched the last episode of Breaking Bad roughly two years ago, I felt a huge amount of emptiness. First, because I finished one of the greatest TV shows of all time and I felt like I lost something at that moment that was very dear to my heart. It was hard to let it go.Second, because I felt that Jesse's storyline was left unresolved and unfinished. As much as I loved the Breaking Bad finale - after all, it was cathartic, satisfying, and deeply impactful on an emotional level - in the past two years I kept wondering what happened to Jesse after his escape. I always felt that this story would be well worth telling.It looks like this lingering question was in Vince Gilligan's head too the whole time since he finishied his (near) masterpiece of a series, but he only decided to answer it 6 years after the show's original run has ended. Now, after finishing El Camino, there's one question I asked from myself. Is this story really needed to be told, and if so, was this the right way to tell it?Because the thing is, I thought that after I'll watch this movie, I'll get a real closure, I'll have a fullfilling, meaningful, and deep cinematic experience, I'll get a definitive end to a character's life and to a brilliant series. I thought that if we get a 2 hour continuation to Breaking Bad in the form of a movie after all these years, there's has to be a strong reason for that.I thought that I'll see something in the veins of Drive (to give you an example) - a movie with a high level of tension and suspense, an artistic piece of cinematic work about a person with a troubled life who is seeking for personal redemption and ultimately, is looking for an escape from his past.I expected a lot of things but I have not expected the feeling of emptiness to hit me for the third time after finishing the movie. But this is exactly what I've got. El Camino felt like a mostly pointless and lukewarm epilogue to a brilliant series, instead of something that would have elevated its brilliance to even greater heights.It was a two-hour feature film, yet it felt like there's so little happened in it. It was a movie that was almost completely devoid of any real tension. It was a movie basically about nothing. Without giving away any spoilers (it wouldn't really be possible anyway), the whole script can be summed up in one sentence. Basically, Jesse went to some places to grab some money and then he travelled to somewhere. Literally, that's it.There are so many ways this story could have been told and/or expanded, there are so many interesting plotlines that could have been explored. Or at the very least, we could have gotten a razorsharp, tightly focused suspense thriller/drama/action movie with minimal dialog and with a high focus on building tension and atmoshpere. Kinda like a crossover between Breaking Bad and Vanishing Point (or think about any great escape movie).However, what we've got instead is a movie with a lot of unnecessary padding and filler. We've got a lot of scenes that while are often good and quite tasteful, they don't really move the story forward in any meaningful way and they don't really deepen the characters any further than we've already seen them on the show. They are just there to extend the run time of the movie, in order to justify it to be a movie in the first place.Expectations can be harmful, however, I'm not actually disappointed because the movie didn't went the way I thought it would. I'm disappointed because I expected a meaningful and memorable movie that will be a worthy continuation and closure to Breaking Bad. But what I've got instead is something that while good enough, at the same time, nearly pointless, and again, it left me with a huge amount of emptiness."
    },
    {
      "rating": "4",
      "text": "I think it was overall just a movie that didnt contribute anything to the plot of the series. This movie has a runtime of 2 hours and there are literally only about 30 minutes of content that are important to the plot. It's nice to see the old characters again but overall this movie wasnt necessary since there's barely anything happening in this movie"
    },
    {
      "rating": "5",
      "text": "I enjoyed seeing my beloved characters once again on the screen, I can't deny it. But it wasn't what we were waiting for. It seems the movie has been produced just for making Jesse great again! The similar actions of Walter White in his last ours repeated this time for Jesse! The money Walt needs gets robbed, he goes and kills the robbers (however not only for that reason). The money Jesse needs gets robbed, he goes and kills the robbers. As if it was the only undone and important mission. Rest of the movie dedicated to minor reunions! Mike (we may see more of him in BCS S05, so it was enough), Todd (not so similar to Todd in BB!), Badger and Skinny Pete, Ed, Walt (the best moment of the movie was his appearance, at least in my opinion), and Jane Valar Margolis!And three more things ... 1. Skinny Pete gave Jesse his hat so that he became less recognizable, however it seemed Jesse didn't agree with him. We saw Jesse most of the time without that hat! Although all he was looking for was running away from ABQ, he didn't give much sth about being recognized! 2. How did Jesse know where was the hidden key of his parents' house?! 3. I thought Brock was the most important person to Jesse! Yes! I know! Ian Posada (actor of this role) has grown and he's not that young, but come on we said nothing about Todd, or maybe we said! But this double standard is not acceptable."
    },
    {
      "rating": "2",
      "text": "(Mauro Lanari)\"El Camino\" of BB: from \"Breaking Bad\" to \"Breaking Balls\".That's all, folks."
    },
    {
      "rating": "10",
      "text": "Whilst there is a debate for how necessary this film was for the Breaking Bad/Better Call Saul story, there is no doubt that this movie was extremely well made and could work as a stand-alone movie without the assistance of the famous TV shows. Gilligan and Paul have come together to produce something special once again, with an extremely satisfying ending that Jesse most definitely deserved. Even if some cameos may have been there for the shock-value (looking at you Walt), almost each and every character has a purpose in Jesse's story. An extremely well crafted follow-up to the original series."
    }
  ],
  "recommendations": [
    "the_hunger_games_mockingjay_part_1",
    "the_x_files_i_want_to_believe",
    "next",
    "the_hunger_games_mockingjay_part_2",
    "the_twilight_saga_breaking_dawn_part_2",
    "the_many_saints_of_newark",
    "terminator_genisys",
    "taken_2",
    "a_quiet_place_part_ii",
    "maze_runner_the_death_cure",
    "limitless",
    "maze_runner_the_scorch_trials",
    "awake",
    "rocky_v",
    "infinite",
    "pirates_of_the_caribbean_on_stranger_tides",
    "the_mountain_between_us",
    "the_new_mutants",
    "inferno",
    "vantage_point",
    "man_on_a_ledge",
    "how_it_ends",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "contagion",
    "fifty_shades_freed"
  ]
}