{"id": 3522, "title": "Elektra", "starring": ["Jennifer Garner", "Goran Visnjic"], "runtime": 97, "genre": ["Action", "Fantasy", "Science Fiction"], "description": "Elektra the warrior survives a near-death experience, becomes an assassin-for-hire, and tries to protect her two latest targets, a single father and his young daughter, from a group of supernatural assassins.", "releaseYear": "2005", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/9Azi1GBNj3gPPwmQWAMcATg7JOl.jpg", "categories": {"plot": 5.0, "acting": 4.9, "ending": 4.0, "soundtrack": 5.0, "cinematography": 2.0, "familyFriendly": 5.25, "funny": 4.0, "action": 3.4166666666666665}, "reviews": [{"rating": "4", "text": "Elektra may receive better treatment than other girl superhero movies like Catwoman or Supergirl, but it still lacks a straightforward story and good dialogue."}, {"rating": "8", "text": "Goran Visnjic and Jennifer Garner look great as a team on the big screen. I believe that if Visnjic's character had a little bigger screen-time (maybe some hidden super powers or passive ones like regenerating). The movie, as I see it on metacritic, is fairly underestimated and does not fall under the \"taking it seriously\" category. It is often underestimated and thrown away quickly.\rIn fact I believe that Electra is one of the best screen adaptations of Marvel's characters. It is similar to Jessica Jones, but not the same"}, {"rating": "3", "text": "The problem with this movie is it doesn't know what it wants to be. The first half has potential, going the way of an action-drama type film. But after the supervillians come in, it just turns into a dumb superhero film (and not just any dumb superhero film, this one attempts to redefine the meaning of the word dumb). It tries blending the two styles together but it doesn't work, they should have gone with one or the other. Also, while the story in the first half is good, the second half makes no sense and the whole thing just falls apart. The only reason to watch is Jennifer Garner."}, {"rating": "5", "text": "Pretty bad in parts but Garner does a decent job and I think Elektra is one of the better superheroines."}, {"rating": "1", "text": "COMPLETELY UnnecessarySeriously, This did need to be made, Daredevil was a bad film and this is EVEN WORSE!"}, {"rating": "4", "text": "The movie \"Electra\" starts out straight and good, cold as ice. But as it progresses, it gets torn down by terrible acting from Garner and a dialogue so obvious that you just want to cut their tongues out."}, {"rating": "7", "text": "This movie is not bad at all. I mean, what is the difference between this and a talking racoon? Nothing. Absolutely nothing. The story is maybe too much based on the comic book, the acting was good, and the directing was better than I have expected. Overall I am between 6 and 7."}, {"rating": "0", "text": "The only thing worse than \"Daredevil\" is the utterly putrid spinoff it spawned.  Makes \"Spiderman 3\" look like solid gold."}, {"rating": "2", "text": "Difficult story with Elektra, other amazing character, but the film is terrible, the only good parts are the action scenes, but this film have much mistakes. Elektra is terrible."}, {"rating": "6", "text": "it came this close, but its not a bad movie."}, {"rating": "5", "text": "This came out during a bad time for Marvel when they were putting out terrible movies like Hulk and Daredevil, while this is the best of them, it's still just a mediocre movie with a bland plot, and bad acting, this is one of those movies that are so bad there good, I'm not really sure if I liked this or not, but if you like Marvel there is a chance you may like this just don't expect greatness."}, {"rating": "9", "text": "when i first watched this, i didn't know much about marvel's different superheroes. now growing up, I can definitely say that in the line of superhero movies in between 2003-2005, this was my favorite and definitely better than Daredevil."}, {"rating": "7", "text": "Elektra. Silent killer in red. Unremarkable and the most ordinary superhero movie. On the plus side, you can highlight the stunning red Jennifer Garner suit and pretty good effects."}, {"rating": "3", "text": "It's amazing how many levels this movie sucks on. It's probably one of the worst Marvel Comics superhero movies ever made since it's release in 2005!!!!!!!!! Almost nothing is good about it. It has bad acting, bad dialogue, stupid villains, it's occasionally boring, and the plot doesn't really work for a superhero movie. The only thing that's good about this movie are the action scenes. But unfortunately, one good thing can't save this movie."}, {"rating": "6", "text": "This movie had lots of nice action and starred Jennifer Garner. This movie was fairly interesting to watch and considering the fact I am not a comic book fan this movie in-itself kept me entertained."}, {"rating": "8", "text": "I held off seeing this because Daredevil was so bad, but I actually ended up really liking it. I think the acting and story and great and there will be a sequel for sure!"}, {"rating": "10", "text": "I tought elektra was the best movie ever made and i dont want your opion elektra is the best."}, {"rating": "2", "text": "Elektra is Kill Bill on quaaludes."}, {"rating": "2", "text": "Garner is not Elektra! I know she is doing the best she can, but she just isn't the character in any shape sense or form. This is perhaps the worst casting choice ever! Again, I have to say, why didn't Michelle Rodriguez get this role?\r As to the movie: The plot is weak, the characters are mere shadows of their comic counterparts. The effects, locations and camera work are actually pretty good.\r Overall:\rA clear licence cash in trying to rake off of Daredevil's \"success.\" This movie is garbage from beginning to end. It may look pretty, but that doesn't even come close to redeeming it. If ever there was a movie I would say \"Don't watch this,\" then this would be it."}, {"rating": "7", "text": "This is a rather corny superhero movie but not too corny. Jennifer Garner plays the part well and just as good as she did in Daredevil. It's pretty simplistic and there isn't too much substance to the storyline, but visually there is enough here to enjoy. The fight scenes are pretty fun and the characters are likable enough. I know it coped a lot of slack for being a bad superhero film, but I think it works and has just enough cheese to still be enjoyable which is why I watched it again."}, {"rating": "0", "text": "This comic book movie is an inert muddle that takes itself much too seriously.\rOffers no surprises, and whether or not you'll appreciate its modest charms depends entirely on whether you too have been anticipating Garner's new outfit."}, {"rating": "3", "text": "Uninteresting, uninspired, and just wholly unnecessary, Elektra is a painfully predictable spin-off of an already mediocre Daredevil film, that despite some decent fight scenes, is full of lifeless acting and bland dialogue."}, {"rating": "1", "text": "Boring, god awful movie. It's on par with Catwoman and Batman & Robin. Even Garner's performance was pretty bland."}, {"rating": "2", "text": "It's a terrible movie, but I give those who made props for trying to make an artsy martial arts movie out of it. But it lacks the one thing that made Daredevil (in my opinion) enjoyable. Daredevil was a gritty action flick. it wasn't Sin City or Batman Begins gritty, but it was still gritty. There was a review that I agreed with most, and it wasn't recorded in metacritc. It was a plasma magazine, saying that it could've been a great, gritty, gory, and R-rated action flick, and it went with fantasy. That, other than the lame effects, action scenes, and performances, is what ruined the movie."}, {"rating": "2", "text": "This film is one of the dumbest spin off films of all time. Its probably the dumbest spin off movie of all time. It takes you from the relative highs of Daredevil to a world so completely different its hard to contrast the two. However the fact that Elektra links to Daredevil in the early moments implies it wants you to think about it. However because they differ so much its almost impossible to enjoy Elektra because its world is so remarkably stupid in comparison, it may be accurate to the comics (I don't really know the source material) but from where I was sitting it was just dumb, lifeless, unengrossing and slow."}, {"rating": "1", "text": "Far from a Greek but a tragedy all the same. This film is positively one that is simply not interesting, I have yet to have been able to watch it in one sitting.  The one character I was excited to see was Typhoid Mary and her role was reduced to a Poison Ivy knock off."}, {"rating": "4", "text": "Elektra: 4 out of 10: When people said Jennifer Garner, as Elektra, was the best thing in the movie Daredevil. I'm pretty sure they were mostly damning with faint praise. After all Jennifer, while certainly an attractive female, came across as a sorority pledge playing dress-up on S and M rush night.\r In Elektra she looks even more ridiculous. There have been plenty of great female assassins over the years from the camp of a Bond villain, to the seductiveness of Linda Fiorentino, even the girl next-door deadliness of Bridget Fonda in Point of No Return. Female assassins are a wonderful staple of filmdom, seductive yet deadly. Garner is neither. \"She looks like she is thinking of puppies,\" claimed one reviewer I read and I concur. If the Smurfs were X-rated ninja's, then Garner would still be miscast in Smurfette: Deadly Blue.\r Her costumes certainly don't help her cause. You almost have the urge to tell her to put some clothes on and bright red Victoria Secret lingerie just doesn't scream stealth or deadly. Lord knows the rest of this mess doesn't help Garner either.\r While Terrance Stamp can do no wrong every else seems either miscast or afraid of stealing Garner's thunder. Add on poor special effects, villains that turn into family friendly yellow smoke when killed, ninjas that crash through windows like Army rangers, gas stoves that explode like nuclear weapons, laundry fu, Japanese villains out of a World War 2 propaganda film and my personal favorite the warmest Christmas in Canadian history.\r The movie clearly takes place in the northwest United States or Vancouver. The days are long, everyone is in short sleeves, and Garner takes recreational swims in the lake. (Canadian Lakes are notoriously cold even in August mind you) So when a cherub faced character asks Garner over for Christmas dinner Elektra isn't the only one surprised.\r Garner is sexy but when it's time to kill she should either get dressed or let the grown-ups take care of things."}, {"rating": "3", "text": "אני לא מכיר את הדמות של אלקטרה, אבל הסרט היה ממש גרוע וממש לא מובן למה החליטו לתת לה סרט אם היא הייתה גרועה גם בדרדוויל. לא מומלץ לראות ממש משעמם"}, {"rating": "4", "text": "While I like some characters and parts of the story I must admit that it is not a good movie nor in the so bad it is good category. Many said this harmed female superhero movies for years and I think they are right. As if there is a secret rule in Hollywood that these movies need a bad script, a weak story and some poorly written characters. I think of the even worse Catwoman movie and the Supergirl 1984 movie is also some of the best additional examples. Exceptions are the great Wonder Woman 2017 and the excellent Wonder Woman 2009 animated movie (The animated movie is a hidden gem). They both have well written characters, an engaging story and immersion. Lets go back to this movie: After the events of the Daredevil movie Elektra is taught the ancient art of Kimagure that gives her a set of superhuman abilities (Chi or Chakra based) and starts working as assassin. Years later she gets a contract that will challenge her in ways she did not imagine as she still has a code of honor and emotions. So far not a bad story but foreseeable and generic. I could predict nearly everything from miles away as they heavily use tropes, cliches and staples that are common because other movies / medias used them before ( a lot). Then there is the acting. Jennifer garner is excellent but cant turn the tide or defeat the bad script. A great performance in a bad movie. The other actors do their jobs and I think the script weakened the performance also as this movie had is moments. For clarification it is often that I had disbelieves of the story and though that many scenes can be improved. This is not a good sign. Someone said that you can get away with many things if a movie is engaging and immersive. It it is foreseeable or boring the watchers will search for errors, mistakes and think about failures in the structure of events and characters acting weird. Lets say the acting is as good as it can be in a script that needs improvement. I will not blame actors for bad writing. The fight scenes are however good but also nothing you will remember.  Overall this is the kind of movie were I see potential for a great experience. The script is the worst villain in this story. While it has it moments it is not worth remembering and I am a fan of Jennifer Garner since Alias. Watchable once but nothing to remembered with exception of Jennifer Garners performance."}, {"rating": "8", "text": "I love the aesthetics of the film, the acting, the script. It just has nothing to do with the heroine of the comics hahaha. But other than that, it's a movie that works, I would like it to continue the story and the characters. With beautiful art direction and photography in other films for the series."}, {"rating": "2", "text": "Girl power? I think not. Jennifer Garner tried her best, but she can't save Elektra from being a puny-sized, adorable film that no one even manages to care about after the next day passes."}, {"rating": "4", "text": "I have never understood the appeal of Jennifer Garner as an action/adventure star. Based on my limited exposure to her work, she's better in comedic or lightly dramatic roles (such as her turn in 13 Going on 30). Nothing that happens in Elektra has changed my mind. Although Garner was arguably the best thing about the lukewarm comic book adaptation of Daredevil, her character had limited screen-time, playing fourth fiddle to Ben Affleck, Michael Clarke Duncan, and Colin Farrell. The translation from supporting character to lead doesn't go smoothly. Garner has difficulty carrying this movie, although the weakness of the script could be part of the reason.\r Instead of following the usual superhero path of the protagonist trying to stop a diabolical villain from taking over the world (or some similarly grandiose goal), Elektra goes all metaphysical on us. It seems that we have reached a key point in the endless battle between good and evil. A Chosen One has been born and both sides want her. Evil is represented by \"The Hand\" - a bunch of Japanese bad guys who have cool powers and disappear in a puff of green smoke when they are killed. Good is represented by the film's resident Yoda/Mr. Miyazaki, Stick (Terence Stamp, who played the super-villain Zod in Superman II) and his reluctant pupil, Elektra (Garner). She isn't done with her training yet, so she's not a real Jedi, and the dark side of the Force beckons… Oops, sorry, wrong movie.\r \"But, wait,\" you say, \"Elektra died in Daredevil.\" That is a correct observation, but in films like this, death is only a temporary inconvenience. Characters return from beyond the grave as often in comic books as they do in soap operas. It turns out that Stick can manipulate time and revive the dead. Elektra starts out her second life as his apprentice, but is eventually kicked out of paradise. Instead of seeking out Ben Affleck (at least on screen), she becomes a paid assassin (imitating what he did in Gigli). It's after she turns down a job to kill Mark Miller (Goran Visnjic) and his teenage daughter, Abby (Kirsten Prout), that she runs afoul of The Hand. They have decided that if Chosen One Abby won't join them, they'll eliminate her from the equation. When Elektra becomes Mark and Abby's accidental protector, she ends up headed for a confrontation with the evil sorcerer/swordsman Kirigi (Will Yun Lee) and his henchmen, Tatoo (Chris Ackerman replacing the late Herve Villechaize), Stone (Bob Sapp), and Typhoid (Natissia Malthe).\r There's really only one good action sequence in all of Elektra, and that's the climactic battle between the title character and her nemesis. Director Rob Bowman borrows techniques from Hong Kong martial arts duels for this fight, but their integration is sloppy. Zhang Yimou (Hero, The House of Flying Daggers) might have been able to do something with all of the dancing sheets, but Bowman's use of them is merely confusing. This one-on-one struggle has plenty of high-energy moments, but the resolution is unsatisfying. When it was over, my underwhelmed reaction was, \"Is that it?\"\r Elektra contains plenty of intriguing elements that are left unexplored. Except for an occasional quip, we never learn much about her death experience. The character is afflicted with an obsessive/compulsive disorder, but this turns out to be a personality quirk that is discarded when it doesn't play a role in the storyline's resolution. All of the human relationships (Elektra/Stick, Elektra/Abby, Elektra/Mark) are underdeveloped. I think there's supposed to be some sort of romantic attraction between Elektra and Mark (after all, they kiss twice), but actors Garner and Goran Visnjic (on a break from \"E.R.\") never connect.\r Elektra is one of the least effective comic book-to-movie stories to have come along in the past few years. Without a viable screenplay, there's nowhere for the character to go, and no way to avoid making her look silly. Garner looks elektra-cute in red, but I should not have been thinking about the impracticality of that outfit as assassin's garb. Involving movies banish such thoughts; Elektra encourages them. When a comic book movie fails to grab its audience, it is apt to come across as excruciatingly dumb. That description applies to offerings like Catwoman, The Punisher, and Elektra. This movie is better than the other two, but that's not company in which any self-respecting superhero would want to be included."}, {"rating": "3", "text": "I loved Daredevil But this one is just truly awful in almost every single thing."}, {"rating": "2", "text": "don't look for your opponent..ElektraElektra lacks every ingredient that a comic-book movie contains or even a movie for that matter, as it is flat out exhausting from the top."}, {"rating": "7", "text": "Jennifer Garner returns as Elektra, a lethal synthesis of grace and power with the mystical power known as kimagure: a limited ability to see the future. She has purposefully severed all ties with the world and lives only for her next assignment. Elektra's latest job forces her to make a decision that can take her life in"}, {"rating": "3", "text": "This movie is not favorable marvel movie! I do not like this movie! All MCU movies are way better than this movie!"}, {"rating": "2", "text": "What a big pile pieces of sh*t, Elektra just got everything's wrong, it's awfully boring story, with a horribly written and developed character, and terribly boring fight, this movie is a complete failure, it's simply one of the worst movie i've ever seen, it's the worst spin-off movie i've ever seen, and it's the worst comic book movie i've ever seen so far and probably will ever will be."}, {"rating": "7", "text": "the introduction narration was weak but the opener scene 2:30-7:10 still is the best scene from any anti hero movie. that scene alone perfectly capture frank miller's elektra how mysterious and how she known as a myth that lurk in the shadows. J.Gard was soo perfect but was wasted in the rest of the movie. the whole movie should've been taken place at night. i loved her all red outfit and it even paid homage to ultimate elektra when she wore all white, the problem becomes when the writers zak penn, stuart zicherman & raven metzner for creating non existing comic book characters that's made only for this movie characters like Abby Miller, Mark Miller, Roshi, Kinkou, Meizumi in an incredibly flawed incoherent scriptand making Stone a villain, gender swapping Nina McCabe by making her into a male character only using the character last name McCabe and should've kept Ben Affleck as Matt Murdock/Daredevil scene. I only gave this a 7 score rating only bcuz of how good the opener scene is. the movie shot itself by trying to build a story around non existing characters instead of maintaining the supernatural mysterious and myth setting that it build up rather than trying to create artificial connections to the created characters that u don't care about. this movie should've had Radioactive Man as elektra's main villain since they're enemies in the comics. it could've played off of the idea of resurrection and greg rucka's 03 elektra comic: (Elektra is forced to confront her murderous past after being taken hostage by an adversary. Feeling desperate in her containment, Elektra must choose between continuing her homicidal professin or making an attempt to change her life.) that would've been a far more impactful story then what we've ended up with. ppl are right about this movie doesn't know what it what's to be it's all over the place. bcuz this movie should've been a spin off sequel to daredevil that shows what took place after the events from '03's daredevil. i do enjoy J.Gard's elektra but the bad, outweighs the good. too many shortcomings too many subplots and boring unoriginal created characters that the story surrounds itself with brings this movie down and latch itself onto this movie like a tumor. J.Gard tried to do the best that she had to work with and even she knew it was a bad movie and admitted during the world premiere of this movie. the writer and fox wasn't even confident of the very movie that it's spinning off from why bring back MSJ the director of '03 Daredevil to write this movie and isn't even confident in his own work and advertising it as \"from the makers that brought u x-men franchise\" instead of the director from daredevil it's no surprise that this movie turn out the way that it did i love J.Gard from '03 daredevil and she showed her potential at the start of this movie but was wasted in the rest of it.so overall it should've had a better main villain, the setting should've always taken place at night to keep the mystique, and mysteriousness of elektra, the writing after the opening scene was over was cringe and a chore, the created characters for this movie was a plot device and unappealing, and less that was told about elektra could've also be something that this movie could've benefited from and this movie should've had kept affleck's daredevil scene so it can feel like it's a in the same universe but this movie feels so disconnected, so to sum it up this movie was directionless filter that's so disjointed with Garner and her character being wasted. I hope she gets a second chance, and the blame shouldn't go on her she did the best that she could, however it doesn't matter how good of an actor and actress u are, u can't make a bad script and awful movie good, no matter how good u are. the blame Soley goes to: rob bowman, zak penn, stuart zicherman & raven metzner and 20th century fox."}, {"rating": "4", "text": "The fight scenes are serviceable, but nothing too special. What little we learn about the backstories and the universe we are in is painfully generic and Garner's performance is let down by a poor script."}, {"rating": "2", "text": "The best thing I can say about Elektra is they tried. They tried to make a simple, stand-alone, story focused movie. They failed spectacularly, as the movie is a complete bore, but they tried. It's more than I can say about a lot of current superhero movies. Jennifer Garner, who is a fine actress, is still miscast in the title role. Though, she and Kirsten Prout do play well off of each other. Furthermore, action scenes are poorly staged, and horribly edited. It's impossible to tell what's going on."}, {"rating": "4", "text": "Marvelous Jennifer Garner in Floppy Marvel’s Movies Era?!Back then, Marvel Studio's reputation didn’t marvelous as right now even though they hire a great leading cast, Jennifer Garner. She plays Elektra which prodigy child and an urban legend of a legendary woman that could stop the ancient war – the good vs the evil. She possesses magnificent skills in hand-to-hand combatant, skillful weaponry, and incredible human sense – almost like a sixth sense. Even, sometimes, she could see the future in a glimpse. The main plot is narrating Elektra's struggles from a blurry POV about her fate and messy life – as an assassin and loner. Then, there is a fateful moment from her assassination duty that changes everything.The only pros are Jennifer Garner’s performance which marvelous. Her actings, athletic body, and beauty are the only thing that entertains the audience. Besides that, everything is very miserable – it’s really hard to believe if compared to current Marvel movies. Lack of storyline, visual quality, and even barely to entertain us. The storyline always jumps from one to another very quickly. The visual quality seems every picture is the same, dull, and monotonous. As an audience, I began to understand why this movie rating was so bad as entertainment. The only entertaining aspect is Jennifer Garner’s performance.Overall, my POV, big thanks to the marvelous Jennifer Garner’s performance that tried to cover the floppy quality of Elektra (2005) but sadly it still failed. The failures of this movie prove that Marvel Studios couldn’t deliver a great spin-off from Daredevil (2003). However, they deliver another proof, Jennifer Garner's performance is marvelous. It’s still worth watching if wandering how Marvel Studios movie quality in back old days."}], "recommendations": ["fantastic_four", "suicide_squad", "seventh_son", "fantastic_four_rise_of_the_silver_surfer", "jumper", "daredevil", "aquaman", "x_men_apocalypse", "captain_marvel", "thor", "x_men_origins_wolverine", "the_last_witch_hunter", "bloodshot", "i_am_legend", "project_power", "hercules", "sin_city_a_dame_to_kill_for", "the_karate_kid_part_iii", "shazam_fury_of_the_gods", "black_panther_wakanda_forever", "the_departed", "justice_league", "lucky_number_slevin", "the_old_guard", "the_equalizer"]}