{
  "id": 3526,
  "title": "Elf",
  "starring": [
    "Will Ferrell",
    "James Caan"
  ],
  "runtime": 97,
  "genre": [
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "description": "When young Buddy falls into Santa's gift sack on Christmas Eve, he's transported back to the North Pole and raised as a toy-making elf by Santa's helpers. But as he grows into adulthood, he can't shake the nagging feeling that he doesn't belong. Buddy vows to visit Manhattan and find his real dad, a workaholic publisher.",
  "releaseYear": "2003",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oOleziEempUPu96jkGs0Pj6tKxj.jpg",
  "categories": {
    "plot": 8.538461538461538,
    "acting": 8.214285714285714,
    "ending": 7.6,
    "soundtrack": 7.0,
    "cinematography": 7.0,
    "familyFriendly": 7.6,
    "funny": 7.3428571428571425,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "GREAT FILM! it was funny and a perfect christmas movie to watch some parts of the movie are just too funny. Will Ferrell plays the part of elf really well."
    },
    {
      "rating": "9",
      "text": "Loved it. Christmas movies usually disappoint me, but this one, this one was actually good. The characters are well developed, the plot is interesting and Will Farrell and Zooey Deschanel make it even better. Very good movie."
    },
    {
      "rating": "8",
      "text": "Just wonderful! It has just the correct amount of comedy, emotion, and magic to make it a great Christmas movie to see year in and year out. Perfect for the holiday season."
    },
    {
      "rating": "10",
      "text": "Elf, The Santa Clause, and Home Alone. Those are the three real Christmas classics since 1990. Will Ferrell's performance is so great, it's not only a kids movie, but an everybody movie."
    },
    {
      "rating": "8",
      "text": "Hilarious Christmas movie for kids and adults. There's a lot to enjoy, but above all, the Crown Jewel of the movie is Will Ferrell's delightfully manic performance. He was energetic and quirky with priceless facial expressions and just as witty and likeable as you'd expect from him. The movie successfully avoids dipping into schmaltzy and sentimental territory like most Christmas movies do and the whole cast seem to be having fun. Overall, this is a fun, memorable Christmas movie that deserves a spot among the classics."
    },
    {
      "rating": "9",
      "text": "One of the best Christmas movie ever. Home Alone, The Grinch, Charlie Brown, and this are the best movies for Christmas. The story and jokes are amazing and are even good if you watch it multiple times."
    },
    {
      "rating": "7",
      "text": "A great Christmas film that I think is an obvious must watch. It's definitely the film to get you in the Christmas spirit, even in 2020. The film has a lot of hidden messages that some people will realise. One being about love and how its importance at this time of the year. Another is how you shouldn't put yourself down and how you should always put your foot forward instead of a foot backwards. These little messages are hidden with character personalities and relationships, all what make this film special. You can't deny it's one of the top and most watched Christmas films of all time, and for that I respect it highly."
    },
    {
      "rating": "10",
      "text": "Divertentissimo."
    },
    {
      "rating": "5",
      "text": "Will Ferrell gave a funny performance in this movie. However, the story seems WAY too shallow, and, overall, it's not a very funny movie. You'd be better off watching one of the older, more superior Christmas movies like Jingle All The Way and A Christmas Story."
    },
    {
      "rating": "8",
      "text": "For a movie that has been around since 2003, Elf has a bit of originality in its humor but even some of the humor it contains has still not aged well. Despite minor issues about its humor, this movie has a bit of heart to be found within its story since it's straightforward and spends time developing characters that are very crucial to character development."
    },
    {
      "rating": "10",
      "text": "This is one of the most hilarious Christmas classics ever written. I absolutely loved every minute of it. It was also a movie that kids, teens,and parents will all enjoy!"
    },
    {
      "rating": "3",
      "text": "The ending was terrible. Weak plot/storyline. Some parts were funny but overall the movie was bad."
    },
    {
      "rating": "7",
      "text": "It's good enough to entertain you so it's worth a watch."
    },
    {
      "rating": "10",
      "text": "I love Elf. It is definitely one of my favorite Christmas movies. The jokes are hilarious!!! Will Ferrell plays Buddy the Elf so well. This movie is also a great family movie. I also get a lot of nostalgia from watching this movie.\r Acting: 9.5\rJokes: 10\r Total: 9.75 (rounding it to 10)"
    },
    {
      "rating": "3",
      "text": "Will ferrel is a  funny in anchorman and the campaign   . but this movie stinks . it is funny but it is gay like turbo the snail and free birds .   it is the Christmas movie i have ever seen"
    },
    {
      "rating": "7",
      "text": "Elf isn't a perfect Christmas movie, but it was sweet and charming with a great cast. The script can be a little too fluffy and unfocused sometimes though, while the pace occasionally lags and some jokes such as Buddy eating the sweets felt forced. However, it does look terrific, with the locations striking and the cinematography very nice. The soundtrack is a nice addition too, it made me nostalgic and all the more ready for Christmas. The story while simple and a tad predictable is at least original and well-meaning, while the direction is credible. The cast is what gives Elf its staying power and charm. Although I am not a fan of Will Ferrell, I think he really shone here as Buddy, while Zooey Deschannel is beautiful and a huge part of the film's charm, James Caan is a suitably gruff father-like figure and Bob Newhart is wonderful. All in all, it is a sweet film if you forgive the slightly cliché ending, by all means not for all but the cast do save the day. 7/10 Bethany Cox"
    },
    {
      "rating": "8",
      "text": "Elf is a really great Christmas movie; one with lots of laughs that will keep you wanting to rewatch it every holiday season. Will Farrell is great in it as well as the rest of the cast and their performances. It is a Christmas classic everyone should see at least once."
    },
    {
      "rating": "8",
      "text": "excellent xmas comedy, and surely a future classic. the only movie ive ever seen with will ferrell, so dont judge! might seek out a few more, although unsure if any of his other output also hits the right mark. will stay optimistic! lol.. anyone that dislikes this movie however surely should stay away from this particular genre altogether. perhaps not 'laugh out loud' amusing for a comedy, but its not really designed to be.. theres actually a reasonable xmas plot in there, and it wears its influences on its shoulders with pride! recommended."
    },
    {
      "rating": "7",
      "text": "Very enjoyable, funny at alot of moments. But the ending falls apart."
    },
    {
      "rating": "9",
      "text": "This is one of Ferrels more funnier movies. A hell of a lot funnier then \"Talladega Nights.\" This movie made kept me and my brother lauphing for hours. Buddy is so funny and oblivious to how to behave with the people in New York.Had a great sense of humor, I would love to have Buddy the elf as a brother or a friend."
    },
    {
      "rating": "9",
      "text": "Definitely one of those Christmas films (which you really do have to remember that it is) that can be on each year and not become tedious. Each laugh is still as fresh as the first."
    },
    {
      "rating": "6",
      "text": "Elf is a decent Christmas movie for children. It has a good amount of Christmas cheer and a fair few laughs. A little bit more of Ferrell insanity would have been more appreciated, though."
    },
    {
      "rating": "6",
      "text": "Without a doubt, Will Ferrell's finest effort to date. There are warm moments but not enough to necessarily make this one a Christmas-classic. Regardless, you're bound to smile at least once or twice."
    },
    {
      "rating": "4",
      "text": "Elf is a sad piece of material. Will Ferell does his best to save the movie but becomes extremely annoying with his tactics. A childish, stupid movie with a few laughs here and there."
    },
    {
      "rating": "8",
      "text": "Elf is jam packed with Christmas spirit, making it an instant must watch for the holiday season. It's also  heart-warming, hilarious, quotable and (thanks to Will Ferrell) lovable."
    },
    {
      "rating": "7",
      "text": "Generally Favorable"
    },
    {
      "rating": "10",
      "text": "Possessing what might just be Will Ferrell's greatest performance, \"Elf\" is an irresistibly adorable comedy, stuffed to the gills with hilarious holiday cheer and affecting human pathos."
    },
    {
      "rating": "9",
      "text": "What a great film this turned out to be! It delivered a truckload of laughs that could appeal to anyone, interesting characters, a heartwarming Christmas plot, and zany Looney Tunes-style sight gags! Overall, Elf is a must see for the Christmas season, and even any other time of the year!"
    },
    {
      "rating": "7",
      "text": "Elf is outright hilarious, unlike some other 2000's Will Ferrell duds (Talladega Knights, anyone?) The sheer innocence Ferrell gives Buddy the elf just elevates the character and reminds us of when we were like that. All of those who didn't like the movie, \"you sit on a throne of lies!\""
    },
    {
      "rating": "9",
      "text": "\"Elf\" is pretty iconic, and why not? It's got the Christmas cheer, it's hilarious, it's charming and Will Ferrell provides an amazing performance as Buddy the Elf. There's no two ways about it, \"Elf\" is truly a great film that should definitely be viewed during the Christmas season."
    },
    {
      "rating": "6",
      "text": "Elf is decorated with spirit.\rElf is simply a fun loving and heart warming comical film about a man raised as an Elf who searches for his biological father. The movie succeeds with its one-liners and quarks to make a good holiday film."
    },
    {
      "rating": "8",
      "text": "Elf is one of those movies that is made or lost by the strength of its lead. Luckily, Will Ferrell plays the role of Buddy with so much energy and passion it's impossible not to like him. While the supporting cast is bland and some scenes fall flat, Elf is an instant holiday classic due to its jokes, which almost always hit bulls-eyes, it's innocent premise, and the warm fuzzy feeling that a good Christmas movie provides.\r 8.3/10\r Follow me on twitter. @cbeers2513"
    },
    {
      "rating": "8",
      "text": "With a film like this, you can't just watch it during Christmas, but during all times of the year. Elf proves to be the best holiday comedy since Bad Santa. With both laughs and feelings that move you heart towards the screen and not to the exit."
    },
    {
      "rating": "7",
      "text": "The movie is predictable but he has his laughs.Will Ferrell is really good in his role of a human adopted by elfs who returns in the city.Zooey Deschannel is good but not REALLY good in her role.The humour is childish and the special effects are bad but it's watchable."
    },
    {
      "rating": "10",
      "text": "This is my automatic go to movie if  nothing else is on TV! I love this movie and no matter what time of year this movie will bring you Christmas cheer, its just so funny, and it's just one of the ultimate feel good movies!"
    },
    {
      "rating": "10",
      "text": "A sure thing in our household every Christmas.  Charming, hilarious, cute, and full of Christmas cheer.  Will Ferrell is always an instant laugh for me and all he has to do is spit in a can and I am rolling on the floor peeing my pants.  Bye Buddy, until next year."
    },
    {
      "rating": "8",
      "text": "Funny, original, and well directed. One of the few movies that I actually like Will Ferrell as a main lead. He is fresh, fun and oblivious. If you like Christmas movies, this will not disappoint."
    },
    {
      "rating": "9",
      "text": "I was five years old when this movie came out. (I know my user-name probably gives that away already) and my parents took me to see it. The fact that I was able to remember certain scenes of the film (especially when Elf breaks off the little ice berg and leaves the North Pole) proved to me that the movie is a memorable work of Christmas magic that viewers ages 5 & 45 can both enjoy whole-heartedly. But what does one scene prove anyway? So I watched the film again just this past Christmas and I'll admit I was expecting some vulgarity (I didn't see the PG rating). What I received instead is basically what I remembered from my childhood; a fun, comical movie produced by clever story writers and acted by a collaboration of talented actors. I especially love Will Ferrell's talent, and how couldn't you? He plays his part as the innocent elf protagonist exceptionally flawless. The irony in the film is also quite clever and you'll agree once you watch the movie. I recommend Elf to anyone of any age who wishes to sit down (preferably with some hot chocolate and gingerbread cookies) and watch a family fun Christmas movie. Heck! You can watch this movie any time of year; it's season-less. And that is how Elf goes down in history."
    },
    {
      "rating": "6",
      "text": "Elf is a very overrated film but it's a fine heartwarming film to watch on Christmas    ."
    },
    {
      "rating": "7",
      "text": "Great film. Timing is perfect. Falls short of being heart felt but still enjoyable for any age. A must see film."
    },
    {
      "rating": "4",
      "text": "A Chaotic Christmas.ElfFavreau's take on Christmas does exactly what such feature demands, a lot of magic, a lot of love and a whole lot of innocence flooding across the screen. The first act being of course dipped in irony, as a whole new magical world is projected where most of the jokes are pulled out from the fact that there is a variation in their bodies compared to our protagonist. And this is a theme that never does and would end, from visiting a new city to street, jumping in on new lifestyle, every aspect of it is being mocked at through comparisons.The rest of the structure is familiar, with antics that helps advance the storyline, the humor is never offered in extreme, there is a broad smile on your face throughout the journey; this is Favreau's big win, gullible in its own world and characters, a film has never been so satisfied with itself. As far as gags are concerned it can easily be left to Ferrell himself. His knack of eating too much sugar, his physical comedy, his way of dancing and picking up the phone by saying, \"This is Buddy Help. What is your favourite color?\"; it all bodes well.His commitment of pinning himself down to that amount of childishness is what fuels this film. Favreau has few ideas on his minds that makes him push the boundaries on an emotional level, unfortunately this is where the film gets dodgy, there is very little art for them to draw out the emotions. Favreau should have known better to keep the film light and breezy, for that is where the film shines, a happy go lucky attitude is what it thrives upon. Elf has more human in him, it lops off few taboo subjects, and give you a decent simpler miracle."
    },
    {
      "rating": "10",
      "text": "10/10 starsIt isn’t Christmas Without Buddy the Elf    Jon Favreau's movie “Elf” is an amazing movie describing the adventures of a human raised by elves in the north pole, searching for his real human father. Buddy, the main character, goes on all sorts of wacky adventures throughout the story. The story of Buddy the elf is heartwarming and adventure filled. His crazy personality and goofy antics will definitely serve you a good time.    In the movie, Buddy is just a young orphan before he ends up in the North Pole. He grows up believing he is an elf, but always wondered why he is so much bigger than a normal elf. He eventually finds out the truth by mistake causing him to have a whirlwind of emotions. Buddy sets off to find his real father, after he finds out the truth, only to find out his dad is on the naughty list! When Buddy finally makes it to New York City, where his father lives, he goes on a mission to locate him. Buddy eventually finds his father but doesn't get the reaction he anticipated. He is distraught but doesn't give up. By the end of the movie, with some help from christmas magic, he lives happily ever after with his new family .    The story of Buddy the elf has a lot of different characters that affect the story in different ways. All of these characters however, help build the story to what it became. The story wouldn’t be the same without anyone of these characters. The way that  Buddy reacts to these characters is very amusing to watch, sense he is new to this human world. One of Buddy’s most famous quotes from the movie is “You stink! You smell like beef and cheese, you don’t smell like Santa.”. This is Buddy’s reaction to the fake santas we often see in different stores and malls. When Buddy see’s “santa” he gets all giddy and excited. Quickly however, he finds out the truth and ruins it for the customers and the children inside the store. As you can tell, Buddy still has to learn a few things about Christmas in the human world.    I really enjoyed this script/movie. The reason being that it fit my sense of humor. It had corny jokes and interesting choices for Buddy’s actions. A good quote for this movie would be “You’ll find life is still worth while, if you just smile.”-Charlie Chaplin. The reason why i chose this quote is because in the movie one of Buddy’s favorite thing to do is to smile. He smiles when his dad doesn't want him or his brother doesn't except him. He smiles the pain away. Eventually, they both accept him for who he is. Which is good. His personality just seems so happy-go-lucky and care free.    In conclusion, “Elf” is a Christmas movie classic. If you ever need to just get in the Christmas spirit, you will need to watch Buddy the elf’s crazy adventure. This movie is overall great from the plot development to the characters within the story. But one thing is for sure… everyone loves Buddy."
    },
    {
      "rating": "9",
      "text": "Will Ferrell stars in this festive comedy directed by Jon Favreau. Brought up by Santa (Edward Asner) and his elves at the North Pole, Buddy Hobbs (Ferrell) has spent the last 30 years happily working in Santa's toy workshop and believing he too is an elf. But when his ungainly size starts to cause problems in the elf-sized workshop, Santa suggests that Buddy head to New York City to find his biological father, Walter (James Caan). Once there, Buddy struggles to fit in in the Big Apple and finds himself in all sorts of scrapes as he tries his best to spread Christmas cheer wherever he goes.http://www.cosio.co.uk/"
    },
    {
      "rating": "7",
      "text": "La trama es buena, además, la interpretación de Will Ferrell es excelente; la recomiendo mucho."
    },
    {
      "rating": "10",
      "text": "In my opinion this is the best Christmas movie ever made. Its so hilarious that you laugh throughout. If you havent seen this, i highly suggest that you do."
    },
    {
      "rating": "8",
      "text": "Elf is a lot better than I remember. I haven't watched much of Will Ferrell, but I have heard his carrier is kind of similar to Adam Sandler's. This is a good movie though. Elf is probably one of the best Christmas movies. For the majority of the movie Elf is really funny. All of the fish out of water jokes land, and I love them all. The only thing holding this movie back is near the end they made some, questionable decisions to say the least. Mainly with the getting the sleigh up and running, and of course the central park rangers. Take the rangers out it makes no difference. I mean that was terrible. Elf has really funny scenes and is one of the best Christmas movies, but it makes some bad mistakes late. I give ELF a 8/10 and a B+."
    },
    {
      "rating": "8",
      "text": "There's not much that I have to say about this movie really, but it is a delightful Christmas film filled to the brim with holiday spirit that makes the cut of the few Christmas films that I watch each time the season comes around."
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●●¡●¡●¡●¡●¡●¡:;:;:;:;;;;;::::;;;;:::;;;:;:;:;:;:;:;;:;:;:;:;:;:;:;;::"
    },
    {
      "rating": "8",
      "text": "\"Elf\" successfully captures the essence of a children's holiday story to life. The loose plot is not the focus here. If questions about the plot are raised, it may suck your enjoyment out of this film. What makes \"Elf\" so enjoyable are its funny jokes, embracement of the Christmas holiday, and Will Ferrell giving one of his best performances as Buddy (the elf), the titular character. In fact, if anyone else played this role, the film would not have been as strong."
    },
    {
      "rating": "8",
      "text": "----------------------------------8.4/10-----------------------------------"
    }
  ]
}