{
  "id": 4539,
  "title": "Eli",
  "starring": [
    "Charlie Shotwell",
    "Lili Taylor"
  ],
  "runtime": 98,
  "genre": [
    "Horror"
  ],
  "description": "A boy named Eli with a rare autoimmune disorder is confined to a special experimental clinic for his treatment. He soon begins experiencing supernatural forces, turning the supposedly safe facility into a haunted prison for him and his fellow patients.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bIID8uZTYNnSMfWwaIluRTzaZQL.jpg",
  "categories": {
    "plot": 5.1,
    "acting": 6.4,
    "ending": 4.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 3.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This one surprised me but \"Eli\" is definitely one of the stronger Netflix horror movies.The first half seemed to have a slower pace compared to the second half. However, the story itself was fascinating and kept me guessing up until the last scene. Acting was overall solid minus a few moments with the kid actor. Music and atmosphere were also solid. Some of the jump scares were predictable if you've seen enough horror movies, but the interesting story makes up for that.Overall, I would recommend \"Eli\" to those looking for a nice Netflix horror movie."
    },
    {
      "rating": "9",
      "text": "This film is very original work that has a rich and deep story and a mix of other horror films.When I watched it I see a good mix of atmosphere of next films: The Others (2001), A Cure for Wellness (2017),  Carrie (2013). Also, if you know this film or like as other work - you could think about many ends of story, but the true final of picture is beautiful, impressive and mind-blowing."
    },
    {
      "rating": "3",
      "text": "For the first half it's a copy/paste of the same \"scary\" scene over and over again mixed with a heap of ridiculous non-answers from all characters at all times, probably to extend the length of the damn thing. It's completely stripped of any kind of human emotion or logic reactions from everyone included. It's quite simply put a complete disaster of a movie. When it nears its end it tries to throw some lame plot twists at you that \"clears everything up\". But the plot twists themselves are so laughably out there that it only accomplishes to take it to a whole new level of utter nonsense."
    },
    {
      "rating": "9",
      "text": "Nicely filmed, pacing is steady and performances are serviceable.  Lilli Taylor always carries her weight.  i found the scares very effective, not generic jump scares, very well done blending of light and shadow and characters.  I like the dad doing tough love, too often characters could be more real if they attempted a balancing act like real people.  It was like a good pulpy horror book from the 1970s."
    },
    {
      "rating": "3",
      "text": "In just a week Netflix released two films with the same premise of: Nothing is what it seems. Although with different narrative approaches, I speak of Fractured and now Eli.The problem is that both have ridiculous plot twist and both are unable to create suspense.Eli is more inclined towards horror but my God the atmosphere is so damn passive that after about 40 minutes you will be begging for something more interesting to happen. And it doesn't.Everything is too messy and scattered and the final minutes are very similar to many other exorcism films and the ending above all feels empty and devoid of a real crucial or stronger moment.Calling it disappointing is me being nice."
    },
    {
      "rating": "8",
      "text": "Despite this film's few inconsistencies, the powerful performances (particularly by the young man who portrayed Eli), easily voided some of the flaws. Although Eli did lack in originality, SOMEHOW it managed to keep me interested throughout. I've always rather enjoyed Lili Taylor's work. Nothing earth shattering, but I liked it."
    },
    {
      "rating": "4",
      "text": "Από το The Boy in the Plastic Bubble μέχρι το Bubble Boy και τις αμέτρητες αναφορές στις διάφορες ιατρικές σειρές, μια ιστορία ενός ανθρώπου, συνήθως παιδικής ή νεαρής ηλικίας με ανοσοανεπάρκεια που αναγκάζεται να ζει σε ένα πλήρως αποστειρωμένο περιβάλλον, δεν μας είναι πρωτόγνωρη. Ωστόσο στη νέα ταινία Eli που θα δούμε σύντομα στο Netflix οι δημιουργοί σκέφτηκαν να μπλέξουν στο στόρι και τον τρόμο."
    },
    {
      "rating": "6",
      "text": "The first three quarters of the film are really entertaining, which is why its a bit of a shame that it stumbles towards the end."
    },
    {
      "rating": "2",
      "text": "A film that tells us the story of how the children of the devil earn their place on earth."
    },
    {
      "rating": "1",
      "text": "Iba todo bien hasta la mitad de la película donde te das cuenta de la pérdida de tiempo y del ñordo de película que es. Horrible, lamentable."
    },
    {
      "rating": "4",
      "text": "Klasik hikayesinin sonu bağlanmayan saçma netflix filmlerinden biri korku var ama daha sonra iş iyice saçmalaşiyor bu filmi izleyeceğinize kadar daha başka birsürü film izleyebilirsiniz zaman kaybi eğer ben saçma filmleri hikayesinin sonu olmayan filmleri seviyorum diyorsanız o başka tabi"
    },
    {
      "rating": "1",
      "text": "What I thought was an innovative horror about doctors, weird treatments and diseases, turned into a supid cliche movie about demons and cults. After watching this film I felt that I just wasted my time."
    },
    {
      "rating": "2",
      "text": "Tiene un inicio de trama interesante pero tanto la actuación como el desarrollo argumental es terrible."
    },
    {
      "rating": "3",
      "text": "movie production is great and so is the acting, very predictable jump scares, they still do a job, movie has more of a comedic sense to it, the first half of the movie was clear, the second half was all over the place and the ending is just horrible and unrealistic, overall its an okay movie but they shouldve put more effort into the plot, the ending in specific."
    },
    {
      "rating": "6",
      "text": "Boy doesn't really have Solar Urticaria, he's just allergic to the holy water that his parents have been injecting into him as he is actually Satan."
    }
  ]
}