{"id": 1340, "title": "Ella Enchanted", "starring": ["Anne Hathaway", "Hugh Dancy"], "runtime": 96, "genre": ["Family", "Fantasy", "Comedy"], "description": "Ella lives in a magical world in which each child, at the moment of their birth, is given a virtuous \"gift\" from a fairy godmother. Ella's so-called gift, however, is obedience. This birthright proves itself to be quite the curse once Ella finds herself in the hands of several unscrupulous characters whom she quite literally cannot disobey. Determined to gain control of her life and decisions, Ella sets off on a journey to find her fairy godmother who she hopes will lift the curse. The path, however, isn't easy -- Ella must outwit a slew of unpleasant obstacles including ogres, giants, wicked stepsisters, elves and Prince Charmont's evil uncle, who wants to take over the crown and rule the kingdom.", "releaseYear": "2004", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/ilcY7kub31SqfBfMNCESC823qR9.jpg", "categories": {"plot": 6.5, "acting": 7.333333333333333, "ending": 2.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 8.125, "action": 5.0}, "reviews": [{"rating": "2", "text": "what is the point to see girly movies  like tangled and alll that **** now this . i did like the ending with the singing elton jhon ' s do'nt go breaking my heart ."}, {"rating": "1", "text": "Yeah right, people. This is a horrible movie. Go watch The Fugitive or something like that. The book is waaaaaay better. Check it out."}, {"rating": "10", "text": "I agree with Julia R. Hugh Dancy is Definitely on my top 5!"}, {"rating": "1", "text": "Worst film I have paid to see at the movies since The Shadow, way back when. There is not one iota of originality in this sad, FoxFamily channel style tale. I thought murderous, angry thoughts the ENTIRE movie - and I almost always give a movie a chance, especially when I'm in the movie theater. There are no special effects - other than a CGI talking python and a talking face trapped in a book. The story can be summed up using an example from the movie itself - in the very beginning, Ella is cursed to do everything anybody commands her to do. So, when someone says to her a statement like, \"Bring me that pair of scissors\" or similar, Ella stops whatever she is doing, stands bolt upright (the \"magic sound\" is played), and then she walks swiftly over to the scissors. It is absolutely the worst gimmick I have ever seen in a movie that received such ridiculously good ratings. I usually depend on this site and always scan it before seeing a movie. Ebert's review of this movie so repulsed me, however, that I felt inclined to comment. At the very least, wait till video to prove me wrong. Then you can at least turn it off when I'm right. danny."}, {"rating": "7", "text": "it lacks the magic of other fairy tales, but to be fair, this movie has good comedy and it sticks to the book."}, {"rating": "10", "text": "A real Crowd pleaser, really enjoyed this one and say that you will too! An amazing piece of work that 100%    guarantees a family fun adventure and with a comedy touch and lots of twists and turns! Amazing!"}, {"rating": "10", "text": "I remember reading this book in elementary school so when I discovered there was a movie, I jumped at the chance to see it and I am so glad I did.  Anne Hathaway brings Ella to life with a classic teen-girl personality, not always in line with the book but still very well done.  Hugh Dancy is the perfect Prince Char-ming, who helps Ella learn about love while she teaches him some character lessons. Ella and Char are such a cute romantic pair and they made me believe in the magic of fairytales all over again!"}, {"rating": "6", "text": "There are films that are meant to be great. Others, however, are just meant to be fun. This film belongs certainly to the second group, having been thought of as a family comedy. The plot is clearly based on Cinderella's tale, but here she is cursed to obey because of a bad-taste gift given by an unconventional fairy godmother. The whole story then develops in her effort to free herself from this gift and the way people take advantage of it to manipulate her. Gradually, everything becomes more predictable and my interest has diminished but never disappeared because it remained funny enough. The way Ella and the Prince know each other is, in my perspective, the poorer solution the script could have created to cross them. The idea of ​​that talking book sounded kind of stupid too. Dialogues and even some jokes are sometimes common and boring. Throughout the film, medieval elements and things from our time (miniskirts, fan clubs, automatic ladders etc.) intentionally intersect and blend. The film also tried to introduce some Disney- style musical moments, but I have some doubts about whether or not it was a good idea.Anne Hathaway, still very young here, excels in her character, adorable and yet full of personality. Hugh Dancy was a satisfactory Prince, the same could be said of Aidan McArdle and Joanna Lumley, who played supporting characters. Cary Elwes was a predictable, weak and rather risible villain, but I think it's the bad idealization of the character and not the actor himself.Overall, this movie is worth it if you just want to laugh a little or spend an hour and a half with family in a nice way. However, if you are looking for a cinematographic work of art, this film is not for you."}, {"rating": "2", "text": "Plain and winding story, conversations are so-so, great customs and settings though."}, {"rating": "10", "text": "Ella Enchanted, starring Anne Hathaway, Hugh Dancy, Minnie Driver, and Eric Idle, is a contemporary epic fairy tale, sitting on the top shelf with such classics as The Wizard of Oz, and Willy Wonka and the Chocolate Factory.A deeply telling and romantic tale, set in the land of magic, with many important messages, ranging from personal freedom, self empowerment, truth, and equality, to the simple pleasures that create the beautiful contrast of fairy tales, humor, song, beauty, friendship.A family movie, Ella Enchanted will be enjoyed by adults and children, and is sure to bring a warmth to your heart.Anne Hathaway steals your heart with her charm, personality, and ability to carry the movie no matter where it leads, with great beauty and skill. The supporting roles are cute, witty, and fill out the movie in all the right places.This is one for the vaults, and the DVD collection"}, {"rating": "7", "text": "Interesting take on the fairy tale genre.  Never read the book so I can't say how faithful it is.  I thought Hathaway was a good casting choice for the movie."}, {"rating": "10", "text": "More enchanting than its title, Ella Enchanted is an underrated classic comedy that will live on for ages!"}, {"rating": "10", "text": "It's had been a couple years since I watched Ella Enchanted, and because of that I had a weird nostalgic love for it. As a kid, this was just another Cinderella story with a fun twist. Although it is truly a sweet retelling of a classic, a heartwarming romance, rewatching it a few years later made me realize: this is also a genius comedy. I found myself laughing at both the intentional and unintentional hilarious moments. The random musical acts stood out, yet, somehow still fit perfectly. It makes a silly and lighthearted commentary on politics, and although the visual effects are makes it obvious early 2000's movie, the movie doesn't feel dated. The bad graphics and green screen actually makes this film ten times more lovable. This movie might not be the smartest or funniest of all time, but all its quirks-- and that one scene in the mirror room-- make this movie is a clear ten out of ten."}, {"rating": "9", "text": "----------------------------------9.4/10-----------------------------------"}], "recommendations": ["the_princess_bride", "stardust", "onward", "paddington", "christopher_robin", "enchanted", "nanny_mcphee", "last_christmas", "up", "godmothered", "klaus", "me_and_earl_and_the_dying_girl", "the_peanuts_movie", "groundhog_day", "paddington_2", "the_polar_express", "elf", "a_cinderella_story", "the_star", "ratatouille", "eternal_sunshine_of_the_spotless_mind", "arthur_christmas", "10_things_i_hate_about_you", "a_christmas_carol", "the_notebook"]}