{
  "id": 4356,
  "title": "Elle",
  "starring": [
    "Isabelle Huppert",
    "Laurent Lafitte"
  ],
  "runtime": 130,
  "genre": [
    "Drama",
    "Thriller"
  ],
  "description": "When Michèle, the CEO of a gaming software company, is attacked in her home by an unknown assailant, she refuses to let it alter her precisely ordered life. She manages crises involving family, all the while becoming engaged in a game of cat and mouse with her stalker.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lpKIazNJncpV3sJ5MyTFS5tfTZk.jpg",
  "categories": {
    "plot": 6.305555555555555,
    "acting": 7.648648648648648,
    "ending": 6.4,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.25,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Thanks to a typically brilliant performance by Isabelle Huppert (and really, when is she not great), and Paul Verhoeven working at peak power. ELLE takes what could have been a typical rape-revenge thriller and transforms into something else entirely. Subverting expectations at every moment, taking the story to twisted and twisty, not to mention disturbing, areas I was not expecting. This is a compulsively compelling character study that leaves much to discuss and gets better the more one thinks about it. Layered and unforgettable."
    },
    {
      "rating": "9",
      "text": "Isabelle Huppert has never been better than in this wonderfully constructed drama by Paul Verhoeven. Although positioning a rape front and centre, this is no ordinary revenge drama but a well written and directed character driven thriller that keeps you guessing as to the culprit's identity despite a few red herrings being thrown into the mix. It's fair to say that the film is about 10 minutes too long and for those paying close attention the eventual unmasking of the guilty party comes as no big surprise. Compelling and stylish film making non-the less."
    },
    {
      "rating": "7",
      "text": "A disturbing and twisted yet strangely compelling story of sexual compulsion and antisocial behavior that says as much about the society in which we exist as it does about the characters on the screen. Many of the film's shocking sequences are on par with those found in pictures like \"A Clockwork Orange\" and definitely not for the squeamish nor faint of heart, but its superb lead performance by Isabelle Huppert nevertheless keeps one's eyes glued to the screen, almost no matter what happens. Those easily offended by violence and explicit sexuality would be wise to skip this one, but viewers who appreciate a provocative psychological thriller with a singularly cynical, macabre wit may find this an irresistible guilty pleasure."
    },
    {
      "rating": "8",
      "text": "Absolutely disturbing film that probably won´t go the way you would think at first if you hadn´t heard that much about it. It´s definitely engaging form beginning to end (despite being long, many things happen). Most of the characters if not all are quite amoral probably in an attempt at reflecting what all of us humans can be. Good and bad. Way more exaggerated than what most people in real life are in my opinion, but that´s not a problem of the film of course. A lot of issues are approached regarding sex most of all, also other types of relationships and mental states. Every actor plays their part successfully and nothing will leave you indifferent. A very strong 8/10 from me for a very daring and out there film."
    },
    {
      "rating": "2",
      "text": "Elle has its strengths - Hubbert's fierce lead performance and occasional laugh out loud moments - but its unrealisic plot and strange transgressions are confusing at best and wildly offensive at worst."
    },
    {
      "rating": "10",
      "text": "Oh boy. Here we go. This one is going to be controversial as hell. This never could have been made in America. For one thing--the heroine isn't likable. For another--her unlikeability isn't shown as a weakness of character. The less you know going into this one, the better. One of the best performances of the year by Isabelle Huppert. Great thriller."
    },
    {
      "rating": "0",
      "text": "Rating = 2 (Metacritic incompetence)No wonder they couldn't get it made in English in Hollywood, it's a beyond belief stupid nonsensical obscene silly plotless incoherent indulgent scattered ramble directed by a washed up hack who had a couple hits 20-30 years ago and a flash of brilliance in his short lived shock jock cinema and has now proven he never made it out of adolescence with his perverted delight at attempting to disturb with his usual cartoon vision of the world. He tipped his hand beyond recovery (in a sane industry) with the so laughably horrendous \"Showgirls\" that it became one of those rare movies so terrible it gets notoriety and watched anyway as 'so bad it's good'. This junk blatantly rips off \"Jagged Edge\" (not just the mask but also the score, cam, cuts), which it would be an understatement to say is about 100 times better than this puke. You've got to be a fool to tolerate this hoax or just a pseudo euro trash film snob who is either dishonest with themselves or has no clue what a good movie is."
    },
    {
      "rating": "3",
      "text": "The high ratings from critics is mystifying.  This movie's main characters, supposedly bright, accomplished people, act stupidly again and again for the entire length of the story--offering ridiculous justifications for their stupidity.  How stupidly?  A rape victim doesn't go to the hospital or police to collect her attacker's DNA.  In fact, she submits to his attacks twice more!  Tough to sit through this one."
    },
    {
      "rating": "0",
      "text": "No way is it a great movie. There's no effort spent on character development; too many useless subplots (why is the thing about the father or for that matter the son there anyways!!!); and too much hype. If you want movies of the genre please go see Gone Girl; dont waste your time on this crap."
    },
    {
      "rating": "3",
      "text": "Look, I'm not even going to engage the question of whether this movie is essentially misogynist or not. I'm going to take the film at face value. Because I actually enjoyed the first third of the movie immensely. Isabelle Huppert's performance is fantastic and compelling, the concept of a woman dealing with a violent rape by sitting back and methodically preparing to take her revenge, and the way she treads through the male world she lives in are all compelling ideas!But the story is a train wreck! And not in an enjoyable way!The first engine of the movie is Elle's mission to track down her rapist. Very compelling.Then we get this backstory that her father was a mass murderer. Also interesting enough to keep me watching. But not tied in to the rest of the movie in anyway whatsoever. It almost seems random.And then some very boring subplots about her whiney son and his obnoxious girlfriend, and some casual relationships with the other people in her life. No tension driving those subplots.And then! *spoiler alert*She discovers her rapist, it's the neighbor she has a crush on! Wow, interesting! The person she's been trying to track down this whole time! But then, she seemingly doesn't care at all! She lets him go, gets into a random car rack which he saves her from for some bizarre reason, she continues to hang out with him, he rapes her again but it's bizarre because the movie plays this like it's a bad thing but she also wants it maybe? Not clear. And then he tries to rape her again in the end which is totally undramatic at this point because she's totally given up on trying to stop him from raping her.The last third of the movie lacks tension or any compelling conflict at all. This could've been a good movie. :("
    },
    {
      "rating": "1",
      "text": "This is the wonderful movie for brainless liberals. This is the real degradation of French movie making.I am not surprised the Hollywood chose this movie as the best foreign film. What can we expect from Streep and Co? I spent $25 for two tickets and will regret for the rest of my life that I didn't buy instead  the bottle of Russian vodka."
    },
    {
      "rating": "7",
      "text": "“Elle” is a French film based on the novel “Oh…” written by Philippe Dijan (“Betty Blue”) with a screenplay by David Birke. Directed by Paul Verhoeven the movie stars Isabelle Huppert, Charles Berling and Laurent Lafitte in this tale of a woman who is raped and how she copes with the incident. The rape scenes are brutal in their violence and makes the viewing of the film an uneasy experience. What is more uneasy is the mind of the viewer as he or she recalls and tries to understand the theatrical presentation they have just seen for the story is complicated and made even more so by the subtitles. I am sure a French viewer would find the film easier to understand than his or her English-speaking counterpart. All that being said, this film is filled with suspense and mystery and, more than anything else, is a tribute and testament to the talents of Ms. Huppert. Her unbelievable ability to communicate and exude various degrees of emotions and sex appeal without ever uttering a word speaks volumes to her amazing acting ability.  I give a 7.5 with a warning for the squeamish viewer to beware."
    },
    {
      "rating": "7",
      "text": "This movie starts with a rape. The woman who's attacked (Isabelle Huppert), goes into stealth mode, playing down the effects of this act of aggression. There are some notable parallels: she runs a company that creates violent video games and a relative is a serial killer. This film seems like it's headed to a revenge narrative (it is directed by Paul Verhoven, who's no stranger to sex and violence in his work), but expands into a compelling character study of a seemingly stable woman harboring a number of issues. Huppert is always fascinating to watch, even as the character seems to spiral in unexpected directions. It's not exemplary, but it is an unusual, complex and interesting experience."
    },
    {
      "rating": "5",
      "text": "This movie stuffs so many issues under one hat. Rape, pervert sexual relationships, raising children, anti humanity crimes, men women sexual and social lives, work maneuvers. Too much to be contained in a well crafted scenario and swallowed by the audience.  Isabelle Huppert did reveal a cold faced woman who isn't easily shaken even when raped!! A movie to be seen more than once but without acquiring high grades.  It is like eating too much of everything without finishing a dish!!"
    },
    {
      "rating": "6",
      "text": "Elle is a mentally disturbed movie, a human drama like nothing you seen before, can’t say if in the good or bad sense. Tells the story of a woman, with a horrible past, that could traumatize every kid in the world; and that is violated in her adulthood. Michele’s stoicism is breathtaking; the struggle she gets in is astoundingly portrayed: the rebirth of her past and the imperious impulse to move on with her life. This awful happening will affect, without her noticing, her love life and the relationship with her mom, son and friends. Regardless it seems that the protagonist didn’t change after the assault, it’s because of what she lived as child, that prepared herself, in a way the viewer can imagine, for borderline situations. The director’s hand doesn’t tremble for showing the reality, the script is very clever and Isabelle Huppert is magnificent and her performance gives you chills."
    },
    {
      "rating": "6",
      "text": "Just calling this a movie about rape revenge is a gross oversimplification as the situations and characters are complex. Typical of French movies, this film has every permutation and combination of sexual relationships. Overall, this isn't a bad movie but there are better ones out there to spend your time on."
    },
    {
      "rating": "9",
      "text": "On December 20 I wrote a review of “Things To Come” a movie starring Isabelle Huppert.    In it I said,“Isabelle Huppert is one of those rare actresses who can be doing one thing while her face shows, expresses, shows deeper  emotions. Huppert is an interesting actress to watch and I am looking forward to seeing her in “Elle”, a much praised with Oscar talk performance, which can only add to her stellar resume.”I saw “Elle”, for which she was just nominated for an Oscar as Best Actress, deservedly so, and who I will be rooting for on Sunday February 26 on the Oscar telecast. Up to seeing this movie I was hoping Ruth Negga would win for “Loving”. In any case they are more deserving than Emma Stone, who I have nothing against though her performance comes nowhere these two.Isabelle Huppert plays Michele Leblanc, a video game executive, who, during the first scene of the movie, is brutally attacked and raped by a masked man. While there are flashbacks to this particular act there are also repeat attacks and Michele’s reaction to them seems to change from fear to desire almost as if she was controlling the man and what was happening.There are many suspects from Patrick (Laurent Lafitte), a married neighbor, to Robert (Christian Berkel), Michele’s lover and whose wife Anne (Anne Consigny) is Michele’s best friend and business partner. There are also some of the men who work for her from one who doesn’t like her and another who follows her around like a puppy. There is also her ex-husband Richard (Charles Berling) not quite as successful as she is.Along with her various reactions to her attacker Michele also has a 22-23 year old son Vincent (Jonas Bloquet)  who has a girlfriend Josie (Alice Isaac) and thinks he is the father of their child which is, obviously, wrong plus Josie having attitude to both Vincent and Michele. There is Michelle’s mother Irene (Judith Magre) who is very full of herself and has a stroke while in the background is her father who committed a horrendous mass homicide when Michele was a young girl and was in the middle of the surrounding publicity.While Michelle is pulled in many directions along with trying to find out who her rapist was/is and wanting to control him and the situation Isabelle Huppert commands us, letting us see what she wants us to see, keep us guessing what she may be thinking and feeling but you believe everything she shows you.Partially a character study and partially a psychological thriller “Elle” is a film with excellent performances, top production values from the soundtrack to the photography with sharp direction and a good screenplay all held together by Isabelle Huppert who, after 100 movies and at the age of 64, shows what the best acting is like!A definite must see!"
    },
    {
      "rating": "10",
      "text": "It's a very nice french drama film with shades of a mystery. For sure, the highlight of this movie is the strong performance by Isabelle Huppert. She's great"
    },
    {
      "rating": "7",
      "text": "Sometimes the crime decides its own fate.I had no thought before the watch, but while watching it, I felt it was overrated. That's for a moment, once I finished watching it, realised it's a better film. I mean I changed my stance, after over and over thinking about the film. So its the patience you need, wait till the film to end to decide how much you liked it. It was too long, but every space was filled up with the best parts. It took time to understand the characters, and with multiple angle events in one woman's life. Isabelle Huppert was amazing. Despite so many characters in the film, she ruled it. One of her best films I have seen.The film focused on the boss of a video game designing firm. It opens with as she's been sexually assaulted in her home by an intruder. Followed by one of her employees morphed her face to an animated character as a sexual explicit material for the game they are working in. So she begins her investigation to find both the culprit who might be the same person. This is where the suspense comes into play to develop interest in us. Besides, facing family troubles takes some extra development. Subsequently, all the mysteries will be solved and to know how it ends, you should watch it.\"Michele to her cat: You did not have to claw his eyes out, but scratch him at least.\"It is official French submission to the 89th American Academy Awards. But as per the latest news bulletin, this film is out of the Oscars race, despite made into the Golden Globes. From the director of the original 'Total Recall' and his first French film. Based on the book named 'Oh...'. But I felt it was developed from a small part of 'The Little Death'. Basically, there's an understanding being it is the story of the adults, despite the sexual violences and that's how this story was built. So you must compromise on a few things that is shown in it if you really want to enjoy it.I did not like it all the sudden, though looking back all the film events and joining them together made me see the film was decent. Especially that final line said by a woman who was evacuating her house makes whole thing sense. Maybe that's the real twist in the tale. Initially I did not think to write a review, but surely it deserved one from me, so I wrote this short and quick. This is the film for the grown ups, but not for all the grown ups. So I hope it will meet your expectation if you decide to try, but according to me definitely it is worth.7/10"
    },
    {
      "rating": "10",
      "text": "If you love Isabelle Huppert as an actress and can accept other people’s points of view based on what’s happened to them, then you will like or maybe even love this movie as I did. Can rape ever be funny? No, but when you find out who the rapist is in this film – and who his wife is – maybe then you will begin to understand Huppert’s Michele Leblanc and see the many absurdities and ironies in this film. When you meet Michele’s parents and learn about her father, you may understand her cockeyed life more clearly. And you may even find yourself laughing and admiring how Isabelle Huppert manages to make such a character come alive so that you understand and even sympathize with her."
    },
    {
      "rating": "7",
      "text": "First and foremost, Isabelle Huppert's bold, tour de force performance in this film is the sole reason to check it out. She's really never been quite better. The rest of the film felt somewhat scattered and dragged out and the film's content and story became a bit too aberrant and even somewhat ridiculous in the second half for my tastes. Overall, despite the story just being average in my opinion, it's a fine film that's worth checking out for the most part due to a career-best performance from Huppert."
    },
    {
      "rating": "6",
      "text": "A well-made film with Huppert at her best. Unfortunately the script is a contrivance that gets silly. Thrillers can be funny but they can't be silly. Verhoeven's idea is to construct an allegory that parallels the life of Elle with the stories created in her video game business. It's a cute idea but he forgets to take the audience with him."
    },
    {
      "rating": "10",
      "text": "This is not a normal movie, this movie will keep you thinking even when it ends. Elle proves that not all movies have to complete a formulary, sometimes a movie can be so unexpected and so out of the rules and be really a masterpiece, this is teh case of Elle. With a really Oscar performance from Isabelle Huppert, Elle is a must see experience. The director don´t go on directions that one could expect, in this movie you would think that the movie is over at the 3/4 of it, but then you realized that are more minutes of the movie, and that´s when you´re lost and the movie is not gonna help you find it, you must find it. There are so little movies that are really mind-breaking without presenting a new topic, however Elle does break your mind in a way that you couldn´t expected. There are some people that because of this may not like the movie, but everybody has their reasons to like or not like this movie"
    },
    {
      "rating": "7",
      "text": "This movie starts like an action movie, later it seems to be romantic, then drama and finally it's again a thriller. I thought it would be a boring movie and it kinda was but I could feel a tension throughout all movie. The main character was kinda traumatizing. She was like a nymphomaniac or something. So the main idea was a bit odd. But despite these minuses this was watchable and at the moments I really liked it."
    },
    {
      "rating": "3",
      "text": "From one viewpoint, this is a film about such a highly dysfunctional group of individuals (to the point of being truly warped), that you wonder how they can get through life and even hold a job at all. As a viewer, if you can accept this incredulity as the baseline of the film, then you can get more involved with the twisted fantasy and the mystery-unraveling-solving part that is built around it. It doesn't pan out, in the end, and just adds to repository of disbelief we already have about the French and their very bizarre and unique ways of living life, as it apparently straddles the line between actual truth and fiction."
    },
    {
      "rating": "3",
      "text": "Ce vieux pervers de Verhoeven a la vue qui baisse : le voilà qui s'est découvert une nouvelle passion pour les cougars ! la Huppert et sa copine là, environ une centaine d'heures de vol à elles deux au compteur (à moins que ce ne soit des années ?) et pourtant, toujours en piste les desperate housewives... surtout pour Isabelle qui donne beaucoup de sa personne dans son inédite relation sado-maso à l'insu de son ignorance.Le Hollandais volant sait encore en quelques scènes ici et là sans fard et sans fioritures nous estomaquer par la brutalité et l'agression (sexuelles bien sûr) ; il sait en extraire le côté scabreux le long d'une histoire qui s'y prête forcément. Cette même \"histoire\" qui multiplie les situations et les personnages si aberrants que cela confine à une sorte de surréalisme.Il détaille le passé et la psychologie d'Isabelle (qui s'en tire bien) ainsi que son environnement tourmenté (le père psychopathe, le fiston complètement con, sans oublier évidemment ses ex et ses coucheries à droite et à gauche) et c'est pas facile tous les jours ! c'en serait presque risible si ce n'était aussi absurde... et abrutissant.Non, on est très loin de Basic Instinct sans parler de La chair et le sang, ni même de l'étonnant Black book... Papy a perdu la main sur ce coup. Premièrement parce qu'on y croit pas, on y croit plus au bout d'une petite heure : trop aberrant et invraisemblable ; secondement parce que le film est une limace neurasthénique sous neuroleptiques : si on avait sabré au bas mot 40 minutes inutiles, le film aurait pu peut-être s'en sortir. Mais avec des \"si\"...La fin retombe à peu près sur ses pieds, comme une dernière tentative -quoique convenue- pour extirper le film de la mélasse dans laquelle il s'est enfoncé jusqu'à la garde. Mais il est déjà trop tard."
    },
    {
      "rating": "10",
      "text": "O filme mais cru e intenso do ano. Huppert provando o porquê de ser a melhor atriz de cinema atualmente com sua capacidade de imergir completamente no personagem. A direção de Paul Verhoeven é impecável!"
    },
    {
      "rating": "10",
      "text": "Elle is a fine film that owes its greatness to Isabelle Huppert's masterful performance and Paul Verhoeven's impressive ability to surprise the audience at every turn."
    },
    {
      "rating": "2",
      "text": "This film was incredibly boring. The story did not start. 1 hour and a bit into the film could have been the opening scene so little had actually happened. It is shocking the amount of praise this film is getting in comparison to other movies that have been slayed. The movie is more or less about a woman getting raped then staring out her balcony for 2 hours. Save yourself the misery. Let me finalise by saying I was well up for this film and recommended it to my friends. My recommendation premiums have taken a hit as a result of this film. Incredibly overrated."
    },
    {
      "rating": "9",
      "text": "hard and disputable topic, but fantastic cast and great director, so definitely recommend if you are an adult!!!!!!"
    }
  ]
}