{"id": 1091, "title": "Elysium", "starring": ["Matt Damon", "Jodie Foster"], "runtime": 109, "genre": ["Science Fiction", "Action", "Drama", "Thriller"], "description": "In the year 2159, two classes of people exist: the very wealthy who live on a pristine man-made space station called Elysium, and the rest, who live on an overpopulated, ruined Earth. Secretary Rhodes, a hard line government ofﬁcial, will stop at nothing to enforce anti-immigration laws and preserve the luxurious lifestyle of the citizens of Elysium. That doesn’t stop the people of Earth from trying to get in, by any means they can. When unlucky Max is backed into a corner, he agrees to take on a daunting mission that, if successful, will not only save his life, but could bring equality to these polarized worlds.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/aRjuJuPXHtVs6YegfeeQWXGRs1E.jpg", "categories": {"plot": 5.6875, "acting": 6.681818181818182, "ending": 5.454545454545454, "soundtrack": 2.0, "cinematography": 2.0, "familyFriendly": 3.0, "funny": 6.0, "action": 6.903225806451613}, "reviews": [{"rating": "10", "text": "Just caught the matinee and feel a little guilty this one deserved a full price! No soph0more slump for Blomkamp I loved District 9 this to me even surpasses it.We get developed characters that we actually care about the performances by all were stellar,especially Damon as the guy we can relate to and Copley in a scene chewing performance delivering one of the best villains in recent memory,Foster was the  too as the cutthroat politician .Blomkamp has balls and his vision of two separate societies one of the diseased, overpopulated planet and Elysium where the rich flourish disease free was richly brought to life truly a beautiful the effects by Weca are amazing! I bought in to this future world and the plot actually had a purpose with something to say about our modern society while still being balls to the wall entertaining and affecting its audience. Blomkamp delivers another classic go check it out i can't recommend enough"}, {"rating": "3", "text": "I just got back from the 10 o'clock screening of Elysium, and boy am I disappointed. I mean, talk about underwhelming in pretty much every way possible. There were tons of fairly sizable problems with the film, one of the most damning being the reliance on generic cookie-cutter characters (excluding Kruger, who was kinda awesome) and a convoluted chase-movie plot that lacked real motivation since the audience wasn't brought up to speed on the stakes of the mission or the endgame of the heroes.\r However, I would argue the greatest flaw of the movie is just the fact that it doesn't have a whole lot going for it. Once you get past the clever premise and fantastic world-building, the movie doesn't have a whole lot of originality to spare. Its few creative weapons concepts (like the air-burst gun and shield you see in the trailer) are only used for a few seconds a piece before being traded for something more uninspired. A few characters look promising from the get-go, like the  bonkers Kruger and some of Max's gangster buddies, but all these guys end up going the safe and dull route. Even the climax of the film, which I was hoping would do something daring and different to solve the character's predicament, went the trite path of a million different feel-good endings that were nothing but convenient B.S. that wrapped up everything with a nice bow, regardless of how little sense it made.\r TL;DR\r Elysium may have a fantastic setting and some cool ideas, but its let down by blah characters, a messy story, and a lack of creativity"}, {"rating": "10", "text": "Elysium is a tour de force of science fiction and dazzling action. Matt Damon gives an engaging performance as a man who is working and living on a ruined earth. He wants to live on Elysium but Elysium is only reserved for the wealthy. He isn't wealthy and he is an ex convict yearning for a better life. He has an accident at work and his body is bombarded with radiation. He has only days to live and he decides to go to a friend for help. His friend gives him a mission to shut down Elysium's system. He tells him that if he can get vital codes extracted from this guy's mind and brought back to him he will give him passage to Elysium. The coolest part of this movie is that Matt Damon sacrifices himself to save everyone on earth. In the end, everyone gets to live on Elysium and nobody has to suffer anymore. This is one of the smartest science fiction thrillers I have seen in years."}, {"rating": "9", "text": "yeah I thought this movie was great. I loved District 9 and looked forward to their next film. The critics were kind of split so I was a little worried but the movie turned out to be awesome. The action was intense and their were some great characters. The main character from the first movie returns in a totally different role and I thought he kicked ass. I don't usually like Jodie Foster so her being the antagonist made it alright. Matt Damon did a good job and the mechanic suit he wears gave the movie some very memorable action scenes. I also liked the story a lot about the elite deserting earth for a haven in space, keeping their advanced health care for themselves and leaving the poor too die. The movie held my interest completely and definitely lived up to what I expected."}, {"rating": "9", "text": "I'm a huge fan of sci-fi and I have to say this film is definitely a personal favorite of mine! Much like District 9 before it Blomkamp presents us with a seemingly all too real vision of the future in which the wealthy are able to live on a \"Heaven\" like space station known as Elysium free from all crime, sickness and disease. What follows is truly one of the most well crafted sic-fi films I have seen! Its not all action and that may turn some people away, but not me. It gives itself time to build up and gives the audience time to care about its characters. Take all this and set it against some of the most gorgeous CGI visuals you can imagine and you have a good idea of what to expect!"}, {"rating": "7", "text": "Movie was above average. Great special effects, great design. Had a very Halo vibe to it all. But the movie was very \"paint by the numbers\" and nothing really stood out. There weren't any moments of sheer awe or laughter or any other emotion. I would say def worth seeing but not in theaters, wait for Blu-ray."}, {"rating": "7", "text": "Though not as creative or executed as well as District 9, Neil Blomkamp provides another strong film to the sci-fiction genre. Even though the theme is nothing new, Elysium is a well paced action film that succeeds at sending a message."}, {"rating": "7", "text": "The plot was fluid and the characters were great. Spider stood out the most for me as the strongest actor. Too bad he was a minor character with a major role in the film. The villains were hate able, but not to the extent of them becoming complete a$$holes. It wasn't the District 9 plot i was hopping for, the intelligent action movie, but it was a very complete film with no plotholes that I could think of."}, {"rating": "7", "text": "Although it's lack of creativity and some poor acting stops it from being perfect, Elysium has dazzling visuals, great characters and is much more thought-provoking than most other sci-fi flicks."}, {"rating": "7", "text": "A really cool concept that could have been executed a bit better but still a really entertaining movie. Matt Damon and Jodie Foster kill there roles in this movie. Some great visuals and action scenes to keep you entertained. A bit slow in the middle but its a good average action movie."}, {"rating": "6", "text": "About half way through the movie, I thought this is much better than I expected. We had a an original plot and it looked like we were headed to a thoughtful climax. But no, we had to slide back to the action, shoot them up bs that every film seems to collapse to in the second half. They wasted this promising film for more silly gunfire and fight scenes which we have all seen a million times. Why, I don't know."}, {"rating": "6", "text": "Fun to watch, but there were a lot of plot holes, and pieces that were not properly explained. The action scenes were entrancing, and Matt Damon did a good job."}, {"rating": "7", "text": "\"Elysium\" 10 Scale Rating: 7.5 (Very Good) ...\r The Good: As usual, Blomkamp has a great and interesting idea. Very creative and full of social commentary without ramming it down your throat. Damon and Foster do a great job as adversaries despite spending little screen time together. The gritty backdrop (the same for District 9) of life on Earth vs. the peaceful bliss that is Elysium was an excellent contrast.\r The Bad: The action scenes could have been better. Far too much shaky cam and fast movement so that you're not always sure what happened. Sharlto Copley, Foster's main enforcer and one of the main villains in the film, was a little over-the-top and was more interesting when he didn't say much."}, {"rating": "8", "text": "In Greek mythology, the Elysian Fields are the blissful utopia where all good souls will come to rest. In this film, Elysium is a utopia that exists side by side with a wretched dystopia, which is our very own planet Earth. Earth is overrun with poverty, disease, and decay, a place where a preponderance of visible minorities hold miserable jobs and lead miserable lives. Matt Damon as Max is a poor orphan who grows up on Earth to become a reformed car thief working in an unsafe factory, and he longs to take his childhood girlfriend to Elysium.\r Because the planet got so polluted and run down by the year 2154, the filthy rich evacuated to a giant space station that exists just outside the atmosphere, clearly visible from Earth, in the shape of a round wheel that is a country in itself. It has its own president, President Patel, apparently the only non-Caucasian who has made it to Paradise, and every citizen of Elysium lives in the lap of luxury with beautiful homes, exotic gardens, sumptuous meals, and clean air. Every household is waited on by obedient robots, and every household contains a med bay, which is an enclosed box with a plastic lid where a sick person lies down, gets diagnosed by a computer program, and then is instantly cured of every affliction, disease, and malady that can possibly beset humankind. The med bay not only cures, it grants immortality, barring an accident or other calamity. Desperate, downtrodden, and ill citizens of Earth try to make illegal runs to Elysium in outdated space shuttles, just to gain access to a med bay.\r Playing the role of cold-blooded Secretary of Defense Delacourt, Jodie Foster is horrified by President Patel (Faran Tahir), who has an interest in human rights, even though he does not exactly go over the top with his philosophical beliefs, given that he has no interest in improving the lot of the masses back on Earth. Some Elysians visit Earth for business reasons, and John Carlyle (William Fichtner), is the CEO of an exploitative company that treats employees like slaves; as a result, Carlyle has to spend quite a bit of time back on the polluted planet. Foster's Secretary of Defense is cruelly ambitious, and she wants to stage a coup to overthrow President Patel and make herself president. For that she needs Carlyle to write a computer program that will topple the present regime of Elysium by resetting the country's entire computer system with new instructions.\r Since this is science fiction, and rather engaging science fiction at that, much can be forgiven in terms of some of the logistical details. For example, when a society is as technically advanced as Elysium, will the Secretary of Defense really get her text messages on a tiny screen on her watch? Even Sean Connery's Bond could have done better than that. And when the evil John Carlyle writes the ultimate computer program that will shut down Elysium and put Delacourt in power, would he really be writing the program in assembler language in the year 2154? I could have sworn I saw the assembler language STO command (for storing numerical values in registers) rolling by on Carlyle's computer screen. And does Delacourt speak fluent French because it is a pretentious skill for the rich or because Jodie Foster graduated from a French lycee in Los Angeles?\r But the movie is carried by Matt Damon, who does not disappoint. As Max, he is strong but tender, courageous but meek, and heroic but timid. He protects the girlfriend he's been true to since childhood. But more significantly, he seeks a proper distribution of income so that the repressed citizens of Earth can enjoy the same rights, opportunities, health benefits, and the blessed serenity of the rich and overprivileged dolts who are the good citizens of Elysium. It is the Day of the Revolution.\r Although the plot is somewhat predictable and a little too violent, this movie gets extra points for being philosophically sound."}, {"rating": "8", "text": "This movie is a solid 8, ignore the bad reviews. If you like District 9 you will enjoy this, Elysium has a very similar feel to District 9 though there seems there is a lot more character development in Elysium and you really feel majority of the actors gave stellar performances."}, {"rating": "7", "text": "Entertaining Sci-drama set in a dusty hopeless time. Clever tech fuels this movie with enough gas to get you to the end of the film but not much further. It certainly feels like Dist-9 2.0   That is not necessarily a bad thing though. Unlike the 1.0 this movie has A list Hollywood actors and a hefty budget to give it a boost and it for the most part it works. The O' Brother politics bring the score down some though as it is a little blunt in some of its over the top view of current issues. Don't let that sway you though this is a good movie so go see it."}, {"rating": "9", "text": "very good movie, enjoyed the action, i love how technology is not \"super\" advanced like in most futuristic movies but very close to reality and to what might actually really happen"}, {"rating": "5", "text": "After I saw this movie I didn't know what to think. It seemed to me to be preaching a message that the characters couldn't really convey. Once again it was a familiar plot of the poor and down-trodden rising up against the rich and evil. It also seemed to have a predictable plot, almost force fed to you, though Sharlto Copley plays an awesome bad guy.  Don't get me wrong, it entertained me but it really failed to impress me, maybe its just because we always seem to get the stock standard good poor vs. evil rich? Its an alright movie, not bad, not great, just alright."}, {"rating": "7", "text": "I got a good laugh when they showed some of the Elysium reboot code. Is Elysium really run by a 32-bit IBM PC? The mnemonics were unmistakable. The action sequences were certainly decent."}, {"rating": "8", "text": "Although it doesn't carry the heavy originality of 'District 9', Neill Blomkamp creates another interesting and important political message, and adds the onslaught of heavy action and profane language. Matt Damon, Jodie Foster, and Sharlto Copley are an intricate chemistry, with an enjoyable effect. 'Elysium' has enough for the cost of a ticket."}, {"rating": "8", "text": "Yes, movie snobs are damning the movie for not having super original characters or a super original plot. Get over it, this is a solid sci-fi movie. Not the best, but not nearly as bad as some make it out to be. If you are looking for a perfect movie, this is not it. If you are looking for entertaining sci-fi, this is a good one. If you have to have everything be realistic, this is not it and that is true of most of sci-fi. The acting in general was fine. It was a touch gory at times. Many cliche moments and characters. The pacing was slow at times, but not bad overall."}, {"rating": "4", "text": "I'm able to suspend my disbelief a fair amount, especially if there's something to be gained from it.  But I feel like Neil Blomkamp took the easy way out of every difficult situation during his first draft of the screenplay and then never went back to edit it.  Almost nothing interesting happens the entire movie and every difficult situation is resolved the boring, predictable way.  The main characters don't act like people, and the minor characters and robots are on screen precisely when it the plot asks for them to be there and no more.  Elysium did not surprise me or make me care about anything that was happening, and the times it made me laugh were mostly from the ridiculousness of it.  The thing I liked the most about the film was the cinematography, but most of that was reminiscent of District 9.  In fact, District 9 was just a better movie in every single way.  I recommend watching that again (or for the first time!) instead of watching Elysium."}, {"rating": "8", "text": "A well crafted sci-fi film about the have and the have nots.  Matt Damon gives his usual strong performance, but the scene stealer is Sharlto Copley his villainous role is the best part of the film.  A-"}, {"rating": "8", "text": "Wow!!  Reading some of these reviews says more about the reviewers' strange political/social views than it does about this movie.  I read one review that said a dystopian future like this is unlikely because history has shown us that every generation has left the next generation better off than the last and that incomes are predicted to rise meteorically.  All I can say is wow.  Do you not think that there will be a breaking point?  The patterns of history mean nothing because the whole dynamic is changing with dwindling resources, overpopulation, etc.  Situations that are unprecedented in history.  I could go on and on but I won't.  This is great sci-fi: gritty and topical.  I hope there is more science-fiction produced like this in the future."}, {"rating": "8", "text": "Elysium es un refresco comparado a peliculas como Oblivion que intentan la misma idea pero no logran sacrle el jugo del todo y se tornan demasiado aburridas, Elysium logra tramar con la misma idea con subtemas basados en realidades y suspensos emocionantes."}, {"rating": "8", "text": "\"Elysium has spectacular visual effects, an interesting story, and a good performance by Matt Damon.\" Even though Matt Damon has done some \"paycheck\" movies lately (We Bought a Zoo), I believe he really wanted to do Elysium.\r Elysium combines great action with an interesting storyline, good acting, and enough eye candy to give you a cavity.\r The visual effects in this movie are stunning, and Elysium has some pretty cool gadgets to go along with it. I especially liked Damon's \"drilled-in neurological droid suit\".\r I didn't get Jodie Foster's accent throughout the movie, and I believe she was sort of a weak link, but it didn't really take away from the story, so I guess I can forgive the movie for that."}, {"rating": "9", "text": "Elysium is not a film for stupid people. Ultimately, critics and reviewers will pan the film simply because they're unaware of the sci-fi tropes and themes that it references. Like Tarantino, Blomkamp is demanding engagement from the viewer, and when one is able to shunt disbelief aside and enter his world, the brilliance of his vision and his technical ability in portraying it make it an emotionally and intellectually satisfying experience. This is Asimov meets Orwell, it shows a depth of understanding of the nature and evolution of technology as well as the essential structures that produce it that should make most political scientists feel ashamed. Blomkamp isn't producing 'summer block buster entertainment' for the American masses, he's trying to create something artistic. This is not Lady Gaga, it's the White Stripes. A lot of critics will miss the joy of this movie by trying to watch it in terms of a summer blockbuster, instead of being aware that this is a director who will never (at least we hope) produce anything that Hollywood wants him to make. Blomkamp heavily references the scientific types found in novels like Dune and gives them a feeling of reality that is almost creepily grounded in today. A lot of critics ask questions like \"how did people end up on Elysium\". Well how have rich people in any time period distanced themselves from the masses? The answer is slowly. This is a film that will ultimately be beyond people who have never seen or noted how extreme income disparities develop and who have no feeling for how political economy works thorough technology. As such, many critics will try to cast it as a parody or satire of today's world, but in doing so will miss the point completely. This is the world of today taken to its logical end. Solid acting by Matt Damon who plays the everyman with a sort of pent up aggression that's important to the role. Jodie Foster's role is delightful, but ultimately, if a movie is defined by the quality of its villain, Foster is an antagonist but not the ultimate evil. That's reserved for Sharlito Copley, who's portrayal of Agent M Kruger brings chills, all the more so because his type of existence and the nature of his evil are so well recorded in history. But you'd have to know some history to know that and so we come back to the point; Elysium is an intelligent film for intelligent people, and many critics will bash it simply because they don't get it. I certainly don't expect the editor of Time Out London to do so. Frankly, I hope Blomkamp simply ignores them and that we continue to see the evolution of this fascinating artist."}, {"rating": "5", "text": "Everything here is clearly black or white, no shades of gray, but even just no gray! These are good, these are frankly evil. The development of the plot is not very logical, and much remains unexplained on a course of action. It was also the feeling that the author tried to re-shoot DISTRICT 9 (which IMHO was much better) for a second time, but failed. I liked the picture  Cinematography  atmosphere, and Jodie Foster's and \"psycho-sleeper agent\" Sharlto Copley 's roles. In general, average and highly ambiguous film. To be honest, I was waiting for something else: something like \"robotic man alone destroys the whole space station of the richies\", and the output was some kind of fiction with a pretension for something more."}, {"rating": "0", "text": "Neil blumpkin Has good special effects and artistic style, his plots are total garbage. Typical boring Matt Damon and Jodi foster, I couldn't care for any of the characters other then Kruger and his boys. I dunno district 9 was an alright movie but so far everything else has been total garbage. This movie is meh it's boring predictable liberal future childish view of the world. Although the one good thing the movie shows is open borders makes the U.S. Sooo sh***y people want to live in space with Jodi foster."}, {"rating": "4", "text": "Elysium had a decent enough premise. But the execution falters. Neil Blomkamp should have made District 10 instead. This is almost a two hour movie (two plus with previews and commercials) and it felt like it dragged on. It was a message movie when all I wanted was sci fi, none of the characters were likable and the trailers gave away to much. Visually, just as impressive as District 9. But we can see good effects everywhere now. It is something that used to be special and isn't anymore."}, {"rating": "5", "text": "Elysium is a huge disappointment compared to District 9. It doesn't even come close to being as smart or well-written as District 9, and is clearly the sophomore slump for Neil Blomkamp."}, {"rating": "4", "text": "Where to start? I had high hopes for \"Elysium\" since I liked Neill Blomkamp's other movie, \"District 9\" a lot. However, aside from some cool special effects and a great performance by Jodie Foster, I really can't say I recommend seeing it. Some of the stuff that happens during the movie really stretches credulity almost to the breaking point. I mean it's 2154 and people in L.A. are still driving GMC vehicles and riding buses? Yet there are aircraft that can fly from the earth's surface to Elysium in 19 minutes. A lot of discontinuities. The ending is equally predictable and unbelievable. Also it seemed a lot longer than an hour and 49 minutes. Wait to see it at a matinee or on DVD is my advice."}, {"rating": "8", "text": "Overall a very solid movie with great si-fi action, a cool/interesting story, and believable characters. The only reason I don't go higher is because I sort of left the movie wanting to know more about the backstory, details during the movie, and ending. Just wished parts were a little more fleshed out. Otherwise though it was great and I recommend it."}, {"rating": "7", "text": "Although it's lack of creativity and some poor acting stops it from being perfect, Elysium has dazzling visuals, great characters and is much more thought-provoking than most other sci-fi flicks."}, {"rating": "8", "text": "Elysium is a fun movie that does not take itself too seriously, has excellent acting and great special effects.  It has a good story set in the future but the science fiction element seems more like an excuse for exotic sets, costumes and special effects than an exploration of future themes.  If you go expecting something nerdy and professorial you will be disappointed.  If you are looking for a good shoot em up  at the movies, this is for you."}, {"rating": "8", "text": "Some of the writing may be ham-handed in its attempts to establish antagonism and build a message, but  even so  \"Elysium\" proves to be a thrillingly eye-catching sci-fi experience with a jaw-dropping performance from Sharlto Copley."}, {"rating": "9", "text": "I wish there was a way for users to delete reviews. I thought this was a great film but I want to delete the review under this profile, and so I write 150 words."}, {"rating": "10", "text": "Highly recommended, best original sci-fi movie released in a long time.  Great because it was a realistic future dystopia-- if anything, the world in 2154 will probably look a lot worse than what it depicted (overpopulated, disease-ridden and devastated by climate change), with scathing social commentary of the present day and gritty, kinetic action sequences/ great special effects to boot.  Ending was a little bit of a conventional letdown, and the film didn't spend nearly enough time exploring the fascinating setting and its implications.  Probably Blomkamp was already flouting too many stagnant Hollywood conventions that to go any further out of lamestream production values would make him a pariah.  Nonetheless this is the best movie I have seen in a very long time and was entertaining for every second of the ride."}, {"rating": "1", "text": "I don't know what I was expecting. Walking into the theatre watching a movie with Matt Damon (The Bourne Trilogy) playing the protagonist really is a type of contract. Still, for some reason I was expecting smart sci-fi, because this is after all the guy who made District 9, right? Well, except for the larger frame story (Rich People Escaped the Polluted Earth) there is no trace of what made District 9 good.\r This is a pure action movie, and if that is what you like you'll probably like this movie. For me, it was not what I expected. I did not expect watching Matt Damon running around firing different future-modded rifles for an hour. I did not expect the last half hour of the movie being one of those drawn out sequences where the protagonist is fighting towards the end goal ever so slowly. I did not expect this movie to be so insanely predictable.\r The worst part by far about this movie though is the characters. There is not a single relatable character in this movie, and I found myself several times really not caring what happened even to the cutest token child characters in the story. The most interesting character in this whole movie was the villain, who is a South African (the only similarity to District 9 in the whole movie) mercenary previously convicted of rapes and murders. Someone with a hint of script writing skills would have made this almost interesting character somewhat deeper by rounding off the edges of his \"Absolute Bad Guy\" persona, but that takes some thought, which is outside the objective of this movie.\r If you want to watch a good guy kill a bad guy and save humanity by shooting at stuff for one and a half hour, go watch this movie. If you're expecting anything like District 9, don't."}, {"rating": "7", "text": "Actually, I'd give this a 6.5 because it's got a few too many problems to be a solid 7 IMO.  While Damon is the best part of the movie (he was GREAT), there just wasn't enough Elysium life-style development (I was curious as to the details of how the habitat worked and what they did, but nothing was ever shown except for women lying by pools with their butler robots).  The only part of Elysium that was developed was the defense side, in which Jodi Foster was miscast, IMO.  She is a great actress but her in this role didn't feel right to me.  By the same token, not much was devoted to life on earth and how society operated in the future there either.  Lots of people running around looking poor, sick and dirty, but nothing much about how they survived.  TONS of action though, so I am guessing the guys will like this movie a lot.  But for me, it left too much out in favor of all the action."}, {"rating": "9", "text": "I never saw District 9, but I heard many good things about it. I really thought that Elysium looked good, so I went to see it.\rHow was the acting?\rThe acting in this film was overall good. There was a bad part, though, like Jodie Foster. Jodie Foster is a good actress, but in Elysium she was not good. She was pretty bad. She did not portray her character well at all, and had forgettable performance. Every syllable she said, she fidgeted. Her very also obviously audio dubbed. It was very easy to tell, and sometimes the movement of her lips didn't match the audio track. Matt Damon, Diego Luna, and Alice Braga did very well in this film, though; and Sharlto Copley stole the show. he played the main villain in this film and he just killed it. He was great playing the \"crazy guy\" and portrayed his character beautifully.\rHow was the writing?\rThere's not much I can say about the writing in Elysium, but what I can say is that is was writing very well. There were some sudden twists and turns, and maybe too many of them, but other than that, I liked the direction this film went. I do think Elysium changed a little too much, but that doesn't really bring it down that much. It also had realistic dialog, and a very satisfying ending. I really liked the ending of this film. It really surprised me.\rDid it have an interesting premise?\rBasically the main reason I went to see Elysium was because of its premise. I loved the premise. It took real world problems that we have today and made something happen with them. I know District 9 did that, too, but I can't compare Elysium to District 9. Anyway, I liked how at the beginning it showed how life on Elysium and Earth was, and how horrible things are. I also really liked the robot cops. The premise for Elysium was great.\rWas it entertaining or boring?\rThis film had a slow start and did have a very big switch from action scenes to slow part, but overall it was very entertaining. The slow parts were used to show how things were and show us the characters, but they weren't that interesting. The parts were more boring than they were interesting. The action scenes, though, were very cool. There was a little bit too much slow motion used, but it very cool action sequences; and they were intense, too, especially in the third act of the film.\rWhat things in particular did I like?\rI loved the premise of Elysium. The action scenes of this film were great. The acting in this film was mostly very good. I liked the direction this film went. I also thought the last act of this film was excellent. I think it was the last half and hour or so of the film. It was very intense, had quite a bit of excellent action, and mixed the right amount of emotion in the mix, too. The film was also very interesting, enjoyable, and entertaining for the most part.\rWhat things in particular did I dislike?\rI very much disliked Jodie Foster's performance in Elysium. It was more boring than interesting in most of the slow parts. It aslo changed direction too many times. I just had three problems with Elysium but all three of them were kind of big, making the film not excellent. That's all I disliked about Elysium, though.\rHow was it overall?\rElysium, despite my few problems with it, was a great film.\rDo I recommend this film?\rYes, I do strongly recommend Elysium to see at full price for anyone who is considering seeing it.\rWill I buy this film?\rYes, when this film comes out, I will buy it on Blu-Ray."}, {"rating": "8", "text": "Elysium doesn't benefit from being compared to District 9, as District 9 is smarter, has a better script, and is just smoother and cleaner; it has better flow. As a stand-alone action movie, Elysium is very good. It has great acting, great visuals, and is very exciting and thrilling. As a counterpart to the Oscar-nominated District 9? It just doesn't stack up. I really liked it, but I can't guarantee that you will."}, {"rating": "2", "text": "My son and I were really looking forward to this being a great movie.   With all the hype and marketing we thought this would be the best movie of the summer.   We both couldn't believe how disappointed we were.  I could write a book about why this was the worst movie we have seen this year.   I felt bad for Matt Damon being a part of a loser.  The premise was great but the execution was terrible.   I wish I could get my money back."}, {"rating": "2", "text": "So many interesting concepts just wasted for interminable fights you couldn't even see because the camera action was so bad. Jodie Foster should be ashamed of her performance. And the music sucked. What a waste of Matt Damon."}, {"rating": "9", "text": "Full of swearing and blood: my type of movie. Matt's act is acceptable. The robotic-arm joke dropped me from the seat, because of laughing. Good action and a nice story. Almost 10."}, {"rating": "8", "text": "You know the writers got the class warfare aspect of this movie across perfectly when you almost smile at the thought of Homeland Security's pet sociopathic murdering rapist rampaging through the space station where all the elite snobs hang out.  Yes, at one point they did use the words Homeland Security, in case somehow someone failed to get that Elysium represents America (or at least America's ruling elite) and impoverished Earth represents the rest of the world.  I'm all for a movie that captures the anger and frustration of have-nots gazing upon the intolerably selfish haves.  However, I prefer my class warfare with fewer plot holes.  First there is the usual problem of humans  going to work building robots that are fully sophisticated enough to build themselves.  Then factory worker and hard-bitten hero Max receives a lethal dose of radiation without becoming lethal to everyone around him.  As an aside, poor Max!  His troubles start with a beating from jackboot robots, which leads to the extension of his parole by his robot parole officer, and then goes from there to radiation poisoning.  Then things get really bad for him.  Now back to the plot holes, because there are many more.  First of all, I don't recall any reason the citizens of Elysium need the pitifully impoverished, desperately sick and injured people of Earth.  The people of Elysium are terrified of illegal immigrants invading their space station paradise, and since they are more than ruthless enough to deny the people of Earth assistance of any kind I see no reason why they wouldn't have dropped a few neutron bombs on the planet and been done with the problem long ago.  Instead it seems they're hoarding all the immortality for themselves while panicking when the occasional illegal reaches the station, breaks into a house, and obtains medical treatment.  The illegals reach Elysium thanks to a thriving black market in identification and disposable shuttles.  Very disposable.  The Irish coffin ships had better odds of making it to shore.  This operation is run by a guy who can't get his henchmen to abduct a citizen of Elysium and steal passcodes out of his head, so he gets Max to do it in exchange for a ticket to Elysium to cure the radiation poisoning that will kill him in five days.  The citizen Max decides to abduct is for some unclear reason slumming around on Earth heading up the robot manufacturing plant where Max, thanks to glaring worker safety issues, gets his lethal dose of radiation.  During the course of this we end up doing a stint in Johnny Mnemonic, with Max's head containing the secret to Elysium citizenship for all.  It seems that all anyone has to do to make everyone on Earth a citizen of Elysium is type in the command and reboot once Max's brain gives up the data (killing Max in the process).  Because any advanced society is just one hack away from being completely and irretrievably taken over.  Then to compound that plot hole, the movie ends with the now benevolent Elysium computer sending medical help to all of its new citizens on Earth.  If that was so easy then why didn't Elysium's government just do it in the first place and spare themselves the trouble of arguing with their sadistic Homeland Security head over whether to shoot the desperate immigrants out of the sky or just stomp them and send them back to Earth?  So why did I give this movie such a high score?  Because sometimes the theme and overall flavor of a story works even when the plot is swiss cheese."}, {"rating": "8", "text": "Visually stunning, some great action and gore to go along with it, Elysium had me on the edge of my seat for the most part of the movie. Great acting minus Jodie Foster. Could have used a better plot, but Ill take it. 8/10"}, {"rating": "7", "text": "Pretty standard sci-fi fare. It actually turned out quite a bit better than I had expected, but it still wasn't anything to write home about. The plot wasn't bad, but there were far to many \"convenient occurrences\" throughout the movie and the camera-shake was extremely annoying at times. Overall, not a bad movie, just nothing really new. Probably not theater worthy, but rental/netflix worthy."}, {"rating": "4", "text": "Despite a very interesting plot premise, Elysium is a very disappointing and unsatisfying film in every way possible. Weak plot ruined even more so by the unlikeable characters and uninteresting action scenes that fail to entertain. Would not recommend."}, {"rating": "4", "text": "The movie has an interesting setting, as most dystopian films do. WHat it lacks, however, is interesting characters, factions and dilemmas. Instead of being some sort of moral or ethical engagement, it just ends up being a platform for action-man Matt Damon to beat things up and cause explosions. Some people might like that. I personally wanted something a bit more thought provoking. Even a battle between different politically orientated faction would have sufficed, but all we got was what amounted to a cartel vs the World government, which was never named and was just shown to be run by the rich, end of story. What I am trying to say is that the movie lacked any kind of depth, I guess it was fine as some sort of dumb summer action flick, but it was just so average in it's delivery, I could see what it provided in any other movie at almost any other time. The film was not emotionally investing. Below average, but not specifically bad."}], "recommendations": ["lucy", "surrogates", "the_tomorrow_war", "chaos_walking", "what_happened_to_monday", "code_8", "infinite", "mortal_engines", "pompeii", "x_men_apocalypse", "limitless", "after_earth", "contagion", "captive_state", "stowaway", "the_purge_election_year", "battle_los_angeles", "sunshine", "taken", "in_time", "repo_men", "the_kingdom", "the_day_after_tomorrow", "project_power", "downsizing"]}