{
  "id": 1853,
  "title": "Emperor",
  "starring": [
    "Matthew Fox",
    "Tommy Lee Jones"
  ],
  "runtime": 105,
  "genre": [
    "Drama",
    "History",
    "War"
  ],
  "description": "As the Japanese surrender at the end of WWII, Gen. Fellers is tasked with deciding if Emperor Hirohito will be hanged as a war criminal. Influencing his ruling is his quest to find Aya, an exchange student he met years earlier in the U.S.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lKcRXcffQM2KxNruljrd7H3gUe5.jpg",
  "categories": {
    "plot": 6.090909090909091,
    "acting": 6.0,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Surprisingly someone like tommy lee jones has compelled with a war film and Peter Webber has made a film so special that anyone will cry at the climax. When I mean anyone I mean everyone."
    },
    {
      "rating": "2",
      "text": "After Japan surrendered in WW2 General Douglas MacArthur (Tommy Lee Jones) was sent to help rebuild the country and cement better relations among the two nations that fought each other  Along the way he has to find out how involved the Japanese Emperor Hirohito (Takataro Kataoka) has been in the bombing of Pearl Harbor and the actual war. He puts General Bonner Fellers (Matthew Fox) in charge of the investigation, giving him 10 days to investigate and come to the conclusion whether the Emperor should be held for war crimes and possibly executed.\r In “Emporer” we find a country in ruin except for the royal palaces of the ruler which has maintained its splendor but it is never explained how, which would have made for  a more interesting story. Instead we have a mostly fictionalized story of General Fellers and a Japanese woman before the  war and his search for her afterwards.\r There are some examples of the different ways the two countries, and the people who lead them, are but not enough not hold the audience’s interest.  There are hints of the politics back in the States and those who want the Emperor executed. There is also reference to  the possibility that MacArthur may run for President.\r Tommy Lee Jones isn’t on screen long enough  but he snaps off his lines so sharply that you wish he had made a longer appearance. Matthew Fox has the longer, starring role but isn’t very commanding in the role of a General and the love story is a complete waste. The screenplay by David KLass and Vera Blasi is far from interesting or even suspenseful regarding what will be the final report on the Emperor. The direction by Peter Weber just sits there.\r For whatever reason all I could think of was the Marlon Brando movie “Saynora” which would be worth more of your time."
    },
    {
      "rating": "2",
      "text": "I knew that Tommy Lee Jones as MacArthur was probably the worst miscasting since the invention of the motion picture.  But I hoped for a miracle, that somehow that old dogfaced Texan could transform himself into the patrician MacArthur.  He couldn't.  It was simply awful.  But bad as that was, and it was really bad, it wasn't as bad as the script.  You were led to believe that the movie was going to be about MacArthur's administration of postwar Japan  a fascinating chapter in that complicated man's history and in Japan's, deserving of a historically accurate and well-acted movie, in the manner of \"Lincoln\" and Daniel-Day Lewis.  Instead, it is about the very beginning of that chapter, a brief period of a few days in which a subordinate of MacArthur's is tasked with ascertaining the guilt of Emperor Hirohito in the war.  As anyone who has read \"Shogun\" knows, Japanese emperors are figureheads who are revered but not expected to actually interfere with prime ministers  rather like the British monarch, but with a lot of pretense about his authority he doesn't really have  which damn near got him hung at the end of WWII.  Stretching that important judgment over a full-length movie might have worked if the history justified it, but it didn't.  So the makers went completely off on some romantic subplot, just as the makers of \"Midway\" did almost 40 years ago, evidently just to kill time.  When watching that otherwise estimable movie, I always have to fast-forward past the totally irrelevant melodrama.  This melodrama tries to introduce some relevant cultural history out of the mouths of the mooning melodramatis personae, but it's not enough to justify their presence. And then there is the ridiculously implausible drunken fistfight that the main protagonist, a one-star general, gets into because he's mooning over his lost girlfriend.  What an embarrassment.\r As is this entire movie, except for the dignity lent by the characters of the Japanese officials.  They make you pine for the good movie about that era could have been made."
    },
    {
      "rating": "8",
      "text": "Based around a dark time in both Japanese and American history, Emperor is a subtle and beautiful story of a return to normalcy and the empathy that can come from anyone, even one of your worst enemies.\rEmperor follows General Bonner Fellers (Matthew Fox)  a man who lived in Japan prior to the war and is given the decision of whether or not the Emperor of Japan should be tried fro war crimes, a decision he is to make under the close inspection of General Douglas MacArthur (Tommy Lee Jones). Emperor doesn't even attempt to create tension when it comes to Fellers decision as the film isn't really about history but one mans attempts to console himself with his past and move on. The film creates tension by showing through flashbacks the relationship between Fellers and a Japanese woman he met in the states. As Fellers searches for his past love, someone he hasn't seen for a long time, the film shows a moving love story that is infused with some of the beauty of the country that is now in ruins. The film really isn't about the Emperor at all and it certainly isn't about Fellers quest either, its a rather simple story of  how Fellers past relationship and his search for historical context regarding his decision helps him find answers to some of the questions that plague any man who has done horrible things and lost things along the way. The film proves to be extremely interesting thanks to the fact it turns both America and Japan into villains from the get go making them both culpable for the atrocities they have committed. The difference is that by setting the film in war torn Japan the film shows everything the war has caused by the Americans, the state of a once prosperous happy country that is one execution away from total collapse. The film is a love letter to Japanese culture and a love story well worth watching as Matthew Fox is a captivating actor and gives a revelatory performance well worth recognition. The film is a story not just about the past but about the future as it shows two countries in flux, Japan awaiting news of their fate and America trying to justify their actions having just committed one of the worst war crimes in history. Trying to find some kind of redemption even though they have made an indelible mark on a country it had already ravaged."
    },
    {
      "rating": "5",
      "text": "Good perforances but not much else can be sad about The Emperor."
    },
    {
      "rating": "5",
      "text": "An interesting dramatic take on the people and affairs of the time.  Roughly a third of the movie is dedicated to a romance that becomes central to the character.  It seems to me entirely invented but it only detracts from the movie if one is looking for a documentary.  The epilogue seemingly implies that Fellers is demoted related to his report or actions in the film.  In reality this was not the case, many generals were reverted to colonel at the end of the war and Fellers was reinstated to the retired rank of brigadier general in 1948.  Also the film mentions he was awarded the \" Second Order of the Sacred Treasure\" but strangely does not explicitly state that this was an honor awarded by Emperor Hirohito.  Which I think makes it all the more unique and meaningful."
    },
    {
      "rating": "0",
      "text": "This movie is seriously rubbish, seems just like a typical weeaboo movie. It is seriously biased towards the japanese where they are trying to justify their bloody actions happened during the World War"
    },
    {
      "rating": "6",
      "text": "I liked this movie.I am from Japan.I know the history.I am a World War 2 buff.I really enjoyed it. However, if you know nothing about the Pacific War and allied troops occupation. You may sleep. I strongly recommend people who like Japan, history and war movie."
    },
    {
      "rating": "4",
      "text": "I loved seeing the behind-the-scenes historical information brought to life. And the fact that Japans emperor was saved by the love of a Japanese girl for an American. How ironic. Excellent movie."
    }
  ],
  "recommendations": [
    "letters_from_iwo_jima",
    "free_state_of_jones",
    "a_united_kingdom",
    "american_sniper",
    "seven_years_in_tibet",
    "apocalypse_now",
    "22_july",
    "munich",
    "the_pianist",
    "race",
    "the_lost_city_of_z",
    "platoon",
    "the_imitation_game",
    "lone_survivor",
    "the_mauritanian",
    "snowden",
    "13_hours_the_secret_soldiers_of_benghazi",
    "the_hurt_locker",
    "full_metal_jacket",
    "the_33",
    "gone_with_the_wind",
    "patriots_day",
    "green_zone",
    "darkest_hour",
    "valkyrie"
  ]
}