{"id": 4870, "title": "Empire of the Sun", "starring": ["Christian Bale", "John Malkovich"], "runtime": 153, "genre": ["Drama", "History", "War"], "description": "Jamie Graham, a privileged English boy, is living in Shanghai when the Japanese invade and force all foreigners into prison camps. Jamie is captured with an American sailor, who looks out for him while they are in the camp together. Even though he is separated from his parents and in a hostile environment, Jamie maintains his dignity and youthful spirits, providing a beacon of hope for the others held captive with him.", "releaseYear": "1987", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/tU7NpwxpX3W6Vpgu2hWQfQKizMo.jpg", "categories": {"plot": 7.5, "acting": 8.454545454545455, "ending": 8.666666666666666, "soundtrack": 4.0, "cinematography": 7.0, "familyFriendly": 8.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "Another classic drama film detailing the atrocities of war and it's effect on a young Christian Bale. The film centers around Japan during World War II and a boy who was separated from his family in the ensuing chaos. So much emotion is displayed on film, it's hard to get through without shedding a tear."}, {"rating": "10", "text": "I don't know what the stupid critics were talking about, that movie was awesome, another one of Speilburg's great works."}, {"rating": "10", "text": "my best child/teen movie, and is still in my top 10 movies what i seen in my life."}, {"rating": "9", "text": "A beautifully woven tale with historical significance.  Steven at his very best in my opinion.  War viewed from the sidelines during simpler times but no less brutal."}, {"rating": "10", "text": "When this film was released in 1987 I couldn’t understand the negative reviews of a movie that was so intensely captivating.  Christian Bale gave the best performance of any child actor I’ve ever seen. It was clear he is a great actor, and his career since then has proven that. I predicted that some day Empire would be re-evaluated and get the respect it truly deserves. That has come to pass."}, {"rating": "7", "text": "Lush and beautiful, Empire of the Sun is a very good coming of age film and tale on the loss of innocence during war times. With a fantastic performance from a young Christian Bale, the film also sports phenomenal cinematography and strong writing that really make for a solid film. That said, the film is held back from being truly great by a few things. As the film is told from Bale's perspective and he is a child, obviously things can become unclear. In terms of a film, this can be a bit annoying as you feel as though you never really receive the film picture or scope of the proceedings. Additionally, the film can be quite slow. I have no problem with slow films, but there were a few times of this 150 minute runtime that the film did drag. This happens enough to hamper the film a bit. Fortunately though, Empire of the Sun is lovingly crafted and a thoroughly well made war film. Even if it does slack at times, it still more than accomplishes its goal and is a really moving look at WWII and is particularly compassionate towards the Japanese, which is a nice touch."}, {"rating": "10", "text": "dont got much to say but this is one of my child hood films and now knowing its name Uggggh its just a good film  i would suggest you watch it Spoiler alertThis film is good"}, {"rating": "10", "text": "Empire Of The Sun is the same like The Color Purple, something that you will never guess to be directed by Steven Spielberg, and it's another Masterpiece, it's powerful, it's heartbreaking, and it's incredible, fills with tremendous performance by everybody, amazing score by John Williams, Empire Of The Sun is so far my second personal Spielberg's best and definitely one of Spielberg's Best."}, {"rating": "10", "text": "An awesome movie with a truly mesmirizing performance by Christian Bale."}, {"rating": "10", "text": "This movie has haunted me for years as a solemn, heart-rending experience. Jim's reaction to the appearance of the P-51s and his final reunion are unforgettable. I can't think of anything NOT to like about this movie."}, {"rating": "10", "text": "This movie is one of my all-time favorites. It is, indeed, \"haunting: as the above person mentioned. Christian Bale's performance is amazing, especially given that he was just a child at the time. There is such depth to his character-what he says and doesn't say throughout the movie. I highly recommend this film."}, {"rating": "10", "text": "Love this movie and a best world war 2 film ever yet. Don't know how critic respond to the film."}, {"rating": "10", "text": "Gorgeous and touching. Definitely one of my all time favorite movies."}, {"rating": "9", "text": "I really enjoyed this movie and i think it's great."}, {"rating": "9", "text": "This definitely one of Spielberg's best, I don't care what Gene Siskel said, this is way better than Hope and Glory that wasn't very good."}, {"rating": "6", "text": "Steven Spielberg's lesser known wartime drama \"Empire Of The Sun\" brings the semi-autobiographical stylings of J.G. Ballard to the big-screen, with then up-and-comer Christian Bale doing the heavy lifting as the young protagonist who loses track of his family and subsequently succumbs to the harsh realities of human hardship. And, to be absolutely sure, Christian Bale commits to the role entirely, offering up an incredible performance for anyone, let alone that of someone at such a young age at the time. In fact, all of the acting is up to snuff. Where this movie falters, I find, is actually in that of one of its primary intentions. Part of the movie's aim is to really drive home the desperation and exhaustion on the part of the film's main character. In relating the devastation and pain at hand -- especially towards the end of the film -- the movie does this a bit too well, in my opinion, ultimately allowing things to dip in terms of entertainment value. Granted, this isn't necessarily a movie that's supposed to entertain you, but my engagement suffered nonetheless."}, {"rating": "10", "text": "Outro filme que não glorifica a guerra e mostra o caos que provoca. Apenas lembrar que muitas crianças perdidas não tem a mesma sorte do final deste filme."}, {"rating": "8", "text": "Based on the eponymous book, it may not be up to the best dramas of World War II, but in its favor it has a story that captures the interest of the viewer, especially due to the participation of a very young Christian Bale. With about 20 minutes of footage it would have been better."}, {"rating": "1", "text": "Spielberg se lance dans une sorte de grande épopée historique du côté du Soleil Levant, lequel vient vient d’envahir une bonne partie de la Chine… On y suit un gamin anglais pris dans la tourmente des évènements et incarné par… Christian Bale !On y croise aussi John Malkovich et le moins connu mais très estimable Joe Pantoliano mais qu’importe… car le gros machin de Spielberg dépasse les deux heures et demi et se révèle à la fois aussi crédible et aussi palpitant qu’un épisode entier de Derrick qui viendrait d’épouser Julie Lescaut en apnée et sans pop-corn.Malgré les moyens déployés et sa mise en scène appliquée (mais très scolaire), le réalisateur américain bien connu qui a débuté dans les années 70 et qui semblait prometteur a régulièrement fait faux bond ! et ça ne s’est par arrangé avec le temps, bien au contraire.Cet « Empire du Soleil » en est un exemple particulièrement frappant et consternant avec son remplissage à bailler d’ennui, sa naïveté incurable et ses invraisemblances innombrables. Spielberg est sans conteste ce que le cinéma américain fait quasiment de pire et est au 7ème art ce que le MacDo est à la bonne bouffe : son « Empire du soleil » est un gros big mac qui vient de se suicider en sautant de la table, sur lequel on se fait une joie et un devoir de marcher dessus. Avec nos grosses rangeos du surplus américain."}, {"rating": "7", "text": "Out For A Walk.Empire Of The SunSpielberg's symphony on the disastrous incident has a young heart pulsating among the cold sinister world. To drive an entire more than two hours of a film with a kid on the lead role to speak of a tale that is bizarrely horrendous and gloomy to be palpable. But then this is Spielberg's strongest genre, and the reason why his take on war over the year has created such a jarring effect on the viewers is to his gore yet clean vision. There is undoubtedly inedible sequences as the concept suggests and demands, but his little tactics through which he scales the depth of the water, is to be admired in here.Barring no restraints on taking the storyline to various places and wider ranges, the consistency is kept alive through familiar faces that shows up every now and then like surfing through different channels. Spielberg's world is not dependent of any medium, as the war should be, and through physical sequences with using less words as possible, he demands attention of the viewers on a much larger scale. Bale, upfront in the field, marching without any flags or troops, is a committed floating bubble that narrates this resistance fluently.Among all the harrowing images shown, one of the worst ought to be Bale's innocence being ripped off in the field to almost nothing. And it's that journey of nothing to existence, if not meaningful, that arcs up a magnificent moon on the screen; a pure brilliance. But all the good bits aside, there are times where the film sinks too much into the semantics of it to brew the bittersweet essence of the tale. Nevertheless, Spielberg's second World War triumph claimed Empire Of The Sun has a white bright light that Bale sees it and so do we."}, {"rating": "4", "text": "The concept - 10, soundtrack - 9, the AI - 1. The game has an interesting take on the actual financial management of your \"enterprise\". Yet the whole \"gangstering\" thing is soooo primitive - hey go two houses to the left enter the house, here is your brewery. 20m from there another house - that's your casino. Some random guys just pop out of nowhere - these are gangsters you can recruit. I could not shake the feeling it is a mobile game really..."}], "recommendations": ["apocalypse_now", "hacksaw_ridge", "12_years_a_slave", "the_last_samurai", "gone_with_the_wind", "braveheart", "the_deer_hunter", "the_pianist", "first_they_killed_my_father", "hotel_rwanda", "american_history_x", "gladiator", "darkest_hour", "the_imitation_game", "1917", "unbroken", "master_and_commander_the_far_side_of_the_world", "hostiles", "eyes_wide_shut", "the_last_king_of_scotland", "life_of_pi", "the_fountain", "war_for_the_planet_of_the_apes", "the_master", "upside_down"]}