{
  "id": 1084,
  "title": "Enchanted",
  "starring": [
    "Amy Adams",
    "Patrick Dempsey"
  ],
  "runtime": 107,
  "genre": [
    "Comedy",
    "Family",
    "Fantasy",
    "Romance"
  ],
  "description": "The beautiful princess Giselle is banished by an evil queen from her magical, musical animated land and finds herself in the gritty reality of the streets of modern-day Manhattan. Shocked by this strange new environment that doesn't operate on a \"happily ever after\" basis, Giselle is now adrift in a chaotic world badly in need of enchantment. But when Giselle begins to fall in love with a charmingly flawed divorce lawyer who has come to her aid - even though she is already promised to a perfect fairy tale prince back home - she has to wonder: Can a storybook view of romance survive in the real world?",
  "releaseYear": "2007",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8KCNzCArLlvLdQoHx6npua2VSVc.jpg",
  "categories": {
    "plot": 8.285714285714286,
    "acting": 7.857142857142857,
    "ending": 6.666666666666667,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 7.916666666666667,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I was entertained beyond my expectations. The plot has more substance than you might expect, and deals with themes of real love and being a strong woman. There were audible \"yucks\" from the children in the theater, however, during the kissing and during one scene where the would-be princess touches Mc Dreamy's chest. That aside, my young daughters said that they enjoyed the movie. I nearly cried a couple of times. Worth seeing, in my opinion."
    },
    {
      "rating": "9",
      "text": "How can you not love this film? Sit back, relax and be totally Disnified. I had a bad day at work and by the time I left I was singing a happy tune. Great for kids or grown-ups. Just go see it."
    },
    {
      "rating": "10",
      "text": "Greatest movie of all time! Ever!"
    },
    {
      "rating": "9",
      "text": "I think amy adams does a wonderful job in this movie, spot on with the mannerisms of a cartoon princess! loved it."
    },
    {
      "rating": "10",
      "text": "Simply one of the happiest, warmest films in years. I just loved it!"
    },
    {
      "rating": "9",
      "text": "A wonderful, cheerful film that, for a change, has no bitter, sardonic edge. Really enjoyable for everyone, and will help older folks recover some of the simple joy of living they thought they had lost."
    },
    {
      "rating": "10",
      "text": "This is a Disney Classic allready! I can see myself owning this and watching it with my kids that I havn't even had yet!"
    },
    {
      "rating": "8",
      "text": "Very Enjoyable! At times laugh out loud funny! Innovative and touching... a great date movie!"
    },
    {
      "rating": "9",
      "text": "A brilliantly charming, funny film that will melt your heart. I took my wife and three teen daughters to this flick for a family night out, expecting to sit though another Disney \"tweener\" flick. I was not prepared for how thoroughly entertaining this movie turned out to be! There is something for everyone from ages 4 to 70. Amy Adams is astounding, as she brings to life every sound and body movement of a prototypical Disney animated princess (Belle, Ariel, Snow White, etc). Most surprisingly though, is there is even a Disney-clean, but still very moving, grown-up love story for parents who take their kids to see this. My bet is that once the word of mouth starts, this will be a huge, huge hit."
    },
    {
      "rating": "9",
      "text": "The movie was very enjoyable for both adults and children. A great \"feel good\" holiday-time movie. I would recommend this for a good family-time movie."
    },
    {
      "rating": "10",
      "text": "Hilarious, touching, romantic and catchy, Enchanted is the best musical-comedy-romance I've seen in a long time."
    },
    {
      "rating": "10",
      "text": "Best movie of 2007 by a long, long way. Unless you hate fun, laughter and tears of joy, you owe it to yourself and your entire family to watch Enchanted. At least once."
    },
    {
      "rating": "9",
      "text": "What can I say about this movie its simply enchanting.The film is bascially about a cartoon princess named Giselle who is banished by an evil Queen to modern day NYC in human form and falls in love with a single father who works as a divorce attorney in New York. Although she's got the best of both worlds but she has to choose one and also to find out who she really loves Robert(Dempsey) or Edward(Marsden) Amy Adams was brilliant as the soon to be princess Giselle who is transformed into a real life woman in Times Square nyc and Patrick Dempsey was a real prince charming in this movie it was the only movie that I actually liked him in as he is a bit overrated. The whole story is magical and it will make you feel like a kid again by looking at the references in the film and the music which is composed by the two guys that did music for The Hunchback of Nortre Dame and Pocahontas(Alan Menken & Stephen Schwartz)was brilliant I loved all the songs and the instrumental pieces. James Marsden who played/voiced and sang as Prince Edward was hilarious in this movie. He acted like he was spoofing Jim Carrey he was that good. The ending was rather predictiable as Giselle chooses Robert over Edward,but having said that it is definetly one to watch again and again if you are like me a fan of Disney fairytales like Beauty & the Beast,The Little Mermaid,Snow White & Cinderella then this film is for you. If you are a guy then don't bother as you will find the characters annoying and you probably say its stupid. But if you are a girl that wants something to keep her mind relaxed and fancies Patrick Dempsey or if you like stuff that will bring you to another world then this is for you. Susan Sarandon I found was a bit dull in this film as she was only in the live action world for like 15 mins. The dragon scene was ok nothing like Spiderman or whatever but still its my all time favourite film and like I said in the first line its brilliant and enchanting. And who can forget that cute chipmunk Pip and Morgan who was adorable. My only downside I had to this film was that there was alot of errors that can easily be spotted with the corner of your eye and it can be unsuitable for chiildren who are like 4 years old as Giselle feels Robert's chest and there is an odd scary scene. I'd say that this film is catered for 12 up as its not aimed at younger children(except for that chipmunk) but having said this its a fantastic movie. 9/10"
    },
    {
      "rating": "7",
      "text": "\"Enchanted\" is dumb and childish. That's why I loved it."
    },
    {
      "rating": "5",
      "text": "Sometimes you feel that a lot more could have been done with this idea."
    },
    {
      "rating": "10",
      "text": "'Enchanted' is such a romantic fantasy story/movie. There is a Princess called Gazelle and a Prince called Edward. But then she comes into the real world leaving the cartoon world. My favourite part is when Gazelle meets a man. I forgot what his name is. Anyway, what was I saying now. Oh yeah! The man decides that Gazelle should stay with him for a little while. The little girl decides that Gazelle should stay for a little while as well. I'm sorry but I don't know all these names. I think 'Enchanted' is the bestest movie. Well, I have got some other best movies but still it's the bestest movie. The other best movies are Open Season, Flushed Away, Garfield comes to the real world, Like Mike, Scooby Doo, Monsters Inc; Bee Movie and last of all Step Up 2: The streets! WOW. That is a load of films that I like there. And I might still have some more films but forget all about those films that I watch/like. See ya laters!!!!"
    },
    {
      "rating": "3",
      "text": "Realism is off, an animated world enters the real one, eventually you will intend to consider that the whole thing is animated through the amount of affects, designs, direction, I was never captured by this truly moving picture."
    },
    {
      "rating": "8",
      "text": "As long as you understand your viewing a Disney movie, this a very fun movie."
    },
    {
      "rating": "7",
      "text": "I'm a teen and i thought the movie was okay for its type of genre. It's more of a tweenish movie; ages 6-10 might enjoy it. Even if your a little older, the movie is actually not as bad as i had imagined. It's not totally boring, but on the other hand, it's the general family movie that parents, teens, tweens, and young children want. I can't say that i loved it, but i give it credit for making me actually say that it actually a good movie. Not for teens, and not really for tweens (10-11), but younger kids might take this movie to the heart."
    },
    {
      "rating": "5",
      "text": "At the ball, Giselle(Amy Adams) is finally able to differentiate real love from storybook love when Robert(Patrick Dempsey) meets her gaze, and it's such a perfect moment, ironic, too, because a crystalline moment that pure and unadulterated is indeed storybook in nature. \"Enchanted\" enchants, finally. Before the swoon, however, this near-miss movie is hampered by lazy writing. \"Enchanted\" doesn't properly address the shock an animated character would experience upon entrance into the real world. For example, when Giselle falls from some scaffolding, the film fails to acknowledge that a cartoon figure would never experience physical pain in their animated realm. In Wim Wenders' \"Faraway So Close\"(the sequel to \"Wings of Desire\"), an angel sees his blood for the first time. \"Enchanted\" would be far better if Giselle was just a tad more existential, and inquistive about the differences between both worlds. The real world doesn't acknowledge the existence of animated films. When Prince Edward(James Marsden) uses the television remote, he never encounters the world of his previous incarnation as an animated figure. \"Enchanted\" doesn't want to get too complicated, which is an insult of sorts, because this film is obviously for young girls. There's also an insidious anti-feminist ideology at work, too. Rather than be a smart woman like Mata Hari, or a strong woman like Rosa Parks(from a book Robert gives Rachel(Morgan Phillip) on her birthday), the young girl is confronted with a princess as her primary role model. Well, I'll shut the hell up now. \"Enchanted\" is redeemed by an ultra-romantic ending."
    },
    {
      "rating": "2",
      "text": "Major disappointment from Disney. very lazy, dull, lacklustre film. Characters are not well developed and no chemistry exists between the lead pair. Boring. Best movie to avoid."
    },
    {
      "rating": "4",
      "text": "I loved Amy Adams in JUNEBUG, and was so hoping she'd hit this out of the park. She's the best thing in it, no doubt,;but in the end it's still a fantasy piece in a mythical unrecognizable Manhattan without much charm because it lacks sass. Overall, a disappointment."
    },
    {
      "rating": "0",
      "text": "Corny. A butchery of every fairy tale we grew up loving. Is this what Disney amounts to now?"
    },
    {
      "rating": "0",
      "text": "Terrible. Even for a children's movie."
    },
    {
      "rating": "0",
      "text": "This movie **** sucked, I hated it, it makes watching grass grow interesting. What the hell was the director's problem making this box office piece of ****"
    },
    {
      "rating": "3",
      "text": "When I seen the trailer, I thought the movie was funny and original. The movie was original enough but then I realised they already shown all the funny bits in the trailer. And finally, this movie was horribly cheesy."
    },
    {
      "rating": "5",
      "text": "I feel more disconnected than Enchanted, despite some delightful sequences."
    },
    {
      "rating": "8",
      "text": "Enjoyable movie. Make beleive comes to New York.....isn't that ironic."
    },
    {
      "rating": "10",
      "text": "this is an extremely interesting and funny film.i just love it!after watching the film it became one of my favourite films. while watching it with my family we had such great fun."
    },
    {
      "rating": "10",
      "text": "This is an absolute adorable movie. This movie took a fairy tale like story and modernized it. Although it changes from cartoon to real life it is an enjoyable film for everyone. It was nice to see a movie that was not all about violence and sex. This a great movie for kids as well as adults. This movie filled with warmth was definitely worth my money."
    },
    {
      "rating": "9",
      "text": "My friend and I enjoyed this fanciful musical comedy immensely. The mix of adult and child humor is spot on and engaging. All the casting is wonderful but the movie hinges on Amy Adams and she pulls it off to a T, playing the soon-to-be-princess with just the right tone. Dempsey does a solid job, too and Sarandon is terrific as the meanie with support from Spall. The squirrel's antics in NYC are laugh-out-loud funny. The story is spare but the visuals and backstory fill it out and the movie surprisingly ends up being empowering as well as optimistic. The production reminds me of Mary Poppins but with better CGI. If you like that and other musicals you will likely love this and count it a potential classic."
    },
    {
      "rating": "9",
      "text": "Good movie for adults as well as children."
    },
    {
      "rating": "8",
      "text": "When an animated fairy tale princess (Amy Adams) winds up in a live-action reality, the result is destined to be entertaining. And"
    },
    {
      "rating": "6",
      "text": "The begnning is cute and Amy Adams stays in character pulling it off, the rest of the enchanted cast not so and the ending bombed, Susan Saradon was mediocre. A shame they did not develop a characters or a strong story line. Although the Alan Menken songs are terrific."
    },
    {
      "rating": "10",
      "text": "True completion of the art style of Disney profession, this spedazzler is just as magical as the Harry potters with humor and thrills."
    },
    {
      "rating": "7",
      "text": "An outragouse quirkster throughout, nothing spectacular, not a classic, just given by the evolution of creativity of the improvement over the years to show how much the world of movies has done to itself, a little much, but satisfaction always wants more."
    },
    {
      "rating": "10",
      "text": "Laughed out loud and even shrieked a few times at Giselle's naivete. As a Disney fan and New Yorker, I inevitably adored this movie. Please try not to be so jaded that you feel it is necessary to dismiss this type of entertainment. Give in and just enjoy it for what it is: satire/comedy/romance/musical/fantasy."
    },
    {
      "rating": "9",
      "text": "A beautiful classic Disney story"
    },
    {
      "rating": "10",
      "text": "Took 6 kids, boys and girls, 4 to 14, and 2 adults. All laughed, were fully entertained. Shrek like combo of kid and adult humor. NYC used effectively. Disney pokes fun at itself. Not too scary. A pleasant surprise with actual character development."
    },
    {
      "rating": "10",
      "text": "It had very cool characters. I really cracked up.I had a very interesting ending because the fight.I liked how the prince and Nancy and Robert and the Giselle got married.It was one of the best movies I have seen in my life Ari neugeboren and Eric Neugeboren-"
    },
    {
      "rating": "10",
      "text": "One of the greatest flicks I've ever seen. I especially liked the part when the incredible met the guy in New York City! Wow! that was the coolest piece of film making I have never seen."
    },
    {
      "rating": "9",
      "text": "The three leading actors -- especially Adams and Marsden -- are superb. Everything is cleverly conceived and executed. A little corny, maybe, but sometimes the best things in life are corny if you're honest about them."
    },
    {
      "rating": "6",
      "text": "Very funny movie that was enjoyed by all of my family. Just be prepared for it to all fall apart towards the end. Could have been a classic."
    },
    {
      "rating": "10",
      "text": "Brought the husband, 6 and 9 year old boys and loved it. The audience clapped at the park sequence. Lovely! We had a great time. Just loved it!"
    },
    {
      "rating": "8",
      "text": "Very, very cute. Engaging. A post-modern Disney fairy tale."
    },
    {
      "rating": "2",
      "text": "How any critic can compare this to Hairspray only goes to show that many critics today have their heads up their asses.There was nothing that made this film special.The design work both Costumes and Production Design were lazy to say the least. James Marsden was the only saving grace here in a pedestrian piece of crap. Susan saran Wrap was beyond terrible. If I remember correctly the only original piece of this film were the end credits."
    },
    {
      "rating": "10",
      "text": "An absolute treat! Amy Adams was brilliant as the princess! If you ever wondered how the whole Disney princess thing translates into modern day NYC go see this film. It's hilarious! It also showed how Disney can keep things fresh. It's original and will become one of Disney's classics along the lines of Cinderella and Bambi."
    },
    {
      "rating": "7",
      "text": "I liked the Pop-Up Book blends in several scenes, but felt the movie should have made more of the \"Fish Out Of Water\" aspect with the film going from animation to real -life of the two central characters. Our 8 year old grandson gave it a 5 out of 10. Maybe it's target audience is more little girls than boys, although I doubt it. Not bad at all , but largely forgettable in the end."
    },
    {
      "rating": "10",
      "text": "In Enchanted Disney recaptures the magic it had lost years ago, it has a feel good story and the performance of Amy Adams is a must see."
    },
    {
      "rating": "8",
      "text": "I was dragged to this by my wife and i admit that it was charming and Amy Adams proves JUNEBUG was not a fluke."
    }
  ]
}