{
  "id": 4297,
  "title": "End of Days",
  "starring": [
    "Arnold Schwarzenegger",
    "Gabriel Byrne"
  ],
  "runtime": 121,
  "genre": [
    "Action",
    "Fantasy",
    "Horror",
    "Mystery"
  ],
  "description": "On 28 December 1999, the citizens of New York City are getting ready for the turn of the millennium. However, Satan decides to crash the party by coming to the city  and searching for his chosen bride — a 20-year-old woman named Christine York. The world will end, and the only hope lies within an atheist named Jericho Cane.",
  "releaseYear": "1999",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pY8FbKKl3VD0jRI1iDFrwN6alLa.jpg",
  "categories": {
    "plot": 6.384615384615385,
    "acting": 7.75,
    "ending": 7.6,
    "soundtrack": 8.333333333333334,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 7.428571428571429
  },
  "reviews": [
    {
      "rating": "9",
      "text": "There is a scene which depicts the dropping of a cigarette into a flammable liquid, which the camera follows as it burns. This scene is similar to a scene in The Usual Suspects (1995), also featuring Gabriel Byrne and Kevin Pollak."
    },
    {
      "rating": "9",
      "text": "It's New Year's Eve in 1999 and the devil is walking the Earth looking for a specific woman to have his baby so he can bring about the end of the world but it falls to an alcoholic detective with a dead family to stop this from happening."
    },
    {
      "rating": "9",
      "text": "Epic action and horror, one of Arnold's must see thrillers. _____________________________________"
    },
    {
      "rating": "9",
      "text": "Arnold Schwarzenegger's first film since Batman & Robin (1997). The reason for the gap was because of his heart surgery after playing Mr Freeze; the studios were anxious about whether or not they could insure him, and despite attempts to convince them he was in perfect health, he couldn't get any work until End of Days (1999). Even then, he was amazed when insurance people and executives from Universal came to the set just to watch him, to see if he was still up to the action scenes. They asked Schwarzenegger if he enjoyed this kind of punishment, but he said he was used to it. After the first week of shooting, the insurance guys backed off and not long after, the film offers started rolling in again."
    },
    {
      "rating": "7",
      "text": "i like arnold,he should have stayed in acting. from what i read he bombed as governor. this movie is one of his weakest, hence the \"7\". half the high rating is because he literally throws himself on the sword.  i'm catholic."
    },
    {
      "rating": "8",
      "text": "La pelicula esta muy bien la verdad antes de dar puntos positivos y negativos decir que la pelicula es mas de 7 que de 8 pero el 8 esta para mantener la nota positiva y que se defienda como buena pelicula ya que los criticos le pusieron malas notas sin merecerselas la cinta la verdadPuntos positivosEl personaje del diablo es muy bueno y esta extremadamente bien ya que es todo lo que representa el diablo que es capaz de manipular, engañar entre otrosLos efectos especiales y las escenas de accion estan muy bien conseguidos para la epoca es pura acción sobre todo la escena en la que jericho que es el protagonista se enfrenta al demonio en un tren y la escena de la casa que es espectacular y muy tensaTambien tiene elementos de terror muy bien implementados por ejemplo al principio cuando vemos las visiones de christine (que es la otra protagonista y en quien se centra la trama junto con jericho) emplea momentos de terror psicologico como las visiones que solo ve ella que quedan muy bien y cuando se encuentran los cadaveres al principio de la peliculaEl personaje de jericho es el mejor de todos ya que se nos presenta al principio como un personaje derrotado por la vida por las cosas que le han pasado como la perdida de su mujer y hija y que nos demuestra la película como evoluciona el personaje y como va recuperando su fe.Otro punto muy bueno es que no se sienten seguros y la sensación  de que es una situación muy jodida para ellos por que todos los satanicos les persiguen para entregar la chica al diabloPuntos negativosLa iglesia que al principio da muchos problemas a los protagonistas por que quieren matar a la chica y ya cuando la situacion se descontrola y consiguen coger a la chica la iglesia no hace nada y tiene que ser el protagonista solo el que vaya y te quedas pensando por que no le ayudan ni nada por que por ser pecado no es por que en la primaera mitad de la pelicula querian matar a la mujerHay cliches que se usan siempre como por ejemplo el de el secuestro de la chica al final y tiene que ir el protagonista a rescatarla y el de el tipico combate en el ritual Tampoco me ha gustado mucho el final ya que es muy bueno y bonito pero queda un poco abrupto pero este seria coger con pinzas por que para algunos sera muy buen final como me parece a mi pero a otros igual les parece muy abruptoQue se diera tanta importancia a la policia negra ya que no aporta practicamente casi nada"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "6",
      "text": "Not really good. But not really bad either. Perhaps leaning on the side of decent. It was nice to see Schwarzenegger playing a character with a bit more depth (and not pregnant) for a change. Acting is decent. alround with Schwarzenegger & Byrne doing a decent enough job with what they were given. The story on the other hand is nothing we haven't seen before and it has been done better. A rather poorly written script that really rushes the movie along too quickly with far too much exposition coming from the weirdest places.\r Overall:\r On okay movie that is worth a watch if you have nothing better to do."
    },
    {
      "rating": "6",
      "text": "The devil has returned to Earth to claim his bride and bring about the end of the world, and only one man has the power to stop him in END OF DAYS! END OF DAYS feels like a dumbed down version of ROSEMARY'S BABY or THE OMEN, an opportunistic attempt to cash-in on the turn of the century paranoia that tries to mask its failing script behind big names and explosive special effects. Arnold Schwarzenegger plays a parody of his former self, having been given more of the worst one-liners of his entire career as he makes a fool of himself on-screen. It is ever-apparent that he is reading the role off of the page, making it impossible for the audience to invest in his character. Gabriel Byrne, on the other hand, gives an entertaining performance as the devil. He is cunning and manipulative, but playful at the same time, recalling Robert de Niro in ANGEL HEART. It is worth watching for his part, alone. Peter Hyams' over-budgeted action sequences turn what probably should have been an atmospheric thriller into a flashy light show with no character or mood to show for it. If anything, the title most accurately describes the shape of Arnold's career as we entered the 21st century."
    },
    {
      "rating": "2",
      "text": "In the rush to capitalize on the 'impending doom' of the year 2000 (and the public panic regarding Y2K), this 'end of the world as we know it' movie can only make us wish it had ended, so we wouldn't be subjected to periodic showings of this trash.  Bottom line:  Ahrnold's (sic) big arms take on the Devil himself...and wins?  I don't consider that a spoiler, since this film has probably been rotting away on the shelf for years.  If this is how the millennium goes down, one can only hope they have a new plot for Y3K.  Compared to other Schwarzennegger flicks, the 'action' is mild, the 'humor' forced, and the plot (which normally doesn't need high standards when Arnold's the star) is almost as ludicrous as \"Santa Claus vs. the Martians\".  There was only one scene that I actually enjoyed:  when \"Satan\" (Byrne) compliments some roller-blading kid for wearing a nice shirt (emblazoned with words like:  Satan Rulez or some such).  The kid, unimpressed, flips him off and shouts some obscenity (\"Up yours\"? or something along those lines), and while distracted rolls in front of a truck or buss and is promptly flattened.  Satan sees this, turns away, and in an off-handed manner repeats his \"nice shirt\" line.  Otherwise, the remaining 2 hours is junk.  One thing I really hated was the attempt to re-create the 'buddy spy' team of Schwarzenegger/(Tom) Arnold which worked so successfully in \"True Lies\".  Needless to say, the attempt failed miserably.  There isn't even the decent 'love interest' (ala:  Jamie Lee Curtis, also from \"True Lies\").  To paraphrase William Shatner, from his latest 'Priceline' ad (with the cliff-hanging bus scene):  \"Save yourself...some pain\" and stay away from this truly idiotic experience."
    },
    {
      "rating": "7",
      "text": "End of Days. And the savior will not come. Nice mystical action movie with Arnold Schwarzenegger. You can’t say anything else about this film. Is that good special effects for 1999 and a relatively normal plot."
    },
    {
      "rating": "7",
      "text": "As we approach the turn of the millennium, the Devil seeks to fulfill the prophecies about the birth of the Antichrist, looking for a bride in New York. Directed by Peter Hyams, with a script by Andrew W. Marlowe, this film has Arnold Schwarzenegger, Gabriel Byrne and Robin Tunney in the main roles.One of the last films of the past millennium, it precisely addresses the end of it and the apocalyptic prophecies about that. It's a quite grim film, which puts the audience in suspense from the very beginning. The dark picture helps to amplify these feeling, with the most scenes taking place at night or on foggy or rainy days in New York, depicted like a real and decadent \"sin city\". The darkest character is undoubtedly the Devil, but the police fighting against him (played by Schwarzenegger) also has to face his own demons: alcohol, deep depression, lack of faith and lack of self-confidence, in a double combat, physical and psychological.The film has great action scenes which strangely cohabit with several heavier scenes, almost terror. In fact, this is the major flaw of the film: it lives in a permanent dilemma between terror and action, thriller and suspense. We cannot say it's a horror movie or a thriller, or action. It's a mixture of all, which ends up easily displeasing the public looking for just one (particularly the terror lovers, as the film never gets to scare us truly). The climax is very interesting, makes good use of special visual and sound effects, manages to surprise and not be predictable, but some of the effects (the monster) are so \"cliché\" and far-fetched that destroy what was good.The work of the actors is fairly good. This film marks the end of a comedy decade in Schwarzenegger's career, and he seems convincing in his role and doesn't make mistakes, giving another proof of versatility. He wanted, truly, show that it's not only a lot of muscles, and he succeeded. Robin Tunney looks a bit bland and hysterical in the role of Christine. Byrne made an interesting devil, very calm and cold, able to boot chills through the simple look. The soundtrack doesn't stand out particularly, with the exception of \"Agnus Dei\", it's main music, combining incidental chords with small arrangements of Gregorian chant."
    },
    {
      "rating": "7",
      "text": "There is much worse movies than this, I think this movie is decent, it might be a bit cheesy in places but it beats watching some cheesy crap like Deuce Bigalow or something... it doesn't really deserve all the crap it's dished up, Gabriel Byrne is good, he's a great actor."
    },
    {
      "rating": "7",
      "text": "Interesting idea to connect religion with action. I liked it because the story gets more interesting and because you get some extra special effects for the religious elements. But still the movie is not logical, some of the scenes are not \"realistic\" and some characters are annoying for example Christine."
    },
    {
      "rating": "2",
      "text": "/    /"
    },
    {
      "rating": "7",
      "text": "One of my favorite Arnold movies. A lot of crazy demonic people. Lots of action and a great storyline."
    },
    {
      "rating": "9",
      "text": "There are several ads in the background in different scenes that read \"NY2K are you ready?\". Y2K was shorthand for \"Year 2000\" and there was a widespread fear that computer operating systems would crash because only the last two digits of the year were used to indicate dates, and it was feared computers would read the \"00\" as 1900 causing mayhem. There were even email suggestions going around that in the year 1999 people should change the year of their VCR's to 1976 because the days of the week (starting March 1) would be the same for both years. The fear of a Y2K meltdown was exaggerated, as timely programming fixes were able to prevent a major catastrophe."
    },
    {
      "rating": "9",
      "text": "Anachronisms In the subway car an ad for Crazy Eddie's electronics store chain is seen on the wall. The electronics chain went bankrupt and was liquidated in 1989, ten years before the movie's setting."
    },
    {
      "rating": "9",
      "text": "One of the best...Arnold Schwarzenegger's comeback film, 'End of Days' absolutely made an impact on film that year. While watching it, I kept seeing images that stood out, and that I remembered (The Man (Gabriel Byrne) looking at Christine (Robin Tunney) in the car, Jericho (Schwarzenegger) looking around the reverend's home). This film is one of Arnold's most serious, most dramatic, and most dark. He plays the character of Jericho Cane extremely well (crying over his daughter's music box for eg.), and keeps his performance constant throughout. The ending of the film, *POSSIBLE SPOILER* where Jericho drops his weapon in favor of faith is hugely powerful, accompanied by the haunting choir music that is the film's background. *END SPOILER*Kevin Pollack's character, Chicago, acts as light comic relief, but also gives some of the great lines in the film (\"It's official. I'm never sleeping again\"). He also provides a great performance in the more dark, serious parts of the film.Robin Tunney is perfect as Christine York, with the character having a very vulnerable edge, and the relationship between her and Jericho forming an almost father-daughter relationship.Finally, Gabriel Byrne's portrayal of the man is amazing. He gives the character a certain edge, which makes Satan seem almost accessible at times, but can quickly become terrifying in an instant.The script is strong, and the special and visual effects are astoundingly impressive."
    },
    {
      "rating": "9",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "9",
      "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°@÷@÷@÷@÷@÷@÷@÷@÷@÷@÷@÷@÷@$@$_@_@_@_@_@_@_@_@_@_@_@_@_@_@"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●●÷÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷÷%÷%÷%$$$$$$$$$$$$$$$$$$$$$$$"
    }
  ],
  "recommendations": [
    "constantine",
    "cold_pursuit",
    "twister",
    "the_dark_knight_rises",
    "the_perfect_storm",
    "armageddon",
    "no_escape",
    "those_who_wish_me_dead",
    "creed_ii",
    "annabelle_comes_home",
    "angel_has_fallen",
    "the_magnificent_seven",
    "spider_man_far_from_home",
    "the_grey",
    "maggie",
    "terminator_salvation",
    "nightcrawler",
    "3_days_to_kill",
    "x_men_apocalypse",
    "wall_street_money_never_sleeps",
    "mad_max",
    "the_woman_in_the_window",
    "hanna",
    "47_meters_down",
    "pompeii"
  ]
}