{"id": 3783, "title": "End of Watch", "starring": ["Jake Gyllenhaal", "Michael Peña"], "runtime": 109, "genre": ["Crime", "Drama", "Thriller"], "description": "Two young officers are marked for death after confiscating a small cache of money and firearms from the members of a notorious cartel during a routine traffic stop.", "releaseYear": "2012", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/pDeVKQICkcdwwjHxGj0MeS14YJ6.jpg", "categories": {"plot": 7.419354838709677, "acting": 7.84375, "ending": 7.75, "soundtrack": 5.0, "cinematography": 6.909090909090909, "familyFriendly": 3.0, "funny": 8.857142857142858, "action": 8.071428571428571}, "reviews": [{"rating": "9", "text": "There were racist jokes, a gold-plated AK-47, a man who survives being stabbed in the eye with a knife.  There's simply not enough of that in movies.  Also, the bad guys were cast well.  Big Evil plays big evil very well."}, {"rating": "8", "text": "After having just finished the 5th season of The Shield, I was skeptical that such a short feature would be able to capture the feeling of a small division within the LAPD.  Instead, the film focuses on the chemistry and relationship between it's two leads, who are terrific in this film. There are more than a few genuinely funny moments, but there are also a few extremely intense and graphically violent scenes. Yet the nature of the unique relationship between the officers is what you leave the film with."}, {"rating": "8", "text": "I had no idea Anna Kendrick was in this movie. She is a doll with her pearly whites. I thought the movie gave us the fact that cops are human. Some truly are out there in the streets to do the right thing. This film showed us that they have families, and they struggle seeing death everyday. I enjoyed Gyllenhaal and Pena's performances. Having to keep the peace in the hood ain't easy. Just like some soldiers never come home from deployments alive. Some cops never make it home alive from the streets. Thumbs up! Check it out if you haven't yet."}, {"rating": "6", "text": "It is good but left me struggling to think whether to recommend it. The middle slows down a bit while the ending is solid. Be prepared for the handheld camera moves that work for awhile... then your eyes tire and you have to look away just to focus. it has many great parts to it."}, {"rating": "8", "text": "As an Netflix instant watch film, End of Watch was one of the better finds I have located on there.  I was very surprised by the quality of this film.  Both lead actors make their roles believable and very human for the audience.  The gritty way in which the movie was shot made the personal touch that much more apparent.   Very well written and directed film."}, {"rating": "5", "text": "Two things I am tired of in movies are the hand-held \"I am taking this film\" technique and the inability of a half dozen people at point blank range with military grade weapons being until to hit their target.  If you love cop films you might like this one, but I found it tedious."}, {"rating": "9", "text": "End of Watch is a thrilling action drama film incorporating the elements of hand-held footage. What"}, {"rating": "8", "text": "End of Watch is not only an emotionally interactive, episodic slice of realism and well done film for its very low budget, it is a gem among its sub-genre of non-horror found footage films."}, {"rating": "6", "text": "End of Watch is so close to being a great film, but is ultimately held back by it's lack of polish and lack of consistency. The found footage aspect from the perspective of an officer in the LAPD is a great concept, and is well executed early on in the movie. The second act of the movie is just slow and tiresome, and in a weird way feels rushed, like it was added on as an after-thought. The ending makes up for it, but there were too many cliches in the script to really make End of Watch memorable."}, {"rating": "10", "text": "This film humanizes cops. Excellent movie! The movie contains a lot of criminal trends. It may seem fake to a lot of people but the truth is that what this movie contains in it is reality. When watching this movie people may say \"that doesn't happen\" the truth is that it does. I will watch this movie again in the next couple of days!!!"}, {"rating": "6", "text": "A good LA Police Department movie using the reality film point of view (although not overdone).  A Bromance movie about 2 low level LAPD cops who get in over their head.  In summary, it is a good story that show that in the end friendships and family are most important.  It does a great job a showing parallels between the police vs. gang life (they are not that different).  Good vs. Evil was well documented and shows that everyone wants to move up the food chain. The movie make you feel sad in parts where you know they pulled the story-lines from actual police reports."}, {"rating": "4", "text": "It was difficult for me to to watch an amazingly talented actor like J. G. trudge his way through this extended episode of 'Cops'. He is the movie's only saving grace amidst a poorly written screenplay that feels cliché and strips the LAPD of an opportunity to be depicted somewhat accurately in a fictional setting. Yes, it's gunfights and bro-banter entertain, but are lost in a plot that is forgettable and disappointing."}, {"rating": "10", "text": "An amazing police thriller/drama film that reminds you of such great cop show oldies like Adam-12 and 21 Jump Street. With deep characters, great acting and superb directing, End of Watch is worth watching."}, {"rating": "8", "text": "Mostly shot in a first person point of view giving way to a more realistic yet very shaky imagery, it started off by giving us short bursts/stories in the lives of the two cops and at first it felt it was going nowhere fast.  However, as the movie went on, I started to realise that each story was merely a piece of a puzzle to help describe the protagonists through their daily actions which inevitably define who they truly are."}, {"rating": "9", "text": "I watched the movie not knowing what to expect when the main characters were playing completely different type of roles than usual. It chronicled the lives of two cops caught in the war zone of crime, gangs, drugs, and violence and kept a light humor even during the worst scenes. The two young officers, their family involvement, their wives, the job, their fellow officers, personality profiles were set early and the action went from one dramatic scene to the next with gang bangers and street people actively involved in every aspect of their city's subculture. If you aren't ready for violent action, you might want to pass on this. Every minute there was constant action, dialogue, this movie had no dead air time with nothing but scenery. During the non action moments it was full of banter between the two about everything from their families to their sex lives. Some comedy but mostly drama and action."}, {"rating": "7", "text": "As an Netflix instant watch film, End of Watch was one of the better finds I have located on there. I was very surprised by the quality of this film. Both lead actors make their roles believable and very human for the audience. The gritty way in which the movie was shot made the personal touch that much more apparent. Very well written and directed film."}, {"rating": "1", "text": "You know how Training Day was a gritty well written neo-realistic law enforcement drama....well End of Watch isn't. It falls short, real short. Honestly, I fell asleep in the movie. Combination of bad writing, horrible cinematography, tired scenes of LA, and too much popcorn."}, {"rating": "1", "text": "This movie is horrible. It starts out as a ripoff of the movie \"Colors\" and then the plot scatterbrains down different paths from there. Predictable, trite, inconsequential, unimportant, and annoying are some of the adjectives that come to mind when describing this awful attempt at cinematography. There are a few chuckles mixed among the ridiculous garbage. Don't waste your time on this nonsense."}, {"rating": "8", "text": "\"End of Watch is a gritty, reckless and emotional film that, gives us the true in-depth look at inner city cops. Filled with Oscar Worthy performances. It should come as no surprise, End of Watch being one of the best cop dramas in years.\"  B+"}, {"rating": "3", "text": "I found these two cops quite annoying with their lame, childish banter. The acting is fine but the dialouge seems a little unrealistic in parts. Not as gritty as it could be. I got bored and switched it off. Doesn't come close to a single episode of the Shield. Dissapointing"}, {"rating": "0", "text": "This movie is so bad, it is beyond bad. It is basically unwatchable. When every second word in the script is the F word, it makes you want to turn off the sound. The script seems to have been written by a 14 year old. The acting is atrocious. The photography is nauseating. How can anyone sit through the entire length of this shameful attempt ?"}, {"rating": "1", "text": "Weak story line, poor photography, mellow dramatic glorification of cops and gangs.  It has been done many times before and done better.  Nothing new here and nothing like the Movie Trailer.  Absolute waste of time"}, {"rating": "10", "text": "The various points of view and personality of End of Watch have created one of the best police dramas in years, with the shaky cam and POV technique that really immerses the viewer in the film, with said film outlining perhaps the dark side of being on the right side of the law, the trials of day to day routine but also the obstacles faced when there is always someone with a higher pay grade. Jake Gyllenhaal and Michael Peña star as the two LAPD officers, Taylor and Zavala who create a tension of unpredictability and lack of safety as the film progresses. As the documentary style film unfolds, we realise these two officers end up investigating much deeper into the criminal activity in south central LA, nothing really screams new that hasn't been done before, but the way in which it unfolds can sometimes be frightening, often edgy but seriously entertaining.\rThe story is a character-driven account of these two officers as they deal with their job but also their personal lives, they discuss their ambitions and their love life, these two perfectly fit the bill of a buddy cop film, but it properly explores these two individuals and the closely wound lives they lead, they have weaknesses and fears, something which the two actors perfectly portray, these two officers are friends, they spend their social lives in each others company which makes the film hit home that much more.\rThe film itself as mentioned explores the gritty side of the police work, and the film tells a brutal tale involving trafficking and brutality of the highest level, with some very gruesome and edgy scenes that come alive with the documentary style and approach. There are laughs to be had at the very real conversations that the two share, with an excellent supporting cast to back up some of these moments.\rWriter/Director David Ayer had consistently showed his strength in the cop genre of films, and his latest is a no holds barred action flick that has a lot of heart, but tells a tragic and powerful tale of friendship and doing the right thing, End of Watch succeeds in being real, honest and forthright in the story it tells, leaving room for both the police drama and the personal story the two central characters have, elevating the charisma and heart the film has."}, {"rating": "1", "text": "This is basically a FPS film about militant, calloused patrol cops in the worst section of LA. If this type of thing works for you, great, but I was done 15-mins into it. With all the racially charged cop violence that's been happening, this is NOT the film the country needs and with a poor $48M gross (mostly cops and their families I'd bet), the movie-going public agrees."}, {"rating": "9", "text": "End of Watch is the big sorprise of this year -in my opinion- the story can have a simple development, but when the movie start you watch that have an intelligent development, and the performances of the cast are awesome, the script can have some mistakes, but is not much. End of Watch is interesting, funny and is a sorprise."}, {"rating": "9", "text": "To be honest going into this movie I didn't know what to expect  but it really was great.\rThe actors did a great job and the movie established a connection between me and the character.\rMy only real critique would have to be the ending. It seem so... abrupt, just kind of ended. Other than that I would highly recommend."}, {"rating": "8", "text": ""}, {"rating": "7", "text": "A great tribute to cops!  The film is very realistic but the wavering candid camera photography almost made one of my buddies carsick.  The situations are believable and thrust the spectator into the routine rituals and the bizarre situations that cops must face in a major city.  The only problem is the ending....for such a well-acted film with a graphically realistic concept, the ending is too melodramatic and almost unbelievable."}, {"rating": "10", "text": "Amazing movie.  Great action, great acting all the way through.  Well written.  I enjoyed it far more than The Master which is getting all the rave reviews lately.  Toward the end there is a bit of subtle foreshadowing, but the ending is still somewhat unexpected."}, {"rating": "10", "text": "Amazing film. It's one of those films which doesn't fully hit you how great it is until the end. They achieved so much with it considering they had a small budget. Well worth a watch!"}, {"rating": "8", "text": "End of Watch turned out to be one of the biggest surprises of the year and it surpassed my expectations dramatically. It's only more recently than I've warmed to Jake Gyllenhaal and both him & Michael Peña are great together here. The chemistry between the duo is one the most convincing and realistic buddy cop pairings I've ever seen. It's the pointless everyday conversations between the pair whilst on patrol that carries the film and makes it believable. Usually I find the found footage style camera work to be a worn out gimmick. But the majority of the time it works well here. And it plays an integral part in making the experience so intense. David Ayer's overall direction is impressive and overall I found this to be a refreshing, original, real and honest take on the buddy cop formula."}, {"rating": "10", "text": "I watched this movie because Anna Kendrick is in it and I think it is absolutely amazing! All the actors did a fantastic job and the script was so well written and clever. I am doing a project for school about this movie!"}, {"rating": "9", "text": "Not all movies are meant to be bright and happy, entertaining all audiences. End of Watch is one of these movies. It is raw and gritty and forces the viewer to feel uncomfortable...and it does this very well. It provides a near realistic view of what it is like to be a cop...the good, the bad and the ugly...and examines a sort of \"worst case scenario.\" This movie is well acted and well executed. The camera style is intentionally shaky and raw, giving the viewer a sense of being right there with them. This is the type of movie you will watch and think about for a while. It carries large themes dealing with morals, ethics and a sense of family. It is highly recommended."}, {"rating": "8", "text": "0 = Worse thing ever made\r5 = Average\r10 = God's gift to mankind\r End of Watch is the perfect cop movie. the witty dialogue, partner chemistry, and shootouts leave nothing to be desired. This is a gritty film that displays the \"police life\" perfectly. The main actors are perfect for their roles, and the tension is palpable. End of Watch will get your blood pumping! A must watch."}, {"rating": "6", "text": "Great movie (would have given it a 7 but took off one star for the following) but DON'T SIT CLOSE TO THE SCREEN (or rent it on DVD) if you are prone to motion sickness, like I am.  Halfway through the movie, due to the way it is filmed with lots of camera panning I felt somewhat nauseous and kept hoping it would go away.  However, the style of filming persists throughout the movie, so either sit far away or take some Dramamine before you go (I would recommend a half pill).  It took me about a half hour after it ended before I felt okay again."}, {"rating": "8", "text": "Jake Gyllenhaal and Michael Peña are cop partners riding rough neighborhoods in LA. We get to know them mostly through their snappy banter in the patrol car, while most of the action is purportedly shot through their own cameras. We ride along as they encounter minor and major crimes, but also watch them interact with their fellow officers and their women. This camerawork and editing have a big-budget grittiness that keeps the film rooted in reality, but doesn't get in the way. Performances are outstanding and David Ayer's directorial style has become even more sophisticated, while staying \"street.\" A solid film with modern sensibilities."}, {"rating": "8", "text": "This a decent film, its gritty but ultimately it has an easily predictable ending. It's a good action / pseudo documentary film about 2 cops who are partners that find situation after situation of dealing with the worst criminals humanity has to offer in south central LA."}, {"rating": "8", "text": "This movie manages to have a completely unreastic and a realistic feel at the same time. A very good cop movie. The only problem is the partners are a little too nice to each other. Like their trying to push the friendship too hard to lead to more emotion. Comes of as a little cheap."}, {"rating": "7", "text": "I find the critic and audience score for this movie was overrated. But I must admit it's one of good movie. Tearjerking ending and captivated performance by Jake Gyllenhaal and Anna Kendrick. But I don't find it's one good example of found footage entry."}, {"rating": "7", "text": "This is an action movie / police drama about a couple of street cops working in a dangerous area of Los Angeles. Two protagonists are played by great actors Jake Gyllenhaal and Michael Pena.The movie is well directed and looks quite realistic. There are a couple of things I did not like.I generally do not like handheld camerawork. It was quite relevant in this particular case but I still did not like it. The other minus was a few clichés that were used in the script. Otherwise it was a good, solid movie that I recommend to watch."}, {"rating": "9", "text": "Not since Training Day has a movie grown above the cliche'd cop storylines, and Ayer is a master of this genre. This is by far his best work, and it's a heartbreaker. Look for Gyllenhall this Oscar season."}, {"rating": "8", "text": "Officers Taylor (Gyllenhaal ) and Zavala (Peña) are LA cops that respect the jib they do. When a seemingly routine traffic stop leads to the discovery of guns and money linked to a Mexican cartel the pair starts investigating, putting a target squarely on their backs.\r Moving past the fact that the ‘found footage’ aspect makes little sense in this context (even the director actively ignores it at points!) the film moves along at a break neck speed whilst still finding time to explore the lead characters lives to the extent necessary that audiences can invest in the two leads. The action set pieces are also brilliantly shot meaning that, while it can stretch plausibility at times, End of Watch's almost two hour running time flies by."}, {"rating": "8", "text": "Excellent film.  Spot on performances by the main cast and secondary characters.  Fresh take on the buddy cop film.  More a character study of the two main subjects than focusing on the plot, which is fairly straight forward.  Many of the incidents during the film don't get explained to any extent, and some characters pop into the film and then disappear without much information about them  The pacing is really good but the camera work is not always successful.  The over use of the hand held, shaky cam reduces the film to an episode of Southland and certain times.  This is film, not TV.  A bit of a splatter fest at times.  A must see if you're into this genre of film."}, {"rating": "9", "text": "This was a purely great film. Great performances delivered into a great story. It was thrilling, it was hilarious, and it was dramatic. The only issue i had with gthe movie was the annoyance of the switching of cameras, i wanted them to just stick to one but it kept switching but after a ways into the film i got used to it but other than that this movie was great. Im not a big fan of Jake Gyllenhaal or Michael Pena fan but they were both perfect and hilarious in this film, they're \"brotherhood\" was so strong which made the film so much better because of how well they blended together. If you don't like violence or alot of strong language then don't bother with End of Watch, but if not then you must see this! Its well worth your money and your time! 9.5/10"}, {"rating": "8", "text": "With dynamic cinematography and some good writing, \"End Of Watch\" is an excellent film that takes the usual brotherhood cop formula and juices it up with some adrenaline."}, {"rating": "0", "text": "this jerky camera crap was old with blair witch; unless you're 13 or enjoy that nonsense, give this film a skip.  oh and if the excuse is \"hey it's cause they're video-taping themselves\" then get a camcorder and go out and make your own film; you couldn't do any worse than this."}, {"rating": "9", "text": "Wow!  I was pretty blown away by this!  Great movie.  Gyllenhall and Pena are amazing together.  Fantastic cop movie, though the one negative for me was that there were some extremely grisly, upsetting scenes.  One scene in particular affected me more than I can remember any scene in a movie affecting me in a long time(though I am kind of a wuss in that regard!).  Definitely not something to take the kids to.  But a really good movie."}, {"rating": "8", "text": "End of Watch is one of the best cop films I've ever seen and it all starts with the fantastic cast. Jake Gyllenhaal and Michael Peña are both incredible actors and the supporting cast is just as great. Because of the entire cast's acting ability, the emotion and drama felt real and authentic and really pulled you in. The action sequences were also done really well. You felt the intensity through the realism and the emoting and it really made you get on the edge of your seat at times. I also felt the the plot developed really well. Yes, the movie dragged a bit about two-thirds in but that was necessary for the development of the characters and their relationships. Without that portion, you may not care as much so I do not hold that against the movie. The only things that I do think brought the movie down were the extreme overuse of the shaky camera effect and some of the editing of scenes felt too episodic. When you're starting to almost feel a bit dizzy because the camera is shaking so much, I'm pretty sure that means dial it back a bit. I understand that there are plenty of handheld cameras used in the film as part of the plot but those are not the examples I'm referring to. The only other thing I felt was worth mentioning was the blatant foreshadowing in the film. There's a particular scene that essentially spoils the ending. I'm sure not everyone caught it but when I saw the scene I practically threw my hands into the air because I knew right then and there how the movie would end. I'm aware that directors love these little foreshadowing elements because it adds a certain level of cinematic quality but they're supposed to be subtle. Overall though, I'd say that this was a great movie and one that most people, at least those not easily offended by vulgar language and violence, would enjoy."}, {"rating": "6", "text": "By now, everyone knows that I hate these camcorder films, because they are lazy and don't really have much of a story to them, but there is an exception to that rule, and that is the TV show Cops. Police work comes with natural real life drama and action, in this instance the script really does write itself, so I was okay with it being used for a film like this. I just wish it had been done more naturally. I understand that the film takes place in a gang infested area of L.A. and that they needed to make it more dramatic and action packed for it to succeed in theaters, but you talk about going over the top. That's where Director, David Ayer comes in, after all gangs and going over the top are his specialty. End of Watch does have some great chase scenes and some really cool moments between partners, but for the most part it's just one non-stop explosion filled gun battle after another, making Los Angeles look like Fallujah. The point of view cameras do give us an interesting look at the action and some new perspective into how it's all made, which I thought was really cool, but I mean the lack of story line and constant shooting was beyond ridiculous. I'm some what surprised they'd didn't just go full on crazy and release the whole thing in 3-D."}, {"rating": "10", "text": "Best Movie of the Year, Period. 5 or 6 years down the line, ask any cop about his fav movie and there's a good chance that it's gonna be this one. One of the best Guy/Buddy movies of all times."}], "recommendations": ["good_time", "the_equalizer_2", "the_accountant", "a_history_of_violence", "drive", "sicario_day_of_the_soldado", "free_fire", "a_walk_among_the_tombstones", "bad_times_at_the_el_royale", "red_sparrow", "the_commuter", "no_country_for_old_men", "the_infiltrator", "blackhat", "hanna", "den_of_thieves", "the_bank_job", "the_equalizer", "dragged_across_concrete", "broken_city", "run_hide_fight", "widows", "haywire", "tenet", "the_kingdom"]}