{
  "id": 3578,
  "title": "Endless Love",
  "starring": [
    "Brooke Shields",
    "Martin Hewitt"
  ],
  "runtime": 116,
  "genre": [
    "Romance",
    "Drama"
  ],
  "description": "Two young kids fall in love with each other. But the passion is too consuming for the parents of Jade. The parents try to stop them from seeing each other. But when this doesn't work, David burns down the house and is sent away. This doesn't stop him from seeing her. When he gets out he goes to look for her. But the passion for his first love is too strong and she has to leave.",
  "releaseYear": "1981",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sU9jXtu7dtbAezz5LdrFZSyzztw.jpg",
  "categories": {
    "plot": 5.611111111111111,
    "acting": 4.666666666666667,
    "ending": 7.0,
    "soundtrack": 6.5,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "A remake of the soapy '80s classic of the same name, Endless Love is both dopey and overly serious in its execution making for an unintentionally funny and campy piece of fluffy entertainment."
    },
    {
      "rating": "9",
      "text": "Wasn't holding out much hope for this movie, however, I actually really enjoyed it. I am not usually the romantic film genre lover, but this one surprised me with a gripping storyline, lovable characters and a love you really can feel through the screen."
    },
    {
      "rating": "8",
      "text": "The newer version of the '81 movie, which both of them were the adaptation of a book of the same name. This type of story is a kind of outdated, but this movie was updated according to the present time. So there's no doubt on convincing the teenagers and do like it. It was a mini version of the movie 'The Notebook', but everything happens in a very much soon, like in one summer and expands a bit in the last quarter. This movie got all the substance that teen romance theme should have like strong bond, emotions, resistance and a tragic.\r I don't know still how many Hollywood is going to make a teen love story about a rich or popular boy and a poor or nerd girl, sometimes vice versa comes together. Recently I saw 'The Spectacular Now' which was not too far from it, but anyway cast and the story varied distinctly. This was the story of David, on his high school graduation day he reveals his crush on a rich geek girl that he waited for this day. The opposite had attracted each other and she finds the same feeling about him in her. Now they got one whole summer in front of them before moving on a different path to higher education or taking a job. Like the father from 'Father of the Bride', the overprotective father oppose the idea. But it only makes the stronger the young relationship. Somehow it has to end when summer is over, so what happens after that is the remaining.\r ‘‘I found what you said inspiring.\rAnd inspiration has been in short supply these days.’’\r The pair was good together, you can call it a fine chemistry. With the decent performances, music and cinematography, it looked a perfect movie to watch with your female (male) companion at the weekends. It was not, wow! sayable kind of movie, if you forget yourself, you will get into the movie's deep. Other than that probably you may not like it if you have already seen the '81 movie. I believe everyone had not seen that, so this movie is for those people.\r Gabriella Wilde was so beautiful like I saw her first time in 'The Three Musketers' with that classical European royal house costume. Perhaps a better movie for Alex Pettyfer so far in his career as a lead actor. Except these two, the father character played by Bruce Greenwood was great. Definitely not it is his greatest execution, but one of his for sure that helped the movie to shape well. Overall, the movie might not be close to the earlier version or the book, but certainly not a bad one. Since I have not watched the old and not read the book, I give a go for it for those who are looking romance movies.\r 7.5/10"
    },
    {
      "rating": "6",
      "text": "Love lost and love found are some of the most rewarding narratives we have ever seen on the big screen. In David Elliot’s (Alex Pettyfer) case, love lost, as his therapist tells him, is “like a book you read long ago”, and those words could not be more true for Endless Love. Aside from being a remake of Brooke Sheilds’ 1981 film of the same name, the film is also an exercise to see how Shakespeare’s famous tragedy, written almost 420 years ago, could be modernized, interpreted and adapted for a Pinterest-driven, Instagram-obsessed generation of young people. But like the amaro, hudson and mayfair filters featured on the highly addictive mobile app, Endless Love is a sun kissed love story told through the lens of a writer/director that is beautiful to look at, and understands what it’s audience wants, especially during one of the most forcefully romantic times of the year.\r No movie released on or around Valentine’s Day should be judged on originality, because like the holiday itself, there is nothing original about roses, chocolates, and forced sentiment that is the driving force flooding people’s minds. Instead, writer/director Shana Feste delivers an entertaining, nicely shot film of first love with many of the essential ingredients to make it a success amongst young people.\r One minute, hopping along the roofs of cars, the other, kissing the girl of your dreams, Endless Love is a soft and safe story of two lovers who find themselves on opposite ends of the tracks of life. David, who has been in love with Jade Butterfield (Gabriella Wilde) since tenth grade, uses their high school graduation as a chance to finally connect with her. The wonderfully innocent and vibrantly blonde Jade, who has spent the last two years of high school mourning the death of her older brother Chris Butterfield (Patrick Johnson), decides to spend most of her free time submerged in literature and within the tall gates of her family’s large estate. Grieving from the loss of their child, Hugh and Anne Butterfield (Bruce Greenwood and Joely Richardson) are content with having their two remaining children sheltered at home. It isn’t until Jade’s graduation that the lives of the Butterfield’s are completely sent topsy-turvy by David, a smart and sophisticated young man whose main concerns are his father and his attainment of true love.\r The 1981 version of the film is a dark and often times melodramatic adaptation of Scott Spencer’s novel of the same name. David’s character and the past that haunts him in the two earlier adaptations are much darker and convoluted, often times resulting in mental institution. But in Feste’s interpretation, the real conflict in the film is the one between Jade’s overprotective father Hugh, and David. This conflict in the film is the driving force for so many of the characters and is one that shows the intentions of a young and impressionable boy, against the expectations of a worrisome and overbearing father.\r Hugh, a cardiologist, after having his prized son pass away, looks to keep his family tradition alive through his to-be doctor daughter, especially since his middle son Keith (Rhys Wakefield of The Purge), is intent at keeping his father at arms length; falling in love and studying on his own terms. Greenwood’s performance of Hugh is one that has many layers; on the one side, a protective father who keeps his daughter from making a decision that might jeopardized her life and future; and on the other side is a haughty, upper class elite who doesn’t see David as able to provide the kind of lifestyle his daughter deserves. Greenwood becomes the essence of the film, showing that true love doesn’t always reign supreme and providing the film with a conflicted character with realistic and somewhat expected mid-life crises.\r The truth remains, there is a big difference between true love and first love. David, who scores an impeccable SAT score and professes to finding happiness in simplicity, spends his days after high school helping his father Harry Elliot (Robert Patrick) around the auto shop he owns. Throughout Endless Love we are reminded just how smart and wise David is, yet the choices he makes, and a little bad luck, get the better of him. Showing very brief glimpses of anger that often finds his fist connecting with several people throughout the film, David gives merit to Hugh’s concerns for his daughter. But, like any good cranky dad set amidst any love story, love reigns over logic. Decisions are made during the course of heart-wrenching monologues, and tempers escalate quickly, but not before any Valentine’s Day film’s centre motto is expressed, and that’s letting the past go."
    },
    {
      "rating": "1",
      "text": "Wow.  Just... wow.  And not in a good way.  Every cliché ever created crammed into an ENDLESS cheesefest that's also an extremely immoral movie.  Case in point; The two leads have sex within three days of meeting each other and it's portrayed as the right thing for them to do.  Did I mention that they're supposed to be 17?  Yeah.  The movie is supportive of teenagers being \"young and dumb\" and throwing every moral and scrap of logical thinking out the window.  They have sex at least 3 times within their first week of dating and they do it every chance they get.  I was thinking, \"What is this, Basic Instinct?\"  Sadly, there are no ice pick murderers here, just corny dialogue and the most unoriginal story ever.  Endless definitely fits this movie.  It goes on forever."
    },
    {
      "rating": "3",
      "text": "For the first fifty minutes of this film I wouldn't say it was good but at least it was watchable.  I kind of bought the chemistry between the two leads and thought there was a bit of campy but fun romance.  Unfortunately any appealing aspects of the beginning are turned into some highly laughable parts in the second half.  D+"
    },
    {
      "rating": "0",
      "text": "As bad as it gets. I usually like romantic movies as a distraction to everyday reality but this movie had so many incoherences and it was so ridiculous that I couldn't even focus on the romantic story. The first hour is at least entertaining. It looks more like a videoclip or a clothing advertisement but it gets you in a romantic mood, wishing to find a fairytale love as the one the main characters share. However, in the middle of the movie, things get out of control when the writers try to make up barriers for the couple to be together in the form of an over controlling father in a story that could have had a little sense in the 50s, but never in the 21st century. The script seems to be written sometimes by a 12 year old with a lot of imagination and no sense of reality at all. Of course that is the target intended for the film so at least they may be happy."
    },
    {
      "rating": "5",
      "text": "While the movie may not make it’s audience feel as if the ticket was worth the price, this sloppy (in plot) remake was most enjoyable when the creative team behind the music supervision department demonstrated their talented ability to make the bored viewer feel what the acting couldn’t. Yes, drama was obviously the goal, but who could turn down artists like Lord Huron, Ecosmith, In The Valley Below, and the killer Tegan and Sara? All of which paired flawlessly with the voiceless and beautiful montages of carefree, privileged and painfully attractive eighteen year olds prancing around the 1%'er south. Don’t let my sarcastic undertone defeat the purpose, the only thing to take away from this Valentine’s Day disaster is the shag-able Alex Pettyfer and some brilliantly placed music."
    },
    {
      "rating": "2",
      "text": "as much as romantic movies have the same cliche's, the actors did superb but haven't we heard of the same father doesn't get along with boyfriend story cliche #1 they stay together cliche number #2. the actors did superb more of a C performance. Grade C+"
    },
    {
      "rating": "1",
      "text": "horrible, couldn't get through it. insincere and fo dramatic. smelled like a movie made trying to follow rules to success. alex ugly haircut. the girl i'd like to see more of thought she was the same girl from blue crush. both fathers i've seen do good jobs in acting but maybe they knew what a crap movie it was because they were horrible. god havent watched something that unartistic and unpowerful in awhile. def  worst then twilight"
    },
    {
      "rating": "0",
      "text": "Another poorly scripted movie about two good-looking white people? Get me out of here."
    },
    {
      "rating": "7",
      "text": "A good romcom watch with a easy to follow plot. +1 point for an annoying dad."
    }
  ]
}