{
  "id": 3346,
  "title": "Enemy of the State",
  "starring": [
    "Will Smith",
    "Gene Hackman"
  ],
  "runtime": 132,
  "genre": [
    "Action",
    "Drama",
    "Thriller"
  ],
  "description": "A hotshot Washington criminal lawyer becomes the target of a rogue security executive videotaped in the act of murdering a congressman when the incriminating tape is surreptitiously slipped into his shopping bag by the videographer, who is fleeing the executive's assassins.",
  "releaseYear": "1998",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/x9pXrMKLsBGGOFyyZ0Gwt9YpVub.jpg",
  "categories": {
    "plot": 6.75,
    "acting": 7.454545454545454,
    "ending": 9.0,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.5,
    "action": 7.714285714285714
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Truly a Jerry Bruckheimer masterpiece."
    },
    {
      "rating": "8",
      "text": "Quite an enthralling and captivating film. It does take a bit of time to get going but once it does it keeps the pace pretty well until the end. If I have one criticism, it"
    },
    {
      "rating": "9",
      "text": "At times I felt like Smith was trying to be Denzel, but one I got past that Enemy of the State is one heck of a good thriller. I love Smith but am so used to seeing Denzel doing a Scott movie that it felt like this movie was more meant for him and had a hard time giving Will a chance. Yet I pushed forward and after about 10 minutes began to enjoy the comedic aspects that Smith brought to the screen (something Zel wouldn't have brought). The plot and the movie move along at a blistering pace but still allow for character growth which makes Enemy of the State a true classic in the thriller genre."
    },
    {
      "rating": "7",
      "text": "Enemy of the State is a very slick political spy thriller directed by Tony Scott, the late director who certainly could be called a master of thrills. He does a great job here creating an entertaining and well made thriller that certainly keeps you on the edge of your seat for the most part as every twist and turn really grabs you. For the first three quarters of this one, it certainly does not break much new ground, but is very entertaining and contains great performances from Will Smith, Gene Hackman, Jon Voight, and Barry Pepper. It does a great job creating thrills without having to resort to guns for the most part, which is always a breath of fresh air for me. However, towards the end, it all goes off course and it really puts a damper on the movie for me. One scene in particular kind of hits the breaks and felt very, very Hollywood. Throughout all of the preceding elements, this one felt very realistic, which is what really contributed a lot to the thrills provided, but the ending, again, kind of kills that a bit for me. However, this one is still very timely all the way to 2015, even though it was released in 1998 and really delivers on every front you can ask from a film of this type."
    },
    {
      "rating": "8",
      "text": "It's sad to think that Tony Scott, master of movies like these, would commit suicide in 2012. Like in this movie, he crafts everything in his films so well and with a patience some directors can't find. This movie is very exciting, enticing, and interesting. The villain is the usual protective, corrupt government that will try to kill anyone who knows too much, but other than that, this is a great movie."
    },
    {
      "rating": "7",
      "text": "The late Tony Scott's Enemy Of The State reminds me a lot about of 70s movies like The\rConversation. Smith and Hackman are great for eachother as the leads."
    },
    {
      "rating": "8",
      "text": "Though \"Enemy of the State\" finds a flimsy excuse for setting one scene amid lingerie models, babes have nothing to do with its notion of sex appeal. Instead, it's the gigahertz that are hot in a thriller that treats technology as its biggest turn-on.\r High-tech surveillance (\"Enhance, then forward frame by frame!\") is at the heart of this latest splashy collaboration between Tony Scott and Jerry Bruckheimer (\"Top Gun,\" \"Crimson Tide\"), with its premise that privacy is imperiled by runaway electronics. In a week that finds the nation listening to surreptitiously taped Washington telephone calls, who's to say that \"Enemy of the State\" doesn't have a point?\r This much is certain: it has a hurtling pace, nonstop intensity and a stylish, appealing performance by Will Smith in his first real starring role. And although Scott has done popular culture no great favor by pioneering the Simpson-Bruckheimer school of empty but sensation-packed filmmaking, he now looks like a veritable Billy Wilder beside latter-day Top Gunners like Michael (\"Armageddon\") Bay.\r As a grand old man of the thrill-happy genre, Scott gives this film a fine cast, a modicum of wit on the run and a reasonably human dimension. As Gene Hackman, playing an eccentric technology wiz, finally admits about Smith's lawyer-turned-action hero: \"Not too stupid after all.\"\r Smith plays Robert Clayton Dean, an upright and happily married lawyer who winds up, quicker than you can say John Grisham, being targeted, chased and spied on by ruthless forces within the National Security Agency. Needless to say, the \"huh?\" factor is considerable.\r How exactly does Dean go from peace and quiet to a scene in which he must run away from a helicopter, a truck and a train simultaneously? The screenplay by David Marconi seems to be wired with its own self-destruct mechanism, so that it works within the moment but stops making sense the minute you walk out the door.\r \"Enemy of the State\" begins with the murder of a congressman (played by an unbilled Jason Robards) because he opposes a Telecommunications Security and Privacy Act that a certain NSA official (Jon Voight, who modeled his appearance here on Robert McNamara) dearly hopes will pass. But it happens that a nature photographer (Jason Lee, a star of \"Chasing Amy\") is monitoring geese in the very park where the killing takes place.\r The photographer becomes toast as soon as he relays this information to someone else by telephone, since there are no such things as unmonitored phone conversations or camera-free buttonholes in this movie. Incidentally, everyone who makes phone calls here tends to be doing at least one other thing -- fiddling with a keyboard, peering at a monitor screen, watching television -- simultaneously.\r And information is gathered and processed with dizzying rapidity. The real world's hourglass icon, the one that indicates a computer is taking its sweet time about something, is nowhere to be seen.\r In what passes for crafty plotting here, Dean happens to be buying holiday underwear for his wife (of course it's Christmastime) when the photographer bursts onto the scene and hides a copy of his incriminating evidence in Dean's shopping bag.\r Suddenly, a whole nerd squad back at headquarters begins studying the configuration of the bag and then monitoring Dean's every move. His house is fitted with more bugs than there are in children's films this season. There's a sensor in his pants.\r A special dedicated satellite, filmed as if this were \"Star Wars,\" is devoted to chasing him. The question of why one little vote in Congress -- or even one little murder, in this cutthroat context -- is enough to set off such techno-frenzy is one more \"huh?\" along the way.\r But Scott comes up with enough snazzy equipment, wild chases and explosive notions (like blowing up the original Dr. Pepper factory in Baltimore) to keep the story moving faster than the speed of scrutiny. And he does use sharp, video-influenced editing more effectively than most (though John Frankenheimer's \"Ronin\" achieved the same high velocity without benefit of MTV tricks).\r The film's juxtapositions, sharp angles, jump cuts and aerial surveillance shots (a la the Gulf war) have a rhythm that suits the material. And Scott avoids touches of overkill, like pumped-up emotional heft or an overlay of musical schmaltz.\r In addition, the filmmakers' claims that actual surveillance capabilities go well beyond what is seen here give added interest, not to mention true menace, to much of what is seen.\r Making memorable appearances here are Regina King (from \"Jerry Maguire\") as Dean's sturdy wife; Barry Pepper, Ian Hart and Jake Busey as young thugs on Dean's trail; Lisa Bonet as an ex-girlfriend of Dean's, and Tom Sizemore as a tubby mobster.\r Gabriel Byrne appears in a brief, baffling role. The film's horde of foxy screens, transmitters, buttonhole cameras and laptops probably deserve an acting credit of their own."
    },
    {
      "rating": "10",
      "text": "Runaway films have been mesmerizing movie goers for years, but this film right here is the king of all runaway films. This is, by far, Tony Scott's best film. It is an action thriller that grabs and holds your gut from beginning to end and never lets go."
    },
    {
      "rating": "10",
      "text": "If there is one of Tony Scott's films I would 10 star, this is it. Of course his repertoire is stellar. Enemy of the State is perhaps one of the most divulging films of the secretive spying State to have hit our consciousness. Yet 16 years later we seem as a whole to care less about their intrusion into our lives as we did then in our ignorance.\rOf course Snowden revealed so much of what Scott divulges in this mega paced, brilliant masterpiece. It is thus easy to understand his so called suicide during the making of another expose film might just have been taken from this film's storyline.\rToday we are beset with even greater evils as they crawl out from under the shadows, however I recommend this film to everyone as it never loses its shine no matter how many times one watches it. To students of the game, it is essential viewing.\rGod rest your beautiful soul Tony and may your delivery of truths behind the veil at least help waken up generations to their self made prisons and release the desire left to us at the end of this film. We need it more than ever..."
    },
    {
      "rating": "0",
      "text": "The violence is top notch, the language and dialogue is perfect, the story is great, but the engagement is nothing, I had a blank brain of interest for this film."
    },
    {
      "rating": "6",
      "text": "Enemy of the State is a mostly harmless chase thriller with one or two great scenes (NSA goes Italian!). The movie is solid throughout but is ultimately unmemorable. Not the strongest of Tony Scott efforts but it's certainly worth watching at least once."
    },
    {
      "rating": "6",
      "text": "Probably one of Tony Scott's better films, pretty entertaining but plot is holey."
    },
    {
      "rating": "6",
      "text": "look at that ball..Enemy Of The StateThe vulnerability and the intense drama sequences are score on high pitches that speaks to the audience where even its amazing background score too factors in. David Marconi's screenplay is the real gem that bridges between the fiction and practicality in here. The execution by the director Tony Scott fails to justify the script where neither d.o.p. nor editing works on its favor. Will Smith is genuinely good in his portrayal and is supported with a great cast like Jon Voight and Gene Hackman. Enemy Of The State lacks a fresh concept or perspective, but the gripping screenplay and stellar performance is enough to hold the audience for its more than 2 hours of runtime."
    },
    {
      "rating": "8",
      "text": "This movie is a gigantic manhunt, where a liberal-minded lawyer is inadvertently caught in the middle of a conspiracy involving the murder of a congressman at a time when important secrecy laws were to be voted on. Unknowingly, these lawyer has strong evidences that compromises the killers and they will use every means to neutralize him.That lawyer is probably the luckiest guy in the world, because he had people with him who had a lot more experience than him and who knew the danger he faced better than himself. In fact, the script is good, but the fact that the central character spends so much time in the dark about what's going on around him is hard to swallow. He spends half movie thinking that he is being targeted by a mob group because of a totally different situation. Also, 90% of the movie is pure cat and mouse game. Will Smith is good enough to appear credible in his character, but he can't compete with the charisma and strength of Gene Hackman, who shakes the movie from the moment he enters. Without him, this movie would not be so good. Jon Voight also did a good job, as a villain. The remaining cast is limited to what they have to do, which has not stopped many famous actors from agreeing to participate.Technically, it's a regular movie. Tony Scott ensured a satisfactory direction, giving coherence and elegance to the film, ensuring a pleasant pace and no dead moments. Good photography, good sound and video effects (especially in action scenes), good special effects (when needed) and a discreet but decent soundtrack round out a movie full of qualities, though not particularly noticeable, or set apart from the panorama of movies involving persecution and state plots."
    },
    {
      "rating": "8",
      "text": "I love a good conspiracy movie. Especially when it's a well thought out one. This movie was well thought out and had the perfect actors to do it."
    },
    {
      "rating": "8",
      "text": "The Enemy of The State is a thrilling movie with Will Smith being a dramatic actor."
    }
  ],
  "recommendations": [
    "nightcrawler",
    "the_fugitive",
    "sully",
    "heat",
    "apollo_13",
    "triple_9",
    "captain_phillips",
    "sicario",
    "the_score",
    "man_on_fire",
    "widows",
    "american_made",
    "donnie_brasco",
    "breach",
    "body_of_lies",
    "public_enemies",
    "hell_or_high_water",
    "the_rock",
    "casino",
    "money_monster",
    "insomnia",
    "patriot_games",
    "beirut",
    "ford_v_ferrari",
    "captain_america_the_winter_soldier"
  ]
}