{
  "id": 3138,
  "title": "Enemy",
  "starring": [
    "Jake Gyllenhaal",
    "Mélanie Laurent"
  ],
  "runtime": 91,
  "genre": [
    "Thriller",
    "Mystery"
  ],
  "description": "A mild-mannered college professor discovers a look-alike actor and delves into the other man's private affairs.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vf40tyDRKZsBmaLsYeopzfFLzLx.jpg",
  "categories": {
    "plot": 6.909090909090909,
    "acting": 7.478260869565218,
    "ending": 4.882352941176471,
    "soundtrack": 7.2,
    "cinematography": 8.285714285714286,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "One of the strangest and creepiest movies ive seen. While some people don't like unclear endings that are left up to the viewer to decide/decipher I absolutely love them. Never have I walked away from a movie in such deep thought and reflection on what ive seen. Gyllenhaal also gives what may be his best ever performance in this years best movie so far."
    },
    {
      "rating": "8",
      "text": "Even if I didn'y liked previously movies from Denis Villeneuve (which was Prisoners), Enemy is so much different that I'm really confused by final meaning of this movie. Great acting from Jake Gyllenhaal and great using of symbols makes very good movie."
    },
    {
      "rating": "9",
      "text": "The film is about a friend suggests he watch a particular video, a man recognizes the actor - as he looks exactly like him. He seeks out the actor and the two agree to meet - opening the door to something strange and sinister. This movie has a creepy score and a lot of people might not understand this movie but i did and that's why am giving this a good rating."
    },
    {
      "rating": "7",
      "text": "0 = Worse thing ever made\r5 = Average\r10 = God's gift to mankind\r Going into this movie, I was mildly excited. The cover art alone is interesting. But man, was I blown away! Jake gyllenhaal shows his mastery in acting in this cult hit that will keep you confused and intrigued for the whole ride. I highly suggest this movie if you love deep stories that get your mind working hard to find the inner meaning. also, if you are confused after viewing (like we all were) go on Youtube and watch one of the Explanation videos some people have posted. It will make a second viewing a must. Overall a great watch!"
    },
    {
      "rating": "9",
      "text": "One hell of a movie - the type of movie that gets me fired up to go to the theater. I'll simply call out the sickly yellow muck of the Toronto skyline as so effective.  Loved it.  And one critic suggested that the final shot is possibly the scariest he's ever seen in a film - I might have to agree."
    },
    {
      "rating": "6",
      "text": "Special little film that keeps you interested and intrigued despite the pacing being pretty slow. Jake Gyllenhaal takes ones again on a great role and carries the film by himself. The director has went onto bigger and better films with Sicario and Arrival. Prisoners was a better film too. But this is no less a very interesting experiment. Not a must-see, but still good."
    },
    {
      "rating": "9",
      "text": "This movie is one of the best movies of 2014. However it isn't for everyone. This is not the traditional linear story line in movies that contain beginning, middle, and end. I can understand if someone dislikes this movie. This movie leaves a lot  to interpretation, and the ending may make people say, \"What the **** Though this movie made me confused, going online and looking at theories makes me appreciate the movie more. Performances are great with Jake Gyllenhaal  as both Adam and Anthony being the star of it. The cinematography is beautiful and the score very eerie. I highly recommend this movie."
    },
    {
      "rating": "8",
      "text": "A engrossing thriller on how deep and endless our minds truly are. As Villeneuve put it bluntly, if you like the sound of \"A look into Jake Gyllenhaal's Subconscious\", you should check Enemy out."
    },
    {
      "rating": "8",
      "text": "Enemy comes across as someone's nightmare. There are a few WTF moments, especially at the end, which elevate the film to another level. Gyllenhaal is great in this and becoming a \"go to\" actor for sci-fi."
    },
    {
      "rating": "9",
      "text": "Enemy is a beautifully shot, Very well acted and directed film about the mind of the subconscious, And the haunting imagery of spiders lingering other the city of Toronto, Captivating, Edge of your seat, Enemy is a incredible unforgettable film."
    },
    {
      "rating": "7",
      "text": "Very interesting psychological thriller with a great performance from Jake Gyllenhaal and first rate direction from Denis Villeneuve, this movie is a serious mind **** Riveting from the get-go right up to its twisted shock ending, it's just the right length to avoid audience boredom. It has a slight Hitchcock feel to it, the cinematography is appropriately muted and it has an effectively eerie music sound track."
    },
    {
      "rating": "10",
      "text": "I wasn´t expecting to like this movie that much, amazing plot and great acting    ."
    },
    {
      "rating": "9",
      "text": "This film is one of a kind. Not only do we get amazing performances from the actors especially Jake Gyllenhaal, but this film requires you to think. It requires you to do research on this film. It makes you sit there mouth agape by the end of the film. Not many films did that this year. You will be confused by this movie. And part of it is all the fun of watching."
    },
    {
      "rating": "7",
      "text": "A cool little psychological thriller that features a fine performance (performances?) from Gyllenhaal.  An earnest young history professor, who is having some romantic problems, sees the face of an actor in a film that looks like his own.  He awkwardly tracks the guy down and they discover that they are physically identical.  Well directed by Villeneuve, with many ordinary interactions that are full of hidden tension.  Based on a story by Jose Saramago, \"The Double\", which would have been a better title.  A couple of weird questions are left hanging at the end."
    },
    {
      "rating": "3",
      "text": "Pure nonsense and garbage. It made no sense to me and people in the theater turned to me at the end to ask me what the hell it meant. I then turned to someone else who had no clue as well. I did not understand the spiders at all and the filming was dreary. A real waste of film and Jake G must be getting a big head if he thinks we are buying into this type of cheap bs. I didn't walk out because it wasn't long enough to walk out on. Spiders my ass."
    },
    {
      "rating": "7",
      "text": "Not every great music has to be a symphony or an opera. Sometimes, a little chamber music  can be witty and entertaining. For books and films it is the same thing.Denis Villeneuve should have kept doing this type of ingenious, powerful and intimate films, rather than getting lost, or better said, diluted, in projects such as Arrival and Blade Runner since some of the ideas and scenes he developed in Enemy have been copied in both blockbusters but in a far more bloated, bland and ponderous fashion.In this film, Villeneuve's tackles the postmodern man's neurosis, bad faith, schizophrenia and masculinity's terror of femninity in a masterly fashion.Minus points: Pacing is laborious. Some scenes drag on for too long and the initial beauty of the first scene is not repeated often during the film"
    },
    {
      "rating": "0",
      "text": "Enemy was a boring movie. I watch the movie because of JG but I was disappointed. It was nonsense! Just waiting time. I wonder what did the director want to say by such a presentation? What is the meaning of the spider at the end? About two hours of my life fell into a garbage!"
    },
    {
      "rating": "1",
      "text": "Yes, I've read all of the existential crap about this movie.  Non-linear.  Chaos not yet organized.  Etc.  Etc.  This was a film full of tiresome people doing illogical things.  Accomplishing absolutely nothing.  Thought provoking?  Yes -- I thought this film was pompous trash."
    },
    {
      "rating": "2",
      "text": "I think this is one of those movies that people praise because they didn't understand it.  They're afraid of being perceived as missing some deep artistic statement so they pretend.   The movie is a failure.\rHere's how it went for me.   The fist 30 minutes or so were a complete bore.   Then suddenly it started to intrigue me and I though it might turn out to me a good movie.   I was wrong.  It slowly fizzled away to nothing and then abruptly ended.   I was left with the distinct feeling that the film was originally meant to be something other than what was on the reels of film come the end of the shoot.  And that rather than eat crow they edited together what they could and tried to pass it off as a third rate David Lynch Film.\rThe movie is an exercise in pretension where the talent of the writers failed to meet their own vision (if there ever was one)"
    },
    {
      "rating": "2",
      "text": "Dimly lit, all beiges and browns, makes Toronto look like a dingy slumland. Too much borrowing from Naked Lunch and French art film, with long studies of thoughtful/frustrated/puzzled/sad Jake G, and not enough plot to follow. What person is not curious to meet their doppelgänger? Seems like Adam Bell got cold feet right away, and many of his reactions were questionable. Some red herrings (watch for a recurring photo) and predictable manipulative behaviour from Anthony Claire as the \"evil twin\". Or maybe he wasn't... If Denis Villeneuve wanted people to talk about the film, then he will be getting his wish, but not in a good way. I will be advising friends to avoid, avoid, avoid. At least some Canadian film crew got work; that's the only rationale for my score of 2."
    },
    {
      "rating": "0",
      "text": "You have to be kidfing!! Never wrote a review about a movie before but had to warn those thinking about seeing this movie. Do not waste your money! I am shocked that the lesd actor associated his name to this piece of junk!"
    },
    {
      "rating": "0",
      "text": "The movie is 3/4 over before you get past what the trailer reveals. The ending is predictable and more the sort of thing you'd see in a farce, one of those Comedy of Errors inspired comedies about twins, with violence tossed in. The very last few seconds, however, where surreality enters the picture, make no sense on any level whatsoever except that it was a reverse Kafka visual pun. Just stupid. A horrendously dull and plodding and unimaginative movie."
    },
    {
      "rating": "3",
      "text": "Waste of time. The story goes nowhere, I felt nothing. It tries to break the monotony of the very bland and very boring \"double personality / look alike / twin\" themed scenes by adding some random creepiness (and over acting, and crying, and drama in scenes that do not warrant it) that never succeeds, then it tries to be mysterious by waving some spider imagery here and there, but there is no symbolism or depth to any of it. Just a bland, gimmicky movie that goes nowhere."
    },
    {
      "rating": "9",
      "text": "Because this is such a polarizing film is the reason you need to see this. Prepare yourself, you will be thinking about this long after it's done. And might like it even more the second-viewing, which it's worth. Everything does make sense, as the director has stated, when it's given context. The opening line on the screen is: \"Chaos is order undeciphered\", so you know not everything is going to be spelled out to you in linear form (i.e. beginning, middle, end). It's moody (incredible photography, score) harkens back to great noirs and reminds me of The Game as directed by Cronenberg. Loved the underlining premise of fear and it's power over man's every decision."
    },
    {
      "rating": "6",
      "text": "Not nearly as bold as Villeneuve's Prisoners from last year, Enemy rests on another hefty performance from Jake Gyllenhaal. Villeneuve proves once more that his craft is unique and thought provoking; however, more symbolic and deep than necessary."
    },
    {
      "rating": "1",
      "text": "The whole movie looks like it was shot through smog. There's too many holes in the premise. Yes, there's a twist at the end but getting there is definitely not half the fun. Or any fun at all. Nothing to recommend this film at all."
    },
    {
      "rating": "4",
      "text": "Why was everything so dark? I mean, literally dark. I never understand why they don't flick the lights on. Anyway, Enemy is a Kafkaesque psychological something that didn't quite impress me. In fact, with such an idea, the double, which is not really anything new (it all probably heralds to Dostoevskij's novel rather than Saramago), with the immediate dreariness it may cause, one could have created the masterpiece of thrillers. But no, we have no such thing here."
    },
    {
      "rating": "5",
      "text": "Bizarre yet intriguing, Enemy is somewhat enjoyable, but ultimately succumbs to an unexplainably abrupt ending, which leaves viewers questioning the entire film."
    },
    {
      "rating": "8",
      "text": "\"Enemy\" is a psychological, min-bending 87 mins, with masterful crafting and flexibility & Jake Gyllenhaal delivers a solid, fascinating performance that promises more to come. It is a must see!"
    },
    {
      "rating": "1",
      "text": "Slow as molasses, filmed in a kind of sepia, depressing and with a completely unexplainable, illogical and strange end, leaving people saying \"that's it?\".  Loved Villeneuve's previous films, hated this."
    },
    {
      "rating": "1",
      "text": "Spoiler Alert!!!\r The only reason I rated this movie a 1 instead of a 0 is because it had enough allure to trick me into watching the whole thing... although I did fast forward through 50% of it as it was toooooo slow.  I kept feeling the urge to turn up the brightness on my TV because it was so dark.  However, I loved the idea of the movie - a guy meets his own doppelganger & interesting things could pursue.  However, when you think something interesting or dramatic is going to happen, it just falls flat instead.  They have so many opportunities to create a passionate or fascinating scene, but choose to go with watered down drudgery instead.  WHY?  Then, at the end, it's as if they can't muster up a real ending to this one-way street to Boringville, so they just randomly decide to throw in a gigantic spider to eat the pregnant chic (but you don't even get to SEE IT happen... zzzzz). The End. I thought this was the worst movie ever... until I watched Under the Skin... even worse!"
    },
    {
      "rating": "3",
      "text": "Enemy just isn't my movie. I liked Jake Gyllenhaal's previous collaboration with Denis Villeneuve which was Prisoners, an excellent movie, but I'm not a fan of this. I just don't get the ending and its just so drawn out and boring. I'm sure that other people can enjoy it but it just doesn't do anything for me."
    },
    {
      "rating": "7",
      "text": "his is not your traditional beginning, middle, and end story. The film has a non-linear element of story-telling, making it unique and unpredictable. People will be split on their feelings of \"Enemy,\" those who are willing to sit through a very slow paced and simple story may or may not be rewarded with an abstract puzzle that awaits to be deciphered. I did appreciate the slow paced build-up, yet was a bit disappointed at the amount of plot closure the film gave us. French-Canadian director, Denis Villeneuve's use of intense sounds and music with summer blockbuster-like camera shots contrasted greatly with the slow character driven and psychologically oriented story. It seemed as if the director was unsure of what kind of a movie he was making. The screenplay was very simple, yet very complicated, and that is greatly credited to Jake Gyllenhaal's performance, or should I say performances? The Toronto skyline setting added a suspenseful and ghost-town atmosphere to the movie, which is peculiar as Toronto is a loud and busy metropolis in reality. But perhaps the film is trying to convey that nothing is as it seems. Although Villeneuve chooses to not leave behind answers to creepy crawling questions, he gives you just enough tools to answer them yourself."
    },
    {
      "rating": "9",
      "text": "Denis Villeneuve’s Enemy is a must watch for those that love seeing independent foreign mystery films. Similar to Nicolas Winding Refn’s films, Enemy is stylishly well acted, directed, shot, written with such mysterious charisma that most film fanatics might enjoy. Enemy may not be for everybody, but overall it takes the cake of how stable it is when the tension gets tighter throughout the last minutes of this film starring Jake Gyllenhaal in action."
    },
    {
      "rating": "3",
      "text": "Its a good film if it made sense.\r The film is quite short and as you sit there watching with the ending drawing closer and closer you start to wonder when this film is finally going to piece itself together and make sense, but nope the ending is just freaky and then your sat there wondering why you even bothered watching it.\r After the film me and my girlfriend had to watch a 30minute youtube clip explaining what actually happened.\r Watch it if you like getting confused"
    },
    {
      "rating": "1",
      "text": "Denis Villeneuve tente de nous faire du David Lynch mais n'y parvient pas vraiment : son film n'est pas assez bizarre, pas assez timbré, pas assez surréaliste et en même temps pas assez réaliste : il reste le cul entre deux chaises à vivoter pendant une heure et demi qui en paraît trois...On appréciera sa maîtrise des plans, de la steadycam et de l'éclairage, ce qui donne une ambiance particulière, soulignée par une musique, non, une sorte d'accompagnement sonore discordant plutôt... ça fait son effet mais ça reste très froid.Jake Gyllenhaal est comme souvent très convaincant, même en barbu mais on se demande ce que notre Mélanie nationale est venue faire dans cette galère ! elle meuble littéralement et a l'air davantage d'une call girl que d'une copine.Finalement, contrairement aux meilleurs délires de David Lynch, Enemy n'est que fort peu sujet à une quelconque interprétation : le film reste ici vide, ses efforts sont vains et on s'en désintéresse bien vite. Même l'expérience analogue avec Lena Headey (The Broken) était plus intrigante, plus fascinante sur la question du double et de l'identité, et pourtant on pouvait déjà trouver à y redire...Un échec patent donc pour le réalisateur canadien qui n'a que sa qualité formelle ici pour séduire : c'est bien peu, trop peu pour que l'on lui accorde le plus petit bénéfice du doute. Un coup dans l'eau."
    },
    {
      "rating": "7",
      "text": "A trippy mind game. There seems to be an audience for movies in which everything apparently has second meanings, and once you figure it out it \"all\" makes sense (but not really...). It makes the viewer feel smarter than the average Joe, and this absurd feeling of superiority propagates an opinion of greatness. But sometimes these second meanings and general obtuseness don't make for a great film, even with the meanings understood.\r Scene by scene the film should work, should at least feel like growth and story in service of something. This isn't quite that. There are moments of great cinema in here, but even with an even interpretation, there are still long-winded scenes of ponderousness that don't further any sort of feeling for the story, outside of trying to provide some out of reach meaning.\r What I mean is this: David Lynch makes great films with plots that can't be explained are are looped in some dream logic. But they still work even without meaning. This film never quite does."
    },
    {
      "rating": "8",
      "text": "ENEMY is Denis Villeneuve’s back-to-back psychological drama with PRISONER (2013, 8/10), treads the water of a doppelgänger sub-genre, it is a neatly gripping head-scratcher hoisted by its jaw-dropping anti-climax (literally the flabbergasted final scene), and confidently beckons for repeated viewings, running succinctly within 90 minutes, Villeneuve knows how to play his game perfectly.\r continue reading my review on my blog: google cinema omnivore, thanks"
    },
    {
      "rating": "8",
      "text": "I am surprised at the mixed response to this one from the audience, but I really liked Enemy. It was unique, weird, and incredibly confusing, but that is what makes it fun at the end of the day. I love films that leave you wondering, \"What the hell did I just watch?\" and this one fits the bill to a t. Jake Gyllenhaal is phenomenal here as Adam Bell and Anthony Claire. He plays these two different, but very similar men brilliantly and is able to switch between the two at the drop of a hat, which is really cool to watch. In addition, it is gorgeously filmed. I loved the lighting at night and, on top of that, the shots during the day are also very beautiful. It truly is eye candy. It also functions great as a psychological thriller as, even though it slow going in the beginning, when it kicks into high gear, you are left wondering \"Wtf wtf wtf wtf\" as events unfold. This was one of my most anticipated films of 2014 and now that I have finally been able to see it, it does not disappoint at all. I have no idea what any of it means, but I have a sneaking suspicion that this one will benefit from repeat viewings."
    },
    {
      "rating": "6",
      "text": "Decent, thought-provoking movie with not much substance. Some nudity, some cursing, and a lot of confusion and thinking. I'm sure the concept was great (maybe as a book or screenplay), but as a movie it didn't really work.\rIn summary, rent if you want, but don't buy unless you absolutely love the movie. It reminded me of another B-movie with Jake Gyllenhall: Source Code. So if you liked that, you might like this."
    },
    {
      "rating": "8",
      "text": "Whoever watched the movie 'Prisoners' will definitely expect like the much mount Everest, because it was the next feature film from the same director. Which will also lead to disappointment for the majority because it was detached from entertainment in the far distance. You can call it an art movie, but the materials used for the story were somehow stronger. I mean for the grown ups and especially for a man with patience. It deal about a middle aged man and his world of desires towards sex and irresponsibility in the life he lives.\r It was adapted from a novel called 'The Double'. Looks like the title was not available then changed it to 'Enemy'. Not a bad title either, but slightly misleads especially after watcher 'Prisoners'. Adam is a history professor and his life is a less joyous. His mother is worried about him for being careless. One day by chance he discovers something while watching a movie that knocks his inner consciousness. He begins to give more interest on it and prepare to solve the mystery. The venture he's after is supposed to take place smoothly, but it didn't. Hits back to his life and scatters the pieces of his own identity.\r ‘‘Never know how your day\ris gonna turn out.’’\r I must make you understand that it was like a jigsaw puzzle. The story just happens and it won't expose completely with proper description. Like the outer layer of a fruit, but inside there are lots of stuffs to figure it out by ourselves. If you are a smart enough, you will sketch your own conclusion by joining the pieces. For that you may need to watch twice. Revealing my opinion may end in spoiler, but wanted to say that the story was programmed to handle a man's irresponsibility and desire. Both were symbolically exposed its identity and rest of the things leaves for the audience to observe closely, otherwise you will miss the important point.\r I yet to watch 'The Double', the description kind of match to this. Nowadays this thing keeps happening frequently like recently ones 'Olympus Has Fallen' and 'White House Down'. Anyway, Jake Gyllenhaal was awesome in this movie. Almost 90 per cent of the movie frames had captured his presence. Without a doubt its a one man show. He's becoming a great personality in Hollywood, but it was not a Hollywood flick. Finally, one more time I will remind you that it is not a piece of cake for everyone, choose it if you are not preferring entertainment."
    },
    {
      "rating": "9",
      "text": "This movie was good but confusing on my first watch and amazing on the second. I did some reading on the theories of what's happening in the film before watching it a second time and enjoyed noticing all the little hints. The story is really well-written with lots of little details that bring everything together, plus some ambiguity so it's open to some interpretation. Combine that with great cinematography that really strengthens the movie's themes.If you enjoy watching movies that make you think, this is a great choice."
    },
    {
      "rating": "10",
      "text": "I couldn't take my eyes off of the screen for the entire movie.  The tone was even and powerful throughout, the intrigue didn't let up for a scene or a second, the score and the composition were supremely complimentary.  I saw the trailer and knew I wanted to see this movie and I can assure you that there's a lot more going on here than that teaser would have you think.  This is a movie that will leave you anxious and hungry for an explanation.  There are a lot of great discussions on the film's meaning and I think it's pretty subjective.  This is a movie that unapologetically breaks the template of contemporary film expectations.  You haven't seen anything like this, you likely won't again and comparing it to anything else would be a stretch."
    },
    {
      "rating": "9",
      "text": "I had a very different idea about this movie, because it starts with some explanations about dictatorship, so I thought I will be a political movie. But instead it is psychological with a great performance by Jake Gyllenhaal. In addition I didnt expect a great movie, because the scores in internet are not that good, but I like such movies, so I enjoyed it to think all the time, to think about the story."
    },
    {
      "rating": "8",
      "text": "A truly captivating yet exceedingly confusing art-house film that left me thinking that I must watch it again; and on a couple more viewings the film becomes so much more clear.\rThe films message is constantly yet subtly given through dialogue, imagery and metaphors that make it hard to keep up with, as there is only a 86 minute mark to build up and finalise the films themes. The film is a mind bender for sure but it is maybe best to go into viewing with this in mind. Jake Gyllenhaal’s character is battling something; what I will not spill. He must deal with it and fix the problem. The film also heavily links itself with dictatorship and women, so take note of this and watch the screen carefully. Basically, without spoiling anything, the films message and themes are executed in maybe a bit too indistinguishable way but once you’ve figured it out it becomes an incredibly interesting film.\rThe films pacing wasn’t too bad but then it was only 86 minutes so it didn’t have to worry itself about that too much. Directing was very nice and really helped highlight the films message visually. The acting was good all round, but nothing extremely award worthy here. Most enjoyably is the last 15 minutes of the film, which are perfectly delivered for the audience to sit there tensely and afterwards deliberate over; and with this comes one of the creepiest and scariest finales I have ever witnessed!\rSound design and the soundtrack to the film add exquisitely to the films tone and atmosphere, but doesn’t overpower itself. The dark and brooding atmosphere feels like something out of a Fincher classic.\rOverall the film is well worth the watch but with maybe not too friendly a viewing for people don’t don’t want to think too hard the film is not too easily accessible, quite an elitist film perhaps. I would give this film a 7.6ish or a bit more, and so will round up to 8. I don’t believe the film has warranted itself an 8 but it Is definitely more than a 7 and better than what some people have made it out to be. Very enjoyable but not easily digestible; Will take a few bites.\r7.6/10"
    },
    {
      "rating": "6",
      "text": "Es una pelicula que te puede hacer pensar mucho de que trata o por que pasan las cosas que ves, pero que te llega a entretener actuaciones muy buenas. dejando que cada persona saque sus conclusiones de la trama."
    },
    {
      "rating": "7",
      "text": "Enemy was quite strange. After watching Prisoners, I expected more from this (because of the same director), but this movie could've been a Coen brothers movie, since their style is out there..."
    },
    {
      "rating": "8",
      "text": "The cinematography was superb, the acting was amazing and the movie was interesting and unpredictable.Enemy definitely is a movie you should not miss."
    },
    {
      "rating": "10",
      "text": "An amazing movie. It made me feel and think. It leads the viewer down a dark and curious path. And the feeling stays with you as you think about the movie for days afterwords. This is art. It is not for people looking for an anesthesia in the form of mindless action-comedy. Most amazingly it makes Mississauga look fascinating and mysterious."
    },
    {
      "rating": "9",
      "text": "Silent but Deadly this film is unique, great performance by Jake Gyllenhaal the plot is scattered around like a puzzle in desperate need for an intelligent audience to solve it."
    }
  ]
}