{
  "id": 2757,
  "title": "Enemy at the Gates",
  "starring": [
    "Jude Law",
    "Joseph Fiennes"
  ],
  "runtime": 131,
  "genre": [
    "Drama",
    "War",
    "History"
  ],
  "description": "A Russian and a German sniper play a game of cat-and-mouse during the Battle of Stalingrad in WWII.",
  "releaseYear": "2001",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9cSoNnB31hGY2mL78VT8mAbz6nR.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.285714285714286,
    "ending": 7.0,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.428571428571429
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Typical anti-Russian propaganda. Average for the west cinema user that has little to do with reality.\rThese films and form misconceptions about history"
    },
    {
      "rating": "6",
      "text": "Movie is alright to watch if you have nothing better to do ,however it could have been done a lot better and more accurate ,having read Vassily's book from historically accurate point of view movie is garbage ,probably even insulting for relatives.Vassily doesn't even mention Tania (yet he bothers to mention 3 other nurses)in the book so clearlyt didn't mean that much to him,Daniilov either.Lyudmila and Kulikov who got shown as chumps in movie and got killed were excellent snipers themselves and survived the war.The duel whatever you believe Russian's made it up or Nazis deleted Konnings name out of embarrassment  that their sniper got killed by village boy from Ural,Vasilly doesn't even give much significance in the book let alone show it as the circus movie made it to be."
    },
    {
      "rating": "2",
      "text": "The film has only one positive point - the quality of the picture. Logic is missing, as is credibility. Many moments are distorted or fiction. Some frames are so absurd that the question arises: “How did the scriptwriters come up this and why!?” (Translate with Google)"
    },
    {
      "rating": "6",
      "text": "This film has many screenplay issues but also good performances and some strong scenes."
    },
    {
      "rating": "4",
      "text": "Your joking right? this isnt a good war movie!! I should note i dont think i liked black hawk down that much either. But i'm extremely fond of saving private ryan(luv the characters and story) this ones concept, snipers playin cat an mouse is sooo cool but unfortunately, i felt bored, aggitated and quite shockingly resentful towards the film. the climax was lame, the acting wasnt horrible but its just how this ones written that doesnt wanna tick into stylishness. A mere disappointment. I am one of those rare people who actually despise this film beyond recognition. If only we had a different writer for it, such a waste of talent."
    },
    {
      "rating": "3",
      "text": "I was expecting a dramatic war movie, not a boring, poorly acted, incredibly cliched \"love\" story. Unfortunately, I got the latter."
    },
    {
      "rating": "5",
      "text": "A bland, unconvincing WW2 adventure that tries hard to be a solemn portrait of struggle. Instead we are given a jumbled mess of an ambitious commissar, a home-town boy and the partisan fighter he falls in love with. Worth a watch for the tense, well-staged sniper duels, but little else."
    },
    {
      "rating": "7",
      "text": "Pretty good WW2 movie with a solid story.I was not impressed with the acting, but the intense that was built held me till the end of it. Also the film represented the horror like it really was in Battle of Stalingrad."
    },
    {
      "rating": "0",
      "text": "Пропаганда против советской власти. Тот кто это снимал подкупленный идиот..."
    },
    {
      "rating": "7",
      "text": "A good war movie. I wasn't even annoyed by the love story, it seemed a pretty accurate portrayal of snipers, the sets were also all realistic. Sometimes it slows down a little, but there are enough ideas and twist to keep the viewer entertained."
    },
    {
      "rating": "9",
      "text": "An epic war based film filled with drama, action and gore. Holds historical accuracy and value, and the acting is floorless. The production team deserves bags of credit; great picture, and an even better soundtrack - jam packed with all the necessary micro-elements such as realistic sound effects and compelling music."
    },
    {
      "rating": "7",
      "text": "A film with some great set piece battle scenes involving hundreds of extras; it does look quite epic in places. I would have liked to have seen it on the big screen, I’m sure it was quite impressive. The music was pretty good; mainly relying on great sweeping themes throughout it did put me in mind of another epic war film set in Russia. All the performances were very good with Jude Law, Rachel Weisz and Ed Harris standing out for me. It was one of those films that was good, with ambitions of being great but never quite getting there. Sadly I felt that the love triangle got in the way, a bit, of a decent war film. I say ‘sadly’ because I thought Rachel Weisz was particularly good in this one. Over all though, I found it a bit too long but still quit a decent watch.\r SteelMonster’s verdict: RECOMMENDED\r My score: 7.3/10."
    },
    {
      "rating": "7",
      "text": "I had an opportunity to watch Enemy at the Gate last night which I had never seen and found it to be an enjoyable war movie. It was bold and daring to create and an English film totally set in Russia and not to feature any Americans which does give the movie some originality from the bucket loads of American hero themed WW2 movies out there. The gritty visual style, props, and costumes are also very impressive and believable. There are also some good war and battle scenes, some of which have gone on to influence popular shooter video games like Call of Duty. Some of the characters are interesting however the love story becomes silly and feels a little unsuited to the movie, I can see the intention to bring some warmth into the gloom and doom of depressing Russia but it didnt work. Some of the accents also feel out of place but the movies core strength is the cat and mouse hunting of its 2 leads which is entertaining and enjoyable. Not a perfect movie due to its silly mishandled love story but recommended."
    },
    {
      "rating": "7",
      "text": "One of the most amusing movies I've ever seen because it shows the truth behind the war and it contains a lot of action scenes. But how did the girl survive in the end?"
    },
    {
      "rating": "10",
      "text": "A great WWII movie. Loads of action and splendid acting. If you love snipers and WWII, this is the movie for you. Some romance scenes in it aswell, well made movie."
    },
    {
      "rating": "0",
      "text": "Hands down the worst movie ever. It's absolutely ahistorical waste of time filled with anti-russian propaganda. Vasily Zaitsev most likely rolled over in his grave after this crap was released."
    },
    {
      "rating": "6",
      "text": "The unnecessary and platitudinous love story is a major drag, but there are more than enough suspenseful and thrilling scenes to keep the movie going smoothly."
    },
    {
      "rating": "6",
      "text": "\"Enemy at the Gates\" is a decently engrossing, suspenseful war film centered around a historical duel that took place between a Russian and German sniper. Rachel Weisz is a nice surprise to see here, and adds some healthy romantic interest, and the rest of the lead cast puts forth good performances. The most interesting part of the movie is the story it's based on and the dueling scenes, beyond that you can expect some fairly standard war film fodder. Certainly not a bad movie by any means, so check it out if you're a war buff."
    },
    {
      "rating": "8",
      "text": "Les films sur la Seconde sont légion mais ceux traitant du Front de l'Est sont bien trop rares, sans doute parce qu'en occident, tout cela nous paraît bien loin et que ça ne concernait après tout qu'une guerre à mort entre des nazis et des bolchéviks...Et pourtant, Stalingrad signe bel et bien un tournant dans le conflit, une nette inversion de tendance à tout le moins... Jean-Jacques Annaud nous fait donc profiter d'une reconstitution soignée -bien que sévèrement romancée, un peu trop même- de la bataille décisive. Le plus étonnant est le rôle important accordé à Khrouchtchev, commissaire politique dédié et grand motivateur de troupes mais don't act...Il est campé par un Bob Hoskins tantôt enragé, tantôt menaçant à souhait et tout-à-fait raccord avec les méthodes soviétiques employées lors du conflit : loin de glorifier le Soviet Suprême et sa clique, le film nous montre à la fois le dénuement de l'Armée Rouge et le comportement abominable de ses gradés qui tirent sur leurs propres hommes, enfin je veux dire ceux qui reculent, c'est-à-dire \"les traîtres à la patrie\"...Du côté nazi, tout n'est pas très rose non plus avec l'histoire du gamin... mais au cas où vous n'auriez pa saisi, Stalingrad n'était pas une colonie de vacances, dans un camp comme dans l'autre... En tout cas, Ed Harris est excellent dans le rôle du sniper ennemi et d'une sobriété, d'une neutralité exemplaires.Jude Law dans le rôle du héros soviétique à l'insu de son ignorance ne s'en tire pas trop mal mais ne s'avère jamais réellement à la hauteur de sa tâche : quant à Rachel, elle est hélas un peu trop servie comme \"repos du guerrier\" et pas grand-chose de plus...  Joseph Fiennes est heureusement excellent d'intensité, dévoué à la cause et presque aussi cinglé que ce bon vieux Nikita...En outre, la fin un peu trop hollywoodienne loupe le coche, car le film de JJ Annaud est globalement assez dur (avec quelques notes de psychodrame, certes) et gagnait jusque là sur les tableaux du réalisme et de la crédibilité.Rien de grave cependant, car ce Stalingrad réussit à atteindre et maintenir un bel équilibre entre le grand spectacle, sa mise en scène rigoureuse et la romance ainsi que quelques moments forts. Le manichéisme est finalement assez réduit et on doit sans doute au réalisateur français de ne pas en avoir rajouté (sauf éventuellement dans le psychodrame...).Il n'en a pas moins fait prendre conscience au spectateur via ce duel à distance de la dureté de la guerre, ce qui n'est certes pas toujours le cas dans le genre très fréquenté des films de guerre : on en ressort ici ému, prêt à chanter l'hymne non pas de l'affreux camarade moustachu mais celui de la Russie éternelle invaincue (et nous autres, Français, en savons quelque chose !)."
    },
    {
      "rating": "6",
      "text": "Movie war / drama / romance, all in one.This film portrays the Battle of Stalingrad, considered by many the turning point of World War II, as it was the first crushing defeat of the Germans. The film focuses its history in Vassili Zeitzev, a soviet sniper who caused many headaches to the Nazis, killing his officers on the ground, something that was used by the communist propaganda machine to encourage the morale of Russian troops, worn by unstoppable advance of the Nazis. In this film, the story of Zeitzev intersects with Tania, a Russian girl who volunteered to help the forces defending Stalingrad, giving birth to a romantic plot that intersects the main one. Directed by Jean-Jacques Annaud (who also wrote the screenplay with Alain Godard), the film has Jude Law and Rachel Weisz in the lead roles and also features Joseph Fiennes in the role of a political commissar, Bob Hoskins, embodying the Russian leader Nikita Khrushchev, and Ed Harris in the role of a German professional sniper sent by Hitler to kill Vassili.The wartime love is a theme that has made great films. One of the most notable was obviously \"Casablanca\". This film, however, takes place not only in wartime but in the midst of one of the most raw and bloody battles of the war, which makes it more interesting as it is not just a romance or a drama, nor a \"conventional\" war film. It's a bit of all three genres combined. The sound effects, soundtrack, visual effects, sets and costumes are noteworthy for their realism and attempt to portray the combat scenario. The actors were also very good, especially Ed Harris (who has got used to doing tough-guy roles) and Weisz (finally a movie without mummies and Egyptian stuff). Jude Law and Fiennes, together, deserve a special greeting as they were able to incorporate very well the emotional and psychological conflicts of his characters, two friends in love with the same girl.As more negative marks, I point out the lack of \"chemistry\" between Weisz and Law, which should have been more crafted by two actors. Some dialogue required a greater commitment on the part of writers. Also I don't understand how Khrushchev was involved in that battle when, in reality, it was led by Georgi Zhukov. A good war movie, worth seeing because it will please both those looking for action as for those who enjoy a good drama."
    },
    {
      "rating": "7",
      "text": "A good world war 2 movie. If you love snipers and war. Watch it. Solid story with good actions and acting."
    },
    {
      "rating": "10",
      "text": "The mivie presents a interesting history, about courage a sacrifice. Virtually the most bloody battle of WW2, even now, after 60 years from the battle, the scars of war still remain in the citizen of it.Thanks to the Russian propaganda, the Germans called their best sharpshooter, Major Konig, especially to kill Zaitsev. In the middle of the film, becames evident that the battle is not only in the city, but there's a fierce internal battle between Zaitsev and his fella Danilov (Fiennes), that have a special feeling for Tania (Weisz) and in a major moment starts to write lies about Zaitsev, and in the final sacrifices his own life to reveal the position of the german sniper, so Vassili can finnaly kill him. It is a interesting film that opens the people's eyes to they see how bad, bloody and terrible a war can be.You feel a little suspense during the film, because you don't know where can a soldier be and shoot you to death."
    },
    {
      "rating": "6",
      "text": "The cat and mouse game at the core of this film works well. But there is a very conventional hollywood melodrama in the way. Rachel Weiss and Bob Hoskings in particular give good performances, but Jude Law is miscast in the central role."
    },
    {
      "rating": "7",
      "text": "The cast deliver decent performances with the potent screenplay. Although the action set pieces aren't the best in its genre, there is a suitable tension to it to bolster the drama well. An excellent watch for fans of this genre."
    },
    {
      "rating": "10",
      "text": "Film-epochue. Big battles and wery good music. Film have some \"klukva\", but when you watching film-you don see thus klukva"
    },
    {
      "rating": "4",
      "text": "Bad movie. Bad propaganda. That's all I've got to say, so keep the whole stack with you chief."
    }
  ],
  "recommendations": [
    "the_patriot",
    "black_hawk_down",
    "we_were_soldiers",
    "the_eagle",
    "centurion",
    "12_strong",
    "troy",
    "hacksaw_ridge",
    "platoon",
    "full_metal_jacket",
    "the_deer_hunter",
    "captain_america_the_winter_soldier",
    "red_tails",
    "the_last_samurai",
    "midway",
    "master_and_commander_the_far_side_of_the_world",
    "anthropoid",
    "captain_america_civil_war",
    "the_sum_of_all_fears",
    "gladiator",
    "pearl_harbor",
    "hostiles",
    "conan_the_barbarian",
    "the_monuments_men",
    "allied"
  ]
}