{
  "id": 2092,
  "title": "Enola Holmes 2",
  "starring": [
    "Millie Bobby Brown",
    "Henry Cavill"
  ],
  "runtime": 129,
  "genre": [
    "Mystery",
    "Adventure",
    "Comedy",
    "Crime"
  ],
  "description": "Now a detective-for-hire like her infamous brother, Enola Holmes takes on her first official case to find a missing girl, as the sparks of a dangerous conspiracy ignite a mystery that requires the help of friends — and Sherlock himself — to unravel.",
  "releaseYear": "2022",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tegBpjM5ODoYoM1NjaiHVLEA0QM.jpg",
  "categories": {
    "plot": 2.736842105263158,
    "acting": 2.6176470588235294,
    "ending": 3.75,
    "soundtrack": 5.0,
    "cinematography": 1.3333333333333333,
    "familyFriendly": 2.0,
    "funny": 1.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Woke YA script that may have an impressive cast, but cannot help but destroy itself with modern messaging and the pathological need to tear down legacy characters, in the pretense of building new ones.  Burning down your neighbour's house does not increase the value of yours."
    },
    {
      "rating": "3",
      "text": "While a good movie it completely ignores key points from the books if you read the books I would not recommend watchingI give it 2.5 stars but that’s only mostly for the acting. The only thing I absolutely detest is the love interest which does not exist at all in the books and was only manufactured most likely due to the fact that all movies must have some predictably romantic feature if you want them to be popular apparently"
    },
    {
      "rating": "0",
      "text": "Elementary, indeed. As in on the level of a grade schooler.  More woke **** I have a pang of guilt, having never needed to come to the defense of a 19th century fictional character before, but this is Ghostbusters all over again. Right in the description, \"her useless brothers, Sherlock and Mycroft.\" Really? Face facts, Netflix, there would, and never has been, an Enola Holmes super girl detective, without Sherlock. Why the need to denigrate one of the most celebrated fictional detectives in order to sell this? Because nobody cares about some nameless girl detective and she needed the credibility of the original. They did this in the Alienist too; beefed up a female character to be woke. It so unoriginal and childish. Especially given that there are plenty of talented women writers out there that could write an original script/character. Yet another attempted cash in of an established genre/franchise."
    },
    {
      "rating": "0",
      "text": "Absolute trash. Beyond bad I'd be more than happy to get on the piss hard and wake up forgetting ever watching it"
    },
    {
      "rating": "0",
      "text": "Feminism is so forced into this movie that it just get annoying after a while, and by while I mean 5 minutes into the movie.A female child with feministic ideals played by Millie Bobby Brown, wait, isn't she the same spoiled kid who secretly negotiated a separate pay package from ST's other child actors? Well, there goes equal pay for women.A storyline urging women to break the stereotype only a minute later casting a stereotypical slack-jawed good-looking male sidekick (Louis Partridge).How pathetic can Hollywood get? Well, 2016 called, and Ghostbusters want their script back."
    },
    {
      "rating": "4",
      "text": "Starts off interesting. Like all genre of movies this movie has a lot of tropes people have begun to classify as “woke”. Sherlock Holmes is in the Movie and plays the “bad farther” roll. Meaning more often than not he is lectured through out the movie. The movie employs the “Mary Sue” writing style. Enola is a young child that understands the world better than Sherlock Holmes. She is a better fighter than a trained assassin. She commands the respect of adults regardless of her age due to her superior intellect. If the viewer at any point catches on to type of movie it is easy to figure out that the villain must be a woman. In these movies any character of note is generally a woman. Finally the message of the movie is that world needs to change and become more progressive which is made clear in the first act.Weather you like this genre of film or not it has interesting parts. The movie tries to keep a balance of a strong feminist story and an interesting story for everyone. Enola is a great fighter. The movie makes sure to show her learn this skill. She has a superior intellect and her education is shown through the movie. The lead actress has proven herself many times over and is entertaining. The movie does a good job of fixing issues with this genre but at the end of the day it’s more of the same. With lines like “your a man when I say you are” and Sherlock Holme’s character being lectured by an African American (England?) women about white privilege it just detracts from the story. V/RSwpoison"
    },
    {
      "rating": "4",
      "text": "\"Do I want to find you?\".( 40/100 ).\"Enola Holmes\" es la primera película de Harry Bradbeer, quien tiene una carrera extensa en la televisión, y está escrita por Jack Thorne, cuyo mayor éxito fue colaborar en la adaptación del guion en la película \"Wonder\" (2017). \"Enola Holmes\" es una historia inofensiva que hace muy poco para inspirar y demasiado para entretener. El guion es culpable de ambas, tanto por \"mal representar\" un propósito socialmente importante como por querer llenar la película de aventuras igualmente mal desarrolladas. La trayectoria de Enola es desenfocada y se otorga responsabilidades que la desvían de su propio objetivo. Los \"nuevos\" caminos le permiten aprender del mundo y de ella misma, pero esto provoca que la autonomía de Enola esté a la disposición de los menos responsables. Como diciendo \"yo soy más inteligente que tú, tomaré responsabilidad de tus problemas\" (una idea algo irresponsable que promueve el abuso). En fin, esto se disfraza con un romance mudo y entre miradas de la forma más cliché posible y elimina cualquier propósito de empoderamiento en la película. Las ideologías de los demás personajes son tan drásticas que no permite ningún debate. Todos estaremos de acuerdo con lo mismo de siempre. También hay un esfuerzo por hacer notar que Enola no lo sabe todo y eso trata de agregar intriga y madurez al ambiente, pero realmente solo genera una auto-contradicción que anula cualquier lección previamente aprendida. Por lo tanto, la actuación de Millie Bobby Brown se reduce a un personaje con poco sentido que le gusta hablar consigo misma, y Henry Cavill, Sam Claflin, Helena Bonham, Louis Partridge y Fiona Shaw no aportan ni muestran un impulso importante. El único esfuerzo visual, aunque no sorprende, es el vestuario. Ni la fotografía, ni la música. \"Enola Holmes\" falla en llamar la atención de jóvenes y adultos en esta historia, pues esta película es una monótona distracción que entretiene solo a las audiencias poco experimentadas.-\"Enola Holmes\" is the first movie of Harry Bradbeer, who has a long career in TV Shows, and is written by Jack Thorne, whose greatest success has been collaborating in the adaptation of the script of \"Wonder\" (2017) movie. \"Enola Holmes\" is an inoffensive story that makes too little to inspire and too much to entertain. The script is to blame for both of them: for wrongly presenting a socially relevant purpose and for wanting to fill the movie with adventures equally poorly developed. Enola's trajectory is blurry and takes responsibilities that divert her from her own mission. The \"new\" paths allow her to learn from the world and from herself, but this causes that Enola's autonomy to be in the disposition of those less responsible. Like saying \"I'm more intelligent than you, I'll take responsibility of your problems\" (an irresponsible idea that promotes abuse). Anyway, this is disguised by a speechless romance between glances made in the most cliche possible way and erases any empowerment purpose of the movie. The other character's ideologies are too drastic that they don't permit any debate. We all will be agree with the same things as always. There's also an effort to show that Enola \"doesn't know everything\" and tries to add some intrigue and maturity in the ambient, but that only creates a self-contradiction that nullifies any lection previously learned. Therefore, the acting of Millie Bobby Brown gets reduced to a character with not much sense that likes to speak to herself. Henry Cavill, San Claflin, Helena Bonham, Louise Partridge, and Fiona Shaw doesn't provide or show any relevant acting moment. The only visual effort, but not surprising, is the costume design. Not photography, nor music. \"Enola Holmes\" fails to call the attention of young and grown-ups in this story since this movie is a monotonous distraction that will entertain only the least experimented audiences."
    },
    {
      "rating": "6",
      "text": "Bradbeer didn't make Enola Holmes be a female Sherlock Holmes film and he didn't make it to be filled with intriguing mysteries. He made it to be a light-hearted coming of age film with some name recognition, a hint of mystery, and an inspirational end. You’ll remember Enola Holmes for the bright characters and delightful performances, not so much for the story. It’s clear Harry Bradbeer knew what the strengths of the film were and played to them. With a better story and a focus on Enola’s sleuthing skills, a sequel could easily become something exceptional."
    },
    {
      "rating": "4",
      "text": "The perfect movie to teach feminism to 12-year-old girls. The problem is it's rated PG-13."
    },
    {
      "rating": "5",
      "text": "Maybe children will like this film. However, as a grownup I was soon bored by the stereotype story and figures. Millie Brown is charming, but Henry Cavill doesn't really fit as Sherlock. A pity, I thought the idea would have had some potential."
    },
    {
      "rating": "4",
      "text": "A really good premise spoiled by a script that rushes through matters in the horribly disjointed way that seems to plague recent filmmaking. Do producers truly believe you can't hold a modern attention for more than five minutes? Brown's performance lifts the material a little and the backdrops are nice but that's about it."
    },
    {
      "rating": "5",
      "text": "The concept and idea of this movie was good lets not get this wrong but really should've been a series, just to let us know more about the characters individually and its kinda rushed too. just to say there is a LOT of fourth wall breaks maybe 2 or 3 would've been enough and the fourth wall breaks doesn't feel like Enola at all but more Millie just saying. Overall an okay as a midnight movie when you got nothing to watch. p.s. I really hope there will be a spin off series by Netflix because its a good concept as an early teens show like Umbrella Academy and yes clearly the cast won't be the same."
    },
    {
      "rating": "3",
      "text": "The story tries to hang on to the Holmes name, an attempt to create a character based on a family name so a book's author, producers and long etcetera could made money. At the end you get a cringe and woke story. The ambientation was well made. The acting was quite good but not enough to be interesting."
    },
    {
      "rating": "2",
      "text": "Synopsis: 16-year old Mary Sue explains everything she’s doing/is about to do/just did, both to correct all the men and to educate all the viewers. Attaching the Holmes label assumes you’re going to give the viewers at least some credit. So, 2 points for thinking you can get away with not doing this."
    },
    {
      "rating": "0",
      "text": "Mary Sue fanfiction rapes the past with a character expansion insert and a 2020 political plot. No wonder Conan Doyle's estate are suing, the movie is filmed in a quirky late 20th century manner, and it violates the spirit of Conan Doyle's works with metaphorical anvils for the crudest of motives, personal opinion. While I agree with first-wave feminism it seems impertinent to not let the dead speak for themselves with their existing work, and exhume their corpses so that you may put your words in their mouth, much like a necrophile liberal or conservative may wish to rape YOUR dear author."
    },
    {
      "rating": "0",
      "text": "I couldn’t finish it. It never really got my attention as everything was over explained. Did not need to use my brain while viewing."
    },
    {
      "rating": "3",
      "text": "Despite having a great cast that makes this movie watchable, Enola Holmes suffers from terrible writing and a bland story that fails to be even remotely interesting. Not to mention the crippling slow pace that the second act suffers from. What could have been an enjoyable movie becomes a nearly insufferable bore."
    },
    {
      "rating": "4",
      "text": "Strong cast (love all the main actors), great camera work, impressive surroundings all suffering under a superficial, unrealistic script and an obnoxious tendency to kill the atmosphere by a need to keep breaking the fourth wall.It's also a very sad piece of work that can not help throwing in modern politics(which won't age well), ignoring things like zeitgeist and the real issue back then between the poor and the rich (which still is).I wouldn't mind a strong female character in a deep well thought out story. Enough games and movies have proven that such things are easy to be expected 'with good writers', those are sadly not found here and only feed the real sexists found on the far right 'and' far left."
    },
    {
      "rating": "3",
      "text": "This movie didn’t deserve Millie’s talent. This is the WORST directed movie I have EVER seen. It is not cohesive and the pay offs to the set ups are ruined by the emotionless directing. Also, in the scene where tewksbury gets shot and Enola kills the guy in the hat, in one shot the guy had blood and in the next shot no blood. Too bad I was excited for this movie"
    },
    {
      "rating": "1",
      "text": "Cliché party. It is ok to promote feminist ideals, but this stupid Sherlock performance is awkward and nonsense. Also, this is the most emotional Sherlock Holmes related film I’ve ever seen, it made the Holmes family go nonsense."
    },
    {
      "rating": "1",
      "text": "The modern movie and political area have poisoned the well, you can no longer look at a movie without seeing an underlying political message.This movie is just a click bait, men are bad, go go captain  marvel etc. etc."
    },
    {
      "rating": "3",
      "text": "Great cast, great story, great costume, and very very bad directing skills."
    },
    {
      "rating": "0",
      "text": "I like MBB but all other acrors we're awful. The story was boring, just as Mary Sue enola. It's just feminist brainwashing propaganda."
    },
    {
      "rating": "0",
      "text": "Es un completo insulto a la inteligencia y el buen gusto, lleno de anacronismos, personas de color de sexo femenino enseñando karate en la Inglaterra Victoriana? Lestrade es Arabe o Indú ? y lo peor de todo... ¿Porqué debe Enola romper la cuartapared cada vez que puede? parece por momentos que es un episodio de Malcolm el del medio, pero muy mal... tiene buenas ideas que no supieron ser llevadas adecuadamente, Henry Cavill como Holes está bien y Millie Bobby Brown definitivamente es una prodigio, lo malo es ese Microft patético y edulclorado perpetrado por San Claflin , hacer parecer al hermano mayor de los Holms quien realmente es el más listo, como una caricatura mediocre y burlezca del original, esta película tenía una buena idea y prometía mucho, pero el  guión y dirección la arruinaron, a ver si mejoran en la parte 2."
    },
    {
      "rating": "0",
      "text": "stop it......................................................................"
    },
    {
      "rating": "0",
      "text": "feminism agenda , hatred of men, useless plot , just a bad movie for aggressive liberal women who hate the man and society in general , a bad movie for a bad 2020 year , 0 of 10"
    },
    {
      "rating": "2",
      "text": "I didn't finish this movie because I couldn't. It was not for the \"politics\" or feminism that I lament this movie, at least not entirely. I am glad that this film had a feminist message, but the feminism was ham-handed. Social justice is something that needs to be achieved still, and woman-positive media is a way to help achieve that.What was most reprehensible and anti-Holmesian was the fourth wall breaking; the direct speaking to the audience that was annoying and unrealistic and unnecessary. Also, The story was not compelling. The old \"what happened to character X that disappeared suddenly without a trace\" trope as the first mystery was boring. Furthermore, the use of clues was not typical of Sherlock Holmes. The deduction that Enola used was based on her personal knowledge of her mother, rather than keen observation, the deep pool of knowledge that Sherlock Holmes gains through reading, or his network, which Sherlock uses to solve mysteries. Indeed, Enola had no network because she was cooped up and home-schooled by her mother, played by an unoriginal and overrated Helena Bonham Carter.The relationship and age of all the Holmes doesn't make sense and seemed forced, although some marriages did start at a very early age for many young \"women\" in the 1800s. There's barely 17 years between Cavill and Carter and Mycroft is supposed to be 7 years older than Sherlock, so... mother at 10? Before the average girl's first menses? Please. Despite trying to be pro-woman, this film continued Hollywood's infantilization of women and cast an unrealistically young mother Holmes. They should have went with a older, more intelligent woman.Lastly, I thought Calvill's acting was wooden and dull. He didn't seem to be processing much in his head like a real Sherlock would. Of course, some of this is due to his writing, which made him to look inferior to the upstart Enola, because this movie is both anti-man and young adult fiction. This could have been a much better film."
    },
    {
      "rating": "0",
      "text": "This movie is so cringey it's akin to having sand blasted in your eyes and ears. The only positive is that an 11 year old girl will undoubtedly like it, everyone else not so much. As for all the recent \"productions\", it is filled with the usual tropes: \"men bad\", \"men incapable\", \"men evil\", \"white men worse than plague\", \"women strong\", \"women good\", \"women mary sue\", etc. In a sense, it's quite astonishing and amusing that they are still peddling this non sense: it reeks of despair. The cast is useless as there is nothing to support and the characters are paper thin, mere stereotypes of straw men. I guess everyone needs to make a living. Good job, keep up the good work!"
    },
    {
      "rating": "3",
      "text": "Muy aburrida. Diálogos tontos e infantiles y malas actuaciones. No merece la pena verla."
    },
    {
      "rating": "1",
      "text": "Це підлітковий недетектив. Генрі Кавілу 1"
    },
    {
      "rating": "0",
      "text": "Boring storytelling. Once again selling apolitical agenda gets priority instead of good writing."
    },
    {
      "rating": "2",
      "text": "I was really excited about this one. Not gonna lie. I really liked the film on it's first minutes.Then it happened...For real, I do not want to say: \"Ughh this is such a bad adaptation that's why it sucks\"Real problem here is that in one point you realize this is a Netflix production so you can expect some forced topics. But that's not the real problem, and by the way, are we seriously going to forget that Helena's character was trying to make a terrorist attack? I though she was being framed or something but turns it was more real than I thought. After finishing the film couldn't avoid to think that, for real, there's no even way to justify that Netflix and Millie (Who produces this by the way)Henry is perfect, though he couldn't fit the role but he does, althought of course it's kind of a different version of the Sherlock we know, some changes but it's Sherlock. Real and HUGE problem comes with Mycroft, if he would've turned into the person behind everything this movie would have a large zero, lucky for us he is just a selfish who hates feminism. Mycroft in books it's almost smart as Sherlock is, but here they turned him into an stupid and annonying brother, in the end he is just that, nothing else, but come on, Sam does what he best can and that script they gave him it's stupid, when they made him yell during the trip with Enola, it was cringy, lame, I mean, they're really trying to make him look like the bad anti-feminist guy. Awful.And finally, Enola is smart, but she didn't solve the case. She went to the house with another idea, and she found the answer there but didn't solve anything. Sherlock did it and somehow she takes the credit, ALL the credit. And again, she didn't solve anything.It's fun to watch, it has some good moments but for real and I can't stop thinking about this while I'm writing.HELENA'S CHARACTER WAS TRYING TO MAKE A TERRORIST ATTACK! And they justify it with the fact that she was fighting for women rights. Really, can't stop thinking about this, but go on, watch it, not recommend it but it's not like it's unwatchable."
    },
    {
      "rating": "0",
      "text": "We’re reaching a time where movies are nothing but front for political activity. They use old credible franchises to bring people in and then spit back in their face with nothing but agenda. Its like that science movie that halfway through becomes a christian movie. If you’re looking for mystery, weird clues, interesting deductions and wit, there aint none of that here.Meanwhile, netflix executives are looking for the next brand they can use as vessel for propaganda."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)Cute as much as forgettable under the ballast of political correctness."
    },
    {
      "rating": "0",
      "text": "This movie is all fluff and no substance made for a dumb audience. The acting is okay but the story is mostly uninteresting and predictable. Unfunny with forced romance that felt unnatural. Maybe children will like it."
    },
    {
      "rating": "6",
      "text": "Aiming for a younger audience, the title role is played by Millie Bobby Brown (Stranger Things) as the wily younger sister to Sherlock (Henry Cavill) and Mycroft (Sam Claflin). After her mother (Helena Bonham Carter) disappears, Enola sets out to London to find her, meeting a young aristocrat along the way. The opening sequences offer a jaunty modern approach to the detective story, but things do slow down as the plot and the burgeoning romance develops. Still, the pleasant performances and lively attitude make for a mildly entertaining diversion."
    },
    {
      "rating": "6",
      "text": "Some what entertaining but mostly bland and predictable. Millie Bobbie Brown is a very talented actress and I’m excited to see where her career goes from here and she is easily the best part of this film. She brings a lot of energy to the role and while her 4th wall breaking and script she is given may not be good, she’s still trying. Henry Cavill also does a pretty good job here too and I wish we got to see more of his take on Sherlock Holmes. The film is well shot but it doesn’t do anything creative with its shots and the production design, costume design, and score are all pretty good. Everything else however was definitely below average. The plot is fast which is nice but certain elements of the story are not engaging at points. The setups and pay offs are so predictable that you could see them coming from a mile away. The editing is very dull and rapid and there are some very obvious green screen moments here and there. I took a lot of issue with the 4th wall breaks. It felt out of place and awkward at many points and really ground the film to a halt when it happened. I know they need to explain some elements but it could have been done much better than that. Go check this out on Netflix if you are a fan of Millie Bobbie Brown or Henry Cavill or if you enjoy the universe of Sherlock Holmes. If you don’t like any of those elements, then you can definitely pass on this."
    },
    {
      "rating": "0",
      "text": "I never watched any movie that more contextless than this film. Worst movie i've ever seen."
    },
    {
      "rating": "1",
      "text": "Oh dear..Firstly, did we really need yet another Sherlock Holmes story? No. The Guy Ritchie films were fun, the Mark Gatiss series was very good and Johnny Lee Miller and Lucy Liu as Holmes and Watson in Elementary were perfect. This film has none of the qualities that made all those other productions great. The script is bad, the story is shallow and empty and quite frankly i think the whole thing is an insult to the original writings of Conan Doyle and to the much loved characters he created. One thing this does show is how poor an actor Millie Bobby Brown is. I thought she was pretty wooden and bad in Stranger Things, but i put that partly down to the way she was written, but she is truly awful in this too. She is just not a good actor. And this is not only a bad film, but as i said before, and insult to the original stories. A lot of clearly fake two line 10 out of 10 reviews with no detail at all on here again too."
    },
    {
      "rating": "2",
      "text": "This film is completely unnecessary to be released, about meaningless character. Henry Cavill and Sam Claflin saved this terrible movie. 1 for Henry, 1 for Sam. So - 2/10"
    },
    {
      "rating": "0",
      "text": "The single most political movie that's not about politics. The actors are great but the story is failing so hard with out-of-time references that it's insane. Ju jutsu at least 50 years before it reaches Europe amongst other things.I wish that the script gave me a reason to find the main character interesting but it doesn't."
    },
    {
      "rating": "3",
      "text": "God how I miss good story telling that is not contrived cookie cutter nonsense designed to beat the audience over the head with \"social issues.\" Hollywood is destroying itself.  Good acting cannot overcome horribly predictable and one dimensional writing. Yet another great cast wasted on a tale of social justice. Enola Holmes is just another Mary Sue main character surrounded by one dimensional simple minded and or oafish males who she saves repeatedly from themselves. Such a missed opportunity to have a fresh tale of the younger sister of the famous Sherlock Holmes solving cases together with her older brother. Matching their wits against the cunning Professor Moriarty."
    },
    {
      "rating": "0",
      "text": "God awful movie. The acting is not that bad but the writing and directing are very bad. It feels like a movie made for children age 0-10. The whole men are bad ad women are better than them in everything is getting kind of tiresome. If you are going to make a movie defending feminism, at least do it right because this movie is truly hilarious. And finally the lack of respect for Sherlock and Mycroft is unbearable."
    },
    {
      "rating": "0",
      "text": "absolute **** post modernist badly written movie, however a strong cast and good camera work"
    },
    {
      "rating": "1",
      "text": "Trailer was great. Unfortunately the movie was the opposite. Very chaotic narrative that killed an interest movie idea."
    },
    {
      "rating": "0",
      "text": "Just another woke hollywood style effort....................................."
    },
    {
      "rating": "6",
      "text": "An interesting concept that has almost no payoff throughout the entire movie. The storytelling style (i.e. flashbacks to scenes we had no context for previously to explain current scenes) removed almost any emotional punch from any reveals. Hardly any mystery whatsoever."
    },
    {
      "rating": "6",
      "text": "Movie felt like targeting toward younger audience below 13. Lacks of crime solving really didn't do justice for Enola skills and talent as Holmes characters. Not much cleverness you expect from typical Sherlock Holmes film or series. The character connection and development between Enola and her Mother are probably the high point of this movie. Movie overall is simple thrill with Good cast with touch of teenage romance."
    },
    {
      "rating": "0",
      "text": "It is too bad for the very good performance of the lead actress,  but the director and writers have failed this movie. If you expect a good mistery movie, you will be disappointed."
    },
    {
      "rating": "2",
      "text": "I had never before seen anything by Millie Bobby Brown, and still her Enola wasn't believable. Bad acting, too much breaking the fourth wall, with a very bad script and two brothers that were just used for the \"men are evil\" trope and not even faithful to the original stories. Full of political agenda, completely predictable, with a romantic storyline that makes no sense, and no brilliant deductions anywhere to be found. A real insult to the Holmes franchise."
    }
  ]
}