{"id": 4129, "title": "EO", "starring": ["Sandra Drzymalska", "Isabelle Huppert"], "runtime": 88, "genre": ["Drama"], "description": "The world is a mysterious place when seen through the eyes of an animal. EO, a grey donkey with melancholic eyes, meets good and bad people on his life’s path, experiences joy and pain, endures the wheel of fortune randomly turn his luck into disaster and his despair into unexpected bliss. But not even for a moment does he lose his innocence.", "releaseYear": "2022", "mpaaRating": "NR", "imageUrl": "https://image.tmdb.org/t/p/w500/1MK86Vr2nf1GSYOtRd8pFvA5RM8.jpg", "categories": {"plot": 3.310344827586207, "acting": 3.36, "ending": 1.8, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 2.4, "funny": 5.0, "action": 2.75}, "reviews": [{"rating": "3", "text": "I really wanted to like this movie. I didn't. It was plodding, and it failed utterly to connect with me on an emotional level, which was clearly the intention. So much wasted potential. Sigh."}, {"rating": "3", "text": "My beef with IO is that basically nothing happens and maybe an hour of the hour and 1/2 runtime is a complete waste of time. Nothing against the performances. Anthony Mackie does a great non-Falcon performance. The other actor is ok too. It’s just they have nothing to do except read quotes from literature and stare off into the distance.I don’t want to spoil anything so let me just say that you won’t see IO or any real sci-fi material. You won’t see the characters go anywhere or do anything in this ultra-low budget movie. More happens in an episode of the Twighlight Zone. I feel duped, hurt by Netflix for offering this movie as something worth watching. There plan is to make as much content as possible. Quantity over quality. It’s too bad because the premise of this movie was workable. The characters aren’t at odds with each other or the rest of humanity. There is no stupid conflict for the sake of conflict. It’s a simpler tale of survival of the human species with all characters focused on that goal. They just do anything worth watching."}, {"rating": "2", "text": "I was certainly hoping that in this post apocalyptic setting with all of the talk of massive planetary evacuation etc. That we would see you know, some space cool stuff, some neat effects due to the planet changing environment. Nope, it was just way dragged out to only be suspenseful really for the last 10 mins and even that wasn't overly exciting and quite predictable. I want my life back for the time wasted watching this, don't bother."}, {"rating": "3", "text": "Nice idea but it does't go anywhere lots of plotting and discussion with no pay off and it just sort of stops after a predicable and telegraphed reveal."}, {"rating": "3", "text": "I can see where this movie might get its inspiration in stories/film like Cormac McCarthy's \"The Road,\" in all of that grayscale, the-world-is-dying portraiture. But this is filmed so much in just one location with such little emotion, it feels like just one chapter of a concept. It feels like taking a luke warm bath as the water's starting to actually get cold. I wouldn't suggest wasting 96 minutes in a cold bath."}, {"rating": "0", "text": "Boring, boring, boring, and BORING.A film about mankind leaving Earth. Nope, scratch that.A film about one girl's fight for survival on a dying planet. Nope, not that either.Two people staring at each other and and being moved to rapture over...classical literature. YES! Let's make a movie about that!!!"}, {"rating": "8", "text": "IO is a thought-provokingly deep movie made for those who can appreciate mythology and allegories. A delight to watch, the film separates itself from the rest through its immersion of atmosphere, introspective narrative and exploration of societal underpinnings. I would recommend this film if you find yourself contemplating the future of society and often wonder about the profound effects modern civilization has on our world."}, {"rating": "1", "text": "Mind-numbingly boring schlock: 0 development, poor acting and amateur screenplay."}, {"rating": "1", "text": "Wow this movie  was garbage. It was mindnumbingly slow, had nothing going on, and the acting and chemistry was so forced that it didn't make you feel anything because they didn't feel like real characters. OH and that ending... wow just wow. I think that is the worst ending I've ever seen in a movie because i can't even think of a worse ending than the one from this movie. Don't waste your time watching this."}, {"rating": "2", "text": "O filme possui uma proposta interessante, porém na execução não passa de uma enrolação tentando chegar a algum lugar com discussões sem direcionamentos. A expectativa de algo interessante acontecer ao longo do filme foi o que me motivou a continuar assistindo, mas nada aconteceu, e sim somente nos últimos minutos. Um filme sem pontos de conflito, um filme sem emoção, um filme sem drama, um filme chato."}, {"rating": "4", "text": "It is a beautifully filmed but pretentious movie that tries to be deep and fails as much as it fails to be entertaining. The premise is interesting, but the story never takes off and in the end, it felt like I wasted two hours."}, {"rating": "2", "text": "Movie feels like 60 minutes too long. It is good for falling to sleep if you have insomnia I guess"}, {"rating": "1", "text": "Incredibly bad storytelling, predictable, illogical progression, absolutely bizarre and unhuman interaction between the actors. Pseudo-romance that doesnt work and feels as bland as the rest of the movie."}, {"rating": "3", "text": "All you need to know is that IO is moon that is wracked by tidal forces due to Jupiter's immense gravity well.  So a space station inside of IO's oribtal path is ridiculous on many levels, even the lack of resources.  Europa would have been the better choice, for the water alone.  All for a flashy title, which is the best thing about this movie.  Netflix is now dipping from their average of 6/10 into the 3-5 region as their quantity over quality begins using up the half-decent material, leaving only flotsam like IO.  I do not expect 2019 is going to be a good year for them."}, {"rating": "1", "text": "Totally pointless story, completely throws away the ideas of science and love depicted in the movie. Zero development, extremely boring. The only reason I gave it one point is because the acting by the male lead was decent."}, {"rating": "0", "text": "\"IO\" is Hollywood at its preachy worst. First, Earth is doomed due to \"human nature\". Our protagonist is a \"strong woman\" because white men are out of favor now. And that leads to interracial romancing since a black man is all that's left for her. Finally, the glacially slow plot all takes place on Earth, there is no set on IO, there is no sci-fi really at all. It's just a sloooooow, scenic Lifetime/Oxygen women's fantasy excursion. Such a waste. I rarely give a \"0\" out but this deserves it."}, {"rating": "7", "text": "I liked it. It's not a masterpiece, but I can say I haven't lost 90 minutes of my life. I do not think it's for everyone (I looked to see what the world was saying and many said it was boring) but I like slow movies (some)."}, {"rating": "5", "text": "Good premise and conclusion, but not much is done with their potential. Around halfway through I had to start skipping ahead because I realized I wasn't going to see much of any interest happening. Just pointless conversations punctuated by another thing going badly and then another, and when the hopeful conclusion comes along they even manage to present that one in a depressing way. Best part of this whole thing is they underscored how important bees are to a functioning planet. And the acting was good. That's about it."}, {"rating": "0", "text": "One of the worst films I've ever seen, honestly. A major complaint is that everything from the title onwards is a misleading bait-and-switch. Io has nothing WHATSOEVER to do with IO - it is a dull-as-dishwater post-apocalypse disaster film, everyone has had to abandon Earth for a colony around Io, but Io is never seen, the colony is never seen, the entire film is set on Earth! It might as well have been called Pluto, Alpha Centauri, Bizarro World, because it really doesn't matter where everyone has gone - you will never see what the rest of the human race is doing - the entire film is focused on the boring as hell 2 main characters.Io, and the Jovian system have fantastic potential for a sci-fi epic, which this film is unequivocably not. Besides the dull as anything plot, and the pointless, seemingly random title, the actual reason for going to Io is so pointlessly stupid it crosses the line from reasonable dramatic unscientific license into just gratuitous absurdity.I won't even bother mentioning the reason because it just doesn't even matter, just like Io itself doesn't matter, nothing that happens in this film means anything, and there is no apparent reason for any of the decisions about the plot. Anyone involved in this film should just never work on science fiction again - the writers especially should probably just choose a new career because this is just an inexcusable pile of garbage."}, {"rating": "0", "text": "I really wish Netflix would employ some decent writers for their sci-fi ventures.  This was really hacky and, even worse, belaboured.  Characters that you don't care about in a world that doesn't bear any relationship to something that matters (i.e reality)... it's pretty disappointing.  I understand why companies don't invest in new sci-fi IPs - they have high production costs and demand more of their audience than the average swill Hollywood churns out.  That said, if you invest in good sci-fi writing, you get the Alien series, the Terminator series, the Star Wars series (okay, it's space fantasy NOT sci-fi but it falls into the same funding pool), etc. etc.  I mean I LOVE the fact that this ISN'T a reboot but I HATE the fact that this isn't worth rebooting."}, {"rating": "0", "text": "\"..should confirm or disconfirm the presence of bacterium able to use ammonium as a main oxygen source.\" There's oxygen in ammonium now? Also \"disconfirm\"? WTF? Another in a long-line of scientifically illiterate space-themed low-budget pics set in garbage heaps. What's that, you say? Surely the story and characterization will overcome the film's other total failures? No, not at all! Dull, pointless, unsympathetic. The kind of thing you might play if you want to drive people to suicide, perhaps."}, {"rating": "6", "text": "Acting 4/10Storytelling and plot 4/10 Camera shots 8/10 Video Edit 6/10Pleasant to watch If You need something for lazy evening."}, {"rating": "3", "text": "In a future world the level of pullution got so high, the oxygen got contaminated making it impossible to breathe and killing many people, apparently. The girl Sam,  survived living in a place where the contamination didn't reach, and from there she tries to find some biological and chemical solution from what is going on. Directed by Jonathan Helpert and written by Clay Jeter, Charles Spano and Will Basanta.I like this kind of movie, a movie where there isn't action, there isn't epic events or not necessary many characters or places, but for this kind of film to work and actually be good, it would need to fill a few requirements, not all of them, but a few, these requirements, i believe, would be at least:Good Dialogues, wich isn't present here, there are so many whatever conversations in this film, somethings that don't made me think or got invested in the situation, the dialogues most of the time are just saying what you already know or things that you won't quite care, saying math formulas and stuff like that in different moments, the dialogues should make you think and absorb something, help into making you care or reflect about something, wich lead us to another thing required.Questionate something that is not usually thought by society in general and is an active thing in the same, wich this movie does try to do, it definely does, but it is so basic and badly done, they do talk about loneliness, but is so superficial, the character is alone for a long time and she doens't seem to have any different aspect from other people, she seems normal, if the movie keeps saying that people are meant to interact and there is one character that doesn't interact with anyone personally in a long time and feels normal, the script is sabotaging itself.A good narrative, this is always important to keep the audience invested in what is going on with that world, even more in a movie that doesn't happen many things, the narrative in this film it starts well, until some moment are actually things going on and they are introducing what is going on and how that affects the places to us, wich worked, the vegetation getting in the city, the purple fire indicating a polluted air, we got to know that the character is trying to find a cure or something like that, until some point it does work, but after it just stops and most of the film there isn't anything going on anymore wich completely took me off.There are some other good things, there are some pretty shots, the whole concept at the beginning is good and interesting, the acting is quite fine in some moments, Anthony Mackie did a really nice job, with frustration and hope, angry in some moments as well, Margaret Qualley is fine, in a lot of moments she is apathetic, in others she can be interesting, but not a big deal. The ending of this film is good, it made me think a bit, not about life, but still, getting together somethings from sooner in the story it can have some different possibilities of interpretation in that ending, wich is always good.The problem with this film is not that this is boring or that it have few characters and few places with an strange ending, the big flaw with this movie is that it doesn't delivers anything, it poorly try to make the audience to reflect about life or changing, but the way that they do it is so bad with such whatever dialogues, dialogues that don't go any deep, is so simple, but at the same time pretending to be something giant."}, {"rating": "6", "text": "As far as the premise of the movie goes it probably hookes all viewers, but when it comes to the actual movie it's going to turn off a lot of them. But when you look at it for what it is, it's an okay movie.So, Girl stays on Earth in hope that one day she finds a way to have bees be able to survive the toxins. She does this by living in an air pocket on top of hill. But then nature happens and one little storm kills all the bees... and well that is just about as intense the movie is going to get. The movie makes an interesting plot, but it falls flat early one by not taking advantage of the large potential for such a story. There are a few nonsensical decisions which deflate the smart decisions made before (You know which one i mean) and the character of Sam becomes less relatable as the story progresses. On a general note, I'm getting frustrated with Netflix as they put out multiple Sci-Fi movies a year now (which i like) yet seem incapable of making one that hits it out of the park. This movie smells of the same effort of movies like Titan. The ending... it's quite lazy and lacks any impact. If we were actually shown the people of the exodus missions on Jupiter's Moon it would have mattered more as we know nothing about the conditions they live in.Overall this movie was pretty average, as it entertains but falls flat on delivery and satisfaction. I give this movie a 6/10."}, {"rating": "7", "text": "I.O is a bold attempt at a fascinating and complex premise, despite all the bad reviews it had I feel like this film was very badly misjudged, there were some justified arguments for being bad mainly in the Science part of the Sci-fi because this film pays no respect what so ever to science, but beath all of that and if one looks very closely, there's something there to be admired, mainly how it unfolded and acted, Margaret Qualley the actress that plays Sam delivers on a steady and constant pace which I really appreciated as her acting really captured the loneliness she was in, the plot didn't do get any favors but she worked with what she had and I think she was the glue that held this film from falling apart, having saying said that, I feel the need to say that I really liked it, and here's my reasons, first of all, I didn't see it as a big scale sci-fi that would adhere to the rules of science, this was more on the fantasy part but it wasn't bad by all means, it felt fluid, granted it was a bit bland at times but it really held its own I'd say, especially considering how limited the story is.This premise is infinitely complex, a lot of amazing writers and directors presented their work on it and the majority failed miserably, what we should take from that is the fact this wasn't trying to be epic, not even close, it was a simple, and as crazy at it sounds very enjoyable."}, {"rating": "4", "text": "While the movie looked beautiful, the acting was very wooden and Anthony Mackie's performance felt phoned in at times. The plot moved along very slow and I felt this was a 3 hour movie instead of its actual 96 minute run time. The ending was very anticlimactic and felt very rushed, coming to a strange conclusion feeling almost like it was rushed in for no reason."}, {"rating": "1", "text": "This film was so boring, so slow, so lacking in anything that might be called original thinking that I signed up in order to review and and warn people like me (possessing at least 2 neurons) to avoid this film. Still if you want to experience time slowing down as if you were travelling near the speed of light then do watch this film. It certainly felt like several hours longer than it was."}, {"rating": "0", "text": "Movie that has, well nothing in it. It started off well with suspence that left viewer wondering whats going on and what going to happen. Sadly when movie ended nothing had happened and it felt waste of time."}, {"rating": "5", "text": "IO could have been a good film - but, Anthony Dwane Mackie as the male lead Micah ruins the film.Mackie should not have been cast for the role and he turns in a poor performance.  The Micah character is a failure in casting, acting, directing and even - to a certain extent - writing.On the other hand, Margaret Qualley was an excellent choice for the Sam Walden role.I found the message of the film to be powerful and interesting.  It makes me very sad that the film was ruined.****************************************So, I'm going to do something new.  Rather than just complain about casting, let's do a thought experiment in regard to what good casting of the Micah role would be.The obvious choice that almost any professional casting director would want for the role of Micah would be Timothée Chalamet.  But being realistic, Timothée Chalamet is much too expensive for a film like IO and his availability is close to non-existent I would imagine.So, a little googling...Colin Ford would be a very good choice for the role of Micah.  His ask would be within almost any budget and I would guess his availability is flexible.  The only problem I would see with Colin Ford is that he is somewhat distractingly good looking which is not particularly good for the role - but, would be great for box office.  I'm thinking makeup and lighting could address the physical appearance issues to tone it down a couple of notches.  Colin Ford could effectively deliver the emotive lines so much better than Anthony Dwane Mackie."}, {"rating": "7", "text": "I thought this was going to be a waste of time but I found it surprisingly good. That may be because I've seen quite a few 2+ hours movies lately that quite frankly bored me, some to pieces. This one however actually had an interesting premise, even if the science was a bit dodgy. Well acted budget movie. I've seen far worse. Finally something to make the green again, a surprising one at that."}, {"rating": "1", "text": "Most BORING thing Ever!!!That is the peefect example what people do, when they hates own work."}, {"rating": "2", "text": "Had high hopes, But it was dull, didn’t go any where, good topic and interesting. But this one didn’t go anywhere, I agree with others that emotionally didn’t connect...it could have been sooo good but instead it was so blah."}, {"rating": "2", "text": "The film is completely stagnant and emotionless.The concept itself is good, however they didn't know how to work on it. The main character apparently don't even care about the last spaceship to Io's human base just for that art exhibition, the love concept that the film show us is totally useless as the it's broken when she ignore her boyfriend to start a day-to-day love with Micah"}, {"rating": "2", "text": "So mediocre I almost cancelled Netflix.  Horrible script.  Why even make this film?"}, {"rating": "8", "text": "This human-centered drama has the hallmark of great sci-fi: it is patiently paced to allow us to consider the possibilities it offers. In this case, it contemplates environmental catastrophe through the experiences of just two characters. Its composite form has no CGI moments of improbable spaceship maneuvers and explosions; instead, the focus is on how humans might respond to environmental cataclysm, and how humans and natural systems might change in unexpected ways.This movie does not shout its message; its subtle script requires you to ponder the central allegory it poses, like many good short stories. If you have the patience to follow the details, it's a compelling proposition for how humans might respond to a changed earth."}, {"rating": "3", "text": "2.9/10"}, {"rating": "5", "text": "It was no very good, the first half hour was interesting, but the rest of the movie wasnt. I have no more to say that i have waiting a better movie."}, {"rating": "3", "text": "This movie is fantastic at presenting an environment that is exciting and full of promise, and a concept that is full of possibilities, all the while building tension and intrigue to have it all tank 3/4's of the way through when you realize, like the movies star, you aren't going anywhere. It would be a lot like watching Alien, but instead there's no Xeno on board and the ship just crashes into an asteroid at the end."}, {"rating": "3", "text": "slow pacing and boring script. good to watch when you have trouble falling asleep."}, {"rating": "2", "text": "https://sineg.net/2019/01/20/io-film-incelemesi/ Beautiful interpretation of the worst movie I've ever seen"}, {"rating": "5", "text": "I wanted to like to movie and I like that they took the fear of being isolated and the courage normally needed to embark among the stars and flipped it toward the person who decides to stay on earth. You have to suspend your disbelief in parts but it was well acted and the allegories and premise was good. But ultimately, it failed in to many areas for me to really like it."}, {"rating": "0", "text": "Just really bad. Not sure what they were going for with this, it was supremely boring. The plot line didn't seem to have any direction at all, the story itself, was vague and dull. There was no drama to it, though urgency was suggested by parts the script, it was never felt, at all. And then an ambiguous ending so horrendously dull, that I really didn't care to wonder what I might have meant. I was going to score it 1, but I can't find enough redeeming features even for that. Really disappointed"}, {"rating": "3", "text": "This film is just boring and has nothing going on at all. They did well with making the city look like it had been through the apocalypse and I the fact that all the overgrown plants in the city are dead is a nice touch which conveys the amount of radiation in the place. The writing is bad, there's no denying that. I just wish there was actually something going on. It's really what this film needed. Also, a lot of the time, this film just doesn't make sense."}], "recommendations": ["the_midnight_sky", "stowaway", "contagion", "code_8", "chaos_walking", "the_mountain_between_us", "captive_state", "what_happened_to_monday", "the_tomorrow_war", "gravity", "the_titan", "sunshine", "the_counselor", "the_cloverfield_paradox", "children_of_men", "the_darkest_minds", "annihilation", "the_maze_runner", "bird_box", "lucy", "brimstone", "downsizing", "coherence", "anon", "elysium"]}