{
  "id": 4631,
  "title": "Epic Movie",
  "starring": [
    "Kal Penn",
    "Adam Campbell"
  ],
  "runtime": 85,
  "genre": [
    "Comedy",
    "Action",
    "Adventure"
  ],
  "description": "When Edward, Peter, Lucy and Susan each follow their own path, they end up finding themselves at Willy's Chocolate factory. Walking through a wardrobe, they discover the world of Gnarnia, which is ruled by the White Bitch. Meeting up with characters such as Harry Potter and Captain Jack Swallows, the newly reunited family must team up with Aslo, a wise-but-horny lion to stop the white bitch's army.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/l0lGJiTzU2Ce6T31DIRWv7I0kaC.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 2.6666666666666665,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 2.7777777777777777,
    "funny": 3.4782608695652173,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Worst \"comedy\" I think I have ever seen. The only reason I give it a single point was that some of the jokes were almost worth a chuckle. Almost. But everything else about this piece of crap just stinks."
    },
    {
      "rating": "0",
      "text": "Seltzerberg are the worse directors ever. As bad as they are, at least Ed Wood films have camp value and Uwe Boll made Rampage.Seltzerberg, Epic Movie including, has no redeeming value whatsoever. Words can't describe the horrible abomination that is Epic Movie."
    },
    {
      "rating": "2",
      "text": "Scary Movie is way better. this movie sucks. if people like it, thats fine with me."
    },
    {
      "rating": "3",
      "text": "A poor excuse for a parody, heck it's even a poor excuse for a movie, it's just so stupid, I hated every second of it, even if your a fan of the writers you'll hate this movie."
    },
    {
      "rating": "0",
      "text": "Jason Friedberg and Aaron Seltzer don't know a lot about directing movies. Its more like a Moronic Movie than an Epic Movie because they make morons out of too many actors from too many good movies. Especially Kal Penn and Crispin Glover."
    },
    {
      "rating": "0",
      "text": "The makes of Epic Movie managed to put in a ridiculous number of movie references. Too bad no one told them that wasn't enough. This movie just isn't funny."
    },
    {
      "rating": "0",
      "text": "A mindless film made by two directors without talent, with lame gags, unfunny stereotypes of homosexuals and expensive sets. Friedberg and Seltzer must sell hot dogs instead direct any film."
    },
    {
      "rating": "2",
      "text": "I think most people will agree with me when I say that Epic Movie.......is an Epic Fail. It may not be as bad as Disaster Movie but that doesn't stop it from being totally unfunny and cringingly bad."
    },
    {
      "rating": "0",
      "text": "Hey look Entertainment Weekly gave this movie a good score! How about that?! Anyways, this movie is just 'Disaster Movie' except they got the title wrong this time."
    },
    {
      "rating": "1",
      "text": "Pointless, crass, and not even funny in a vulgar way. Someone should unleash the hounds of hell to hunt down the people who make these films, they're representative of everything that blows in America. There are boatloads of movies that are decent, so why shell out your bread on this kind of empty-headed crap?"
    },
    {
      "rating": "4",
      "text": "It has it's funny moments and some good parodies but overall I find the movie annoying and gross. The characters are only good while there doing gags. This movie deserves a skip."
    },
    {
      "rating": "1",
      "text": "One funny part: When Crispin Glover danced to Fergalicious. Juss fast forward to that and consider yourself lucky."
    },
    {
      "rating": "0",
      "text": "The only worse movie than this is, meet the Spartans."
    },
    {
      "rating": "0",
      "text": "Painfully unfunny one of the worst movies i have ever watched. people who like this shit have no taste."
    },
    {
      "rating": "1",
      "text": "Gross, and weirdly under-produced for the budget it had, Epic Movie truly feels like an overly-long 2007 era YouTube video. It's just so humorless and cobbled together that it barely stands up as a movie. It's just a long list of bland references and disgusting, poorly delivered \"jokes\" that just grate on the viewer without end. This movie is so horribly paced that even though its under an hour and a half that it feels like three hours. It gets one point from me because it got exactly one snort of laughter from me."
    },
    {
      "rating": "1",
      "text": "Not Epic In The SlightestEpic Movie is a poor excuse of a comedy with painfully bad jokes, The parodies feel forced and awkward, And the acting is awful."
    },
    {
      "rating": "0",
      "text": "Awful picture!! The directors of this movie are absolutely stupid. One of the worst films ever made. Never ever try to watch it. You will waste your money and your free time!! An epic fail!"
    },
    {
      "rating": "2",
      "text": "What saves this from being a 2 or lower for me is that I like the main structure of the story. I would like to see a Narnia parody and a Wonka parody.But the references, toilet humor, and other distractions come in and ruin the experience."
    },
    {
      "rating": "6",
      "text": "It's stupid but funny."
    },
    {
      "rating": "10",
      "text": "Loads of low reviews, these people don't know what an AKA Scary movie but with epic porportions is. This is more entertaining, funny, and overall amazing than any of the scary movies."
    },
    {
      "rating": "10",
      "text": "MOST GREATEST PEICE OF ART I HAVE EVER SEEN IN MY LIFE!!! :)  GREAT STORY! GREAT ACTORS! GREAT SCREENPLAY!!! YOU CAN REALLY RELATE TO THE CHARACTERS!!! GREAT EVERYTHING. I GIVE IT A 10 AND THAT RARELY EVER DO THAT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! :) :) :) :) :) :) :) :) :) :) :) :) :) :) :) :) :) :) :) :) :) :) :) :)"
    },
    {
      "rating": "10",
      "text": "Excellent movie. The setting is marvellous. Story is great."
    },
    {
      "rating": "9",
      "text": "Hilarious entertainment that mangaged to be worth 10 dollers for once. The spoofs were brilliant, and I was dying of laughter by the end. My stomach still hurts."
    },
    {
      "rating": "10",
      "text": "How can people not like this movie? It was one of the funniest movies I've ever seen, and it did what it was meant to do: spoof epic movies and be funny. My whole theater was laughing through the whole movie, and we all clapped at the end (and not because we were glad it was over). I loved it!"
    },
    {
      "rating": "10",
      "text": "This movie was so hilarious that I couldn't stop laughing. They did excellent on there screenplay and did a fine job on there acting as well. This movie was probably the funniest movie I've ever watched in my entire life. 5 days later and I'm still laughing. Ha Ha Ha!"
    },
    {
      "rating": "10",
      "text": "This movie is great but the a lot of people have no sence of humor and think it is stupid."
    },
    {
      "rating": "10",
      "text": "I don't know why everyone hates this movie so much! It was an ok movie with some funny stuff in it, but it wasn't terrible!"
    },
    {
      "rating": "10",
      "text": "There are so many bad reviews of this film that it's unbelievable! this sort of film if not meant to have a clever storyline with plot twists and built up characters. It is just simple daft commedy and I loved it! There is nothing more frustrating than seeing a film that you don't quite get or makes you feel rubbish by the end of it. This film is a gag a minute and as long as you're up for mindless violence and constant stupid humour (which I so am!) you'll love it too. People need to stop over thinking this film. It's daft! It's FAB!!!"
    },
    {
      "rating": "9",
      "text": "Very amusing, in some parts childish but ties in well known charecters much better than previous 'movie' titles"
    },
    {
      "rating": "0",
      "text": "People actually think this s**t is FUNNY ?!?!?! How do you work that? The plot is thinner than water-based tomato soup, the lines are written with nothing on the brain but vulgarity and lame pop-culture references, the \"parodies\" are not, in fact, parodies at all, merely a bunch of nobody actors playing dress-up, and two minutes cannot go by without someone getting beaten up/ killed, splattered with excretement of some kind, sexually violated/exposed, insulted, or madly burst into breakdancing and rapping. This movie is nothing but hostile and offensive, and should have been rated R. F**K YOU JASON FRIEDBURG AND AARON SELTZER!!! Do us all a favor and stop making this s**t!!!"
    },
    {
      "rating": "9",
      "text": "This movie is so funny! Laughs from beginning to end! A+++ Would see again!"
    },
    {
      "rating": "0",
      "text": "This movie was so bad I walked out during the previews. I agree with the San Francisco paper; only a complete idiot could think Epic Movie is remotely funny. But yet, people give it a 10 while they say things like \"It was an ok movie with some funny stuff in it, but it wasn't terrible!\" That sentence doesn't even make any sense! And some how \"It was ok\" warrants a 10?"
    },
    {
      "rating": "0",
      "text": "I have too say that this is the funnyest moovie i ever scene in my intire life. Who says I have to bee dum to luv this grate fillum. I isnt an i tinked it was grate. Grate comidy 100% out of 10"
    },
    {
      "rating": "0",
      "text": "If you think that this movie is funny, if you thought it was hilarious, if you so much as considered seeing it again, you are a retarded, childish nincompoop. Yes, I did just use the word nincompoop. That's 'cause I mean it. It seems like the people who produced this movie just stopped trying to make it be even halfway good. It's a steaming pile of human excrement, but considering the ironic box-office turnout, it's a gold-plated one."
    },
    {
      "rating": "0",
      "text": "There are just no words to describe how awful and senseless this movie really is! Whoever actually went through the making of this film should have their eyes gouged out!"
    },
    {
      "rating": "0",
      "text": "Absolute rubbish, painfully contrived, and humorless."
    },
    {
      "rating": "0",
      "text": "Worst movie ever; it seems like something some college students made for MySpace."
    },
    {
      "rating": "0",
      "text": "This is one of those movies where the protocol is obvious. Anyone who saw it and has any brains or any real sense of humor will find this movie to be insanely bad comedy. Then on the other side of the coin if you watched the movie and are dumb as a rock, or have a sense of humor that laughed everytime someone got hit in this movie, then you'll love it."
    },
    {
      "rating": "2",
      "text": "Awful movie. Only funny moment was Silas hitting himself madly and Jack Swallows thin kwas quite funny. honestly, crispin glove rneeds to do better films other wise his nice career would be destroyed too."
    },
    {
      "rating": "0",
      "text": "Being a 14 year pld girl, who loves a good parody film, I went along to this. Terrible. Not one funny line, worst movie I have ever seen."
    },
    {
      "rating": "0",
      "text": "Absolutely terrible. This movie is vulgar and very inappropriate. I got it at Blockbuster and thought it would be a crack up like Napolean Dynomite, but instead it was an inappropriate, once again, vulgar movie. And you wonder where these 10, 11, 12, 13 etc. year olds are getting their vulgar stuff from. What kind of looney would make such a movie?!"
    },
    {
      "rating": "0",
      "text": "Found it funny when I was 13. Not ever since."
    },
    {
      "rating": "1",
      "text": "It's as funny as watching your house burn down. The spoofs are as spoof-like as Hitler and Ghandi. The jokes rely on potty humour. The acting relies on potty humor. The stupidness of the jokes that made Airplane!, Hot Shots! and the Naked Gun so brilliant is taken so overboard, that they are not even stupid anymore but a cry for help from 2 of the 6 writers of scary movie that asks: \"SOMEONE PLEASE TELL US WHAT A GOOD JOKE FOR THIS SCENE WILL BE? OK WE\"LL JUST THROW IN SOMEONE GETTING RUN OVER\" As you can tell, I didn't like Epic Movie that much."
    },
    {
      "rating": "7",
      "text": "There was no plot, no meaning, no movie really. But if you saw at least 5 of the 200 movies it makes fun of, you will find yourslef laughing pretty hard. I had seen basically every movie it made fun of, except maybe Nacho Libre...and I laughed very hard. It all comes down to how many movies you have seen that it makes fun of."
    },
    {
      "rating": "0",
      "text": "Wow! This movie is just as bad as Date Movie. I hope no one is actually going to see this. The only good part was the Borat person."
    },
    {
      "rating": "1",
      "text": "Absolutely terrible. Unfunny except for a couple decent scenes. This kind a trash should go straight to video."
    },
    {
      "rating": "0",
      "text": "This was the very worst movie I have ever seen. Besides it's poor effort to make a joke, the flow of the movie was so bad that you could nap during the awkward moments and empty scenes."
    },
    {
      "rating": "0",
      "text": "This movie is garbage, It really thought it was stupid that they made fun of Borat, cause borat is alrdy a joke, It kind sucks that this movie is gonna sell alot, Good OL usa for ya"
    },
    {
      "rating": "0",
      "text": "The movie was kinda stupid and corny, it had its funny moments but it was still kinda dumb."
    },
    {
      "rating": "0",
      "text": "How could anyone go into this movie expecting some \"good stuff\"? did you see the trailer? honestly, they won't stop making s*** til people stop going to see this crap."
    }
  ],
  "recommendations": [
    "meet_the_spartans",
    "scary_movie_5",
    "vampires_suck",
    "deuce_bigalow_european_gigolo",
    "movie_43",
    "a_haunted_house",
    "miss_march",
    "grown_ups_2",
    "the_hangover",
    "hot_tub_time_machine",
    "the_watch",
    "one_year_one_night",
    "superhero_movie",
    "the_dictator",
    "scary_movie_2",
    "scary_movie_4",
    "jackass_the_movie",
    "white_chicks",
    "30_minutes_or_less",
    "zoolander_2",
    "not_another_teen_movie",
    "dumb_and_dumber_to",
    "little_man",
    "scary_movie",
    "kangaroo_jack"
  ]
}