{
  "id": 4769,
  "title": "Equilibrium",
  "starring": [
    "Christian Bale",
    "Taye Diggs"
  ],
  "runtime": 107,
  "genre": [
    "Action",
    "Science Fiction",
    "Thriller"
  ],
  "description": "In a dystopian future, a totalitarian regime maintains peace by subduing the populace with a drug, and displays of emotion are punishable by death. A man in charge of enforcing the law rises to overthrow the system.",
  "releaseYear": "2002",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eW3YrxOh3rd6PnRgMSftYoflvfe.jpg",
  "categories": {
    "plot": 9.0,
    "acting": 8.75,
    "ending": 9.5,
    "soundtrack": 10.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 9.098039215686274
  },
  "reviews": [
    {
      "rating": "8",
      "text": "So, according to dear critics X-men Origins Wolverine better than this movie huh?"
    },
    {
      "rating": "8",
      "text": "First of all I am not saying the movie is perfect because of the fact that there is no such thing as perfect even though the director maybe could have wanted to see the movie that way. Second of all I am not saying the movie is dark and melancholic because its really not, eventually. Third, the movie was pretty great for those honest needing people reading this.\r I cannot undergo being selfish and saying that the movie reminds me a little bit of \"The Matrix\" (1999) which is one of my most favourite movies of all time. Everyone will or is thinking that. The cut-scenes are probably at its peak of that time, now I'm not even hailing Bales performance and his scenes. Even the acting from the children are fantastic.\r The storyline for the main characters are fulfilling yes, the script is detailed and deep enough to be intriguing. I must give credit to the intro of the movie. Somehow it wants one to look away from fascism and at the same time to understand why and how. I believe its called somewhat of a mixed feeling you could say.\r The outro needs to be cut down in two to be understood. Just as a human face is divided in symmetry depending on where you cut it. Leaving the whole brain of the story behind of what to happen hereafter with one man's face looking forward in the future of the horizon of tomorrow. From the top again: satisfying  surprising and curious."
    },
    {
      "rating": "7",
      "text": "Gj critics. You reminded me why i never use your opinions to justify movies or anything.\rAs for the film - it has good action, interesting setting and kind of cliched plot, but in a good way."
    },
    {
      "rating": "9",
      "text": "If you enjoy movies with Christian Bale this one is one of his best work. Also the \"professional\" critics show how out of touch with reality they are with their reviews and score for this masterpiece."
    },
    {
      "rating": "10",
      "text": "Equilibrium is one of those movies I regret not having seen earlier and I was amazed to see that it had scored so badly pretty much everywhere. To start of, yes Sean Bean is in it and yes it happens it should be no mystery by now. Christian Bale plays John Preston is a futuristic cop called a Grammaton Cleric, his job is to find and arrest (or kill) sense offenders which are people who have decided to reject the Fascist governments policy that emotions are evil and need to be pressured using a special drug. Prestons character development through out the movie is phenomenal, to see a cold blooded killer who only cares about following his corrupt governments rules to a soft hearted human who risked everything for a puppy is definitely something to see. The new fighting technique called gun kata is definitely interesting when he is actually shooting but when he gets into a close quarter fight near the end it is a bit ridiculous to watch 2 grown men and professional killers slap each others gun about and make absolutely no head way in the fight for a good 30 seconds. The plot is one of the best I have ever seen and kept me enthralled through out the entire movie, there was never a point that I wanted to look away from the screen apart from one part but not because it was bad but because I didn't want to believe it would happen. The team behind this movie worked hard and the actors worked even harder to get their message across, Equilibrium deserves a 10/10 and if I could go any higher I would. Every one needs to go see this movie right now!"
    },
    {
      "rating": "10",
      "text": "Once of my alltime favourite movies. Drama and Action could go together before the new BSG. But it´s hardly surprising that a movie warning of \"soft totalitarianism\" isn´t well recieved the media. Make a movie about a clicheed fascist gouvernement seizing power using anti-terror as an excuse and they love you. But a movie talking about how the concept of hate-crimes will lead to policing of thought and you are a heretic."
    },
    {
      "rating": "8",
      "text": "Wow, talk about  aiflm with an overwhelming amount of unnecessary hate. Equilibrium is a very high quality sci-fi action flick with great sequences of drama, along with a fantastic performance by the ever brilliant Christian Bale. His performance alone lifts this up from your ordinary action movie to something much more."
    },
    {
      "rating": "8",
      "text": "When I watch a movie I want two things: I want to be entertained, and I want a story I can follow.\r Equilibrium gives me both.\r If you don't compare it to the Matrix or any other action movie, it's pretty good.\r Christian Bale's character doesn't start out good. He's actually a really bad guy. You watch his character grow throughout the movie.\r You really end up hating the bad guys in a good way. You root for Christian Bale's character, not because he's such a good guy, but because he's taking it to the bad guys.\r The action sequences are not realistic. No, they are not.\r But if I wanted realistic I'd go to public square and watch the drunks box it out.\r I go to the movies to escape reality, and this movie did exactly that.\r On the negative side, it seemed the black guy and the main villain were pretty emotional. Smiling is a sign of happiness, and shouting is a sign of being upset in some way. So that was very stupid.\r It's not perfect. The characters don't have much personality, but it has a good story."
    },
    {
      "rating": "10",
      "text": "Great performance by Bale and for the time in which the movie was released. It had a tough crowd reviewing it - post Matrix.The plot carries perspective and ensures there is more to the movie than just good action scenes."
    },
    {
      "rating": "10",
      "text": "I loooved that movie and I watch it at least once a year. It has everything: romantic love, love for animals, for music and art, for liberty. And there are great gun kata scenes. It has something of Ira Levin's dystopic S-F story \"A Perfect Day\" and of Ray Bradbury's \"Fahrenheit 451\", which are 2 of my favorite s-f stories. And Christian Bale is aah! what could I say that would match his talent and charm? ;)"
    },
    {
      "rating": "10",
      "text": "Critics keep mentioning the plot and the themes which are the weaker aspects of equilibrium. This movie was incredible for me because of the performances \"christian bale\" \"emily watson\" \"sean bean\" , the superb novelty and excellence of the martial arts and action sequences, and the crisp sharpness of atmosphere. Alot of criticism is aimed at bcuz its based in a dystopic future world and its \"done before\" but dystopic setting should be thought of as a genre rather than a plot so i don't think it has to be new and original all the time.  Also note that it came out in 2002, soon after the first matrix movie. So it's a bit unfair to say that it copied the matrix when a lot of work would have already begun on equilibrium.  Most pple would have watched it years and years after it was made, bcuz they saw christian bale in batman. Equilibrium is always in my mind christian bales greatest performance. And Gun kata a semi-realistic martial art that has spawned a real-life niche in itself."
    },
    {
      "rating": "10",
      "text": "one of the best films ever made, original and inovative action, amazing acting and a film that can be watched over and over. It will make you question al the critics who try to discredit the film."
    },
    {
      "rating": "10",
      "text": "It appears that all the low ratings for this movie are just people that are bashing it, while the good reviews seem filled with inspiration, appreciation, and satisfaction. What are the people making low ratings missing? I thought this movie was one of the best I have ever seen and was absolutely blown away by it. Stunning effects and choreography, incredible depth in the story, extremely believable character development, and an amazing message. Not to mention heart pounding action - this movie literally made me feel like I wanted to stop watching it because it was so suspenseful and absorbing that I didn't want to risk watching it all for fear it might not go the way I wanted it to! Absolutely amazing."
    },
    {
      "rating": "9",
      "text": "CRIMINALLY Underrated!! Don't make the gullible mistake of pidgeonholing this movie as a matrix/1984 ripoff. Director Kurt Wimmer already addressed these claims stating that while he did willingly borrow some elements from those films, his dramatic intent was to re-examine several themes that are crucial to humanity while presenting a new take on choreographed hyperstylized action. Did he succeed? Instead of a simple answer, and instead of offering more hyperboles or pompous critical slams like everyone else here, let me just say this: In all of my 22 years of watching films from every genre, making it a near-weekly tradition to go out to the movies with close friends & beloved family members, Equilbrium is the only movie that I immediately bought a second ticket for just so that I could experience it again consequently after it's first showing. And that's just for the action scenes. My friends and I whipped out our cell phones, calling everyone we knew inviting them to come see this pleasant gem that has shined out from nowhere. The ultimate bottom line, stripping away all of the hype and mostly undue criticisms, Equilbrium entertains with it's truly unique, expertly choreographed, jaw-dropping action sequences mixed with passion, art, tight pacing, great acting, and wonderful drama. It's story may or may not be unique to you, but it is touching nonetheless, and if you have any sense of empathy then you will remember it. Is it the best film you'll ever see? Probably not. But honestly now, what movie ever is, universally speaking? It boils down to this: If you're looking for a good time, you will find it in Equillibrium. If you want a film that hits the right notes of the delicate musical balance that is \"action & drama\" without being hammy or contrived, Equilibrium is your song. If you hate science fiction, enjoy bitching about movies, are too cynical, or have no sense of empathy, look elsewhere (or better yet, stop watching films altogether and find a new hobby). As for me, three years after that fateful first viewing, this film is still near the top of my highly-selective DVD shelf."
    },
    {
      "rating": "7",
      "text": "I liked this movie. but its nowhere close to bladerunner. but still I enjoyed it alot. It seems like the director really wanted to make this movie as good as possible and it shows. Not a bad movie."
    },
    {
      "rating": "8",
      "text": "The Film is complete - you get what you see. It tells a story, doesn't let you down in any moment, full of action, nice effects, nice cinematography, etc.... It is complete."
    },
    {
      "rating": "8",
      "text": "Great action, Bale carries the movie. Guards and troopers look a little too stylish. But the clerics are dead on."
    },
    {
      "rating": "9",
      "text": "This was one of the best action movies I've ever seen! It has some of the feel of The Matrix but the action was more believable. Christian Bale was AWESOME! The story was good, a little slow at times but good. It had depth and heart which you don't see much in action these days."
    },
    {
      "rating": "8",
      "text": "An enjoyable film overall. Only faults I can find are the similarities to the Matrix (which cause a great amount of De ja vu) and some of the fight scenes get a bit brainless, but it's great fun."
    },
    {
      "rating": "8",
      "text": "Very good movie. For another supposedly shallow action production you get a well written story with good played and believable characters and good action scenes. I liked the showing of the future world the director has chosen and particulary the psychology behind the main person. The world did not get demonised the way it is done in other action flicks. We see that indeed, a world without emotions is a calm place with everyone doing their job for the good of the society. It would even present an attractive picture if wasn`t for the over the top police procedures. Instead of being locked up somewhere, the emotion (as society`s enemy #1) is to be destroyed once and for all. Getting rid of all the culture by the state is also too much for the vision to be acceptable. What we see exactly is what we might miss if we took the pill that supposedly is our saviour. In both dimensions : from POV of a single human being and the whole bunch of people. Hell yes it would have been more \"efficient\", but we`d stop being people. John preston sees that and shows others. It was fascinating, making me reflect the movie for couple of weeks. To add to that, we get some drama with some good action. Believable, original and solid."
    },
    {
      "rating": "9",
      "text": "entertaining and great action scenes. christian bale does a wonderful job portraying a devoted cleric who begins to doubt his original beliefs, abandons them, and eventually fights for them. very good end fight scene."
    },
    {
      "rating": "9",
      "text": "Totally under-appreciated and misinterpreted film.\rThis is one of my all time favorite movies, yet I have a hard time\rdefending it now as a serious piece of cinema, and I'm not sure why. It\rgets low ratings on all the major film sites despite tons of great\ractions scenes, a huge overarching story line, great attention to\rdetail, and a terrific performance by Christian Bale.\r The Story: The dictator ruled state of Libria force-feeds its citizens\rdrugs to suppress their emotions, and in fact, feeling emotion is\rentirely illegal. Punishment is death.\r Overactive emotions have been known to cause many of humanity's\rprevious atrocities and wars, so to vanquish emotion is to therefore\rbenefit humankind. There is a method to the madness; this film is set\rright after world war III, and emotion suppression is modern humanity's\rsolution for preventing world war IV.\r Of course there are those that do not see this repression as a benefit\rand so an underground resistance forms. Although the plot is\rexcellently executed, the dystopian theme comes across as just a little\rbit too close (for some, not for me) to an exact replica of an\rOrwellian model. Equilibrium has been accused of being unoriginal, a\rmere mishmash of well-known various Sci- Fi stories.\r I was never bothered by this mishmash. Examining the film shows there\rare more than enough original features, features that people must be\roverlooking when judging, because the originality more than counter\rbalances the borrowed material.\r The top ranking law enforcement officials are (I think very cleverly)\rcalled Clerics. They employ the use a fictitious fighting style called\rthe Gun Kata. The Gun Kata a major part of the film and makes for some\ramazing scenes. The details about the world are so specific that it\rreally is an amazing accomplishment on writer/director Kurt Whimmer's\rpart. Whimmer makes a living mainly as a writer, Equilibrium being one\rof only two major features he's directed.\r As I said earlier, Christian Bale gives a great performance, handling\ralmost all the fight scenes himself, and due to budget constraints,\ronly being allowed a handful of takes to get each set of complex\rchoreography right. Director Whimmer makes excellent use of light and\rspace, pleading his case for humanity's right to \"feel\" as light peeks\rthrough the drab gray tones of the photography, rarely, but just\renough.\r Equilibrium is the biggest box office flop of a film I can think of.\rFor how epic it is, the 20 million dollar budget seems miniscule, but\rits total to-date gross is $1.2 million, a totally pathetic ratio.\rEquilibrium appeared around the same time as the Matrix was doing its\rthing and so Equilibrium got very little press. The two films share a\rsimilar vibe and since Equilibrium came out second, it loses points for\roriginality, and even though The Matrix is undoubtedly a great\rachievement, Christina Bale is hands-down the better lead (I'm not too\rfond of Keanu Reeves). Just based on that fact alone Equilibrium is\rworth checking out."
    },
    {
      "rating": "9",
      "text": "Critics gave 33, audience 85.Shows how different critics are from us, the audience who just wants good movies. Critics... they want something more than a movie. Well **** you, this is a great movie. Some action scenes were amazing for that time period. Yes, CGI is bad, quite bad, but it does held up well since 2002. It is very interesting movie in terms of idea, that one day this can be reality. The Political Correctness, Thought police and general modern snowflake generation might one day demand no feelings so no one can offend no one. Because apparently feelings are either bad or must be taken above facts.Anyways, good movie."
    },
    {
      "rating": "6",
      "text": "I have mixed feelings on this one. On one hand, the action is superb and the story is reminiscent enough of dystopian classics while still maintaining enough original elements to make for an interesting premise and maintain this interest throughout the movie. On the other, writer/director Kurt Wimmer isn't particularly known for subtlety and intelligence in his films, which a movie like this most certainly requires in order to be successful.\r The story, a mashup of elements derived from other, bigger, and better films like Fahrenheit 451, 1984, and Brave New World, follows John Preston, a high-ranking member of a secret police force established in humanity's last bastion following World War 3 and tasked with eliminating any and all items that invoke human emotion, as well as executing \"Sense Offenders\" who fail to take the emotion-blocking drug Prozium. Yes, rather than books or knowledge deemed dangerous by the ruling party in other similar works, humanity's problems are this time blamed upon our ability to feel, particularly rage and anger, but anything that invokes any emotion whatsoever is labeled for destruction--music, paintings, literature, you name it. The concept is interesting: without emotion someone is typically considered a sociopath/psychopath, and yet crime and violence are completely eradicated in the city-state of Libria (aside from the \"necessary\" execution of Sense Offenders in the Nether region beyond the city and in the giant furnaces beneath the streets). But rather than delving deeper into the societal implications of this, Wimmer instead settles for a disappointingly normal saga about Preston and what begins to happen to him when he accidentally misses a dose of Prozium before devolving further into a \"rebellion versus evil government who seeks out the help of an ex-bad guy\" plot. Typical.\r The cast is both a strength and a weakness. One great thing about this movie is that it brings out the best in Sean Bean, who as Preston's original partner Errol Partridge brings real emotion, conviction, and humanity to his brief appearances in the movie, remorseful for having served the government in pursuit of a misguided quest to rob mankind of what makes us human, before quoting Yeats poetry and taking a bullet to the neck in an abandoned church in typical Sean Bean fashion, though we're sad to see him go. He would have undoubtedly made a more interesting protagonist than Preston (portrayed by Christian Bale), who, aside from the moments in which he experiences flashes of emotion that cause breakdowns on the spot, is not terribly convincing or interesting. Wimmer doesn't try at all to make him likable nor does he give us much reason to care for him, as he shoots his best friend early on in the movie and was present at his wife's execution despite having fought to prevent the police from taking her when they raided his house. His speech is very monotone (if and when he does speak), and his main purpose in the movie appears to be to shoot people. Though that's more, I suppose, than Emily Watson's Mary O'Brien character was allowed to do, as after her arrest all she did was sit in an interrogation room and wait for Preston to come back and say something to her. And one other thing, though I won't spoil that. Taye Diggs, for a man without emotion, sure puts a lot more into his performance than Bale does, smiling and occasionally cracking jokes while still capable of being ruthless when it is demanded of him (though he's not exactly the greatest fighter without an armed strike team to back him up). The two standouts in this movie are Bean, because we wish we could have seen more of him, and Diggs, who is appropriately devious in his role as a secondary antagonist.\r One superb element of the movie is the action sequences, especially the gun kata utilized by the Grammaton Clerics that puts even John Woo's signature gun fu style to shame. The difference here is that while other forms of the art usually rely on pure reflex, Wimmer's style is more scientific, allowing the wielder, through analysis of recorded gunfights, to predict the angles of enemy fire and adjust their own fire to inflict the maximum amount of damage on opponents while suffering a minimal amount themselves. The gunplay in the film is fast, unrelenting, and brutal, and it looks cool as hell, beating out even \"The Matrix\" and \"Desperado\".\r As I stated above, there are things that I like about this movie, and things that I don't. Is it entertaining? Sure. Does it make a statement about humanity and society, and the direction we're headed? To an extent. But if you're looking for a meatier, more philosophical look on a less undesirable trait of our species, go watch one of the more classic dystopian movies rather than this one. Still, on a slow Saturday night, this will offer a fun and usually engaging ride, provided you don't read too much into it. 6/10"
    },
    {
      "rating": "10",
      "text": "I'm not into action movies, but Equilibrium is one of the best Science Fiction and action movies I have ever seen. The Story was great, the characters are dope, and the action scenes are dope. Equilibrium is definitely worth your time. 10/10"
    },
    {
      "rating": "10",
      "text": "Equilibrium is an awesome movie, and these trash critics don't even know what they're talking about."
    },
    {
      "rating": "10",
      "text": "I'm not a fan of Christian Bale, but this was a great movie in which he did a phenomenal job. This dystopian movie is something that you'll remember for years (in a good way). Unlike most modern movies, which are remakes upon remakes, the plot is rather unique too."
    },
    {
      "rating": "10",
      "text": "Whats up with most of these critics. If they didn't see the depth and the message in this movie, well they are a bunch of retards who were probably dropped as infants. This in one of the most iconic movies I've seen for a long time. A definite cult fav. Hats off."
    },
    {
      "rating": "9",
      "text": "One of the most underrated films of all time with a deep and ahead of its time story."
    },
    {
      "rating": "10",
      "text": "those who gave this film 0 are jealous!!!! OK, it has from films like Fahrenheit 451, 1984, etc. some ideas, but Kurt Wimmer was doing this project for 12 years and his final product, Equilibrium, is fantastic movie! so, those who gave it less than 6 can come here and suck my balls!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "I am seriously considering never again opening Metacritic. I mean what sort of nonsense ratings are those? Are these critics retarded or what? This is an amazing movie and deserves at least an 8!"
    },
    {
      "rating": "10",
      "text": "Why does this movie receive such low scores from reviewers? It is a fantastic movie! I have to agree with MarkusW, guess the media did not like the message."
    },
    {
      "rating": "9",
      "text": "9.5 even. This movie... reigned. Today's reviewers are such a bunch of paid off schlocks. This is THE MOST UNDERRATED FILM of the year, and perhaps the decade. Those reviewers would be giving nines and tens if this film came out before the Matrix. The difference between the two is that the society depicted in Equilibrium is actually possible. The acting, story, cinematography, sound, choreopraphy and set design were each nearly flawless. If you like action and you've seen The Two Towers, then finding a better flick than Equilibrium from the list at left will be extremely difficult, if not impossible. And if you've got a DVD player, and missed it at the theatre, don't rent... buy. Your friends will know who the king is after they pop by for a flick, and that's a guarantee. P.S. Possibly the best conventional action footage ever... I guess I'd better stop before I start naming reviewers who SHOULD BE FIRED FOR BEING IGNORANT MONKEYS. And the best action P.C. game in history is called DEUS EX, and this site would do well to review it. [Ed: Try the search engine: PC - 90; PS2 - 80] (Great site, nonetheless.)"
    },
    {
      "rating": "10",
      "text": "Very nice! Sure Matrix was damn good, but it was one of the trend at that period, only because this movie didn't advertise as much, doesn't mean this is a bad movie at all. True critic make minor stream movies alive! is it's good! Only stupids, just like to COMPARE!!!"
    },
    {
      "rating": "10",
      "text": "I thought this was one of the best films I have ever seen. The hidden references to classical works and the amazing fight scenes won me over. I would consider this a \"must see\"."
    },
    {
      "rating": "8",
      "text": "Say what you want but despite real originality and some silliness Wimmer's anti-utopia is still one of the bests I've ever saw. And anyway nowadays you can't really do anything truly original."
    },
    {
      "rating": "10",
      "text": "Excellent movie, great fight scenes, and they actually managed to make gun fights amazingly interesting. Gun-kata is actually something i'd enjoy seeing in future movies, even if it is fictional. plot only really became cheesy for about a 10 minute period towards the end, but other than that, great flick."
    },
    {
      "rating": "10",
      "text": "Awesome movie. Those who rated it low, simply doesn't understand it. I'ts not a movie for everyone, but if everyone was able to understand it, we where in a better world."
    },
    {
      "rating": "10",
      "text": "This movie is severely underrated. In my opinion, this movie is one of the better sci-fi or action movies I've ever seen. But then, Star Wars: Ep. 3 got a 68 on metacritic, and it's garbage."
    },
    {
      "rating": "9",
      "text": "I just can't understand the critics sometimes. This movie is great! Don't just always think about  '' how crazy idea the storyline is''. This movie has a inner message, and it is beautiful, exiting, and so true. I recommend you to watch, people who give points like 1-6 instead of 7-10, are just too stupid to understand this. Definetly a worth of your time."
    },
    {
      "rating": "10",
      "text": "An underrated piece of art, this bleak future where emotions are forbidden has an ironic emotional core to it. It doesn't surround itself with blatant copies of Fahrenheit 451 and 1984, in fact, what many people would assume are carbon copies I would prefer to call references, harking back to other dystopian films while also being a standalone film in its own right. Equilibrium treats the matter with mild stoicism, foreshadowing particular events in a neat way that manages to explode in a thrilling yet thoughtful way. The ignorance of many critics that assumed the worst, didn't seem to see the whole picture. None of this was about the fact that censorship exists or that you could be executed for certain crimes. The whole idea of the film was to make you see how people behaved through lack of emotion, with the failure to see that emotion is what makes us human. Rather than take a purely political motive, it manages to incorporate perhaps a majorly ethical motive. The action that is contained in this film is not just for showing off. The stylistic features render the action scenes mindblowing, but no less helping to drive the core theme of the story - besides, the main character is a cleric, trained in the art of Gun Kata (a thrilling name for a sadly non-existent masterpiece of fighting style) who manages to put a chink in Libria's armour as we see through his perspective by realising he can use this weapon against the system that attempts and fails to betray him as someone who is 'feeling'. When I first regarded this film, I became fascinated about how, amongst the close-ups and wider shots, the main character seems to obviously show some kind of emotion without the intrusion of the system demanding why on earth he hasn't been arrested for his crimes. This ultimately came to the climax, whereby the foreshadowing managed to sneak its way in at the beginning. The fact that Christian Bale was chosen for this role makes me wonder why some people didn't think this was good, considering how deft he was in executing the action, the visual non-speaking scenes and the dialogue. To the amazing use of irony, a number of heart-rending scenes kept up the core theme, and the stylistic use of camera focus on Christian Bale emphasised the distress that we could feel he was going through, one being his flinching when we don't see the dogs being shot, but we can feel it by way of his reaction. However, I thought one of the most chilling scenes was during a raid of someone's apartment, with fires burning and people spattered with blood, was the simplicity of a dying man running into the main character, known as John Preston, bleeding, desperation and hope glittering in his eyes as he slides down, leaving Preston aghast and completely horrified, reflecting the man's pain. The expression on his face could not have been possibly matched, Christian Bale just executed that so perfectly that I could feel myself choking up and stopping dead. So this film, by none the way anything completely copied from other films, is a masterpiece in its own right. By way of insulting the stylistic features to convey emotion and provide thrilling action that shaped the film, the amazingly well-acted characters that were to no end incredibly fascinating, the amazingly clever storyline, you are refusing to take it to the light of some of the world's greatest films and distastefully making the biggest mistake of throwing it away. Like the scene in the film, whereby Preston awakes from a nightmare with shock and overwhelming emotion, tears away the fabric from the window to reveal glimmering light on the horizon and a rainbow glowing in the rain, it strips away the layers as the film goes on, lulling you into a false sense of security, but instead just brings you surprises exploding onto the scene, leaving you brimming with hope at the end. Look out for the poignant reference of Yeats."
    },
    {
      "rating": "10",
      "text": "After watching this movie, I was completely shocked at its metascore! Thank god the users have got it right! This films goes up there in my favourite films of all time list. The story is really good, I don't know why some people were bad mouthing the story, it was really interesting and executed nicely, job well done right there. The action itself is fantastic, I've only watched it recently so considering it was a 2002 film I was definitely impressed."
    },
    {
      "rating": "10",
      "text": "I can't understand the low score on this movie. The movie is awesome! Maybe the mainstream media has a problem with this sort of films... maybe it makes people aware of their own goals!"
    },
    {
      "rating": "10",
      "text": "This is one of the best movies ever. It's action scenes outclass the Matrix by at least 2x, if not 100x! The plot, character development, characters, and ending all outclass The Matrix (which was a great movie.) My favorite part is the ending! One of the best endings ever, because it says what we all feel, and gives us what we truly want: Pure Ownage."
    },
    {
      "rating": "10",
      "text": "This is an excellent rendition of the potential of totalitarianism today. I have to agree with some other users, that the \"critics\" are truly in denial about society. Take a hard look at the world today, know anyone on anti-depressants or Ritalin? Do you feel world news is uncensored? If you feel that world leaders and nations aren't manipulating emotions for political/financial gain or profit, you are truly in denial as well."
    },
    {
      "rating": "9",
      "text": "Reading the critics' reviews, I am astonished by the vacuity and triteness. Apparently they hate dystopia themes because they fail to produce any kind of intelligent criticism. It contains a clever dystopia premise with solid acting and innovative---if unrealistic---action sequences. Once again, if you hate dystopia themes then just admit it upfront. Don't pretend, though, that this movie is \"mindless\" because it copies other dystopian themes. That is a mindless statement, for sure."
    },
    {
      "rating": "8",
      "text": "Christian Bale,conta com uma super performance,uma brilhante história e cenas **** Yeah!!!.\rSean Bean um pouco que aparece já deixa sua marca no filme com uma brilhante performance. Como disse uma história brilhante que talvez com um orçamento maior teria um resultado mais interessante porém mesmo assim o filme ficou ótimo"
    },
    {
      "rating": "8",
      "text": "I love the difference between the User and Critic score, but I liked this movie because I liked the world that was presented and the characters even though they didn't need any emotion (major plot point)"
    },
    {
      "rating": "7",
      "text": "I feel the need to clear the air here. There is a massive disparity between the very poor reviews this movie received from critics and the massive praise it enjoyed from viewers. Do not believe either. Users who have given this movie 10/10 are out of their minds--it is simply not that good--and critics who have panned it are being too harsh. Although this an exceedingly half-baked re-hash of Orwell and Huxley, it is nonetheless an entertaining and not entirely mindless action flick. The fight sequences are, for the most part, pretty good and I must say I was pleasantly surprised with the inventive nature of the gun battles (a unique if not entirely realistic idea that you simply need to see if you want to get it). While you shouldn't expect anything particularly profound or original, this movie is not completely mindless. On the whole, I recommend you give it a try. But go in with both eyes open and don't expect too much. If you approach this film from that perspective and don't take it too seriously I think you will genuinely enjoy it. 6.5/10, imho."
    },
    {
      "rating": "10",
      "text": "The critics who reviewed this terrific movie are morons. Judging from the list of bad movies they gave good reviews for its no surprise. This film is one of the best sci fi action movies ever. You don't have to appreciate the ideas that are presented but cannot deny its powerful impact. We ourselves are the evil we try so hard to oppose. Our ideas and judgements about humanity are all at stake no matter how its presented. And this film does a great job of elevating that narrative."
    }
  ]
}