{
  "id": 3273,
  "title": "Eragon",
  "starring": [
    "Ed Speleers",
    "Jeremy Irons"
  ],
  "runtime": 104,
  "genre": [
    "Fantasy",
    "Action",
    "Adventure",
    "Family"
  ],
  "description": "In his homeland of Alagaesia, a farm boy happens upon a dragon's egg -- a discovery that leads him on a predestined journey where he realized he's the one person who can defend his home against an evil king.",
  "releaseYear": "2006",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/k8f8WZjTzZ6TJYrKpyayCB4zKlw.jpg",
  "categories": {
    "plot": 1.7380952380952381,
    "acting": 1.8928571428571428,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 2.2857142857142856,
    "funny": 1.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Nice sfx effects but hell, it was written by a kid!!! It's obvious he only had 2 influences: Harry Potter books and the movie Dragonheart, which was good."
    },
    {
      "rating": "1",
      "text": "'This is the most original film ever made' would be something you would never hear about Eragon. Not only does it feel like it was written by a 2-year-old monkey , with horrible dialogue and bland, uninteresting characters, buit it also seems to enjoy stealing from every damn fantasy/sci-fi film out there. It's as if the writer went into a DVD store and rented out every friggin' sci-fi and fantasy film on the shelf, before putting each film in a boiling cauldron and mixing it into something evil. It's as if Star Wars and Lord of the Rings had a son, but this son is an ugly, stupid, bastard child with brain damage and problems with interacting with other kids.Even if you can get past the horrible dialogue and generic, recycled plot, the acting is horrendous too. Composed of a cast of mostly nobodies, Eragon excels at making you cringe at the God-awful acting. In fact, the acting is so bad it's funny. Hearing generic-faced people utter generic lines such as 'we must destroy the empire!' and 'great power comes with great responsibility,' I found myself either laughing or sleeping throughout the whole movie. Mostly the latter.Perhaps the one redeeming quality this film COULD have had is the effects. I'm definitely not saying that special effects should be valued over a good story (*cough* George Lucas *cough*) but in an alternate universe, if you could overlook the story and every other horrendous thing about this film the effects could make it worthwhile. That is not the case in this film. The graphics are generic and more cheesy than a packet of Doritos. Seriously, you just want to scream at this film 'WHY? WHY WHY WHY WHY WHY?!'.But the saddest thing about this film is that it could have been SO MUCH MORE. Yes, the book this film is based on is hardly original either, but if the plot and setting was changed, the cast replaced by talented acters, a good writer penned the film, the dialogue got changed (or removed entirely) and the special effects were taken out, then this film MAY have become an enjoyable Winter blockbuster. Ah, who am I kidding, this film was a nuclear bomb even before the monkey started writing the script. May God rest that monkey's soul."
    },
    {
      "rating": "1",
      "text": "The visuals are cool but they simply have little purpose in a movie with a sloppy plot. The entire construction of the movie is sloppy and it just plain boring."
    },
    {
      "rating": "0",
      "text": "This movie has to be one of the worst films of all time. Not a single good thing about it other then the CG of Saphira, Which was rather well done. Way to ruin the series."
    },
    {
      "rating": "4",
      "text": "The film would've been a lot better if Peter Jackson or Ridley Scott headlined it, and added and hour or so."
    },
    {
      "rating": "1",
      "text": "Yikes, is Eragon BAD. To be fair, the books are derivative, but they are entertaining and bring new elements to tried and true storytelling techniques. The books are at the very least, a fun ride. The movie is utterly bland at best and a nightmare at worst. The only elements that save this movie from being a 0 are Jeremy Irons as Brom and Rachel Weisz as Saphira. They honestly do their best with a bad script."
    },
    {
      "rating": "6",
      "text": "Guys, if you’ve never read the book Eragon, then there’s a chance you might enjoy this movie ( which was my case when I saw this movie for the first time)... then one day I read the amazing book and then rewatched this movie... oh, how much I regretted doing that!!"
    },
    {
      "rating": "2",
      "text": "\"Eragon\", a movie based on a book written by a 15 year old kid, is a embarrassment in film history. Everything is a mess; story, script, cast, CG, even the name! Don't expect to see a epic fantasy like Lord of the Rings\" while watching this movie. It's not even close."
    },
    {
      "rating": "3",
      "text": "Yes, the novel clearly was influenced by Lord of the Rings and Star Wars, even in the sequel, Eldest, it seems followed this influence. However, in the third novel of the Inheritance Cycle, Brisingr, the plot begins to change. For those who do not read novels, I am sorry to say that you will never see Eldest in film form let alone Brisingr or the fourth in the cycle. Why? Well, it's obvious isn't it? The Eragon film was just plain horrible. Chances are you could probably do better filming in your backyard with your flip phone (slight hyperbole). I am not sure how to review this one without spoiling it, but it outright sucks. If you want to see why, rent it out,  just make sure you have a back up video to stop yourself from destroying the television."
    },
    {
      "rating": "8",
      "text": "forget what the critics say about this movie. it has great entertainment, great visuals, great everything. god praise Eragon."
    },
    {
      "rating": "8",
      "text": "I read the books and fell in love with them. I was very excited when I found out that there was a movie about it. After I had watched I could tell the major difference between the two but it wasn't horrible. You shouoold let the movie stand on its own, away from the books, or you will have a very longwinded argument about all the things that were missing. It was a fun movie with awsome effects and I think it need some credit. So, well done."
    },
    {
      "rating": "10",
      "text": "This was one of the most awesome movies of the year that I saw. I think all the bad rumors about it are false. This movie was one of the greatest back when it was released. Everyone should like this movie. I hope the make a movie for the second book ,Eldest, and the third book, Brisingr. This movie should have a lot of positive reviews. :)"
    },
    {
      "rating": "2",
      "text": "I had the nice advantage of reading the books and knew that a lot was stolen from Star Wars, but they are well written books. The movie is an epic fail one of the worst book adaptations ever, with bad performances. Cool special effects though. I give this film 21%."
    },
    {
      "rating": "10",
      "text": "This was the best movie that I have seen in a long time. I dont know why everyone says that it was, \"Written by a teenager and its terrible.\" This was a great movie, and I rented it again just so I could see the details better. There should be movies of all of the other books that Christopher Paolini wrote. BEST MOVIE EVER!!!!! :)"
    },
    {
      "rating": "0",
      "text": "This film was terrible and nothing like the books at all - if they released a book of the sequel I wouldn't even waste money to see it."
    },
    {
      "rating": "2",
      "text": "When compared to the book, 2 stars, when not, 4 stars. Compared to the book, it really stinks. The only good thing about it was the aerial battle and the Keep Holding On song. The only worthy actors would be the ones who played Brom (altough I think he should have looked older), Durza, Murtagh, and Ajihad. I hope they remake the film to where it is very faithful to the book (which would be at least 3 hours long). Although I would like to do the script for it as well as the sequels myself. Hopefully I will and give you all those films the way they should be."
    },
    {
      "rating": "10",
      "text": "Personally, I think this movie topped lord of the rings. It's not nearly as cliche and includes more fantasy. At least the main character isn't as hopelessly helpless and frodo was."
    },
    {
      "rating": "2",
      "text": "The writer and director of this movie need to burn in hell for the abomination that they have unleashed upon the earth. (sounds pretty epic, doesn't it, lol)."
    },
    {
      "rating": "2",
      "text": "The effects in this film, especially the work on the dragon Saphira, are impressive. That's it. Everything else is insufferable. The storyline was created by a kid in his early teens and it shows. The acting can only be called that at a push but, to be fair, they don't have much to work with.The characters they were trying to portray were extremely bland and there was very little character development. I'd love to say that this film would be better if you'd read the book, but I have read the book and it doesn't help. My basic point is that if you don't want to launch a serious attack on your brain cell count, avoid this film at all cost."
    },
    {
      "rating": "1",
      "text": "I've read the book. It was alright, it had a poorly written storyline and most the characters were very unimaginative but it kept me interested for me to finish it. The movie is awful without a doubt. It ripped out and changed most of the storyline and made it even worse than the book, well it doesn't actually follow the book's storyline very well. The storyline wasn't the only thing changed though. Some of the characters have been screwed up. Aren't the Ra'zac supposed to have beaks and are strong and not killed by Eragon? Forgive me if i made a mistake, its been a long time since i've read the book. The entire movie felt very rushed too."
    },
    {
      "rating": "0",
      "text": "The books=good. movie=terrible. It probably would be a good entertainment film for a seven year old but for the rest, its just a pile of mumbo jumbo that doesn't even remain that loyal to the book. After the most random growth spurt, laughable dialogue, and John Malkovich cutting down a curtain, I just want to lie down and scream. Watch Lord of the Rings or Narnia instead!!!!"
    },
    {
      "rating": "0",
      "text": "Oh. My. God. I'm gonna split this review into two parts- the first for people who haven't read the book and the second for the people who have. The movie isn't that bad, it just suffers from a dull plotline and too much focus on random action, and not enough focus on the characters. Certainly, they could have developed Brom more than they had, or gave some background on Eragon. And then the second review. If you have read the book, here is my opinion of the movie. As a huge series fan, I feel that they have smothered the original story is smelly sh*t and then spit on it. For one, it is Summer in the movie. Fuc**ng Summer. The book takes place in winter. Two whole cities are cut out, at least six characters are gone and the worst part is that partway through the movie Eragon kills all the Ra'Zac like they were babies. Know what that means? It means that there is zero chance for Brisingr to ever be made into a movie, which I suppose is good so they can't ruin it. Don't see this movie. Just..please...don't see it."
    },
    {
      "rating": "0",
      "text": "You guys need to try reading the books before badmouthing the author over the movie, as his first series he's done an excellent job even surpassing some more experienced fantasy authors.\r The movie really annoyed me, it uses the name, a VERY simplified version of the storyline and some of the characters (minus about 90% of their personalities). I can understand the need to alter the plotline a little bit to fit into the timeframe of a movie but they changed so many things completely unnecessarily. I can't really explain it all but go read the book and then watch the movie and you may understand."
    },
    {
      "rating": "4",
      "text": "Just in case if you don't know, here is a rundown of the story - A poor farmboy finds a blue object with relations to a princess. When his uncle dies he goes with an old man to flee the Empire's elite troops. On the way the old man teaches him of a magical force and gives him a weapon. The boy finds out that the old man used to be part of an ancient order that kept peace before they were betrayed by one of their own. They then go to rescue the princess that sent the blue object, but in doing so the old man dies trying to save the boy. They then go to the rebel stronghold, meeting a guy with a dark past along the way. However, they are tracked and the Empire attacks the rebels. However, the boy defeats the enemy commander in a dogfight and the rebels defeat the enemy force. Sound familiar? And on top of the story being an outright copy of Star Wars Episode IV: A New Hope, the best actor is really the dragon. Ed Speelers just stands there going 'wow!', Jeremy Irons is given a really bland script and John Malkovich only speaks in one scene. The dragon is really the only redeeming factor, being that it looks and flows like a giant bird of prey and that Rachel Weisz voices her like who she is in the books, caring yet young and brash. The rest of the movie is just a worse rendition of something that we've all seen before, be it Star Wars or Lord of the Rings. Its not cliched, but reading the book and seeing the movie gave me the feeling that Christopher Paolini was a wannabe Tolkien who had seen too much Star Wars. The book is well written and worth reading (originality aside), but the movie misses 70% of the story, and is less worth your time than the book. Go watch the original Star Wars Trilogy, The Lord of the Rings or read the book."
    },
    {
      "rating": "0",
      "text": "This movie was utterly terrible, I just wish everyone would stop saying \"written by a 15 year old and it clearly shows\". Please don't compare this to the book that was written by said 15 year old. The Inheritance Cycle novels were amazing, but this movie was a total disappointment, leaving out so much and infuriating fans (like me) in the process"
    },
    {
      "rating": "1",
      "text": "I read both Eragon and Elder which I enjoyed, but the movie was terrible. I have never seen such a great story butchered so badly. What a waste of time and film."
    },
    {
      "rating": "1",
      "text": "Yikes - It's a bad sign when the author obviously meant to name his \"novel\" Dragon but instead of typing the D, typed an E instead and stuck with it. He should have given up after the typo because the movie is just one long excrutiating typo. This movie is just awful. The second bad sign was I took my girlfriend and her 10 year old son to this movie and although my girlfriend was okay with it, her son (who this movie is obviously geared towards, also do not go to this movie thinking it's in the same league as LOTR or Narnia, it's not even CLOSE), was bored to tears with it. My \"Error\" is that I paid for a ticket to this movie at all. After witnessing about 35 minutes (believe me it felt like an hour) of Jeremy Irons and John Malkovich embarrasing themselves and just looking for an easy paycheck, we were \"Gone\". That's a bad sign. Never have I seen that before. I mean once in a while it's okay to see a high profile actor do a bad film just to collect a paycheck (Snakes on a Plane?) but two highly regarded actors in the same film? Me thinks Fox put some hocus pocus juju spell in both actors drinks before they handed them the scripts... Well we eventually left our seats after we could take no more and sneaked into the theater next door showing Unaccompanied Minors... that movie was not much better, but we enjoyed it much more than this poor excuse for the studio to cash in on the newly rejuvenated sword and soercery genre. Awful Film. Stay Away!"
    },
    {
      "rating": "3",
      "text": "I didn't read the book. I suspect that, if I had, I'd be a lot more ticked off this morning than I am. It's pleasant, diversionary entertainment. It's also an annoying little film. Annoying because, in the midst of the chopped and hacked sequences, the ham-fistedly filmed action scenes, the corn-pone dialogue, the 103-minute running time, is a strong, likable, interesting, and fleshed out 145-minute film just dying to have been made."
    },
    {
      "rating": "0",
      "text": "This is the most derivative piece of crap ever. Not only awful, but glaringly unoriginal in its slavish copying from other films in the genre. I was surprised that Peter Jackson et al. didn't sue the pants off of the makers of \"Eragon,\" until I realized that they probably did not want to draw a comparison between their work and what is a truly painfully awful film."
    },
    {
      "rating": "0",
      "text": "If you've read the book, DO NOT watch this movie. I had the highest expectations for this movie after I read the books. I was severely disappointed. Saphira was the best part of the film. This is the biggest piece of crap I've ever seen. Christopher Paolini should sue the crap out of whoever was in charge of this movie."
    },
    {
      "rating": "2",
      "text": "This movie was trash. the acting was horrible, especially from the main 'hero.' it didn't help that he was totally unlikable to boot. the only reason this doesn't get a zero is that the dragon had character and Jeremy Irons didn't suck too bad."
    },
    {
      "rating": "0",
      "text": "This movie's a joke. I can handle the fact that it take 's it's plot lines from SW, HP and LOTR, I can handle the fact that the movie's special effects are frustratingly armature, I can handle the fact that the plot makes no sense and there is way too many dragon fights, what I can't handle is the fact that it has an decent script written for it in the book Eragon, yet it's dialogue is embarrassingly laughable. Unless you are a nine year old who likes dragons and wouldn't know a good movie unless it hit them in the face, AVOID THIS MOVIE. Whoever got paid to make this pile of poo should be charged with fraud."
    },
    {
      "rating": "0",
      "text": "Well, I didn't read the book and after this, I most likely will not ever pick up a copy. It was a want-to-be LOTR with a little SW mixed in. It didn't succeed. Leave alone the terrible SFX and the non-existing story, the dialogues were beyond frustrating. Nothing in this movie made sense and it felt rushed, put together as if chronology doesn't matter and sold it as an unfinished product. Nothing in this thing is believable or entertaining. Just throwing in some British actors to pretend to have some class is just not cutting it. It doesn't even hold its own as a copy of LOTR, because the writing is simply too bad. There's nothing redeeming about this and I will not go and see the sequel (if there ever is one). If there was such a thing a as minus rating, I would gladly use that."
    },
    {
      "rating": "0",
      "text": "Probably the worst movie of 2006. I'm somewhat of a fantasy fan, but this was utterly disappointing. The director either had no sense of pacing or intentionally made this movie for those with startlingly short attention spans. Things that should take days, weeks, months or even years happen instantly. First we have the cute little CGI dragon hatchling Awww...but we need a big dragon for the rest of the story. Hmm...well we'll just make it instantly mature. Ta Da! Then we have Obi Wan, oops, I mean Brom try to teach young Eragon the ways of magic, but that might take awhile so instead we'll just have Eragon mysteriously discover how to do magic on his own. Gee that was easy. Everything here happens quick and easy. There's no sense that the hero makes any serious effort to do anything. He's constantly wanting to take on platoons of ravenous bad guys and we're supposed to swallow this as a bit of characterization. Hmm...what a brash young hothead our hero is...but then he dispatches the hordes without breaking a sweat. He's not brash--a kindergartener armed with nothing but a Duncan yo-yo would have a pretty good chance against those pathetic enemies."
    },
    {
      "rating": "1",
      "text": "I have read both books (Eragon and Eldest) and enjoyed both of them. I was curious to see what they would do with the film. After seeing it, I was extremely disappointed. There were quite a few parts that I enjoyed of the book, but they were either changed, or just left out! Even though a film of the whole book would be quite long, if you want to do something, do it properly! At least Saphira was cute for a while."
    },
    {
      "rating": "0",
      "text": "If the rating was on here, I would have given this movie a -10. Both my husband and I have read Eragon, and Eldest. Like one person said, it was torture sitting though the movie. Especially when you know what's supposed to happen. Not only was the story line wrong, but so were the characters. Uh, Arya had black hair, not reddish blonde, and they didn't even bother to make her look like an elf. Saphira having feathers??? And growing up while flying in a lightning storm? Look, I know that they have to pace the story but come on! Not only was the story line botched beyond repair, but I felt like the movie was on fast foward the whole time. What happened to the dwarves? They are kind of important in the next book...and so are the elves, but we didn't see them either. This movie was the saddest attempt for a book-to-movie that I have ever seen in my life, and being that I rather enjoyed the books, I'm pretty pissed."
    },
    {
      "rating": "1",
      "text": "I was very disgusted with this movie. Nothing like the book. Bad acting, bad attempt to make it like the book. Tried to copy lotr but couldn't cause it sucked so bad. Easily the worst film of the year in my opinion."
    },
    {
      "rating": "7",
      "text": "After reading the reviews from both critics and viewers I felt I had to add my say. I liked this movie. My 6 year old son was frightened by some of the images, but it is generally an entertaining movie. More exciting than Narnia. It seemed like a definite mix of LOTR, Star wars, & Narnia. Would definitely see a sequel. God's Speed Eragon!"
    },
    {
      "rating": "0",
      "text": "I fully agree with Mike S. This movie was beyond terrible. It was a torture for me to sit through, as I knew what was actually supposed to happen. They deviated from the original storyline so much it was painful. The creators have literally shot themselves in the foot, as it will now be completely impossible to make the second installment without COMPLETELY changing the storyline. I had to force myself to sit through to the end, and it took a great deal of effort to not yell out profanity at some stages. I have the most minimal skill with films and making them, but even I would have done a much better job of this movie (with a bit of help, of course). I would recomend the author of the books to sue the pants off of these fools."
    },
    {
      "rating": "0",
      "text": "Very bad movie, a lot of info was not included, after reading the book it was horrible to watch. I would rate it the worst movie of 2006."
    },
    {
      "rating": "2",
      "text": "The positive points are for the dragon CGI. The actual telling of the story itself was horrendous. I probably would have read the book long ago if the movie hadn't tainted the story for me."
    },
    {
      "rating": "7",
      "text": "The movie was good, but if you want movies that follow the book, this is not your movie. They had great effecs, and the actors did the best they could with what they were given. Over all, i think it was a great movie (even though it was not true to the book) and it is worth buying."
    },
    {
      "rating": "2",
      "text": "TERRIBLE!!! It has nothing to do with the book except for the names of the characters and throws the plot out the window! Tthe dialogue was cheesy, the directing terrible. The only possitive point was the way the dragon looked. All in all a terrible movie that deserves to be toasted by the dragon, if I was Christopher Poalini I would commit suicide for having my book portrayed in that matter!"
    },
    {
      "rating": "6",
      "text": "I read the two books that are out... its not even close to the true story. Yes, the effects are nice, and the relation dragon-rider is well portraited, but the story is confusing, far tru from the original and very melodramatic. Yuck!!!"
    },
    {
      "rating": "7",
      "text": "I wish I hadn't been initially swayed by all the bad reviews for this movie. I watched it recently, and I didn't think it was all that bad. It's not the best movie out there, and it certainly doesn't stack up to any of the Lord of The Rings movies, but it was okay as entertainment for a lazy sunday afternoon. It reminded me a lot of the older fantasy movies from the 1980's."
    },
    {
      "rating": "0",
      "text": "I read the book, and I think it was ok even though there where absolutely no new ideas in it. So I went to see the movie. They could just as well have called the movie DRAGON WARS! return of the ridder! It has nothing to do with the book, and the actors where porbably found in a dumpster. This movie is worse than bad and there is no reason to waste money on it. Btw how come hes the only one with clean cloth? Even after a huge battle??"
    },
    {
      "rating": "1",
      "text": "I'd like to call this film the most mentally challenged fantasy film I have ever seen. Horrible editing, god-awful script, and considering how embrassingly simple the story is, it somehow still manages to not make a whole lot of sense. The movie essentially follows the successful template of Star Wars plot-wise, but it's so muddled and derivative that you just want it to hurry up and end. Though I haven't read the book, I heard that they couldn't even follow IT accurately, so one wonders what the studio was thinking. The actors were piss-poor; John Malkovich had as much intimidation as Andy Dick in the single minute that he's on screen, Honsou was completely useless, the main character is irritating, and Jeremy Irons, who deserves so much more than this, seems to be the only one that attempts anything that can be considered a performance, which is a testament to the type of actor that he is. The dragon Saphira, admittedly, is an impressive CGI creation, and Rachel Weisz does give the creature a certain etiquette about her, but the decision to have her speak in a telepathic voice is just ridiculous. Either have the creature actually speak (Dragonheart showed that you can pull it off), or at least give it enough expression to just pantomime through the feature. While this is a more picky complaint, it's just the way they present the voice, especially with the craptastic dialouge, is winch-inducing as if it were a 1980s afternoon fantasy special. I usually avoid using this term to describe a movie, but I have no choice: it's retarded. It's as if Lord of the Rings was dropped on its head if it were a baby. I don't rate it a zero because while it's a curse to the genre, it could also be a blessing in disguise. I'm sickened because there are so many other great sci-fi/fantasy stories out there that deserve the film treatment and THIS flavor-of-the-month gets a $125M budget and a December release. BUT because it should do wonderful in the box-office, the studios could start grabbing more and more fantasy stories; which is a good thing because any other story would be better than this idiotic cesspool of cliches and shoddy dialouge. I haven't hated a movie like this since Timeline."
    },
    {
      "rating": "2",
      "text": "Saw this movie last night, thankfully for free. The more I think about it the more I realize how bad of a movie it actually was. It feels like they shot the movie in a matter of weeks with how rushed it is. Imagine Narnia (not going to blame the movie, thats how the books were written) on speed. Should have added at least another half hour to develop some sort of story and character development. Perhaps the director could have made the elves look like elves, and the urgals look like urgals, but no not even pointy ears!!!!! Usually I don't care at all about movies straying from a book or comic, but this is a disgrace. The thought of a possible second movie disturbs me. Subjects and characters that aren't touched on in the movie play a huge part in the 2nd book. For instance, Eragon and Murtagh's close friendship, Eragon's obsession with (unlike the movie Arya express little emotion and never returns Eragons affection for her) Arya. The wound he receives from Durza plays a HUGE role throughout the second. The child he blessed/cursed in Farthen Dur, and the fortune teller Angela also play major roles. The list goes on. That being said, with these gaps in the story I don't see how a second movie is possible. End it now... perhaps in 20 years or so someone will make a good version of this book."
    },
    {
      "rating": "6",
      "text": "Being that the rating was PG I took my 6 year old grandson to see it and was not pleased with the violence that the movie portrayed. I was surprised this film was not rated PG-13 and am wondering how much of this rating system is political. Why are some movies like Pirates of the Carribean and Superman have less violence that this one are rated PG-13? Other than that the movie is okay and very visual. A tear arose when I thought the dragon was dying. The end of the movie lets you know there will be a second and probably a third. I would rather have one really good movie than 3 so so films."
    },
    {
      "rating": "8",
      "text": "One of the professional reviews said - great for 10 year olds, and that is the truth. They know their perspective audience and so this is the right age bracket for this movie. Obviously had to simplify many of the plot lines from this tome of a book. Don't walk in expecting SW or LOTR and you'll be fine, sit back and enjoy it through a 10 year olds eyes. (votes are the combination of three peoples opinion)"
    }
  ],
  "recommendations": [
    "the_mortal_instruments_city_of_bones",
    "artemis_fowl",
    "the_chronicles_of_narnia_prince_caspian",
    "percy_jackson_sea_of_monsters",
    "dreamcatcher",
    "vampire_academy",
    "the_golden_compass",
    "the_twilight_saga_eclipse",
    "the_hobbit_the_desolation_of_smaug",
    "dragonball_evolution",
    "the_twilight_saga_new_moon",
    "seventh_son",
    "the_last_airbender",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "doctor_strange_in_the_multiverse_of_madness",
    "the_book_of_eli",
    "the_day_the_earth_stood_still",
    "a_wrinkle_in_time",
    "batman_v_superman_dawn_of_justice",
    "the_da_vinci_code",
    "the_matrix_resurrections",
    "green_lantern",
    "the_new_mutants",
    "inferno",
    "the_twilight_saga_breaking_dawn_part_2"
  ]
}