{
  "id": 3812,
  "title": "Erin Brockovich",
  "starring": [
    "Julia Roberts",
    "Albert Finney"
  ],
  "runtime": 131,
  "genre": [
    "Drama"
  ],
  "description": "A twice-divorced mother of three who sees an injustice, takes on the bad guy and wins -- with a little help from her push-up bra. Erin goes to work for an attorney and comes across medical records describing illnesses clustered in one nearby town. She starts investigating and soon exposes a monumental cover-up.",
  "releaseYear": "2000",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5GAUaXxC7chmHzXiB4L1nnplx9y.jpg",
  "categories": {
    "plot": 7.333333333333333,
    "acting": 6.571428571428571,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 9.2,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "8",
      "text": "a breath of fresh air in this hectic mechanical world..Erin BrockovichSoderbergh's unflinching reply to the misogynistic mentality is a real timeless gem. Ticking for more than two hours, it follows one and only one track that keeps us tangled in this traffic of mediocrity through which the protagonist soars as an obvious clear winner. It is not believable because it is real but is real because it is believable. This insanely sane character of Roberts is just a breath of fresh air in this hectic mechanical world. And despite of the fact that she is dipped into one, she is surprisingly calm, smart and hard worker than the ones surrounding her. She stands alone not only on these characteristics but the tiny notions that shows her humbleness. And amidst all these fine qualities, she is also flawed and blatant about few fragile things which actually sculpts her to a more effective and humane that makes its easier to connect. Aforementioned, the narration is adaptive and layered if not gripping and is also too much mechanic that is unfortunately imputed with unfiltered storytelling of it. And this is where Soderbergh swoops in, he takes his time, he glorifies each moments through his brilliant finesse on execution that keeps the thrills alive. The dialogues aren't just mere a medium to converse but has their own characters, especially the way they are delivered by Roberts. The eerie buoyant natured script is what keeps us thriving and wolfish for the behemoth exposure that this case is, since the revelations are enfolded with equal sincerity that keeps us giving back and back. And to justify these reasons is what Soderbergh's job is and he is well aware of it. Erin Brockovich is a force to be reckoned with and not because of all the prowess that it possess but the line drawn on its ideal state."
    },
    {
      "rating": "10",
      "text": "Hey, I tell you! Damn, listen to me? Do not run, stop for a moment. Are no longer young. Thank you. I need you to just a few questions.\r What is the color of your skin?\r What kind of question is this.\r Do not be angry, please, please reply. Eventually everything will be clearer. Resume, what is the color of your skin.\r I am a white man.\r Ok. You see that gentleman over there?\r Who, that reads the newspaper?\r No, the other one with the dog.\r You see it.\r What is the color of his skin.\r It 'a colored man.\r Sorry, man of color is a bit generic, you can be more specific?\r It 'a black man.\r And the other, that is collecting a flower? Well .. one is yellow.\r I'm bored? No, please. Continue.\r Listen, you believe that diseases recognize skin color?\r Come on, do not make me laugh, that damn question.\r Yes, I recognize that the question is a little strange, but it is a question. Can you answer?\r Sure, the diseases do not care your color, your religion, if you are a\r Republican, a Socialist, left, center left, center right,\r Democrat. I say more. Do not even knock on the door. Sign in enough\r if it is trivial, you get on. Otherwise ... otherwise reach your God.\r Pause ...\r That's it?\r We're taking taste? You like to be interviewed. Maybe call the video operator. Most people flee before the camera.\r Come on.\r\rYes, go ahead.\r\rChildren, the elderly, what you think.\r\rI believe they have the right to grow, play, study .... and now elderly,\r\rdie in peace.\r\rAnd if someone intentionally, perhaps to do a lot of money, anticipate everything.\r\rNice catch.\r\rThat's why we need a free press, free men, free information. You are informed?\r\rNo. Sometimes I think it is useless.\r\rDo not be discouraged friend, it is important to be aware of the problem. So there are some brave films that tell true stories of people who pay on their skin, the careerism, the wealth at all costs, the struggle for power.\r\rIt 'been a pleasure to meet you. America is beautiful, you have many problems but it is beautiful. Also in Italy we are not very good.\r\rHello friend, thanks.\r\rThank you to the next.\r\rAnd now the movie.\r\rStubborn, loving, original, optimistic, charming, proud, dynamic, thoughtful, fearless, loyal, impulsive, foul-mouthed, angry, caring ... it has a memory of iron exercised because dyslexic. Two former husbands behind three children to care for Matthew, Kitty, Bett, respectively 8 and 6 years, 9 months' last.\rThis woman is Erin Brockovich (Julia Roberts). Even the real one, appears in the film. The encounter at the Steakhouse Restaurant. And 'the person who takes the reservations of the family when Brockovich, an \"unwanted friend\" in the kitchen sink, leads Erin to bring out the children. The first to be overwhelmed by our Artemis and, twice, is the lawyer Ed Masry (Albert Finney).\rThe first. Unable to obtain compensation for the damage done to Erin's neck, the result of an accident. (By Erin poverty, called to testify in court, using language not exactly Shakespeare.)\rThe second. Desperate for work, her days are punctuated by readings of ads and phone calls, has the idea of presenting the study at Masry and think a bit '... \"get\" the coveted job, no insurance, but that's something. Job, salary, ergo, a little 'sunshine. Meanwhile, the house vacated by the station is now occupied by George (Aaron Eckhart), working in construction when he wants and has a passion for the world's most famous twin. The first meeting with George is taken from the manual \"How to get along with your new neighbor\" far from it over time, however, things seem to take a different turn. Erin in the office and instructs an interest in a practice on real estate matters, taking advantage of the moment and asks her to dress in a less eccentric, but you know, Erin is direct when answering and his answers are \"joke,\" It beats a retreat.\rThus began the adventure of Erin Brockovich between papers, lawyers, colleagues are not always friendly, people to interview, documents to be photocopied, miles to go, people to send to that country e. . . an unexpected, fundamental encounter.\rAn overcast most often is a harbinger of the storm. The presence of Erin Brockovich in the law firm Masry is something worse.\r\rGood Ciak!"
    },
    {
      "rating": "8",
      "text": "Erin Brockovich was an incredible story where Julia Roberts earned a very good character with a bold performance, the story was very good despite its leisurely pace, but it always kept us entertained second to second so we can continue its great story."
    },
    {
      "rating": "6",
      "text": "Erin Brockovich is an expertly made film from director Steven Soderbergh that creates the maximum emotional it requires. It really is heart wrenching at times to watch these people suffer. The direction is not the only strength, but also the acting. Julia Roberts is phenomenal, while Aaron Eckhart and Albert Finney are incredibly strong here as well. However, the writing is where this one falls apart. The characters are too thin and not fleshed out well enough in any regard. Even worse, Erin Brockovich is characterized as an annoying b***h who flies off the handle when somebody says one thing she does not like. Maybe she is really like that, but if she is, it really needed to be toned down for the film because it becomes grating. This annoyance is what holds the film back because the rest is quite strong and really pulls on the heart strings."
    },
    {
      "rating": "6",
      "text": "Overall, Erin Brockovich has pretty solid direction, but falls short in some of its most important aspects. It's a well paced and well told story with some good messages, but in terms of accuracy and entertainment value, it sometimes feels forced."
    },
    {
      "rating": "9",
      "text": "The eternal fight of David against Goliath, now with a divorced mother, burdened by debt and lack of employment, who will be the voice of the victims of those who were harmed in their person, by the negligence of a corporation. Julia Roberts is one of her most mature roles. And it leaves a good taste in the mouth."
    },
    {
      "rating": "5",
      "text": "Julia Roberts est en pleine forme (et pleines formes) dans ce film social volontiers revanchard et tout de même très procédurier puisqu'il s'agit de poursuivre d'infâmes pollueurs et notamment une énorme entreprise qui met en danger la vie de ses concitoyens...L'actrice campe en effet avec le dynamisme dont elle est capable un mère de famille très brute de décoffrage, grande gueule et féministe, mère bien entendu courage divorcée deux fois et qui se coltine ses trois chiards dont un bébé... et la voici tout-à-coup à son insu Robine des Bois (ou plutôt des Eaux) et intraitable justicière des laissés pour compte et des opprimés...!Oui, j'en rajoute pas mal je crois mais c'est pour restituer le sentiment de caricature qui envahit le spectateur au cours du film, lequel sans tomber dans un pathos exagéré (heureusement) se laisse trop aller dans le grand guignol... même si c'est pour la bonne cause ! ainsi (par exemple) Erin connaît par coeur 634 numéros de téléphone... pas 12, pas 50 ni 200... mais 634 ! et chaque \"drame\" de chaque famille, elle le connaît également jusqu'à la troisième génération !L'autre souci concerne un certain nombre de lenteurs, lesquelles nuisent sérieusement au tempo... ça dépasse allègrement les deux heures ce machin-là et c'est trop, vraiment trop...  il aurait fallu élaguer.Cela étant, Albert Finney est non moins excellent que la furie Julia dans un autre registre bien entendu mais très attachant également et cette comédie -qui n'en est pas une pourtant- a quelques accents comiques fort bien vus, ma foi... à l'insu de son plein gré ou non, ce n'est pas notre affaire... Bref, un film certainement intéressant mais trop contrasté et souvent perfectible."
    },
    {
      "rating": "6",
      "text": "This film is very slightly based on a real case of environmental pollution, where a small community processed a factory because of the pollution and the diseases that it caused. Erin Brockovich (whom Julia Roberts brought to life) is a single, unemployed mother who comes across this process by chance, while working (almost by favor) in a law firm. Julia Roberts has had, in this film, one of the most remarkable works of her career to date, along with \"Notting Hill\". She is a talented actress, who filled with spirit and personality a character who needed a point of irreverence and temper. At her side was Albert Finney in the role of Ed Masry, the law firm's chief partner, who accepts (reluctantly and suspiciously) Erin's help in resolving what promises to be the most important legal case of his career. The film does not hesitate to portray the polluting firm in the worst possible way, in a not inconsiderate and certainly premeditated criticism of the large US corporations, that rarely put environmental and health concerns at the top of their priorities. In this sense, the film, which never abandons the comic and entertainment side, takes a strongly interventionist stance, seeking to alert consciences and draw the attention to the situation portrayed, and some analogous situations that still continue to persist. The film also gives some importance to the so-called \"anonymous heroes\", which Erin symbolizes in a way, and that often make the difference when all other people choose to ignore the problem or let the authorities figure it all out. The cinematography emphasizes the warm and vibrant tones, which reinforces the sensation of heat passed by the filming locations and the garish prints of Erin's clothes, clothes that help the character to clearly assumes her popular and very humble condition.This movie is far from a thriller or a police movie. It's an entertainment film that has been made for the families, but with a huge desire to alert consciences to environmental and health concerns, which it always approaches in a light but determined way."
    },
    {
      "rating": "9",
      "text": "Ed Masry - (Erin's Boss) Do they teach beauty queens how to apologize, because you suck at it !!!!"
    },
    {
      "rating": "7",
      "text": "La trama es muy simple; sin embargo, esto se compensa con la excelente actuación de Julia Roberts."
    },
    {
      "rating": "10",
      "text": "great performance. great story. very entertaining."
    },
    {
      "rating": "10",
      "text": "Erin Brockovich is a smartly realistic and surprisingly funny film about a woman who takes a big part in a case without getting a degree in law. Julia Roberts carries the film with her wonderfully commanding performance."
    },
    {
      "rating": "8",
      "text": "Qwertyuioplkjhgfdsazxcvbnmmnbvcxzlkjhgfdsapoiuytrewqqwertyuiopasdfghjklzxcv"
    },
    {
      "rating": "8",
      "text": "°¤°¤°¤°¤°¤°¤°¤°¤°¤°°¤°¤°¤°¤°¤°¤°¤°¤°¤°¤°¤°¤⊙⊙⊙⊙⊙⊙⊙⊙_____________________________\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\".........."
    },
    {
      "rating": "8",
      "text": "..........................hiigugguihihihugugug\":;!?,.()*&^%$#@+×÷=/_££₩₩€▪○●□■♤♡◇♧¿¡》《¤•《》•°⊙☆▪~♡}"
    },
    {
      "rating": "8",
      "text": "⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙@:@:@:@:@:@:@:@:@:@:@:@:@::@;@;@;@;@;@;@;@;@;@;@;@;@;@::"
    },
    {
      "rating": "8",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."
    }
  ],
  "recommendations": [
    "k_pax",
    "the_card_counter",
    "philadelphia",
    "disobedience",
    "dallas_buyers_club",
    "leave_no_trace",
    "miss_sloane",
    "ingrid_goes_west",
    "on_the_basis_of_sex",
    "dark_waters",
    "the_way_back",
    "the_mauritanian",
    "swallow",
    "just_mercy",
    "bombshell",
    "richard_jewell",
    "a_time_to_kill",
    "the_boy_who_harnessed_the_wind",
    "judas_and_the_black_messiah",
    "greta",
    "my_cousin_rachel",
    "the_hate_u_give",
    "the_white_tiger",
    "green_book",
    "the_danish_girl"
  ]
}