{"id": 3576, "title": "Escape from Pretoria", "starring": ["Daniel Radcliffe", "Daniel Webber"], "runtime": 102, "genre": ["Drama", "History", "Thriller"], "description": "South Africa, 1978. Tim Jenkin and Stephen Lee, two white political activists from the African National Congress imprisoned by the apartheid regime, put a plan in motion to escape from the infamous Pretoria Prison.", "releaseYear": "2020", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/5vePsmbekQ1ysXS6f0lhzgCwvc4.jpg", "categories": {"plot": 7.714285714285714, "acting": 7.6, "ending": 5.0, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 5.0, "funny": 5.0, "action": 6.0}, "reviews": [{"rating": "6", "text": "Perhaps this is the most solid effort from Daniel Radcliffe to demonstrate that he definitely doesn't want to be remembered only for having played Harry Potter.In all honesty, he will never succeed with that, but efforts like this one are appreciated.Escape From Pretoria isn't a film that exhibits depth but it was quite entertaining."}, {"rating": "8", "text": "I was on the edge of my seat! Hard to believe it’s a true story. A very cleverly directed film, highly recommend."}, {"rating": "8", "text": "This based on a true story thriller had me on the edge of my seat throughout the entire movie. The story of Tim Jenkin's daring Escape from a 12 year sentence for spreading anti-apartheid propaganda sheds a light on the on the racist atrocities of the government in general and of the prison systems in particular.Daniel Radcliffe plays the political activist Tim Jenkin, and Daniel Webber (The Dirt) plays his mate Stephen Lee.Mark Leonard Winter is especially noteworthy in his role as the French prisoner Leonard, who only get to see his son for 30 minutes a year.(we'll get back to that)Ian Hart (Harry Potter and the philosopher's stone) is the wise elder political prisoner, who has the system well and truly pegged for what it is.But the truly great performance is by Nathan Page who is Mongo the personification of the archetype sadistic and racist prison guard that visually enjoys the violence and degradation of especially black or coloured inmates.And his clear satisfaction in cutting short the 30 minutes visit of Leonard's son, is a key point in storyline.As talking is prohibited at night, the dialogue is sparse, but this is soon forgotten as Visual long pans, close-ups and points of view cleverly replaces the would be dialogue. Especially the very close up takes of \"Tim\" masterly tells the story of the Terror he's hiding withinSee this movie!! The cinematography alone is worth it!!And the story is cleverly adapted by Francis Annan from Tim Jenkin's book It's readily available on various streaming services, as most Cinemas are currently closed due to Covid-19 restrictions."}, {"rating": "6", "text": "Der Film war ganz okay, kann man sich mal anschauen, wenn auch teilweise zu wenig spannendes passiert. Da er aber auf wahrer Begebenheit ist, macht es etwas mehr Spaß, zu schauen."}, {"rating": "8", "text": "Amazing escape! Even Harry Potter can't do it! LOL. Seriously, this was an interesting movie. I also learned racism called Apartheid in South Africa. It made me feel researching many things on Google!"}, {"rating": "5", "text": "(Mauro Lanari)Rather limp since the jailbreak thriller is at the expense of the prison movie and the escape plan prevails over the penitentiary condition from which the protagonists intend to escape."}, {"rating": "8", "text": "This is a quite gripping and certainly tense crime thriller film. The fact its based on a true story appealed, as is ever the case. Daniel Radcliffe does well in showing a range of emotions undoubtedly felt by the protagonist, Tim Jenkin - anger, determination, fear. He isn't someone others may feel especially easy to feel sorry for, given what happened but even so, you may be surprised by the sheer brutality prisoners faced on a daily basis at the depicted prison. Its an interesting tale pretty well told, with some edge of your seat type moments, so yes, I'd recommend it."}, {"rating": "10", "text": "This movie kept me wondering what the heck was going to happen, my nerves were running in my body, highly recommend it."}, {"rating": "6", "text": "At it’s core, Escape from Pretoria is just another prison escape movie. The finish of the South African apartheid setting does enhance it, and Daniel Radcliffe is good despite a questionable South African accent. But the thrilling scenes of the daring escape get less thrilling as you see them rebranded and recycled."}, {"rating": "8", "text": "acceptable script.great acting by Daniel Radcliffe.good directing.amazing shooting. totally love it!"}, {"rating": "7", "text": "Not a bad watch at all. Movie keeps you on edge as the characters prosceed to jump the hurdles that are put infront of them. Very underated cast, while the movie dose not particularly build on them but on escaping the prison itself, all characters do there part. Radcliff and Heart always good to watch."}], "recommendations": ["patriots_day", "the_way_back", "nightcrawler", "hostiles", "dark_waters", "wind_river", "the_last_duel", "just_mercy", "allied", "judas_and_the_black_messiah", "child_44", "the_card_counter", "closed_circuit", "only_the_brave", "13_hours_the_secret_soldiers_of_benghazi", "the_mauritanian", "the_great_escape", "spotlight", "prisoners", "the_experiment", "the_lincoln_lawyer", "the_guilty", "richard_jewell", "snowden", "12_years_a_slave"]}