{
  "id": 2279,
  "title": "Escape Plan",
  "starring": [
    "Sylvester Stallone",
    "Arnold Schwarzenegger"
  ],
  "runtime": 115,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "Ray Breslin is the world's foremost authority on structural security. After analyzing every high security prison and learning a vast array of survival skills so he can design escape-proof prisons, his skills are put to the test. He's framed and incarcerated in a master prison he designed himself. He needs to escape and find the person who put him behind bars.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qQAKQ2Zwn1BFx3kaWuPJAIk872l.jpg",
  "categories": {
    "plot": 6.434782608695652,
    "acting": 6.625,
    "ending": 6.571428571428571,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.4,
    "action": 7.25
  },
  "reviews": [
    {
      "rating": "10",
      "text": "this film was fantastic, i swear critics these days just dont have any sense of humor, and all films have to be super serious in order for the score to be good. this was really enjoyable"
    },
    {
      "rating": "7",
      "text": "Escape Plan is a damn funny action film, thanks to a mesmerizing Arnold performance. Finaly Schwarzenegger and Stallone stars together and result is beyond expectations. For sure this is not an academy award quality screenplay and some elements are quite cheesy but still enjoyable. This definitely well worth the watch and particularly if you're into 80s action movies. But for God's sake stay far away from the awful sequel Escape Plan Hades, even if the third part Escape Plan Extraction is a fine sequel."
    },
    {
      "rating": "6",
      "text": "Not a bad movie, enjoyable and some cute interactions between Sly and Arnie.  Both guys still in great shape despite the age showing on their faces.  If you love Sly and Arnie, go see it!  Not the greatest plot (a bit predictable and silly in places with stereotypical \"bad guys\"), but still good fun!"
    },
    {
      "rating": "8",
      "text": "A film can't be recommended only on the merits of its big, action-packed finale, and Escape Plan isn't the movie on which to make an exception to that rule. The first 3/4 of the film are plodding, so much exposition and senseless set-up that has you crawling for some classic, '80s-level action. An explosion, at least. But as meandering as most of the film is, it's never boring, and the promise of one, extended, awesome action scene is just enough to keep you invested in the proceedings. Stallone and Schwarzenegger  and we, the action fans of the world  finally have their big, team-up movie, and like the action powerhouses themselves, Escape Plan is a bulky mess. It still knows how to fire a mean weapon, though."
    },
    {
      "rating": "7",
      "text": "I have no idea why Escape Plan is receiving negative reviews. Escape Plan is great, it is really clever and intelligent, I think that Stallone and Schwarzenegger pulled this off, they rocked. The whole plot is new and entertaining, smart and overall very funny. Escape Plan is one of the better thrillers this year (Runner Runner anyone?) it is Clever, entertaining, funny and new, I really enjoyed it, can't wait to watch it again!"
    },
    {
      "rating": "10",
      "text": "Stallone and Schwarzenegger in one movie?! That has to be the greatest movie that has ever existed and yes it is! I think the critics that give so low scores are just old people that dont like their job."
    },
    {
      "rating": "9",
      "text": "When this was in theaters, I had no desire to see this. I redboxed it and now I'm going to buy it. Arnie and Sly on the same film?? It's an action film on steroids! Get it? Oh man! I kill myself! This was very entertaining. I really hope they do more buddy films. Great team and they surprisingly play off of each other well. This movie will really PUMP.... YOU.... UP!!! Oh man! There I go again!"
    },
    {
      "rating": "10",
      "text": "I don't understand why the critics hate this film. Solid plot, solid acting, solid action..... it doesn't want or need to be Pulp Fiction.... it's simply a fun movie with an awesome plot."
    },
    {
      "rating": "7",
      "text": "Very solid and decent thriller. Surprisingly clever and with an unexpected chemistry between the stars and a villain not to be forgotten. Th action packed final is way over the top, but the movie works very, very well. Fortunately, it's grossing big overseas."
    },
    {
      "rating": "7",
      "text": "Upon looking at the cast of Escape Plan, it seemed like another type of Expendables 2 or Red 2 type movie restating that \"old guys are cool.\" We all have seen one these types of movies with no such plot or storyline, just 80ish minutes of action. Just seeing that the movie was 115 minutes and that Arnold Shwarzenegger was in it didn't seem right so I had to go see it.\r Escape Plan is the story of Ray Breslin (Sylvester Stallone) whose job is to test the security of prisons around the world. When asked to test a prison that makes criminals certain people \"disappear\" he accepts the offer and is taken to the prison. After soon learning that the whole thing was a setup, he meets Emil Rottmayer (Arnold Shwarzenegger), and together they attempt a breakout.\r To me it seemed like another scheme just to get the two men back on screen together but it turned out to be much more. I enjoyed watching the chemistry on screen between characters and it seemed effortless (probably because they've been doing these roles for 35+ years).\r The prison (picture one and two) was very unrealistic compared to the regular prison the movie started off with. The mix of CGI (Computer Generated Imagery) and soundstage filming turned out nice, but the overall concept of the cells was a little too imaginary. The guards (picture two) were all dressed in these black suits and cheap party masks. Though it seemed unnecessary at first, I realized that this was done so that the prisoners couldn’t tell who the guards were, make friends with them, know their patterns or know when the guards were actually looking at them.\r The movie felt like someone said \"here's an idea, now make it a movie and release it next month.\" Don't get me wrong, the clever things Stallone did on screen must've taken some top writers to think up and wowed me. It was clear that they rushed the filming in some scenes though. For example, when a supposedly large helicopter was flying over the ocean, it actually looked like a toy helicopter on a wire over a lake.\r Overall, it was easy to tell that Shwarzenegger and Stallone didn't make the movie for the money, but more to show that they're still making movies. I did enjoy Escape Plan for the 115 minutes it ran, but I probably won't remember it a few weeks from now."
    },
    {
      "rating": "7",
      "text": "Sylvester Stallone spends his days in jail, not because he’s a criminal. He’s a security specialist who cleverly breaks out of prisons to help them become less vunerable. When he’s put into a super-security, supercool facility, he teams up with fellow inmate Arnold Schwarzenegger to make his break. The brain-teaser plot pushes credibility, but it still unravels without ever getting dumb or dull. The action is mostly average with a few moments of flash. You don’t go to a movie with these two expecting great drama or deep meaning, just some macho fun and a few laffs. It's enjoyable popcorn escapism, literally."
    },
    {
      "rating": "8",
      "text": "This was a very enjoyable movie.  I personally think that it has a 90s action movie throwback feel to it.  It isn't the most realistic movie ever but if you allow yourself to just enjoy it for what it is then I found it to be an entertaining movie.  I'm also glad to see these guys back in action."
    },
    {
      "rating": "3",
      "text": "This film delivered less than it seemed to promise. I was left desperately wanting some classic Arnold lines, but for better or worse he seems set in establishing himself as an independent character.\r There is some entertainment value and I wouldn't recommend avoiding this film. I only say, after it is over you may ask yourself, could I have done something better with that 90 minutes of my life? Probably. But if you can't think of anything you can always give this film a try.\r Also you get to see 50 cent attempt to be a nerd."
    },
    {
      "rating": "9",
      "text": "Stallone and Schwarzenegger together in an action movie? Oh, heck yes! Even better than the team up is how awesome is the movie they are teaming up on. With a great plot, nice action, and some great one-liners this is one of the best movies I think either have been in. If you enjoy action movies, as well as enjoy Stallone and Schwarzenegger, then this is an action movie I highly recommend you check out. It's one that should be around the top of your must watch list."
    },
    {
      "rating": "8",
      "text": "I love Arnold movies. I was never really a Stallone fan, but he was good in this to and he's growing on me in recent years. I love the way Arnold is embracing himself and letting out his inner Arnold."
    },
    {
      "rating": "9",
      "text": "Escape Plan is a good action film. Having two of the most notable action heroes of the 80s and 90s in one movie is priceless. The movie outlines the danger of privatization and extra-judicial prison system. It draws some comparison with Guantanamo Bay Prison. A very enjoyable movie."
    },
    {
      "rating": "10",
      "text": "Great movie Stallone and Schwarzenegger make a GREAT TEAM!!! I LOVE IT!!! The film is interesting, and i never move because this movie is fantastic!!!"
    },
    {
      "rating": "10",
      "text": "Is a excelent movie i saw the trailers i like it i want to see the movie beacuse in Venezuela the movie has not arrived  I have to dowloand the movie i think that is't have to be very good"
    },
    {
      "rating": "5",
      "text": "Sylvester Stallone and Arnold Schwarzenegger alone could advertise this movie, and it's admittedly good to have them both on-screen, but Escape Plan tries to ravel in more cerebral plot which doesn't really work well nor does it have much depth in narrative. Script is sloppy, pacing is a bit clumsy and they soon revert back to the way of machine gun, which arguably might be the inherited charm they bring with them. This is a shame because these two of such fame deserve better material than the movie could provide.\r To its credit, it starts off pretty well as Ray Breslin (Stallone) is introduced as prison break specialist. He would voluntarily enter a prison to test its design and escape by taking advantage of its flaws. With his illustrious career, he is hired to test a highly secretive shadily illegal prison. Everything isn't what it seems in this semi futuristic prison where he meets Emil Rottmayer (Schwarzenegger) a fellow inmate who claims to know secret location of most wanted man. Cue in some conspiracy later; it transpires into menial action thriller.\r The events switch into slower pace later on, an ironic turn while the movie tries to churn clever ways to escape. It doesn't appeal much and frankly is inferior to many other similar movies with such premise. The tricks are dull, almost borderline implausible. The movie undoubtedly relies heavily on audience’s willingness to accept the nifty gimmicks and reception towards the duo combo. Plot twists are expectable, with barely any fresh idea in the mix. The pace is also rather uneven, it stutters when it should gain momentum and eventually just fades gradually more anticlimactic as it goes.\r Script is downright terrible, as if the two action stars are still using dialogues from two decades ago. This may be due to familiarity to said style, but they would merit from smarter writing. Hammy one-liners are uttered every few minutes to weakly sell the bravado. Screenplay feels sporadic; sometimes it seems to cut too fast or just doesn't explain much. At the very least, it does provide some chuckles, although they may be somewhat intentional yet serendipitously are the more memorable moments of the movie. Stallone and Schwarzenegger still possess big screen charisma to attract audience; they do need more witty scenes and less exaggerated machismo though.\r Escape Plan benefits from the stars duo and barely legitimate prison break premise, but its lack of thrill and slapstick script don't make for a compelling watch."
    },
    {
      "rating": "8",
      "text": "They put them in the most extreme jail ever. It`s a fun movie watching the old guys at again trying to get out.They keep the good movies coming. Critics just want movies similar to their lives witch is boring as hell.The rest of us have no interest in watching two people have tea by the window. If you like movies with people having tea by the window this is not for you.If you like movies with guys that would make the guy having tea spill it this is for you."
    },
    {
      "rating": "8",
      "text": "The content wise it is the same movie to all prison break theme, but\rthe characters were a bit modified. The new fashion in today's cinema\ris the twist at the opening as well at the end. So this movie had one\rlike that in both the portions.\r If you are a Schwarzenegger fan, you would disappoint a bit because the\rStallone rules whole show. I can say it was fairly balanced screenspace\ronly due to the capacity wise. Capacity comes under strength factor, so\rStallone had the upper hand and does justice. Schwarzenegger looked\rbetter than his last movie, especially with less wrinkles in his face.\r Good cast and good idea but lack of good stunt sequences and\rintelligent scenes. In a couple of scenes they show Stallone like\rvision Sherlock Holme had about the 3 dimensional structure of the\rsurrounds. It has been just imitated not the original. The Islamic\rcharacter in the movie as well included due to one reason and that is\rto find the position of their location. Otherwise the alliance would\rhave been only between Stallone and Schwarzenegger. That is why I was\rnot surprised by the elimination of that character.\r As the movie had great actors it was a little let down. Entertainment\ris guaranteed but visually not spectacular. Expected a better execution\rfrom the Swedish director. I believe he did not get a better crew\rexcept two iconic stars. It had a good commercial success, but won't\rremain in people's mind for a very long. If you are a fan of one of\rthese actors you would have a good time, but for others it is one time\rwatch and forgettable.\r 7.5/10"
    },
    {
      "rating": "8",
      "text": "This movie isn't like Sylvester Stallone's usual movies. There isn't a lot of action, but what there is a lot of interesting plot. Sylvester Stallone plays a guy who breaks out of prisons for a living. One day he's given a job to break out of a prison that is said to be impossible to break out of, but there's a twist. He's set up and treated like an actual prisoner and the only way out is to break out of the prison for real.\r The way the prison is ran is interesting and the way he breaks out is thrilling to watch. I would recommend this movie to anyone that loves action movies. My only complaint is that sometimes the dialog was a little cheesy and it took away from the tension of the movie. 88/100 B+"
    },
    {
      "rating": "6",
      "text": "A surprisingly good action film with a great 90's throwback feel.  Arnold and Stallone give two of there better performances in a long time.  Overall a good solid fun film.  B"
    },
    {
      "rating": "6",
      "text": "One's an action star who's still got plenty of action left in him, the other is Schwarzenegger. That pretty much sums up this action title. There's some decent action scenes and the ones involving Arine you can clearly see his double taking the hits. Stallone is the only one who saves this movie from becoming unwatchable, he's still has what it takes to keep you in your seat. As for Arnie, hit the gym running California has made him soft and doughy."
    },
    {
      "rating": "8",
      "text": "i have no idea whats wrong with the critics...its a really interesting movie..you dont really know how the main character is going to escape that prison....i recomand it..its not a perfect movie to want over and over and over again without getting bored of it but i loved it and i think i will watch it again some time."
    },
    {
      "rating": "6",
      "text": "“Escape Plan” starts out interesting but ends kinda generically.  However, that didn’t really hurt my overall enjoyment of the film.  While it’s not stellar, the movie is mildly entertaining.  Jim Caviezel is a great evil warden (when you can hear him…he whispers too much) and it’s clear that Arnold and Sly really enjoyed working together (Arnold looks like he’s having A LOT of fun playing his character).  The only issue I had was the film scrambles to resolve some plot threads at the end and the movie becomes a generic action film during the escape.  Still, it has its moments and wasn’t an entire waste for me."
    },
    {
      "rating": "6",
      "text": "it was great to see arnie and sly together for more than 2 lines and quick chat like in expendables 1 and 2 how ever this film just isn't what i imagined them doing but it does work  arnie does the one liners as always stalone plan and plots there escape and there is a fair bit of mystery but all in all its just simple and the title says it all not terrible and not great arnie and sly have ive course been way Better if only they teamed up when they were younger"
    },
    {
      "rating": "6",
      "text": "Although the film's plot is full of holes (to say the least) and is just, well, a bit dumb, it is never less than an absolute pleasure to watch Stallone and Schwarzenegger's scenes together. Escape Plan is simply a fun action-thriller offering a few especially memorable set pieces."
    },
    {
      "rating": "5",
      "text": "The Escape Plan feels like it has escaped a 1990's cutting room floor. The plot is weak, as are the characters (and acting in places) and has a budget feel to the main location.\r However the film is entertaining enough for a watch if you love your 90's good cop, bad cop films. There is an element of tongue in cheek, but not quite enough to convince you that they wanted this to be a fun film rather than a serious attempt at a film."
    },
    {
      "rating": "7",
      "text": "It was nice to see Arnie and Sly working together again in Escape Plan. This movie its really as action packed as you'd expect from these two. They do a little bit more talking then you expect, but its pretty hard to dislike. You even get a surprise ending that you won't see coming."
    },
    {
      "rating": "8",
      "text": "i liked this movie a lot. i believe critics were paid to rate this movie so badly. it definitely deserves a lot more than the metacritic score. it is an action thriller with lots of fun and suspense which will not disappoint you. its worth a watch!!"
    },
    {
      "rating": "8",
      "text": "This was a fun \"inverse-heist\" film about a professional prison-breaker (Stallone) who is illegally trapped in an unethical private prison.  The leads worked really well together, and the action & humor was nice.  You might know already more or less how things will turn out, but I enjoyed watching work through it."
    },
    {
      "rating": "1",
      "text": "Escape Plan is one of the worst films I've ever seen. Sylvester Stallone and Arnold Schwarzenegger may make a great team but it didn't work in Escape Plan because the acting was awful and the whole story and how it was executed was poor. This movie has spawned at least 2 sequels but if the original was crap then how can the sequels be any better? Lol"
    },
    {
      "rating": "7",
      "text": "Escape Plan was a surprisingly entertaining film. Sylvester Stallone and Arnold Schwarzenegger do a good job in carrying the predictable yet well executed plot. Their acting is as is expected in just about every role they've done but it fit the story well. There were also a couple of scenes that were absolutely hilarious, as they catered to the stereotypes that the actors have established over the decades of their careers. It felt a bit cliche at times but it was an overall solid film."
    },
    {
      "rating": "5",
      "text": "Escape Plan has very interesting setting, good start and after 20 minutes it gets progressively downhill. Original story with a lot of potential, were poorly executed!"
    },
    {
      "rating": "9",
      "text": "What a big surprise for me. I like this movie. The basic idea of the story is great and works on many movies, but this one has this background, that someone is working to escape from prison and not being busted unjustified.Arnie shows the best scene in his life. His acting to make a diversion in german was brilliant, great idea.CGI effects were just average and some action scenes were unrealistic. Otherwise I would give a 10."
    },
    {
      "rating": "5",
      "text": "Simplistic story loads of one-liners generic bad guys rampant torture, prison bad morality tale of course it a Stallone film. It's fun to watch to ageing action heroes age before your eyes."
    },
    {
      "rating": "5",
      "text": "Sly and Arnold are great together. I wish they would have done more movies together throughout there careers and you get the feeling they do too. It's funny and it's got some pretty great action. 50 Cent in the small dose of a role as a computer hacker is ridiculous..."
    },
    {
      "rating": "6",
      "text": "Maybe this movie isn't so intelligent, but It was fun to watch two great personalities in one, not so bad movie. In my opinion this is kind of good filmmaking and I'd like to watch Stallone and Schwarzenegger again, maybe even soon. I have to write about this movie, that's mediocre performance of acting but 115 min  going by fast."
    },
    {
      "rating": "6",
      "text": "\"Escape Plan\" 10 Scale Rating: 6.0 (Decent) ...\r The Good: It's not deep, but it's a fun film. The action sequences and parts of the plan itself were actually well done and interesting. The ending was worthwhile and wasn't as predictable as I expected it to be. For the most part, succeeds in what it sets out to do.\r The Bad: It's still a heartless film full of cheap thrills. While it ends up decent, there are enough groan-worthy moments to prevent it from actually being a good film."
    },
    {
      "rating": "4",
      "text": "i missed the beginning....can't imagine its anything though.....i feel like the warden was a well cast guy simply because of his past role as Edmond Dontez....this movie is  the best prison break movie that there will ever be i hope....that being said all that happens is you imagine yourself jumping into the ocean and trying to swim to freedom......the reason shawshank redemption is worse is hard to say"
    },
    {
      "rating": "8",
      "text": "Pretty decent action flick. Simple but enjoyable. A movie like in the good old days."
    }
  ],
  "recommendations": [
    "lockout",
    "the_mechanic",
    "skyscraper",
    "bloodshot",
    "the_fate_of_the_furious",
    "the_ice_road",
    "angel_has_fallen",
    "wild_card",
    "salt",
    "the_transporter_refueled",
    "mission_impossible_iii",
    "the_commuter",
    "seeking_justice",
    "contraband",
    "den_of_thieves",
    "honest_thief",
    "iron_man_2",
    "mechanic_resurrection",
    "the_losers",
    "the_equalizer",
    "wrath_of_man",
    "infinite",
    "furious_7",
    "the_marine",
    "the_a_team"
  ]
}