{
  "id": 3540,
  "title": "Escape from the Planet of the Apes",
  "starring": [
    "Roddy McDowall",
    "Kim Hunter"
  ],
  "runtime": 98,
  "genre": [
    "Action",
    "Science Fiction"
  ],
  "description": "The world is shocked by the appearance of three talking chimpanzees, who arrived mysteriously in a spacecraft. Intrigued by their intelligence, humans use them for research - until the apes attempt to escape.",
  "releaseYear": "1971",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/AnbLVdUEroTfHTUVAJCxkL4R0IH.jpg",
  "categories": {
    "plot": 6.666666666666667,
    "acting": 7.833333333333333,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 4.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "If you like dogs or cats, this franchise isn’t for you.\"Escape from the Planet of the Apes,\" like much of its original film series ('68-'73) is one of the most dishonest, slimy, unforgivable piles of garbage in movie history. This isn't because it kills off two \"peaceful\" chimpanzees in its last 5 minutes. It's because it spends the preceding 90 minutes trying to cuddle us up to these two rotten monkeys who are literally responsible for destroying the world. The fact that audiences kept falling in love with these ugly freaks is beyond pathetic. (And spare me the argument about humans being more evil: when you have smelly chimp protagonists who unleash a pet-killing virus--and who consider themselves better than humans *and* other animals/apes--it's easy to see the true villains.)The premise of this installment: Cornelius and Zira, snotty ape couple of the future, travel back in time to escape a monkey-vs-human nuclear war that they themselves set off, by committing heresy and triggering political unrest. Their time-traveling spacecraft had in fact belonged to a human, Col. Taylor (Charlton Heston) whom they supposedly loved even though they abandon him and steal his ship to boot...Anyway, after their bumble into present-day Earth, it's confirmed (by the next film) that these dirty monkeys are spreading around some mystery plague that soon wipes out the whole dog-and-cat population. This is what clears the path for apes to dominate society: first as cutesy pets, then as annoying slaves, and finally as idiot revolutionaries. Until this happens, though, ol' Corny and Zira are happy to keep smugly wasting time in \"Escape...\", evading responsibility while being coddled and pampered by a bunch of incredibly stupid humans who aren't worried about the intentions of two English-speaking, human-detesting apes from the future.On top of that, our alleged pacifist heroes end up killing and/or fatally endangering various other characters. These include: a fellow chimp who is strangled by a gorilla (after Cornelius and Zira provoke the gorilla with noise); a well-meaning orderly whom Cornelius kills just for saying \"monkey\" (and whose death is greasily insisted upon as being an accident)...and let's not forget that innocent ape baby, whom Zira and Cornelius fatally jeopardize to save their own.I repeat: an innocent ape baby whom they fatally jeopardize to save their own.Even if \"Escape...\" were at least half-decently written, directed, scored or acted, it'd still never make up for this grossly offensive plot point alone. The viewers who adore these two disgusting fleabags should be ashamed.As I suggested before, the killing-off of Corny and Zira is the one thing that makes all this trash remotely worth watching. I don't even care that their real baby survives at the end, and grows up in the next two films to become just as ratty and despicable as his parents. At least he gets his own karma too, ultimately.Good riddance to those pet-murdering, planet-ruining chimpies--and good riddance to Disney's reboot plan(?!) for this entire franchise. I hope it tanks harder than the careers of Roddy McDowall and Kim Hunter."
    },
    {
      "rating": "6",
      "text": "It's a huge step up from the previous sequel but still not on par with the original. I like the story a lot, I liked how hard the apes tried to convince the humans that they were responsible for how things turned out but as always, humans turned a blind eye to it and shifted blame elsewhere. The only thing I really disliked about the film was the ending, Which dragged on way too long and brought the pace to a grinding halt."
    },
    {
      "rating": "7",
      "text": "Good movie with a similar structure as the first one, but this time the apes came to the world of humans. There are some stupid scenes, for example the explanation how the 3 apes escaped from the future. And the characters were boring and onesided also. But the movie entertained somehow and have some good social critics. The movie shows also some political sides, what I liked. Anyway it was more interesting to discover the world of the apes."
    },
    {
      "rating": "6",
      "text": "Escape from the Planet of the Apes completely changes the idea of    the franchise. Transferring the action to modern times at the time of filming looks not like a triquel, but as an attempt to extend the life cycle of the series. And although Escape from the Planet of the Apes is the best part of the franchise, I personally liked it the least. For everything for which I watched the first parts of Planet of the Apes is mostly absent here"
    },
    {
      "rating": "8",
      "text": "Taylor's take on this advanced species may not be perpetually competent, but is a pedigree to mature entertainment itself.Escape From The Planet Of The ApesTaylor's take on this advanced species may not be perpetually competent, but is a pedigree to mature entertainment itself. The concept is a mature taken on human nature peeled skin by skin with a sci-fi twist of time travelling ingredient that spices things up. The first half of the tale is intriguing and gripping that moves fluently with adaptive and absorbing narration with both humor and fascinating characteristics displayed about characters in order to lure the audience in. And if first half is taken lightly, the second half is equally intense, with slow pace, mature conversation and revelations and nail biting close calls.And it is one of those things where you are worried about these extremely likeable characters that something will go wrong. And the makers being aware of it, uses that crisp tense environment to keep us at the brisk of our emotions. And on that uncertainty of the trajectory that the makers are about to follow, it is a complete triumph. And as usually such new species does, the innocence is what draws out most of the emotions and with a compelling storytelling and moving characters, the objective is jaggedly on mark. McDowall as a mature overprotective and more grounded to the practicality is convincing but Hunter's more human and emotionally fueled character steals the show.With a heartbreaking final act, the franchise manages to answer the big and essential questions raised in here, that shows the surrender of a species to fear, thirst and unawareness of the horror that it can capture and project. Taylor's vision has a certain tone that is soothing and poignant at the same time which he has managed to keep it balanced. Escape From The Planet Of The Apes is a forward pass to this franchise on a more similar direction but it is also pushing its boundaries."
    },
    {
      "rating": "7",
      "text": "Создатели наверное увидели свои ошибки. И решили сделать зеркальное отображение первого фильма. Эта идея оказалась более выгодная для самого фильма. Приятно наблюдать за сюжетом который въется вокруг Корнелиуса и Зиры. Но были и заметные проседания сценария и растягивание хронометража картины. В целом не плохо."
    },
    {
      "rating": "7",
      "text": "This movie reprises some of the social themes that were crucial in the original film, but now with the same pathos and intensity."
    },
    {
      "rating": "8",
      "text": "A very good sequel.'Escape from the Planet of the Apes' is a clear improvement on (the good) 'Beneath the Planet of the Apes' and isn't that far adrift from the 1968 original. The plot is out there but they make it believable, while the ending is quite something - unexpectedly so!Neat to see Roddy McDowall return to his role from 'Planet of the Apes', while co-star Kim Hunter continues once again. I like those two characters so enjoyed seeing them become 'the stars' of this third release of the franchise.Onwards to 'Conquest of the Planet of the Apes'."
    }
  ],
  "recommendations": [
    "voyagers",
    "alien_covenant",
    "godzilla",
    "dawn_of_the_planet_of_the_apes",
    "smallfoot",
    "deep_impact",
    "the_legend_of_la_llorona",
    "tears_of_the_sun",
    "greenland",
    "goodbye_world",
    "settlers",
    "the_titan",
    "prometheus",
    "the_space_between_us",
    "k_pax",
    "alien_resurrection",
    "dominion_prequel_to_the_exorcist",
    "the_rhythm_section",
    "snowpiercer",
    "the_midnight_sky",
    "exodus_gods_and_kings",
    "star_trek_first_contact",
    "annihilation",
    "constantine",
    "munich"
  ]
}