{
  "id": 90,
  "title": "Escape Room: Tournament of Champions",
  "starring": [
    "Taylor Russell",
    "Logan Miller"
  ],
  "runtime": 88,
  "genre": [
    "Horror",
    "Thriller",
    "Mystery"
  ],
  "description": "Six people unwittingly find themselves locked in another series of escape rooms, slowly uncovering what they have in common to survive as they discover all the games that they've played before.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jGYJyPzVgrVV2bgClI9uvEZgVLE.jpg",
  "categories": {
    "plot": 4.153846153846154,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 4.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The first Escape Room film was an out of left field surprise when I caught it in theaters, one of the better original PG-13 thriller of recent years, and, initially, it's ending teaser for a sequel bummed me out. I'm glad to report the follow up, ESCAPE ROOM: TOURNAMENT OF CHAMPIONS, is a fun distraction for an afternoon that is a elevated by it's wacky escape room ideas. The acting on display is of quality performances for the B-movie that it is, and the writing isn't fantastic but nothing to complain about. All in all, I enjoyed this one about as much as the last one, and, honestly, will definitely be watching the third one, though I admit it was taxing it's milage with this second one."
    },
    {
      "rating": "6",
      "text": "Not as horrible as I thought it would be, though it feels rushed, lacks character development and has a dumb underlining subplot. The best part, the creative escape rooms."
    },
    {
      "rating": "7",
      "text": "Me pareció más entretenida que la primera, hay más ingenio en el diseño y mecánicas de los cuartos, de ahí no hay nada más que decir"
    },
    {
      "rating": "6",
      "text": "I mean who doesn't love a tournament of champions?! Am I right or am I right!?! When the sequel to the 2019 movie named after a social gathering fad came out, you know my antennae perked up. Escape Room: Tournament of Champions was released this past weekend and I had to see it. I wished it was on HBO Max or some other streaming service, but I risked the theater world. For those of you who did not see Escape Room, this sequel is about 6 people who unknowingly find themselves locked in an escape room of death once again. The group slowly uncovers what they have in common in order to help themselves survive this deadly game. This time our star Taylor Russell, as Zoey, finds herself joining forces with a few more survivors of the Minos' Escape Rooms. I know you're intrigued.Based on our review of Escape Room - \".... For the horror/thriller/suspense fans... 7... Its an average movie with a knock off of the Saw movies but not gory... You can wait to see this on Netflix... The rooms are ok... Character development was pretty lame and stereotypical character types from all movies like this\" - this still rings true. This is almost exactly right again except I may know why this time. Escape Room: Tournament of Champions is rated PG-13 and it truly shows. Obviously, they are pandering to the teen crowd that wants to get to the movies without their parents. The series is missing out on a solid bit of umph without the freedom of an R rating. I'm not saying movies need to be gory, horribly violent or tons of cursing, but I feel like The Conjuring series has found a way to be scary and classy at an R-rating. In fact, I'm surprised The Conjuring series has the R designation because Escape Room makes The Conjuring look like The Exorcist. In fact, The Fear Street trilogy just released on Netflix found a way to be rated R but still teen appropriate (well part 1- 1994 got a little gross but the others for sure). Anyway, the movie was intense but lacked a seriousness or shock factor. I'll put it like this - acid on the skin should look like you got a little hot grease pock on you. We all drop something in hot oil too fast and got one of those pocks and that's not horror.Nevertheless, I digress. Tournament of Champions furthers the story that Escape Room left off on. Literally, the movie legit did a recap for you. If you were even thinking about it, you really don't even need to see the first movie to see this flick, which is kind of helpful. In that way, it doesn't make any sense because now a viewer doesn't even feel the need to see what they may have missed in the first part. Beyond that, the story is a bit too obvious in this one, but I will say the twist was nicely displayed, even though you may have caught on. Even though this movie feels basic, I'm still strangely ready to see Escape Room 3: Revenge of the Architect (I made that up but I like it). The movie lacks character development for the full group and that's even harder to say after the first movie. We really have no clue about these fools other than Ben and Zoey. But I really do care if Zoey and Ben survive, or not. Unfortunately, while we don't know who will return, we do know Zoey isn't dying and that's slightly a bummer because I want to feel like there's some fear she might not survive. The first movie had that but this sequel lacked that completely. While the rooms this time were different and slightly interesting, the whole thing felt rushed. Viewers are sped through the strife and maybe that along with the PG-13 rating really holds back the movie building any terror. Ah well.Escape Room: Tournament of Champions is a walk in Central Park at 10pm during the summer. It used to be scary back in the day, but it's a bit safer now but still keep your head on a swivel just in case. The movie is perfect for a Saturday afternoon FX flick or a streaming service. If you're looking for an anxiety-inducing, blood pressure raising flick that lacks depth, this is the movie for you. Put it on in the background and jump in and out during the games, watch this. If you're thinking should I go to the theater... do not spend more than matinee money if you're desperate for entertainment. Best suggestion is to wait because this will be on a streaming service in short order for free."
    },
    {
      "rating": "1",
      "text": "I wish I could've escaped watching this boring and bloodless PG-13 puzzle borefest - 1 star"
    },
    {
      "rating": "1",
      "text": "What bothered me the most was that in the trailer the dude says “what is this, some sort of tournament of champions?” And in the film some girl says it. So they used two different takes for the movie and trailer. Idk"
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "2",
      "text": "This should have been the last movie. Being lured on a plane fake or not is not very realistic compared to every room prior in both movies. The amount of people on the plain turned that last seen in to a potential mass murder."
    },
    {
      "rating": "7",
      "text": "There's no shame in being able to turn your brain off for 90ish minutes and be entertained."
    },
    {
      "rating": "0",
      "text": "While the first film was tolerable fun, This second film is just garbage. The plot is simple, rushed, and takes yet another convoluted turn at the end. The forgettable characters, lack of character development in general, and weak cast bring this film down even further. I was bored within the first 10 minutes and nearly fell asleep a couple of times watching it."
    },
    {
      "rating": "6",
      "text": "Tournament of Champions is unbelievably dumb, lathered in hazardous plot holes and is bereft of any intelligence whatsoever. Tournament of Champions just so happens to also be a hugely entertaining romp, pumped full of intense popcorn thrills with a lavish glossy look to boot."
    },
    {
      "rating": "5",
      "text": "This is lowkey becoming my guilty pleasure franchise. It’s a PG-13 Saw with bad acting and insane plots, but the puzzles are fun. If you know what you’re walking into there are worse ways to spend 90 minutes."
    },
    {
      "rating": "1",
      "text": "This is honestly one of the worst movies I have seen in my life. It is basically Saw for 11 year olds. This movie is not even comically bad. I fell asleep during the “climax”. That should never be the case. If nothing else, the climax should be the most interesting and engaging moment. This movie is nothing more than an advertisement for the escape rooms — a horrendous one at that. Save your time, money, and/or energy and watch something worthwhile."
    },
    {
      "rating": "7",
      "text": "First one was better - here I did like the rooms and all that, but the ending, some of it felt rushed and the twist at the end didn't hit so hard because of it. Still was enjoyable."
    },
    {
      "rating": "5",
      "text": "It's basically the same movie but with enough different situations to justify calling it a sequel.It advocates for the same stuff that people liked of the the first one, and still leaves undeveloped the elements that could make it a little more substantial.How fair is it to ask for that in a film that only seeks to entertain with a frenzy pace and style? Maybe not so much, but that doesn't mean re-packaging an identical product and just changing the wrapper to try to sell it as something new.That happens a lot in the horror genre, and is to be expected. Those formulas always seem to work.The simple fact that the ending is a cliffhanger for a third film makes it clear this franchise is very happy with what it offers.What remains is the responsibility of the viewers."
    },
    {
      "rating": "4",
      "text": "Escape Room 2, é melhor que o primeiro so nas escape rooms, um final e roteiro mal escrito e personagens que morrem e não fazem falta."
    },
    {
      "rating": "6",
      "text": "I was excited for the sequel after watching first part. Wanted to see what new are they gonna do but I was little bit disappointed. Movie had nothing new and exciting in it. It looked like same as previous one, only previous one was full of surprises and exciting.From the beginning only you know when the game is starting and you can also predict what's gonna happen next. Also, I watched blu ray version and got to know that it was different from theatrical cut, which confused me as it may make me difficult to understand the sequel (if any).Overall, it was a normal sequel which is just for entertainment and nothing else."
    },
    {
      "rating": "5",
      "text": "Girl and guy who survived the first escape room, return to confront the company behind it but end up in another escape room with other winners before there's a convoluted story between the puzzlemaker and his daughter revealed."
    },
    {
      "rating": "4",
      "text": "Sillier than the first installment. The story is searching for.. the story. There is none. It's running, screaming, solving puzzles with absurd clues. The elapsed time is never film time, sometimes faster, sometimes slower. Even the last part is ludicrous. There's so much that can not be made in the real world, that it's credibility is out of the window in the first few minutes. There nothing which made us feel that we should care for the players of this game. They don't care much themselves if someone dies."
    },
    {
      "rating": "1",
      "text": "La primera película me gustó bastante y me dejo con ganas de ver una futura secuela. Pero esta secuela es un espanto de película, a medida que avanza la película se hace aburrida y absurda."
    },
    {
      "rating": "4",
      "text": "The main part of the movie - the rooms - were interesting and suitably creepy. The acting was OK (the main actor is mostly expressionless). The story was ridiculous but I did like the coverage of the people behind the rooms. Surprisingly, the music really got me into the zone.Unfortunately, it all falls apart at the end of the movie. Most of the story so far is thrown out in favour of a quick and cheap setup of a franchise/universe. The end credits also have the most garbage music I've ever heard.You'll probably enjoy this just as much if you watch the escape rooms and fast forward through the rest."
    },
    {
      "rating": "6",
      "text": "Escape Room: Tournament of Champions is significantly better than its predecessor, but still struggles with a weak script and uninteresting characters. I found the rooms to be much more interesting and well thought out this time around, and I found myself pretty engaged and on the edge of my seat at times. Very entertaining and easy to sit through, but nothing special or at all memorable."
    }
  ]
}