{
  "id": 2779,
  "title": "Eternal Code",
  "starring": [
    "Scout Taylor-Compton",
    "Richard Tyson"
  ],
  "runtime": 105,
  "genre": [
    "Action"
  ],
  "description": "A researcher's family is kidnapped after she leads efforts to withdraw her company from a collaboration. With everything on the line, only her teenage daughter can save the family with help from a suicidal veteran and a prostitute.",
  "releaseYear": "2019",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/k2BotDix7KZtgFqswfaZifiBDfC.jpg",
  "categories": {
    "plot": 9.333333333333334,
    "acting": 9.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "i can say ,this is something especial .I hope you can watch, and after you do that, please review this amazing movie,and be pleases to leave a 10 as i did. This way ,all of us can make a difference , the difference that puts something special at the top, not all of those crappy movies that gives you nothing but a truly time-wasting !"
    },
    {
      "rating": "10",
      "text": "WOW, what an amazing movie, the story starts getting better and better, such a beautiful story, with so much touching moments, amazing soundtrack."
    },
    {
      "rating": "9",
      "text": "Really solid story and better than average acting.  Expected a little more Sci-Fi but the action and suspense made up for it!  Didn’t recognize some of the characters until I looked them up but a pretty sweet cast with a history of good work.  I was going to give it a b+ but knowing it’s an independent film I added a little because this wasn’t a 20 million dollar budget and it kept me interested until the end, so I give it an A-"
    }
  ],
  "recommendations": [
    "oz_the_great_and_powerful",
    "oblivion",
    "alita_battle_angel",
    "tron_legacy",
    "john_carter",
    "edge_of_tomorrow",
    "the_three_musketeers",
    "passengers",
    "the_illusionist",
    "aquaman",
    "gemini_man",
    "tomorrowland",
    "eternals",
    "the_last_witch_hunter",
    "now_you_see_me",
    "gods_of_egypt",
    "the_lucky_one",
    "twelve_monkeys",
    "hercules",
    "the_chronicles_of_narnia_prince_caspian",
    "glass",
    "pan",
    "the_debt_collector",
    "triple_frontier",
    "jumper"
  ]
}