{
  "id": 300,
  "title": "Eternal",
  "starring": [
    "Conrad Pla",
    "Caroline Néron"
  ],
  "runtime": 107,
  "genre": [
    "Drama",
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "Detective Raymond Pope is a detective of questionable morals, searching for his missing wife. His investigation leads him to the wealthy estate of the enigmatic Elizabeth Kane and her young maid Irina. Under Elizabeth's fascinating looks and aristocratic manners hides a terrifying secret,shared by her companion Irina. As Detective Pope finds himself perversely drawn to the powerful Elizabeth, bodies begin to surface, his inquiries only deepening the mystery surrounding Elizabeth's past. Pope's obsession grows so intense that he completely fails to anticipate Elizabeth's reaction to his intrusion into her dark world, a fatal mistake that might cost him his life and the lives of those close to him.",
  "releaseYear": "2004",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1jhHwF0sMoi8fcmiZh1TAFfG7vF.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 7.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Great looking film. Guilty pleasure."
    },
    {
      "rating": "9",
      "text": "Very powerful portrayal of a very scary woman. This is the best looking film of its genre I have seen in a very long time. The detective is a jerk, but I think that's the point for the payoff. Caroline Neron is amazing as the evil Countess Bathory. Or is it Countess Bathory? One wonders.... go see this for sure!"
    },
    {
      "rating": "9",
      "text": "Absolutely steamy, erotic thriller. Not a campy slasher movie, but a serious cat-and-mouse mystery with a Basic Instinct kind of heat."
    },
    {
      "rating": "10",
      "text": "Too hot. Way sexed and crazy stuff. Caroline Neron is awesome as a killer. What's cool about this is that it's a really good mystery and every part of it is good."
    },
    {
      "rating": "5",
      "text": "Very VERY underwhelming, most of it is just talking, and even with all that talk the characters arent fleshed out.Theres asian girl, kid girl, irish superman, deaf person, black gay guy, chinese man Who is BARELY ON SCREEN!"
    }
  ],
  "recommendations": [
    "freaky",
    "seed_of_chucky",
    "i_know_what_you_did_last_summer",
    "kick_ass",
    "mean_girls",
    "terrifier",
    "red_riding_hood",
    "night_teeth",
    "knock_at_the_cabin",
    "case_39",
    "i_spit_on_your_grave",
    "mama",
    "the_hot_chick",
    "bride_of_chucky",
    "fright_night",
    "little_monsters",
    "machete",
    "leprechaun",
    "friday_the_13th_part_iii",
    "friday_the_13th_the_final_chapter",
    "superfast",
    "magic_mikes_last_dance",
    "beverly_hills_chihuahua",
    "black_snake_moan",
    "tall_girl"
  ]
}