{"id": 1364, "title": "Eternal Sunshine of the Spotless Mind", "starring": ["Jim Carrey", "Kate Winslet"], "runtime": 108, "genre": ["Science Fiction", "Drama", "Romance"], "description": "Joel Barish, heartbroken that his girlfriend underwent a procedure to erase him from her memory, decides to do the same. However, as he watches his memories of her fade away, he realises that he still loves her, and may be too late to correct his mistake.", "releaseYear": "2004", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/5MwkWH9tYHv3mV9OdYTMR5qreIz.jpg", "categories": {"plot": 8.821428571428571, "acting": 8.774193548387096, "ending": 5.75, "soundtrack": 10.0, "cinematography": 8.5, "familyFriendly": 3.0, "funny": 8.666666666666666, "action": 10.0}, "reviews": [{"rating": "10", "text": "This movie was amazing! I loved the characters and I thought it was a refreshing change of romantic comedy.  It really toughed base with the meaning behind a thoughtful relationship between one really odd couple. This movie really does express the meaning behind two opposites attract."}, {"rating": "9", "text": "It was the most powerful film in my entire life that really made me to have its dreams in nights and was a brilliant idea for more directors. HUMAN MIND... watching 1 time is really unfair."}, {"rating": "9", "text": "I had a chance to see this movie again in 2008 for only the second time. I saw it in the theater when it premiered 4 years earlier. What a piece of art! This movie goes deep into the heart of romantic love. It's not a love story, it's an internal examination of what love does to your mind. It's painful to watch at times because it dissects what most of us try to repress most of the time. But, if for just one moment, you allow yourself to \"get into\" this movie, you will have a deeper experience than you've ever had while viewing movie. Darwinian thought (as well as just about any religious thought) tells us that procreation is perhaps the most important of our human functions. Romantic love leads us in that venture and this movie delves into the most sensitive areas of that process. This film could have easily felt pseudointellectual had it not been for the way the film was shot. It looks like it was filmed inside someone's head - clausterphobic, impressionistic, etc. - all in the right balance."}, {"rating": "10", "text": "A perfect concept wrapped around great performances.  Kate Winslet, as usual, is spectacular.  Anybody who has been in a relationship full of hills and valleys will appreciate this movie and shed a tear or two by the end.  A movie to be filed under \"original and thought provoking\"."}, {"rating": "10", "text": "There are those movies that provide you with two hours of mind-numbing entertainment, and then there are those movies that can change your view on life and human emotions while still providing you with two hours of entertainment. This movie belongs to the latter category."}, {"rating": "10", "text": "This is one of my favorite movies without a doubt.  I never tire of watching it.  Jim Carrey and Kate Winslet are absolutely terrific together and I cry every time I see it.  There is very little wrong with the film."}, {"rating": "10", "text": "Easily, 2004's best film. Charlie Kaufman delivers us his best script yet, Kate Winslet's amazing acting is probably the biggest highlight of the movie and surprisingly Jim Carrey's acting is not that horrible.although the film is pure beauty it seems rather cheap for a 20,000,000$ movie."}, {"rating": "10", "text": "This film is wondrously creative, entertaining, clever and thought-provoking. It's based on an interesting premise, it's artistically shot and edited, and the story is told in an ingeniously innovative way. But this isn't half the reason it's so good. At it's heart, it's a brilliantly acted bittersweet love story that avoids all cliches, feels uncannily real and ultimately engages the viewer emotionally on so many levels (which is rare for a Kaufman film, despite the guy's obvious artistic talent). I know a lot of people don't like Jim Carrey that much because he's been in a lot of rubbish stuff, but the guy can certainly act when given the opportunity, and Kate Winslet is simply brilliant. Together they make a wondrously believable couple that I've never stopped to question for an instant. Overall, one of my favorite all time films and an amazing cinematic achievement. Don't miss out on this!"}, {"rating": "10", "text": "Please do not be scared of this film by those ignorant reviews saying that this film is \"too artsy\" or \"to complicated\". That is absolute bulls**t. This is one of the best films I've ever seen so I strongly advise everyone to watch it."}, {"rating": "10", "text": "This was just a delight. It was clever, it was original and it was downright emotional on so many levels that that  have made this a timeless classic.\rEternal Sunshine tells the story of socially awkward Joel (Jim Carrey), who is detached from his surroundings and everything going on around him, until he meets Clementine (Kate Winslet), a confrontational and free spirited woman who he immediately hits if off with, simply because their worlds couldn't be further apart.\rThe film is told in a very much non-linear fashion, and this is set up through the apparent break-up of the happy couple, Joel soon learns that Clementine has forgotten who Joel is, she did this through getting her memory of him erased by Lacuna, a company which deals in this.\rJoel eventually decides to do the same thing and is told the process is done while he sleeps.\rWhat follows is the true shining moment of the film, as Joel visits happier times with Clementine, to which we soon realise all is not as it seems.\rThe supporting cast includes Mark Ruffalo and Elijah Wood as technicians who carry out the erase part, Kirsten Dunst as the Lacuna receptionist and Tom Wilkinson as the Lacuna doctor, Howard Mierzwiak.\rThese characters, however, hold their own unique secrets and revelations that truly create a wonderful piece of cinema.\rJim Carrey and Kate Winslet are simply fantastic as Joel and Clementine and it was wonderful to see these two step out of their comfort zone, Carrey the awkward and unfunny man, and Winslet the free and crude woman. The messages which are put across heighten the beauty and dramatic context of the film that never lets go of the wheel.\rThe pace of the story may leave some confused, but this is where the film truly becomes unique, there are so many elements of surprise and so many heart wrenching moments that succeed in creating a truly unique masterpiece, full of colourful scenes and artistic filmmaking that push the film further than many other love stories.\rIts not surprising for many to say that this is one of their favourite films, there is enough drama to last a lifetime and enough talent to surpass your expectations in this flawless gem."}, {"rating": "9", "text": "Marvellous! Jim carrey proves us than he can be more than a clown. The plot is creative. I can't believe that we were waiting for something as awful as 'the green lantern'' from Gondry afterward, such a waste of talent."}, {"rating": "10", "text": "There are so few perfect movies.  This is one of them.  One of my all time favorite movies.  So funny yet intelligent and romantic.  It gets better every time you watch it."}, {"rating": "10", "text": "This is by far the best movie of 2004, and one of the greatest films of all-time. Jim Carrey and Kate Wislet share a magnetic bond that evolves way past the usual chemistry in movies. They are absolutely amazing, and they were both robbed of should-be Oscars. (especially Carrey, who wasn't even nominated) This film will forever be remembered as one of the films considered a true classic from the new era of 2000 and on. Brilliant."}, {"rating": "10", "text": "Probably the most accurate, brutally honest dissection of what it is to be in love ever put to film. The concept behind the film may sound gimmicky, but it really is implemented brilliantly. A masterwork for all involved."}, {"rating": "10", "text": "This movie is a heartbreaker. Probably the most beautiful movie I've ever seen. Fantastic acting. Interesting story. Great soundtrack. If it doesn't move you, then you've never been in love."}, {"rating": "9", "text": "Just spellbinding. It's a while to build up and the wait is worth every second. Michel Gondry's direction is on top-form and brilliantly accompanied with a beautiful score and a precise screenplay. The story seems to go off astray but for some reason, that's one of its best qualities. Jim Carrey is at his best since The Truman Show and thoroughly gives a performance that will be remembered for years. But the carpet from under his feet is Kate Winslet who delivers yet another monumental performance. This is my favourite role she's played because she played someone modern and she was funny at times. PLEASE, more Kate Winslet comedies. I rather liked Kirsten Dunst as the quirky receptionist who quotes Alexander Pope but underneath lies a secret unbeknownst to her. This is probably the best film of 2004 and one of my favourite films of all time."}, {"rating": "9", "text": "Did you ever fall in love so deeply and then you just broke up with her/him? That is the feeling you got from watching thiz film. The feeling about how you fall in love with her, and later you realize that time would never come back again. Starred by Jim Carrey, Kate Winslet, Mark Rufallo, and Kirsten Dunst. Directed by French Director, Michel Gondry. Gondry is one of the directors who always brings  some absurd stories as his features (such as: THE SCIENCE OF SLEEP (2006), that also I like very much). The story is about how you dreams your past and you can actually feel it as just happens at the present time. Sometimes it happens based on what you remember. Thiz is interesting  part, in one of the scene, the two characters (Carrey and Winslet) had interaction with each other but they surrounded by people who had plain/blank face, coz the Carey character don not remember how the people look like, so the scene describes it people with plain/blank face. Director was so lucky to got Carey and Winslet in appropriate time, Carey just desperately wants some serious drama beside his role always known as comedian, and Winslet wants to prove her truly acting skill after TITANIC (1997). Thiz Movie maybe not contains an extraordinary storyline, but can effectively reflects very well the description about how the event occurred.\r Visit My Blog on JONNY'S MOVEE : http://jonnyfendi.blogspot.com"}, {"rating": "9", "text": "\"Eternal Sunshine Of The Spotless Mind\", blessed with director Michel Gondry's innovative creativity and vision, is a sad, sentimental, but a beautiful film as with excellent performances from Jim Carrey and Kate Winslet does the movie dive into memory, heartbreaking break-ups, and the ever-prevailing ultimacy of love for those who are troubled with and wanting to get the good memories with each other erased and move on."}, {"rating": "8", "text": "There is no way anyone could deny just how unique, clever, and original this movie is. The story and the characters are just so fresh, and while I don't think the movie is as ingenious as everyone proclaims, it is certainly a fine piece of cinema."}, {"rating": "7", "text": "Eternal sunshine of the spotless mind is a story about a couple who obviously don't get well with each other and so the women goes to a doctor who can erase her memories of the men. When the men learns about that he wants to do it too. It is an interesting idea but in the beginning the film is too complicated, strange  rare and hard to understand which will confuse many people. Jim Carrey and Kate Winslet were amazing and that surprised me as I am used to see Jim Carrey only in comedies. The cinematography is amazing as well as the direction of that film but it is a little bit confusing which is something I really didn't like. Yes it it touching and passes the message that we have to give a second chance to some people. But it is still over complicated for the kind of these films yet it is a new idea."}, {"rating": "10", "text": "An imaginative and unique work of art. This films cast delivers their comedic dialogue perfectly, along with stunning imagery and visuals, phenomenal acting, touching and heartbreaking moments, a breathtaking soundtrack, and a masterful script. With its unclear ending and its \"easter eggs\" that you find throughout the film, \"Eternal Sunshine\" has you asking questions and coming to conclusions the likes of which may go forever unanswered. The abundance of melancholy in the air just makes the movie so much better. The characters are some of the most personable and lovable characters I have seen since \"The Perks Of Being A Wallflower.\" Their personalities consist of many traits that are noticeable, but one of those traits is over exaggerated to the point of making seem like caricatures, which makes their problems seem so much more important, making them so much more relatable, making them seem like long lost family members, which makes their emotions just so important to you. Emotional preparation is mandatory before watching this film. There are some scenes that just break your heart, it's just called good filmmaking. This beautiful film has put it's mark on cinema forever and will be always known as an instant classic. Its a masterpiece."}, {"rating": "10", "text": "Possibly the greatest romance movie ever. Incredibly touching, with a well thought out plot. This movie makes you think, It makes you relate, even if you don't want to. Jim Carrey and Kate Winslet put on a performance that is outstanding, you don't even question their mismatched relationship because its so authentic. A must see movie for everyone."}, {"rating": "9", "text": "Eternal Sunshine of the Spotless Mind shows all of us that even Jim Carrey could need a little more starring to it. Regardless because this is one of those drama/romanace stuff and somehow Jim Carrey turned some of the scenes to a magical work of comedy."}, {"rating": "10", "text": "Would you delete the memory of someone, that you loved and was happy with, because your relationship ended and it seems you won't spend your life together as you imagined at first? A movie, that you can not fully understand and unravel from a first watch. Simply brilliant! :)"}, {"rating": "10", "text": "Perfect and TOUCHING. One of my most favorite movies ever. The message is incredible! Never gets old for me and something new is uncovered to me every time I watch it. The soundtrack is absolutely beautiful too! I've watched this probably 10 times, and I'll watch it the next time it comes on too."}, {"rating": "10", "text": "This is the perfect love movie. In every way it is perfect and clever. And I generally hate love movies, but twisting the genre into this is just a majestetic achievement. It's crazy, sad, beautiful, funny and full of love; what every love movie wants to be, but only \"Eternal Sunshine Of The Spotless Mind\" is."}, {"rating": "10", "text": "Eternal Sunshine of the Spotless Mind is a heartfelt, funny, emotionally powerful, original, heartbreaking, piece of art. It features great performances from Winslet and Carrey, and offers a nice, sweet, fresh, twist on a regular romantic comedy. I give this movie 96%."}, {"rating": "10", "text": "This may be my favorite film ever. Perfect casting, perfect direction, perfect writing. Clementine: My crotch is still here, just as you remembered it. Joel: Yuck!"}, {"rating": "10", "text": "This film is one of the best movie I have ever seen in my life. and in any way is not Analogous with \"being john Malkovich\" and any other memory and Mind and Remembrance movies. Thanks for your rating."}, {"rating": "10", "text": "Perfect. Favourite movie of all time. Showing a deeper and brilliant side to Jim Carrey that is lost with most of his hollywood comedies. Kate Winslet played the eccentric and irrational role of Clementine amazingly. Clever and thoughtful."}, {"rating": "6", "text": "The concept for Eternal Sunshine is simply incredible. Unfortunately, the narrative isn't. The love story should feel genuine, but it never gets fully fleshed out due to subplots that constantly get in the way of Joel's (Jim Carrey) story arc. However, with strong performances from all cast members, interesting visuals and a great soundtrack, Eternal Sunshine of the Spotless Mind is worth a watch, at the very least."}, {"rating": "0", "text": "One of my least favorite movies ever. The message is stupid. Watching it once was painful enough. All the actors should kiss their careers goodbye. I hated everything about it."}, {"rating": "2", "text": "yes it was a very different and artsy and yes i does have a fairly important message at the end which is rather hackneyed but still even if i concede all that it still isn't a good movie, because a good movie entertains and this never really entertained me. I never wondered what happened in the beginning, and when i found out it was anti-climactic even though i didn't care."}, {"rating": "10", "text": "Kaufman is a genius, nuff said."}, {"rating": "10", "text": "Only saw it last week... had been on my to watch list for too long. Very impressed though."}, {"rating": "10", "text": "My current favorite film. An intriguing story about relationship, the good and the bad. All those reviews in here that \"didn't get it\" or hated it, you're entitled to your opininions, but I'm sorry for you that you missed out on a great movie."}, {"rating": "10", "text": "Another classic of our time. There has never been another like it, nor will there ever be again. The elements conspire on this one to create something that leaves you not entirely sure what kind of movie you just watched- and loving it. Yes, it's funny, but never slapstick. Yes, it's dramatic, but it never goes Deep End of the Ocean. Yes, there are fantasy elements aplenty, but somehow it feels natural, as if the events just fit within the world of the film. There's even a mystery element, leaving you slightly confused until ut all comes together at the end. It has a slightly Donnie Darko-like quality in this way- somehow it feels like somewhere you missed something, and you have the urge to rewind and see what it was. Once all the threads are tied up, you're left with an \"aaahh\" sense of completetion. Complex characters, never dismissing development to focus on the more quirky elements of the film, never letting you get lazy as a viewer. No one character is a runaway favorite as each is flawed in the way they are supposed to be. One of the few movies that pulls off the darker, more morbid aspect without laying it on too thick. Outshines it's \"cousin\", Being John Malkovich, by a mile. My only critisism is possibly cramming just a leetle too much in there. Not enough to forfeit a point, though."}, {"rating": "10", "text": "Quite possibly one of the finest films ever made. Heart-wrenching and sweet all in one. I watch this DVD at least once a week and it never gets old. Considering my hatred of Jim Carrey, this is a remarkable and surprising use of his talent."}, {"rating": "10", "text": "Typically confusing, but sadly enjoyable. It really is a confusing movie but the vibe that it gives off...its very unique. Its not bad, but after rewatching another time, its not THAT comfortable. The way i recommend anybody watching it is: watch it late at night, peacefully, relaxing and let the take you in"}, {"rating": "10", "text": "Beautiful and touching. Very creative."}, {"rating": "10", "text": "To bad there are only fiew of such films.. The abstractism should predominate into more movies, because there are less people who understand them, but they could understand more, why not?"}, {"rating": "1", "text": "Boring is the main word. So much \"why should I care\" moments and \"Oh my God when is the ending coming\" times as well. Another of the thousand times when Hollywood tries to impress us with \"art\" instead of entertainment. Movies that are worse than this are anything made by Wes Anderson."}, {"rating": "0", "text": "Wow did this movie suck. I walked in thinking it would be the cinematic experience of my life from all the great reviews I read. Guess what? IT SUCKS!!!! I felt absolutely nothing for the characters. I wanted them all to forget each other so they movie would END! Carrey, Carrey, Carrey, when are you going to learn that you cannot act at all. Go back to comedy and make us all happy. All the other performances felt forced and fake. Whoever tells you this movie is complex is a totaly dumba$$. I figured it out just by seeing the trailer and the commercials. DON'T SEE THIS AT ANY COST."}, {"rating": "0", "text": "Simply...the second worse film I have ever seen. How is it possible so many people love this film?!?!"}, {"rating": "10", "text": "When I first saw Eternal Sunshine of the Spotless Mind, I wasn't expecting to love it, let alone like it. What a surprise when I saw it! I think this film is wonderful in every aspect, truly beautiful and packs a full emotional punch. In fact, if you don't mind me saying so, it is one of my favourite films of the 2000s.I especially loved how Eternal Sunshine of the Spotless Mind was shot. The whole film looks beautiful, not only with the cinematography which is indeed spellbinding but also in the scenery which was nothing short of amazing. Another impressive asset was the soundtrack/score. Eternal Sunshine of the Spotless Mind doesn't have the best soundtrack/score I have ever heard in my life, but the score makes the film all the more moving, while the soundtrack is well selected and appropriate.I was also very taken with the story. Eternal Sunshine of the Spotless Mind has one beautifully constructed story I can tell you, with an almost poignant message about it. It is strange and bizarre yes, but neither of those are bad, quite the contrary. Then there is the script which is both poignant and funny, not to mention very deep. The pacing very rarely feels boring if at all, and the direction is adept.I have very little to complain about Eternal Sunshine of the Spotless Mind's performances either. As good as the supporting performances are especially from the always splendid Tom Wilkinson, I have to give the real kudos to the leads. Jim Carrey has done some good performances in some good films, The Mask, Liar Liar, The Cable Guy and Bruce Almighty showcase his comedy talents wonderfully, but this and The Truman Show show he is perfectly good at drama too. He is very understated here, but it works as he still manages to be likable all the same. The real star though is Kate Winslet. A beautiful and captivating actress, Winslet is absolutely perfect in her role.Overall, wonderful film. Bizarre yes, but very tender and poignant helped by the exceptional performances and cinematography. 10/10 Bethany Cox"}, {"rating": "7", "text": "The movie itself was fine, although I do have trouble with a director reusing the same scenes multiple times in a movie, it comes off as laziness. There is not much to get, it seems as though the people who say, \"Did you get it?\" were also overly enthralled by the Butterfly Effect and find fascination in the Gilmore Girls and One Tree Hill. The movie pulls off its premise, but does not providing a \"WOW\" factor by any means; the only saving grace is Jim Carrey doing what he does best in a quickly moving montage of acting as different characters from his past. Save yourself the time, go see Man in the Moon instead."}, {"rating": "10", "text": "In a word: breathtaking. I realize that the unconventional means of storytelling employed in this film won't be everybody's cup of tea; many viewers don't want to have to think too much or feel too much when watching a movie. But this is an extraordinary film, and it deserves the fulll investment of attention and emotional engagement that it demands. Despite the arty cinematic methods used by Gondry (which will either astound you or irritate you, depending on your tastes), there is nothing highbrow or inaccessible about the story's message: love is worth experiencing, even when it's difficult or painful or imperfect. And love - and our lovers - can never be removed from our psyches, no mater how much we may sometimes wish it all could be. Beautifully acted (Jim Carrey is better than I would have ever expected him to be, and Kate Winslet equals him in every way), imaginatively directed, exquisitely written, and boldly designed and shot. This film is a challenge, but those who rise to it will be richly rewarded. Truly awesome."}, {"rating": "10", "text": "My favorite movie of all time. not much else to say except it is amazingly insightful and touching."}, {"rating": "9", "text": "An absolutely riveting love story, that Gondry and Kauffman don't make a sappy mess out of."}, {"rating": "10", "text": "People criticise it for being confusing, okay think you kind of missed the point, it does not make them think and they are not entertained... okay you can not help who you fall in love with and it is better to remember to have loved and lost than not at all. the film is entertaining and romantic and something different and beautiful. this film lies in my top ten of all films, Jim Carrey should have got an Oscar nomination. The film should have bagged director and technology nominations. the best of the past 10 years, difficult to say with some good ones but definately in the top 5. See it and enjoy and get taken to a side of cinema which we love and are surprised how vivid some directors and writers can be."}], "recommendations": ["the_secret_life_of_walter_mitty", "magnolia", "the_royal_tenenbaums", "eddie_the_eagle", "the_upside", "the_illusionist", "edward_scissorhands", "casablanca", "eternals", "her", "paddington_2", "me_and_earl_and_the_dying_girl", "groundhog_day", "the_shawshank_redemption", "joker", "my_name_is_khan", "yesterday", "youth", "cinderella_man", "annette", "the_disaster_artist", "revolutionary_road", "the_green_mile", "hugo", "the_prestige"]}