{
  "id": 3,
  "title": "Eternals",
  "starring": [
    "Gemma Chan",
    "Richard Madden"
  ],
  "runtime": 156,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure"
  ],
  "description": "The Eternals are a team of ancient aliens who have been living on Earth in secret for thousands of years. When an unexpected tragedy forces them out of the shadows, they are forced to reunite against mankind’s most ancient enemy, the Deviants.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lFByFSLV5WDJEv3KabbdAF959F2.jpg",
  "categories": {
    "plot": 8.785714285714286,
    "acting": 8.857142857142858,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 9.0,
    "action": 9.333333333333334
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A spoiler free review Go watch it knowing it's not the same as any other marvel movie and it's more of a family drama then action and you will love  it. The  diversity of the cast is great and the movies  culture representation is the greatest mcu one I ever seen so go watch it and you will love the story, the characters, and the plot."
    },
    {
      "rating": "10",
      "text": "Loves it. Marvel movies were starting to get a bit boring to me tbh, but eternals changes that. It' marvel movie with all the action and lores but also a health dose of complexity, drama and intrigue. Hope the studio keep the direction they are heading"
    },
    {
      "rating": "10",
      "text": "Amei eternor, foi a melhor coisa que a marvel fez nos ultimos anos. Podem conferir sem medo. um belissimo filme"
    },
    {
      "rating": "10",
      "text": "It's a great movie. Chloe Zhao's unique directing made me ecstatic. If you are a Marvel fan, you will be satisfied with the Celestials in this movie."
    },
    {
      "rating": "10",
      "text": "Gostei muito, quem não gostou é hom0fobic, pq não é motivo dar nota ruim pelo filme ser \"morno\", ele é um filme introdutório com outra pegada, não teria graça se fosse só mais um filminho de porradaria e intrigas sem sentido"
    },
    {
      "rating": "10",
      "text": "Из лучших фильмов Marvel.Вам действительно нужно это увидеть, вы будете удивлены."
    },
    {
      "rating": "8",
      "text": "Please do not listen to the critics. They have absolutely no idea what they’re talking about. Does this movie have flaws? Sure, but it delivers big and is the most unique Mcu Film. Please judge it when you’ve actually seen it"
    },
    {
      "rating": "9",
      "text": "Great movie overall. Timing, plot, character development and twists that for once, in a long time, were actually surprising. Chloe Zhao does a wonderful job on bringing something fresh not just to the MCU, but to comic books movies as a whole. Best marvel project this year, and last. Well done to everyone involved. Solid 9/10. Go see it for yourself and show it some love."
    },
    {
      "rating": "10",
      "text": "Saudações do ovicio, **** you critics moda****ersAshuashuahaushauashauuahahaha"
    },
    {
      "rating": "10",
      "text": "ETERNALS IS EPIC.Chloe Zhao you're amazing. Can't believe this movie is rated the worst of all MCU films...absurd."
    },
    {
      "rating": "10",
      "text": "Do yourself a favor, ignore the non objective homophobic scores, and go to see it."
    },
    {
      "rating": "10",
      "text": "Marvel Studios had a lot of fun with this movie and I look forward to more of these types of movies in the next phases of their beautiful cinematic universe."
    },
    {
      "rating": "10",
      "text": "finally a movie that feels different from the rest of Marvel and that is very good because we need variety in this cinematic universe."
    },
    {
      "rating": "10",
      "text": "Good Good Good Good Good Good Good Good Good Good Good Good Good Good Good Good!"
    },
    {
      "rating": "10",
      "text": "Filme está incrível!! Vão assistir sem medo.Angelina Jolie está linda atuação impecável,como sempre. Amei muito o elenco o enredo TUDO NESSE FILME.."
    },
    {
      "rating": "10",
      "text": "This movie is beautiful and that it was with the worst expectations, I'm glad I'm not the only one who happened the same."
    },
    {
      "rating": "10",
      "text": "Too good a movie.It is very rare that you have received such criticism when the quality of it is excellent."
    },
    {
      "rating": "10",
      "text": "Unico, bonito, atores maravilhosos, diretora incrivel, um filme realmente lindo!"
    },
    {
      "rating": "10",
      "text": "This movie is breaking the typical Marvel mold and that’s okay. It is breathtaking in every since. With ten main heroes and the building of a whole new world within the current MCU, it was so well done. It goes back to one undercurrent of Marvel is that humans are good and deserve to exist, no matter their flaws and errors. The semi-lead character is played Gemma Cham & she is the soul of the movie. Every leader of the Eternals is a woman of color and they command respect. It also flips the script, similar to Captain Marvel, where the semi-lead man who turns against the other characters goal. How they frame where they are in various parts of human history is magnificent, it breathes life into our stories of the past, good and bad. It is funny but not as much as other established MCU storylines but the first round of character-establishing movies weren’t all comedy. I loved it and I can’t wait to see more from these heroes. Also HARRY **** STYLES MY WORD BLESS. CHERRY ON TOP, no pun intended."
    },
    {
      "rating": "8",
      "text": "Externals is fun watch. It has a plot that is sometimes puzzling but still in interesting."
    },
    {
      "rating": "7",
      "text": "In the grand scheme of MCU... where do Eternals exist? I can't connect the dot... don't see how it move the current MCU timeline... felt very disconnected and separated. Eternals as the almighty demi gods are not that powerful actually... Thor can beat all of them easily.It took them thousands of years to eliminate the Deviants. Thor and Hulk can do same things in 5 years easily. Eternals should not exist in the MCU... but seeing it as a standalone movie without thinking how it relates to MCU... I really like the movie.It's a high concept movie similar to Dune where it centers around theologies... kinda biblical approach in telling the story of how the universe and human beings were created and evolve. I also believe the writers are afraid to delve deeper in the theologies aspect because they need to put this movie within the MCU and this made the movie feel uneven and all over the place.Overall I enjoy the movie... the fight scenes are amazing and THIS IS ANGELINA JOLIE movie... I don't care about other characters.. if Marvel decide to write off the movie from MCU because of the worst MCU reviewed movie status... I don't care BUT Thena should live on in the MCU... she have the best power set among the Eternals. If you approach this movie thru MCU thoughts, I don't think you gonna like the movie but it still a recommendation from me 7/10.Black Knight is a great Marvel character... can't wait to see Jon Snow become The Black Knight. In the comics he's also a member of The Avengers."
    },
    {
      "rating": "10",
      "text": "A great step in the expanding of the Universe we all learned to love on the last 10 years, with a lot of confidence and originality in the aesthetics and the history itself. It sets the right pace to develop the characters and show all of their singular and interesting way of being part of this world and it’s history, with all of the human contradictions and personal drama on the right notch to set a good plot twist.Out of the “Marvel formula”, with the right pitch of humor, drama and action, i felt happy and satisfied again, after more than 2 years without going to Theaters."
    },
    {
      "rating": "10",
      "text": "I'm shocked, because I expected this movie to be **** and it wasn't, rather I ended up liking it too much."
    },
    {
      "rating": "9",
      "text": "A great movie  a few plot holes. And whoever is moaning cos there's two guys kissing. Get over it its the 21st century."
    },
    {
      "rating": "7",
      "text": "My main concern regarding the Eternals had to do with the huge baggage they carried, and even for Chloé Zhao that turned out to be a barrier that she couldn't overcome.There are too many explanations in Eternals and that slows the pace quite a bit, coupled with its long duration and lack of action, the film feels too irregular and its progress is stunted.Yet I also have to mention the things that does right, and that is that, although it's still a Marvel superhero film, Chloé Zhao finally manages to shake up a bit the exhausted introductory formula for new characters that are coming to this cinematic universe.Although it must be admitted that this is due to the complexity and scale of the story that is being told.Marvel has opened a door as large as the multiverse by finally directly introducing cosmic entities that are simply larger than anything else the MCU has shown so far.The possibilities are endless, you just need the ambition and the talent to exploit them.The most solid point of this film is of course its cast. Even though the most important leading role falls to Gemma Chan, everyone involved is given the opportunity to show off.Some to a lesser extent than others, but the cast is sufficiently balanced, although the shared humor came to feel too gratuitous after a while.The visual is simply remarkable. I can't recall another MCU movie that can boast such excellent use of cinematography and lighting as this one.There are a lot of visual effects, but only at some points the CGI and green screen are truly noticeable and not really problematic. Ben Davis' work is simply outstanding.For the rest, I can only say that even with its problems, Eternals is yet another solid addition to the ever-growing MCU.It knows how to balance its strengths and keeps the machinery greased and working.It's still the same formula, but at least it has a little shake to it, and it doesn't feel so ordinary.Predictable? Yes. Still entertaining though.Now it is only necessary to see what plans Marvel will have for these characters considering the ending and the two post-credits scenes.Time will tell."
    },
    {
      "rating": "8",
      "text": "I loved it! The characters were all likable, the cast had great chemistry, the actors all did amazing, and the cinematography was gorgeous! Things were a little bit squashed, meaning the characters didn’t all get the amount of deeper characterization that I had hoped for, but for as much content that was put into this film, I’d say Zhao did a good job with what she was working with. Plus, the diversity in this film is so important to so many people. As a woman it’s amazing to see women in the lead, and as a gay person I can’t tell you how excited I was when Phastos and his husband, Haaz, kissed (the first in the MCU) I got such a warm feeling in my heart! I look forward to more representation in the future!"
    },
    {
      "rating": "8",
      "text": "Marvel did a great job in setting the story for the 2 chapter of the MCU with these characters. There was a lot of story/world building which might be why there aren’t as many positive reviews since it’s more of a broad story rather than character specific. The acting was amazing and the CGI was beautifully done and on par with their other films. Overall a great movie with great character relationships, however I think if the score was better throughout the movie it would’ve helped to portray the heartbreaking scenes better."
    },
    {
      "rating": "10",
      "text": "It’s wonderful. Marvel won, she knows won. Thena it’s bad as, all characters very well built"
    },
    {
      "rating": "10",
      "text": "My friend took me to see this movie, I did not want to go see it because I was lazy and I thought I was going to sleep in the cinema but in the end it turned out that no, I was on the edge of my seat throughout the movie because of how good and epic it was. Thanks Mathias for taking me to see this wonder."
    },
    {
      "rating": "10",
      "text": "This movie felt like the The Boys series and that is one of my favorite series of the superhero genre."
    },
    {
      "rating": "10",
      "text": "Entered the movie theater with the lowest expectations due to the mostly bad reviews. Left the room with the feeling that this might be an \"ArtPOP\" situation, or more likely the \"Watchmen\" (2009) situation, where it will be better appreciated on the future, far from the usual \"marvel\" expectations. This is probably my 2° favorite Marvel movie, behind only Infinite war."
    },
    {
      "rating": "10",
      "text": "Tenia muy bajas expectativas de esta película por las malas criticas que tuvo hace días pero al final me sorprendió!"
    },
    {
      "rating": "10",
      "text": "Watashi wa sono eiga ga hontōni **** Machigatte iru to **** wa arimasen! Kekkō."
    },
    {
      "rating": "10",
      "text": "Filme incrível! O mais diferente da Marvel, com certeza e isso é bom! Apresentar dez personagens em um mesmo filme não é tarefa fácil, mas aqui foi feito com maestria. Os personagens são, de longe, o ponto alto do filme. Ansioso para ver mais deles."
    },
    {
      "rating": "10",
      "text": "*I promise this a spoiler free review of Eternals* I don’t want to over sell the movie, because I don’t want to raise anyone’s expectations too high, but I feel obligated to say the 55% rating is 100% undeserved."
    },
    {
      "rating": "10",
      "text": "Uno dei film migliori del Marvel Cinematic Universe, forse il migliore. Grandiosa fotografia, costumi stupendi, ambientazioni mozzafiato, CGI incredibile e una storia intensa che lascia in bilico etica e moralità. Chi è veramente l'eroe? Chi il cattivo? Consigliatissimoe assolutamente da guardare e riguardare!"
    },
    {
      "rating": "10",
      "text": "perfect dmssss meu deu do céu, filme bom do inicio ao fim, os herois, os deviantes, cgi, trilha..."
    },
    {
      "rating": "10",
      "text": "It is very good movie. It’s worth to watch just go and watch don’t see any reviews. Internet is dumb and some people are also dumb"
    },
    {
      "rating": "10",
      "text": "Que bella película, me parece muy injusto todas las criticas malas que recibió en su premiere."
    },
    {
      "rating": "10",
      "text": "Best movie!! The visuals and the actors and everything! Also Harry Stylesss"
    },
    {
      "rating": "10",
      "text": "Eternos delivers what we're not used to see from a Marvel Studios movie. There is a delicacy in the director's view of relationships and society itself. A masterpiece that is ahead of her time."
    },
    {
      "rating": "10",
      "text": "Different from marvel movies but well portrayed. One of the best marvel movies in recent times"
    },
    {
      "rating": "10",
      "text": "The fight between Ikaris and Makkari woow! It’s phenomenal!Druig and Makkari are the owners of my heart ❤️"
    },
    {
      "rating": "8",
      "text": "It's not as bad as people say y'all tripping I'm sorry if you don't understand the plot it's kinda confusing"
    },
    {
      "rating": "9",
      "text": "Marvel just served their most unique movie on a golden platter and I am honestly happy that I disregarded the critics review.... Extremely happy with the movie , cast , direction and cinematography... Do watch it in theatre Thank you"
    },
    {
      "rating": "9",
      "text": "Excellent movie. Great fight scenes and new characters. I enjoy the way it tells the story (flashbacks as in The Witcher books every 30 minutes or so) and the universe lore is pretty interesting. Jon Snow character barely appears, but is enough to generate hype for his future."
    },
    {
      "rating": "8",
      "text": "No idea what all these critics were on about. Personally enjoyed the movie, laying the groundwork, doing the MCU worldbuilding and what it sets up for future adventures. Dorsn't do everything to satisfaction but delivers what I more or less expected. Looking forward do go see it a second time this weekend."
    },
    {
      "rating": "10",
      "text": "Este una de las mejores películas de Marvel porque se sale de la formula que han estado usando por mucho tiempo."
    },
    {
      "rating": "10",
      "text": "Je n'ai pas été aussi content d'un film de super-héros depuis que j'ai vu le premier film des Avengers."
    },
    {
      "rating": "10",
      "text": "Eternals is the most sophisticated, elegant marvel movie to date. Massive story, great acting, and beautiful cinematography. It did not disappoint! The Eternals added another layer to the MCU and is a must see for those excited to experience something less traditional. Currently love all the Marvel movies and loved Eternals too."
    }
  ],
  "recommendations": [
    "alita_battle_angel",
    "black_widow",
    "oblivion",
    "tomorrowland",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "ben_hur",
    "black_panther_wakanda_forever",
    "hugo",
    "the_hunger_games_catching_fire",
    "alice_through_the_looking_glass",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "the_illusionist",
    "cloud_atlas",
    "inception",
    "doctor_strange",
    "the_13th_warrior",
    "upside_down",
    "twelve_monkeys",
    "the_prestige",
    "blade_of_the_47_ronin",
    "the_shawshank_redemption",
    "titanic",
    "dredd",
    "avengers_age_of_ultron",
    "john_carter"
  ]
}