{"id": 3023, "title": "EuroTrip", "starring": ["Scott Mechlowicz", "Jacob Pitts"], "runtime": 93, "genre": ["Comedy"], "description": "When Scott learns that his longtime cyber-buddy from Berlin is a gorgeous young woman, he and his friends embark on a trip across Europe.", "releaseYear": "2004", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/9t1e0Mova7eyV3OpRC6nT4y6hHH.jpg", "categories": {"plot": 5.666666666666667, "acting": 7.0, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.636363636363637, "action": 5.0}, "reviews": [{"rating": "9", "text": "Offensive? Give me a break; i'm European and I thought that the stereotypes were hilarious! It's a light hearted joke movie for Christ's sake, it's meant to be childish. I thought it was a shame the hostel scenes in Amsterdam were deleted; watch the dvd, they're hilarious!"}, {"rating": "1", "text": "This film is really lame - let's hope the stereotypes in this film aren't believed - it actually verges on offensive - a long shot off the original US college comedies."}, {"rating": "10", "text": "I thought it was a great movie. It was hilarious. They better make a second one."}, {"rating": "10", "text": "classic teen comedy that has, if anything, has become even better over a time, a rarity among this genre."}, {"rating": "8", "text": "Eurotrip ROCKS."}, {"rating": "7", "text": "It was funnier than I expected - especially the part where the brother and sister were drunk at the bar and started making out and licking each other. I laughed for a very, very long time."}, {"rating": "10", "text": "Very good movie. The swimming pool movie scene at the start and the boob-rubbing scene was HOT!"}, {"rating": "9", "text": "Hilarious. My favourite comedy was Old School until this game along. Wet your self funny."}, {"rating": "5", "text": "Such predictable and boring jokes make this a loser in my book. I know it's a comedy, but come on, the story should be a tad possible."}, {"rating": "6", "text": "Honestly The 1st Time I Watched Euro Trip I Thought This Movie Is Actually Fine.. Some Really Good Parts But Some That Were Yuckers...The Jokes Somewhat Wrap Up Together Throught The Film. This Is Not The Best Or Worst Movie I Have Ever Seen.. As For The Cast.... Michelle Trachtenberg Does A Fine Job..."}, {"rating": "9", "text": "While somewhat predictable, this movie does have a lot of funny moments, and it seems to me like the cast realized that they weren't about to make the next great cinematic classic, and decided to truly enjoy making this film for it's own sake and have fun with their roles. Fun to watch, even years down the line."}, {"rating": "10", "text": "I enjoyed this movie a lot more than, say, Road Trip, or American Pie. It mixes exaggerated European stereotypes with the usual raunchy jokes. Not for the easily offended."}, {"rating": "6", "text": "How is this movie so well rated by users? Bad acting, cliche' story line, predictable plot and events....not to mention the lack of originality. Sure the use nudity to try to divert your attention so you don't know the movie is so terrible, but even this does not work."}, {"rating": "7", "text": "While it is nowhere near a classic, in some ways it also is. This is an old fashioned road trip comedy following in the guise of National Lampoon. It isn't original, the jokes really tame, and the acting about what you could expect from such a unseasoned cast. Yet, I found it all really charming, also really wanting to buy orange juice for some reason. *lol* Overall: Eurotrip is a fun movie that is good for a few laughs and for when you want something easy to watch."}, {"rating": "6", "text": "EuroTrip is certainly an above average teen film. This movie kind of rides the coattails of American Pie and the wave of young adult films that came after it. The movie is I like the characters, despite them not really being overly original and falling into the general stereotypes. There is some good humour in the mix as well although some of it has already faded a little. Eurotrip is also clichéd which is almost expected from a teen film and you can see the ending coming from a mile away. Still overall there is a lot of fun to be had with Eurotrip and it is a great lighthearted comedy for young people."}, {"rating": "9", "text": "I really liked it; it's so funny. But I was shocked a bit with the nudity in the church, in the confession room, and I think it holds disrespect towards it."}, {"rating": "10", "text": "One of my all-time favorite comedies. It's the funniest road trip comedy ever made. It will make you die from laughter. Must-see for anyone who needs a great laugh."}, {"rating": "8", "text": "Excusy excusy! This movie is so hilarious. Kind of a raunchy comedy. Stays pretty funny throughout film."}, {"rating": "8", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷"}], "recommendations": ["american_pie", "the_watch", "a_haunted_house", "not_another_teen_movie", "jackass_presents_bad_grandpa", "old_school", "the_dictator", "rough_night", "the_hangover", "the_three_stooges", "hot_tub_time_machine", "scary_movie_2", "22_jump_street", "neighbors", "scary_movie_4", "johnny_english_reborn", "scary_movie", "step_brothers", "miss_march", "30_minutes_or_less", "superhero_movie", "white_chicks", "nacho_libre", "knocked_up", "the_wedding_ringer"]}