{
  "id": 873,
  "title": "Europa Report",
  "starring": [
    "Anamaria Marinca",
    "Michael Nyqvist"
  ],
  "runtime": 90,
  "genre": [
    "Science Fiction",
    "Thriller"
  ],
  "description": "A crew of international astronauts are sent on a private mission to Jupiter's fourth moon.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tbsfaBjiAW5vfrV06R8KCOzVOYy.jpg",
  "categories": {
    "plot": 7.75,
    "acting": 6.866666666666666,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.8,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.666666666666667
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Europe Report by Sebastián Cordero: I had high expectations for this film, but I had a little incuriosito.Il film manages to put tension throughout its duration, is consistent with himself, affascina.Riesce in order to be realistic despite the budget remeber, maybe there's a little something that could be done a little better, but you can not gloss over some difetti.I protagonists behave in a credible way, there is the appeal to discovery, there is a lot of curiosity in what accade.Il everything is made with the technique of found footage, which in this case is apt for this film.Ci are references to other science fiction films like A Space Odyssey that are sure to please  however the film for me is very cool piacevole.Davvero is a good science fiction movie, definitely worth watching (I hope it comes out sooner or later in Italy), one of the best of its kind in recent years."
    },
    {
      "rating": "6",
      "text": "I thought this film started off very well but then the plot line became a bit mired for my tastes. The acting was fine but the script became to thin in the middle. It sort of went from being an intelligent and challenging film to being a typical space disaster movie. I wonder why. The idea was interesting enough but it became improbable with creatures easily breaking through six feet of ice as if it was salt water taffy. I recommend it if you are looking for a hit of science fiction but it won't do for the evening by itself-you will finish watching t needing to see something else to break the mood of faint doom created by it."
    },
    {
      "rating": "6",
      "text": "Shot in a documentary-style with lots of jumping around and \"live\"/recorded camera feeds from the ship and from a handheld, which isn't a type of movie I generally like but I gave this a chance. The pacing and the order of things seemed a little jumbled and confused in the beginning but got better towards the middle  I think they jumped around way too much. Arguably it did add to more to the mystery of what happened during the mission as well as helped to build some further tension, but I think the pacing and order of the scenes could have been done much better.\r The performances by the cast were actually very good, and the characters did have some depth to them. That said there were a lot of strange actions, much involving plain disregard for protocols and safety measures that astronauts training for deep space missions would simply not do.\r While evident that the budget wasn't exactly big, I think they did a good job with this movie. But the fact that I don't really like documentary-type films plus my dislike of the pacing, scene-order, and parts of the plot knock the rating down for me. Watchable and entertaining for the most part, but not exactly a movie I'd tell someone they have to see."
    },
    {
      "rating": "8",
      "text": "A gratifying and mystifying science fiction thriller that delivers with expert detail, impressive visuals, and a captivating sense of realism that can be described as breathtaking, as well as thought provoking."
    },
    {
      "rating": "10",
      "text": "This is the best picture I've ever seen. Its great on so many levels I dont know where to begin, like its use of real life-like NASA footage to the real scientific argument of the possibility of life on Eurpa(even a clip of Neil Degrasse Tyson). There were no \"red herrings\" or romance interest between the crew, which is rare in movies now a days, and most of all the story of the crew and how each one sacrifice themselves for one another as well as their research."
    },
    {
      "rating": "9",
      "text": "The film is one of the real sci-fi film without explosion and combat but focus on the main goal of the mission; find a sign of life on another planet (actually a natural satellite of Jupiter).\r Storyline is great and interesting. My hearth pounded as if I were they on that spaceship and fear of what is waiting outside.\rActing is great. They made me truly believe they are scientist who devote their life for scientific discoveries.\rVisual effect are undoubtedly beautiful and realistic. I can said that is what REAL Europa should looks like when we land on her in the next few decades. They did a great job for scientific accuracy."
    },
    {
      "rating": "7",
      "text": "Not every sci-fi movie is an action-packed super-hero popcorn flick. Luckily! And Europa Report shines among those, lately rather rare examples.\r Europa Report follows the line of a documentary and does that so successfully that I, throughout the movie, kept forgetting that humans actually have not yet landed on Europa. While the search for extraterrestrial is in fact the focus of the mission, it is not the focus of this movie, but rather human behavior and psychology, the magic of exploration and the steps we are ready to take for something that is larger than individual life.\r The story flows beautifully and, yes, with time-jumps demands full attention from the viewer. And as a consequence also delivers a great deal of excitement and enjoyment.\r I definitely recommend to all the science, space exploration and old- school-sci-fi fans."
    },
    {
      "rating": "10",
      "text": "Europa Report is no short of amazing, dark and mysterious with dazzling effects; you can actually believe that you are with the characters on the spaceship, and the discovery, it is a beautiful wonder to sight. The whole movie has the cold claustrophobic feel to it, which is a unique style and feeling. This movie actually proves that we can bring science fiction thrillers without the use of much budget and gross out scenes ex: Alien & Aliens! Europa Report is a beautiful journey through the wonders of the universe around us. Just beautiful and a definite must see! Best of 2013!"
    },
    {
      "rating": "8",
      "text": "Europa Report 8/10. I loved it. Bravo Sebastián Cordero, you did with a 10 million dollar budget what Shane Black and 200 million could only dream of: make a great movie, LOL. Seriously, if you're a sci-fi fan tired of the same old predictable repetitive crap, then watch this. It has tension, emotion, depth, mystery, everything that makes a great sci-fi movie."
    },
    {
      "rating": "10",
      "text": "Awesome movie. I loved the way story incorporated actual science behind it. The effectThis movie proves you can make a compelling sci fi movie on a limited budget. I highly recommend this movie."
    },
    {
      "rating": "9",
      "text": "I went into watching this with Syfy channel expectations... What I left with was a smart. Visually impressive. Realistic \"lost footage\" film about a journey in space.  Fantastic film and highly recommended."
    },
    {
      "rating": "8",
      "text": "Surprisingly good visuals for a low budget film. This is the proof you can make a film with not that big of a budget but make it interesting, intense and such an attention grabber. Really enjoyed the journey and felt like I was in space. I felt the fear one must feel in this kind of situation. Maybe the very end was a little out of place (the last scenes). But overall, everybody did a good job and the landing on Europa was so captivating. I would give it a 7.5."
    },
    {
      "rating": "10",
      "text": "Visually interesting:  use of multiple cam shots from different parts of the shuttle, scratchy disconnections etc.  Interesting plot:  loss of connection to missile control, and the team continues on with the mission.  I wouldn't normally watch science fiction, but I found this really engaging:  especially the passion  how important this was to them  and it was believable, not over the top.  Interesting actors."
    },
    {
      "rating": "10",
      "text": "This is a much watch sci fi movie. Many sci fi movies use C level CGI and throw lots of aliens/zombies at you in the same old predictable story line. Europa Report uses none of the above mentioned things and keeps you on the edge of your seat as you do not know what is going to happen."
    },
    {
      "rating": "1",
      "text": "This is the Blair witch project in space.  This movie actually proves that we have to much time on our hands. After waking up from a nap this thing was still on. Your best bet is to Keep scrolling Net-flix for something better."
    },
    {
      "rating": "1",
      "text": "Nope, boring and long drawn out, payoff only came in last minute. Mildly interesting intellectually but poor audience-design. That is, NASA types may find this very engaging but this screenplay wasn't written with the general public in mind."
    },
    {
      "rating": "8",
      "text": "When a sci-fi movie achieves a certain degree of excellence I have special category of greatness where I place such films. Europa Report, the little known sci-fi film of summer 2013 is placed squarely in this special category.\r The farthest than humankind has ever traveled; Europa Report takes us to a moon orbiting Jupiter where researchers believe there may be life. As a crew of scientists and engineers depart Earth they tread the well-worn path of many a space movie. Traveling to Europa the crew have their squabbles, their celebrations, their successes, their letters and videos made for loved ones on earth.\r Then lines go dead. They loose all contact with Earth. They have every possible gear malfunction imaginable, including a few mental and emotional ones. Director Sebastian Cordero permits this display, the usual psychological strains the typical sci-fi film character faces, but Cordero keeps them to a minimum. He does not rely on these typical factors to carry the film. The clichés become less and less important as the adventure of the actual mission intensifies\r Once on the crew arrive on the moon Europa everything goes wrong. When characters we’ve become fond of start dramatically disappearing we realize this is not a story about the power of the human spirit’s ability to overcome all odds. This is intended as a realistic portrayal of a real mission. What it would actually be like to venture to the far reaches of our solar system. It is a stunning achievement.\r For 10 million dollars this film transcends basic film devices. The Astronauts’ struggles to survive become incidental. Europa Report takes us past the mere human crusade of survival. Way past.\r Errata: Surprisingly the crew miscalculates the temperature of Europa as absolute zero. Absolute zero is a scientific impossibility according to the Smithsonian. Particles no longer move and energy is no longer transferred. At absolute zero, the principle that prevents perpetual motion from existing which is also used as an adjective to describe the decent into disorder- entropy- reaches its minimum value. The scenes on Europa are overflowing with entropy, so this absolute zero declaration is blatantly false.\r 8/10"
    },
    {
      "rating": "4",
      "text": "The question of what else is out there in the universe is one that has wrapped our collective consciousness ever since Galileo discovered the Earth orbited the sun and we weren't as flat as everyone assumed we were. Europe Report is a film that tries to answer the question while trying to terrify the viewer with predictable cares thought up years ago. When the crew of the Europa One are cut off from Earth when their communications are destroyed by a solar flare they are forced to do their mission alone, a multi year journey to Europa, a moon of Jupiter where scientists have discovered signs of possible life. Filled with meaning and deep philosophical questions about our role in this universe, Europa Report doesn't feel like a piece of entertainment, it feels like a science lesson video, a great looking science documentary that doesn't aim to entertain but make you wonder. It does what it says on the tin and makes you question things but it fails to entertain on a filmic level, it plays like a cliche ridden horror film that ends in a predictable way. The cast are good with the best performances coming from District 9's Sharlto Copley whose devoted family man is an interesting and unique addition to a horror film and he stands out from the pack, Michael Nyqvist also impresses as the guilt ridden and depressive lead engineer on the project. Embeth Davitz bookends the film as an overly emotional lead researcher down on Earth who provides context and relevance to the mission but all these attempts to make the film seem cosmically important make it a slow exercise in asking questions we cannot possibly know the answer to making for a slow paced exercise in futility."
    },
    {
      "rating": "5",
      "text": "big sci-fi fan.  Surprisingly light on substance, this movie is a sci-fi blair witch project, too stale of formula to be given a high rating.    The budget was just too low to make this sort of movie.   Throughout the middle of the movie it just teases the audience's interest by alluding to mysterious event which happened (can't be more specific here without spoiling) earlier.  Movies resort to this tease when It needs to stall out audience interest.  The last act of the movie really needed some more budget, as you never escape the interior of the ship.  Pretty lame as the audience has been waiting in anticipation."
    },
    {
      "rating": "5",
      "text": "The film was remarkably better than I expected. However, the film was not that well directed and lacked an inspiring story. The ending was not that great either."
    },
    {
      "rating": "0",
      "text": "Quite boring. Nothing too interesting. Only good scene was the end, with the alien. Other than that, this film was a cliched mess, and I do not recommend it. 0/10"
    },
    {
      "rating": "6",
      "text": "The found footage genre is has been wearing incredibly thin for some time, so it's refreshing to see a film doing something slightly diffrent with it. Shown from the POV of onboard cameras on a spaceship on its way to Jupiters largest moon, Europa Report is a slowburn which builds to a interesting climax and doesn't opt for easy shock tactics. An obviously small budget is utilised well, and a cast of actors, usually seen in supporting roles, underplay their roles nicely. It's nothing earth shattering but kudos for trying to try something slightly different."
    },
    {
      "rating": "8",
      "text": "Although the premise of the movie seems a little flawed (Why would we send a manned flight to one of Jupiter's moons to do a job that could just as easily be done with probes?), I nonetheless found it thoroughly engrossing. It's hard science-fiction done well. The camera-work (the found-footage technique is used) and minimalist sound editing do a great job of inserting you into the claustrophobic confines of the spacecraft. The character development is fantastic and I'm not going to give anything away, but there are a fair number of little puzzles that the viewer gets to work on for a while before the answers are made apparent. Great film!"
    },
    {
      "rating": "5",
      "text": "I've let my feeling be known many times on how I feel about these found footage documentary films, that use camcorders. They are lazy, usually have no storyline, and the constant camera movement is just nauseating. Europa Report is different, as the film is told through surveillance cameras, aboard a state of the art space ship. Europa is a privately funded mission to the sixth moon of Saturn, to investigate strange heat signatures detected by NASA, that could be alien lifeforms. The cinematography was better than most of these film, and there was somewhat of a back story, however Europa Report is really not much different than a million other similar films. Nothing really happens until they reach their destination, they find something strange, and then must decide if fighting for their lives is worth the potential for scientific discovery. I bet you can name a dozen other films that were similar. As for the cast, they were just like film, in that they were very average, with little to nothing of note. Science Fiction is my favorite genre and I'm always hoping these films will show me something new and excited, but as with Apollo 18, Mission To Mars, Sunshine, and Moon, I was extremely disappointed. Europa Report wasn't a bad film, but it wasn't unique in any way. If you haven't seen many films, you may be wowed by something like this, but if you're like me, all you're going to find is a very boring and unimaginative film."
    },
    {
      "rating": "7",
      "text": "Riveting from beginning to end, Europa Report manages to extract a ton of thrills out of the mystery surrounding the happenings and what they will find on Europa. The film has a certain chilliness to it that really keeps you on edge and waiting to see what comes next. Though, it can drag a bit in the middle until things really kick in. The constant jumping in time period also does not help matters in that regard. However, the pay-off is more than worth it and once they reach Europa, it really becomes a very good science fiction film. Somehow, it managed to be this good of a science fiction film with beautiful production design and effects with an under $10 million production budget, which is worthy of acclaim. An interesting twist on the found footage genre, Europa Report never truly feels like a found footage film, which helps. Entertaining, thrilling, and well made, Europa Report may not be great, but it is certainly more than worth your time."
    },
    {
      "rating": "6",
      "text": "A thrilling and suspenseful space exploration film.Space exploration themes are the next big thing in cinema, as well as in the real world. So there some good films, I mean not science fiction, but real science based films were made in the recent times. This is one looked like one of those until the final scene. According to be, it looked so good, but when the end came, it ruined everything.It was more like a docu-adventure-drama, but was a found-footage type film. I wanted to see it ever since I saw 'The Last Days on Mars', because people were comparing between these two. I think both these titles looks same, except different planet exploration. The 99 per cent of the film looked like a real mission, except the conclusion.The writer, director and all the actors did good. The entire story takes place on a spaceship and a few scenes on the Jupiter's moon Europa, obviously a setting. If you like space travel concepts, you will enjoy it. It was just like 'The Martian', but it did not have popular actors, otherwise would have made a little buzz. Most of you have already seen it, if not try it, it is worth if you are a sci-fi fan.6/10"
    },
    {
      "rating": "6",
      "text": "A very well made film, but it's not a sci-fi game changer.  There is a lot of scenes that give a realistic look of what it might feel like to be in space.  B-"
    },
    {
      "rating": "8",
      "text": "I went into this one with no real expectations but found a movie that was attention grabbing and something that was fresh in the \"discover alien life\" and \"found footage\" genres.  The presentation of the story is the biggest highlight of this film--second only to the story itself and the tension that unfolds from it.  The movie is NOT told in a linear fashion and its creative editing is enough to make you say, \"Aha!\" more than once.  The director also did a great job of making the film feel tense, and did so while keeping the cameras (mostly) stationary--it's a \"found footage\" movie after all...and being a \"found footage\" film, \"Europa Report\" was able to dodge all the pitfalls that becomes that subgenre and was actually watchable (I can't stand \"found footage\" movies).  The only real downside is the movie's special effects aren't the best but with a great story, great presentation, great acting and a fantastic ending (not all the elements are great...some are better!), the movie doesn't fail to entertain."
    },
    {
      "rating": "7",
      "text": "Amazing special effects and visuals.  Some stupid choices are made that trained professional astronauts would never make, and proper safety measures weren't followed most of the time.  Over all I really enjoyed this creepy sci-fi thriller and applaud the sheer scope of this film's purpose."
    },
    {
      "rating": "8",
      "text": "buena pelicula con  efectos interesantes sin caer en exagerados , actuaciones, la forma que utilizan las cámaras como si fuera en directo lo hacen mas interesante."
    },
    {
      "rating": "9",
      "text": "Its always good to see that the movie industry is not completely brain-dead when it comes to creative risk taking.\r The movie is told through a documentary like perspective, and it has really convincing acting. This movie is no \"nice throwback scifi movie\" and some deeper themes are explored if you look really hard. The movie does not get caught back in stuff that other scifi movies get into, like badly forced themes and misfit love stories, this movie is straight to the point.\r The movie is clearly coped well with a fairly low budget, and I respect it for that. The movie is 100% worth a try, and if you did not like it (due to its fairly mixed opinions), no biggie! Its not like the 6$ or so is a great investment, especially to see something never before done (at least done properly (yes Im talking about you Astronaut))"
    },
    {
      "rating": "0",
      "text": "I do not recommend Europa Report. Boring!!!!!!!!! If you want a good space action movie, get Armageddon with Bruce Willis and Ben Affleck. You won't be disappointed there :)"
    },
    {
      "rating": "8",
      "text": "\"Europa Report\" 10 Scale Rating: 8.0 (Great) ...\r The Good: An extremely realistic account of what space exploration would probably actually be like, Europa Report avoids typical sci-fi cliches. Despite being comprised almost entirely of unknowns, the cast holds up and does an amazing job. Extremely interesting film, especially if you have an affinity for space exploration. One of the better films of 2013, despite being a film that most people have never heard of.\r The Bad: Can be a little slow at times. Sometimes the out of sequence script is a put off and confuses you somewhat early on."
    },
    {
      "rating": "0",
      "text": "Boring. it is like nothing went on throughout the entire film. I did not understand the little stuff that did happen the whole time I watched it. Not a good film by any means."
    },
    {
      "rating": "8",
      "text": "Europa Report is an excellent Sci-Fi film, shot in a pseudo-documentary style. Shooting a movie on camera in a budget is a great solution. Europa Report is almost inferior to the larger and more expensive films of the genre. Europa Report can be recommended to all fans of the genre and not pay attention to the budget of the film. Also, the open final turned out to be excellent"
    },
    {
      "rating": "8",
      "text": "Europa Report is a quite unusual sci-fi found footage movie showing what if scenario of exploring possibility of life under the ice of Jupiter's moon Europa.Its a well written and well executed thrilling story with good pay off at the end. Rare treat in found footage genre."
    },
    {
      "rating": "7",
      "text": "A different film in terms of the space because it shows an unusual realism especially with the elements with which it tells its story, a splendid and very entertaining work, by far one of the best films of the genre in years.The ending is weak but when it come to that point is just the last passage to go through."
    },
    {
      "rating": "5",
      "text": "I thought this was ok, althought not entirely great or gripping. Its mildly intriguing, seeing things from the characters point of view (via headcam footage). The camera angles/sources add a sense of isolation and claustrophobia too, as well. Some sudden actions present may make you doubt whats going on, which kept me fairly interested. As I say, its an ok film that could have done with a more substantial script. I wouldn't recommend this film as such, no."
    },
    {
      "rating": "8",
      "text": "Not a perfect movie, but a very good one. The cast and visuals are very good, especially knowing that it’s a low budget film."
    },
    {
      "rating": "7",
      "text": "More than a movie - a proof of concept that Fictional Non-Fiction (i.e. films entirely composed of in-universe footage) can be put to good effect in SF cinema, without the need to resort to the shaky-camera trope."
    },
    {
      "rating": "8",
      "text": "As someone who finds the idea of searching for life in space fascinating, I loved how realistic this movie was. I also loved where it ultimately went and how it resolved itself. That said, I disagree with the decision to jump around in time. It made me feel like I was missing when major things happened until I realized the movie would randomly go forward and then back. This found footage concept doesn't need that. The characters also seem to make odd mistakes or find equally odd solutions to things. That said...really, really great for people interested in the exploration of space. I loved it."
    }
  ]
}