{"id": 3078, "title": "Evan Almighty", "starring": ["Steve Carell", "Morgan Freeman"], "runtime": 96, "genre": ["Fantasy", "Comedy", "Family"], "description": "Junior congressman Evan Baxter, whose wish is to \"change the world\" is heard by none other than God. When God appears with the perplexing request to build an ark, Evan is sure he is losing it.", "releaseYear": "2007", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/5vjH8oQFZXJ0gTOPsJKWidVsWmg.jpg", "categories": {"plot": 3.75, "acting": 3.375, "ending": 3.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.076923076923077, "action": 5.0}, "reviews": [{"rating": "10", "text": "Critics must have lost their sense of humor and forgotten what it's like to simply go to the movies for enjoyment -- and being able to laugh out loud without being offended by crude, rude, stupid Junior High School humor. OK, so I'm not a kid, but I go to the movies a lot -- and Morgan Freeman is just great in this playing \"God\" -- with with and wisdom. Wanda Sykes is a hoot -- and OKAY, so Steve Carell falls down a bit much, but otherwise -- I'll gladly see this one again! I don't go to the movies to criticize, I go to be entertained, and Evan Almighty had the audience (both times I saw it!) enjoying it thoroughly. Two thumbs UP! Shakti"}, {"rating": "7", "text": "Silly? Oh yes. Entertaining, well yeah it was. I didn't think I'd really like it, especially considering it was Steve Carell as the lead but I managed to quite enjoy this. It's a ridiculous idea but still in a way that manages to work, as long as you don't take it seriously. The cast works well together and with the exception of some bad CGI it comes together nicely in the end. Even Carell, who I normally don't like, is bareable and that's saying something! It's no Bruce Almighty but its OK."}, {"rating": "10", "text": "After seeing Evan Almighty with my wife this evening, I am happy to join to underground resistance in support of the movie. Very cheerful and fun, the comedy is \"cute\" comedy, which if you are too full of yourself you may not enjoy. You do not have to stretch to enjoy it, we were thoroughly entertained. Looking forward to owning it on DVD."}, {"rating": "3", "text": "'Evan Almighty' strongly lacks the hilarious jokes, the original hooks, and the ridiculous references that made 'Bruce Almighty' so great. This is yet another example of how a film with Jim Carrey in it will make you laugh, but the Carrey-less sequel will make you frown."}, {"rating": "4", "text": "There was no point in the whole story. the story just sucked but the comedy that came with it was somewhat funny."}, {"rating": "10", "text": "Awesome movie, I loved it - very uplifting and family-oriented! I'm waiting for a real Christian reviewer to be featured on this website!"}, {"rating": "7", "text": "A good family movie."}, {"rating": "9", "text": "Me and my family enjoyed this movie immensely. This is because there was little to no offensive material at all. It was a story that inspired faith in God and trusting Him even when things were not looking like they were going to work out. With many good biblical references and light hearted situations, this movie will actually make you feal better about lifes trials after seeing it. To only go by what the critics are saying about this movie will leave you missing a really good time."}, {"rating": "3", "text": "This film nearly left me dumbfounded. The plot is so insipid and lame, the ending so ludicrous, that I found myself distracted by the idiocy of the makers. There are bits of humor and some fun little chuckles. However, what this movie amounts to, despite its good cast, is a whole lot of money wasted, much like that which one spends on an expensive trinket that breaks the first time you use it. BooHoo!"}, {"rating": "8", "text": "Loved this movie. I saw a sneak preview last weekend and was impressed with its ability to make me laugh without any off-color language or situations. (I'm rather juvenile and actually LIKE off-color humor like that evidenced in \"Knocked Up,\" so I'm no moralist). The film is reminiscent of Disney-type family movies like \"Parent Trap\" or \"Herbie the Love Bug.\" The actors committed to the roles and were great: Wanda Sykes was great. I was impressed with the animals, too. Overall, a movie I would feel relieved to take my aging parents and the kids to see."}, {"rating": "10", "text": "Loved it, I could take my whole family to it, it raises my hopes for Hollywood. It was funny without having to go overboard, and had an incredible cast, definitely a keeper!"}, {"rating": "0", "text": "Absolutely HORRIBLE. How do you screw up a movie about Noah's Ark? With this cast? The script is all poo jokes and moralizing. One of the worst films I have ever seen."}, {"rating": "10", "text": "The ratings of the critics are a clear testament to the biased opinions towards a Christian-based film. This film was hilarious, well-written, and not at all sappy or dull with its clever allusions. It looks like America has become too cynical to see the good of a Random Act of Kindness."}, {"rating": "3", "text": "A dispassionate, humorless morality tale churned out by the corporations to make money."}, {"rating": "8", "text": "A funny movie for the whole family. This film Has its funny moments and although not the best movie is sure worthy of a movie ticket."}, {"rating": "9", "text": "A great family flick with inviting laughter and reflection; inspiring.; very good acting, graet special effects. My 13 and 10 yo loved it as did my wife and I."}, {"rating": "8", "text": "Once again the, ahem, professional critics missed it. I guess the professionals objected to the religious overtones, or maybe it was too upbeat. My wife and I brought our children, ages 6 & 8, to this movie and they absolutely"}, {"rating": "10", "text": "This film was great. These critics are so used to the traditional crap Hollywood shoves down our throats that they can't appreciate a feel good movie anymore. I do not believe Walt Disney could have made one tenth the incredible pictures he made in this date and age because the critics would have ruined him.. I give the critics a rating of 0. They are the colossal duds."}, {"rating": "7", "text": "I'm glad I did not read the reviews before I went and saw the movie. \"Evan Almighty\" is funny and uplifting, a wonderful contrast to the rude, materialistic, road rage culture that depresses and wears me down from day-to-day. Its troubling when reviews point to the \"moral of the story\" as one of its problems. Rather, Its those who liked \"Hostel Part II\" who need to reevaluate why they enjoy such sadistic trash."}, {"rating": "3", "text": "Good for kids, parents of them and grandparents, but when it comes to just about everybody else it's just terrible. Bad acting (with exception of Carell), and the writing was at times clever but most of the time it was cheesy. Then of course there's the stereotypical black attitude-filled assistant, who had some of the worst punch lines I've ever heard (\"I can't even get my cat to use the litter box!\")."}, {"rating": "10", "text": "wow, does Will G. think that the Christian Science Monitor is a true Christian website? that's actually not a Christian-affiliated church or website buddy, read the fine print. Anyway, the film was excellent, I loved it and laughed the whole time - Steve Carell is great and the message was very positive and inspiring too. What a concept - a feel-good movie you can take the whole family to!"}, {"rating": "1", "text": "The worst movie I have seen in a long time. The only laughs this movie elicited were from the realization that what I was watching somehow cost 175 million dollars, and the inadvertently hilarious \"impromptu\" dance number during the end credits. You know how occasionally actors in a movie look like they're having a good time? These actors look completely miserable. At least I only had to watch it, not be in it."}, {"rating": "0", "text": "What in the world were the producers thinking when they unloaded 175 million dollars into this gigantic heartless and most of all unfunny right-wing comedy? I don't understand the people who find Steve Carell funny. He sees something completely normal, screams uncontrollably, drags the scream out to make sure everyone realizes he's doing the same schtick he's done since The Daily Show and then follows it up with a low-pitched dramatic line. Wow I haven't seen that one before Steve! Add a loud mouth who sucks at improvisation like Wanda Sykes and you have the worst movie of the year!"}, {"rating": "5", "text": "First part of the movie was amazing, second part was dumb."}, {"rating": "8", "text": "Great movie. Your family will all love it. Ignore negative reviews from dysfunctional critics."}, {"rating": "9", "text": "A movie made for families that is sure to please. Clearly those reviewing this movie have not adopted the frame of reference of a child or tired parent!"}, {"rating": "0", "text": "A gaping hole on Steve Carell's career. Unoriginal and very unfunny."}, {"rating": "8", "text": "I do not know what film some of these reviewers saw, but the kids in my audience laughed themselves sick. No, this is not a dark, edgy Oscar-contender, but it is s fun family film -- remember those? Kids will like this film, as will the adults who take them. It is about time someone realized that a fun family film coud be made without resorting to thinly-veiled sexual humor (Surf's Up). Lighten up, go, and have fun."}, {"rating": "10", "text": "The kids loved it."}, {"rating": "10", "text": "Laugh out loud funny that adults and kids will enjoy. A refreshing change from standard Hollywood fare."}, {"rating": "8", "text": "There were a couple of scenes where I laughed so hard that there were tears rolling down my cheeks, and that does not usually happen to me. I expected the movie to be a little too \"adorable\" for my tastes, but it wasn't overly icky-sweet. Steve Carell is a very talented comic actor. In another actor's hands, this part might not have worked, but Carell hits all the right notes."}, {"rating": "0", "text": "This was a terrible movie. I think its funny that Kelly M. would think that the critics were biased against this Chrisitan-based film. I guess the Christian Science Monitor was pressured into giving a 50 as well. Obviously, Kelly has seen into the conspiracy. Critics control the world . Props though for the great vocabulary. It really does make you look smart."}, {"rating": "2", "text": "So painfully unfunny. I love Steve Carell and wanted to like this movie, but it was just bad. And I think the whole 'people who don't like this movie are anti-Christian\" thing is hilarious. Noah was Jewish, morons."}, {"rating": "0", "text": "Nice movie if you are a Holy Roller otherwise bland as dry toast."}, {"rating": "10", "text": "I generally follow metacritic's scores but I'm glad I didn't this time. Evan almighty was great without having to be filled with sex jokes/scenes or language. Steve Carell is basically, amazing. as usual."}, {"rating": "1", "text": "Sunday school masquerading as comedy."}, {"rating": "8", "text": "nice one Will G. Do you even know who the Christian Science people are? They are as far from Christianity as Marilyn Mansun is. They are not Christians."}, {"rating": "5", "text": "Could have been better if the ending of the movie was an actual flood. My question STILL IS.. WHY ALL THE ANIMALS? [***SPOILER***]There was a flood in Washington DC. So why did we need to save the giraffes and elephants? What a waste of time."}, {"rating": "1", "text": "Hideously un-funny. Religious propaganda glopped on so heavily that it made the entire audience in my theater shift uneasily in their seats. Only reason I don't give it a 0 are the special effects."}, {"rating": "1", "text": "One of the stupidest and most idiotic film I've seen in my life. Nothing good in it ... NOTHING!!!"}, {"rating": "7", "text": "The best on-screen portrayal of the Deity of all time was given not by George Burns or Morgan Freeman, but over 70 years ago by Rex Ingram. In the 1936 film version of Marc Connelly's The Green Pastures, a reimagining of Old Testament Bible stories as Connelly assumed that many African-Americans saw them (and still an extremely entertaining and moving film, if you choose to overlook certain attitudes that were inextricably part of its time), Ingram plays \"de Lawd\" with tremendous dignity, majesty and a sly sense of humor. So it's absolutely no insult to Morgan Freeman to place him a close second to Ingram in the all-time cinematic God sweepstakes; unlike George Burns, who plays him a little TOO folksy for my tastes, Freeman balances wisdom, authority and casualness perfectly--and looks better in a white suit than Steve Martin and Tom Wolfe combined! Freeman's first appearance in his \"biggest\" role was opposite Jim Carrey in the underrated Bruce Almighty, a consistently amusing and occasionally rather insightful mainstream comedy whose major point--that man is completely incapable and ill-equipped to \"play God\"--is one that even some atheists and agnostics can live with. In this pleasant, family-oriented sequel, Freeman returns, issuing divine orders to the title character (Steve Carell, a newscaster in the first film and a politician here) to build an ark because, well, the heavenly weather forecast is calling for LOTS of rain. A major sticking point is that in the Book of Genesis, God promised Noah that He'd never flood the earth again, but this movie sidesteps this particular caveat rather cleverly. I also admired Evan Almighty's subtle conservationist message; it's puzzled me for a long time that the right wing has been so successfully able to hijack the energy issue almost to the degree of convincing a substantial portion of the fundamentalist community that Al Gore is practically the Antichrist, when it seems far more logical for Christians to want to exercise judicious stewardship over what God has entrusted man with rather than prodigally burning through it as though tomorrow's never coming. (Notably, some Christian leaders, such as Rick Warren, have recently thrown in with the environmentalists.) As a comedy, Evan Almighty has its flaws; being a Noah's Ark movie there are inevitably lots of jokes about animals, but noticeably quite a few more deal with what comes out of them than what goes in, which appears to be both a biological and a mathematical impossibility. But you don't have to be God Himself to be able to forgive the movie's faults anytime Freeman or Carell (who's a riot whether trying to control his kids, his critters, or his rapidly growing acres of unruly facial hair) are onscreen, individually or together. There's nobody around these days who's more capable than Carell of blending silliness and sympathy: in his TV series The Office he can make you cringe with embarrassment at his character's clueless gaucheries one moment and break your heart over his loneliness the next...and then, of course, there's his breakthrough movie The 40 Year Old Virgin, in which he and Catherine Keener transformed two hours of dick jokes into a surprisingly poignant, resonant love story. Evan Almighty doesn't always completely open the comedic floodgates, but Carell and Freeman are such consummate miracle workers that they more than keep this ark afloat."}, {"rating": "0", "text": "This is quite possibly the worst movie I have ever wasted my time watching.  The actors are not funny, and neither are the jokes.  The plot is not only lame, but dripping with the kind not-so-subtle bible-thumping morality that has no place outside of an all-christian cable channel.  The message-that you need to 'let go and let god'-is so heavy handed that the viewer finds their IQ repeatedly insulted. Even God would be offended by his cliched portrayal in this film.  My advice; if you aren't into mindless Christian 'family' entertainment with a soundbyte of a message that only a simpleton could appreciate-stay away from this movie!"}, {"rating": "0", "text": "I saw this when it first came out. The only good thing was that the film was delayed thanks to difficulties and I got free tickets from it. It was a poor sequel that is nothing compared to the previous film. The cast was terrible, The plot was stupid, and it was totally unnecessary."}, {"rating": "6", "text": "The movie comes with a good moral but if you asked me would I want to watch Bruce or Evan (Almighty), I would definitely choose Bruce Almighty."}, {"rating": "0", "text": "I watched this in theaters and the best thing about it is that I got free tickets from it because they had technical difficulties before airing it. This is a terrible film and I wouldnt recommend it."}, {"rating": "0", "text": "After we saw this on TV my husband asked me, \"Did people actually go to the theatre to see that?\"   I told him they did but hardly believed it myself as I was saying it.    It's so bad that it's hard to believe that even brain dead religious wackos would think that it was worthwhile.    Two hours of God trying to get a weaselly politician to build an ark by having animals chase him around.   So pathetic.   Such a contrast to Bruce Almighty which was actually pretty funny and clever."}, {"rating": "1", "text": "Evan Almighty reeks like something one might produce from a squatting position."}, {"rating": "3", "text": "Trying embarks on the success of its predecessor, and fails miserably.    .    ."}, {"rating": "2", "text": "Is this film supposed to be funny? Is toning down the first film to a PG movie and getting rid of the best part about that first movie (Jim Carrey). Story is weak, script is laughably bad, as well as the acting. There was seldom any scenes where I could actually laugh without feeling it was forced. A thoroughly bad movie, almost laughable (Ha-Ha-Ha)."}, {"rating": "3", "text": "Evan Almighty cannot be described as anything else but goofy. In fact, about the only thing worth watching in the movie is Wanda Sykes' comedy. other than that, this is a bore, even if Morgan Freeman plays god."}], "recommendations": ["wild_hogs", "grown_ups", "yes_man", "dinner_for_schmucks", "the_ridiculous_6", "a_million_ways_to_die_in_the_west", "knocked_up", "thunder_force", "the_interview", "ted", "ted_2", "the_happytime_murders", "this_is_the_end", "confessions_of_a_shopaholic", "tropic_thunder", "the_dictator", "night_at_the_museum", "norbit", "burn_after_reading", "idiocracy", "step_brothers", "one_year_one_night", "neighbors_2_sorority_rising", "old_dogs", "hot_tub_time_machine"]}