{
  "id": 3614,
  "title": "Event Horizon",
  "starring": [
    "Laurence Fishburne",
    "Sam Neill"
  ],
  "runtime": 96,
  "genre": [
    "Horror",
    "Science Fiction",
    "Mystery"
  ],
  "description": "In 2047, a group of astronauts are sent to investigate and salvage the starship Event Horizon which disappeared mysteriously 7 years before on its maiden voyage. However, it soon becomes evident that something sinister resides in its corridors, and that the horrors that befell the Event Horizon's previous journey are still present.",
  "releaseYear": "1997",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6b5Kux470PpQkgBdRqE9WtUpYfE.jpg",
  "categories": {
    "plot": 5.391304347826087,
    "acting": 6.5,
    "ending": 6.666666666666667,
    "soundtrack": 4.5,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 6.5,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "The critic score of this movie on sites like this and Rotten Tomatoes just goes to show that they are completely useless. This is one of the most underrated movie's of all time. I love everything about this movie. Out also has an incredible cast, which includes Lawrence Fishburne, Sam Neill, Jason Isaacs, and Richard T Jones. Horror, Sci Fi, and Hell... What is there not to like?"
    },
    {
      "rating": "10",
      "text": "Especially for its time, this movie was amazing. The visuals were awesome and it is scary as hell. In regard to EricC's comments, Solaris was ok... but hardly mind blowing. lolStarTrek Generations did the same thing, only better."
    },
    {
      "rating": "10",
      "text": "This brilliant thriller is oft misunderstood. People are catching up that is a cult classic that will enter the larger public consciousness shortly (or, perhaps never;). Aside from completely brilliant references to other excellent movies (won't spoil for you) and interesting philosophical, physical, and metaphysical questions, it wis, to my young mind (watched it when it came out), the most terrifying question. Upon a re-watch, I laughed through it and enjoyed the horror fwew. It,s actually a rather well-executed idea visually and dramatically; the characters are interesting. More than anything, I appreciated it as a lovestory. I would call this «black romantic comedy\", 10/10 (negative 0 being the lower end of the scale, F(Y)I]."
    },
    {
      "rating": "10",
      "text": "Haunted house in spaceship. It's certainly niche. I watch alone in the dark on a 50\" Hardware Calibrated screen 4 feet away. Absolutely terrific."
    },
    {
      "rating": "10",
      "text": "The movie has a perfect blend of scifi, horror and mystery elements set against the cold void of space."
    },
    {
      "rating": "8",
      "text": "This movie failed in the box office but is a hidden classic gem. One of Sam Neil's best career performance also starring Morpheus(Laurence Fishburne) lol"
    },
    {
      "rating": "8",
      "text": "A fantastic \"horror in space\" thriller led by an excellent assemble cast (Laurence Fishburne, Sam Neil, Kathy Quinlann). Do we really want to know what can be found at the edge (event horizon) of a black hole?"
    },
    {
      "rating": "10",
      "text": "A master piece blend of scify and horror. The entire cast makes a super job. The atmosphere is sublime. The only bad thing this movie has is that there has been no sequel yet."
    },
    {
      "rating": "8",
      "text": "Despite it's dated CGI effects and the cliché moments, this is a pretty effective sci-fi horror movie. The acting was good, the practical effects were impressive, the movie was very atmospheric and there was a constant claustrophobic feeling to it. While it's not a movie for everyone, Event Horizon is still a very underrated sci-fi horror classic."
    },
    {
      "rating": "8",
      "text": "Event Horizon is a highly original and atmospheric science fiction horror film that took me a couple of watches to really understand why it's so great. It's disturbing and memorable scares, and haunting cinematography make for a scary ride through this terrifying classic sci-fi movie."
    },
    {
      "rating": "8",
      "text": "While, having a fair share of flaws, Event Horizon is the perfect late-night popcorn horror movie. It has a decent cast, spooky set pieces, a frightening villain, and a daunting revelation to put the cherry on top. It even has little bits of comedy which makes it all the more enjoyable."
    },
    {
      "rating": "8",
      "text": "I think this was a fantastic movie.  Yes, there were a few plot holes that didn't make perfect sense, but as far as sci-fi/horror films go, this movie ranks among the best.  It is thought provoking, and is not just a standard \"jump scare\" movie.  For the time, the visual effects are amazing, and not over-done.  I don't see why people gave it such a low rating.  In the genre, it ranks at least a 7/10."
    },
    {
      "rating": "8",
      "text": "I would kill to have acess to the original cut before it was lost forever.."
    },
    {
      "rating": "9",
      "text": "One of the best scifi horror movies.  Great story, excellent actors and threatening surroundings.  Moment you set your feet in Event Horizon you know something is wrong with this ship."
    },
    {
      "rating": "8",
      "text": "This looks absolutely great, all practical effects beautifully composited. It is very stylish and looks unique but also fitting genre conventions. Some of the subtle use of CGI looked a little dated but nothing major. Very good sound. It worked well on all levels. I liked the music. This is hell in space! In fact it is Hellraiser (1987) vs. Alien (1979) and also slightly inspired The Matrix (1999). It is scary, gory, jumpy and slightly funny at inappropriate times. I liked the story. There are some major big scares that made me jump like mad. I was also nervous to walk around the house thinking that there would be scary demons and hallucinations around every shadowy corner. It's a good film that you can easily see what inspired it."
    },
    {
      "rating": "10",
      "text": "The \"critics\" almost always succeed in making me laugh at their ratings. They're either extremely overrated (usually with big movie companies) or underrated (as with this movie). Event Horizon is one of the two best sci-fi horror movie of the last decades. It's  claustrophobic, psychological, terrifying and extremely well acted and directed."
    },
    {
      "rating": "7",
      "text": "Event Horizon is a good chamber Sci-Fi thriller. You just shouldn't expect scale and realism from it. Event Horizon is just a thriller with horror elements. Horror failed, suspense does not pull the whole film either. And only the sad ending turned out not bad"
    },
    {
      "rating": "10",
      "text": "○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"
    },
    {
      "rating": "8",
      "text": "Completely underrated horror by the critics as usual. A bit dated but still holds up."
    },
    {
      "rating": "10",
      "text": "A cult classic that clearly went over the heads of the critics. Amazing cast, amazing set design, original story, brilliant acting, great practical effects, great camera work and great directing. This film has all the ingredients to be a genre changing horror film. I highly recommend this film. YOU WILL LOVE IT!!!"
    },
    {
      "rating": "10",
      "text": "On my Top 10 sci-fi movies of all time, a must watch for fans of Sci-Fi horror. The cast is great, the ship is great, would attempt rescue to Neptune again!"
    },
    {
      "rating": "10",
      "text": "Destrozada en su momento, pero que en la actualidad ya es un clásico de culto, tenaz y aterradora."
    },
    {
      "rating": "8",
      "text": "I don't think Anderson can write a decent screenplay, but he he can nevertheless direct a decent movie. Event Horizon attempts to be a schlock horror films full of cliches and trite characterisation: it really does. Cue foreshadowing, the whittling down of characters, and a healthy dose of gore... but in reality this movie is far more than the sum of these genre stereotypes and the critics should have seen this . This is as much a psychological thriller as it is a horror movie. It is a movie in which the \"aliens\" never do appear - never can appear - but can get into the minds of their victims to make them prey, antagonists and tools."
    },
    {
      "rating": "10",
      "text": "I don't understand the bad critics. I feel this film ist the best horror-scifi film since 2000. It's better than Alien 4 (but not better than Alien 1-3). The horror in this film is not only physical it is also psychological. The acting is good to very good. The plot is simple but absolutely OK for a horror movie. And it's also great to see that african american actors not only play roles as cannon fodder or comedic relief. I think some critics are very narrow minded and dogmatic, when they claim a horror movie should only rely on suspense and thinks you don't see\". Concluding I i would say that this movie is way to underrated - you don't have to feel like me and give it a 10, but come on this film deserves at least a 8 ."
    },
    {
      "rating": "8",
      "text": "You won't need eyes to see how awesome this movie is. (actually you will cause it's probably not all that great as a radio play).  I can understand someone feeling the movie is mediocre, especially if they went in expecting Sci-Fi and got a big dose of horror instead.  But a 0 ranking? that's ridiculous."
    },
    {
      "rating": "10",
      "text": "Loved this movie for a long time so I feel obligated to review it. Alien was terrifying because of what the creature would physically do to you during your horrible death. Event Horizon's antagonist, hell itself, is immeasurably worse... Dying just means you get the luxury of going there for all of eternity, and being tormented by an entity or entities so cruel that a mortal mind cannot even fathom it. There's no reference to Satan, making it even worse, because this evil is purely foreign, leaving no chance of bargaining with it/ reeling off nice things you did in life so it'll torture you less... No... You don't just ever want to end up in the hell of Event Horizon, at any cost, and that's why this movie is boss."
    },
    {
      "rating": "8",
      "text": "I honestly do not understand the hate the critics had for this film. The primary complaint seems to be that it makes little sense, and its frightening scenes rely on cliches. I don't think either of those complaints are fair. The ship itself literally went to Hell and back, and is even described in the film as having come from \"pure chaos\". It's not supposed to make sense, because sense is a psychological luxury that probably wouldn't exist in Hell. As for cliches, I don't think that's fair either. I'm not a big horror buff, so maybe I just don't see it, but the psychological and physical torment that occurs in the film came off to me as somewhat creative--at the very least, a very well-done cliche. I can totally see why this is considered a cult classic: it's extraordinarily original in its premise, and watching it is, at times, surreal, and very entertaining.Now, if I had one complaint, it would be that it pulls its punches when it comes to horror and gore. Yeah, it's gory, but it's not *that* gory. But I can't knock points off for that because the director himself stated that he was forced by the studio to tone down the gore, which supposedly turned initial audiences off. He's said that he's very sorry he was forced to do that, and he feels it takes away from the effect the film is going for. I'm inclined to agree; for a film essentially about a glimpse into Hell itself, the violence and gore is pretty minor, and I can tell that quite a bit of it was cut or toned down a lot. Still, I liked this film. The characters were entertaining, and the happenings on the ship were creepy, until the final surge of violence at the end as very bad things start to happen. The \"final battle\" with the main bad guy isn't particularly climactic, though, and his design didn't strike me as creative or particularly frightening. Since the horrors on the ship are personal for each person, I would have imagined the good guy's past mistake that cost someone his life as the form of the bad guy, in his post-mutilation form. Well, that's how I would have done it, anyway. Still, it's an entertaining movie, and I wouldn't mind seeing it again."
    },
    {
      "rating": "8",
      "text": "This movie is just too underrated. One of the very few horror films that provides a truly scaring experience. It has its flaws, but they're outweighed by quality acting and special effects."
    },
    {
      "rating": "3",
      "text": "I was just reviewing the terrible AVP which I, unfortunately, just saw. I thought I'd see what was up with this one since I knew Anderson directed it and actually thought he had a tad bit of potential after I saw this movie, but Alas, it's a resounding no. Well, from what I can remember, Event Horizon was pretty good up until a certain point and then took the proverbial nose dive into total shlockery. It looked great and had a pretty convincing atmosphere of dread. The palette was very sickly and put me off for most of the film. It was a very effectual way of making me feel uncomfortable in a good way. I remember a lot of yellows and greens. So, I was thinking the climax was going to be very satisfying, but it unravelled once they really started to \"explain\" what the mystery was. I will just say it was ludicrous, ruined the movie, and I will leave it at that. I think that was the point where Anderson started his trip into bad director land."
    },
    {
      "rating": "8",
      "text": "Space is just a great setting for horror. The sense of isolation and \"how do I get home?\" mentality add an atmosphere of hopelessness to already bleak circumstances. The futuristic technology that comprises the scenery of these dark, cold ships can be haunting in ways that those creepy mansions just can't. Event Horizon has all of that, but while other sci-fi horror flicks take the standard alien(s) approach, this one goes for a more paranormal angle.\r Does this allow Event Horizon to change the game and bring a new level of horror to outer space? No, not really. When it comes to actual horror, this movie just isn't scary. That's mostly because it can be kind of dumb. However, even the face of it's occasional ineptitudes in writing, it's great premise and liberal amounts of blood and WTF moments make it quite a bit of fun.\r The cast is on point as far as performances go. Granted the characters they're playing aren't much to speak of, but they give it their all with what they were given. It's also a really gorgeous film. Director Paul Anderson's visuals as far as the ship goes are gorgeously futuristic and unnerving. This is one creepy ship. Not all of the CGI has aged well, but the practical effects still look really good. The blood and gore is still pretty nasty to this day.\r So how about that plot? Well, like I said the characters aren't well written individuals. Just faces to suffer through the events. The events themselves are pretty entertaining. While you basically get the core idea of what's going on, there are other elements happening that go unexplained. The whole thing ramps up at such a ridiculous pace that the lack of explanation is only more noticeable. By the time the blood really starts flowing all of the crazy crap happening onscreen starts to seem just so dumb. The movie starts off with this kind of creepy vibe reminiscent of the Alien series and makes you think that things will get scary. However it's not long before you realize that it just won't and will end up relying on blood and creepy spaceship imagery to deliver it's thrills.\r While all of that is a disappointment, the movie is still able to deliver it's thrills. Just not the scary kind. It's an out there and visually stunning ride. One that's stupid crazy enough to keep you watching. Anderson may not be able to deliver the writing or frights necessary to make a truly great horror film, but he's able to make an absurdly fun one. You may be required to check your brain at the door, but if you just want to see some nasty stuff happening in the truly creepy expanse known as outer space, then give Event Horizon a shot. It's one trip through the galaxy that's way more fun than it should be, lack of scares and all.\r 8.9/10"
    },
    {
      "rating": "8",
      "text": "Highly underrated, don't know because it's directed by Paul Anderson or, simply, is a Sci-Fi horror. But for sure is still one of the best on the market, even if is 15 years old. The plot is entertaining, the setting simply terrific and the actors performance good enough, while the soundtrack and the visual effects are simply awesome. A true must see."
    },
    {
      "rating": "0",
      "text": "This is a cult classic. Jeez. It's laughably bad, to be painfully honest. But as funny as it is, I never, ever want to see it again. Seriously, people, go watch The Thing if you want to be disturbed or the orignaly Solaris if you want your mind to be blown."
    },
    {
      "rating": "7",
      "text": "Really only falls apart the last 20 mins. It seems like the writers and director had a smart sci-fi movie going then the execs butted in and had them throw a bunch of nonsensical things in at the end. Still, I enjoyed this movie."
    },
    {
      "rating": "3",
      "text": "This movie has a certain cult status, which implies that it has no real status, and let me tell you why: IT SUCKS on an gargantuan level.\rThe first 20 minutes or so are actually pretty good in setting up the mysterious mood, but after the crew enters the \"Event Horizon\" the movie disintegrates into a string of horror movie cliches. There is really no story at all, the crew is forgettable (except for the two leads) and plausibility and creativity fly straight out of the air-lock.\r This is \"haunted house\" schlock in space, stay away from this stinker."
    },
    {
      "rating": "10",
      "text": "This movie scared the crap out of me, I'm a big sci-fi buff and I could not listen to The Prodigy in the same way again"
    },
    {
      "rating": "6",
      "text": "Won't deny this film is incredibly scary and disturbing...but it feels edited and shortened as if there was a bigger story to tell. Okay, but could have been better."
    },
    {
      "rating": "7",
      "text": "I have a very mixed feelings about this movie. The idea is brilliant, though for many it might look trivial. It is actually the main reason I am writing this review. The first part of the movie suits the idea perfectly. It is very atmospheric. Unfortunately the closer the movie is to the end, the less creativity and spirit is observed. The feeling is the director failed to hold on."
    },
    {
      "rating": "3",
      "text": "“Hell is only a word. The reality is much, much worse.”Developing a cult following for its terrific set design, gruesome sadomasochist iconography and otherworldly Lovecraftian themes, this $60 million cosmic horror shoots for the stars as ‘The Shining in space’, but slips into a worse dimension with a frustrating sci-fi spin on Clive Barker’s Hellraiser. Plagued by many demons during a troubled production, such as its rushed editing schedule, unfinished CGI and poor sound mix, the film falls apart with gory sequences that feel torn to shreds and stitched back together, not too dissimilar from Sam Neill’s hokey turn after a strong set-up in the first act. Aspects like the techno-gothic aesthetic and spooky atmosphere contribute to a sense of foreboding and dread, but sadly never pay off, thanks in no part to a mediocre Philip Eisner script and ill-advised studio meddling. Despite horrifying visuals and a host of game character actors, in particular the tonally jarring but hilarious Richard T. Jones, Paul W.S. Anderson misses the mark for a dull 96 minutes that doesn’t point to a longer, better cut lost to time and space. Shame he passed on helming X-Men for this.3/10 pens through folded paper."
    },
    {
      "rating": "5",
      "text": "While I'm quite aware it has become a cult classic for some audiences I must say I was disappointed with this movie and it's shame because it has really cool elements of horror and also the whole space narrative. It's a pity.I'm pretty sure a better director could have made something better out of this."
    },
    {
      "rating": "7",
      "text": "Event Horizon has large ambitions and is clearly directed by a cohesive vision. The sets used look great and and at its best can give the viewer 2001 vibes. There is intellect regarding the technologies of the ship and the theory behind faster than life travel. The plot is original and the horror can be disturbing. Set pieces are exciting and well constructed. However, its shortcomings, mainly the script and occasionally the acting hold it back and prevent it from reaching its full potential. The script does not have the same level of intelligence as the scientific principles it explains, meaning that the film is only sporadically clever. Sam Neill is competent as the brilliant scientist but Laurence Fishburne mainly goes through the motions. The supporting characters are all relatively plain, tame, cookie-cutter, horror death fodder but the film occasionally tries to make them more. Despite these criticisms, Event Horizon is a fun movie that deserves cult appreciation but perhaps not much more."
    },
    {
      "rating": "7",
      "text": "Event Horizon follows a small crew of scientists to the abandoned and thought destroyed ship, the Event Horizon orbiting Neptune. Once on board the Horizon they find things are not quite right; that the ship, with its ability to bend the very fabric of space, has managed to go to an alternate dimension and back resulting in the ships old crew to go insane and kill each other.  As the grisly memories echo through the hallways, one of the crew members plans to send the Horizon back to the alternate dimension along with the rest of the crew.\rA well executed psychological horror film with a great cast and some decent scares, plus an interesting plot to tie everything together. Why the critics hate this film I cant understand"
    },
    {
      "rating": "7",
      "text": "I have always considered \"Alien\" to be one of the best sci-fi films ever, so if you are going to steal, you might as well steal from the best. For me, watching \"Event Horizon\" as an homage to Ridley Scott's masterpiece makes \"Event Horizon\" more interesting than it would otherwise seem. Of course, some viewers may simply write \"Event Horizon\" off as a cheap and tawdry ripoff, which is an understandable reaction to a film that often seems content to be a lurid and disgusting albeit visually splendiferous gorefest, with a third act literally covered in blood."
    },
    {
      "rating": "7",
      "text": "Space ship designed to create black holes and travel instantly literally goes to hell, gets the crew killed and then kills the rescue team that comes to help."
    },
    {
      "rating": "5",
      "text": "The movie wasn't quite as bad as many of the critics claimed, but the dialogue was very cliche and corny, especially at the beginning of the movie. The creators probably did get some of their ideas of a psychological space thriller from ancient corny Soviet 60s films, which are utterly unwatchable for people like me who are used to better cinematography, such as Solaris, but the plot of this film was clearly different.\r This film was easily the scariest Sci Fi film I have seen. The liters of blood being spilt were probably a bit too much, but it had its impact. The way that the story went on without really explaining itself, or what it was exactly that was getting into people's minds and killing them, added to the horror.\r Many critics pointed out that the atmosphere and technology of the Event Horizon was starkly different from the rescue ship, I agree. It was unexplainably different, and looked like something that belonged on a stereotypical alien spaceship as it looked so different. There were many Gothic-esque spikes located all around the FTL engine, and the access tunnels in the engine room were all bizarrely colored, with green and blue glows.\r Some critics complained about the fact that Dr. Weir had to explain to the crew how his faster than light engine worked, because they should have known more about elementary physics, seeing as they work in space. I disagree, most of the main characters were more of the very expendable \"Space Soldier\" mold of space explorers from Stargate,  Alien II, or Starship Troopers, and had plenty of applied engineering, medical, or combat expertise, but they were not the contemporary highly educated and decorated astronauts of our time. This movie, like Alien II (in comparison to Alien (I)), is set in a time when space exploration is commonplace, so the people doing the exploring are not necessarily highly intelligent or educated, and have to be easily replaceable by other trained, but not very educated, personnel due to the fact that space accidents are happening all the time.\r The common complaint I understand the least is the one that says something along the lines of \"We never even found out exactly what happened to the crew of the Event Horizon 7 years earlier!\". Did you not watch the part of the movie where they fixed the log, and played the recording of the crew dying? They clearly did not survive, and died in unimaginable circumstances. When they found the ship 7 years later, it was extremely cold, and life support was not on. Do people really mean \"We never found out what happened to all but one of the bodies if the original crew...\"? That is never explicitly explained (you could speculate that they got vented into space, or sucked into the liquid around the FTL engine). The movie clearly, and graphically shows exactly what happened to the original crew, and some lines towards the end of the movie also confirm this."
    },
    {
      "rating": "0",
      "text": "This is by far one of the worst movies I have ever seen! The story is awful, it is really boring, and it makes absolutely no sense. I don't know how anyone could give this a 10."
    },
    {
      "rating": "6",
      "text": "Bad acting and dialogue but it has it's spooks and gores. I thought it had potential but it just wasn't executed  well, IMO. I don't really see why it's so popular."
    },
    {
      "rating": "5",
      "text": "Fairly unique scifi-horror that's mildly entertaining but also completely ridiculous."
    },
    {
      "rating": "2",
      "text": "It is supposed to be a horror movie but the only thing it succesfully did was irritate the hell out of me with the cheapest jumpscares i've ever seen for a good half of the film. The characters are not endearing at all, i didn't feel anything when watching them die one by one (in the most predictable way i must add). This film is complete garbage in my opinion. I was never scared, never intrigued, never sad/happy for the characters, never nothing. The direction is uninspired af which makes the movie soooo boring. It's a shame because the story was kinda interesting but the telling was horrible. For exemple, they don't stop describing hell as the most disturbing/torturous place but we never see any of it except badly lit props and Sam Neill with too much make up. Looks more like schizophrenia than hell to me.This movie is a such a mess."
    },
    {
      "rating": "3",
      "text": "The biggest problem with this movie is that it is all build up with no bang. Imagine staring at a bomb. You watch the bomb's timer count down from 10 and as the counter reaches 0, nothing happens. The bomb doesn't detonate and you go about your day. If you pardon this weak analogy, it is actually a perfect comparison to this film. Every time something tense happens there is no payoff. Its all build up to nothing. For example while avoiding spoilers, a character will be in a room of the ship and they get the feeling of being watched. They snoop around for five minutes and nothing happens. Its extremely annoying and makes the entire film lack any sense of dread as you know no matter what you think will happen, nothing will. On top of that characters all act stupid, as they ignore things imperative to their survival that have had explained to them. One of the characters is so stupid that I was actually glad that they died. Only a few deaths seem to feel authentic to something that would actually happen in the given situation. Most of them however seem fabricated by \"horror movie syndrome\" with people acting stupid just so we can watch them die. So along with stupid characters, and weak horror aspects my biggest gripe with this film is of how much wasted potential it had. At the beginning the movie was giving Dead Space vibes. This is nothing short of a good thing as DS is one of my favorite video games series ever. But as it progressed what seemed like a movie that was going to be DS or Aliens-like slowly turned into a House on Haunted Hill (the 1999 version), IN SPAAAAACCCCEEE! I do not recommend this film. Although the atmosphere is amazing and the acting is actually pretty good, halfway through the film it just turned into a different movie. A stupid one."
    },
    {
      "rating": "1",
      "text": "I can't tell you how this ends because I could not stand to watch it any more.  I knew from the beginning that it was doomed when they relied on attempts at startling the viewer(s?) with sudden over the top volume music in scenes that did not deserve it.  Why would you resort to this in the early stages of a movie when it is not warranted?  Probably because this movie does not warrant being watched unless you just like to watching Si-Fi Goth sets.  I give it a 1 because it is just a bad movie but I have to leave room for the really terrible ones.  If the studio really wanted to piss away 50M$ I have suggestions and none include making crap like this."
    }
  ],
  "recommendations": [
    "the_descent",
    "the_pyramid",
    "monsters",
    "sunshine",
    "the_conjuring_2",
    "color_out_of_space",
    "it_follows",
    "antlers",
    "the_last_days_on_mars",
    "pandorum",
    "insidious_the_last_key",
    "chernobyl_diaries",
    "mirrors",
    "malignant",
    "dark_skies",
    "annabelle",
    "the_ritual",
    "scary_stories_to_tell_in_the_dark",
    "signs",
    "the_conjuring",
    "a_quiet_place",
    "the_medium",
    "the_mist",
    "captive_state",
    "the_cloverfield_paradox"
  ]
}