{
  "id": 1334,
  "title": "Everest",
  "starring": [
    "Jason Clarke",
    "Josh Brolin"
  ],
  "runtime": 121,
  "genre": [
    "Adventure",
    "Drama",
    "History"
  ],
  "description": "Inspired by the incredible events surrounding a treacherous attempt to reach the summit of the world's highest mountain, \"Everest\" documents the awe-inspiring journey of two different expeditions challenged beyond their limits by one of the fiercest snowstorms ever encountered by mankind. Their mettle tested by the harshest of elements found on the planet, the climbers will face nearly impossible obstacles as a lifelong obsession becomes a breathtaking struggle for survival.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4xmndWnTYTE4bDdlWrkZyaGcZlo.jpg",
  "categories": {
    "plot": 6.987654320987654,
    "acting": 7.083333333333333,
    "ending": 6.8,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 9.0,
    "action": 7.111111111111111
  },
  "reviews": [
    {
      "rating": "7",
      "text": "This movie was overall a fairly good movie. The acting was relatively good, while the movie continued to give out solid suspense throughout it. Unfortunately, it could have done a better job at making the audience feel as if they were actually in the mountains than it did."
    },
    {
      "rating": "8",
      "text": "I might not have been ready for the kind of movie I just watched because this was a deeply emotional and visceral disaster film. I was expecting a little more of a mindless action thriller than the amount thematic depth that I actually got, and it was a very memorable and intense ride. Everest dramatizes the 1996 Everest disaster that lead to the deaths of eight people, and the movie involves two groups that get caught in a violent storm while climbing Mount Everest. It actually takes a while to get to the real meat of the story. Maybe 40 minutes pass before the storm is even referenced, but the movie gets so intense and emotional during the last half that it makes up for the slow pacing of the first half. Luckily, the slower first half allows us to get to know each character, their motives to climbing the mountain and each of their backstories. The second half is so much more effective because of this. One thing that bothered me about the film were these random lapses in time that were distracting at times. One moment it would maybe be 2:30 PM, and thirty seconds later, it'll be 5:00 PM. Some of the transitions just felt choppy, but it's not such a big deal that it takes away from the film. Everest is a movie that grabs you and takes your breath away for 2 hours, and it's one that you need to see in the theater."
    },
    {
      "rating": "8",
      "text": "Everest was not a movie that I was really looking forward too, I was not really expecting much when I entered the theater. But boy am I glad that I went to see this movie, it looks beautiful, every single performance is amazing. I really cared for the characters and that is what the director does at the beginning of the movie, he makes you fall in love with the characters and then you get sad when they start to die. The top performers were probably Jake Gylenhaal, Josh Brolin, and Jason Clarke, those were the best but I think all of them did really good. I was fun to see Sam Worthington in a good roll. Every character in the film was amazing and every shot in the movie was amazing!"
    },
    {
      "rating": "9",
      "text": "1996 - The deadliest year (19 fatalities) ever on Mount Everest during a trek, chronicled by writer Jon Krakaeur in \"Into Thin Air\". With 1 fatality for every four successful hikes to the summit, what does it take for one to dare into Mount Everest's \"death zone\". Man is it simple named that way? With low-oxygen and harsh and rapidly changing weather conditions, Director Baltasar Komakur provides us the ultimate experience and this is the closest most of us viewers are ever going to get to scaling the world's highest peak.\r Rob (Jason Clarke) is the leader of an expedition guiding company called Adventure Consultants, specializing in commercial mountain climbing of Mount Everest. He leads eight of his clients to the summit. The director gives the viewers’ time to acclimate to the expedition group and the dangers involved, while the cast acclimate to the altitude and oxygen deprivation.\r The entire crew and cast crew has done an excellent job in crafting and bringing to life this real-life disaster with an emotional consistency as well. Everest definitely dares you to imagine what it must be like to be at the top of the world with everything around going horribly, horribly wrong. With the fates of the different climbers unsure, Everest is nail-biting tense. But as the true consequences of the disaster becomes clear, that tension turns into grim sadness amid frozen corpses.\r Everest boasts of a handful of spectacular shots that show how small the climbers are against the awe and majesty of Everest (definitely watch in IMAX if you can). Those shots are relatively scarce and one of the most effective uses of IMAX is when Beck slips while trying to cross a terrifyingly deep chasm over a wobbly ladder. Maybe if we experienced less of the climber's suffering and more of the mountain's majesty, their adventure would have been more inspiring.\r While there are moments where the towering peak is overshadowed by the human dram, the viewers can forgive them in favor of the compelling experience of ascent and descent to the summit which is heaven for a moment and hell the next."
    },
    {
      "rating": "7",
      "text": "Major props go to Jason Clarke and Baltasar Kormakur for turning what could have been a superficial, high-octane cash grab into a truly meaningful, character-driven cautionary tale of survival and the limits of human exertion."
    },
    {
      "rating": "9",
      "text": "I found Everest to be a very powerful film. I agree that the characters could have used more development, particularly Scott Fischer (Jake Gyllenhaal), but I still experienced a roller coaster of emotions from seeing the tragedy unfold.\r I also really like the fact that they stayed true to how the tragedy actually happened, instead of changing the plot to suit the typical \"most people die but the protagonist survives\" formula that we see so often in films. It was great to get a dose of realism and realize that even the most experienced and knowledgeable people can still fall prey to nature when they make bad decisions and get unlucky.\r Meanwhile from a technical and visual aspect, the movie is an absolute masterpiece - the visuals are breathtaking and you can actually feel like you can experience the cold, lack of air, and desperation that the climbers felt."
    },
    {
      "rating": "6",
      "text": "On a technical scale, \"Everest\" is breathtaking and capable of offering visceral thrills enough to keep the attention of its audience. On a human level, however, this is a disappointingly underdeveloped affair that comes across as a squandered opportunity more than anything else. This particular story demands and deserves far more of an introspection into the tragedy of that fateful day in May 1996 that killed 12 people; the social issues that surround it; and the immense personal cost to those left behind. The film's screenplay offers little to none of this and the emotion it possesses can be sourced in the remarkable and committed performances of an accomplished ensemble - Josh Brolin, Jason Clarke, Jake Gyllenhaal, Keira Knightley and Emily Watson throw themselves into their respective roles one hundred percent, both physically and emotionally. The acting aside, I feel as though there was a lot more emotion below the surface, waiting to be discovered. It's unfortunate that the film doesn't take the chance to try and find it."
    },
    {
      "rating": "7",
      "text": "Having read Jon Krakauer’s riveting account of these events in his book, Into Thin Air, I was really looking forward to this movie.  But, after reading some of the User Reviews here on Metacritic, I had lowered expectations and almost didn't go see it.  That being said, Everest exceeded my expectations.\r I often find that the first few lines of dialogue provide an early indication of a movie’s overall quality, and several people had reported that the dialogue was not great.  My take, it's not brilliant, but it’s not totally lame either.  Also, the special effects aren’t over the top ridiculous.  However, the 3D doesn’t really add much to the movie, so feel free to see it in standard format.  The most unrealistic aspect of the movie is probably the way the climbers are dressed. Despite temperatures well below zero, they constantly take off their gloves, leave their jackets unbuttoned, and continuously expose their faces and heads to the elements, but I suppose it wouldn’t be much of a movie if you couldn’t see their faces.  At least they’re not dressed in tank tops like Sylvester Stallone in Cliffhanger!\r Fans of Into Thin Air, should take note that this movie is NOT based on Krakauer’s book.  It’s the same story, but told from a different perspective and it does not paint Krakauer in a particularly kind light.  (Krakauer has called the movie “total bull”.)  Most of the events in the movie are ‘pre-storm’ and I thought more time should have been spent depicting events that occurred during the storm.  This lack of detail left me confused about what really happened.  In addition, the movie leaves some of those who died on the mountain completely out of the story, and mentions them only by way of the closing credits.  Despite its shortcomings, it’s still an interesting story about Everest, climbing and the potentially lurking dangers of adventure travel."
    },
    {
      "rating": "6",
      "text": "I think the build up was very strong, and i enjoyed the film overall. However, i wanted it to end, and I hate that feeling. I think the s enes with the wives and family at the end did not flow well with the film. Amazing cinematography."
    },
    {
      "rating": "7",
      "text": "Nicely done, great cinematography. We actually feel cold while watching Everest. The cast is superb, especially Clarke, Brolin, Hawkes and Knightley. Gyllenhaal is amazing but his character lacks development so as the other ones. Despite the interesting and moving stories of the main roles, this movie is more of a documentary about the 1996 tragedy. The loyalty and details in the narrative sometimes make it looks like a BBC film or something. Script's attention to the fact itself also jeopardizes dialogues and characters a little bit. The final result is definitely entertaining and good but it lacks the cinematic language we expect while watching a film."
    },
    {
      "rating": "7",
      "text": "Never again will I look at a mountain the same way after seeing this movie.\r The story is about a group of climbers tackling Mt. Everest must fight to survive after a devastating snow storm leaves them stranded. The film is based on a true story of the 1996 Mount Everest Disaster.\r So I've just seen Everest and it was pretty good. What I thought the movie did a great job is making me care for the characters and I also liked how I felt like I was 29 or however thousand feet high on this mountain with the characters.\r The cast in this movie is freaking huge and every single one of them and yes even Sam Worthington was great in this movie. Jason Clarke and Josh Brolin were both absolutely phenomenal in this film and easily the biggest stand out of the movie. Jake Gyllenhaal was great too and I was quite surprised that he wasn't the main character as me and everyone else thought he was, because I watched the movie not knowing too much about the real life disaster itself and I actually thought that Gyllenhaal was the main star at the first, but he wasn't.\r There was never a point in the film that I can say that was bored, I mean at the beginning of the movie it's just these guys camping for a month getting ready to climb the mountain and you would think that will be boring right? nope, not here as the performances, the characters and every detail about climbing Everest kept me interested and locked on.\r The score is another thing that was great in the movie, and so was the cinematography that was just flat out gorgeous and truly breathtaking to watch.\r Now for the problems: The movie did feel a little bit too long and yes I know it's two hours long, but at some point I did felt like it went a little bit over in parts. The movie did have some pasting issues in some parts and that's really it for problems.\r Overall Everest isn't a movie that I'll call \"great\" but I can say that I enjoyed watching the movie and it's worth seeing."
    },
    {
      "rating": "9",
      "text": "If your looking for a convenient plot then turn around and walk into Pan because this film is hard to watch at times. This film is defies film stereo types in what is probably the most depressing, grim and just straight up hard to watch movie to come out this year. The lead in this film is shared by both Jason Clark and Mount Everest itself. Jason Clark kills it as Rob Hall and shows no flaws in what might be an Oscar contending performance. Support was equally as impressive with people like Jake Gyllenhaal, Josh Brolin, Keira Knightley and Sam Worthington. Josh Brolin was easily the strongest of the supporting cast although like i said they were all very good. The only place this movie lacks is in developing the relationship between Rob Hall(Jason Clark) and his wife Jan Arnold (Keira Knightley). Now lets get to Mount Everest in the film because it is both the most beautiful and terrifying thing about this movie. They did a great job of outlining the dangers of this beast but also showing off its beauty. Overall a great film and a must watch."
    },
    {
      "rating": "8",
      "text": "Glorious at its name, the film is not a blockbuster with intense actions or CGIs, thanks to its original source from a true story in 1996, it works well as an adventurous hiking drama. The beginning is pretty surprising as it does not drag much and straight progressing to Nepal, followed by preparation for the climb and then most of the second half turns into a terrifying experience struggling to survive. At certain parts, there's some flaws of jumping scenes due to editing and it's quite confusing to track who is who due to too many characters but the cast has delivered promising performances and the stunning cinematography has brought audiences the great scenery of the peaks. The journey ends in an inspiring way that even though hiking is challenging, the psychology to deal with death and to face the reality are the hardest in life."
    },
    {
      "rating": "10",
      "text": "Everest soars high to great heights, thanks to terrific performances, great and spectacular visual effects, and research to make history come back to life. It would have been better if the film was released on May 2016, 20 years after the disaster. Thanks to 3D VFX and groundbreaking, new generation computer generated imagery, it even makes the audience feel like mountain climbers crossing tough terrain to achieve the near impossible with powerful portrayal of love, loss, bravery and friendship through the viewers eyes."
    },
    {
      "rating": "5",
      "text": "Stunning cinematography, gripping circumstances and a brilliant cast should make for an epic film. Unfortunately, whilst there are some good moments, this was an underwhelming experience. The pacing was poor, with a climax which fails to engage the audience emotionally, and you're left feeling as though you should have cared more about the real people who were a part of the journey. A mediocre film that's visually arresting but otherwise disappointing. 5.34/10"
    },
    {
      "rating": "7",
      "text": "Right off the bat ‘Everest’ is visually impressive with a mix of sound stage work and real location shooting in the Italian Alps and parts of Everest itself, the combination provides impressive and foreboding panoramas plus tense and perilous sequences.\r The decision to make ‘Everest’ a faithful representation of the tragically real and relatively recent events of the 1996 expedition puts the film in a difficult position which is reflected by some of its reviews. Baltasar Kormákur is damned for not injecting more cinematic jeopardy and making this more of an action thriller, almost as much as he would have been slated for desecrating the memory of those who perished had he sexed-up the narrative to make a more “Hollywood” production.\r If you’re expecting an action/adventure thriller ala Stallone’s ‘Cliffhanger’ you will be disappointed by ‘Everest’, think more along the lines of the 1993 real-life survival drama ‘Alive’ and you’ll understand the narrative tone of this film. Kormákur and the writers do a commendable job of painting a realistic portrait on the reality of climbing Everest, from the weeks of acclimatization before the climb to the several camps along the way and the physical consequences of climbing at extreme altitudes.\r Led by Jason Clarke, the all-star cast does a good job of fleshing out the characters and getting the audience to connect to them enough to make the tragic drama that develops all the more effective, particularly when you consider that these are real events being depicted, perhaps the performances are good enough to make us more overly sympathetic.\r The Bottom Line..\rAlthough constrained by its faithful adaptation of a real story in terms of narrative and action, ‘Everest’ is executed well enough to make it a striking and potent thriller and a different kind of disaster drama, a refreshingly realistic view of the most unattainable of human endeavours."
    },
    {
      "rating": "8",
      "text": "Edge of seat stress for 2 hours. Great thriller, some clunky plot and character lines, but overall very good.\rDon't bother with 3D Vmax, far better without 3D, way brighter, and the 3D dullness takes away from the epic nature of the mountain."
    },
    {
      "rating": "6",
      "text": "I found it a fairly bland disaster film personally.\rI found the first half hour was a poor way to introduce characters, and frankly found I didn't connect with any of them. I found that the film poorly demonstrated why it is that people will do silly things to summit and risk their lives. The characters barely had any backstory, and them trying to do such crazy things in the face of immediate danger wasn't expressed in a empathetic way. I felt as connected to the characters as I would to a character from a late 80s/early 90s slasher sequel. I couldn't empathise or understand why these people would do such stupidly obvious things. The loss of sanity caused by lack of oxygen, the hunger to summit against better judgement, none of this was portrayed well by the film for me.\rI also found the film jumped around time frames poorly, and failed to show the actual struggle of the climb itself, skipping months of going between base camps and painstaking climbing, instead just showing you a few dangerous high-octane moments. It felt like the movie Jaws, if the ocean was the size of an Olympic Swimming pool, suspense was edited out of the film, and people were still trying to swim laps despite everyone telling them there's a shark coming towards them.\rBut, to each their own."
    },
    {
      "rating": "7",
      "text": "Heart stopping thrills, brilliant cinamtography, and a solid cast are the highlights of Everest. It certainly is a stomach churning, brain turning and cold as hell movie. Some scenes felt so real that I actually felt bad for Jason Clarke and Josh Brolin and CO, as they fall down a grazing mountain to their grisly deaths, but they don't. Everest is the true story of the first men to reach Mount Everest, and their survival in the deep zero cold. First of all, the acting is great, each character shows major emotion and strong feelings that makes their character feel more real. But, why a 7/10 then? Because Everest tired and tried but it felt open ended and unneeded. The writing is rushed, feels like drama class lines. Direction is bare minimum with actors winding about in some scenes. But, if you crave perilous entertainment, Everest is the pick for your week."
    },
    {
      "rating": "8",
      "text": "If you have ever thought how cool it would be to climb Everest, you need to see this movie.  Based loosely (according to writer Jon Krakauer who was there and wrote about it) on an incident in May 1996.  There were too many people trying to climb the summit on the same day, ladders weren't in place and oxygen tanks were not full or where they were supposed to be.  And, on top of all that, an epic storm blew in and put everyone in extreme jeopardy.  The movie focuses on one group and their guide, New Zealander Rob Hall, and peripherally, another group, led by Jake Gyllenhaal's character.  The movie somehow makes you feel you are there, climbing, freezing, huffing and puffing, and exhausted right along with the climbers.  It all looked very real to me and I couldn't tell what was or wasn't the real Everest, Base Camp and higher up camp areas.  It all looked real to me.  Whether you know how it all ends or not, it is a real life thrill ride.  Suspenseful and riveting."
    },
    {
      "rating": "1",
      "text": "One of the MOST BORING movies ive seen. The reason i rated this even 1 was because of the scenery. Otherwise the movie lacked everything, too stretched and too boring."
    },
    {
      "rating": "6",
      "text": "Movies about attempts to scale the titular peak have been made before and probably better. This one's based on a real expedition that was plagued by harsh weather and other dooming circumstances. The first hour is spent setting up the characters as they prep for the big climb. The 2nd half takes the trek with methodical detail. Even though there are perilous moments, they seldom create much apprehension or drama. The cinematography offers incredible vistas and perilous perches that are even more dizzying in 3D. If you're into mountain adventures, there's enough here to like, but as cinema, it's less than gripping."
    },
    {
      "rating": "5",
      "text": "Decided to check this out this week since it's only playing in IMAX 3D for its first week and I thought it looked decent and intense. All I can say is man, what a disappointment! First off, the 3D felt so pointless and didn't invest me any further into the film. Hell, halfway through I pretty much lost interest and didn't really care anymore. Also, the cast felt wasted. For such a great ensemble, everyone's acting was surprisingly mediocre. The middle act felt cluttered and overstuffed with too much happening all at once that it was hard to keep track of all the characters and what was happening to them. And last but not least, the ending was depressing as hell with very little payoff. Yes I understand that these are facts and it was a true story, but that doesn't change the fact that it still put me in a downer mood as I left the theater. Overall, not as near intense as I would've liked and a waste of 3D, talent, and potential. Oh and did I mention that the ending's depressing?"
    },
    {
      "rating": "6",
      "text": "What killed this movie for me the most was their attempt at \"docu-dramism\" where they tried too much to be almost a documentary rather than a dramatic film. Things are told but never felt. You know some things about the characters but you never get to know them. There is little time spent in establishing them as people.\r The biggest reason for that is that the film never really settles on a protagonist, but just sort of jumps from person to person. The film would have been a lot better if it had told just one person's story, then maybe it could have created some feeling in the viewer.\r But besides all that Everest is by no means a bad film. What it does well is give you a sense of the experience of mountain climbing and the mind numbing danger of it all.\r Everest is not a bad film, especially for a large screen experience, but drama wise it left me wanting more."
    },
    {
      "rating": "4",
      "text": "I'm not generally a fan of epics or big-budget, commercial films, though I took a chance and went in to watch this one. It was a dissappointing experience. As I expected, having Robin Wright's, Keira Knightley's, Jake Gyllenhaal's big names on the promotional poster was a farse - they only have about 15 minutes of screentime combined. Initially, it was exciting to see blend between the director's beautiful, dramatic shots and the crisp cinematography. As the movie played out, it became clear the characters were severly underwritten. Josh Brolin, actually, was the only well-known actor who had a significant part. His character was the worst. Ultimately, the characters I least kind-of liked were the ones that survived. I know this is based on real events, but it felt melodramatic. Still, it's not any worse Alive, which I hated.\rHave to, again, give credit to the director and cinematographer. The (ultimate) problem was that the characters were horribly played out by the film as a whole."
    },
    {
      "rating": "6",
      "text": "Everest's highlights is that it is so well filmed it makes you feel as if it is actually filmed on Mt Everest and it greatly depicts the actually events that happened in 1996 using there fantastic ensemble cast. However I found that the film was great lacking a sense of drama and some of the cast like Knightley seemed to sound more Australian than Kiwi. After watching the trailer I was expecting a more high intensity film which I didn't quite get when seeing the actual film. It is worth seeing but don't have your hopes too high."
    },
    {
      "rating": "5",
      "text": "\"Everest\" is full of uninteresting characters, a dull plot and it is more of a documentary than it is a movie. In the end, \"Everest\" has very little joy in it and never lives up to the hype."
    },
    {
      "rating": "4",
      "text": "I think this subject is much too complicated to be properly explored in the feature film format. As such anyone familiar with the already widely reported events of that day will find the film superficial and unsatisfying.\r I also question the filmmakers' decision to completely whitewash the story of fellow climber Gau Ming-Ho (Makalu) from the film and find it hard not to believe that this decision was based on the fact that he is not a westerner. This kind of cultural imperialism is deeply troubling as anyone viewing the film, without being aware of the larger story, will not even know that such choices have been made.\r David Breashear's 2008 documentary remains the essential filmic account of the disaster.\r More here: http://wp.me/p6keYm-D"
    },
    {
      "rating": "6",
      "text": "Everest is a technically sound film and sports a great cast, but ultimately, clunky writing causes the film to become undone. There are too many characters to keep track of, and this problem is made harder by poor characterization and poor relationships between the characters. We are never given a reason to care about them or their expedition. Some dramatic moments are completely undercut by poor directorial choices in addition to the poor writing choices. It's an entertaining watch, but is held back from true greatness and comes off as a paper-thin adventure movie."
    },
    {
      "rating": "6",
      "text": "Icelander Baltasar Kormákur, whose career starts with 101 REYKJAVIK (2000), is another European talent recruited by Hollywood, after two mediocre Mark Wahlberg’s star vehicles CONTRABAND (2012) and 2 GUNS (2013), his latest is an ambitious USA, UK and Iceland co-production retells the story of 1996 Mount Everest disaster, and it just opened this year’s Venice film festival, and now a 3D format arrives in the local multiplex.\r keep reading my review on my blog, please google: cinema omnivore, thanks!"
    },
    {
      "rating": "5",
      "text": "Visually thrilling, but lacks substance. Actors are absolutely wasted, especially Robin Wright. The writing is very weak, but the directing is respectable. Jason Clarke is good as the leading man. Ultimately, it could have been so much more, and comes out as a disappointment."
    },
    {
      "rating": "6",
      "text": "Longest movie I have seen from this year so far. \"Everest\" is the kind of films that makes you more stunned for its sheer of spectacle but less with substance, which is lacking in plotting in this movie's case. Loved the group's dynamic, though the dialogue was really clichéd at points, particularly when Rob was talking with his wife Jan over the phone. The whole \"I love you,  I miss you so much\" bit is a factor that has been driving me insane in almost every movie about survival. It doesn't help much the fact that these characters aren't developed enough, despite the film having enough runtime to do that, but instead, it ultimately focus on its undoubtedly impressive setting and the tension setup. Another thing that bogged the movie itself a little was the lack of narrative heft. Sure, the performances are great (kudos to Josh Brolin, Jason Clake and Jake Gyllenhaal who did an amazing job in this picture), however, as whole, there was not enough narrative terrain to make \"Everest\" reach the landmark of better movies, such as \"Saving Private Ryan\" or \"Life of Pi\". I'm gonna give, though, a fairly reasonable score due to the solid direction, exuberant cinematography and pretty visuals, but it's not a movie I would recommend, unless you're planning on see it in 3D.\r Final Score: 6/10"
    },
    {
      "rating": "5",
      "text": "Everest was not ask good as I thought it would be, but I didn't walk out of the theatre mad about how bad it was. It takes a little time to pick up, but after that it gets better and better, and ends up at a 6/10."
    },
    {
      "rating": "8",
      "text": "This movie does with mountains and snow, what Gravity did for space. I don’t think I can ever look at Everest the same way again. Always thinking it’s just another mountain. The incredible imagery in this film really makes you feel so close to it. You can feel every part of its cold and dark frost on your face.\r On the morning of May 10, 1996, climbers from two expeditions start their final ascent toward the summit of Mount Everest, the highest point on Earth. With little warning, a violent storm strikes the mountain, engulfing the adventurers in one of the fiercest blizzards ever encountered by man. Challenged by the harshest conditions imaginable, the teams must endure blistering winds and freezing temperatures in an epic battle to survive against nearly impossible odds.\r What makes this film more interesting than the climb and decent itself is the way in which we see how commercialized the expeditions (Climbs) to one of the most dangerous places in the world has become.\r You think of the two base camps of Everest and visualize a few people waiting at them to climb. However, what we see in this film, which is based on a true story, is the enormous task these expeditions face when coming up against other companies leading expeditions. All racing to get to the top and get that one big story that will change a company’s name to the next biggest thing. That leaves a whole lot of amateur’s right alongside some of the world’s best climbers. That may not sound like the worst thing. But when seeing this film, you can really see how every second counts when climbing up a mountain and crossing amazingly large dark crevices that drop down for miles beneath you, in subzero temperatures. Having a group of inexperienced climbers in front taking almost 40 minutes to cross a ladder which normally would take only a few, leaving other climbers waiting and using up precious oxygen.\r Other climbers take rope where it should be left and O Tanks (Oxygen) that are left for other climbers. You really feel the tension and I was on the verge of being so angry at these other companies choking up the space on this once, majestic and peaceful piece of earth for a few bucks in their pockets. To push aside the morality of another person’s life, whether or not they are experienced enough to make it up a mountain only 1 in 4 ever survived.\r The true story we follow are of the expedition team Rob Hall, Played by the Jason Clarke (Rise Of The Dawn of The Planet Of The Apes, Terminator Genisys) and Beck Weathers, Josh Brolin (No Country For Old Men, Sicario)  in which we get heavily invested in are one of a rare breed. Rob cares for each and every person on his team. Their health and wellbeing are number one well before the climb or the peak itself. Beck seems to be the rough hard nosed Texan that wants to run ahead to the top with little to no care in the world. Jason Clarke really shines here and I got to see something I have never seen in him before. Real soul and heartbreak. Rob’s wife Jan played by Keira Knightley, plays with an outstanding New Zealand Accent. I am not normally a massive fan of her and her overly English roles. But she was amazing here. Some other surprising actors in the film make great cameos but I do not want to spoil it all.\r This movie is extremely well made visually. I saw this film in 3D. I would love to see it again without the dark shades on my face and see the full bright beauty in front of me. It had its effects and added some depth to the terrain and gaping holes beneath the climbers. But I highly recommend seeing it in 2D if you get the choice.\r If you love a true story and find that someone risking their lives to reach insurmountable tasks and can handle some fierce and heartbreaking scenes. This movie is for you. If you’re looking for heartless action or a script that bleeds all its characters dry you will be slightly disappointed. I know a True Story has to stay close to that which makes it strong, however I felt it needed a little more time with its characters. Especially if we are soon to see them off into the nether. Also the end credits sequence in which you see the real photos of these people brings the entire film to a tear jerking close.\rBREATHTAKING, HEARTBREAKING MUST SEE adventure only slightly let down by the lack of character depth and no real answers to why they are really doing a climb that will possibly end their lives."
    },
    {
      "rating": "9",
      "text": "One of best uses of IMAX 3D ever. Felt like I was there clinging to the cliffs. Had to put on my hoodie cuz I was freezing along with them. Very intense scenes to keep you involved."
    },
    {
      "rating": "6",
      "text": "Documentary type movie. No great scenario or acting. It is a focus on mountains climbing, an adventurous deadly sport whose details are not known and whose technicalities are not explored. No actor took the camera, just the furious nature. Sometimes a feeling of boredom reigns at the first half and a sense of anxiety at the second half. A learning that is interesting to know more than a movie to enjoy."
    },
    {
      "rating": "7",
      "text": "SHORT REVIEW: I thought this film was okay, it wasn't quite as brilliant or big-scale like 'Gravity' (2013) was...but it was an intense, 3D experience. Plus, it will scare you from going mountain climbing.\r Jason Clarke, Josh Brolin, Jake Gylenhaal, Keira Knightley, Emily Watson and Robin Wright deliver excellent performances which this film mostly benefits from. The film is directed by Baltasar Kormakur who uses some great use of 3D shots and the cinematography is excellent as always.\r There is pure emotion in this film, I guess what really let it down, going from a strong 10, to an okay 7, would be the fact that you can feel the run time and there are a lot of pauses throughout. Other than that, it is an experience, and it's worth the 3D."
    },
    {
      "rating": "0",
      "text": "It was not okay since my expectations were created high beforehand and the experience felt disappointed due to the expectations. I would not consider this movie to be a good movie to watch"
    },
    {
      "rating": "0",
      "text": "I watched this movie with a friend tonight but we couldnt finish it. I was that boring! There was no story, no drama, and the conversations and dialogue was horrendous! My friend said that this is how itreally happened but I dont care for reality, I want a thrill."
    },
    {
      "rating": "8",
      "text": "\"Everest\"is the true story of the ill fated 1996 expedition by a group of amateur and professional climbers who sought to reach the top of this most difficult of all mountains to ascend. The film stars Jason Clark who portrays Rob Hall, the real life leader of the expedition. Mr. Clark is  ably abetted by Keira Knightley, John Hawkes, Jake Gyllenhaal, Robin Wright, Josh Brolin and Emily Watson. Written by William Nicholson and Simon Beaufoy, the movie was directed by Icelandic director Baltesar  Kormakur whose deft hand and skill help make this 121 minute film move at a very comfortable pace. Of course the real star of the film is Mt. Everest itself for it is the dominance of this natural edifice that controls and ultimately destroys so many who have challenged it. Chronicled in the best seller by Jon Krakauer  (\"Into Thin Air\")  the film plays more like a documentary and its realism is the essence as to why this film is so good. As stated by Mr. Clark's character in the film, these climbers are asked to exist at an altitude level equal to that which 747’s fly. A most amazing feat and one that tests the stamina and sensibilities of both the characters in the film and those in the audience watching it. I give the film an 8.0 with a suggestion that it be seen in 3D for the cinematography and views of the mountain are alone well worth the extra price of admission."
    },
    {
      "rating": "8",
      "text": "Great acting performances, and the special effects are pretty amazing. Well worth seeing.  If you've got vertigo to the slightest degree, this one might be tough to stomach.  This film really has an all-star cast - and they're uniformly excellent."
    },
    {
      "rating": "6",
      "text": "Everest is able to more than adequately balance the thrill and devastation on the mountain with the heartbreak of families thousands of miles away. Don’t be fooled by the ensemble cast, each member packs a punch."
    },
    {
      "rating": "7",
      "text": "Everest is an absolute thrill ride that needs to be experienced in IMAX 3D. Featuring solid acting and a decent emotional story, the real success of Everest comes with the incredible visuals and special effects. Honestly, I felt cold felt watching these guys try to climb Mt. Everest successfully. As a story, it may feel generic and the guys who are portrayed here do deserve a better film about their true story and their life as guides on Everest. However, this one does do a decent job telling their story and certainly treats its real life people with tremendous respect and grace. Just because the story takes a backseat to the visuals does not mean it is ignored. An obvious front runner for numerous technical Academy Awards, Everest is a visual wonder that pulls all out of the stops visually and emotionally as you watch their harrowing climb and tragic demise."
    },
    {
      "rating": "9",
      "text": "I came to the theater not knowing anything about the original story and watching Everest was such an exciting, unpredictable, and emotional ride. It's not one of those movies that you would expect to have amazing writing because the idea of this movie is telling a simple true story and the only thing that would make this work is through the actors.\rThe cast are huge. They all gave phenomenal performances and not a single one of them is below average. Some of the very best acting performance for me are from Jason Clarke, Josh Brolin, Jake Gyllenhaal, Emily Watson, and Keira Knightley. You're gonna root for them for the entire movie and you're hearts are gonna truly break when something bad happened.\rThe graphics and visual effects are awesome. It was really worth experiencing it on 3D and make you never want to climb the Everest."
    },
    {
      "rating": "7",
      "text": "That the delights of climbing Mount Everest would be fairly resistible to most people is ably demonstrated in Everest, a well written and exciting adventure yarn that may be just a tad overlong. Based on a true story about one particular expedition that, due to appalling weather conditions, resulted in the loss of lives and the shattering of others. From the beginning the film successfully draws us into the necessary preparation needed to undertake such a massive venture and the pace, though measured, keeps one constantly engaged. Once on the climb things become quite tense. Stunning visuals of the mountain from all sides are sure to give vertigo sufferers reason to look away even if it is these snow swept images that provide the film with its tension. The camera work is truly amazing. Ditto the stunning sound which realistically captures avalanches and swirling winds in all their horrific beauty.\rAn eclectic cast play second fiddle to the elements of nature, but in a very small role Keira Knightley proves once again what an under rated actress she is. Emily Watson is also strong with a great accent and it is about time that Jason Clarke was afforded a leading role like the one he has here. On the mountain, due to the constraints of the clothing, one sometime loses track of who is who. Also certain plot points are a bit vague (what was going on with the oxygen?). Overall, however, the film is surprisingly better than the conventional disaster movie that one had feared would be its template, and is often quite moving."
    },
    {
      "rating": "10",
      "text": "My best film of the year, beating Sicario, Spectre, Avengers 2, hell even Mad Max and Inside Out. Star Wars might beat it to the top spot, but I'm doubtful.\r This is easily the most underated film of this year, 72% doesn't do it justice. Its tense, but ultimately an experience for the senses. I thought it was even more tense than Sicario, as well as having more compelling and engaging characters. It has also inspired me, opposite probably to what it was supposed to, to go mountaineering. If you are afraid of heights, just avoid this like the plague."
    },
    {
      "rating": "8",
      "text": "It's sickly true nature to the story sticks with you. It clings with you for hours after leaving the cinema to what makes up for a film experience packed with adventure, fear and heart pumping thrills. A film worth watching if you can last through the first act with just boring and pretty tasteless dialogue. 2nd and 3rd act....pure masterpiece."
    },
    {
      "rating": "9",
      "text": "In 1996, dozens of people tried to get to the top of Mount Everest. Some succeeded, and some died trying. The gripping and realistic 'Everest' recounts, in dramatic fashion, this event.\r There were quite a few expeditions on Mount Everest in May 1996, and they all had one goal, to get themselves, and their clients (who paid $65,000 eacg), to the top of Mount Everest, and it was up to the expedition leaders to make this happen. Rob Hall was the leader for Adventure Consultants, and he happened to have Jon Krakauer on his team (journalist Krakauer, who was on an assignment for Outside magazine, would go on to write 'Into Thin Air' - a book about the disastrous events that took place on the mountain during this climb ). Hall was also responsible for 7 other clients. The Mountain Madness expedition was led by Scott Fischer, who also had 8 clients, including Sandy Hill Pittman, a very wealthy New York Socialite who was, at the time, the wife of Robert Pittman, the founder of MTV. In addition to the clients, several sherpas (local people who are hired by the expedition companies to carry supplies and food up the mountain, and to fix the ropes and ladders to make it easier and quicker for the clients to get up - practically getting everything in place for the climb) were part of the teams as well. Of course most of Hall's and Fischer's clients were not professional mountain climbers, they climbed mountains as more of a hobby, and expected to reach the top of Mount Everest because of the huge amount of money they paid. One of Hall's clients was a postman (Doug Hansen). Another was a doctor from Texas (Beck Weathers). Also on Hall's team was Yasuko Namba, a Japanese woman who had climbed six of the Seven Summits. And Hall and Fischer knew that it was good for their businesses to have their clients actually make it to the top. So along with these two expeditions groups, other groups of people trying to climb the mountain at the same time were from South Africa, France, Tibet, and 13 members of a Taiwanese team.\r But the weather gods were not smiling on Hall and Fischer and their clients during this climb. And this is the story that 'Everest' the film successfully and gloomily brings to life. We are introduced to the teams six weeks prior to the start of their expedition. Hall (played by Jason Clarke) is from New Zealand who leaves his pregnant wife (Keira Knightley) behind to go to work. Fischer (Jake Gyllenhaal) is the adventurer with a laid back attitude. Beck Weathers (Josh Brolin) says goodbye to his wife (Robin Wright) in Texas to try to accomplish the almost impossible task of getting to the top of Mount Everest. Doug Hansen (John Hawkes) meets up with the gang in Nepal, as does Sandy Hill Pittman (Vanessa Kirby), which is the starting point for all expeditions. It is in Nepal where the teams get to know each other and bond, but it's when they get to base camp that the adventure, and danger, begins. Base Camp is already at such a high altitude (17,600 feet), that climbers need to be acclimatized so their bodies can get used to the high altitude. It's also where the operations for the expeditions take place, led by Helen Wilton (Emily Watson). 'Everest' takes us with them on the journey of these teams climbing the mountain. But first they need to navigate the Khumbu ice fall, soaring ice towers and crevasses so deep that there really is no bottom. Camp I and Camp II are where the teams stop to rest, perhaps spending a few days here. But it's the Lhotse Face that is one of the most challenging bits on the mountain. It's a 3,600 foot wall of ice that they have to climb to reach Camp III, an altitude where most climbers need to use bottled oxygen just to breath. But it's above 26,000 feet, right below Camp IV, which is called \"The Death Zone\" because it's where humans cannot survive for long. If climbers have survived as high up as Camp IV, then it's full throttle ahead to reach the summit, usually at midnight so that the teams can reach it before noon, that if they survive the heavy gusts of wind, and the Hillary Step, a 40-foot tower of ice and rock on an exposed part of the mountain that becomes a human traffic jam for people getting to the top, as well as coming back down. But it's the climb back down that is hardest. The climbers are exhausted, some suffering from high altitude conditions, but it's the lucky ones who can make it down on their own, and it's these people who have to decide whether to save the almost dead or leave them behind to save their own lives. As recounted in 'Everest', Hall and Fischer's teams encountered a major storm on their way down, but it was not the only mistake that took place on that climb. Besides too many people on the mountain, Hall took Hansen up to top way past the agreed time. And the search for them cost another climber his life. Fischer was not in the best of shape as he was climbing to the top, and had a much harder time going down. And a storm overtook the climbers, which turned out to be unexpected and deathly. And it's reenacted in 'Everest' to extreme detail; high winds, blowing snow, climbers struggling just to survive, dead bodies littered here and there, and almost blacked-outconditions. 'Everest' also recounts Weather's struggle for survival, Hall's loyalty to his client, and the operations team realizing that there is nothing they can do for the people trapped on the mountain.\r 'Everest' successfully, and grippingly, tells the story of the people who survived the mountain that fateful year. And while there have been a few books and one television movie made about this event, 'Everest' is based on the book by Weathers ( Left for Dead: My Journey Home from Everest (2000)), recollections from some of the survivors, as well as satellite phone conversations between the climbers, their families, and base camp.    And the actors who portray the real life characters are superb. Josh Brolin has his best role in years as Weathers, a man who amazingly was left for dead on the mountain but somehow survived. Jason Clarke as Rob Hall is excellent - he's determined to get his clients to the top and at the same time determined to get back home to see the birth of his first baby. Emily Watson as Wilton, the base camp operations coordinator, is concerned, and then doomed, after she realizes that a few lives have been lost on the mountain. And John Hawkes as postman Hansen gives us a portrait of a man who wants to be there but is not experienced in any way to climb the mountain. Luckily Knightley's role is not on the mountain (can you actually see her playing someone who is climbing Mount Everest?), she plays Hall's wife back at home, and there's nothing she can do to help him. Gyllenhaal's role as Fischer is relegated to a few scenes, mostly up on the mountain - he's far from being the star of the movie. Director Baltasar Kormakur (2 Guns, Contraband), working from a script by William Nicholson and Simon Beaufoy, takes us with the teams on their journey, and it looks all too realistic. While there are lots of characters to keep track of (the all important Sherpas are virtually ignored), especially when they are all wrapped up - it's a bit hard to tell who is how, 'Everest' brings to the big screen the real life 1996 Mount Everest disaster. Eight people eventually died during this expedition. 'Everest' was shot at a high elevation on the trek to Everest in Nepal, in the Italian Alps and at Cinecitta Studios in Rome, and Pinewood Studios in the UK. It can be experienced in IMAX 3D as well as standard 3D and 2D. 'Everest' is a true epic adventure that will take your breathe away."
    },
    {
      "rating": "7",
      "text": "A capably made action-adventure film featuring good special effects, beautiful cinematography, fine characterizations and some genuinely heart-tugging emotions. Despite these strengths, though, the sound quality (especially the dialogue) sometimes leaves much to be desired, and the film editing could have used a little more consistency. Overall, a nice outing to the cinema, even if it's not positively epic filmmaking."
    },
    {
      "rating": "7",
      "text": "It was really touching. Seeing what those climbers go through is really heart-wrenching. Though I feel like that there were too many unnecessary scenes. But I'm glad I saw this movie."
    }
  ],
  "recommendations": [
    "the_perfect_storm",
    "deepwater_horizon",
    "the_finest_hours",
    "in_the_heart_of_the_sea",
    "first_man",
    "apollo_13",
    "only_the_brave",
    "sully",
    "cast_away",
    "127_hours",
    "wind_river",
    "the_grey",
    "flight",
    "beirut",
    "allied",
    "greyhound",
    "the_abyss",
    "the_lost_city_of_z",
    "deep_impact",
    "unbroken",
    "midnight_special",
    "the_rover",
    "the_beguiled",
    "hostiles",
    "the_walk"
  ]
}