{
  "id": 2603,
  "title": "Every Day",
  "starring": [
    "Angourie Rice",
    "Justice Smith"
  ],
  "runtime": 97,
  "genre": [
    "Fantasy",
    "Romance"
  ],
  "description": "16-year old Rhiannon falls in love with a mysterious spirit named “A” that inhabits a different body every day. Feeling an unmatched connection, Rhiannon and “A” work each day to find each other, not knowing what the next day will bring.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4UnME3icxSspwL0UoGZNSyyp7Xs.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 10.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I was very hesitant about watching this movie. I'm not usually a fan of dramas but for some reason I decided to watch it. Thank God I did! It is actually a great movie, with very relatable characters and a solid, yet simple plot. I really don't understand the poor reviews given to this realistic drama. I am a 19 year old male who is not really in touch with his emotions, and yet I felt sad for the characters through the tough times, and elated in the others! This is attributed to the sheer perfection of the actors, particularly Liev Schreiber and his gay son, played by Ezra Miller. They portray a very realistic representation of life and its problems. This movie is real, and tackles topics as common as homosexuality, stress and sexual boredom! The one tiny flaw I must highlight, is that there is one or two hitches in the plot which are slightly boring. But this movie is meant to depict the \"Every Day\" events of Ned and his families lives, the exciting and the not-so exciting, which it does!As I said before, I'm an average teenage male who is not effected greatly by emotional movies, but this one is an exception. I found myself engulfed in the world of this movie torn by the actions and reactions of the world inside the story. Its perfect blend of seriousness and light comedy, coupled with outstanding acting make it an extremely watchable and enjoyable movie. Obviously, this movie won't affect everyone in the same way as it did me, but I genuinely feel it deserves a chance, and I humble believe that it's low scores and ratings do not accurately portray its sheer brilliance!Thank you for reading!"
    }
  ],
  "recommendations": [
    "all_the_bright_places",
    "closer",
    "me_before_you",
    "the_fault_in_our_stars",
    "the_upside",
    "blood_diamond",
    "the_big_sick",
    "her",
    "cashback",
    "men_of_honor",
    "manchester_by_the_sea",
    "my_name_is_khan",
    "jojo_rabbit",
    "the_edge_of_seventeen",
    "lovelace",
    "greenberg",
    "breakthrough",
    "the_blind_side",
    "revolutionary_road",
    "secretary",
    "lady_bird",
    "12_mighty_orphans",
    "the_devil_all_the_time",
    "hotel_rwanda",
    "20th_century_women"
  ]
}