{
  "id": 1845,
  "title": "Everly",
  "starring": [
    "Salma Hayek",
    "Hiroyuki Watanabe"
  ],
  "runtime": 93,
  "genre": [
    "Thriller",
    "Action"
  ],
  "description": "After she betrays a powerful mob boss, a woman matches wits and weaponry with a legion of killers who are out to collect the bounty on the heads of her and her family.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2As9fPVTZ1jF6uaTweiVw1RRFDD.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Everly takes a little bit from a lot of different action films and adds up to a solid piece of entertainment.  Salma Hayek fits this role well.  There's nothing special or different here, but I was entertained.  B"
    },
    {
      "rating": "2",
      "text": "I watched this movie because it came up on one of those 'good movies you've missed'. Two things wrong with that statement one-I wouldn't have missed in my life and second it isn't good. What a terrible movie nothing really redeeming other than the beautiful Salma Hayek running around in a slip. Even that can't save this crappy movie. Its attempts at being edgy and cleaver come across heavy handed, sophomoric, and idiotic. There's a part for no apparent reason after being raped, beat up and shot she slips on her 4 inch high heel leopard skin pumps just so she can walk around like a stripper for 5 min, idiotic. Mrs. Hayek gets shot, stabbed, punched and doesn't seem to effect her very much if at all. Forget this movie I'm sorry I wasted my time."
    },
    {
      "rating": "6",
      "text": "Surprisingly entertaining movie. When I start watching I said to myself: if this is where the movie goes, I am gonna like it. At some point, it gets out of the apartment but not of the building."
    },
    {
      "rating": "10",
      "text": "Awesome movie that is filled with action and suspense... Where is part 2???????????"
    }
  ]
}