{
  "id": 2572,
  "title": "Evil Eye",
  "starring": [
    "Ofelia Medina",
    "Arap Bethke"
  ],
  "runtime": 100,
  "genre": [
    "Horror"
  ],
  "description": "Nala, a thirteen-year-old girl from the city, travels with her family to her grandmother's home in the countryside, to try to find a cure for her little sister's mysterious illness - But she'll soon find her granny is not exactly what she seems...",
  "releaseYear": "2022",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/vcym9A0idLCFI1iIMRFiXKRvnbs.jpg",
  "categories": {
    "plot": 3.0,
    "acting": 3.0,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "The most interesting thing about this film is that it straddles 2 generations of Indian culture. The daughter is living in Seattle, while her mother in Delhi continually worries her about finding a husband. When the perfect mate appears, mom starts to believe that he’s related to her unhappy past. Much of this film is comprised of calls between the 2 woman, which gets tiresome and provides no suspense. When something starts to develop, it’s an hour into the film and the tiny climax is certainly not worth the time spent to get there"
    },
    {
      "rating": "4",
      "text": "The last of the four films of the disposable ''Welcome to Blumhouse'' project.Just as forgettable as the others.Kinda hard to say this, but Amazon got ripped off."
    },
    {
      "rating": "3",
      "text": "As Horror Movie season continues to push on, we too continue watch the latest in horror streaming options. This week we were able to get a preview of Evil Eye. This Blumhouse and Amazon production will be released on Prime video on October 13th. Evil Eye is part of \"Welcome to the Blumhouse\" anthology of Blumhouse and Amazon creations released throughout October. In this horror/thriller/mystery, a devoted and superstitious mother pressures her daughter into marriage but is convinced the man her daughter chooses is a reincarnated soul from the mother's past. Eerie, right?! Let's see what this film has for us.I'm going to be blunt. Sima Taparia would be proud and disturbed by this film. Everyone else will be bored. This movie moves so slowly and it's only an hour and half film. Viewers will be begging for something to happen. Now yes, the romantics out there will want to be swept off their feet and to be swooned by the charming nature of the antagonist, Omar Maskati as Sandeep. Yes, my guy was a baller but boy did he move way too fast as well, except in the crazy behavior we came to see. This is primetime horror movie season and people do not have time to waste to not be scared. I could watch Hocus Pocus for all of that (an all-time great movie). And Sunita Mani, open your eyes girl. Her character Pallavi, was beautiful and desperate, which both came across the screen clearly. And the true star of the movie, Sarita Choudhury, gave us the perfect imitation of a mother on Indian Matchmaking. Y'all know which one I'm talking about. I know y'all binged it during the pandemic. BUT WHAT ABOUT THE THRILLS. THERE WERE NO THRILLS. IS THAT NOT WHY WE ARE HERE?! Unfortunately, that is why we came and boy does this movie fall short. We got 3 minutes of thrills out of 85. That is not enough. We got 98% Lifetime movie and 2% Blumhouse thrill. Blumhouse has creativity for sure but often I find their films lacking in execution. This is no different. And I especially believe they failed in using the New Orleans setting to their advantage. It's the most haunted, creepy, and beautiful cities in America and yet we got no connection to it.In conclusion, Evil Eye is a thriller without thrills which means it's meaningless.  While the story and concept could be quite interesting, the execution and direction were lacking.  The movie is fine and boring.  Nothing to write home about or go to New Orleans for.  Grab one kernel of popped corn to get you through this Blumhouse Lifetime Movie."
    },
    {
      "rating": "5",
      "text": "Abusive guy killed by a girl in India, gets reincarnated, meets her daughter, tries to marry her, just to get close to the mum again but she's onto him."
    }
  ]
}