{"id": 2363, "title": "Evolution", "starring": ["David Duchovny", "Julianne Moore"], "runtime": 101, "genre": ["Comedy", "Science Fiction", "Action"], "description": "A comedy that follows the chaos that ensues when a meteor hits the Earth carrying alien life forms that give new meaning to the term \"survival of the fittest.\" David Duchovny, Orlando Jones, Seann William Scott, and Julianne Moore are the only people standing between the aliens and world domination... which could be bad news for the Earth.", "releaseYear": "2001", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/dwIrP544LxJtXToLpzkEa08pIMm.jpg", "categories": {"plot": 5.25, "acting": 4.714285714285714, "ending": 5.0, "soundtrack": 5.0, "cinematography": 7.0, "familyFriendly": 6.0, "funny": 7.0588235294117645, "action": 5.0}, "reviews": [{"rating": "7", "text": "A very enjoyable and humorous movie set on the theme of \"Alien invasion with a twist\", the movie displays both imagination and self-irony, and the acting is for the most part of good quality. The movie manages to let the suspense build nicely, until it explodes and gets defused with what I see as a thoroughly self-ironic nod to product placement.\r It's not a work of genius, but it is worth a look-see if you enjoy humorous alien invasions and hopeless heroes forced to try to \"save the world\". A solid 7."}, {"rating": "10", "text": "Very good sf comedy movie. Humor is casual and well made unlike many other comedy films who pushed too hard and created opposite effect. Also very good porformance by all actors."}, {"rating": "5", "text": "\"Evolution\" was a very regular movie and some interesting question though comedy and science fiction out of it regularly in the visual effects, but very reliable with the plot ."}, {"rating": "5", "text": "In \"Evolution,\" Ivan Reitman's scattershot sci-fi comedy, Orlando Jones and David Duchovny play community college science instructors who happen upon an alien life-form that threatens to take over the world. A meteor has crashed into the Arizona desert. Examining the blue- green slime that oozes from beneath its surface (\"It's a rock that bleeds!\"), Mr. Duchovny's character, a disgraced former Pentagon biologist named Ira Kane, discovers a colony of squirming star-shaped amoebas. These quickly mutate into more complex microorganisms, and then into computer-animated flatworms, insects, slimy lizards and angry primates.\r The movie itself evolves in reverse, starting life as a moderately clever grab bag of high-concept noodling and half-witty badinage before descending into the primordial ooze of explosions and elaborate lower- intestinal gags. Mr. Duchovny and Mr. Jones make an amusing pair. Their interracial shtick is reminiscent of that of Gene Wilder and Richard Pryor in movies like \"Silver Streak\" and \"Stir Crazy,\" but with the ragged anxiety of the late 70's smoothed over by the referential pop-culture cool of the present day.\r Mr. Duchovny works hard to show some range beyond Agent Mulder's morbid intensity while still poking fun at his \"X-Files\" pedigree. \"No government,\" Ira snaps when Harry suggests alerting the federal authorities about their discovery. \"I know how those people operate.\" In his first scenes, Mr. Duchovny, who was a Ph.D. candidate in literature before becoming an alien tracker for the Fox network, captures the easygoing cynicism of the second-rate academic with frightening accuracy. Virtually everyone in his class gets an A, except for two obese brothers whose identical papers, titled \"Cells Are Bad,\" earn them C-minuses.\r But compared with Harry, Ira is Jonas Salk. Mr. Jones, best known as the demented pitchman for 7-Up, has quick timing and effortless improvisational flair, as well as an absolute, and in this case welcome, disregard for consistencies of character. Mr. Duchovny is constrained by a silly back story involving his mishandling of a Pentagon-sponsored anthrax vaccine (the laughs never stop!) and a love interest (played, for no good reason, by Julianne Moore); Mr. Jones is free to mug and gangle to his heart's content.\r \"I've seen this movie,\" he says as an alien bug crawls around inside his protective suit. \"The black dude dies first.\" No, but he is subject to some fairly gross indignities: the bug must be extracted from his nether regions with forceps. Later, as payback, he administers a dandruff-shampoo enema to the shopping-mall-size mass of protoplasm that threatens civilization as we know it.\r Unfortunately, civilization as we know it — that is, the highly evolved state of being that can find no better use for its biological advantages than the production of movies like this one — triumphs in the end. That dandruff shampoo appears to be a clever product placement, a moment that the rest of the movie, for all its ickily impressive digital flora and fauna and its cast of good sports, rarely lives up to.\r Seann William Scott, in the designated-doofus (or David Arquette) role of a hapless aspiring firefighter, has some moments of slack-jawed charm. Ms. Moore falls down a lot and bumps into things. She's sexy, she's a scientist, she's clumsy; comic invention of this caliber makes you sorry the writers' strike never happened. From time to time an actor — usually Mr. Duchovny, Mr. Jones or Ted Levine, who plays a Pentagon heavy — will send up a tired action- movie or television-show commonplace: \"Let's do this!\" \"It's payback time!\" \"Be careful out there!\" But the spoofing of movie clichés has become a cliché in its own right, and beneath the hyperactivity of \"Evolution\" is an abiding laziness.\r In a Darwinian universe, this is a dangerous thing. The biggest frustration in \"Evolution\" is that it squanders an interesting premise. The aliens evolve so quickly, compressing hundreds of millions of years into a few short days, that you can't help wondering what they will look like when they turn into us. But we never get past the angry apes.\r Maybe in \"Evolution II\" the process of natural selection will be allowed to proceed further, and we can witness the full flowering of superior life-forms — or at least see whether they have it in them to make better movies than this one."}, {"rating": "7", "text": "the movie was fun until the end. i liked how well it mixed comedy with science-fiction. the monsters were fun to watch and i laughed at the jokes of the main characters."}, {"rating": "7", "text": "Definitely flexes it's comedic brawn rather than it's brain. There are a lot of laugh out loud moments throughout, and the special effects have aged surprisingly well. It's the type of film that doesn't take itself too seriously. While that may not fair too well for the plot, it definitely keeps things entertaining throughout. A solid, if not particularly brainy comedy."}, {"rating": "3", "text": "Evolution is pretty terrible. Some of the acting is atrocious. Orlando Jones plays a different character in every shot. The direction can't decide whether this is a comedy or a horror. The fact that there were four different writers vying for control of the script is very apparent. However, the creature effects are really cool and well done for 2001. This movie does have moments of brilliance, which make me want to seek out Don Jakoby's original script, which was written as a very serious sci-fi horror flick, instead of this overly long Head and Shoulders commercial."}, {"rating": "5", "text": "A movie with a great premise and ideas but sadly not remarkable enough to be remembered. I have no one heard talking about the movie in years with the exception of the sentence „This was such a great idea for a movie but it did not live up to it”. The movie itself is decent to good but not remarkable or anything to write home about. It is a science fiction comedy and the story starts when a meteorite hits in Arizona and ended in a cavern system. Two scientist discover microorganisms that rapidly evolve into new specimen (Practically the evolution is shorten from million of years to days or even hours). Of cause the military gets also involved and tries their own things. So far so good. As set up this is fascinating and kept me invested. Sadly the rest of the story cant keep up. It does not find the right balance between being serious or cheesy funny. More in either direction would have worked better. Also it uses a lot of tropes and stereotypes in an unimaginative way. Then there is the humor. While some parts work well other seem incoherent with the movie like the toilet humor. The better comedies or spoof movies have an own style and follow it. Here it takes you out of the immersion and I often taught “really” or “unfitting”. It is also the best commercial for Head & Shoulders shampoo (Don't know if it still exist as brand). The acting is decent / O.K. I see neither missteps nor true greatness. David Duchovny is the lead actor as Dr. Ira Kane and does his job well. Orlando Jones plays Prof. Harry block and while he delivers is to much used for tropes including the black guy character tropes. I think they go for satire or parody of stereotypes but it sits not well. Today it would create an outrage. The rest of the cast does also their job and I repeat that there are no missteps here. The special effect were good for its time. It was satisfying and some effects looked really good. Maybe the one in the final is not good enough as seen back then it was not that convincing. Overall it is fun to watch but fast forgotten. Only by coincidence I remembered this movie by submitting another on Metacritic. Sounds to harsh as it is also nowhere near a worst movie list."}, {"rating": "7", "text": "Evolution light Sci-Fi comedy. Here the whole plot is written to simplify life for the main characters, all conventions are violated every minute, all only for the sake of humor, which is really good here. It is worth noting the comedic role played by Julianne Moore. And although the graphics for Sci-Fi are terrible, you get the fun from the film completely. I advise everyone to view."}, {"rating": "9", "text": "Honestly this is probably one of my favorite comedies of all time I believe it would have done alot better if it was marketed better. It has an excellent cast of characters. If u want to shut your brain off for a while and just laugh this is that movie."}, {"rating": "10", "text": "One of the most entertaining movies that will keep you laughing!  We need this in our lives sometimes, just to laugh and not be so serious.  This movie will do that.  Ca-Caw, Ca-Caw.  Just sit back and enjoy it, we dont have to criticize everything!"}, {"rating": "7", "text": "It looked fine. The effects all looked convincing, the camera movement was good Hollywood and the clarity was good. I watched in stereo and it sounded good. Well balanced and crisp. The sound effects were slightly comedic and that suited perfectly. This is pure mind-relaxing cheese. It is a fun ride without being too memorable. It is pretty funny too. Not as good as Ghostbusters (1984). A fluffy journey that will make you smile but the memory won't last."}], "recommendations": ["mars_attacks", "wild_wild_west", "paul", "men_in_black", "guardians_of_the_galaxy", "men_in_black_ii", "keeping_up_with_the_joneses", "the_gentlemen", "thor_ragnarok", "johnny_english_strikes_again", "snatch", "fantastic_four_rise_of_the_silver_surfer", "jumanji_the_next_level", "tremors", "jungle_cruise", "american_ultra", "rampage", "baywatch", "the_nice_guys", "ant_man_and_the_wasp_quantumania", "armageddon", "ghostbusters", "the_wolf_of_snow_hollow", "the_happytime_murders", "the_losers"]}