{"id": 2118, "title": "Ex Machina", "starring": ["Domhnall Gleeson", "Alicia Vikander"], "runtime": 108, "genre": ["Drama", "Science Fiction"], "description": "Caleb, a coder at the world's largest internet company, wins a competition to spend a week at a private mountain retreat belonging to Nathan, the reclusive CEO of the company. But when Caleb arrives at the remote location he finds that he will have to participate in a strange and fascinating experiment in which he must interact with the world's first true artificial intelligence, housed in the body of a beautiful robot girl.", "releaseYear": "2015", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/dmJW8IAKHKxFNiUnoDR7JfsK7Rp.jpg", "categories": {"plot": 8.510204081632653, "acting": 8.157894736842104, "ending": 7.894736842105263, "soundtrack": 8.333333333333334, "cinematography": 8.0, "familyFriendly": 3.0, "funny": 9.0, "action": 8.125}, "reviews": [{"rating": "10", "text": "Alex Garland is a genius. No matter what his movie's are about they are simply extraordinary. This one is definitely worth the time. I highly recommend watching it."}, {"rating": "7", "text": "Style over substance in Alex Garland's directorial debut. A stage play in essence but with the beautiful Norwegian landscape and an ultra sleek subterranean futuristic research slash eccentric billionaire den as background. The Turing test plot is very familiar and has been done better elsewhere numerous times. This pales in comparison to Blade Runner for example,the yardstick. Even the most recent AI flick I saw 'Morgan' is better. But still it’s compelling and entertaining.....and predictably depressing..Elon Musk would approve."}, {"rating": "8", "text": "I was left a little disappointed by the ending. For all of it's expertly crafted tension this game of manipulation turned out exactly how I thought it would. Which is to say that when all is said and done Ex Machina isn't all that different from the countless other films out there with similar premises. The ride up to that point is still thrilling however, with strong themes and three exciting performances that will give you at least a little bit of doubt in regards to who can be trusted.The ominous soundtrack and the fact that I already knew that things weren't what they seemed filled me with unease. This is something Alex Garland made excellent use of to create a very unnerving atmosphere and reveals that come off as even more twisted than they already would have. For me this was freakier than most of the horror films I've watched. Of course the concept of playing mind games with AI already deeply disturbs me. That's not to take away from the performances of Oscar Isaac and Alicia Vikander though. Those two are key reasons things feel so dangerous.The back-and-forth pull between which of their characters the protagonist would be better off trusting hinges on the question of what it means to actually be human. Isaac's character may be a little unhinged, but he is another person so it stands to reason that while he is manipulating his house guest in some way, he's probably not a real threat. Ava on the other hand is an inhuman entity unlike anything else Gleeson's character would have previously encountered. We don't know if she feels empathy enough to not slaughter anyone she comes in contact with if she were to be set free. She's clearly hasn't had the most desirable \"life.\" That could very well have led to a hatred of humans. A lifeform she could view as inferior anyway. Vikander gives a suitably alien performance that provides Ava with a certain disconnection from her flesh and blood counterparts. Is she using her sexuality to manipulate a lonely and naïve individual, or is it possible for her to actually feel something more than a need to deceive?Ex Machina is another movie about the dangers of playing God. It's really good at getting you to ask questions. Certain twists and the ending itself are easy to predict. Meaning that it doesn't deviate too much from convention story-wise. Yet it's never robbed of atmosphere or tension so this is still a very effective thriller. It's also an intelligent piece of science fiction. One with a sexual angle that stems from the very human condition of never wanting to be alone and belief that if we aren't screwing, we aren't living. Alex Garland wasn't just satisfied with getting under our skin. He wanted to get inside our heads as well. And I, for one, think he succeeded rather marvelously. Managing to make something gorgeous in the process.8.7/10"}, {"rating": "8", "text": "Ex Machina is a slow burn dystopian film which is beautiful shot and acted. The payoff however was a bit too soft in my opinion, however what a cast and concept."}, {"rating": "9", "text": "Nice movie 8.8, only 15 million budget and the visuals are so good. Was filmed on Norway, mostly in a hotel called Juvet Landscape Hotel, and has beautiful landscapes."}, {"rating": "10", "text": "One of the most engaging and beautiful movies I've seen in years. It may not break any ground conceptually if you're a sci-fi movie buff, but the acting is excellent (the A.I. in particular... obviously), and the plot isn't nearly as predictable or flawed as others might say (unless perhaps you just sit there trying to guess the ending and nitpick at the plot instead of enjoying the movie, as many negative reviewers here clearly were).  A truly excellent movie with stunning visuals and special effects, and a engaging plot with a great ending."}, {"rating": "7", "text": "Ex Machina is film that tries to be too clever for its own good. The premise is simple enough...\rGuy working for a big 'search engine' style company \"wins\" a competition to spend time with the company's mysterious and God-like CEO at his top secret research facility/retreat.\r Upon arriving he discovers the CEO is an incredibly eccentric man, overbearing, aggressive, drinking heavily and using stimulants to 'recover' the morning after.\r The guy is introduced to the CEO's latest and most far-reaching idea. Artificial Intelligence, a digital consciousness drawn from the billions of inputs made into the company's search engines and refined into an adaptive algorithm.\r This consciousness is personified into a robot, a stunningly attractive female robot (naturally), and the guy is asked to go in and interact with it/her and discover any flaws in how she reacts/responds. The idea being whether she possesses the capability to mimic human responses and whether it can constitute emotional depth in what is a purely digital/binary construct.\r As the film progresses it becomes clear the CEO has some mental instability issues, and there is a darker, more subversive rationale for why he seeks the answers.\r The guy becomes the one developing emotional contexts, to the point where he has to 'help' the robot escape the limitations of a couple of rooms in this way out in the middle of nowhere facility\rAnd the robot? Is she mimicking the deviousness and instability of the CEO, whilst developing a deeper sense of empathy for the guy? Is she the one who is manipulating them both???\r The three stars of the film play disparate characters.\r Oscar Isaac plays the CEO and billionaire Nathan Bateman, heavily bearded and over the top, his performance is probably the nearest to being 'by the book', the depth coming at the beginning of the movie as he monologues about the idea of AI and the infinite possibilities that could exist.\r Domhnall Gleeson plays programmer Caleb Smith, the 'nobody' who is plucked from his desk and and computer to 'work' on assessing the AI and how it learns and reacts. His performance is more muted, and bridges the middle part of the film.\r Alicia Vikander plays Ava, the robot with the latest version of Bateman's AI. Clearly the standout acting part of the movie she captures both the innocence and naivety of what is a 'new' life-form, whilst also trying to hide her own insecurities and sense of self preservation.\r In terms of film-making, it's well directed and scored. The cinematography is also excellent, with fantastic use of different techniques to produce the fantastic visual effects. As the (debut) Director and screenwriter, Alex Garland's desire to translate his own thoughts and ideas onto the Big Screen does resonate throughout, and this is also highlighted by the great performances from everyone in the film, not just the three 'stars'.\r However, for everything that is great about the movie, it's all undone by a muddled script. Great story and screenplay are all for nought if what is being conveyed in the words people are speaking either makes little or no sense, or relies on vague explanations that don't give you an insight into the characters thought process.\rOK, we're not talking about something as hapless as 'The Architect' and his nonsensical monologue at the end of Matrix Reloaded, but it's a lack of consistency in both expositional and character developmental dialogue that I found difficult to accept.\rIt just uses the 'catch all' trope of creating a scenario that exists to facilitate the movie, rather than the movie facilitating a means for something creative and thought-provoking to exist. Which was very disappointing indeed.\r Overall, it is an interesting film in that you approach a well worn path from a different direction. Alicia Vikander lights up the screen whenever she appears on it. And the twist ending ties up all the loose ends nicely, and leaves open a possibility for a potential sequel.\r I'd recommend it, just don't expect the narrative and plot devices used to stand up to some good old 'human' thinking!"}, {"rating": "9", "text": "A smart science fiction film that asks a lot of good questions about artificial intelligence and the dangers it might pose. The Cinematography is gorgeous, the script is spot on and the pacing is superb. Alex Garland’s direction is great. I particularly loved his use of mirrors and reflections throughout."}, {"rating": "9", "text": "Ex Machina is one of the best movie about robot I've seen ever seen. There are so many great things about it, and the one false note I find is in the first act. Many dialogue can be done much better, and \"history of God\" scene does not work. However, as the movie goes on, the script becomes better and dialogue feels much more genuine. Almost all sci-fi films have a problem with exposition: since the story happens in the future, the audience would not know about it. Ex Machina handles the exposition very well. In the helicopter scene at the beginning, we did not know the boss is rich because someone tells us so, but because the helicopter has been flying on its territory for years. This is a very nice approach to tell the audience an important information. But the greatest thing about the film is its theme. Never have I ever seen a movie so thoroughly and beautifully explored the identity of an A.I.. Ava has been perfectly portrayed as an attractive, creepy, also terrifying character. Overall, the movie is really really good. The music is also suitable for the sci-fi filmmakers out there. A lot of the theories and Ava's characters in the film are worth learning about. If the script for the first act can be done just a little bit better, I would just have no problem with it."}, {"rating": "9", "text": "There isn't much that I don't like about Ex Machina. It's written very tightly, it feels realistic, and the acting is superb. I wish we could give Alex Garland a blank check every couple of years so he could create a whole library of sci-fi films."}, {"rating": "8", "text": "Seriam os humanos os únicos detentores da consciência?Se você se interessa pelo assunto, esse é um filme pra você. Ele aborda pontos muito importantes ao redor dos arcos e tem uma carga filosófica enorme por trás: nossa evolução. Como não quero dar spoiler, vou parar por aqui.A OST do filme é boa, se mostrando presente/firme nas suas respectivas horas de atuação. Os personagens são interessantes - principalmente o Nathan, que quase que deixou seu lado humano pelo seu propósito, apesar de ser sim um pouco estereotipado, mas isso ai só fica na base dele mesmo-. O roteiro é muito bem escrito, os diálogos tem propósito e os plots são bem conduzidos. As atuações, propriamente ditas, não deixam a desejar."}, {"rating": "9", "text": "Disturbing and somewhat sinister; involves many layers of themes that are subtly conveyed"}, {"rating": "10", "text": "A truly great movie about the philosophical death of god. also vikander, isaac, gleeson make a great set of actors"}, {"rating": "9", "text": "This movie is the best AI film I have ever seen. All four actors perform phenomally, especially Alicia Vikander. The story keeps you interested from the get-go, and the last half hour leaves you on the edge of your seat. My only complaint is the amount of unnecessary nudity."}, {"rating": "9", "text": "Ex Machina is an amazingly tense film that makes you question who is in the right. This is thank to amazing performances across the board. It also has brilliant use of sound to make the reader feel nervous. It's really a must see"}, {"rating": "10", "text": "One of the best movies I saw in recent time and one that I actually wanted to watch again before it even was over. The movie gives enough substance to think about and to revisit and stellar performances."}, {"rating": "8", "text": "Not a great film but it's not a bad movie at all either.It starts perfectly and it's very slow paced plus the ending makes very little sense with some decisions taken by \"certain people\" that leaves us wondering why? Besides that this movie does tension well and warns us about what's to come,add to that some great performances and you get a really good Sci-Fi Thriller film."}, {"rating": "7", "text": "Pros: scenery, CGI, philosophy\rCons: plot holes, ending\r I don't know about this movie. On one hand, I question: what would I do in X situation. I certainly wouldn't do some of the mistakes that the actors made in the script. Some parts are just: WTF were they thinking and it ruins the movie partially. Overall, the concept of an AI robot that looks like a human and the implications of such a creation is intriguing."}, {"rating": "8", "text": "It doesn't feel to long even when it is, because in those scenes we get anxious about what will happen and if that guy's a creep and crazy or not. It's a calm, anxiety movie. The ending gaved me chills. Actors are freaking good."}, {"rating": "8", "text": "Ex Machina is an incredibly thought provoking film that had me gripped throughout most of it's running time with some amazing preformaces (espically from Oscar Issacs), directing and cinematography as well as some of the best set designs it stands as an excellent allegory for our modern internet culture. i've seen in a while. the only major complaint i had was the ending that had a few questionable points and could have been slightly better but as it stands it's an excellent film. i wouldn't recommend to everyone especially with the films slow pace though i would say if you enjoyed Charlie Brooker's series Black Mirror you'll probably enjoy this"}, {"rating": "8", "text": "With simple but strong visual choreography and a plot that poses a profound question on machine vs man, Alex Garland's \"Ex Machina\" definitely is great must-watch."}, {"rating": "9", "text": "It is definitely only for mature viewers, but Ex Machina is a stunning experience, maybe even a masterpiece.  Visually perfect.  It has the coolest production design I have ever seen and some of the cleanest, appealing camera work in recent memory.  The atmosphere is beyond thick, creating a hypnotic mood that just completely envelops you. Alicia Vikander and Oscar Isaac give Oscar worthy performances, but Gleeson isn't a slouch either. The plot is thought provoking, creepy, surprising, and buoyed by intelligent dialogue.  It was the best movie I've seen in a long time, and one of the best I've ever seen for that matter."}, {"rating": "9", "text": "That its very a intelligent movie ... its hard to understand for people but when you catch it .... its evolutions ... like the guy in jurrasic park say ... no one can stop evolution .....\r i hope i dont tell enough to understand the fact with the punch we have"}, {"rating": "8", "text": "Alex Garland has created an exceptional directorial debut here with Ex Machina, scoring many high notes all throughout the film.\rEx Machina is a film talking about issues that are very prevalent in our current time, with much thought out and well written philosophy in the film to make it an interesting read by itself, let alone a film. The issues are kind of looking at what skynet in the terminator franchise was like except in a more subtle and no where near as destructive way. The questions arise; do we trust technology too much? Will it be what ultimately destroys us and takes over us but only as a part of evolution? With how we are taught to dedicate ourselves to certain things are we any more human than a robot with a thought process, do we both lack a sort of empathy for humans? Yes, this film is a thinker.\rThe film is acted brilliantly (partly in due to brilliant writing of the characters by Garland) with only a cast of 4 people, 3 of which have dialogue. The tension between Gleeson and Isaac's characters is a sight to behold as you feel stuck in the claustrophobic utopia of Isaac's abode. There is a constant threat of who is telling the truth and who isn't throughout along with the feeling that you are being left in the dark whist watching.\rHowever, certain issues i found with the film were these. The pacing, whilst not bad at all, was monotonous. It literally struck one note, the pacing staying the same throughout which wasn't a bad pace but never really made you feel you'd reached the climax of the film at any point. I also found the ending a little too open, not really having a full(ish) resolution at the conclusion, which left me feeling a little empty.\rOne other thing to note, the sound design for this film was just glorious to listen to, my ears tuned in on every sound in the film all the time.\rDefinitely worth the watch for our upcoming Star Wars actors and for it's impressive philosophy."}, {"rating": "10", "text": "Smart. Unpredictable. Beautiful. Minimalist. Powerful. Cautionary.  Thought provoking. Captivating. A perfect alternative to big budget sound and fury."}, {"rating": "9", "text": "What Chappie missed out on. A beautifully shot, well executed take on the beauty of artificial intelligence and the sicking entrapment that we imagine they can't escape. A wonderful ploy on my personal views of human sexual nature likewise, this is surely not one too be missed, even if it ties things up rather unintentionally cruel."}, {"rating": "9", "text": "Terrifyingly mysterious, Ex Machina is a film that is remarkable in its simplicity. From the first scene to the very last, it is a story that keeps you extremely intrigued. Alex Garland gets the best out of his small but powerful cast to create what is a small but powerful film."}, {"rating": "9", "text": "A subtle, polished and introspective film. Beautifully shot, this is a carefully crafted slow build, with the balance between tension and dark humour precisely held. The performances are brilliant, the script is excellent and the storyline is thorougly compelling, intricate and engaging. The endemic questions that inevitably arise when exploring the idea of AI are examined with a wry humour that is tempered by the sinister undertones of the plot, adding an undercurrent of tense unease throughout, making for a very satisfying experience. This is an understated film well worth your time. 9.01/10"}, {"rating": "9", "text": "Where do I begin... Oscar Isaac was amazing, Domhnall Gleeson was amazing, Alicia Vikander was amazing... all the performances were award-worthy, I think.\r Another great thing was the way it built up tension so well, and how complex and slightly disturbing the story turned out in the end. It was amazing. One of the best films of 2015."}, {"rating": "9", "text": "Ex Machina is an interesting movie that's both thought-provoking and visually amazing. Domhnall Gleeson, Oscar Isaac and Alicia Vikander were brilliant (out of the three, I found Oscar Isaac to be the strongest) and the story was interesting and smart. I thought the ending was a bit problematic (it doesn't give us much of an idea about the future of AI following the events of the film) but nevertheless, it was brilliantly written and full of ideas. The characters were great and there were plenty of great quotes (for example, \"Sexuality is fun. If you're gonna exist, you might as well enjoy it\"). A great movie with fantastic performances and interesting characters. Highly recommended."}, {"rating": "8", "text": "Me gustó mucho la peli, la vi en el cine, fascinante fotografía, mínima acción, mucha intriga y buen final.\rMuy recomendable si te gusta la inteligencia artificial."}, {"rating": "8", "text": "Ex-Machine possesses a great taste as in itself. Through out we see struggles of the minds including that of a machine to find the answers and we are lead to believe and feel about the robots. But it ends with even greater twist and a total change of our mind and perception of innocence. A powerful and convincing film."}, {"rating": "10", "text": "Do not miss this flick if you love Blade Runner…this is the evolution of the story as seen through our modern eyes.  Elegant and sparse  - this flick has many! subtle details. Much like a fine wine the story emerges akin to a fine palate of philosophical insights examining our involuntary agreements with our many machines.   Also a haunting and beautiful cinematic reflection on the majesty of Mother Nature."}, {"rating": "9", "text": "This Movie one of the biggest Suprises of the year.The movie is different from other AI Type Of Movies.The Movie Is really Enjoyable.The Story was Compelling . Everybody Acted Well Especially Oscar Issac.But there was a Segment Which I didnt find interesting If they removed that segment of the movie I would gave the movie 10. The ending was really unexpected"}, {"rating": "7", "text": "Every scene that involves Ava is a captivating experience and makes you feel and think about what really artificial intelligence is. Somewhat predictable but the slow intense pace made it a thought provoking film that  I only wish would have dug deeper."}, {"rating": "8", "text": "Ex Machina is a razor sharp thriller, that is brilliantly thought and crafted. Alex Garland's beautifully innovative film explores Computer expert, Caleb, played by Domnhall Gleeson. Who is invited to stay in the company's CEO's (Oscar Issac) estate for a few days. There he meets A.I beauty, Ava (Alicia Vikander) and falls in love with her. What follows is an emotional fight between man, machine and love. The film is thoughtful although painfully long and tedious. Ex Machina has great acting from Issac and Gleeson but Vikander steals the show as Ava. All in all, it's a must see film that is very innovative and thoughtful despite pacing flaws."}, {"rating": "7", "text": "This film dispenses with any notion of hard science fiction to focus on more philosophical questions about consciousness and humanity. Its biggest failing is that it quickly stops being interested in answering them so that it can present a much more straightforward fembot thriller. I can't help thinking that the film would have been much more interesting if, instead of Ava, we had Michael Fassbender's David 8 appealing to the protagonist's morality rather than his sexual desires."}, {"rating": "8", "text": "Ex Machina proves there is something incredibly humane about artificial intelligence. When science fiction makes us think long and hard about existence, consciousness and beyond - that's when you know it's something special. You won't know what hit you - and we can owe much of that to a stellar performance from Alicia Vikander."}, {"rating": "8", "text": "Last week I saw \"Avengers: Age of Ultron\", an overstuffed super-hero sequel that emphases much more on action than on its occasionally muddled narrative. I'm bringing this up, because \"Ex Machina\" is the total reverse: It's thoughtful, inventive and surprisingly well written. There are no subplots, no exposition... it's just three characters in a building. The conversations between Caleb and Nathan are incredibly realistic and just straight up entertaining, as well as Ava's sessions. It's tense, visually shiny and in the end, you are encountered with a simple moral of the story. I loved this and it's by far the best I've seen this year.\r 8.5/10."}, {"rating": "8", "text": "A very stylish, thought-provoking, entertaining science fiction release that gives us much food for thought about our relationship to technology, not to mention our very future. This well-written, well-acted offering is generally quite suspenseful, if a bit slow-paced at times. Like a good game of chess, this one will keep you guessing right up,until the end."}, {"rating": "8", "text": "The movie is well directed well performed and well written.Ex Machina Beautifully created and it is on one of the best film of the year.Ex Machina may feel bland at times but it is a well executed film but this movie is not for people."}, {"rating": "8", "text": "The movie, Ex Machina, had a simple plot: A young billionaire genius, Nathan (Oscar Isaac), spends a fortune to build a hideaway in a remote region, the only way in or out by helicopter.  He’d made his billions on the Internet, and was now working on creating humanoid robots (but only females).  A young programmer, Caleb (Domhnall Gleeson), working for his company, has won a contest, the prize being a week spent with the billionaire in his hideaway, participating in a Turing Test of Artificial Intelligence, specifically in the person of Ava (Alicia Vikander), a beautiful robot.  Caleb is to see if Ava is capable of more than factual intelligence, capable of human emotions.  Ava and Caleb interact under the watchful eye (and omnipresent cameras) of Nathan.  That’s the plot setup and I’ll leave it at that, no spoilers here.  But the whole idea of artificial intelligence is intriguing and has been dealt with in science fiction from the very beginning of the genre, most notably in Isaac Asimov’s I Robot.  We also saw it in Her, the\rSpike Jonze film starring Joaquin Phoenix who fell in love with his cell phone operating system named Samantha (Scarlett Johannson).  Today, however, we’re actually on the brink of creating robots and artificial intelligence that in the near future will take over most of our tasks: cars that drive themselves, planes that fly themselves, houses that clean themselves and cook our meals, machines that operate on us and take care of all our medical needs, assembly lines that automatically create other machines to take care of all our basic needs.  I just read that Gartner, an information technology research firm, predicts that by 2025 AI and robots will take over a third of current jobs, one-third by 2025 with the likelihood of two-thirds and three-thirds in the not too distant future.  Does that mean that mankind may in fact get to that Utopia envisioned by Arthur C. Clarke in his novel Childhood’s End? A time when all of man’s needs will be met by robotics and no one will have to work to survive, but will be able to engage in whatever activities they enjoy?  I hope so.  But back to Ex Machina and its considerations of how far artificial intelligence might go.  Would it be possible to create machines that not only know and use all of man’s knowledge but could also be programmed to feel as humans feel?  To appreciate music and beauty, to know love and hate, joy and regret, shame and triumph, sympathy, empathy, pleasure, even sexual pleasure?  Could we give a machine a sense of humor?  Mark Twain sardonically said, “Man is the only animal that blushes.  Or needs to.”  Could a robot blush?  Would a robot need to blush?  Fear seems to be the only feeling we wouldn’t need to program into an android.  What would a machine fear?  Death or injury?  No, that’s strictly a human feeling.  But even death might one day be defeated when we could store a person’s memories and experiences on a hard drive, to which later thoughts and experiences could be added endlessly, living in an artificial body and switching to another artificial body when the first one wears out.  A robotic immortality.  Science and technology are expanding exponentially and the future may be closer than we think.  Oh, yes, and by the way, go see Ex Machina.  It will lead you down the same introspective paths to the future that I found."}, {"rating": "8", "text": "Very good film. Makes one think that's for sure. Don't want to give away any spoilers. I totally recommend watching this film. Even more than once. Maybe you will come up with some answers to the questions it leaves you with. lol"}, {"rating": "10", "text": "This is a very tightly constructed and smartly written movie. Frequently with movies I'm too busy picking at plot holes and obvious contrivances to enjoy them. But not this one, because there weren't any that I could see. Everything that happened was driven by the actions the characters took and those actions were made sense with what we saw of their personality and motivations.  The most important thing for a movie like this to have is logical, internal consistency, and this one has that. There were a few times while watching it where I thought the writers had made a mistake or opened a plot hole; but each of those times, within a few minutes, the characters on screen addressed my concern in a way that fit within the story and the characters. Not many movies get this right but this one does.\r All that said, while the plot didn't play out exactly as I expected going in, it doesn't have any completely out-of-left-field twists either. If you are paying attention, you can mostly guess where it's going.\r The movie contains some intense scenes, full frontal female nudity, and frank sexual dialog. None of it is completely gratuitous, it's all in service of setting an atmosphere or adding depth to a character. But still, this isn't a movie to take the kids to. Take the R rating seriously and leave them at home."}, {"rating": "7", "text": "Ex Machina leaves me in grim awe of the masterpiece, because this was a well-written, well-acted film on an interesting topic, but it fell measurably short of that pantheon. Looking back, this could have been a play, and indeed, I can easily imagine it on Broadway. On the one hand, the set pieces, largely in interiors, must have helped bring the project in at a relatively modest budget, without making the production look cheap. However, the “lust of the eye,” which draws us out of our caves to movie theaters, is left largely unsatisfied. I offer “Blade Runner” – 30+ years old now – as an example of a big budget menagerie, on a similar topic, which can last in the mind’s eye for years. The images toward the end of Ex Machina suggest what might have been. Still, I give it a 7 for first-rate imagination, acting, and a generally plausible story line. And the movie looks just fine, for what it is."}, {"rating": "6", "text": "I didn't really see why this movie received such rave reviews.  This is essentially a three-person play, which is difficult to pull off unless the characters are all compelling and the dialogue is great.  Oscar Isaac had the best role, and also the best drawn character.  Caleb and Ava were not as interesting as characters, and I felt that the film lagged in the middle.  However, it did lead to some interesting discussions after the film.  Additionally, the scenery in Norway is magnificent."}, {"rating": "8", "text": "Nice movie overall, a bit slow and doesn't suit all tastes, but will definitely keep you thinking when it's over. It's brilliantly executed and actors nailed it, and story is portrayed inventively, I have personally not seen something like this before."}, {"rating": "8", "text": "It's a visually interesting, and thematically exciting film that hearkens back to such films as Blade Runner and Westworld, but it's especially relevant these days as more and more scientists are dreading the dawn of true A.I. Alicia Vikander does a pretty remarkable job as Ava, and Oscar Isaac is amazing, as usual.  I thought perhaps Domhnall Gleeson could have done more with his role, but that's nitpicking. This is a no-brainer recommendation, especially this time of year."}, {"rating": "10", "text": "One of the strengths of this fine film is that it is not the outrageous fairy tale which this movie has inevitably rendered Blade Runner, leaving it, thus, in the dust. Not that I'm entirely dismissive of Blade Runner. Sean Young and Daryl Hannah were never better. But this film's ability to absorb the contingencies of real life makes it far more than any dystopian-utopian popcorn movie."}, {"rating": "10", "text": "Great script...really makes you think about the workings of our intelligence and our attempts to manipulate. It's hard to figure out who's the honest one and who's the deceptive one. Just like life, but with an A.I. Robot."}], "recommendations": ["the_good_shepherd", "the_killing_of_a_sacred_deer", "the_rover", "i_am_mother", "you_were_never_really_here", "interstellar", "arrival", "blade_runner_2049", "the_master", "inception", "coherence", "midnight_special", "the_green_knight", "the_machinist", "sicario_day_of_the_soldado", "nocturnal_animals", "annihilation", "donnie_darko", "the_martian", "tenet", "unbreakable", "the_fly", "thoroughbreds", "anon", "hugo"]}