{
  "id": 1052,
  "title": "Exodus: Gods and Kings",
  "starring": [
    "Christian Bale",
    "Joel Edgerton"
  ],
  "runtime": 150,
  "genre": [
    "Adventure",
    "Drama",
    "Action"
  ],
  "description": "The defiant leader Moses rises up against the Egyptian Pharaoh Ramses, setting 400,000 slaves on a monumental journey of escape from Egypt and its terrifying cycle of deadly plagues.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uaDj37JtvLan9tihxZ18e6qL33b.jpg",
  "categories": {
    "plot": 3.3442622950819674,
    "acting": 4.041666666666667,
    "ending": 5.3076923076923075,
    "soundtrack": 5.0,
    "cinematography": 6.333333333333333,
    "familyFriendly": 4.444444444444445,
    "funny": 1.2,
    "action": 4.3
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Usually I give fair reviews, but since people are tanking the scores because it doesn't follow a Biblical story properly, I'm giving it a 10.  As a Christian, I want to spite all the other Christians that forget that Hollywood is Hollywood, and that Ridley Scott only does epic death and not much else.  The only surprise here is that Russell Crowe wasn't tapped for the lead role.  I'm rooting for this movie to tear it up this season, if for no other reason than to piss off the close-minded r-tards that can't take a joke and forbid a little dancing.  Cheers!"
    },
    {
      "rating": "4",
      "text": "There is no escaping the dreadful monotonous  first hour of Exodus: Gods and Kings. Thanks to a better made second half the movie becomes an average one at best."
    },
    {
      "rating": "2",
      "text": "Tries way to hard to be an epic remake for an epic story and falls flat with monotone acting and shallow intensity. Not to mention, Ridley Scott's portrayal of Moses was simply terrible, as his character was mostly faithless and bland."
    },
    {
      "rating": "1",
      "text": "A religious story that is made into a non-religious movie imagine that. The epic story that has endured thousands of years is essentially Gods wrath being brought against slave owners. Sure Hollywood can ignore the religion of the Hebrews and reduce God to Moses' imagination after hitting his head on a rock. But the ONE thing, the absolute ONE thing people go to see when someone makes a story about the Exodus is seeing hail and fire rain down on the slave owners.\r In the end the movie reduces a religious story about God's wrath to mental illness and the 10 plagues of Egypt to a series of coincidences.\r It was clear the director did not understand the God of the Old Testament and the 10 plagues was like watching my dog play piano. By the end of the movie I sympathized more with the Egyptians than the enslaved Hebrews.\r If you want to see a movie about the Exodus go get the 1998 Dreamworks movie Prince of Egypt it trumps this movie with ease."
    },
    {
      "rating": "5",
      "text": "This movie had spectacular scenes created by computers.  The story is so far removed from the Bible that the whole movie was unbelievable.  Hollywood knows nothing about the Bible that is for sure."
    },
    {
      "rating": "0",
      "text": "Thank you Ridley Scott for butchering a good story. How could anyone go so far off from the plot in the bible? To name just a few mistakes in the movie: 1) Moses was banished from Egypt a became a Shepard for 40 years not 9, before coming back to Egypt. 2) Why would Moses' wife, a believer of God have tattoos on her face, when God's laws prohibited tattoos? 3) Why is almighty God represented by a stupid bratty child? 4) The Israelite's never attempted to fight the Egyptians when they left. Moses and Aaron talked to Pharaoh, threw a staff on the ground that turned into a snake to prove they had God on their side AND THEN the 10 plagues began. 5) The Red Sea was Parted meaning that water was in the air not no water at all!!! 6) after the Israelite's  crossed the sea the waves fell upon all the Egyptians and killed all of them even Ramses. So in all I think that it would've been easier to make this movie more historically accurate rather than piss a bunch of people off. I mean it seems like these people just made up their own version of the story. This movie sucks and some of the cast was really unfit to play these characters too. I felt to distracted thinking about what other silly roles they played in other movies and shows"
    },
    {
      "rating": "3",
      "text": "What do you get if you mix 140 million dollars, a talented but clearly misguided director and a story believed and respected by hundreds of millions of people of different faiths around the world? In this instance, a nonsensical mess thats what.\r The 3 points are for a few striking scenes in an otherwise dire movie."
    },
    {
      "rating": "4",
      "text": "As boring as wandering in the desert for 40 years. Biblical epic is a double edge sword, its well-known tale might easily instill sense of marvel, but then again it is already well known. That means a movie with such original source not only needs to live up to the potential, it also has to produce a visualization of thousands years old scripture. Exodus: Gods and Kings does so little to said effects and frankly not enough to entertain, let alone awe the audience. Aside from the good visual and occasional short bursts of thrill, it's a long painstaking trudge through Moses' life.\r The graphic is indeed great, it's one of the movies that did 3D right. Depth perception and setting are meticulously made, when they both work in tandem the scene is absolutely gorgeous. It does not, however, rely solely on CG. There's adequate atmosphere in play to create an organic ancient vista, dust and stone seem like everyday sight in the movie. This visual will grab interest, sadly for only first half an hour. Most of the movie's problem is the pacing. It's very slow and scenes play out stutteringly.\r Editing is an issue as well, sometimes the movie pushes rather fast, but often dwell on the same matter. Motives and occurrences happen with thin reasoning, it is scripted by bible, but it could use much more explanation. Many times the story progresses merely by the willingness of the character to accept dubious development. It's never explained how Moses or Ramses come to decisions that will affect so many people, or how they convince them, for that matter. The movie is quite lengthy, but sadly it barely shows any vital interaction, and the characters are trapped in rigid single-minded behavior.\r It tries to be relatable and display Moses' doubt, yet even this is lackluster. When someone is handpicked vaguely to be a prophet, one would imagine that said prophet would have intense discussion if given the opportunity, but here it feels like childish bickering. It never rises to the point of entertaining or inspiring like Ridley Scott did with Gladiator, not does it deliver some uplifting tone like Prince of Egypt. While breaking into song may be too cheesy, it at least possesses a joyous celebration.\r Christian Bale does his best as Moses, but perhaps it's better for him to don a cape and start throwing batarang at Ramses."
    },
    {
      "rating": "0",
      "text": "This film insulted my intelligence; Black face in the 21st century is pretty much what this film boils down to. they tried to make the story \"realistic\" and changed the splitting of the sea and the burning bush to make it realistic but made the Egyptians white...hahahaha!!! horrible writing, accents, acting...an opportunity missed. Do not waste your hard earned money on this garbage called film.\rI would love to see a Vikings movie with Blacks playing the major roles HA!!"
    },
    {
      "rating": "0",
      "text": "Exodus is a failed remake of the movie classic The Ten Commandments and seriously downplays God and faith. What is unexpected however is how miserably the movie fails to deliver on its secular assets. The story line was weak and confusing, character development nonexistent; the acting was lackluster, and nothing memorable about the dialogue.\r As for special effects, the movie opens with very impressive scenes of ancient Egypt in all its glory. When it comes to the two visual milestones, the burning bush and the crossing of the Red Sea, Cecil B. DeMille is still the hands down winner 58 years later. A big budget and computer graphics are not enough.\r This movie suffers from a lack of message, emotion, and entertainment. It assumes you know the story of Moses, but then departs so far from the Biblical narrative to leave you frustrated and dissatisfied. If you are not familiar with the story, the gaps are so plentiful that all you are left with is a war movie and a chase scene, both of which are poorly done. For example, as Pharaoh chases Moses he loses his entire army in a landslide. A few minutes later, he is leading a division of chariots across the Red Sea!\r If you are hoping this movie will bring a Christian message to a younger generation, this movie fails miserably. Unfortunately, it also fails to entertain the secular audience. The movie is fittingly named Exodus, which is what moviegoers should do."
    },
    {
      "rating": "0",
      "text": "Apparently Hollywood hates the Bible and intends to mock it, this movie is another example.  It's so far off the mark it's embarrassing.  The first 10 minutes I was actually excited, the visuals were amazing, the details of ancient Egypt really enthralled me..but around minute 11, I just sat there pissed at how much the writer/director hacked the story up.  I'm pretty sure he never bothered to read the Bible to see if anything he wrote has any semblance to the original writings.  The Ten Commandments were more accurate than this horrible movie.  But then again, what do I expect from someone who hates religion?  This movie shows his contempt."
    },
    {
      "rating": "0",
      "text": "If you enjoy having your intelligence insulted then by all means watch it. Exodus was comparable to being locked up in prison on an episode of scared straight. You'll hear about how bad it is but you won't believe it until you are actually there. About 30 minutes in I'd had my fill of this \"Biblical\" story (laughable to even call it that) and left. Before I left I was sure to splash my Pepsi on the seats in front of me to serve as a warning to any poor soul that dare see this film next."
    },
    {
      "rating": "3",
      "text": "Although this movie is far better than the 2014 account of \"Noah\" it seems as though the producers and the directors are trying to re-wrte the actual biblical account as to what the bible actually says in the story of Moses and the exodus of Israel from Egypt. Maybe they were trying to give a different story line than the Charlton Heston version of the \"Ten Commandments\". There was no need to do that, with all the technical advances that are available to us today, it would have been very easy to make an action packed movie that could have remained true to scripture."
    },
    {
      "rating": "0",
      "text": "mindnumbing waste of money and efforts..  Cant believe its a ridley scott movie....\ri actually walked out of the film.. Just could NOT TAKE IT ANY MORE"
    },
    {
      "rating": "1",
      "text": "Typical Ridley Scott promises so much delivers an uninspiring load of drivel, appears that he has trouble remembering the story and gets carried away with his artistic licence. Even the special effects don't lift this nonsense to a level that could be entertaining. What did surprise me is that two good character actors in Bale and Edgerton have sullied their names by participating in this sad attempt to make a big movie. Do not waste your time or money, I will guarantee you will be at least disappointed if you go."
    },
    {
      "rating": "2",
      "text": "Having watched the mess that was 'Noah' I probably should have known better than to trust another 'visionary' Hollywood director to deliver on another epic Bible story.\r I was under no illusion that this would be 100% faithful to the source material, and some embellishment was to be expected, but what Scott has done is inexcusable and absurd.\r What a wasted opportunity."
    },
    {
      "rating": "2",
      "text": "Scott going through the motions yet again.  Prometheus was so lazy it was an insult, so is this monument to a huge budget CGI and a director with the attention span of a 3 year old."
    },
    {
      "rating": "2",
      "text": "There's a well worn phrase \"if it ain't broke don't fix it\". Why Scott felt the need to tamper with an epic story that would/could have been thrilling and thought provoking in it's unadulterated form baffles me.\r I hope this bombs at the box office and forces everyone involved with this rubbish to give pause for thought."
    },
    {
      "rating": "2",
      "text": "This film would be laughable if it wasn't so depressing, and by depressing I mean Scott's blatant disregard for the Bible account he supposedly drew inspiration from.\r I wish I had walked out but I was compelled by a morbid desire to see just how bad it could get. In that respect I wasn't disappointed.\r Guaranteed to frustrate, disappoint or amuse the faithful and faithless in equal measure."
    },
    {
      "rating": "6",
      "text": "The uninspiring story and mediocre cast may deter many however, the excellent CGI effects are the only thing going for it. Boring unoriginal direction and character development, defiantly worth a skip! If you like mother natural and animals tearing **** up this is your moneys worth!"
    },
    {
      "rating": "0",
      "text": "Pure trash, Ridley with the blatant white washing deserves this movie to bomb. Seti, Ramses II, Tuya and countless other Egyptians in this garbage heap of a movie were real people that lived thousands of years ago and they were not white, they were brown skinned people that looked nothing like the pasty Edgarton, Weaver, Bale or the rest of the cast of friends. Sunscreen didn't exist yet, no way in hell someone with Sigourney Weaver's ghoulish complexion would be able to handle the Egyptian heat, I have less trouble believing a man could part the ocean than I do with someone as ghostly as here surviving that area without stage 4 skin cancer. Someone should have spoken to the mods about this movie before it was made, incredible that something so blatant could be made in this age."
    },
    {
      "rating": "0",
      "text": "Bible meets Michael Bay film\r Rarely have I seen such a shoddy. An extremely up lasener Bible film of the same bloodless comes along like Transformers 4. Total waste."
    },
    {
      "rating": "1",
      "text": "In the beginning Viceroy Hegep says his problem is people are living longer. And so it is. Nowadays, we can see the original-the remake and even a second remake if we are lucky or unlucky enough. Exodus is\rthis generation's Cleopatra- an unspectacular spectacle of astronomical costs. Most of the name actor's don't disappear into their characters ( especially weaver and turturro) - like liz and dick.\rBale - a miracle himself- an incredible child actor (empire of the sun) still going strong- gives his best though this isn't his best- as yet , another biblical character gone wild. What irritated me most was the message delivered by this omnipotent god- peace can only be achieved through violence. Why not just brain wash them like Hollywood does us?"
    },
    {
      "rating": "3",
      "text": "The only way this gets a positive rating is if it's NOT compared to the classic \"Ten Commandments\", otherwise it's a shameful, waste of a remake. I barely got halfway through it before pulling the plug on its awfulness."
    },
    {
      "rating": "3",
      "text": "Possibly Ridley Scott's worst movie.  The story and performance of the Prince of Egypt animated movie was actually far superior to this.  Ridley's rendition of the story wasn't bad but the overall feel and performances of the movie didn't convince me.  It's forgiveable that Biblical movies are almost never going to be 100% accurate due to interpretation or style of director; they may want to focus on some other aspect of the story. There were some parts that weren't bad and the performances were very strong.  But it didn't feel consistent.  From the trailers, the casting already looked odd.  But I thought maybe it shouldn't be that bad after I watch it.   I was wrong.  After finally watching it was horrible and the characters were unconvincing.  The acting wasn't that bad but it didn't match the epicness of a movie like this.   It was a good twist to use a child playing \"a messenger of God\".  The kid is talented and has a lot of potential for a kid actor but didn't quite feel right in a movie like this.\rChristian Bale's performance was better than I expected. Although, I think it would be more powerful if he attached a bit more of Moses' character.   Moses actually wasn't a great speaker (he stuttered) and I don't even think he was a general from what I recall.    Also, one part that seemed to stand out was his accent didn't seem consistent throughout the movie (especially noticeable in the first dialogue with the \"viceroy\").  Overall, it didn't have quite an epic feel as I would have expected from Ridley.   The effects were good...the cinematography captured some of the essence of that era.  But overall it wasn't a keeper.  Maybe it's just me, but I'm a big Ridley Scott fan....and just being too harsh.  Not his best work anyways."
    },
    {
      "rating": "3",
      "text": "Overtly dragging and long in length but suffocating . The humanizing of a biblical villain ok long have they been marginalized like the enslaved people of Canaan. But why so dragging and unnecessary comedy of pharoses advisors downplays the dense heavy handed emotions of scenes. was Moses talking to god or just to belligerent **** angel I don't know never explained like most Ridley Scott films have dead end plot holes with multitude of contradictory explanations in films."
    },
    {
      "rating": "0",
      "text": "Before I begin, I'd like to say that I am in fact an atheist, and hence, my review will not be based upon the accuracy of the story line. Instead, I'd like to say that I'm going to go ahead and give this my worst movie of all time award, based solely upon how horrible its acting, dialogue, and production values are/were. They went ahead and got Christian Bale along with Ben Kingston, two decent actors by all accounts. But their performances in this movie are just horrible. Granted, whomever the director was is to blame. Some of their lines are just plain horrible. I, much to the dismay of everyone watching this \"film\" with me, was laughing constantly. It seemed like it was written by a little kid, and that's at is best. My finial problem is that the movie just doesn't know what it wants to be. It has a bit of shock value, a bit of action, a bit of drama, a bit of everything. AND ALL OF IT IS HORRIBLE.\rIts bad, Its very bad.\rReally, we don't need any more of these horrible Bible stories gone action movies. They just turn out to be bad, and thats the extend of it."
    },
    {
      "rating": "5",
      "text": "When I first heard of director Ridley Scott's willingness to make a feature length interpretation of the story of Moses and his quest to lead the Israelites out of Egypt, I had my doubts of the outcome. Scott has not had a very good track record of making historically epic films with duds like 1492: Conquest of Paradise and Kingdom of Heaven in his resume. Armed with a  cast of white actors to play the lead roles of Hebrew and ancient Egyptian characters,  Ridley Scott sets out to retell the story of Moses no matter what the cost and what audience he alienates in the process. The portrayal of Moses which will no doubt leave religious audiences scratching their heads and others with little more than a visually stunning movie with little substance.\rMoses (Christian Bale) is the adopted brother to future pharaoh Ramses II (Joel Edgerton) and chief military council of Egypt, under the Seti (John Turturro) the current pharaoh. Moses and Ramses are as close as can be and are sworn to protect each other from harm. The current ruler knows in his heart that his adopted son Moses would make a better heir to the throne than his own son, but this cannot be as Moses is not blood. A prophecy is spoken by Seti's high priestess that during battle a true leader will be found as one of the men would save the other. Of course Moses would save Ramses and which would lead to dissension between the two brothers.\rAfter Seti dies, Ramses ascends to power. After a visit to the Israelites to thwart a possible revolt, Moses' true identity is revealed in a meeting with the elder Nun (Ben Kingsley), who insists that he is a Hebrew child sent down the river and raised by Egyptian parents to escape a purge of Hebrew children by the Egyptians. When Ramses finds out he is condemned and exiled. Wandering the land for a new purpose for his life and to seek a place to settle, Moses arrives in a small village and meets his future wife Zipporah (María Valverde) and raises a child. A simple life, one which suits the former warrior, but there is something pulling him back to his former land, something that will change Moses forever.\rNearly a decade after leaving Egypt, Moses comes face to face with God on the summit of Mount Sinai, who informs Moses of his need to return to Egypt and lead an army to free his people. With the help of Joshua (Aaron Paul) and a small army of Hebrews ready to fight for their freedom, Moses begins his quest to achieve God's will. Fearing war, Moses pleads with Ramses to consider his proposal and free the slaves, but when Ramses refuses, Moses turns to God for the answers, but the response he receives is not one he expects and Moses must witness the wrath of God on the people he once called his. Fearing that time is running out, Mose must find a way to rescue his people and deliver them safely our of Egypt, but will Ramses bow to his former brother or will he defy his oath the keep him safe in order to defend his kingdom?\rTo his credit, Ridley Scott tries desperately to depict the events of the Book of Exodus into his interpretation of how these events would've come to be, the problem is, he takes too many liberties with his source material. From the re-imagining of Moses first visit from God to the parting of the Red Sea, Scott seems to believe that an updating of the original telling was needed by, more or less, explaining these events in a less than mystical way. This tactic is not one that will bode well for Scott as the core of his audience will be left feeling a bit cheated. The pacing of the film is also in question. The film is not as long as it could've been, and I'm not sure that's a good thing, considering that Scott spends most of the film trying to cram the entirety of the Moses story into a 2 1/2 hour film. What he does spend most of his time doing is setting up his visual set pieces which are aesthetically grandiose but very little else.\rChristian Bale is one of the lone bright spots in this film. The actor embraces the complexities of the Moses character and entrusts his instincts to flesh out just who Moses truly was. Each phase of Moses life is carefully defined by Bale's impeccable acting style which gives a fresh take on the popular biblical character. Joel Edgerton has such an important role to this story, but it seems that, in some ways, his character is downplayed to depict a move feeble man instead of a vicious, power hungry dictator. The chemistry between Bale and Edgerton is enjoyable to watch as both actors try to best each other. Besides the two main characters, the ensemble, which includes Sigourney Weaver as Ramses' scheming mother and  Aaron Paul as Joshua, never gets the chance to develop much of a character arc and are given very little to shine.\rOverall, Exodus: Gods and Kings is not a very good film. It's liberties to the source material do very little to keep the audience engaged and its reliance on visual effects isn't enough to save the film. I"
    },
    {
      "rating": "0",
      "text": "I give it 1 mark only for the costumes. If Hollywood can make a magnificent movie like Schindler's List to be true and accurate why can't they make a movie from the Bible the same way? Not add anything like a landslide that never happened or rocks that come to life in Noah. We walked out and got our money back. I double dare Hollywood to make a true and accurate Exodus movie from the author Himself."
    },
    {
      "rating": "1",
      "text": "Frankly I'm insulted this is even being called a movie. The lack of direction and character development is astounding. Is this is supposed to be a Biblical movie? There were so many mistakes and factual incorrect scenes that it almost made me fall out of my set. Which is sad because the CG is actually pretty decent. In short, I wouldn't recommend this movie to anyone, and it should be completely redone."
    },
    {
      "rating": "0",
      "text": "Exodus: Gods and Kings. If that title doesn't give it away as a bad movie, I don't know what else will (because there are no gods or kings in the story lol). However, I did go see it with my parents with sheer curiosity as how an atheist is going to depict the biblical story of Exodus.  All I have to say is if anyone makes a bible movie, they should at least use the Scripture text as source material for the movie, especially if they want us to enjoy it. And what is the negative effect of a movie like this? Well, it's a waste of time and energy making it if it is made for the glory of the world and money and not for the glory of God. And some innocent people may watch this and think this is the story of Exodus from the Bible, but it's not even a SHRED close to the writings in Exodus. It may actually be the worst movie I've ever seen in my entire life, because I left the theatre 2/3 the way through out of disgust. We need to ask God the Father for movies like \"Passion of the Christ\" and \"Gospel of John\" which are amazing movies made for God's glory and honor.   I mean, come on, the mention of God is so missing in this movie, you'd be surprised at the end of the movie if Israel even had a God.  Where was Moses' rod that he turned into a serpent and did the signs with?  The bottom line is that this movie is just a laughing stock for true Christians who know their Bible, as it should be."
    },
    {
      "rating": "9",
      "text": "Yet again another divisive movie based on the Bible. Just so you guys know I am Catholic and take faith seriously. And personally I found the movie to be very good. Yes, the director does take some artistic leeway in terms of how some scenes play out but honestly taken as a whole it has all the major parts and main points there. I do think the director wanted to walk a fine line to try and get his atheist/hollywood audience to buy it but there isn't much discussion about God being real within the context of the movie as (spoiler alert lol) the Red Sea parts. So it is definitely clear that God is there. Is it exactly like the old movies? No. It is a really good movie worth seeing and faithful to the Bible? Yes. I will say I was glad that at least Moses said \"God\" unlike Noah who only said \"the Creator\". If you are a hardcore literal interpretation of the Bible type person then you won't like it. But I think the vast majority of people including those of faith will."
    },
    {
      "rating": "6",
      "text": "This movie is not so bad after all. Story loosely based on the moses story. Unfortunately the big let down are \"Moses with no staff\", \"No pillar of fire\" and the best of all \"Sea wasn't divided, but an extreme low tide\".\rOther than that, it still an enjoyable hollywood movie."
    },
    {
      "rating": "2",
      "text": "IF you HAVE to see EXODUS: GODS AND KINGS see it in 3D or don’t bother seeing it. The only reason for seeing this film is for the special effects. I sat there wishing Anne Baxter or Yul Brynner  would come on screen and start chewing the scenery! I never thought I would think of Charleton Heston as a great actor but I did watching this. If you don’t know what I am talking about please see THE TEN COMMANDMENTS, a 1956 American religious epic film produced and directed by Cecil B. DeMille, that was cheesy and camp!\r Aside from taking many liberties with the Bible this film is seriously miscast with the two male leads. Christian Bale seems to have only two expressions, neither appropriate to the role of Moses as a leader. We know that ’a child should lead them’ but God as a child? Oh to hear Cecil B. DeMille’s booming voice! Joel Edgerton, as Ramses, has Brynner’s build but wears a lot more mascara.\r Sigourney Weaver is completely wasted as Ramses’s mother but then most of the women in the film are a second thought. Ben Kingsley and John Turtuuro are given little to work with but do what they can with the underwritten roles.\r It took 4 writers: Adam Cooper, Bill Collage, Jeffrey Caine and Steven Zaillian  to write a script that lets all the actors down and  Ridley Scott, the director, and one of the producers, certainly loves the blood and gore.\r Getting back to the special effects while DeMille had a lot less money and nowhere near the techniques available today most of his effects were cheesy and funny but Scott does everything he can, using every technical  aspect available to show the plagues and, yes, his parting of the sea is spectacular.\r Just for the record, and this may be a mark against me, as I watched Moses etch the tablets--yes he does--while tea is supplied by God, I couldn’t get Mel Brooks, as Moses, in his film HISTORY OF THE WORLD PART 1 dropping the third tablet. If you haven’t seen this film and/or the Cecil B. DeMille’s film do yourself a favor and watch them instead of seeing EXODUS: GODS AND KINGS!"
    },
    {
      "rating": "0",
      "text": "Horrible depiction of World History\r Where can I start with this horrible movie. Ridley Scott allowed his fantasy to get the best of him with this creation. First, Ancient Egyptians were not Europeans but Africans as their practices, murals, customs and beliefs are African. Depicting Ancient Egypt as European when the African Egyptians called them Typhonians or People of Seth because of their love of violence and destruction wrecked havoc on their societies for thousands of years. I suggest if you are a history buff please do not purchase a ticket for this movie. I am a White professor myself but I can't condone history being rewritten destroyed by people like director Ridley Scott any longer. This is disrespectful to individuals as myself who spent countless hours of research and travel to these wonderful places for truth and love. I am just fed up I am typing furiously on my keyboard because we as a people need to advance pass the differences and racism. It is the 21st century.\r Thank You."
    },
    {
      "rating": "1",
      "text": "To rewrite the Bible is spiritually expensive. No hollywood budget can afford the wrath to pay leading folks to believe this is the story of Moses, because its not.  I walked out as i watched moses chisel the tablets while some creepy little boy poured tea.  Need i say more?"
    },
    {
      "rating": "8",
      "text": "First of all, I’m Christian. Nevertheless, simply because Exodus: Gods & Kings strays a bit from the Biblical account doesn’t mean I’m going to dismiss it. Us religious people shouldn’t be so seemingly harsh on E:G&K, because it kind of paints us in a bad light. (Ex: religious fanatics can’t tolerate the slightest bit of change!) Now, because so many hate on the film due to its differences with the Bible, I’m going to discuss what’s different.\r Early on in E:G&K, Moses is depicted as an experienced warrior with a sword. He later displays conflicted feelings, argues with God, and questions the severity of the plagues God inflicts on Egypt. Unlike the Bible, in E:G&K,  Moses isn’t slow of speech and slow of tongue and doesn’t have his brother Aaron as his spokesperson.  Unlike the movie, Moses is portrayed in the Bible as a “a quiet but firm shepherd--one who delivered his people from slavery with a staff and God’s plagues, not an Egyptian sword.” In the movie, Moses and his generals (who lead their own makeshift army) at one point prepare to hold-off the first wave of Pharaoh’s army. But Moses never created a Hebrew fighting force to combat the Egyptians.**E:G&K also shows its antagonist, Ramses, in a positive and humane light. (It should be noted that the ruling Pharaoh during the time of Exodus is never named in the Scriptures.) He is shown to refuse letting the Israelites go partly because he “doesn’t believe that Egypt could survive the loss of its primary labor force”—the enslaved Israelites. E:G&K shows “the challenges of Ramses’ predicament: the Egyptian gods were not responding–while the Hebrew god was terrorizing the Egyptian people with one terrifying and deadly plague after another.” He was probably torn and conflicted over what he should do. Later, Ramses doesn’t decide to chase after the Israelites and Moses until after his dead baby (killed by God in the final plague) is being mummified and placed in its coffin.**In E:G&K, God leaves Moses on his own; he lets Moses make most of the decisions, and he doesn’t offer much in the way of advice and guidance. In the Scriptures, Moses is instructed by God what to do, and he and Aaron actively are a part of the Plagues (sometimes beginning them). In the Bible, the 10 Plagues are shown as separate, God-derived events but in the movie they are shown to be connected to each other in a series of (slightly improbable, yet supposedly more ‘realistic’) events with a cause-and-effect relationship. When Moses and the Hebrews arrive at a seemingly dead end (trapped between Ramses’ army and the Red Sea), Moses throws his sword in the sea in anger and frustration-and the water then begins to recede because of this. The Israelites are afraid but show faith and follow Moses. Moses and Pharaoh both never are assaulted by a big wave in the climax of the parting of the Red Sea, only for both to survive. Moses leaves Egypt unscathed, and the Pharaoh dies by drowning.\r Despite these changes, I don’t believe that this is some deeply offensive Hollywood abomination--it’s just a movie adaptation of a novel. And with most adaptations, changes are made to help the movie become a smoother (more slick and streamlined) cinematic tale. “Viewers at extreme ends of the audience (those hoping for a close adaptation or a drastic reimagining) may find that Scott has either taken too many or not enough liberties with the events of Exodus.” Me? If he was going to adapt it, I wouldn’t want something exactly the same as something I’ve already read. I’d want some new material that is within the spirit of the text source. I’d want changes made that make things a little different and interesting, yet nothing that completely changes the whole theme/idea of the text. The movie has nice CGI, and the scenery/costumes are great. I personally think they could’ve cast more people who weren’t white and still get the movie financed. (Scott said it would’ve been impossible to make the film with mostly black actors and get the film financed, but I think that’s BS.) Despite it’s long run time, almost all the characters in the film are somewhat one-dimensional. The actors do fine but high-profile acting talent is wasted, and G&K’s biggest problem is that there isn’t enough character development. The fact that Moses and Ramses grew up as brothers yet turn on each other so quickly isn’t believable. The 2nd biggest problem is that E: G&K is way too dark, moody, and gory/violent all the time--for what should be an awe-inspiring tale of hope. Yet, I like that Scott depicted the events of Exodus in a cynical, realistic way as he tried to get viewers to challenge their perceptions of the events of Exodus. E:G&K’s “storyline is mostly in step with the fundamental message and themes of the Hebrew scriptures–but placing added emphasis on Moses’ personal doubts and the horror of God’s violent crusade to punish the Egyptians. E: G&K is a tale of relatable faith in a world where things aren’t black and white.”"
    },
    {
      "rating": "7",
      "text": "Underdeveloped plot threads and overstayed welcome aside, \"Exodus: Gods And Kings\" nevertheless entertains with its sweeping scale and relatively admirable stab at the epic tale of Moses and the Israelites."
    },
    {
      "rating": "5",
      "text": "A visual masterpiece of epic proportions. It's stunning - the nature and it's production design. Unfortunately, due to a shoddy script, the film is awkwardly paced and a far less exciting tale than anticipated."
    },
    {
      "rating": "5",
      "text": "The visual elements in Exodus: Gods and Kings (cinematography, art design, and CGI) are competently executed (the sequence with the plagues is a standout). Unfortunately, I get the impression that the movie had several scenes cut for commercial purposes. What makes the Moses story so captivating is that it's about a love-hate relationship between two brothers, an aspect that wasn't explored with much depth. I never felt Moses and Ramses grew up together since they always acted like enemies when they were in each other's presence. The latter being portrayed as a one-dimensional cartoon villain doesn't help much to the cause either. The characters' motivations don't always make sense (E.g: Moses claims to care about the Egyptians, yet he orders his men to burn their food supplies), and their development is rushed (E.g: Moses accepts his fate as a prophet too easily).\r The acting is fine, which would normally be a compliment, but keeping in mind we have the likes of Christian Bale, Joel Edgerton, Sigourney Weaver, Aaron Paul and Ben Kingsley (the latter three are criminally underused), it comes off as a disappointment. But they're not to blame, the fault relies on the paper-thin script they had to work with. Bale however has his moments, and achieved to project his trademark gravitas into Moses. You buy him as an imposing leader and a morally torn prophet.\r Another major problem was God's characterization, which had the subtlety of a Super Bowl commercial. Instead of being a mysterious voice of reason, he's a hateful brat throwing tantrums. I often wondered, why is Moses following his instructions?\r Ridley Scott couldn't quite figure out how to handle the religious elements. He tried to please religious and non-religious people alike by mixing realistic explanations (and the suggestion that Moses might be insane) wih mystical tones (the death of the firstborns is supposed to be taken as granted, unlike the other plagues, which are supported with science). It's more confusing than ambiguous.\r I hope there is a director's cut out there that makes Exodus: Gods and Kings the great movie that didn't make it into the theaters. As it stands now, it keeps the Ridley Scott tradition of the last 15 years: astonishing visuals undermined by disjointed and pointless storytelling."
    },
    {
      "rating": "8",
      "text": "Exodus is a grand and complex new interpretation of the story of the Hebrews and their exodus from Egypt by legendary director Ridley Scott, known for films such as 'Alien' (1979), 'Blade Runner' (1982), 'Gladiator' (2000), 'Black Hawk Down' (2001) and 'Prometheus' (2012). The film stars Christian Bale as Moses and Joel Edgerton as Ramesses.\r 'Exodus' breaks new ground in its depiction of epic landscapes and the glory of architecture. Ancient Egypt is reconstructed before our eyes with vast CGI vistas of pyramids and temples populated by thousands of ant-like workers. The audience truly has God's view of this panoply, looking down from above at one of the world's mightiest and most ancient civilizations. Likewise, we are given breathtaking views of mountains and the desert landscapes of Egypt as Moses wanders, first as a outcast, then as a leader of his people into the unknown wilderness. Special attention is given to the sea floor of the Red Sea as special effects wizardry reveals what lies beneath the waves as God rolls back the tides for the Hebrews.\r The drama of the epic is centered around the two personalities of Moses, the adopted Egyptian prince and his natural-born brother Ramesses, the incipient Pharaoh. Bale turns in a dedicated and focused portrayal of a reluctant messiah induced by God, in the persona of a 7-year-old boy, to lead his people out of slavery. I found Joel Edgerton's Ramesses to be much more interesting. He interprets the young pharaoh as a brash, bullying, but shrewd man, born to the purple. His performance hearkens back to that of Joaquin Phoenix's Commodus in 'Gladiator', and exceeds it in power and depth. Edgerton projects a sort of visceral sense of entitlement that brings the pharaoh to life. John Turturro plays referee to two princes as the wise elder pharaoh, Seti.\r The main weakness of the film is that the lack of action makes the two-and-a-half hour running time seem very drawn out. Part of the problem is the faithfulness to the long biblical narrative, and the other part is weak-willed editing. For example, there is a long sequence in which Moses wanders in the wilderness, encounters a bedouin community, marries a woman and has a child, all of which could have been safely omitted from the film. Moses' interactions with the ghetto-like Hebrew slave community in Memphis is also written and edited in a somewhat ham-handed manner, leaving actor Ben Kingsley, playing a Hebrew elder, with the raw end of the script.\r The costumes and scenery of the film are a high point that set a new standard for depiction of the ancient world, going far beyond even Gladiator in their detail and authenticity. The razor-sharp cinematography and moody lighting combine to give the film a fine-art feel, like a Ruisdael painting come to life.\r Overall, 'Exodus' is a rich and complex film that provides a valuable new re-telling of the Hebrew mythos."
    },
    {
      "rating": "10",
      "text": "I think it was great and technologically advanced in the making any person that can bring in the open the wonderful stories of the bible is great. It's better then some of the evil garbage in the movies today that fill r youth with horrible thoughts but I found it to b a little off from scripture but again it's great to see stories from our true history come alive even if they r a little off people can be drawn to read the true story themselves everyone should see and support good quality movies"
    },
    {
      "rating": "10",
      "text": "Ridley Scott basically took the fairy tale and gave it a touch of realism. No wonder religious majority hates it. It showed that movie critique in general is subjective as I always argued. They're not criticizing the movie, but the Atheistic approach and this is why 4.4 is not really the score of the actually movie here.\r On the other hand, the fact that the film topped the box office during its opening weekend with $24.5 million shows that mass opinion of religious zealots is completely irrelevant. The more they hate something, the better it actually is. And boy, it definitely is. The film is MAGNIFICENT!\r This is why I love Ridley Scott. He doesn't let public opinion influence his work.\r The film is probably the most realistic portrayal of bible event I've seen so far. People argue that it should have stayed literally true to the bible. But how can you stay literally true to something that's not even true to itself? Our bible is completely different to the original bible. It was changed and revised countless of times through centuries.\r Events that happened in Bible are described as god's deeds only because people couldn't explain them in any other way at the time. Just as cavemen before them thought the stars were small spirits floating above. That doesn't mean we should turn the stars into divine fairies when filming the stone age today.\r I give this film clean 10 to balance the bias. Else I would give it 8. Definitely worth watching."
    },
    {
      "rating": "7",
      "text": "This movie starts trying to explain the strong brotherhood between Moses and Ramesses. It somewhat succeeds because it only shows one scene when their father is saying keep eachother safe, always. I never felt that bond between Moses and Ramesses because they only liked eachother for one small scene and hated eachother for the rest of the movie. But when they form a rivalry, it turns into a strong hatred and that part is awesome. Especially the \"battle scene\" at the end when Moses \"parts\" the Red Sea and the huge wave engulfs the entire Egyptian army and somehow by some magical coincidence, Ramesses survives. Perhaps god spared him so he could feel guilty? Also, the movie has a ton of pacing issues! The beginning drags on and on and the end drags as well. The middle sequence is the best because their is a smooth transition between events. The part that drags the most is when Moses forms a family. I did not care about his wife and his child and I actually wanted them to die so the movie can move on. But, eventually it did and the 1 hr segment in the middle is awesome. It shows the conflicts in egypt as Ramesses becomes power hungry and tries to find Moses who is hiding in Egypt, training his small army so he can free the hebrew slaves and again, the big battle in the end and the awesome battle scene at the beginning of the movie. All in all, Exodus is a good film but has a lot of pacing issues and lacks some character development. Exodus gets a 7/10 (good)."
    },
    {
      "rating": "1",
      "text": "I won't be running to a movie without first reading whether an atheist wrote it.   It was so biblically incorrect in so many ways.  I sat waiting to see things happen (which never did) but saw things happen in the movie that aren't biblically.  Left me scratching my head, like HUH?  It made as much sense as watching a ballerina try to play football in her tutu"
    },
    {
      "rating": "1",
      "text": "Not Biblical on any account at all. If R Scott wanted to mock the Biblical view and God as a little bratty kids he gets two thumbs up, but this was a pathetic excuse of any semblance of what the story either Hebrew or Christian account. be prepared to be sadly aggravated and it's not at all even entertaining.  I have nothing, NOTHING good to say about this, waste of time and film."
    },
    {
      "rating": "0",
      "text": "This movie was absolutely inaccurate with the Biblical text.  I found it deeply insulting to use a Godly tale and have it retold without God.  Cinematography was great and if you are not a Christian, or may not know enough about the Bible you may even find it a bit entertaining.  I understand that Hollywood will put their spin and interpretation on their stories, but to reinvent the story and failed to recognize the author are two steps too far even for Hollywood."
    },
    {
      "rating": "7",
      "text": "The beginning of this movie was boring.... I mean PAINFULLY boring. But as the movie progressed it picked up the pace and had some pretty awesome sequences. It is just too bad that it was too long and dragged on and made me want it to end. But all in all, Exodus is a good movie. It just could have been much more."
    },
    {
      "rating": "6",
      "text": "Christians hold on to your crosses you may nail this one to the cross and cast the first stone at Ridley Scott for rebooting Cecil B Demill version. As for regular audiences its a watered down version of Gladiator. In general its not Passion of the Moses and it doesn't move you emotionally or move mountains. The director fired God and edited God's performance out of the film and replaced it with Ridley Scott's faithless gospel."
    },
    {
      "rating": "3",
      "text": "Ridley Scott wanted to please everyone, and he couldn't. On one hand it is good that he put logic and reason into the miracles, but on the other hand the whole thing turned out to be something that is ashamed of itself. If you are using the Bible as a source material, do not try to rationalise it, because you will fail. The depiction of God/God's messenger was horrible in every possible way, I just wanted to hit him so hard, he was that annoying. Also Moses was way too sexy for the circumstances. And why is everybody white in Africa?"
    }
  ],
  "recommendations": [
    "noah",
    "machine_gun_preacher",
    "risen",
    "zero_dark_thirty",
    "unbroken_path_to_redemption",
    "valkyrie",
    "children_of_men",
    "heaven_is_for_real",
    "apocalypto",
    "the_shack",
    "silence",
    "greenland",
    "son_of_god",
    "dark_waters",
    "alexander",
    "constantine",
    "the_road",
    "interstellar",
    "contact",
    "crash",
    "13_hours_the_secret_soldiers_of_benghazi",
    "babel",
    "chaos_walking",
    "avatar",
    "lone_survivor"
  ]
}