{
  "id": 3036,
  "title": "Exorcist II: The Heretic",
  "starring": [
    "Linda Blair",
    "Louise Fletcher"
  ],
  "runtime": 118,
  "genre": [
    "Drama",
    "Horror",
    "Thriller"
  ],
  "description": "Bizarre nightmares plague Regan MacNeil four years after her possession and exorcism. Has the demon returned? And if so, can the combined faith and knowledge of a Vatican investigator and a hypnotic research specialist free her from its grasp?",
  "releaseYear": "1977",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/g9i3LTMYLRHvCYSKimZEfd1Vqy7.jpg",
  "categories": {
    "plot": 2.0,
    "acting": 3.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Good story ruined by unnecessary and negatively uncomfortable scenes, bad acting, and confusion that lurks in this film."
    },
    {
      "rating": "2",
      "text": "Si, es una película bastante deficiente, la historia es deliberadamente confusa, ridículamente sin pies ni cabeza, razón de ser e innecesariamente compleja, el hecho de ser precedida por la mejor película de terror de todos los tiempos ya complicaba mucho la recepción de esta infame secuela, pero en el fondo no es tan mala si tan solo olvidas por un momento la existencia de El Exorcista original.Si existe algo que se pueda destacar positivamente es la banda sonora y nada más."
    },
    {
      "rating": "3",
      "text": "Terrible FollowupThis movie disrespects the legacy of it’s predecessor with it acting like a bland and stupid horror film."
    },
    {
      "rating": "0",
      "text": "Nothing is good about this movie, the original wasn't really sequel worthy, but this is too far, by far just one of the worst movies."
    },
    {
      "rating": "1",
      "text": "Truly terrible film. I can’t even think of any reason to watch this. There was one second shot of someone stepping on spikes which was entertaining and some bits on rocks which looked alright. The rest of the film is painful incomprehensible crap. I believe that this is the worst film ever made. Do not watch. Atrocious."
    },
    {
      "rating": "3",
      "text": "the exorcist 2 is a rare and at the same time disastrous movie, unfortunately it is one of the worst sequels I have seen despite the fact that it has great actors and a good director. A failure in all respects but with beautiful photography and very few aesthetically beautiful scenes."
    }
  ],
  "recommendations": [
    "jeepers_creepers_3",
    "the_day_the_earth_stood_still",
    "jeepers_creepers_reborn",
    "the_legend_of_hercules",
    "mortal_kombat_annihilation",
    "the_wolfman",
    "clash_of_the_titans",
    "the_eye",
    "the_happening",
    "aquaman",
    "abduction",
    "the_omen",
    "day_of_the_dead_bloodline",
    "pulp_fiction",
    "see_no_evil",
    "dark_phoenix",
    "the_matrix_resurrections",
    "the_last_airbender",
    "the_room",
    "book_of_shadows_blair_witch_2",
    "superman_ii",
    "the_final_destination",
    "the_mummy_tomb_of_the_dragon_emperor",
    "ghost_rider_spirit_of_vengeance",
    "the_mist"
  ]
}