{"id": 4889, "title": "Exorcist: The Beginning", "starring": ["Stellan Skarsgård", "Izabella Scorupco"], "runtime": 114, "genre": ["Horror", "Mystery", "Thriller"], "description": "Having lived through traumatizing events during WWII, Father Lankester Merrin takes a sabbatical from the Church to conduct archaeological excavations in British-administered East Africa. Merrin unearths an ancient Byzantine church believed have been built and then immediately buried to keep down evil from the crypt below. The natives are convinced that uncovering the church has unleashed a demon, and begin to violently clash with the British military troops. As the village rapidly disintegrates into chaos and war, Merrin must face-off with the demon which has taken possession of somebody close to him.", "releaseYear": "2004", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/phXWlfOuTxzOnO96BNZ8CiSJqZk.jpg", "categories": {"plot": 5.2, "acting": 3.0, "ending": 4.2, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.0, "action": 7.0}, "reviews": [{"rating": "4", "text": "To me, Exorcist: The Beginning is a stronger, scarier film that is not empty like Dominion kind of is. However, I still think this film sucks."}, {"rating": "6", "text": "Lacks focus and any true sense of pace. It steers clear of the psychological themes and horror from the original, instead hoping to evoke some reactions by throwing as much ugly effects at us as possible. Unfortunately, fear doesn't work that way."}, {"rating": "7", "text": "I can't tell how much I would have paid $10 extra if Friedkin had directed it. Even though his way was somewhat simplistic it still was one of the best horror films I've ever seen (the original). On that note, usually when people hear \"The Exorcist\" they still get those images of Reagan's demonic face. For most people, the images (and possibly voice) will stay with them forever, its made such an impact in people's minds. The thing I liked most about The Beginning was how it makes you think about how much the Churches actually DO cover up. (I wouldn't expect you to realize this if your one of those people who go to see a movie for the 'hot' actors.) Think on it for a second or two, Priests are still taught how to preform Exorcisms today. People like to often argue the fact that this can never happen and never has. If it can or hasn't happened, why are the priests still taught the rituals today? ... Also, I liked how they showed the church, the tomb with the stairs leading down was rather overused but it worked. Things I really didn't like were how they had the war, I'm sure we're all aware of the fighting in Africa. It didn't really give much to the real story and plot other than the area around the Church is like a playground of evil. Which again, is made aware by other scenes in the film. People who bash this movie and think the Ring and the Village 'out-scare' it, should not brag. Of course Sequels and Prequels are not commonly as good as the first, lets face its true. Anyways, I found The Beginning entertaining. The CGI was ok..it wasn't bad, you want to see bad? Go see Anacondas. I think Harlin tried TOO hard to live up to the original. Nothing mean towards Harlin, but I'm sixteen and I couldn't directed some of the scenes better. Still, I was happy to see that this wasn't as bad as the Washington Post claimed it was. If you don't like this film, you can always stay home and watch the original, it never gets old."}, {"rating": "7", "text": "i actually really enjoyed this movie a lot.. . but it didn't really show how it all began now. Basically it was just a body count movie with tons of violence and gore and scary images. There wasn't even a exorcism in the movie except that cheap one at the end."}, {"rating": "0", "text": "I watched this today with my boyfriend and during the movie I predicted what would happen, and I was right every time. It was just too predictable and like other movies. Don't really see exactly how this is the beginning, and the movie stunk too much to watch it again to understand. :/ Plus, the DVD features were extra boring."}, {"rating": "3", "text": "This prequel to \"The Exorcist\" seeks to follow the first confrontation between a young Father Merrin and Pazuzu, countering the opening scenes of the first film. The environment of the film is roughly in British Kenya, where a Byzantine chapel has just been discovered, in perfect condition because it was deliberately buried soon after construction. Here begins the problems of this film, with the script gluing Byzantine art to a chapel whose interior has nothing to do with it, besides being outside the geographical area where the Byzantines were. Okay, the movie is fiction, but does it need to invent something so unrealistic? Father Merrin is the most dense and complete character. Interpreted by Stellan Skarsgård in a relatively satisfactory manner, he is a priest in doubt due to the remorse and traumas of World War II. All this has been well used and intelligently developed. Another thing I liked was the romantic subplot between the priest and Sarah, the attractive nurse of the field, played by Izabella Scorupco. Possessions are slow to occur although demonic signs are evident, and the ending may even be surprising, but only partially. The film attempts to compensate for obvious screenplay flaws with special effects, but most attempts are so rudimentary that it does not have the desired impact. Renny Harlin may not be the worst director ever but he is definitely not one of the best. Throughout the film, there are very obvious exaggerations, likely fruit of a bad script and an indolent director. One of them is the characterization of Scorupco at the end of the film, in a clear and unnecessary allusion to \"The Exorcist\". This film was an effort, but an effort without glory or merit for any of those involved."}, {"rating": "0", "text": "“God is not here today, Priest”. Oh I laughed my ass off when I heard that golden nugget of a line. Renny Harlin you really outdid yourself here buddy, **** on legacy of The Exorcist with this boring, predictable, jump scare filled garbage.0/10 Jay x"}, {"rating": "5", "text": "I would like to start by saying that this is far better than Exorcist II: The Heretic (1977) but absolutely nothing compared to The Exorcist (1973) or The Exorcist III (1990). You know that there is going to be an exorcism and they don't let you think otherwise at any point. The problem is that the build up to this finale is not looking at the social aspects and the introverted paranoia associated with such confusion but instead focuses on confusing the issue. It feels painful as this has been done before so much better. This is boring with little development until near the end with an interesting twist and some cool scenes. The biggest gripe is that this film is laced with computer effects designed to impress the audience. You don't need to be impressed, you need to be scared. This film isn’t that bad, it simply doesn't deliver."}], "recommendations": ["children_of_men", "paranormal_activity_the_ghost_dimension", "sanctum", "chernobyl_diaries", "the_girl_with_all_the_gifts", "the_pyramid", "midsommar", "paranormal_activity_2", "unfriended_dark_web", "bird_box", "i_spit_on_your_grave_2", "unfriended", "the_curse_of_la_llorona", "antebellum", "the_purge_election_year", "vivarium", "the_haunting_in_connecticut_2_ghosts_of_georgia", "a_quiet_place", "the_purge", "paranormal_activity_the_marked_ones", "the_devil_inside", "splice", "brimstone", "annihilation", "brightburn"]}