{
  "id": 4010,
  "title": "Extinction",
  "starring": [
    "Michael Peña",
    "Lizzy Caplan"
  ],
  "runtime": 96,
  "genre": [
    "Action",
    "Drama",
    "Science Fiction",
    "Thriller"
  ],
  "description": "A chief mechanic at a factory, haunted by apocalyptic nightmares, becomes a hero when Earth is invaded by a mysterious army bent on destruction.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qjnNdjrZIdi7d316SjjkgEjJRSg.jpg",
  "categories": {
    "plot": 5.875,
    "acting": 6.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Looking rather similar to the horde, but there's a decent drama on this desolated winter. Chances are Extinction will remind audience to other zombie or survival movies, such as I Am Legend or even The Walking Dead television series. It uses many familiar elements in this already packed subgenre and honestly it doesn't boast that high of production value. The saving grace is its human drama, which may not be perfect, but acted and crafted fine enough to present a solid survival story.\r Patrick (Matthew Fox) and Jack (Jeffrey Donovan) are two neighbors surviving in cold wasteland. Both of them had unusual past which eventually drifted them apart, but they now must reconcile to protect a child from escalating threat. The pace is shifted from present to past regularly to showcase their backstories while the story moves forward.\r This method does set some nice character developments, furthermore the actors are definitely capable enough to make it work, seeing that the runtime of nearly two hours revolve around them. It does feel a bit slow at times since the angst and redemption theme are repeated frequently. The movie tries to deliver a few twists, these might not be outright predictable, but not exactly strong and occasionally reaching too far to produce emotional tone.\r Actual zombie assault takes much less portion of the movie than the drama, yet it is still made pretty well. Design and effects look better than most of smaller budget flicks. It won't look cheap or campy when the action starts, but it does tend to follow overused path of bald white creature and its quirky antics.\r The effort put to personal story and action survival might not suffice to rise above the horde, but it doesn't go to waste since Extinction, despite its flaws, is adequate for a survival tale."
    },
    {
      "rating": "7",
      "text": "While the movie isn't particularly scary, it's cliché and predictable and some people might find it a little bit too slow, it was quite enjoyable. The acting was good, the practical effects were good and the movie was rather entertaining. While it doesn't revolutionize the genre, this low budget horror movie still manages to be a pretty good one."
    },
    {
      "rating": "5",
      "text": "This movie reminded me of \"30 Days of Night\", what with its snowbound locale and bizarre creatures, which came across more vampire than zombie. It's a multinational production, produced by Spain, shot in Hungary and starring made for TV Americans. Everyone tries really hard to pull it off and some of the acting is okay, but the script is melodramatic and the direction is lost in translation. Over all it's the deep freeze version of \"The Walking Dead\"."
    },
    {
      "rating": "5",
      "text": "This movie wasn't as bad as many reviews made it seem. I would have given it an 8 if not for the horrible ending and the slow pace of the movie. Many times in the movie, the slow pacing worked since it helped develop the storyline and characters. However, I'm sure many people who chose to watch this movie as a zombie/horror thriller were seriously disappointed by the slow pacing as well as the very little screen time the zombies actually received in it.\rI liked Matthew Fox in Lost and Jeffrey Donovan in Burn, but it felt like they were lackluster in this movie with how their characters were portrayed so one dimensionally. As a matter of fact, the movie seems to go out of its way to leave things confusing as far as the relationship between Patrick, Emma, and Jack. I watched it twice just to be sure but I am confident that they did not explain their relationship. What was the relationship between Emma and Jack? Somebody please explain that to me already lol...\rIf not for Quinn McColgan, I might have given up on the movie early. Quinn, as Lu, really stole the movie. She charms the audience and makes the slow pacing bearable. So, basically, Lu got them up to 8 stars, and the screenwriters brought it back down to 5. Way to go writers..."
    },
    {
      "rating": "7",
      "text": "An atypical zombie flick. It gets points for it's new-ice-age setting and family drama center, but loses points for hard to follow-shaky action, dialogue-stuffed filler scenes, and predictable genre tropes."
    }
  ]
}