{
  "id": 1070,
  "title": "Extraction",
  "starring": [
    "Chris Hemsworth",
    "Rudhraksh Jaiswal"
  ],
  "runtime": 116,
  "genre": [
    "Drama",
    "Action",
    "Thriller"
  ],
  "description": "Tyler Rake, a fearless mercenary who offers his services on the black market, embarks on a dangerous mission when he is hired to rescue the kidnapped son of a Mumbai crime lord.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nygOUcBKPHFTbxsYRFZVePqgPK6.jpg",
  "categories": {
    "plot": 4.2,
    "acting": 4.0,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 4.571428571428571
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Bruce Willis has been taken, by this lackluster second rate action movie\r Extraction is done by the book, as in every step of the way is filled with action B-movie cliché. Strangely, the cast and plot have decent potential, yet it ends up mediocre due to severe lack of chemistry and uninteresting thriller aspect. There are some action fun from combat, though they are brief, too few and scattered throughout disjointed mandatory set pieces.\r Bruce Willis can deliver a good action movie and Extraction is primed for humorous quirky relationship with younger actors, he has done this gig before in RED. However, he looks constantly disgruntled and unsympathetic here. It doesn't help that he's held hostage for most of the time and even in some scenes with other leads, there's not a shred of chemistry to be had.\r Kellen Lutz, from The Legend of Hercules (not The Rock one) is not exactly bad. He just has an outstandingly plain on-screen presence, he wears action hero template with not much more personality. Gina Carano is capable, but she's relegated into supporting semi love interest character and her martial art credential isn't capitalized enough. The two share most screen time and a couple of them do work in their favor, but it'd be more interesting if the role is swapped and it's Carano who tries to save her father.\r As for the action pieces, they are strikingly rigid, although still presentable. Cue the typical bar fight, a venture into night club, some chase scene and then random warehouse shootout. The movie tries to create some thriller subplot, actually quite a lot is invested on it, but this isn't Tom Clancy's script. It's a lot of build up to an unexciting end. Worse yet, the rest of the characters are typical villains, their henchmen and a couple of obnoxious extra.\r Extraction is the bare basic action film, it may barely entertain a lazy weeknight with few action sequences, but it's lacking identity and charisma despite its favorable cast."
    },
    {
      "rating": "2",
      "text": "This is just a misandrist's action film.  The chick is a manly girl, and there is even a chick that drives a Mustang, as if it were cool . . . it's a pretty sad film.  If you are a fat chick that hates men, but isn't quite a full lesbian, and you dream of Bruce Willis (don't tell your \"girlfrinds\"), this is the film for you.It's really awful for everyone else."
    },
    {
      "rating": "3",
      "text": "In the old days, they made \"B\" movies to show with the main feature so the theater could charge for a double feature.  This was a real B movie.  Actors, script, story, production, all second rate.  Wow, what was Bruce Willis doing in this movie?  Did he owe somebody a favor?  Wasn't this the plot of \"A Good Day to Die Hard\"?"
    },
    {
      "rating": "6",
      "text": "I didn't find 'Extraction' to be that bad at all, it's not good either but it's definitely nothing terrible. I found it an OK, relatively well paced full on action film.It is, I will say, one of those productions that big up a well known actor, in this case Bruce Willis, yet they actually don't even feature much. That's a negative for sure, like why would you have Willis and not make him the main attraction - most likely down to financial/scheduling issues, but still.Kellan Lutz is very much the lead in this and I think he does a solid enough job, as does 'Fast & Furious' alum Gina Carano. Talking of alumni, 'The Walking Dead' duo Steve Coulter and Joshua Mikel appear.I agree the story is nothing exciting or thrilling, but I honestly didn't have much of problem whilst watching it. It's hollow, but nothing awful - in my opinion, anyway.If you're looking for a good action film with this title, check out the 2020 release with Chris Hemsworth - it's certainly much better."
    },
    {
      "rating": "0",
      "text": "This movie criticized Bangladesh by different angels.And yes Hollywood always try to criticized other for their marketing.but this time u guys have chosen a wrong.fk u"
    },
    {
      "rating": "5",
      "text": "Nothing special. Neither good or bad. Just a blueprint action movie. Will probably forget about it in few weeks."
    },
    {
      "rating": "7",
      "text": "Extraction is an average action flick that has awesome action, good performances, and a totally \"meh\" plot. But hey, this is exactly what Netflix is for and I'm totally okay with that."
    }
  ]
}