{
  "id": 2136,
  "title": "Facing the Giants",
  "starring": [
    "Alex Kendrick",
    "Shannen Fields"
  ],
  "runtime": 111,
  "genre": [
    "Drama"
  ],
  "description": "A losing coach with an underdog football team faces their giants of fear and failure on and off the field to surprising results.",
  "releaseYear": "2006",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/33gkfCURxgBBpiAnrWua4Txmrvs.jpg",
  "categories": {
    "plot": 6.875,
    "acting": 6.2,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.25,
    "funny": 5.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Viewing this movie, you are immediately aware of the low budget via the poor lighting, acting, editing, etc. However, I have to give it credit in that it did a good job on a very limited budget. The story itself, while predictable, is fairly entertaining if you set aside the ridiculous plot and reality. One item that stands out for me is when the coach gets a new car and he claims \"God gave me a new car!\" I guess we shouldn't think about the fact that it's a polluting and gas-guzzling V-8. Clearly, the movie is looking to cater to a particular audience. I also have problems with the idea of God really caring about a small town high-school football game outcome - any sporting event for that matter. Also, the overall impression that if you pray hard enough, your dreams will come true. Tell that to parents who have lost a child to cancer, war or an accident. It's religious propaganda. And no, our founding fathers would not be proud, they believed in separation of church and state."
    },
    {
      "rating": "0",
      "text": "A very unimpressive tale, cloaked in trying to squeeze money from a religion."
    },
    {
      "rating": "9",
      "text": "We all have Giants in our life to face and I think it is remarkable that a church put out a film of this quality on just 100K! The whole movie is a jewel and well worth bringing the whole family too. That includes grandparents...."
    },
    {
      "rating": "10",
      "text": "What a surprise! This was one of the most fun movies I have seen in a long time. It was funny, exciting, gripping, and refreshing. Even though I am a Christian I don't usually like \"Christian\" movies. They tend to be religious and preachy. This movie was NOT! I think anyone, of any religion (or no religion at all) could like this movie. Great football action sequences! Great story! I don't usually cry, but in several places I literally wept for joy! I highly recommend this movie!"
    },
    {
      "rating": "9",
      "text": "Yes, the acting is not perfert but they are not claiming to be million dollor actors. the Messsage is great. The story is good (I'm not a football fan). I believe every pre-teen and teenager should see this movie."
    },
    {
      "rating": "9",
      "text": "Great inspiration. Wholesome and encouraging entertainment."
    },
    {
      "rating": "10",
      "text": "This is the kind of story that I love. Winning comes from putting things in proper perspective. When this is done you can't lose. Even if the field goal is wide right."
    },
    {
      "rating": "10",
      "text": "Terrific, highly entertaining. Every movie doesn't have to be a high budget hollywood production to be taken seriously and enjoyed by families. This movie achieved just that. Our family loved it. Wish there were more like it."
    },
    {
      "rating": "10",
      "text": "A really good friend of mine recommended this movie to me. I am so glad she did. Not only was it one of the best football films I have ever seen, but it also presented a very straight-forward Christian message. This movie had it all- a moving story, great acting, and football. My only complaint is with the MPAA. Why would you give a movie that has no objectionable material a PG rating? If you ask me, this movie needs to be re-rated and given a G. Anyway, pick up this movie as soon as possible. Trust me, you will find it well worth your time and money"
    },
    {
      "rating": "7",
      "text": "This is an enjoyable inspirational film with a good storyline and a strong Christian message. The actors won"
    },
    {
      "rating": "10",
      "text": "This is a fantasitc film! Knowing this was produced for only $100K dollars and no professional actors, is amazing. I highly recommend."
    },
    {
      "rating": "7",
      "text": "I was pretty cynical about this film at first, but I loved it despite myself. It has heart--more than a lot of the pretentious, self-congratulating independent films out there. And Facing the Giants is earnest. Whether you agree with the message or not, you can tell that the actors really believe it. Certainly, knowing the story behind the movie makes it more powerful."
    },
    {
      "rating": "9",
      "text": "This film's budget was a mere $100,000, and from that fact alone, I'm amazed at the end result. This is a quality family film that blends football and faith very well. And the best thing is that the \"dorky\" factor that's found in many Christian-oriented films is nowhere to be found here. It includes great football segments which were filmed by a crew from \"Friday Night Lights,\" and you can feel the pain! Granted, this isn't Chariots of Fire or The Chronicles of Narnia, but it IS a great family film that deserves wide exposure. Kudos to Sony for picking it up for distribution."
    },
    {
      "rating": "9",
      "text": "I thought this was a fantastic movie. One my entire family could watch together. I can't wait until they make thier next one!!"
    },
    {
      "rating": "8",
      "text": "While I will concede with others who said the acting and some technical elements were flawed, I believe also that this film targeted a specific audience - and it nailed it! Secular critics, and - shall we say - the \"unchurched\" will never get this film but will scratch their heads over its overwhelming popularity with people like me. I grew up seeing typical \"preachy\" Christian films and endured them into early adulthood. I have since learned the value of films like \"Star Wars,\" \"A Beautiful Mind,\" and, yes, \"The Departed.\" This story moved my wife and me to tears as we watched it at home. I will be forever grateful to God and to the Sherwood Baptist Church for crafting a story that is so emotionally true and spiritually uplifting. What an awesome achievement!"
    },
    {
      "rating": "10",
      "text": "Very pleasantly suprised. Not a big budget production, but go in with the proper expectations, and you will be pleased. Uplifting."
    },
    {
      "rating": "10",
      "text": "It doesn't get any better than this! Our founding fathers would be so proud of such a film, as everything they beleived in and stood for, (such as, life, liberty, and the pursuit of happiness), was based on their belief in almighty God. Imagine, the positive impact on Americans, (especially our youth), if our entertainment industry provided similar productions, as the norm. I recommend, anyone breathing,should watch thisfilm! The fact that the movie rating industry placed a PG rating on this film, to warn parents about a message showing that \"all things are possible though God\", is ludicrous!"
    },
    {
      "rating": "9",
      "text": "Josh Rosenblatt for Austin Chronicle says it all, but the movie truly is inspirational, and powerful, its the best football movie I've ever seen. A must see, do not skip this. It is sappy but very emotional, even more sad than Extreme Makeover home edition. Its very influential, so do not judge this movie on how boring it is, because it is, but its excellent."
    },
    {
      "rating": "9",
      "text": "To keep it short, Facing The Giants had some pretty good football sequences in it, and this coupled with its great morals was precisely the reason I liked it. And yes, I am a Christian."
    },
    {
      "rating": "6",
      "text": "I found this movie from searching through good football movies a couple days ago. Then I saw this one and read reviews and having the review talk about how this movie displays a lot of Christianity I jumped on it knowing I had to do a religion movie review. So I watched half the movie on Friday and the other half today (Saturday). I would definitely recommend people to watch this movie as it gives some goof information about Christianity and what that religion can do for people. Also this movie incorporates football in it to make the movie less boring and it definitely helped to send the message of the movie through. The message of the movie was that with God everything is possible. My personal opinion on the movie was that it was decent but not good. It overplayed Christianity. They gave some false information and made it seem like Christianity could solve any problem in the world. But the movie did get it’s point across through a fun movie to watch and I did gain some knowledge about how Christianity can affect people’s lives."
    },
    {
      "rating": "9",
      "text": "Really motivating! Great effort by the cast and crew... at its core its Human Arrogance Vs Godly Submission.. lots to learn if you are humble and open-minded enough to learn....The element of the supernatural in life's battles is something which even i have experienced while facing my giants...  however this movie is foolishness to those who have been wired and conditioned to like movies that have no element of God or morality in it.."
    },
    {
      "rating": "0",
      "text": "God, oh god this movie is so bad. It's not even about the budget. The acting is terrible, the sound design, direction, art direction and screenplay are all so **** bland they make me want to puke. And the plot, oh the plot, i've never, EVER, seen such an unispired, uniteresting, stupid and terrible script. It's just so awful."
    }
  ]
}