{
  "id": 3515,
  "title": "Fading Gigolo",
  "starring": [
    "John Turturro",
    "Woody Allen"
  ],
  "runtime": 90,
  "genre": [
    "Comedy"
  ],
  "description": "Fioravante decides to become a professional Don Juan as a way of making money to help his cash-strapped friend, Murray. With Murray acting as his \"manager\", the duo quickly finds themselves caught up in the crosscurrents of love and money.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bThnmRhh0d3oKcmte2w0aArm8Lq.jpg",
  "categories": {
    "plot": 5.7272727272727275,
    "acting": 5.75,
    "ending": 5.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.4,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "“Fading Gigolo” has Sharon Stone, crossing and uncrossing her legs in a very short skirt--anyone remember “Basic Instinct”?--along with Sofia Vergara showing ALL her assets. It has a threesome between the two women and John Turturro, who also directed and wrote the screenplay, and a gigolo (Turturro) along with a pimp, the latter being Woody Allen. With  all this you would expect a lot of sex or what goes on behind the ‘business’ but the sexist scene is a kiss in a park in Brooklyn with Turturro giving the kiss. (Hey he wrote, directed, stars in the film--he can do whatever he wants!)\r Hidden in all this is a sweet love story triangle between Fioravante/Virgil (Turturro),  Avigal (Vanessa Paradis) and Dovi ((Liev Schreiber). Avigal has been a Hasidic widow for 2 years, is the mother of 6 children and is in a religious Jewish sect where women are invisible. Dovi is an officer in a Brooklyn Hasidic neighbor watch with special cars and uniforms who has loved Avigal for years but it is Fioravante who brings her alive with innocent touches and that kiss.\r The setup of Turturro and Allen as gigolo and pimp is quickly set up but really isn’t necessary to the film except with Stone and Vergara added to that part of the story extends the film long enough to be a featured film. Whether Turturro would be considered sexy enough to be a gigolo, get paid $1,000 and get Stone plus Vergara I’ll leave up to you. He is sweet enough to get Paradis’s attention.\r Vanessa Paradis steals the movie from all with Liev Schreiber as the sincere suitor who doesn’t know how to approach the woman he loves.\r Instead of the whole ‘sex for sale’ idea if more time had been spent on defining how a ‘trial’ can be held and the procedure that takes place, along with explaining more of  Avigal’s life it would have been a better film.\r This is a small ‘independent’ ‘art’ film that shows a woman becoming alive because she receives attention that she had never gotten even with 6 kids. It might also spark more interest in the Hasidic Jewish community in Brooklyn.\r “Fading Gigolo” is a film that would be better being seen on the small screen but should be seen on a movie screen to see Vanessa Paradis’s face and acting!"
    },
    {
      "rating": "7",
      "text": "“Fading Gigolo” was written and directed by John Torturro who also stars in the film with Woody Allen, Sharon Stone, Sofia Vergara and Vanessa Paradis. As is always the case with one who takes on the triple role of actor, writer and director, the objectivity needed to make certain scenes work or not work is lost or seriously diminished. Mr. Torturro, the writer, has written a thin improbable script and, as an actor, relies more on his facial expressions than the dialogue the viewer is begging to hear. Mr. Allen, easily cast as the  elder mentor and friend to Mr. Torturro’s character tries very hard to be the Allen of 20 years earlier but fails in this attempt. He is, after all, an older version of the character we loved to watch and now, sadly, we are conscious of this old man trying to  entertain us. The real value to this film is the performance of Ms. Paradis, a well known French singer, who steals and dominates every scene she is in. This is a movie about Williamsburg, a section of Brooklyn where Hasidic Jews have their own community and how this culture ultimately impacts upon the lives of the characters played by Mr. Allen and Mr. Torturro. As one who lived and worked in that community, I enjoyed the scenes of the lifestyles and people who resided there.  Unfortunately, nostalgia and interesting photography alone are not enough to make a really good movie. I give the film a 7."
    },
    {
      "rating": "5",
      "text": "I know what you're thinking: John Turturro (who also wrote/directed) is too old and unattractive to ever be a gigolo, but his pal (Woody Allen) dismisses those hesitations early. The film starts out with promise, but disappoints before it's over. Even some lovely ladies (Sharon Stone, Sofía Vergara) don't make it better. Allen plays Allen (but without the funny lines he'd write for himself) and Turturro stays sullen (this is clearly a vanity piece). While the premise is interesting, it loses momentum and never develops the comic potential. Let's just say that Turturro should stick with acting."
    },
    {
      "rating": "6",
      "text": "This film is generally well acted and well shot but the story is all over the place. Further, there are some basic unanswered questions: why is Mr. Allen living with the African-American family - this makes no sense? Why is Mr. Torturro so stiff, cold and  laconic (we have to rely so much on his facial expressions instead of more meaningful dialogue)? Why is there so many Hasidic Jewish details which seem to distract rather than add to the story (the Jewish trial is overdone and not funny)?\r The meeting between Mr. Torturro and Ms. Paradis just happens out of the blue although their involvement develops fairly well. And then, impulsively, she dumps Turturro without any preparation and, to make matters worse, Turturro tells Allen that he's going to just \"move away\". We're left wondering about these details without  satisfactory explanations or development."
    },
    {
      "rating": "4",
      "text": "I enjoyed Woody Allen's role in this film by John Turturro, which had elements of a WA movie (quirky characters, improbable plot lines) minus most of the wit and whimsy. The OK supporting performances could not get me past the fact that almost nothing in the movie seemed plausible. Not sure Turturro could pass as a gigolo in any scenario, but definitely not with the laconic performance he turns in here (minus a few touching moments -- he does have an expressive face)."
    },
    {
      "rating": "8",
      "text": "I really liked this film. At times it is a complete art piece. The framing, the travelings, the faces, the silences. Clearly there are unanswered questions, but this opens a role for the audience to play, which makes it even better. Thank you Mr. Turturro."
    },
    {
      "rating": "0",
      "text": "I found it to be boring and unfunny given the talent involved. There's a tirade against organized religion and morality in general.  \"Methinks thou dost protest too much.\"  a quick buck for the once talented over the hill gang."
    },
    {
      "rating": "6",
      "text": "Although not written nor directed by Woody Allen, it is esscentially a Woody Allen type film. Heavy on dialog, minimialistic scenes with a setting among jews and/or brooklyn. After seeing the trailer I liked the concept with the quick one liners throughout. the movie did have comic moments but essentially was something other than the trailer seemed to depict. Which was a pleasant surprise. However the film ran too long with comic moments too far and between. Romantism with Turturro is funny in itself but after only an hour seemed to far flung-even if Vergara appeared, the story became predictable and good for a one time watch."
    },
    {
      "rating": "6",
      "text": "More of a comedy/drama than the comedy genre that the IMDB website has promoted, \"Fading Gigolo\" enters Woody Allen territory, and his influence is evident when he delivers his lines playing a pimp. John Turturro writes, directs and stars in this movie which is not totally satisfying as the dramatic scenes border on the melodramatic. One yearns for more scenes with Woody Allen as he has the funniest lines and one wonders if he personally contributed to his own dialogue. Sharon Stone and Sofie Vergara are criminally underused. The scenes involving the characters of John Turturro and Vanessa Paradis are the least interesting as this is where the melodrama creeps in. The music score is smooth and mainly jazz influenced, accompanied by some easy listening foreign language songs. \"Fading Gigolo\" is the type of movie Woody Allen could make in his sleep, and when in form, this would be his masterpiece."
    },
    {
      "rating": "6",
      "text": "Its definately not bad, but there is not much about fading gigolo that really grabs you in. Its a gentle, witty little film that tries to take its self a little more seriously then it should."
    },
    {
      "rating": "4",
      "text": "Woody Allen has got to be the worst actor of all times. He stutters all along the movie and never holds the pose when being filmed from another angle. This is pathetic.\rSomewhat of a cute, albeit quite unbelievable story.\rLife is too short to waste it with mediocre movies and abominable actors."
    },
    {
      "rating": "7",
      "text": "Plötzlich Gigolo startet wie ein 70er-Schmuddelporno: Swingunterlegt und im körnigen 4:3-Format. Ein augenzwinkernder Einstieg – denn mit albernen Sexfilmchen hat John Turturros Regiedebüt überhaupt nichts am Hut. Turturro mimt den Blumenverkäufer Fioravante, den Kumpel Woody Allen aus Geldnot zur Sexfachkraft ummodelt. Als Virgil Howard und Dan Bongo ziehen die zwei im denkbar unpassendsten Umfeld – dem jüdischen Teil Brooklyns – ein Gigolo-Business auf. Das inszeniert Turturro angenehm gefühlvoll und klischeefrei, indem er statt Culture-Clash- und Sex-Klamauk lieber ernstere Themen wie Selbstfindung, Trauerbewältigung und sexuelle Befreiung in den Mittelpunkt stellt. Vanessa Paradis etwa überzeugt als verkrampfte Witwe, die lediglich durch die sanfte Berührung Fioraventes ins Leben zurückfindet. So spricht Plötzlich Gigolo – seinem unpassenden deutschen Titel zum Trotz – ein erwachsenes Publikum an – und nicht die Eis am Stiel-Fans darunter."
    }
  ]
}