{
  "id": 2318,
  "title": "Fallen",
  "starring": [
    "Denzel Washington",
    "John Goodman"
  ],
  "runtime": 124,
  "genre": [
    "Crime",
    "Drama",
    "Action",
    "Thriller",
    "Horror"
  ],
  "description": "Homicide detective John Hobbes witnesses the execution of serial killer Edgar Reese. Soon after the execution the killings start again, and they are very similar to Reese's style.",
  "releaseYear": "1998",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nEDvTB9cP2oIKY0M1ZdDvuUEJ8d.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 10.0,
    "ending": 5.0,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The Movie and the good actors are perfect i hope there is a continuation the books have a fantastic magic that surely the films have deserved total public"
    },
    {
      "rating": "10",
      "text": "I loved the movie he made me feel so good i hope he has a continuation they can not leave a work like this without another movie the books are perfect and the movie is wonderful"
    },
    {
      "rating": "10",
      "text": "the movie is incredible i hope from the bottom of my heart that you have a continuation the fans can not be without the next movies lauren kate please do torment"
    },
    {
      "rating": "10",
      "text": "I will start with the bad points, which offers us as a fan this movie, along with its director Scott Hicks and the writer of the book Lauren Kate, is something totally different from what we read, although the film is titled \"Fallen\" , it has nothing to do with the book title, but there is something good, Mr. Scott Hicks did something truly beautiful, transformed the movie into a work of art for us, it's weird, and as I said before, the movie does not follow the pattern of the book, but it is something that I, for me, does not matter, Scott Hicks, was able to catch every scene, every move and every burst of emotion; the photography, the music and the actors are perfectly chosen, selected and taken, I have loved and surpassed all my expectatibas, test surpassed, I hope \"Torment\""
    }
  ],
  "recommendations": [
    "harry_potter_and_the_prisoner_of_azkaban",
    "the_shawshank_redemption",
    "the_lovely_bones",
    "the_green_mile",
    "harry_potter_and_the_deathly_hallows_part_2",
    "the_lucky_one",
    "eternals",
    "eternal_sunshine_of_the_spotless_mind",
    "the_golden_compass",
    "the_great_gatsby",
    "charlie_and_the_chocolate_factory",
    "harry_potter_and_the_order_of_the_phoenix",
    "inkheart",
    "breakthrough",
    "alice_in_wonderland",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "harry_potter_and_the_chamber_of_secrets",
    "the_giver",
    "the_count_of_monte_cristo",
    "the_witches",
    "the_disaster_artist",
    "perfume_the_story_of_a_murderer",
    "harry_potter_and_the_goblet_of_fire",
    "chemical_hearts",
    "alita_battle_angel"
  ]
}