{
  "id": 4854,
  "title": "Falling Down",
  "starring": [
    "Michael Douglas",
    "Robert Duvall"
  ],
  "runtime": 113,
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "An ordinary man frustrated with the various flaws he sees in society begins to psychotically and violently lash out against them.",
  "releaseYear": "1993",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7ujqyF96Zg3rfrsh9M0cEF0Yzqj.jpg",
  "categories": {
    "plot": 7.407407407407407,
    "acting": 7.928571428571429,
    "ending": 7.4,
    "soundtrack": 5.0,
    "cinematography": 8.5,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 5.8
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Okay i'm actually giving this film an 8/10 as it is a really great movie but i'm putting 10/10 on here to compensate for the bewildering low user score. The film is both funny and a thrill ride that can all be consumed with ease for a brilliant watch."
    },
    {
      "rating": "8",
      "text": "The movie's symbolism and allegory throughout the entire time was too obvious and prominent. However, its still a unpredictable but effective classic that possibly is Joel Schumacher's best film he directed (and also the last one too)."
    },
    {
      "rating": "10",
      "text": "LMAO.Honesty Time.This movie is one the best, realest, and down to earth movies out there. Period.The only people giving this movie a bad review are ultra sensitive, racist,sheltered, foreigners, or uneducated silly white apologetic's who will pretend M.Douglas is the villian here. AMERICANS will relate to this depiction of daily city life, and will root for him, AND against him at times..you won't always agree with his choices, but you will FEEL and UNDERSTAND his choices. He's just a regular dude, trying to get home to his kid, fed up with the nonsense, being ripped off, lied to, robbed, gang assaults, nazi scumbags, bumper to bumper traffic, the filth, unfairness, etc..and as his downward spiral begins it takes a toll on him and the world around him..He has to deal with all the BS that you can encounter while walking through the city..just trying to get home. Sometimes, good people have just had enough.The movie is a MUST SEE and imo, unforgettable! M. Douglas did a excellent job in his role and a sequel is long overdue. A masterpiece of gritty realism of a normal day."
    },
    {
      "rating": "10",
      "text": "Phenomenal piece of film-making. The only ones who think this movie is over analyzed are the people who don't understand its depth. How about all of the reviews by white people starting off saying it's a scape-goating white angst revenge film. Supposing that a white man, unlike a black or hispanic man; would have nothing to be angry about in the first place. Typical BS. The only thing more amazing than this film is the fact that it was allowed to be made in hollywood. Those were the good 'ol days!"
    },
    {
      "rating": "9",
      "text": "One of the most underrated films, both by critics and audience. The critic that gave this film the best review, Mick LaSalle, said that \"a film too good and too original to win any Oscars but one bound to be remembered in years to come as a true and ironic statement about life in our time\" - which is exactly what happened."
    },
    {
      "rating": "7",
      "text": "In \"Falling Down,\" crew-cut Michael Douglas is a clockwork citizen, an average Joe with a bar code on the back of his neck. He's the ain't-gonna-take-itanymore taxpayer in all of us, harassed daily by the system he has bought into. As he fumes through yet another L.A. traffic jam, the frustration factor finally boils over.\r\"Where are you going?\" an appalled driver asks, as Douglas climbs out of his car. \"I'm going home,\" replies the fired military-defense firm employee, briefcase in hand.\r In director Joel Schumacher's dark comedy, Douglas's simple intention is to make it to his daughter's birthday party. But the route he takes is blocked by gun-toting nutcases, rip-off artists, bigots and the economically disenfranchised. Like Griffin Dunne in \"After Hours,\" he's about to undergo the paranoid epic of his life. Luckily, he's armed with middle-class rage.\r For starters, there's the Korean grocer who charges 85 cents for a soft drink and won't give him change for the phone. A baseball bat helps assuage Douglas's anger. When he's accosted by barrio boys, Douglas's briefcase comes in handy. After another confrontation with the same gang, Douglas emerges triumphant again, this time with their bag of monster weaponry in hand.\r Actually, Douglas's \"home\" turns out to be fictional, since ex-wife Barbara Hershey has a restraining order against him. But his mind is fixed. In Nietzschean fashion, his beeline there becomes, with each altercation, increasingly psychotic. Now the cops -- including soon-to-retire Robert Duvall -- are in pursuit. Douglas has a deadly run-in with neo-Nazi Frederic Forrest. And, upon reentering the wealthy zone, he decides that a country-club golf course is a waste of beautiful land.\r The movie's sense of direction isn't quite as straightforward. By midpoint, it faces a crisis of options. How serious an indictment of society should it be? Is it a thriller with funny elements, or a comedy that turns increasingly black? Does Douglas get \"saved\" at the end, or does he go to the nutso-limit?\r First-time screenwriter Ebbe Roe Smith seems to want a bit of everything -- to the movie's eventual detriment. After a while, Douglas's homeward-bound intentions become an abstract endgame, something to bring the movie to a narrative halt.\r Deskbound officer Duvall, who's dreading quiet days in Arizona with neurotic wife Tuesday Weld, uses Douglas's blitzkrieg for his own call to arms. The trouble is, he spends too much of the movie apart from Douglas, always a step or two behind. The chemistry that could have happened between the movie's two heavy-hitting performers isn't allowed to happen until the finale. There's a roughly similar relationship in \"Thelma & Louise\" between cop Harvey Keitel and fugitives Susan Sarandon and Geena Davis. Tracking the women across the country by phone, Keitel strikes up an increasingly affecting relationship with them. It seems the same thing is meant to happen in \"Falling Down.\" It doesn't.\r However, Douglas's intentionally robotic -- and intense -- performance holds its own. He's scary, normal and funny all at once, as he goes to town on that grocer's overpriced merchandise, or stands up to the street hoods with almost clock-whirring deliberation.\r \"That's a helluva way to treat a vet,\" says a homeless person after Douglas refuses to help him out.\r \"You're an animal doctor?\" asks Douglas with genuine surprise. In the middle of this one-dimensional, RoboCitizen rampage, Douglas's endearingly naive question is one of the movie's more beautifully played flickerings of humanity."
    },
    {
      "rating": "8",
      "text": "A great movie that is really effective on bad days where you can live through the Michael Douglas character's eyes."
    },
    {
      "rating": "9",
      "text": "A fantastic film about social alienation and takes everyday annoyances we all face to the extreme."
    },
    {
      "rating": "9",
      "text": "Great movie. If it was made today who knows what kind of reviews it would get."
    },
    {
      "rating": "10",
      "text": "Modern america.This movie just gets more and more true as time marches on."
    },
    {
      "rating": "6",
      "text": "I'm not entirely sure who we were supposed to root for--that may not even matter. What matters is the great sadness that become madness... so vividly portrayed by Michael Douglas."
    },
    {
      "rating": "9",
      "text": "The core story is so classic, everyone know what this movie is about, because it is so unique. Michael Douglas is perfect, his character also interesting."
    },
    {
      "rating": "6",
      "text": "While the movie has a very over the top premise and they played it a little more serious than they should've, it's still a very entertaining and fun movie. Supported by the outrageous premise, the great stand off at the end and the excellent performance by Michael Douglas, Falling Down is an early 90's classic."
    },
    {
      "rating": "8",
      "text": "Falling Down has that early 90's camera style but is good as it is. Falling Down is a story about a man who takes his anger on people."
    },
    {
      "rating": "7",
      "text": "A cult film in which we witness a man who cannot stand the system any longer goes crazy step by step. As you watch, there will be scenes where you put yourself in the place of the main character and give him the right. I think it inspired many productions. Definitely worth watching."
    },
    {
      "rating": "8",
      "text": "One of my favorites! Michael Douglas gives an amazing performance, as well as all the various characters DFENS runs into on his journey through the concrete jungles of LA."
    },
    {
      "rating": "10",
      "text": "I recommend watching this movie, this makes me go through a rollercoaster of emotions and preferably watch it alone since it is usually more quiet."
    },
    {
      "rating": "10",
      "text": "Hard to believe this only has a 7 on here, they must have wiped the rating imo. This is a classic."
    },
    {
      "rating": "10",
      "text": "Great movie that acts out all the things you've always wanted to do (well, almost all!)."
    },
    {
      "rating": "1",
      "text": "How this film got such a high metacritic score is beyond me. On a superficial level, it's a story of a white male who has seemingly been driven into violence by a corroding American society. Dig a little deeper and you discover the sub-plot of white angst; a theme that gives justification to the the protagonists misdeeds, using minorities (and their dissolving of American norms and values) as its scapegoat. The director obviously wishes for the viewer to sympathize with his maniacal main character. Unfortunately, unless you believe in Manifest Destiny and the White Man's burden (which I'm afraid a good numbers of Americans do), all you'll see is a shallow movie attempting to make something out of nothing."
    },
    {
      "rating": "9",
      "text": "Fallen ManI really love this movie, this film is one of my personal favorate top 50 movies, and the reason why is because in a way it's not just satirical on our current society but it's sort of a dark mirror on what dark thoughts we repress everyday, that occasionally creep up on the back of our minds whether we want to admit to it or not.  And we never act upon them because it would be deemed wrong even though it would feel so right.This is my favorite performance of one of my favorite actors Michael Douglas, the Bill Foster character is sort of like a mix of comic strip character Dilbert and Rambo.  This character I couldn't help but feel a sense of pathos for because his character as we see is angry and frustrated but he is emotionally broken, due to being down on his luck and separated from his family.  From one good camera shot where he sees the city though the hole of his shoe and then covers it with circled want ads, it really tells you a lot about his character and current psyche.  But he is also aware and ashamed at himself knowing he has some emotional problem, one scene he is watching a family video but then something happens where Bill get's a bit angry in the video, Bill then has a sad look on his face.But most of all I really like the actions this character takes which I think are awesome and blackly funny because there is a truth to them as well as the situations his in, which makes us emphasize with Bill's actions and feelings more.  In a way it's similar to the film \"After Hours\" because Bill is practically in one crazy predicament after another, makes you wonder if the world is crazier than Bill.  I don't want to reveal all of them you have to see them for yourself to enjoy them.  But one favorite moment despite kinda dark is the golf course scene where he encounters a butt face golfer that wants him off the course.  I hate people like that, that golfer is one of those people that stick their noses up and look down on people, practically think their own farts smell like roses.  I really don't understand the prejudice against people of a lower class then them,   but also for some weird reason I can't explain they act childish, that golfer kept saying this is my golf course though I bet it's not.  What the hell was the golfer's problem with Bill, what that Bill was going to dirty the grass or something, the prejudice against guys like Bill and us is just pathetic.  But of course Bill teaches the golfer a lesson and I really like that monologue Bill delivers.I really have no problems with the film even though my minor complaint I'll admit I don't really like how Bill's ex wife and mom drew him out.  It didn't really feel like they assumptions were for the same character but some other character from some other suspense thriller, it's kinda that same problem with comic book antihero \"Deadpool's\" origins.  I don't know it could just be me on this matter it's just I really like the Bill character and on his side, so sometimes what you don't say about a character is better.The everyday world can indeed be a insane place."
    },
    {
      "rating": "7",
      "text": "Man gets stuck in traffic jam, wants to go home, gets out of car & starts walking, has day from hell.One of Michael Douglas's best performances as the ordinary man turned bad, Bill Foster, in this very watchable Joel Schumacher film.Lots of memorable scenes & dialogue backed up with a great supporting cast including a very distrubing Frederic Forest as the army store owner."
    },
    {
      "rating": "7",
      "text": "A fairly solid, non-art film about themes that are fairly complex and layered. Foster is a character that is gray; while he is doing things throughout the movie that aren't rational we can't help but empathize to some extent of why he's making the choices that he is making. On the surface, most people today will pry view this as nothing more than enabling white privilege. It's only obvious to me that these individuals did not watch the full movie, nor did the really try to understand what it's about. The big twist at the end is, in fact, Foster realizing he's the bad guy in all this and feeling nothing but remorseful and ashamed for it. This film does not justify Foster, it just depicts it. Whether or not you think Foster is justified says more about you than it does this film. It's a black mirror to look into, but it's necessary and will continue to be relevant and necessary."
    },
    {
      "rating": "10",
      "text": "One of Michael Douglas’s best performances, in a strongly themed film that rings true for every decade in America since the 1990’s"
    },
    {
      "rating": "7",
      "text": "this movie is smart how the film makers did this they make something different and how it deals with some racism and other things, I know the script isnt the best and it wasnt good enough for it to be huge but I thought it was good from all of the messages it had in it also try understanding this character how he just goes off and how he thinks also the ending was emotional although the creators of the film did mess up on some of the plot it was still a decent movie in the 1990s unless if someone didnt understand it"
    },
    {
      "rating": "10",
      "text": "What is wrong with the critics? They must be the old guys on the golf course scene! This is a Classic movie! I have have watched it over and over and over and over again, this movie never gets old. A whole lot of dark laughs! The character does a lot of things a normal person only wishes they had the guts to do, after putting up with all the crap you face in life.It`s so good I got the DVD today."
    },
    {
      "rating": "10",
      "text": "I’m surprised that this movie has a score of 6.6, I really enjoyed this movie for its great and funny scenes and the slow decent of madness in the main character, also the ending was quite shocking"
    },
    {
      "rating": "7",
      "text": "OK, this is true: the film is not a artsy, photogenic masterpiece where nuance meets a boisterous voice. Rather, it is a fantasy we all wish we could live to some degree. Having a bad day and raging over all objects like they were toy Lego sets."
    },
    {
      "rating": "4",
      "text": "I really do not know what to say. Falling Down is a good look at a man who spirals out of control after losing his job. Michael Douglas and Robert Duvall turn in prototypical good performances in this thriller from director Joel Schumacher. However, like many of Schumacher's films, something just feels \"off\". There is an element out of place here, which causes the film to simply feel far too distant. The at making the film relatable fails when every social critique it offers is ham fisted and shoved down your throat repeatedly with Schumacher seemingly screaming at you, \"DO YOU GET IT YET? WE ARE F****D!\" It simply gets aggravating. The character also loses relatability when he starts shooting people and loses his mind. No one can relate to a psychopath unless you too are a psychopath. This is all a bummer because, otherwise, the film is well crafted and can be truly intense and thrilling at times. Yet, the film is too focused on force feeding us its agenda than being a good film."
    },
    {
      "rating": "6",
      "text": "Falling Down is an interesting and holding experience through convincing angry played by Michael Douglas, but the focus in boring subplots and random moments blows it."
    },
    {
      "rating": "6",
      "text": "Le film vaut surtout le coup pour le magnifique pétage de plombs de Michael Douglas qui délivre une prestation à la fois subtile et d'une grande intensité, assez éloignée paradoxalement du film lui-même à dire vrai, lequel se laisse aller à une caricature échevelée de la part de Joel Schumacher : le \"parcours\" de \"D-Fens\" est en effet si peu crédible que son réalisme s'en trouve totalement anéanti.Cela étant, cette caricature est bien sûr l'occasion d'un certain nombre de scènes très drôles au cours desquelles notre révolté à cravate s'insurge, flingue à la main, contre la société déliquescente, son hypocrisie et ses travers, tel un justicier de pacotille, un brin paranoïaque...Si le personnage est bien construit et reste cohérent dans ses vicissitudes et sa névrose galopante, son contrepoint incarné par le très bon Robert Duvall est également caricatural à souhait, ainsi que la mégère qui le persécute, sans compter la bande de flics tellement débiles, tellement beaufs qu'ils ont tous été recalés à Police Academy.Il reste tout de même la mise en scène des plus soignées, une bonne musique et comme dit plus haut, un Michael en pleine forme. Il s'agit d'un film qui se veut social ou psycho-social à tendance dénonciatrice (regardez-moi, je dénonce...) mais qui échoue à nous émouvoir ou nous questionner ; il parvient néanmoins à nous faire rire sardoniquement malgré ses maladresses, ce qui n'est déjà pas si mal."
    },
    {
      "rating": "1",
      "text": "one of the most offensive and unintentionally hilarious films ever made, this reactionary fantasy is equal parts absurd and deranged."
    },
    {
      "rating": "6",
      "text": "Surprisingly astute social commentary randomly mixed into an action thriller film. The cast is superb with Douglas stealing the movie with his excellent character acting. There isn't much in the way of a plotline just the loose concept of an above average working man unhinged by his urban lifestyle decides to rampage. Sadly the pacing is awful and the leaps of logic for some of the characters decisions are pretty extreme. Despite its flaws something about it just worked for me. Imperfect but highly watchable."
    },
    {
      "rating": "10",
      "text": "It is a case study. It is a fast case study. People can go from sane to insane in a split second. Decisions are taken in a split second. This is like that. It was a gamble from Hollywood and I think it paid off pretty well."
    }
  ],
  "recommendations": [
    "savages",
    "promising_young_woman",
    "no_country_for_old_men",
    "no_escape",
    "taken",
    "cold_pursuit",
    "crash",
    "sas_red_notice",
    "donnie_brasco",
    "the_marksman",
    "colossal",
    "public_enemies",
    "live_by_night",
    "the_rite",
    "law_abiding_citizen",
    "the_machinist",
    "boyz_n_the_hood",
    "the_accountant",
    "downsizing",
    "jane_got_a_gun",
    "the_hunt",
    "up_in_the_air",
    "hereafter",
    "eden_lake",
    "the_intern"
  ]
}