{
  "id": 651,
  "title": "Fantastic Beasts and Where to Find Them",
  "starring": [
    "Eddie Redmayne",
    "Katherine Waterston"
  ],
  "runtime": 132,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "In 1926, Newt Scamander arrives at the Magical Congress of the United States of America with a magically expanded briefcase, which houses a number of dangerous creatures and their habitats. When the creatures escape from the briefcase, it sends the American wizarding authorities after Newt, and threatens to strain even further the state of magical and non-magical relations.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/h6NYfVUyM6CDURtZSnBpz647Ldd.jpg",
  "categories": {
    "plot": 7.151515151515151,
    "acting": 7.377777777777778,
    "ending": 6.818181818181818,
    "soundtrack": 8.666666666666666,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 8.666666666666666,
    "action": 7.666666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "What’s it about?Eccentric magizoologist Newt Scamander (Eddie Redmayne) misplaces an enchanted suitcase in 1920s New York. An extremely profitable franchise is unleashed.What did I think?Hey, you guys like Harry Potter? Then I’ve got good news: Fantastic Beasts is the worthy spin-off that you’re going to be really into for the next ten years or so. While it’s darker than the original films, it’s packed with subtle little nods to them that fans will adore, and the story (though somewhat complicated) is good enough to stand alone. It’s tremendous fun to see the wizarding world through a 1920s lens – magical speakeasy, anyone? – and the inhabitants of Scamander’s Pokeball-meets-TARDIS suitcase are just as fantastic as advertised. This film will frighten young children, but everyone else will be thoroughly enchanted."
    },
    {
      "rating": "8",
      "text": "You can fell the magic again. The Movie just is enjoyment pure. As an big Harry Potter Fan this movie just works. The Story may not be Special but seeing the American side of the Wizarding World is Fresh and interesting and the Main cast also works for the most part. I personally find Newt an good Main Protagonist but i kind of missed that he gets no real development so the thing he says at the end is ironic. The Main Villain was fantastically played. I was invested in the World and the Beasts. The CGI was really good for the most Part, only the last showdown was a little to much in may opinion. I got to admit that this Movie is one of my favorite Harry Potter movies even it has probably not the same quality as some of the older ones."
    },
    {
      "rating": "9",
      "text": "First of all, a majority of the casting for the characters was fantastic. Each actor or actress fit their respected role perfectly. This can be seen with Eddie Redmayne. He just played Newt in such a way that he was relatable. He was such a charismatic character that everybody loves. Also, Dan Fogler was hilarious as Jacob Kowalski. He had pretty much all of the funny lines in this film. He also was the audience character which was nice to have in a film like this. The score by James Newton Howard was incredible to hear. The costumes in this film, which are Oscar-winning, are fabulous. They look like they were taken out of a history book for what people might have worn in the 1920’s. The last good thing I want to mention is the visual effects and set designs. Their production design was Oscar-nominated and you can see why. You can see how much detail went into each set that they wanted to show in this film. Same thing with the special effects. All the beasts and creatures in this film looked remarkable. Now some things that they could of fixed was the pacing in the film. The pacing was all over the place. It almost felt like they didn’t know how to end some scenes or they thought the scene was too long and cut it too early. This also could be a cause of some poor editing. There were some awkward transitions in this film that didn’t make sense. The last thing I want to mention is the plot holes. I feel like the writers had to ignore them or else there wouldn’t have been a film. In the end, Fantastic Beasts is a stunning film that just has a few issues but I still recommend to watch."
    },
    {
      "rating": "6",
      "text": "There are glitters of inventiveness and potential throughout, although it doesn't quite mesh very well in this appealing yet inconsistent start of a franchise."
    },
    {
      "rating": "6",
      "text": "You know what was good about “Harry Potter”? It had “Harry Potter” in the title and it was about Harry Potter. In “Fantastic Beasts and where to find them” there are those “beasts”, but the problem is that the movie is not about them and has a single word about where to find them.The film begins with a battle of a group of mages and a mysterious dark sorcerer and a bunch of newspapers headlines about someone called Grindelwald. Who is it? That’s a good question. If you want to know than go watch sequel, because he is not in this one. The twist of Grindewald’s exposure is very weak, it simply leads to nothing. Throw it out of the movie and nothing will change. Oh, wait, if you do that than it wouldn’t be so interesting to see the sequel. It’s really sad when the first movie of a cycle tries to sell you the sequel.What is a real pity is the fact that the beasts are absolutely gorgeous, but there’s too little screen time with them. The story just begins when some of them flee, later they become a secondary storyline, giving the first place to Creedence. He is a very powerful wizard, who turns into an obscurus, a dangerous magical creature, by suppressing his magical powers. And someone might say: “But here is your magical beast and a story about it!”, but it is a very cheap move. The viewer clearly understands that the story of the beasts ends with the capturing of the last escaped creature, long before the end of the movie. Who is this Creedence guy? Why should I care for him? The whole movie feels like the creators just stuffed too much and didn’t bother to make some part really good.But no everything is bad here. Eddy Redmayne (Newt) and Ezra Miller (Creedence) are superb in portraying their characters. You could watch this movie for their performances alone. It’s difficult to say something good about other aspects of this film. The editing feels raggy and awkward, the stories are skin-deep, and the sequel baiting is frustrating. The movie had potential but it lacks of polishness almost in every aspect."
    },
    {
      "rating": "8",
      "text": "Set in the magical world of witchcraft, Fantastic Beasts is really worthy of the hype and the stir it's been causing for a almost a year now. The film itself is emotionally charged and action-packed, just like we've come to know everything Rowling has ever touched. With a great script from JK, great direction from David Yates, outstanding performances from the whole cast (Eddie Redmayne especially), and breath-taking visual effects, it's safe to say that this is the first journey of what looks like a franchise that will be up to the level of the pinnacle that is Harry Potter."
    },
    {
      "rating": "7",
      "text": "With incredible special effects and exceptional performances, Fantastic Beasts figures out how to stand up all on its own, even if it feels like somewhat of a set-up for future installments."
    },
    {
      "rating": "9",
      "text": "A worthy successor of Harry Potter movies, well thought out story and good casting make it works. Finally we get some insight to the wizard's world, and we like it. I think CGI is exaggerate, however it's well made and enjoyable."
    },
    {
      "rating": "7",
      "text": "This spin-off of the Harry Potter franchise isn't what everyone was expecting to see, but just for the benefit of it, Fantastic Beasts and Where to Find Them builds a feeling connected to the original Harry Potter books and/or movies and the spirit lives on."
    },
    {
      "rating": "7",
      "text": "Fantastic Beasts is a fun adventure set in the magical word that we have ALL come to love! However this spin off fails to capture the raw amazement the originals did. Mediocre performances, hit & miss dialogue really flat line the movies overall quality. Unfortunately  this magical world may have already surpassed its hay days."
    },
    {
      "rating": "9",
      "text": "Well, this franchise certainly has my attention now or, let's say, once more. Fantastic Beasts is magic and the only flaw that gets to me might be a personal taste problem: The casting of Johnny Depp as Gellert Grindelwald, when actually the whole movie made me more and more interested not only in Colin Farrell's character but also his performance."
    },
    {
      "rating": "1",
      "text": "This movie is an insult to the original Harry Potter movies. Is this how old Star Wars fans felt when they saw The Phantom Menace?The first part of the movie is terrible, it's slow and uneventful. It was still an ok movie by that point. In the second half, however, ok turned to utter **** How can JK Rowling go from writing a plot twist spanning 7 books and 8 movies to writing this turd? She violated the rules of her own world by approving this. Graves' wand connecting randomly? No, the cores of the wands have to be the same. That was reserved for the climax of three of the old movies, and they just throw it around here? No. And Obliviate rain? Give me a **** break. The people in the theater were laughing, I was crying inside.The movie's score, which in some bad movies is good, is completely terrible. James Newton Howard, you are not a bad composer, how could you do this? He attempts to emulate the previousl movies' score from start to finish, and he fails terribly. You're no John Williams, son. Be original.I'm not even going to mention the cringe-worthy CGI...Johnny Depp was the only positive aspect of this movie. I am giving this one star because of him.Rowling, you should be ashamed of yourself."
    },
    {
      "rating": "6",
      "text": "I had mixed feelings about this movie, I did like the characters, parts of the story, and the special effects. Over all however, I found the movie to be dull and boring. It lost most of the dark elements that I liked in Harry Potter, but we shouldn't be comparing this with the main series, since the movie feels like a standalone. It was shallow, digging only slightly in topics and themes. This ensured that the movie was entertaining to watch.. or was it? I personally found myself blanking out at moments during the movie and tried to look for a deeper meaning within the movie. I couldn't much apart from clichés and an overall average movie. The abuse was used to make the movie seem more mature, yet I was thinking about why I was watching a movie aimed at children."
    },
    {
      "rating": "6",
      "text": "Whilst a charming tale, Fantastic Beasts and Where to Find Them is a noticeable descent from the magic of the Harry Potter series. The main characters are not likeable and the film lacks a proper villain. Due to a somewhat disengaging plot, the final act is not the epic conclusion it tries to be. Despite this, it is a fun little movie and the array of beasts themselves are amusing."
    },
    {
      "rating": "7",
      "text": "It's a weird blend of childish silliness and gritty seriousness but it just about fits. A charming world with an array of equally charming (and uncomplicated) characters."
    },
    {
      "rating": "6",
      "text": "Set in the magical world of witchcraft, Fantastic Beasts is really worthy of the hype and the stir it's been causing for a almost a year now. The film itself is emotionally charged and action-packed, just like we've come to know everything Rowling has ever touched. With a great script from JK, great direction from David Yates, outstanding performances from the whole cast (Eddie Redmayne especially), and breath-taking visual effects, it's safe to say that this is the first journey of what looks like a franchise that will be up to the level of the pinnacle that is Harry Potter \"testuser-4\""
    },
    {
      "rating": "8",
      "text": "I think if more people could set nostalgia aside they'd realize this is a much better film than the entire HP series. Moving to 1920's America setting and removing the angsty teenagers who have to save the world because the negligent adults are too incompetent are both absolute improvements.Newt himself is an extremely underrated character, and brilliantly portrayed by Eddie Redmayne. See Pop Culture Detective's \"The Fantastic Masculinity of Newt Scamander\" on Youtube for a better examination, but I'll sum it up here: He's not macho or \"The Chosen One\" or a witty schmoozer. But he doesn't fall into the typical nerd/genius/outsider stereotypes either. He's quiet, introverted, humble and sensitive, but also confident in his abilities and sympathetic towards his beasts as well as humans.The only major downside to the movie was that it couldn't decide which movie it wanted to be: a lighthearted romp about chasing down escaped magical beasts, or a dark conflict between wizards, anti-wizard muggles, and dark wizards. I personally preferred the latter, but it would not make a lot of sense to have Newt in a movie purely about that (and of course the former also brings child appeal and toy sales to the table)."
    },
    {
      "rating": "10",
      "text": "I really like this movie! BEST MOVIE IN 2016! Great acting. The beasts are fantastic. There’s nothing inherently wrong with that. But the picture — directed by David Yates, who also gave us the last four Harry Potter films, terrific ones — feels both sprawling and crowded, as if it were trying to pack too much mythology into one cramped crawlspace. Fantastic Beasts is a prequel, set years before Harry Potter was even a zigzag-lightning-scar-shaped gleam in his parents’ eye: it’s 1920s New York, and Newt Scamander (Eddie Redmayne), a “magizoologist” with insider knowledge of all sorts of magical creatures, is just arriving from London. Stateside, it’s a troubled and troubling time: the underground wizarding community is under threat, because a whirling black whatchamacallit has been forging a path of destruction through the New York City streets. To protect their ranks, the wizards must take great care to hide their powers from the No-Majs (the American term for Muggles). It doesn’t help that a fanatical group, led by Samantha Morton’s demonically prim Mary Lou Barebone, is out to break the wizards’ ranks apart. Also, dark wizard Gellert Grindelwald has gone missing—in case you happen to find that Fantastic Beasts doesn’t have enough plot points for you to digest.Into this mess steps Scamander, hoping to research some new magical beasts and protect some that have become endangered. He happens to carry a number of such creatures in his mystically bottomless suitcase (more on that later), though their misbehavior ends up landing him, and the new friends he makes, in a great deal of trouble. Those misadventures involve an earnest, friendly No-Maj and aspiring baker, Jacob Kowalski (Dan Fogler); Tina Goldstein (Katharine Waterston), a “Statute of Secrecy” enforcer who misperceives what Scamander is up to and tries to turn him in to the wizarding officials; and Tina’s sister, Queenie (Alison Sudol), a charming flapper-girl who can read minds as efficiently as a voracious grade-school reader tearing her way through all seven Harry Potter books.There’s so much going on in Fantastic Beasts that after the first act, you almost can’t be bothered to care what happens next. In the movie’s world, there’s a magical explanation for everything, which means story logic too often gets left by the wayside. (In the Harry Potter books, Rowling did a remarkable job of making magical logic seem consistent and believable, and the movie adaptations followed suit; that clarity has been lost here.) And even though the movie preaches tolerance, its ideas never quite jell. Still, Yates and Rowling are intent on working their charm on us, and some of it sticks: If Redmayne’s performance is just too adorably mannered, Fogler and Sudol twirl through their roles like dance-floor champs — both have low-key, breezy allure."
    },
    {
      "rating": "10",
      "text": "This film is the perfect expansion of the Harry Potter universe. Thanks to J.K. Rowling as the screenwriter and producer, and David Yates as the director, we can enjoy a very dark, mature and humorous film. Eddie Redmayne appears to be a flawless actor that can play any role. The soundtrack was very emotional and nostalgic: in fact we can notice an inspiration from the famous Hedwig's Them from Harry Potter. Moreover, the cinematography is fantastic and very detailed."
    },
    {
      "rating": "7",
      "text": "This movie is okay, a lot of expectations from the movie but I was not as satisfied. The plot is ok. Some CGI is good, some is pathetic, particularly at the end, the farewell of Newt and the thunder bird, the CGI is so bad.A lot of stuff was not quite make sense, I feel like there was a bit of rush about the orphanage, and constant cut scenes from Newt and Tina then to orphanage does not quite connect. At the end, I kinda of feel like Grindelwald might show up base on those newspaper headlines earlier. But Johnny Depp, wtf, I was expecting someone from Bulgaria or Russia.The aims and objective for Grindelwald is not well explained, and c'mon man, the greatest dark wizard at that time, got defeated in no time.But I have to declare I have not read the book yet."
    },
    {
      "rating": "9",
      "text": "Everything is great from the story to the CGI effects. The twist, the acting,... are great too. Its a nice Spin-off from the Harry Potter's franchise but the film is kinda not as good as i expected ,there are some plot holes and the ending is not perfect at all, The antagonist isnt bad at all he has a great ideology but the way he did it, which is wrong in many levels, the other one is seemed to be very powerful but in the end the MACUSA easily kill him within 30s - I mean what the f*ck , i thought there would be a lot of magical fight scences . That are the down-side of the film. In the end this film is very good and enoyable . Im looking forward to the sequel in 2018."
    },
    {
      "rating": "7",
      "text": "Don't get me wrong. I'm a huge Harry Potter fan. I grew up with it. I was so happy when i found out that J.K.Rowling is planning to get us back to the wizarding world! Yeah but... no. The characters are interesting, but not complete. Without spoiling - you may not understand or care about the main \"villian\" in the movie, because the movie doesn't really tell much about him. The thing you probably liked the most in Harry Potter - the mystery, is really lacking in this movie! It's replaced by more action and comedy! The story was not that bad, don't get me wrong! But i really think that we needed more characters with more stories about them, so we could care about the plot. Because that's what the wizarding world was all about! The only character that gets that attention (without spoiling) is not even a wizard. I'm sorry for my bad english. Overall - i recommend this movie to pretty much everyone. I really liked it and i'm looking forward to the sequel!"
    },
    {
      "rating": "10",
      "text": "We're no longer seeing 500 page books pared down to 2 hour compromises. Rowling is working within the medium and allowed to flourish. For the first time, I'm seeing her work portrayed on film and not knowing exactly what to expect.I'm old and jaded, but this film delivered a true sense of wonder to me. Rowling's magic is just like what she put in her books. It's funny and intriguing. It's odd. It starts from an unlikely place but manages to get all the way to deep issues of society and self."
    },
    {
      "rating": "8",
      "text": "We travel once again into the magical world of Harry Potter, several decades before the rise of You-Know-Who and the birth of The Boy Who Lived, by following the misadventures of Newt Scamander in America and discovering his Fantastic Beasts. In this misadventure we get a treat of a film that is a decent follow up to the masterpiece of its predecessor but stumbles a little on the execution.The biggest fault of the film is the story, or at least specific parts of it. The film is a little too obvious with its foreshadowing and setup, which distracts from the rest of the film. The entire subplot with the \"exposure of the magical world\" and the involvement of the \"Magical Congress of the United States of America\" (or \"MACUSA\") is interesting, but ultimately unnecessary for the movie until the sequels come out. When the film focuses on the Fantastic Beasts and Newt Scamander themselves, it shines, only to be rusted by the political overtones and the unneeded dark magic involved.The characters are all fun and very distinct. They all have very unique looks and actions to them that makes them memorable and likable.  The distinctions come to a disadvantage, however. The roles of each character is so obviously cliche that, if it weren't for the decent acting chops of all involved and the additional character tidbits added in, it would be rather painful. Newt is obviously the hero, Kowalski is obviously the comic relief, Tina is obviously the heroic girl and so on. The effects are a little questionable. It's easy to make out a lot of the CGI, and the filmmakers would have done well to use more practical effects. Especially for creatures that were on screen for a long time. For a movie that's based around them, that's a pretty big flaw.The movie is good, but it could have been much better. If they cut out the subplots and add in more practical effects, we could have had the Magical World equivalent of Jurassic Park. Instead we get an enjoyable movie that is bogged down by stories that are obviously meant to set up future sequels."
    },
    {
      "rating": "9",
      "text": "Scamander's Lumos Maxima Is Sufficient For Another J.K. Rowling's HeptalogyIt was predicted by the selfsame Rowling: \"If I have a sufficiently powerful idea, I will come back\", it is. The return to the wizarding universe most acclaimed of all time was as logical and pressing as the return to Katniss Everdeen's Panem or a galaxy far, far away in \"Star Wars\". \"Fantastic Beasts\" fulfills all its aims with faultless expertise: conceiving the spinoff wished by all fanatics drawing on Harry Potter's rich mythology to forged a style of its own which stands out with power of franchise, introducing to the most apathetic or uninterested people of  Rowling's writings and laying a consistent foundations for extensive franchise which has in front of its wand.Seductive prequel begins in in the midst of the 1920s, in New York precisely, a period of economic prosperity. Magizoologist Newton \"Newt\" Artemis Fido Scamander (Eddie Redmayne) born in 1897, who was expelled from Hogwarts due to an incident with one of his beloved offsprings, does expeditions across five continents to register, protect—from the most dangerous specimens in the planet, \"humans—\" and categorize magical creatures in order to write a meticulous textbook of preservation about them, entitled \"Fantastic Beats and Where to Find Them\" (with a foreword written by Albus Dumbledore: \"Never tickle a sleeping dragon\"). These trips take him to 'The Big Apple', where meets the baker Jacob Kowalski (Dan Floger), who accidentally takes Scamander's fabulous carrying case. That mistake ends with the catastrophic opening of the suitcase, which four celestial animals escape (\"Night at the Museum\" style). While Kowalski, Scamander, Goldstein (Katherine Waterston) — a police belonging to the 'MACUSA' — and her charismatic sister Queenie (Alison Sudol) are in the exhaustive animal search and capture, in Europe, malicious and powerful dark wizard Gellert Grindelwald (Johnny Depp) causes great vicissitudes, which will be connected ominously with animal chase in North America.The charm, excitement and fantasy projected before us were theoretically 'as if by magic', nonetheless, such magic is performed by explicit magicians. The first of them is who has been behind the art of wizards all this time, J. K. Rowling, who now holds the start of this new story with her own hands, since in addition to assembling almost naturally the new piece within Harry Potter's vast universe, wrote the screenplay of all the characters involved. British (screen)writer makes a well-built beginning as such; it's for that reason that first installment is crammed with information, narrative threads as: The Magical Congress of the United States of America (which is strictly dissimilar to the British), varied range of suggestive characters, meaningful range of facts, ambitious catalog of creatures and the presentation of who perhaps will be the king-villain of the saga (akin to 'Thanos' in \"MCU\").Second miracle worker is director-producer David Yates, who was in the middle of Gabonese jungle with \"The Legend of Tarzan\" in July and concluded masterfully the story of Harry, Ron and Hermione with \"Harry Potter and the Deathly Hallows: Part 1 & Part 2\" in 2010 and 2011 respectively; he enigmatically returns to inaugurate a new and long chapter, which probably also will direct. His tremendous experience is imposed on the fluidity of the story, the refreshing and vital blocking and assiduous harmony of every complex aspect on the screen. It is open to view that Yates and Rowling are understood well and for the sake of their all 'muggles', that honest connection must endure.Our third magicians are the art, production and boundless special effects team, they demonstrated some of their aces under the sleeve, the others are kept for future films. Simply by the imaginative, surprising and sophisticated recreation of the 1920s, radiant —and sometimes terrifying— creatures, thundering lightning flashes of wands, flying food and objects in the movie, parallel worlds of the suitcase of Newt and more are a compelling Academy Awards nomination. Maybe there is a little excessive use of CGI, but if the current blockbusters abusing technology for purposes like these, they have the clear path.Lastly, but no less important, the true wizards of the story. Oscar-winning Eddie Redmayne wears the coat that made Radcliffe shine in his time. The new hero for a new era of magic has an inherent connection with his stooped over way of walking, his shy personality and bangs manage to create an overwhelming and interesting atmosphere. His team is equally effective, however, Dan Floger (\"No-maj\") is who amuses us and provides part of the comicality in the film, and in addition, gives us glimpses of silent film. On the dark side of witchcraft and wizardry, Colin Farrell, Ezra Miller and the short cameo by Johnny Depp become the subplot into something scary, creepy and not too suitable for kids— substantially, pointing out in the excellent performances and background music by James Newton Howard.\"Fantastic Beasts\" fortuitously becomes us absent-minded of the original series, with a spin-off packed with magic, joy, new opportunities and surprises to come. The faithful muggles—or No-maj— of Rowling have a lot to be happy with the return to the essence of Harry Potter with a golden and striking wrapping which promises fabulous visuals, stories, and possibilities. Open that suitcase, we are on the right way."
    },
    {
      "rating": "7",
      "text": "'Fantastic Beasts and Where to Find Them' is the first screenwriting credit for \"Harry Potter\" author, J.K. Rowling, who plans on taking this beloved franchise and expanding it, since that is the current trend of Hollywood blockbusters, these days. Eddie Redmayne stars as Newt Scamander, a wizard employee at the Ministry of Magic who travels to New York. It's 1926, and Newt appears to be carrying around a case that seems to hold a living creature inside. He tries everything he can to retrieve the creature when it's escaped and starts to cause trouble, on the way, he runs into a man named Jacob Kowalski (Dan Fogler) that takes one of Newt's mysterious eggs when he leaves it behind. Meanwhile, a woman named Tina Goldstein (Katherine Waterston), another wizard is concerned that Newt may have let Jacob, who is a \"No-Maj\" - which is an American term for \"Muggle\", meaning non-magic humans - know too much about the wizard world, and his memory must be \"Obliviated\". But Jacob gets away with the egg, and Newt and Tina must get it back before more chaos ensues. Meanwhile, we meet a high-ranking Auror and Director of the Magical Security named Percival Graves (Colin Farrell) who appears to get close to a young boy named Credence Barebone (Ezra Miller) whose family seems to be holding some dark, magical secrets that Graves needs to know more about. Graves also discovers that there are some dark magic that invades the whole of New York, and it's up to Newt, Tina and Jacob to try and stop it. Seeing the few unlikely heroes reluctantly go on their unexpected journey together is fun and riveting, and the cast do an excellent job to get you invested in what might happen in future sequels... it appears that there will be four more movies to come out of this. The worst thing I can say about \"Fantastic Beasts\" is that, it's not \"Harry Potter\"... there is no young boy discovering the gifts of magic, there is little awe and it's not quite as whimsical. But, director David Yates - who directed the last four \"Harry Potter\" installments - keeps things balanced. The pacing of the story is a little uneven, as there are some amazing scenes where we discover a world of magical beasts, and there are some slow, scary and chilling moments about the dark magic. 'Fantastic Beasts and Where to Find Them' isn't necessarily exciting, but it has made me curious for where the characters might go in future sequels. Whether or not this will match or even surpass the quality of the \"Harry Potter\" franchise, we will never know. But, if you watch it as a franchise on its own terms, it's still good! I liked the characters, I liked the creatures, I liked the new story... this is a franchise that should get more attention."
    },
    {
      "rating": "6",
      "text": "This movie was all over the place. Sometimes it was dark and compelling (Samantha Morton, Colin Farrell, Ezra Miller). Sometimes it was fun, energetic, and charming (Dan Fogler, Alison Sudol). And sometimes it was bland and forgettable (Eddie Redmayne, Katherine Waterston).I liked parts of it a lot. Even parts with wildly different tones and plots worked for me (even if they didn't necessarily work well together). In the end, however, it felt like a lot of potential and a lot of wasted opportunities. I think there could have been two really good films here, instead of one that was simply okay.I liked more than I disliked and there's definitely a lot of material left here to build a film franchise on (as they're planning to do). Unfortunately a horrible casting decision sucked out a good deal of my enthusiasm. That character reveal evoked laughter from the audience at my theater and *not* in a good way. It's the worst misstep in a movie that wasn't exactly perfect to begin.It was an entertaining movie and it was not a bad movie. I'd recommend it to fans of the Harry Potter universe for sure. I was mostly left wishing it had been better but I didn't regret having seen it."
    },
    {
      "rating": "10",
      "text": "This movie had a great plot and extremely interesting character list. Eddie Redmayne did a fantastic job of Newt and portrayed the inner character. CGI wasn't as good as I thought it would be, which was one of the let downs. But the niffler was an extremely adorable addition to the movie. I thought this movie was incredible and fun to watch. Good job Yates and Rowling!"
    },
    {
      "rating": "10",
      "text": "Gran comienzo de la saga. Mostrandose en su primera parte la similitud con los primeros libros como la aventura, descubrir nuevos bestias. Ya en su recta final se notan las similitudes con las ultimas peliculas de David Yates(mas enfrentamientos, drama).Y dejando un final que da ganas de ver mas."
    },
    {
      "rating": "3",
      "text": "*in jk rowlings office* \"I'm running out of money from writing all those harry potter books\" Jk said, \"I need to write a new book and get people to like me again\" In walks one of her editors, \"Ma'am you already released a book that you didn't write but you did take credit for\" \"shoot i gotta do something different then how about a movie that is about a textbook from harry potter featuring characters not in harry potter and the only thing similar to harry potter are some key words.\" \"ma'am thats brilliant i'll get the best writers on it.\"This is what i imagine the creation of this movie was like. This cashgrab was a poorly produced/directed/written piece of garbage that i'm surprised anyone liked. Are you a fan of harry potter? well this movie says dumbledore and hogwarts so come buy a ticket? Did you only see the movies and haven't kept up with anything J.K has made canon? Good luck keeping up with this movie. I feel like i should've had to buy two tickets to see this as it feels like two completely different plot lines put together into one convuluted mess. I do not recommend you see this movie for any reason."
    },
    {
      "rating": "9",
      "text": "I really enjoyed this movie.  It's basically like a Harry Potter.  Lots of new characters and not everything was predictable either.  There will be sequel!"
    },
    {
      "rating": "10",
      "text": "amazing film with well made settings and enchanting moments. JK is such a talented writer with a script that keeps you at the edge until the very last moment. Yates' directing is really good"
    },
    {
      "rating": "0",
      "text": "This movie struck me as being a somewhat cynical cash grab. Harry Potter is over, it's finished, well done all involved. This just seems like a third rate fantasy series desperately hanging on Potters coat tails. We are getting five of these movies? Really, is that what the public wants?"
    },
    {
      "rating": "8",
      "text": "In 1926 a former Hogwarts student, Newt Scamander travels to New York with a case full of magical creatures only to find himself pulled into the strange world of magic in the United States, which is very different than Britain. The Magical Congress of the United States of America (MACUSA) is embroiled in a situation that threatens the safety of the wizarding community as well as the No-Majs (Muggles). It also jeopardizes the International Statute of Secrecy, risking the exposure of the wizarding world in America. Newt and his beasts may be just the thing needed to help bring to light the true forces at work.Us vs ThemThe Magical community has been hidden from the rest of the world since 1692 when the  International Confederation of Wizards enacted the International Statute of Secrecy to protect itself from Muggles or No-Majs. In America it has created an even stricter divide between the two worlds as witches and wizards are forbidden to marry non-magic folk. It's created a sense of superiority in the magical community which Tina clearly show when she says to Newt, \"Why would I want to marry him?\", pointing at Jacob, a No-Maj that has unwittingly become entangled in the wizarding world. The No-Maj world is no better. Mary Lou Barebone who runs an orphanage and the New Salem Philanthropic Society, works to indoctrinate the children she \"cares\" for and the people of New York of the dangers go witches and wizards in their midst. There is a real sense of tension that is palpable as each side cloisters in it's group, spreading fear of the other.The movie, in subtle ways, slowly undermines this idea of Us vs Them through the character of Jacob. In America, a No-Maj is immediately obliviated (a memory charm) so that they do not remember what they have seen, yet circumstances in the film make that impossible. Jacob and Newt form a friendship, learn from one another as they share their worlds. Jacob also has a major impact on Tina and Queenie Goldstein who, for the first time in their lives, get to spend significant time with someone from the \"other side\". It's beautiful to see the fear of the unknown vanish as communication leads to the awareness that they're not that different. In the real world where this happens every day, the message is clear, true knowledge of the \"other\" side only comes though interaction, communication and an open mind.The MovieThis is the first of five movies in the Fantastic Beasts series, written specifically for the screen by J.K. Rowling. There is a really strength to this since there are no books to compare it to leaving the audience free to enjoy the film for it's own sake. The movie does a good job of laying the foundations for the world of wizardry in this time period as well as what's to come in the series. The cast is outstanding, with the relationship between Alison Sudol as Queenie Goldstein and Dan Fogler as Jacob Kowalski being a true highlight. James Newton Howard's score is good, even if it never reached the heights of Williams and the production value, character design and world building is, well, magical. The film nicely begins it's journey to telling the history of the Harry Potter universe that we got hints of in the previous series, making it a wonderful addition and expansion to the world, yet, at the same time, it stands on it's own. Fantastic Beasts and Where to Find Them is rated 4 out of five Bowtruckles."
    },
    {
      "rating": "0",
      "text": "Meet Newt Scamander - wizard - from England, one of Prof Albus Dumbledore's favourite, young, talented, very interesting in magical beasts and sloppy. He came to America, to buy a rare magical beast.  His aspire just one : that to make the world of wizard have a better understanding about magical beasts. He come just in not in right moment where ther has been several phenomena in that could've blown the cover of wizards identity in America. Newt stop by in the ladder entry to a bank to hear speech of Mary Lou about wizards living among humans and very dangerous to human mankind - meanwhile a cute niffler manage to escape from Newt magic suitcase and runaway into the bank, Newt found out and try to catch it back. His path cross with a no-mag Kowalksi - a wanna be pastries shop owner, then soon the adventure begins for both of them. Then Newt arrested by a demoted auror Tina Goldstein and brings him to magical congress, so she can get promoted again. But, then things don't happen as she hopes. Cause, in the process when Kowalski escape from Newt, their suit case accidentally swapped - all the magical beasts that Newt hide in that magic suitcase escape, even one of that beast bite Kowalski and cause him a fever. And rhe road to a whole new unforgettable adventure begins for all of them. I do admit that i enjoyed this movie - even though that director David Yates buy too much time to bring all adventure that make me in between of bored, curious and impatience at the same time. But, even i never read any of JK Rowling's book i still can feel that this character Graves - is onto something evil (my opinion cause that choose Collin Farrel - that also known of his ability to play as a villain, but it's not a poor choice, cause Farrel really did his part as a cold magical security). Yates succeeded brings this element of curiousity among audiens that never read this JK Rowling book, what is Graves agenda - who is the wanna be quiet introvert Credence? I also enjoyed the hillarious and emotional moments that Yates build between character Newt-Tina-Kowalski and Queenie. Off course the beasts are fantastic. What i feel is that this first Fantastic Beast is not really of Harry Potter's weight, but Yates manage to delivered this in a such magically fun delightful adventure with such beautiful special effects. But really it was Kowalski character that steal moments while the others - not mediocre - even though not fantastic but really fits in. My final conclusion is : \"The whole plots not kick hard enough but...really entertaining\""
    },
    {
      "rating": "8",
      "text": "The only blondie is an airhead. The white hair ones are either incompetent or evil. There is no shortage of bad things and plot holes, but the fantastic production outshines it all.  The CG really turned Rowling's quriky monsters into Fantastic beasts, and the principle cast did a good job at making me care about their characters.  Rowling's go-to-choice for a whimsical adventure with foreshadowing of greater plot is still here and it's good entertainment... if you just accept it for what it is... a kid's movie."
    },
    {
      "rating": "0",
      "text": "Completely unmemorable. Opens interestingly enough but has nothing propelling the middle and meanders to a muddlesome end. Formulaic as f**k I thought."
    },
    {
      "rating": "10",
      "text": "Harry Potter is the biggest part of my childhood, so it's no surprise that I was waiting for Fantastic Beasts more than anything else this year. But finally the wait is over, and I can feast on this movie with my eyes! And for all you Potterheads out there, I've got some good news! Fantastic Beasts is just what the title says, it is fantastic. The biggest surprise for me was the fact that this movie doesn't rely on nostalgia and just try to set up sequels, but instead it gives us a good story, interesting characters portrayed by fantastic actors and last but not least, it gives us the feeling that we really are in the Harry Potter world once again! There's magic, there's wonder, there's color and an overall feeling of warmth here. Eddie Redmayne was such a good choice for the main role, his performance was fantastic, and so was Dan Fogler's as the funny sidekick character. It's just so nice that the movie didn't suck because I'm the biggest Potterhead and it feels good to have a new movie in the series."
    },
    {
      "rating": "8",
      "text": "Maintaining the magical components of the Harry Potter world and adding more creatures that i couldn't even imagine, and a great twist in the end, just was expecting more from some characters, but if you enjoyed the harry potter franchise, you will certainly enjoy this movie"
    },
    {
      "rating": "7",
      "text": "Eddie Redmayne plays the slightly-eccentric Brit who travels to 20s New York with a suitcase full of magical creatures. Naturally, they escape and all manner of mayhem ensues. The visual effects are remarkable and the beasts are truly fantastic. On the other hand, the story isn't especially inventive and the direction lacks personality. Even Redmayne resorts to the gawky, awkward style that's often apparent in his work. While there are clever moments and a few mildly enjoyable characters, it's just a noisy, jumbled disarray by the end. The overall effect is visually dazzling and fun to watch, but not especially captivating on a human level."
    },
    {
      "rating": "7",
      "text": "Fantastic Beasts and Where to Find Them is an excellent first chapter in the Harry Potter spin off. It immediately lurches towards the darker aspects of the later potter movies, whilst still maintaining some giddy fun of new discovery. The world building is great and in general, this is a much more satisfying movie than the early Potter films. Great stuff!"
    },
    {
      "rating": "8",
      "text": "It's great to jump back into the series after a few years absence. Really enjoyed the main cast, Specifically Farrell and Redmayne. Shout out to Dan Fogler, He gave a much better performance than I expected and really had a lovable character. I thought Ezra Miller was by far the weakest part of the cast, Mainly due to how his character was written and not acted. Plot wise is was a little bit basic but there was enough action and plot twists to keep you interested in for the full run time. It's a very beautiful and well directed/edited film. I wish they tried more variety among spell use rather than the same 3-4 spells over and over again but that's just me.Overall, I really enjoyed it. I had no real issue with the movie and can't wait to see the second one. Certainly lived up to expectations as a spin off and more than lived up to the hype."
    },
    {
      "rating": "6",
      "text": "For someone that is really into the Harry Potter universe, I was actually kind of excited for this movie. However, the movie was simply enjoyable, but nothing special. I'll start off with some positives. First off, I was intrigued with the concept of having to recapture the beasts. The beasts were very unique and interesting to watch. As much as I personally do not like Eddie Redmayne as an actor, I thought he was fine as Newt Scamander. Nothing special, but serviceable. I really enjoyed Dan Folger as Kowalski, or the no-maj as he's referred to in the movie. I liked seeing him really get caught up in this world and forming this awkward friendship with Newt Scamander. At the same time, I also found his relationship with the character of Queenie to be even more interesting than I could have possibly imagined. Most importantly, despite the movies numerous \"Lord of the Rings\" like endings, what happens to Kowalski at the end of the movie honestly left me touched. However, the movie has quite a bit of flaws. The movie suffers from pacing issues. Some scenes played out better than others. The whole Ezra Miller storyline didn't really captivate me and felt as if it was from a completely different movie. But the biggest reveal in the movie, while truly surprising, didn't feel needed in any way, shape or form. If you've seen the movie, you will definitely know what I am talking about. And the ending itself went on way too damn long. Like I mentioned before, I like what happened with the no-maj character, but everything else happening at the end simply did not need to happen. There were definitely two movies going on at the same time, which was very distracting. At the same time, I cared about our main protagonists and wanted to learn more about them, which is why I ended up enjoying the movie in the long run. Overall, for a messy movie, it still provides some interesting new additions to this movie universe that fans will not be disappointed with. I give \"Fantastic Beasts\" a B-!"
    },
    {
      "rating": "7",
      "text": "The first half of this movie moves at a very slow pace with no music or rhythm. The first half is quite boring. The second is a lot of fun and adventure. With a great climax to the movie as well. If you're a fan of the Harry Potter series you will love this film, but otherwise it may not be worth seeing."
    },
    {
      "rating": "8",
      "text": "Fantastic Beasts is a thrill ride full of monster, witches, wizards and the American laws of magic. Inspired by JK Rowling's book of the same name, this is more of a North American based prequel of the Harry Potter films, and though it starts slow it builds into a wonderfully complex movie filled with themes of politics and animal rescue. Eddie Redmayne is wonderful as the awkward Newt as is Dan Fogler who plays his No-Maj (human) friend Jacob."
    },
    {
      "rating": "8",
      "text": "Related media: I have watched all of the previous seven Harry Potter films but have not read any of the books, including the Fantastic Beasts book.What's it like?: It's like the first Harry Potter film, where they introduce the World of Wizardry, its magic, human characters and animals, combined with the horrifying world of witch-hunting in the old US of A.Pros:1) As promised by the title, there are some fantastic beasts! 2) The film also brings the world of Harry Potter, its magic, human characters and animals, back into our consciousness again, but it is going in a totally different direction, and that is interesting and original.Cons:1) The obvious villain in the film, a very destructive force, could be better presented towards the end of the film. As in Alien and Jaws, less is more. There was too much of it in the film, yet it felt insufficiently explained. This part here could be shortened by few minutes. (Note: There is a less obvious villain in the film.)3) Johnny Depp's casting in this film felt like an attempt to promote his flagging career.How would the the different age groups rate it?Children: (The film is not rated for children.)Teens: ExcellentYoung adults: GoodMedium age adults: GoodOld adults: GoodRating: 4/5 (no half scores). It is worth spending your money and watching it in the cinemas."
    },
    {
      "rating": "8",
      "text": "FBaWtFT is as good as a film based on a spin-off novella written for charity has any right to be, and better than the ninth film in any franchise should be expected to be. It's got all the wonder and none of the bad child-acting of the original Harry Potter films. What more can be said than that?"
    },
    {
      "rating": "9",
      "text": "Fantastic Beasts is an absolute blast and a great opener to this new story in the Wizarding World. It has all the magic of the Harry Potter franchise, while at the same time bringing in new elements and standing on its own without relying too much on nostalgia or the previous entries. I don't want to spoil too much but this film was much darker than I was expecting. This is definitely a more mature version of J.K. Rowling's universe. The acting is fantastic. Eddie Redmayne as Newt was a great choice but I would say the standout is probably Colin Farrell as Percival Graves. He stole every scene he was in. Fantastic Beasts is full to the brim with imagination. It truly shows how many tricks Rowling still has up her sleeve. It's pretty impressive how her first screenplay/film is already up to par with her extremely innovative book series. This is definitely not like other prequels when it comes to substance. It's original, it's complex, and it's engaging. And I say that as someone who liked the Star Wars prequels.Unfortunately, since I'm not an official critic, I can only give scores out of 10 but if I could give scores out of 100, this would be a 96. For Harry Potter fans, this probably ranks somewhere in between 3rd and 4th place out of all the films. For me, that'd be between Prisoner of Azkaban and Half-Blood Prince."
    },
    {
      "rating": "8",
      "text": "A pleasent revisit to the universe that JK Rowling created. I only wish they would have spent more time on character development than story. I can't wait to see more."
    },
    {
      "rating": "9",
      "text": "I was not expecting much, since this is a kind of prequel to Harry Potter based on a fictional textbook.  However, J.K. Rowling really did not drop the ball here.  I love how she has brought the US wizarding world to life, taking into account a variety of real-life cultural differences between the US and the UK. There's a lot of imagination and a lot going on in this story, all while it introduces us to a new cast of interesting characters.  I liked that the No-Maj character is not simply comic relief (though he is pretty funny)."
    }
  ],
  "recommendations": [
    "how_to_train_your_dragon_the_hidden_world",
    "the_bfg",
    "the_nutcracker_and_the_four_realms",
    "doctor_strange",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "the_hunger_games_catching_fire",
    "maleficent_mistress_of_evil",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "back_to_the_future_part_ii",
    "hellboy_ii_the_golden_army",
    "thor",
    "bumblebee",
    "dumbo",
    "how_to_train_your_dragon_2",
    "toy_story_4",
    "the_hobbit_an_unexpected_journey",
    "mortal_engines",
    "the_kid_who_would_be_king",
    "spider_man_into_the_spider_verse",
    "harry_potter_and_the_goblet_of_fire",
    "alice_in_wonderland",
    "alice_through_the_looking_glass",
    "super_8",
    "the_lord_of_the_rings_the_fellowship_of_the_ring"
  ]
}