{
  "id": 2304,
  "title": "Fantastic Four: Rise of the Silver Surfer",
  "starring": [
    "Ioan Gruffudd",
    "Jessica Alba"
  ],
  "runtime": 92,
  "genre": [
    "Adventure",
    "Fantasy",
    "Action",
    "Thriller"
  ],
  "description": "The Fantastic Four return to the big screen as a new and all powerful enemy threatens the Earth. The seemingly unstoppable 'Silver Surfer', but all is not what it seems and there are old and new enemies that pose a greater threat than the intrepid superheroes realize.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9wRfzTcMyyzkQxVDqBHv8RwuZOv.jpg",
  "categories": {
    "plot": 5.285714285714286,
    "acting": 4.774193548387097,
    "ending": 3.6666666666666665,
    "soundtrack": 5.0,
    "cinematography": 4.5,
    "familyFriendly": 6.0,
    "funny": 5.142857142857143,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Fantastic 4: Rise of the Silver on its own is a mediocre/forgettable film with thin characters but it is a major improvement over the first film. The cast who somewhat captures the spirit of the cast from the comics works well off each other and is given a story to participate in this time. The group using their powers to stop a bad guy provides a more engaging film than the last one when the film isn’t getting bogged down in goofy antics and a generic romance plot. This isn’t a good superhero movie being a little corny especially given where Marvel movies are at now but there have been far worse especially from its own franchise. While it remains to be seen how the reboot will fare at least we have FF movie that kind of works."
    },
    {
      "rating": "6",
      "text": "Another mediocre Fantastic Four movie that is just as interesting as the first one, while it does have a more interesting plot it suffers because they ruined Galactus, I mean come on a cloud?! you've got to be kidding me, but at least it's not worst than the first."
    },
    {
      "rating": "4",
      "text": "Same Issues As The First OneRise Of The Silver Surfer may have a decently done Silver Surfer, But the movie’s overly campy tone, Galactus is done COMPLETELY wrong, the CGI can get bad at times."
    },
    {
      "rating": "8",
      "text": "At ninety-minute,the movie whizzes along efficiently and isn't around long enough to really overstay its welcome,which also ends up playling  to its advantage."
    },
    {
      "rating": "3",
      "text": "\"Fantastic Four 2\" is extremely terrible. Everything has gotten one step worse, and the more you watch the more paint it will bring you."
    },
    {
      "rating": "10",
      "text": "Very good, the best superhero film ever since X2."
    },
    {
      "rating": "6",
      "text": "This movie continues the adventures of the Fantastic Four. During a wedding with Reed Richards and Susan Storm, they've been threatened by a new villain named the Silver Surfer. With the reunion of their old arch enemy, they tried to hunt down the Silver Surfer and stop him, but is he really a bad guy or is he just a slave working for an unknown evil? Oh, well. Time to get on with my opinion. I actually found this movie to be way better than the first.\r The cinematography was good, the sets were good, the acting was decent, the storyline was well-paced, the CGI were great, and the action sequences were also great. That's it for the good.\r The dialogue was rushed, and the storytelling was weak. That was it.\r Overall, it isn't the best marvel adaptation of the comics, but it is way better than the first as one of the most interesting superhero movies.\r 6/10"
    },
    {
      "rating": "5",
      "text": "Somewhat entertaining and reasonably well-produced but mediocre writing and lame story."
    },
    {
      "rating": "7",
      "text": "A big improvement from the original. The acting has improved, and the Silver Surfer is awesome. They have proven they can make the series great. The best in the series."
    },
    {
      "rating": "8",
      "text": "It's as good as the first one honestly. While the film approve over the original it's still fun. Good story, good concept, good acting and fun like the first one! It's a fun superhero film."
    },
    {
      "rating": "10",
      "text": "Amazing! This second part of the fantastic four is better than the first part, and the best is the apparition of Silver Surfer, the only bad is... Galactus, really? a big cloud? need be a joke. But the film is awesome, and I never wait that."
    },
    {
      "rating": "7",
      "text": "I found this movie quite a disappointing sequel, but still it is good. It is still with the memorable four superheroes, but the plot is quite disappointing. I don't know how this sequel gets better rating than the first movie. Still it haves it's great moments, and great villains. (7.0)"
    },
    {
      "rating": "7",
      "text": "Tim Story's sequel is a largely an improvement to it's predecessor, but it still has the problems  that the first film had it's poorly edited and it's riddled with the cliche's also it's a boring story and plot. Fantastic 4: Rise-Of The Silver Surfer is an interesting film but screenwriters Mark Frost and Don Payne at least keep the film going and keeps us interested with the story and not make it boring like the last one. The franchise still  goes in it care-free direction, but it does something that the first one hasn't done yet and that is entertaining enough, the first one wasn't entertaining it just gave us a cheesy super hero story and mindless action sequences it was boring. Hack du-jour Tim Story has returned to direct, Story gives us non accurate action sequences but he actually does not make the fun invisible, he actually  goes CGI crazy delivering scene after scene. But at this at this point he should just make comedies instead, he does not how know this  action genre at all. The comedic timing was off and it didn't work. The villain is weak the only reason he is there is just trying to take the team down that's the only reason the character has no motivation.  The cast does have some chemistry, that's what makes the movies watchable. After defeating Von Doom, the Fantastic Four can really enjoy life more. All four are now comfortable with their new powers. The Thing and Johnny Storm now get along with each other, and Sue Storm is now planning to be Mrs. Fantastic. Galactus, an evil creature in space, has decided that Earth is it's new target, and sends the Silver Surfer to destroy it. Reed Richards and his team must now work together to capture this surfer, and even must now team up with one individual who they didn't expect to help. Grade C+"
    },
    {
      "rating": "1",
      "text": "Do not watch this film. It's a waste of your money and your time. The acting is horrendous, the storyline is garbage and some of the lines which are meant to be serious had me shrieking in laughter. If you want to watch a movie just to laugh at it, look no further than this garbage."
    },
    {
      "rating": "4",
      "text": "The good news is that its more memorable than the original. The bad news is that the problems of the original still remain."
    },
    {
      "rating": "1",
      "text": "Particularly for me it seems the film is completely worse than its predecessor and is guilty of heavily putting on the cheese along with the film providing awful performances. The film is atrocious besides it great visual effects. I give this film 12%."
    },
    {
      "rating": "5",
      "text": "One could argue that this is both better and worse than the first movie at the same time.\r Characters feel more flushed out this time. Even Doom looks and acts more like his comic counterpart (most of the time.) However, there are too many times when the dialogue is a bit too cartoony, trying too hard to sound like the comic.\r While the plot is a good one, its execution was poor and again, underwhelming. While I get why they didn't make Galactus a big purple guy, they completely messed by making him look like a space storm, also Doom hogging the spotlight didn't help.\r I did like the Silver Surfer. He looked, acted and sounded exactly as I expected he would. A shame that his character is over shadowed by almost everything else.\r Overall:\rF4RotSS is in my opinion a marginal improvement on the first movie. It's allot more fun to watch with better effects and action. But also some silly dialogue and wasted plot opportunities do make the movie feel a bit underwhelming."
    },
    {
      "rating": "4",
      "text": "The most interesting part about this film is that it is supposed to be about the Silver Surfer, however we spend most of the film trying to work out why this dud was made."
    },
    {
      "rating": "2",
      "text": "Fantastic Four is anything but.\rA collage of terrible actors with terrible scripts, given horrendous characters with laughable moments of pure stupidity."
    },
    {
      "rating": "4",
      "text": "This movie is a massive screw up in nearly everyway. It makes one of Marvels biggest villains Galactus as a cloud. Anti-military bias throughout as bad as that of Avatar. Lots of bad jokes fill the script in an episodic plot that rarely has any stakes even when the world is in danger."
    },
    {
      "rating": "2",
      "text": "A very bad sequel to an incredibly mediocre first try. The fantastic four rise of the sliver serfer fails to try to do things right. Johnny storm and reed Richards are the only good characters again but the silver surfer just looks bad. Don't get me started on what they did to galactus. He is basically a big cloud of nothing really. Overall a really terrible sequel to a mediocre first try"
    },
    {
      "rating": "5",
      "text": "Pues la verdad ni supera ni es peor que la primera, pero que le hicieron a Galactus? De verdad, no se entiende, fue HORRIBLE. Que tiene Fox con las nubes gigantes?"
    },
    {
      "rating": "3",
      "text": "With not much to work with, the folks behind this sour sequel to the first Fantastic failure, manage to make a bad thing even worse."
    },
    {
      "rating": "3",
      "text": "Somehow even worse than it's predecessor. Even more silliness and subpar writing seems to find itself into this sequel."
    },
    {
      "rating": "10",
      "text": "Un film sicuramente superiore al primo,mi è piaciuto soprattutto perchè introduce Silver Surfer,personaggio con una storia tutta sua nel fumetto originale,infatti nei film di Spider-Man non compariva nessun altro supereroe della Marvel eccetto Spider-Man,quì invece assistiamo ad un vero e proprio Chrossover,ed è questo ciò che mi è piaciuto del film.Una storia fantastice ed un'ottima recitazione.Un film da vedere assolutamente."
    },
    {
      "rating": "3",
      "text": "Be careful what you wish for, you may get it…\r For non comic book fans over the age of 13, Fantastic Four: Rise of the Silver Surfer is a tedious, incoherent bore. For comic book fans of any age, it is an atrocity - the cinematic desecration of one of the most storied and beloved of Marvel comic book epics. It reduces iconic characters to soulless special effects and turns one of the most ominous and dangerous of all villains into an interplanetary storm cloud. The action, of which there is little, is predictable and unexciting. The so-called \"drama,\" of which there is far too much, is painful. Soap opera writers would be embarrassed to script such drivel. Then there's the overlay of \"comedy,\" which is intended to reflect the superheroes' comic book origins, except it's not funny and it makes the Fantastic Four seem more like the Four Stooges than a quartet of world saviors. For a story that has been kicking around in one form or another in Hollywood for 30 years (at one point, it was to have starred Olivia Newton-John as the Silver Surfer's girlfriend), it's discouraging that this is the best the filmmakers could divine.\r Bring on Galactus, I advised during my review of the underwhelming first Fantastic Four movie. Well, they brought him on and promptly dissed him. He's not much of a presence in the film, always hovering out of sight if not entirely out of mind. And when it comes time for the big \"reveal,\" the word \"underwhelming\" doesn't do the experience justice. Granted, the Galactus of the comic books, with his bright purple suit and ridiculous helmet, might have looked a little silly on the big screen, but his stand-in is a huge disappointment. To quote Star Trek: The Motion Picture, which also featured a space cloud heading for Earth: \"Is that all there is? Is there nothing more?\"\r When the movie opens, Reed Richards (Ioan Gruffudd) and Sue Storm (Jessica Alba) are trying to get married. But their nuptial plans are interrupted when a celestial traveler called the Silver Surfer (Doug Jones, voice of Laurence Fishburne) arrives at Earth to prepare it as the next meal for his planet devouring master, Galactus. His arrival awakens Dr. Doom (Julian McMahon), who manages through nefarious means to be named the lead scientist on a government project studying the Surfer and his board. Reed, Sue, and the other members of their quartet, Johnny Storm (Chris Evans) and Ben Grimm (Michael Chilkis), find their best efforts to stop the Surfer to be futile, and every time they fail, Galactus looms ever closer.\r Director Tim Story, who also helmed 2005's Fantastic Four, seems convinced that the movie must be pitched to pre-teens. There's something unsettling about a superhero movie carrying a PG rating. There are plenty of special effects but the action sequences (which include a soaring flight past New York skyscrapers and a chase featuring a souped-up Dodge - talk about a product placement!) could have been lifted from a video game and the characterization is atrocious. Story is creating a product and he has lost sight of everything that makes the Fantastic Four beloved by fans. I can't say this is the worst comic book superhero movie to grace the silver screen, but it's in the dregs (and this series hasn't even reached #3 yet).\r The acting is almost uniformly cringe-inducing. If not for his work in Amazing Grace, I would be convinced that Ioan Gruffudd has no talent whatsoever. Jessica Alba makes love to the camera with her looks but no amount of physical beauty can camouflage the fact that she can't act. (The guy sitting next to me kept murmuring, \"She's hot!\" not \"What an actress!\" That, I suppose, is the point.) Nip/Tuck's Julian McMahon froths at the mouth so energetically that one wonders if he has rabies. Stripped of his Shield and trapped under foam and latex, Michael Chilkis comes close to making Ben Grimm a sympathetic figure, until bad jokes get in the way. And Chris Evans is simply annoying, even though he has what comes closest to a character arc.\r This movie is a mess. It's as if the script was cobbled together in a rush then changed during filming. The ending, in addition to being a letdown, is nonsensical. A lot of what happens in the film, including the re-introduction of Dr. Doom, feels completely arbitrary. What does it say about a major motion picture when the Stan Lee cameo is the highlight? (That was the only time when I smiled.) Rise of the Silver Surfer is only 90 minutes long but it seems as protracted and pointless as anything else this summer has had to offer.\r ise of the Silver Surfer is an insult to comic book aficionados and movie lovers alike. Those who know and love the Fantastic Four will curse Tim Story and 20th Century Fox as they leave multiplexes shaking their heads in disgust."
    },
    {
      "rating": "5",
      "text": "Fantastic Four: Rise of the Silver Surfer is a mildly entertaining superhero flick. There are some nice beats in the movie, such as Doctor Doom still being a suave badass and some amusing power swapping shenanigans, but overall the film fails to surpass the fun original. The main problems are some really stupid blunders of logic (the Great Wall of China is apparently right next to Shanghai) and the bizarre implementation of the Silver Surfer, which results in an incredibly famous hero minimized to almost nothing. Overall, Rise of the Silver Surfer is a bit of a lame duck."
    },
    {
      "rating": "4",
      "text": "Jeez. Even while fans are still reeling from the mess that was the first film, it was decided to take another part of this fabled comic series and shred that into unrecognizable pieces that leave a pure-rotten taste in your mouth. This second iteration of the film series has the four fighting against the Silver Surfer and his boss, Galactus, before the two can consume Earth and many more planets along the way. But the movie becomes more and more desperate to keep you watching as it goes on. But even then, by the ending you'll be so bored watching a sack of potatoes would keep you more entertained. And there is a big freaking question that is never answered: If the Silver Surfer could take out Galactus all by himself, why didn't he do it earlier? When the idea was prompted, he was all in support of it, but at the start of the movie he wasn't? I suppose that there were some pretty cool scenes in the movie, but if you want to see a flick with a good story, dodge this train-wreck. Comic fans, don't even bother. I can't believe they decided on a second Eragon."
    },
    {
      "rating": "5",
      "text": "This movie is of a normal standard. The climax is placed at the wrong time of the movie. The special effects were not bad. Overall, this is an average film and if your expectations are high, you will probably give this a negative review."
    },
    {
      "rating": "3",
      "text": "Here's a thought. If the Silver Surfer can take out Galactus all by his lonesome, how come he didn't do it a few sentient planets earlier and spare billions of lives and remove the potential threat to his planet? This movie insults the intelligence and is silly. Jessica Alba looks like a freak with the blonde hair and blue contacts. The general guy is an idiot to keep the FF 4 under lock and key while allowing Dr. Doom a free rein (more or less). Don't waste your time unless you are a comicbook fanboy and have to go to such movies on principle."
    },
    {
      "rating": "8",
      "text": "I dunno what the problem is with critics these days... they don't seem to rate a movie on what it is.. they want another Schindlers list or something equally as deep. News flash!, comic books aren't meant to be deep (Well most of them), they are meant to be action a bit of comedy and stick to the storyline of the comic book that made them so damn.. well.. fantastic. I really liked some of the stuff they did the merging of powers was cool and i never really had a bored moment in it. However i do have three very big problems with this film 1) Silver Surfer never says.. TO ME MY BOARD!, even though they give him the perfect chance to do it. 2) Galactus is a giant smoke screen and the little we do see of his face is fire? What the hell, I love silver surfer but the possibility of seeing Galactus was what drew me to this movie.. I didn't see him once.. i saw a shadow of his head on Jupiter :S that was about it... very disappointing. 3) Silver Surfer who Galactus gave a tiny bit of his power was able to kill galactus... and yet seemingly survive at the end.... ok cmon now your stretching things.. Galactus would have laughed, with that awesome voice of his, at the pure audacity of such an attempt.. Silver Surfer is meant to beg for Galactuses mercy and then be trapped to earth forever for his treachery... Why Stan lee allowed someone to change this we will never know i guess. Ok other then that i was entertained but severely disappointed at the changes in storyline."
    },
    {
      "rating": "10",
      "text": "This movie was really good. A must-see. Mr. Fantastic and Invisible woman have great chemistry. Flame boy is really cool too! Rock man is funny and is a rock."
    },
    {
      "rating": "6",
      "text": "Like the prequel it is a solid movie but nowhere near the good MCU movies. Also it uses the characters not well. Believe it or not both the Silver Surfer and his boss (don't know if his name counts as spoiler but will avoid it) have a deep and tragic back story in the comics. They fail to address this here which harms the characters. The boss should be a highlight of the movie and I hope they do it better in the MCU as his appearance is theorized for this phase. The story starts during the weeding ceremony of Susan and Reed Richards when a strange object cause a power blackout. This is just the tip of the iceberg as around the world strange things happen. The titular Silver Surfer has arrived. So starts the story. I say they deliver an interesting story but fail here too. At least they produce not total garbage. It is underwhelming if you know the comics and the impact of the Silver Surfer and his boss. There are countless ways to do this better and transfer this to the screen. It is like going to a good steak house and just take a small salad while not being vegan or vegetarian. The arc with the powers is interesting and well done but meaningless in comparison with the menace. It is like fixing your uniform when you are under heavy enemy attack. It should not be the focus. Also they solve the issue with ease and this cheapens the movie and menace. When Silver Surfers boss is approaching in the comics all the heroes are panicking and you will see real dread even by hardened characters. He is a force of cosmic nature and the number of people that can go toe to toe with him or surpass him includes only the strongest characters aka reality warpers and the stronger god like beings. The characters aka actors deliver a good performance in the movie but cant turn the tide. All characters return and I basically copied my comments from the prequel as it is valid here too. Ioan Gruffudd is excellent as Reed Richards and I can see him become as iconic as the MCU counterparts with better scripts. I am a fan of Jessica Alba since Dark Angel. I like her performance but also think they could use her character better. Sue Storm is an often overlooked powerhouse and this does not change with or without her powers. Chris Evans as Johnny Storm seems now so out of character since he became the embodiment of Captain America and nailed the role. I say he delivers but was destined to become something far greater. Michael Chiklis as Ben Grimm is awesome and I like his character development and struggles. Julian McMahon again delivers as actor even when they fail to deliver Dr. Doom. Doug Jones and Laurence Fishbourne are similar. Great performance but weak representation of the Silver Surfer from the comics. I wont and to be fair cant blame the actors. Good performance in a script that needs improvements. The special effects were good back then but there are things that did not win me over. There are things that can be good but not for you like licorice as an easy example. Overall this is not a bad movie but will be fast forgotten."
    },
    {
      "rating": "8",
      "text": "Fantastic Four: Rise of the Silver Surfer. Threat on a planetary scale. More interesting, captivating and cooler. Now, The Fantastic Four is not a boring team of superheroes as it was in the first film, but a strong family that can even resist Galactic evil."
    },
    {
      "rating": "5",
      "text": "Feels like they didn't know what to do or where to go with the sequel. Stick with the first film it was the stronger of the two in every way, but only by a little."
    },
    {
      "rating": "6",
      "text": "This film isn't necessarily better than the previous but it certainly isn't worse. The acting hasn't improved and neither has the story but this is a fun summer superhero film."
    },
    {
      "rating": "5",
      "text": "I don't hate this film because of three reasons. 1. I could see GGGAAALLLUUCCCTTTUUUSSS! and SS in this film.2. I loved Stan Lee Cameo.3. It was much better than FF film in 2015.Actually, it was not that bad. I expected something worse, but this satisfied me. Therefore, the film is okay."
    },
    {
      "rating": "7",
      "text": "This movie continues the adventures of the Fantastic Four. During a wedding with Reed Richards and Susan Storm, they've been threatened by a new villain named the Silver Surfer. With the reunion of their old arch enemy, they tried to hunt…"
    },
    {
      "rating": "10",
      "text": "hugugugigiggjgjjbjbjbjvyddyfswwrtuokkkpkmjhhgfdsazzxcccvbnnmkklljjhhggfdsthjononohigyftdyfugihufyfyfugugjgjgjgjg"
    },
    {
      "rating": "10",
      "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°@;@;@;;@;@;@;@;@;@;@!@!@!@!@:@:@;@;@;@;;@;@;@;@;@;@;@;@;"
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:::;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "10",
      "text": "-----------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"
    },
    {
      "rating": "7",
      "text": "better than the first but not great. i recommend if you like superhero movies but not for anyone else"
    },
    {
      "rating": "7",
      "text": "Much better than the first movie, I liked it even though a lot of critics panned this movie!!!"
    },
    {
      "rating": "3",
      "text": "Although i would say this was the better of the two Fantastic 4 movies, it would be much like saying, \" Of the two times i have been stung in the face, this was definitely the most pleasureabe\" or maybe, \"That was the best head-butt to the crotch my nephew has ever given me.\" If this movie was just advertised as your run-of-the mill popcorn flick, it may have been tolerable. But if you're gonna call yourself a 'Marvel' movie and include the likes of The Silver Surfer and especially Galactus, you'd better do it right. First of all, the first quarter of the movie was still just talking. I mean, the 4 already have their powers and the beginning is still devoted to nothingness. When the story (and i use that term loosely) finally gets going, the movie really starts to disappoint. Apparently, the Fantastic 4 aren't nearly as interesting with their original powers so they trade around a little bit. At the end of course this all works out beautifully when the Human Torch (who is made out to be an unbelievably massive tool; 'Flame on' is an understatement) takes everyones powers (including the Thing, who just kinda turns back to a human, ridiculous) and saves the world from planet-eating Galactus (Who is now a cloud? There's gotta be a law against completely and utterly mutilating characters! Such a disappointment.). In fact, the only thing that doesn't make me reach for mouthwash and ginger ale is the Silver Surfer. The effects on him were well done, honestly better than I expected. My suggestion: if you're gonna cast Jessica Alba in a role for your move, consider maybe a role where she doesn't have to do that, that thing that actors and actresses are supposed to do. What's that called again?"
    },
    {
      "rating": "10",
      "text": "FF2: Rise of the Silver Surfer has a weak point in its plot every second with a touch of dullness, and standards. But these special/visual effects we were given are amazing, I was astonished by them. And if you put your full thought into it, it is entertaining, and creative throughout."
    },
    {
      "rating": "9",
      "text": "JUST got back from the midnight showing. Now, I'm biased because the FF are my favorite superheroes, period. But even I have to admit the first one was pretty hum drum. I went into this with a mixture of dread and hope. I have to say, I really, really liked it. To me, this was a proper Fantastic Four movie. About 20 times better than Spider-man 3 for sure. The Silver Surfer, the Fantasticar, Doctor Doom... everything felt so right. It's not nearly as brainless as some critics make it out be. There's genuine warmth between the characters, and there is some growth. In the FF's world, there's no cloud of death hanging over them ala Spider-man that drives their sense of responsibility. Their scientists who go on fun adventures, enjoying their powers and trying not to kill eachother when their familial bonds get to be too much. Their not being hunted and spurned by a world who hates them ala X-men. There's not a lot of pathos, so maybe that makes them seem shallow. But it's not that simple. There are a lot of inter-relationship issues that stem from being a family. It's this, set against the backdrop of all these crazy adventures, that makes the team what they are. The first movie felt sort of forced in places, and didn't have nearly the scale an FF movie should. This movie was much better. I'd like to see more exploring, more strange worlds, etc in a future movie, but this was a step in the right direction. It had more of a global feel. Also, Julian McMahon totally redeemed himself as Doom. He was really cool. If anything, I want to see more adventures of this team now. It was very short. A perfectly paced 90 minutes (which was refreshing after the over-long, sometimes boring Spider-man.) Oh, and the thing that most people are in a tizzy about? Didn't bother me a bit."
    },
    {
      "rating": "5",
      "text": "I enjoyed this movie, purely for the genius of Jessica Alba in a lycra cat-suit. However, the rest was another forgettable comic book flick for me."
    },
    {
      "rating": "8",
      "text": "This is a great movie. Its not a masterpiece but its great fun and enjoyable to watch. The Film improves greatly on the first Fantastic four."
    },
    {
      "rating": "1",
      "text": "This movie sucks. The dialog is cheesy, the acting sucks, and the title makes no sense. The silver surfer didn't \"rise\" from anywhere, he came from space. And at the end he destroyed Galactis, which he could have done all along when he was destroying those countless other planets. It wasn't as bad as the first, the special effects were cool, but don't see this movie. At the end they hinted at a sequel, i hope they can bring this series back."
    }
  ]
}