{
  "id": 2040,
  "title": "Fantastic Beasts: The Secrets of Dumbledore",
  "starring": [
    "Eddie Redmayne",
    "Jude Law"
  ],
  "runtime": 142,
  "genre": [
    "Fantasy",
    "Adventure",
    "Action"
  ],
  "description": "Professor Albus Dumbledore knows the powerful, dark wizard Gellert Grindelwald is moving to seize control of the wizarding world. Unable to stop him alone, he entrusts magizoologist Newt Scamander to lead an intrepid team of wizards and witches. They soon encounter an array of old and new beasts as they clash with Grindelwald's growing legion of followers.",
  "releaseYear": "2022",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jrgifaYeUtTnaH7NF5Drkgjg2MB.jpg",
  "categories": {
    "plot": 6.52,
    "acting": 6.2727272727272725,
    "ending": 4.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.333333333333333,
    "action": 7.857142857142857
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I'm not sure why this movie is getting so much negativity. It's not a masterpiece, but it's an entertaining and fun watch. There's several things that could be improved (the ending is somewhat anti-climatic), but it's a step in the right direction and had many moments that made me and my family happy. Even if you're not a huge Harry Potter fan (like myself), there's tons for you to enjoy."
    },
    {
      "rating": "7",
      "text": "It's as good as it's predecessor... Not great, what is really sad.The actors are really good except for mads Mikkensen ( Grindelwald)"
    },
    {
      "rating": "7",
      "text": "CGi great, locations breathtaking but a story that doesn't convince because of the many story arcs. All in all an entertaining movie but not a memorable one within the universe."
    },
    {
      "rating": "10",
      "text": "В целом мне понравился этот фильм , вторая часть была такой что хотелось вырубить на середине фильма , а здесь даже как то лампово, не без косяков конечно , но фильм хорош."
    },
    {
      "rating": "10",
      "text": "GOOD GOOD GOOD GOOD IF I DIDN'T WATCH FANTASTIC BEASTS THE SECRETS OF DUMBLEDORE THE ENDING IS GOOD FANTASTIC BEAST THE SECRETS OF DUMBLEDORE IS BETTER THAN FANTASTIC BEASTS THE CRIMES OF GRINDELWALK I HOPE THE 4TH AND THE 5TH WILL BE GOOD JUST LIKE THE SECRETS OF DUMBLEDORE BUT I HOPE THE 4TH AND THE FIFTH DON'T BE LIKE FANTASTIC BEASTS THE CRIMES OF GRINDELWALK! good"
    },
    {
      "rating": "10",
      "text": "I love the universe of Harry Potter and this movie always remains the same: A surprising and incredible film"
    },
    {
      "rating": "8",
      "text": "Based on the mixed reviews, I had low expectations going into the theater, but I was pleasantly surprised. This movie does a better job of addressing some of the issues with “Crimes of Grindelwald.”  The story is more focused on the key characters — although they did introduce a few new ones again.  Mads Mikkelsen is excellent as Grindelwald. Jude Law and Eddie Redmayne are also great. The pace is exciting, although the plot is a little predictable in places."
    },
    {
      "rating": "8",
      "text": "I enjoy these movies a lot movie more than others. I don't love it but I like. It is the best Fantastic Beasts move in my opinion."
    },
    {
      "rating": "9",
      "text": "Excellent way to get back with the wizarding world after the pandemic!  Gorgeous visuals, dynamic script, funny moments and more.  I think the explanation of Credence's origin could be better, and it lacked flashbacks, Nagini disappeared without explanation, apart from that it was great!"
    },
    {
      "rating": "9",
      "text": "The movie is a great mix between the Fantastic Beasts and Grindelwald story. It is a watch if you love both of these in the previous movie. The story between Dumbledore and Grindelwald is so sad and so beautiful at the same time. This movie shows that their is still love from both sides. You also see that their is heartbreaks between the 2 lovers and that those people deal with it differently"
    },
    {
      "rating": "4",
      "text": "+Think they are doing a good job with Dumbledore overall-The whole fantastic beasts angle is completely shoehorned in and nonsensical, a baby animal decides the elections?-Uninteresting plotting and direction"
    },
    {
      "rating": "0",
      "text": "Another paper thin movie attempting to bank off the success of the original series"
    },
    {
      "rating": "4",
      "text": "Very slow and boring missing the magic you used to get with Harry Potter. Weird woke parts within 5mins to please a certain group so annoying. Mads was amazing but no reason to replace Johnny. Overall I hope this is the last of these!"
    },
    {
      "rating": "0",
      "text": "Worst movie in the whole Wizarding World universe.. borring scenario, new Grindelwald is a joke"
    },
    {
      "rating": "5",
      "text": "In The Crimes of Grindelwald I waited the whole film to see those crimes and they never appeared.This time in The Secrets of Dumbledore I kept waiting for those secrets, but they didn't show up either.I mean, there's a confirmation about a certain character in that family but that's it.As with its predecessor, it's become very clear that J.K. Rowling doesn't have enough material for this prequel saga and she's basically filling in the gaps with what she can.With this third instalment, the total absence of direction is the constant feature of what we are seeing on screen.With the exception of a more action-focused tone, a distinctly fascist flavor clearly inspired by our present day that is infused into the character of Gellert Grindelwald, and that Mads Mikkelsen playing him is a monumental improvement over Johnny Depp; Fantastic Beasts: The Secrets of Dumbledore is an improvement over its predecessor, but it's also another disappointing addition to the franchise of the Wizarding World that fails to capture the magic and grace that made the Harry Potter films so famous."
    },
    {
      "rating": "7",
      "text": "I think It’s better than its predecessor, It’s more entertaining and i enjoyed a lot the Harry Potter references."
    },
    {
      "rating": "1",
      "text": "boring and predictable bad writing and  worst and lazy ending to make an other parts from it"
    },
    {
      "rating": "1",
      "text": "If you are going into this as a long time fan of the Harry Potter series you will undoubtedly come out of it disappointed. This movie like all the fantastic beast movies fails to capture what was once great about JK Rowling's work. Even with what was clearly heavy attempts at nostalgia baiting its still a huge miss."
    },
    {
      "rating": "1",
      "text": "Horrifically boring film, ridiculous plot points and completely forced dialogue. Maybe JK should stick to books rather than writing screenplays because this was horrific. Coupled with all the real world issues with this series, just a poison pill of a franchise.Completely wasted the whole potential of a series about beasts, if they wanted a dumbledore prologue that should have been the series. Not cramming it in here. Each film has got progressively worse, god help the final two films.But I’m tapped out now, no more money wasted on this."
    },
    {
      "rating": "10",
      "text": "Fantastic Beast: The Secrets of Dumbledore was such a good movie. As much as I love Johnny Depp and totally support him, I feel like this role just wasn’t for him. When Johnny depp was playing the character it just didn’t feel real, he just looked to insane for it to look like Dumbledore actually fell for him. (If that makes sense). Mads Mikkelsen did a great job in portraying his character. Mads already had the kind of charm and look that the character needed, he didn’t have to change his whole appearance to look like the character aged up. I get that the character is supposed to have white hair but it makes more sense for the character to look older and not exactly how he is supposed to look. Anyways, I watched this movie with some of my friends and we totally enjoyed it. It had such a good plot and you would never get bored. The movie had a bit of everything romance, adventure, thrill, ect. I 100% recommend it and I’m sure you’ll have a great time!"
    },
    {
      "rating": "7",
      "text": "This movie portrays a bit more magic than the last, though it feels as though something is missing. Although Johnny Depp was asked to resign, Mads Mikkelsen did a wonderful job playing Gellert Grindelwald."
    },
    {
      "rating": "10",
      "text": "So far the best one of the three Fantastic Beasts films, and great movie over all!Funny moments, good love story, a bit of political and social matters of wizarding world, fantastic actors and intriguing storyline, enjoyable for basically anyone in my opinion (even if you are not a big fan of the genre).Hopefully they will continue with the other two movies to close the saga."
    },
    {
      "rating": "10",
      "text": "This movie touched me inexpressibly. Definitely my favorite one not just in the Fantastic Beasts franchise, but in the entire HP world (and I say it as a big HP fan)! It leaves you with something in your heart when you go out from the cinema. It is at the same time adventurous and deeply emotional, with powerful scenes, beautiful settings, funny moments, wonderful characters, but, first of all, a strong focus on the depths of human heart and the struggles which can take place in it. It is a movie about the choice between what we desire and what we have to do. The tormented love story between Dumbledore and Grindelwald, lying at the core of the movie, is poetic and heartbreaking, with the taste of a Greek tragedy. Jude Law and Mad Mikelsen are gigantic in their performances and have an incredibile chemistry together.They seem to have been born to play these two unhappy, torn lovers/foes. Watched the movie twice and I will soon watch it a third time. I warmly raccomend it! Don't let you  be dissuaded by negative critics and Rowling haters.  Go and watch this movie...and judge by yourselves!"
    },
    {
      "rating": "1",
      "text": "The movie is about nothing. Loss of money and two hours of life. Instead of development of the characters and answering the audience's questions - this movie is a spit in the face of the audience."
    },
    {
      "rating": "0",
      "text": "I am a huge Harry Potter and fantastic beasts (especially the 2. one) fan but this movie was a huge disappointment. It felt dull and unexciting. I lost any emotional connection to the characters and the movie was just filled with too much unnecessary comedy scenes. Not for me"
    },
    {
      "rating": "1",
      "text": "How they think they can keep stretching this out for more movies i have no idea. Wildy mediocre...Also should have kept Johnny Depp.. f*ck cancel culture."
    },
    {
      "rating": "0",
      "text": "Absolutely farcical.First remove Depp and replace with, quite frankly, a worse actor for the role.Then you go and mess with dumbledore. WB have taken the franchise and just thrown it at the wall and thrown out the remains to the audience.The film was slow and underwhelming with next to no magic....... you know the thing people watch a HP movie for. All in all I hope that there's been a mass boycott after WB took decisions based on poor decisions and they will look at redoing it with more energy and the right actors"
    },
    {
      "rating": "3",
      "text": "Oh no :( it makes no sense, its boring and the grand finale is none. What a shame."
    },
    {
      "rating": "7",
      "text": "Really enjoyed this, lots of heart and answers! I think Mads was a great choice."
    },
    {
      "rating": "10",
      "text": "this movie better then any film in this univers. good flashbacks good storyline stc."
    },
    {
      "rating": "0",
      "text": "No points for the another woke project :) producers these days don't care about quality as long as \"the message\" is delivered."
    },
    {
      "rating": "9",
      "text": "Vraiment j'ai passé un excellent moment devant le film. Certains détails pourraient être améliorés mais dans l'ensemble c'est bien."
    },
    {
      "rating": "10",
      "text": "I have never understood why so much hate to this movies. The have very high production values."
    },
    {
      "rating": "1",
      "text": "Another company ruining an authors work, really wish hollywood would stop ruining good shows/movies. Instead they will continue their double standards while pandering to the CCP. Really wish we would have gotten the true movie - crimes of grindelwald with johnnie debt"
    },
    {
      "rating": "3",
      "text": "In summary, this is one wizarding movie that should've been (made and) left as a novel instead. What a borefest it must be to those who saw it in the theaters!The cast probably did their best, but the plot really couldn't be helped."
    },
    {
      "rating": "8",
      "text": "I would judge this to be The strongest entry in the Fantastic Beasts series so far!"
    },
    {
      "rating": "0",
      "text": "The name speaks for itself: the situation Dumb indeed because you cannot find real Grindelwald anywhere."
    },
    {
      "rating": "1",
      "text": "One of the most spineless attempts at storytelling I've ever had the displeasure to watch. I mainly wanted to write this review to coin the term \"Vote Goat\" in reference to the little creature who decides the electoral process based on who it deems pure of heart. Dear god help us if a character written by J.K. Rowling is the one judging people's characters. The refusal to bring back Johnny Depp after the hell he's been through is very telling of the absolute horror show that is J.K.'s empty shell of a heart.Also, the Dumbledore/ Grindelvold dynamic is literally just Professor X and Magneto. I know that old crone watched those movies and then had an unrelated dream in which she invented it, but it's not subtle, nor is it remotely even as well fleshed out.Also also, they added the Mirror Dimension from Doctor Strange, and I know that's where the idea came from, because they cast the bad guy from Doctor Strange in the movie.Also also also, the previous movie ended on a cliffhanger where the bad guy wants to, in a roundabout way, prevent the holocaust. So, the entire subtext of this film includes our wacky heroes actively trying to stop the bad guy from preventing the holocaust. Just a fun note that is also very telling of how much of a garbage human being Ms. Rowling is. If you need a reminder, she's the same lady who wrote a slave race into her children's books and said it was okay to leave them enslaved because they \"liked it.\"Even worse than Morbius."
    },
    {
      "rating": "10",
      "text": "Honestly my favourite 1 hope we get more in the series want to see the wizarding war"
    },
    {
      "rating": "9",
      "text": "A pretty solid movie with plenty of action and a good story line. Anyone saying it's confusing is clearly missing the point!"
    },
    {
      "rating": "3",
      "text": "The movie has plot issues and continues with the main problems of the fantastic beasts franchise. Mads Mikklesen is good as Grindelwald, and Jude Law is good as dumbledore but they can’t carry this movie on their own."
    },
    {
      "rating": "4",
      "text": "Man, they killed so many magical Bambis in this movie.While not as depressing and miserable as the last movie, the magic of these movies are quickly fading. These movies need a brand new director with a fresh vision.Jude Law and Mads Mikkelsen were good together, so at least there's that."
    },
    {
      "rating": "10",
      "text": "this movie is excellent... it gets hate for no reason.. yes i get it j depp is gone but the actor who took is place is amazing and i cant wait to get even more... loved it and its one of my favorite harry potter films now"
    },
    {
      "rating": "4",
      "text": "The ending to this film is incredibly weak and disappointing.  The side plots are dull and the characters aren't all that interesting."
    },
    {
      "rating": "10",
      "text": "So far it’s the Best of the Fantastic Beasts, that’s saying a lot because I love them all so far."
    },
    {
      "rating": "0",
      "text": "I disliked this movie so much, it didn't make sense and I couldn't figure out what was going on and it was so slow. Fantastic Beasts has nothing on Harry Potter, Harry Potter is on a completely different level and is truly amazing. This film was absolutely hopeless."
    },
    {
      "rating": "10",
      "text": "I can’t image a grindelwald without Mads Mikkelsen, his performa man e was great. Vfx and original score are beautiful. The final fight was entertaining. The secret of dumbledore is good (he is gay). The chemistry between the actors is beautiful. Bunty is the central part of this movie. We probably don’t see ezra miller again"
    },
    {
      "rating": "9",
      "text": "I love this movie and I don't know why it's so hated. It's very exciting and funny."
    },
    {
      "rating": "9",
      "text": "Molto piacevole, risponde ai quesiti sollevati dal capitolo precedente. Ambientazioni come sempre spettacolari. Ha scene di bellezza fuori dal comune."
    },
    {
      "rating": "10",
      "text": "Nice movie, must watch. But I suggest that they must add some verbal spells to gain more intensity to some action scenes."
    }
  ],
  "recommendations": [
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "the_prestige",
    "terminator_genisys",
    "black_panther_wakanda_forever",
    "x_men_apocalypse",
    "the_craft_legacy",
    "tomorrowland",
    "bumblebee",
    "thor_ragnarok",
    "avengers_age_of_ultron",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "glass",
    "eternals",
    "pirates_of_the_caribbean_on_stranger_tides",
    "twelve_monkeys",
    "maleficent_mistress_of_evil",
    "man_of_steel",
    "maleficent",
    "thor",
    "the_karate_kid_part_ii",
    "incredibles_2",
    "back_to_the_future_part_ii",
    "batman_v_superman_dawn_of_justice",
    "the_adjustment_bureau",
    "thor_the_dark_world"
  ]
}