{
  "id": 138,
  "title": "Fatherhood",
  "starring": [
    "Kevin Hart",
    "Melody Hurd"
  ],
  "runtime": 109,
  "genre": [
    "Drama",
    "Comedy"
  ],
  "description": "A widowed new dad copes with doubts, fears, heartache and dirty diapers as he sets out to raise his daughter on his own. Inspired by a true story.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pR2fzm82fl0giommpo310LBOMbV.jpg",
  "categories": {
    "plot": 6.3125,
    "acting": 7.125,
    "ending": 6.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.285714285714286,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Some reviewers say it's sweet and emotional, and certainly those elements exist, but you'll only get to enjoy them, if you overlook the predictable and generic formula of its narrative."
    },
    {
      "rating": "8",
      "text": "A film that is certainly not unique, but does manage to strike the right chords. The story builds up slowly and takes the time to develop the arcs of the main characters. Kevin Hart acts excellently and conveys the emotions very well to the viewer. At the end it's a tearjerker with heartwarming moments that was worth to watch."
    },
    {
      "rating": "10",
      "text": "Hands down one of the best films of Kevin Hart, This movie is so heartwarming and some scenes are funny"
    },
    {
      "rating": "9",
      "text": "Fatherhood is a much needed and appreciated film in an age of cynicism and lost faith. I applaud the courage of everyone who made this film especially given the perceived redundancy and disposability of fathers in society today. Kevin Hart gives the performance of a lifetime. Never underestimate a performer, especially one who was previously typecast into comedic roles as the butt of jokes, often due to his height. I strongly feel he should be a contender on the award circuit. Kevin gave a nuanced and powerful performance as a father dealing with unimaginable odds and overwhelming grief. You can relate to his journey as he goes through various stages of grief and acceptance, tempered with hope and heart, and above all the courage to change and listen. It may come as a shock to many, but fathers are capable of deep emotion and connection to their children as depicted in this film. Melody Hurd gives a stunning performance as a precocious and courageous child, willing to challenge herself and above all guide her father to grow. She shows a wisdom beyond her years and I expect great things from this talented little actress.As expected Alfre Woddard delivers a powerful and moving rendition of a grieving grandmother, tempered with her signature gravitas. Indeed the entire cast is excellent and really rounds out the movie, each playing their role as a set of hands holding up the grieving, overwhelmed father. The tragedy depicted in this film had particular poignance and relevance with me on a personal level as I had a brush with a similar incident just recently in my life. I remember all too well those fateful days when as a father I felt crushed with the magnitude of responsibility before me, but the Mercy of God delivered. Fatherhood is an essential film and strongly recommended viewing. A good parent is a good parent, period. And a good parent shows courage and determination beyond the expectations of everyone else, even themselves."
    },
    {
      "rating": "7",
      "text": "This is a cute, sweet movie that does its best of trying to capture the endless struggles of what it’s like to raise a child as an early widower in an hour and 50 minutes.  Anyone that disagrees can honestly go f*€% themselves."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "2",
      "text": "i shall never watch a kevin hart show again. i thought central intelligence was bad. HE IS NOT FUNNY AT ALL. and when u try to ask him to do a serious drama, it's horrible. trying to be pathetic funny is excruciating.moreover the script and storyline is so dated. the new 'girl'looked so ugly and like a giant beside the minute hart. the only character worth watching is the cute daughter. but her cute smirk can only last so long. can't wait for the show to finish just to tick off our to do list in our bored lockdown existense."
    },
    {
      "rating": "6",
      "text": "Kevin Hart dials back his typical fast-talking manic personality for a chance at drama (plus some lite comedy). His character’s wife dies shortly after their baby is born and he faces life as a single father. The film is front-loaded with tragedy, but brightens up after a while. Most of the comic moments are wisely assigned to supporting cast members, leaving Hart as the straight man. While the story follows a familiar trajectory, it’s made more enjoyable by Hart’s sensitive performance, along with the always-wonderful Alfre Woodard (as the unsure mother in law) and cute, charming Melody Hurd (as the daughter). Overall, it’s a sweet little family drama with Hart doing a commendable job."
    },
    {
      "rating": "8",
      "text": "Pleasantly surprised that this movie isn't a comedy. I thought it was a comedy going into it but it wasn't. I related to this movie a lot (almost, at least) so I cried more than I ever had during any move, except for maybe Flight of the Navigator. Kevin Hart did a great job as a serious actor. I didn't think he had it in him but he does."
    },
    {
      "rating": "6",
      "text": "Really impressed by Kevin Hart here! Obviously it’s not Oscar-worthy stuff but I think it goes to show he can handle these more serious dramedies like a Jack Black or Will Ferrell"
    },
    {
      "rating": "8",
      "text": "Being a dad is not an easy task, especially if you do it alone. Kevin Hart in a sober role, without vulgar humor, playing a widowed dad will not be the scoop of the year but only the biggest idiot in the world would deny that that role is touching. For an unpretentious weekend."
    },
    {
      "rating": "5",
      "text": "I rescue the good role of Kevin Hart in Fatherhood, however I do not omit the low quality of the comedy, and then force a dramatic final half hour. Surprised that I passed PG-13 rating considering most of the jokes."
    },
    {
      "rating": "10",
      "text": "Sad truth that really happen in real life, and Fatherhood captured it beautifully well done, with Kevin Hart incredible performance, Fatherhood was amazing, i highly recommended."
    },
    {
      "rating": "6",
      "text": "Fatherhood is a simple, beautiful, and relatable movie. It's a family drama with a predictable plot but it's a cute story. It's mostly drama with comedy and emotions. Kevin Hart performed the character of a single young parent very well.  We have seen him doing comedy but he just rocked the character of an emotional parent who is concerned about her daughter's life and he is trying hard to balance both his professional life and family life.I enjoyed the chemistry between father and daughter. There wasn't anything surprising in this movie. It didn't capture my attention but it was indeed a sweet story."
    },
    {
      "rating": "10",
      "text": "I'm a widow and solo mom. This movie was so realistic and heart-wrenching. It brought me to tears repeatedly. There were moments that I forgot Kevin Hart was acting, this was so spot-on, and beautifully done. Not a flaw in the movie, and it easily thrust Kevin Hart into position as my favorite actor. This was amazing."
    },
    {
      "rating": "10",
      "text": "i'm not gonna lie, this is one of the best movies if not the best that Kevin Hart act in, i'm not a big fan of drama but this movie is not like any drama movie you'd watchi recommend everyone to watch it with someone or a family it's totally worth your time"
    },
    {
      "rating": "1",
      "text": "This movie should have been titled, \"Retread\" or, \"A Thief of Time.\"   There was absolutely nothing original about this. To say it was boring would be doing this film an injustice. It was the next level REM sleep tedium - to the nth degree. Half way through the movie I was rooting for the nun. How did this get the green light to be made? There should have been a disclaimer at the beginning of this movie, \"This film contains no novel ideas or thoughts - watch at your own discretion.\" If there is any sequel made of this movie I'm going to kill myself and move to France - that's how bad this movie was. I'm going to do it in that order. What was the screenwriter thinking? Let's play it so safe we'll put everyone to sleep, including all insomniacs. Just when you thought it was safe to go back to the movies, something like this comes along and you wish the pandemic was followed by a plague. Let's all agree, the next time a movie is made, it should have a point and not just rehash every other \"single-parent\" movie that's ever been made. As Americans we deserve better than this."
    },
    {
      "rating": "10",
      "text": "Metacritic is garbage. You'd have to have no would to give this movie a rating of less than 7. Your just a bunch of grumpy used to be hipsters giving bad foreign movies the best reviews."
    },
    {
      "rating": "10",
      "text": "I’m not even a father, but I found this movie to be quite touching. Kevin Hart did a fantastic job of playing a semi-serious role. I teared up more times than I’d like to admit."
    },
    {
      "rating": "6",
      "text": "The movie never balances the tone well. One moment there are some classic Kevin Hart humour, like the scene where young Maddy pukes on Matt and another guy on the plane. Another moment sees Matt and Maddy have heart to Hart (sorry) conversations. It's not really comedy-drama, more like drama, then comedy, and drama again."
    },
    {
      "rating": "10",
      "text": "I don't get it.I just don't get how a movie like this exists.Kevin Hart is supposed to be a comedian, but yet he ended up in this beautiful, emotional, somewhat comedic magnum opus. To be honest with you, I thought Netflix was dying when it released the infamous \"Cuties\", as well as shutting down multiple cartoons because they're all **** ****But this movie...is legendary, with an interesting plot and phenomenal acting.Don't waste any time trying to watch this movie, because every single part about oozes pure amazement."
    }
  ]
}