{"id": 1253, "title": "Fear of Rain", "starring": ["Madison Iseman", "Israel Broussard"], "runtime": 109, "genre": ["Thriller", "Horror", "Drama"], "description": "A teenage girl living with schizophrenia begins to suspect her neighbor has kidnapped a child. Her parents try desperately to help her live a normal life, without exposing their own tragic secrets, and the only person who believes her is Caleb – a boy she isn’t even sure exists.", "releaseYear": "2021", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/5hmaACPJfI2M0v38DeltW3dSggT.jpg", "categories": {"plot": 5.5, "acting": 6.0, "ending": 6.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "This was a superb movie in ohhh so many ways.  Won’t go into any of the details here. After watching trailer for 30 seconds we turned it off and went to movie cold last night.  That was a good decision.  Check it out. You won’t be disappointed."}, {"rating": "6", "text": "A predictable, yet still somewhat entertaining story. Don't expect it to be a horror movie as the only \"scary\" parts were mostly the cheap jump scares. The acting was up and down at times, but I did think Madison Iseman was solid throughout. As I said before, the plot is fairly predictable, but it does keep you guessing at times. However, the ending was probably the weakest part of the whole story. Overall, it's a nice movie to watch only when there is nothing else on TV."}, {"rating": "7", "text": "I was pleasantly surprised. This was a bit better than I thought it would be. Great performances and portrayal of what this poor girl was going through. The ending was a bit confusing and it was weird how it mysteriously turned from night time to daytime, but otherwise it was alright."}, {"rating": "5", "text": "Though it somewhat holds your attention and can occasionally succeed in being an entertaining film, I think saying that this movie is above average is being generous. The story is unsurprisingly incredibly predictable. The acting is overall serviceable for the most part but it is always obvious that the people being filmed are just actors and not real people which always takes away a lot from a movie. There's nothing scary despite it supposedly being a horror movie, too. If you're really into this type of film, I'd say give it a try, but for someone looking for a good movie for the average person, this definitely ain't it, chief."}], "recommendations": ["house_at_the_end_of_the_street", "dead_silence", "disturbia", "dark_skies", "better_watch_out", "marrowbone", "insidious_chapter_2", "devil", "shut_in", "the_eye", "hereditary", "annabelle", "contraband", "the_mist", "a_perfect_getaway", "insidious", "underworld_evolution", "malignant", "countdown", "old", "the_happening", "chernobyl_diaries", "the_possession", "summer_of_84", "what_lies_below"]}