{
  "id": 2784,
  "title": "Fearless",
  "starring": [
    "Yara Shahidi",
    "Gabrielle Union"
  ],
  "runtime": 89,
  "genre": [
    "Family",
    "Animation",
    "Comedy"
  ],
  "description": "A teen gamer is forced to level up to full-time babysitter when his favorite video game drops three superpowered infants from space into his backyard.",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5oQJ6HeNGWnEtP9Qyt5IZjuKI7j.jpg",
  "categories": {
    "plot": 7.285714285714286,
    "acting": 7.416666666666667,
    "ending": 8.375,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 6.0,
    "action": 7.774193548387097
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Awesome. Teaches you a lot about life."
    },
    {
      "rating": "2",
      "text": "I cant believe I paid to watch this movie."
    },
    {
      "rating": "7",
      "text": "If you know Jet Li only from his American films, you're in for a shock. He's a Chatty Cathy. It's debatable if Li is more effective when he lets his fists do the talking, but watching him speak in his native language is a revelation; he's a fighting machine, and an actor. Although \"Fearless\" bears a superficial resemblance to \"House of Flying Daggers\", this film has a moral center in which Clint Eastwood's \"Unforgiven\" sort of echoes(another echo: Elvis Presley), as if the filmmaker is doing the demythologizing thing for martial arts films(as Eastwood did for the western). Like \"Unforgiven\", the anti-hero returns as a hero when it's time to fight again. During the obligatory climactic altercation, the violence is senseless, but it's performed with a sense of honor and righteousness. If the action didn't take place in such a formal setting, the film's message might've registered stronger."
    },
    {
      "rating": "10",
      "text": "Wow. That is all I can say. Wow. I am spechless to this movies incredible talent."
    },
    {
      "rating": "5",
      "text": "The fight scenes are entertaining, but the story being told is too by-the-numbers, and the movie also glosses over, or short-changes too many key elements of the story. Also, the ending is a bit much."
    },
    {
      "rating": "7",
      "text": "At first I thought it was just another 'fight, fight and fight some more' film, but it take a more artful turn at the midpoint. Not as emotionally powerful as some other genre films, like HERO, but a good film with a respectable message about rejection of violence."
    },
    {
      "rating": "10",
      "text": "I would have to say this was Jet Li's best movie."
    },
    {
      "rating": "10",
      "text": "The best movie ever made. No movie has ever been so captivating, so moving, so satisfying and yet so graceful, beautiful and action packed with only the best martial arts, ever."
    },
    {
      "rating": "10",
      "text": "The war is on. Will any movie ever be this amazing. No, not even godfather can grace in this new genre of unbelievable independence. This movie is downright outstanding in every possible aspect."
    },
    {
      "rating": "9",
      "text": "Good sendoff. Storyline can be cheesy at times but everything comes together in the end. Another good hero story."
    },
    {
      "rating": "10",
      "text": "A good film, good fight scenes, and I liked every part of it. Someone said the ending could be better, first things first \"This is based on a True story\". They can't go changing what happened in the real legend even though is loosely based on it, the real person died at the end due to poison and is a key part to what has happened. The proper Chinese title of the film Huo Yuan Jia (not fearless) is the actual name of the real legend happened in china and the martial art school he made still stands in china. Gabor in his review he didnt like Crouching Tider style films. Well one Chinese kung fu films has always been made in that way for decades is the way usually done and two Crouching Tiger's style is completely different style to Fearless'. If you watch enough asian films and drama you will understand what I mean."
    },
    {
      "rating": "8",
      "text": "Yes this movie is very good...I thought it was rather excellent until I realized that it lacked the proper closing. If they came up with a better ending than it would have been the best martial arts movie hands down!"
    },
    {
      "rating": "8",
      "text": "It's always nice to see a good action movie, which doesn't bore the audience with stupidity. And it's always nice to remind people of why the seeking of inner peace is so important."
    },
    {
      "rating": "10",
      "text": "This movie is simply beautiful. Most people don't like it because it's not \"dubbed\" with English voices. The fight scenes are intense and the ending was unbelievable. Very great movie. I recommend it to all audiences. Gamespot user: Hinata237"
    },
    {
      "rating": "10",
      "text": "The greatest movie of all time, hands down supurb. No movie has ever had such a variety of plot. With action, with acting, with incredible flowing perfection. This movie is unbelivable. It is what going to the movies is all about. It could possibly change your life. Jet Li is stunning and Nakamura Shido stands alone as one of the best acting directors of all time."
    },
    {
      "rating": "10",
      "text": "One of the best martial arts movies ever. The story of Huo Yuanjia is dramatic and moving, while Yuen Wo Ping's choreography is exciting and fast-paced."
    },
    {
      "rating": "8",
      "text": "Entertaining and worth the $9 to see the movie. My wife wasn't that thrilled with the violence. Great fight scenes if thats your bag. Subtitles but not a whole lot of dialogue. Jet Li is a remarkable athlete and does a good job on the acting as well."
    },
    {
      "rating": "6",
      "text": "Not bad... but I expected better... I wanted another 'Hero'... I would have loved a low-budget action-packed Ong Bak-like... instead I got something in between, just good enough to be entertained."
    },
    {
      "rating": "8",
      "text": "Never reaches the level of masterpieces like \"Crouching Tiger\", \"Hero\", and \"House of Flying Daggers\", but is in the same ballpark. Features several memorable fights and mixes some authentic Wushu philosophy in to create a very satisfying film for any martial arts fan."
    },
    {
      "rating": "7",
      "text": "Decent swan song for Jet Li's wushu film career. The fighting scenes were very good but I would've hoped to put the fighting sequences in the middle of the moves. My concern is that the acting still needs a bit of work."
    },
    {
      "rating": "9",
      "text": "A great visual action movie with minimal special affects & wires. Ranks within the top 3 martial arts movies produced, even though I'm not a Jet Li fan. The action shots are mostly realistic and a good performance for the actors. Great movie to watch with the boys."
    },
    {
      "rating": "3",
      "text": "Loaded with just about every asian epic cliche. The plot is really just ten other movie compacted. Can't we bring something else over seas for a change? I know for a fact good movies are made in asia, but all we get are these Crouching Tiger formula followers. Oh, and Crouching Tiger sucked."
    },
    {
      "rating": "9",
      "text": "One more usual movie with martial arts. That was my first thought about the film but I was completely wrong. This film is much more different than the the rest of this kind. It has a lot of surprises and a big value of different scenes. Furthermore the end of the movie completes the hole plot with a very interersting way!"
    },
    {
      "rating": "9",
      "text": "Just loved it. Very good action scenes and story."
    },
    {
      "rating": "9",
      "text": "Very good mix of Action and Ethics. A true superhero."
    },
    {
      "rating": "10",
      "text": "Dang! this movie was tight. the scene in the resturant was absolutely sick and everything else was tight too."
    },
    {
      "rating": "10",
      "text": "It was good. not great, but just good."
    },
    {
      "rating": "8",
      "text": "It's everything you would expect from Jet Li, and yes, it is cliche but good nonetheless. I definitely recommend seeing this movie if you like martial arts films."
    },
    {
      "rating": "9",
      "text": "I watched the director's cut (Which has around an extra 20 minutes of footage I think) of this and thought it was excellent, wasn't exactly fight after fight throughout the whole movie like I first thought which I liked, solid plot and excellent acting throughout, lasted two hours twenty minutes but I loved every bit of it, just one of those movies where you just sat back and let the movie take you in and wanted it to keep on going, truly stunning, I have watched movies like Hero and House of Flying Daggers but this seemed to be different in it's 'feel' and was overall better in my opinion, it just came across as much more beautiful and meaningful, if this really is Jet Li's final Martial Arts movie then it is truly an excellent one to go out on."
    },
    {
      "rating": "6",
      "text": "Jet Li's Fearless: 6 out of 10: This movie is a true near miss. For most of its running time it is action packed with handsome photography and gritty realistic fight scenes. To bad a too predictable by half story and Jet Li's performance hold it back from greatness.\r What the move does right however it does very well indeed. The fight scenes are extremely well choreographed and differ in tone and skill from each other. Except for the final fight they are all very satisfying. They range from an acrophobic set piece early on above a busy city square to a humorous match between Li and a boxer that reminds one of Rocky's fight against Hulk Hogan in Rocky 3.\r There is no obvious wire work or CGI involved this is the real deal. Had the movie stuck with it's strengths it would have been much better off.\r Unfortunately halfway through the film Jet Li's character (A loosely interpreted version of a real historical Chinese patriot) decides to forgo fighting for a life in an idyllic rice patty. Like the picture perfect Japanese village in the Last Samurai the rice patty is an idolized place with supermodel blind girls and hobbits. (Okay I made the hobbits part up but try to watch the scenes and not think of Middle Earth.) Jet Li's acting in the transformation scenes is wanting and his costars (especially best friend Dong Yong) steal every scene they are in. It is hard to get emotionally connected with the character (Who goes from brash youth to wise old man after a couple of rice plantings with little transformation and no gray area or shadings of personality. Both characterizations are extremely broad and simply seem two different people.) This leads to a surprisingly sterile finale. I simply couldn't care about the character or his cause. Though the story is more fleshed out than say in Hero the character is simply to broad to identify with as an individual. That said I did love the fight scenes."
    },
    {
      "rating": "10",
      "text": "Jet Li's Fearless is a true martial arts masterpiece. The story is awesome and the fighting scenes are some of the best I have ever seen. There are also three versions of the movie on one blu ray disc. Theatrical version, Unrated version and the Director's Cut version. The definitive version of this movie is the Director's Cut because it adds 35 minutes of extra footage to the movie. And the extra footage makes an epic and amazing movie even better. This is my favourite Jet Li movie ever."
    }
  ],
  "recommendations": [
    "shang_chi_and_the_legend_of_the_ten_rings",
    "the_one",
    "the_forbidden_kingdom",
    "ong_bak_2",
    "ninja_assassin",
    "top_gun",
    "john_wick",
    "gemini_man",
    "john_wick_chapter_3_parabellum",
    "blade_of_the_47_ronin",
    "troy",
    "abraham_lincoln_vampire_hunter",
    "kung_fu_panda_2",
    "john_wick_chapter_2",
    "haywire",
    "300",
    "300_rise_of_an_empire",
    "rocky",
    "top_gun_maverick",
    "the_foreigner",
    "jiu_jitsu",
    "avengers_age_of_ultron",
    "king_arthur_legend_of_the_sword",
    "hercules",
    "hardcore_henry"
  ]
}