{
  "id": 3360,
  "title": "Fear and Loathing in Las Vegas",
  "starring": [
    "Johnny Depp",
    "Benicio del Toro"
  ],
  "runtime": 118,
  "genre": [
    "Adventure",
    "Drama",
    "Comedy"
  ],
  "description": "Raoul Duke and his attorney Dr. Gonzo drive a red convertible across the Mojave desert to Las Vegas with a suitcase full of drugs to cover a motorcycle race. As their consumption of drugs increases at an alarming rate, the stoned duo trash their hotel room and fear legal repercussions. Duke begins to drive back to L.A., but after an odd run-in with a cop, he returns to Sin City and continues his wild drug binge.",
  "releaseYear": "1998",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gFo5UrXQaVDQ9Vc1mmsWZNRt2aQ.jpg",
  "categories": {
    "plot": 5.461538461538462,
    "acting": 7.8125,
    "ending": 4.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.666666666666667,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Meaningful, thoughtful, and excellently crafted. Movies like this help us explore ourselves and reality we create. This one additionally make this in a very entertaining way. If only You can keep up with the movie... Just like with Natural Born Killers it's best to watch it couple times."
    },
    {
      "rating": "10",
      "text": "This is a very good film the reviews do not do it justice. It is not a stoner film it is a unique, funny, provocative and disturbing view of America, and with Terry Gilliam unique directorial vision it's a powerhouse film."
    },
    {
      "rating": "8",
      "text": "An excellent movie IMHO, but I'm really not here to discuss this. I love this film and I really could not care less what some others have said about it. I would, however, like to point out the fact that whenever someone makes a spelling or grammatical error that supports the movie they are insulted by being called \"druggies that can't tie their own shoelaces\". Pity. And Mark B., I find it rather interesting that you caught marvellous, but failed to catch such atrocities as \"congrajulations\" and \"unphathomable\". Really, top notch work."
    },
    {
      "rating": "10",
      "text": "I love this movie. It's funny and provoking and I can imagine, it's just what Mr. Thompson had in mind when he was writing his novel."
    },
    {
      "rating": "8",
      "text": "Unique, addictive movie that isn't quite for everyone. The first half shines with great performances and oddball humor. The second half doesn't quite have the same qualities and might leave people feeling rather uneasy, but it does have it's moments. Mark B. seems like the kind of person who would stand to argue that there's only one way to spell \"color.\""
    },
    {
      "rating": "10",
      "text": "An amazing film. Incredible acting, suitably psychedelic visuals and, surprisingly, hilarious and profound all at the same time."
    },
    {
      "rating": "9",
      "text": "I am not a drug addict, in fact, at 35, I have never once partook in any unprescribed narcotic. I am not a fan of drunks, in fact I tend to leave parties early to avoid them. A huge fan of Depp (this is his best ever, if not most popular, performance) and of Hunter Thompson (an irrepressible writer of modern literature), I felt I was adeptly escorted into a world of excess and depravity I could never, in my sobriety, have entered on my own. Depp animates Thompson's paranoid and hilariously caustic commentary on the socially acceptable 'swine' and their equally, if acceptable, excesses. I bought the ticket, and LOVED the ride!"
    },
    {
      "rating": "10",
      "text": "Hunter S Thompson's stunning book is marvelously captured on screen. A great performance by Johnny Depp. A great commentary on American life, past, present and future."
    },
    {
      "rating": "7",
      "text": "Could never match the book, what that would be be impossible. Terrys' baby is vastly under appreciated. (I'd better check my spellings now since a schoolteacher below believes that the only way have a valuable opinion is be able to spell. Whatever - weren't you at the police convention in Vegas in 1971?)"
    },
    {
      "rating": "10",
      "text": "Pure quality, a perfect intimidation of the great doctor!"
    },
    {
      "rating": "9",
      "text": "Based off my favorite book, directed by one of my favorite directors, starring on of my favorite actors, what could go wrong? Very little! The film is incredibly faithful to the book and in my opinion one of the great underrated movies. Word of advice, if your planning on watching the film READ THE BOOK FIRST."
    },
    {
      "rating": "8",
      "text": "A surprisingly accurate adaptation of Hunter S. Thompson's odyssey of self-revelation, self-destruction and the American Dream. In fact, I'd say the movie is better than the book because Gilliam's visuals gives a sensory overload that really packs the in(s)anity into form. Thankfully, the hilarious antics of Depp and del Toro really follow suit."
    },
    {
      "rating": "8",
      "text": "This film is EXTREMELY underrated on this metascore thing. But not surpirsing-people usually really like this movie or are incredibily irritated with it. Obviously the visuals take you by surprising which will add to your experience or make you ill. Additionally, the dialog is a bit disjointed. But the two elements together define this film. Definite cult classic."
    },
    {
      "rating": "6",
      "text": "I admit, I almost turned this one off early on into the film, but I am glad I made it all the way through. The directing really makes you feel as if you are under the influence and really puts you into the mindset of Duke (Johnny Depp's character). As for the acting, it was quite good as well and Depp really played the role of the constantly under the influence writer very well. Only gripes were the utter lack of character development, which certainly hurts. The seemingly all over the place plot would normally be a gripe of mine as well, but in a film like this, it certainly makes a ton of sense."
    },
    {
      "rating": "5",
      "text": "As in typical Terry Gilliam fashion, \"Fear And Loathing In Las Vegas\" is rife with provocative imagery and creative camera work, but with that you also end up running into the trade-off of a typical Gilliam work -- if you're a more mainstream-minded moviegoer with easygoing sensibilities, you're going to feel a bit alienated by all of the weirdness. That's not to say this is unwatchable. In fact, it's far from it. As each -- admittedly episodic -- scene goes by, you as an audience member feel as though there's always some sort of concerted effort being placed into doing something new; some different kind of framing, movement, color palette, or effect that'll make things interesting. There's at least that. Beyond this, though, it seems the film represents more of a treat for those who are fans of the novel and the larger-than-life man behind it, rather than plain ol' vanilla-loving normies like me. But that's not to say it wasn't at least worth a look."
    },
    {
      "rating": "8",
      "text": "Funny, psychedelic, sometimes a mess, but interesting enough to keep you in this weird trip through the movie. Hard to watch, but nevertheless, one of the movies you just have to give it a try. and in the end there are two possible outcomes: you either love it or you hate it."
    },
    {
      "rating": "10",
      "text": "simply amazing. watched so many times and it still gives me joy. i suspect only ones that dont like it, are the ones that are 100% against drug use. and to those i say, it clearly shows the bad side of bad trips that are results of overuse as well, and in no way glorifies it after all. movie has a massive points on many levels, just not all can spot them apparently."
    },
    {
      "rating": "8",
      "text": "Bottom line: Well done and very trippy movie.\r Fear and Loathing in Las Vegas is the story about journalist Raoul Duke and his attorney, Dr. Gonzo. Duke is on an assignment to report on a big motorcycle race held outside of Las Vegas. The two decide to make the trip a drug fueled journey to search for the American Dream.\r Fear and Loathing in Las Vegas is the adaptation of the novel of the same name by Hunter S. Thompson. Thompson, if you aren’t familiar, was the Rolling Stone journalist responsible for inventing “Gonzo Journalism” which focuses on the experience of an event rather than event itself as in the case of traditional journalism. The product of Gonzo journalism is something of a stream of consciousness: half fact, half fiction.\r This is a really rather grotesque movie and, quite honestly, I didn’t really like it. At the same time, it was quite a good movie. That sounds contradictory. If it was a pretty good movie, why wouldn’t I like it? Well, the guys in Fear and Loathing in Las Vegas are taking an obscene amount of drugs. It’s a trip that might very well kill them. It isn’t a happy experience and the movie illustrates that well particularly through the cinematography.\r The acting in this film is really good. I was initially turned off because I saw Johnny Depp acting like Captain Jack Sparrow or the Mad Hatter or Tonto and I for one am sick of drunken Keith Richards. But this is the first movie that he ever acted this way. With that in mind, I’ll let it pass. And after watching some interviews with Hunter S. Thompson, I found Depp’s impression spot on. Benecio Del Toro’s performance as Dr. Gonzo is stellar. The pair jump between the effects of the drugs seamlessly as naturally as if one drug wears off to be replaced by another.\r Throughout Fear and Loathing in Las Vegas we never really know what is true and what is a drug induced hallucination. You can say this type of thing about lot’s of movies but here it transcends the movie itself. When I said that Thompson’s work is half fact and half fiction, I really meant that we can’t really take very much of it as “fact”. I always thought Fear and Loathing was about Hunter S. Thompson and his friend going to Vegas but, really, it is about the invented character, Duke, going to Vegas. I wasn’t particularly familiar with Hunter S. Thompson so I watched a 1970’s or ‘80’s BBC documentary about him. The documentary maker, like so many of Thompson’s fans, confused Thompson with Duke. The filmmaker even took Thompson the Vegas hoping to see the cult hero in action. Thompson then spoke about this tendency. When he is invited to speak at a university, are they hoping to hear Raoul Duke or Hunter S. Thompson? I originally thought that the premise, a motorcycle race, was the “fact”. I made the mistake of reading fiction as “non-motorcycle race” instead of “everything.” The identity of Raoul Duke, the film’s narrator, adds another layer of fiction to the film; even though Depp looks and sounds like Thompson, he is Raoul Duke.\r To add another layer of uncertainty, consider the marketing campaign for this film. According to an interview I heard, Fear and Loathing in Las Vegas focused heavily on TV spots and the majority of them featured Cameron Diaz even though she's in the movie for about a minute. It feels like the truth of this movie is muddled into fiction on every level; from the story to the marketing, nothing is reliable.\r Would I recommend Fear and Loathing in Las Vegas? You might want to pass, for the time being, if you are looking for something light and fun, but other sure; it is a weird and disconcerting movie but enthralling."
    },
    {
      "rating": "10",
      "text": "Excellent adaptation for the screen of Hunter S. Thompson's masterpiece autobiographic novel. Please be advised that your capacity to appreciate this film will be limited if you have not read the novel in which it's based. This is the root cause of this film being largely underappreciated by critics and amateur reviewers."
    },
    {
      "rating": "7",
      "text": "A very divisive, but honest film. The cinematography is purposefully disorienting, but once you get used to its hectic pace, there is a lot to enjoy here. Strong performances by its actors and a thought provoking script really propel this movie to great heights."
    },
    {
      "rating": "8",
      "text": "The excellent movie which became cult. I the truth haven't understood why he that became. Fine game still young Johnny Depp. The plot is perfectly registered though it is simple and rectilinear.The quote about amount of drugs at the main characters is invaluable)"
    },
    {
      "rating": "10",
      "text": "Fear and Loathing in Las Vegas is grossly underrated. The film's atmosphere is eerie, dank and, grimly comedic. There is too much that is just too clever to explain in words. Check it out."
    },
    {
      "rating": "10",
      "text": "I am more than surprised that Metascore is overall yellow; user score is green and I am on this boat - this movie is an absolute classic and should be watched if you are interested in cinema in general, not only in drug-related movie. Hunter S. Thompson was a tough piece of cake. Book is also recommended. +fav"
    },
    {
      "rating": "10",
      "text": "Truly a masterpiece. I appreciate the extreme divisiveness of opinions about the film, but simply don't understand it. Faithful adaptation, and nearly perfect film."
    },
    {
      "rating": "10",
      "text": "One of my favorite crazy movies to watch. It's so entertaining and Johnny Depp does a great job capturing his role in this movie. This movie will always be one of my favorites."
    },
    {
      "rating": "10",
      "text": "An audio-visual Masterpiece. It shows the devastating consequences of drug abuse mixed with brillant acting. This movie is greatly underrated and I guess some people voting it down don't understand it."
    },
    {
      "rating": "10",
      "text": "A masterpiece, simply the epitome of excellent acting by Johnny Depp who lived with the character he portrays for a period of time, just to ensure a competent imitation of him."
    },
    {
      "rating": "0",
      "text": "Can I give it a negative score? The worst movie that I almost saw. The only movie that I've ever seen that I could not finish watching."
    },
    {
      "rating": "3",
      "text": "Fear and Loathing in Las Vegas is a total mess.  During the 95% of the movie, it uses all the most obvious ways to show hallucinations, trying to hide the lack of ideas and good screenplay. This is the worst Terry Gilliam's production - pointless, disgusting and incredibly stupid. And even Benicio del Toro is not able to help it."
    },
    {
      "rating": "0",
      "text": "This movie is downright awful. You can sit down for two hours,which feels more like two years and wonder what the point of this is?There is no wit,no fresh views. Most stunning is that these characters should have been dead about two minutes into the film as the mix of alcohol and drugs surely would have killed them. Finally this movie is all hype.....yet is one of the worst films I've ever watched."
    },
    {
      "rating": "0",
      "text": "A classic to those who were to stoned to realize they were watching a movie. A favorite to teenagers who saw the twisted cover art and decided to stop there. Brought Thompson's work to a new generation of \"fans\" who spell genius with an O."
    },
    {
      "rating": "8",
      "text": "It's pretty hard to describe the movie since it mostly consists of drug hallucinogenic adventures of two guys, but yeah, the movie is great. Terry Gilliam could capture and show the sense of madness and surrealism here. A must-watch!"
    },
    {
      "rating": "8",
      "text": "Well then, that was a movie. Aside from the fact that it's one of the weirdest and trippiest movies I've ever seen, I found it entertaining and funny."
    },
    {
      "rating": "10",
      "text": "Two genius: Thompson and Gilliam = Master-piece !!!"
    },
    {
      "rating": "10",
      "text": "Spinning visuals and disoriented dialogue."
    },
    {
      "rating": "9",
      "text": "Man, this is a genious movie based on a genious book written by a genious author, hard to believe not very many people can actually understand his work. Rest in piece Hunter."
    },
    {
      "rating": "10",
      "text": "One of those few movies that deserve a 100 out of 100, and this, of course makes it one of the most underrated movies of Metacritic. I really think it had something to do with the fact, that Drug War is the best-selling war nowadays ( those of you who didn't get it - this movie makes fun of your life style, maybe that is why you hated it so much, I mean, it must really hurt too look inside damaged self). Overall - a kind of masterpiece, that is really RARELY made."
    },
    {
      "rating": "9",
      "text": "I love it. It holds a special place in my heart. I was won over in the first 10 minutes...right after Johnny looks around all glazed eyed and says \"We can't stop here...this is bat country!\" A precursor to druggie movies as we know them."
    },
    {
      "rating": "10",
      "text": "A brilliant capsule of what Gonzo is all about to the new Thomsonite. Beautifully disgusting, lovable, hate-fueled and terrifying all at the same time."
    },
    {
      "rating": "10",
      "text": "This movie is nothing less than a work of art, and in my opinion is Johnny Depp's best film, no questions asked. I find it discouraging that many critics failed to grasp the true aim of this movie, which is not to explore drug use (in which case it actually would suck), but rather to explore the shift in the American culture and spirit that was taking place at the time. Great movie, and GREAT acting by both leads."
    },
    {
      "rating": "7",
      "text": "This is not a pretty movie; it's often unfunny; it's very frightening and fairly accurately portrays the dementia and paranoia that can come from drug abuse. (Yes, I've know people that crazy.) I don't know if this is really a movie you like; you just want to watch it two or three times a year to see what you missed the last time. This might be great to show to kids if you want them to avoid drugs: Honey, you want to behave like that? I feel about this the way I often feel about David Lynch films: Not sure II really like them much but compelled to watch them again."
    },
    {
      "rating": "10",
      "text": "First off i would not recommend watching this while under the influence of any serious drugs (the dinosaur blood orgy comes to mind but there are other scenes as well). um, phenomenal book I'd read it first. best ever reflection on what the American dream really amounts to. if you are a religious republican voter you will hate this film, which is why i love it."
    },
    {
      "rating": "10",
      "text": "A masterpiece. A stunning combination of visually pleasing effects that bring to life the hilarious anarchist antics of a genius subculture outlaw."
    },
    {
      "rating": "4",
      "text": "If you are a fan of Hunter S. Thompson, it's likely you'll enjoy this film, as it's essentially a overly exaggerated biography of Mr. Thompson. People who are into the \"drug scene\" and can appreciate wonderful chemicals like LSD will also find the movie enjoyable.  Visually the movie is wonderful and manages to simulate what it would be like while tripping on drugs like LSD. Almost every scene is colorful, bizarre and sometimes frightening.The biggest issue with Fear and Loathing in Las Vegas is the writing and story telling. Simply put, the movie starts off with the most very basic idea of a story and then just goes completely off the rails. There is no ryme or reason for the movie's plot or story and eventually just mutates in a hodgepodge of scenes that make no sense and are barely connected to one another."
    },
    {
      "rating": "8",
      "text": "A polarizing film. My first viewing left me confused, and I hated it. After a second viewing with better knowledge on the novel and the director's style, I began to admire it. It's a great performance from both Depp and del Toro, and it captures the insanity that drugs can lead to. I also loved the soundtrack."
    },
    {
      "rating": "1",
      "text": "I was tortured to keep watching this movie, I couldn't remember that I watched worse than this film, please tell me what is the story of the movie?! Just two guys taking drugs and getting high from beginning until the end of the movie, 2 hours just to watch the effect of drugs on these guys!!! I think all the cast got high before shooting the film.If you want to watch this film, just be sure to take nausea pills before you start it."
    },
    {
      "rating": "9",
      "text": "A classic, maybe not as good as the book, who knows? I will admit I have never read the book but this showcases madness wonderfully."
    },
    {
      "rating": "10",
      "text": "I absolutely love this movie, if you liked the book than you would definitely enjoy this. It's one of the most faithful book adaptations I know of. Granted i's not for everyone, it's very much a cult following movie, very unique though, it's not just some simple stoner comedy."
    },
    {
      "rating": "8",
      "text": "Where to even start with this? What starts as a fun drug-fueled comedy slowly turns into a claustrophobic nightmare of grotesque imagery and sensory overload. I've never done any hallucinogetic drugs, but I imagine that after a while, the rush Would become a nightmare. This is an ugly movie. It's hard to watch. It's extremely uncfomfortable. And that's the point.Terry Gilliam said in his own words: \"I want it to be seen as one of the great movies of all time, and one of the most hated movies of all time.\" Judging by the critics' reactions, he succeded.The film has an almost perfectly split 50 percent on Rotten Tomatoes, and many critics, including Roger Ebert, were completely appalled by it, and honestly, it's not hard to see why.But the movie survived. It has stood the test of time. It has risen from the ashes to become stronger than ever before. It is a paradox. A joyful nightmare. A horrifying treat.This film was too weird to live, yet too rare too die."
    },
    {
      "rating": "9",
      "text": "My personal favorite movie by Johnny Depp. This movie is basically a 3rd person view too the worlds greatest drug binge. A strung out and reporter and his psychotic lawyer travel too Las Vegas to cover a motorcycle race, but instead spend most of their time dropping every drug known too exist and wrecking more havoc than I did when I was an angry, stoned teenager. Worth the watch."
    }
  ],
  "recommendations": [
    "vanilla_sky",
    "fight_club",
    "morbius",
    "chappie",
    "cloud_atlas",
    "inherent_vice",
    "v_for_vendetta",
    "the_13th_warrior",
    "antebellum",
    "scarface",
    "tomorrowland",
    "perfume_the_story_of_a_murderer",
    "risen",
    "joker",
    "they_live",
    "t2_trainspotting",
    "ready_player_one",
    "inception",
    "the_butterfly_effect",
    "apocalypto",
    "the_adjustment_bureau",
    "the_social_network",
    "speed_racer",
    "all_eyez_on_me",
    "equilibrium"
  ]
}