{
  "id": 1769,
  "title": "Fences",
  "starring": [
    "Denzel Washington",
    "Viola Davis"
  ],
  "runtime": 139,
  "genre": [
    "Drama"
  ],
  "description": "In 1950s Pittsburgh, a frustrated African-American father struggles with the constraints of poverty, racism, and his own inner demons as he tries to raise a family.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/35N1U1qnFLDgWD2gcNgEKHtCBxV.jpg",
  "categories": {
    "plot": 7.1525423728813555,
    "acting": 7.052083333333333,
    "ending": 6.3,
    "soundtrack": 6.5,
    "cinematography": 7.25,
    "familyFriendly": 6.0,
    "funny": 6.666666666666667,
    "action": 7.833333333333333
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Denzel Washington is a great actor and one of the biggest movie stars, and he is the only thing about this that makes it watchable.  It's a bore.  A snooze.  Nothing new.  Yet it's well acted across the board, the photography is simple and effective, and the music is mostly a spare light piano which generally is my favorite kind of score for adult dramas.  It does have a few intense moments of dramatic humanity, with some nice directorial flourishes.The source of this movie is a stage play, and with that comes drastic limitation unless it is adapted with great creative latitude.  It stays pretty much a straight adaptation carrying along all the wall to wall nearly non-stop stagey affected dialogue which may be good for actors to showcase their talents but is wearing and somewhat unnaturalistic to the audience.  The question must be asked:  What does this little domestic story do on the big screen that couldn't be done on the small on say the Hallmark Channel?  The answer is nothing really besides feature Denzel's face.Funny little detail is I thought his friend at the beginning of the film was 'white' and not until the end of the movie did I suddenly realize he's 'black' and just has light skin, which points to the absurdity of emphasizing race in general though this has nothing to do with the movie itself."
    },
    {
      "rating": "4",
      "text": "Fences is adapted from a play and there lies the problem. At no point does this film actually feel like a film. It feels like you’re watching a play on the big screen. A very, very long play. I’m sure on stage this is a very interesting and moving story but in the cinema not so much. If you’re going to adapt a play into a film then you better make it feel like a film. The one location setting and severe lack of music was a mistake. Watching Denzel Washington was like being trapped inside the mind of a rambling drunk man spending the majority of the film ranting and raving about how terrible his life is, aw hell naw my son ain’t playin’ no football and I better get out back and build me this fence. I had no sympathy towards his character at all therefore I really didn’t care about him or his problems. As the story progresses all I did was hate him more. It’s exhausting just to listen to him for 2 hours 20 minutes. Perhaps the only redeeming factor was Viola Davis who stole the show and gave an emotional performance. Unlike angry Washington I did actually care about her character.Very disappointing and with the superb cast this should have been much better. I’m not recommending this film but if you enjoy Oscar bait then by all means give this one a try."
    },
    {
      "rating": "6",
      "text": "\"Fences\" seems confined, almost claustiphobic. It rarely branched out beyond the inside of the house and the backyard. The difference between a play and a movie is: a plays tells us what it wants us to know, while a movie shows us. The movie version of \"Fences\" didn't \"show\" enough. I wanted to see what went on at the bar with his girlfriend. I wanted to see what went on at the school, and at the hospital, and the church, and the meeting with his bosses.., and any other location that involved one of the main characters. Don't tell me what happened...SHOW ME! So, although Denzel did a decent job as an actor, (I got sick of hearing him talk; it was refreshing when the movie fell silent every now and then). And although Viola Davis tore up the screen (as usual). The movie falls short because Denzel, as a director, played it safe. This could have been a classic. Instead, I left the theatre worn out and ready to go home. 2.5 stars"
    },
    {
      "rating": "7",
      "text": "The script is thicker than Viola's ass. Im not a fan of stage plays but the performances make Fences worth to watch. Wouldn't surprise me if they get the double Oscar"
    },
    {
      "rating": "3",
      "text": "This movie was way to slow for me! Most of the movie was just talking in the backyard of their house. The only good thing was the acting of Denzel and Viola."
    },
    {
      "rating": "8",
      "text": "A much more enjoyable movie than expected, for me. While there is never a decent shot of the wooden fence that he builds around his house, I felt like I didn't really need it. Viola Davis and Denzel Washington are amazing as usual, and Gabriel's character was well done. The music fit the nature of the movie, so that was nice. It's good to see true, gritty reality after watching so many movies like Doctor Strange and Wonder Woman."
    },
    {
      "rating": "10",
      "text": "Fences is a great adaptation of an american classic. It's the best filming of a play you will ever watch. The acting is incredible across the board, the cinematography is excellent, and the story will leave you thinking long after you leave the theater."
    },
    {
      "rating": "7",
      "text": "I find the film an actor's feat for nearly everyone, including Denzel Washington and Viola Davis. I liked the atmosphere of being very close knit, like a play, but I also felt it grown tiresome on me, especially with the repetitive monologues. The film was also too long (I can recall about four different points where the movie could have ended before it did). Washington just made the film too much like a play, and not enough like a film."
    },
    {
      "rating": "6",
      "text": "It's an adaptation of a play with the same name, written by August Wilson.Directed by Denzel Washington.It looked and felt too theatrical to me. Non-stop monologues, too many close-ups.One person talks, others just stand and wait for their turn. I am sure it was a good play, but even Viola Davis (who was fantastic as usual) did not save this film. The movie is just good enough to go and see it but it does not deserve its hype.I probably should mention Denzel Washington's good performance as an actor but I do not think it was his best acting, and I did not like the way he directed the film."
    },
    {
      "rating": "10",
      "text": "This movie is about Narcissism. It is a terrible disorder and causes highly dysfunctional families. The movie represents this well - believe me i was raised by a father like this. I have noticed both angry and highly dismissive rants about this film in the user reviews. If my father reviewed this movie he would absolutely hate it. Just saying."
    },
    {
      "rating": "9",
      "text": "This is as intense and deep as a movie can get, Denzel Washington and Viola Davis are amazing and watching them is just something out of the ordinary, there are intense moments almost every minute that if you blink you'll miss them, and the screenplay was just outstanding August Wilson did wonders, and to think Denzel managed to pull off a performance like that and still direct the movie wonderfully, just made me respect him even more"
    },
    {
      "rating": "9",
      "text": "There is a great tradition in Hollywood for adapting plays to the screen. You can always tell when a film has come this way because of it's extended scenes, small casts, and grand dialogue. At times it can be Shakespearean–which is to say, long and daunting for most audiences. Other times it can bring film back to its roots.We don't always need a grand score and special effects. We don't always need the auteur designs of a Wes Anderson set or a Kathryn Bigelow action scene. Sometimes we just need to see these performers play a scene while we (the camera) sit back and experience the story.Like Doubt or Cat on a Hot Tin Roof, Fences is about the script and the performers. And Denzel Washington understood this when he put together this perfect cast and let them play it all out on a real Pittsburg street. It's a raw and realistic story captures a time and place and people as well as anything flashy with twice the budget could have."
    },
    {
      "rating": "6",
      "text": "Sad to say,  but this movie is overhyped and praised by the mainstream. Why praise a stale movie such as this, internal politics and the name behind it. Denzel Washington is a very fine actor and Viola Davis is truly astounding,  but to say this movie is the best of the year has me questioning journalist's judgment. I would see it regardless, but know that this screenplay is not a screenplay, but a stage play that was put on film. Denzel you are a brilliant actor,  but you shouldn't have directed your own movie that is a play adaptation while playing the lead."
    },
    {
      "rating": "3",
      "text": "Oh. My. God. You'll never see such spectacular, knock-your-sock-off acting, entrapped within an utterly miserable two hours of homework.  I laughed when I saw the \"adapted from his play\" credit; the only adaptation must've been typing \"Fade In\" and \"Fade Out\" -- as a play this would be very powerful; as a movie it's a $50K student film shot in one house with Oscar-worthy actors. It's film; why did we only get tell-not-show? The son's school and football practice; the characters at the bar; the friend's wife; Denzel's 'acquaintance,' the church women -- all theatrical offscreen references, faceless names only referred to. I was nearly coming out of my skin with impatience. Storytelling should reflect, and take advantage of, its medium. This belonged off-Broadway."
    },
    {
      "rating": "10",
      "text": "An outstanding, deep, and moving movie.  This movie has twists and turns that you don't see coming. It is moving, because every person can identify with the situation in the movie.  This is the kind of movie that sticks with you long after you leave the theater."
    },
    {
      "rating": "9",
      "text": "Despite not having seen the Pulitzer-winning play this was adapted from, this was an undeniable well-acted, potent, and well-rounded film that felt all the more fresh and compelling to watch having not seen the play prior. While the feeling and style of a play remains, this doesn't hold the film down in the slightest and remains and intriguing watch due mainly in part to the top-notch performances from  Denzel Washington (who also brilliantly directs the film) and Viola Davis, who will almost certainly garner much deserved Oscar recognition for their work! Overall, it's a solid, well-told story with some of the best powerhouse acting I've seen all year!"
    },
    {
      "rating": "8",
      "text": "Unless music is involved, nobody these days talks enough about the great live Broadway performances, but more so the movie or TV series they are streaming on a mobile screen. So now, Denzel Washington (Malcolm X, Training Day) sets a clever strategy in place to create better public appreciation of the performing arts: using his experience acting in August Wilson’s play, Fences, he combines the humanistic, real-time feel of a play with the eye-to-eye level of power created by the culturally obsessed virtual screen.How does he accomplish that you may ask? Well, only one single set takes up the majority of the film’s runtime, giving the feel of one single continuous scene, only relying on dialogue to carry the tension. The genius fusion of these two artistic mediums results in a heated, unsettling character drama which sticks to your ribs and controls you.The living situation of the run-down family is meticulously detailed within their all-Negro neighborhood. Mr. Washington plays the indecent ruling patriarch over the home, a full-time colored garbage man, and the home’s sole breadwinner. The mother played by Viola Davis (Doubt, The Help) stays at home, wondering where her self-centered husband goes after work each day. The oldest son played by Russell Hornsby (Grimm, Lincoln Heights) plans to pursue a music career, with money bargained by his unwilling father. The youngest son played by Jovan Adepo (The Leftovers) still survives under their roof, dictated by his unloving father. As we see their few highs and many lows under the heated sun, attention never gets lost with the crucial information learnt about their hearts.Denzel Washington proves how his experience acting on Broadway has prepared him for his tremendous screen direction. He stages the actors to express the household’s separation, however much the religious decorations on the house’s borders force them together. Although the sets look way too much like on stage, hurting the ability to feel engrossed in an authentic looking worn-down predicament. But the theatrical greatness comes less from the theatrical set, and more from the theatrical dialogue.Everything coming out the actors’ lips parallels a live show, while also imitating talk by genuine people. They talk aplenty about their personal issues growing up, so much so, you need to pay close attention to remember something important. In fact, the dialogue pacing spits out in the speed of a play, rather unsuitable within cinematic bounds, where the actors are not the only visual element to the story. So you may have to put your glowing screen in your pocket away while you ingest your undivided attention to the feature.Gradually, the tension between the tiny cast grows and grows from a serious lack of faith. Then suddenly, a devastating plot twist strikes you with snake fangs, pulling the less active characters out from the shadows to take charge. Never before since The Sixth Sense could a plot twist shake you so unnervingly. Even then, you won’t as feel shaken as Viola Davis was while delivering her dialogue of epiphany, commanding true, powerful tears from the ideal independent woman who understands the world’s needs.The discomforting new nature of this Tony-nominated play pulls back the picket fence to reveal a completely different side to the American Dream at the dawn of the Civil Rights Era. While the lack of any redeeming White characters gives the race an overly bad name, it helps to recreate the play’s unique depiction of a fallen African-American family inside a changing world.So due to recent events, everybody must see Fences right away, no matter their skin color. Both 2016 and 2017 needed a reminder on the importance of building fences: who are we keeping away from our existence? Who are we keeping in to better ourselves? What do we tear down to help our loved ones be better than we ever were? Such questions explain the vitality of in-person storytelling including stage productions: it forces us to look closer and see people in person for who they are, which in my perspective, we could benefit from."
    },
    {
      "rating": "7",
      "text": "Viola Davis is pretty spectacular in this film - Denzel's directing is on the money.  I enjoyed it greatly, but I didn't want it to dwell for long in cliches. It didn't.  I kept thinking of \"The Great Santini\" as the tough father/son relationship developed."
    },
    {
      "rating": "7",
      "text": "This is a screen adaptation of August Wilson's play about a strict and restricted black father (played by Denzel Washington, who also directed). He verbally bullies his wife (Viola Davis) and son (Jovan Adepo), while ranting about his authority and significance. While Wilson's language borders on poetic, the father's unsympathetic character makes the situations hard to handle. Of course, the performances are superb with Davis' sensitive portray illuminating the screen. Director Washington has kept every moment of this long encounter compelling (it runs 2:19) with crackling energy and dynamic force. Still, it feels like a cinematic staging of a theatrical presentation with the attendant embellished dialogue, hyper-focused encounters and larger than life emotions."
    },
    {
      "rating": "7",
      "text": "Fences isn’t an ambitious movie, it’s simple, straight to the point and center in daily human conflict. The story follows a man, hardworking, struggling to reach end of the month, with a humble home, loving wife and conflicting children. This movie is a slap in the face from reality, teaches that the world ain’t sunshine and rainbows, that dreaming is dangerous and the path for black people is twice (or even more) as difficult, due to hidden racism. It evaluates human behavior, concerning humility, stubbornness, selfishness, fear to death, living day by day and projecting into future; and human relationships in marriage, family nucleus, father and son, and friendship. Denzel Washington and Viola Davis are marvelous and she is especially heartbreaking. The title is very interesting, because of what it represent for the protagonist lifestyle; fences are for keeping people away and mark your territory, nevertheless, they are also for maintaining inside the things that you care about."
    },
    {
      "rating": "8",
      "text": "A terrific take on family issues, love, and forgiveness, almost everything about 'Fences' works. With grand performances from Denzel Washington and Viola Davis (get that Oscar, girl!), the story builds up, and comes to a very pleasing conclusion. The minimalistic set is a plus, the multi-layered meaning of the title and the fact that the film is packed with emotions and feelings gives it a one-of-a-kind taste. 8/10."
    },
    {
      "rating": "6",
      "text": "While this is a very strong drama with truly fantastic performances, it is clear why it is much better suited as a play than a film. I do believe there are certain criteria that distinguish film from other art forms, and simply put having 2-3 locations in the entire 2+hour movie does not cut it. But other than that, good."
    },
    {
      "rating": "9",
      "text": "I'm a big theater fan, so I've seen most of August Wilson's Pittsburgh cycle plays, and Fences is his most awarded and arguably best play.  It takes place mainly in the 50's and concerns Troy Maxon, former Negro League baseball player now trash collector, his wife Rose, two sons and brain damaged war veteran brother.  Denzel does a great job as Troy, who is not a totally sympathetic person, but the movie belongs to Viola Davis as his long-suffering wife.  Yes, it is obviously an adaptation of a play, but the dialogue is terrific and all the characters are realistic and well-rounded.  Kudos should also be given to the actor portraying his brother.  You may not like this film if you are mainly into action movies, but I was thoroughly involved with the plot and the characters, despite my familiarity with the play."
    },
    {
      "rating": "8",
      "text": "Denzel Washington's fourth directed film is by far his best. A fantastic adaption of the Broadway play. Denzel Washington and Viola Davis both give Oscar worthy performances. It felt like you can not look away or breath during this film cause every word in the movie is incredibly important to the story. I loved that there weren't many scenes just extremely long takes. Every scene starts with a small conversation then builds and builds and builds. It was truly amazing. This movie will most likely get nominated for best picture"
    },
    {
      "rating": "4",
      "text": "Boring film. As usual, critics created a lot of hype like all denzel washington films but in the end the film is unsmokable.all is reduced to a bunch of **** doing **** talk non stop for 30 minutes. NON STOP. the insane bla bla bla bla bla bla bla gives headache. like aaron sorking m60-like infinite speechs.The rest of the film is more **** talking and 2 shamingfull performances in contrast with the awesome character of viola."
    },
    {
      "rating": "6",
      "text": "I feel like the 6 points go to Viola's acting and the story, which probably works better as a play because Denzel's directing was a bit lost, though his acting was actually good."
    },
    {
      "rating": "7",
      "text": "watching this film is like watching an actual theatrical play which is funny cause this movie is a film adaptation to a play. Reason why I enjoy this film was because of the acting and the acting in this movie is fantastic."
    },
    {
      "rating": "2",
      "text": "Terrible waste of some first-class acting -- it'll likely win Denzel an Oscar in a film nobody will want to see.Apparently, August Wilson doesn't get writing for the movies -- the operative part of the word being MOVE. This felt like a play was filmed & not well.  Denzel must have been too in awe of the guy to tell him to back off -- why the heck was Wilson the screenwriter anyway? He is clueless even if his play did win a Pulitzer. This movie is so claustrophobic (for no good reason) stuck in a backyard for 9/10ths of the time. Why not show Denzel at the bar with the women he takes up with? Why not show the kid on the football field & in high school? Why not let Lucinda come to life & be a confidant to Viola? Show the church ladies interacting. Show Denzel at the shop.  Show all of it -- you can do that in the movies. Keeping all the vital parts of the story just talky-talky didn't work, had no value in this case. Didn't add mystery or help keep focus. Just plain boring. While Denzel & Viola's acting was superb -- Denzel's turn as director fell flat. Many shots made no sense. Feet on the steps ... long fade to black ... long shot suddenly shifting to tight shot. Again, I think he was scared to mess with Wilson's vision -- which really bogged down this movie. I hate to give this such a crummy rating, was really looking forward to seeing it, but IMO it was a drag."
    },
    {
      "rating": "8",
      "text": "Viola Davis as Rose, in “Fences”, makes you afraid to breathe because you don’t want to miss a word, an emotion, she says, and shows on her face, but there are two particular scenes that are among the most mesmerizing ever seen on screen. Denzel Washington, as Troy, her husband, equals her performance but, unfortunately, never stops talking!The Pulitzer Prize winning play written by August Wilson, who also wrote the screenplay, uses words like poetry but it is almost as if he didn’t want to cut a word of his for the screen and Washington, who also directed, gave him his lead as did producer Tony Kushner, also a Pulitzer Prize winning playwright. Plays are naturally ‘wordy’ and films are a different medium so while they may work on stage it doesn’t always work on film.The director opens the film with some street scenes, a bar, following the garbage truck Troy works on, in a church but most takes place within the home and in the backyard of Rose and Troy’s home. Washington makes a few editing mistakes but he gets first rate performances of all his actors including himself.Stephen Henderson, as Bono, Troy’s longtime friend knows the man and mostly accepts him for who he is while Russell Hornsby, as Troy’s son from another marriage, does not see himself as a failed musician but in his thirties still comes along on Fridays, his dad’s payday to borrow a few dollars. There is also Troy’s older brother who has a metal plate in his head and is brain damaged, due from his fighting in WW 2, played by Mykelti Williamson, is almost a cliché on screen while would be more believable on stage. In the latter part of the film young actress Saniyya Sidney shows Washington directs children to be as children are, not an older actress playing a child.One of the main conflicts is between Troy and his high school football player son Cory, played by Jovan Adepo, with the father being particularly hard on his son. Is it for the son’s own good or is that just the way the man is?Troy is not a particular nice person, though at times he can show a sense of humor, he can be, and usually is, hurtful to all around him. We try to like him mainly because we have come to love Rose and want to understand why she not only married this man but stayed with him for the next 18 years. Davis has a scene where she tries to explain to her son exactly that but we have listened to Troy talk way too much negatively, especially to his son, to all those around him to completely accept what she is saying. In addition Troy betrays Rose which would destroy a weaker woman than her.“Fences” is a ‘must see’ movie if no other reason than to see Viola Davis but Denzel Washington and the rest of the cast are fine too. There is also the plus hearing August Wilson’s words on screen, with the promise of the other 9 plays he has written regarding different decades of Black Americans lives, being brought to the screen, all combine to get you in the movie theatre."
    },
    {
      "rating": "8",
      "text": "A faithful theater-to-screen adaptation that, refreshingly, doesn't feel stagey (as often happens with such translations). Superb performances by the excellent ensemble cast (especially Viola Davis and Denzel Washington) bring the characters to life and captivate viewers from start to finish. Despite a slight tendency to drag a bit in a few spots, the film tells its story well, with deft humor, heartfelt emotion and riveting drama."
    },
    {
      "rating": "8",
      "text": "While Batman V Superman was my favorite movie of the year, Fences deserves to clean house at the Oscars. Troy is a really interesting character and i loved hearing his stories. \"Old Blue\". August Wilson created some great dialogue. Best Picture indeed."
    },
    {
      "rating": "10",
      "text": "К чёрту \"Лунный свет\"! Здесь цвет кожи - это всего лишь поверхность, а глубже история о нас - простых людях.Житейские и интересные диалоги, прекрасные актёры, отличная драматургия, будь я совсем чуточку синтементальнее, то расплакался бы в конце, а так слёзы наворачивались.Кино прекрасно во всех отношениях!\"Спасибо\" академии за их прекрасный выбор в пользу \"Лунного света\"."
    },
    {
      "rating": "8",
      "text": "A poignant look into the lives of African Americans in the 1950s told in the backyard of one home. The movie is easily worth watching, if only to see how Washington is able to capture such a emotionally complex story in such simple scenes. Outstanding performances from Washington, Davis, and the rest catapult this movie into being one of the best of the year. Emotional performances that are truly deserving of nominations for best actor and actress."
    },
    {
      "rating": "8",
      "text": "Denzel Washington brings a soul to a more-of-the-same movie that crawls inside your skin. Viola Davis performance is definitely Oscar material and the remaining characters are interesting enough to keep our attention."
    },
    {
      "rating": "10",
      "text": "No spoilers here just a few observations.  Given what Fences the play is I can't imagine a more difficult thing to bring to film.  The dialogue is great.  These characters can be any of us at some point in life.  I saw myself in Troy, Rose and Corey.  If you can sit still and listen to people talk then this film is for you.  If something must blow up every half hour then not so much.  Is Fences an Oscar nominee for Best Adapted Screenplay, no, but do Denzil and Viola give masterful performances, the answer is an resounding yes."
    },
    {
      "rating": "10",
      "text": "Awesome! Didn't need car chases, not going to be digital wizardry.  What you get is an excellent story about a flawed man and the effect it takes on his family.  You also get Denzel bringing that character to life with commitment and honesty.  If you like story driven movies See It. It's popcorn worthy!"
    },
    {
      "rating": "10",
      "text": "I can't believe I'm saying this: Better than seeing it on Broadway six years ago. Denzel is triumphant as is Viola. One of the best films I've seen this year."
    },
    {
      "rating": "9",
      "text": "This movie was wonderful and, I think, well-made, although not for everyone!It focuses on a troubled man, his family, and the circumstances that cause events in one another's lives. It is a sad movie, but great performances from Denzel and Viola, as well as the secondary cast.Well written, story wraps up well, excellent acting, slow, but well paced. Not everyone will appreciate the relatively small location of the movie, and there's basically no action; all in all a slow, easy-on-the-eyes, but tugging at the heart movie.9/10"
    },
    {
      "rating": "0",
      "text": "I could stand about an hour of this incomprehensible babbling. I have no idea what this movie was about. It was nauseating, they never stopped talking. Who talks like that ? Please, learn the English language before you make a movie."
    },
    {
      "rating": "7",
      "text": "Full of raw power, the dialogue and performances in this are pure vitality. Troy is a compelling character of real human dichotomies, someone you can loathe and love in equal measure. His baseball analogies verge on the embarrassing he's so obsessed with them, which in hindsight makes me a little sad.This film never comes alive as a film however, it always feels slightly restrained as an obvious adaptation of a play. I've never really understood this critique of plays-into-movies before (feeling that character and dialogue will trump lack of settings and fancy camera work) but watching this, and seeing how some of the scenes are awkward with how the actors are standing around, then randomly sitting down and being so careful with their stage movements. It wasn't fully engaging me viscerally as a film. Too many unnecessary close-ups of people's faces when dialogue becomes \"important\". Also weird CGI or something with some of the backgrounds and the tree at the end?I also felt Denzel was projecting a bit too much at times - like he was still giving a stage performance. I understand his character \"filled a room\" with his personality, and to that extent he succeeds, but I still couldn't shake that feeling. Viola is the best snot cryer in the biz."
    },
    {
      "rating": "8",
      "text": "Denzel Washington's Fences is undoubtedly a flawed work. With its screenplay written by the play's writer August Wilson, Fences is a film that is entirely connected to the stage. With dialogue heavy scene after dialogue heavy scene for two hours, Fences can be an exasperating film to watch with how much of it is relying upon nothing but words. For two plus hours, this is undeniably a major challenge and one that can prove too much at times. However, it is in those words that the beauty of Fences reveals itself. Brilliantly written with aching roots in reality, Fences is certainly a tremendously acted film, but the star here is August Wilson's writing. It is vibrant. It is raw. It is emotional. It is, above all else, real. The film's writing is what gives it fire in the first place and the what brings it triumphantly over the finish line. No matter where the film may slack, creak, or trip, the script is always there to pick it up and point it in the right direction.While Wilson's eloquent use of language to have the characters express their emotion without having to come out and have the characters say exactly what they feel serving as terrific footing for the film, it is his ability to develop those characters that will stand the test of time. As a challenge for this, Wilson sets the film in 1950s Pittsburgh in the inner city and in the home of a garbage collector named Troy (Denzel Washington). With a wife named Rose (Viola Davis) and a son with her named Cory (Jovan Adepo), a son with another woman named Lyons (Russell Hornsby), a brother dealing with mental illness named Gabe (Mykelti Williamson), and a friend named Bono (Stephen Henderson), Troy's life is one of fear. At every turn, this big behemoth of a man is afraid. Projecting confidence and aggression to mask this fear, Troy compartmentalizes his fear into baseball references and elaborate stories of how he fights off death. Yet, underneath the surface, he is a man who knows he has already struck out and is nearing death. As he pushes away his son Cory and derails his dream of playing football, Troy also antagonizes Lyons, signs away Gabe to the state, and cheats on Rose. He is a man who is failing and struggling to stay afloat and to keep a roof over his family's heads, all while bearing the weight of that burden. He is a man who is so afraid that he will fail and be rejected by his family that he winds up crushing himself under the weight of it all and pushes away some of his family in the process. Of all the people in the world, Rose is the one who sees this. As Cory leaves and even Bono leaves, Rose stands by her philandering husband and even raises the daughter he has with another woman. Why? Because she sees him for what he truly is on the inside. No matter how abrasive he is and how aggressive of a person he can be, Troy is just scared and latching onto anything he can in order to not fall or to forget that he is falling. The thought of death, though he approaches it with great machismo, is something that scares him. He refuses to admit he did not go pro in baseball because of his age, instead blaming it on the whites. Why? Because that would require admitting he is old. When Cory challenges him, he only fights back when Cory calls him old. He is a man afraid of growing old and dying. Rose, for the the pain he has caused her, refuses to give upon this man. Instead, she opts to stand by him and hold his hand as he slowly and loudly slips out of this world. Though it would be easier to leave him to rot in the bed that he had made for himself, she loves that man that has become consumed by fear and refuses to let herself become consumed by that very same fear. Instead, she fights back and declares war on it in order to provide her husband with the strength he needs to fight back as well.One of the greatest challenges undertaken by Fences is to make Troy likable. For the part of Rose, Viola Davis' brilliant and raw performance combines with Wilson's eloquent writing to make her the one we root for. When Cory takes on his father to defend his mother, we want him to kick his ass. Every time Troy lets down Rose, we want her to leave him and for Rose to kick his butt. Yet, she never does. This could make Rose seem to be quite the confounding character if Troy remains this detestable person that we cannot root for. On the surface, he is an angry, self-hating, narcissistic, and cruel man. He treats his sons like garbage and his wife even worse. His words are hollow and leave you longing for a better man to step into his place. So, how does Wilson make Troy a man you can root for, even with Denzel going full \"You know what I'm talkin' 'bout **** Partially, it is because of Rose, but the rest is because of how he writes Troy. In his boasting and reminiscing, you can hear that tinge of emotion. Denzel does an excellent job bringing it to life, but the writing gives it the beating heart to open those lungs."
    },
    {
      "rating": "6",
      "text": "Trying to be a good husband and father!It took nearly a decade for Denzel to direct another film and this time it sailed through the Oscars with four nominations and one won out of it. Yeah, it was Viola Davis, who snatched the most prestigious award for her supporting actress role. Originally the film based on the stage play of the same name. It is a drama takes place in the 50s about a hard working family man, Troy. His past was not very good, which makes him a little arrogant when it comes to raining his boy. Marrying Rose was the best ever thing happened in his life. Though it was not a perfect family. The differences between them is what later bring twist and turns in the tale before heading for the final of the final act.A very simple drama on the fine topic. Most of the film was just a conversation or arguments. And most of the film was little slow moving with the very long overall runtime. If you can manage that, you can enjoy it. If you are a drama genre fan, then you will be more than happy for giving it a try. One of the best drama films of the year, yet not the greatest. It's all finger points at the performances. Those magnificent actors displayed magnificent show. Nearly 35 years old screenplay and 70 years old timeline, still looked the same and powerful. Despite the film's success and poured praises, I don't think it is for everyone. Definitely young generations won't enjoy it. It is mainly for families.6/10"
    },
    {
      "rating": "6",
      "text": "\"Fences\" is hobbled by a director. who can't resist showing us everythiing we should be seeing and feeling for ourselves. August Wilson's screenplay, based on his play, tells us quite enough and, occasionally, more than enough about characters' feelings and inner turmoil. It's all in the faces of an excellent cast, but Denzel Washington, who directed and also stars, can't let good enough alone. In one scene, when Rose, the Washington character's wife, beautifully played by Viola Davis, runs out of the house and drops an important - and clumcy symbolic object - the camera can't resist following the fallen object. There are also similar lapses when the camera lingers on faces or objects long enough for us to be nudged out of the film's emotional life. And that's exacerbated by much in the latter part of the screenplay when characters are handed stage-bound monologues that don't translate as anything but well-crafted text - poetic imagery and shifts in language replace what had been commonplace dialogue filled with phrases and slang familiar to these people and their time. August Wilson exhibits the strong influences of O'Neill, Miller and the mid-20th century American playwrights who struggled to create a unique American voice for the stage. \"Fences\" doesn't benefit from this screen adaptation any more than its central symbol and metaphor, which lands with a thud."
    },
    {
      "rating": "8",
      "text": "A knockout. Not an easy film, it's adapted from a stage play and spans a period of about 10 years from the late 50s through the mid 60s. (I'm white and this film should certainly resonate w/ viewers who are not black.) I am still trying to wrap my mind around the vivid and detailed portrait of a family with all its flaws and strengths. Actor/director Washington is great and Viola Davis's Oscar winning performance is surprisingly restrained and marvelous. EASILY one of the best films of 2016. I know I will remember it for a long time."
    },
    {
      "rating": "6",
      "text": "\"Some people build fences to keep people out, and other people build fences to keep people in\".'Fences' is what I call an \"actors movie\". Great acting all round, good story, and a easy straight forward narrative. Other than that, it falls flat. Denzel directing is bland and the film has a lot of pacing issues, as I felt the runtime. Of course this was based on a stage play and it sure feels like it even watching it. Because every monologue has to be shout and be big like a stage performance, but at the same time fits certain characters. Kind of a mix bag really.You could say the main goal was to make it look and feel like a play. I mean, many movies have done it, but did it so much better. It got pretty repetitive after awhile and has a rusty flow.While a movie adaption of 'Fences' wasn't really needed, but it's the performances and story that keeps things a float. Honestly, this is some of the best I've seen from Denzel Washington and Viola Davis. Both delivering powerhouse and unstoppable performances. It doesn't shy away from dark themes and I know a lot of people will be uncomfortable, but moved of what's be presented.Just to be clear, I don't hate the movie, as it may seem. There's a lot to be liked and some may disagree with the points I brought up, which is totally fine."
    },
    {
      "rating": "7",
      "text": "Movie Review: Fences\tRecently I saw the movie Fences. As a fan of Denzel Washington, this was one of my favorite roles he has portrayed. The other actors that played a major roles in this movie were Viola Davis ( who played his wife,Rose), Stephen Henderson, Russell Hornsby, Mykelti Williamson, and Jovan Adepo. Fences is the story of Troy Maxson, a 1950s sanitation worker of Pittsburgh, Pennsylvania. He had dreams of being a major league baseball player, but was too old when he finally got out of jail.Troy makes some rash decisions while trying to keep his family in order.\tTroy Maxon had a rough childhood growing up, his father had eleven kids and was very strict. His mother left him when he was only eight. He stayed with his father until he left home when he was 14 from a dispute he had with his father.\tThe movie begins as Troy and his friend ( Mr.Bono) were doing their job as sanitation workers; talking about women they like and their wives. When they finished work they decided to go to Troy’s house and drink a pint of liquor together. When they get there Troy talks about the devil and not being scared of death. He says that death is like a fast curve ball he could knock out the park. Then Troy’s brother Gabe stopped by to visit; he was in the army and suffered and head injury and has metal plate in his head. He is kind of delusional and talks about Saint Peter, heaven, and judgement day frequently. Soon after his brother leaves, Troy’s oldest son comes over and asks his father for ten dollars to help him while he works on his music career. At first Troy refuses to but his wife persuades him to give him some cash. His youngest son is still in high school at the time and has a chance at making it in football. His youngest son, Cory has a job as well and decided to quit it to focus more on football since recruiters were starting to notice him. Troy thinks he should focus on keeping a regular job and ends up telling Cory’s coach to cut him from team. Troy and his youngest  son argue often in this movie. The movie was set in mid-century, so the clothes were a bit old fashioned and so was the football equipment. The cars were retro and so were the buildings. The acting was delightful; the actors and directors most likely critiqued the play of it that was made a couple decades ago. They named the movie Fences particularly because while some confrontation was occurring; the wife wanted Troy and his son to build a fence. The wife thought it was help keep the family together inside the fence while Troy thought the fence would help keep the devil out.\tOverall, this movie didn't capture my full attention like a beginning of action or comedy movie; then as I started following the plot of the movie I felt an emotional connection to the main character. I watched as the main character (Troy) dealt with his problems and I felt as if he tried his best for his family;but as a man,we all have shortcomings and memories in our past that sometimes come in the way of us making the best decision. If you're looking for a movie where you can feel the ups and downs of the main character, this movie is it."
    },
    {
      "rating": "9",
      "text": "It would be foolish to deny that Denzel Washington made the effort to adapt from theater to film a well-known play about the efforts of an African-American family in the prejudiced 1950s. The performances are worthy of recognition, as well as the analogy between baseball and life."
    },
    {
      "rating": "10",
      "text": "I Think This Is One Of Those Movies That Only Someone Who Was Raised By A Father Like Troy (Denzel Washington) Would Understand Perfectly!I Really Wish From The Depth Of My Heart For Families Like This To Finally Find Happiness..."
    },
    {
      "rating": "7",
      "text": "I listen to highbrow music, try to stay well read, and make an effort to see all the Oscar nominated movies. But sometimes Radiohead is too heavy, Faulkner makes no sense, and fantastic performances are a part of slow paced movies. Viola Davis and Denzel were sensational, with Davis especially securing her spot as reigning Oscar heavyweight. I read recently that we all underrate Denzel’s performances, because he’s so consistently spot on. I thought these two were going to have an Academy Awards night sweep, especially after the SAG awards this year. But I don’t picture myself re-watching this anytime soon. Performances near perfection, but film, 7.2/10"
    },
    {
      "rating": "7",
      "text": "Fortunately, Washington has monstrous performances in his pocket, he does not and will not take them for granted.FencesDenzel Washington, an actor-turned-director, directs his films just as any other actor would, should. And if done properly, just as he does, the film is going to be emotionally fluent in its vocab. And the characters are respected more than the plot and the performance given the priority. The film is crafted around those performances. Almost as if it was created to showcase their talents to the best of their ability. It rattles the Academy members and announces in their ears. A call for attention. And boy what fun it is to see them give what they would like to. Adapting the infamous play for the screen, Washington tries his best to make it not seem like a play.He makes things mobile, he keeps characters apart as much as he can, he novelizes the idea, he keeps montage sequences to make time flow. These are the scenes where the film comes alive. For these are the scenes where the truth is spoken. Fences is a bit Shakespeare-ean and a bit verbally challenged. In the sense that the characters call out to their fate and claim their destiny as a part of pain and endurance. And it is verbally dysfunctional just as Noah Baumbach's world.Which I think is the best for I love these sorts of narration. And as beautifully does it capture the ambiguous subtextual theme, it also gives away the final result at a certain point. And that is the only tiny element of the script that kept bugging me. For the real drama is the thought provoking ideas bouncing in our head as each of these characters are studied and portrayed. Now, what happens is the definite answer orders us to stop letting it wander. The imagination is held back and as mentioned before, the emotions takes charge, the performance steers the film then."
    }
  ]
}