{
  "id": 633,
  "title": "Ferdinand",
  "starring": [
    "John Cena",
    "Kate McKinnon"
  ],
  "runtime": 108,
  "genre": [
    "Animation",
    "Family",
    "Adventure",
    "Comedy"
  ],
  "description": "Ferdinand, a little bull, prefers sitting quietly under a cork tree just smelling the flowers versus jumping around, snorting, and butting heads with other bulls. As Ferdinand grows big and strong, his temperament remains mellow, but one day five men come to choose the \"biggest, fastest, roughest bull\" for the bullfights in Madrid and Ferdinand is mistakenly chosen.  Based on the classic 1936 children's book by Munro Leaf.",
  "releaseYear": "2017",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rMm94JsRfcOPiPVsTRcBiiVBOhz.jpg",
  "categories": {
    "plot": 6.181818181818182,
    "acting": 5.769230769230769,
    "ending": 5.5,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.166666666666667,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "A Family Film With A Good MessageIt's No Pixar, But Ferdinand Has A Terrific Performance From John Cena And A Very Positive Message."
    },
    {
      "rating": "8",
      "text": "As far as animated kids movies go, this is pretty good. While it does contain the tired \"be yourself\" cliche that all kids entertainment seems to spout these days, it doesn't lean into that too hard. Rather, it's more about friendship and doing the right thing in the face of adversity.  There's a couple of mild off-color jokes and some slightly scary/tense moments, but nothing really concerning. Set in Spain, the music and artwork does a great job of setting the appropriate tone. The character of Nina is appealing and well designed/acted - I wish she played a larger role in the movie.  Wrestler John Cena voices the titular Ferdinand, and does a good job in the role; he's always been charismatic and kid-friendly during his tenure in the WWE, and those qualities come across here. Overall a very sweet film that I recommend without hesitation for kids and families."
    },
    {
      "rating": "10",
      "text": "Wow!! People really like to downvote on things they haven't even seen! Ferdinand is its own thing and whether you want to compare it to Pixar or not, it is still jolly fun and a must-see for the themes and messages that the film talk about!! GO SEET IT!!!!!"
    },
    {
      "rating": "7",
      "text": "Yes, \"Ferdinand\" was predictable. We've seen it all before. But, my three-year-old grandson had never seen anything like it. To him it was new... all of it. I often read complaints from reviewer's about how a version of a story has been done before. Hell, almost EVERY children's story, in one way or another, has been done before. There are only so many ways to write a fairy tale.. \"Ferdinand\" takes a nice story and gives it feeling, personality and depth. The voice-overs by pro-wrestling superstar John Cena and Kate McKinnon were outstanding. \"Ferdinand\" is the second best animated movie, from a major studio, in 2017. Only \"Coco\" was better. Its too bad that \"Ferdinand\" premiered on the same day as \"Star Wars: The Last Jedi.\" It got lost amidst all of the Star Wars hype. It deserved a better audience."
    },
    {
      "rating": "7",
      "text": "Well done Blue sky studios. After ruining the Ice age franchise, i am very pleased to see a good comeback. Predictable story, yet adorable and very enjoyable to watch!"
    },
    {
      "rating": "4",
      "text": "This is the first original Blue Sky movie that i actually didn't like. Not an Ice Age sequel or a Rio sequel, but this yes. I mean, the animation is good, the voices actors are ok, there some scenes that i gigle and he third act is impressive since there's almost no dialogue. ¿Does that makes the movie good? Unfortunately no. The characters are annoying, idiots and boring, the jokes aren't funny, the message is really bad recived, there's a lot of cliche and unfunny stuff and most of the movie is dedicated to have slasptick, butt jokes, pop cultres jokes and another annoying story of animals in an adventure to go home. I don't see why this movie is nominated for 2 Golden Globes, i don't think they worth it. Is a shame that someone like Carlos Sahldana (Who's not a bad director, i like Ice Age 2 and 3 and also Rio) had to go in a more overuse way that we have seen before in staed of show us something new and creative"
    },
    {
      "rating": "0",
      "text": "Me and my 5 year old kids didn't really enjoy this movie. I have no idea why a child movie need to include a slaughter house which bulls are sent to after they \"fail\". Yes - I get the message but for kids this is just scary as ****"
    },
    {
      "rating": "10",
      "text": "This is a just, plain feel-good movie with a good story.  My friend and our kids and I watched the movie on New Year's Eve and had a wonderful evening. I didn't give it a 10 because of its Oscar-worthiness but because it was very successful at what it set out to be.  And I loved it!  Thanks, Ferdinand people!"
    },
    {
      "rating": "4",
      "text": "Unfortunately, 20th Century Fox once again did not learn their lesson to release juvenile crap on the same day Star Wars hits theaters. They got awfully owned by the way better Force Awakens when it came to that Alvin and the Chipmunks movie. Ferdinand, on the other hand, attempts to become way better than Fox's latest attempt to bring the chipmunks back to theaters but that doesn't mean that Ferdinand is a second option to send children or basically the whole family just in case they have already seen the latest Star Wars movie. I just wish 20th Century Fox would just stop releasing movies like these on the same day as Star Wars gets released to theaters unless they can bring a way better movie that isn't juvenile like their latest attempts yet. Literally worth the shot once it becomes able for rent but don't expect to find anything that can hold this movie back from its score."
    },
    {
      "rating": "6",
      "text": "As I watched Ferdinand I couldn't help feeling I've seen the movie before.  The movie certainly breaks no new ground, and most of the characters don't have a lot of personality.  The movie perks up a little when the goat is introduced and gives the movie some much needed humor, but sometimes the goat's humor feels forced.  The horses are the funniest part of the film, but they don't have a lot of screen time.  The \"bull in the china shop\" scene is clever.  Overall, pretty forgettable and middle of the road."
    },
    {
      "rating": "7",
      "text": "1. Happy Holidays!2. Thanks to Disney,Fox will never release movies like this on the same day as Star Wars,THANK GOD.Ok,now onto the review.Ice Age 6 was b... Wait. It's not another Ice Age? Oh,thank goodness... But it's released on the same day as Star Wars? This doesn't look promising... Or does it? Because Ferdinand was a perplexing seat,honestly. Kind of like the Ice Age sequels: It's not good,but it's also not bad. As an adaptation from a kids' book,it's fine as a distraction for your kids,and it may be okay for adults,but I just don't think you can adapt 80 pages into a movie,and yet a major studio is doing this movie. Unlike Ice Age Collision Course,it does take control of itself,though. And so does its animation. While being shown with John Powell's accurate Spanish score,the animation is so impressive in here,it sometimes takes a leap into the term 'Artistic Cinematography'. And hey,the charachter animation is probably one of the best of the year,so there's that.I was also impressed with John Cena's voicework as Ferdinand,as well as Kate McKinnon as Lupe,even if it can get annoying at times (it's no Despicable Me 3,don't worry).But where does Ferdinand fall apart as a 'Middle-of-the-road Movie'? The story and the humor.As i said in the beginning,it's kind of impossible to adapt 80 pages into a movie,yet Blue Sky Studios takes some risks both story-wise and tone-wise,and i'm fine with it,but only if you do it correctly,because yeah,it's fine in several moments,but it can ruin the pace at certain times.Oh,and if you're wondering why the humor is one of the movie's flaws,here's this: Never make a Horse dab ever again,PLEASE. I get that they're trying to appeal to a certain audience,but can we just don't do that again?Overall,Ferdinand was a serviceable kids' movie. It's no Road-Chip and it's no Collision Course,but it still suffers from the story's execution and the (honestly) horrid humor.In a word: A-Ok."
    },
    {
      "rating": "9",
      "text": "Very funny with true massages about life itself . . .what else can you expect?"
    },
    {
      "rating": "9",
      "text": "Boy I was very pleasantly surprised by this movie - Very funny, warm, thoughtful, true to the feeling of the book (at least as I recall it) and gorgeous to look at. Laughed a lot and shed a couple tears."
    },
    {
      "rating": "4",
      "text": "Epically dumb animation with excellent visuals but hopeless writing. Very disappointing from Blue Sky."
    },
    {
      "rating": "8",
      "text": "From same masterminds of Ice age, the story of a shy, meek bull works as well as plea against cruelty to animals. The supporting characters are more laughish -the training goat- than annoying, and sequences like the pottery and the getaway makes worth the effort. Nice choices for kids in holidays."
    },
    {
      "rating": "8",
      "text": "Ferdinand is a kids' movie, and I am not a kid.  Nevertheless, I found the movie entertaining and the voice work particularly good.  I was put off by the use of the word \"sucks\" several times in a movie ostensibly for children, and there were the obligatory multiple references to butts, which become predictable and tiresome after a while.  The movie did, for the most part, manage to avoid references to excretory functions, which seem to be the source of much of what passes for humor in kids' movies these days.  Ferdinand is a very pleasant movie for younger children to see."
    },
    {
      "rating": "5",
      "text": "Weak, boring, unfunny. Like a lot of kid's movies coming out these days. John Cena's heartfelt performance is underplayed by the surprising lack of the titular character's development, in place of adhering to the rest of the cast which consists of about 90% comic relief that all fail to delivery any laughs or chuckles. Only for very small kids."
    },
    {
      "rating": "6",
      "text": "Mostly pleasant and also pretty forgettable, I mean it's not that it's bad but it isn't that good either, it won't be a classic for animation but I must say it looks pretty good, the story works enough and definitively will please it's target audience, so I can't really say anything more elaborated, it would be pointless."
    },
    {
      "rating": "10",
      "text": "I love this movie! This film teaches the children that when they grow up they do not mistreat the animals or kill them, since the animals are alive and they have the right to live, it is a very educational film for both children and adults!"
    },
    {
      "rating": "6",
      "text": "At least it's better than The Boss Baby + The anti-animal cruelty message represented very well from the perspective of the bulls and also merged very well with the message of individuality.+ The animation is simple yet very beautiful, and the human characters' designs are really something special; every single human character design is different from the other and also very suitable for their Spanish nationality+ John Cena did a great job voicing the titular character, I mean who could be better than him voicing a strong bull with a big heart?+ \"Home\" is really a very good song and surprisingly moving!+ The final bullfighting scene is very well directed.------------------------------------------------------------------------------------------------- The humor is really really bad in this movie and 99% of the joke didn't work for me. Every bad joke you could imagine is in this movie; they are very silly, they are clichéd and they are so long that make you bored!- There are a lot of useless characters who are often supposed to be funny (okay, maybe the hedgehogs weren't that bad), and their introduction seemed like short films not just because they are long scenes but also very bad edited.- Unexpectedly, the relationship between the little girl and Ferdinand seemed to be forced to the movie. I really think it's not that important to the story, and the movie itself didn't care so much about it; it didn't give it a lot of time to be emerged or to be felt throughout the movie."
    },
    {
      "rating": "4",
      "text": "it's about time we meet again..FerdinandThe animated features are supposed to attract the viewers into their new and attention seeking world and to be rich in details which helps connecting to them, unfortunately none of it is offered in here. Just a mere idea is projected by Carlos Saldanha; the director, which already was present in the original book and addition to that, it fails on delivering what was already there too. John Cena at the centre of it, is quite convincing but in here Kate McKinnon steals the show as her character is strong too along with her work. Ferdinand is a forward pass in its first act and a complete downer on its second one where all the clichéd characters and sequences jumps in that awaits and predicts the last act that even though being exhilarating (the chase scene is the only high point of the feature) couldn't charm anyone."
    },
    {
      "rating": "6",
      "text": "Pros:-Stellar Voice Acting-All the main characters are very likeable and enjoyable to watch-Decent humor-Really good animation-Pretty good script-I really like the message it sends about friendship and doing the right thing, as well as it’s messages about how it’s okay to be different.Cons:-Some side characters, mainly the horses, are pretty annoying-The soundtrack, while it works in the context of the film, is pretty forgettable-The movie can be a bit predictable at times.Final verdict: Overall, I enjoyed Ferdinand, and it’s definitely one of the better films to come out of Blue Sky Studios in recent years. It’s not perfect, and I wouldn’t say it’s on the same level as most Disney or Pixar films (Ironic saying that since this is now technically a Disney movie after they bought out 20th Century Fox but now I’m getting off topic here), and I don’t see myself watching it again anytime soon, but if you are interested, it’s worth a look."
    },
    {
      "rating": "8",
      "text": "Es muy bonita de ver, aún más sabiendo toda la historia que tiene detrás de censura franquista."
    },
    {
      "rating": "6",
      "text": "Ferdinand was a decent movie that lived up to my expectations, however that being said, my expectations were not very high. The plot was pretty predictable and the humor was often-times crude. Also Ferdinand managed to save something around 6 bulls from dying so when Ferdinand is living happily with his family more bulls are still fighting and losing in the ring in his animated world. Overall it was a pretty good animated movie for children."
    },
    {
      "rating": "10",
      "text": "Es una película animada increíble, sin duda nos deja un mensaje hermoso que debería la humanidad tenerlo en cuenta."
    },
    {
      "rating": "5",
      "text": "\"Gee Ferdinand, I wish the world worked like that for ya\", is the line said by ferdinand's father to him at the starting, just before he was going to leave the ranch, is a great line. The problem is that the movie never takes that forward, it just ends up being a hugely predictable story and a shabby script and dialogue. Another problem was the ending, which is sooo like blue sky studios. If it were pixar or dreamworks, they would have made it much more interesting and emotional. I also felt they ruined it by showing that Nina come at the end, for no damn reason at all. It should explored the message it wanted to convey more, instead of just making it a bland story with a bad ending. But to the film's credit, it had great animation and you can't deny that it's filled with wit and humor, making it a fun ride throughout, also having some great voice-acting. But in the end, it's just another bad attempt by blue sky studios."
    },
    {
      "rating": "7",
      "text": "The screen version of the classic childrens book. Not a bad effort but could of been better. John Cena does surprise in a good way with his voiceover role."
    },
    {
      "rating": "10",
      "text": "Maravillosa, una película preciosa para cualquier edad que enseña valores muy importantes."
    },
    {
      "rating": "7",
      "text": "Much of the film relies on filler and overdone cartoon shenanigans, but both the film's bold message and the voice cast (with John Cena's passionate vocal performance of the titular character being the main highlight) help secure a well-balanced viewing experience for the whole family. It's a refreshing film from Blue Sky Studio, who have certainly exhausted their popular \"Ice Age\" series. For younger audiences, this will simultaneously appeal to both the fun and serious sides of their ever-growing minds."
    },
    {
      "rating": "6",
      "text": "Ferdinand is an animated film based on the children's book \"The Story of Ferdinand\" by Munro Leaf and Robert Lawson. The movie, directed by Carlos Saldanha and produced by the studio behind the Ice Age and Rio films, follows the story of a Spanish fighting bull named Ferdinand (voiced by John Cena) who dreams of a non-violent life. When he is mistaken for a fierce fighter and recaptured by his former trainer, he is determined to prove himself as the peaceful bull he knows himself to be. The film is visually pleasing, with a colorful animation style and a playful, light-hearted tone. It also touches on themes of conventional masculinity and animal cruelty, and is suitable for younger viewers. While it may not be highly original, Ferdinand is a fun and heartwarming film that should leave parents and children smiling._______________________________Ferdinand es una película animada basada en el libro infantil \"La historia de Ferdinand\" de Munro Leaf y Robert Lawson. La película, dirigida por Carlos Saldanha y producida por el estudio detrás de las películas Ice Age y Rio, sigue la historia de un toro de lidia español llamado Ferdinand (con la voz de John Cena) que sueña con una vida no violenta. Cuando lo confunden con un luchador feroz y su antiguo entrenador lo vuelve a capturar, está decidido a demostrar que es el toro pacífico que sabe que es. La película es visualmente agradable, con un estilo de animación colorido y un tono alegre y juguetón. También toca temas de masculinidad convencional y crueldad animal, y es adecuado para espectadores más jóvenes. Si bien puede no ser muy original, Ferdinand es una película divertida y conmovedora que debería dejar a padres e hijos sonriendo."
    }
  ]
}