{
  "id": 277,
  "title": "Fifty Shades of Grey",
  "starring": [
    "Dakota Johnson",
    "Jamie Dornan"
  ],
  "runtime": 125,
  "genre": [
    "Drama",
    "Romance",
    "Thriller"
  ],
  "description": "When college senior Anastasia Steele steps in for her sick roommate to interview prominent businessman Christian Grey for their campus paper, little does she realize the path her life will take. Christian, as enigmatic as he is rich and powerful, finds himself strangely drawn to Ana, and she to him. Though sexually inexperienced, Ana plunges headlong into an affair -- and learns that Christian's true sexual proclivities push the boundaries of pain and pleasure.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/63kGofUkt1Mx0SIL4XI4Z5AoSgt.jpg",
  "categories": {
    "plot": 2.3448275862068964,
    "acting": 2.125,
    "ending": 1.5,
    "soundtrack": 10.0,
    "cinematography": 1.0,
    "familyFriendly": 1.0,
    "funny": 5.666666666666667,
    "action": 2.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "\"Boring (Two Hours that Feel Like Two Weeks- the movie is too LOOOONG), Derivative (The Story of O and 9 1/2 Weeks both did it much better, and with a better-looking cast, if this S & M genre is your thing) and Embarrassingly Stupid, 50SOG is Dreck for Those Whose Brains Have Been Scooped Out\"\r You would have had to have your brain scooped out to buy into the absurd premise that this boring, monotonous, derivative, cheesy-porno dreck has anything to do with love, or even satisfactory coupling.  If you manage to make it through the movie without nodding off at the tedium or just cutting your losses and leaving early, you will understand why the distributors and their media enablers had to promote the heck out of this dog to get people into the theatres. The record that 50SOG should be setting is \"the year's biggest gotcha.\" What a bunch of hype for a zero of a movie.\r The thin storyline is nothing new. To reduce it to its basics and give nothing away that you probably have not already surmised just from the trailer and the heavy hype leading up to its release:  Sicko beats up Flavor of the Moment and she pretends to enjoy it in exchange for access to Sicko's money and trappings, natch.  Charming, huh?  A romantic Valentine story?  Not and not.\r Tinsel Town has reached another low in this stinker of a movie with its fake flagellations, man-on-woman violence and gratuitous sex.  About the best that can be said is that at least you get to sit in a theatre seat out of the winter cold for two hours, and you do have two hours of escapism where you do not have to consider the day's beheadings by the Islamic terrorists steadily expanding their already-New Hampshire-sized territory.\r 50SOG is pretty much devoid of imagination:  If this S & M genre is your thing, the oldie The Story of O, or even 9 1/2 Weeks, is not as tedious as this movie is, and those casts are better-looking and better actors.  Older filmgoers might also vaguely equate the lack of merit in 50SOG with the icky, degrading Last Tango in Paris:  Maria, the butter.  Ana baby, the whip.  Hollywood cannot seem to \"discipline\" itself to avoid these irresponsible and degrading themes.\r Obviously, 50SOG is unapologetically anti-woman and pro-sexual-violence, and generations of women with any sense of history or context (and critical thinking skills surpassing those of a second grader - and let us not forget that most second graders would have a keener sense of stranger danger than apparently the stupid Ana does) are hurling in their popcorn to think that any moviegoers, particularly the confused women who have fueled the success of this dud in both book and now movie form, mistake sexual assault and battery with love, romance or satisfactory coupling.  Sexual abuse is not love.  Abuse is not cute, not clever, not cool, not fun, not funny, not entertaining.  Abuse is sick and an offense.  Where is the PC Police when you really need them?\r The US film industry must be pretty dead, too, if Melanie Griffith's daughter could not get better work than this merde, given her connections.\r Bottom line, as is obvious from my opinion as expressed in this review, and which also seems to be the 186 to 132 majority view of reviewers on this thread:  Save your time and money for a good movie, as 50SOG stinks.  About the only reason to waste your time with this dog is if it is a cold day and you need a place to get in out of the elements for two (long) hours and you only have $14 in your pocket.  Otherwise, stay clear.- La Mer\r Rating: One half of one star out of five stars."
    },
    {
      "rating": "2",
      "text": "I've watched this with my wife on Valentine's Day:\rMy score: 0 - Nothing to see here...\rHer score: 4 - He liked some BDSM actions, but film was boring\r So we are giving it 2."
    },
    {
      "rating": "3",
      "text": "Boring. The movie is about sex. BDSM. It seemed like the creators only wanted to dwell upon that, but unfortunately had to create some background story, because you don't get directly to sex, you get porno if you do. So all the plot is extremely weak and its only purpose is to provide the terms for sex. Characters behave unrealisticaly, they do unreasonable and random stuff, they get horny by looking and each other lips etc.\rYou might think \"Well, I bet at least the sex scenes themselves are cool\". No, they are not. They are neither appealing, nor horryfying, nor passionate. They are lame and boring. The deep breathing, fist clenching, shouting etc. seem out of place for there is no real cause for them.\rAnd it gets more and more random. During one of the final scenes which were supposed to be extremely dramatic and make viewers cry the entire cinema hall started to clap and burst into laughs because what was happenning on the screen was random, illogical and simply stupid."
    },
    {
      "rating": "0",
      "text": "I was embarrassed I forced my date to see this terrible movie.  It turned both of us off  rather than being an exciting and liberating sexual movie. I spent the rest of the day apologizing and distancing myself from the choice."
    },
    {
      "rating": "0",
      "text": "A wanna be softcore/pinku movie that every women who read the book will definitely enjoy.\rWTF is wrong with hollywood these days. Don't tell me that this piece of trash is going to have a sequel."
    },
    {
      "rating": "1",
      "text": "50 Shades of Disturbing\rI did not read the book. This is a porno horror movie dressed up like a glossy fashion magazine. As it was hyped by the media and released for Valentine's Day, I expected steamy, playful sex games...I was wrong. The young woman is a wide-eyed innocent. She is drawn to a handsome, well-dressed man who, despite brief flashes of whimsy or vulnerability, slowly reveals himself to be a brutal monster. This film glamorizes violence toward, and exploitation of women. If any of the young women or men lined up to see this film come away thinking that inflicting pain on another person is sexy, it will be a very sad outcome from all this gratuitous promotion of an ugly film dressed up to look pretty."
    },
    {
      "rating": "2",
      "text": "This movie is just TERRIBLE. For a movie about BDSM, there sure isn't much of it. Better off watching 50 minutes of Sasha Grey instead with your significant other."
    },
    {
      "rating": "1",
      "text": "If you like porn, go see the movie. But if you like good screen writing, acting, and good storytelling, don't bother. Here, everything just executes to a poor level. It seems to me like they focused on putting effort on the sex scene rather then the movie. And what do you learn at the end of it all? HEY GIRLS, IT'S OK TO BE IN AN ABUSIVE RELATIONSHIP! (So yeah, I'm pretty sure this sums to a pretty bad movie)"
    },
    {
      "rating": "1",
      "text": "A lack chemistry, and poor writing and directing, hamper a lot of films.  Ultimately, what ruins Fifty Shades of Grey is how it belies its own edgy reputation by playing it safe.  It doesn’t go dark enough with Christian’s sexual addiction for fear of alienating the suburban soccer moms who made it acceptable to talk about bondage at bunco night, nor does it go sexually far enough for fear of turning its R-rating into an NC-17, a financial kiss of death.\r Grey might be a color associated with steely control, but it’s also associated with being dull, and fifty shades of that isn’t worth two hours of your time."
    },
    {
      "rating": "2",
      "text": "Fifty Shades Of Grey had already become a huge thing before it came out. Same can be said for the weird sexual book by E.L James. Okay, Jamie Dornan was good as Christian Grey and Dakota Johnson was HOT. But the movie is very odd, the sex scenes are cut down so much, that it reaches the R rated level. The story confused me, part of Christian likes Anastacia,  but part of him doesnt. The movie was LOONG, it held barely any of my attention for 2 hours and 2 minutes. FSOG is a boring movie, it is an erotica that fails on its premise. This is a dissapointing adaptation,  that fans will surely have some fun with, but not be totally satisfied."
    },
    {
      "rating": "0",
      "text": "It is obviously the worst piece of crap ever. Nothing else to say but this thing demands at least 150 characters so there you go. I managed to make a more interesting comment than that movie."
    },
    {
      "rating": "1",
      "text": "A middle aged wifeys mid life crisis galore of their old sexual desires. I remember seeing a few parts from the book and it was terribly written! Only reason people liked it was because it was dirty. That's obviously the only reason people will want to see this. Ana is totally one dimensional and Mr Grey is actually kind of an **** and i feel like it's a cash grab due to the book selling so well to middle aged wifeys. Also, the film doesn't really seem erotic but almost glorifies sexual violence as a pleasure. I can imagine many females almost being offended by this and i as a male believe it is wrong to show as the main theme of the film almost. I know it's in other films but they never glorify in it and usually it's only a scenes worth in other films. This film is based around it. Awful."
    },
    {
      "rating": "10",
      "text": "Just finished watching Fifty Shades of Grey and I gotta say... the film was beautiful. Yes, I am using the word beautiful to describe this movie. I went into the theater completely prepared to be embarrassed because of how graphic it was supposed to be, but I was extremely surprised by how I actually felt. I watched all of the scenes that were made available and thought that it all seemed a bit awkward, but it was only because there was no background music or noise. Watching the actual scenes in the movie was a whole other experience.\rThe movie is getting a really bad rep because of the bad writing and graphic scenes that are in the book that it is based on. However, the movie is not just a \"sex movie\" like everyone says. It's pretty hilarious and romantic. The sex scenes were extremely dialed down and they all served a purpose. If you thought the pointless sex in The Wolf of Wall Street was acceptable, then you would be more than okay with the content in this Fifty Shades. Before I watched Fifty Shades of Grey, I watched a lot of interviews with the cast of the film and was confused as to how they could possibly describe the sex scenes as being classy and elegant. But then again, all I had to compare it to were scenes from Game of Thrones, True Blood, The Wolf of Wall Street, etc... After watching this film, I can honestly say that I completely agree with the cast. There was nothing \"dirty\" or \"wrong\" about what I was seeing on the screen. Sam Taylor-Johnson, the director, did an excellent job with this movie. She made it very tasteful and easier to accept. This film could have gone in a very bad direction, but thank god it didn't.\rFor those of you that think that this movie is glorifying abusive relationships, think again because I think that it actually empowers women. I'm sure that you can argue, with quotes from the book, that I'm wrong, but there are many differences between the film and the book. Let me remind all of you that the book is a little over 500 pages and the movie is only about 2 hours long. Obviously, they had to cut a lot of things out, including the blue string scene that I'm sure a lot of people are aware of. In my opinion, they cut out many of the scenes that were considered controversial. I watched the movie looking for signs of an abusive relationship, but I really didn’t see anything of that nature. In fact, all I saw was this confident and empowered woman that made all of her own decisions. She was not forced to do anything that she didn’t want to do. She wanted to explore Christian’s dark world and her own sexuality. You can argue that Christian abuses her physically and emotionally, but he does what she tells him to do. When she says stop… he stops. He tries to give her what she wants.\rMoving on to something lighter, the comedy in this movie is on point! There were many “laugh-out-loud” moments that gave the movie a lighter mood. Those scenes were there to show that Christian and Ana’s relationship was not all dark and serious. I mean they are both young people in their twenties that should be having fun!\rDakota Johnson gave a phenomenal performance and did everything right! She was confident, awkward, shy, and funny all at the same time. Jamie Dornan also did an amazing job as Christian Grey. They had great chemistry.\rI guess what I’m trying to say is that you should give the movie a chance. If you hate the book, it doesn’t necessarily mean that you will hate the movie. I have read many reviews, written by skeptics, saying that they ended up loving it. Don’t let the bad reviews or even the book itself stop you from seeing the movie. I was not disappointed at all with the finished product, even though they cut out a few scenes that I loved. It is perfect just the way it is.\r(I apologize for any grammatical mistakes... Unlike Ms. Steele, I am not an English major)"
    },
    {
      "rating": "1",
      "text": "I read a 1/4 of the book so I had an idea of what the movie entailed. To me, this was just a different version of Nine and 1/2 Weeks. I thought Anastasia was too unattractive for the part, but played a good innocent type with a dominating side to herself. Christian Grey was cast well. For the most part, the movie was weak and easy to make fun of. It did not turn me on at all. I think this is more for the young and inexperienced in life. I think it's sad when a person has to result in getting tortured to feel fulfilled. Overall, not impressed."
    },
    {
      "rating": "1",
      "text": "All it has is sex no real story its a terrible movie that should not be supported IMO Don't let the popularity and advertisement of this film fool you, because this film is bad. It's not even bad - it's atrocious. With little 'erotic' behavior and a whole lot of caked over domestic violence, this movie is not only bad in the sense of story and bad acting, but teaches women to stay in abusive relationships."
    },
    {
      "rating": "0",
      "text": "As a girl I expected this to be a nice movie. It just isn't. It's boring and with no story at all. Avoid at all cost cause only thing I wanted to tie after this movie is a noose around my neck."
    },
    {
      "rating": "2",
      "text": "Cheesy, cringe-worthy dialogue. Wooden, robotic performance by Jamie Dornan, who lacked the intensity and charisma needed to pull off the character. Dakota Johnson was ok, and had a charm to her but had no chemistry with the other lead. Awful, unsatisfying ending."
    },
    {
      "rating": "0",
      "text": "Fifty Shades of Grey more like Fifty Shades of Abuse.\r The story is about a literature student, interviews the wealthy, intimidating Christian Grey and instantly develops an attraction to the enigmatic man. Grey is likewise drawn to Ana - but will only agree to a relationship on his own terms. Both will discover a place where want and desire intersect.\r Fifty Shades of Grey was a movie that I had zone interested in, because I was in that bad mood where if I see a best selling novel being made into a movie which is a cliche now, and now there did it with Fifty Shades of Grey which by the way the book sucked ass, yeah I red the book and I had no idea why it was a best seller it's basically porn on paper. What's more annoying is in the UK there are people on the Radio and everyone I met who was looking forward to this movie and my Question is why. The people on the Radio keep making top stories about it making it the hot headline and I'm here thinking \"That's really new worthy. There's loads of usual but amazing things happening around the world and this peace of **** makes the headline. My hope for humility is slowly fading away\". And that's not all, I'm not kidding you here but there actually made a headline of it's reviews it's getting and this never happened before when it comes to movies. So after seeing Fifty Shades of Grey I can say it's not as bad as people say, it's actually a lot worse then I thought.\r Now let me give you the positive things in this movie: Dakota Johnson was the only good actress in this movie, she did what she can do with a god awful script that she had and shes the only one in this movie that gives it her all. The movie is shot really good as well, it fitted the movie very well, but beside's that all those good things can't hind the fact that this is a abomination against humanity, it brings shame to cinema and it should be burn in hell.\r Now let's talk about Mr. Grey The Psychopath, now I got to ask you this what do women see in this guy, I mean his not charming at all, his cold, he's kind of a **** and what he want's to do is hurt you with sex, and the actor himself isn't really that good at all. And she doesn't enjoy it she only does it to make him feel good so in the sex scenes she's not enjoying it, she's getting hurt by this guy and after a while she get's crossed with him and then she runs off then start's to have thoughts about him and how she needs a man in her life so she goes back.\r The writing in this movie I don't know if it's for comic relief or to be taken seriously, because the writing in this movie was absolutely atrocious and it's the most cheesiest dialogue ever put to film, it's Twilight dialogue bad.\r Now is this worse than Twilight and I can't believe I'm saying this but yes it is. I found a movie that's more awful and more laughable than Twilight. I hated this movie, I hated it, I HATED IT, I HATED IT. This is the worst movie of 2015, I can't wait to forget this film. You better off seeing Kingsman: The Secret Service, I haven't see it myself yet but at least that movie looks well made and effort went into it."
    },
    {
      "rating": "2",
      "text": "This is destined to be the worst movie of the year.Oh My God what is this movie,the acting is terrible the two main actors have no chemistry at all that makes you wonder who chose them.There are some okay-ish looking scenes here and there but that's it.Terrible one liners and to think that they are getting a freaking sequel to this boring ass movie.What is the point of it ? Why does it have to exist I will never understand."
    },
    {
      "rating": "3",
      "text": "Kinky not really, Fifty Shades of Grey falls flat.  The problem is that the film is pretty boring and also has a poor script.  You can definitely see the Twilight fan fiction, though this film at least looks good.  D"
    },
    {
      "rating": "0",
      "text": "Twilight fan-fiction.. need I say more?  Twilight fan-fiction.. need I say more?  Twilight fan-fiction.. need I say more?  Twilight fan-fiction.. need I say more?"
    },
    {
      "rating": "0",
      "text": "OMG. What's with all the hype with this movie??? This movie sucks ass! This movie is probably for horny teenagers or single people? Definitely not for married people.  I'm beyond disappointed. My husband and I gave up watching it after 50 minutes into the movie. ﻿"
    },
    {
      "rating": "0",
      "text": "This is a movie about nothing. I left the cinema and I've asked myself, what it is all about? There is no plot, just a guy dating a girl like we see in every movie as a subplot. This movie has only the subplot. The trailer you see is the movie itself. For those who want some hot action, sorry but there is none, just some kissing scenes and romance, and they're so poor(not even closer to those 90's soft porn). I swear, there is no sex scene and the dude does not even use all the spanking stuff he has there. When he beats her with 6 whippings(camera on dude's face, then SLAP!, then girl's face), the movie is over."
    },
    {
      "rating": "0",
      "text": "Worst movie I think I've ever seen.  Boring, slow, and uneventful.  Even the \"sex\" scenes were boring, and that was that bad.  There was no chemistry, and the movie ended before anything interesting could happen.  It might have been alright if they cut an hour from the movie of useless garbage, moved it along at a much faster pace, hired some actors that could make someone believe they have some sort of feeling, and put a proper ending to the movie."
    },
    {
      "rating": "0",
      "text": "some body say this is a love story!!!! I don't think so. love not like this!! this is sexual dreams of the author...with this movie we see fall of the Cinema... oh **** cinema is dying help..."
    },
    {
      "rating": "0",
      "text": "By far the worst movie I've ever seen.  Almost walked out (and I've never done that before).  I actually liked the book.  Their relationship had humor, intelligence and she had strength that ended up \"saving\" him.  The movie captured none of that.  The acting was flat and wooden, the casting was awful.  They should have hired Ian Somerhalder.  He has the drop dead gorgeous looks of a Christian Grey and he can act.  It was so awful they'd have to pay ME to see the other 2 when they come out."
    },
    {
      "rating": "1",
      "text": "This is the first movie that I have seen in a VERY long time that I would not even see through to the ending. I'm a guy so I do believe that it is more difficult for myself to get wrapped up into Mr. Grey's appeal in the movie, however, to me he was just boring, and too out of reach and unrealistic. In my opinion, Mr. Grey would have been better suited had he been more down to earth and realistic. I believe that most of the female's attraction for him was wrapped up in wealth and materialistic things rather than sexual pleasure. All in all, I was very disappointed in the film, so much that my girlfriend and I attempted watching this film together and she turned it off before I could."
    },
    {
      "rating": "3",
      "text": "This is exactly what you would expect from a film based on a book that was initially just a moronic Twilight fan fiction novel. The relationship makes no sense, the basis of the plot makes no sense and it glorifies physical and emotional abuse."
    },
    {
      "rating": "0",
      "text": "\"iF THE SAME STORY TOOK PLACE IN A MOBILE HOME IT WOULD BE AN EPISODE OF LAW AND ORDER SVU\" -Anonymous    This movie will make you lose all faith in humanity..."
    },
    {
      "rating": "4",
      "text": "\"50 Shades Of Grey\" may be easier to describe as \"The R-Rated Twilight\". Yes, substitute all the main characters of \"Twilight\" with the same generic pornstar-named characters and all the action with pointless BDSM (I heard even the sex scenes don't come close to the ones in the book) and you might as well have the ultimate mother-flick movie that's going to turn your valentines day upside down."
    },
    {
      "rating": "4",
      "text": "If I’m being honest, I should be damning the Fifty Shades film to hell. It’s an adaption of one of the most poorly written novels in recent memory and makes the Twilight trilogy’s Stephanie Meyers—which it initially originated from, being a fan fiction—look like J.D. Salinger. It’s also one of the poorest representations of the BDSM community I’ve ever witnessed and I’d argue that it’s actually about a mentally unstable man who uses “BDSM” to stabilize his sadist mind—if I took “erotic” fan fiction seriously. But Fifty Shades of Grey just wasn’t as unwatchable as I initially predicted it to be and, to my surprise, it has entertainment value—if not in its target audience, it has laughable dialogue, cheap acting performances, and an overall sense of silliness, the way it boasts the fetish it knows nothing of, which should make it a must-see for the ones who antagonize it most. But otherwise, this isn’t a film I wouldn’t particularly remember, for better or worse, if it weren’t for the controversy, criticism and cultural criticism surrounding it. It’s merely a mediocrity dressed in clothing that might catch everyone’s attention, both good and bad, but some of us who neither treasure nor hate this franchise see how unfitting it truly is."
    },
    {
      "rating": "3",
      "text": "Consider my inner goddess unsatiated with this surprisingly boring and dull adaptation of E.L.James' already terrible book. No chemistry between leads and wooden BDSM action."
    },
    {
      "rating": "2",
      "text": "No es novedad que un libro tan viral, con tantas ventas, al final del día realicen una pelicula sobre esta. Quiero decir que no leí el libro (ni lo leeré) pero en cuestión de adaptación y censura, supongo que tuvieron que cortar demasiadas escenas de sexo (algunas sumamente estúpidas) para que esta pelicula lograra por lo menos una clasificación \"R\" (o C en México) pero en fin, recuerdo que me senté frente a la computadora y me dije: \"veré esta pelicula sin la necesidad de buscarle contras o con la intención de criticarla\" pero esto no duro ni 10 minutos, la pelicula es un error total, en primer lugar, no me cabe en la cabeza la idea de que esta pelicula es romance y amor (el cual no lo es) pues yo solo veo una atmósfera tétrica, oscura, estúpida, repleta de Sadomasoquismo o masoquismo. ¿Desde cuando las mujeres ven a un hombre enfermo mental atractivo? no lo entiendo, ¿sera porque es millonario? ¿tiene autos de lujo? no tengo idea. Fifty Shades of Grey cuenta la historia de Anastasia, una estudiante virgen tímida que va a entrevistar a Christian Grey para un trabajo de su compañera de cuarto, la interacción de Jamie Dornan con Dakota Johnson es plana, no se sienten reales, Anastasia siempre tiene la misma cara: \"orgasmo\" \"tristeza\" \"orgasmo\" \"enojo\" \"orgasmo\".\rLa relación de estos dos es tonta, aburrida y poco interesante, ambos personajes no aportan nada de carisma, se vuelven tediosos y odiosos, por poner un ejemplo:\rChristian Grey: \"te regale un auto, una computadora, libros y todo lo que tu desees ¿seras mi sumisa?\rAnastasia: No, no quiero volver a verte (pasan 2 minutos) Te amo.\rPor el amor de Dios, esta pelicula es basura! Con lo que respecta a las escenas de sexo, prometen mas de lo que son, así que no vayas con la idea de que veras escenas sexuales sumamente explicitas y polémicas.\rSam Taylor-Johnson hace lo que puede en esta pelicula, no es culpa de ella que la pelicula no funcionara, de hecho se ve que puso todo su esfuerzo para que al menos fuera pasable, la culpa la tiene la historia (y por supuesto la escritora E.L James) una historia aburrida, nada interesante, mediocre y con poca originalidad (¿olvide mencionar que esto es \"Crepúsculo\" con sexo?) Lo unico perdonable de aquí es el Soundtrack (por parte de Danny Elfman) no es que sea una obra maestra, pero es lo unico decente que tiene esta pelicula (¿esto se le puede llamar pelicula? este termino no entra aquí...)"
    },
    {
      "rating": "3",
      "text": "BIG FAMOUS BEST SELLING BOOK... terrible money making movie. This movie was created only to make money since the book became famous because of its erotic clasification and a controversial BDSM related themes. I've read the books and after seen the movie, I was very disapointed, the MOST important thing about this book is every thought Anastasia had about Grey and BDSM, in this movie you cant get to know what is going on in her mind. You can interpret that she doesnt like the way he is or the way he treats her, but she still got into BDSM practices, and the important WHY she did it, its totally missing. To make this movie even worse, one of the things that people critizised about the book, is that BDSM is practiced by people with psychological problems, people that need help, people that are sick... and once again this movie fails into proyecting this same way of seen Grey as a sick person.\r Bad sex scenes, failure in thansmiting the main ideas of the bdsm and Anastasias thoughts, and TERRBLE performance of the principal character Christian Grey, in the movie he looks like an idiot, VERY different form the book.\r Dont waste your time watching this movie, I know many people dont like to read, but believe me, if you want to know what the fifty shades are all about, you better read the books."
    },
    {
      "rating": "1",
      "text": "Here's another movie that acts like a joke on the book that it's based on. Instead of calling it Fifty Shades of Grey, let's call it Fifty Shades of Jokes on the Book."
    },
    {
      "rating": "0",
      "text": "Just no...Seriously, it's a very boring film that went far longer than necessary and without a central, well-written plot to guide it. The actions that are taken by the characters are unrealistic and are forced without legitimate motivation other than the shallow romantic tension between the two main characters."
    },
    {
      "rating": "6",
      "text": "Dopey but never dull, 50 SHADES OF GREY is way too somber for its own good. Why are these films always so serious? Shouldn't S&M be fun? Or mean and nasty. Something. Luckily, saw this in Spanish in Mexico City which made it far more entertaining than it should be. Dakota Johnson is pretty damn good though. Question: Why does each generation need a story like this? From STORY OF O to 9 1/2 WEEKS to 50 SOMBRAS DE GREY. WHY? Inquiring minds want to know."
    },
    {
      "rating": "2",
      "text": "Haven't wanted to walk out on a film since \"Mighty Morphin Power Rangers\". I couldn't do that at this film since I was on a date, thus compounding my suffering. No story, no character development, no resolution, and grade school dialog make this the loser film of the year. Before I even said a thing after the ending, my date apologized for dragging me out to this atrocity.\r This sums it up: Let's write a novel about every girl's fantasy unicorn of a man, include an S&M component to add an aspect of taboo in order to pique more interest, then start a viral marketing campaign to get people to talk about the novel. This'll cause everyone to read it to see what the big deal is. When they find out there's no big deal, they'll be asking everyone else, what the big deal was, spiraling the virality of the novel. And then of course, capitalize on the commercial success of this marketing ploy by making a film on the cheap and let the viral aspect do all the marketing of the film for you.\r Final step, use your Benji's from novel/film profits to light up your contraband Cubans whilst bathing in champagne."
    },
    {
      "rating": "2",
      "text": "Fifty Shades of Grey should have been a guilty pleasure film. It wasn't. Instead Fifty Shades is filled with a tedious plot, completely forgettable side characters, leads that have no chemistry and lame BDSM scenes. I wasn't aroused. Nuff said."
    },
    {
      "rating": "2",
      "text": "So, I don't know what kind of dimwitted mind thought this was a steamy film, or even a romantic film for grown-ups. \"Fifty Shades of Grey\" is and feels like the byproduct of a corporative contract. If the book it's based on is just laughably pedestrian and dull, the film equivalent nearly rivals it in monotony. There's no emotion, no passion, no life; like Christian Grey, it's all cold, calculated and mechanic. Want to watch a real steamy film about sex for grown-ups? Please go and watch Stanley Kubrick's 'Eyes Wide Shut' and avoid this infantile, seems-to-be-made-for-promiscuous-teenage-girls drivel at all costs. And, the 'strong sexual content' that the MPAA rating suggests is a joke."
    },
    {
      "rating": "1",
      "text": "I once was wet, but now I am dry.\rDid anybody read that story about the woman who saw this is the theater and then shat herself? Manchester I think it was."
    },
    {
      "rating": "1",
      "text": "Never read the book, wasn't expecting the film to be any use and I was glad not to be proven wrong this time. I was not the only person to spend most of the film laughing at the endlessly boring scenes of terrible dialogue given by one dimensional characters with not a shred of chemistry between them. No character development whatsoever with lame attempts at adding backstory that at that point I just didn't care about. As for the rest of the film, to say it was cringeworthy is an understatement, awkward and pathetic.\rTo everyone involving in the making of this \"film\": if you set out to make a good movie you have failed miserably, but if you set out to make money gratulations and enjoy your time upon your giant throne of money to which I am sorry to say I contributed."
    },
    {
      "rating": "0",
      "text": "I knew i was going to hate the movie within the first five minutes. It's just silly the two main characters are hard to like and habe zero chemistry. The dialogue is painfully slow. There is supposed to be a build up to the intimate scenes but even those are really really boring and nonsensical. I won't even  go into how deeply offended and violated the movie made me feel as a woman. Disgusting. Worst movie I've watched so far."
    },
    {
      "rating": "0",
      "text": "test review, IGNORE IT..............................................................................................................................................."
    },
    {
      "rating": "1",
      "text": "The story is lazy, the premise is a twilight ripoff and overall the characters are terrible, Fifty shades of Grey proves to be the worst film of the year and quite possibly one of the worst films that i have ever seen"
    },
    {
      "rating": "0",
      "text": "What the actually **** did i just watch ! i hate this ****ing movie! This should be about ****ing and they give me this softcore **** ."
    },
    {
      "rating": "0",
      "text": "Absolutely hilarious to watch if you're anything like me and enjoy some cringe from time to time. It's rigid performances and sobering book accuracy make for one of the most unnatural romance films in recent history. There is no chemistry here,no drama,no concerning conflict. Just a billionaire with unresolved ptsd and a God complex. It's unfortunate how seeing the supposedly sexy words that captured many on pages be said by real life people without discernable irony such as the repulsive flirting post contract negotiation or the now infamous don't make love I **** To be honest I can't really admonish the film as it didn't have a lot to go on but with that said the actors didn't help. Jamie Dornan is unwatchable as the presumably (I presume because it's never expressed) sexy bachelor, he feels wooden and not in the intended way Christian was written (albeit terribly) to be. Dakota Johnson at least attempts and is unsuprisingly the only one willing to go bare for the sake of her charater. Another thing I  found frustrating was how no arcs were explored satisfyingly such as José attempted assault, the family dinner,his intimacy issues,Anna's fears etc. They just use every scene as interludes b4 they f ,nit as opportunities to develop characters. Overall this is a sprawling yet bare 2hr disappointment that I can't stop chastising."
    },
    {
      "rating": "10",
      "text": "The best movie! It’s not simple porn like some people say, even if you disappear all the explicit scenes the story is great."
    },
    {
      "rating": "10",
      "text": "Fantastic movie I'm sure after watching only first part you will fall in love with Anastasia Steele and Christian Grey There are also very wonderful, beautiful love story"
    },
    {
      "rating": "9",
      "text": "Finally a sexy romantic movie with a twist. Jamie Dornan brought out Christian Gray to perfection, he had me feeling like I understood the character pain and his desire."
    }
  ],
  "recommendations": [
    "fifty_shades_darker",
    "the_twilight_saga_breaking_dawn_part_1",
    "fifty_shades_freed",
    "the_wolf_of_wall_street",
    "the_shape_of_water",
    "the_lobster",
    "sex_and_the_city_2",
    "midsommar",
    "i_care_a_lot",
    "the_counselor",
    "boyhood",
    "magic_mikes_last_dance",
    "a_wrinkle_in_time",
    "the_darkest_minds",
    "gamer",
    "the_twilight_saga_eclipse",
    "old",
    "wonder_woman_1984",
    "sanctum",
    "vampire_academy",
    "polar",
    "shadow_in_the_cloud",
    "the_emoji_movie",
    "twilight",
    "seven_pounds"
  ]
}