{
  "id": 2570,
  "title": "Fighting with My Family",
  "starring": [
    "Florence Pugh",
    "Lena Headey"
  ],
  "runtime": 108,
  "genre": [
    "Comedy"
  ],
  "description": "Born into a tight-knit wrestling family, Paige and her brother Zak are ecstatic when they get the once-in-a-lifetime opportunity to try out for the WWE. But when only Paige earns a spot in the competitive training program, she must leave her loved ones behind and face this new cutthroat world alone. Paige's journey pushes her to dig deep and ultimately prove to the world that what makes her different is the very thing that can make her a star.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cVhe15rJLRjolunSWLBN6xQLyGU.jpg",
  "categories": {
    "plot": 7.6,
    "acting": 7.619047619047619,
    "ending": 8.666666666666666,
    "soundtrack": 5.0,
    "cinematography": 9.0,
    "familyFriendly": 6.0,
    "funny": 7.846153846153846,
    "action": 7.7272727272727275
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I wasn't too excited to see this movie at first.  I'm a huge wrestling fan and thought that the story of Paige wouldn't be enough to carry a movie.  I was completely wrong.  The movie had great pacing and touching moments at the same time, delivering a positive message for females, wrestler or not.  Highly recommended to anyone looking for that feel good true story."
    },
    {
      "rating": "8",
      "text": "A film that was better than I thought it would be. A film about following your dreams that contains strong comedic moments. Overall a low 8 an A-."
    },
    {
      "rating": "8",
      "text": "VERY GOOD MOVIE. Based on the real life of an English wrestler who went to follow her dream in the USA a few years ago. A tragic story, but what struck me the most and i think it's the best is the plot of his brother, who stayed on the other side of the pond because he was not accepted to fight, the story of how he deals with the frustration of not being able to follow his dreams and have to gave himself to the world to contribute their bit as a mentor and support new people who want to move forward."
    },
    {
      "rating": "9",
      "text": "Pugh is a rising star and Fighting with my Family is a stellar vehicle to keep it going. I actually wish that it was 10-15 minutes longer so that the ending doesn't feel as rushed."
    },
    {
      "rating": "9",
      "text": "Fighting With My Family, a film produced by lord of the box office Dwayne Johnson and written by the talented Stephen Merchant, is a fish out of water story with a twist: where normally the outcast, “freak,” responds to ostracism and hazing by rising above, Saraya imagines conflict between others and herself, misunderstands their motives because of her own insecurities. There are a number of wonderful moments of suspicion that display this split screen moment of both high drama and mundanity (in a way that’s somewhat reminiscent of bedroom scenes from Eighth Grade). Florence Pugh, who plays the star role, seems at ease in an wonderful departure from her debut a few years back in the erotic, historical thriller Lady Macbeth. She is plucky, awkward, nervous, and believably physical.Dwayne Johnson is used judiciously and there’s one headfake in the movie based on our expectation of his appearances in the trailer that does something sweet with his character. Saraya’s parents and siblings are supportive and thoughtful but quirky. Her parent’s story about their meeting (apparently a verbatim account based on end credit interview footage) is a fresh and compelling story of love and redemption. Wife found the most interest scenes of the film to be moments when people act out of character: when Zak, recently rejected by the WWE, reunites for the first time with his sister at a Christmas fight and goes off script.More from Wife’s critique, as the less satisfied viewer: because Soraya never seems that personally invested in her journey, is constantly in a position of questioning her ability and her willingness to continue, the stakes are never that high. In the worst case scenario, she gets what she wants, which is to go back to her loving family and work with them. Also, because her reaction when she’s “on stage” is to clam up and succumb to stage fright, we don’t have many instances when we can read her expressions.Problems aside, this is a fresh and unusual comedy that displays a young and talented actor’s talents. Go see Fighting With Your Family."
    },
    {
      "rating": "8",
      "text": "This is a really great movie and NO you do not need to be a wrestling fan to enjoy this movie. (I am but that is besides the point). The point is, this movie is one of those feel good movies. Its a movie that I feel has elements in it that we can all relate to in some way. It is a movie which shows the ups and downs of life but thrown up against the back drop of a wrestling story. It doesn't go for action or big fighting scenes. It goes for something real. Which for a movie based around fake fighting, really says a lot."
    },
    {
      "rating": "8",
      "text": "Sometimes you walk into a movie not expecting much and get completely caught off guard in a good way and that is just how I felt about \"Fighting With My Family\". Based on a true story we follow the tight-knit wrestling Knight family in Norwich, England, particularly brother Zak (Jack Lowden) and sister Saraya-Jade Bevis aka Paige (Florence Pugh) who both have the same dream of fighting for the WWE. They are finally given a chance to try out for a chance to go to the WWE's development league in Florida and there it will be decided who will go on to fight for the WWE.Let's say I know so little about wrestling that what I know is from the early days of TV when it was shown in black and white and everyone 'knew' it was fake! Let me just add that after writing it 4 times I had to google the definition of WWE!!  (Yeah, yeah, I know you all know but for the 2 besides me who didn't it is World Wrestling Entertainment.)Without giving too much away Paige is chosen while Zak has to go home and deal with what he sees as being a failure plus becoming a father. The Knight family also consists of another brother serving time in prison and a father (Nick Frost) and mother (Lena Heady), not your common parents except they have involved their children in the family business--wrestling--since the day they were born. An important figure in Paige's life becomes the talent scout/coach Hutch (Vince Vaughn--I didn't know he was in the picture!), who is aware what makes a star in the ring.Director/writer Stephen Merchant based the movie on a documentary of the family and he does a fine job dealing with the cliches of the sport, adding humor when needed and shows all the choreography that goes into a wrestling match. The only problem I had was understanding the accents in many scenes.As Paige Florence Pugh does a star-making turn and Jack Lowden holds his own in some tough emotional scenes. As the parents, Nick Frost and Lena Heady are in a class of their own though going through the end credits where you see the real people the actors are very mild compared to the actual parents. Vince Vaughn really does a fine job as the all professional coach who can get the best out of the trainees by being tough and empathetic.\"Fighting With My Family\" is the Rocky of wrestling and just as enjoyable though even if it is faked the 'sport' can cause some major injuries. When you get a chance, see it. I know I want to follow up watching the film by watching the documentary."
    },
    {
      "rating": "8",
      "text": "Despite what the trailers and promotional materials would have you believe, \"Fighting With My Family\" is actually not a studio comedy romp through the world of professional wrestling, prominently featuring The Rock. No, in fact, this directorial debut from British comedic mainstay Stephen Merchant is actually a much better drama than it is a comedy. Though, yes, it is most definitely funny at times, the comedy is nowhere near the film's strongest aspect. This is a triumphant, inspiring study of one family's plight to achieve a very specific dream, and the fallout that can ensue when they realize that only one of them can attain it. It's well-acted, well-written, sweet, and definitely worth a watch."
    },
    {
      "rating": "6",
      "text": "It's actually well made but deep down it's nothing but an ordinary inspirational sports and family film.And if you're not actually into the theme, well I've gotta say that the rest of the enjoyment is mostly up to you."
    },
    {
      "rating": "7",
      "text": "It's a well done if slightly predictable \"underdog\" story. Merchants script is touching without too much schmaltz and quite amusing too. All the performances are solid especially the underrated Nick Frost as the tough but kind hearted father. Pugh is also great as Paige herself getting the balance right between street girl with attitude and insecure outsider. I do wonder if some if Paig's lack of confidence and struggles were overplayed for dramatic effect though as I don't remember her ever faltering on NXT or WWE like she did in the film.Still, overall it's worth seeing even if you know nothing about wrestling."
    },
    {
      "rating": "9",
      "text": "For someone who hasn't liked wrestling for a while, I loved it! Kept me glued to my seat. Lots of laughs and interesting characters"
    },
    {
      "rating": "10",
      "text": "Als wrestlingfan ein echt guter Film und hat auch echt Spaß gemacht den Film zu schauen, sehe zu empfehlen"
    },
    {
      "rating": "8",
      "text": "For not being a fan of the WWE, I still enjoyed this film. Any movie that can but Lena Headey in a reindeer outfit and wrestle has got to be a good movie. Nick Frost and Stephen Merchant have fun roles. I question how often the Rock popped up in the real life version of this story but he is fine in the film. Embrace your inner freak, Respect to the real life Paige."
    },
    {
      "rating": "9",
      "text": "not really my type of movie, but i got really into this film love the story and i must say it is a must-see film ."
    },
    {
      "rating": "7",
      "text": "It's really fun and enjoyable film.. I watched the documentary about Paige's family and was awesome.. Stephen Merchant did a great job in writing, but not good in directing, but after all I recommended it to anyone interesting in a popcorn movie."
    },
    {
      "rating": "8",
      "text": "Fighting with my Family, a dramedy biopic of World Wrestling Entertainment's Paige's journey to becoming a wrestling celebrity and her family who are all wrestlers, is a fun little film. It's fairly humorous. The oddball dynamics and conflicts within the family work well. It's also interesting to watch the training required for the WWE. (Although if you really prefer the illusion of the stories and personalities and all of that, you may not want to see how the sausage gets made.)Paige's inner struggles could've been done better. Don't get me wrong, the protagonist has to have something to overcome, but her self-doubt was spread way too long. Doubt even occurs at her famed winning of the Divas belt, the most obviously manufactured scene in the film, which was a mistake. In order to be selected for such a publicized match, the wrestler's persona had to have been well-honed by then. Now that I think about it, you see Paige falter so much that you never get a real feel for her pubic persona at all.Fans of WWE should be warned that even though the organization produced this the movie doesn't have the feel of it. This is a very British film directed by comic actor/writer Stephen Merchant. It has more the general pacing and feel of Bend it Like Beckham.Florence Pugh does a great job as Paige. Heck the entire cast playing the family are pretty good, including Game of Thrones' Lena Heady as the mom and Nick Frost as the dad. He is really underappreciated as a character actor. He has all these little mannerisms that just make the performance. Vince Vaughn plays the more serious and predictable role of the tough but fair trainer/mentor, but he does it well and it's nice to see him no longer typecast after his Old School/Wedding Crashers period. Although the trailers advertise the Rock, he'sonly in three scenes. Still, he's THE ROCK and his first scene in particular is pretty funny.I know I might've given more description to the cons than the pros here, but that's because a lot of this film works so fluidly that it's hard to really focus on the positive elements. I legitimately enjoyed myself and I'm not a professional wrestling fan."
    },
    {
      "rating": "4",
      "text": "I couldn’t get past the realization that, ultimately, “Fighting with My Family” is World Wrestling Entertainment’s (WWE’s) tribute to itself.  The film’s Executive Producer is Dwayne Johnson, a WWE alum, with WWE Studios holding a major producing credit.  This lends the film a certain perspective. For example, the viewer learns that WWE is not fake, it is “fictionalized.”  One of the secondary characters quietly shares that she has moved on to WWE from modeling to “make things better for my family.”  We learn that Johnson, who makes a cameo, rose to superstardom (he’s the best-paid actor in Hollywood) from a humble wrestling family.The movie is based on the 2012 documentary “The Wrestlers:  Fighting with My Family” that chronicled the rise of Paige, real name Saraya Bevis, from a low-level professional wrestler in Norwich, England, to a major role in WWE.  Early on, we see Paige (Florence Pugh, so compelling in last year’s AMC three-part “Little Drummer Girl”) wrestling before modest local crowds.  After a tryout in London, she’s selected to participate in NXT, WWE’s developmental level (I’d like to buy a vowel).  While at NXT, she struggles to compete against three physically stronger, more attractive female wrestlers.  Life lesson:  models and cheerleaders have feelings, too.  Paige has a time of doubt and self-reflection.  Paige realizes that WWE isn’t just her family’s goal for her, it’s what she wants as well.  (I flashed back to Richard Gere’s “I got nowhere else to go” in “An Officer and a Gentleman.”)  Paige gets physically stronger, becomes a supportive teammate and embraces her underdog, outsider status.  Throughout this process, Vince Vaughn, Paige’s coach, mentor and occasional therapist, tries with occasional success to channel the tough but fair drill sergeant from every military movie ever made.Just before the closing credits, we are told that Paige is a key leader of the “women’s revolution” at WWE.  Oh?  How’s that?  Nothing in the movie addresses the relative role of women in WWE, good or bad.  We’re also informed that Paige remains the youngest-ever Diva’s Champion.  If WWE is admittedly scripted, how is this an accomplishment?“Fighting …” is not without merit.  It’s at its best when it focuses on Paige’s eccentric, wrestling-obsessed family.  As Paige’s father with a Mohawk, Nick Frost is fabulous.  You may remember him as Don in the movie version of “Kinky Boots” (2005) or working with Simon Pegg in “Shaun of the Dead,” (2004) the first rom-zom-com.  Lena Headey seems to be enjoying herself as Paige’s mother.  Some of the plot is actually sweet, sincere and inspiring.  For years, the family has befriended neighborhood kids, offering free wrestling lessons to keep them off the streets and away from drugs.  Paige’s brother even mentored a blind boy from the area who eventually became a professional wrestler.  Had the film focused here, it could have joined an impressive list of films exploring the British working class experience, beginning with 1947’s “It Always Rains on Sunday” and moving to more current, excellent films like “My Brother the Devil” (2012).  “Fighting with my Family” isn’t awful.  This is a movie with a good heart and a streak of kind sentimentality.  It’s just not terribly original.  If you want to explore the biography of someone emerging from modest circumstances to success in a non-traditional field, watch “Billy Elliott.”"
    },
    {
      "rating": "10",
      "text": "Surprisingly emotional not just some action movie with no feeling. Had heartfelt and touching moments."
    },
    {
      "rating": "9",
      "text": "My favorite film this year. It tells a great story about wrestling and equality of culture."
    },
    {
      "rating": "0",
      "text": "C’est, paraît-il, inspiré d’une histoire vraie… et c’est sans doute ça qui fait le plus peur ! une famille de catcheurs de père en fils et de mère en fille : on se croirait dans les Tuche : Tuche pas à mon catch !Volontiers vulgaire, ça ne fait pourtant pas rire le moins du monde ; ça désole et ça ennuie comme c’est pas permis : rien de plus affligeant que de tenter de regarder ça. D’ailleurs, on ne le regarde pas bien longtemps et même la télécommande ne le supporte pas : l’avance rapide fait des siennes, alors on appuie juste sur « stop ». Pour arrêter les dégâts.C’est en effet aussi bidon que ce prétendu sport bidon et truqué… mais il paraît que c’est de la « mise en scène »… soigneusement bidonnée elle aussi. Bien débile, niaise et gravos à la fois, cette sous-comédie finit dans les cordes. Et au fond des chiottes."
    },
    {
      "rating": "9",
      "text": "Best wrestling movie since The Wrestler.  There are some very touching moments in this film, and I teared up a few times actually!  That's when you know you've got a great film...when nostalgia is mixed in to give the audience a reminder of how great the WWE was in the late 90's.  There was one moment that really got me, and it was when the actress who played Paige was on the holiday vacation, on the verge of quitting NXT tryouts, sitting in her room looking into the mirror at herself.  And she looks up at the two posters on her wall at The Rock and Stone Cold Steve Austin, both holding their WWF Championship belts.  The camera switches focus to those two posters on her wall, and back to her, and she raises her cutout Divas championship belt over her shoulder like Stone Cold, and the rest is history.  Awesome movie, not just for wrestling fans, but for anyone who loves a good story.  Sure, a non wrestling fan may not have any clue who anyone portrays in this film, but like The Wrestler, who cares?  It's that good."
    },
    {
      "rating": "7",
      "text": "Muy divertida, la historia es lo mejor. Tal vez su problema es el casting de la protagonista, parece la versión minimi de la original."
    },
    {
      "rating": "4",
      "text": "This movie is sth that you can't imagine how bad is it, but still lots of people go and watch it. This matter reminds me that how much of stupidity is still exists in a large scale all around the world."
    },
    {
      "rating": "9",
      "text": "A fantastically feel-good delve into a sport adored by many, that also proves to be a thoroughly engaging family drama on its own terms. Fighting With My Family is more than deserving of a main event slot."
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)Dwayne Johnson tries to get us to take wrestling seriously with a biopic and instead fails as much as his career as a muscular people-pleaser and manages to do worse than Aronofsky (\"The Wrestler\", 2008)."
    },
    {
      "rating": "10",
      "text": "dope movie realy make  nother movie like this please people let's get it and go"
    },
    {
      "rating": "6",
      "text": "This is based on the true story of a British family that loved to wrestle. They put on exhibition matches around the country, but the dream of the brother and sister was to become WWE champions in America. This starts as a rowdy comedy with enjoyable characters, but once the narrative goes stateside, it becomes an underdog fight drama. The narrative quickly falls into a predictable path and even though it's based on reality, the facts have been compressed, which makes it feel more like a hokey cinematic trope. Still, it's still a heartfelt little film about a loving family and the unlikely success of one of them. Yes, the Rock does have small part (and is a producer)."
    },
    {
      "rating": "8",
      "text": "Good fun and great to hear a real-life success story I knew nothing about.Stephen Merchant crossed with The Rock seems like a weird combination at first glance, even if I had seen The Tooth Fairy, but somehow it all comes together. Everyone sells in their roles although Nick Frost comes a lot more cosy than the real deal and Sweet Saraya must be overjoyed to be played by Lena Headley.With all the honesty about the behind the scenes of wrestling it would have been nice to see a scene with AJ Lee, Page and 'Hutch Morgan' explaining why she was being given such a big break, that the WWE needed to broaden it's audience as the women's draw had been shallow and stagnant beforehand. Even if they had just phrased it as 'we need a real wrestler rather than cheerleaders and models' calling back to earlier in the film.But I don't think Merchant's eyes were entirely on the wheel giving me impression that he thought the job was well within his weight class when wrestling contains a little more nuance than it first suggests."
    },
    {
      "rating": "5",
      "text": "started out well and was fun up till the girl goes to training and gets mopey and sad etc, its the same movie you have seen many times. of course it picks up again when she is reinspired and then prevails and wins! i was very disappointed because i have seen this a million times. some may find this attractive, i wish i would have waited to see it on tv."
    },
    {
      "rating": "9",
      "text": "Almost a perfect wrestling biopic, the film doesn't slow to a crawl in the slightest with some comedic writing thrown in which seemed to fit in a bonkers wrestling family. A great time if you're a massive wrestling fan and even if you aren't into wrestling all that much you won't feel like you've wasted time on a mediocre film."
    },
    {
      "rating": "6",
      "text": "Fight. Fight. Fight.Fighting With My FamilyMerchant is probably the most authentic filmmaker you would get. Only because, he is a consumer at first. He breathes his fanboy moments onto papers that makes each mundane moment cinematic. He makes things look easy, familiar but easy. All his learned and adapted methods, on how to communicate with the viewers, from film itself, gives you a satisfying Friday night out feeling. He is not bringing anything new on the table, but is also smart enough to know what the audience wants and delivers a safe adored content on screen.Is he taking risks? Probably not. Should he? Definitely not, if this works just fine. All his projects has had the essence of his vocab. The command over the language of Stephen Merchant; the writer-director, is both quirky and heartwarming. He has been selling this ever-working product for ages and it still holds up for its excellent quality. He works on detailings of the moment. Swooping in on all the angles possible, in a situation, he makes sure his world is diplomatic.He accounts in every angle of a sequence, every perspective of the character, he gives them enough space to justify their deeds. This real life based comedy-drama maps out the tremendous amount of variations or fluctuations, one goes through, when he or she goes \"big shot\" and fame hits right on the face. Jolting down that very note is where Merchant's target lies. After which the cast brings in their magic in the ring. This eerie mixture of cast is a delight to watch, from their chemistry to their synced body language, they are just simply convincing.Florence Pugh playing the infamous Saraya Knight or more commonly known as \"Paige\" has done an excellent work on conjuring the both physical and emotional aspects of her characters. Lena Headey and Nick Frost are protective and fairly negligent parents that we all can easily resonate with. Jack Lowden cloaking on the most complex character is convincing and also a big dose of electric charge when alone in screen, the bar fight is brilliantly shot and performed. Dwayne Johnson has done a great comic cameo where he is set loose with confidence by Merchant and there are no regrets.Shockingly, Vince Vaughn as the coach of Pugh has much more to give than we would have expected, presumably since he is never sharing the screen with anyone, he is all on his own, brooding and inspiring his past for a better future. As mentioned, all the physical sequences are shot with well choreographed and multiple angle cameras that makes it look more exhilarating and profound of what they call it \"fixed but not a fake\" fight. The textbook structure of the script never grows into the culprit, it is entertaining even when Merchant is pulling off a montage sequence of the training our protagonist goes through. Fighting With My Family is like a big dinner at Christmas evening, it has few laughs and tears and bickerings, and in the end, is just pure fun."
    },
    {
      "rating": "7",
      "text": "This was a good movie. It has great acting (Vince Vaughn was Amazing), and the rock was really fun in this. The theme felt flat, and could of been better.Its a basic underdog movie.  It fun for both wrestling fans and Non wrestling fans. Its a popcorn movie."
    },
    {
      "rating": "7",
      "text": "This is a surprisingly nice natured film, although it undoubtedly felt cliched but that didn't stop me enjoying it none the less. The fact its based on a true story made it more interesting and I liked the determinism showed by Paige but moreso I though Vince Vaughn did particularly well as the WWE trainer, who has some good lines and, its fair to say, isn't afraid to put people in their place. Its a bit corny, in a 'person chases after their (sports related) dreams' way but its not bad either, as it has decent characterisation and features a good cast, which can make all the difference sometimes.There is a nice atmosphere present during some of the bigger performance scenes. I wouldn't say its especially funny as such - probably the main plus point, other than the general characterisation, is the more fundamental theme of family dysfunction. I think probably quite a lot of people can relate to an aspect or two of this film, which helps add to its appeal. It wasn't a greatly memorable film but its relatively good all the same, so I suppose I'd recommend it overall, although the critic in me does feel like this film could have somehow been a bit more substantial but I can't deny that it must have been a quite atmospheric watch in the cinema at certain points."
    },
    {
      "rating": "8",
      "text": "Fighting with my Family is an incredibly heartfelt underdog story of a young woman from England who aspires to become a wrestler. The story revolves around the main protagonist Paige, who is portrayed brilliantly by Florence Pugh. She comes from a family of wrestlers and has a dream to one day become a WWE superstar alongside her brother. The film takes us through the journey she took and struggles she had to go through to achieve her dreams. At its core this film is about family. The family dynamic and the story of Paige's connection to her family who just happen to be wrestlers is beautiful. When the film takes us through this family's hardship and struggles to get by is when this family shines. It especially shines with the compelling relationship between Paige and her brother Zak, who is played exceptionally well by Jack Lowden. Throughout the film we experience ups and downs from the siblings as their relationship begin to crumble as Paige rises to fame. The film is filled with excellent performances which truly drive the film. As said before Paige is portrayed flawlessly by Florence Pugh, giving a heartfelt performance which makes you shed a tear for her as she goes through her struggles and makes you uncontrollably smile with joy when she achieves her dreams. The film is also filled with excellent performances from Jack Lowden, Nick Frost, Vince Vaughn and Dwayne Johnson. Overall Fighting with my Family is an excellent viewing experience filled with brilliant acting, compelling drama, plenty of laughs and emotional moments which will leave you shedding tears by the end."
    }
  ]
}