{"id": 3562, "title": "Final Score", "starring": ["Dave Bautista", "Pierce Brosnan"], "runtime": 105, "genre": ["Action", "Thriller"], "description": "When a stadium is seized by a group of heavily armed criminals during a major sporting event, an ex-soldier must use all his military skills to save both the daughter of a fallen comrade and the huge crowd unaware of the danger.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/5m3FEfxGQ7MdNNfUwNtA6paXRDs.jpg", "categories": {"plot": 6.0, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 6.0}, "reviews": [{"rating": "5", "text": "It is a typical action movie, so I am rating it as one - action was ok, plot was too silly at times, especially the end part. It was entertaining, but could've been lot better and more intriguing rather than one guy saving everyone they could've went with what would actually happen if such terrorists would attack there. This was more with comedic elements and not too serious. It was ok but nothing impressive"}, {"rating": "4", "text": "In a few words, a boring movie with a high profile production that you can see if you are in the mood or «you did not see it before»."}, {"rating": "7", "text": "Criteria: Action Movie.It follows the classic trope of action movies where a villain plans a terrorist attack and has to deal with an unintended one man army.The movie delivers in its action scenes and pacing, and the fact that is R rated allows that extra degree of violence most action movies are missing this days.That being said, since it follows an old formula don't expect great developed villains or heroes, just the basic background story to have it rolling."}, {"rating": "5", "text": "(Mauro Lanari)Once the protagonist of this kind of action movie was Bruce Willis (\"The Last Boy Scout\", Tony Scott 1991). More than a quarter of a century later it is still proposed, exhausted and geopolitically incorrect."}], "recommendations": ["safe", "war", "the_mechanic", "shooter", "the_bourne_identity", "the_equalizer", "quantum_of_solace", "wrath_of_man", "den_of_thieves", "death_race", "escape_plan", "rambo_first_blood_part_ii", "london_has_fallen", "mission_impossible_ii", "21_bridges", "the_commuter", "mission_impossible_ghost_protocol", "2_guns", "john_wick_chapter_3_parabellum", "the_expendables", "the_ice_road", "angel_has_fallen", "the_november_man", "the_foreigner", "mission_impossible"]}