{"id": 4754, "title": "Final Fantasy: The Spirits Within", "starring": ["Ming-Na Wen", "Alec Baldwin"], "runtime": 106, "genre": ["Adventure", "Action", "Fantasy", "Science Fiction", "Thriller", "Romance", "Animation"], "description": "Led by a strange dream, scientist Aki Ross struggles to collect the eight spirits in the hope of creating a force powerful enough to protect the planet. With the aid of the Deep Eyes Squadron and her mentor, Dr. Sid, Aki must save the Earth from its darkest hate and unleash the spirits within.", "releaseYear": "2001", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/47b1EwFqqSWxYna7NtUM7iML4oT.jpg", "categories": {"plot": 5.72093023255814, "acting": 5.65, "ending": 4.5, "soundtrack": 6.0, "cinematography": 5.0, "familyFriendly": 2.0, "funny": 0.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "Stuck between a rock and a hard place; Final Fantasy neither resembles the games of its namesake nor provides solid narrative to quiet the harshest critic. Both camps hate the film for what it isn't; it isn't related to the games at all and it isn't 2001: A Space Odyssey. As far as visuals go, The Spirits Within looks amazing ten years after its original release, which is not to say it's overbalanced with style over substance ... well, it is, really. This came out when I was studying for a computer animation degree and I will always love it (even if most of it is motion captured) because it blew my eyes out of its sockets. The story is standard Science Fiction fare that often breaks down into shoot 'em up action but underneath is something deeper that's there if you decide look for it."}, {"rating": "6", "text": "This movie is definitely not as bad as I previously had heard. Amazing, stunning state-of-the art animation and a definitely enjoyable film, but there are too many character and plot cliches and some of the voice acting is subpar. A decent film, and one I'd recommend to watch just to see how REALLY good the graphics are, but not groundbreaking in plot or character development."}, {"rating": "9", "text": "When this movie came out there were a lot of people I knew that felt that because it was SquareSoft making it, it should have have a deep plot. Those that came in expecting a fairy tail were disappointed, but the only way for them to get such depth is with a series of films. I believe for a single film it had a believable environment, likable characters, goals that are usually traditional in SQ games, and a good antagonist. I personally feel they did a good job seeing as they are a game company."}, {"rating": "7", "text": "This movie has a visual appeal, rarely seen in movies and a voice acting, i have never seen achieved in 3d animation before, the characters were more alive than i have ever seen before. true, the story was kinda weird but then again, i have seen worse story in many other movies. Definitely worth a watch."}, {"rating": "7", "text": "i think this film failed all because of one thing....the name as a FF fan i saw this and thought it was terrible but a few weeks ago i found it on DVD for a very cheap price so i bought it and then i watched as if it wasn't part of the franchise and it was an fairly enjoyable sci-fi film not the best but it wasn't terrible, the voice acting was great, the animation was brilliant for a 2001 film but the story was a bit lacking and left me with a few questions but its worth a watch by any animated movie fan even if you view it just as a technical milestone"}, {"rating": "7", "text": "A very solid generic sci-fi movie. I really feel like the one MASSIVE problem this movie has is the Final Fantasy title. Once you slap Final Fantasy onto something there are certain expectations and this doesn't fit.\rThis movie is closer to something like Blade Runner than it is to Final Fantasy. If it had just been \"The Sprits Within\" I don't think it would get even 1/2 the hate it does."}, {"rating": "7", "text": "The greatest criticism I will have to this movie is its name. Yes it was made by Squaresoft, but it is Final Fantasy in name only. It offers and deliver very little to give it any connection to the franchise. A few small nods here and there, but nothing substantial enough to make the connection. This is likely why allot of fans really raged against the movie. I didn't rage, I was just a little disappointed.\r That aside as a movie, on its own forgetting the name, it is beautiful. Considering the animation was done in 2001 it was utterly breathtaking and mind blowing. Character are great and the voice acting absolutely fantastic. Story was a little limp though. I felt there was too little focus on the main plot and more on the main characters. This constant sidetracking from the main plot really get a little boring and does ruin the pacing. Making the movie a little boring at times. But when the action kicks in, it really kicks in! In fact it kicks in far to quickly and is over before you know it.\r Overall:\rThe Spirits Within (I ignore the FF part) is a decent enough movie that perhaps could have been longer, simply to add in more relevant plot points and perhaps cut down on the character development a little.\r A great movie that you will love the first time you watch it, but can be a bit dull as a rerun."}, {"rating": "5", "text": "Ok, I know most every new FF game is done in a universe different than the previous release.\rbut hey! only a FF fan could catch that glimpse.\rThe only \"Final Fantasy\" stuff that this movie has is its name... nothing else."}, {"rating": "3", "text": "this film just sucks. yes the animation is great and has aged relatively well and the cast is pretty good but the plot is so dull and in no level representative of anything final fantasy. i know hironobu sakaguchi was developing ideas that were surrounding his mothers death and you can see a lot of good ideas but they aren't fully executed and probably should have been blended into something more appealing to long time fans. and unlike any other final fantasy this has really forgettable characters. even the most awful final fantasy's had character's you would never forget Cid is the only one here that fits that criteria"}, {"rating": "10", "text": "Should of done very well, and could of change how we did film if it had done well. Very easy my favorites"}, {"rating": "0", "text": "complete and utter crap. now im a fan of the FF games played them all but this doesnt resemble any thing to the game peroid . now i wasnt expecting them to remake one of the games in movie form but i was expecting them to capture the feel of the games like swords , magic , summong monsters , with a interesting villian . well all that was tossed out in the crapper for some kind of millitary shooting at ghost aliens which was boring as hell. the voice acting was bad the story was terriable. the CGI did look nice but it was so coverd in all the **** that this film was . with in 10 minuites i was getting bored and i actaully walked out of the movie in the last 15 minuites it was that bad and ive never done that when seeing a movie at the theaters and ive sat through crap like judge dread , Aliens reserection , and last action hero . this film was so bad that when the good charicters where dieng i was happy because i knew i wouldnt have to see them again. this film is definitly on my top 10 list of worst films ive ever seen."}, {"rating": "2", "text": "Even being a huge fan of the video game series, I feel like this movie is best remembered as being forgotten. Not only was it not as technologically revolutionary as it promised, it's just a plain horrible movie."}, {"rating": "3", "text": "Final Fantasy: The Spirits Within is a movie made by people who dont know anything about movies or story telling. The creators are clearly only skilled in creating 3 minute video cut scenes and not feature length films. The visuals are only impressive in a technical sense and lack memorable creativity. There is nothing to care about with its heroes nor villains, and the story drags through pain and agony to a complete void, a waste of time. Everyone is entitled to enjoy what they choose but that does not make it good and anyone who says this movie is good is an uncritically minded blithering idiot. This movie is only worth your time if you were studying bad movies and wasted film opporunities.â"}, {"rating": "3", "text": "Final Fantasy the Spirits Within: 3 out of 10: Have you ever walked through the airport and seen one of those religious cult members with their robes and bald heads selling flowers? You ever wonder what would happen if you stuck up a conversation with one of them and went back to the compound in the unmarked white minivan? I imagine after 24 hours of food and sleep deprivation they would show you this film.\r That's exactly what Final Fantasy feels like. A cult recruiting film for James Lovelock's Gaia theory. Really, forget Battlefield Earth (which was god awful but hardly filled Scientologist recruiting sites as people feared); forget Passion of the Christ, heck even Triumph of the Will was less of a propaganda film.\r Besides the heavy-handed religious message the film itself is a mess. The basic plot has alien ghosts that kill on contact overrunning the earth. The one group wants to use a death star style laser in space (paid for by your tax dollars) to kill the deadly aliens. The other group wants to travel around collecting magic broccoli so Gaia will use her spirit to drive away said ghosts. Guess what side the movie is on. To make the Gaia broccoli-collecting group look more reasonable the movie stacks the deck by making the Laser people completely insane.\r Even with the deck stacking and James Woods drooling as the mad general I still wondered why they couldn't try the laser? Oh that's right they might kill Gaia who lives under the earth like a cross between Lovecraft's Old Ones and a hibernating Care Bear. The animation is groundbreaking for film but really not that much better than the cut scenes in the last few Final Fantasy video games.(Which the movie has literally nothing to do with. Even the tone of the film is all wrong.)\r Either unknown voice work or live actors might have been a better choice in casting. The action scenes are well done though the ghosts aren't exactly scary. The magic of the visuals wears off after twenty minutes or so. The irritation at the story however can last for weeks."}, {"rating": "3", "text": "Esta película en especial tiene mas de una película al estilo \"Aliens\" o \"Tomates asesinos\" que de una película a la altura de la mítica saga de videojuegos. Desde principio a fin es bastante aburrida, es como esa cuarta película de Indiana Jones que nadie tiene en cuenta de lo mala que puede llegar a ser a nivel narrativo. Animación correcta para la época de lanzamiento. Nota: 3/10 Nula."}, {"rating": "10", "text": "This movie was unpredictable in that it was not very \"Final Fantasy\" and it did not have the feel that the video games have. Extremely contrare to Advent Children, but just as awesome in its own way."}, {"rating": "6", "text": "You can't knock its beautiful computer graphics. Shrek, Incredibles and Monster House have nothing on this movie's realistic designs and textures. Unfortunately all that computer power went into a generic science fiction plot. Fans of the videogame series will be disappointed to see this film has very little in common with any plot from the games, nor does its world fit with the Final Fantasy cosmos. The voice acting is fine, if hammy, though there isn't much in the script for them to work off of."}, {"rating": "5", "text": "I was unsure of this film since I had never played the game on Playstation. However, when viewing The Spirits Within, it doesn?t matter whether you?ve played the game or never heard of it, the film is a big heap of mumbo-jumbo and it has nothing to do with the game. I never thought I would have to say this about a movie, but the plot is in desperate need of being simpler. Sure, I like a good complex plot that makes you think after viewing. With Final Fantasy the plot is just so hard to understand that you?ll need to force a scientist to come with you. It doesn?t leave you thinking after viewing, and if it did, your head would probably burst thinking about all the options the plot had. I didn?t care about the characters, the romance was cheese on a huge stick and I was frankly bored through most of the movie. Okay, I?ll admit like everyone else that I thought the computer generated people and sets were pretty amazing, most of the action scenes were entertaining (except the final reel ? sheesh, what when on there?) and the character Aki was very believable, determined and voiced well by Ming-Na. This movie just didn?t please me in the rest of the areas in filmmaking unfortunately. In this review, I?ll go out on saying a similar thing to what I said at the start. The Spirits Within is a big disappointment not only for people who?ve never played the game, but also for people who have. When I came out of the cinema, I heard loud and clear ?That movie was ****ing horrible. The game was so much better.? There goes proof: fans and non-fans of the game are most likely to be upset by the films utter silliness."}, {"rating": "7", "text": "It was a pretty entertaining, definitely very cool looking sci-fi futuristic adventure that's fun, and always interesting...yet forgettable the moment you turn the movie off. The characters just don't leave much of an impact and the plot was actually not nearly as impressive as the plot featured in most FF games. That said, it's a pretty good movie that's DEFINITELY not great...but pretty good. I liked Dr. Sid, and the little homage to FF7 at the end was pretty cool, but ...I don't know. Not worth a purchase but maybe at least a rental."}, {"rating": "6", "text": "Technically it was a masterpiece back then and there were even some people that thought that it could lead to actors becoming obsolete. Sadly it lacks in the story and character parts. Lets start at the beginning. The Final Fantasy franchise is a long running series of role playing games by Square (later Square Enix). It is one of the most recognized and successful franchises in the industry with a loyal fanbase. So many people including me were hyped when a Final Fantasy movie was produced. The trailers and animation looked amazing. It was the first time that we got realistic animated human characters. It blow away the minds of many and the attention reached even people that never played videogames or have heard of Final Fantasy. It was a new milestone in animations and creating realistic characters. What we did not know back then was that this made the movie really expensive and it was a ton of work. We noted that the trailers did not look like it was related to any Final Fantasy game which was not strange as the games are no sequels of each other in this regard. They are set in different worlds with new characters and sometimes really different mechanics and ideas (There are of cause some staples and reoccurring themes). Then we watched the movie and it was a bit divisive. It is neither a masterpiece nor garbage. As fans we would say it is not Final Fantasy or to be more generous not Final Fantasy enough by far. It uses a few recognizable themes but is more like a post apocalyptic science fiction movie. Recently I read that they wanted to make something that is for everyone and does not rely on knowledge of the games. This is the kind of decision that seems good on paper but annoys the viewers. For fans of the games it is unrelateable and for others it is just a standard movie with some good or unique ideas. A perfect example for the middleground being the worst case. The story is set in the year 2065. Earth has been overrun by alien live forms that came to us via a meteorite. Humanity is nearly wiped out and hides in cities with shields as no human can survive on the outside. This is caused because the alien live forms called Phantoms have ghost like characteristics. They are invisible to the naked eye and physical matter is not effecting them like us or how it should. What makes them even more dangerous its that they can kill by touch and seek out lifeforms. However there are some strange or unfitting things like the Phantoms not using their advantages in a tactical way or seem not cooperating (They could have won and ended humanity long ago with ease even if slightly competent). The protagonist Aki Ross is on a mission that could change the status quo but has to be secretive about as there is more to it then it seems. I stop here with this basic set up. The story is actually good and has its moments. I think it is a fresh approach and a bit unique. I must also admit that it sounds better on paper and is not in the realm of the better stories in the genre. It uses themes from the Gaia theory that can be a bit confusing if you are unfamiliar with. Like already said technically this was a masterpiece of the era. Everything looked amazing and the movie itself set the new standards. It comes with a slight weakness in facial animations as the emotions are sometimes not transferred well enough. For the voice actors we got a dreamteam. For Aki Ross we have the great Ming-Na Wen who is now far more famous thanks to Agents of Shield and the Mandalorian. Then we have James Wood as general Hein who can be described as antagonist but I refuse to call him evil as I clearly see his motives and care for humanity. Alec Baldwin as Gray Edwards and Donald Sutherland as Dr. Sid are an amazing addition to the cast. I think they have chosen a great team. I don't remember much of the soundtrack so I wont rate it. For me the negatives are that it is not Final Fantasy enough, the character development is just decent and the story itself misses the last push or pushes to awesomeness. The ending while fitting is also a bit unsatisfying. For itself the reception was average except for the animations which were amazing. From box office standpoint it was a bomb and hurt Square Enix financially. Overall I would have rated this movie a bit higher but after a few years I came to the conclusion that being a fan of the franchise made me less critical. Still worth watching as it has it moments and set new technical standards. Far away from videogame movie adaptation garbage."}, {"rating": "5", "text": "Once again another example of great video game franchises turning to be great movie franchises, but eventually fails to hit the bargain bag at any cost."}, {"rating": "5", "text": "Final Fantasy: Spirits Within felt as if someone was playing a video game. Each scene was like another cut-scene you would experience when you complete a level, which can cause confusion very often. The animation was terrific, but it lacked facial expression each character was supposed to express at key moments. The voice acting felt careless and and defective, which really bothered me watching this film because it altered the enjoyment I was so much expecting. It also had a weak plot that felt very unoriginal and dull. I don't know too much about the Final Fantasy video games, but I do know that the film was very disappointing."}, {"rating": "8", "text": "The 3rd best video game movie yet. First is sonic ova. Second is wreck it ralph and this is third. But I do wish the movie is better and gets a better sequel."}, {"rating": "5", "text": "Sans aucun doute le meilleur avatar de toute la série des Final Fantasy, car en passant d'un média à l'autre, elle s'est libérée -forcément !- de ses infâmes et insolvables problèmes de jouabilité et de \"game design\" complètement pourravenazes. L'adaptation s'est donc bien passée et constitue esthétiquement (et techniquement) un ravissement pour les yeux.En termes d'animation en images de synthèse, ce Final Fantasy est en effet toujours aussi beau et impressionnant, même aujourd'hui. En outre, on ne s'y ennuie pas une seconde (chose impossible sur les \"jeux\" débilitants de la série) et le film sait maintenir l'attention et la curiosité.Car il est clair qu'il s'agit d'une \"curiosité\" et d'une histoire bizarroïde et bancale qui a retenu (hélas) les tics et les TOC (troubles obsessionnels compulsifs...) de la franchise vidéo-(pas)-ludique... On a donc là en vérité une fable écolo-bobo emballée dans de la poésie de supermarché, une fable d'une grande naïveté qui ne tient pas debout, puisque directement inspirée d'un folklore bouddho-shintoïste ou assimilé très gnangnan (sans parler du Greenpeace concentré en boîte !).Le film reste donc beau et esthétique (le bleu contre le vilain orange...) mais se révèle beaucoup trop bêbête pour réellement espérer convaincre."}, {"rating": "5", "text": "As a Final Fantasy fan from the bottom of my heart I need to say that this movie is very normal with a predictable Story. Nothing to be excited about as a FF fan because there are no references at all. The CGI animations are great for 2001 and if you like movies about the earth and weird aliens you might give this one a try."}, {"rating": "9", "text": "Фильм явно сделан не для фанатиков игр Final Fantasy. То есть, для таких как я!Когда в 2002 году, я случайно взял этот, тогда ещё думал художественный фильм, в прокате, то даже не подозревал, что беру не кино, а чудо технологической мысли того времени.Я играл в Final Fantasy толи на nes, толи на чем то ещё. Это было давно и игра мне не понравилась, плюс ко всему она была на японском. Я про неё давно забыл.\"Последняя фантазия: Духи внутри\" не имеет ничего общего с играми. Это редкий случай, когда фильму реально мешает название. Поэтому я оценивал его как самобытное произведение.А как самобытное произведение, этот анимационный фильм, просто бесподобен.Качество анимации для 2001 года просто запредельное. \"Беовульф\" так же показал бесподобную графику, но это было уже в 2007 году.Сюжет захватывающий и не имеет, как это принято, счастливого конца. Что, опять таки, выделяет фильм из общей серой массы.Герои мне так же очень понравились. За них хочется переживать, им сочуствуешь.Единственное, чего не достаёт фильму, на мой взгляд,  это более подробного описания того, что произошло с Землёй и героями во время самой катастрофы. А так же какой, никакой истории пришельцев. Короче, фильму очень нужен приквел! Хотя надежды на это никакой.Ещё раз говорю, что оценивал этот анимационный фильм, как самостоятельное произведение и другим советую сделать то же!Если кто пропустил или просто не видел ещё, советую даже сейчас. Фильм смотрится очень бодро. Только убедительная просьба, выбросите из головы все упоминания о Final Fantasy!!!"}, {"rating": "7", "text": "First film I owned and watched on PSP it's not terrible but the story is often rushed."}, {"rating": "6", "text": "Looks good, but plot makes no sense. Not willing to watch again to figure it out."}, {"rating": "7", "text": "The movie shows good CGI as 2001 released movie. I hope they make sequel as video game or comic books."}], "recommendations": ["the_witcher_nightmare_of_the_wolf", "warcraft", "maze_runner_the_scorch_trials", "9", "monster_hunter", "tomb_raider", "silent_hill_revelation_3d", "silent_hill", "resident_evil_damnation", "jupiter_ascending", "the_last_witch_hunter", "the_matrix_revolutions", "pacific_rim", "the_matrix_reloaded", "riddick", "serenity", "underworld_awakening", "percy_jackson_sea_of_monsters", "ready_player_one", "rampage", "bumblebee", "the_13th_warrior", "the_maze_runner", "avengers_age_of_ultron", "my_little_pony_the_movie"]}