{
  "id": 1139,
  "title": "Final Destination 3",
  "starring": [
    "Mary Elizabeth Winstead",
    "Ryan Merriman"
  ],
  "runtime": 93,
  "genre": [
    "Horror",
    "Mystery"
  ],
  "description": "A student's premonition of a deadly rollercoaster ride saves her life and a lucky few, but not from death itself – which seeks out those who escaped their fate.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/p7ARuNKUGPGvkBiDtIDvAzYzonX.jpg",
  "categories": {
    "plot": 5.9,
    "acting": 5.9375,
    "ending": 3.857142857142857,
    "soundtrack": 3.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 7.6,
    "action": 7.666666666666667
  },
  "reviews": [
    {
      "rating": "6",
      "text": "I liked the first 3 movies of this series, there happen' all the crazyies thinks that you can't even imagine. And the deaths... I like it............."
    },
    {
      "rating": "8",
      "text": "Now, if you're expecting more than blood, gore and death from this third installment in the Final Destination saga and hope for something resembling a plot line, then stay out. You will be disappointed.In all fair and vague shortness, Final Destination 3 is more or less the same as its predecessors. It is an expanded montage of elaborately staged and immaculately bloody deaths strung together by a simple and undemanding story line. Frankly speaking, the stars have not much to do other than stand and act scared - or disbelieving. Regardless, most of the actors did well, with leads Mary Elizabeth Winstead, Ryan Merriman and Kris Lemche standing out slightlier than the rest.Similar to its antecedents, Final Destination 3 is about high-schooler Wendy Christensen (portrayed adequately by Mary Elizabeth Winstead) receiving a premonition of the ill-fated rollercoaster ride in which she is on board. She panics and manages to save herself and a bunch of her friends (or more appropriately, entrees in Death's wish list), but soonafter realizes that Death's in the market for tying up loose ends.If you've decided to give this film a try, then come in with an open mind and just expect fun. Leave your brains at the door, and anticipate gallons of strawberry, juice and banana (creatively mixed up to produce a simulation of blood and bone marrows) to come shooting out of the screen.To grade a film like this, you have to evaluate the atristry of its death sequences, review the mock build up of suspense preceding a death sequence and diagnose the level of bone-chilling each death sequence brings to the table. In short, Final Destination 3 is all about the death sequences. And, suffice it to say, the film succeeds in every level while doing so.Look pass the plot holes gargantuan enough for a train to barrel through. Ignore the poor screen-writing abilities of James Wong, chock-full of dialogues to bury, witty one-liners that never succeeds to pass off as witty one-liners and one or two exchanges so tacky and cliched until it makes you want to punch nails into your ears. Pay no attention to the strong lack of sturdy character development, or the lack of any kind of sturdy characters for that matter. Do all this, and you might just have a good time.For what it's worth, James Wong tries, but still, the sub-plots about the 'Pictures which Tell the Future' and 'The Search for the Two Unknown Ride Attendees' does not add anything new to the table, and instead, turns out to be very predictable and foreseeable. Without wanting to reveal too much, I just have this to say: If you want your audience to be surprised by the plot twist, make sure you have a couple of red herrings ready. Introduce characters who have decent amount of screentime to pose as the possible potential victims, but not too much as to steal the limelight from any of the ten main stars.Nevertheless, as aforementioned, Final Destination 3 is a movie whose sole purpose is to entertain and delight twisted, sadistic fans by introducing new and improved ways to kill off characters who merits their deaths. And, for that, it passed.Verdict:Those who just expect a good time will find this immaculately bloody film to be fulfilling, to say the least. Those who expect more will be dismayed. Nevertheless, the film hits the targets its supposed to, and that adds up to a good, enjoyable thriller perfect for movie night."
    },
    {
      "rating": "8",
      "text": "Not bad. Better than the previous movie. I liked the rollercoaster scene and how they actually put some thoughts into creating inventive deaths for each character. Winstead's acting is very impressive and believable and did the best lead role out of the first 3."
    },
    {
      "rating": "8",
      "text": "Being a fan of the movies myself, I like this one. For those of you who are not familiar with Final Destination movies, someone has a vision about a freak accident. They then try and avoid it. However the people who avoid it, deaths hunts them down. It's a good movie. It's not so much a horror as it isn't scary, but it can slip into that category. Lot's of blood and gore and a fast going movie."
    },
    {
      "rating": "6",
      "text": "\"Final Destination 3\" não nos mostra nada de novo, porém, temos que admitir que as cenas das mortes são morbidamente divertidas (especialmente a das duas amigas).6/10"
    },
    {
      "rating": "4",
      "text": "\"Final Destination 3\" is like \"Final Destination\", a movie where teenagers play around and foolishly die in preposterous methods. The only bad thing is, its bad."
    },
    {
      "rating": "10",
      "text": "Almost the perfect Final Destination series in all, effects are awesome. Actors in the movie are natural. The roller coaster deaths are very brutal that makes the movie a perfect horror movie. It does manage the formula of horrors with brutal or gory deaths. It does good. I hope the Final Destination 5 makes an another perfect formulatic horror movie."
    },
    {
      "rating": "9",
      "text": "....................................................................................................................................................extremo"
    },
    {
      "rating": "5",
      "text": "So we have yet another installment of the uninteresting franchise (it's only my opinion, so you get my drift) and this is as good as the previous film, but that is not saying much."
    },
    {
      "rating": "6",
      "text": "This movie was slightly better than FD2. But it still was exactly perfect but it was better than the previous film. I gave it a 6 out of 10 because it could have been better but wasn't horrible"
    },
    {
      "rating": "3",
      "text": "Not that it has THAT much plausible competition, but the original Final Destination, written and directed by X-Files expatriates Glen Morgan and James Wong, was the best, smartest and most effective teen slaughterfest since Wes Craven's original Nightmare on Elm Street. In it, a high school student envisions a fiery plane disaster which will wipe out his Paris-bound classmates and several teachers; he then successfully talks several of them out of taking the flight. Death, who would've completely gotten away with its plans if it hadn't been for those meddling kids, proves to be the ultimate poor sport, and starts picking off the survivors in various bizarre, baroque and mostly very elaborate methods. Part of the original's success (as well as that of its sequel, which was energetically directed by Snakes on a Plane's David R. Ellis) was that Death, although never seen, was an incredibly vivid personality: an anal-retentive type who insistently redoes its handiwork in the EXACT SAME PATTERN that it originally would've had its plans not been thwarted, and judging from the increasingly elaborate nature of the \"accidents\" it stages, is a dark force whose all-time favorite board game isn't Monopoly, Risk or Clue...but Mouse Trap. Sadly, this third entry is as sloppy, perfunctory and unfunny-jokey as most of the Elm Street follow-ups were, and at least those had the lame excuse of Craven NOT being involved with most of them. However, Morgan and Wong are back for this one, and while their use of a roller coaster ride certainly had potential (aren't ALL horror films by nature roller coaster rides?) this movie's victims--who had realistically and intriguingly varied personalities and reactions in the first two Final Destinations--are, except for the hero and heroine, all either disbelieving twits or total morons. The deaths all follow the same identical pattern (whirrrr--woop, woop, woop--whiz!--whew!--WHAM!!!) and the editing, so precise in the first two entries, is maddeningly slapdash, looking as though several frames have been randomly sliced out of all those Rube Goldberg nail-gun/ barbeque pit mishaps. And let's be honest: as far as Death's selected traveling music goes, The Lettermen don't have a fraction of the cultural, historic or emotional resonance that John Denver brought to the original. As anyone would normally expect from the third film in any horror series, the \"special makeup effects\" budget has noticeably increased (probably surpassing the actors' salaries), but for all the gallons and drums of red stuff added by Morgan and Wong to the proceedings, Final Destination 3 still comes off as almost totally bloodless."
    },
    {
      "rating": "5",
      "text": "James Wong returns to the director's seat for this third entry in the teen-slaughter series. Unfortunately, what fans liked about the first movie hasn't been recaptured here. Final Destination 3 plays like a more mediocre version of the second film. The few clever deaths that it does have lack the original's surprise and the second's entertainment value. But at least there's some gore.Where the movie really stumbles is in it's plotting and characters. The previous films also suffered from a bland and generic group of survivors, but at least we didn't have to listen to them whine as much as new lead Mary Elizabeth Winstead. The film drags it's feet getting to the stuff we want to see (the deaths) by forcing us to watch her get freaked out by nothing at the beginning of the film, and mope around for the rest. Everyone else is just there to add to the body count, although Kris Lemche is pretty entertaining. The plot loses the attempts at complexity and depth noticeable in Final Destination 2 in favor of falling back on formula.One thing I do appreciate about the movie is that it keeps the more playful, self-aware tone of the last movie. It makes things a little easier to tolerate and means that the kills themselves have some imagination going for them, even if they lack the punch of the earlier (and later) entries. I feel more could have been done with this though. It never quite embraces the sense of fun it tries to continue with. Like I said, we watch our lead mope a lot.There are some moments here and there where Final Destination 3 has something going for it. It just never really reaches the heights seen elsewhere in the series (which weren't all that high to being with) and takes too long getting to the good stuff. It can be quite the slog to sit through. A shame as it saw the return of James Wong at the helm. He directed the first Final Destination, which is still to this day the one most consider to be the best of them. None of that was really recaptured here. Nor were any of the good things from the second. The lack of which lead to what is arguably the most disposable entry in the franchise.5.8/10"
    },
    {
      "rating": "2",
      "text": "Final Destination 3 is sickening, not only from the deaths but also from the acting and writing. The movie is far lazier in coming up with different kind of deaths. A pretty bad movie all around."
    },
    {
      "rating": "9",
      "text": "It may be my love of rollercoasters, but I love this film. I prefer the idea of pictures hinting deaths than the visions in 4 or the newspaper hint in 1."
    },
    {
      "rating": "7",
      "text": "Mi favorita de toda la saga, la escena inicial es espeluznante, la actuación de Mary Elizabeth Winstead está OK, y digo OK porque de entre todos los protagonistas de cada entrega, Wendy aparentemente es la más vulnerable de todas, pero lo mejor de todo son las muertes llenas de gore y creatividad."
    },
    {
      "rating": "8",
      "text": "In my opinion, Final Destination 3 is the best movie in the series. It's scarier, gorier, and overall more fun to watch. The first 2 movies worked very well. Then Final Destination 3 comes along and this is what makes people more interested in the franchise."
    },
    {
      "rating": "5",
      "text": "The main things I liked about the movie were the cast and the way everything played out. The movie had a good cast, and though I'm not a huge horror movie fan, I saw this one because something about it caught my attention. Though some of the deaths would most likely never happen. The one thing I really didn't like about this movie is that they leave a cliffhanger ending... you don't even know if Wendy, her sister, and Kevin are able to get off of the subway with her new friends. But I guess since it was moving, they probably don't, hence the line \"This time death will finish them.\" The whole setup made this movie...different, at least you don't see a crazed lunatic going around causing gross deaths like other horror movies. Of course, I can now imagine some overactive kid(s) getting on board and pretending or hoping to have a premonition of a fatal rollercoaster ride just so they can cause a ruckus and see what really happens. Oh, well."
    },
    {
      "rating": "6",
      "text": "Final Destination 3 is a letdown. I went from a bad sense of deja vu to just annoyed. I mean, the movie does what it's always done best, hit the audience with some of the most gruesome reasons to twinge and the occasional \"ohhhhhhhh shyt!\". But the story is just a letdown and the characters are a little more than puppets for Death to take out one by one. It's just that I enjoyed Final Destination 1 and 2 more, even in-between the deaths. Not to mention that 3 doesn't even try to connect to the first 2. It's a whole seperate story with little references here and there to the first two. Because of that, I just don't see the need for Final Destinaion 3 to have been made. Other than to create the whole trilogy thing that seems to be popular nowadays. Oh yeah, and to make just a little more money out of the series. Pointless."
    },
    {
      "rating": "9",
      "text": "This is one of those horror films where there are equal parts campiness and horror; here the horror being tied to bloody \"accidental deaths.\" There is no real bad guy creepiness such as the fear of an unknown stalker, but rather just the omen of death as the apparent predestination dictates the next stereotyped victim to die. Perhaps a bit too graphic at times, but I think the movie hits its mark as a well-constructed scary entertainment: just sit back, accept the movies' logic, and watch silly teenagers meet their unfortunate demise."
    },
    {
      "rating": "7",
      "text": "It turned out to be better than I thought. Since it had no original cast in it. I loved the death scenes too!!! If you like 1 or 2. You'll definitely enjoy this one."
    },
    {
      "rating": "9",
      "text": "awesome movie to just sit in the theater and see people constantly get whacked by things that would never happen like the tanning place with the board but these movies are never supposed to have a plot or be any good but i gave it a 9 because it was a funny hour and half movie of people getting dismembered."
    },
    {
      "rating": "10",
      "text": "I give 10 points to the guy who complained \"it wasn't at all realistic.\" Funniest (albeit most ridiculous) thing ive ever read in my life."
    },
    {
      "rating": "7",
      "text": "Better than the second film. It starts off with chilling suspense then goes all stupidly & horrificly predictable. You won't want to ride a rollercoaster for a while."
    },
    {
      "rating": "9",
      "text": "The movie itself was really good. Special effects were good, acting was decent, parts were 'over acted'. Plots of the deaths were awesome. Just a really good gory movie."
    },
    {
      "rating": "5",
      "text": "we've seen it all before but there are a few good thrills in watching people meet their end. if you liked the first two you'll be able to enjoy this one too."
    },
    {
      "rating": "6",
      "text": "Not nearly as good as Final Destination 2. I'd say it was the worst in the series. Kinda like horror porn, very formulaic with the occasional gory money-shot."
    },
    {
      "rating": "10",
      "text": "the movie was really great it wa really thrilling i had to go to the bathroom at least 6 times my head was going in circles the movie was jus perfect best scary movie this year."
    },
    {
      "rating": "8",
      "text": "Fun. another good FD movie where you dont have to think a whole lot or anything, just sit back and jump and laugh at the stupid things that happen. Great."
    },
    {
      "rating": "4",
      "text": "It was allright. The major problem is that all 3 final destination movies pretty much offer the same exact thing. The first one was good, but the second two seemed like stale reproductions of the first one, except with different ways to die. Overall the plot remains the same."
    },
    {
      "rating": "6",
      "text": "This movie was ok. However, it wasnt at all realistic. If you remember that in the premonition, Franky brought a camera on the roller coaster, which he dropped. The camera somehow magically got caught on the rail, and when the coaster ran over it, the whell came loose and started the crash. OK, after the premonition and the freak out scene, franky gets off the ride with his camera. now, the cameras gone, yet the crash begins in the exact same spot where it happened in the premonition. Second of all, only a few of these deaths could have happened. Most of the events leading up to the deaths could almost never had happened. [***SPOILERS***] Example, at the tanning salon, what are the odds of the board falling in the position it did. And at the fair where Ian dies, that metal pole knocks over a cannon ball which then destroys the firework support, at what momentum could a pole that small made a ball that heavy go that far. Its not logical. Overall the deaths were gory, although they could have been more creative. But come on, they are creative but too creative. There are many things that should never had happened. This doesnt feel like final destination."
    },
    {
      "rating": "5",
      "text": "What an appropriate title for this movie (Final Destination) I'll break it down into defitionitions... Final; - concluding: occurring at or forming an end or termination Destination; - finish: the place designated as the end Add them together and you pretty much get this... Final Destination; - Concluding Finish: The end/finish of every actor in the movies career. The movie was decent but it was obvious what was going to happen most of the time."
    },
    {
      "rating": "0",
      "text": "By far one of the worst movies i have ever seen. In all fairness, i knew it was going to be the worst movie i would ever see before i saw it. my only incentive to go see this abomination was the fact that my friend paid for it and had smoked me up before-hand (note to my fellow tokers, blazing before this movie does not help it in anyway, it just ruins your buzz...its that bad). This movie is just made for mindless barbarians who want to see people die in as many ways as possible, regardless of how little thought was put into the plot, seeing as how it was exactly the same as the last two: a few people escape death because some random highschool girl with no psychic history out of nowhere has a prophetic vision of them all dying, and surprise, surprise: now they all have to cheat death before death gets them! whoa! ...as someone also mentioned below..i thought it would be so stupid it would be funny...i was even high and it was no such thing....just rediculously stupid."
    },
    {
      "rating": "8",
      "text": "Final Destination 3 proves that movies don't have to be intelligent or innovative to remain fun. I'll take this goofy, sadistic, ultra-gory glee over a long, impressive drama like Capote any day of the week. I go to movies to be entertained, and FD3 delivers far more than I expected, and then some. Expect to laugh with serious vigor after a scene involving a strategically-placed falling cherry-picker."
    },
    {
      "rating": "5",
      "text": "This is NOT a good movie no matter how you look at it although given what it's supposed to be (a mindless splatter movie) it entertains and leaves you in suspense here and then.the problems mainly lye with the character development and the acting.It doesn't even attempt to make you care for these charachters and the acting is less than passable.The dialogue lacks and the script is a poorly written one but in the end you can't help but love the death scenes."
    },
    {
      "rating": "1",
      "text": "Well the 3D part was OK...only some parts of the movie were 3D. Other than it being 3D there was nothing in this movie that we have not seen in every other Final Destination. The plot in the other once were more intense, and it kept you wondering what was going to happen. This one you know whats going to happen. He has a dream of people dying, wakes up freaks out people survive, they start dying in order. Please make a final destination with a twist. Its like they made this movie thinking no one had ever seen final destination, or hoping we would be so stupid we would not remember that this movie is just like the other ones. Overall this is not worth spending your money. In my case $22 USD."
    },
    {
      "rating": "0",
      "text": "Worst film in the franchise. In between the death scenes, there was no suspense, tension or atmosphere. The dialogue was weak & there was no dimension to the characters. No character seem affected about the gory deaths they witnessed. Other than the deaths, this film provided no storyline. FD1 & 2 were good, FD3 died!"
    },
    {
      "rating": "7",
      "text": "[***SPOILERS***] I liked this movie a lot, but I just can"
    },
    {
      "rating": "5",
      "text": "Eh, it was all right. Nail gun impailment through the face was pretty great. Nude girls in tanning deserved to die even if it wasn't the plan. Seems like the only reason why people went to see it was to see the rollercoaster scene. Makes the next trip to an amusement park interesting. Deaths get more and more predictable as the movie goes on. Ending was a let down."
    },
    {
      "rating": "10",
      "text": "I found FD3 was actually more of a comedy than the straight horror flick. I loved the Ashley and Ashlynn roles they added real life humor to the plot. The young cast was a refreshing addition to sequel."
    },
    {
      "rating": "8",
      "text": "Somewhat rushed, going from death to death without really tying much together, this movie still takes the audience through a wide range of spooky thrills and chills. I liked it. Be safe on your drive home from the theater..."
    },
    {
      "rating": "10",
      "text": "This film is unreal! It is the bet out of the 3!! The roller coaster scene is leahal and there is great gore scenes! the film is tense all the way through I LOVED IT!"
    },
    {
      "rating": "8",
      "text": "From the perspective of someone who has never seen part 1 or 2, this move is really good. The deaths are unpredictable for the most part. What stopped this movie from getting a 9 or 10 is the ending, which wasn't so great."
    },
    {
      "rating": "7",
      "text": "This movie is a lot of fun and much better than part 2."
    },
    {
      "rating": "7",
      "text": "\"Final Destination 3\" might be just another dead teenager movie, and yet the manner in which each young person gets eviscerated is reasonably inventive, and gory, but satisfingly so. It doesn't have the self-awareness of the \"Scream\" movies, or the creepy realism of \"Saw\". \"Final Destination 3\" is something of a comedy. You're already laughing during that interval when Wendy(Mary Elizabeth Winstead) shows up to \"warn\" the next kid slated for death. Since she has a flair for seeing the future, maybe the film is unaware that our heroine might be unconsciously killing everyone through telekinesis. The sequence at the amusement park is very exciting."
    },
    {
      "rating": "10",
      "text": "This was a great movie. A unique one. Makes it seem so real that when I first saw it I was kind of freaked out. But wow...great job! I love this movie soo much that I own it."
    },
    {
      "rating": "10",
      "text": "Well what can I say!! Wow!! Magnificent movie. I own this movie on dvd. This is the perfect movie of drama, horror, and mystery that I like to see. No other movie has this good than Final Destination 3. Honestly Final Destination 3 is much better than Final Destination and Final Destination 2. I love this movie."
    },
    {
      "rating": "4",
      "text": "Everything is funny about this film: the idea, the premise, the filmmaking, the gore and the acting. Its the kind of film that exists just to be teased by critics and public. That could be good if the filmmakers put some fun in the making. In this case, all seems just replaced, recycled and too tired. But the funny premise of killing those stupid characters is more interesting for the simple thing that here, everybody dies."
    },
    {
      "rating": "10",
      "text": "This was a great movie. Very entertaining with great characters. It's the best of the series. I recommend this to everybody who wants a fun ride of thrills!"
    },
    {
      "rating": "10",
      "text": "It is an AMAZING film and I was left wanting more, you may say its cheezy but thats one of the great aspects of it. I also love how they use the same song when something bad is going to happen to Wendy."
    },
    {
      "rating": "10",
      "text": "I thought it was clever and really quite amusing. My date was scared silly - and loved it."
    }
  ],
  "recommendations": [
    "final_destination_5",
    "final_destination_2",
    "final_destination",
    "the_final_destination",
    "happy_death_day",
    "friday_the_13th_part_2",
    "the_strangers_prey_at_night",
    "paranormal_activity_the_marked_ones",
    "47_meters_down",
    "saw_iii",
    "would_you_rather",
    "happy_death_day_2u",
    "28_weeks_later",
    "saw_3d",
    "jigsaw",
    "brightburn",
    "frozen",
    "texas_chainsaw_3d",
    "spiral_from_the_book_of_saw",
    "paranormal_activity_2",
    "countdown",
    "maze_runner_the_death_cure",
    "the_twilight_saga_breaking_dawn_part_2",
    "vacancy",
    "taken_2"
  ]
}