{
  "id": 1119,
  "title": "Final Destination",
  "starring": [
    "Devon Sawa",
    "Ali Larter"
  ],
  "runtime": 98,
  "genre": [
    "Horror"
  ],
  "description": "After a teenager has a terrifying vision of him and his friends dying in a plane crash, he prevents the accident only to have Death hunt them down, one by one.",
  "releaseYear": "2000",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1mXhlQMnlfvJ2frxTjZSQNnA9Vp.jpg",
  "categories": {
    "plot": 5.962962962962963,
    "acting": 6.7,
    "ending": 5.428571428571429,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "9",
      "text": "A very teen movie! Just look the effects the deaths, it's just in the right and balanced ways... I was really surprised on this movie, I can't believe that a movie like this will airs..."
    },
    {
      "rating": "9",
      "text": "this movie was freakin' mindblowing. true, the sequels have gotten worse and worse. but the original was and is great. amazing suspense and intrigue, and full of awesome surprises. The critics are very wrong to hate this movie."
    },
    {
      "rating": "9",
      "text": "Creepy and RealThis movie was frightening for one simple reason, it isn't afraid to go the route of talking about death, fate and if the inevitable is really unavoidable or if deaths plan can be fathomed and subsequently outwitted. The opening scene is downright scary, come on who hasn't got on a plane and wondered if it would crash, and let me tell you I am not in a hurry to get on one now. Thought the story is a little contrived and a bit predictable(though that is part of the story) the effect is still the same. The movie is not, despite what you may hear, a teen flick, if you're a horror fan from any generation trust me you'll like it as long as you go in wanting to see it and willing to actually think about the film and follow the story line. Trust me on this one and give it a shot."
    },
    {
      "rating": "10",
      "text": "Final destination is a very good movie i highly recommend it, and Tony Todd in one scene which is my favourite scene in the whole movie is freaking good he should have been in the movie with more scenes but still a really good movie."
    },
    {
      "rating": "10",
      "text": "Final Destination has original scares and a creepy atmosphere. The movie is intense and will make you\rjump with a few of the scenes.  The idea that death can track you down, and you can't stop what you\rcan't see is eerie. The character's can't avoid their demise because most of the aren't aware what\rIs happening. Overall a fun ride that will give you the chills but in a good way."
    },
    {
      "rating": "9",
      "text": "Final Destination is a horror film that brings great honor towards the genre of modern horror. Making Death itself the main antagonist was a great choice and I enjoy this movie to this very day. Can't hate it."
    },
    {
      "rating": "9",
      "text": "\"Final Destination\" tem um bom enredo, as cenas das mortes são impressionantes e o elenco é razoável. Algumas partes são estranhas, mas, fora isso, o filme é muito bom.9/10"
    },
    {
      "rating": "10",
      "text": "Final Destination has fantastic death scenes that are freaky, great acting & a suigeneris horror concept, A+."
    },
    {
      "rating": "10",
      "text": "While Alex is sitting in his bedroom reading a magazine, an owl lands on a tree branch outside the window. In many cultures, owls are viewed as omens of death."
    },
    {
      "rating": "10",
      "text": "Kerr Smith and Seann William Scott took motion sickness pills (Dramamine) before each plane crash take and were half-asleep in these scenes - that's why they aren't shown close-up much."
    },
    {
      "rating": "10",
      "text": "{}[]{}[]{}[]{}[]{}[]{}[[{}[]{}[[{}[]{}[]}{[]{}{}{}{}{}¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡"
    },
    {
      "rating": "9",
      "text": "This movie was a pleasant surprise the first time it came out. I thought it was going to be another cheesy teen thriller. But it actually had an original plot and the actors held their own. Most ended up having a good movie career and are still around. It's definitely on my permanent collection. I highly recommend it for cult thriller aficionados."
    },
    {
      "rating": "10",
      "text": "Character error (at around 1h 25 mins) When Clear is in the car that was being attacked by the electrical wires, Alex said that the car was \"grounded by the tires\". This is incorrect as the rubber tires are actually an insulator, hence they do not complete the circuit (for example, ground the car). Also, the car should act as a partial Faraday cage, which means that all of the charge would be on the outside surface of the object (in this case the car), and that the person inside would be safe."
    },
    {
      "rating": "9",
      "text": "Filme incrível com ótimas atuações só que a trama policial as vezes fica chata"
    },
    {
      "rating": "10",
      "text": "Here it is,the beginning of one of my favorite horror franchises.Who knew that a cool concept for a X-Files episode could turn into a 5 movie franchise?\r PROS:\r*Good deaths\r*Suspenseful\r*Realistic reactions to the deaths(people actually care when the survivors die)\r*Interesting,realistic characters\r*A great jump scare\r*Tony Todd\r*Good acting\r*Great concept(until it got old)\r*Good script\r*Feels realistic\r*Amazing jump scare\r CONS:\rNone"
    },
    {
      "rating": "10",
      "text": "Audio/visual unsynchronised (around 10 mins) When Alex pushes Tod shortly before boarding the plane, Tod says \"Ow that hurt\". But when he says \"That hurt\" his mouth is not moving."
    },
    {
      "rating": "7",
      "text": "THESE CRITICS ARE STUPID! Now..with that said, this movie has a good plot, awesome death scenes. The cast plays well together and play the right parts. Has a fair amount of \"holy cow\" parts."
    },
    {
      "rating": "0",
      "text": "Garbage, makes no sense, and is just moronic!"
    },
    {
      "rating": "7",
      "text": "I don't understand why the critics speak of this movie with such distaste as they do. It has a premise that in some ways supersedes the majority of modern horror films; how many movies have an idea where death is a forceful entity that torments people with the constant fear of meeting their doom. The problem is some dialogue, and abhorrent acting by a majority of the cast. Only the protagonist and the coroner have a place being in this film. If it weren't for the acting, this film would be recognized more for its theme and its scares."
    },
    {
      "rating": "8",
      "text": "This is where the infamous series started that has now spawned a further four sequels! Now it's obvious that this is a very corny series so as long as you don't take it too seriously then you're bound to enjoy these films :) This is probably the best regarding the acting and characters, but the corniest regarding 'death' trying to kill the kids. Overall a nice new twist on the somewhat predictable genre, and the beginning of a great series of twisted and gory Horror films!"
    },
    {
      "rating": "6",
      "text": "\"Final Destination\", a movie directed by James Wan, is your average, violent teenage \"Saw\" movie. Don't expect something like \"Scream\" or \"Halloween\"."
    },
    {
      "rating": "4",
      "text": "Even though it it a thriller;horror movie, it was surprisingly funny, like the \"suicide\" of Tod. :DD *Сержче се пръсна*Anyways, predictable and a bit boring. :("
    },
    {
      "rating": "6",
      "text": "To be honest, \"Final Destination\" is a decent horror film. It's quite smart and keeps the tension going and overall resembles a good original shocker. The plot is very ridiculous and silly though."
    },
    {
      "rating": "6",
      "text": "The film that started it all, in my opinion it looks like a rough version of the second and third films in the franchise. The acting is good and the plot too. But if you've never watched any film of the saga, see this first, otherwise you might end up disappointed with the obviousness of the deaths."
    },
    {
      "rating": "6",
      "text": "It's ok, it has an above average plot and above average acting for this kind of movie, however with all the better movies in this genre it only comes across as slightly above average."
    },
    {
      "rating": "3",
      "text": "Horror movies from the 80s were very popular these days, but when more horror movies appear except when they're not good, this is the only horror franchise that I'm starting to hate, starting with this one. Do you know what it's like? It's like trying to ride a skateboard, but when every once in a while you get some scraps on your hands or knees, you'd rather ditch skateboarding and go do something else and that's this movie.Pros: Devon's Sawa's performance was a lot of fun, the death scenes were very realistic, and the premise was very interesting.Cons: The story was predictable, the characters aren't as interesting as toast, the music score was completely forgettable, the comedy was unfunny, and the pacing was so boring even the director himself couldn't possibly make this enjoyable.If any of you really like the series, then go ahead and watch this. Otherwise, stick to Halloween, Friday The 13th, or A Nightmare on Elm Street. Heck, there are a lot of good horror movies out there, for crying out loud!3/10"
    },
    {
      "rating": "7",
      "text": "Final Destination, one of the most creative horror or thriller movies out there. This was the beginning of a franchise that if infamous for having some of the craziest deaths in cinema, and some f the most cliche characters and bad acting, but that's not really a bother. This movie is a load of fun, and has some great deaths and funny scenes. Check it out if you haven't seen it. 7/10"
    },
    {
      "rating": "5",
      "text": "Pretty much an average film really, but with a good concept and some really clever ideas. Enjoyable to say the least, but not sure how many times I could watch it before boredom sets in."
    },
    {
      "rating": "2",
      "text": "I really think this movie has a great story to start with. But what James Wong made out of this story is just sad. And with sad I mean sad in a way of “How could you transform such a nice story in a movie as bad as this?”. It's not that type of movie where everything is bad, I have to say that the score created fine suspense, the acting was really not as bad as I expected, and there were some good shots in. Yet, the screenplay. HOW BAD WAS THIS SCREENPLAY? I'm honestly surprised that it didn't receive credit at the Golden Raspberry Awards. I mean, the ending of this movie was so illogical and stupid. I wasn't expecting a good screenplay, but this was just too much for me. And, oh, the dialogue. There were dialogue parts in this movie that created a new unit of stupidity. This movie is actually the best example if you want to prove that the screenplay is the most important part of the movie because with an at least okay screenplay this film would've been a lot better, but it's just totally  like this. Being entertained by people getting killed is sick in any case  but if you are entertained by a movie as bad as this, you seriously need some help."
    },
    {
      "rating": "8",
      "text": "\"Final Destination\" is really just a fun movie to watch. It has a great premise and a lot of thrills. The death scenes in particular are really intense and original, and I didn't think the acting was as bad as everyone makes it out to be. The main character did get somewhat annoying towards the end, and the writing is pretty bad too. Despite those few flaws, I think it's a very enjoyable movie to watch."
    },
    {
      "rating": "4",
      "text": "A clear thing about \"Final Destination\" is that never tries to be taken itself seriously. the filmmakers know that this is teenage entertainment. The kind of entertainment that never appeals to our brains or our logic. This film is just a case of teenage flick mixed with a kind of horror and a lot of unvoluntary humour. \"Final Destination\" is just what it is: a waste of time with the shape of entertainment and with that purpose, the film works well."
    },
    {
      "rating": "6",
      "text": "A fairly entertaining horror that relies on plot more than cheap gore and jump scares. The plot has a little of the exacting internal logic that made 2015's It Follows so good. This film is nowhere near that good, but it punches above its low budget weight."
    },
    {
      "rating": "6",
      "text": "I also think itâ"
    },
    {
      "rating": "6",
      "text": "The original in the series offers up a great concept but is lost among a sloppy story line as well as horrible acting. However, the film did open up doors for it's later and semi greater sequels. It might be boring at times but with less gore and more mystery it does lay out a great foundation."
    },
    {
      "rating": "6",
      "text": "A critically underappreciated film. I thought Final Destination was pretty original, Decently acted and entertaining enough to warrant watching. It's not perfect by any means but it doesn't necessarily fail at what it was trying to accomplish."
    },
    {
      "rating": "3",
      "text": "Teen horror-thrillers can be great, but when they're so humorless to begin with, and then so ultimately lifeless, they don't work. Final Destination takes itself way too seriously, especially considering the plausibility levels of its premise."
    },
    {
      "rating": "6",
      "text": "The concept is extremely original and kind of creepy. The character development is also good and you really do care about almost everyone in this movie. The only flaw was that for large amounts of time nothing big happened so you sort of get bored at first. But once it gets going it's pretty entertaining."
    },
    {
      "rating": "6",
      "text": "This is a thriller you won't regret you watched, especially on Halloween or on a party with friends. The story is   good but i just think that it could've been better (no spoil)"
    },
    {
      "rating": "5",
      "text": "Uma história interessante,Que acabou gerando uma franquia que felizmente foram melhores que o 1,Créditos a criação dessa nova  história de terror,Inovadora!!! porém não foi bem executada"
    },
    {
      "rating": "4",
      "text": "It had some memorable moments, but in all the characters were rather one-dimensional and the death sequences were very predictable, albeit sometimes they were meant to be. The sequels are no better, this film, 'Final Destination' should have been the final one, just like its title."
    },
    {
      "rating": "5",
      "text": "My 17 year old self would easily have given this movie an 8/10 but in my thirties now?? Final destination is dumb but fun.... The oh so 90's lingo and general attitude of these (clearly in their twenties) actors playing 'teenage students' is a grind to watch.... The opening 20 mins still serves to impress as a work of cinematic art beautifully marrying the tension of its story with the gratuitous and expertly produced crash sequence. Sadly the 'fate finishing them off' concept drags on too long and instead of implying the danger takes an oddly detailed silly practical effects heavy territory with each death more ludicrous than the last (how is it the victims fail to notice the sentient liquid/air attacking!). Nonetheless it houses a great concept (even if the film has aged poorly). If you can switch off and tune in to the 90's horror grunge vibes though, this is sure to entertain you."
    },
    {
      "rating": "7",
      "text": "Final Destination introduced a cool premise. The first and the second movie are really the only two I bothered with because although both films were entertaining the amount of sequels got a little out of hand and everyone gets sick of repetition. There were always gruesome creative death scenes and you never knew what to expect."
    },
    {
      "rating": "4",
      "text": "Well, this movie has been good for the fans but the first deaths have been little bit simple and emotionally chilling as the explosion of the plane. And I remind you if there is a bad film will discuss all without rudeness just left me almost with regrets but good film , it's all true knowing that death will always come at any time, too bad if I get me some of it."
    },
    {
      "rating": "7",
      "text": "'Final Destination' is most notable for two things mainly. The first being that it was the introduction of a fascinating and clever premise that is pretty unique for a supernatural horror. The other being that it was the feature film directing debut of James Wong, best known beforehand as a veteran of 'The X Files'.It spawned four sequels with the fifth film being released in 2011. While it is flawed and somewhat of an uneven film, the first 'Final Destination' is still, six years after the fifth film, one of the franchise's better outings. Perhaps even the best, and the one where the premise feels the freshest. The more stale the concept got, the more the novelty wore off and the less effective the film. Could 'Final Destination' have executed its premise better? Perhaps. Mostly, to me, it did it quite well.Visually, 'Final Destination' looks pretty good for low budget. It's slickly shot and very atmospheric, while the plane effects in the Flight 180 plane scene/explosion are quite impressive. The music score has a suitable eeriness.The film is never dull and is a vast majority of the time fun and suspenseful, with elaborately creative death scenes that are ingeniously unsettling. The film's highlight is the opening Flight 180 scene, anyone already with a fear of flying will have their fear exemplified and it is likely to turn people from boarding a plane for a while. Wong does competently with the directing and the portrayal of Death is an interesting and well done one.Acting varies, with personable Devon Sawa, affecting Ali Larter and Tony Todd's creepy cameo coming off best. Really liked the characters' surnames, that were nifty homages to horror/suspense icons.Not all the acting works however. The others are saddled with one-dimensional and flatly written roles and are a mix of bland (Kristen Cloke) and irritating (Kerr Smith), also found myself not being able to take Seann William Scott seriously.The biggest issue is the script, which is very high in the cheese and awkwardness factors and there is some clumsy exposition that often feels under-explored and not really going anywhere. Generally the story is nice, but things could have been explained better and explored more and it's a little too reliant on coincidence. Things also take a dumb turn towards the end before the film concludes on a logic-defying note.Overall, patchy but entertaining. 7/10 Bethany Cox"
    },
    {
      "rating": "8",
      "text": "Una película bastante buena, una historia creativa y original, si bien el planteamiento se siente un poco forzado sigue siendo entretenido de ver, fue un buen comienzo para una saga cuya calidad siempre fue en zigzag."
    },
    {
      "rating": "8",
      "text": "Me encanto, es super gore y trae un concepto original y muy explotable al cine."
    },
    {
      "rating": "3",
      "text": "Premier film de la saga drôlement morbide qui a le mérite de poser les bases d'un principe simple mais ô combien efficace, ce premier Destination finale se prend hélas bien trop au sérieux, laissant de côté l'ironie et le cynisme à l'humour noir des films suivants...Il se présente donc comme un petit thriller surnaturel, original certes, mais sans envergure et au rythme assez mollasson. C'est fort dommage, car on voit déjà ici et là le sadisme jubilatoire des accidents domestiques bêtes et brutaux mais sans l'habile exploitation qui en sera faite plus tard. L'intérêt du plan n'est pas en effet de se focaliser sur un seul protagoniste qui joue à cache-cache avec mamie faucheuse mais de suivre l'exécution du plan jusqu'à la fin, quoi qu'il advienne...Bref, les scénaristes se cherchent un peu trop dans ce premier film, ignorant encore comment tirer pleinement profit de l'idée initiale. Or, c'est bel et bien vers la comédie macabre qu'il faut aller, non pas vers le thriller de pacotille,  de toute façon casse-gueule et pas crédible pour un sou.La fin est escamotée sur un rebondissement idiot, preuve que le scénario ne sait plus où donner de la tête. Voilà donc un brouillon trop médiocre et forcément décevant en regard des épisodes suivants."
    },
    {
      "rating": "6",
      "text": "This is a dumb movie. So take it for what it is and you will be mildly entertained."
    },
    {
      "rating": "8",
      "text": "This bizarre version of a slasher where teens fight death itself is by far one of the best slashers out there. Its unique version of a bloody fun with bizarre, unrealistic traps killing students is what I need to get my fill of horror with a side of 2000s nostalgia."
    },
    {
      "rating": "8",
      "text": "Amazingly creepy suspenseful and thrilling.right from the start trying to figure out what is happening great acting and love the scene with they went to watch tod body they told death finds the way brings me creep the deaths were suspenseful and terrifying car scene was great.starting was good as dream and real happened it kept engaging from that scene on.amazing climax kept me guessing who's next and the way the cheat the death cabin and professor death scene was hauntingly satisfying and thrilling as every part in the house was terrifying to look whats that gonna do like boiler,mug and single item was terrifying to watch how she's gonna die.overall amazing movie!"
    }
  ],
  "recommendations": [
    "final_destination_2",
    "insidious_chapter_2",
    "malignant",
    "dark_skies",
    "happy_death_day_2u",
    "annabelle",
    "vacancy",
    "the_strangers_prey_at_night",
    "sinister_2",
    "final_destination_3",
    "insidious_the_last_key",
    "insidious_chapter_3",
    "insidious",
    "summer_of_84",
    "devil",
    "countdown",
    "dead_silence",
    "chernobyl_diaries",
    "the_invasion",
    "scream_2",
    "the_final_destination",
    "scream_4",
    "the_conjuring_the_devil_made_me_do_it",
    "the_possession",
    "the_boy"
  ]
}