{"id": 1319, "title": "Final Destination 2", "starring": ["A.J. Cook", "Ali Larter"], "runtime": 90, "genre": ["Horror", "Mystery"], "description": "When Kimberly has a violent premonition of a highway pileup she blocks the freeway, keeping a few others meant to die, safe...Or are they? The survivors mysteriously start dying and it's up to Kimberly to stop it before she's next.", "releaseYear": "2003", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/sDsdhVmGzh4L56QvtLLinvXjDs3.jpg", "categories": {"plot": 6.045454545454546, "acting": 6.136363636363637, "ending": 7.166666666666667, "soundtrack": 6.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.666666666666667, "action": 6.5}, "reviews": [{"rating": "6", "text": "Well, if you're looking for exciting death scenes, 'Final Destination 2' is the place to come. In all honesty, much better than the original. Despite plot errors, a highly enjoyable film. Loved it..."}, {"rating": "5", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"}, {"rating": "4", "text": "\"Final Destination 2\" ain't horror. It's comedy."}, {"rating": "7", "text": "for me is the best movie of them all. The cause's of death are amazing and the running order too. Very impressive........................................"}, {"rating": "8", "text": "A slight step up from the original. Well acted and a more developed plot helps redeem the status of the Final Destination franchise. The thing that makes this film stand out more then the original is that it has a clear beginning, middle and end. More mystery better deaths and higher production value. It's a pretty good cliche horror film."}, {"rating": "5", "text": "The movie is sick and funny and everthing in between. For some reason, watching people die horrible deaths in somewhat enjoyable. Only wish the script and acting could have been as good as the deaths."}, {"rating": "5", "text": "This is probably the worst movie in the franchise.It was boring and the acting was not really good.The visuals from the deaths are good but the result is boring.The movie does not deliver what we were expecting."}, {"rating": "7", "text": "Suite directe du premier film mais avec sa seule rescapée, la mignonnette Ali Larter, et conséquemment un nouveau groupe assez varié ici, fin prêt à partir pour la destination finale, la même que précédemment, à savoir direction le broyeur toujours avide de viande frâiche...Comme de coutume, ça commence par une grande catastrophe, très impressionnante ici sur la route 23... au km 180. Et on se régale... Bien sûr, les débiles vont chercher le moyen de déjouer le plan de la grande faucheuse au fil des atermoiements d'un scénario qui part assez en vrille, il faut bien le dire. Si quelques accidents sentent le poisson et la paresse d'un scénariste fatigué, bien d'autres font preuve d'une inventivité et d'un sadisme merveilleux... surtout que le gore est l'invité d'honneur, très généreux ! Indéniablement drôle, ce second Destination finale n'a pas trouvé l'eau tiède mais assume totalement et avec une singulière bonne humeur son statut de film pop-corn."}, {"rating": "5", "text": "This movie was not any where near as good as i thought it would be-it was a horrible disappointment to me and to all final destination films. After the original, and how awesome that was, then they go and make this piece of **** I gave it a 5 because it does not deserve anything lower"}, {"rating": "0", "text": "Final Destination was brilliant and always will be. The first movie was never meant to be made into a series.\rThis sequel is beyond lame and corny. All the effects are overdone and intended to shock you but they make you cringe and are overly gory. The movie provides more laughs than scares and in horror movies that's usually not the intention."}, {"rating": "5", "text": "Some of you heard my skateboard joke that I was trying to describe about the first installment of this series. Well, this time, I'm not gonna use that joke in this one. I was really waiting for a sequel that would wipe out the original. Don't get me wrong. It wasn't the worst, but it was just predictable. Then, at last, Final Destination 2 has been an improvement, but that's not saying much.Don't like: The predictable story, the pointless characters, the forgettable soundtrack and the lame bickering and arguing used from the first movie.Do like: The premise, the acting, the realistic death scenes and the clever writing.So, to sum it, not good, not bad, mediocre installment, but way better than the first. That's it.5.0 out of 10"}, {"rating": "5", "text": "\"Final Destination 2\" nem sempre conseguiu assustar e, às vezes, deixou-nos a rir. Ainda assim, as cenas das mortes são realistas, o enredo é bom e a escrita da sequela mantém-se consistente.5/10"}, {"rating": "7", "text": "No entiendo el hate, la verdad que me pareció una entrega muy buena mucho mas gore que la anterior."}, {"rating": "5", "text": "Woman has a vision of a motorway accident that kills her so stops driving before everyone gets killed before death starts picking them off."}, {"rating": "8", "text": "While not as good as the first this is still a decent sequel that probably just tries to do a little too much when it comes to twists and trying to work with the original. That aside, the opening scene is, of course, impressive, and the deaths to follow are equally as good. Only Clear returns from the original (oh and that funeral guy) but the newbies are decent. It's much cornier also but enough comparing, as a stand-alone film it's entertaining and will impress the right audiences."}, {"rating": "5", "text": "The film doesn't need a script, if only because its language is not in talk but in the scenes of disaster, in which case here the tension is what gives the movie! Let's say that the film is quite strong enough, that besides the very impressive visual effects, you get a bit shocked in due to some scenes could not be forgotten for a long time... Like when you're going out of the car and you're in a traffic jam... already run through in a panic after seeing this movie... heheh Being a horror movie, many people fail to understand that movies like these should not be taken seriously, because it is only as great fun for fans of the genre. I read several comments on many websites about this film, not everyone liked, which is common because some found appealing and extremely bad taste, in fact, for a horror movie, what do you expect? Just don't agree to compare this movie with others like \"The Ring,\" \"The Others\", which are other types of horror films which deal with other issues other proposals... Premonition is a teen horror movie (like \"Scream,\" \"Urban Legend \"...) of humor, not psychological horror, for it has nothing to compare them. Director David R. Ellis did very well, because we can not always attend to a sequence as good as its predecessor."}, {"rating": "5", "text": "I found the movie quite entertaining. I would give it a 10 just for the crash scene in the beginning of the movie, which must be THE best crash scene ever done, seriously. I guess it would have been better not to have seen the first one, because this one is pretty much a copy, but still, it is entertaining. Which serves the purpose. It even contains several memorable scenes - how many movies can you name that contain scenes where people say \"Yes I remember that\" ? So, it was good value for the money."}, {"rating": "6", "text": "Admittedly, it's kind of hard for me to consider this movie to be true horror. It's less concerned with scaring you and more interested in just throwing crazy deaths on the screen for cheap thrills. Occasionally it'll even pop in some jokes. There's nothing here that will get under your skin and keep you up at night. The concept is still great though and watching these bland characters try to cheat death, fail, and meet a gruesome demise has it's value.The kills themselves are pretty creative and often amusing. Their convoluted set ups are usually quite obvious, but every now and then it'll use the more chaotic moments for a bit misdirection. That's not to say it's smart in any way, but it can still provide a good kick here and there. The gore effects are quite well-done. The plot doesn't quite fare so well. It's a simple, but enticing premise that needed to be fleshed out with characters we cared about. Unfortunately that just didn't happen. Everyone is committed, but they are mostly just playing bland stereotypes who are there just to add to death's final body count. It does get a little deeper with the premonitions this time around, so that's neat.Overall, the movie doesn't really have much going for it other than the deaths. So it's simple, stupid fun aimed at the teenage crowd who would rather see blood and guts as opposed to real horror. That's not an entirely bad thing. It certainly does what it does decently enough. For true genre buffs though, this is a passing amusement at best."}, {"rating": "5", "text": "Final Destination 2 it's not as good as the first one but it is still pretty good i mean Ali Larter return as claire and this movie has probably the best accident in the whole series. But it's not bad but i still recommend the first one"}, {"rating": "6", "text": "Levemente Melhor e superior ao primeiro A.J Cook faz um excelente trabalho.\rContém cenas fodas como a do acidente com o caminhão de toras de árvores,a morte na cozinha e Etc.\rMelhor que o primeiro"}, {"rating": "7", "text": "50th review!\r I thought this movie was superior to its predecessor in almost every way. It had better acting, cooler death sequences, and a more intriguing plot. It's a bit contrived in some of its plot elements, and the bickering between characters from the first movie is a problem here as well. If you're a fan of the first film, you will enjoy this film even more."}, {"rating": "5", "text": "The sequel to \"Final Destination \" was a little off topic for the comic part right which does not need , but it was boring , at least it was no worse than the fourth."}, {"rating": "2", "text": "La peor de toda la saga, personajes aburridos y torpes, situaciones fuera de toda lógica, inconsistente y tediosa, lo único bueno es la escena de la carretera."}, {"rating": "10", "text": "The first Final Destination is amazing,it was dark,suspenseful,and everything a great horror movie should be,Final Destination 2 however,while it is unintentionally funny at times,and is clearly more of a \"Hollywood\" movie,it should not be underestimated,as it continues the dark tone from the first movie,and still manages to be quite fun.\r PROS:\r*Great deaths\r*Amazing premonition\r*Good characters\r*Suspenseful\r*Story-driven(feels like it has an actual beginning,middle,and end)\r*Tony Todd\r*The fact that it actually feels like it's a continuation of the first movie\r*The tone(dark,yet fun)\r*The effects\r CONS:\r*Unintentionally funny at times"}, {"rating": "5", "text": "Pretty much a complete repeat of the first film but even more ridiculous and silly."}, {"rating": "8", "text": "É um filme divertido e engraçado mas não passa aquela sensação de medo mas tem uma boa trama e personagens carismáticos"}, {"rating": "3", "text": "The movie wasn't what I thought it was going to be. The movie wastoo quick and the death scenes happened back to back and some was pointless. The dialouge was bad and the acting was too good. The movie just could have been better."}, {"rating": "3", "text": "This movie is bad, but it's also mighty tasteless. Unless you enjoy Faces Of Death, or those drunk driving accident films they show in school, you probably won't get much of a kick out of this movie. I was actually bothered by the pointless ways the sad characters all died. It's much worse than if they had been chopped up by a masked monster because deaths like the ones in Final Destination 2 actually happen to people in real life. The audience might as well be watching a snuff film. Of course, if you get off on this type of realistic sadism then you might enjoy it. I just keep getting flashbacks to the film they showed us in sixth grade of the little girl who got bent into pieces when she decided to play on a stopped train."}, {"rating": "1", "text": "Quite possibly the worst movie I will ever see in my lifetime. So stupid I don't know weather to cringe or laugh."}, {"rating": "8", "text": "Now, I've only seen death scenes on YouTube, but I thought the deaths were at first quite disturbing and haunting. Then I looked at them again and laughed my pants off at each one! Of course, they all seem unlikely, so that added to the humor. There are of course some overexaggerated special effects though, such as one of the cars exploding in a cloud of flame and debris when it only hit a fallen log head-on. But however, an entertaining movie from the looks of it, and a good horror film. I'd probably give Final Destination 2 a solid B."}, {"rating": "7", "text": "It's not as good as it's predecessor, but Final Destination 2 actually manages to etch in some comedy along with the grim wit of the first film. It also manages to include enough blood and gore to fill the Nile river. The deaths are even more inventive and chilling, and the final death is unexpected and funny as hell. I was packed full of evil giggling after seeing this one. After a while, I realized that in every horror movie there exists one character so hated and despised by the audience that they wish for that character to die in the most morally reprehensible way possible. Final Destination (and it's sequel) is built on this very concept, giving viewers an entire cast of such individuals and systematically kills them with merciless brutality. Brilliant."}, {"rating": "10", "text": "Final Destination 2 was a very affective horror film that got you to really identify with and care about the characters. Yes, some of the deaths were a little absurd but its a movie and should not be taken as seriosly as some people have taken these films."}, {"rating": "8", "text": "\"This risible thriller is merely a sadistic series of misread premonitions and vile murders. \" Thats exactly what makes it fun."}, {"rating": "4", "text": "It's not scary in any way. It's almost funny how the ways the characters die (a barbed wire fence launched at a guy and he get's sliced into pieces? REALLY?) In fact, it's basically the same as the first film."}, {"rating": "2", "text": "I don't like this one. This must be my least favorite Final Destination movies out of the 5. It was rather boring. Maybe I just don't like this director's style very much."}, {"rating": "7", "text": "One of the best of the franchise, with a faster pace than the first, and also with more tension, the deaths become more creative and intelligent, the acting is convincing and the plot is good."}, {"rating": "6", "text": "I guess I am the only one that thought the sequel was on par with the original. The kills were more graphic, The acting was better as well. My only issues would be is that they can't seem to decide upon which rules really apply in this universe. That kind of irritates me but aside from that, It was a good movie. I don't get the hate."}, {"rating": "4", "text": "\"Final Destination 2\", the sequel to the the decent original, doesn't pretend to be anything other than a complete repeat of the first film. The plot is even more ridiculous than the first, really a bad waste of time."}, {"rating": "1", "text": "This movie totally sucks, anyone that likes this knows nothing of comedy nor horror. The horror movies of the 70\\\\\\'s were the best, & never will that be done again. IE: Texas Chainsaw Massacre, 1st Halloween, 1st Jason, etc.. Not even one single hot chick, I wanted to see the cop DIE!"}, {"rating": "4", "text": "First of all, the opening scene was awesome but that doesn't mean the movie is awesome. The three flaws were that some of the characters were really cliched and at times it was utterly predictable and sometimes even boring. The worst Final Destination of them all."}, {"rating": "7", "text": "I really enjoy Final Destination, the original, and this was an excellent sequel, as good as the original. The deaths in my opinion. Re much better though, very creative and graphic. This is a very fun movie, much like the first, and pages the way for more sequels, this is another example of Final Destination at its prime. 7/10"}, {"rating": "6", "text": "When people talk about movies that changed their outlook on life, I think Final Destination 2 is my pick. I mean, every time am in a car on a motorway and am behind a truck carrying something dangerous, I always think back to the log scene."}, {"rating": "6", "text": "Final Destination 2 as a sequel is very mediocre. In sequels, everything should be better or at least more. There are sequels. But Final Destination 2 is just the same, just replacing the initial scene and cast. And although character murders are still the main element of the film for which you watch it, it no longer has such an effect. 2 part is still removed at the normal level relative to subsequent extensions. But it can be advised clearly only to those who entered the first part. Secondary project per person."}, {"rating": "9", "text": "This really surprised me. Initially when I first saw it I thought there was no way they'd be able to do a sequel. This one in my opinion is the best of the bunch. It all starts off with the most insane scene ever. A giant accident on the highway that's let's the audience know all the different ways you can die. Like the first someone has a vision but this time around it's a young woman who ends up stopping traffic and saves a group of strangers who of course begin to die in the spectacularly gruesome ways. The death setpieces are ridiculously impressive a combination of practical and digital effects. My favorite has to be the glass kill but all of them are remarkable and hella shocking. The movie unlike the original doesn't take itself seriously and neither should you but it also impressively lays out a complex twist that brings it all together. A superior film to the first with solid performances all around.Budget: $26MBox Office: $90.4M8.5/10"}, {"rating": "7", "text": "Amazing just like 1st one!great connection with 1st one like how flight 180 survived people died and how the leads in this part was saved from they're death!good acting and music every death was terrifying and suspenseful to watch visions were confusing and kept me guessing whats going to happen felt entertaining to watch!"}, {"rating": "8", "text": "Ich finde es sehr cool das eine Frau in die Zukunft sehen kann sonst waren es immer Männer. Ein wirklich guter Film. (Dafür das es vom Jahr 2003 war waren die Effekte richtig gut).    > 8/10 *"}, {"rating": "6", "text": "This is my least favorite out of the series. Just main character doesn't sell her character to me in this. The death scenes were cool, but it was just an ok movie."}, {"rating": "7", "text": "Final Destination 2 is creepy, enjoyable and importantly, better than the original. This movie had the iconic wood log truck scene and the way deaths happened, you may get frightened and think what if this happens in reality.The direction and acting was better than the original. Like original, you will be busy enjoying the thrill and drama and will give you mixed feeling of horror, drama and thrill.Overall, will recommend everyone to give it a try."}, {"rating": "4", "text": "Among all the titles of the saga this is in my opinion the worst because the plot is the same as the predecessor and the deaths are not so fanciful and therefore it turns out to be the most forgettable film of the entire saga."}], "recommendations": ["final_destination", "final_destination_3", "the_final_destination", "the_strangers_prey_at_night", "hostel_part_ii", "saw_iii", "malignant", "happy_death_day_2u", "insidious_chapter_2", "texas_chainsaw_3d", "countdown", "the_grudge_2", "dark_skies", "scream_4", "annabelle", "jigsaw", "the_last_house_on_the_left", "insidious_the_last_key", "chernobyl_diaries", "hellbound_hellraiser_ii", "the_collection", "saw_ii", "scream_2", "underworld_blood_wars", "sinister_2"]}