{
  "id": 42,
  "title": "Finch",
  "starring": [
    "Tom Hanks",
    "Caleb Landry Jones"
  ],
  "runtime": 115,
  "genre": [
    "Science Fiction",
    "Drama",
    "Adventure"
  ],
  "description": "On a post-apocalyptic Earth, a robot, built to protect the life of his dying creator's beloved dog, learns about life, love, friendship, and what it means to be human.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jKuDyqx7jrjiR9cDzB5pxzhJAdv.jpg",
  "categories": {
    "plot": 6.6,
    "acting": 6.846153846153846,
    "ending": 6.0,
    "soundtrack": 7.333333333333333,
    "cinematography": 6.75,
    "familyFriendly": 6.0,
    "funny": 6.142857142857143,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "It's impossible to not like a sentimental Tom Hanks movie. It's one of the last pure joys of Hollywood we have left. And Finch is all that, a warm, good-hearted movie, though very limited in scope. Feels more like a long vignette than a 3-act feature film, but that's ok sometimes."
    },
    {
      "rating": "7",
      "text": "Tom Hanks just makes good movies. Middle stretches thin but the beginning and end make up for it. Man, beast, machine, artificial intelligence, and the universe. It’s the story of our time here, beautiful, sad, happy, terrifying, it’s all here."
    },
    {
      "rating": "8",
      "text": "Finch perhaps maybe a touch too long for some viewers (at 1hr 49min) but patient audiences should be rewarded. Hanks does what he does best in a strange picture that casts him aside a Dog and an A.I. Robot. The dog is a likable pooch and the robot, built by dying electrical engineer Tom, is programmed to care for his canine friend after he’s gone. This is no kids picture and there’s suspense in its bleak post-apocalyptic setting (earth decimated by a Solar Flair) spots of humor are also well-placed and don’t detract from the drama. Thankfully the writers (Craig Luck and Ivor Powell) and director (Miguel Sapochnik AKF; ‘Hunger Games’) keep the focus on the central humane theme – unlike many other movies out there presently, they have avoided the superficial over-the-top spectacle and kept it mostly believable. Perhaps some aspects of the story might not hold up to close scrutiny (but who’s lived on post-apocalyptic earth to know?) it’s the amiable personality development between the three ‘friends’ that keeps it entertaining. The last scene offers a melancholy moment to consider Hank’s character, and what he’s missed in life.  Quality cinematography and music score (both original and from the past) dress it up nicely. There even seems to be rather well-chosen parallels to Don MacLean’s, American Pie’s father theme (?) Not to mention the symbolism of the 1984 Fleetwood RV.  Worth thinking about."
    },
    {
      "rating": "9",
      "text": "This is Tom Hanks at his best... the whole concept had us gripped from beginning to end. I didn't use my phone once during the film."
    },
    {
      "rating": "9",
      "text": "Очень душевный и милый фильм. Том Хэнкс в стандартном амплуа, от этого появляется ощущения, что вернулся в детство. В общем, рекомендую ознакомится, отличная семейная драма с элементами научной фантастики."
    },
    {
      "rating": "2",
      "text": "25 years ago, Could anyone dream of  tom hanks talks to a dog and a cgi puppet in a apple+ movie.  but here we are. Tom hanks talks to a dog, creates a robot for the dog and all three flee to san fransico in a post apocalyptic world. that`s all. it not good. its not entertaining.  someone took the book of eli, wall-e, iam legend and mixed it together to something finch"
    },
    {
      "rating": "5",
      "text": "A very average movie where Tom Hanks plays old man Tom Hanks. He's not bad, but it's kind of tiring seeing him do the very same thing over and over. Caleb Landry Jones, as Jeff, is the best part of 'Finch'. The way he changes his voice as he develops human traits is funny and fulfilling. I appreciate the noble idea of this, but post-apocalyptic films have been done to death, so there's nothing here you haven't seen before."
    },
    {
      "rating": "3",
      "text": "Another painfully generic, by the numbers movie staring an A-lister that offers nothing original or anything of substance. Passable at best."
    },
    {
      "rating": "5",
      "text": "Finch is a post-apocalyptic story where the world's situation is not really important, and frankly, that's not really a bad thing.Of course the reasons for this can be questioned, because it's not of much use, but an unlikely human-robot friendship story doesn't sound so bad in any situation. But that's only if you can make it work.Tom Hanks is too proven an actor to have a hard time holding a film all by himself, and the film's production is pretty well done, but the script is weak, predictable and inconsistent.Not terrible though, just absolutely unremarkable.I believe with absolute certainty that Finch could have tried to explore and exploit other types of more interesting narrative resources, but quite fast I saw there was no interest in using other narrative variants, and the whole conduction of the story plays it safe from start to finish.Just a weekend option, if you had no better ones."
    },
    {
      "rating": "1",
      "text": "I am Sorry, this Movie is GARBAGE. Only a Single Character in the whole Movie. There is Absolutely Nothing to Love about this Movie. Nothing! It is Actually a Shame Tom Hanks Decided to make This Movie. The Best Part about this Movie is the Movie Cover!"
    },
    {
      "rating": "5",
      "text": "As good as Tom Hanks is he can't carry this movie because the story isn't very good...the growing up of an Android? His skills can be used elsewhere."
    },
    {
      "rating": "8",
      "text": "excellent[ ek-suh-luhnt ]adjectivepossessing outstanding quality or superior merit; remarkably good."
    },
    {
      "rating": "3",
      "text": "Hard to understand who thought this was a good idea. Charming performance from Hanks is a given, but the script is by turns clichéd, unfunny, corny and sappy, and usually at the same time. The robot is goofy and annoying, and the premise is totally incongruous; an apocalypse comedy with a side of sentimentality. Some critics, on automatic when they see Hanks, have, IMO, found grace and meaning where there is none. Unless the sight of Hanks deactivates your critical faculties, hard pass."
    },
    {
      "rating": "5",
      "text": "Decent performances and visual effects elevate an otherwise dry post apocalyptic road trip movie that struggles to find originality with so many other stronger examples within its genre (the road, wall-e, I am legend etc) and also mixes in the 'human teaches a robot to be human' trope from films like short circuit/ chappie etc. It's entertaining at best and just a bit dry and unchallenging to watch at its worst."
    },
    {
      "rating": "7",
      "text": "I enjoyed it, Tom Hanks was great as usual, interesting concept, it was a bit predictable towards end but nonetheless nice movie."
    },
    {
      "rating": "5",
      "text": "Finch is a passing movie created to fill the Apple TV + library. The film is completely unremarkable except for the excellent acting of Tom Hanks. The plot is one big cliché, the end of the film is even worse, it is the same cliché. There is a good camera job and a couple more jokes from Jeff's robot, but you should not wait for more."
    },
    {
      "rating": "4",
      "text": "This movie is very generic. By the end of the movie, I was like \"that's it?\". So much wasted potential."
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)Zemeckis produced another \"Cast Away\" (2000), another Hanks' one man show in another survival movie, but placed in a strictly post-apocalyptic future and with a strictly dystopian sci-fi (cowardly not of anthropic origin). A disappointing \"I am Legend\" (Lawrence 2007) or \"Chappie\" (Blomkamp, 2015) on the road. \"I wish I had done more with the time I had,\" Finch cries at one point. I wouldn't be surprised if the filmmakers thought exactly the same thing."
    },
    {
      "rating": "7",
      "text": "I didn't see a trailer for this at all, and I must say Iwas pleasantly surprised. tom hanks is just outstanding in this film. this is a cross between cast away and mad max: fury road and it's amazing. the CGI is very impressive also, and it might be a contender for the Oscar for Best Visual Effects. I didn't think I would care about this film but this might be one of my favorite films of 2021. ↓ point rating ↓8.9 out of 12 = 74%⚡️ acting - 0.8⚡️ cinematography - 0.7⚡️ costume design - 0.7⚡️ directing - 0.7⚡️ film editing - 0.6⚡️ makeup & hairstyling - 0.7⚡️ music - 0.7⚡️ production design - 1.0⚡️ score - 0.8⚡️ sound design - 0.8⚡️ visual effects - 0.8⚡️ writing - 0.6"
    },
    {
      "rating": "7",
      "text": "I didn't see a trailer for this at all, and I must say Iwas pleasantly surprised. tom hanks is just outstanding in this film. this is a cross between cast away and mad max: fury road and it's amazing. the CGI is very impressive also, and it might be a contender for the Oscar for Best Visual Effects. I didn't think I would care about this film but this might be one of my favorite films of 2021. ↓ point rating ↓8.9 out of 12 = 74%⚡️ acting - 0.8⚡️ cinematography - 0.7⚡️ costume design - 0.7⚡️ directing - 0.7⚡️ film editing - 0.6⚡️ makeup & hairstyling - 0.7⚡️ music - 0.7⚡️ production design - 1.0⚡️ score - 0.8⚡️ sound design - 0.8⚡️ visual effects - 0.8⚡️ writing - 0.6"
    },
    {
      "rating": "8",
      "text": "This film reminded me very much of 'I Am Legend' from early on - only, obviously, this stars Tom Hanks, not Will Smith and there aren't really any zombies around but it deals very much with isolation and a barren (once urban) environment. There's some quite poignant dialogue and Hanks shows his characters vulnerabilities well, even if not saying too much in certain moments. It is surprisingly moving at times. I thought the robot reminded me slightly of Wall-E from the Pixar film of the same name - his basic questions relating to/querying human emotion are quite touching. It is thoughtful and sobering...a decent film worth seeing if you can, yes."
    },
    {
      "rating": "10",
      "text": "Finch is not a perfect movie but it shines in an era where most movies have nothing to give"
    },
    {
      "rating": "10",
      "text": "great movie. shame there are so many freaks who don't like it. but i guess not everyone has enough brain cells"
    },
    {
      "rating": "7",
      "text": "FinchTom Hanks puts in his usual good performance in this pretty bleak family film. Despite Jeff (robot) sounding a bit like Borat, he/it does stand out as the star.A slightly flat ending made me wonder if this film had been better if made as a comedy.7/10"
    },
    {
      "rating": "9",
      "text": "Incredible movie full of emotion while still being captivating, showing the evolution to characters in a fenomenal way. Highly recommended"
    },
    {
      "rating": "8",
      "text": "Finch (2021) is an Apple TV+ film starring Tom Hanks as the titular character, a couple of robots, and a dog. Set on a post-apocalyptic Earth, it is about Finch and his companions trying to survive while they set on a journey for a better location. I legitimately decided to watch it just because I saw a solo Tom Hanks with a Robot and a dog on the poster, thinking at worst it will be a middling watch. It turned out to be a heartwarming and somewhat original experience and I'm glad I made that jump. Tom Hanks, to no surprise, delivers a poignant performance as an old survivor in a desolate landscape desperate to find some way of safeguarding his only biological companion, particularly in his absence, a doggo named Goodyear played wonderfully by Seamus. He is also accompanied by a four-wheeled helping hand robot Dewey, and the best part of the film, Jeff, the humanoid bot with true artificial intelligence voice nicely by Caleb Landry Jones. Together, you set out on a journey with them that'll give make you laugh and give you the FEELS! Apart from the group, the thing I loved about this movie is that it sets itself apart from other films by focusing solely on the group and does not dive into what you'd normally expect from a post-apocalyptic setting. The meat of the experience is from small subtle things instead of having big thrilling set pieces or the typical Human conflicts. Seeing Jeff learning what it means to be Human from Finch and Goodyear in his newfound conscience had me smiling most of the film. I do wish the movie delve deeper into those Human elements and themes but I'm still satisfied with what I got.  Directed by Miguel Sapochnik, who directed some of my favourite episodes from Game of Thrones, the movie is competently made. It can be a looker at times. Written by a duo of newbies when it comes to feature-length films, Craig Luck and Ivor Powell, I admired their venture into doing something different with a setting that could have been by the numbers story. Also, while understated, the musical score by Gustavo Santaolalla added a layer of poignancy to the entire experience, especially in key scenes. Now, it is almost 2 hours long, you hardly get any detours and instead just simmer in the experience, so the entire thing is slow-paced, which I can understand can be a turn off for a lot of people but for me, it just worked. I was enthralled by it and was enjoying the characters and their journey. So if you get bored by slow-paced stuff easily, I wouldn't recommend it. Otherwise, I'd suggest giving it a try, the movie might surprise you. You leave it feeling content. A slice of life experience in a post-apocalyptic world. Something original or different, at least for me. And if I were to rate it, I'd give it a solid 8/10."
    },
    {
      "rating": "5",
      "text": "I loved this movie! It kept us gripped through out and crying at the end. Tom does it again, we don’t care what the bad reviewers said."
    },
    {
      "rating": "7",
      "text": "Finch really surprised me! A uniquely personal and intimate take on an apocalypse film filled with witty humour and grounded in effective emotion. Really well helmed by Miguel Sapochnik with seamless visual effects. Jeff is the MVP."
    }
  ]
}