{
  "id": 1821,
  "title": "Finding Dory",
  "starring": [
    "Albert Brooks",
    "Ellen DeGeneres"
  ],
  "runtime": 97,
  "genre": [
    "Adventure",
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "Dory is reunited with her friends Nemo and Marlin in the search for answers about her past. What can she remember? Who are her parents? And where did she learn to speak Whale?",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3UVe8NL1E2ZdUZ9EDlKGJY5UzE.jpg",
  "categories": {
    "plot": 8.245283018867925,
    "acting": 8.25,
    "ending": 7.5,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 7.333333333333333,
    "funny": 8.043478260869565,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Finding Dory is not just a good sequel, its a great one with more emotional depth and memorable characters finding dory is one of 2016s best films and another great animation from pixar"
    },
    {
      "rating": "10",
      "text": "Ellen delivers a much more entertaining view to dory on this amazing adventure in finding dory. The experience through out the movie is spectacular and i believe Finding dory is one of the only sequels that are amazing"
    },
    {
      "rating": "8",
      "text": "Many sequels can't quite live up to their predecessor(s). However, the exact opposite is the case for Finding Dory. Boasting amazing performances from Ellen DeGeneres' Dory and Ed O'Neill's crowd-favorite Hank, as well as beautiful visuals, Finding Dory is a well-rounded, and above all funny, family adventure."
    },
    {
      "rating": "10",
      "text": "Finding Dory is the rare sequel that is able to match it's predecessor. It succeeds where most sequels fail. And if that predecessor is Finding Nemo - one of the best movies of the genre - you can understand the power and heart this movie has."
    },
    {
      "rating": "10",
      "text": "This sequel might not be as great as the original but that doesn't mean the film is bad but  instead its another Pixar movie that deserve the praise.Finding Dory is a amusing,touching,moving and a intriguing film that delivers an amazing animation that Pixar is known for and a significant continuation of it's predecessor.The voice works here are appreciable and the characters are just lovable and  entertaining.This sequel will feel identical from it's predecessor but some of it are new additions that were worthy enough to make this film great and a touching moments that made people weep.\r Finding Dory is another example that there is more ideas in a franchise if the people making it has effort and passion to do it.Finding Dory might have some identical story and a some emotional scenes that didn't intrigue audiences but overall the film is near to the \"one of the best animated films\" very very very,very far from the worst ."
    },
    {
      "rating": "6",
      "text": "Finding Dory has its amusing and funny moments however the overarching story fails to deliver - especially for a pixar movie.\r The biggest issue that I have with this movie is that it is almost solely fueled by 'deus ex machina' moments. It prioritizes luck over problem-solving which ends up as weak storytelling.  Also the appearance of Marlin and Nemo felt unnecessary as they only minimally contribute to the progression of the story while taking quite a bit of screen time.\r Overall a passable movie but without the depth that I expect from pixar."
    },
    {
      "rating": "8",
      "text": "Finding Dory is not one of Pixar's best, but is really far from being bad. The movie presents an interesting premise, revealing the background of Dory, one of Pixar's most beloved characters. Unfortunately, this journey does not take place in the ocean, which really bothers me. Instead, it takes place mainly on a marine life institute. However, something made it all worth it: the new characters. They're just so charismatic that I can't help but love them. All of them. The structure of the plot may not be as great as it was in Finding Nemo, but Finding Dory has enough to keep you entertained through all of it."
    },
    {
      "rating": "10",
      "text": "Since 1995, when \"Toy Story\" was released, Pixar has managed to reinvent the animation genre by becoming the first studio to release full-length computer animated films. They didn't just change the animation technique. They added much depth to animated stories and made these films enjoyable for the entire family. While the studio has been facing a decline in quality as of late, \"Finding Dory\" is an exception of that and manages to meet the early standards of Pixar movies.Taking place just months after \"Finding Nemo\" ended, Dory remembers her long lost family and tries not only to find her parents, but also to remember how exactly she was lost. That leads her and her friends, Marlin and Nemo, to California. There they will have to face many challenges and meet new friends in the Marine Life Institute, as Dory is trying to remember.\"Finding Nemo\" set the bar high, so it was difficult for this sequel to meet expectations, even after coming 13 years later. \"Finding Dory\" could have gone wrong in many ways, such as by focusing on Dory, a character with short-term memory loss and a comic relief, which most audiences can't relate too. But people who don't suffer from disabilities can relate to Marlin and Nemo, as they struggle to help their friend. The movie is heartfelt, complex, funny, cute, deep and teaches a very important lesson. It's also stunning. A great time for all families and for fans of the original and an impressive feat in the history of sequels."
    },
    {
      "rating": "9",
      "text": "With considerable risk, Finding Dory mixes a tale of the past with a new story that delivers on many levels. Whilst Finding Dory plays on nostalgia to a large extent, it is also a fresh new film with fantastic new ideas in each scene. Hilariously funny, exciting, sad and meaningful, Finding Dory is a worthy sequel to one of the best animated films of all time."
    },
    {
      "rating": "10",
      "text": "I think finding dory is a great film I went to watch it in the cinema with my auntie and my cousin, it was a really good film and it made me cry I cant say the reason or I would be spoiling the film for anyone who hasn't yet seen it. its a great family film and would recommend it to everyone"
    },
    {
      "rating": "9",
      "text": "Before Nemo, a long ago another child got lost in the open ocean...Whoa! 200 million dollar film, 1 billion box office collections worldwide. The 27th film to do that so and the 5th animation film. This sequel was made after 13 years, surely a long gab, but 'Finding Nemo' was one of my favourite animations, tell me who does not love it those who love animation. Nevertheless, I liked the idea of having a sequel, but I scared it would go to flop terribly. Now, after watching this, I totally stunned. This is not a greatest animation ever made, but the way the screenplay handled, along with other stuffs, this makes one of the best among its kind.Firstly, when I heard the sequel's title, it made me laugh. Like, whaaaat? Once again the story is going to repeat. I did not think it would bring a big change. Actually, it was a different tale, especially I was not expecting it to be emotional. Tell me how many tearjerker-animation you have seen. Once again the Disney-Pixar jointly did it. I think appreciation must go to the director who also made the original film. Great casting too, I mean the voice- over artists.We know that Dory is severely suffering from the short term remembory (memory) loss. Now this tale is going to reveal her backstory. From her childhood to till she meets Marlin and then Nemo, there was a series of forgotten events. She slowly regains some of those memories and begins her quest to find out more. This is where she gets lost, but the title defines that she was lost before and now looking a way to get back where she really belongs.For me, after 'Frozen', this film is what emotionally got me. The value of having family and friends beautifully disclosed. It might be an animation, but still a meaningful story from many perspectives. Lots of new characters were introduced and those were really cool ones. I expect theirs short animations to make its way about their origins, particularly Hank the octopus and his story about how he lost one of his tentacles.The Oscars is the quarter of a year away, but releasing nominees would come weeks ahead. So it's about time to learn where this one fit in. But I'm anticipating close contest between this, 'Zootopia' and 'Red Turtle'. Coming back to the review, this is a good watch, for everybody, so I highly recommend it. I hope there will be a third film, but like I had felt before this, I desire it and then I'm not sure it would extend its legacy to further. So fingers crossed!9/10"
    },
    {
      "rating": "8",
      "text": "Background: I have seen Finding Nemo, but only on TV. Loved it.\r Pros: It looks good.\r Cons:\r(1) The film failed to step away from its predecessor and the other Pixar films and do something really different. Considering the numerous in-built messages of the preceding Pixar films, this film does not seem to have a profound message of its own. Was there a need to make a sequel to Finding Nemo? Could it have been written better?\r (2) Many of the stunts in the film did not seem plausible. They seemed to be set-up to convince the younger audiences only.\r Who would think the film is great? All childen.\rWho would think the film is only so-so? All adults\rWho would think the film is lousy? No one.\r Rating: 4/5 (no half scores). It's worth it to watch it in the cinemas."
    },
    {
      "rating": "7",
      "text": "Seriously has there been a bad Pixar film? Some might not to be to all tastes (I am not the world’s biggest Toy Story fan for example but I admire the quality of the films.) For those rooting for this to be the time that Pixar goes to the well too often prepare to be disappointed. This is actually a decent film. Good characters check. Easter eggs check. Nice visuals check. Is it all that memorable? No. It will keep the kids entertained and adults will not suffer. While that may not be the measure of a great Pixar film it certainly is a measure of a good kids film"
    },
    {
      "rating": "7",
      "text": "Great voice acting, fantastic CGI, which we have come accustom to with Disney/Pixar. It was absolutely hilarious and of course the heart warming parts that Disney is so good at. I was also surprised that it wasn't just a rehash of the first film. I also loved the intro scene with the little bird. It was pretty awesome."
    },
    {
      "rating": "7",
      "text": "Um filme engraçado, sem duvida as crianças vão gostar. Explora o mundo da fantasia ao maximo e diverte. Para alem disso é engraçado e explora varias coisas da vida dos peixes"
    },
    {
      "rating": "10",
      "text": "Wow...is this film amazing. Completely blows The Good Dinosaur out of the water as Finding Dory...throws us back in. Come on, I HAD to. This movie left my tear ducts dry heaving by the 4 minute mark. The new characters weren't just \"oh hey we're new, g'bye\" like other Pixar sequels. This time most of the new characters played a part in the story! And it's an astounding cast, astounding visuals (I haven't even scratched the surface with Piper), and astounding...well, everything. I recommend 101%."
    },
    {
      "rating": "9",
      "text": "Though this film doesn't dazzle like Finding Nemo did (which in my opinion is the best Pixar film), it's still a great film filled with emotion and alot more humor than the 1st film. I didn't think it would hit the feels like Nemo did, especially when the plot is very similar, but it did and I would say it hit deeper than the 1st film did. Dory's sense of hopelessness at times with their memory loss did make me tear up. In the 1st film her memory loss made Dory like the comic relief of the film, here we actually get to see all the trouble and emotions of living with it. The animation of the film is top tier aswell. Thomas Newman's score hits a perfect 10 also. For those who were huge fans of Finding Nemo as a kid, this is a certain must-watch. A satisfying sequel to the movie which was a huge part of my childhood."
    },
    {
      "rating": "7",
      "text": "Dory is an heartfelt & enjoyable sequel with some wonderful voice acting (especially from DeGeneres). The somewhat thin plot is well written as to last almost 2 hours, but you can't shake the feeling that they were capitalising on the popularity of the first film for this to be such a financial success."
    },
    {
      "rating": "10",
      "text": "this is one of the best ivies I've ever seen so far, the voice acting is fantastic, the new characters are awesome, Hank is a very good character and he deserves it's own zone inside my review, the story is better then the first movie one's but the scenes in this movie may not be look as mighty as the finding nemo one's (and a great thing about the first movie was the scenes the best for its time). anyway this movie is always unexpected and it shows that the guys at the pixar don't joke with this stuff.\rP.s. this movie confirms me again, I grown up watching Pixar movies, that John Lasseter is not a man, he's a god"
    },
    {
      "rating": "10",
      "text": "I have to say, I was a bit torn about watching this film, or not. I don't like sequels, except in very rare occasions. I thought it would never live up to my fav \"Nemo\" since I consider it to be one of the best of its kind. I was planning to watch it, eventually, on DVD when a friend insisted we went to a cinema near us.\rI was caught by surprise, I was sucked in the story, I was laughing like a kid. Its freshness, tenderness, adventure took me to a place in my heart I will never forget. And imagine, all theatre was full of noisy 3-5 year-olds that I generally don't appreciate. It was like I had earplugs! A perfect 10, thank you Pixar,Disney for the dream!"
    },
    {
      "rating": "10",
      "text": "Was very well done the and was a great movie date for my bf and I. Th only down side of the movie is the plot was given away and it was hyped up too much too early."
    },
    {
      "rating": "7",
      "text": "7.8 out of ten too much water 7.8 out of ten too much water 7.8 out of ten too much water 7.8 out of ten too much water 7.8 out of ten too much water 7.8 out of ten too much water"
    },
    {
      "rating": "8",
      "text": "The first was better (A 9.5), however, Dory is still quite good. My exact word after getting out were, “Better than Batman V Superman.” I wasn’t lying."
    },
    {
      "rating": "8",
      "text": "I am rating this movie from the perspective that its primary goal is to target the under 13 crowd.  Great script for a 'cartoon' movie and great humor.  The movie flowed well and not only satisfied the under 13 crowd, but was a hit with everyone.  We watched this movie at a packed outdoor theater with more than half the audience watching outside their vehicles.  When the movie ended, there was a loud applause of satisfaction with the movie.  If you have kids - ours are 9 and 10 - they'll love the movie.  And that was the main goal for this movie - to make kids laugh and I sure heard a lot of them laughing through-out the movie.  Adults, don't try to over analyze the movie - it's a kids movie!"
    },
    {
      "rating": "7",
      "text": "A bit disappointing to be honest. It didn't have that emotional \"mmph\" that the first one had. I loved the Pixar short that came before the film, I thought it was really cute."
    },
    {
      "rating": "7",
      "text": "This sequel (or prequel?) to \"Finding Nemo\" is even more wondrously imagined and animated, and there’s enough intelligent convo and laugh lines to keep adults entertained. If anything, Stanton & pals have taken the drama to a new level—well, the movie is still about a lost child, but Dory seems more pointed in its portrayal of juvenile angst.  In fact, parents should give some thought to whether their youngsters who are old enough to understand the plot are also old enough not to worry about it.  But we adults (most of us) can take the poignancy and near-desperation that colors some scenes, and will appreciate the search for a resolution—to help Dory find ways around short-term “remembery” loss and, more generally, to cope with fear.  (In theaters, the movie is preceded by the short “Plover,” which has been highly praised for its animation but which I found rather flat, especially compared with Disney/Pixar’s previous “opening acts.”)"
    },
    {
      "rating": "9",
      "text": "Though not quite as good as its predecessor, Finding Dory is still a funny, moving and beautifully animated follow-up with characteristically hilarious work from Ellen DeGeneres as the title character. Like the best Pixar movies, it manages to be hilarious and poignant at the same time. There are some great new additions to the cast, particularly Ed O' Neil. The animation, as one would expect from a Pixar film, was stunning. On the whole, Finding Dory is a hugely satisfying sequel that kids and adults should enjoy."
    },
    {
      "rating": "8",
      "text": "Finally, after 13 years the movie is out but does it live up to the original movie?\r Animation-9.1/10\rOnce again, it's the great animation of Pixar movies.\r Story-8.6/10\rThe concept and idea of Dory finding here parents using all she can remember is just great but the execution was a little bit flawed.\r Comedy-7.9/10\rThere is some very good comedy over there but I feel like more jokes could have been added.\r Characters-8.8/10\rI like Destiny and Hank, they're really memorable(especially Hank) but more character development could have been added to Hank and bailey isn't that memorable.\r Innovation-7.2/10\rIt has some pretty good innovation.\r Verdict:While this move doesn't live up to the original, it's still a great movie and I give this movie an\r 8.3/10(Great)"
    },
    {
      "rating": "7",
      "text": "Pixar managed to do what Universal Pictures failed to do last year, take a supporting character and successfully transition them into the leading role. The best way to describe Finding Dory is cute. It has good laughs throughout and a slew of great new characters, especially Hank the Octopus who is one of the best Pixar characters in recent memory. I did find that it does tend to follow the Pixar formula a little too closely and doesn't try anything really new. Is this better than Finding Nemo? Of course it's not, but does it need to be? No it doesn't. While it isn't great Pixar, it is good Pixar."
    },
    {
      "rating": "7",
      "text": "The original had Marlin (Albert Brooks) \"Finding Nemo,\" with Dory (Ellen DeGeneres) as a hilarious sidekick. When you try to make a sidekick the star, their casual presence doesn't always work as the focus. Dory, who has only short term memory, decides to go in search of her parents. This takes her on adventures all over an aquatic theme park, but the sequel is darker, literally and thematically. Where the first featured colorful, delightful animation, this one often takes place in murky, gloomy environments. Dory's search leads to continuous self-doubt and hesitation. The movie runs too long, partially because the story takes too many twists and turns (ebbs and flows?). DeGeneres' flippant way with a punch line still lands the laffs and there are the requisite new wacky characters. Although less delightful than the original, it still has moments of entertaining fun. NOTE: Stay thru the credits for an extended gag."
    },
    {
      "rating": "7",
      "text": "I found one scene in “Finding Dory” to be absolutely ridiculous and while shaking my head I heard my brain saying, “What can be more ridiculous than an 80 year old man having a ball watching a cartoon about talking fish and enjoying himself, probably more than the kids in the audience?”\r I don’t know which was more fun recognizing old friends like Dory, the blue tang fish who has no short term memory, or Nemo and Marlin, the clown fish or meeting new friends like a very near sighted shark, a very strange octopus who can somewhat drive a truck and a beluga fish who can see outside of his surroundings.\r You are very quickly drawn into the picture as we meet Dory and her old and new friends. You not only are in their world but you believe the world exists no matter what situations they get into and out of, in the strangest ways!\r We are brought up to snuff regarding “Finding Nemo” and quickly get into Dory looking for her parents. “Finding Dory” is a little heavier and sadder than the first movie.  Though Dory’s movie is only about 3 minutes longer than Nemo’s because of its heavier scenes about friends and family it seems a lot longer. A lot more characters are introduced, some quickly who come and go, others become an important part of the picture.\r From the opening vignette, before the titles, up to the funny ‘bits’, mainly by Hank the octopus, under the closing credits, “Finding Dory” is a good film for the kids and the adults. Of the many films I have seen this year so far I would rate “Finding Dory” in the top 5.\r Yes Ellen DeGeneres is back as Dory and Albert Brooks is Nemo’s father, while Nemo is now voiced by Hayden Rolance along with Diane Keaton and Eugene Levy as Dory’s parents, Ty Burrell as Bailey the  Beluga whale, Kaitlin Olson as Destiny the near sighted shark among many others but don’t waste time trying to figure out who is what creature as it will only drive you crazy!\r I do expect a feature like “Finding Destiny and Bailey” in 2-3 years!!\r By the way we adults outnumbered the kids at the matinee which might say something---or not!"
    },
    {
      "rating": "9",
      "text": "What starts out as a somewhat bumpy trip down memory lane quickly escalates into an all-out frenzy of warmth, rib-splitting humor, and visual grandeur. Director Andrew Stanton not only proves that he is still capable of great filmmaking, but that worthwhile stories can still be found within this aquatic world we all fell in love with back in 2003. A sequel/spinoff that actually has a point/contains the same soul of its predecessor? I'll take it. This movie won me over. Big time. With its absolutely stunning setting, adorably hilarious characters, and truly enthralling final act, I can say that \"Finding Dory\" made me feel 100% like a kid again. Easily my favorite Pixar movie to come out since \"The Incredibles.\""
    },
    {
      "rating": "9",
      "text": "Surprisingly entertaining, hilarious and heart-warming. Visually stunning, the story is not as flawless and original as the studio's highest standards, but Finding Dory is a movie that's honest and excellent enough, who deserves applause and respect from Pixar fans and even haters alike."
    },
    {
      "rating": "10",
      "text": "I concede that this film may not be technically as brilliant as its predecessor. Regardless, it is beautiful, heartfelt, and deeply enjoyable. With a wealth of wonderfully-crafted characters, stunning visuals, gobs of laughs, and plenty of heart-warming adorableness, there is almost nothing in this film that I would change. With Inside Out and now Finding Dory, I can confidently say that Pixar has one again found its mojo."
    },
    {
      "rating": "6",
      "text": "Finding Dory is emotional, funny and poignant but in comparison to its classic predecessor, lacks the storytelling skill and groundbreaking visuals that could have elevated it into the high bar that Pixar usually sets."
    },
    {
      "rating": "10",
      "text": "So far... so great! Finding Dory is a great continuation of the original Finding Nemo witch I loved and still love it! The Characters, Animation, Story, Humor, everything about this movie worked for me!"
    },
    {
      "rating": "10",
      "text": "Absolutely an amazing animated film which also a great sequel.Finding Dory Delivers a fun,enjoyable,thought-provoking themes that certainly made the film good with amazing voice cast and a fantastic animation made it one of Pixar's Best effort."
    },
    {
      "rating": "9",
      "text": "Finding Dory isn't as great as Finding Nemo, but it still manages to be amazing. Pixar was able to find a new and emotional story to tell for Dory that is both touching and thrilling at the same time. The new cast of characters are just as good as the old, especially Hank. The CGI is spectacular once again, as well as the writing, the voice acting, the comedy, and the music. Definitely a must 'sea' for all, after the original of course."
    },
    {
      "rating": "8",
      "text": "While not quite as good as the original, Finding Dory is still yet another wonderful addition to Pixar's filmography. With fantastic voice performances yet again from Ellen Degeneres and Albert Brooks, as well as great turns here from Ed O'Neill, Idris Elba, and Dominic West, Finding Dory is a film packed to the brim with childlike wonder and emotion. A beautifully universal tale of the connection between family members and between you and your friends, Finding Dory is a heartfelt and moving animated tale of Dory trying to find her parents after having a memory of them. While the film can be kind of silly at times, it is obviously an animated film about fish talking, so I cannot really complain too much. That said, it is moving and really funny at times, especially when the sea lions are on the screen. Overall, Finding Dory is a fantastic film from the minds at Pixar and a worthy sequel to the nearly perfect original."
    },
    {
      "rating": "8",
      "text": "While not quite on the same level as Finding Nemo, Finding Dory is still plenty of fun and even emotional at times."
    },
    {
      "rating": "8",
      "text": "I was expecting Finding Dory to be awful, but it was actually pretty good. The storyline was creative, and the film was touching. Very well written, and not just a delight for the kids, but the adults too!"
    },
    {
      "rating": "8",
      "text": "While Finding Dory does not come close to being better than Finding Nemo (one of my favorite animated movies ever) and the first half/third feels a bit too familiar, the rest of the film is great and definitely a step in the right direction for Pixar, which has come off one of its best movies and one of its worst movies in the past year. All of the characters, old and especially new, are fantastic, the feels and themes are there, and, more importantly, the film is engaging and fun. Probably just in the dead middle of Pixar's 17 films, but still a great movie that I'd strongly suggest to anyone, especially if they have seen Finding Nemo or are generally a fan of Pixar."
    },
    {
      "rating": "9",
      "text": "Finding Dory is a wonderfully heartwarming, visually breathtaking, incredible film. It isn't as perfect as the first but it didn't need to be. It did what a good sequel's job is to do: it furthered along a story in a structurally familiar but also wildly original and different way. The film exceeds mostly due to it's overwhelmingly likable and hilarious characters. Every character, new and old, have their shining moments. Not just one moment. Multiple moments. From Dory to Nemo to Hank to Destiny to Becky to Gerald, they all are extremely memorable and help further the plot in their own, unique ways. And are truly the reason the film works so beautifully well.\r Finding Dory packs so much emotion in it's heartbreaking/heartwarming flashback scenes that are definitely the highlights of the film. I cried within the first five minutes and that's what I've come to expect with Pixar films. The film within the Pixar universe isn't one of the very best, just due to lack of originality. Which isn't necessarily a bad thing in this case. If this was the first in the series it would be groundbreaking, like the first Finding Nemo is.\r I loved Finding Dory with every inch of my body. It does everything it needed to do and actually exceeding my expectations more than I ever could have imagined. It even features positive messages of teaching children with disabilities and animal captivity. Finding Dory is a wonderful, emmersive, lovable film that I don't see anyone disliking. I cannot wait to see it again!"
    },
    {
      "rating": "9",
      "text": "Finding dory is a very good movie. Ellen is very good as dory and thought it does not live up to the high standers set by finding nemo it is still an enjoyably experience."
    },
    {
      "rating": "10",
      "text": "So why this isn't necessarily the BEST Pixar film, I gotta give it credit for opening kids up to such a serious topic such as mental health.\r Dory has short term memory loss.\r What was once a funny little gimmick for Finding Nemo is explored and opened up and is shown as something a lot more devastating and serious. Dory's memory loss is absolutely devastating. It stops her from achieving tasks and stops her from living a normal life. The way the film portrays how awful and how mental illness really effects everybody and how it destroys and tears people apart, yet also brings them together.\r This films was absolutely beautiful. I loved every moment. Its so cute and adorable but has soooo much heart and soul. I honestly started crying at one scene in the film. Being someone that actually struggles with mental illness it just brought a tear to my eye seeing a light film explore such a topic in such a positive and light hearted way that doesn't hide how frustrating and awful such a thing is.\r absolutely loved it."
    },
    {
      "rating": "6",
      "text": "Another review said it best and I will confirm those comments. This movie is decent and kids will enjoy it, but it is a recycle of the original and has the feel and story-quality of a sequel better released directly to DVD.  Finding Dory is full of color and cuteness but overwhelmed with far-fetched scenarios that fell hollow and contrived to me.  I was not terribly impressed and remember thinking after seeing Finding Nemo that it was a movie better left without a sequel.  Disney might have done better with a sequel with a little more of a statement about the condition of our oceans and a thicker plot."
    },
    {
      "rating": "3",
      "text": "Finding Dory was a huge disappointment. I went to see it today not expecting much, but hoping for just a little Pixar magic. Unfortunately what I got was a big cliched cash in, full of obvious humor, obnoxiously over the top cutesy characters and a slapdash plot. I found all the characters to be mildly irritating and they had none of the charm they possessed in Finding Nemo.\rIt was such a half arsed, predictable story! It lacks every ounce of depth Nemo had. I know it's a kid's film (and I'm sure your kid is gonna like it) but that's what I used to love about Pixar! It was for everyone even us twenty somethings!\rIt's such an obvious money grab and it makes me really sad that Pixar is sinking to that. I've got a bad feeling about The Incredibles 2 and Toy Story 4.\rThere is one saving grace however!!! The short at the start was absolutely fantastic! It's by far the best Pixar short I would say and worth the price of my movie ticket even if the film itself isn't."
    },
    {
      "rating": "8",
      "text": "As sequels go, Finding Dory is an unqualified Pixar success.  Colorful, funny, and moving with outstanding animation and 3D, there are no boring moments.  It's a little more \"frantic\" than the original Nemo, and since the storyline is similar some of the freshness of the original is gone.  In the original Nemo had to find a way out of one aquarium.  In this one, fish are constantly hopping from container to container to container even moving from building to building making the story seem less believable.  The rescue scene of the Van on the freeway is way over the top and felt like a Looney Tunes cartoon rather than Pixar.  The animated short \"Piper\" they show at the beginning, however, is outstanding and probably my favorite short they have done so far.  Incredible animation, maybe the best I've ever seen."
    },
    {
      "rating": "8",
      "text": "Finding Dory is set 1 year after the events of Finding Nemo, and our familiar fish faces Nemo (Hayden Rolence), father Marlin (Albert Brooks), and Dory (Ellen DeGeneres)- the blue tang with short-term memory loss- have settled into normal life at the reef. Dory's memory is infuriating everyone, including herself- and she's struggling to find a role in sea life. But one day, she regains some memories of her family and is determined to find them. But she knows she can't do it alone. Accompanied by Nemo and-reluctantly- Marlin, she must once again make her way across the ocean navigated only by sporadic memories of her childhood to find her parents. But it won't be easy. Along the way she encounters old friends, new creatures, and no shortage of obstacles between her and being reunited with her family. But is this journey futile, or just too impossible?\r 13 years. 13 years we have been waiting for this movie. And may I just applaud Pixar on such a smart way of making money. Now you've got all the people who were kids when they saw Nemo, all the parents who saw it with them, all the current kids who can see this one, and all the current parents, plus all the others who are just interested in the movie. That's a lot more of an audience than you would normally get for the average children's film. Pixar have released amazing films that are fantastic in giving you the feels and providing quality animated movies. They have received an impressive 30 nominations and 11 wins at the Academy Awards, but they haven't faired so well in two out of three sequels they've made. This combination of reputations gave me both excitement and weariness going into this movie. The trailers didn't look so good as well. The verdict?...SUCCESS!! Thank God! Pixar is back on track!\r This film was the definition of 'a rollercoaster of emotions'. Fear, sadness, desperation, admiration, happiness, laughter, ecstasy, hysteria, and tears (of both happiness and sadness) could be seen by the people sitting next to me in the theatre. That is what I believe composes a quality film. The plot was well-designed and crafted- even if in their journey they go around in circles a little bit- and wastes no time getting underway in the beginning. There is a bit of back and forth between flashbacks and reality, which got annoying after a while, and those emotions I was talking about before were not sustained consistently throughout the movie. They existed in small pockets, especially so nearer to the climax(es) of this movie. This could easily be a source of boredom. And then there's Dory herself. You either love her or hate her. When the movie started, Dory was doing her whole 'sorry, I forgot' routine every 5 seconds and I groaned thinking; 'is this really going to be the whole movie?' but luckily it's not, but it's definitely there. Just enough so that you accept that its a character trait, not an annoyance. And one last thing about plot conveniences, HOW DOES NOBODY SEE THIS OCTOPUS CLEARLY MOVING INFRONT OF YOU??? (more of him in a second...)\r The cast has a lot of familiar faces- especially if you've seen Modern Family- including old faces Ellen DeGeneres, Albert Brooks, Hayden Rolence, Andrew Stanton and Bob Peterson among others meeting new faces Ed O'Neil, Ty Burrell, Diane Keaton, Eugene Levy, Sloane Murray, Idris Elba, and Dominic West. All the voicing was excellent, with DeGeneres demonstrating more of an emotional range. We got to see some solid character development from all our characters, but I would've liked to see some more depth from Hank the octopus- who was one of my favourite new additions- as cruel as he is stealthy- able to hide in plain sight and pull off some daring escapes without being seen due to his dexterity and ability to camouflage, however, I loved all the new additions!!\r Themes include family, belonging, uniqueness, friendship, and loyalty. As usual, there's plenty of morals here for the kids to live by. The animation was up to its great standard, and the cinematography was fantastic, along with Stanton and McLane's directing. In terms of engagement, my attention was lost sometimes, but most of the time, I was thoroughly engaged by the storyline, characters, blending of genres and spectacular animation. The ending, however, I felt was a little too long. Poignant, but tedious. No cliches here either, another unique Pixar film. The tone was simultaneously emotional yet lighthearted due to the way the proceedings occur. I expect some Oscar nominations from this movie.\r You should probably watch Finding Nemo to get some context of the characters, but it isn't a necessity. They make some references to the original which is good for nostalgic purposes. To improve, sustain the emotive scenes and engaging qualities over the entire film for better engagement, and the running time probably could've been cut down."
    },
    {
      "rating": "8",
      "text": "\"Finding Dory\" had a lot to live up to, as \"Finding Nemo\" is considered by many to be one of the best Pixar films. \"Nemo\" had it all. Amazing story, characters, lessons, and visuals. While Dory doesn’t hit all the marks as well, it’s solid entertainment.\r The Breakdown:\r Story: 3/5\rStrengths:\rThe set pieces and obstacles are the protagonist instead of having an actual villain.\rGreat humor throughout.\rSome creative ties into the first film.\r Weaknesses:\rThe illusion of realism is broken in the third act with far fetched antics that are tough to swallow even with talking fish.\rLacks some of the strong lessons and heart that Find Nemo had. (Though Piper, the animated short before the film, makes up for this.)\r Characters: 4.5/5\r Strengths:\rHank the Octopus played by Ed O’Neill steals every scene he’s in.\rPixar does it again by working in the animals habits and mannerisms into every character in the film.\rYou look forward to every character to show back up as the story progresses.\r Weaknesses:\rA funny gag from the original  with Dory “speaking whale” is over used and looses its humor and charm.\r Visuals: 5/5\r Strengths:\rPixar animation continues to advance, and every shot in the entire film is beautifully done.\rThe animated short Piper before the film has some of the most realistic textures and environmental elements I’ve ever seen in computer graphics.\r Weaknesses:\rNone\r Bottom Line: 4/5\r The story is very straightforward and is missing the depth of the first film. However the fantastic cast of characters and how well they tie to their real world animal counterparts is extremely well done. Pixar’s beautiful animation continues to impress and really brings the characters and environments to life. It’s a solid entertainment for kids and adults, and highly recommend a theatrical viewing.\r Stay in your seats as there is a fantastic post credit scene!"
    }
  ],
  "recommendations": [
    "finding_nemo",
    "onward",
    "toy_story_3",
    "up",
    "the_incredibles",
    "toy_story_4",
    "christopher_robin",
    "brave",
    "meet_the_robinsons",
    "the_croods",
    "rio_2",
    "how_to_train_your_dragon_2",
    "soul",
    "the_good_dinosaur",
    "the_bfg",
    "the_polar_express",
    "klaus",
    "bolt",
    "my_little_pony_the_movie",
    "my_little_pony_a_new_generation",
    "atlantis_the_lost_empire",
    "big_hero_6",
    "moana",
    "paddington_2",
    "the_lego_movie_2_the_second_part"
  ]
}