{
  "id": 521,
  "title": "Finding Nemo",
  "starring": [
    "Albert Brooks",
    "Ellen DeGeneres"
  ],
  "runtime": 100,
  "genre": [
    "Animation",
    "Family"
  ],
  "description": "Nemo, an adventurous young clownfish, is unexpectedly taken from his Great Barrier Reef home to a dentist's office aquarium. It's up to his worrisome father Marlin and a friendly but forgetful fish Dory to bring Nemo home -- meeting vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more along the way.",
  "releaseYear": "2003",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5lc6nQc0VhWFYFbNv016xze8Jvy.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.76923076923077,
    "ending": 7.0,
    "soundtrack": 10.0,
    "cinematography": 9.5,
    "familyFriendly": 9.333333333333334,
    "funny": 8.5,
    "action": 9.8
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Finding Nemo is definitely one of Pixar's greatest creations because it is charming, beautifully animated and hilarious mostly because of Ellen Degeneres's hilarious and unforgettable performance. To help this movie succeed even more it is emotional and heartwarming. I give this film 99%."
    },
    {
      "rating": "10",
      "text": "Now this is the kind of breathtaking adventure that keeps me entertained all the way. Distributed by Disney and Pixar, Director Andrew Stanton has produced an incredible movie about the underwater sea life. It tells the story of a Clown fish called Marlin (voiced by Albert Brooks), who is very protective over his son Nemo (voiced by Alexander Gould) after the loss of his family. Nemo grows increasingly tired of his Dad worrying all the time that on his first day of school, he disobeys his father and swims up to touch a speed boat. He then gets captured by a scuba diver. Marlin swims after him, but is too late and he quickly sets off on his speed boat. Marlin, swimming as fast as he can, soon bumps into a royal blue tang fish called Dory (voiced by Ellen DeGeneres), who suffers from short term memory loss. The two then decide to work together and try and rescue Nemo (which from this point on is like going through this difficult quest - being chased by a shark, tackling jellyfish and swallowed by a whale) before it is too late. What I liked most about this movie was the jaw binding special effects. The CGI of the underwater oceans surroundings are breathtaking, and the designs of the fishes are nicely done, although a bit fake in the eyes I would say (don't recall there being fish eyes the size of a grapefruit). Of course the film wouldn't be as good without any good comedy performances from voice acting, and Finding Nemo managed to conquer that. All the actors/actresses played a good voice part, but I have to give full credit to Ellen DeGeneres. Her performance as Dory is absolutely brilliant, honestly she really plays the character so well and will provide audiences from 5 to 50 with great laughter, especially the one where she is trying to speak whale. I actually don't think they could have found another person to better Dory. What I like most about Pixar films is that they try to capture the audience to imagine what the character (whether it's a toy, an insect or a fish) inside is feeling, and what your reactions would be if you were the character. As well as joy and laughter, there's a real heart to this film. Finding Nemo is a truly epic masterpiece, filled with action/adventure and characters and emotions."
    },
    {
      "rating": "8",
      "text": "Finding Nemo is wonderful. While it may not have Up’s unbelievable first ten minutes or the tear jerking ending to Toy Story 3, ten year later the film still holds up as one of Pixar’s finest. It has a simple story that kids can follow that does an excellent job balancing comedy, drama, and horror. The characters are all likeable and memorable. Plus, the animation is outstanding making you feel like you are underwater. Ten years later the animation has not aged a bit. The film is perfect for kids and great for adults and you need to see it if you have not already"
    },
    {
      "rating": "9",
      "text": "Once again, Disney and Pixar produces a fantastic story for everyone."
    },
    {
      "rating": "10",
      "text": "I must have seen this movie over 50 times with my kids and i never tire of it. Great storytelling, emotional depth and the most beautiful animation you will see. In my top 3 favourite movies ever. And I'm 41."
    },
    {
      "rating": "9",
      "text": "My daughter adores this movie, and I'll admit the plot is cute and the characters have a good depth for a cartoon. The brilliant colors of the movie are just an added extra."
    },
    {
      "rating": "9",
      "text": "It is up there with Toy Story for my favourite child movies. It is both an exciting and moving tale with a bit of traditional Disney comedy. A number of quirky characters like forgetful Dory and the Shark, Bruce keep you hooked on this aquatic journey till the very end."
    },
    {
      "rating": "10",
      "text": "A beautiful movie done by the ever talented people at Pixar Animation Studios. At the time of its release, one can argue this was the most emotional Pixar movie. Had I been older when seeing it for the first time, I believe I might've cried."
    },
    {
      "rating": "9",
      "text": "An animation classic if you ask me. Finding Nemo is a sad yet enjoyable tale and should be enjoyed by anyone who watches it. The one flaw of the film is that it sort of gets set into this mode where it cant get out of it and it can make it a little boring but overall its still great."
    },
    {
      "rating": "8",
      "text": "This is one of those movies which is good in spite of itself; there's no one thing in this movie which is really incredible, but the whole thing ends up coming together to be enjoyable. The whole thing is sort of a \"random journey\" plot, but it comes together well due to Dory's eccentricity. Nemo's interactions with the tank fish are a little goofy, but there's some stuff that ends up working well, and Gill worked well as a character. The movie just manages to make itself work despite not having the best plot in the world."
    },
    {
      "rating": "9",
      "text": "This is one of the funniest, most adult-worthy kids movies ever made and is so funny that it's perfect for repeat viewings. It's deifinitely a kids movie that I'm not ashamed to love"
    },
    {
      "rating": "9",
      "text": "Another great film from Pixar. An over protective father fish goes after his son Nemo when he is kidnapped and brought to a dentist's fish tank in Sydney."
    },
    {
      "rating": "10",
      "text": "Hands down my favorite animated film of all time. I loved Finding Nemo from start to finish and I really enjoyed it, Even years after its release. A must watch imo."
    },
    {
      "rating": "9",
      "text": "What an amazing movie! I was 11 when I saw this in theaters and loved it. I'm currently 20 and watched this the other day and still loved it. Truly timeless, for any and all people."
    },
    {
      "rating": "10",
      "text": "I don't even know how to respond to people that give this movie a negative review.  This is one of the greatest animated movies ever created.  Finding Nemo is absolutely hilarious and visually stunning, with some of the best characters in any Pixar movie."
    },
    {
      "rating": "10",
      "text": "Almost as great as Toy Story, and that's saying a lot. Finding Nemo's characters, score, and animation are absolutely flawless. Finding Nemo is one of Pixar's best."
    },
    {
      "rating": "9",
      "text": "Um dos clássico da Pixar, certamente um dos melhores da sua era de ouro. Um dos filmes mais lindos que já vi com uma bela história e personagens magníficos."
    },
    {
      "rating": "10",
      "text": "Finding memo is a emotional, exciting movie that makes you root for the clown fish to find his son while travelling across half the ocean. Your in for a intense, funny, sometimes depressing movie that you can't help watch 100 times over. Finding Nemo is a movie your never forget."
    },
    {
      "rating": "10",
      "text": "How could one not enjoy Finding Nemo? It's a spectacle of a film, a jewel in the crown of cinema. The computer animations and the ways it presents itself are genius. Everything about it is carefully planned and thought out, and almost nothing is left to chance. While that might not be interesting in some movies, it works very well here."
    },
    {
      "rating": "10",
      "text": "Finding Nemo was one of the first films I ever saw in cinema. Granted I hardly remembered watching it as a child, however as I age: I find that it gets better every time I watch it. I can't help but admire its colourful and flowing animation, diverse and memorable characters, gripping story, heartwarming morals, impeccable voice acting and particularly strong and emotional interactions/connections between characters. It set the bar even higher for Pixar after Toy Story and Toy Story 2: and propelled them onward into their illustrious career in making computer animated films; that have since become revolutionary."
    },
    {
      "rating": "10",
      "text": "Looks great, well produced, and is just as great as Toy Story. The look of things like water is appealing to look at and seems real. The human characters look great also. The character of Dory I thought would be annoying but actually, I laughed quite a lot at the character because of how funny she was. What can I say despite being really overrated it's an instant classic."
    },
    {
      "rating": "10",
      "text": "This movie is awesome! Has to be one of my favourite movies of all time with The Simpsons and The Cat in the Hat. The animation is great. There is an amazing storyline. The voice acting was good. The characters are great. Finding Nemo is Pixar's best movie and you should definitely watch it."
    },
    {
      "rating": "9",
      "text": "Finding Nemo is nearly perfect. The story is original and it can get very emotional. The characters are amazing and the world really did seem massive. This one of the best animated movies of all time for sure."
    },
    {
      "rating": "9",
      "text": "The more things change, the more they stay the same. As we enter the summer of 2003, Walt Disney Pictures reigns supreme as the distributor of the best animated fare. Yet, less than a dozen years after Beauty and the Beast became the first (and thus far only) animated film nominated for a Best Picture Oscar, Disney's in-house animated division has degraded to the point where it's a pale shadow of its former self. However, by acquiring the exclusive North American distribution rights for the films of Japanese master Hayao Miyazaki and by entering into a partnership with Pixar Films, Disney has managed to maintain its position atop the mountain, despite furious challenges from Dreamworks and Fox. Without either of those deals – especially the Pixar one – Disney's once unassailable position might have been lost.\r The movies of the Pixar canon – Toy Story and its sequel, A Bug's Life, Monsters Inc. – have all been critical and box office successes. There is no reason to believe things will change with Finding Nemo. Visually, the film is just as jaw-dropping as its predecessors (if not more so). From a narrative standpoint, it's not quite as ambitious as some of the earlier movies, but it has enough juice to keep things moving for 100 minutes. And, as always, the voice casting is perfect. Throw in a moral, and some nice touches of technical accuracy (that fish keepers will appreciate), and the movie represents the best family film to-date of 2003.\r Pixar films always contain thematic content, and this one is no different. It touches on the issues of how a parent's natural protective instincts can drive away a child, and how children, no matter how desperately they crave independence, still need their families. None of this is presented in a heavy-handed manner. Instead, it's offered in such a way that even the younger members of the audience will understand what the film is saying without feeling like they're being subjected to a sermon. There's also a message about the importance of diversity and harmony, as a wide variety of animal species band together to help Marlin as he searches for his lost son.\r Finding Nemo is every bit as humorous as Monsters Inc., although some of the comedy is more low-key. Having experienced comedians like Albert Brooks and Ellen DeGeneres as the lead voices helps immeasurably. Brooks, as is his forte, makes Marlin sound constantly beleaguered. DeGeneres is a hoot as the tang with no short term memory. Willem Defoe brings an initial whiff of the sinister to his part as Nemo's older, larger tankmate. Other voices include Alison Janney, Austin Pendleton, and Geoffrey Rush as a helpful pelican.\r Director Andrew Stanton has opted to animate some of the fish realistically, while using artistic license with others. The clownfish and hippo tang, for example, look almost identical to their real-life counterparts. The sea horses and turtles, however, have some of their rough edges smoothed out, making them cuter and more child-friendly. Overall, Finding Nemo is a treasure trove of visual splendor. From the opening scenes on the coral reef with Marlin taking up residence in his new anemone to the cheesy insides of Nemo's aquarium cage, the film is colorful and amazingly detailed. Every time I view a Pixar film, I am stunned at how much there is to see. Finding Nemo proves that the computer animators can do as much under water as above it.\r I wonder if Finding Nemo will fuel an upsurge in interest in salt water aquariums. To be sure, clowns are interesting fish to keep, but only for those with a little patience. Children expecting their pets to exhibit the characteristics of Marlin and Nemo will likely be disappointed. Nevertheless, ecological considerations aside, there's nothing to gripe about where Finding Nemo is concerned. Pixar has done it again, and, in the process, managed to salvage Disney's reputation – at least for a little longer."
    },
    {
      "rating": "10",
      "text": "This is definitely my favorite animated movie of all time to date. I love this film and have been watching it since I was a little kid, I must have watched this at least 10 times and I am so eager to watch Finding Dory!"
    },
    {
      "rating": "10",
      "text": "One of the greatest animated movies ever made. An original story, amazing and charming characters, witty jokes... almost as good as the \"Toy Story\" trilogy!"
    },
    {
      "rating": "10",
      "text": "Wasn't it Disney which once claimed that life can be \"better down where it's wetter\" during The Little Mermaid's ocean-floor showtune `Under The Sea'? Well, that's certainly proved to be true. After all, Mermaid was the feature-'toon that shoved the Mouse House back on track, while Pixar's latest, a subaquatic epic which casts fish as its heroes, smashed box-office records Stateside to surpass The Lion King as America's biggest-ever animated feature.\r Conceived, co-written and directed by A Bug's Life helmer Andrew Stanton, Nemo doesn't take long to reveal why: it's a sparkling treasure trove of snappy comedy, smart characterisation, lush visuals and breakneck action.\r This fish's tale follows Marlin (Albert Brooks), a neurotic clownfish who's afraid to let his vulnerable son, Nemo (Alexander Gould), out of his sight lest he be gobbled up by one of the Great Barrier Reef's multitudinous predators. Understandable really, especially considering a harrowing face-slap of an opening that reveals how Marlin's wife and brood were massacred by a barracuda. During a school trip, however, Nemo is netted by a diver and whisked away from his ocean home. The distraught Marlin immediately goes in pursuit, reluctantly enlisting the help of Dory (Ellen DeGeneres), a fish who suffers from short-term memory loss...\r It's become somewhat fashionable to praise family entertainment for being `dark'. After all, if it's `dark', then it must be okay for adults to like it. And Finding Nemo has its fair share of `dark' moments (one minute, Bruce, a vegetarian Great White, sobs that he never knew his father; the next, he's going wild at the scent of blood and launching himself at Marlin and Dory), but to describe it as such is missing the point. The reason why Finding Nemo is such a success is because it's layered.\r While Marlin and Dory take the episodic adventure route, Nemo is dropped into an aquarium in a dentist's office, where he encounters a collection of barely sane inmates, led by a fish named Gill (Willem Dafoe) who's obsessed with returning to the Big Blue. So Marlin's journey of self-discovery, in which he encounters monsters, turtles, jellyfish and the like, runs parallel to Nemo's coming of age under Gill's (mis)guidance as he takes part in a One Flew Over The Cuckoo's Nest-flavoured asylum-break.\r The moral message is satisfying and schmaltz-free and, as you'd expect from Pixar, the comedy is sharper than a swordfish's nose. Then there's the astounding visualisation of the undersea world, so breathtakingly detailed it could empty a scuba diver's airtank in a matter of seconds. But the loudest praise should go to DeGeneres, who makes the forgetful Dory a laugh-a-minute comedy sidekick, her quips timed to perfection. As Bruce the vegetarian shark's mantra goes, \"Fish are our friends.\" And Finding Nemo certainly makes sure we realise that.\r A spectacular comedy-adventure that's never less than totally immersive. The first TRUE Pixar masterpiece. Go fish!"
    },
    {
      "rating": "10",
      "text": "Hi! This was originally a crank review. Metacritic will not let me delete this review so I have merely edited it as to remove the original content. Hopefully one of the moderators will find this and remove it. Have a great day!"
    },
    {
      "rating": "9",
      "text": "\"Finding Nemo\" não é dos filmes mais emocionalmente intensos da Pixar, porém, deve ser visto por qualquer pessoa, pelo menos uma vez na vida.9/10"
    },
    {
      "rating": "9",
      "text": "Buscando a Nemo es una de mis favoritas. Tiene una calidad gráfica y una historia sobresaliente. Dory es una gran acompañante y cada papel que cumple cada personaje no se siente genérico. Todos los personajes tienen relevancia en la trama a diferencia de unas cuantas películas animadas de hoy en día, que simplemente se sienten de relleno (no mencionare ejemplos). También es bastante triste en ocasiones! Una obra maestra de Pixar..."
    },
    {
      "rating": "10",
      "text": "A lovely movie with stunning visuals and great characters and writting ❤ My rating: 95-96/100"
    },
    {
      "rating": "9",
      "text": "Pixar illustrates the super dad in their masterpiece \"Nemo\". They don't use guns or super skills like \"Death Sentence\" or \"Taken\", but with colorful visuals and deep characters that actually maneuver the movie. You did it again, Pixar!!!"
    },
    {
      "rating": "9",
      "text": "This film is A-MA-ZING! Thank you very much Pixar for another masterful film....I'm looking forward for your next features......."
    },
    {
      "rating": "3",
      "text": "a horribly overrated film that delvers a lame story and tries to use star power to make it appeal to older audiences and tries to be a serious animated drama while at the same time making wise crack jokes, the result a terrible combination"
    },
    {
      "rating": "10",
      "text": "If I had to choose my favorite Pixar movie that isn't 'Toy Story' (1995) or 'Toy Story 2' (1999), it's definitely 'Finding Nemo'. Filled with breathtaking animation, great vocal performances from Albert Brooks, Ellen DeGeneres and more, and a good, heart-felt story about father and son relationships.\r The color palette for the animation is absolute eye candy, the best I've seen and it's easy to get immersed into the movie's magical world. Plus, Thomas Newman's music score always knows how to pull on my heartstrings.\r Albert Brooks, from 'Taxi Driver' (1976), does some amazing vocal work as a concerned father looking for his missing son, Nemo (voiced by Alexander Gould). Ellen DeGeneres is incredibly funny as Dory, a fish who suffers from short term memory loss. She steals every scene she is in.\r All in all, 'Finding Nemo' is a classic, I loved it as a child, and I still love it as an adult."
    },
    {
      "rating": "10",
      "text": "The movie's just about swimming to find Nemo. That's just it? No... that's not it. You'll find some eye-popping moments and a blast in the eyes during the movie."
    },
    {
      "rating": "2",
      "text": "i canat belive thsi!!? thay had a sharc in THE game?. yeah. for a whuile. i rely thinc the guril atthe detnist was a cabniball!! she sed SHE WAS PERANNA. thena fish inthe toylet? i dont thinc sew1. this isn not a professinal gamemovi at all not chylde aproupreit? 3/10v for lying to bviewers!!@?!"
    },
    {
      "rating": "0",
      "text": "One of pixars most famous and memorable works is absoloutely beautiful. There is no denying it is visually stunning, great pacing and Dory is one Pixars greatest creations. The film doesnt have the emotional touch as much a as 'Toy Story 3' and 'Up' but the message given is thoughtful and meaningful. This is some of the best animation in a film in recent memory, it truly is unforgettable and there is so little flaws that this can go down as one of Pixars greatest films."
    },
    {
      "rating": "4",
      "text": "Good movie, but in the end it was really boring! NOTE: DO NOT HIRE OUT! NOT WORTH IT."
    },
    {
      "rating": "0",
      "text": "The animations were all nice, but i was bored during most of the movie."
    },
    {
      "rating": "0",
      "text": "This is just another poor attempt by Disney to make another film that is over credited. Worst of all, they dragged Pixar with them. This is suppose to be a children's movie but includes topics and situtaions that are too serious and almost to a point too scary for most children 8 and under. Besides the entire movie is so repetitive that I fell asleep the first time I went to see it. I watched the movie four different times in the theaters with friends and my boyfriend and all together I only laughed 6 times."
    },
    {
      "rating": "1",
      "text": "Just... bad. The whole plot was a poorly strung- together series of annoying episodes that were meant to be funny but failed due to general immaturity. There are vegetarian sharks. There are surfer turtles. There are evil humans. You see the problem here? The creators are trying to be funny by putting a \"clever twist\" on sea creatures but their ideas are so obvious and juvenile all I could do was cringe. Furthermore, the movie is cursed with one of the most - or dare I say it, THE most - annoying character in the entire Disney cannon - the every babbling, annoyingly forgetful idiot fish Dory. (I hope that in the sequel, they fail to find her.) The only redeeming factor is the sweet father-son story, but the frantic, overbusy, episodic plot and excessive melodrama quickly sunk that as well. Despite the rave reviews this one has gotten, I came away extremely disappointed."
    },
    {
      "rating": "10",
      "text": "Un bello e inolvidable clásico de toda la vida, la historia es muy creativa y original, las actuaciones vocales estuvieron bien logradas y la animación es fabulosa, tan bien hecha que aún 17 años después se sigue viendo fresca y novedosa."
    },
    {
      "rating": "10",
      "text": "I LOVE DORI."
    },
    {
      "rating": "10",
      "text": "Best movie ever!!!"
    },
    {
      "rating": "8",
      "text": "It's a great movie to watch with you family or your girlfriend, ONCE!! I liked it but I don't think I will need to see it again. A bit overrated>"
    },
    {
      "rating": "10",
      "text": "A GREAT film that's essentially more that just about fish. Amazing visuals, voice talent, and script. A+ P.S. Ellen DeGeneres deserved an Oscar nomination for her potrayal of Dory."
    },
    {
      "rating": "10",
      "text": "its the best movie ever!!! and all you people think that is stupied well its not you are so go and screw you self!!! its the best movie to watch at all ages and it never gets old even if you know what is going to happen its still the best movie in the world!"
    },
    {
      "rating": "10",
      "text": "An excellent movie! If you love disney and pixar films, you must watch this if you haven't. It's worth it!"
    },
    {
      "rating": "9",
      "text": "Exciting, funny, and inventive."
    }
  ]
}