{
  "id": 2085,
  "title": "First Man",
  "starring": [
    "Ryan Gosling",
    "Claire Foy"
  ],
  "runtime": 141,
  "genre": [
    "History",
    "Drama"
  ],
  "description": "A look at the life of the astronaut, Neil Armstrong, and the legendary space mission that led him to become the first man to walk on the Moon on July 20, 1969.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/i91mfvFcPPlaegcbOyjGgiWfZzh.jpg",
  "categories": {
    "plot": 5.324324324324325,
    "acting": 6.492307692307692,
    "ending": 5.636363636363637,
    "soundtrack": 6.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 4.666666666666667,
    "action": 7.166666666666667
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Earnest visceral and intimate treatment of most important of historical events widely covered in all manner and lodged in the cultural consciousness for 50 years, this does add a stylistically contemporary cinematic updating that puts you there perhaps more than ever before.  It's also needlessly prolonged in its annoyingly too tight handheld photography which should have been more measured for effect!  Surprisingly it drags even more than epics typically do considering its new look into the real hero's personal life."
    },
    {
      "rating": "5",
      "text": "How can a movie about such a significant man and event be so *boring*? The movie is not bad in any way, but it drags and drags and drags."
    },
    {
      "rating": "4",
      "text": "good actors but this movie put me to sleep some...……………………………………………………………….."
    },
    {
      "rating": "5",
      "text": "\"First Man\" starts out well enough, but it gradually becomes cumbersome and somewhat boring.  The epic length, the dialogue I had to keep rewinding and replaying at higher volumes through my stereo speakers so I could understand it, the overemphasis on melodrama involving the wife and kids, and the studied downplaying and internationalizing of what was a uniquely American triumph leaves the viewer with a feeling best summed up in one word: \"meh.\"  I am sure there is all manner of high-end filmmaking craft that effete artsy-fartsy critics might appreciate, but the movie fails in its most basic mission: to engage and entertain the viewer."
    },
    {
      "rating": "4",
      "text": "This movie wants to impress, but in the end, simply bores. The characters should be able to connect, but don't. Some of the problem is with the directing, but more has to do with the thin story line. The sound effects, which adequate, don't mask the poor special effects. I wanted to like this movie, but can't recommend it. Nothing in it you don't already know about the space program."
    },
    {
      "rating": "3",
      "text": "First Man went to great lengths to highlight in lengthy detail every major failure of the space program up to Apollo 11 with no balance to it. This movie spent zero time on any of the successes until the end with the successful landing on the moon. The movie itself is well made, well acted and the special effects were fine. This is this movie depicted an complete rotten life for Neil Armstrong that seemingly turns him into this nearly emotionless stoic. They should have mixed in a little bit more of the Right Stuff and show at least something of the many successes leading up to Apollo 11. The movie was highly riveting in a misleading way most of the time. The actual landing sequence was decent and I thought it was the best part in the movie. But seriously you get 2hrs of tragedy, 20 minutes of spaceflight and really nothing positive about the program. They literally spend more time discussing Russia's successes at the time than anything NASA did. It is a very adept attempt at revisionist history."
    },
    {
      "rating": "5",
      "text": "It's almost inconceivable that a story as monumental as the first moon landing could be made boring, but, unfortunately, director Damien Chazelle has found a way to do just that. While the filmmaker's biopic about astronaut Neil Armstrong takes a different approach to its subject than that of other historic space program pictures (like \"The Right Stuff\" and \"Apollo 13\") -- one that's more quietly contemplative and less bombastically heroic -- there's still something to be said for making it engaging, and that's where the film falls flat. This overlong slog, filled with easily edited material, too many protracted shots of silent emoting and images that are often filmed far too up close, tries the viewer's patience from early on -- and never eases up in these regards. As the lonely, brooding protagonist, Ryan Gosling delivers a fine performance in portraying the character for who he is, but, when placed in the context of a story that fundamentally lacks  something to draw viewers into it, that effort is, regrettably, lost. The dark, sullen overall tone of the project does not help, either, especially in a film that showcases one of mankind's greatest accomplishments. In many ways, this plays, albeit loosely, like a film adaptation of David Bowie's \"Space Oddity,\" but, personally, I'd rather listen to the song that sit through this tedious exercise. Kudos to Chazelle for being willing to try something different, but it's too bad this didn't show up in the finished product."
    },
    {
      "rating": "5",
      "text": "Honestly was disappointed. Maybe just not my type of movie, because I found 'First Man' to be very slow and repetitive,  as well as dumb and cliche. It made happy and historic points of the story very sad, reflecting lots about family, and although it showed a different side of the story it definitely had issues. The movie was too long and had a very mellow tone. I can see why some people really enjoyed it but in the end, it had me disappointed."
    },
    {
      "rating": "4",
      "text": "Get ready for long strides of Ryan Gosling staring stone-faced around rooms and space capsules. I get it, Neil was never a talkative guy, so the portrayal, while snooze-inducing, is probably on point. Sadly, it makes for some really slow, devoid of dialog and almost lifeless passages. And those are the scenes on Earth! Neil's demeanor pretty much kills all of the drama as it happens. Completely devoid of emotion. Might be accurate, but it makes for some damn boring scenes.The scenes in space are pretty much a mix of fast cutting between zoomed in buttons and displays, a lot of shaking and the occasional view from outside the capsules. The technical details of pretty much everything is cut down to the bare minimum. Most of the time you have no idea what is going on. And the worst part is that even the moon landing itself seems so devoid of excitement that I just didn't care about it. I just wanted the movie to end!Normally, when I watch movies or documentaries on this stuff, I am almost in tears when they reach the points of great significance. Not the case for this one! I just sat there. No interest in the scene. Nothing but boredom.Bottom line: This movie is 90 minutes of Neil Armstrong getting in and out of capsules mixed with some incredibly slow-moving family moments on Earth being interrupted by calls about colleague accidents. Then he goes to the Moon, quickly skips to being back on Earth and the movie ends."
    },
    {
      "rating": "4",
      "text": "Guess this is one movie that's spoiler-proof.  The same could be said of Apollo 13 (I was an adult for both), but that movie somehow generated suspense and empathy, which are hard to come by in First Man.  I suppose that the tale of 13 is more implicitly exciting, and that the principals were inherently more likable and even humorous at times;  I have to say I hope that Neil was actually more interesting in real life.  He is played almost entirely without affect, and would likely be diagnosed today as being somewhere on the \"spectrum\".  The space sequences are not bad, but they don't pull you in to the experience.  I'd say rent Apollo 13 instead."
    },
    {
      "rating": "6",
      "text": "Neil Armstrong is an American hero, Ryan Gosling is a great actor and Damien Chazelle is one of the best directors working today. But none of these things lend themselves to the simple, personal approach taken to an event of this magnitude. I really wanted to love this movie, but so much of it just didn’t work.."
    },
    {
      "rating": "3",
      "text": "Very Boring, dark, and lacking emoton on almost every scene... the movie russian The Spacewalk is made arround similar events and is much much more engaging"
    },
    {
      "rating": "3",
      "text": "Nope, this movie was a complete miss.  Having been spoiled by The Right Stuff way back in 1983 (!!!) having shown this story in what is turning out to be the best possible way with the best possible cast, First Man was too dark, too moody, looks like it was filmed with a potato inside a potato, melancholy mess of a picture wasn't worth the 2+ hours spend watching it.  This director was trying for something and he didn't hit this barn with the elephant (potato) gun.  uggh, this was bad in every way."
    },
    {
      "rating": "3",
      "text": "I usually love movies by this actor...but this was just off...doesn't help that is not historical and borderlines science fiction."
    },
    {
      "rating": "5",
      "text": "It was certainly not what I was expecting. Extremely low-key and understated. Felt a little bit like an Indy movie with some big budget side takes. On one hand I appreciate that they tried to give it a more distinctive style in a sea of space movies, but a lot of it didn't work for me. The family stuff, there was some depth to that, but too much of it just came out bland and ineffective. There was definitely a great a mount of research and effort put into the NASA parts of the movie, but too much of it was procedural without any real tension. Now, the actual moon landing scenes were indeed quite beautiful, and as can be expected elevated the movie, but still it's hard to give it more than a 5, 5.5/10 at most."
    },
    {
      "rating": "2",
      "text": "Slow, uninspiring, and confused. Pivotal parts of the process not present. Neil Armstrong is portrayed as a diligent hard-working man and whose emotional intelligence is apparently so terrible that the director decided to not have Ryan Gosling do anything note-worthy other than appearing stone-faced for the entire film. Two points for the amazing score."
    },
    {
      "rating": "3",
      "text": "Just saw it and I felt I was sitting thru a couple of hours of schmaltz. If we aren't looking into Armstrong's eyes, we are looking at his wife's eyes. At least she had a part to play, and did it well, where as Gosling/Armstrong part was to look and act like a statue of an astronaut. And it's hard to give much credit for astronaut risk and bravery at a time when 50,000 US military (including 14,000 draftees)were giving up there lives in Vietnam."
    },
    {
      "rating": "0",
      "text": "First Man was super boring and honestly a huge dishonor to history.The writers and actors def thought they were making a deep movie. It was like purposely boring."
    },
    {
      "rating": "8",
      "text": "The ost makes everything possible. It's another magic that space can create. When he finally landed on moon, it was so emotional that it made so many people cry including me. This film is feels like a 1 hour long waltz."
    },
    {
      "rating": "6",
      "text": "Aesthetically laudable, emotionally vapidMore an intimate character drama than a grandiose examination of man's place in the cosmos, First Man is more concerned with domesticity than the actual journey to the moon, attempting to demonstrate that behind the great moments of history exist personal demons and private motivations. Nothing wrong with that of course - contextualising small character beats against a larger historical canvas can produce compelling cinema. Terrence Malick's The Thin Red Line (1998), for example, uses the Battle of Guadalcanal as the background against which to engage personalised existential Heideggerian philosophical conundrums, whilst Michael Mann's Ali (2001) is more interested in Ali's private struggles outside the ring than his public bouts within it. However, for this kind of storytelling to work, one thing is essential - emotional connection. The audience must, in some way, care about the people on screen, otherwise their introspective problems are more than likely to feel like they are just getting in the way of the larger story. And that's exactly what happens in First Man - there is a lifelessness at the film's core, an emotional vapidity that can't be filled by exceptional technical achievements and laudable craft.Based on James R. Hansen's, First Man: The Life of Neil A. Armstrong (2005), the film begins in 1961, and hits all the beats you'd expect in the lead up to the Apollo 11 mission in 1969, including the death of his daughter, Karen (Lucy Stafford) from a brain tumour; his marriage problems with his first wife, Janet (Claire Foy); the lunar landing alongside Buzz Aldrin (Corey Stoll); and his private sojourn to the Lunar East crater.With this framework, the film remains tied almost exclusively to Armstrong's perspective, with the occasional shift to Janet. It sets itself the task of penetrating this most private of men, explaining why he was so driven, even to the detriment of his family. And herein lies perhaps the film's most egregious failing. It's as if director Damien Chazelle and screenwriter Josh Singer think the Apollo 11 mission isn't interesting enough by itself - there needs to be some kind of deeper \"why\" behind the whole enterprise.In any case, the attempts to tease out the inner workings of Armstrong's mind don't really work, as he remains very much in his own world - no matter what Gosling, Chazelle, and Singer do to dress him up, Armstrong comes across as aloof and interiorised. Partly at fault here is Gosling's performance, with its fulcrum of emotionless stoic masculinity. Instead of giving the character hidden depth, the few discernible traits he possesses make him something of a cardboard cut-out, a 21st-century screenwriter's idea of what an American man who grew up in the 40s and 50s should be.Another issue is that the filmmakers choose to locate Armstrong's primary motivation in the death of Karen, which is presented with a mawkish sentimentality, as Chazelle attempts to link Karen's death with Armstrong's determination - as she is dying, he holds her and looks wistfully into the sky, and on the moon's surface, he drops her bracelet into the Lunar East crater and cries a few tears. The problem lies in the overkill, detracting from whatever genuine emotion such details should evoke. Every time we see Gosling stare yearningly into the sky, the potency of the film is diluted just a little bit more.Did he really drop the bracelet into the crater? We don't know. However, for me, the whole thing comes across as far too syrupy, an amateur psychological profiling of a man who was intensely private. I would have much preferred the Lunar East trip to remain a mystery - by showing us what they think might have happened, Hansen, Singer, and Chazelle cheapen the intensely personal nature of the moment, which Armstrong obviously chose to keep secret for a reason.Make no mistake, however, the lunar landing itself is beyond spectacular, with Justin Hurwitz's incredible music and Linus Sandgren's superb cinematography coming into their own. The sequence was shot in 70mm IMAX, and it makes extraordinary use of the larger frame, with the first panorama of the lunar surface almost as awe-inspiring as anything in 2001: A Space Odyssey (1968) or The Tree of Life (2011). An especially well-directed part of the lunar descent is that rather than lay down a busy foley track, Chazelle pulls out the sound altogether, creating an eerie, otherworldly moment that literally gave me goosebumps.However, despite the magisterial last 30 minutes, and some sporadically well-handled moments, First Man is underwhelming, and, for long portions, interminably dull. As good as that final sequence is, it's no compensation for the plodding and lifeless two hours that precede it."
    },
    {
      "rating": "5",
      "text": "Ryan is stoic, too the part where I think he is trying to hard. The first man, roll credits, to walk on the moon would have acted differently. This was based on a book and real life but I can feel Hollywoods touch in this and it takes me out of it. 10/10 if it was just the space montages and flights."
    },
    {
      "rating": "10",
      "text": "Space exploration movies, especially those based on a true story, are always riveting. First Man is no exception. Unlike the film Apollo 13, which explored the friendship and solidarity between Jim Lovell, Jack Swigert, and Fred Haise, this film focuses on the professional and emotional journey of one astronaut, Neil Armstrong (Ryan Gosling), who holds a place in history for being the first human being to set foot on the fine powder that pervades the surface of the moon.Clearly, there was teamwork involved in this endeavor as well. Armstong did not fly to the moon by himself—he was accompanied by Buzz Aldrin and Michael Collins. Nevertheless, even though his crewmates were with him the whole time, and the interdependency between them was obvious, Armstrong’s fierce inner strength, and his laconic and terse inability to express his deepest emotions both at home and at work, depict him as an iconic loner. It was not just one small step for [a] man and one giant leap for mankind, it was a giant leap for astronaut Neil Armstrong as an individual and a man whose personal journey had literally taken him to the moon.Director Damien Chazelle beautifully balances the professional man with the private individual, who was difficult to live with as a spouse, who loved his children but could not always demonstrate paternal affection, and who respected his copilots even as he distanced himself from them. Generally unknown or forgotten details about Neil Armstrong come to light in this screenplay, such as the fact that he lost a 2-year-old daughter to brain cancer in 1962. Given his impassive and stoic personality, he was never completely able to assimilate his grief. He is shown dropping his daughter’s bracelet in a moon crater during his 22-hour Apollo 11 lunar exploration. Although this scene is not wholly based on fact, Armstrong did wander away from Aldrin briefly to spend a few minutes by himself at the edge of what is known as Little West Crater. This went against the scripted actions that had been carefully planned before the launch. It was thought he might have left something there as a memento, not uncommon practice for astronauts who walked on the moon. Armstrong’s biographer suspected he left something from his daughter, as did others. Also, not generally known was that Armstrong was probably not NASA’s first choice to be first man. He was shoved to the head of the line with the death of Gus Grissom, who perished in a flash fire during a “plugs-out” test. Grissom was purported to be lined up for commanding the first lunar landing mission.As a strong-willed, hard-working Midwesterner from Ohio, Armstrong was not the easiest character to depict on screen. He was not glamorous or flamboyant, his life was scandal-free, and he avoided the limelight. Ryan Gosling attempts to recreate this inner and dispassionate strength, which was a kind of discrete reserve worn like a protective armor. The portrayal is accurate, but for those who have never experienced the quiet, unflappable self-restraint of a certain kind of Midwestern personality, it may have appeared that Gosling was underacting. He wasn’t. As for Claire Foy in the role of Armstrong’s wife Janet, she has demonstrated what appears to be an infinite acting range. She has effortlessly glided from a flawless portrayal of the young Queen Elizabeth II to an equally flawless portrayal of a Midwestern (from Illinois) suburban housewife who has to stay home to mind the kids, bravely live her life in the dark shadow of possible widowhood, and give her difficult astronaut husband a ton of support. Also noteworthy, the moon landing scenes and the eerie silence of space as the astronauts approach the lunar surface make this film an almost mystical experience."
    },
    {
      "rating": "10",
      "text": "Workmanlike in its approach and deeply personal, while showing the importance of determination, struggle, and failure to achieve success, \"First Man\" is technically and emotively flawless."
    },
    {
      "rating": "4",
      "text": "the shaky cam felt very unnecessary and it was giving me slight motion sickness. i thought the shakiness was a reflection of armstrongs inner self but the whole damn movie it just shoke nonstop even when characters are just sitting still on a chair. then a lot of the scenes felt like the director just threw his camera and a broken flashlight into a tumble dryer and those scenes would go on for ever. most of the time the audience is just confused at what is going on on the screen. armstrongs character was also so distant and unlikable compared to some of his colleagues, which really made it hard for me to understand him. if you like the style of lincoln you might like this movie. but I thought lincoln was much more interesting to watch"
    },
    {
      "rating": "4",
      "text": "Predictable and over-dramatized. Mediocre cinematography, shaking cameras and very obvious music leading to and underlining every single dramatic moment. Characters are dimensionless and don't change, neither learn anything. The movie doesn't address any problematic topics, doesn't teach anything, doesn't explore any emotions and isn't much entertaining. The acting is fine, but the whole plot is just boring."
    },
    {
      "rating": "8",
      "text": "The third film from Damien Chazelle definitely does its best to change up his formula, and he does a fantastic job of expanding on his style. The music and production design are incredible, as is par for the course. Ryan Gosling gives a grounded, breathtaking performance, and does a lot of justice to Neil Armstrong as he is portrayed in James R. Hansen's novel. The cinematography is top notch, and apart from being unnecessarily slow at times, this is a wonderful real-life drama."
    },
    {
      "rating": "7",
      "text": "What I loved the most in First man are the trials before the actual launch. Yet we only have to see a bit of them. The story slow down a lot when it comes to the personal life and makes the film sluggish. I really like the death aspect of the movie. It make the experience emotional. The acting was very good all the way around. The music is on point in tense moments. I give it 72%. This is not to the level of Apollo 13 or Gravity but still interesting to watch."
    },
    {
      "rating": "10",
      "text": "Excellent movie. Ryan Gosling perfect as always. Damien Chazelle can't make bad movie"
    },
    {
      "rating": "9",
      "text": "Just what kind of man must you be not only to undergo the first ever Moon landing, but to do it with such a lack of fear despite having an insight into the amount of risks you undertake. Neil Armstrong, at least how he was portrayed by Ryan Gosling here, was such a man.The first few scenes depict him flying a rocket plane when it inadvertently bounced off the atmosphere. He has a brush with death as he attempts to land it in the Mojave Desert. He succeeds, but for a man who has just been in the atmosphere a couple of minutes ago, then had a near-fatal crash, he was unmoved. Some people find this bland, but I find it fascinating. Not to mention the power of the scene was helped by Justin Hurwitz's ambitious score and Damien Chazelle's precise direction. The noises were brief, hard-hitting, the cogs could be heard breaking apart and the frames were mostly stationary feeling like an impact.The film is also careful to make sure to keep you entertained even during the times when Neil is not in the cockpit. Of course, these moments are not as tense, they can't be, but Damien Chazelle crafts his opaque personality in a clever way. Early in the film, he loses Karen, his two-year-old daughter, to a brain tumor. This is the first of the many funeral scenes in the film. Throughout the film, he only mentions her once, to his colleague, Ed (Jason Clarke), but you can feel he is always thinking about her.Somehow, Gosling's content portrayal carries this film. He remains apparently unmoved to the countless deaths of astronauts testing the Apollo Mission rocket, he always keeps a certain distance from his family. His wife, Janet (Claire Foy) is the one who from time to time breaks his wall and she is truly strong. But his pain does not come from fear to his job, as he loves it, but from loss. Always looking up at the Moon, maybe, just maybe, thinking that Karen is somewhere over there.This might seem far-fetched, but his ambition is brought by pain. In the final scenes, when he steps on the Moon, he looks around as if he is not impressed, but disappointed. There is nothing and in the end, he drops Karen's bracelet on the ground and realizes this is it. This is all there is to it."
    },
    {
      "rating": "10",
      "text": "This isn't just a normal biopic about the famous Apollo 11 mission and the first man on the moon. This is a movie about how a person deals with tragedy with the events of the horrifying events of how dangerous the mission was. Amazing performances from everyone. As well have a fantastic score that stays with you forever.  Damien Chazelle shows that he isn't just a jazz fan."
    },
    {
      "rating": "6",
      "text": "This is again a movie which is clearly over-hyped. I agree that the performances are good (especially Claire Foy). Neil Armstrong wasn't too charismatic so I understand why Gosling chose to play him with this stoic attitude and empty stares. He also showed very real emotions in a couple of more dramatic scenes. But in the end this character wasn't really that interesting. I agree that trials of getting to the moon are shown in a thrilling manner. I disagree that the landing on the Moon in this movie was particularly spectacular. It was OK, but kinda meh. The surface of the Moon is cratered, grey and dusty - that's it. The real fuss was about the emotional journey. In this movie the screenwriter and director decided to tell the story from the point of a family drama. This is the strongest aspect of the movie. Armstrong is portrayed as someone who didn't manage to cure his daughter, so he is determined to go to the moon despite all the odds. We saw him searching for the treatment for her. In his opinion he probably failed her. So it is a promise he made (to himself / to her?) that he will never fail again. I know that people make a lot of strange stuff \"for their loved ones\" and a lot of times those things are like an ego driven wishes, dressed up as a tribute to lost ones. I'm OK with it. But it was almost the only thing that kept this movie arc together. The movie tries to base it's emotional payoff on a very oscar-baity scene, that nobody can confirm ever happened in real life. So is it a lie?, probability?, assumption ??? Not a good way to end the journey. It's not a bad movie. It's a bit slow and blurs the lines between real events and pure fantasy. The ending was just to emotionally manipulative for me and clearly an oscar-bait."
    },
    {
      "rating": "4",
      "text": "Ok look I'm sorry that people really enjoyed this movie however I was not one of those people to me it was nothing but super slow and boring I should have stuck with my original plan and skipped all together so not worth"
    },
    {
      "rating": "6",
      "text": "I was really looking forward to this movie, mainly because of the newest co-op between Damien Chazelle and Ryan Gosling. On some levels, First Man met the expectations. It's informative, host to some great acting by Ryan Gosling and Claire Foy, and overall pretty decent to watch. However, for me personally, the choice to make the movie more documentary like in cinematography didn't pay off as well as I would have hoped. At the beginning it was OK, but as the movie progressed it sometimes felt like the cinematography was part of a low budget \"let's not have too many special effects\" choice. The shocky images even made me nauxious from time to time watching it in the theater. For me the acting in the movie saved it from an even lower grade. All in all it definitely wasn't a waste of time, but for me it's not in the \"must-watch-again\" category."
    },
    {
      "rating": "4",
      "text": "One small step for man, one giant stumble for the filmmakers.The movie was less about space and more about a man coping with the death of his young daughter. It had the potential to be an emotional rollercoaster, but honetly it failed to lauch.The characters in this movie were dull and distant, at times it felt like a documentry about cold serial killers. The cinematography was another misstep. Regardless of the scene, the camera was shaking and focus pumping every 2 seconds, akin to watching the movie in a MASTIF gimbal rig.I believe Clint Eastwood or Mel Gibson would have been a much better choice of director. Clint would have given the characters a soul and Mel would haven given the film a sense of awe and grandeur. Instead the film was a depressing dirge, a funeral march to the moon."
    },
    {
      "rating": "10",
      "text": "This movie is amazing. I think the reason it’s been mischaracterized as “slow” and “boring” is because people were expecting a space action movie. Apparently, they didn’t read the title. Yes it’s very different than Apollo 13 or even The Right Stuff, but it’s SUPPOSED to be. They didn’t want to give you the same things you get from those other movies. They wanted this movie to be unique, and it is. And they did an excellent job of it."
    },
    {
      "rating": "0",
      "text": "This movie ruined Ryan Gosling in my eyes, I used to enjoy the roles he played, the silent strong and dangerous guy thinking he has a dimension which is not visible but there. Now he is just boring to death in my eyes."
    },
    {
      "rating": "10",
      "text": "Truly one of my favorite movies about space journeys and moon landings. The attention to detail and accuracy amazed me. Also the cinematography was absolutly stunning! I loved it when the Apollo 11 spacecraft launched. I fully recommend this movie!"
    },
    {
      "rating": "9",
      "text": "An amazing movie about landing on the moon. Maybe it is a pity that there is too much family and not so much training and the trip itself to the moon. The effects in this movie are very well done and I don't blame the film for winning an Oscar. Maybe the truth is that the songs and sounds don't appear much here and that the film will be drawn to the end, but it is still a very well-made film with great acting performances."
    },
    {
      "rating": "10",
      "text": "It's amazing! Just outstanding and very real. Everything seems to be best. Story is simple but, with this crew, nothing is going to be simple..."
    },
    {
      "rating": "8",
      "text": "First Man is one of my fav movies of 2018 I love the beginning of space like apollo 13 first man apollo 13 is one of my fav movies from that This movie is about Neil Armstrong going to the moon on Apollo 11 while his daughter had cancer she died which really messed with Neil that started him to really not have to speak to Elliot is one of his friends loses him also I believe in a crash than an apollo one had a fire that made him more more emotion for him for his character so he does not what to say anymore to his wife and his kids also this movie is good very good accurate of Neil Armstrong pass and the space mission also I do like this is focused on Neil Armstrong, not just the mission you care what Neil Armstrong is going through the shots In this movie is so beautiful I love space so watching this movie is just remarkable one of my fav scenes in this entire movie is the bracelet scene was emotional to watch Ryan Gosling as Neil Armstrong is really good it make since why he does what he does people say that it is not that strong it is to me it make since why he acts like that now the really only thing what is holding this back to me is that runtime it is a little long so u start to wonder is it going to pick up from the beginning not really But this movie is one of my fav space movies and my fav movie from 2018 so I give First Man an B+"
    },
    {
      "rating": "8",
      "text": "First Man (2018), a newly released biopic on the Space Era Neil Armstrong, from self-claimed film auteur and Academy Award-Winning Director, Damian Chazelle (La La Land), hits all the marks for a successful box office take in the current climate. First Man has already received nominations for best film from the Oscar-campaign-launching, Venice International Film Festival (Golden Lion Award) and the massive Toronto International Film Festival (The People’s Choice Award).Oscar-winning, La La Land composer extraordinaire, Justin Hurwitz, returns to the Chazelle fold, bringing slightly more than is required for effect with a mesmerizing First Man score. Hurwitz creates such a beautiful composition it is easy to overlook its occasional intrusiveness. Linus Sandgren (Best Cinematography Oscar for La La Land)  is also back with his roving camera movement which is a bit dizzying. For the most part, despite a jar or two (not surprising with Sandgren’s camera shooting style) Editor Tom Cross, kept the flow fairly continuous, if not seamless. And, last but not least, Canadian-born actor, Ryan Gosling, resumes his La La Land Sebastian minimalist acting style, as Neil Armstrong. Jason Clarke and Kyle Chandler provide excellent supporting characters as Edward Higgins White and Deke Slayton. Claire Foy turns in the film’s deep, emotional performance as Janet Armstrong, wife of Neil Armstrong, that the other characters either don’t bring or can’t bring to the story. Gosling almost gets there! The costuming, hair, makeup and production design all add credence to the depicted period in a convincing manner.All in all, First Man is a nicely done film and it moves Director Chazelle up a notch on the Hollywood list of bigger budgeted films. Surprisingly, or unsurprisingly, Steven Spielberg received an Executive Producer credit. Nevertheless. the opening sequence, glaringly fails. The imagery is blatantly and conspicuously shot in an empty studio. I know Chazelle felt the lack of a bigger budget with La La Land not only curtailed his efforts but hamstrung his vision of a big-production, Hollywood-style musical of yesteryear. I like all three of Director Chazzelle’s full-length, feature films; Whiplash (2014) La La Land (2016) and First Man (2018).As I watched the credits roll yesterday night, I noticed the film was based on the New York Times Bestseller First Man: The Life of Neil A. Armstrong from James R. Hansen (who seemingly makes a cameo in the film). Josh Singer [The Post (2017) and Spotlight (2015)] gets credit for the screenplay. In my opinion, the best part of the film, by far, is the special effects. And Chazelle shot on 35MM with IMAX cameras.The spectacular rocket launches and the use of mirror-effects heighten sensibilities. Furthermore, the use of smoke and gasses also added a deft sense of the surreal and a touch of dream logic. Also, Chazelle pumps in some nice archival footage and effectively utilizes foreshadowing with early frames of daytime, lunar shots. Screenwriter Singer also weaves some heady lines referencing an often under-reported and underappreciated aspect of the Space Program and NASA. Rory Kennedy’s documentary, Above and Beyond: NASA’s Journey to Tomorrow recently aired on Discovery Channel, October 13th, and details NASA’s mission as a viable reporting agency on the health of Planet Earth and Singer encodes this concept as Armstrong is asked, “Why do we explore and travel in space?”Smartly crafting a timely topic of space exploration and NASA, Chazelle and company manage to bring the vessel home and to fruition with another buzz-worthy, award-contending product with First Man. What the film does well, it does very well! Warmly recommended."
    },
    {
      "rating": "8",
      "text": "\"First Man\" is a haunting exploration of Neil Armstrong's emotional journey. While most of the major reveals are known, it still seems as though not many people are aware of Neil's struggles. There isn't any \"Oh **** reveals, but most dramas don't need any. The film is slow, that doesn't mean its boring. The visuals are excellent."
    },
    {
      "rating": "9",
      "text": "Very, very good movie. Ryan Gosling does a great job in portraying Mr Armstrong (assuming that’s how he was). Plus, anytime you can debunk two conspiracy theories at the same time, that’s a bonus."
    },
    {
      "rating": "10",
      "text": "From its performances to its technical achievements, First Man is a masterpiece. Damien Chazelle is putting himself in the conversation for one of the best young film makers of our time. Every shot is perfect with specific lighting choices that added to the impact of certain scenes. It's not easy to get me emotionally invested within the first 20 minutes but the way Gosling portrays Neil Armstrong really got me early and often and Claire Foy is just as good if not better. I can't sing this films praises high enough it's a must see. Overall a 10 an A+(currently my favorite film of 2018)."
    },
    {
      "rating": "5",
      "text": "As a massive fan of Damien Chazelle's previous works ie Whiplash and La La Land, First Man is, unfortunately, his first dud and a massive disappointment. The issue with First Man is that it overall has a pretty tame direction, and a story that really doesn't spring to life despite the remarkable achievement of its main hero. That hero, of course, is Neil Armstrong, played very well by Ryan Gosling, but is so devoid of life and lacks any substantial relationships that make First Man an overall tired pointless films that does very little with the material that is on offer. Whilst Chazelle does manage to make a lot of the action very tense and helps deliver strong performances by Gosling and Claire Foy, the amount of negatives outweigh the film as a whole. For example, the film begins with plentiful amounts of shaky cam and extreme close-ups that make the film very disorientating. Whilst this technique is great during the action scenes where we feel the vulnerability of the astronaut's craft, it makes little sense during the domestic scenes where the film just decides to focus on the faces of the characters most of the time. Another problem is that the plot of the film documents the time between 1961 to the first apollo mission, but little character and relationships are developed during the time, making it a snore for most of the time. The film could have easily explored the relationship between Janet or Buzz Aldrin with Neil Armstrong, but this is instead neglected and most of the side characters are nothing than mere plot devices or stereotypes (namely Buzz who acts like this hot shot throughout the film but never has one meaningful conversation with Neil at all!). Instead, most scenes or set pieces act like montages of everything Armstrong did leading up to Apollo 11. Another problem is that the film tries really hard to inject emotion through the death of his daughter. Whilst some people might think that is emotional or deep, I found it super forceful and given that Neil was a stoic character to begin with, the whole relationship thing with his dead daughter felt unearned and often quickly forgotten. Some of the CGI at the end was pretty bad and was unnecessary but the final space sequences was quite good. As Chazelle is obsessed with jazz and music, I found the music choices suprisingly dull and a bit of a hit and miss throughout the film. Most of the meaningful score only comes at the end when Apollo 11 happens. I suppose the film also has a pacing issue because Chazelle decides to focus on some aspects for a very long time ie the Gemini 8 test flights, whilst Apollo 11 actually feels very rushed. Perhaps the biggest problem is that Neil Armstrong is arguably not really an enduring character and there is nothing really meaningful to say about him. He is stoic and straight to the point, but one that never really grows or one that the audience learns anything more about him even by the end of the film.First man is an overall bland experience which I did not expect after seeing Chazelle's previous works. Where the previous films had a main theme of characters with a craft driven to obsesssion and having to sacrifice their relationships, the problem with the 'Armstrong story' is that we all know what happens - he becomes a global hero and has a happy albeit reclusive life. There is nothing really more to say. If the film decided to focus more on the struggles to get to the Moon and more on Armstrong with the other astronauts (such as who wants to land first/whilst their colleagues kept dying) then I personally think that would've been a better film. First Man unfortunately won't be coming first in terms of this year better films..."
    },
    {
      "rating": "0",
      "text": "eu nao gostei , esperava mais deste filme e do proprio ator no qual sou fã..nao foi dessa vezzzzzzzzzzzzzzz"
    },
    {
      "rating": "5",
      "text": "okay. this movie has staked out it's niche. It's personally intimate. It's effective at literally getting in people's face. Inside a crowded Gemini cockpit: claustrophobic and chaotic. As majestic as the backdrop is, this film is as grounded as it gets, but not in a good way. Character studies have their value, but Armstrong, while an important man, while an iconic man, a First Man, is just not interesting man."
    },
    {
      "rating": "9",
      "text": "Damien Chazelle's perfect record remains intact.  His third feature film, 'First Man,' is an extraordinary achievement in filmmaking and immediately becomes a front-runner for best movie of the year.The technical aspects of the film are flawless.  Everything from the writing to the cinematography to the sound design and score are as compelling as they are precise.  Yet it's the pacing and emotion of the film--which are directly a result of Chazelle's exceptional directing--that complete the package, making 'First Man' his most audaciously planned and executed project to date."
    },
    {
      "rating": "7",
      "text": "Maybe not my type... This movie is super slow and dry that I almost fell asleep. And I don't like the dichotomy between family responsibility and patriotism. Although I do find the way Chazelle portrays the state politics dynamics to be compelling and sardonic."
    },
    {
      "rating": "9",
      "text": "I would give First Man a 9 out of 10 (an outstanding film, better than most of the other films released in 2018), only if we can agree that The Right Stuff should be about 15. It's beautifully shot and an extremely intense first-person account. Claire Foy is incredible.  It simply lacked much of the excitement that films like The Right Stuff had locked down."
    }
  ],
  "recommendations": [
    "everest",
    "deepwater_horizon",
    "in_the_heart_of_the_sea",
    "127_hours",
    "the_good_shepherd",
    "you_were_never_really_here",
    "the_rover",
    "the_master",
    "the_perfect_storm",
    "interstellar",
    "the_walk",
    "the_last_duel",
    "21_grams",
    "melancholia",
    "the_light_between_oceans",
    "beirut",
    "apollo_13",
    "nocturnal_animals",
    "dunkirk",
    "allied",
    "ex_machina",
    "patriots_day",
    "only_the_brave",
    "the_beguiled",
    "alpha"
  ]
}