{"id": 1625, "title": "First Blood", "starring": ["Sylvester Stallone", "Charles A. Tamburro"], "runtime": 93, "genre": ["Action", "Adventure", "Thriller", "War"], "description": "When former Green Beret John Rambo is harassed by local law enforcement and arrested for vagrancy, the Vietnam vet snaps, runs for the hills and rat-a-tat-tats his way into the action-movie hall of fame. Hounded by a relentless sheriff, Rambo employs heavy-handed guerilla tactics to shake the cops off his tail.", "releaseYear": "1982", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/a9sa6ERZCpplbPEO7OMWE763CLD.jpg", "categories": {"plot": 8.714285714285714, "acting": 9.0, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 7.75}, "reviews": [{"rating": "10", "text": "Awesome film. Stallone's greatest acting performance. An instant classic imho - has brilliant character development and an excellent story with some amazing gun shooting action. Awesome cast - everyone is perfectly casted and each portray the characters brilliantly. No doubt, First Blood is the best in the Rambo series."}, {"rating": "9", "text": "First Blood is not the Rambo movie you would expect to see. The moral ambiguity of the film makes it much smarter and more subtle than its sequels. And the fantastic performance of Sylvester Stallone sells the whole picture."}, {"rating": "7", "text": "It was ok. It was interesting at first but then it just turned into a full fledged action film that was rather pointless and unrealistic (plot wise). Overall it was decent."}, {"rating": "8", "text": "First Blood. He thought the war was over for him. A great start to the new Sylvester Stallone franchise. You worry about his Rambo and you understand why he does certain things. In general, a good action movie."}, {"rating": "7", "text": "This is quite a good action film. I certainly felt on the side of the main character and it'd be hard not to be annoyed at the local sheriff, William Teasel. It was interesting how he reacted to the colonel who stepped in to try and save him from Rambo. The dynamics of the characters are good I suppose but of course this is, first and foremost/primarily, an action film. There are certainly some good explosions and chase scenes. I thought this was quite a good film I'd recommend."}, {"rating": "10", "text": "Great movie.It holds so well year after year!The sequels were awful, but the first one meant a milestone."}, {"rating": "10", "text": "this is the best action thriller movie of all times, the best performance of Sylvester Stallone in my opinion the best of the trilogy.   First Blood should win an oscar"}, {"rating": "6", "text": "First Rambo film is decent with solid action and acting though isn't really that good."}, {"rating": "10", "text": "Um Clássico de ação!!! Digno de sequências e uma franquia criada.\rSylvester Stallone desempenha uma fenomenal atuação como o soldado John Rambo que volta aos Estados Unidos,depois da Guerra do Vietnã a procura de um colega que serviu junto com ele no Vietnã porém é noticiado que o colega faleceu,ele acaba passando numa cidadezinha na qual é intimidado e preso pelo xerife que o acusa de ser um vagabundo,Rambo acaba revivendo na cadeia traumas que passou no Vietnã e foge da delegacia derrubando todos por lá,e acaba sendo perseguido pelo xerife e o resto da equipe de polícia até uma floresta.\rLá ele acaba começando uma guerra contra a polícia até que seu comandante no Vietnã o coronel Trautman interpretado Brilhantemente por Richard Creena,vai até o xerife dizer que o cara (Rambo) é casca grossa e que eles vão perder a briga contra Rambo,e propõe um cessar fogo de ambos indo ele convecer Rambo a parar mas as coisas piora...\rExcelente Filme clássico!!!!"}, {"rating": "9", "text": "The only Rambo movie with a real story. I own them all and i like them all, but Rambo 2-4 are just \"Lets Rambo kill hundreds of bad guys\" without a real story. Rambo - first blood, shows a vietnam vet mocked without a reason by some Polivemen. Because of his experience during his prison in vietnam he starts raging and runs away from the cops and hides in the woods. The Cops start to act violently against him, until he starts to return the favour. In this movie Rambo avoids violence for a long time. Its not a blood and gorefest like the other parts. Thumbs up for one of the best true action movies. Good storytelling and good entertainement, without CG Explosions and stuff, needed in todays movies."}, {"rating": "9", "text": "El ejemplo de lo que hacen los americanos cuando los critican, lo trasforman en un producto hollywoodense como en Rambo 2 y 3, aunque esto no quiere decir que sean malas películas, pero esta es mejor porque a pesar de que el personaje es un experto en combate, también se lo muestra muy vulnerable y lo mismo sucede con la sociedad americana que a pesar de ser organizada y prospera, le dio la espalda a estos veteranos de guerra solo porque no la ganaron. Una de las mejores actuaciones de Stallone sobre todo en la escena final."}, {"rating": "10", "text": "A great start to a great series, with astounding performances and a nice story."}, {"rating": "8", "text": "Really enjoyed this movie, kinda underrated but is really awesome action movie, Stallone did great on it."}, {"rating": "10", "text": "!!!amazing movie!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "10", "text": "It's one of the few perfect movies I've seen in my lifetime"}, {"rating": "10", "text": "Classic movie not only with some nice and intelligent action, but also with a good story, nice duell between Rambo and the police chief and a sad ending. Sylvester Stallone with a great performance"}, {"rating": "8", "text": "\"Character actors! Who cares if we get fat?!\"From the stage, to the silver screen - Brian Dennehy is the type of talent that comes once in a life time.He played a hand full of roles. Larger than life, but still brilliant.I first saw him in 'First Blood'. He and Stallone made that film a classic.RIP"}, {"rating": "7", "text": "It is classic and great for its time, but I still found some parts in plot a bit weird, like him kinda being good and only revenging to guys who attack them, but in the end goin crazy and destroying half city - not all people there did something bad to him"}, {"rating": "7", "text": "A great premise and a nice insight on the effects of war, but that was it. It was thrilling and suspenseful, I'll give it that. But other than that, the movie's action scenes where lackluster."}, {"rating": "9", "text": "Grieving and traumatised Vetnamn Vet gets provoked/asssaulted by a-hole cops and goes breaking bad. Still pretty gripping stuff to watch in 2022."}, {"rating": "8", "text": "Una de las mejores películas de acción. Si bien es cierto que el ritmo de la película no esta muy bien logrado que digamos, la combinación entre venganza y malentendido la empuja para arriba."}, {"rating": "9", "text": "I have seen this movie at least 20 times. For some reason I ended up watching this every time I get ill (go figure). But by far his best movie as it is even half believable and has a good plot."}, {"rating": "7", "text": "Way more of a soft spoken action movie than I expected. Stallone probably only has 10 lines total, he gets a great scene to cook in at the end which was worth the wait."}, {"rating": "10", "text": "its kinda of horror movie and an action movie which is pretty interestingbut that cop is annoying"}, {"rating": "10", "text": "This is the only Rambo movie worth seeing, and is an excellent thriller where we empathize with Stallone's PTSD scarred Rambo as a struggling and decorated Vietnam Vet lashing out against unsympathetic and heartless forces in a story as relevant today as it was then."}, {"rating": "8", "text": "Sewer Rats: Rambo's Greatest Enemy[PTSD is pretty bad too.]Stallone at his best, right after Rocky. Unlike Rocky, I don't have much love for the subsequent Rambo films."}, {"rating": "10", "text": "Probably my Favorite Action Movie ever. It isn't just action, it's a take on Vietnam PTSD."}], "recommendations": ["shooter", "john_wick", "the_equalizer", "the_mechanic", "angel_has_fallen", "john_wick_chapter_3_parabellum", "the_italian_job", "rambo_first_blood_part_ii", "the_expendables", "run_all_night", "die_hard", "the_terminator", "bullet_to_the_head", "safe", "terminator_3_rise_of_the_machines", "iron_man_2", "nobody", "the_expendables_3", "true_lies", "mechanic_resurrection", "hercules", "16_blocks", "gangster_squad", "homefront", "mission_impossible_iii"]}