{
  "id": 4847,
  "title": "First They Killed My Father",
  "starring": [
    "Sareum Srey Moch",
    "Phoeung Kompheak"
  ],
  "runtime": 136,
  "genre": [
    "War",
    "Drama",
    "History"
  ],
  "description": "A 5-year-old girl embarks on a harrowing quest for survival amid the sudden rise and terrifying reign of the Khmer Rouge in Cambodia.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5370jxJfZQY8TUZiiGkpNgvRwU9.jpg",
  "categories": {
    "plot": 6.7,
    "acting": 8.375,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "very bad about Cambodia Vietnam war, bad story bad atmosphere built, unreasonable story and character development"
    },
    {
      "rating": "7",
      "text": "Sensitive enough to overcome its noticeable flaws that manage to shine through its charismatic acting and a story worthy of being on screen. A fine experience."
    },
    {
      "rating": "8",
      "text": "For those who continue doubting, First They Killed My Father is a film that proves that Angelina Jolie has real talent for directing, perhaps even more than she once had for acting.This film represents her best and maturest effort behind the cameras, it's work that overflows empathy and understanding even on front of the indifference that can provoke her own vision of the events that she is narrating in this movie.Nonetheless this movie it's totally worth it, it is certainly one of the best hits for Netflix this year and also we should give recognition to Angelina Jolie who continues to mature and evolve as a filmmaker and I can assure that we are very close to see something incredibly remarkable from her."
    },
    {
      "rating": "10",
      "text": "Sensitive and powerful film, it's impossible not to be thrilled with Loung's story.Angelina did a great job with this film, it captures your attention from beginning to end. Special thanks to Mrs. Jolie, for having the audacity to make this film in honor of a people she loves very much.After watching this movie you will never be the same again, I just regret not being able to hug Loung Ung, because that's what you want to do after watching the story of her life."
    },
    {
      "rating": "0",
      "text": "Looks nice......they got the asia sky hues just right. But the whole film plays out like the poor unfortunates are bored at the worlds most basic holiday camp than at a holocaust site. It's a Lifetime TV safe version of events. Also as an aside, i wondered as i was watching the film, why the director changed her Cambodian kids names to an American variant instead of keeping their original Cambodian versions.....BORED to death(camp)."
    },
    {
      "rating": "10",
      "text": "Angelina Jolie is an accomplished filmaker. FTKMF is stunning, it is a powerful film. Great job , cast and crew, all cambodians actors and most of the technicians. This movie deserves all the praises and i hope it will be awarded when comes the award season."
    },
    {
      "rating": "10",
      "text": "I was so moved by this film. As beautiful as it is heartbreaking, seeing these happen  through the Eyes of a child.This is not an easy film to watch, children suffering from war, but it's an important piece of history."
    },
    {
      "rating": "10",
      "text": "“First They Killed My Father” is a very difficult movie to watch. I had known much about the Cambodian genocide under the Khmer Rouge, nevertheless it was painful to slog through this tale, at points my emotion overcame me. The story is a quiet horror unfolding scene by scene, without much gore but with the stronger dread of helplessness in the face of a universal terror all around you. The true fear of this film is watching your beautiful world and family torn apart by forces over which you have absolutely no control. As a father I simply cannot imagine the strength of character it took for Leung’s parents to hold their family together with stoicism, courage and smiles in the face of such unimaginable horror.Leung herself is a master class. You can see her struggle to hold onto her childhood and innocence as it is torn away from her, and even till the end she does not give in. Looking at this terrible dark chapter of human history through her eyes is a new perspective. Her wits, sharpness and determination were her ultimate survival skills. As the namesake of the movie, the moments when the parents were forever separated from their kids made me choke up in a way few movies have.I am so glad this true story was told in an unfiltered manner, in the harsh depiction it deserves. To this day Cambodia has unhealed wounds, as the demons of the Khmer Rouge have been largely unpunished. In the outside world fresh horrors have unfolded since in Bosnia, Rwanda, Myanmar and now Xinjiang. The world continues to sit silent and observe. I will be eternally grateful to Angelina Jolie for her sheer masterful direction and support to bring this must see story to the big screen."
    },
    {
      "rating": "10",
      "text": "It's an awesome movie. I enjoyed every aspect of what Angelina and her team did to make the reality of book come to life. Great cinematography, acting and directing. I absolutely recommend everyone reading my comment to watch it."
    },
    {
      "rating": "10",
      "text": "This is a special and incredible movie. It shows something that many have forgotten, a part of the history of mankind that should be known. Thanks, Angelina for this film, your talent did it again"
    },
    {
      "rating": "7",
      "text": "Una gran película que juega entre lo brutal y emocional sin caer en lo cliché, bien contada, una justa candidata a la nominación por lenguaje extranjero."
    },
    {
      "rating": "7",
      "text": "A good film that shows the tragic realities and results of current, American Liberal ideas (ie. the US leaving civilians to die in Cambodia and Vietnam, and the inherent destructionan murder that occurs because of large government control and redistribution of wealth); ideas which have been around longer than the US has been around.This is a must see for Bernie Sanders supporters and American College students, who have been so lucky to be born in a country that has come closer to fulfilling Capitalist ideals than Socialist ideals.  The people that lived through occurrences that are portrayed in the film, easily recognize the Socialist rethoric that they have survived.  They either enjoyed thier sadistic journey, which is very few, or they never want to see the violence that Socialism tortured them with, ever again, which is the vast majority.A difficult fim to watch, to see the Cambodians flee to the Vietnamese for safety and survival, simply because the Vietnamese were ever so slightly less Socialist than the Khmer Rouge at the time, and ironic, since the Vietnamese are predominately at fault for the Khmer Rouge’s existence.A good film that will slap the face of people in America that say,”I don’t care about politics,” as well as Liberals who say everyone has a “right” to healthcare."
    },
    {
      "rating": "10",
      "text": "Awesome! So haunting. A+ all the way! Sad and full of grief. Yet joy and full of strength of family. Ugliness yet beauty seen in a country. Wow, the young actress, Sareum Srey Moch, to carry so amazingly, such a dramatic film, on her small shoulders. Mostly through her face and mannerisms. That is true talent by her and her director to get such a performance from a first time actress. Also praise for the other actors and actresses, who some must have had unwelcome memories of long ago. All well acted.Some say it was too slow, too long. Not so. It was needed. That is how real life is like. Others wanted more war action, more graphic scenes, more information. They forgot or never thought - through the eyes of a child.Kudos to Angelina Jolie, Loung Ung, Rithy Panh, Anthony Dod Mantle and the other cast and crew who worked so hard and brilliantly to present us with such an amazing film.Shout out to Maddox and Pax Jolie-Pitt also. It must have been hard, yet I know you are proud of your Mom and yourselves and rightfully so. A much needed movie to see and to inform, especially now, when it seems that evil has descended once again on so many - who tend to be forgotten, whether through ignorance, callousness or laziness, it doesn't matter - A daughter of Cambodia remembers do other do not forget - EVER."
    },
    {
      "rating": "10",
      "text": "First They Killed My Father is a disturbing and well crafted film. Sadly I'm left troubled thinking about how much the same thing is happening in the world today."
    },
    {
      "rating": "10",
      "text": "Wow. First They Killed My Father is so beautiful, powerful and heartbreaking. A Masterpiece that is told through the eyes of a child. A rare film that stays true to the book and its culture."
    }
  ],
  "recommendations": [
    "the_impossible",
    "12_years_a_slave",
    "hotel_rwanda",
    "empire_of_the_sun",
    "nomadland",
    "the_hunt",
    "the_florida_project",
    "just_mercy",
    "the_boy_who_harnessed_the_wind",
    "sin_nombre",
    "the_pianist",
    "american_history_x",
    "manchester_by_the_sea",
    "the_book_thief",
    "the_imitation_game",
    "minari",
    "call_me_by_your_name",
    "silence",
    "the_last_king_of_scotland",
    "the_road",
    "a_monster_calls",
    "melancholia",
    "only_the_brave",
    "legends_of_the_fall",
    "hidden_figures"
  ]
}