{
  "id": 2818,
  "title": "Fist Fight",
  "starring": [
    "Charlie Day",
    "Ice Cube"
  ],
  "runtime": 91,
  "genre": [
    "Comedy"
  ],
  "description": "When one school teacher gets the other fired, he is challenged to an after-school fight.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/huRhv4IZDk2ds0DIDkI6uxdmb6J.jpg",
  "categories": {
    "plot": 6.8,
    "acting": 5.5,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.071428571428571,
    "action": 7.333333333333333
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Fist fight was a fun movie. It was clever if a bit juvenile, hilarious all the way through, and very well acted with the actors all having fun with their roles. In a few ways it reminded me of 21 jump Street with the school setting and comedy, which is a great thing for a comedy. It's nowhere near as bad as some critics are saying and it's not afraid to get dirty and over the top when it needs to which I also really appreciate in comedies. Overall it was a fun watch especially the scene s with Charlie day and ice cube as they defintely steal the show and make it an entertaining fun watch. If you like comedy movies that aren't afraid to take chances with both comedy and dialogue as well as clever scenes (ice cube's character story rumours was a fun bit) I'd say you would more than likely enjoy this movie. If anything it's a good laugh and has fun with itself and I enjoyed this fistfight 8/10"
    },
    {
      "rating": "2",
      "text": "Another movie where Ice cube has been presented like he's the greatest thing to ever walk the face of earth. Pathetic and really annoying - this comedy is just horrible. But if you have plenty of free time - you may wanna check it out yourself."
    },
    {
      "rating": "8",
      "text": "I quite enjoyed this movie, don't get why it has so many negative reviews. Ok it was a bit silly, unreallistic and over the top, but it was meant to be like that. Plus it has Charlie Day in it and I do enjoy his humor here and also in Its always sunny in Philly. Maybe I am biased, but I did like it a lot."
    },
    {
      "rating": "5",
      "text": "A film that has its fair share of laughs, but in the long run is highly forgettable.  This might be the most messed up school I've seen on film literally everyone is deplorable.  C+"
    },
    {
      "rating": "4",
      "text": "If you're looking forward to see Fist Fight, go look somewhere else for it because it is not here and nothing is great about this film. It comes to the point where movies like these only exist for the heavy benefit of money."
    },
    {
      "rating": "10",
      "text": "SOOOOO MCFREAKING FUNNY i want to go watch this **** again. all these bozos with their negative reviews are stupit. go watch this movie i'd pay real green dollars to go see it again"
    },
    {
      "rating": "10",
      "text": "It was a lot better than we expected it to be! My only qualm is that I don't find Jillian Bell very funny, and I thought her role in the movie was just weird and unnecessary. Charlie Day and Ice Cube both gave great performances, and there was even a little bit of reality thrown into it about the sorely understaffed public school system. Charlie Day's daughter performing was definitely one of my favorite parts of the movie hands down!"
    },
    {
      "rating": "10",
      "text": "This review is being written by Bethani Eskridge.I believe student on student bulling has decreased in the school systems due to behavioral units within the school systems. Most students that physically bully have limited timing in the classrooms or have been eliminated from the classroom. I am aware of this because I use to work as a Teacher assistant for Randy Wood in the Jessamine County School Systems back in 2013-2014. However bullying has not been eliminated in the schools anymore. It has now come to teachers bullying students mentally. I know because my daughter is being bullied by a teacher that picks favorites. I think there should be 2 teachers in each classroom one teacher that knows signs of mental abusers and one that is the abuser. I think the teacger that mentally abuses students should be parented by the teacher who knows signs of mental abusers(people who show love for there favorite students and show petty discipline to students that they don't like)  I think this movie could be a good solution to eliminate bullying in schools between teacher on student abuse. For more facts and evidence on my reasoning. This could also help teach and entertain students on different types of adults in the world and which ones to seek help from and which ones to stay away from. For more facts and evidence on my reasons you can email me at beth061791@aol.com. Boolean MySQLi"
    },
    {
      "rating": "7",
      "text": "Fun movie if you can suspend your disbelief enough to sit through it. Plot breaks no new ground which means you basically know what youre getting as soon as you walk in to it. Ice Cube and Charlie Day were great at playing extensions of themselves and theres alot of laughs to be had whenever either of them are on screen."
    },
    {
      "rating": "2",
      "text": "So trying to review this film without spoilers is pretty difficult, however I'm up for the challenge, mainly because I'm pretty sure I can write more entertaining and witty dialogue then I was given in this film. To say that it was a poor film is an understatement, it's like the producers asked there writers to write the most bland script and then they shat all over it. I mean this both literally and figuratively of course in this film I'm pretty sure the teachers nor pupils would know the meaning of the two terms. However I digress from my review. So lets talk about the acting, while bland is the best description I can use for all the actors in this film, I must give some credit to Icecube, it seemed quite clear in this film that he didn't really want to be there either, sadly I do think its a downward slope for him, after his last few films have been generally panned. As for the rest of the actors, I can't really say much as I really didn't notice them, they were just bland and boring, recycling the same shock comedy as Monty python (just without the funny bits). In terms of set I will be honest in saying it was well designed and made me feel like I was in a school, granted that the continuity editor may have missed some bits, but it's a forgivable mistake.... it's not like they are on $150,000+ per year or anything?? Oh wait, my bad that's exactly true, lucky them, if I made as many mistakes as them then I wouldn't have a job anymore. Sadly I can't tell you how the film ended, as much as I wish I could to save you a lot of time and money, I left the cinema before the film ended as I simply couldn't take any more of it. In the first time in over 10years a film has been that god-awful that I walked out on it! So that's my review of the film without giving away spoilers, personally I wish I could as it would save you, but in my opinion it should have been a straight to DVD or Netflix original and not disgraced the big screen."
    },
    {
      "rating": "4",
      "text": "When a nebbish English teacher (Charlie Day) crosses the angriest member of the high school faculty (Ice Cube), the titular event is on. Day spends the rest of the movie frantically trying to avoid the throw down. He can be very funny and does have moments, but more often his frenzied energy just comes off desperate. There are a few supporting characters who add most of the humor, but even so, the script isn't especially funny. The best scene is when Ice Cube gets to utter the most famous line from his NWA days. NOTE: Stay thru the early credits for outtakes and thru all of them for an extended improv by Tracy Morgan."
    },
    {
      "rating": "7",
      "text": "Snitches get stitches!The first feature film for a television director. He did not get the best cast, but best among the second string. Charlie Day's first lead I'm seeing. I mean not like, among other big stars he used to do the roles. Yes, there are like Ice Cube in the film, but the whole narration was presented from the Charlie's viewpoint. This story needed strong voice, but he had none. You may get annoyed for that, but that's the first fun side of the tale. Charlie Day versus Ice Cube! This kind of combination is not new, but decently used to tell the story. I like Cube in comedies than the serious roles.Well, it's not about the story, it's just a one day event. The final day of the school and a tough day for all. Because some of the staffs were fired from the job, the students' misconduct peaked, it's totally a messy day. The English teacher, Campbell, gets into a fight for going against his co-staff. So the day goes on as the countdown begins for their most anticipated fight at the final bell of the school. The preparation for that and all other craziness take place before the finale.When the film started, it was like any other B movie, very familiar atmosphere and predictable. Once the second half kick-started, I felt it was getting better. And the climax was even better. So, it ended strongly, after a so-so opening. Till that end, I did not think it deserved a decent respect, but at the end a better one. With this kind of cast and thematic, the film was much better. Really a well made, nothing more than on the entertainment perspective. So, if that's your sole purpose to watch a film, then this is the right one. Go for it. A much better film than the rating it had received. #TeachersFight7/10"
    },
    {
      "rating": "3",
      "text": "Lmao. Such a bad movie, but I couldn't stop watching the trainwreck. It's a really bad movie, but strangely, one that I would recommend for **** and giggles."
    },
    {
      "rating": "5",
      "text": "It's not terrible; Charlie Day and Jillian Bell are pretty funny. The director also directed multiple It's always sunny in Philadelphia episodes so you got some of this type of humor in here"
    },
    {
      "rating": "5",
      "text": "Ice Cube and Charlie Day's chemistry is by far the best part of this movie. Nothing else in the movie matches up to that, which is one of the problems. I must say though, quite a bit of laughs throughout."
    },
    {
      "rating": "7",
      "text": "I was surprised at how much the movie made me laugh.  There were some cheap gags, but Ice Cube and Charlie Day had a decent chemistry working together.  It is irreverent and fun."
    },
    {
      "rating": "7",
      "text": "Can't lie, even I wanted to beat the hell outta Andy Campbell towards the end."
    }
  ],
  "recommendations": [
    "21_jump_street",
    "superbad",
    "diary_of_a_wimpy_kid_the_long_haul",
    "confessions_of_a_shopaholic",
    "thunder_force",
    "the_game_plan",
    "my_spy",
    "bad_teacher",
    "the_croods_a_new_age",
    "17_again",
    "neighbors_2_sorority_rising",
    "night_at_the_museum",
    "the_duff",
    "the_change_up",
    "friday",
    "couples_retreat",
    "this_is_the_end",
    "good_boys",
    "mean_girls",
    "spy_kids_all_the_time_in_the_world",
    "hall_pass",
    "paul_blart_mall_cop",
    "never_back_down",
    "the_war_with_grandpa",
    "dirty_grandpa"
  ]
}