{
  "id": 844,
  "title": "Five Feet Apart",
  "starring": [
    "Haley Lu Richardson",
    "Cole Sprouse"
  ],
  "runtime": 116,
  "genre": [
    "Romance",
    "Drama"
  ],
  "description": "Seventeen-year-old Stella spends most of her time in the hospital as a cystic fibrosis patient. Her life is full of routines, boundaries and self-control — all of which get put to the test when she meets Will, an impossibly charming teen who has the same illness. There's an instant flirtation, though restrictions dictate that they must maintain a safe distance between them. As their connection intensifies, so does the temptation to throw the rules out the window and embrace that attraction.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kreTuJBkUjVWePRfhHZuYfhNE1T.jpg",
  "categories": {
    "plot": 8.485714285714286,
    "acting": 8.146341463414634,
    "ending": 7.818181818181818,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.777777777777779,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "What an incredibly Romantic (with a capital R) story, which is reminiscent in many ways of Hathorne's Rappacini's Daughter - the girl raised in the poisonous garden who is incredibly beautiful but who is poisonous to anyone she makes contact with. Yes, it's a bit of a stretch, but the Romantic themes of intellect vs. emotion and head vs heart are overflowing in this very beautiful story.  Haley Lu Richardson is just incredible in every role she plays, and this film is no exception. I wasn't expecting much from her counterpart (Jughead from Riverdale), but he's excellent as well.  There are so many moments in the story in which you could see a cliche'd story element coming, but first time director Justin Baldoni (from Jane the Virgin) avoids them and has really come up with an elegant story which really compels moviegoers to go and embrace the ones they they love.  It's a positive message from a very touch medical story, but it truly is a feel-good film."
    },
    {
      "rating": "8",
      "text": "A couple, Stella (Haley Lu Richardson) and Will (Cole Sprouse) meet 'cute' in a hospital. They are both teenagers and both have cystic fibrosis, with Stella awaiting a lung transplant and Will just started on a drug trial for a bacteria he carries that can be lethal for another CF patient.  They are, of course, complete opposites with Stella being a control freak, along with being OCD, who has a video blog and Will is a cartoonist and believes in breaking rules just for the sake of breaking them. Oh yes, in case this all sounds familiar Stella has a Gay BBF, Poe (Moises Arias) also with cystic fibrosis, who is the wisecracking comic.Though \"Five Feet Apart\" may sound like other young adults with illnesses love story but the director Justin Baldoni and screenwriters, Mikki Daughtry and Tobias Laconis add special touches. Instead of lectures about CF Stella points out most of the must-knows in her vlog with humor and at one point half the audience yelled out \"NO!\" at what was about to take place. At another point what you expect to happen doesn't---or does it?In the story is Nurse Barb (Kimberly Hebert Gregory) who really cares for the kids, keeps on eye on them as far as taking meds, wearing masks when they should, following the rules they must and really runs when she has to in emergencies. She, also, keeps them aware of the no touching, staying 6 feet apart (no, that's not a typo error) at all times with director Baldoni introduces a cue stick as a measurement to keep the lovers safe. (No, that's not a spoiler--you know they were going to fall in love!)The three leads are perfect in their roles with Moises Arias as the gay friend having two high points one being very funny with Will accusing Poe of being in love with Stella and later explaining one of the major fallbacks of an illness that isn't often thought of in this kind of movie. Haley Lu Richardson brings humor and gravitas to her ever-optimistic though a strict with herself patient who is carrying a secret that I didn't get until it was spoken. Cole Sprouse is a handsome actor who has a very annoying hairstyle and not necessarily the chemistry he should have with Richardson but he has the charm to win over everyone, including the audience.  Everyone should have a nurse like Nurse Barb/Gregory.There are shots that you will think are not following the rule about staying a certain distance apart but the direction shows what seems a closeup is really the angle of the camera.\"Five Feet Apart\" has the drama you would expect in a movie of this sort and as far as I can tell there wasn't a dry eye in the movie during a few scenes but it also has humor, tenderness, a learning experience about cystic fibrosis without lecturing and an optimistic feel. For those who don't watch television, it will also introduce you to 3 stars of tomorrow. The bottom line is that \"Five Feet Apart\" is a good movie and more worth seeing than what else is available."
    },
    {
      "rating": "4",
      "text": "I'm sure the filmmakers' intentions were nowhere near this bad, but what I gleaned from \"Five Feet Apart\" as a depiction of cystic fibrosis is that the disease itself is much less of a debilitating illness as it is a borderline **** plot device that's keeping two horny teenagers from making out, ultimately romanticizing and -- in turn -- minimizing a very un-romantic and serious disease in the real world. Couple that with all of the treacly, \"Everything, Everything\" meets \"The Fault In Our Stars\" sort of sweetness that veers so heavily into quirk that it breaches into insanity, and you end up with a truly frustrating cinematic experience. Why are we still doing these? What diseases are we going to Hollywood-ize next? Leprosy? Osteogenesis imperfecta? \"I can't love you because if we make love I'll LITERALLY fall apart\"? It's nonsensical and, most importantly, condescending to those few people who actually struggle with this very real, very unglamorous disease. At least \"The Fault In Our Stars\" depicts cancer, something most of us are going to get anyway. And at least the disease in \"Everything, Everything\" -- you find out -- is simply made up. This feels like a weird attempt at exploiting an illness for the purposes of manipulating an audience's emotions. I'm tearing into the foundation of this movie hardcore, yes, but it's important that intentions be hammered out in the scripting/development stage. Like, of paramount importance. Overall, the acting is good, sure. And even the filmmaking borders on competent. But I just can't get behind movies that are this out of touch with reality."
    },
    {
      "rating": "10",
      "text": "This film is so moving and beautiful! It raises awareness for cystic fibrosis, and also inspires the audience to live life to the fullest and not take anything or anyone for granted.  Truly beautiful film!"
    },
    {
      "rating": "5",
      "text": "We each have our time-wasting habits that cause us to forget just how short life really is. You could anticipate habitually checking on social media to last only a minute, then suddenly a half hour later are googling why you should use bourbon for a chocolate chip cookie recipe. Those procrastination moments halt our livelihood to borderline existing in solitude, sleepless with apple pie a la mode heated without the strawberry ice cream (or non-canned whipped cream) on top. Five Feet Apart attempts to dramatize that concept of how valuable time with others is, but ultimately dissatisfies anyone who is not of its intended age group, as much as it gets some core ideas right.The focus centers around two patients suffering from cystic fibrosis, Stella and Will, whose idiocy harms each other to the extent where they’re hard to cheer on. Even while Will later displays a heart, it ultimately satisfies your moral high ground once they reap what they sow. Everyone else around them, patients and staff, acts aloof due to the weakly written tragedy, in empty attempts to replicate another classic romance, Eternal Sunshine of the Spotless Mind. Putting the two between ice and stars does not make Will less of a jerk, nor does copying that iconic shot make Stella as empathetic as Clementine Kruczynski.Although Stella and Will could die any day, alone, hospitalized, of which the movie mostly stays inside of; the emotional separation enables easy befriending of sadness like any emotional separation you’ve felt before. You will remember those broken bonds as the camera emphasizes Stella and Will’s six-foot distance; much different than the intent of most romantic dramas that want to get intimate, this pulls back to set the waterworks off.Plenty of details expose Stella’s living condition in a nutshell: a stuffed panda gift from her dead sister connects to bamboo that decorates a meditation room she sits in, which in turn is the subject of a poster on her door. Together, these subtle clues generate comprehension out of her desperate search for peace amidst the chaos. Then, it all takes a maximum strike when a surreal dream sequence pops her sister’s art to life; it’s a visualization of survivor’s guilt closer than ever before.The director, Justin Baldoni, has a humble way of emphasizing the natural look as if it where a documentary—through techniques picked up from documentaries he directed in the past. Yet Baldoni does get carried away with the use of shaky-cam to the point where it obnoxiously disrupts calm scenes. There are also obtrusive elements that “pep” up the image, like graphics projecting text messages, that appear incredibly out of place.At least those graphics don’t arise during the couple’s gentler exchanges of what they fear about what happens after death. However, even the emotional highs abuse the playing of unnecessary pop songs which fail to project Stella’s college-age girl mind, when an original score would have worked better. Still though, the love-birds’ existential crisis remains genuine, with the gross symptoms of Stella’s body causing fear of whether she will die right there.There’s little reason to stay happy, so Stella cheers herself, along with the audience, up through a regularly updated vlog that explains everything, particularly why cystic fibrosis is such a thief. It helps Stella and Will bond after their instant connection in person, a source of joy that gets stronger as Will draws the apple of his eye by the window. It’s a Jack-Rose bond that fuels the romance and sets a strong contrast against the adults in control of their routines; focus wisely stays on the younger generation without its abuse on authority breaking a chain link from happiness.Except one ultimate strike makes the experience less joyful: the characters get too much freedom to the extent of being unrealistic; they seriously can go to the gym or rooftop whenever without supervision. There needs to be an explanation to how this incompetent hospital operates, instead of some manipulative video footage starting and ending this film. Also, how on earth did Will get cologne despite literally having no money!? Too little focus on simple explanations make the writing resemble a sappy teen romance novel. While life may be too short for rules, it’s also too short for on-the-nose statements the couple says like, “God, you’re beautiful.”As time goes by, you should find far stronger applications to livelihood than wasting time on Netflix, that being the love of another. Five Feet Apart attempts to restore your confidence, and won’t succeed in doing that for everyone, but its visualized importance of community can be just enough to lift today’s youth back up by the bootstraps."
    },
    {
      "rating": "6",
      "text": "Romantic drama about two people with the same terminal illness. Touching and humorous at times, though missing a certain quality that I'm having a hard time putting my finger on. It's not the acting, but maybe it's just that the Fault in our Stars is the better movie in every way."
    },
    {
      "rating": "10",
      "text": "I hate sappy movies, but this is no sappy movie. The genuine emotions this film conveys will penetrate all except the most hardened of hearts. It had me in its grip every minute of the way."
    },
    {
      "rating": "7",
      "text": "Amazing romance movie that brings tears to your eyes, emotional story and the way how they fell in love was perfect, beside the stunning performance by Haley Lu the cutest actress who shows a lot of reactions in the same time, if you see Haley Lu in real, her actual character almost same as her movies character, I think she will be one of the most famous actresses in the future.I just have a comment about the end, the most emotional moment in the movie, Joe planned to surprise Haley directly after she underwent a dangerous surgery and says goodbye to her!! I thought she would die after his emotional speech. He must wait until she becomes better, and I don't know why all the hospital staff and her parents helped Joe in his plan, they must stop him because she needs a critical care."
    },
    {
      "rating": "4",
      "text": "Apparently couples with illnesses are the new niche for romantic films in Hollywood. And not that there are many but the truth is that this film made it clear that there is very little to grab within that theme.Five Feet Apart will remind you in seconds of The Fault in Our Stars and although the diseases are different, the characters are tremendously similar. She's the smart one and fully aware of her illness while he's the risky guy and too cool for the rules but although on one hand Ansel Elgort had charisma, Cole Sprouse cannot help feeling arrogant and unfriendly.Haley Lu Richardson tries but it's clear that the script allows very little. This girl has more talent than shown here and she should definitely look for better roles.In conclusion, there's nothing here that feels different to something you haven't seen before."
    },
    {
      "rating": "7",
      "text": "The story is easy to follow and you can always guess what will happen next. Still, it's a cute and lovely movie."
    },
    {
      "rating": "10",
      "text": "This is one of my favorite movies of 2019, my 3rd favorite drama of 2019, one of my top 10 favorite romance movies, and one of my favorite movies of all time. The acting performances were stupendous especially from Haley Lu Richardson, Cole Sprouse, Moises Arias, and Kimberly Hebert Gregory. The chemistry between Haley and Cole was terrific. The writing and story were heartwarming and heartbreaking. The screenplay was funny, heartwarming, and heartbreaking. I love how this move helps bring awareness for Cystic Fibrosis and how it affects those with this disease. I loved this movie it was beautifully heartwarming and heartbreaking and this movie made me cry and smile the whole time. This is a for sure A+ movie for me."
    },
    {
      "rating": "6",
      "text": "Five Feet Apart is the yearly teen romance film that has been done a dozen times before, and will be done a dozen times more. I do think that it is better than the past few teen romances that I've watched, but at the end of the day the best one of these films can be (outside of The Spectacular Now) seems to be average quality. I enjoyed it because it's a crowd pleaser, but I won't be thinking about it much come tomorrow. I will say I really loved the final shot before the credits rolled. They nailed that, at least."
    },
    {
      "rating": "9",
      "text": "Five Feet Apart will pull at your heartstrings, leave you teary-eyed, and make you hopeful about life when all is said and done. If that doesn't happen, in the very least you'll have learned a bit about the hardships that a terrible disease has on roughly a thousand newcomers each year. It's slightly corny and may cause a bit of doubt in the viewer from time to time, but nonetheless, Haley Lu Richardson and Cole Sprouse have perfect chemistry on screen from start to finish, making it all the worthwhile to see."
    },
    {
      "rating": "10",
      "text": "Five Feet Apart From Other Romance DramasTeenage romance movies always hold special places in a lot of people's hearts, but depending on the decade your familiar with, the elements and presentation are a little different. Eighties brought comedy with emotional drama, nineties was the Nicholas Sparks beginning with the cute, cheesy tactics, early 2000s were all about the Nicholas Sparks, super dramatic stories that hold a lot of places in the hearts of the public. Then came the 2010s and the twist was now romance, but put some type of terminal illness with it to sweeten the deal... So tonight's movie continues this current trend, taking another story in hopes of invoking tears and pulling the heart strings of the audience at the same time. Yes, tonight is Five Feet Apart and yours truly is here to write his reviews as always and share his opinions. Let's go:Movie: Five Feet Apart (2019)LIKES: Acting Character Use Comedy Appreciation of Art Beautiful Romantic Nice SurprisesSUMMARY: The latest movie fills the formula of sad, drama meeting the romantic teenage plotlines. Fortunately, the acting is there to bring a fantastic dynamic to latch onto in the form of Cole Sprouse and Harley Lu Richardson. Their chemistry is amazing, bringing the two sides of the romantic cone to life in a very sweet, charming, and surprisingly realistic way. Five Feet Apart takes these characters and does a fantastic job advancing them past the carbon copy templates most of these films do. The supporting cast does a wonderful job of being integrated into the story, their own tales and dynamics meshing well to bring out the main characters in new ways. Of course the movie somehow manages to add on to the simple romantic story by appreciating other dynamics that can be included in romance movies. The comedy is simple and classy, fitting very well with the tone of the movie without being too forced. For those enjoying symbology in the visual arts, the rooms and works of our proverbial Romeo and Juliet have plenty of artistic bite that is quite impressive to behold, instigating a little jealously in my mind about their artwork. As for the romance component itself, again I give them props for finding a way to bring love and beauty into a realistic way that was both poetic and fun to behold. Five Feet Apart takes most of the cheese factor out of the romance, and instead makes it an adventure that is fun to go on. The ordeal of the disease contending with the blossoming love is a driving force of the film and somehow manages to be fresh despite how plotted love tales are. Perhaps it is also the surprises that come in at points that assists with keeping the adventure going, finding ways to divert from the film, without going too far away from the tale at hand. With all these components it works very well for me.DISLIKES:Predictable Cheesy At Times Scientific Stretches The Parent Components?SUMMARY: No surprise, the movie follows much of the same formula, and my friend and I were able to predict much of the movie based on the trailers we had seen. Fortunately, surprises were able to help with this, but they still held some trouble keeping the romantic movie cheese fest from happening. Five Feet Apart leaves much of the mushy, gushy, Nicholas Sparks like drama that is difficult to get away from, which is a selling point for most going to these movies, but for me could have used a little more spice up. In addition, some of the scientific plausibility for one with my mindset are difficult to get over in terms of the miracles vs. the statistical chances of the real life. Some of the interactions, primarily in the ending occurring the way it did, was very unrealistic and seeing these miracle moments only added to the cheesy coincidences that this series is famous for. If that's not something that bothers you, no worries on this, but for me this is just something to warrant on. As for the parents, they were okay, but I felt that for something as intense as the themes in this movie, some more involvement would be seen. Five Feet Apart's weakest characters are actually the parents, reduced to a few lines of dialogue and the background images. Sure, it's not about them, but in the other films similar to this, the parents were very active in the support of the kids. What happened here?The VERDICT:Overall, Five Feet Apart was much better than I had anticipated, with a lot more heart, artistic beauty, and adventure than many of the romance/dramas that I've seen. A strong cast, character usage, and surprises in terms of comedy and plot were the selling points for this reviewer in regards to this film. It still has predictability and cheese factors, primarily in the scientific stretches, but the good far outweighs the bad for me in regards to this category of movies. I think this is one for the theater in regards to dramas. If not check this one out for a rent/stream because it's got the heart that movies are known to have."
    },
    {
      "rating": "7",
      "text": "I didn't expect much from this film, yet it showed the feels it needed. The story is pretty good, but predictable. Loved the secondary characters, but sadlly, can't say the same for main cast as they were too cliche. Overall, if you are into romance films, this one is a go."
    },
    {
      "rating": "5",
      "text": "Muy incoherente la historia, como es posisble que todos se junten con todos sin contagearse, ni el SIDA."
    },
    {
      "rating": "9",
      "text": "I cried, I laughed, I smiled, This film had me go through all of that.Five Feet Apart is a very beautiful story that reminds us that life is precious and should be lived to the fullest, Stella & will's romance is charming and so seamless, it had this fantastic charm to it, mainly due to the two leads, especially Haley Lu Richardson who performed wonderfully throughout the film, now I know this might be filled with cliches and whatnot, but it felt genuine and heartfelt and that's right there is what matters at the end of the day.Chirs Nolan once said that films are meant to be felt not watched, this is exactly what I did with this one, absolutely breathtaking."
    },
    {
      "rating": "10",
      "text": "I love how this movie has a realist approach to such a tender subject. As well as placing the charters at a human like view! This romance movie isn't like other I've watched, its not as sappy or fairy tale like... if you get what i mean. I would rate this movie 10/10 in my option  its no to romantic or sad. But i'll warn you, YOU WILL CRY A LOT!!!"
    },
    {
      "rating": "9",
      "text": "I took my daughter to see this movie, and she loved it! It's a real tear-jerker (I rarely cry watching movies but a few times I teared up). The cast is great and I found myself really rooting for the main characters to fall in love. I usually am bored watching \"chick flicks\" but this one is interesting (you will learn a lot about their disease). I really liked it."
    },
    {
      "rating": "6",
      "text": "the film depends a lot on personal emotional, contains many clichés, the really begins between the true beginning and the middle."
    },
    {
      "rating": "9",
      "text": "It’s been awhile since a movie made me shed a tear. This film tore at my heart strings. I never had a great understanding of cystic fibrosis but this film explained it to me and showed how awful it truly can be. I couldn’t help but feel so full of emotion for both the lead characters. The film begins with a narration intro from Stella (Haley Lu Richardson) telling us about not being able to experience touch in the same way that everyday people can. We see Will (Cole Sprouse) from a back view as she says about never being able touch him and him being gone. At this moment, I knew the ending of this would be tough and boy was it. The film does a great job giving us insight to CF and what it’s like to live in a hospital. The moments between Poe (Moises Arias) and Stella are funny and give the movie some light. Their friendship is one of the bright spots of a film that makes you feel good but at the same time feeling sadness. When Stella first meets Will, she doesn’t like him but we find that he is immediately smitten. He watches her YouTube videos in his room and gets to know her and her life. Each thing he proceeds to do makes her being to fall for him as well. They make a pact for him to take his meds regularly because he is giving up and she is a control freak that doesn’t like things out of order. The chemistry between Stella and Will works on so many levels. With a film like this, it’s make our break on how this will work.  The moments of their date and not being able to touch each other is absolutely heartbreaking. I could only imagine what that would feel like. The performances from Richardson and Sprouse are so good. Richardson made my heart drop in the final moments in the film and I could not believe that I actually was crying. It takes a lot in a film to do that to me but she really tore at me. She carries this film so well. Sprouse is the same. He is so convincing in his performance and put myself in his character’s shoes and that’s what I think really got me. This film has stuck with me a day after seeing it and it still is. There is so much about this film that I love. My only gripe might be that I couldn’t believe their parents weren’t around more especially due to the extreme circumstances of what they have . Also, with them having to be six feet apart at all times, there were moments I could not help thinking why aren’t they wearing their masks in this situation and they seemed awfully close at times. It’s a really huge risk for the characters to take. All in all, that is really my only complaint but on the whole, I absolutely adore this film and love everything about it. Learning more about CF and just the pure emotion this film has, is just truly compelling and heart wrenching. The final act is one of the most emotional times I have ever felt seeing a film. Grade: A"
    },
    {
      "rating": "4",
      "text": "Now to be fair, these aren't my kind of movies. Romances. There's a few I like but not much. Especially this one."
    },
    {
      "rating": "10",
      "text": "This movie is the best movie I have ever watched and deserves a better review. Its an amazing movie and the actors are very talented. I just don't know why critics should have their opinion considered more than anyone else. What makes their opinion better than any other person who has watched this movie"
    },
    {
      "rating": "9",
      "text": "Awesome and sad movie showing us that love is not so easy and we can't choose our lover. I'm in love with that masterpiece!"
    },
    {
      "rating": "7",
      "text": "When the actors are amaziing , the scenario incredible , The movie turns into a beautiful love storyyy !"
    },
    {
      "rating": "9",
      "text": "Five feet apart is movie I loved the most in recent years . The film was released in 2019. The type of film is romantic drama . The story starts with Stella who is living in hospital because she has cystic fibrosis so her life is boring . Then she meets Will and he also has cystic fibrosis and they fall in love together but they should stay away from each other.The actors make the film really influential . It is full of emotions .And the soundtrack is amazing and sad.I recommend five feet apart especially if you are really into romantic movies this movie will be awesome for you ."
    },
    {
      "rating": "10",
      "text": "absolutely moving and beautiful and i love it in every single way possible. the perfect combination of love, beauty, and death. i watched it three times and i cried, literally sobbed, three times. it reminds us of how fragile life is, how precious and strong love is, and how lucky we ourselves are. amazingly inspirational."
    },
    {
      "rating": "9",
      "text": "I enjoyed every minute of the film.. a great story with great music.. ending was very sad but beautiful."
    }
  ],
  "recommendations": [
    "me_before_you",
    "blue_valentine",
    "about_time",
    "the_age_of_adaline",
    "her",
    "call_me_by_your_name",
    "the_notebook",
    "the_big_sick",
    "seeking_a_friend_for_the_end_of_the_world",
    "up_in_the_air",
    "love_actually",
    "the_fault_in_our_stars",
    "stand_by_me_doraemon_2",
    "cashback",
    "collateral_beauty",
    "moonrise_kingdom",
    "the_perks_of_being_a_wallflower",
    "the_florida_project",
    "closer",
    "secretary",
    "instant_family",
    "lost_in_translation",
    "the_light_between_oceans",
    "i_kill_giants",
    "into_the_wild"
  ]
}