{
  "id": 3530,
  "title": "Flag Day",
  "starring": [
    "Sean Penn",
    "Dylan Penn"
  ],
  "runtime": 108,
  "genre": [
    "Drama",
    "Thriller",
    "Crime"
  ],
  "description": "A father lives a double life as a counterfeiter, bank robber and con man in order to provide for his daughter.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zvDxMJy41RfsH35YFVDKw5mxahy.jpg",
  "categories": {
    "plot": 5.333333333333333,
    "acting": 1.8333333333333333,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Sean Penn and Dylan Penn is simply down as one of the finest real life father and daughter leading perfomances in movie i've ever seen, i'm just gonna be honest throughout the film i have no idea that Dylan Penn is Sean Penn's daughter, and both are a real life father and daughter playing a role of a real life father and daughter too, Flag Day is Dylan Penn biggest role in her movie career so far, accompanying his father, their chemistry is just so good, their both act just like in real life, it feels real, it feels natural, the story of Flag Day is fascinating yet it's heartbreaking, it's emotionaly works, the soundtrack is perfect, and probably my only complaint is just that i was kinda felt the film is a bit too long and that's about it, overall i really think Flag Day is a really good movie."
    },
    {
      "rating": "1",
      "text": "First and foremost, we here at Night Film Reviews , wants to take this time and opportunity to say thank you; thank you for your commitment to our creative endeavour, thank you for your resilience as an individual and most of all, thank you; for your love and passion of cinema and all that it encompasses. Thank you, from the bottom of our hearts . Now, without shedding anymore tears, we wanted to address an elephant in the room. Since our last review back in April 28th 2020, the world has changed a lot, and I mean...a LOT! The way the world looks has changed, the way we watch movies has changed so we figured, why not adapt and make the changes we needed to make in order for us to evolve with the times. Hence, welcome to nfreviews.com (NF does still stand for Night Film, in case you're still wondering). A new way of reading (yeah, that is still a thing), familiarizing and falling in love with film again. So, given the last year and four months of contact change and evolution, we here have decided to make our reviews more fun, more engaging and more relevant to what our readers want, without compromising who we are and our overall mandate as film critics and film enthusiasts. Hopefully, you tag along for the ride. Unfortunately, Flag Day is a lost, bewildered and nostalgically hallow film that seems to have been mis-cast for its 2021 audience. More of a feature film that could act more appropriated as a cable re-run (what's cable? Sorry millennials), Penn's sixth directing attempt seems more suited as demo reel for his two children, Penn's son Hopper Penn and daughter Dylan Penn. Sadly, Hopper has no more than five minutes worth of runtime in the feature, and falls to the waist side of his older sister Dylan, who is the real gem and reason why anyone would consider watching Flag Day in the first place. Dylan, a beautiful and talented actress, who is truly able to flex her acting chops and spread her creative wings in the film, emulating after her father's early 2000's film roles. Since becoming an actress in 2016, after a few music videos, shorts and cameos in some forgotten blockbusters, Dylan captivates audiences with her portrayal of Jennifer Vogel, a woman searching for a little love from her parents, when the going got tough. Between her love-obsessed mother Patty Vogel (Katheryn Winnick) and her \"entrepreneurial\" father John (Penn), a notorious American counterfeiter, Jennifer navigates through life without much confidence from anyone in her family. Like so many \"Based On a True Story\" films from the 90's, Flag Day really holds on hard and fast to the many similar films made before it. From its grainy/VHS type cinematography, to Eddie Vedder's Original Song's for the movie's soundtrack, to the minimal character development and storytelling, it's a wonder why any studio would want to release a film like this, despite the billions of dollars lost in revenue over the past year and a half, and despite whether or not the film was made pre-pandemic, or not. Either way, Flag Day is a whimpering and sad self gratifying family vehicle of a film that makes its references of patriotism and Americana way too seriously, if not too toxic; a film who's only saving grace is the star-in-the-making performance of Dylan Penn and a highly transparent failed attempt by Penn in what is his first directing/acting role. With small roles from some of Penn's best buds, from Josh Brolin, Eddie Marsan and Regina King, there is no bringing this half-mast failure to glory. Netflix? Amazon? Crave? Start your bids! This theatrical release will see itself on your streaming platform in no time. Oh, and welcome back cinephile!"
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)The United States seen by a loser with his family (true twice: that of the biopic and that of Penn) and filmed in indie style. Predictable, disappointing and exciting as listening to Springsteen's entire discography backwards. In his absence there is the heir, Eddie Vedder soloist."
    },
    {
      "rating": "6",
      "text": "There is no doubt Dylan Penn has a future as an actress.And nobody plays \"ner-do-wells\" as good as Sean Penn.But Flag Day was a tough movie to like.I get it---it's based on a real people, and I'm sad that Dylan's character had to endure the crushing disappointment of her father played by Sean Penn, but this movie didn't move me liked I hoped it would."
    }
  ],
  "recommendations": [
    "a_beautiful_day_in_the_neighborhood",
    "joy",
    "collateral_beauty",
    "walk_the_line",
    "cinderella_man",
    "the_glass_castle",
    "blue_jasmine",
    "gifted",
    "lovelace",
    "the_intern",
    "blow",
    "revolutionary_road",
    "lincoln",
    "still_alice",
    "manchester_by_the_sea",
    "the_secret_life_of_walter_mitty",
    "brokeback_mountain",
    "adore",
    "chef",
    "marriage_story",
    "forrest_gump",
    "king_richard",
    "the_judge",
    "a_bronx_tale",
    "morning_glory"
  ]
}