{
  "id": 4611,
  "title": "Flashback",
  "starring": [
    "Dylan O'Brien",
    "Hannah Gross"
  ],
  "runtime": 97,
  "genre": [
    "Thriller"
  ],
  "description": "Frederick Fitzell is living his best life—until he starts having horrific visions of Cindy, a girl who vanished in high school. After reaching out to old friends with whom he used to take a mystery drug called Mercury, Fredrick realizes the only way to stop the visions lies deep within his own memories, so he embarks on a terrifying mental odyssey to learn the truth.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/z8DPeAno9IT47gCQBrKqJ9czUyI.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 7.5,
    "ending": 6.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "This movie hits the ground running and expects that you are ready without questions during its hour and thirty six minute runtime. The problem is I have nothing but questions after watching it. It’s atmosphere and filming aesthetic are rich and compelling, but the meandering storytelling isn’t. I won’t spoil it, there is an interesting and fresh take on what “time” is that I found momentarily compelling here. My biggest problem with the movie is it’s one that try’s hard at times to hit that sweet spot where the dialogue has weight as if it’s being carved in stone while it’s being delivered on screen, but the devices used to move the plot forward come off as cliché and obvious. You also don’t really have time to build a relationship with any of the characters, but the movie is always leaning into the absolutely creepy vibe they achieved and it put me on edge the entire time I was watching. I’m not sure that I cared that I was missing character development until after I was done viewing it. You hardly get much backstory for the lead yet you are thrown in different situations that don’t always connect to the main thrust of the story that you are guided through. All of that said I still enjoyed it. It got a very big reaction from me at the end that I didn’t expect. The melancholy score really helped with that. The movie is very nicely put together on the whole, beautiful even at certain points to look at. I don’t know who I’d recommend this for as I don’t think I’ll ever watch it again, but if you want to be mildly chilled without any real scares I’d check this out."
    },
    {
      "rating": "10",
      "text": "Flashback is everything I love about film. It's thrilling, it has suspense, creativity, artful and coherent direction, and it's filled to the brim with desire and memory. I have no idea what the hell people are smoking that rate this low, but it's not the right stuff. Challenging art in this time always seems to get the short stick, but in the end who even cares anymore? To hell with them. This is beautiful and stunning in every way."
    },
    {
      "rating": "5",
      "text": "This will probably sound a bit strange, but even in the face of things the film does well, and that are merely interesting, Flashback never seems interested in breaking the barrier of the common, and doesn't benefit from a good theme, so it ends up completely stagnant after a while.I did not find it dreadful or anything like that, but there's nothing to highlight either."
    },
    {
      "rating": "1",
      "text": "it isnt really good... doesnt make much sense and its really not a movie i recommend"
    },
    {
      "rating": "10",
      "text": "First, we must relate to the story. If we can't relate, in this humble reviewer's opinion, then our critical observation is another experience of another's life experiencing other experiences of other lives. Critically, presentation by the film maker sets this story towards an explosion of reality taken across mind illusions and tossed back again into some kind of reality. Presentation of this kind of experience resonated with my own experiences by what and how our mind is capable of folding upon itself in nightmarish fashion.I would have found it difficult to view this film in light of my past mind numbing experiences if it were not for the Spirit of the Living God to ground all such experiences as earthly and having not the power given by our creator and peace of mind promised by our Lord Christ.It was not my intent to proselytize my belief but only to give a counter reality observation to a work of fiction mirroring reality felt by others.Character and acting wasn't fully developed but as I observed previously presentation brought an experience for my relatedness into a creation of story too powerful to ignore."
    }
  ],
  "recommendations": [
    "donnie_darko",
    "the_tree_of_life",
    "a_ghost_story",
    "searching",
    "the_green_knight",
    "under_the_skin",
    "the_fountain",
    "annihilation",
    "high_life",
    "anon",
    "cloud_atlas",
    "antichrist",
    "coherence",
    "arrival",
    "ex_machina",
    "the_killing_of_a_sacred_deer",
    "vivarium",
    "the_lobster",
    "her",
    "incendies",
    "the_road",
    "titane",
    "enemy",
    "crash",
    "paprika"
  ]
}