{
  "id": 4800,
  "title": "Flatliners",
  "starring": [
    "Kiefer Sutherland",
    "Julia Roberts"
  ],
  "runtime": 115,
  "genre": [
    "Drama",
    "Science Fiction",
    "Horror"
  ],
  "description": "Five medical students want to find out if there is life after death. They plan to stop one of their hearts for a few seconds, thus simulating death, and then bring the person back to life.",
  "releaseYear": "1990",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wda3j7p7YHXKpFIlSzoTCtP7myF.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 7.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 7.333333333333333,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Flatliners is a classic thriller with an unusual plot. Five medical students want to flatline briefly to see if there is life beyond death. 4 of them flatline but they bring back their sins and begin having visions. The acting and effects are outstanding. This is one of the best horror movies of the last three decades."
    },
    {
      "rating": "9",
      "text": "Flatliners (1990) directed by Joel Schumacher who's made a few good films has an allstar cast such as Julia Roberts (Sleeping with the Enemy), Kevin Bacon (Hollow Man),William Baldwin (Sliver), Kiefer Sutherland (The Lost Boys, Mirrors) and Oliver Platt (Indecent Proposal)....  FLATLINERS is a film about five medical students who take part in seeing if there's anything beyond death or if they can die or be brought back or being in the state of a vegetable and see who can handle it the longest and survive or something stupid. It's a silly film and it could of been better but Flatliners does deliver in terms of suspense and it grabs holds of the viewer and keeps them in it's grip until the credits roll. It's not a bad film and excellent performances especially by Julia Roberts, Kevin Bacon and Kiefer Sutherland.. Good film however I'd avoid the recent remake that came out recently as it looks crap and remakes never work if hardly ever."
    },
    {
      "rating": "8",
      "text": "As underappreciated as this movie gets, Flatliners is the example of what this movie really is. There's a new film of Flatliners has come out four months ago and it's not well received by audience giving it bad reviews thinking that it's god-awful. Not to say that the original is overlooked it's because it has flaws that are noticeable which is something I know about. I would that the original is much better than the remake. I know that the original has flaws that I didn't know of but that doesn't mean the movie is bad, it's just overlooked by everyone. There's some good cast in this and that's including Kiefer Sutherland. He plays the leader of the vampire's from The Lost Boys directed by Joel Schumacher. In this one, he plays a medical student named Nelson Wright and he has four classmates. There's Rachel Manus played by Julia Roberts, Dave Labraccio played by Kevin Bacon, Joey Hurley played by Alec Baldwin's brother, William Baldwin and Randy Steckle played by Oliver Platt. They're both responsible for the bad things they did in the past. Nelson Wright is responsible for the death of the kid called Billy Mahoney cause he was bullying him and after years of Billy's death Nelson has nightmares about Billy beaten him up. Rachel Manus feels responsible for her father's death and feels horrible about it. David Labraccio feels bad about making fun of a little girl called Winnie Hicks. Joey Hurley is haunted by the video tapes of women sleeping with him afraid that his girlfriend might leave him. And ask for Randy Steckle, he doesn't do anything at all. All he does is doing what he does best no matter what so ever. Now all they gotta do is go to the medical bed to face their past of what they did. The cinematography is great and it's so similar to The Lost Boys. I mean when you look at it, it shows people wearing Halloween costumes dancing and partying, looking at the beautiful views from the islands and yes, it's directed by Joel Schumacher. He makes cinematography look like 80's style. Billy Mahoney who is bullied by Nelson years ago bullies Nelson throughout the movie is the scenes where I can't stop laughing because of his reactions. Like the scene where Billy spits on Nelson's face and he screams and funny for me though he has nightmares like I said in the beginning. There's one full scene that I legitimately remember is the scene where Winnie Hicks calling David names on the train. Once again looking back at The 100 Greatest Insults in Movies on YouTube and whilst I'm watching Flatliners now and remember the scene I said \"Oh God, I know this.\" That would be quite hilarious. I also finding it funny that five characters had to say \"1,000, 2,000, 3,000, 4,000, 5,000, breathe.\" multiple times to make that someone is alive or dead. Flatliners is not only one of Joel Schumacher's overlooked films but some of his most underappreciated. It may be one of the weaker films but I can't help but getting thrilled by this. Joel directed some of his memorable films like The Lost Boys, Falling Down, Phone Booth which I haven't seen these two yet and The Phantom of the Opera. If you are a fan of Joel Schumacher like I do, maybe check this one out. If you are a huge fan of The Lost Boys like me then I would suggest watching these two movies starring Kiefer Sutherland with your friends and have a good time and get thrilled. Now I know the remake is been badly executed but I haven't seen it yet and I know that Kiefer Sutherland is in it. If you're not getting bored watching The Lost Boys and Flatliners then I would say that every day is not a good day to die."
    },
    {
      "rating": "6",
      "text": "The talented cast and interesting premise lift this movie up a lot more than what it would have been. It kind of drags at times but it's watchable."
    },
    {
      "rating": "5",
      "text": "The idea of what is after death looked original and had a lot to say in favor, but it fails to define which genre of films it corresponds to because it does not cause anxiety in the viewer, and in the last act he falls flat on his face with a very cheesy ending. In the defense of it, of the filmography of J. Schumacher, it is not as terrible as those that would do long after Batman (1995 and 1997)."
    },
    {
      "rating": "4",
      "text": "Flatliners, the movie's got an interesting plot, which is about these five medical students who are wanting to learn what the afterlife is about.The movie's got a great idea and it's even got some really good scenes, which show us what it's like in the afterlife or trying to test it out.Also, the acting isn't amazing throughout this movie and the same goes for the dialogue, which feels like it's getting read from a script on the set.The action scenes throughout this movie are honestly hilariously stupid because they try too hard to be some what scary and it doesn't work for them.Overall, it's got some really good moments but in my opinion it lacks good acting and pretty much the same goes for the dialogue."
    },
    {
      "rating": "6",
      "text": "A fantastic concept conveyed well by the talented cast. Sadly the set designs and bizzare lighting choices alongside some odd direction and editing choices firmly age the material and detract from an otherwise compelling watch. The screenplay is excellent and holds up well."
    }
  ]
}