{
  "id": 4303,
  "title": "Flight of the Phoenix",
  "starring": [
    "Dennis Quaid",
    "Tyrese Gibson"
  ],
  "runtime": 113,
  "genre": [
    "Action",
    "Adventure",
    "Drama",
    "Thriller"
  ],
  "description": "When an oil rig in the Gobi Desert of Mongolia proves unproductive, an aircraft crew are sent to shut the operation down and fly them out. On the flight out over the desert on the way to Beijing, Capt. Frank Towns and co-pilot A.J. are unable to keep their cargo plane, a C-119 Flying Boxcar, in the air when a violent sandstorm strikes. Crash-landing in a remote uncharted part of the desert, the two pilots and their passengers -- a crew of oil workers and a drifter -- must work together to survive by rebuilding the aircraft. Soon, low supplies and a band of merciless smugglers add even greater urgency to their task.",
  "releaseYear": "2004",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pcj6unMsKCw0ogWFlUXmbc9gKap.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 7.222222222222222,
    "ending": 7.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Stylishly imperfected with a mess of catagorious amount of flaws deeply researched into. With all its strength, its a fun movie from beginning to end."
    },
    {
      "rating": "9",
      "text": "An easily enjoyable remake that wasn't as good as the first, but it still manages to rise as it's own and maintains a sense of drama and suspense that draws you into it"
    },
    {
      "rating": "7",
      "text": "It had good acting performances, an interesting story, great acting performances and it was entertaining. As a remake, it was far from being a bad movie."
    },
    {
      "rating": "5",
      "text": "\"The Flight of the Phoenix\" , was a little interesting , so better to be the plot has been good, but do not rule out the reluctance of the movie, but it is the fact."
    },
    {
      "rating": "7",
      "text": "Fun movie with an unusual premise. I appreciated that the sole female character was not simply included to give an opportunity for rape threats (of which there are none in the film), but was actually a member of the group."
    },
    {
      "rating": "7",
      "text": "This is a tense drama, with an interesting variety of characters, including a Scottish and an English one. There's a plot twist uncovered towards the end of the movie which really puts a new spin on the story, putting alot into question. There are some pretty good landscape shots/cinematography present, again mainly but not entirely at the end.This movie is a bit like the TV show Lost or the novel Lord of the Flies, with conflicts arising between different characters who decide to label themselves as 'top dog' and with the action of others potentially endangering the whole group. There's definitely a conflict of personality, some characters seeming to be happy to pitch in and others much less so.As a movie, I was quite impressed with it as I hadn't expected much from it to be totally honest, it seemed to me to be a pretty bog standard action/drama movie but I felt quite engrossed by the story and seeing what happened with the threat of nomads sabotaging their only real hope to get to safety.As much as this is a tense movie, there are some lighter scenes, with some funny dialogue inbetween. I felt that overall this was quite a good movie, though not without its flaws, such as the fact that it seemed a bit unlikely that they'd happen to have everything needed to attempt to re-build the plane and that someone knew (or claimed) to know enough expertise to guide them to do that. Also the ending, well I don't want to give it away too much as it'd be wrong to say that everyone lived happily after but equally, it was perhaps a bit too Hollywood, particularly the way it was driven home via the credits. The story isn't as simple as you may think but the ending will (or has) probably divide opinion, I think its fair to say.I thought that the performances were all good and I also specifically noticed the soundtrack in this movie, with one or two songs really adding to the tension as they played during certain scenes. In that sense, its quite a well thought out movie. I feel like I can't really review this movie without mentioning that it is indeed based on the 1965 movie of the same name and it seems to divide opinion being very similar to the original - perhaps I enjoyed it more as I don't remember seeing the original, I don't know.Yes, I'd recommend this movie as it turned out to be better than I'd first expected. The story doesn't drag too much, the variety of characters are good, its quite tense and thrilling in places, although I couldn't help but question how believable it was that they had all the right equipment/resources to make the new airplane - for instance the rigging and so on...thus the plot is slightly flawed but otherwise as an entertaining movie, its worth a watch in my opinion."
    }
  ],
  "recommendations": [
    "what_happened_to_monday",
    "the_maze_runner",
    "now_you_see_me",
    "glass",
    "the_good_liar",
    "the_equalizer_2",
    "the_accountant",
    "maze_runner_the_scorch_trials",
    "unknown",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "i_am_mother",
    "army_of_thieves",
    "gone_girl",
    "man_on_a_ledge",
    "sicario_day_of_the_soldado",
    "pirates_of_the_caribbean_on_stranger_tides",
    "project_power",
    "tenet",
    "triple_frontier",
    "captive_state",
    "shutter_island",
    "three_kings",
    "the_craft_legacy",
    "the_bank_job",
    "the_number_23"
  ]
}