{
  "id": 3110,
  "title": "Flight",
  "starring": [
    "Denzel Washington",
    "Don Cheadle"
  ],
  "runtime": 138,
  "genre": [
    "Drama"
  ],
  "description": "Commercial airline pilot Whip Whitaker has a problem with drugs and alcohol, though so far he's managed to complete his flights safely. His luck runs out when a disastrous mechanical malfunction sends his plane hurtling toward the ground. Whip pulls off a miraculous crash-landing that results in only six lives lost. Shaken to the core, Whip vows to get sober -- but when the crash investigation exposes his addiction, he finds himself in an even worse situation.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1AjXgBM2lkpG3FLQO0f6AK3Bi1e.jpg",
  "categories": {
    "plot": 6.407407407407407,
    "acting": 7.196969696969697,
    "ending": 6.9,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 9.5,
    "action": 8.75
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Flight is a very interesting movie because of the plot that presents; a pilot landed a plane that was falling in flames and save most of the people on it, but a blood test indicated that he was with a considerable percentage of alcohol in his blood. In this point the protagonist start living in a big contradiction, because he is a national hero, but also an alcoholic. That is why the story moves between two worlds, in one he is a questioned pilot trying to defend his image; and in the other one he is immerse in drugs and liquor failing to acknowledge his problem. This theme of a protagonist facing to worlds is recurrent in the filmography of Robert Zemeckis, for example past versus future in Back to the Future; expectations about the world versus real world in Forrest Gump; and life in the island versus life in the civilization in Cast Away. In the same way of these mentioned pictures, the protagonist of Flight will enter in a rediscovery of himself, to finally become a new person, with no possibilities of returning to what he was before. Despite that the film is slow, Denzel Washington is great and Zemeckis did it again."
    },
    {
      "rating": "7",
      "text": "This movie is okay. Since Robert Zemekis directed this, I thought that this would become an instant classic. It's only okay at best. Washington and Goodman definitely redeem the movie a bit since their acting is so great. Unfortunately, it wasn't even to put this up there with Forest Gump or The Green Mile."
    },
    {
      "rating": "7",
      "text": "Flight is an interesting and well acted movie about a man battling with alcoholism. The movie suffers a little by being overlong but overall it's a decent cautionary tale."
    },
    {
      "rating": "4",
      "text": "My advice would be to watch the first half of this film, which is generally original and captivating. When it gets about an hour in, you will begin to notice some overt cliche thrown in casually. By the end of the film, you will walk out feeling appalled that you have once again been tricked into watching a predictable and non-sensical hollywood plotline tailored for the un-thinking audience. Damn you Hollywood producers for relying on formula and ill conceived moral banality to ruin yet another film that had great potential."
    },
    {
      "rating": "6",
      "text": "Washington and his supporting cast are enjoyable and the first 40 mins are good (up until after the crash) and then it just sorts of level off. It gets a little interesting at parts through out but never really gets to the potential that it was capable of reaching. Sort of a disappointment really because Flight easily could have been the best drama of the year."
    },
    {
      "rating": "6",
      "text": "The movie's synopsis is basic, and so is the film. After the first half an hour, everything slows right down and it turns into more of an insight into the mind of an alcoholic. It's a very long movie for a story that's been told many times, with just a few alterations. Towards the end, we see what a great actor Denzel is and we come to a satifying conclusion. This is certainly a fascinating film to watch that will have you pondering over whether we should criminalise someone for drinking on the job or whether they deserve a second chance depending on the situation. But it's hardly a movie that would make my all time favourites list."
    },
    {
      "rating": "7",
      "text": "I watched this movie because of Denzel Washington, and if only in his case, the reviews are true.\rWashington does a stellar job throughout the movie, and as is the case with most if not all movies he stars in, he practically makes the movie. The acting itself is actually quite good across the board, as is the writing, even if it does feel a bit stretched at times. I do hold one substantial complaint, however, that being the exception to both of the commendations above. In one scene, when Denzel Washington's character Whip goes to see his co pilot in the hospital, the writing and acting take an expected, yet nevertheless disappointing turn. Here, the already foreshadowed \"crazy Christians\" scene plays out, and the director attempts no subtlety. As both husband and wife stare with fury at Whip, they switch suddenly, like they just escaped an asylum, from anger to the resolute conviction of madmen as they state (paraphrasing) \"the plane was pre-ordained to crash\" and that they \"prayed for it\". All this is said by a slightly lowered camera with a light focused on a gaudy crucifix hanging above his bed. All as his wife, with a catatonic face chants \"praise Jesus!\" in a tone akin to a cultist. Now, I understand that there are many people who view life many other ways, and yes, I do believe we should tolerate all religions. However, I fail to see how making Christians look crazy is tolerant. Few if any prolific Hollywood directors would risk putting a scene featuring crazy Buddhists or crazy Zoroastrians, crazy.. pretty much any other religion in their movie, for fear of rightful outrage, and quite frankly, such a biased, one sided point of view not only shows either hatred or ignorance, but also runs a high risk of taking the viewer out of the movie, and placing them back in their seat scratching their head."
    },
    {
      "rating": "10",
      "text": "Flight is an incredibly underrated film that is rich with character drama. While the movie was marketed as a disaster flick (an enormous disservice) Flight is actually the harrowing tale of one man's struggle with alcoholism. Flight is a force to be reckoned with, and it is one of Denzel Washington's finest performances, up there with Training Day and Fences. Denzel fans need to check this out, as the man has some serious acting chops."
    },
    {
      "rating": "8",
      "text": "A very good drama about facing who we are,  taking responsibility, and change to the right direction. Mr. Denzel Washington's acting was great. A little bit slow, but worth watching im my opinion."
    },
    {
      "rating": "8",
      "text": "A high quality drama with a great story that is a good break from the action flicks that dominate the market nowadays. Scenes that will be funny for some may be all too real for others. Denzel Washington does a fantastic job as usual. Definitely recommend."
    },
    {
      "rating": "8",
      "text": "Denzel's rock-solid here (yeah, yeah, what else is new).  His performance, the story line, and the subtle message will be appreciated even more for those who have battled any addiction problems of their own.  Would have reached a 9 in my book had Zemekis not chosen to portray evangelical Christians in a short scene I found insulting and laughably stereotypical."
    },
    {
      "rating": "10",
      "text": "As the movie begins you think you know where it is headed, but you (the audience member ) only really have a general sense of direction and you quickly learn that this screen play and director Robert Zemeckis have a much more involved journey planned.  This film exfoliates like an onion to reveal much more of a surprise than  you could have anticipated.  For once the trailer isn't the best part and it doesn't reveal \"all of the good parts.\" There are a number of great performances by both known veteran actors like Denzel Washington and a bunch of lesser known actors as well.  This movie is packed  with twist for certain, but they aren't the kind of supernatural twist that are typically overloaded with a generous helping of hyperbole, not this movie is packed with realistic moments that people will be able to identify with.   There will most certainly be some Oscar nominations from this film, including perhaps best screen play, best supporting actor and may be best director.  Go see this film!"
    },
    {
      "rating": "6",
      "text": "Denzel Washington will probably be nominated for his performance in"
    },
    {
      "rating": "6",
      "text": "This movie should be called The Bottle Jockey or something that more accurately denotes its central theme i.e, an alcoholic airline captain having is coming to Jesus moment. The movie is 140 minutes long:  10 minutes of setup; 15 minutes or so of pretty good flying scenes-followed by 110 minutes of watching Denzel Washington"
    },
    {
      "rating": "9",
      "text": "Flight... Ok, the movie is very interesting, have a trama that sounds interesting, the screenplay is really awesome, and the performance of Washington is really amazing. The problem with Flight, is that have some boring moments. But the movie is really fantastic."
    },
    {
      "rating": "7",
      "text": "Don't expect this movie to be about pilots, flying or the airline industry.  It is a movie about an alcoholic, alcoholism and substance abuse.  It's about the ensuing denial, effects on career, the enablers and the effect on friends and loved ones.  That being said.....it is a good movie, and should be seen by all who have someone close to the affected by substance abuse."
    },
    {
      "rating": "3",
      "text": "This film is so plagued with technical errors somebody should be accountable. They discharge the fire extinguishers yet the engines keep running. Every jet pilot in the world knows if you pull the fire handle it cuts the fuel and the engine stops!"
    },
    {
      "rating": "5",
      "text": "From the previews this looks like the nail-biting experience of a plane crash. That's pretty true"
    },
    {
      "rating": "2",
      "text": "Flight had a potential to be a compelling psychological and moral drama but squandered all that it built up in the last 30 minutes by pandering to the worst Hollywood stereotypes of preachy sentimental commercialism.  I wanted to throw up when Denzel sanctimoniously decides to go all repentant at the hearing, and then makes his schmaltzy  confession to fellow inmates. When his son (with whom he established no relationship in the film) showed with a school assignment, I was ready to strangle Zemeckis, Denzel,  and especially the scriptwriter for the most saccharine sappy weepy sell out. I really don't know how any intelligent viewer could have related to that concluding half hour of the film and I can't recall any recent film that undermined itself so irredeemably. What a waste of money and talent, especially Denzel's. The recovering drug junkie's role was woefully underwritten, and only Goodman in his walk-on role can safely dissociate himself from the rest of the film. The bright spots were the secondary characters, especially  the black stewardess who should have had more screen time and  the dying cancer guy in the hospital.  When I say the film had potential, just imagine a complex, ambiguous film where  Denzel lies at the hearing (without the psychologically and dramatically ridiculous drunken binge the night before), the corporations are punished (as they should for unsafe aircrafts), Denzel retires with a nice severance package that gives him time to first realize that without cocaine he would have not saved the plane and then brings him out of the cycle of self-abuse. He  moves to Jamaica with his white girlfriend. She does photography, he just chills, and in the last scene, we see them listening to raggae and smoking weed, a great pitch for legalizing marijuana."
    },
    {
      "rating": "2",
      "text": "See another movie. Don't waste your time here. It is a drama about a drunk.\r This movie is no more about a \"Flight\" than the movie \"Animal House\" is about animals. The 1st 30 minutes or so are compelling. A pilot, presumably a party animal, pilots a jet with mechanical problems to an unlikely landing, saving countless lives. However, that is only the special effects lead-in to the latter half of the movie - almost 90 minutes, and the TRUE plot - a despicable journey with an alcoholic and his un-entertaining habits, drug use, drinking to excess, lies, more lies, and boring conversations that are at times entirely stereotypical. Denzel Washington does NOT create a new character for himself here. Don Cheadle plays the exact same character he plays in every other movie - the stoic. The movie drags on endlessly and becomes almost unbearable at times. See another movie. Don't waste your time here. It is a drama about a drunk."
    },
    {
      "rating": "8",
      "text": "An excellent movie with excitement, drama, and good story line.  Denzel Washington is sure to receive an Academy nomination.  The picture trailer only hints at the true story."
    },
    {
      "rating": "5",
      "text": "Luckily there is a great nude scene. Otherwise a very bland film about not much. Tries to be dark and troubling, but comes off as shallow and uninteresting. Nudity is worth a Netflix rental, but not full price at the theater. If I were Denzel I'd fire my agent."
    },
    {
      "rating": "2",
      "text": "I went to a lot of trouble to register so I could write a review for this movie. Although the term 'Movie' implies 'Moving Picture' This one moves along quite well for 12 ish minutes, And then staying awake becomes problematic.  Without spoiling it, I can tell you it turns to **** BORING **** YOU WOULDNT BELIEVE HOW NOTHING HAPPENS. I was waiting for ghosts, secret agents,men in black, hell, even ALIENS! SOMETHING!? It Reels you in and you think; 50 minutes in ;Any minute now this film is gonna peel out tyres smoking, and;. .  NOTHING!!  Just a boring innacurate like my spelling take on alcoholism, and some directionless  mumbo jumbo .\rAs we say on the other side of the pond, its complete Pants! ( or utter B@LL*X after 9.45 p.m.)\rI have two nephews not yet ten yrs old and they would nod off to this.  ITS\rRUBBISH !\rYAWNN"
    },
    {
      "rating": "4",
      "text": "The professional critics were far too generous to this film. Sure, Denzel does a nice job portraying the drunk pilot, but his story is simply tedious. I wasn't in the mood to watch a saga of an alcoholic pilot in denial.  It's not an ambitious story in the least. Even John Goodman's character is wasted.  He's terrific in his first scene, but then he becomes a caricature of himself in the coke sequence. The actors who save the film are Kelly Reilly (as Nicole) and Nadine Velazquez (from the League)."
    },
    {
      "rating": "9",
      "text": "This movie is allot better than the trailer. I love the story, big ass's, blow, and booze. GO watch it and you will not be disappointed. Denzel kicks ass."
    },
    {
      "rating": "10",
      "text": "This is a brilliant movie.   I have read many good reviews by my fellow moviegoers so I won't share the thousands of reasons why this film is great but the kicker for me was Whip's scene while offering testimony at the decisive NTSB hearing. Most of us have a sense of how corporate and political machines work and we expect cover-ups as an almost routine way of doing business.  Here's the spoiler: instead of taking the route laid out for him by his very bright lawyer, Whip graduates from villein to hero by telling them the unvarnished truth, for which he pays a very steep price but also finds a very a credible redemption. Denzel Washington, a screen idol of heroic proportions, strips away this facade to reveal a character with huge, even fatal flaws in a fearless performance.  The work of John Gatins and Robert Zemeckis in this film is in the realm of pure genius.  If you want to learn something about yourself and a good deal more about the human condition, don't miss this film."
    },
    {
      "rating": "3",
      "text": "An art film about drinking pretending to be a Hollywood film about an airplane crash. If you want an art film about being self destructive and using drinking as the vehicle and being able to guess the ending just after the crash than this is your film. It is filmmaking 101."
    },
    {
      "rating": "1",
      "text": "Middle class pap, trite, and hackneyed.  Basically about one reprehensible guy who struggles with his addictions.  If you would like to see Denzel drinking, smoking, and snorting without any larger message then this is the movie for you.  Basically a movie devoid of meaning except for a nice, safe upbeat end which, in my mind, is the hallmark of something below even a B-movie."
    },
    {
      "rating": "6",
      "text": "The film is completely carried by Washington. However in a way it is also ruined by him. His amazing performance exposes the rest if the film as lackluster, and the 2 hour 18 minute run time felt very unnecessary. I can think of two plot points that had no effect on the story. Still engaging and worth a DVD viewing due to Denzel."
    },
    {
      "rating": "10",
      "text": "Flight is truly something to marvel. Denzel Washington is a hero here, not because his character in the movie landed a plane and was called a hero, but because his performance was a true act of heroism. Bravo."
    },
    {
      "rating": "8",
      "text": "Flight is, at its core, the story of a man struggling with alcoholism and the devastating course of events that have to play out in order for him to finally face the truth about himself.  At the same time, it forces us to wrestle with our own notions of heroism as we must choose whether to root for or condemn the deeply flawed protagonist.  The film wisely lets us draw our own conclusions resulting in a sobering take on addiction and redemption fueled by Washington's spot on performance."
    },
    {
      "rating": "8",
      "text": "I wanted to take a shower after this movie.  The snorting, shooting up, drinking, more drinking, and general drug abuse is hard to watch.  The acting and writing throughout is excellent, with especially noteworthy cameos from John Goodman as the drug pusher and James Badge Dale as a cancer patient.  Denzel is solid throughout as he always is.  The special effects (the plane crash) looked real and was intense.  Overall I thought the movie was a little predictable, and was such a downer that it loses the repeatability factor - I have no desire to ever see it again."
    },
    {
      "rating": "10",
      "text": "Didn't expect this movie to be to me outstanding. Some good funny humor. But kept it serious. Great story telling. Great direction. Great acting. Almost a three hour movie. But very much worth the watch."
    },
    {
      "rating": "8",
      "text": "Perhaps Flight is a little too long and may have one too many layers, but this does not stop it from being a very enjoyable experience. The film commences with the best crash sequence that I have seen and ends with one of the best performances of the year with Denzel Washington acting up a storm."
    },
    {
      "rating": "8",
      "text": "This is probably the best performance of Washington's career. The story of his redemption is trite, but he plays it very well. The flight scenes are exciting. His portrayal of an alcoholic is realistic, and the ending is expected. He will surely be up for a best actor award."
    },
    {
      "rating": "6",
      "text": "Flight's first 30 minutes is riveting with the flight sequence but then levels off into some addiction drama.The movie soars in the beginning but begins to flat line as the movie progresses and eventually falls into a Hollywood style ending."
    },
    {
      "rating": "10",
      "text": "This is a brilliantly written, directed, and acted film.  I do feel sorry for people who wanted a plane crash movie and didn't get it.  This is a film of depth and moral complexity for which there are no easy answers.  Zemeckis direection is flawless--there's a stunning photographic moment late that is not a special effect.  Denzel Washington tops all his previous work, and John Goodman and Melissa Leo are huge in small roles."
    },
    {
      "rating": "4",
      "text": "As long as you go into it accepting that airplanes and piloting are a plot devise, and you want a tale of alcoholism and the struggle of addiction as the actual theme then it may be enjoyable. The trailer is more entertaining than the movie."
    },
    {
      "rating": "6",
      "text": "A well acted, well directed movie with quite a few story problems. As usual Denzel chews up the screen and is worth the price of admission alone. The crash at the beginning of the film is fantastically shot, super intense, and jarring. Most of the story problems come from the relationships or lack there of throughout the movie. We are given little back story  in some cases, while new relationships are severely under developed and quite unbelievable. So while I do feel like we become invested in our main character and are invested in seeing him change his life, the emotional payoff is a little underwhelming because we care little if any about anyone else in this film. Another liked it didn't love it Denzel film to add to a pretty long list."
    },
    {
      "rating": "10",
      "text": "I think this is Denzel's best performance in the movie Flight. I think he way out performed the character in the movie Training day, which he won the Academy award for a outstanding performance. I think this movie teaches us all a lesson in the consequences of being an alcoholic and substance abuse is a major problem in this country. I think everyone should get the message the movie was trying to express. What really got to me is he had saved so many lives on the defective plane, but there was alcohol and cocaine in his system, but he landed safely on ground with the exception of a few lives The fact he saved so many lives on board the plane, and at the end of the movie he still got sent to prison, for his drug and alcohol abuse. This movie is very serious, but still have humorous parts to laugh at. I also think this is Don C's best performance for supporting, the leading character, Denzel, a still definitely handsome and tall man, who dose not definitely look nowhere in his fifties. Denzel will never give up doing the movies, I love the most. Bravo performance, bravo."
    },
    {
      "rating": "9",
      "text": "Flight may not be liked by many but let me tell you why I like this film. Denzel Washington gives one of his best performances, he is the sole reason why I decided to watch this film in the first place and I don't regret it at all. The direction is satisfying enough to keep the viewers interested in the film i.e. the first 30 minutes of the film show the plane crash which is exceptional, I have never seen something like this before, it was too terrifying and kept me on the edge of my seat throughout the sequence. After those 30 minutes, the 2 hour (almost) drama begins which passes by so quickly, you don't even realize (only if you are a fan of slow-paced drama films). And then, finally the ending, which is downright excellent, I pretty much hoped for an ending like this because without it, the film's message would not have been that clear. Washington's character Whip Whitaker finally accepts that he is a free man, he has no more lies to tell, he doesn't feel any burden or he doesn't have to carry all this throughout his remaining life.\rWhitaker is an unlikeable person, he is an alcoholic and he can't get enough of the booze and the cocaine but there comes a time when he realizes that lying about it would only make it worse since he's been lying about everything his whole life, not even his wife and his kid like him. Flight has an absolute message for every viewer: the message of acceptance, the message of \"stop lying\" and start telling what you really feel. What do you really want to say. Despite all these downsides, my sympathies were always with Whitaker because he really saved those people even when he was high and maybe that factor actually played its part by making him think of rolling the plane into an inverted position, who knows?\rA character-driven drama film with a phenomenal performance by Washington, strong supporting cast, great screenplay by John Gatins, and a wonderful direction by Robert Zemeckis who previously directed the two important films; an Academy award winning 1994 film Forrest Gump and a 2000 film Cast Away, both of which are excellent. Flight does not offer any action sequences or edgy moments after the plane crash but what it does offer is Washnigton's performance, the clever dialogues, and his characterization and depicts wonderfully how he's changed throughout the film. And it leaves you in a position where it's upto you that how do you want to think of his character, a hero or a criminal? A hero for saving 96 out of 102 people on the plane or a criminal for being so negligent and putting 102 people's lives at risk. You get to change your opinions about observing Whitaker's nature and his character throughout the story because of the things he do, his crazy drug addiction and finally, the decisions he make. This film may not be a strong Best Picture Oscar contender but it easily deserves a Best Actor nod for Washington's powerful performance."
    },
    {
      "rating": "10",
      "text": "This movie held my interest throughout.  The opening action scene is realistic.  Bits of comic relief are welcome. Denzel Washington's performance is solid and believable as expected, as are all the performances.  Overall this movie was entertaining and made for a nice evening's escape."
    },
    {
      "rating": "10",
      "text": "Flight was very good.  Denzel was outstanding at portraying this morally confused pilot.  John Goodman's character was so in control and entertaining.  Everyone on the screen were spot on to make this film terrific.  It makes you think about the choices you make everyday!"
    },
    {
      "rating": "5",
      "text": "Worth seeing for Denzel's performance and the opening 30 minutes but the rest of the film, aside from a few tense moments, falls flat. Good direction, great acting but the pace of the film left alot to be desired. Made the same point with the main character over and over again."
    },
    {
      "rating": "10",
      "text": "All I can say is that this is a great movie that EVERYONE should see. It challenges drug dependency, alcoholism, the definition of heroism, and personal accountability/honor all in a short 2 hour span. This was a great investment of my time, attention, and money! GO SEE IT"
    },
    {
      "rating": "5",
      "text": "I went into this movie knowing full well what I was getting myself into, a character study on alcoholism with a flashy planecrash to draw in the public audience. The movie had potential, but it felt like a movie Columbia Pictures made just to fill the seats. Even as someone with a drinking problem, I couldn't identify or empathize with the protagonist. A drama without the script and emotions to back it up. But that crash was pretty sweet..."
    },
    {
      "rating": "5",
      "text": "In the previews we've all seen that Washington makes a miraculous flight recovery to save his doomed airplane. The problem for me with this film is that it continues to tell me over and over again and display situations redundantly that demonstrate that our hero has a problem. OK; I get it. Once you do get it, there's not a lot more to this film. Washington, for all of his abilites, cannot overcome his personal problems and in this movie, he has \"so many chances\". However, Washington's performance is worthy."
    },
    {
      "rating": "2",
      "text": "Though a huge fan of Denzel Washington, I simply never cared about this character or the story in which he found himself. Though there are many technically brilliant things about the film (the plane crash in the beginning is stunning) and the actors and the director fully deliver, but the story they are telling ultimately, does not have a point large enough to justify the darkness of tone. Hope to see them all again in something more worthy of their efforts."
    },
    {
      "rating": "6",
      "text": "I enjoyed everything about this movie. A very powerful and dramatic film that keeps the audience aware the whole time. Opens with a great crash scene and finishes with a perfect ending. Washington at his best."
    },
    {
      "rating": "8",
      "text": "\"Flight\" was directed by Robert Zemeckis and stars Denzel Washington, Bruce Greenwood, Don Cheadle and John Goodman. This is a film worth seeing if for no other reason than the first 20 minutes where action and drama take us into the stratosphere of emotion and fear. Written by John Gatins this is the story of an ill fated flight and the alcoholic pilot who despite his addiction, attempts to perform a miracle of aeronautical maneuvering. Not to be understated, Denzel Washington once again proves his wide range as an actor and gives us a performance worthy of his reputation and past accomplishments. Though thin in story line and weak in some other areas (i.e. depth of the  characters etc.) I give the film an 8 stars because, above all else, it was entertaining and certainly gets the viewer involved."
    }
  ],
  "recommendations": [
    "beirut",
    "widows",
    "man_on_fire",
    "a_most_wanted_man",
    "deepwater_horizon",
    "the_place_beyond_the_pines",
    "apollo_13",
    "the_good_shepherd",
    "everest",
    "the_accountant",
    "sully",
    "allied",
    "prisoners",
    "argo",
    "good_time",
    "the_infiltrator",
    "a_most_violent_year",
    "manchester_by_the_sea",
    "no_country_for_old_men",
    "patriots_day",
    "american_gangster",
    "valkyrie",
    "the_equalizer_2",
    "no_escape",
    "a_history_of_violence"
  ]
}