{
  "id": 4003,
  "title": "Flightplan",
  "starring": [
    "Jodie Foster",
    "Peter Sarsgaard"
  ],
  "runtime": 98,
  "genre": [
    "Thriller",
    "Drama",
    "Mystery"
  ],
  "description": "Flying at 40,000 feet in a state-of-the art aircraft that she helped design, Kyle Pratt's 6-year-old daughter Julia vanishes without a trace. Or did she? No one on the plane believes Julia was ever onboard. And now Kyle, desperate and alone, can only count on her own wits to unravel the mystery and save her daughter.",
  "releaseYear": "2005",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oNjZFzbe7PfF3TxztNHDkinOPyB.jpg",
  "categories": {
    "plot": 5.052631578947368,
    "acting": 4.916666666666667,
    "ending": 4.461538461538462,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 4.444444444444445,
    "funny": 7.5,
    "action": 4.714285714285714
  },
  "reviews": [
    {
      "rating": "1",
      "text": "If you were to take \"The lady Vanishes\", add some \"Turbulence\" and a cup of \"Not without My Daughter.\" then you would get \"Flight Plan\". It is a mixture of many movies strewn into one. I thought Jodie Foster had more class than that.I gave it a 1 because at least it had some talent in the cast."
    },
    {
      "rating": "8",
      "text": "I thought this was very good entertainment, indeed. I'm not sure what the problem is with some of those critics, and what they didn't like but buff'em! Jodie was excellent, as usual. Good balance between action, suspense and great storyline."
    },
    {
      "rating": "1",
      "text": "With Jodie Foster and a few bad actors, you get Flightplan: boring plotline, lack of humour, and an overall mishap in the history of movie making. Jodie drives the audience nuts, as she tries to desperately find her child, who's missing on a plane. Not only is she a little too worried, but comes off as being really annoying. Even throwing a weird twist didn't make the movie better. Instead, it was like a clone of The Village (movie with false advertising and was more disappointing than the 50 second trailer). The only positive side to the movie was that they used Sean Bean as the captain of the flight. Very genius, no Boromir indeed, but still impressive. In conclusion, I totally recommend you DO NOT see this movie."
    },
    {
      "rating": "8",
      "text": "Nothing extraordinary, but clearly not as bad as some reviewers are making it sound. I loved the fact that not a single dirty word was used; Foster's acting was superb!"
    },
    {
      "rating": "10",
      "text": "I think this was the best movie i have ever seen sence i was a little kid i think this is a 2 time movie every one should go see it."
    },
    {
      "rating": "5",
      "text": "Really disappointing. Just not the quality you would expect from Jody Foster."
    },
    {
      "rating": "6",
      "text": "Why wouldn't the 200 passengers who observe Jody Foster running around the plane like she has several screws loose grab her and sit her down in her chair? Was the daughter supposed to be drugged? She was as lively as a leech."
    },
    {
      "rating": "5",
      "text": "The plot was not believable. [***SPOILERS***] When Jodie Foster starts freaking out about her missing daughter and all the people around her doubt she even has a daughter, much less one who boarded the plane, the plot fell apart. Why didn't the character played by Jodie Foster suggest that someone contact the grandparents, with whom she and her little girl planned to live once they arrived in the U.S.? Were there no school, doctor or other records that could prove the daughter's existence? The captain could have initiated an inquiry to ascertain that, at the very least, there WAS a daughter. Did the Jodie Foster character have no friends that could be contacted to verify that Foster had booked a flight back to the states with her little girl? How was the flight booked? If by a travel agent, couldn't that person or firm confirm a booking for the little girl? If by a website, wouldn't there be a record of the number of tickets purchased by the Jodie Foster character in the website's database? I'm sorry, but if a plot is not believable, I stop caring. Other posters here have described other plot holes, but these very early ones pushed me out of this movie very early on. Scriptwriters should plug plot holes and not assume the audience is stupid. A plot that is implausible throws me right out of the movie. Too bad. Some good acting talent on view, and the direction and editing were good in my opinion. But the plot - the story - is central for me. If it fails, the movie fails."
    },
    {
      "rating": "4",
      "text": "Awfully implausible."
    },
    {
      "rating": "7",
      "text": "A good actress can sell a bad movie. Jodie did it for me. I wish that Erica C. would have been given a bigger role in this picture."
    },
    {
      "rating": "7",
      "text": "Jodie Foster is \"mother panic\" in movies like Flightplan and Panic Room. She is quite believable in these roles. The movie is initially captivating as it places the viewer in the same position employed in Ron Howard's \"A Beautiful Mind.\" In Flightplan we actually begin to believe we may be participating in a schizophrenic break from reality. Sadly, we are rapidly brought back into the reality of a predictable plot and \"Hollywoodesque\" ending. The stereotyping of Arabs is too important an issue to assign to the few scenes allocated in this movie. This issue would have been better served with these scenes on the editiing room floor. They were obviously forced into the plot to reveal how easily we engage in stereotypical behavior. If I were an Arab these scenes would cause me to leave the theater feeling as though the dangerous harrassment I often experience could be easily erradicated if \"I\" offered the offender their purse.\" Either deal with the issue in an informative, intriguing manner or let another film bring it to life. This feeble attempt still left me wondering if \"they\" (an often dangerous word) were still connected to the abduction. This film had enough fuel to hold my interest. Still, Flightplan never reached the altitude potentially possible through Foster's fine acting."
    },
    {
      "rating": "3",
      "text": "If this did not have Jodie Foster you would fall asleep or walk out. BTW what airline has $50M these days?"
    },
    {
      "rating": "4",
      "text": "Great to see Jodie Foster, but not in such an implausible whip of a movie. The serious tone of the film's first section belies a plot that panders to stereotypes (of Arabs in particular) and a consipiracy so fantastically ridiculous, a Steven Segall or Jan-Claude Van Damme movie would be loathe to use it. Go see Red Eye, which was at least fun."
    },
    {
      "rating": "6",
      "text": "There were some suspensful moments in the movie I guess when we don't know whether Jodi is out of her mind or not but other than that the story kind of falls flat on it's face and the action in the end is neither well put together nor well directed."
    },
    {
      "rating": "0",
      "text": "Enter a contestant for the Hollywood hall of Turkeys. Totally abject and brainless, what a waste of time and money. AVOID!"
    },
    {
      "rating": "7",
      "text": "A better movie than I would have thought after reading some of the more negative postings. I didn't feel betrayed by the end, nor did I find it as implausible as most action movies are. It almost felt like a female version of a \"Die Hard\" script, or \"Panic Room \"on a plane. Bill C."
    },
    {
      "rating": "1",
      "text": "If Jodie Foster is only going to treat us to a film performance every three years or so, she'd be better advised to join forces with Robert DeNiro for Taxi Driver: 30 Years Later, in which Travis Bickle and Iris reunite and join forces to blast away panhandlers, jaywalkers and other vermin infesting the streets of Rudolph Giuliani's Disneyfied New York than to do anything like this laughably contrived, ridiculously ineffective Panic Room In The Sky. She plays a distraught mom transporting her recently deceased husband's body from Germany to the U.S.; things get complicated when she loses her little daughter on the flight and even more so when questions arise among the crew and other passengers as to whether the child ever existed in the first place. Much justifiable complaining has already been done about the film's final act, and I won't divulge any of it for you--not because it's not nice to print spoilers, but because there's more than enough, uh, love to spread around to cover this movie's ENTIRE 93 minutes!! For starters, setting the action on a superjet half the size of Delaware is comletely nonconducive to suspense; the people who made the 1952 cop-on-a-train thriller The Narrow Margin, the original Speed, and the current Red Eye were all intensely aware of a simple but necessary component in transportation-based thrillers that Flightplan is obviously, completely unaware of: claustrophobia. (Put it this way: spending half the movie's running time thinking about what the Zucker Brothers could've done with the Ponderosa-sized set doesn't exactly whiten my knuckles.) The flight crew and personnel are, to a one, depicted as so thoroughly insensitive to Foster's situation that I'm surprised that more flight attendants aren't picketing theaters showing this movie for defamation of character than conservative Christians protested The Last Temptation Of Christ back in 1988! For that matter, of the 400-plus passengers, isn't it within the realm of possibility that at least a few of them (especially the other parents on board) would treat Foster with some compassion and consideration rather than responding to the admittedly unique circumstances with complete selfishness and heartlessness--even if their plans WERE being disrupted? (Don't get me started on Flightplan's shoddy and offensive exploitation of post 9/11 fears of Arab passengers.) The movie's use of astonishingly unbellievable coincidences not only breaks several simple dramatic laws but invents new ones to mercilessly stomp on; in Speed, having Sandra Bullock ride the bus because she had her license revoked, making her the perfect candidate to keep the bus going over 50 mph was a believable and pleasing piece of serendipity; having Foster be this plane's architect and therefore know every place to look is contrived beyond forgiveness. (Or, as Saturday Night Live's Church Lady would've said, \"How con-VEEEEE-nient!\") You can't fault Foster's very effectively tense performance at all (the fact that she fights like a girl notwithstanding) except that it's utterly wasted in the service of such disgracefully substandard material: watching her here is like seeing a world-class concert violinist performing in a Chuck E. Cheese's. On the other hand, Peter Sarsgaard, normally a terrific actor (Kinsey, Garden State, Shattered Glass) is currently the leading candidate for2005's Nails-On-The-Blackboard award for his surprisingly irritating impersonation of an alternately sympathetic and suspicious air marshal, and would someone please remove the Scotch tape from his eyelids? Of course, the possibility exists that I'm completely misreading this movie, and perhaps everything that's wrong with it should be interpreted as a microcosm for all the troubles that the airline industry has faced in the last few years. If that's the case, perhaps the same advice applies to spending good money on first-class flights AND an evening centered around Flightplan: Fly coach instead."
    },
    {
      "rating": "8",
      "text": "I was impressed wiyh this movie.There could of been a little polishing up though before it was released,but overall it was a good movie."
    },
    {
      "rating": "9",
      "text": "I looooved it! it was amazing, i would have given it a 10, but there was one sequence that didn't make any sense, but nonetheless, a great thriller."
    },
    {
      "rating": "8",
      "text": "This movie was great id go see it if i were u."
    },
    {
      "rating": "6",
      "text": "Ok, now you may see the 6 and think \"that's not that great, it's not worth going to see\". But ... you'd be missing out on entertaining mindless movie fun. I want to give the movie a higher score, but truth be told, it wasn't anything I haven't seen before. But I enjoyed it, and you will too."
    },
    {
      "rating": "2",
      "text": "A poorlty conceived and poorly executed movie. It simply has no point. It makes the case that it is ok to endanger an airliner in flight in the search for a missing child. It promotes self-indulgent and paranoid concepts as being justified by these type circumstances. Most of all, the acting was flat by all in this film including Jodie Foster who comes off as another supermom dealing with just another set of contrived circumstances."
    },
    {
      "rating": "10",
      "text": "I've spent a lot worse 88 minutes in a theater before. Here we get decent acting (down to the passengers three rows to the left of our star), tight editing, moments of tension that spring from implausible situations, and a dynamite leading performance from Foster. Why is this movie getting blasted for showing too much in the previews when Red Eye did the exact same thing?"
    },
    {
      "rating": "4",
      "text": "Great cinematography, well designed, and well acted. However, the story unfolds to a terribly generic and cheap climax. It really destroys everything the movie had built up. The ending reminds me of how cheated I felt coming out of the village."
    },
    {
      "rating": "10",
      "text": "Brilliant photography, very suspenseful and excellent acting. Jodie Foster is superb!"
    },
    {
      "rating": "2",
      "text": "Tepid and proposterous thriller about a mother whose child goes missing aboard an intercontinental flight. A potentially intriguing \"Lady Vanishes\" type premise is mangled by outrageous storyline. Visuallly flashy but utterly lacking in tension or suspense. The always-enjoyable Jodie Foster, plays a mother, trapped in a Kafka-esque situation, her sanity questioned as she tries to convince a skeptical captain and crew that her child has somehow been snatched aboard the plane. Sadly, Foster 'is given little to do except look angst-ridden throughout her ordeal; Peter Sarsgaard is horribly miscast as an air marshall though Sean Bean is effective as the captain of the high tech airliner. Don't wasate your money."
    },
    {
      "rating": "4",
      "text": "All during the movie all i could think about was how much this movie was soo like Panic Room. The acting is good... well too good for the movie, the set is good also. However, the reason why the movie was soo bad was because of the script. The movie leaps form one idea that Jodie Fosters character is crazy to the idea that her daughter is on the plane. And whoever saw the trailer know that she really has a daughter on the plane. Also the movie just ends. If there writers had changed the story line and made the ending more belivable the movie would of totally rocked. However that is not the case here."
    },
    {
      "rating": "9",
      "text": "This movie \"Flightplan\" was very good. The forshadowing will change throughout the movie. For example your thoughts will probaly be they did, or he/she did, or her daghter was just never on the plane. As the ending draws near you will begin to understand the begining. The reason I gave it a 9 and not a 10 is they could have made the begining clearer. It will definatly appeal to all mothers. After seeing this movie they will all keep a closer eye on their children. Has some funny scenes. The movie was not scarry, It was suspenceful. Will not give you nightmares."
    },
    {
      "rating": "6",
      "text": "Jodi Foster's character is at once sharp, cunning and calculating whilst also depressed, paralyzed and lethargic. The plot and pacing work okay, but just okay. No great performances from anyone. After a while, one thinks the dead husband may be lucky to be away from the rest of these losers and downers. The sky marshall character and his motives are sophomoric and foolish. The twists and turns are all formula, We are right to expect much better work and choices from Ms. Foster."
    },
    {
      "rating": "3",
      "text": "Ridiculous. The whole audience groaned at the ending, especially as it wrapped up an  storyline that insults an audience intellegence. Foster's role is one-note, but damn can that girl well up. Nobody can do that about-to-cry-a-river face better than she."
    },
    {
      "rating": "10",
      "text": "I think it was great movie. I loved how the author put many twisteds in their. It keep the mind thinking."
    },
    {
      "rating": "1",
      "text": "Unbelievably bad. Foster looks like a Halloween mask. Poor Peter Saarsgard's Bill Murray low energy style, perfect in Shattered Glass, is screechingly out of place here. What an ego trip for a woman who wants to bring her psychology to her work. Vey bad movie."
    },
    {
      "rating": "8",
      "text": "It certainly deserves higher ratings than the critics have given it. Top-notch acting, a couple of nice plot twists and excellent camerawork all make up for a couple of stretches in credibility."
    },
    {
      "rating": "7",
      "text": "How does this movie not rate higher than Red Eye? I have to think its hurting from being the second of the two released; while both are far-fetched, at least Flight Plan doesn't disclose the entire setup in the first ten minutes, and manages to navigate its unlikely scenario more convincingly than Red Eye."
    },
    {
      "rating": "9",
      "text": "Great suspense. Never would have guessed the outcome in amillion years. Jodie Foster and supporting cast are terrific. See this movie."
    },
    {
      "rating": "5",
      "text": "It was a decent movie.....but nothing really very good. The movie begins very confusingly, and very slowly. Things eventually start to pick up as they introduce many suspicious characters, and the script always keeps you guessing. Unfortunately, your guesses will probably be right; the movie gives itself away fairly early on, and the villains' plans kind of fall apart when you wonder about the details of them after the movie's over. I found the movie to be interesting, and as I said, it kept you guessing through the whole thing...yet it doesn't move fast enough. It's never really as suspenseful or thrilling as it wants to be. The movie resorts to cheap tricks to try to fool you; characters giving eachother suspicious glances when (in retrospect) they had no reason to, etc. It was an interesting movie, but overall, it's only average, and as a thriller, it just doesn't thrill."
    },
    {
      "rating": "5",
      "text": "Suspenseful movies are often compared to roller-coaster rides because the twists and turns and ups and downs are what make watching them such a thrill. The problem with \"Flightplan\" is that it is like a roller-coaster with only one hill. [***SPOILERS***] The tension builds steadily from the beginning, where we aree treated with fractured, inter-woven images of a grieving aeronautics engineer named Kyle Pratt who has lost her husband to a fall from the roof of their residence in Berlin. She is escorting her traumatized daughter Julia home to America, along with her husband in a casket. When the exhausted and emotionally frazzled mother falls asleep on the plane she helped design, she wakes to find Julia missing. At first she is calm and prudent in her search of the luxurious two-story jumbo jet. It's only when she cannot find her daughter, and not a single one of the passengers or crew admits seeing the child ever come on board that we begin to question Kyle's hold on reality. The flight attendents begin to think she's delusional, and the captain discovers evidence she very well might be. But we *saw* Julia board the plane. Or did we? \"Flightplan\" forces the audience as well (as the sleepy-eyed Air Marshall Carson played by Peter Sarsgaard) to ask several hard questions. How can a 6-year-old girl vanish mid-flight on an airplane? Why would someone even hatch such a plan? What makes Julia, or her mother, so special? When the reasons are revealed and the villain of the movie are finally unmasked is when this roller-coaster plummets towards the earth and never quite recovers. The underlying plot that threatens Pratt and her daughter is so outlandish and unecessarily elaborate that one might believe Rube Goldberg was the mastermind behind it all. Suspension of disbelief is not enough to save us from wishing the ride was simply over. What saves the film at all is the superb acting from Jodie Foster and Sean Bean. Foster always appears to be riding the edge of hysteria and madness, yet she skillfully manipulates the circumstances, the crew and Sarsgaard's air marshall to find her daughter. She never for a moment doubts what she is doing, and that means we can not be sure she is fully enveloped in her own grief-fed delusion. Sean Bean, who normally plays villains, is the firm and unflappable master of the airplane who knows he is responsible for the 400+ lives on the plane yet understands that Foster's character is one of those lives. He matches Pratt's unwavering dedication point for point and serves as a much better foil than Carson, whose role is mostly relegated to glowering at Pratt like a surly guard dog. \"Flightplan\" borrows heavily from the classic Hitchcock film \"The Lady Vanishes\", but it cannot live up to the master of suspense. In \"Flightplan\"s case, it's the plot that ends up vanishing."
    },
    {
      "rating": "3",
      "text": "Has anyone ever noticed The Baltimore Sun never has any idea what they're talking about with every movie they review? At any rate, this film has so many loose ends I began shopping for end tables. At least 30% of the movie doesn't make sense by the end and in an attempt to be a thriller it assumes the general public will just forget that it decides not to tie pieces together. I'm disappointed that Foster makes absolutely no judgment calls with scripts anymore. She might be middle-aged but have some pride girl!"
    },
    {
      "rating": "3",
      "text": "The \"payoff\" to this thriller is simply not believable. The plot holes are big enough to drive an SUV through, and the supporting cast is entirely wasted in this movie. Even Foster's performance is only mediocre. A huge disappointment."
    },
    {
      "rating": "5",
      "text": "A star vehicle that works forced and simple. Robert Schwentke´s movie, is a blast for an entire hour but in the last part all becomes absurdist and implausible. Jodie Foster as a newborn Ripley naaahh. All looks like some ATM, and no more."
    },
    {
      "rating": "5",
      "text": "Why oh why did Jodie Foster sign up for this! What starts out as an interesting and believable thriller slides into complete mediocrity with one gaping plot hole after another. The most annoying aspect was as a viewer thinking of about 10 different ways in which this film could have been so much better. Miss Foster as usual is still good especially in the first half of the movie but even she has a hard time trying to seem convincing towards the end when she must have prayed there was a get out clause in her contract. The one thing that continually irritates the hell out of me is this type of lazy film making where by its as if someone said we've forgotten how to end it and someone comes up with a halfbaked idea in about 2 minutes! I'm a big fan of Jodie Foster and I hope she steers away from such mediocre movies in the future."
    },
    {
      "rating": "3",
      "text": "FlightPlan demonstrates that you can make a movie with quality acting, suberb sounds effects and absolutely no plot. The plot requires the viewer to suspend logic for the entire movie."
    },
    {
      "rating": "9",
      "text": "The top-notch performance by Foster only helps the movie become more riveting and suspensful, sure there are plot holes, but the direction is unique and the climax doesn't dissapoint."
    },
    {
      "rating": "3",
      "text": "There are SOOO many holes in the plot, the suspense is no enough to offset that."
    },
    {
      "rating": "7",
      "text": "Solid."
    },
    {
      "rating": "6",
      "text": "A decent thriller. Nothing too memorable, but it is watchable. It has some intense monents and some good acting. Mostly it's very run of the mill, but sometimes that can be okay. It was for me on Friday night!"
    },
    {
      "rating": "4",
      "text": "The plot is absurb at best however the acting is excellent all around and that saves it from being truely horrible."
    },
    {
      "rating": "7",
      "text": "The action built while the movie went along, but a lot of it was pretty unrealistic. The best part was the suspision, which didnt last too long. I gave it a higher grade because it served its purpose...to give you unexpected results."
    },
    {
      "rating": "3",
      "text": "This movie was ruined by the lame ending. It was a good plan with the U.S. Flight Marshall hi-jacking the plane, but to have him get out smarted like that. Not much to say about it... It was a pretty lame movie, but had the potential to be a big hit. did the director watch the movie before releasing it? Why didn't they change such a stupid ending?"
    },
    {
      "rating": "10",
      "text": "Edge of your seat thriller - brilliant!!!"
    }
  ]
}