{
  "id": 3363,
  "title": "Flipped",
  "starring": [
    "Madeline Carroll",
    "Callan McAuliffe"
  ],
  "runtime": 89,
  "genre": [
    "Romance",
    "Drama"
  ],
  "description": "When Juli meets Bryce in the second grade, she knows it's true love. After spending six years trying to convince Bryce the same, she's ready to give up - until he starts to reconsider.",
  "releaseYear": "2010",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6zDYFigohwncqFL00MKbFV01dWb.jpg",
  "categories": {
    "plot": 7.777777777777778,
    "acting": 8.25,
    "ending": 9.333333333333334,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.5,
    "funny": 9.333333333333334,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "It sounds like most of the critics have forgotten what Love is like, I watched \"Flipped\" with my daughter and found it enchanting and memories of being in love at that age came racing back....Excellent acting by all, especially the kids and whether the adaptation is true to the book or not it came across great and would highly recommend it to any family with kids in their tween years."
    },
    {
      "rating": "10",
      "text": "Of course the critics would not like this film.  This piece is so careful not to clutter realism with the idle meanderings of a writers mind that one is amazed by how simple and realistic the film becomes.  It is perhaps one of the best coming of age or self realization pieces I've seen.  There is an excellent ensemble cast.  The piece is limited technically.  This isn't a comic book adaption and it's certainly not a reworking of an overworked Tolstoi piece.  It's just a simple slice of life portrayed without a lot of tricks or visual effects or mass murders."
    },
    {
      "rating": "10",
      "text": "This is one of the greatest movies i've seen. the screenplay is fantastic. humorous and enjoyable. I would recommend this movie to anyone of any age."
    },
    {
      "rating": "10",
      "text": "In my complete own personal opinion this is the best movie I have ever seen. There's just something about the way it ends or the way that its brought out that makes me just want to keep watching and gain an incredible interest in Juli and Bryce's life. This movie will stick with me and be watched for a long time."
    },
    {
      "rating": "8",
      "text": "Flipped achieved one great thing, and that is to produce a feeling on me. At the end of the day that is one of the most important things that movies should ultimately accomplish and aim for. This movie presents one of the most ironical but true love stories that can touch many if not everybody in some way or another. Granted, it could be a bit heavy at times given its structure. Flipped interludes between the two main character's perspective on each of the several situations that they cross upon, and that opens the gate for a lot of repetition which can be a little frustrating. But overall, Flipped couldn't have been any other way; it successfully reaches so much depth because of this enduring but intriguing concept. At the end, this movie takes you back to the days of the first true love, and also to the days that resembled the meaning of what it was to be young."
    },
    {
      "rating": "8",
      "text": "Man I can't believe this movie has gone under the radar for so many people! I feel sorry for the people who haven't seen or heard of this movie! This was one of my best movies of 2010 by far! Rob Reiner done a fantastic job! The movie has the 'Stand By Me' feel!!! It was a really cute love story! I would recommend this for a date movie for sure! If you don't have a date please still it a go cos you won't be disappointed!!!"
    },
    {
      "rating": "2",
      "text": "Critics have called Flipped, \"A true gem\", & \"an instant classic\", so I have to ask, what were they smoking when they watched this movie? The story follows Bryce Loski (Callan McAuliffe) who has just moved to a new neighborhood with his family. Before he's even gone into the house his new neighbor, Juli Baker (Madeline Carroll) has come over to say hi, and for her it's love at first sight. Bryce, being all of eight years old, finds Juli annoying, but that doesn't stop her from stalking him all the way to high school. Will Bryce always find her annoying or will he eventually feel the same way about her? Well, I think the title of the film is a huge spoiler in and of itself, but that's besides the point. The entire film follows their interactions together, first told from his point of view, and then again from her point of view, making the whole thing very repetitive. The film offers nothing else besides the interactions of these two kids, no side stories, no friends, and even limited family interactions, it's literally just one meeting between Bryce and Juli after another. This is a film by Rob Reiner, the Director of Stand By Me, The Princess Bride, Spinal Tap, and countless other great films! I realize that not everything is going to be a home run, but couldn't he see how boring this movie was? Flipped is slow, repetitive, and even the damn title is a spoiler. This is most definitely one you can skip."
    },
    {
      "rating": "3",
      "text": "The lead actor seemed kind of bratty and I did not have much interest in his life.  I don't know how he moved from a wallflower to one of the popular high school boys, a \"ball boy\".  Watched this movie at home with a dvd from the library."
    },
    {
      "rating": "8",
      "text": "Set between the 50s and 60s, Julie Baker (Caroll) and Bryce Loski (McAuliffe) face each other's issues to build a funny and moving relationship in a complex yet upbeat coming-of-age story from the director of “When Harry Met Sally” and “The Bucket List”, Rob Reiner.This movie has a simple narrative that is told primarily by two perspectives, which is in this case, a great way to tell the story of the two main protagonists. It perfectly catches the attention of the two lead stars, as well as their point of views in solving the conflicts by their own. Also, the retro style of this movie is perfectly realized by its fashion and music. By this, Reiner gives this generation a tale of innocent approach of first love and family traditions during the 50s and 60s.VERDICT: However does it look familiar to some coming-of-age stories from other movies, Flipped is still a genuine and heartfelt charm that never fails to captivate its audience."
    },
    {
      "rating": "5",
      "text": "Strange narrative: why do I have to see everything twice? And why must I see all the mental activity? But still a lovely movie for educating the youth."
    },
    {
      "rating": "10",
      "text": "I stumbled on this movie while browsing through Netflix, and only decided to watch because it was a Rob Reiner film. I have to say that this was a wonderful film and definitely filed under “rewatch again in the future”. If you’ve ever been in love for the first time, this movie will bring back a lot of those feels. I also loved the 50’s setting that brought a nice “Wonder Years” vibe to the film. Anyone who gave this movie a 1 star rating is probably a “flat” person and has the same deep down emotional turmoil and prejudice as Bryce’s dad. For everyone else, this movie will not disappoint."
    },
    {
      "rating": "1",
      "text": "I haven't watch this movie so i cannot say if its really good or bad. Actually, this is my first time coming here."
    },
    {
      "rating": "10",
      "text": "I really really really really really really really really love  this movieeeeeee"
    },
    {
      "rating": "10",
      "text": "I don’t care what anyone says. I love... love love LOVE this movie! The story about a boy who pushes a girl away because his friends are like “EW, GIRRRLS!”. It isn’t blatant bullying as much as it is Bryce, as a kid, doesn’t know how to feel about Juli, who is head over heels for him growing up, so he pushes her away and does mean things. And unfortunately when he begins to fully understands his feelings as a teenager, it’s seemingly too late. This is more relatable as a movie than other movies I watched as a young boy, and to this day I have a soft spot for this slice of life."
    },
    {
      "rating": "0",
      "text": "this movie is doo doojdkdkekfkrkeoooekekekrkdkdkdjddjdnsnekeofocodkdnsksosoxockdjdnskozoxxk"
    },
    {
      "rating": "8",
      "text": "great movie. loved it. Bryce is so handsome, i could totally empathize with Juli when she would talk about his dazzling eyes. and then when Bryce did some really mean things to her, I could once again totally empathize with Juli and thought he was a complete jerk. The whole story was very relatable to me in general. wonderful movie."
    },
    {
      "rating": "10",
      "text": "Clean movie, free from any politics loaded content so common nowadays. The characters dynamic is so tasteful that almost leaves you longing for the sequel, addressing the true nature of what romantic love should be; a man finding courage to break from peer pressure for a counterpart that moves you to be a better person, and a woman resisting to give her heart without a proof on maturity.Everyone in my family loved it!"
    },
    {
      "rating": "10",
      "text": "I loved the movie I really did it’s like my comfort movie that I rewatch,they honestly don’t make movies like this anymore the only thing I wish they could of changed was the ending on how they leave it on a cliffhanger making us fans wanting a sequel:( but hey I’m happy I got to see the movie!"
    },
    {
      "rating": "6",
      "text": "Flipped is a well crafted picture with the decent direction and unique colour-grading.Despite some minor flaws, Flipped is still a warm little entertainment."
    },
    {
      "rating": "10",
      "text": "I read the book and watched the movie in 6th grade and yet I still love the story. Great comfort movie"
    }
  ],
  "recommendations": [
    "bridge_to_terabithia",
    "the_notebook",
    "paper_towns",
    "where_the_wild_things_are",
    "a_walk_to_remember",
    "about_time",
    "brokeback_mountain",
    "endless_love",
    "moonrise_kingdom",
    "the_lake_house",
    "if_i_stay",
    "the_art_of_racing_in_the_rain",
    "me_before_you",
    "the_vow",
    "coraline",
    "the_last_naruto_the_movie",
    "up",
    "the_perks_of_being_a_wallflower",
    "instant_family",
    "wonder",
    "five_feet_apart",
    "the_spectacular_now",
    "miracles_from_heaven",
    "we_bought_a_zoo",
    "the_adjustment_bureau"
  ]
}