{"id": 2383, "title": "Flushed Away", "starring": ["Hugh Jackman", "Kate Winslet"], "runtime": 84, "genre": ["Adventure", "Animation", "Comedy", "Family"], "description": "London high-society mouse, Roddy is flushed down the toilet by Sid, a common sewer rat. Hang on for a madcap adventure deep in the sewer bowels of Ratropolis, where Roddy meets the resourceful Rita, the rodent-hating Toad and his faithful thugs, Spike and Whitey.", "releaseYear": "2006", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/78czzq4yOr3yN2znedu0kWyv2Um.jpg", "categories": {"plot": 6.434782608695652, "acting": 6.5625, "ending": 4.0, "soundtrack": 7.0, "cinematography": 5.0, "familyFriendly": 7.25, "funny": 7.148148148148148, "action": 4.5}, "reviews": [{"rating": "6", "text": "Flushed Away suffocates nay say-ers.\rA very wacky, witty, and downright bizarre idea transformed into a very acceptable film. It's not pretty nor polite, but very watchable."}, {"rating": "5", "text": "It had a great cast and animation, but sadly after a while the dimness and the movie itself gets boring. It had a interesting idea, and it seemed to work for a while, and it was very funny and made me laugh, but it was weird near the end. I thought it was good, but could've been better."}, {"rating": "10", "text": "I loved it! Following this May's dissapointment of Over The Hedge I thought this film was awesome.I love all the crude jokes , but mainly those screaming and singing slugs, auhhhhhhhhhhhhh,! When I first saw the trailers I thought it would stink, but I was wrong it rocked. The sewer rat was wareing a pair of upside down undearware how crazy is that? I love it and I hope you too."}, {"rating": "6", "text": "\"Flushed Away\" isn't a great claymation movie. It kinda 'flushs' down the plot with revolving characters and settings. Nevertheless, the film still is a entertaining movie to watch (especially those 007 fans)."}, {"rating": "4", "text": "A movie about rats flushed down a toilet can only go so far without straying from the point. This movie does nothing for me, or film in general, and what is fresh and exciting in \"Finding Nemo\" and \"Ratatouille\" (which has rats, too!) is bland and recycled here."}, {"rating": "10", "text": "Overall I Loved It! I Just Bought It On DVD Today... I Think More People Should Really Sit Down And Watch It... It's Genuis!"}, {"rating": "7", "text": "Flushed away is another successful movie from DreamWorks animation. It isn't as good as other dreamworks films like kung fu panda, and shrek, but it's still a pass thanks to the adventure our heroes have that can bring a classic feel in a way."}, {"rating": "6", "text": "You'll enjoy it while you watch it; it has enough wit and slapstick to keep it running on its own motor. After you exit the theatre, you'll think of how idiotic and crude it was. At least the British/Australian accents made things funnier, as they always do/"}, {"rating": "9", "text": "A hilarious movie, a must see for fans of comedies, seriously go out and watch this it's fantastic, you can and will not be disappointed at all, a must see."}, {"rating": "2", "text": "Trash!!!!!!! I mean come on.... the beginng is so long, that the actual adventure is about an hour... GARFEILD! This movie wasnt even funny, other movies have done the same things...but better! TRASH!"}, {"rating": "5", "text": "Snoooooze. Borrrrinnnggg. Your kinds will like while you sleep away the minutes. SKIP THIS ONE PARENTS."}, {"rating": "8", "text": "The story and characters are not the most deep or sophisticated as something like Chicken Run but this film is still a lot of fun. The characters are likeable and charming. The story is flowing and engaging with some nice humor. Additionally, there is tons of visual appeal and attention to detail. Aardman takes a simple and cliché story and makes a fun and enjoyable film that is definitely worth checking out. Aardman is studio miles ahead of Dreamworks, which makes it sad that this is their last film with Dreamworks as their films are rather enjoyable. While it’s a shame this film didn’t do well at the Boxoffice and ended Dreamworks’ partnership with Aardman it’s a good film to go out on. Flushed Away is a children’s film with a lot of heart and charm that will appeal to anyone especially animation fans and was more than deserving to get a nomination for best animated film as opposed to Happy Feet."}, {"rating": "8", "text": "Hugh Jackman and Kate Winslet have great chemistry together as Roddy and Rita, who make an unlikely friendship defending Rita's hometown in the sewers of England.\rAs quoted by the many singing slugs, \"Poor old Roddy, flushed down his own potty, Rita can't you find it in your heart to help him?\""}, {"rating": "8", "text": "Once upon a time, Aardman Animations made brilliant films that were distributed by DreamWorks Animation. Then \"Flushed Away\" came out, lost DreamWorks $109 million dollars, and ended their deal with Aardman prematurely. Box office woes aside, \"Flushed Away\" was a bold step for Aardman: where all of their previous films were stop-motion, this film was made entirely in CGI. The result? A well-animated, clever, funny, and overall enjoyable (and severely underrated) animated film. Sure, it's not Aardman's best, but it's certainly well-worth watching if you love a good animated film."}, {"rating": "10", "text": "Ever since this film came I out I have adored its memorable characters, songs, references and storyline. While maybe its no E.T., Flushed Away is one of the greatest animated films of all time and I strongly encourage you to buy it as it is quite cheap nowadays.\r -GWZ, Signing Off (Not Really!)"}, {"rating": "7", "text": "Flushed Away mice either a film designed to sewer version of London,  amazing production design , and very good script, and you can not miss the session improved Aardman movement has been buenisima really"}, {"rating": "7", "text": "Enjoyable and decent from DreamWorks Animation and Aardman Animations. While the story, it's about a rat who gets flushed down the toilet, isn't that interesting, the movie should be that enjoyable to us all."}, {"rating": "10", "text": "Wow. what a great movie!!! reccomend it to everyone. i usually HATE movies in this category, im more into gory-horror, but i LOVED this film. awesome. 10/10 great story, awesome comedy."}, {"rating": "10", "text": "Brilliant masterpiece! One of the best animated picture of the last 5 years."}, {"rating": "5", "text": "I have not been remarkably impressed by any animated film since 'The Incredibles.' 'Cars' was good, but certainly the weakest entry from the highly regarded studio Pixar. I suppose it was too much to hope that Pixar would set a standard by which all other animation studios would seek to meet. This British/American hybrid has moments of wit and rib tickling humor, but as a whole, the plot just sort of meanders about aimlessly. Aspects of the story are quite original, but we have seen all of these characters before in other incarnations. The trend in animated films is moving ever so intentionally to an uncomfortable mishmash of potty humor and unintrusive unmemorable characterizations directed solely at young children. We get PG rated content that is neither completely appropriate for small children, and not at all satisfying or meaningful for adults. Is it any wonder that so many of these kind of films see tepid box office returns? 'Flushed Away' may be a slight step above most other recent films from this genre, but it could very well prove to be a disappointment nonetheless."}, {"rating": "7", "text": "It was okay. I enjoy watching my kids laugh and they did when they watched this movie."}, {"rating": "7", "text": "Fun and Entertaining movie! Also well known actors and actress lend there voice for this fun movie."}, {"rating": "5", "text": "Pretty bland all in all, but the singing slugs are very funny. Another lameish kiddie viddie."}, {"rating": "9", "text": "This movie has more charm, imagination and funny jokes than recent animated adventures. Plus a little romance. It grows on you with repeated viewings, especially since there are lots of little details you notice for the first time."}, {"rating": "8", "text": "This was a very funny movie. Even though I'm not a child or anything, I found it enjoyable because of the dialogue (it was OK), and the animation, which was fantastic."}, {"rating": "8", "text": "This was fairly entertaining and quite funny. Jackman and Winslet have awesome chemistry just with their voices. Not sure why frogs are chasing rodents???"}, {"rating": "10", "text": "One of the best animated movies I have ever seen. Right up there with the Incredibles. Truly hilarious. I just came from the movie and I want to see it again right now."}, {"rating": "7", "text": "The fast paced nature of this movie does not make it a classic or anything close but the ingenious script and the hilarious and orginal soundtrack covers and intellegent design make the movie worth appraise. Hugh Jackman and Kate Winslet are of course funny to see as clay figures but they are very cute and well cast. The underworld adventure and funny jokes make this cute movie lovable and at times joyous. A great family film to see when your bored, but still short of classics like The Incredibles and Shrek."}, {"rating": "7", "text": "Never too annoying so the adults can get some laughs too. It has some european joke references and some moments in which the characters open up and come alive. The movie as a whole is very enjoyable despite its fast paced flaws it is still very brillant in its diverse character arrangement and its strange and annoying jokes. I would recommend it for a family viewing but not for a birthday party when the kids want to watch a classic. Stick with Shrek but make sure you rent this one along the way for a look."}, {"rating": "8", "text": "The Best Animated Movie of 2006. Should get the oscar in that catagory. My cousin and I could not stop laughing. Smart Story and really intresting as well as overall brilliant humor that relates to a diverse array of people and generations to come."}, {"rating": "5", "text": "\"Flushed Away\" gets it half-right. After making Billy Idol sound cool for the first time in two decades, the film does an adept job at showing how a feral rat(Andy Serkis as Spike) seems out of place in posh trappings. Because \"Flushed Away\" is aimed at kids, the film hides the truth about Roddy(Hugh Jackman); he's probably an awful snob. When our domestic rat is flushed into the sewer city(read: ghetto), Roddy encounters Rita(Kate Winslet) and never gets to interact with the wild rats. \"Flushed Away\" turns into a sort of \"Raiders of the Lost Ark\" adventure, and any examination of differing socio-economic classes are flushed away. The backstory for The Toad(Ian McKellen) has the sort of sophistication that's missing from the main narrative. The Toad is so obviously a basket case(and sympathetic, thanks to McKellen), you sort of wish his plan for a holocaust panned out."}, {"rating": "7", "text": "Cute and Funny. Not unforgettable or brillant just...cute and funny ."}, {"rating": "7", "text": "Never too annoying so the adults can get some laughs too. It has some european joke references and some moments in which the characters open up and come alive. The movie as a whole is very enjoyable despite its fast paced flaws it is still very brillant in its diverse character arrangement and its strange and annoying jokes. I would recommend it for a family viewing but not for a birthday party when the kids want to watch a classic. Stick with Shrek but make sure you rent this one along the way for a look."}, {"rating": "4", "text": "Following the box office disappointment of this animated feature (you don't have to be Jimmy the Greek to correctly bet that viewers young and old would rather watch dancing penguins than rats flushed down toilets) it was announced that Aardman Animation would not be working with DreamWorks Pictures again. Here's one more example of a Hollywood breakup whose causes are so easy to explain that almost any average, casual moviegoer and Entertainment Weekly reader can temporarily claim amateur divorce-lawyer status. Aardman's previous full-length features, Chicken Run and Wallace & Gromit: The Curse of the Were-Rabbit, succeeded beautifully with abundant charm, dry British wit, attention to character that was almost as painstaking as their shot-by-shot work with hand-crafted plasticine figures, and GENERALIZED observation and parody of specific movie genres (the P.O.W. escape movie, the horror film). DreamWorks, on the other hand, specializes in loud, often exhausting, frequently crass CGI jokefests that too often substitute for real humor or observation an endless fusillade of pop-culture references that serve no other purpose than to inform us that the writers watched the same TV and movies and listened to the same Top 40 radio that the rest of us did. (Their good stuff--the Shreks--still comes off as a bit forced and overbearing; Madagascar and Shark Tale are well-nigh unwatchable, and their lone gem, this year's earlier Over the Hedge, is either an example of its makers reining in their worst, most excessive impulses and genuinely learning from Pixar and Chuck Jones or the ultimate illustration of the spaghetti-on-the-wall theory.) When DreamWorks stays in the background and lets Aardman thematically and stylistically dominate, as happened with Chicken and Wallace, all is well and the Stars and Stripes and the Union Jack can fly side by side in peace and friendship; when DreamWorks takes over too much of the editorial content, which I strongly suspect happened here, you get this thing. Flushed Away, the story of a Roddy, a poor little rich rat who, when his owners go on holiday, inadvertently gets sucked into the sewers and discovers a whole community of one-liner-spouting creatures he never knew existed, works on the DreamWorks theory that no gag or background throwaway is too forced or unfunny to land on the cutting-room floor and adds a corollary of its own: when in doubt, slam the hero in his little tiny balls. (This movie is in doubt a LOT.) I wasn't surprised to learn, while watching the end credits, that Flushed Away's five (!!) writers included two sitcom pros, Frasier's Christopher Lloyd and Joe Keenan--in fact, that goes a long way toward explaining why one of the film's villains, the crude, lazy bully Sid, has a personality so similar to Daphne's worthless brother on that show. But then, even the stuff that works in Flushed Away is disappointingly derivative: the best gag, predicated on seeing something you think is something but is really something else, is a recycling of a convulsively funny sequence in Caddyshack, and even this movie's celebrated singing slugs call forth too many memories of the infinitely more charming singing mice in the original Babe. Speaking of which, even Aardman's trademark character design (give everybody big, bulging eyes and stereotypically British buck teeth) works against them here: if you're going to make an animated film about VERMIN, for crying out loud, you'd better make them cuter than Pixie and Dixie combined! The final, surprise bit involving Sid really DOES work, and it's hard to completely dislike any film whose suspenseful climax is built from the urban legend involving toilet use during the Super Bowl and other big sporting events, but overall, Flushed Away's failure was set long ago when Aardman made its Faustian decision to eschew its traditional, Harryhausen-like approach and hop on the CGI expresss. If they did it because, as some of their representatives have explained, water is too difficult to animate the old way, then let's hope Aardman's next project takes place in the Sahara Desert. As Flushed Away proves, their movies work when they're completely TOUCHED by human hands."}, {"rating": "4", "text": "Wasn't really funny. Used too many of the same jokes."}, {"rating": "8", "text": "Very, very funny. after about the third or fourth slug scene, i was loving Flushed Away. sure, there are the typical kiddie movie plot requirements, such as the cheesy (no pun intended) love story between the two main protagonists, but there is more than enough grown-up homor to keep adults, and even some jaded teens, entertained throughout. personally, i loved the French ninja frogs. they had the best scenes in the whole movie. overall, 8.0 out of 10."}, {"rating": "7", "text": "Genuinely very funny and great voice acting. Animation not as strong as usual."}, {"rating": "7", "text": "Flushed Away doesn't show an special message and there's no moral enough to be a familiar film. But the great comedy, the adventure, suspense, likable characters and catching story-telling, makes this a really nice animated film."}, {"rating": "6", "text": "No es una película mala, pero no es una que trascienda después de tanto, logra entretener un rato."}, {"rating": "9", "text": "Blend of stop motion and CGI, that is this slapstick under-dwelling adventure. The British comedy style is still here, causing several laughs due witty assorted cultural references (keep an eye to find them). The screaming slugs and the voice casting are smashing."}, {"rating": "9", "text": "Alot Of FunThough it’s not Aardman’s best, Flushed Away has a top-notch cast, a weird but clever story, and an interesting mix of stop motion and computer animation."}, {"rating": "8", "text": "A fun little movie. Pretty much all there is to it. It’s nowhere near horribleRating - 82%"}, {"rating": "6", "text": "Flushed Away es una película que le tengo muchísima nostalgia. Sin embargo, no dejare que la nostalgia me impida ser objetivo. La película parece tener muchísimas ideas interesantes, y de hecho tiene una buena historia, sin embargo, no la explota, y muchas de las cosas que se revelan, o muchos \"trasfondos\" que cuentan personajes como \"Rita\" o \"La Rana\" quedan en la nada y la película no sabe ahondar mas en eso a su favor. Y la comedia es muy cliché, incluso irritante; son chistes que ya he visto millones de veces.En general, te mantendrá enganchado un rato, pero si que podrían haber aprovechado mas muchos de sus elementos introducidos. No la considero un clásico, pero la puedo recomendar."}, {"rating": "7", "text": "2006 was a lame year for animation. None of the big studios like Disney, Dreamworks or Pixar were doing their best and, in this case, not even Aardman. I'm not saying Flushed Away was bad, I guess it deserved a nomination for Best Animated Feature more than Monster House for example but it's kind of a letdown compared to Aardman's previous work.It has an all-star cast and it never felt like the actors were there for a paycheck, the performances were genuinely good. The concept is pretty bizarre but the direction and writing made it work and turned it into a widly entertaining movie with good humor and charismatic characters. I just don't know what else to say, honestly, it's entertaining but it's also pretty forgettable for the most part."}, {"rating": "8", "text": "Rude humour, high meme potential and Hugh Jackman what more can you ask for from a. Movie"}, {"rating": "7", "text": "This is an enjoyable, slapstick (madcap/zany) comedy based CGI film, with some amusingly British quirks, including some of the background details. For instance, pieces of various items cobbled together to be made into items the rats use in day to day life. Its a diverting thing for the adults to look out for, I suppose. I also found it amusing that there were clearly London gangster type characters included - literal 'doity rats' I suppose and indeed the main setting does appear to be modelled on London. Its meant affectionately I imagine.Also, there is some good music and the plot is...intriguing, to say the least. Its not especially memorable but its certainly not awful either. As a family friendly CGI film, its worth a watch. There isn't much to say otherwise really - its a bit of a laugh and even, for whatever reason, made me think of the Fraggles, I think perhaps due to the interior setting(?). Its worth a watch I'd say, yes."}, {"rating": "7", "text": "It's clever and so is the jokes, and even if the movie is not conceptually that great, it works! My score: 78"}], "recommendations": ["madagascar", "shaun_the_sheep_movie", "rango", "hotel_transylvania_3_summer_vacation", "storks", "the_lego_movie", "hotel_transylvania", "penguins_of_madagascar", "the_croods", "cloudy_with_a_chance_of_meatballs_2", "puss_in_boots_the_last_wish", "peter_rabbit", "hotel_transylvania_2", "ice_age_the_meltdown", "despicable_me", "over_the_hedge", "ratatouille", "despicable_me_2", "rio_2", "minions", "turbo", "madagascar_escape_2_africa", "ice_age", "smurfs_the_lost_village", "meet_the_robinsons"]}