{
  "id": 98,
  "title": "For a Few Dollars More",
  "starring": [
    "Clint Eastwood",
    "Lee Van Cleef"
  ],
  "runtime": 132,
  "genre": [
    "Western"
  ],
  "description": "Two bounty hunters are in pursuit of \"El Indio,\" one of the most wanted fugitives in the western territories, and his gang.",
  "releaseYear": "1965",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ooqASvA7qxlTVKL3KwOzBwy57Dh.jpg",
  "categories": {
    "plot": 8.818181818181818,
    "acting": 8.333333333333334,
    "ending": 8.5,
    "soundtrack": 8.0,
    "cinematography": 9.333333333333334,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "If the United States invented the western genre. Sergio Leone and Clint Eastwood turned it into a gourmet bite. The story of two bounty hunters on the trail of some outlaws is full of elements that make those who like the genre fall in love at first sight. Popcorn in hand, please."
    },
    {
      "rating": "9",
      "text": "Amazing movie. Probably not as good as the good, bad, and ugly but still super interesting."
    },
    {
      "rating": "7",
      "text": "Equal to the first film, extremely entertaining with a classic score. Very good."
    },
    {
      "rating": "8",
      "text": "Takes inventory of everything that worked about its predecessor and doubles down, whilst also looking to patch up the things that didn't quite come across as well as they could have -- just as every sequel should. \"For A Few Dollars More\" elevates the Dollars trilogy with much more likable leads, a surplus of action to savor, and a score that -- I swear to God -- has at least three or four themes that'll turn into genuine earworms for you in the days following your viewing of the flick. Clint Eastwood and Lee Van Cleef are a joy to watch onscreen, with their friendship ultimately providing the most satisfying element of the entire experience (especially once the ending comes around). Major props also go to Gian Maria Volonte for bringing the dastardly, yet tortured spirit of \"el Indio\" into the fold and then some. You can see a lot of \"Once Upon A Time In The West\" in this, both thematically and narratively. And even though it's not as filmically brilliant as that film, it definitely ages better (subtextually speaking) and is simply more efficient overall. Great film."
    },
    {
      "rating": "10",
      "text": "Just for the record I happen to love all three films. For a Few Dollard More is an amazing film though perhaps not as influential as The Good, The Bad and The Ugly. There is one improvement over that film though, and that is the writing of Clint Eastwood's character, more developed and more compelling. A Fistful of Dollars is also great because of everything that makes TGTBATU and FAFDM so good, but I do consider the other two more influential on the genre and also Akira Kurosawa's Yojimbo, which used the film as its inspiration, to be the superior film. Back to A Few Dollars More, the stylised visuals are stunning to look at, the scenery is the very definition of epic and the cinematography sweeps. Ennio Morricone's score is both elegiac and operatic in tone and the story of greed and revenge that focuses mainly on the pursuit of bandit Indio draws you right in and never lets go. The dialogue is peppered with grit and dark humour, which is well-balanced with neither over-powering the other, while Leone's direction is superb. Clint Eastwood plays his more developed character with immense charisma, Lee Van Cleef is suitably vengeful and again Gian Maria Volonte snarls convincingly. Overall, a wonderful film. 10/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "This is just an amazing movie. The final scene is just beautiful. It isn't as good as The Good, the Bad and the Ugly, but it remains a great film."
    },
    {
      "rating": "9",
      "text": "To consider this one of the rare sequels that improves upon their predecessors would be an understatement. With a taut screenplay, tight editing, impressive camera work, Superb cinematography with beautifully framed shots, Morricone's atmospheric and slow-burning score, a nuanced direction and an unmatched chemistry between Clint Eastwood and Lee Van Cleef, one of the most intimidating villains in a Western, I wouldn't be exaggerating if I said that For a Few Dollars More is about on par with Leone's masterpiece The Good, the Bad and the Ugly. The latter is still my favourite of his, but I really think For a Few Dollars More has a more daring, challenging and unpredictable script! The complaint I have is that the first act is a bit too cheesy unlike the rest of the film. Hence, there is kind of a jarring tonal shift between the first and the second act.(9/10)"
    },
    {
      "rating": "10",
      "text": "Eu amei o primeiro filme da trilogia, e quando achei que não podia melhorar...A obra conta com uma trilha sonora ainda mais marcante e impactante. Você arrepia, entra no clima, e o suspense chega ao nível máximo. Os personagens são ainda melhores, e o destaque dado ao Coronel funcionou muito bem. Junto com todo plot envolvendo o Índio e ele. Inclusive, plot esse que aumenta muito a proporção das coisas.A fotografia está excelente, com uns planos que chegam a encher os olhos. Algumas cenas são memoráveis, como o encontro entre o Coronel e Monco - Não posso deixar de mencioná-la. A atuação de forma geral está muito boa, junto com os efeitos práticos utilizados. O enredo é muito chamativo e cheio de revira voltas que não deixam que a obra caia em monotonismo, fora o desenvolvimento de personagem que está ótimo.Por fim, deixo aqui minha recomendação. Esse filme é essencial para quem é amante da sétima arte."
    },
    {
      "rating": "8",
      "text": "The 2nd entry in Sergio Leone's dollars is another great film with things that you would expect from a western like gun battles, bandits and revolvers. This is a recommended watch for fans of western films."
    },
    {
      "rating": "8",
      "text": "This film contains more of the same from the mysterious man - I love me some C. Easwood - mean and moody etc. There's something charming about the budget English dubbing (from the original Italian, I believe) and (if anythng moreso) the instrumental, sometimes quite high pitched music played in the background. It is quite atmospheric and I enjoyed the battle or confrontation scenes. I think I liked that there are a number of young children and babies present in various scenes featuring the local villagers, giving an extra sense of urgency and fragility in terms of the innocents caught in the cross fires.I'm not sure I'd say its as good as the original 'Fistful of Dollars' film but its still a decent watch and I'd recommend it on that basis."
    },
    {
      "rating": "10",
      "text": "The bit where Man With No Name (Clint Eastwood) is hat blasting Douglas Mortimer's hat away from him is honestly brilliant. Also, I bloody love everything in this movie, the plot, the characters, the dialogue, the gun fights, the composers theme which is used throughout this movie and Clint Eastwood being a bad ass throughout. Overall, it's an amazing Spaghetti Western movie with lots of action and lots of good moments throughout. I'd recommend for you to watch this after you've watched A Fistful Of Dollars, that's also really good but I prefer this one a little bit more but yeah, it's honestly worth the watch."
    },
    {
      "rating": "7",
      "text": "For a Few Dollars More is a good movie. The plot is average the characters are unique in there. This movie is a good sequel to A Fistful of Dollars."
    },
    {
      "rating": "9",
      "text": "The 2nd instalment of \"The Man with no name\" trilogy is a brilliant addition into what is an iconic series.The writing, the score, the action are all exceptional and compliment the excellent direction of Sergio Leone."
    },
    {
      "rating": "8",
      "text": "An improved version of \"A fistful of dollars\". Richer characters and set pieces, decent plot and amazing score."
    }
  ]
}