{
  "id": 4390,
  "title": "For Your Eyes Only",
  "starring": [
    "Roger Moore",
    "Carole Bouquet"
  ],
  "runtime": 128,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "A British spy ship has sunk and on board was a hi-tech encryption device. James Bond is sent to find the device that holds British launching instructions before the enemy Soviets get to it first.",
  "releaseYear": "1981",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/z57s6bpnYqokqr5HVNOBQFv5e1j.jpg",
  "categories": {
    "plot": 5.2,
    "acting": 5.916666666666667,
    "ending": 6.25,
    "soundtrack": 6.5,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 6.166666666666667,
    "action": 5.65
  },
  "reviews": [
    {
      "rating": "2",
      "text": "All in all, this is one of the worst of the Bond films and is really one of the entries that taint Roger Moore's run in the franchise.  It is any wonder that Roger Moore managed to stay in the role after this atrocity. It's bad and there is little redemption to be had outside of the rather well done action sequences.  Moore comes back for...more but we will discuss that later...http://latetothegame.blog/2019/03/21/key-movies-of-my-life-james-bond-edition-for-your-eyes-only-1981"
    },
    {
      "rating": "0",
      "text": "Two words: Instantly forgettable. Action scenes were in need of a major edit, The plot is so bland and typical and the lack of a compelling villain really put a damper on things. It's a shame to see Moore get wasted on such mediocre scripts because he is such a good Bond but it seems like all of his recent Bond films are just scraping the bottom of a barrel. They're awful."
    },
    {
      "rating": "7",
      "text": "One of the better parts of the Bond franchise in my view, especially because the villain was not so clear and therefore you need to think. Also I noticed some very good stunt scenes on the skis for example. But some action scenes were ridiculously unrealistic again. I liked also, that this Bond was harder and ruthless.Problems: Roger Moore is to old to imagine, he could do all these action scenes. Also the character of Bib Dahl was boring and the actress also. Carole Bouquet as Melina was very cold and without charisma, so boring, but her acting was not bad."
    },
    {
      "rating": "6",
      "text": "Having watched 25 Bonds from Dr.No to Skyfall, I place this one at 12/25.For Your Eyes Only is fairly simple: it's a generic Moore Bond, with a villain whose time onscreen is massively misused, and it has no exceptional qualities in its story, actors, or style.But I believe that for its time, and perhaps even for much later in the series history, it has the best action of perhaps the whole franchise. There's a sense of real violence in the strikes, the shots, the moments. The ending sadly is quite boring, and there's a bunch of really poorly made scenes, but the overall movie is visually appealing and its action scenes, in the snow and the mountains particularly, are extremely well made. It's the only Bond movie to have 15 minutes of action scenes upon action scenes, and I still didn't feel bored or that it overstayed its welcome.Otherwise, it's another Moore Bond, not his best, not one of his bad ones. They tried to give it a twist with a friend that turns villain, but he has so little character during his scenes that it's a moot effort. A special mention to Carole Bouquet, who was truly beautiful."
    },
    {
      "rating": "6",
      "text": "The twelfth James Bond movie and for me an underwhelming or better said mostly unremarkable experience except of the set up (ideas) and intro. After the remarkable intro the story starts on a British spy ship equipped with an ATAC system (Automatic Targeting Attack Communicator). It is a system for communication and coordination for British submarines (or in other words the keys to the submarine kingdom;-). After an accident the device is gone missing and James Bond is send out on a mission to retrieve it. Because of the high value it will attract many factions. The set up is amazing on paper and in the movie. However all that follows in not that interesting. I think I should clarify. It is not even bad and I have chosen the word unremarkable on purpose. I quickly lost interest and it was the first movie in the franchise that gave me boredom. There are some good moments as in every James Bond movie but these cant turn the tide. For the actors I say the same. There are no serious missteps but the script doesn't give the characters much room to shine. Roger Moore is as always the James Bond we love (I repeat myself I wont participate in the Sean Connery or Roger Moore discussion). Julian Glover is such a remarkable actor but here he cant do much. I cant go in details for his role but say he is one of the weakest in the franchise. There is also no menacing foe here. The other actors deliver but cant shine except maybe Q;-). I know that after giving us Moonraker which was set in space they wanted a more grounded James Bond movie but this is not the problem here. Grounded movies of the franchise have worked before and after this. Commercially it was a success but it was no ones favorite movie be it critics or fans. The sets are however beautiful and Meteora is a place I would like to see / visit in real live. The soundtrack for the movie is also neither bad or great. Overall this was to that date the worst movie in the franchise. I even have forgotten this movie existed for a while (except some scenes). I give a bonus point for the ideas and some remarkable scenes that sadly are not enough to turn the tide."
    },
    {
      "rating": "7",
      "text": "Warning: SpoilersThis is not the best of the Roger Moore Bonds(The Spy Who Loved Me) but it isn't the worst(a tie between **** and A View to a Kill) either- it is a film with its pros and cons and as an entry in the Bond franchise it is actually pretty solid.CONS: There is nothing new really in the plot, there is little really of surprises. Also some of the humour came across as rather goofy and misjudged while Bill Conti's score is rather disappointing in the forgettable sense.(the theme song was pretty good though)PROS: The set pieces are truly spectacular, even if the gadgetry and stuff is toned down here, while the cinematography and scenery are excellent. The direction and parts of the script are solid too and the pacing is fairly brisk, while I had little to criticise the acting. Roger Moore shows more grit than usual while Carole Bouquet is very classy as Melina. John Glover is suitably subdued, while there is a colourful turn from Topol and it was a surprise to see Chales Dance as a killer.In conclusion, not great but solid enough. 7/10 Bethany Cox."
    },
    {
      "rating": "6",
      "text": "This entry into the James Bond franchise is everything I had ever hoped for after Moonraker. While it still doesn't compare to the Connery classics, it treats the viewer well with thrilling action sequences, a witty script, and a fitting performance by Roger Moore. Are there better Bond films? After clearly favoring action over substance in this film, of course there are, but there has without a doubt been much worse."
    },
    {
      "rating": "7",
      "text": "After the fantastical gadgets and space spectacle of Moonraker, FYEO goes for a much more gritty and back-to-basics approach in the vein of From Russia with Love where the plot is about Bond and the villains chasing after a MacGuffin.Moore was always great with the comedy, but I feel he tends to be underrated in terms of how versatile he can be. Moore more than delivers the darker and edgy gravitas, especially during the scene where Bond avenges the death of a friend by kicking a car down the cliff with the assassin still inside.Where the film may lack in gadgets, it more than makes up for in action. There is a great car chase in a very non-typical Bond vehicle, a ski chase, an intense underwater brawl and a heart-stopping sequence where Bond tries to climb the side of a tall cliff.Now…even though I said this movie is more “serious”, some camp still remains like the hilarious scene where Bond fights a hockey team. I also really like the funky score provided by Bill Conti (Rocky, The Right Stuff)."
    },
    {
      "rating": "5",
      "text": "By this point, Moore doesn't care, he is on the run, shooting blanks, it might go really good or really bad; quantity will boil down to quality. is his motto.For Your Eyes OnlyGlen is new to the town. And so is his method. This breath of fresh air may not hold up against time, but for now, this is as good as entertainment gets. The script isn't breaking any ground here, but it is the director John Glen whose mano-y-mano approach to this franchise fabricates it with new color. And with fast gritty action that may not particularly be the smartest of all, the time slides by like melting butter, and just like it, it is unhealthy yet gestating a fun time for us, where often before reaching the climactic point, the film drops down all its weapons and reveals all its cards, this time with a nail biting tensed environment created around the set, it cuts deep and it cuts good.Finally, they leave the film as they should, at its peak point; no pun intended. Not to say that the rest of the time is spent upon building this grand finale, there are plenty of antics to drool over. From the classic humorous chase sequence- another major scoffed off limitation is the humor that is more subtle, of course, compared to the chapters in this franchise- to a well choreographed and equally flawed escapism from the jaws of the death.Even the Bond girl gets a more emotionally driven and less tempted towards the materialistic aspects of the world, arc to fill, it is still corny though. Roger Moore's performance seems a bit rushed over, almost like a runny ingredient in one big meal that was supposed to amplify the taste and instead undermines them. For Your Eyes Only, claims our lead actress, and is exactly how dogmatic the film travels, there is only so much a stuntman can do, please breathe some life on both paper and screen."
    },
    {
      "rating": "6",
      "text": "Directed by John Glen and produced by Albert Broccoli, it has script by Richard Maibaum and Michael G. Wilson, and is the twelfth film in the franchise. In this film, James Bond must investigate the sudden sinking of a British spy ship in Greece and recover a machine that, if it falls into the wrong hands, can compromise the British submarine defense system. To fulfill the mission and prevent the Soviets from obtaining the lost system, the spy will take the help of a girl who seeks to avenge the death of her parents.This is another movie where Bond will protect his country in the context of the Cold War. As seen in \"The Spy Who Loved Me\", the threat of open war between Russians and Americans was already a situation that both powers sought to avoid, in so-called policy of \"détente\". In fact, Bond mentions that policy in this film, in one of the final scenes, addressing the Russian General Gogol. This is probably one of the most memorable scenes in this film. In another, Bond scale an almost vertical mountain, in order to get to villain's lair. And how can we forget the famous chase scene where Bond, at the wheel of a disjointed Citroen 2CV, makes cross-country by the Andalusian hills? In addition to that famous scenes, we must appreciate the good performance of the cast, particularly Roger Moore, which achieved to harmonized well his comic vein with the pure action scenes, showing much more the aggressiveness that he seemed to tempered in previous films. The opening theme, \"For Your Eyes Only\", sung by Sheena Easton, is also unforgettable.Besides the central cast, inherited from the previous films, and the continuation of Roger Moore in the role of 007, in this film participated Carole Bouquet, in the role of the Bond-girl Melina; Topol gave life to Columbus; Julian Glover represented the villain, Kristatos; Cassandra Harris took the role of Countess Lisl and Lynn- Holly Johnson gave life to the nymphet Bibi Dahl."
    },
    {
      "rating": "3",
      "text": "FOR YOUR EYES ONLY is a 1981 action and adventure film involving James Bond played by Roger Moore... There are a few good scenes such as ••• Roger Moore and Q (Desmond Llewellyn) identifying a villain on screen using Moore's description and Q messes up and Roger Moore says \"His nose is not a banana, Q!\" before eventually getting a match after a print out of the villain and his details. ••• James Bond climbing up a rock face with a badguy at the top trying to smash some clips above that are holding Roger Moore dangling from a cliff so that's all that's supporting him in terms of safety so in theory trying to kill Roger Moore so he falls but Roger Moore climbs up the cliff using rope and strangely his shoe laces before reaching the top and throwing a knife at the badguy before he plummets to his death... We have a beautiful Lynne Holly-Johnson who seduces Roger Moore who plays James Bond but Roger Moore refuses to sleep with her on the basis she's still a kid. A Lotus car similar to the one or the same as the one in The Spy Who Loved Me but painted a reddish colour and used to no great effort or effect. Carole Bouquet as a horribly unsexy Bond girl and who seems dull and uninteresting at times and boring and she uses a crossbow weapon, the villains are laughable and some of the characters are stupid and unnecessary. The under water scenes suck and some of the action is poorly done and the story isn't great. One of Roger Moore's worst Bond films that feels flat most of the time."
    },
    {
      "rating": "7",
      "text": "It was cool seeing Roger Moore play a harder edged Bond and the emphasis on real spy tactics as opposed to gadgets and gimmicks.  The typical Roger Moore humor is still here but significantly toned down. The action scenes are amazing and the climax is tense. Worth the watcg."
    },
    {
      "rating": "4",
      "text": "One of the better parts of the Bond franchise in my view, especially because the villain was not so clear and therefore you need to think. Also I noticed some very good stunt scenes on the skis for example. But some action scenes were ridiculously unrealistic"
    },
    {
      "rating": "7",
      "text": "For Your Eyes Only was a little better than Moonraker.  Location great with a great plot, but mainly ... especially the jingle.  The music in this Bond is one of the best in the series for me.  For me, a good film that I can recommend."
    },
    {
      "rating": "8",
      "text": "The darker tone in this movie works well after the really cheesy and silly Moonraker. There are some good action scenes in this movie, like the ski chase and cliff climbing scenes, as well as the underwater scenes. The movie feels really grounded and that's exactly what makes it work. Kristatos is a weak villain though, he really wasn't that intimidating. Overall, I think this is one of the better Moore 007 films."
    },
    {
      "rating": "6",
      "text": "For Your Eyes Only adds a unique Greek flair, but doesn't do much else to separate itself from standard Bond fair."
    },
    {
      "rating": "7",
      "text": "What a fantastic time Bond movie this is! The film is filled with car chases, gorgeous women, underwater scenes, and chases in the snow once more. Or to put it another way, a Bond movie. But that is also this film's only flaw—it isn't sufficiently unique or unique."
    }
  ]
}