{
  "id": 1075,
  "title": "Ford v Ferrari",
  "starring": [
    "Christian Bale",
    "Matt Damon"
  ],
  "runtime": 153,
  "genre": [
    "Drama",
    "Action",
    "History"
  ],
  "description": "American car designer Carroll Shelby and the British-born driver Ken Miles work together to battle corporate interference, the laws of physics, and their own personal demons to build a revolutionary race car for Ford Motor Company and take on the dominating race cars of Enzo Ferrari at the 24 Hours of Le Mans in France in 1966.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dR1Ju50iudrOh3YgfwkAU1g2HZe.jpg",
  "categories": {
    "plot": 7.404255319148936,
    "acting": 7.235294117647059,
    "ending": 6.875,
    "soundtrack": 8.8,
    "cinematography": 7.857142857142857,
    "familyFriendly": 6.0,
    "funny": 6.538461538461538,
    "action": 8.3125
  },
  "reviews": [
    {
      "rating": "9",
      "text": "An excellent, adrenaline-rushing, funny, and beautiful film. Believe the critics this time around. This is pure cinema Hollywood at its best! Christian Bale gives yet another incredible performance as Ken Miles and gives the near-perfect act for an Oscar nomination. All the other roles played by Matt Damon, Jon Bernthal, Tracy Letts, and Josh Lucas all are stellar. One gripe I do have with the film, however, is the slightly slower-paced sequences in non-racing areas. I think the film dragged rather than raced in those portions. But when the film raced, literally, my heart was pumping and I was nearly sweating out of exhaustion! James Mangold gives possibly a Best Director nomination-worthy job, period. All in all, this is an A-tier, one of the best 2019 movies, and an instant classic for me."
    },
    {
      "rating": "10",
      "text": "My real rating is 8.5 as a film in general, still a solid 10/10 as a racing film. I watched it on IMAX (laser), the engine sounds and screeching felt so good, the cornering was exhilarating, the shifting and throttling finally make sense in a racing film, and the music was there pumping hard, my wife was even humming it on the way back to the car. All these alone pay the ticket if you love driving, furthermore, you know you experienced a great racing adventure if after the film you go back to your car and hear your car engine with more affinity, feel the cornering more natural and have the sensation your Prius is really slow, but suddenly you realize that you are going 85 thinking is 55.Why 8.5 as a film in general? The cinematography was lacking, there was no worldbuilding whatsoever: shots around houses, labs, testing/racing tracks, and even cities were missing or only stills, and way too many short cuts to deliver an event such as pass or tight corner. Story-wise, it is based on real events, so saying the plot is obvious, it is a dumb thing to say. The acting is top-notch: Bale always creates a character that makes you forget about him in a snap, with incredible powerful deliveries left and right; Damon is always Damon, likable AF, he is like Tom Hanks at this point, you are just happy to see him on screen doing his thing; The Punisher is great too, he came and punched his way through. That being written, Ken's wife and child are \"the\" rockstars (I won't pretend I remember their names), every scene that was around them was really powerful, it shows that Mangold strives on getting the best of the best, and this pair has a bright future ahead.Bloody hell, go on and watch it already!"
    },
    {
      "rating": "10",
      "text": "One of the best movies i have seen in my life. It has adrenaline from start to end with touches of drama. Excellent tempo. Very good script and direction. Very convincing performances. It is accompanied by a very good music that immerses you along it. The movie lasts 2 hours 32 minutes and you don't feel them, it's worth it, you enjoy every goddamn second. I hadn't felt this way for a long time, and I don't know about cars and they don't attract me, but the movie is made with love, in addition to everything you learn from history with this based on real life. I could watch it a thousand times."
    },
    {
      "rating": "10",
      "text": "Awesome crowdpleaser that deserves all the attention and hype needed to keep Fox going while under Disney."
    },
    {
      "rating": "10",
      "text": "This is brilliant film as a original work and as a work for those who especially love cars, speed and wonderful picture. Actors is marvelous - Matt and Christian are the best for there roles. The movie isn't boring, has a dynamic actions and true feel of speed.Also, the story ins't changed in compare as original history"
    },
    {
      "rating": "8",
      "text": "An old-fashioned type of film they don’t seem to make too often anymore. Damon and Bale are great and the racing scenes are intense. A dad film if there ever was one..."
    },
    {
      "rating": "8",
      "text": "American car designer Carroll Shelby (Matt Damon) and British racer Ken Miles (Christian Bale) team up in order to build a legendary race car for the struggling Ford automobile company in order to challenge Ferrari at the 24 hr Le Mans race during the mid-60s. Of course, this car was the GT40, and the rest is history. Going into this and judging from most of the trailers, I knew it was probably gonna follow the standard biopic tropes and be crowd-pleasingly predictable at times... And it was! However, that definitely didn't change how much fun I had with this film regardless. It's got all the racing and car scenes auto-buffs will definitely be all over, and even the non-car enthusiasts just looking for a thrilling ride of a story likely won't be disappointed. It didn't feel too long despite its 2.5 hr runtime, but there were definitely a handful of filler scenes that felt a bit longer than necessary. Acting-wise, Damon and Bale make a great team and bring plenty of charm to the film with their performances. Overall, despite its predictability with many of the story elements, the same can't be said for the racing sequences (especially in the second half), which had me on the edge of my seat, and Damon and Bale without a doubt work together great alongside one another to make this ride a highly entertaining one!"
    },
    {
      "rating": "10",
      "text": "Worth every minute. The chemistry between Matt Damon and Christian Bale sizzles and leaves you wanting more. Crisp writing and acting makes this movie shine. While billed as corporation vs corporation, it's actually man vs corporation and all the suited egos houses within."
    },
    {
      "rating": "8",
      "text": "A well-made piece of little-known sports history, specifically the intense rivalry between Ferrari and The Ford Motor Company in their highly competitive efforts to win the 24 Hours of Le Mans during the 1960s. It's the kind of film that appeals to a specialty audience, despite its human angle, so, if you're not into auto racing, this probably isn't for you. However, for those who enjoy the subject matter and appreciate such things as great speedway action footage, this is one of the best films ever made about the sport. With a mostly breezy, light-hearted script and fine performances by Christian Bale and Matt Damon (who share a great chemistry together), this is an eminently entertaining offering."
    },
    {
      "rating": "10",
      "text": "Literally a part is the history of the Automobile, the struggle of the American mass-car manufacturer against the race car specialist, Pride and the essence of racing, a tough but genius driver, a genius of car creation. if you like cars, or race watch."
    },
    {
      "rating": "10",
      "text": "love it!, The level of the cars shown in the movie are just a pleasure for any car lover."
    },
    {
      "rating": "10",
      "text": "This movie is about passion, friendship and talent. It's riveting from start to end, Matt Damon is great, Christian Bale is even greater. James Mangold and his team doesn't make any mistakes, the scenes flows, the car races are simply the best I ever saw in a movie.The story is somewhat classic, it's a biopic, but damn,, it may be the best classic American biopic ever made.Hold on to your seats, this is a great ride."
    },
    {
      "rating": "9",
      "text": "For a movie that spans two and a half hours, about one hundred and fifty minutes, I found myself enjoying every single one. 'Ford v Ferrari' has what makes a racing movie great with thrilling sequences and a story with effective dramatic tension. But the real winner of this film: the humorous, poignant, and most importantly, human chemistry between Damon and Bale, (also supported by a very talented ensemble). In summation, it will have you transfixed."
    },
    {
      "rating": "8",
      "text": "Delivering plenty of laughs, adrenaline-pumping action, as well as powerful dramatic and emotional moments, \"Ford v Ferrari\" is a triumph on all levels."
    },
    {
      "rating": "4",
      "text": "It's a movie with a capital \"F\".Ford vs. Ferrari, with Fiat thrown in the mix.The movie features Fantastic and Fabulous performances. The leading actor, Ford-the-car deserves nothing but a praise, while Ferrari-the-car truly shines as a supporting actor.As to the real people, well, that's a different story. The movie director managed to do what no other director could - have a great Christopher Bale act poorly, with the rest of the actors not Fairing any better. It's is a Feel good, inspirational, one-dimensional Flick, with performances Forced and Fake (again, except the race cars).My score: Four out of ten (trying to be Forgiving)."
    },
    {
      "rating": "10",
      "text": "This is one of the best films of 2019 and easily among the best of both Matt Damon & Christian Bale's careers. As a lover of history and cars, I can see that my expectations for this movie were high and it did not disappoint. Usually racing movies show us the good guys winning in the end but this one was different. It made the audience care not just about the characters but also the historical significance of what they achieved. This should be considered an American classic. Beautifully written and well acted. HIGHLY Recommend it to anyone that loves cars"
    },
    {
      "rating": "7",
      "text": "James Mangold’s ‘Ford v Ferrari’ is a fun two-and-a-half hour ride down memory lane, circling the lives of legendary race car driver Ken Miles and equally esteemed car designer Carroll Shelby.The film gets off to an uninspiring start, introducing the main characters using quick-hitting scenes that turn each into an eye-rolling archetype.  Shelby is the inspired engineer.  Miles is the irascible wildcard.  Henry Ford II is the cutthroat Man of Industry … and they even give him a sniveling bulldog lackey.The second half of the film picks up the pace and is considerably more engaging.  Mangold does a fine job filming the racing scenes, choosing just the right balance of different viewpoints and cuts.  Beyond that, he thankfully spares audiences from the awful “shaky camera effect” that some filmmakers would’ve used anytime they wanted to ramp up the action on screen.Given that the ‘24 Hours of Le Mans’ race is indeed twenty-four hours long, Mangold also excels at keeping an even pace down the final stretch, not relying too much on either the racing or the off track drama, but rather striking an even balance between the two."
    },
    {
      "rating": "10",
      "text": "Christian Bale and Matt Damon star in a car-racing epic with a fine mind and a big heart."
    },
    {
      "rating": "10",
      "text": "Amazingly done movie with an even more amazing cast. A must see! Bale ❤️"
    },
    {
      "rating": "10",
      "text": "American car designer Carroll Shelby (Matt Damon) and British driver Ken Miles (Christian Bale) work together to build a revolutionary race car for the Ford Motor Company to take on Ferrari at the 24 Hours of Le Mans in France 1966. Le Mans ’66 an exhilarating trill ride from start to finish and I enjoyed every minute of it.The art of good story telling is creating something that anyone can enjoy, you don’t have to know a whole lot about cars and racing to appreciate Le Mans ’66. I’m sure all you car nuts out there will get a little more out of this film but when you break it down, Le Mans ’66 is an exciting real life story jam packed with intense racing sequences and some unexpected emotional moments. The racing scenes are all real and not relying on computer generated effects and the results pay off. Nail biting drama, extremely immersive and will have you on the edge of your seat. But for me what pushes this movie into five star territory is the relationship between Christian Bale and Matt Damon. Genuine and humorous with electric chemistry.I knew virtually nothing about the story before seeing Le Mans ’66 and I really feel this added to the drama. Whether you’re interested in racing or not I can promise you’ll enjoy this film. A truly gripping story with two brilliant central performances from Damon and Bale. Thoroughly enjoyable and highly recommended."
    },
    {
      "rating": "8",
      "text": "The car racing scenes are just amazing, the acting is great and the movie is just good."
    },
    {
      "rating": "3",
      "text": "Once again we're treated to a rose-tinted view of events of the recent past, dramatised and watered-down a point where the film is trying to tell a story, but that story exists in a fantasy environment.I'm all for family-orientated movies, but it's hard to watch a film about what is in effect corporate America in the early-mid '60s, and not have an aura of casual racism, sexism, ubiquitous alcohol consumption and pretty much everyone chainsmoking.It just takes the viewer out of any 'moment' in the movie because it's just so sterile and fake.So, it's another potentially great film ruined by the curse of the 'PG-13'/'12A' rating that prevents realism from being shown."
    },
    {
      "rating": "0",
      "text": "Quel dommage d'avoir gâché une belle histoire et une belle aventure pour Ford et Shelby...! car ce foutoir de film ne leur rend pas hommage, il les ridiculise et les caricature à l'insu de leur plein gré ! ce film trop long ne délivre en effet que deux heures et demi de propagande pro-américaine, de dialogues stupides, de bombage de torse et de petite guimauve à deux balles.Ce merdier de film fait passer Enzo pour quasiment un mafioso (très) mal élevé et Henry Ford (second du nom) pour un réactionnaire qui pleure comme un bébé (jamais rien vu d'aussi affligeant). De toute façon, on n'apprend rien mais rien du tout sur le développement de la voiture, un comble...!Côté réalisme, c'est une catastrophe plus ou moins ambulante, déambulant comme un mammouth alcoolique dans une course de voitures en porcelaine... ou plutôt entièrement en images de synthèse ! c'est évidemment la solution de la facilité mais aussi le piège du grand n'importe quoi dans lequel ils sont tombés à pieds joints... ne cherchez pas le moindre réalisme là-dedans, on est à Hollywood... Cela dit, le film de James Mangold a au moins une qualité : c'est sa réalisation de très bon aloi, en dehors ou sur la piste, même si ça explose comme dans un Star Wars, c'est toujours très clair et plutôt agréable à suivre lorsqu'on ne s'y ennuie pas ou qu'on ne peste pas devant tous ses défauts à chaque virage.Evidemment, prendre Matt Damon pour incarner Shelby (?!) il fallait oser... et là pas de miracle, Damon reste universellement, irrémédiablement mauvais, pathétiquement mauvais ; on aimerait alors se rabattre sur Christian Bale mais ce dernier, étrangement contaminé par Damon, ne fait que cabotiner et sur-jouer : il s'avère aussi insupportable que l'autre tanche ! c'est inédit chez Bale, je n'avais franchement jamais vu ça...Finalement, on se retrouve donc avec un film bidon qui sonne tristement creux... Pour un vrai de vrai sur les 24h, il faut voir Le Mans avec Steve McQueen, pas cette navrante gloriole grotesque ! ce film est une merguez !"
    },
    {
      "rating": "1",
      "text": "It's not easy to make car racing look interesting on film, as shots of cars going around corners and faceless drivers shifting gears start to feel pretty repetitive. Though the many scenes of fast driving do add some adrenaline, the film has to rely on a dramatic arc that hinges on the possibility of building a fast car and getting the right driver. Unfortunately this dilemma advances all too predictably, and features static characters in cookie-cutter relationships that feature no real tension and no development whatsoever. The characters are drawn well enough to elicit a few laughs at unexpected juxtapositions, but mostly they just go through the motions, and we literally hear the same overblown lines at the end of the film as we do at the beginning, as though the film wanted to remind viewers that nothing actually happens in between. Some nice period touches and decent turns by some supporting actors working with limited material demonstrate that the filmmakers were at least trying, but the flat relationships and tepid dialog keep things moving at a snooze. Maybe watch it on an airplane if there's nothing better?"
    },
    {
      "rating": "9",
      "text": "In 1966, Ford wanted to jazz up its brand, so they entered the 24 Hours of Le Mans to take on the historically dominant winner, Ferrari. Matt Damon plays the sports car designer who teams up with a famous driver (Christian Bale) for the titular challenge. This film is less about driving and more about the team's drive to win, including the technical challenges and the duo's head-to-head combat with the management of Ford. Most of the racing is saved for the big event, which is masterfully captured and downright riveting. The leads create a compelling duo, but the entire cast is makes this movie work. Director James Mangold keeps the dialogue and conflicts involving, while expanding their personal lives to give extra heft to the drama. A smart and compelling look at hard competition and the will to win."
    },
    {
      "rating": "6",
      "text": "CGI is bad, historical accuracy and technical details are bad, story is very basic and formulaic. 2 main characters and chemistry between them carry it, nothing else special"
    },
    {
      "rating": "2",
      "text": "I can count on 1 finger how many racing car movies I have seen and though I may recall who was in them I don't remember any of them and, sadly, because I had heard good things about \"Ford v Ferrari\" it will probably be in the same category. Based on a true story, the screen writers Jez Butterworth, John-Henry Butterworth and Jason Keller, juggle 4-5 different stories to add human drama to the film while eliminating any one of them would have brought the movie in at a reasonable showing time, way less than the 2 hours and 30 minutes it runs.At the same time the director James Mangold has one too many race scenes, one too many shots of a foot hitting the brakes, more shots than necessary to prove Ken Myles is eccentric or business owners and their employees can be  underhanded and ruthless. Caitriona Balfe, though a bit difficult to understand, impressed me playing the wife of Christian Bale, who as driver Ken Myles, has been getting raves for his role, left me cold and also hard to understand. Matt Damon is, as always, impressive in a strong, somewhat silent way, as former champion driver and now designer of race cars. Tracy Letts in the role of Henry Ford II has a 2 minute moving and at the same time funny scene while being solid in the rest of the film. Josh  Lucas as the boss's right hand man is an effective villain even if the role is a bit overwritten and obvious.The banter between Damon and Bale tells a lot about both men but one segment, meant to be funny is only funny due to the reaction of Balfe while Bale's scenes with Noah Jupe, just right as his son, shows the man to be a good father.The behind the scenes of business life certainly isn't new but the behind the scenes of the racing sport and business aspect of it and car companies is interesting.Though you may know who the winner is, or will be, in \"Ford v Ferrari\" it will entertain you if you can get through the 30 to 40 minutes unnecessary segments."
    },
    {
      "rating": "9",
      "text": "Watched Ford v Ferrari : Exhilarating !!!Outstanding cinematography engaging screenplay and very good direction with perfect background score work !!Story of famous  24 Hours of Le Mans presented with excellency !!Acting side everyone got chance to shinechristianbale done his role ; neat and sparkling!mattdamon is Highly astounding !!!Over all ford v ferrari is inspiring,fun , emotional and thrilling  race to finish !!!"
    },
    {
      "rating": "10",
      "text": "Have watched every racing movie that was ever produced and this, by far, was my favorite. Sure it’s an American rah-rah-toot-toot movie, but what a ride!"
    },
    {
      "rating": "8",
      "text": "Conventionally crafted but with today's state-of-the-art VFX, this well acted sweeping true story of racing and the broader auto industry fires on all cylinders. (Unlike the also 1960's period set ridiculous and ridiculously over-rated \"Once Upon a Time in Hollywood\", this actually has a strong story!)  Despite some of the best racing sequences ever filmed it surpasses previous racing film entries because of its human drama and is the rare outing these days that lives up to the praise.  Like last year's \"Green Book\" this is what Hollywood and only Hollywood can deliver so well.  Had they cut about 10 minutes in the end to match the pace set in the beginning, it would rate even higher here."
    },
    {
      "rating": "8",
      "text": "A exhilrating journey through the life of competition of Ken Miles, Ford V Ferrari surely balances the drama and action with some comedic elements in between to make the film an engaging viewing experience. While biographic films might be boring at times, Mangold kept the pace well enough to let us feel the bond between Ken Miles and Carrol Shelby, whom despite obstacles mounting both from within the Ford Motors and the races itself, still manages to make the best out of the situtation to prevail against odds. Although the story is not about winning, it's about courage and committment ones needs to battle against the unknown. Some downsides would be the uneven screentime of Lee Iaccoca of John Bernthal's character and the way too conventional filming styles."
    },
    {
      "rating": "9",
      "text": "It has become apparent to me that James Mangold is probably one of the most under-appreciated directors of our time. This is a filmmaker who has made some fascinating films and many people probably don't know they were by him. From 'Walk the Line' (2005), '3:10 to Yuma' (2007) and even 'Logan' (2017), he has made some fantastic films, and has a very good eye in how he approaches his storytelling. Here, with 'Ford v Ferrari', he uses Matt Damon and Christian Bale (surely to get some Oscar consideration for his work) as the two leads to tell the story of how Carroll Shelby (Damon) persuades Ken Miles (Bale) to compete in a race against Ferrari by driving a Ford. Shelby designs cars, and wants to team up with Ford to make the best race car possible. The big company knows that they can't remain financially stable if they keep making car after car. They need style and they need to keep up with competition, but most importantly, they need a reputation. Shelby uses Miles as a way to promote the Ford race cars as he is clearly the best racer out there. Their friendship, their bond is what keeps this movie lifted throughout. The screenplay, written by Jez Butterworth, John-Henry Butterworth and Jason Keller keeps these two central characters interesting when they're apart and when they're together. They know that Damon and Bale can work around the dialogue and that their chemistry is vital to the story. The racing sequences are also some of the best you'll see on screen. This movie can get a little long from time to time, so it can be hard to keep interested, but the acting, the chemistry, the racing and just the overall drama, with hints of comedy sprinkled here and there, is enough to keep you invested. It's sure enough that Bale will score another Oscar nomination for his work, hopefully, Mangold can get a \"Best Director\" nomination for his work here. It's a film and a story that deserves to be seen."
    },
    {
      "rating": "4",
      "text": "Seemed to me that every time there were Ford three-piece-suits on the screen the movie went to sleep. Somehow the movie lost track of the real fascination of building a Le Mans winner. But anything with Bale in it is mandatory viewing for me."
    },
    {
      "rating": "4",
      "text": "Bien actuada, pero muy aburrida y lenta, era de esperarse ya que no me interesan este tipo de historias que tengan que ver con autos y cosas por el estilo."
    },
    {
      "rating": "8",
      "text": "Summary: Car Top GunThe Good:  - Awesome acting from three great actors.  - Nuanced dialogue and a well-written screenplay of historical events that's funny and relatable (maybe too relatable).  - Great action cinematography on the races. The bad: - Too many themes. - Not nuanced enough in the one it really wanted, the business vs. art theme.  - Very talky."
    },
    {
      "rating": "9",
      "text": "¡Wheels of fire! The first act maybe is a little slow but the effort of Damon and Bale are notorious for make a real fact drama of team work and friendship, and adrenalizing races  without the boasting formula of Fast & Furious, something you will appreciate. Rush!"
    },
    {
      "rating": "8",
      "text": "Shortly after about 20 minutes into the film I started to get doubts about the movie. Not for the quality but because I was worried that the story wasn't going to justify the whole two and a half hours. But Ford v Ferrari surprises and ends up being a rather entertaining and intense experience.James Mangold is armed with two solid Christian Bale and Matt Damon to provide a story that in addition to being interesting and exciting also has a pleasant dose of humor, irony and sarcasm in something that could lend itself to be more dramatic.While it's true the film shines and is much better in the scenes that involve the car races, it manages to balance in a good way all the narrative aspects of the story, like the ones that include the corporate elements with Ford and its bureaucracy, the scenes that show us how they achieved the mechanical improvements of the car, to the link and friendship between Ken Miles and Carroll Shelby.All this compensates both sides of the balance achieving a good pace that doesn't allow the argument or interest to decline. As I said it's two and a half hours long and I didn't feel them and believe me, that's hard to achieve.I really didn't plan on awarding it an 8 because I didn't really like the ending.I feel that it didn't do justice to the story and how it had been built up to that moment and it's not that it falsified an event that really happened, it's simply that it didn't feel in tune with the rest, but considering all the other stuff and the good time I had watching it, it deserves the 4 stars.I expected something good and it was therefore Ford v Ferrari deserves the recognition and the attention."
    },
    {
      "rating": "10",
      "text": "Хороший фильм, не являюсь фанатом автоспорта, но фильм отлично смотрится и разжевывает все что нужно."
    },
    {
      "rating": "10",
      "text": "I like this movie, very fun. Christian Bale at his best, very exciting of the year! It's very good movies! In 1966, British driver Ken Myers defeated Ferrari when he opened the Ford GT40 and won the 24 Hours of Le Mans!"
    },
    {
      "rating": "8",
      "text": "Ford v Ferrari might not be a great movie, but it is still pretty good. It is two and a half hours long and it never feels like it, because the story is entertaining, genuinely interesting and flows very smoothly. The fantastic performances from the leads (Matt Damon and Christian Bale) will really make you connect with their characters and follow their journey. They both develop good chemistry and are so fun to watch together. There's some good comedy occasionally and it happens naturally. The humor doesn't affect the tone, because, like I said, it feels natural and not forced for the sake of having humor. While the performances from basically every actor of the cast are really good (not as good as the leads, tho), some of the characters felt like cartoons. Sometimes there are moments that get over the top and feel like they belong better in a dumb comedy film, but those moments don't happen too often and the tone remains consistent (Those moments are entertaining tho, but I felt them out of place). The music feels like stock music downloaded from YouTube, and I feel like the racing sequences would've been a lot more intense with less music. Speaking about the racing sequences; They are amazing. The great cinematography and nice editing really helps to capture the races clearly. There wasn't a single moment in the races where I couldn't understand what was going on. Everything was shown nice and clear. The sound design and the sound mixing were fantastic and really helped make the races intense.Overall this is a really good movie: It has stunning technical aspects and great performances, but I feel like some characters, the music and some writing choices could've been better."
    },
    {
      "rating": "5",
      "text": "The first 45 minutes of the film descend into Phantom Menace-tier lunacy, with too many characters introduced and too many events rushed through far too quickly. The rest of the movie plays out like a much more grounded, realistic \"Days of Thunder\" - which sounds good on paper, but in reality makes them film extremely cliche and bland. The cars are the stars of the final half, but after so many low, sweeping shots of the GT, you feel like you're watching a Ford ad."
    },
    {
      "rating": "6",
      "text": "this movie good but I can't say is great .this about two car that in the end Ferrari win the game"
    },
    {
      "rating": "10",
      "text": "i have watched many movies about cars like the fast and furious (of course) or the 2014 need for speed movie. but ive never really come across anything like this before. sure it is based on the actual story, but the way it had been reimagined was so interesting. whenever i watch a scene from the 24 hours of le mans in 1966, i always laughed at the crashes and cars flying all over the track, but this movie really made this event feel like a living hell that you would have to be out of your mind to take on. the cars were weathered like they came out of it as well, the crashes look absolutely fatal and deadly to you if you're not careful enough. the characters weren't the best, but they did do most of the things the actual people did. the cars weren't the real deal but they were beautiful and sounded evil. a really nice way to show the \"beauty of insanity\". the way they portrayed ferrari really made me hate how ferrari shot at ford and really refreshed me when they were destroyed at le mans. this movie overall is not just about retelling a legendary story from the 60s, it's about the stupidly insane things 2 people can do in a few years to beat an automaker that had been racing for way way longer."
    },
    {
      "rating": "9",
      "text": "I'm going to look back at 2019 fondly for supplying so many great movies like Once Upon A Time In Hollywood, Joker, Doctor Sleep, and now, Ford v Ferrari. I loved the hell out of this movie. My all-time favourite actor, Christian Bale, brings his A-game to this movie. Oscar nomination is incoming. Matt Damon also brings his A-game; this is probably the best I've seen from him. Bale and Damon's chemistry is fantastic too; I wouldn't mind seeing them work again in another movie. Jon Bernthal, Caitriona Balfe, Tracy Letts, Josh Lucas and Noah Jupe round out the cast and are brilliant in their roles. The movie is written well too. The writers portrayed the friendship between Ken Miles (Christian Bale) and Caroll Shelby (Matt Damon) well. They also brilliantly captured the family dynamics involved with racecar drivers, a frighteningly dangerous sport, in that era in particular. They even captured the politics involved in working for a giant like Ford excellently, bringing tension and also humour to the story. One scene involving Enzo Ferrari, giving his opinion about the Ford team is a highlight, so too the responding scene involving Henry Ford II. I can't praise the film enough on the technical front. The score by Marco Beltrami and Sanders captures the intensity of the races perfectly. The cinematography is gorgeous from start to finish. The directing is f'n fantastic, masterful even, James Mangold take a bow. What a movie he put together. The race scenes were freaking amazing. In particular, the Le Mans sequence. I was on the edge of my seat the entire time, and I sincerely believe it should go down as one of the best sequences in film, period. There is a bit in that sequence that should earn Bale an Oscar nod on its own. I can't recommend this movie enough. It's one of the best of 2019, a year that seems to keep on giving."
    },
    {
      "rating": "10",
      "text": "This is 10/10 one of my favorite movies of all time it should be considered an American classic and anything with Christian Bale or Matt Damon in it I have to watch. But them as a duo?! Never would have thought a racing movie could be so good."
    },
    {
      "rating": "7",
      "text": "It's a good, solid film, but definitely not a must-see in my book. It's missing some \"magic\" for lack of a better word. Something to make these real-life events shine.  I'll say that both Matt Damon and Tracey Letts do amazing jobs, and Bale is excellent as usual. Josh Lawrence plays the heel, as usual - though he was much better in \"You Can Count on Me.\" I want to see much more of Catriona Balfe - she jumped off the screen."
    },
    {
      "rating": "7",
      "text": "This is a fun Hollywood movie that I found amusing enough despite its long length. It suffers from typical underbaked dramatic tension with \"the wife\" and cartoonish villians. Some nice golden light with Kodachrome overlay and good sound. You could do worse if you feel the need to go see something this weekend, but you could also skip it and not miss much..."
    },
    {
      "rating": "4",
      "text": "Matt Damon is great as Carroll Shelby and the cars are great as cars but Mangold's direction and the cinematography give the racing scenes and most of the scenes with Christian Bale an unfortunate cartoonish quality instead of the intense and gritty quality that a racing movie needs."
    },
    {
      "rating": "7",
      "text": "A fun retelling of a little-known story. Good chemistry between Damon and Bale. Interesting to see a behemoth of a company like Ford to be portrayed as the little guy. Fans of American exceptionalism will no doubt love this and pine for the \"good old days,\" but I think anyone who appreciates a good story, gorgeous cars and good acting can find something enjoyable in this flick. I particularly appreciated that it didn't have a typical storybook ending..."
    },
    {
      "rating": "6",
      "text": "The racing sequences are cool but much of the drama feels contrived. Bale is entertaining."
    }
  ]
}