{"id": 2120, "title": "Forever My Girl", "starring": ["Alex Roe", "Jessica Rothe"], "runtime": 104, "genre": ["Romance", "Drama", "Music"], "description": "After being gone for a decade, a country star returns home to the love he left behind.", "releaseYear": "2018", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/bKqdggnIPeOI15VqtBZTkvh4hA9.jpg", "categories": {"plot": 4.0, "acting": 5.25, "ending": 6.5, "soundtrack": 4.0, "cinematography": 4.0, "familyFriendly": 5.0, "funny": 6.5, "action": 5.0}, "reviews": [{"rating": "7", "text": "i like this movie there is a Sincere love inside it and i suggest you to watch it i really cant figure out why critics have rated so low"}, {"rating": "9", "text": "Forever My Girl  Is a wonderful movie about love forgiveness and family.   Alex Roe as Liam Page and Jessica Rothe as Josie felt like they had real chemistry and showed a true connection. The star of the movie was Abby Ryder Fortson. She is an amazing young actress , she lights up the screen!  I love the humor she brought to the movie!  Forever My Girl is a great movie, great acting, can't wait to see it again. It was well placed and very realistic.I loved the ending to the movie, a perfect fit."}, {"rating": "10", "text": "This movie is one of the best movies I have ever seen! It is definitely a tear jerker though. I have never cried so much during a movie. When Liam goes back to his hometown and puts the clues together to find out that he has a daughter, I lost it. It reminds me of my childhood, when I was younger I spent years trying to find out who my sister was and once we found each other, nobody can pull us apart. I relate to Billy as well because when she first finds out that Liam is her father she doesn't feel comfortable calling him dad. I really didn't know if I wanted to call her my sister yet. We really didn't know each other that well... this movie is a must see movie and is great for dates."}, {"rating": "10", "text": "It is a shame that in the entertainment industry politics must be brought into everything. When it comes to professional critics in particular, their reviews do not necessarily reflect the quality of the movie in question; just how much they were paid or how much it lines up with liberal/atheist ideology.So is it any wonder that films that promote modern-day pederasty (Call Me By Your Name), self-destructive lifestyles (The Fantastic Woman) and \"systemic racism\" (The Big Slick) receive rave reviews while films about \"Christian values\" (Hacksaw Ridge) and conservative ideologies (Forever My Girl) are rather hushed aside or negatively critiqued to oblivion? What should also be questioned is why the films critics love so much are easily forgotten and do not even make the top 250 films list when the films they despise or tend to ignore are the ones that are remembered for a long time?Do not allow politics and liberal bias to ruin your tastes or what you would enjoy; simply see this film for yourself and enjoy."}, {"rating": "3", "text": "What's a romantic film that deserves to have an extremely low budget and not go any higher than that? What's a romantic film that begins to rehash clichés seen in other romantic films of yesteryear? What's a romantic film that all the crew that worked on it deserved to make a better movie? To answer all these three questions, it's obvious to know the answer to all of this because the review's placement is always the first thing noticeable about reviews. Forever My Girl deserves to be one complete lengthy YouTube video with an extremely low budget put to it. Seeing that as a major YouTube video instead of a major theatrical film could have made Forever My Girl a lot better than what it is even if it doesn't change anything aesthetic which I can hardly see here. Romance has been overused a lot recently and, for a moviegoer who expects to see more, that's no good for those who are not into romance or just noticed how stereotypical it just became. Sure not all romance films are bad and deserved awful treatment, but I'm just saying that films like these are what makes romance look bad. Technically because this is a film released in January, it would make sense for people to create an instant skip for Forever My Girl but just for the heck of people who still go watch movies in theaters during dump months, I consider skipping this one unless you literally are into romance which I literally hope not after this."}, {"rating": "8", "text": "Great Movie, about someone Lost between Love and A childhood Dream. Very Wholesome movie for the Whole Family."}, {"rating": "4", "text": "The best thing I can say about Forever My Girl is that it exceeded my expectations. Granted, my expectations were that I would want to gouge my eyes out with a rusty spoon while watching it, but still, it flew high above that very low bar!By far the strongest aspect of this movie is the acting. By the standards of sappy romance novel adaptations, these performances are near Oscar-worthy. The actors really do the best that they can with the project they were given, and their emotion shows it and it’s admirable, even enjoyable to watch.Aside from that, however, this film offers pretty much nothing worthwhile. The plot is something that has been seen hundreds of times before in low-budget romance films and never deviated from predictability. It never provides any story arcs; there’s never a feeling of any rising action. The plot builds and builds to...nothing, really. The climax is based on a clumsily inserted ordinary event and is resolved instantaneously and then...the movie ends. This is dull at best and unforgivably lazy at worst.Speaking of laziness, the dialogue proves to be as forced, predictable, and cheesy as one could come to expect from a movie like this. Aside from a couple actually funny lines, there is nothing surprising, nothing new, nothing that builds tension, there’s just nothing here.Aside from acting, there appears to be little effort put into the production of this film. The transitions between scenes are standard things like fades to black with a fade back in and it’s awkward. The camerawork is weird, focusing on odd things and not on the subject at some points. The soundtrack is unfitting at parts and that further contributes to the awkwardness. The story feels like it was changed several times during production with some plot points shoehorned in randomly. It’s a mess.Forever My Girl becomes a movie that will surely be loved by fans of Nicolas Sparks films, but everyone else need not bother with it.Story: 1Acting: 8Script: 3.5Visuals/Sound: 2.5Entertainment Value: 4OVERALL SCORE: 3.8/10"}, {"rating": "0", "text": "Typical title for the christian hallmark movie about falling back in love. Had low expectations for it."}], "recommendations": ["the_lucky_one", "tomorrowland", "slumdog_millionaire", "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_", "lost_in_translation", "fifty_shades_darker", "the_butterfly_effect", "the_twilight_saga_breaking_dawn_part_1", "the_vow", "the_bucket_list", "the_power_of_the_dog", "the_darkest_minds", "hugo", "pay_it_forward", "titanic", "v_for_vendetta", "there_will_be_blood", "ben_hur", "seven_pounds", "the_lake_house", "passengers", "vanilla_sky", "cloud_atlas", "boyhood", "bright"]}