{
  "id": 1288,
  "title": "Found",
  "starring": [],
  "runtime": 97,
  "genre": [
    "Documentary"
  ],
  "description": "Follows the story of three American teenage girls—each adopted from China—who discover they are blood-related cousins on 23andMe. Their online meeting inspires the young women to confront the burning questions they have about their lost history.",
  "releaseYear": "2021",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9yUFnLw5KkcinnWUzGx8Fll28BN.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 10.0,
    "ending": 5.0,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Director Scott Schirmer has crafted a really interesting allegory in FOUND. Perfect young boy suddenly picked on in school discovers his older brother is a serial killer. What to do? Adults and parents are ineffectual. The world is wrong about everything. Only your brother seems to stand for something. Schirmer's direction is subtle and controlled throughout shocking for a first film and his very nuanced underscoring of the psychosexual underpinnings between brothers, mother and son, father and sons, is downright shocking but so genuine. FOUND may be the best film I've seen about this moment in an American family. Unfortunately, the film meanders and feels too long at only 80 minutes. With a better budget and a bit more skill, FOUND could have packed the punch of Malick combined with a touch of slasher exploitation. A lofty compliment indeed. Another big bravo to Hollywood's Arena Cinema for showing us FOUND."
    },
    {
      "rating": "10",
      "text": "The story delves deep into the nuances of family dynamic like nothing I have ever seen before. Marty is a boy transitioning into his own only to have to deal with bullying, loss of familiarity and the complete and utterly disturbing degradation  of family stability. “found.” is so much more than a horror story, it is a visual ode to a very deep and personal problem lying unmentioned, ignored or unnoticed within our world of paved pathways that guide us along our daily destinations dotted by manicured lawns and cookie-cutter homes. That problem which Schirmer brutally forces us to notice is the complete and utter break down of family cohesion. That one aspect of life that for many of us is an assumed respite, a place of safety and comfort-home, viciously ripped away to expose a darkness that in this film is unequivocally the birth of evil.\r The story plays with you completely from the very beginning. It grabs at your emotional center and squeezes slowly but firmly all the while pushing you to the very edge of tense anguish as felt through the eyes and mind of a child. “found” has done something that so few movies are capable of, it made me reevaluate how I define horror. The characters are so modest and honest that you relate to them in a truly gripping way. It exposes the twisted nature of misguided youth forced to face life with very few answers and nearly absent representation. Then simultaneously placing you head first into racism and bullying. But wait, as if that wasn’t enough to make this well defined nightmare affective there is an added element that forces you as a viewer to test your limit of what is acceptable horror. It is a question that people have argued for quite some time- are horror films warping young people? This is truly the first time that I have seen that subject matter carefully and poignantly dealt with in the horror industry in such an honest manner.\r In my opinion this is truly a masterful tale of terror that carries a deeper message that needs to be addressed, and manages to do so in a fresh and exciting way. It carries all the emotion of surrealistic art film, complete brutality and gore of a horror film in the most systematically harmonious ways imaginable. There is an element of truth that this story pulsates from that creates an atmosphere so haunting and tragic. The film is held together by a chilling soundtrack that allows the story with all it’s components to flow seamlessly. Quite frankly I hope more people than just the horror community experiences this film because although the visuals are graphic the heart of the drama is one that needs to be exposed because the true nightmare of this film is the fact that it could very well be happening in your neighborhood or more disturbingly in your very home. I recommend that everyone who comes across this film-watch it!"
    }
  ],
  "recommendations": [
    "a_monster_calls",
    "the_legend_of_la_llorona",
    "before_i_wake",
    "incendies",
    "sweat",
    "swallow",
    "miss_bala",
    "the_silence",
    "eden_lake",
    "his_house",
    "antichrist",
    "stoker",
    "the_road",
    "flashback",
    "mine",
    "the_impossible",
    "hotel_mumbai",
    "the_way_back",
    "come_play",
    "first_they_killed_my_father",
    "high_life",
    "benedetta",
    "a_hidden_life",
    "the_killing_of_a_sacred_deer",
    "the_boy_who_harnessed_the_wind"
  ]
}