{
  "id": 4068,
  "title": "Four Brothers",
  "starring": [
    "Mark Wahlberg",
    "Tyrese Gibson"
  ],
  "runtime": 109,
  "genre": [
    "Action",
    "Crime"
  ],
  "description": "Four adopted brothers return to their Detroit hometown when their mother is murdered and vow to exact revenge on the killers.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8cO39cnWSZQi2ncPG5TxL3YRzKc.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 5.705882352941177,
    "ending": 6.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is one of my all time favorite movies. Yeah it may not be the most real movie ever but neither is fast in the furious or transformers. The plot along with some great acting made this movie"
    },
    {
      "rating": "10",
      "text": "I honestly have never understood why this movie has never been liked.  It wasn't made to be artsy though Chris Singleton does a great job with the film especially because it could easily have been terrible.  My first Mark Wahlberg film and still my favorite."
    },
    {
      "rating": "8",
      "text": "I am suprised that I liked this movie as much as I did. I think it worked out perfectly and while the whole situation is rather generic and corny, It just has that \"It\" factor that just pulls you in."
    },
    {
      "rating": "7",
      "text": "I agree with Eddie. I thought it was a rather enjoyable movie. The acting was ok, The plot was average, but the action was enjoyable. I liked it quite a bit."
    },
    {
      "rating": "6",
      "text": "A gripping tale. Emotionally powerful action packed drama."
    },
    {
      "rating": "10",
      "text": "..................................................................................................................................................... agreatmovie"
    },
    {
      "rating": "10",
      "text": "I've seen this movie about 30 times,its incredible.The acting by everyone in the movie is outstanding.I put this movie right up there with crash but in a different way cause its a different kind of movie.I advise everyone to watch this movie cause you will love it!"
    },
    {
      "rating": "10",
      "text": "Extremely good movie, highly recomend it to anyone!"
    },
    {
      "rating": "8",
      "text": "Through the predictable plot lies great performances, incredible story-line and a director that prooves himself great. Stunning material that in end leaves us in total awe."
    },
    {
      "rating": "10",
      "text": "Excelente Filme de vingança,Mark Wahlberg,Tyrese Gibson,Andre Benjamin,Garrett Hedlund são excelentes como os quatro irmãos e Chiwetel Ejiofor faz um excelente vilão. Muita ação,comédia cenas de arrebentar Fionnula Flanagan é excelente como a mãe dos irmãos.\rCom um brilhante roteiro de David Elliot e Paul Lovett.\rCom uma excelente direção de John Singleton.\rUm Excelente filme em todos os aspectos."
    },
    {
      "rating": "10",
      "text": "........................................................................................................................................................Good Flick"
    },
    {
      "rating": "4",
      "text": "Started out with a good idea, but it went downhill from there."
    },
    {
      "rating": "0",
      "text": "The absolute worst movie of all time. The only explanation is that the actors and directors were drunk and on drugs at the time they made this. Can we request for this film to be permanently erased from human history?"
    },
    {
      "rating": "0",
      "text": "This was a horrible movie. None of the main characters had any redeeming features. It was predictable. It was boring. The action and acting left a lot to be desired. This tops the list right now as the worst movie I have ever seen. I tried to turn my brain off and enjoy it as \"pure entertainment\". The fact is, its just not entertaining at all."
    },
    {
      "rating": "4",
      "text": "Does anyone at Paramount Pictures have an original bone in his or her body anymore, or was having them all surgically removed a prerequisite for employment? Their entire roster of motion pictures over the last year seems to have consisted solely of remakes of past successes (Alfie, The Longest Yard, War of the Worlds, The Bad News Bears) that, to a one, served only to remind everybody of how terrific the originals were (...and maybe prompt people to purchase them on DVD? Hmmmmm! I guess I have to take it all back; great business strategy, guys!) At any rate, the hits just keep on getting regurgitated: the latest is John Singleton's present-day urban variation on the competent but forgettable 1965 John Wayne/ Dean Martin/ Earl Holliman/ Michael Anderson Jr. western The Sons of Katie Elder, with Mark Wahlberg, Tyrese Gibson, Andre Benjamin and Garrett Hedlund as one-time seriously troubled youths who are taken under the wing of a beneficient woman who sets them right--but not SO right that they're unable to exact a notably bloody, streetwise revenge on her killers. (In an unintentionally funny piece of dialogue comparing the four antiheroes now to what they would've been had they not been rescued from a life of crime, it's explained that even though they still have plenty of rough edges, they're congressmen compared to what they once were. Huh? In whose fantasy world is a congressman an example of angelic behavior?) The one improvement Singleton makes on the original is that he actually shows the mom--warmly played by Fionnula Flannigan--whereas in the original she had died before the film began and was represented onscreen by her rocking chair. The problem is that Singleton doesn't show ENOUGH of her; the real story, I think, is in what this exceptional woman did to get her self-appointed charges on the right path. But then, I'm not sure that either Singleton knows himself or is all that interested; after she's murdered, the guys mostly drink, screw and stuff themselves with Thanksgiving dinner, and you'd think they'd lost a stray cat that had been hanging around rather than the number one influence on their lives. The actors playing the foursome seem to frequently be acting in different movies; only on rare occasions do they give the impression of being brothers at all--real, adopted or whatever. Remember when a frequent (if often unjustified) criticism of Singleton's post-Boyz N The Hood work (Poetic Justice, Higher Learning, Baby Boy) was that he was trying too hard? Would that the good old days were back: the bulk of Singleton's recent work, from the smoothly-made remake of Shaft to the unashamedly trashy sequel 2 Fast 2 Furious to this, has been slickly made but increasingly lazy and machine-tooled, and this relentlessly routine urban bloodbath is the weakest of the lot. It's all sensation, no resonance: the central message poignantly proclaimed at the end of the groundbreaking Boyz N the Hood was \"Increase the Peace\"; Singleton's philosophy in Four Brothers seems to have morphed into \"Make the Blasts Last\"."
    },
    {
      "rating": "1",
      "text": "Well I have to say it sounds like there's some Four Brothers pushin peeps in here trying to sell the movie! I went into it with an open mind and appreciated the plot idea but it soon began to deteriorate. What gets me is why there was such unrealistic stuff put in to ruin the experience when it didn't have to. Like the Store having the Video of the shooting! The Cops would have had it! Also, pulling a gun out during the basketball game and all those witnesses and no one called the cops! These guys are on parole! Also, you guys are talking about there not being any shooting! Are we talking about the same movie? I thought the directing and acting was decent except for Jack the tatooed guy man he was bad (MOMMY) LOL. If there adopted mother was such a great inspiration and role model then why did they turn out so bad! She would have never agreed with what they did! Also, the cops did a lame job at the investigation of the four brothers (Self Defense) LOL! It was funny how they always stayed one step ahead of the cops. If you watch reality shows like \"The First 48\" on A&E, you would see real life! This movie is typical Hollywood run and gun, over the top, and unrealistic. I'd rather watch Training Day. Pietra, none of this could happen especially with four parolles. And Kiro, I appreciate your opinion but I totally disagree."
    },
    {
      "rating": "5",
      "text": "It is good film."
    },
    {
      "rating": "4",
      "text": "It's not the worst movie ever, but at the end of the day, it was a possibly good crime drama that fell too much into a typical action movie plot with average acting at best. Still a solid source of entertainment regardless."
    },
    {
      "rating": "1",
      "text": "this movie the absolute worst.. omg don't watch don't even read my review because there is no review this movie pure garbage. everything is bad the story 0/10, the directory 0/10 , the casting 0.00.00/10 .. the one who did the casting for this film needs some jail time for this crime.. What the **** idiot."
    },
    {
      "rating": "10",
      "text": "A Pretty good flick of action,thriller with great jokes.............................................. A Masterpiece Underrated for **** up............."
    },
    {
      "rating": "10",
      "text": "........................................................................................19 pessoas imbecis e obsoletas cerebrais que não sabem curti um grande filme de ação,suspense,máfia e boa dose de humor..."
    },
    {
      "rating": "10",
      "text": "Love it."
    },
    {
      "rating": "10",
      "text": "Sure the movie isnt realistic. Neither is Star wars, Lord of the Rings or 90% of the movies in theater. Its about 4 brothers going above and beyond what they were ca[lled to do to avenge their mother. The relationship between the 4 is well done- as I can relate, having 3 younger brothers. Realistic- maybe not- but it makes a hell of a story"
    },
    {
      "rating": "8",
      "text": "I really enjoyed this movie, it has a great, unpredictable story and fantastic acting. I like the relationship between the brothers, and I LOVE that the movie isn't all high Hollywood glam and special effects, it's refreshing."
    },
    {
      "rating": "8",
      "text": "I liked this movie. It's true that some of it is a little farfetched, but I thoroughly enjoyed it anyway."
    },
    {
      "rating": "10",
      "text": "people that havent lived it cant really judge it. life is bad in parts of detroit. sure some of the action is a little off but the underlying story is quite believable ....definitely a movie to watch....i found this moving for heartwrenching and sad...i was also very moved by the main characters.  i could feel their pain...bobby actually reminded me of my hotheaded brother!"
    },
    {
      "rating": "10",
      "text": "Let's face it folks, there are two kinds of people in this world; people who like Neil Diamond and people who don't. Clearly there is a difinitive distinctiion between those of you who can handle what real life is like for people who are trapped in the underworld of poverty and constant loss and those who live in the \"not so real world\" of coffee house blind dates from online dating sites and those of you who's absolute worst life experience was your favorite football team losing 3 consecutive times in a row...In my opinion, this film was real, awesome and depicted what life for so many \"underprivaledged and poor\" blacks can be. God bless the cast and production for fullfilling what it set out to do....Show us how it is!"
    },
    {
      "rating": "10",
      "text": "This is a GREAT film. Ignore the critics and the whinging comments here by people who want realistic gangsta movies so they can connect with a culture they don't belong in. This is a PLAIN AND SIMPLE FUN MOVIE. Some good action, funny moments between characters, and the best plot Hollywood has produced for a while (which isn't saying much, but it's a good plot). The violence isn't over-the-top like other hollywood revenge films like Man-On-Fire. Don't take four brothers serious -- it's not a realistic/serious film, but it's not a comedy. A great boys night movie with mates. So fill up your Jerry can with gas, and get ready for a good night's entertainment. :)"
    },
    {
      "rating": "7",
      "text": "Oh, come one people, this is a stupid movie, but as pure entertainment, which is all is intended to be, it's a whole hell of a lot of fun. Tragic good guys, blacks and whites bonding in a testosterone heavy sinkhole, with a token homo who they love anyway........ what the f.ck more could you ask for in a satisfying really-really bad-bad guys get seriously f@@ked in the finale flick? I loved it."
    },
    {
      "rating": "10",
      "text": "Action, comedy, and a great story makes this movie stand out."
    },
    {
      "rating": "6",
      "text": "Aint this a john wayne movie ??"
    },
    {
      "rating": "10",
      "text": "Critics, bashers, party plungers, and mostly just prissy pissed off people find it more than easy to sit in your chairs and type away offensive, brutal words about the production and their producers, the actors and their acting, and the film and the filming. Four Brothers is an epic tale and should be praised for its bravery to go out into Hollywood and give it something that isn't your classic excuse for guns and fists! The sacred bond between brothers, the display of love and affection that four ex-convicts carry for a loving woman, isn't that something that you should see and say, \"Hey, this isn't cliche. This is the type of material that isn't all gangster shooting, isn't war, and especially isn't a hatred-revenge filled movie.\" Appreciate a fine movie when you see it, and I speak to every critic out there who doesn't appreciate this movie for what its worth, and realize the brave step the producers took into making a movie that wasn't made for the sake of violence."
    },
    {
      "rating": "10",
      "text": "Excellent movie! I loved this movie and it's hard for me to say that about any drama since I'm a big horror fan. But this movie just kept me entertained and hooked the whole time. Everything was great; the writing, acting, and plot. Most gangster movies give you characters that make you feel absolutely no sympathy for them what-so-ever. This movie made it hard not to be. Although I have liked to know about more about the four brothers pasts."
    },
    {
      "rating": "10",
      "text": "Four Brothers is one of those rare movies that show you that when push comes to shove your brothers got your back.Four brothers focus on the Mercer brothers, Bobby, Angel, Jerry & Jack who come back to there home town of Detroit to bury there adopted mother and her killer. It's a totally engrossing and powerful action drama that will have you on the edge of your seat, and also at the same time making you feel the pain the mercer boys' feel. This movie from producer/director John Singleton goes to show you just because you don't look anything alike, doesn't mean your not brother's. I very highly recommend this movie."
    },
    {
      "rating": "7",
      "text": "The plot is very slow after the initial murder of Evelyn Mercer and this may have put many off. It does, however pick up towards the middle third and by the end it has reached full throttle. The gritty realism of the story is enhanced by the winter scenes on the streets of Detroit. I can’t say I was overly enthused by the choice of music throughout, but then it’s not really my scene man. The performances were all excellent with Mark Wahlberg and Tyrese Gibson taking most of the spotlight, but I thought nobody put a foot wrong throughout. Over all a gritty realistic and sometimes brutal revenge thriller. Maybe a little too slow for some in the beginning but the pace does pick up (I promise).\r SteelMonster’s verdict: RECOMMENDED\r My score: 7.2/10"
    },
    {
      "rating": "3",
      "text": "A poor movie, with a loose story. The brothers aren't believable, you are thrown from kill to kill with little understanding as to why they are doing this. The police always seem to be one step behind, which is just not believable with this movie, they brothers aren't expert criminals, just delinquents. Do not watch unless you have a lot of spare time."
    },
    {
      "rating": "4",
      "text": "I'll be generous and give this one a 4. But seriously...one of the dumbest endings of all-time."
    },
    {
      "rating": "7",
      "text": "The movie was well acted, entertaining and the action scenes were well made. Of course, the movie has it's flaws. There are a few plot holes and some events were unbelievable.Four Brothers is not one of the best action dramas out there but it will entertain you from beginning to end."
    },
    {
      "rating": "6",
      "text": "Four Brothers classic action movie. A simple story about revenge. Good acting by Mark Wahlberg. Once you can see."
    }
  ]
}