{"id": 1270, "title": "Four Good Days", "starring": ["Glenn Close", "Mila Kunis"], "runtime": 100, "genre": ["Drama"], "description": "A mother helps her daughter work through four crucial days of recovery from substance abuse.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/uaJmqZxwAsdFLLjPGH5DzIEnbpj.jpg", "categories": {"plot": 5.0, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "It's grueling to come up and watch a movie like this, because not only is it completely predictable, it's also completely expendable.This is a inside the box drama. Seen many times before, and with the more than constant sentimental manipulations of the argument.So even with the good performances of Glenn Close and Mila Kunis, this film will not be able to overcome its own barrier of predictability, because at heart this is just a showcase of performances.They're good, true, but these will never be memorable.Four Good Days is primarily a momentary splinter of entertainment that you can find right now, but it will not add anything to the careers of those involved, not even Kunis herself who had never been challenged to this extent, let alone someone with Glenn Close's legacy.So if you want to give it a chance, be aware of what awaits you."}, {"rating": "4", "text": "(Mauro Lanari)RT: \"It struggles to bring authenticity to its tragic source material and strands its talent in a too bland melodrama to emotionally resonate\"."}], "recommendations": ["21_grams", "the_theory_of_everything", "manchester_by_the_sea", "the_impossible", "the_danish_girl", "marriage_story", "only_the_brave", "the_starling", "joy", "eddie_the_eagle", "the_father", "scent_of_a_woman", "blue_valentine", "just_mercy", "gifted", "worth", "the_good_shepherd", "belfast", "a_beautiful_mind", "the_infiltrator", "the_big_short", "whiplash", "the_imitation_game", "catch_me_if_you_can", "the_master"]}