{
  "id": 1622,
  "title": "Fracture",
  "starring": [
    "Anthony Hopkins",
    "Ryan Gosling"
  ],
  "runtime": 113,
  "genre": [
    "Thriller"
  ],
  "description": "A husband is on trial for the attempted murder of his wife, in what is seemingly an open/shut case for the ambitious district attorney trying to put him away. However, there are surprises for both around every corner, and, as a suspenseful game of cat-and-mouse is played out, each must manipulate and outwit the other.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qNen8x5gaikjIg9CFihgxYcJwQe.jpg",
  "categories": {
    "plot": 6.15625,
    "acting": 6.103448275862069,
    "ending": 4.555555555555555,
    "soundtrack": 4.0,
    "cinematography": 4.666666666666667,
    "familyFriendly": 3.0,
    "funny": 6.666666666666667,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Great movie.  Anthony Hopkins delivers.  But there is one troubling aspect of this movie.  When Willy Beachum ask his assistant Mona (played by Zoe Kazan) to standby to receive a call requesting she enter the courtroom and mention the finding of fake evidence - she was all for it.  She was all in for committing a crime that would have sent a man to jail for life.  Shocking."
    },
    {
      "rating": "9",
      "text": "Anthony Hopkins and Ryan Gosling make a great couple. The murderer who devises the perfect plan and the lawyer who redeems himself and understands his mistakes.Gregory Hoblit really did a great job."
    },
    {
      "rating": "9",
      "text": "higugyfyguguuggufttdgjghsrtfguihihkhvhtdugyfsestbuojhjyfdtguguguguihhfsrdtubojugtssrfguighufdtdihihdtetfgjfswssm"
    },
    {
      "rating": "9",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●"
    },
    {
      "rating": "9",
      "text": "+++++++×××××××××××÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷××××++++++÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "9",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "9",
      "text": "°》°》°》°》°》°》°》°》°》⊙》°》°》°》°》°》°》°》°》°》°》°》°@;@;@;@;@;@;@;@;@;;@;@;@;@;@;@;@;@:@::@:@:@:@:@:@:@:@:@:"
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."
    },
    {
      "rating": "9",
      "text": "♤♡♤♡♤♡♤♡♤♡♡♡♤♡♤♡♤♡♡♡♡♤♡♤♡♤♡♡♡♤♡♤♡♤♡¡¿¡¡》¡¿¡¿》¿¡¿¡》¡¿¡¿》¿¡¿¡》¡¿¡¿》¡¿¡¿》¡¿¡¿》¡¿¡¡》¡¿¡¿》"
    },
    {
      "rating": "9",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡°¡°¡•¡°¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"
    },
    {
      "rating": "9",
      "text": "{}{}{}{}{}{}{}{}{}{}{}{}{}[][][][][][][][]][][][][][][]!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "********************************************************》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》"
    },
    {
      "rating": "9",
      "text": "Intriguing story that kept me interested with a sprinkle of laugh out loud lines. Entertaining, if a bit obvious. Even though you sort of know how it will end, it has a nice twist. Left me feeling good about the outcome and the excellent acting."
    },
    {
      "rating": "9",
      "text": "=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:___________________________♡◇♡◇♡◇♡◇♡◇♡♡"
    },
    {
      "rating": "9",
      "text": "÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷++*+*+*+*+*+*+*+*+*+*+*+*+**+●》●》●》●》●》●》●》●》■¡■¡■¡■¡■◇■◇■◇■◇■"
    },
    {
      "rating": "10",
      "text": "Anthony and Ryan are both perfect for there roles, and work very well together.  I was really surprised at how great this movie was.  The first scene of the movie shows Anthony murdering his wife but the real drive of the movie is how Ryan is going to implicate Anthony for the crime, intense and humorous at times and never dull."
    },
    {
      "rating": "8",
      "text": "One of those rare thrillers that first confounds then satisfies with a logical and satisfying ending as all the pieces come together."
    },
    {
      "rating": "5",
      "text": "Plenty of other better movies to go see. Not even something you need to catch on DVD. Unless you've already watched every good movie available, don't waste your time with this. It reminded me a lot of the director's much better film, \"Primal Fear,\" but it never came close to reaching that film's genius. I think that Anthony Hopkins needs to stop playing roles that are so similar to Hannibal Lecter before that's the only type of part he is offered. Or maybe it already is. It seems as though he tried to make his character more interesting (did anyone else notice the very subtle accent?) but what the character needed was to be WRITTEN more interesting. I never understood just exactly what his character did for a living. We were given a basic idea, but I think more of an exploration into his mind would've allowed for a better film. His ball bearing devices that litter his office and home suggest a much more interesting man. Gosling is great, and this was the first film I've seen him in. This is merely a stepping stone for him to better films. I wish I could say I saw all the twists coming, but I didn't. I've never been good at predicting what's going to happen before it happens unless it's blatantly obvious. But it doesn't matter, because when the answers were revealed, they were completely uninteresting. Boring film. Don't waste your time on it."
    },
    {
      "rating": "2",
      "text": "Plot spoiler warning! As a lawyer, I can say there were two major flaws in the plot. First, the notion of double jeopardy is nonsense. Crawford was never tried and acquitted, the charges were dropped for lack of evidence. Hence, they could be refiled if new evidence came to light. That said, being guilty of murder didn't make sense if he couldn't be charged with attempted murder. His wife died because the hospital turned off her respirator, which they were presumably entitled to do under the law, with his permission. How can that be murder if under the double jeopardy concept, he couldn't be charged again with shooting his wife? Doesn't compute. Aesthetically, I thought Willy was obnoxious and his \"conversion\" was laughable. And the affair of a gorgeous senior partner with an incoming jr. associate.......in your dreams."
    },
    {
      "rating": "7",
      "text": "Anthony Hopkins can't really shake off the Hannibal Lector tag & I kept expecting him to put on a blue jumpsuit at any moment. And what was his accent all about? Welsh, Irish, American? Few twists here & there & pretty well acted throughout."
    },
    {
      "rating": "2",
      "text": "Crime dramas like these, which only exist to keep you guessing until the end about the criminal mastermind's seemingly perfect crime, sort of have to make sense for that idea to work. Fracture doesn't fulfill that criteria. The legal proceedings are riddled with creative liberties, making the entire thing a fiasco. The ending turns out to be laughably stupid, and the bad guy is predictably caught doing something insanely dumb...except what he's doing wouldn't actually be a retrial for a separate crime as it is in the film, since he didn't murder his wife, they pulled the plug on her in the hospital. His attempted murder charge still stands, but murder does not, and that's sort of a ridiculous way to catch him at the end. Also, since when do criminal masterminds openly brag to others about getting away with attempted murder all by themselves? Did it not occur to this guy that someone else might possibly be listening in somewhere? You're only talking to the goddamned prosecutor that will do anything to take you down, and you're openly admitting as loud as possible that you shot your wife and then got away with it? The \"twist\" as to why there's no evidence is also just stupid. It's circumstantial evidence and would never hold up in court, as it's nothing more than a theory by the prosecution that can't possibly be proven. All the bad guy has to do is deny it, and that's the end of it, since there's no evidence linking the events together, which was sort of the whole goddamned point of his plan. That's not evidence. If the bad guy had just said, \"Get out\" once he saw this prosecutor enter the premises, he would have gotten away with everything. Instead, he takes the opportunity to laugh and gloat about his perfect murder. And then, look at that, no one saw this coming: People are listening outside. Oops! Must've forgotten to read about how many criminals get caught by bragging about it in local bars. None of the characters besides Hopkins are the slightest bit interesting, so any time he's not on screen, we're just waiting for him to turn the tables on the prosecutor again, due to the prosecution's seemingly impossible stupidity. The rest of the plot seemed like it was just filler. With an ending and a twist this bad, not to mention one that doesn't make any sense, with a legal rule that's badly misinterpreted and totally bogus to finally catch the bad guy, the film just has no excuse."
    },
    {
      "rating": "8",
      "text": "I liked it. Hopkins was a beast in this film and the supporting cast was fine as well. It was interesting from start to finish and it ended perfectly. The one flaw was that is was a little too long, Other then that it was good."
    },
    {
      "rating": "6",
      "text": "Fracture is a fine lawyer  criminal face-off between Ryan Gosling and Hannibal Lecter... Oh, I mean Anthony Hopkins. No, wait. I mean Hannibal Lecter. Quite why Hopkins thinks he can just play Lecter in a different film with a different name and no-one will notice is a bit disconcerting, but the movie is still a good bit of fun."
    },
    {
      "rating": "6",
      "text": "This was a very well done movie. The acting was incredibly solid and the story was very well written. The only issue that I had with this movie was that it became a little slow in some spots. This is definitely a movie that court room thriller fans need to check out as well as fans of Anthony Hopkins because he was amazing in this movie."
    },
    {
      "rating": "7",
      "text": "It was actually a pretty solid film overall. Hopkins ,as always, is an amazing lead and definently the driving force of this film. Gosling wasnt that good though and disapointed me quite a bit, The rest of the cast is a little below average as well. It had a good plot that kept you interested from start to finish. Well worth watching imo."
    },
    {
      "rating": "6",
      "text": "Amidst the hay-days of the murder mystery genre, Fracture is refreshing. Anthony Hopkins may lean on Hannibal Lector for influence but he and Ryan Gosling are a surprisingly great match."
    },
    {
      "rating": "7",
      "text": "I am a sucker for a good courtroom drama and this is certainly one. It is certainly formulaic in parts, but is still very well done as a whole. Both Anthony Hopkins and Ryan Gosling, the latter of which I am not typically a huge fan of, did fantastic and really made for really interesting leads. On top of it, the plot was absolutely gripping and really had you guessing as to how it would end (however it does become clear towards the end). However, the film is never really great. At many turns, it is quite good, but really, it is just a solid entry in both Hopkins and Gosling's filmographies. The film certainly is not Oscar worthy, but it is still very entertaining largely thanks to its two leads who really are at the root of why this film is successful. Without them, it really would have fallen flat, even with the compelling storyline."
    },
    {
      "rating": "5",
      "text": "In 'Fracture,' shameless conviction.\r A movie about shamelessness should be shameless itself. And for five minutes here and there, ‘‘Fracture’’ does a passable job. In fact, Anthony Hopkins, who plays a genius structural engineer who shoots his wife and then represents himself at the trial, has rarely demonstrated less shame than he does in this preposterous courtroom thriller. Nor has Ryan Gosling. Although at about a third of Hopkins’s age, he has decades to top his oily performance as opposing counsel.\r The film is neither a whodunit nor a whydunit. We know both. Hopkins’s character, Ted Crawford, pulls the trigger because his wife (Embeth Davidtz) has been having an affair. Not long after the shooting, a detective (Billy Burke) arrives at the Crawfords’ great big Southern California home, and to his shock discovers that the woman on the floor is the very one he’d been seeing. Ted goes to jail, willingly confesses, and relishes the fact that Gosling’s district attorney, Willy Beachum (what a name), will try to put him away.\r Willy is the movie’s favorite kind of lawyer: hotshot. This one is about to move on to bigger things — a fancy new job at a corporate firm, where he can work alongside the icy dame (Rosamund Pike) who recruited and bedded him. But his 97 percent conviction rate and Ted’s obvious gamesmanship (that the wife’s lover took Ted’s confession nullifies Willy’s entire case) compel him to find a new angle to prosecute. Ted chooses to be his own defense attorney, claiming he knows nothing about the law. But he’s obviously better at it than Willy. Fiona Shaw plays the presiding judge, and she looks rightly confused and exasperated.\r The movie seems so content to be smarter than you’re expecting that it never amounts to more than a talky tease. What’s breezy about the first half of the picture turns logy in the second. The entire film is hung on a shrugging legal plot twist that, years ago, managed to inspire a whole Ashley Judd vehicle. And since Hopkins is far too likable as a would-be cold-blooded murderer (whose wife, mind you, remains in a coma) the movie has to settle for a humane ending that also feels like a shrug.\r ‘‘Fracture’’ was written by Daniel Pyne and Glenn Gers and directed by Gregory Hoblit, whose last legal thriller, ‘‘Primal Fear,’’ was more enjoyably hokey. The new movie isn’t stupid, however. The screenplay has its share of fun, snappy dialogue, and there’s no shortage of good actors to deliver it, from Shaw and Pike, to David Strathairn, as Willy’s boss, Cliff Curtis, as a detective, and Bob Gunton, as Pike’s father.\r Then there’s Gosling and Sir Anthony slinging ham at each other. They spend their scenes crossing accents. Gosling’s has a backwoods lilt that evokes possums, beer cozies, and spritzes of cheap cologne. Hopkins might be using his native Welsh brogue. Who can say, since to me he doesn’t ever sound the same way twice?\r In any case, you needn’t actually see ‘‘Fracture’’ to know that if the charge is acting that winks, these two are guilty."
    },
    {
      "rating": "8",
      "text": "Courtroom drama is held in well inspires Anthony Hopkins as a witt, cold- heart murder. Ryan Gosling even does a remarkable performance. Suitable doses thriller with an ending ellipsis."
    },
    {
      "rating": "8",
      "text": "The excellent movie with fine acting of great Anthony Hopkins. He so perfectly plays that you in literal sense begin to hate his character. Ryan Gosling has played perfectly, one of his best works too. The movie on a plot is simple also the final it is quite expected, but as actors have perfectly played in him."
    },
    {
      "rating": "3",
      "text": "Film procédurier typique avec rebondissement in extremis téléphoné à la clé et une fin qui ne me plaît guère, pour ne pas dire pas du tout... Le film souffre également de longueurs et le rôle de Rosamund ne sert strictement à rien, même si elle est belle, bien coiffée, bien fardée et prête pour son défilé de mode...Ce qui est plus intéressant réside dans le face-à-face entre Ryan et Anthony avec mention très spéciale pour le vieux, sardonique et machiavélique à souhait... c'est tout-à-fait le genre de méchant monsieur qu'on applaudit à tout rompre pour son charisme et son intelligence, à la manière peut-être d'un certain Monsieur Lecter d'ailleurs.Mais la morale hollywoodienne vient à la rescousse avec son vice rebondissant de procédure, peu vraisemblable et tiré par les cheveux. Mais cela dit, si on entre dans les détails, ce genre de polar démonstratif ne tient pas debout deux secondes...Une idée néanmoins intéressante sur le papier et un Sieur Anthony qui nous fait jubiler et ricaner en même temps... mais l'exécution (si je puis dire) est ici beaucoup trop à la masse avec la fin pourrie directement sortie du Kinder Surprise."
    },
    {
      "rating": "6",
      "text": "never less than a \"check\"..Fracture Fracture is a plot driven courtroom drama among a lawyer at its prime prosecuting an already confessed guilty who now is defending his case with no whatsoever experience. It is surprisingly hilarious with much more mature humor installed in with suave note that it never seems forced and cheeky. The narration is fast paced with tightly packed screenplay that is gripping if not layered and thoroughly entertaining for its runtime. Amidst all these highly pitched dramatic sequences it fails to draw out the emotions especially concerning the relations and chemistry since the frustration and the irritation described and portrayed for the protagonist communicates clearly. The background score is exhilarating if not scored extraordinarily and along with decent cinematography and fine editing, the boat floats safely on technical aspects. Gosling is vulnerable but still resists it on each frame against the master Hopkins whose reputation is justified in here with a cunning script and slick chess moves that were never less than a \"check\". The script aces on enfolding newer territories and bold turns and choices that it makes which is not only to bedazzle the viewers but also justifies it considering each perspective. Hoblit's execution might be decent and palpable to its tone but what stands out in here, is the world created by him that feeds itself on nothing but nature and that is something which doesn't come often. The only thing that itches throughout the course is the procedure through which the makers either rush up or skips few beats. The gripping screenplay, the enthralling high stakes through which it conveys its subject and Gosling's stellar performances are the high points of the feature. Fracture not only breaks but shatters expectations that results into never wearing off euphoric energy for the viewers, actors and makers."
    },
    {
      "rating": "4",
      "text": "Good, but still could improve.In this \"court movie\" we have the simple situation of a vain lawyer, accustomed to winning cases, who is faced with the difficult task of proving that a powerful businessman killed his wife. Cold and thoughtful, he manages to anticipate every step of the prosecution lawyer and is determined to seize every asset to confuse and shuffle him. To make matters even more complicated, the prosecution lawyer is in the process of being hired to work in a large and important business law firm, and hiring largely depends on his performance in this case.I have little to say about the script ... the story seems to me well built and developed, and the twists that happen are, in fact, what keeps people stuck in the film. However, it is not very credible, it could be even better and there are some loose ends that can bother you. Plus, it's a bit predictable. Ryan Gosling is convincing in his character. Together with veteran Anthony Hopkins, who gave life to the villain, dominates the film, and how the two characters interact and provoke help greatly to maintain the interest of the public. We really want to know which of the two will come out on top. The remaining cast is limited to the space that the two protagonists leave free. I would particularly highlight the good contribution of Fiona Shaw. Rosamund Pike, meanwhile, despite being like a fish in the water on yet another ice cold character, seems to be left in the film. Technically, the film has quality as well. Good camera game, nice color and light, a regular soundtrack but it does what it needs to do.Overall, this movie does what it claims to do, but it can not do enough to exceed what it is regular and become truly good."
    },
    {
      "rating": "9",
      "text": "Not perfect, but interesting. See if you can figure it out before the solution becomes obvious. Engrossing. I particularly loved Crawfords house!"
    },
    {
      "rating": "10",
      "text": "Great movie! Gosling and Hopkins are both unic actors."
    },
    {
      "rating": "7",
      "text": "While the female characters were either lecherous wives, doe-eyed secretaries, or over-sexed attorneys---making for less-than-modern characterization---beholding the craftiness, suspense, and well-placed humor made this movie well worth the time and money spent."
    },
    {
      "rating": "6",
      "text": "Extremely well-acted legal thriller with some unfortunate plot holes. Ryan Gosling more than holds his own up against one of our finest actors, Anthony Hopkins."
    },
    {
      "rating": "6",
      "text": "Sadly, an audience that pays more attention to the film than Willy does to his case, is made to wait for a transparent gimmick to completely unfold. What texture is present does not stick to the two dimensional characters built out of Hollywood gloss. It's perhaps an interesting diversion, but hardly satisfying."
    },
    {
      "rating": "7",
      "text": "Good plot and great acting. However, there's no way a character as clever as Ted would not have known about the law concerning double jeopardy."
    },
    {
      "rating": "8",
      "text": "Gosling and Hopkins play great off one another. A fun thriller with a great cast."
    },
    {
      "rating": "2",
      "text": "I have to agree with Leslie H. The only amusing parts of this film come from Anthony Hopkins few charming scenes that'll put a smile on your face. You end up cheering for the bad guy to get away in this movie because the lawyer he's up against in a total A-Hole who only cares about himself. Also, the romantic aspect of this film where the hot shot lawyer is having a sexual relationship with his boss, which makes you hate him even more, serves no purpose to the entire storyline. The ended that was suppose to put a \"Oooh!\" on your face really ended up being a \"Whatever...\" The twist at the end was so ridiculous and obvious half way through the movie, that I lost all interest in the storyline. I originally put this movie at a 3, but as I write more bad things about it, I realized this movie really deserves a 2!"
    },
    {
      "rating": "7",
      "text": "Good enough. Hopkins was good as a jealous husband, but this is certainly not Oscar material."
    },
    {
      "rating": "6",
      "text": "Just wanted to say, Cindy N. you need to learn how not to spoil the movie for other people. Revealing key plot twists is inconsiderate and rude. Please learn how not to ruin it for other people, just for the sake of trying to look smart."
    },
    {
      "rating": "6",
      "text": "Generally as an attorney I am able to appreciate literary license and understand that a film can not 100% reflect the realities of the law. But I do expect some basis in reality. The legal errors were so glaring that I was unable to enjoy the movie. Just because a defendant waives a preliminary hearing doesn't mean that the trial is going to start the next day. When a defendant files a motion the prosecution has an opportunity to respond, in writing. Judges don't make rulings in chambers, etc. My guess that a police investigator who saw this movie would have their own complaints about police procedure. That being said, Hopkins is still an interesting actor."
    },
    {
      "rating": "9",
      "text": "Great acting, very engaging."
    },
    {
      "rating": "7",
      "text": "Entertaining but with no real good guy to root for, it puts arrogance (Willy) on par with murder (Ted). Really bad part is the ending which is improbable and fatally fractured."
    },
    {
      "rating": "8",
      "text": "I thought the outcome was rather obvious in the beginning, but Hopkins and Gosling still held my attention throughout the remainder of the film. Overall I thought it was an enjoyable movie."
    },
    {
      "rating": "7",
      "text": "Agree with what others have said, great performances, but you could see the 2 major plot twists coming from the next county. Not a big problem for me with this script though, as it was nice to see the \"most likely scenario\" play out without some campy set of extraordinary circumstances being revealed at the last second. Hopkins has the \"genius without a conscience\" character down pat, and perhaps I've just seen it one too many times, so I wasn't overly taken with that performance. However Gosling did pleasantly surprise me, and I found myself vacillating between hoping his character would succeed and wishing for him to fail. He underplayed the requisite moralistic struggle and epiphany scenes just enough to make them part of the movie flow, rather than an all too predicatable sub climax."
    },
    {
      "rating": "7",
      "text": "Many critics and moviegoers have noted the many apparent similarities in characterization and performance between Anthony Hopkins's Ted Crawford, who plots the perfect crime against his unfaithful wife, and Hannibal Lecter. One fundamental difference stands out, however: while nobody would mistake Hannibal \"The Cannibal\" for anything other than evil incarnate, his attraction to FBI agent Clarice Starling (at least in the original Silence of the Lambs) provided a humanizing factor, however brief...but Crawford is nothing more than a thoroughly despicable sociopath with no redeeming qualities beyond a veneer of surface charm which he operates to suit his purposes. The latter can be the only reason why a seemingly intelligent woman like Jennifer (Junebug's Embeth Davidtz) got involved with him in the first place; given that Hopkins looks healthy and fit enough here to outlive us all, she certainly couldn't have been \"pulling an Anna Nicole\"! District Attorney Willy Beachum is easily fooled; he's a rising legal star who through a combination of youthful arrogance and the distraction of a prestigious legal position he's about to step into, unwisely assumes that Crawford's on-the-spot confession after shooting Jennifer constitutes an open and shut case. Yeah, and back in 1975, Brody, Quint and Hooper were just going on a little weekend fishing trip. Competing for your box office dollars with such derivative slashfests as Vacancy and Disturbia, and with Spidey, Shrek and Sparrow just around the corner, Fracture emerges as an intelligent, satisfyingly twist-filled pleasure: the movie equivalent of a guilt-free beach read. One characteristic that Hopkins's work DOES share with Silence is that in both he's such a powerful presence that you think he's onscreen for much more of both films' running time than he actually is. The focal character in Fracture is really Willy, who's the one character whose future (not just what career track he will or won't eventually take but what kind of human being he'll choose to become) is really at stake. Ryan Gosling proves in this role that his surprise Oscar nomination last year as a likable but substance-abusing teacher in the sleeper Half Nelson wasn't just a space-filler; he continually makes offbeat, unpredictable character choices that are a real joy to watch--notice precisely just how he gets out of his lover's bed! Davidtz is such an achingly lovely screen presence that director Gregory Hoblit's use of innumerable close-ups of her (even after she's in a coma) indicates his outrage that industrialist Crawford, by not only attempting to murder her but by shooting her in the face, is committing the ultimate act of natural destruction by defacing such an example of pure beauty, even if Jennifer were doing the horizontal polka with the entire local police force! Ultimately, Fracture's central flaw, especially evidenced in the far-too-restrained absolute final scene before the closing credits roll, is that Hoblit (Primal Fear) isn't quite outraged ENOUGH; in endeavoring to make a courtroom movie in which the prosecutor is the hero that will still appeal to liberals and ACLU supporters in the audience, he's just a little too polite, genteel and distanced. I recently rewatched an old DVD box set consisting of four 1980s Charles Bronson action movies, all directed by J. Lee Thompson (The Guns of Navarone) in the final stages of his long career for those notorious schlockmeisters Menahem Golan and Yoram Globus. The flicks are raw, lurid and occasionally offensive, but at their best (especially Ten to Midnight and Kinjite: Forbidden Subjects, arguably the cream of the box) they really tap into the anger that their audiences undoubtedly feel about murderers and lowlifes who successfully manipulate the American legal system in order not only to get away scot-free with their crimes but to keep committing more of them. As enjoyable as Fracture is, Hoblit clearly needs to be a little less classy and cerebral and a little more down-and-dirty and emotional in his storytelling; silly as this may sound, the man needs to inject a small but vital dose of Golan, Globus and J. Lee Thompson into his soul!"
    },
    {
      "rating": "9",
      "text": "I was spellbound although we figured out what happened to the missing gun as soon as they said it was missing. That kind of put a krimp in things, but it was a very good movie otherwise. I love Anthony Hopkins in anything."
    }
  ],
  "recommendations": [
    "the_lincoln_lawyer",
    "arbitrage",
    "widows",
    "knives_out",
    "outbreak",
    "the_judge",
    "the_little_things",
    "the_unforgivable",
    "the_town",
    "triple_9",
    "prisoners",
    "before_i_go_to_sleep",
    "law_abiding_citizen",
    "conspiracy_theory",
    "a_most_wanted_man",
    "donnie_brasco",
    "richard_jewell",
    "morgan",
    "stillwater",
    "breach",
    "all_the_money_in_the_world",
    "gone_baby_gone",
    "the_king",
    "the_card_counter",
    "the_gunman"
  ]
}