{"id": 4890, "title": "Frantz", "starring": ["Pierre Niney", "Paula Beer"], "runtime": 113, "genre": ["History", "Drama", "Romance"], "description": "In the aftermath of WWI, a young German who grieves the death of her fiancé in France meets a mysterious French man who visits the fiance’s grave to lay flowers.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/nYqtLg8wKNb4YU8qQo08XpLsonj.jpg", "categories": {"plot": 7.466666666666667, "acting": 7.5, "ending": 8.0, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 6.0, "funny": 8.0, "action": 5.0}, "reviews": [{"rating": "6", "text": "A Franco-German movie, it is a historical drama about \"the lost generation\", taking place in a small German town and some places in France immediately after The First World War. A young widow of a German soldier living with her fiance's  parents (Frantz was his name) meets a young French man who came to Germany to visit Frantz's grave.It is a story about love, vengeance and forgiveness.Nice performances across the board. Some episodes and characters seemed overly simplistic and lacking depth. Beautiful cinematography, mostly in black-and-white, but it had a look of unnatural cleanness. Not a masterpiece in my opinion but worth seeing."}, {"rating": "10", "text": "Frantz is a highly romantic, mesmerizing film that is beautifully acted and sensitively directed from start to finish. Unlike the 1932 film it is based on (Broken Lullaby by Ernst Lubitsch), Ozon’s film is flawless in its pacing, gorgeous to look at, and agonizing as you wonder how it will all end for the characters you have come to care about so deeply. Although it’s hard to believe that Ozon could make a film as moving as Under the Sand or as sly as The Swimming Pool, he has."}, {"rating": "6", "text": "Soon after the end WW1, a young Frenchman shows up in a small German town to mourn the loss of his wartime friend. His encounter with the slain soldier's fiancee sets the drama on a complex course. This is beautifully shot (sometimes in black and white and sometimes in color) and rich in evoking the period. François Ozon's filmmaking revels in the slow unfolding of the story and the quiet emotional struggles that develop. An attractive, interesting and well-made look into the struggles of people with conflicting post-war loyalties. (French & German with subtitles)"}, {"rating": "8", "text": "What is the most painful, the war or the lies?This is pleasantly a surprise film. I would say it is this year's the Oscar winning film 'Ida'. Frankly, there's nothing to compare between two. Not just both of them are modern black and white film, but they are quite similar in the portrayal of lead female characters. Just like 'Marie's Story', it was also inspired by another Hollywood film, 'Broken Lullaby'. I haven't seen that. Even not many people have seen it. One of the less known classic drama which I am going to give a try now. Coming back to the film, it was about the World War I that centres on a young woman who lost her fiancé.Nearly two hours drama, quite slowly narrated, but I never felt drag in storytelling or boring to follow it. From the director of 'In the House', yet another masterpiece. Yeah, it looked like that way for me. Only a very few characters and they all developed so well, almost till the end when a few more joined them. The title role was appeared for like only 4-5 minutes in the entire film. Well, that was the topic, a reason for this story to begin along with the WWI. Though the following storyline was built on a different platform.Like there is a saying 'to hide one lie, a thousand lies are needed', that's what this film was actually about. Living and keep on evolving in the endless process. It is a moral, a message film, but the mistake was committed by someone else that another person has to take the fall for it, even after he goes out of the picture. Really a touching story, but not a tearjerker. The journey of life is sometimes unexpected, particularly when it comes to romance that blooms when one needed it last at the circumstance he's at his life.❝What would the truth bring? More pain, more tears.❞This is not a war film, just in case if you are expecting one. It was a subject under everything happen. So, there's only less than 5 minute clips of them in the film. Basically, those clips too were not required, but it's always nice to see them in pictures when a flashback come into play. It is a pure drama that sets in just after the end of the WWI. A young German woman is mourning for the death of her fiancé. She discovers a young French man who claims his close friend came to condole his demise. He meets the rest of the family and shares those happy days he spent with him in Paris before the war. During his stay, they all get along quite well, despite the people from society are against it/him.That was the first half of the film, developed slowly and steadily, but ended with a twist. The following half began on the new direction with lots of mysteries surrounding. Completely unpredictable, yet as a viewer, I had hundred of different thoughts about the upcoming developments. I was somewhat right on most of the occasion, but I was even happier about how it all went on its own style. Now the story entered the France. More twist and turns unfolded. The pace of the story looked the same, though lots of developments made it look advanced very fast.The World War II is the most dominated theme in the war films. When you see a film on WWI, you will come to realise its perspective, if the film was made with the right dose of everything, even if it was not based on the real event or the person. Fighting the war, carrying the wound, grieving for the lost ones, struggling to rebuild the life and the nation. This is definitely one of the best WWI related, I mean about the aftermath of the war films I've seen. The screenplay was magic. I would surely give an award for it. And then the beautiful photography. I don't know it was because of the black and white, but virtually you would be taken back to the 1919. Simple, yet a great camera angles that must be appreciated.Wonderful cast. Without those amazing performances, this film would have been nothing. Anna is the name you would remember for very long and the actress who played it. In a couple places, the screenplay turns semi colour, particularly when musics takes the front stage. Just in case if you are yet to watch, pay attention to that, because not everybody notices that. To me it looks like an Oscar product, but the release date confirms not eligible for the next Oscars. Different people have different opinion, but I think it is a must see. Those who struggle with slow paced narration, if they manage the opening half, then they would enjoy the remaining and love the overall film. Definitely a hidden gem, it just needs more audience, that's all.8.5/10"}, {"rating": "10", "text": "An amazing movie on so many levels that is sure to stay with me for several days  The photography, the acting, the intriguing storyline, the totally unexpected turns - all contribute to a most remarkable movie."}, {"rating": "10", "text": "A rich, unusual film that hits me like a train. Tour de force direction from François Ozon and magnificent performance from 2 leads. Gorgeous cinematography. Full of illumination of humanity and complexity. A film that won't be forgotten."}, {"rating": "8", "text": "This is a very thought-provoking and quite poignant watch. It's ultimately about grief (inevitable death in war) and forgiveness and so its a bit of a sad watch at times. I liked that it is partially black and white, it gives it a bit of a timeless feel to it. Its a relatively arty sort of film as well but not entirely in a pretentious way. The themes are handled sensitively, with quite likeable characters. I would recommend this film to world cinema fans, yes."}], "recommendations": ["incendies", "nomadland", "the_lost_city_of_z", "seven_years_in_tibet", "the_secret_scripture", "the_light_between_oceans", "hostiles", "a_hidden_life", "the_pianist", "the_white_tiger", "the_33", "the_aftermath", "the_way_back", "dances_with_wolves", "the_book_thief", "lion", "allied", "the_last_duel", "free_state_of_jones", "melancholia", "call_me_by_your_name", "a_united_kingdom", "barry_lyndon", "the_dig", "12_years_a_slave"]}