{
  "id": 1595,
  "title": "Freaky",
  "starring": [
    "Vince Vaughn",
    "Kathryn Newton"
  ],
  "runtime": 102,
  "genre": [
    "Comedy",
    "Fantasy",
    "Horror",
    "Thriller"
  ],
  "description": "A mystical, ancient dagger causes a notorious serial killer to magically switch bodies with a 17-year-old girl.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8xC6QSyxrpm0D5A6iyHNemEWBVe.jpg",
  "categories": {
    "plot": 6.0588235294117645,
    "acting": 6.310344827586207,
    "ending": 6.181818181818182,
    "soundtrack": 5.0,
    "cinematography": 2.0,
    "familyFriendly": 3.0,
    "funny": 7.454545454545454,
    "action": 7.5
  },
  "reviews": [
    {
      "rating": "5",
      "text": "A lot of people are comparing it to Freaky Friday, for the body change plot, but frankly the movie I was thinking of, was Rob Rob Schneider's The Hot Chick.Yes, it was fun, considering its serious limitations, but I really don't understand what all the fuss is about."
    },
    {
      "rating": "8",
      "text": "It was awesome, the deaths was mightily impressive and all the cast did the best job."
    },
    {
      "rating": "2",
      "text": "Some of the acting was very poor and the movie relied too much on old tropes like the token gay boy or person of colour.There was also a line near the start of the movie where the boy said he wanted to sounds rapey. Not a vital part of the movie, but made me and my friend uncomfortable.The gore was decent though and suspense was built well through music choice and camera angles/shots."
    },
    {
      "rating": "3",
      "text": "Very boring. What a poor script. Genre depleted. One of the worst films I have ever seen of this actor. It is a film full of clichés and very mushy. What a waste."
    },
    {
      "rating": "8",
      "text": "A fun, bloody spin on body-swapping comedies. It runs into some problems with the cheap gore effects and the fact that it tries to pull a Carrie 2013 and convince us that a conventionally pretty blonde white girl is an unattractive mega-loser, but a memorable Vince Vaughn performance and the way it subtly pays homage to classic slasher films (sans the blatant Friday the 13th callbacks in the opening) made it so Freaky won me over when all was said and done.One thing that's always bugged me about these kind of movies is how different the characters tend to act when they end up in another person's body. Like how in Shazam! Billy Batson only behaved like a kid when he turned into Zachary Levi, among countless other examples. This is something Freaky manages to avoid however. Vaughn portrays protagonist \"Millie Kessler\" with the exact same energy Kathryn Newton does when the big soul-switcheroo takes place, never overplaying his role as a teenage girl for laughs the way Jamie Lee Curtis did back in 2003. A move that actually makes things a whole lot funnier.I was surprised to find that on top of the humor and gleefully over-the-top murder, there's a little bit of heart here too. Nothing that will bring tears to your eyes or stick with you after the credits have rolled, but as hard as it may be to buy into Millie's schoolyard troubles as the type of girl boys don't look twice at, particularly when she's got a butt like that, her familial struggles centered around the loss of their patriarch does lead to a bit of sentimentality whenever her sister and mother are onscreen.Of course, what's really going to pull you in are the antics that unfold as our lead tries to get back into her body before she becomes stuck inside of a serial killer forever. The resulting string of hilarious and cartoonishly violent scenarios are enough of a blast to make you overlook it's handful of flaws, like how things get wrapped up so neatly and without questions or repercussions despite Millie and her pals' suspicious behavior. Freaky simply provides enough clever twists on well-worn concepts via its combination of genres to be worth engaging in the required suspension of disbelief."
    },
    {
      "rating": "1",
      "text": "\"Never underestimate the propensity for violence of a straight white man.\" this is the 2nd character to speak just as the movie starts. More woke trash, avoid, unless you like woke movies.This could have been interesting and fun, but had  to go woke."
    },
    {
      "rating": "7",
      "text": "If \"Freaky Friday\" met \"Scream\". An interesting film with a sorta original concept, though at times it really can fall into a lazy teen-show writing. Overall worth the watch."
    },
    {
      "rating": "6",
      "text": "More woke than it was thrilling, Freaky's interesting body swapping plot provided more than as much fun than I expected. It's clearly a project where everyone who worked on it had fun but in such an oversaturated genre it did little to break new ground. Average but entertaining to watch."
    },
    {
      "rating": "6",
      "text": "As with many horror movies of this style it tends to stumble towards the end when it gets to the last chase scenes. It overstays its welcome. And the final scenes and thereby the last 10 minutes are just unnecessary.The premise, at least on paper, is interesting and has potential for some backwards who-is-who chase scenes. It tries to work some of that in with mixed results.Overall it was entertaining."
    },
    {
      "rating": "5",
      "text": "Of course these type films are supposed to be cheesy fun and aren't to be taken seriously, but this one has way more negatives than positives to be enjoyable. Freaky steals bits and pieces from every other comedy/horror/teen romance movie, without an original thought of it's own, and not in any kind of intelligent homage way either. It's not near as clever as Scream, Happy Death Day or even Freaky Friday. This movie takes the low road with way too many F-bombs and vulgar slurs (yea, I know they're teens but it's little much) and these characters are boring, poorly acted, stereotyped teens. To top it off, the slasher and gore scenes were low budget and not very creative. On the plus side, Vince Vaughn was surprisingly adorable playing a teen girl and there are a few, very few, fun moments IMHO. April 2021"
    },
    {
      "rating": "6",
      "text": "Could have been really good if it stuck to more horror and more odd but slowly gets cheesier and less interesting and ultimately loses its steam before reaching the destination. The first half is an 8 the second half is a 4. Do yourself a favor and stop at the thrift store"
    },
    {
      "rating": "5",
      "text": "I'd give the movie 7 stars, but the casual racism and sexism right at the start left a sour taste in my mouth which made it hard to enjoy the rest.\"Never underestimate the propensity for violence of a straight black man.\""
    },
    {
      "rating": "7",
      "text": "Amazing slasher comedy, the story was simple and the acting was good,the character switching and gender jokes were nice and the usual school and teenage stuff with it the friends getting together to save the day with amazing covering of other characters arcs and the love stuff blending with literal brutal bloody kills and entertatining situations all over it was a good movie although the ending felt little extra with the extending scene but still good time watching it."
    },
    {
      "rating": "7",
      "text": "The main reason to see this film to enjoy 6’5” Vince Vaughn playing a flighty teenage girl, although Misha Osherovich (as the gay friend) has the best punchlines. This is a hybrid between the Freaky Friday movies (2 people exchange bodies) and the Friday the 13th serial killer series. Kathryn Newton plays the teen whose body is switched with The Butcher (Vaughn). Comic chaos ensues. While there the expected clever kills, most of the film has the teens frantically racing around to save their friend from a lifetime in the wrong body. It’s high energy and although never especially clever, still lots of fun for the genre and for Vaughn."
    },
    {
      "rating": "2",
      "text": "Freaky Friday meets horror is another mash-up by the creator of Happy Death Day. Freaky is very similar stylistically to Happy Death Day with emphasis on quick one-liners and gory kills. It also features some pretty good performances by the cast despite having incredibly wooden characters that hit every stereotype. The writing for this movie is basic, to say the least. It is so predictable and unoriginal that it felt like there was no real attempt to try to cover up that they were borrowing so heavily from elsewhere rather than being its own original thing.For that alone, I really can't recommend it. Freaky is a predictable, cliched mess that will leave you disappointed that you wasted your time on it."
    },
    {
      "rating": "7",
      "text": "It’s really fun! Vaughn is having a blast as a teenage girl (like Jack Black in the Jumanji films) and it fits into the quasi-Happy Death Day cinematic universe well"
    },
    {
      "rating": "5",
      "text": "At the end of the movie, Vince Vaughn somehow survives multiple gunshots, and mom is still a drunk. Otherwise, modest entertainment at about the level you'd expect. Everything is adequate."
    },
    {
      "rating": "7",
      "text": "Two things that made this a fun watch: Vince Vaughn and the R rating.Vince Vaughn chews up each scene he's in as both the Jason-esque serial killer and body-swapped teenager. Every time he flails his arms as he runs brings a belly-laugh.And Freaky is a perfect example why they should stop making PG-13 horror movies. Christopher Landon's previous Happy Death Day movies were fun but they felt like they were missing something. I think that something was the ability to let loose.It does lose steam in the middle act with less action and unneeded character development, but you can't go wrong with this flick if you are looking for a bit of escapism."
    },
    {
      "rating": "7",
      "text": "The body-swapping subgenre gets a fresh horror-comedy twist in this film! A young high school girl, Millie (Kathryn Newton) finds herself at the hands of a notorious serial killer (Vince Vaughn), but in an unexpected twist of fate, due to him using an ancient cursed knife to stab her, they find themselves in each other's bodies. Millie, now in the killer's body, must track down and retrieve her own body back with the help of her friends before more innocent lives are taken, and before the swap becomes permanent. Brought to us by the same director and studio that put a horror twist on the time-loop subgenre with the 'Happy Death Day' films, this film takes the premise made most famous by 'Freaky Friday' (hence this film's title), and gives it a fun and campy slasher spin. There's plenty to enjoy here too, espe the performances from both Vaughn and Newton, who both do a great job at playing themselves, but also each other, as they capture the essence of each other quite well when in each other's bodies, making for some really funny and crazy moments. The story felt surprisingly fresh despite being somewhat recycled, and the only minor issue is the slight over-reliance of past horror film homages and cliches thrown around just for the sake of winks and nods without being employed in a clever way usually. The ending also felt a little abrupt and ridiculous, but the ride along the way was well worth it and plenty of fun. Overall, it's got plenty of fun to offer, and even a surprising amount of heart to it too, and Vaughn and Newton are both hilarious, making it easier for me to enjoy and revel in this film's campiness while also being able to mostly overlook the occasional forced horror homage/reference thrown in."
    },
    {
      "rating": "7",
      "text": "I enjoyed it. I do think it is more intended for teenage or early 20s audiences maybe as it also reminds me of typical high school movie, but it still was fun watch."
    },
    {
      "rating": "7",
      "text": "Into the heart of the film with a dagger. It is about a teenage girl that is attacked by a serial killer, unbeknownst to the two, with a ritual dagger that caused their spirits/consciousnesses to be swapped into each other’s bodies. It’s like if Freaky Friday met Friday the 13th, which the film made clear with the “Wednesday the 11th, Thursday the 12th, and Friday the 13th” references and the humors of old and young swapped people flirting and carrying on their personalities in unfitting bodies.This is a dark horror comedy, with emphasis on the teenage splatter film style. It’s purely set in a high schooler with teenagers as the leads with teenage problems like sex, sexuality, love interests, and anything else hormonally charged. The splatter aspect is extremely strong since all of the gore is shocking and absolutely brutal. For someone who spent a lot of time watching some of the goriest films, this one made my stomach turn a bit. I would say it dips into the splatstick genre but the gore is far too sadistic and repulsive. The comedy in the film occurs everywhere else and while the violence is absurd and unrealistic, it remains comically untouched with its ruthlessness.This exegesis has gone on long enough, but if people reading this wanted more analysis, I had thoughts of delving into the psychology of the characters and how their fates are symbolic, or the underlying theme of gender identity and attraction, or the sexual symbolism and sex-driven nature of youth. Let me know by commenting, messaging, or responding to this if you’d be interested in a more in-depth critique, rather than my recapitulation. Overall, it was fun and creative, mixing the worlds of splatter and body swap comedies, possibly being the first body swap horror comedy (besides Seed of Chucky). It’s spattered with annoying story logic flaws and contained to its metaphor for camp box, but that’s only expected for this type of film. It’s fun, refreshing, brutal, and clever so if your stomach is capable, give it a watch and enjoy the ride."
    },
    {
      "rating": "5",
      "text": "Fans of Freaky Friday and Happy Death Day is this the movie for you. I had very low expectations but Freaky turned out to be better than I thought it would. The opening sequence looks like a rejected scene from something like Scream or Halloween but once it gets going you get this silly yet entertaining horror comedy that you’ll enjoy in the moment and probably forget about once you leave the screen.Millie (Kathryn Newton) is a young high school student and has the unfortunate luck of swapping bodies with a deranged serial killer, the butcher (Vince Vaughn). Millie only has 24 hours to figure out how to switch back before the change becomes permanent. She now has the difficult task of trying to convince her friends of her identity and trying to find a way to get her body back before time runs out, all with the backdrop of teenage high school drama and the upcoming homecoming. Which as it turns out is the perfect environment for the butcher to use his new “murder Barbie” disguise to go on a killing spree with an endless supply of unsuspecting victims. Right, the acting is quite bad, aside from Kathryn Newton and Vince Vaughn who are clearly having great fun filming this. The rest I’m sorry, I know they’re supposed to be annoying teens but it was a lot to take. The story plays out how you’d expect, but at least you’ll probably cringe and laugh along the way. Every scene squeezes in as many horror movie tropes and clichés as it possibly can. You’re constantly reminded of other slasher movies that came before it. From the blonde running away from the knife wielding maniac and then falling at a crucial point all the way to “oh let’s split up and search for the murderer. What a great idea, nothing will possibly go wrong with that scenario.” Yes it’s cringey and predictable but it’s also fun, gory and completely ridiculous.Look it’s not the greatest thing you’ll watch all year but right now options are limited. So if you’re in the mood for a comedy horror flick where Vince Vaughn switches bodies with a high school student then Freaky will keep you entertained for the most part. Recommended for all you Freaky Friday/Happy Death Day fans."
    },
    {
      "rating": "10",
      "text": "Just watched Freaky on HBO Max and is was so good, one of the best horror-comedy movies I've ever watched. They blended gruesome and smart kills and suspenseful moments with funny jokes and a hilarious and very weird body swap to perfectly make the movie equally funny, scary, and suspenseful. Vince Vaughn and Kathryn Newton gave outstanding performances, Vince did an amazingly hilarious job at embodying a teenage girl and Kathryn Newton was excellent at portraying a serial killer in a teenage girls body she was cool, creepy, and scary while still bringing funny dark humor. Misha Osherovich, Celeste O'Connor, and Uriah Shelton gave terrific supporting performances, they were hilarious. The special effects were superb, the kills were so realistic looking. An A+ horror-comedy movie."
    },
    {
      "rating": "8",
      "text": "FREAKY whoops so much ass. Plain and simple. Vince Vaughn is at his delightful best here with one of the best films directed by Christopher Landon, a horror icon in his own right at this point. The body swap is played up for ultimate laughs and one good showdown scene. Kathryn Newton shines bright in this one too, just like every role she's given so far, so par for the course. A fun, funny, and downright badass homage to slasher films, FREAKY is unmissable for horror fans."
    },
    {
      "rating": "7",
      "text": "The actors in question perform the body swap well. The blending and deconstruction of genres and even specific movies is remnant of the writers' other work, Happy Death Day and Happy Death Day 2U, both of which were excellent and I strongly recommend if you enjoyed this."
    },
    {
      "rating": "3",
      "text": "Unabashed horror rip-off of Freaky Friday.  Seriously.  It's Friday.  The title is 'Freaky'.  There's body swapping.  I'm kind of shocked they weren't sued.All that aside, if you saw the trailer you can literally skip the first half of the movie and you won't have missed anything or be lost.I expected good pacing and witty dialog a la 'Happy Death Day', but no it so dull.  Save your time."
    },
    {
      "rating": "4",
      "text": "**There will be some spoilers.** This was overall not a good movie. A few laughs from other actors, but Vince Vaughn made this movie watchable and somewhat enjoyable. If he were not in this then I would have walked out. There's a handful of times where the movie is getting actually good overall and they ruin it with something very cringey or demonization of straight white men. The first scene set the whole mood... almost ruined the entire film. The movie was basically a huge cliche. The amount of demonization of straight white men was obnoxious. One scene with Vince that I did not like, and actually made me very uncomfortable, was when Vince kissed this high school kid who Millie likes. I wasn't uncomfortable because two dudes \"kissed\", but rather because of the age difference and whether it was a fake kiss or not it was very creepy. They forced two scenes that could have gone differently in, quite literally, anyway just to enforce a stupid cliche and demonize straight white men. Like at the end when one of the football dudes brought Millie Kessler, who is the killer at this point, back to a quiet area with two other dudes waiting. The scene quite clearly pointed to him wanting to r*pe her with 2 other guys. And then she ended up killing all three of them. Then another scene, also at the end, when Josh Detmer, who is the gay character, went up to another football guy asking where Millie went. The football guy brought him to the bathroom and kissed Josh. When Josh pushed him off he then proceeded to call him the f-slur. Again unneeded and extremely cliche. Both these scenes, and other parts, just demonized straight white men for literally no reason. Especially these two specific scenes could have gone much differently and could have been more creatively written. This entire movie had such toxic leftist ideologies. I don't understand why movies have been going in this direction. You can make a fantastic film without demonizing an entire group of people for no reason. It's actually disappointing because this was written by Christopher Landon who did Happy Death Day 1 & 2 and those were extremely good. They didn't demonize anyone and were written very well. I'm not sure why he decided to make this movie trash."
    },
    {
      "rating": "9",
      "text": "I watched this movie mainly for the body-swap plot and was skeptical of it because I'm not really a Vince Vaughn fan. I'm glad to say that it exceeded my expectations. The special effects, the jump-scares, the jokes, the costumes, the writing, and the performances were all fantastic. Speaking of performances, the Kathryn Newton (as Millie Kessler), Celeste O'Connor (as Nyla Chones), and Misha Osherovich (as Johs Detmer) trio was outstanding but Vaughn was not very convincing in his portrayal of Millie.To add to this, I loved how the movie avoided many clichés typical of the comedy horror subgenre and even made fun of some of these clichés. Also lovable is the more or less fair gender, racial, and sexuality representation in the movie which shows that a movie can abide by good social ethics and still be thoroughly fun and entertaining to watch. (Personally for me, any movie that includes quotes such as \"Don't underestimate a straight white man's propensity for violence... I don't care how **** old they are\" in a 'non-self-critical' way is a movie worth watching at least once.)So, I recommend this movie highly to those looking for cheap entertainment as well as those that are searching for movies with relatively fair social representations."
    },
    {
      "rating": "3",
      "text": "I think there was already a movie or a series episode with this exact same plot... but not as nearly poorly-made as this onethis is 4/10 at most, mediocre (at most) in everything"
    },
    {
      "rating": "6",
      "text": "Kathryn Newton deserved better.'Freaky' is largely a (very) mixed bag, but Newton's performance is honestly superb - which makes it difficult to rate. On the one hand you have a fairly run-of-the-mill slasher, yet on the other Newton's showing is of such quality that it belongs in something far greater. She's top notch here, it's just severely unfortunate the film is nowhere near her level at all.There are a few decent slasher-y moments and Vince Vaughn tries. Speaking of Vaughn, it's neat to see a different side to him as an actor but I found him to be 50/50 in this; he kills it (pardon the pun) in some parts, but in others it's clear he's trying to impersonate a teenage girl - which is the complete opposite to Newton, who plays two characters supremely well.I know I'm repeating myself, but... in layman's terms: Newton good, film bad."
    },
    {
      "rating": "5",
      "text": "Serial killer stabs teenage victim with stolen, ancient dagger that makes them change bodies for 24 hours and he just happens to kill all of the people who were mean to her previously."
    },
    {
      "rating": "10",
      "text": "Freaky was an amazing movie it was like if you were to fuse the movie Friday the 13th and the movie Hot Chicks the perfect Friday the 13th movie."
    },
    {
      "rating": "7",
      "text": "The movie was more of a thriller and a comedy than a horror film, although it was scary at times but no \"Horror movie scary\" if you know what I mean.   With that said, I think this movie was very enjoyable, fun and interesting.Vincent Anthony (AKA the girl or the murderer) is giving a very good performant and managing to do the boy acts like girl in a way that is so good, funny, believable and not extra girly with exaggeration of feminine qualities!I think this movie is worth a watch, I don't think it is perfect, but it is fun and will pass your time pleasantly."
    },
    {
      "rating": "8",
      "text": "“Freaky” isn’t so freaky So, I just finished watching “Freaky” and I have to say Vince Vaughn (Blissfield Butcher) and Kathryn Newton (Millie Kessler) made this film. It’s hard to believe that Vince can play a better teenage girl than an actual teenager and that Kathryn can go from a sweet girl who is trying to find herself after losing her father to a brutal serial killer. It’s amazing what these actors can do, just switching their emotions on and off.The movie takes the viewer on a thrilling chase when Millie Kessler (Vince Vaughn) wakes up in a serial killer’s body after she was attacked the night prior. Now it’s a race against time to try to stop The Blissfield Butcher (Kathryn Newton) before he kills more of the kids in her school, and take her body back before it’s too late!This movie has some of the best acting in a body swap movie I’ve ever seen. And the soundtrack (by Bear McCreary) For this movie is impressive, it immerses the viewer in the action. The only real complaint I have is that the movie isn’t really that much of a horror movie, it’s just a little bit gory and they call that “horror” while it might be ok for some people it’s not for a true Horror fan, it didn’t really scratch the horror itch I had going into the film, but despite its lack of Horror or what I believe to be true Horror, I would still recommend the movie to my friends and family who like suspense and a good laugh."
    },
    {
      "rating": "4",
      "text": "Empieza con demasiados clichés, y no se los quita durante toda la película.La trama la veo como demasiado forzada, el único que desprende algo de carisma es Vaughn, el resto son bastante malos, no se si actores, o personajes, ahí ya no entro.Momentos de comedia metidos totalmente con embudo, tiene partes que alargan hasta la saciedad y se hacen aburridas, y la conclusión y el bonus clip es de guion bastante malo.Puntos buenos: Vince Vaughn, buen actor y buen papel, y tiene momentos gore bastante interesantes y chulos.Puntos malos: El resto, no tiene chispa, el guion es bastante hueco, y el final muuuy redundante.Conclusión: Es una película palomitera que con tus amigos quizás te lo pases bien, y si te gusta el género más, pero me pareció de lo menos interesante."
    },
    {
      "rating": "10",
      "text": "Vince vaughn man my **** coming in with that jason vibe with this I mean this was **** dope went to see it the theater with friends and they **** with it too perfect blend between scary and funny **** with this movie its dope"
    },
    {
      "rating": "7",
      "text": "It was better than expected. Kathryn Newton and Vince Vaugn did a good job acting as if they were inhabited by each other's characters."
    },
    {
      "rating": "6",
      "text": "The mix of teen family drama, comedy and horror is not always perfect, but Freaky is made with a certain amount of passion and is entertaining throughout."
    }
  ],
  "recommendations": [
    "cooties",
    "the_babysitter",
    "cabin_fever",
    "i_know_what_you_did_last_summer",
    "case_39",
    "zombieland",
    "disturbia",
    "hell_fest",
    "the_collector",
    "terrifier",
    "wrong_turn",
    "happy_death_day",
    "hostel",
    "clown",
    "friday_the_13th_the_final_chapter",
    "mama",
    "texas_chainsaw_3d",
    "krampus",
    "scouts_guide_to_the_zombie_apocalypse",
    "the_green_inferno",
    "p2",
    "vacancy",
    "house_of_1000_corpses",
    "countdown",
    "ready_or_not"
  ]
}