{
  "id": 2515,
  "title": "Freaky Friday",
  "starring": [
    "Lindsay Lohan",
    "Jamie Lee Curtis"
  ],
  "runtime": 97,
  "genre": [
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "description": "Mother and daughter bicker over everything -- what Anna wears, whom she likes and what she wants to do when she's older. In turn, Anna detests Tess's fiancé. When a magical fortune cookie switches their personalities, they each get a peek at how the other person feels, thinks and lives.",
  "releaseYear": "2003",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ipKcZ4Up7dp18XpsfYUc9NKZy3g.jpg",
  "categories": {
    "plot": 7.25,
    "acting": 7.571428571428571,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.666666666666667,
    "funny": 7.545454545454546,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "An excellent movie that shows precisely the conflict of the relationship between parents and children. And what child ever wished that his father was in his place so he could see what it is? Or even the opposite. A great film with good performances and an excellent script."
    },
    {
      "rating": "5",
      "text": "A decent movie with in typical disney fashion. There are so many movies like this that i'll need hours to count!  It had some fun parts, but overall - if you're a teenager or you want to watch something with predictableplot - go ahead and watch it."
    },
    {
      "rating": "8",
      "text": "Although the characters looked nothing like they were from 1984 (which was when the film took place), Jamie Lee Curtis and Lindsay Lohan give everyone plenty of laughs as their characters switch bodies momentarily and they have to figure out how to live the opposite's way of life the hard way. Mark Harmon is among the cast."
    },
    {
      "rating": "9",
      "text": "Freaky Friday has got great humour and great characters that are like able and relatable. While the premise of the movie is a stretch the movie still manages to work very well and is thoroughly entertaining from start to finish. This was one of my favourite comedies as a kid."
    },
    {
      "rating": "9",
      "text": "love the old Lindsay but she's never coming back. It's another great work for her to demonstrate she can really act"
    },
    {
      "rating": "10",
      "text": "Lindsay casi toda su carrera la hizo en disney me encantan todas sus peliculas, pero esta mas me fascinó mucho enserio"
    },
    {
      "rating": "9",
      "text": "¡Película localmente divertida!, Y quizás la mejor de Lindsay Lohan, especial para ver en familia"
    },
    {
      "rating": "8",
      "text": "This was just a cool movie. The script was seriously funny and the acting was good. It was kind of a wild ride. It certainly appeals to everybody. Lindsay was good, but Jamie Lee Curtis was just hilarious."
    },
    {
      "rating": "8",
      "text": "The film has two very funny and sympathetic main characters. Because of its good story it gets better from second to second and is the funniest teen comedy I've ever seen."
    },
    {
      "rating": "7",
      "text": "The acting was good, the movie was entertaining and the characters were likeable.But, the story was cliché, the movie was predictable and it was lazy. It's not a great movie but, it's an okay movie for a \"Freaky Friday\" night."
    },
    {
      "rating": "10",
      "text": "Realmente um excelente filme. Divertido, descontraído, aborda várias questões sem perder seu humor impecável. Lindsay Lohan estava bem naquela época, e interpretou a personagem muito bem. Esse filme merece aplausos."
    },
    {
      "rating": "10",
      "text": "As a child, I remember when I first watched Freaky Friday, I was scared that if I was ever mean to my mother, what would happen to me. I loved that they used humor, or throughout the movie but also touched your heartstrings. It addresses a problem that nowadays mother and daughter relationships are on a strain. At the end of the movie, I felt like hugging my mother. I recommend it for any family movie night!"
    },
    {
      "rating": "4",
      "text": "Another dumb comedy involving Lindsay Lohan. It has a lame story involving dumb scenes between the characters. We have seen these kinds of movies before. Very perdictable."
    },
    {
      "rating": "2",
      "text": "Positively insufferable and almost arrogant in its persistent and formulaic tone. Even if it weren't a remake, Freaky Friday wouldn't be graced with the slightest ounce of originality."
    },
    {
      "rating": "1",
      "text": "The remake of Freaky Friday is terrible, crude, and contributes nothing extra to the movie everyone loved in '76. The casting of the two leads is a mistake, and the script is unfunny and uncomfortable. Watch the original, which is actually a good movie."
    },
    {
      "rating": "3",
      "text": "i can not believe they make a remake of freaky friday . Jamie Lee Curtis was great  but why would they make a remake ? .  the orginal freaky friday was much better . and  lohan's performance was awful"
    },
    {
      "rating": "9",
      "text": "Hilarious. Great acting from everyone. You must see this! Appealing to all ages. I loved it!"
    },
    {
      "rating": "10",
      "text": "I think that freaky friday was the best show that I've seen lindsay lohan be in! EVERYONE should like it! do you?"
    },
    {
      "rating": "10",
      "text": "This was a seriously cool movie. Lindsay Lohan and Jamie Lee Curtis were very good."
    },
    {
      "rating": "9",
      "text": "Grow up watching all the Lindsay Lohan’s movies. Freaky Friday is the best coming of age movie of 2000s"
    },
    {
      "rating": "7",
      "text": "I enjoyed this film, and I do slightly prefer it to the Jodie Foster version. True, the first 15 minutes were a bit slow, and some of the script was a bit weak, not to mention the rather predictable storyline. But you know what, the performances of Lindsey Lohan and Jamie Lee Curtis more than compensated, their performances were really entertaining, and I felt the chemistry between them. I loved the soundtrack, and I thought it was very sensible updating the story, so that it would appeal more to someone like my 13 year old sister, who really enjoyed it. The script, while contrived in some places, was on the whole, very funny, and anyone who's seen the 1976 film, will get a more of the same film, except updated. What I did like, is that Lohan's character is a representation of all of us, someone who doesn't do mornings, doesn't always get on with her mum, and has friends and enemies. In the 1976 version, Jodie Foster's interpretation was more sensible than Lohan's, who put a bit of her other films in, which is quite appealing for this sort of film. Overall, an enjoyable film, with a 7/10. Bethany Cox"
    },
    {
      "rating": "8",
      "text": "I enjoyed this Freaky Friday because it has nothing to do with the fact that you people can't accept this movie as a normal great movie. I enjoyed it because it held me back many adventures being switched voices in different bodies."
    },
    {
      "rating": "5",
      "text": "J'ai regardé ça au hasard, surtout parce qu'il y avait Jamie Lee dedans -pas encore mamie mais presque- et la petite Lindsay vraiment mignonne à croquer là-dedans et qui se débrouille d'ailleurs pas si mal, aussi surprenant que ça puisse paraître... et c'est vrai que ça surprend !Cependant, j'ai failli zapper deux fois... la première lorsque j'ai vu juste avant le début du générique un logo qui fait fuir, le logo qu'on fuit à toute blinde, non pas celui de Marvel, les merdes marveleuses mais l'autre, le logo de... Disney, les daubes disniaises ! quand à la seconde, c'est à peu près au bout de 20 mn alors que le film ne voulait (toujours) pas démarrer : tu parles d'un \"temps\" d'exposition, putain de sa mère sans déconner...Puis lorsqu'elles ont enfin échangé leur place, ça y est, quasiment jusqu'à la fin, ça rigole étonnamment bien surtout grâce à Jamie Lee désopilante en poulette improvisée djeunz rebelle et crise d'adolescence... tandis que sa fille Lindsay joue la presque vioque psy de comptoir professionnelle en crise de pré-obsolescence !Et si on met de côté la fin bien niaise qui fout de la guimauve périmenaze partout, alors j'imagine que la comédie est presque réussie... Donc contre toute attente, c'est tout-à-fait regardable, ce qui pour une \"comédie américaine\" constitue un exploit en soi ! alors on applaudit à moitié quand même !"
    },
    {
      "rating": "6",
      "text": "A simple but decent and somewhat entertaining and funny body-swap movie and parent/child combo film with some good songs. Lindsay Lohan and Jaimie Lee Curtis’ acting and chemistry were great. It was funny watching Jaimie Lee Curtis act like a teenager and watching Lindsay Lohan act like an adult. They were funny in this movie. This movie is so nostalgic to me. I never saw the original Freaky Friday and never read the book, but this movie seems like a good remake and adaptation. Whoever would’ve guessed Lindsay Lohan can both act AND sing very well? The horrendous 2018 Disney Channel original movie reboot of Freaky Friday doesn’t hold a candle to this! The 2003 version is the best Freaky Friday movie!"
    },
    {
      "rating": "10",
      "text": "Fuuuuun movie! Anna is so cool with her \"rocky\" style and she and her friends has so much talent. Lindsey Lohan and Jamie Lee Curtis nailed the part portraying each other. Jake is so sick lol, falling in love with your crush's mom is so weird, but it shows how he likes Anna for who she is; Her taste, her way to think, the bands she likes... Leaving tthe funny on the side, it also teach us an important lesson."
    },
    {
      "rating": "7",
      "text": "----------------------------------7.0/10-----------------------------------"
    },
    {
      "rating": "6",
      "text": "Has some pretty bad lines and cringe rock covers of well known songs, but it's fun.It stressed me out man I had to skip 3 quarters because I couldn't stand the cringe and/or cheese"
    }
  ],
  "recommendations": [
    "17_again",
    "alvin_and_the_chipmunks_the_squeakquel",
    "a_cinderella_story",
    "10_things_i_hate_about_you",
    "hubie_halloween",
    "horrible_bosses",
    "clueless",
    "marmaduke",
    "alvin_and_the_chipmunks",
    "meet_the_parents",
    "blended",
    "easy_a",
    "50_first_dates",
    "role_models",
    "bedtime_stories",
    "the_spongebob_squarepants_movie",
    "friends_with_benefits",
    "zack_and_miri_make_a_porno",
    "just_go_with_it",
    "american_pie_2",
    "the_green_hornet",
    "my_spy",
    "the_parent_trap",
    "pitch_perfect_2",
    "the_break_up"
  ]
}