{
  "id": 4130,
  "title": "Fred Claus",
  "starring": [
    "Vince Vaughn",
    "Paul Giamatti"
  ],
  "runtime": 116,
  "genre": [
    "Action",
    "Comedy",
    "Drama"
  ],
  "description": "Fred Claus and Santa Claus have been estranged brothers for many years. Now Fred must reconcile his differences with his brother whom he believes overshadows him. When an efficiency expert assesses the workings at the North Pole and threatens to shut Santa down, Fred must help his brother to save Christmas.",
  "releaseYear": "2007",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9gATbvoRMxVeoHInwS8nR0KZMVc.jpg",
  "categories": {
    "plot": 4.888888888888889,
    "acting": 6.0,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.5,
    "funny": 4.583333333333333,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is one of the best Christmas movies ever. Full of heart and great acting from the incredible cast. Family moments are hilarious and moving. The ending is the best ever. This movie is super underrated and highly recommended."
    },
    {
      "rating": "3",
      "text": "Despite having the best interpretation of the North Pole I've seen in recent films, Fred Claus fails to be the Christmas great it could have been thanks to the terrible humour."
    },
    {
      "rating": "4",
      "text": "Fred Claus doesn't have a story. Just think about it, what is comedy without a story? A poor one that is and Fred Claus falls straight to the naughty list."
    },
    {
      "rating": "1",
      "text": "Would it be that sad for this to be comedy and not date? Cause that is where this movie comes by as..."
    },
    {
      "rating": "3",
      "text": "Just boring! It is simply not funny. I really wanted it to be and I tried to stay with it but it never actually took off. It is really boring!"
    },
    {
      "rating": "7",
      "text": "When will it occur to Wanda(Rachel Weisz) that she's dating a man who is eternal, like a vampire? According to the narrator of the origin story, the Claus family stopped aging, and if the Santa Claus myth came of age during the nineteenth century, that makes Fred at least two centuries old. Shackled by the need to deliver a \"family-friendly\" movie, \"Fred Claus\" conceals the nefarious side of Nick(Paul Giamatti), who is a vampire in the business sense of the word(sucking the blood of the working class; the elves), and is probably having an affair with Charlene(Elizabeth Banks). When the two brothers engage in a tussle, you'll wish it was fisticuffs, and that edgy actors like Vince Vaughn and Giamatti had the freedom to hurl some expletives instead of snowballs at each other. Santa's toy factory and village is a forced labor camp. \"Here comes Santa Claus, here comes Santa Claus,\" as the song goes, sounds like a veiled threat. Santa instructs his DJ(Ludacris) to play this song repeatedly because it's used as a form of mind control. Against their will, the elves need to meet their yearly quota. In the Nazi labour camps, women were employed to organize the Jewish children. In this light, take a closer look at Charlene and her control over the \"little people\"(\"midget\" is a slur, I'm told). Actually, \"Fred."
    },
    {
      "rating": "1",
      "text": "Terrible movie, storyline is stupid. Please, go see something other than Fred Claus."
    },
    {
      "rating": "10",
      "text": "Loved this sibling rivalry fantasy. superb set design!"
    },
    {
      "rating": "8",
      "text": "I really enjoyed this movie much more than I expected. It was very funny, I found myself laughing often. It's Christmas time..people need to lighten up a little...this movie will help."
    },
    {
      "rating": "10",
      "text": "Great holiday movie. The scrooges who are looking for another \"It's a Wonderful Life\" need to look elsewhere."
    },
    {
      "rating": "3",
      "text": "Vince Vaughn is NOT funny. This is a Christmas movie gone bad. He is not cut our for childrens movies. Save your money or go to a different movie."
    },
    {
      "rating": "1",
      "text": "Wow, that was a horrible movie. Don't waste your dollars for an obviously-stupid plot and virtually no laughs."
    },
    {
      "rating": "0",
      "text": "With a beautiful Sinead O'Connor renditon of 'Silent Night' playing in the background to kids ripping open presents on Christmas morning I knew Christmas movie making had officially bottomed out. 'Charlene's' gratuitous cleavage and a weird, contrived relationship with 'Willie' the elf...come on!!! What a complete waste of talent!!!!"
    },
    {
      "rating": "4",
      "text": "I enjoyed this slightly more than I expected, but overall this is exactly what I feared - \"Elf\" with less heart and less humor."
    },
    {
      "rating": "3",
      "text": "This film only generated a few laughs and the rest was a so-so story that wasn't very interesting. The movie didn't capitalize on what makes Vince Vaughn hysterical in other comedy's like Dodgeball or Old School."
    },
    {
      "rating": "5",
      "text": "Very mediocre in every aspect. Mildly funny, mildly sentimental, mildly wasted talent... The movie is so predictable that 20 minutes into the movie you've pretty much guessed the upcoming plot and have figured out how it will end. Every Christmas theme and dysfunctional family cliche is explored and poorly executed. There were some well behaved children in the theater watching the sneak preview with me, and they looked pretty bored as well."
    },
    {
      "rating": "0",
      "text": "What a piece of sh*t."
    },
    {
      "rating": "8",
      "text": "A surprising movie... I expected a slapstick, irreverent slap at the long standing institution of Christmas, Santa and all things associated with one of the few events that still draws people together in celebration of a common ideal. The film does justice to the concept that there is good in the world, and that giving is the central theme of Christmas. Vaughn, Giamatti and Spacey are excellent in their respective roles. As a summary... at times funny, mostly touching. A good family film and great addition to the Christmas genre. A nice surprise."
    },
    {
      "rating": "8",
      "text": "I loved this movie! It was predictable, but really gave out a good meaning of Christmas! I watched this with my 10 year old daughter and she was laughing the whole time! I did not think it was that funny, but she sure did! Bring your children to this, and enjoy a heart warming movie! Anyone who disliked this story that was there opinion, but this is mine! I know you will all have different opinions, but the best thing i look for while watching a movie with my family, is seeing my children happy! that is what Christmas is all about! My son who is 14 said it was good! I was happy to hear that cause since he is a teenager, he doesn't like going any where with us, but we all personally enjoyed it!"
    },
    {
      "rating": "5",
      "text": "Fair Christmas family film, I don't see it destined to be a holiday classic, but it entertains to a degree. Kevin SApacey is wonderfully evil, and there are a couple of very memorable scenes."
    },
    {
      "rating": "7",
      "text": "This movie was a good and a bad movie at the same time. You really don't know what side to lean on. It looked as if the director tried to come across a message through the movie by incorporating comedy and tears by using the character of Santa Claus; he kind of succeeded."
    },
    {
      "rating": "5",
      "text": "I enjoyed the book a lot more. Fred's sexuality was smoldering on the page; but in this, it was just silly."
    },
    {
      "rating": "8",
      "text": "Good start to the holiday, its warm and funny, and its really not supposed to be much more. Take the kids to see it or your fiance like I did after some Christmas shopping. The showing we were at it received applause, from an audience mostly comprised of Parents with their children."
    },
    {
      "rating": "6",
      "text": "I really enjoy Vince Vaughn's humor and I think it still had it's heartwarming touch. There were some parts that sort of annoyed me ( stupid sound effects) yet there were more that made me smile."
    },
    {
      "rating": "1",
      "text": "Stupid for both kids and parents!We left the theatre after 25 min."
    },
    {
      "rating": "5",
      "text": "It was good, yet sad (my 8-year old daughter)."
    },
    {
      "rating": "0",
      "text": "Horrible movie-boring-don't waste your money."
    },
    {
      "rating": "6",
      "text": "The movie had a weak storyline but was pretty and interesting to look at. The flying sleigh was exciting and real looking and the snow village was beautiful. Vince Vaughan was very good. He just needed a better plot."
    },
    {
      "rating": "4",
      "text": "The film is much too long, but the film has a surprising amount of heart and some good actors; the combination makes Fred Claus an entertaining holiday movie."
    },
    {
      "rating": "0",
      "text": "Fred Claus is just an all together not funny at all film. Vince Vaughn already not being funny in anything else besides Wedding Crashers provides a horrible performance as usual, Giamatti on the other hand shows how much he tries and yet he's still grabbed into the abyss by this awful, stinky, no-good comedy with a horrible cast as well."
    },
    {
      "rating": "8",
      "text": "♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♡♡♡♡♤♤♤♤♡♤♤♤♡¿¡¿¡》¿¡¿¡》¡¿¡¿》¡¿¡¿》¡¿¡¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》"
    }
  ]
}