{
  "id": 1835,
  "title": "Free Willy",
  "starring": [
    "Jason James Richter",
    "Keiko"
  ],
  "runtime": 112,
  "genre": [
    "Family",
    "Adventure",
    "Drama"
  ],
  "description": "When maladjusted orphan Jesse vandalizes a theme park, he is placed with foster parents and must work at the park to make amends. There he meets Willy, a young Orca whale who has been separated from his family. Sensing kinship, they form a bond and, with the help of kindly whale trainer Rae Lindley, develop a routine of tricks. However, greedy park owner Dial soon catches wind of the duo and makes plans to profit from them.",
  "releaseYear": "1993",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1WLTjNznfvr3bkHf4p9PR4ctBKK.jpg",
  "categories": {
    "plot": 8.666666666666666,
    "acting": 8.75,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The best family film ever made that you can watch again and again and it never gets old! They don't  ake movies like this anymore, long live Free Willy!"
    },
    {
      "rating": "9",
      "text": "the best family movie ever made since E.T."
    },
    {
      "rating": "10",
      "text": "Brilliant, just brilliant! Amazing, this is a real family favorite and can be watched by everyone, no one dislikes this film! An amazing sense of adventure that will have you on the edge of your seat and falling in love all over again and again! 10 OUT OF 10! BRILLIANT!"
    },
    {
      "rating": "8",
      "text": "Call me crazy, but I managed to love Free Willy's entire plot and lovable characters without any scratch attached to it. Also, who could expect a killer whale to be this friendly when they have 'killer' in their name?"
    },
    {
      "rating": "10",
      "text": "This is one of the greatest movies to ever watch. Simply breathtaking. Jason James Richter is an amazing actor and Keiko the whale is a true gem. This is a movie that every person in the world has to watch..."
    },
    {
      "rating": "4",
      "text": "As bland as nineties rip-offs of E.T. could get, Free Willy copies that classic down to the smallest detail, but the bond is never felt between the boy and the whale, instead coming across as assembly mind fodder."
    },
    {
      "rating": "9",
      "text": "I must say, Free Willy is one of the best films ever made! The relationship between a boy(Jason James Richter) and a whale named Willy remains strong through hard times. Sadly, Jason James Richter then starred in The Neverending Story III(one of the worst films ever made) and now it's hard for me to believe that he was in a good movie."
    },
    {
      "rating": "7",
      "text": "A fairly moving film with good acting and quite touching story. Great family film."
    },
    {
      "rating": "5",
      "text": "Não  grande coisa"
    },
    {
      "rating": "10",
      "text": "The problem in the movie is great and the characters are very lovable.it's also very realistic and hopefully will make people want to abolish shamu and get the orcas back home like Willy"
    },
    {
      "rating": "10",
      "text": "This is one of my favorite movie involving animals and friendship. The movie has memorable moments and one of the best songs by Michael Jackson. This is the best one in the Free Willy series. 10/10"
    },
    {
      "rating": "7",
      "text": "The boy loves the whale. What are friends for? Great movie as a whole. A family movie."
    }
  ]
}