{"id": 2520, "title": "Free Fire", "starring": ["Brie Larson", "Sharlto Copley"], "runtime": 90, "genre": ["Action", "Crime", "Mystery"], "description": "In 1970’s Boston, a meeting in a deserted warehouse between two gangs turns into a shoot-out and a game of survival.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/21WsmKivqOE2Vut73z07M8yx84F.jpg", "categories": {"plot": 6.913043478260869, "acting": 6.703703703703703, "ending": 7.166666666666667, "soundtrack": 8.0, "cinematography": 6.666666666666667, "familyFriendly": 3.0, "funny": 7.2631578947368425, "action": 6.733333333333333}, "reviews": [{"rating": "5", "text": "A little of this ludicrous 'Reservoir Dogs' wannabe goes a long way. Everything takes place in one location and although there is undeniable attention grabbing action throughout, there is also a certain repetitiveness which begins to pall around the half way point. A game cast do all they can with unoriginal dialogue and there are as many expletives flying around as bullets. The whole thing resolutely refuses to sustain viewer investment, and an air of pointlessness is unable to be dispelled despite snappily impressive editing and a manageable running time."}, {"rating": "4", "text": "A meeting in a deserted warehouse between two gangs turns into a shootout and a game of survival. Starring... quite a cool bunch of young-ish actors like Brie Larson, Cillian Murphy, Amie Hammer, Noah Taylor, Sam Riley.Too bad the movie can't match their potential. It only reminds us how boring indie crime comedies can be.„Free Fire“ is a charmless witless effort to capture some of that pre-Madonna Guy Ritchie or early Tarantino greatness – only without the humor, sense of style, energy or anything to justify its existence, really.Co-screenwriter/director Ben Wheatley has managed to create little if any of the fun or adrenalin he surely surely must've been imagining while planning all this.There’s literally almost nothing to feel excited about, no humor, snappy lines, stylish action scenes, nothing… AND this surely must be one of the dullest gunplay movies in modern cinema history. Only the sound-effects of bullets hitting stuff are noteworthy.Even the plot is almost non-existent consisting mostly of some guys and this one woman yelling, cursing and shooting at each other, mostly lying or crawling on the floor and half-unable to move.There’s little dialogue or spoken lines and everybody looks like having stepped out of vintage denim commercial or something, covered in sweat, dirt, and dust. Maybe because the events take place in 1978 Detroit.„Free Fire“ must have been semi-interesting exercise for the cast and crew – how to make most events happen in one big room and without anybody moving much. But the result feels more like a bunch of deleted scenes than a proper movie.It doesn’t get better in the end. Watch the trailer and you have had an experience much better than the movie itself."}, {"rating": "5", "text": "After a brief introduction involving an arms deal that goes wrong Free Fire is essentially one long gun fight, unfortunately it’s not really all that entertaining. Starring the likes of Cillian Murphy, Brie Larson and Sharlto Copley (from the excellent District 9) things start off well enough but the movie never really goes anywhere, or even really escalates proceedings all that much, and after a while the endless shooting all becomes a bit dull."}, {"rating": "5", "text": "Well this kinda sucks. No I'm not talking about the movie itself, but mostly my expectations for it.\"Free Fire\" is a stylish shoot 'em up film with a Tarantino vibe to it. While I wouldn't call it original, as many are saying it is, but I respect Ben Wheatley for taking a concept like this and actually going for it. The performances from everyone were solid and when some of the humor hit, it's pretty funny.Despite the great cast, the director, and interesting plot; I felt there was something missing from this that stopped it from being great for me. I didn't get any enjoyment or anything special out of this. After the film was over, I got up from my seat and went home without evening thinking about what I just saw. That's never a good sign.I think if the script was more tight and the characters were intriguing then I might have cared for whats happening. And if the runtime was a little shorter, because it got pretty old after awhile. I didn't find some of the humor that funny and it felt kinda force. The only parts that I chuckle at were mostly small things that characters would do or react to situations.I was really disappointed with this, especially if it's a A24 film which are normally great."}, {"rating": "8", "text": "If you like old school Tarantino-type movies then this one is for you. Initially I didn't expect much from this movie, I had heard some so-so things about it but I found myself to be pleasantly surprised by how fun it was. A simple premise in the form of a gun deal gone very wrong that turns into a shoot out with none-stop funny and quirky dialogue that had me laughing the entire way through. Hammer, Copley, Riley and Jack Taylor stand out the most in this film, Hammer's dry sense of humor really help this movie as it does tend to drag and hit a few speed bumps towards the end of the movie. Overall, this is a fun movie with a great cast and if you like old school Tarantino/ Guy Ritchie realm movies than give this one a shot."}, {"rating": "5", "text": "Director Ben Wheatley is known for lots of violent bloodshed. This time, he amps it up to eliminate any semblance of narrative. After a setup about the sale of some guns and a few minutes of meaningless verbal interplay, the shooting begins and doesn't let up. This is one of those action films with dark humor (it's British, after all) and eccentric characters (Sharito Copley is the most fun). It's the style that made the names of directors like Guy Ritchie and Matthew Vaughn, and frankly, they've been better at it. True to form, there are a few humorous moments and some memorable bloodshed, but it's mostly just people shooting at each other (and usually missing). Aimless gunfire for over an hour."}, {"rating": "7", "text": "A gun deal gone wrong, simple enough story built with a great cast and stuffed full of insane violence and quirky dialogue. Most of which comes from the wonderful Sharlto Copley. Owes a lot of its inspiration to Reservoir Dogs and that’s never a bad thing.The shootout scenes, although sometimes difficult to tell who’s shooting who are deafening and completely chaotic. Sure it does appear that every character is somehow bullet proof but regardless I enjoyed Free Fire immensely. It’s well acted, excellently made and you’ll definitely enjoy it. Make sure to take the time to check this one out, highly recommended."}, {"rating": "7", "text": "After loathing Ben Wheatley's last film, High-Rise, my expectations for Free Fire were quite low. Yet, after watching, it is a film that may lose some steam along the way, but it works. Stylish, strongly directed, and terrifically acted, Free Fire manages to invest us in this brief moment at the end of these characters' lives as they engage in a shootout in Boston. Arising out of a weapons deal where one of the men selling the merchandise recognizes one of the buyers as the guy who \"bottled\" his female cousin and the wrong guns were provided, this hour plus long shootout in an old warehouse is thrilling, engaging, and often quite shocking to watch. Never shying away from violence or unexpected deaths or unexpected characters, Wheatley's film is one that attempts to re-invigorate the action-comedy genre with the kind of spirit found in the work of Quentin Tarantino, but minus all of that distracting plot. Free Fire gets to the good bits and then let's this attractive cast bleed all over the set instead. Like a lead-infused musical, Free Fire hits the right notes and creates sweet music as the bullets fly.Though never particularly deep - throw-away lines regarding the place of the sale being an old warehouse that made things nobody wants anymore or Brie Larson's anger regarding the \"bottling\" of some girl do not count - Wheatley is still able to make this one have great depth due to smart writing. Ditching the obvious and ham-fisted symbolism of his prior feature, Wheatley instead makes an action film that develops characters through bullets. With each shot defining loyalty and each line delivering some crucial element of the character, Wheatley is able to somehow make us care about people who should, given the lack of real plot or depth, be rather unmemorable. Yet, many stand out in their own way and become quite easy to root for. Given the size of the cast and often chaotic shooting in this warehouse, it could be easy to lose track of everybody, but the fact that each character feels distinct and distinguishable from one another is quite the achievement. Though it may seem a bit facetious or a low-bar for a film, it is all too often that even character-driven or plot-heavy films begin to lose track of who everybody is and what they mean for the story. Free Fire, however, never has this issue and instead develops its character smartly, without any kerfuffle, and without out any distraction. Instead, it neatly introduces them all, gives them all motivation, shows their bonds or lack thereof with the other characters, and then gives them a gun to fight their way out. Tight and smart, the characters in Free Fire are exactly what they need to be and that is all that can be asked.Of course, the acting certainly goes a long way in bringing about this appeal for the characters, as the strong acting across-the-board often serves to breathe life and individuality into these characters. As manic gun runner Vernon, Sharlto Copley brings a real wild card element to this film and plays this crazed lunatic incredibly well. Compared to the more straight-laced Justine (Brie Larson) or business-focused Chris (Cillian Murphy), Vernon's insane gun runner is one that brings that fun and care-free element to the film that often makes it such a joy to watch. For their parts, Larson and Murphy also deliver typically strong performances. Alongside them, Armie Hammer's dapper and charismatic Ord may not be totally out of his range, but it is nonetheless yet another role that he really nails. An incredibly unsung actor somehow, Hammer's laid back charisma is one that makes him easy to believe as a middle man between two criminal organizations, who is responsible for setting up the sale. In a smaller role, Sam Riley continues to scream out for roles akin to the one he received as the lead in Anton Corbijn's Control. Somehow sympathetic - perhaps just because I do like Riley's work - and absolutely insane as scumbag Steveo, Riley gives an unhinged and rage-infused performance that hits all the right notes.Stylistically, Free Fire is an impeccably crafted film with excellent lighting. Relying upon the orange-tinted lighting of the warehouse to provide all of the visibility in the film, the orange tint is appealing visually, but perfect for capturing the era. Set in, presumably, 1970s Boston, the terrific costume design naturally captures much of this, but the lighting further adds to this appeal. Giving it the look of an old photo or a dimly dreamscape of insanity, this orange hue is what defines the look of the film and what adds much of its visual appeal. Wheatley, additionally, injects style via how the shootout is framed. With tight shots of the characters as they hide behind various obstacles, the film rarely shows where the other characters are in relation to whomever is in the shot."}, {"rating": "7", "text": "Director and co-writer Ben Wheatley tackles a pretty lofty premise with \"Free Fire,\" a crime film revolving around one, single realistic shootout that ensues after an arms deal goes awry in an abandoned factory. And, aside from encountering a few of the pitfalls I ultimately expected to find in a movie with a premise as bold as this one's (some pacing issues and plot ambiguities being the most significant of note), things go fairly smooth on the whole. The vast array of characters are all well-defined and quite easy to differentiate from one another. The dialogue is infectiously funny and adds to the movie's overall air of irreverent cheekiness. And the film offers up *just* enough variance in action to get you through to the end. Props also go to Sharlto Copley and Armie Hammer for stealing far too many moments for me to count. Definitely worth a looksee."}, {"rating": "7", "text": "The night of bullet business!This is one of the surprise films of the year. A limited cast and a one day event film. Except the opening few minutes the remaining film was a crossfire event. It's about two groups caught up in a firing from each other from one mistake to another leading the confrontation. In an abandoned warehouse, with a big amount and the cases new weapons lying in the centre, there's no way in or the out. The only way is to fight them all. So the surviving game begins. Whoever wins at the end can take it all with him.A very nice concept. With a simple storyline a nice gang fight was drawn out. If you like gangster films, this should watch it. But what bothered me the most was the common logic. You know, they all entered the building after checked for if they are armed, though it can be believed they hid their weapon somewhere and proceeded in. That's not it, the ammos for their gun, they kept firing many rounds like in the army conflict or a video game. That's why it is average to me. Otherwise an unexpected awesome film.The casting was good, but the surprise was Brie Larson. To see the Oscar winner in such kind of small scale film. Also disappointed her role was very small. But there is still hope! All others were good. With their unique characters, nicely used to share the screen equally. The reason for the conflict is not well explained, so it is hard to say who's good and who's bad guys here. But behaviours and further development give out where the story is heading. The end was predictable, and also we can expect a sequel. If they have one in their mind, surely it would only get bigger.6.5/10"}, {"rating": "7", "text": "I like the simplicity and the quick humor. There is a 15 min period in the middle where things get stale but the last half hour makes Free Fire great again"}, {"rating": "7", "text": "I went to this film because I was curious about Ben Wheatley as a director and because I like Brie Larson and Cillian Murphy. Definitely this was much more than a dumb shoot’em up, although I can’t say I found it fun. Certainly Wheatley cleverly created a genuinely odd cast of characters, and although there was a lot of shooting, there was surprisingly little gore. In a crazy way, the film was almost balletic, and definitely fate, irony, and chance played more of a role than usual in such films and there were really no heroes or villains. I admired the film, although I can’t say I liked it, but I would definitely go to another Wheatley film – or watch this one again."}, {"rating": "8", "text": "For people saying this is too much like Resevoir Dogs, since when has that been a bad thing? If you're looking for a fun, simplistic action film that will entertain you for 90 minutes, Free Fire is the best one in a long time. Great performances from Murhy, Reynor and most of all Copley don't hurt the film either."}, {"rating": "9", "text": "I may have just found my new guilty pleasure with this film! I went in expecting a fun time, but man! I was not prepared for just how wild and fun this film got, or even how funny it got as well! I'm not even joking! This film was hilarious! This is one action film that I found funnier than any comedy I've seen in recent memory! The whole cast also made this a blast to watch, with the likes of Sharlto Copley, Armie Hammer, Brie Larson, Cillian Murphy, etc. each having their own great and fun moments in the film! The first half hour is all setup, with the last hour being a nonstop shootout in the vein of Tarantino, with hilarious quips-a-plenty from the characters throughout! Overall, this was without a doubt the funnest time I've had at the theater in recent memory, and I honestly believe that this film is destined to become quite the guilty pleasure of mine! Seriously though! I honestly can't wait to watch this again and again when it comes out on Blu-Ray!"}, {"rating": "9", "text": "This is one of the most unexpectedly brilliant films I've seen in a very long time. Its low budget, set in one location, but don't let that put you off, the characterisation and interplay is just awesome and the small location just adds to the drama, I wont give the plot away as that would spoil it (not that there's much of a plot), but it is very well thought out and hilarious in places. The best dark comedy film I've ever seen."}, {"rating": "9", "text": "At first I was worried that this would be a knock off of Tarantino movies but within a short time I was having one of the best movie experiences in a long time.  All the actors are excellent and the writing is hilarious.  I don't want to spoil anything for those who have not seen this movie but I had no idea what to expect and was blown away with what this movie turned out to be.  I can't wait to watch it again and again.  Absolutely loved this movie and the performances by all!"}, {"rating": "8", "text": "I have seen this plot done much better in Reservoir Dogs by Quentin Tarantino, but the heart of this movie lies in its terrific shootouts and surprisingly witty comedy!"}, {"rating": "1", "text": "I wasn't out to hate this movie. Ever since Brie Larson(the one women in the movie. Maybe Wheatley has something to say?) hosted SNL I've been a big fan of her. So giving her the chance to shoot a gun for the first time(that I know of) in what according to the not so subtle marketing is her movie, seemed like enough for me to see what looked like a blatant  Tarantino knock off. But now I think I should wait for these \"likable actress justifies seeing it movies\" till their Video on Demand."}, {"rating": "7", "text": "This movie will not appeal to everyone. It basically takes the action movie trope to the fullest. It starts a firefight, that hinders the actors movement, but not their intelligence... or lack thereof. They spend a full hour slinging insults around while shooting at people (many times not hitting them). Just some immature humor that is mindlessly violent, and sometimes fairly funny. A few good laughs here and there, would definitely be worth a red box rental, or something like netflix. not sure if it is worth a full ticket price, though."}, {"rating": "6", "text": "Free Fire tries to make its attempt to outshine what it wants to be. Unfortunately for that, the movie fails quickly before any attempt is made. Free Fire is probably an average feature within little or no amazing saving features about it."}, {"rating": "7", "text": "Esta película que no trata de videojuegos, retracta tal cual a los equipos de cualquier juego online, y me gusto."}, {"rating": "7", "text": "A sharply written film about a single 70+ minute shootout after an arms deal gone awry. The strength really lies in the performances and wittily written script in particular. Tonally somewhere between Tarantino and Guy Ritchie but quite a bit more low-key.  The only real downside is the limiting nature of the film's premise. The film does drag at times where it feels like you're waiting for the next thing to happen and the characters aren't particularly memorable even if they are distinctive and well portrayed."}, {"rating": "9", "text": "Fantastic homage to 70s era bullet operas. Funny, sharp dialogue leavens all the gun play, and the soundtrack - Real Kids, John Denver - sets the mood in this combination shoot 'em up and dark-black comedy. Sharlto Copley as Vern is worth the price of admission."}, {"rating": "8", "text": "Free Fire is one that I heard a lot of buzz about when the first trailer for it was released, and then it seemed like it got a fairly muted response when the review embargo lifted. And I don't really see why. In a sense, it reminds me of something that Quentin Tarantino might make. It's unique in that the entire film (outside of the first five minutes or so) takes place in a warehouse. Two groups enter the warehouse to make a firearms deal. It inevitably goes south, the two groups turn on each other, and the remaining hour or so it just them tossing insults at each other and trying to kill each other. It's a pretty fun time. The gunplay is also fairly realistic, and the stakes are real. Any character can die at any time, and as a result I found myself rooting for certain characters to survive or die. And to me, that's always a sign that it's accomplishing its goal as a movie: to be entertaining. Unfortunately, despite having some very fun moments, it does reach a slow point in the middle that takes a little too long to pass by. That, ultimately, is what kept it from receiving a much higher score from me. It's fun when it's fun, but it's obvious towards the middle that they struggled to stretch this idea to reach the 90 minute run time. Take out the dip it has in the middle, and it's a great movie to watch when you just want to have a good time watching a movie."}, {"rating": "8", "text": "I like such style movies so I enjoyed this one a lot. Was both fun and with action, maybe silly at times and ending was in a sense predictable, but otherwise good fun"}, {"rating": "6", "text": "Free Fire is not a bad chamber action movie. Everything is done at the middle level, starting from the cast, ending with camera work. And it seems that you will forget the film in a couple of days, so simple and trivial, but it is brought in the trailer as a magnificent Hollywood action movie from Scorsese. Well, it's ridiculous)"}, {"rating": "8", "text": "The movie does drag on a little, but this movie is funny and an overall very enjoyable watch. 84/100"}, {"rating": "8", "text": "A little like Reservoir Dogs but good enough to hold its own. Well acted and very entertaining."}, {"rating": "7", "text": "A movie that knows it place and doesn't try to be anything other than a shoot'em up black comedy and doing it well. And for the most part it does."}, {"rating": "1", "text": "The animation sucks the art style sucks the guns suck this is the worst popular games .Also its pay to win."}], "recommendations": ["kingsman_the_golden_circle", "guns_akimbo", "premium_rush", "skyscraper", "rocknrolla", "wild_card", "ant_man_and_the_wasp_quantumania", "the_commuter", "american_ultra", "mile_22", "limitless", "lockout", "miami_vice", "end_of_watch", "angel_has_fallen", "crawl", "red_notice", "2_guns", "the_fate_of_the_furious", "boss_level", "infinite", "hanna", "honest_thief", "baby_driver", "the_ice_road"]}