{"id": 4382, "title": "Freedom Writers", "starring": ["Hilary Swank", "Scott Glenn"], "runtime": 123, "genre": ["Crime", "Drama"], "description": "A young teacher inspires her class of at-risk students to learn tolerance, apply themselves, and pursue education beyond high school.", "releaseYear": "2007", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/81AdeUQT99N0xPg3j6RVh0YGOTk.jpg", "categories": {"plot": 7.346153846153846, "acting": 7.045454545454546, "ending": 9.0, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 6.0, "funny": 10.0, "action": 5.666666666666667}, "reviews": [{"rating": "10", "text": "Word up homies i seen a lot from da hood and its all about claiming property. This movie is dope as HELL! Live strong."}, {"rating": "5", "text": "This movie was pretty entertaining. Nothing special. It had its moments. One of the better aspects of this film was that the students seemed very real. A lot of movies like this make the kids come off as unrealistic, but I felt the kids were a lot like people I went to high school with. Hilary Swank was good, as always. I found the aspect of her character's husband leaving her to be very telling. I've learned over the years that people tend to be very selfish in relationships, and that's why so many marriages fail. Obviously, this was based on true events, so it was interesting to see that part of the story. This one's not going to win any awards, but it was a well made film."}, {"rating": "3", "text": "\"Freedom Writers\" is a story that should rightfully be told...in the form of a documentary. As vanity projects go, this earnest telling of an extraordinary teacher and her second chance pupils isn't \"Battlefield Earth\"-bad, but it's close. You get the sense that these inner-city kids have good hearts, however, the portrayal of their lives seem too sanitized to achieve versimilitude. At times, the film feels like \"Boyz in the Hood\" as rendered by the PAX network. There's also an odd episode or two that is more documentary than drama, which is an odd mix since the film makes no attempt at realism. This well-meaning film tries too hard to grab our hearts. The success and redemption of these hard-knock kids is somewhat blunted by an unwillingness on the filmmaker's part to be more objective about its subject."}, {"rating": "5", "text": "This movie was average and at times pretty boring. Hilary Swank is a great actress, but her talent wasted on an almost meaningless film. It's all about gangs and violence, so why does almost everything work out in the end? Yes, it had its touching moments, but should've gone farther with the gangs. This movie was too dragged out."}, {"rating": "8", "text": "I went to an early showing and must say, not only did I not know much about this movie but also wasn't expecting too much from it. In the end I was very pleasantly surprised. The actinig was top notch and the story flowed well."}, {"rating": "10", "text": "I loved this movie, it was very inspirational, I laughed and cried literally. I thought it was great when the entire movie theater audience started clapping at various touching parts of the movie. I really enjoyed this movie and I would recommend it to anyone."}, {"rating": "10", "text": "I must say that this is a very inspiring movie. Having a chid in high school, I would hope that his teachers would be jsut as encouraging as Ms. G. I very seldom see that kind of passion in any teachers now. I think this is a must see for all."}, {"rating": "7", "text": "A good film that does what it is supposed to do by telling the warm, well-crafted story of an actual teacher and her first class. Hillary Swank can play almost any role well, and this is no exception."}, {"rating": "9", "text": "Inspiring and touching at the same time. The best part is that it is based on a true story."}, {"rating": "9", "text": "Hilary Swank nails this role, which I expect was difficult to rise above the well-worn To Sir with Love path. If you hate movies that make you cry, stay away from this one, because it is a moving experience."}, {"rating": "8", "text": "A solidly formulaic sappy movie that made me cry. Very mainstream, but entertaining nonetheless."}, {"rating": "7", "text": "I was anticipating this to be just another one of those inspired teacher/tough student movies. And it is. But, this one somehow reaches deeper and is very much a touching and moving film. I didn't find it completely convincing, but the characters are so well developed, so rich in emotion, it becomes a very compelling piece of film making. Good performances from everyone."}, {"rating": "10", "text": "Since this is the high school I graduated from in 1950, the story fasinated me. I didn't have a clue such things had happen to MY school. I went to my 50th high school reunion in 2000 and not a word of it was mentioned. The school had been turned into a \"progressive\" school. I was at first shocked at this story and couldn't believe it had happened. Hillary Swank did an excellent job and made a believer out of me. If 150 students who had no hope could be turned around, then it makes me proud that I went to that very school. Thanks for bringing the story to light."}, {"rating": "10", "text": "Excellent, inspirational movie. All the characters are realistic and interesting. Very engaging and fun to watch."}, {"rating": "4", "text": "It's unfortunate that a true story with such potential was ruined by poor film making. Although at times moving, freedom writers only serves to rehash all the cliches of the \"genre\" (there have been so many movies like this it could be called a genre of its own). The almost immediate transformation of the culturally deprived urban students to highly motivated students is not at all beleivable. I don't know how the real life Gruwell accomplished what she did, but it couldn't have been how it was portrayed in this movie. The student's intense and genuine diary entries, no doubt a major factor in the reviews, would be just as effecting if you read them yourself. The real children were insiteful and aware of life in the ghetto. It's to bad the filmmakers weren't more like them (although, to their credit, the classroom interaction among the students at the start of the film was spot on). See Half Nelson, a much lower profile, yet much better movie that isn't an insult to your intelligence."}, {"rating": "9", "text": "This movie got it right. The resistance that Erin G received from those that thought that these students were a lost cause exists in every school in every big city. There are too few Gruwells out there, and too much of the other. The movie was not perfect, but it did a really accurate job of showing what it takes to get results in an urban school. It should be required viewing for all teachers. And I have not been in a movie audience that has been that moved in many years."}, {"rating": "7", "text": "The \"dedicated-teacher-teaching-in-the-slums/ ghetto/ projects/ 'hood (depending on when the film was made) who-Makes-A-Difference, dammit\" movie genre, whether represented by Blackboard Jungle, Up the Down Staircase, Dangerous Minds and many others, has always been vulnerable to slings and arrows for focusing too little on the disadvantaged multiethnic students and too much on the nice White instructor who rescues them from their surroundings, if only for a few hours a day. Freedom Writers is certainly susceptible to much of the same criticism, but much of it is rendered more or less irrelevant for one simple reason: Hilary Swank is so very good--and so enjoyable to watch--as the teacher. In a performance that's every bit as praiseworthy as her far flashier, Oscar-winning turns in Boys Don't Cry and Million Dollar Baby, Swank isn't at all afraid to appear quite dorky and even rather condescendingly self-satisfied in her early scenes, when she hasn't quite reached her charges yet (and they resent her for seeming to talk down to them). Not that she isn't tremendously likable here, too--especially after she gets her kids' attention by correlating urban gang violence with the beginnings of the Holocaust in a great, inspired near-monologue that's the perfect definition of thinking on one's feet. In fact, if the one thing that Swank's last movie, the Brian DePalma-directed 51-car traffic wreck that was The Black Dahlia, actually did RIGHT was to demonstrate for the first time how incredibly sexy Swank can be in certain roles, then one of Freedom Writers' proudest accomplishments is that it shows off how formidably cute she can be in others. The film works because of Swank, and also because real-life superteacher Erin Grunell's success in developing her students' self-respect and compassion for others as well as their writing skills by having them commit their fears, hopes and lives to paper is truly impressive, admirable and inspiring...but Freedom Writers is still not shy of a few flaws common to its type. Most of the stuff involving Patrick Dempsey as Swank's rather self-pitying husband provides a good excuse for a bathroom break; as most Gray's Anatomy fans already know, Dr. McDreamy is at his least appealing when he morphs into Dr. McWhiny...and that's the only note that writer-director Richard LaGravenese allows him to play throughout. Speaking of wasted actors, the great Imelda Staunton (Vera Drake) deserves better than the one-dimensional faculty head whose sole function is to show how right Erin Grunell is by default simply by sneering bureaucratically at every suggestion Grunell makes. And as moving, stirring anf genuinely affecting as much of Freedom Writers is, one still has to sadly and grudgingly admit that criticisms of it as being a partial paean to emotional codependency aren't completely off the mark. If you think about it for a moment or two, isn't Grunell's class, by fighting so hard to keep her as their teacher for another year, somewhat selfishly depriving OTHER equally disadvantaged and at-risk Long Beach, California students of the opportunity to benefit from her extraordinary, life-changing gifts?"}, {"rating": "7", "text": "Hillary Swank plays a school teacher in a bad neighborhood, who manages to become a second family and create a special kind of bond - trust, love and emotion - with her students in spite of all hardships. They call themselves Freedom Writers. Film is based on real events. Another good and rather difficult drama with Swank."}, {"rating": "10", "text": "Incredibly inspirational and heart-felt. Great acting and cast. The whole Holocaust thing...powerful!"}, {"rating": "10", "text": "The first movie ive seen where the problem of diversity and adversity in youth's life really reaches its core. amazing and heart touching."}, {"rating": "8", "text": "Very nice movie... Touching."}, {"rating": "10", "text": "This is one of the best movies I've seen in a long time (and I've seen quite a few). It made me laugh, cry, and consistently tugged at my heart strings. It is a must see for anyone who believes that there is good in everyone."}, {"rating": "6", "text": "Just an average feel-good movie. Good performances."}, {"rating": "8", "text": "People, educate your children! Tolerance is what this world needs. It can be derived from studying history which furthermore should prevent us from making the same mistakes that others did before us. \"Freedom Writers\" is, on the one hand, a sad revelation to viewers who grew up in countries without gang life. On the other hand, it is a very beautiful movie, based on a true story, that proves that change is possible and hope is not in vain. The movie shows in a smart and reverent way how racism can lead to genocides. Highly recommended."}, {"rating": "6", "text": "Swank is an undeniable talent. It may not be possessed of a beauty worthy of Hollywood standards but delights rightfully so. Casually because she played properly fair. Being a good actress is not having a perfect face. Particularly, I think this is the best movie I've seen of hers. And there's more of hers that I have the pleasure to see... With this film, you realize how imortant not to lose the grip of being in a classroom. Who works in such spot recognizes it. You inspire me to teach their ideas. As I am shy with the public, I need good ideas to teach. I saw this movie, great tips about it. Bright, with riveting performances and leaves you to ponder when the letters begin to rise ..."}, {"rating": "6", "text": "This movie is kind of laughable in a way. It's chalk full of cliches, and yes I realize that was a pun. The first half of this movie was inspirational and moving, and then slowly it turns crazy. The principle, other teachers and department head are almost cartoonish villains. Short of holding a cat and saying \"we can't let the Negroes rise against us!\" she is laughable. Also Hillary Swank's character also sort of loses her mind. I understand that she made great sacrifices but she goes to far. She loses a marriage and then fights to stay with the kids through the high school. This sounds nobel on the surface but we lose sight of the other classes that she is dumping. Hazzah she saved 30 kids and screwed 130. The kids can always come back to a teachers room to get help. It shows how she falls short as a teacher to prepare these kids for the future. Maybe I am biased because my wife is a teacher but I have seen troubled kids in her classes move on and then come back for help. The kids were able to move on and become grown ups with out their hands being held. Thats the biggest problem with this movie. This movie could have been far better then it was but it falls short. Overall it is a good school movie but not much else"}, {"rating": "7", "text": "Bottom Line: Based on a true story, made to look even more inspiring.\r Moving and compelling drama finds Hilary Swank as a high school English teacher named Erin Gruwell. Ms. Gruwell is teaching teens (who are thought to be â"}, {"rating": "6", "text": "It is the typical movie bad children who become good thanks to a good person. The plot is typical, but the movie is entertaining."}, {"rating": "10", "text": "It is very sad that this was a true story, but also a very brilliant piece of work, I am so happy that this movie wasn't so pompus. Usually movies about race always end up blaming white people who did nothing wrong, but this movie is just flat out touching and entertaining. One of my all time favorites."}, {"rating": "5", "text": "It really...did...not...need to be made. As if these school stories about troubled teenagers had't become a formulaic and rely too much on lachrymose story-lines of inner-city school teaching. In truth, all except the non-minority I felt sympathetic to. I'm not racist, but every other character is either a waste, thug, or junkie. And in Hilary Swanks character, I can pitifully admire her insistence on teaching these, \"students\", how to live life not in the ghetto's. Once is about enough."}, {"rating": "7", "text": "An inspiring and surprising film that Hilary Swank surprised with a role as a teacher of literature that changes the sense of being of young people who steal, use drugs and murder , to be a writer of good, God and Liberty."}, {"rating": "8", "text": "A White Savior Film That Isn't Harmful, But Is Still Problematic as an Antiracist Film10/12Freedom Writers was an excellent film. I watched this and Da 5 Bloods on MLK Jr. Day to continue my antiracism journey and to both celebrate race and watch films that deal with racism.Freedom Writers is a beautiful story that wrenches my heart. I cried several times throughout. It's beautiful and upsetting, but almost carries the same Oscar-baiting drama as films like Crash or Green Book. Now, this is another white savior movie, but unlike Green Book, it's not slanderous to the true history and in turn, racistly trying to be an anti racist film.But the whole film is about the white woman being a hero and saving the black, Asian, and Hispanic kids (and the one white kid). She is the main character and the savior and the focus is on her. Of course, that's the story and she is a tremendous human. But, the film prides its antiracism and unifying messages, but also creates an unhealthy dependency on the minority characters. They need her and don't want to be without her and they're portrayed as being lost and helpless without her.So, this film has antiracist themes and it's a Race Film, dealing with racism, but being a white savior, it almost sits on the outside of the core of antiracism films. At the core of these films include films that are typically black-starring or black-produced and really deal with racism in a different way. Some good examples would be BlackKklansman, Selma, Sorry to Bother You, and Get Out. But, movies that sit on the outer circle of antiracism films are this one, To Kill a Mockingbird, The Green Mile, and The Help. They may have good intentions, good stories, or antiracist themes, but they just miss the mark by accidentally disenfranchising POC, over-dramatizing the stories, or collaterally contributing to racism through not fully antiracist stories.But, these aren't as bad as movies like Green Book that completely bastardize the true story, have disingenuous diversity/POC representation, and try to pass off a toxic race film as antiracist. Freedom Writers doesn't nearly go that far. The white savior complex doesn't help the film since it disenfranchises the characters of color and shows a necessity for white people to uplift people of color, but it also tells a great emotional story and comes across as a well-made movie otherwise."}, {"rating": "10", "text": "Escritores da Liberdade é um dos melhores filmes que eu já assisti. Tem uma mensagem linda (e muito importante para a sociedade), além da direção e roteiro impecáveis. Os atores atuaram muito bem, nos mostrando um show de interpretação."}, {"rating": "6", "text": "This film had things going for itself but, it had issues that it could've perfected on. For example, a major flaw with the casting of the students was that they looked twice the age of a regular high school Freshman. Despite the fact that this might irritate some moviegoers, it didn’t get under my skin that much since it seems like this is one of the more common flaws in most present day “coming of age” movies, and I was somewhat expecting that going into this film. Most of the scenes are shot in a pretty generic way, with tons of quick cuts that almost interrupted scenes. In a scene of one of Eva’s (April L. Hernandez) outbursts, she is seen kicking what appears to be tin on the ground and the scene in general was a bit silly. Also, the editor cut out part of the scene too quickly and it just didn’t flow. Although, I would consider the scene when the movie depicts the upbringing and backgrounds of the troubled students while Mrs. Gruwell is reading their journal entries, to be one of the more effective parts of Freedom Writers. This is because the inclusion of master shots during the scenes represented the more short and traumatic events all in one setting, and the long takes depicting the more lengthy events taken place while walking around on the streets. In my opinion, Freedom Writers should've utilized more of a variety of different shots to make the film visually more interesting. The directing and dialogue in the scenes between Mrs. Gruwell and the students are the strongest, especially when she mentions the analogy comparing gangs to the Holocaust.* I would regard this scene to also be the most realistic since I can picture even regular students getting heated with the teacher if they bring up a sensitive topic (gangs) and speak about it as if it was something they have personally experienced enough to know the emotion and impact attached to it. In addition, this scene also indicates to the audience how uneducated theses groups of students are, once its revealed that they didn’t even know what the Holocaust was. However my main issue with the film is that it exaggerates the antagonists too much, making them more one dimensional. Of course the first person that others would assume I’m referring is Margaret Campbell (aka Professor Umbridge). Even though she has been type casted in the same kind of role since Harry Potter, it is definitely for a purpose since she acts in that malevolent role very well. Both Mr. Gelford’s (John Benjamin Hickey) and Scott Casey’s (Patrick Dempsey) scenes in particular were super contrived in terms of trying to make them unlikeable characters. A scene I would say sums up how Mr. Gelford is portrayed is when Mrs. Gruwell meets up with the Board of Education and at one point, responds with something along the lines of, “You really think I care about the students?” No one in that scene even commented on the inappropriate statement he made and he was still perceived as being one of the more reputable and normal teachers in that district. Speaking from the perspective of someone who has a parent that works at the school, I would think that making absurd and unprofessional comments like that around the Board of Education would get someone into some trouble. Dempsey’s scenes are even more unconvincing since they shift from him expressing how dissatisfied with their distant relationship to him forgiving her and being all affectionate with her too quickly. These scenes would’ve been better if they just executed the first two scenes with him in a way that made it seem like they were a normal couple with no issues and then slowly add tension. Another issue I had with Freedom Writers was the portrayal of Ben Daniel’s (Hunter Parish).  I felt  in the beginning of the film, that he would be a prominent character but they just squeezed in his character’s backstory during the most random scene. Despite the drawbacks I just mentioned and the occasional cheese, Freedom Writers is an uplifting movie that I would rate higher than Stand and Deliver (the super dated original version) but lower than Dead Poet’s Society since that move is better in all aspects. So, a fair score for this movie would be a 3 out of 5."}, {"rating": "10", "text": "Amo esse filme. Muito inspirador. Literalmente mudou a minha vida de várias formas e a principal delas foi me ensinando a dar mais valor aos professores. Assisti quando criança e era muito difícil algo prender a minha atenção na época; mas esse longa conseguiu, justamente por ter tudo o que, pra mim, um filme BOM precisa ter: boa ambientalização, boa foto  grafia, bom roteiro e boas músicas. Filme simplesmente incrível, merecia muito mais reconhecimento. Amo demais! Nota 10."}, {"rating": "7", "text": "I was somehow amused to find Imelda Staunton in this film, playing the school section head (assistant principal or something similar) - a very English actor, who I can't say I'd considered being in a film about a school in a rough, gang culture area of the US. Of course this sort of film is hardly original, there have been numerous other examples, such as Dangerous Minds with Michelle Pfeiffer. It is, thus, a somewhat sobering watch. I could empathise with some of the students certainly and with the teacher who finds herself faced with a class full of uninterested, loud and cocky teens. I thought it was interesting that the teacher took the students to a Holocaust museum and how she tries to teach them respect. I've since read that the holocaust survivors featured in the film were genuine holocaust survivors, which obviously makes it feel somewhat more authentic.It is a fairly cheesy film in a way but it is also somewhat thought provoking, if you can see past the cliches. Its a film that means well but it isn't one I felt that overall was especially memorable, although I am aware its based on a true story and I do particularly appreciate films based on true stories - I don't know enough about it to be able to comment how realistic it either is or isn't though. There are a few poignant moments present (it may make you think about how people automatically prejudice people barely old enough to have had a chance to prove they can become more) but not really enough to give it a particularly high rate but enough to make it worth seeing if your interested in it, yes."}, {"rating": "10", "text": "The story was appealing from the beginning, and the movie makes you care for all the characters, the cast of actors also did a really good job. This is the type of movie I would like to see more often, it's very inspiring."}], "recommendations": ["captain_fantastic", "the_perks_of_being_a_wallflower", "moxie", "the_hate_u_give", "the_hunt", "moonrise_kingdom", "the_help", "wonder", "me_before_you", "babel", "crash", "3_idiots", "closer", "booksmart", "the_miseducation_of_cameron_post", "dead_poets_society", "lady_bird", "the_florida_project", "the_spectacular_now", "the_giver", "the_social_network", "the_book_thief", "white_boy_rick", "manchester_by_the_sea", "boyz_n_the_hood"]}