{
  "id": 2584,
  "title": "Free Birds",
  "starring": [
    "Owen Wilson",
    "Woody Harrelson"
  ],
  "runtime": 91,
  "genre": [
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "Two turkeys from opposite sides of the tracks must put aside their differences and team up to travel back in time to change the course of history—and get turkey off the holiday menu for good.",
  "releaseYear": "2013",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gnSU2wUBq2gTkBEkxY8C1d1fXAQ.jpg",
  "categories": {
    "plot": 5.354838709677419,
    "acting": 4.928571428571429,
    "ending": 4.333333333333333,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 6.181818181818182,
    "funny": 6.230769230769231,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Free Birds isn't a disaster, merely a bloated stab at family entertainment (and a spiffy commercial for Chuck E. Cheese pizza, which I'm only now learning is something people in America actually have delivered). It's a hero's tale, it's a sci-fi riff, it's a history lesson, it's a portrait of friendship, it's Braveheart with turkeys, it's a pop culture bonanza cut from the Shrek cloth, and together it's none of these. It's the turducken of animated comedies, and while it might satisfy kids, it's not the healthiest option.  A stew of half-baked plot elements and bird-brained bits pulled from other movies doesn't make the slapstick toon Free Birds a particularly satisfying experience."
    },
    {
      "rating": "7",
      "text": "It was funny and original, not to be taken seriously.  The critics and users that bashed it should try to take off their serious faces and just enjoy the silly surprises that this movie keeps throwing at its audience.  My kids liked it.  And do did I."
    },
    {
      "rating": "10",
      "text": "I don't understand the hate. They are literally going back in the time to the first thanksgiving to take turkey off the menu."
    },
    {
      "rating": "5",
      "text": "This move is not a disaster nor good, jokes are little corny but OK plot, plus this a rip off Chicken run, which was an amazing movie. Not sure about this! 5/10"
    },
    {
      "rating": "6",
      "text": "I have to give this 6 because though it was kind of different it was still enjoyable. I think the story was thrown together fairly quick but it had its great moments and iconic lines. I enjoyed it and thought it was a cool concept but could of been a bit better. But it was pretty good and I think kids would like it."
    },
    {
      "rating": "7",
      "text": "Very funny. Well written and animated. The voice actors were well picked IMO. And even tho I'm watching this 3+ years after its release, I find it funnier then the last 4 animated movies that have come out since 2016. didnt care too much for the chuck e cheese sponsored content but other then that it was good."
    },
    {
      "rating": "6",
      "text": "many people complain about this movie, and I know why. I admit it's bad, but at least I like. a little. the story is something out of the ordinary, a few birds, or turkeys, or chickens. WTF WHAT ARE THEY? on a mission to prevent the turkey be the Thanksgiving meal? it is something original, however it is not liked by many. the characters are forgettable, especially jake. music is forgettable, i almost not hear music in the action scenes. (My opinion) is a film to hang out with your family, or rather with your younger brother or cousin. yes i liked, more or less. free birds is not a bad film to 100% if you compare it with other bad movies of 2013, as planes."
    },
    {
      "rating": "7",
      "text": "Very cute movie. Story is engaging,  plot is adequately complicated for a kids holiday movie. I was pleasantly surprised today, seeing this after reading the terrible reviews. It's supposed to be silly. It's supposed to be fun. The kids loved it, mine and the dozens of others laughing in the theater.\rThe critics are off base here."
    },
    {
      "rating": "9",
      "text": "Love it. It's great. Highly recommended.  Great to play with friends and loved ones. Get it today. Perfect for Christmas, birthdays, or any other special event."
    },
    {
      "rating": "7",
      "text": "Definitely a weird one, but there's enough humor and entertaining moments here that will make it enjoyable for kids. I can't say too many adults will find it tolerable, but I found it to be fairly entertaining. The voice cast is top-notch with the likes of Owen Wilson and Woody Harrelson, but the animation is far from impressive. Still it gets the job done. The plot is decent even if it can get a little muddled and there are plenty of laughs here. The theme of the movie is odd but I can still see kids being plenty entertained, and maybe even their parents as well. It's not among the best animated movies out there, but there are still reasons to give it a shot."
    },
    {
      "rating": "9",
      "text": "I enjoyed the film a lot, it was a great story and very, very humorous. The characters all have different personalities & I like that. There were fourth-wall moments towards the audience which kind of made the film more like a parody of how a certain action film is supposed to be, it was a hilarious moment. I recommend you watch it, because I find the film entertaining and worth the time."
    },
    {
      "rating": "7",
      "text": "WTF!!!!!!! is everyone complaining about this is better then the critics say so.The plot is creative. also theres the lovable characters........................................"
    },
    {
      "rating": "10",
      "text": "Perfect kids movie. From beginning to end not the slightest hint of boredom ! I enjoyed it a lot and recommend it to anyone who likes some good fun with loveable characters. I would watch it again and that says something. I don't wanna spoil anything ! You gotta see it for yourself ! Btw I don't freaking know why there a so many bad reviews for this, I liked it a lot more than Despicable Me 2."
    },
    {
      "rating": "1",
      "text": "“Free Birds” isn’t a movie.  Movies don’t end with convenient product placements saving the day.  Even though the film has terrific voice acting, the movie is a generic, cheaply animated film with a paradox encrusted time traveling story, stuffed with bad jokes, garnished with morals and themes that are doing nothing but flying over the heads of their intended audience and washed down with the reality that this film was made to do nothing more than to sell Chuck E. Cheese pizzas.  To call this a movie is just an insult."
    },
    {
      "rating": "0",
      "text": "Oh, my, God. I thought Planes was godawful. This movie is basically everything an  animated film should not be. Unfunny, annoying, racist, and worst of all boring. The plot of the film is basically like dances with wolves, except with turkeys and a time travel element. Honestly, stay away from this piece of human waste, showing this to kids is really not a good idea, there are much better films still in theaters."
    },
    {
      "rating": "0",
      "text": "this is a movie where turkeys go back in time and try stop something in history that never happened...................................... enough said."
    },
    {
      "rating": "10",
      "text": "It is an excellent movie, the climax was great.\rIt teaches Turkeys are also sentient beings and which really are. And how scary it is to die.\rClimax was great and the story is  perfect."
    },
    {
      "rating": "5",
      "text": "Free Birds is sure to entertain small children with its bright colors, light hearted tone (except for one scene), and nice humor. However, everyone else will probably be uninterested and/or bored as the film has little to offer. The story lacks any real substance and has a poorly constructed ending, the characters are not that interesting with the only interesting ones being interesting more for the actor voicing them then the character themselves, and the film doesn’t deliver in the comedy department as much as it should. However, I can’t hate this film as it didn’t get under my skin or make me role my eyes. The film gave me some amusement but also some shallow righting so it falls in the middle with me neither disliking nor hating the film. Check it out if you are interested but if you don’t care I don’t blame you if you skip it as this film doesn’t have much to offer anyone outside of little kids."
    },
    {
      "rating": "5",
      "text": "Quite humourous but lacking visually and it's story is pretty dumb. Voice acting is good."
    },
    {
      "rating": "7",
      "text": "Mission thanksgiving. The turkeys time to fight back!\r It is definitely an underrated animation. Okay, I agree, Disney is solely dominating the animation industry, especially at present. But this film is no masterpiece like that Disney makes yet not bad to ignore complete. Yes, there are flaws in it, but very acceptable as they're just minors. In the animations, the real world logics won't apply. So you should try to enjoy it than trying to find the errors.\r This film is targeted for children, but then anybody can watch it because it is a beautiful theme with some real laughs in it, only if you forget that you are an adult for a 90 minute. Technically the film quality matches with Disney, Pixer, Dreamworks and even the Sony animation. It is a fine achievement for an outside/new production house to come up with like this. I hope Reel FX would make more animations in the future and compete directly with these top companies.\r It was really a star studded cast. I did not know who were they all, but I identified them by their voices. As far as the story, too easy to predict, but somehow it managed to keep me glued to it with its entertaining contents. It is a time travel theme and a quite entertaining film made by the 'Horton Hears a Who' director.\r Some are saying it is anti-thanking giving film, but I think it is just a fun film. Although, it was kind of like 'Happy Feet', where a bunch of turkeys tries to loose their kind from the humans grip. But narrated differently, something like in the line of 'Penguins of Madagascar'. I don't think anybody can regret watching it, but then there are people with expectations, so it might fail at them. Overall, it was a decent film for sure if not great as other animations that came in the same year. Waiting for its sequel about 'mission turducken'.\r 7/10"
    },
    {
      "rating": "1",
      "text": "I found this movie truly unwatchable. In fairness, I didn't expect much, but I was hoping it would be laughably bad so me and my friends could enjoy it. It was terrible. The premise was awful, the acting was weak, the animation was sub-par, the message was irrelevant, and we had to leave the theatre after half an hour. The funniest bit was a strange double entente that I don't even think was intentional. The worst film I have ever seen, and I've seen The Room."
    },
    {
      "rating": "3",
      "text": "YAWN!boring,racist,AND WEIRED!It's not good.Saw the trailer,heard bad stuff about it.Saw the first 30 minutes then i turned it off!PLEASE DONT WATCH!!!:("
    },
    {
      "rating": "6",
      "text": "Nice move that whole family can enjoy its got plenty of action and comody also a little bit of learning but this movie seems to fit the range of 5-10 year olds but it is a solid movie that the family can enjoy"
    },
    {
      "rating": "3",
      "text": "Free Birds has a very intriguing (and weird) premise but executes it very poorly through an unbelievably predictable and unfunny adventure. It isn't a disaster, but it is bad."
    },
    {
      "rating": "5",
      "text": "I didn't like this movie, but I certainly didn't  hate it. Some of the jokes were funny, but some were awkward and weren't funny at all (mainly the ending joke) but the story was... how do I put this... Interesting...? Most of the characters weren't that interesting though, especially the main character, who I think could've been fleshed out a bit more, and some of the voices didn't seem to fit their character, probably because of some of the previous work they have done, such as the main character, Owen Wilson being in Cars, all of a sudden being a wimpy turkey."
    },
    {
      "rating": "5",
      "text": "I saw \"The Hunger Games: Catching Fire\" with my little brother and his friends, but I would like \"Free Birds\". Even though, I would gave \"Free Birds\" two thumbs down."
    },
    {
      "rating": "3",
      "text": "i loved owen wilson in the internship and wedding crashers  .  but this is the worst thanksgiving special i have ever seen worst then charlie brown series ."
    },
    {
      "rating": "4",
      "text": "Free Birds is pretty bad. It's only for kids who don't understand what's going on. If they understand what is going on, well you just wasted your money, even if it was for your child."
    },
    {
      "rating": "0",
      "text": "Stereo typical Racism... And until the very end you think its not so bad... Then a skinny adult yanks a pizza from a little boy pilgrim and calls him \"Fatty\". Then an Native American dances around with pizza over his penis. Inappropriate to tell youth these are acceptable terms to use on other people and to make fun of a culture and degrade their integrity with a cartoon mockery of an original American culture. History is horrible and people are mean in real-life.. But this is one of those movies that make it 'okay' for kids to say \"It was just a joke!\" when it harms other peoples image or emotional well being.  A must see to teach your kids how NOT to act."
    },
    {
      "rating": "3",
      "text": "Free Birds has a very intriguing (and weird) premise but executes it very poorly through an unbelievably predictable and unfunny adventure. It isn't a disaster, but it is horrible."
    },
    {
      "rating": "3",
      "text": "time traveling turkeys go back  in time to stop turnkeys from being the main menu on thanksgiving dinner go I need to say more........................"
    },
    {
      "rating": "8",
      "text": "Free Birds is a fun and interesting animated movie that kids can enjoy and have a great time at.This movie in my opinion is hated way too much and unfairly because it does have problems on its own but it also has good things in it and above all,good characters that make for a fun ride."
    },
    {
      "rating": "1",
      "text": "An interesting idea that was executed poorly. Free birds is the story of two birds wanting to change the coarse of history by rebelling against humans and not be used for thanksgiving. Free birds is the kind of movie you want to like but just can't. The adventure is predictable and boring. The voice cast is not good and the plot starts to wear thin even with an hour and a half run time. If you like this movie great but there are so many better animated movies out there. This one is complete blah."
    },
    {
      "rating": "5",
      "text": "Although it seldom approaches the inspiration of its plucky and popular premise... Free Birds nevertheless manages to avoid being branded a holiday turkey."
    },
    {
      "rating": "5",
      "text": "Although it seldom approaches the inspiration of its plucky and popular premise... Free Birds nevertheless manages to avoid being branded a holiday turkey."
    },
    {
      "rating": "0",
      "text": "“Free Birds” isn’t a movie. Movies don’t end with convenient product placements saving the day. Even though the film has terrific voice acting, the movie is a generic, cheaply animated film with a paradox encrusted time traveling story, stuffed with bad jokes, garnished with morals and themes that are doing nothing but flying over the heads of their intended audience and washed down with the reality that this film was made to do nothing more than to sell Chuck E. Cheese pizzas. To call this a movie is just an insult."
    },
    {
      "rating": "5",
      "text": "Although it seldom approaches the inspiration of its plucky and popular premise... Free Birds nevertheless manages to avoid being branded a holiday turkey."
    },
    {
      "rating": "5",
      "text": "Although it seldom approaches the inspiration of its plucky and popular premise... Free Birds nevertheless manages to avoid being branded a holiday turkey."
    },
    {
      "rating": "4",
      "text": "I wish I could free myself and my memory from this movie. It's not the worst animated movie, but it's bad. The story is a simple our species is being hunted lets fight back, nothing new there. The main protagonist is so boring and even he doesn't sound like he wants to be in the movie. All the other characters lack the same thing. Plus, there is no real memorable moments in this because most moments lack interest. The animation through is still decent enough to look at. Overall, if you want to watch a thanksgiving film, you might want to skip this one out."
    },
    {
      "rating": "5",
      "text": "Although it seldom approaches the inspiration of its plucky and popular premise... Free Birds nevertheless manages to avoid being branded a holiday turkey."
    },
    {
      "rating": "5",
      "text": "I enjoyed some parts, but some parts were bad. The story was good until the end, and some boring middle parts. The voice acting could use some work, but it wasn't terrible. In all, it was just ok."
    },
    {
      "rating": "6",
      "text": "Watching the movie, is genuinely strange and at times, makes you question what the direction was for this film. You're not sure if it was meant to be an ironic **** or an incompetent satire. But my god, does it have funny moments. I really enjoyed this film and how it embraced the wacky premise and went all the way. It does have a somewhat forced middle act of sympathizing the turkeys but hey, if you've got nothing better to watch Thanksgiving and are willing to have a laugh at a movie that knows its premise is ridiculous. I'd give it a watch."
    },
    {
      "rating": "2",
      "text": "this movie wasn´t good at all in my opinion! it is just stupid and dumb! let´s be thankful that we won´t see more adventures with reggie and jake anytime soon!"
    },
    {
      "rating": "1",
      "text": "most poo movie i have ever seen. fell asleep watching it, woke up and was very confused by bad storyline. genuinely worst movie ever seen so bad"
    },
    {
      "rating": "4",
      "text": "I wish I could free myself and my memory from this movie. It's not the worst animated movie, but it's bad. The story is a simple our species is being hunted lets fight back, nothing new there. The main protagonist is so boring and even he doesn't sound like he wants to be in the movie. All the other characters lack the same thing. Plus, there is no real memorable moments in this because most moments lack interest. The animation through is still decent enough to look at. Overall, if you want to watch a thanksgiving film, you might want to skip this one out."
    },
    {
      "rating": "10",
      "text": "I have no words for how amazing this masterpiece is. 9 years on, it remains one of the greatest cinematic acheivements in human history. It was a journey about how our brave heroes went back in time to the first thanksgiving to take turkeys OFF the menu! They say that every time someone watches this movie, a new \"Zone 6: Mars\" releases. Just a rumour though, I recommend you try it out for yourself! 157/10!"
    },
    {
      "rating": "0",
      "text": "Race with RyanPageTalkReadEditChange sourceView historyFrom Simple English Wikipedia, the free encyclopediaRace with RyanDeveloper(s)\t3D CloudsPublisher(s)\tOutright GamesSeries\tRyan's WorldEngine\tUnreal Engine 4Platform(s)\tMicrosoft WindowsNintendo SwitchPlayStation 4Xbox OneRelease\tNovember 1, 2019Genre(s)\tRacingMode(s)\tSingle-player, multiplayerRace With Ryan is a 2019 racing video game based on the YouTube channel Ryan's World. It was developed by 3dClouds and published by Outright Games for Microsoft Windows, Nintendo Switch, PlayStation 4, and Xbox One.DevelopmentThe game was announced on July 8, 2019. A trailer for the game was released the same day. On May 11, 2020, downloadable content was released, called the \"Surprise Track Pack\". A special edition, called the \"Road Trip Deluxe Edition\", was announced the same day and was released on October 16, 2020.ReceptionReceptionAggregate scoreAggregator\tScoreMetacritic\t51%Review scorePublication\tScoreNintendo Life\t4/10On Metacritic, the Nintendo Switch version of Race With Ryan received an average score of 51% based on four reviews, indicating \"mixed or average\" reviews."
    },
    {
      "rating": "10",
      "text": "THIS iS THE MOVIE WHERE THEY GO BACK IN TIME TO THE FIRST THANKSGIVING TO GET TURKEYS OFF THE MENU!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    }
  ]
}