{
  "id": 3617,
  "title": "Free State of Jones",
  "starring": [
    "Matthew McConaughey",
    "Gugu Mbatha-Raw"
  ],
  "runtime": 140,
  "genre": [
    "Action",
    "Drama",
    "History",
    "War"
  ],
  "description": "In 1863, Mississippi farmer Newt Knight serves as a medic for the Confederate Army. Opposed to slavery, Knight would rather help the wounded than fight the Union. After his nephew dies in battle, Newt returns home to Jones County to safeguard his family but is soon branded an outlaw deserter. Forced to flee, he finds refuge with a group of runaway slaves hiding out in the swamps. Forging an alliance with the slaves and other farmers, Knight leads a rebellion that would forever change history.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pKhJLNHu5Aw8BgxOJ90lCmg0j0f.jpg",
  "categories": {
    "plot": 8.333333333333334,
    "acting": 7.685714285714286,
    "ending": 8.5,
    "soundtrack": 5.0,
    "cinematography": 6.5,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 7.9375
  },
  "reviews": [
    {
      "rating": "5",
      "text": "This film has impressive cinematography and decent acting but fails to deliver an enthralling plot."
    },
    {
      "rating": "6",
      "text": "Matthew McConaughey is a powerful actor in a powerful role but “Free State of Jones” is not as powerful a screenplay, by Gary Ross, as it could have, should have been. All the elements are there from the story being based on a not too well known chapter in American history that includes the Civil War, slaves being mistreated by owners, inter-racial lovers, voting rights, KKK attacking, the poor who are fighting the war so the rich can get richer, a band of escaped slaves, a time in the future when a man is put on trial for marrying a white woman because he may be part black and just after that scene the film doesn’t go into the high you would not only expect but want.\r The idea of a band of people calling a section of their State, here the Free State of Jones, and how that is done or would work is passed over just as what the slaves and poor white people have in common enough to unite and go against those in charge.\r Gary Ross, who also directed the film, tries to stick to the facts of history and, in most cases, stays away from over dramatizing those scenes that might have been more moving, for instance the coupling of white, married Newton Knight (Matthew McConaughey) and black slave Rachel (Gugu Mbatha-Raw) who give birth to a son and, due to reversals in fortune, his wife (Keri Russell), along with his first son, comes to live with them.\r McConaughey continues his winning streak of strong characters but here he applies the strength that is only hinted at by the director and writer, while the depth of his relationship with Rachel is helped by the subtle playing of Gugu Mbatha-Raw who, after “Belle” and “Beyond the Lights” should be a huge star. Mahershala Ali, who names himself Moses, starts with a repulsive iron necklace with spears eventually removed by McConaughey, and winds up in one of the most shocking scenes of the film.\r The cast, with many speaking parts, is an honest look at all sexes, ages, social strata most of who made up the armies of the Civil War. The swamp, filmed in Louisiana, provides some breath taking scenes.\r “Free State of Jones” will show many viewers a part of American history not too well known, contains strong performances but at 140 minutes could have been tightened by eliminating the courtroom scenes that take place in the late 1940s making for a tighter, faster moving and, possibly, allowed some room to add emotional scenes as even most of the death moments offer nothing."
    },
    {
      "rating": "9",
      "text": "This film was marketed incorrectly, and it doesn't help that the people involved are hollywood blockbuster types. But as a result we are looking at critics looking at the film through that lens critiquing based off of the wrong criteria. This film was not about a gripping plot, it was not about the story of a hero, it was not a mere attempt to shift hollywood paradigms on the \"white savior.\" This film is above all else a conversation starter. And it wouldn't be doing its job correctly if it was overdramatized, overwritten, and done in a way that is meant to be digestible for your typical moviegoer. Ross does a spectacular job preserving the integrity and academic nature of the content.\r So for those looking for the next wartime hollywood drama, maybe check out Captain America: Civil War. For those intrigued by the unearthing of a controversial piece of history, I would highly recommend this film.  Not to mention it came paired with a primary source reader that documents and provides footnotes for every scene of the movie. www.freestateofjones.info"
    },
    {
      "rating": "10",
      "text": "This movie is very well done.  Interesting because it gives another perspective during a tumultuous time in our country's history.  Based on a real person and actual events, the movie helps to explain how things were.  Matthew McConaughey does a great job!"
    },
    {
      "rating": "9",
      "text": "I was unaware of  this history, but researched it before attending.  This movie rang true.  It did not sugarcoat, and the violence was not gratuitous.  It seemed so realistic and grainy, like life is.  The acting was amazing.  Go see this movie.  Support this company, so we can see something important and amazing--not just remakes of cartoons or horror.  We were spellbound.  We had to sit there for a few minutes when the movie was over to gather ourselves.  Do not miss this movie."
    },
    {
      "rating": "10",
      "text": "Good important film. True to history, can feel painful at times but I think that was the directors intention. Worth a look. Definitely more of a beautiful documentary then a hollywood blockbuster."
    },
    {
      "rating": "10",
      "text": "Ultimately, I was impressed by this movie. I am not sure how accurate it was. It is worth noting that the time period is a tough one to get totally accurate information about any story or story line. I loved the movie. The acting was excellent. I am surprised with the timing of release though. Most movies like this one are released closer to the awards season."
    },
    {
      "rating": "10",
      "text": "An incredible film. McConaughey does a fantastic job, there is some amazingly beautiful cinematography, and this story is definitely one that needed to be told. Anyone saying that this is historically inaccurate obviously hasn't done their research. The director Gary Ross worked closely with 11 historians (including Harvard University professor of English and African (American) Studies Dr. John Stauffer,) and he studied the Civil War and Knight's story for 2 years before he even began writing the screenplay. They even have a website you can look at to back up everything that is in the movie. This is an outstanding film, and I highly recommend you go see it!!"
    },
    {
      "rating": "8",
      "text": "Free State of Jones is a compelling drama that tells one of the lesser known stories of the Civil War. Matthew McConaughey plays the role of Newt Knight a Mississippi farmer that is disillusioned with the Confederate cause. McConaughey offers a solid performance and lends gravitas to some of the monologues given by his character.\r Deserters? Bushwackers? Freedom Fighters? These are all terms that could be used to describe Knights' band of citizen soldiers which are a ragtag assortment of former soldiers and runaway slaves. The film is respectful of the history behind its source material and creates some incredible thought provoking scenes. How the film manages to juggle these themes is not flawless however. There are several jump cuts between the 1800's and the 1950-60's. Despite this I do understand why the director may have chose to do this in an attempt to juxtapose the struggles of the past with those of Knights' descendants.\r At its best the film offers a poignant portrayal of a darker period in our nation's history by highlighting a group of people who fought for a better world and for what was theirs. Its unfortunate that at times the film seems to buckle under its own weight giving the impression the director may have struggled by trying to tell a broader narrative than it had to be.\r If you are looking for action scenes, the film does have them though the battles are fairly limited in terms of screen time. They are shot well but ultimately don't carry the weight that the dialogue and other elements of the film do.\r Free State of Jones is not a perfect film but is still ultimately a riveting watch despite its stumbles."
    },
    {
      "rating": "7",
      "text": "Matthew McConaughey gets most of the screen time as a defiant Mississippi farmer who starts his own rebellion against the Confederacy. There are parallel stories about his relationships with several slaves and a flash forward to a racially-charged court battle in the 20th century. A lot's going on and even with the deliberate pace, it manages to maintain interest. Writer/director Gary Ross has purposely let this sprawling story take place slowly and took advantage of McConaughey's star power with lots of lingering close-ups. The cast is strong and that helps, but this film is dramatic, solemn and noble…a mighty effort to make important cinema…and it somewhat succeeds. Plus, it's based on a remarkable true story, which makes it more interesting."
    },
    {
      "rating": "8",
      "text": "Historically accurate movie that really makes you question what you were taught in school about the civil war. Wonderful performances by all the leads and beautiful cinematography that takes you back to what it must have been like in the south. Very realistic fight battle scenes that do not glamorize war at all but make it very scary and real. A story I had never heard of before but loved seeing for the first time. Made me feel good that someone back then felt sympathy for mankind no matter what their color.  I was also surprised about the Reconstruction era that followed the war and how the rich plantation owners were allowed to try to go back to business as usual."
    },
    {
      "rating": "10",
      "text": "Metacritic: the same person has obviously posted with several different user names negative reviews (0) for this one and positive reviews for Independence Day (10) over and over. Allowing a troll to stick up several reviews obviously renders users' reviews nonsensical. Not to mention the person obviously hasn't even seen this movie."
    },
    {
      "rating": "4",
      "text": "Free State of Jones boasts very good performances from its leads, especially from Mahershala Ali and of course Matthew McConaughey. But even they can't save this film from becoming nothing less than a bloated, boring, and often preachy history lesson that would serve best as a HBO mini-series."
    },
    {
      "rating": "10",
      "text": "Being raised in the south and born in MS this movie touched my heart. The memories growing up during the 1950's were both good and bad. I want to commend the writer and the cast for doing an excellent job and giving us an insight to events that were never allowed in the history books of our many schools.\rThanks for being bold enough to give us the truth for a change...I highly recommend everyone see this story, it will open your eyes to the struggle of what this country was built on...FREEDOM FOR ALL!!!!"
    },
    {
      "rating": "8",
      "text": "I don't understand most of the low scores here.  This was a riveting movie that kept me interested throughout, as it looks at Newton Knight's life as a Confederate deserter, leader of a militia that controlled a portion of Mississippi, and a civil rights supporter during Reconstruction.  It then flashes forward to the miscegenation court case involving his great-grandson in 1948.\r Matthew McConaughey does a terrific job as Knight, and makes us understand his transformation.  Keri Russell, Gugu Mbatha-Raw and the actor portraying Moses also turn in stellar performances.  Yes, there is considerable graphic violence, but it does not seem gratuitous.  The reconstruction part of the film is also quite difficult to watch (and somewhat long).  The film is not at all sympathetic to the Confederate army, particularly the officers, since it is told from Knight's perspective.\r I actually found the flash forward to 1948 to be a valuable part of the film (at times, it was a break from the Civil War/ Reconstruction action).  This film has a lot of interesting things to say about race and class in America, and it should be seen by more people."
    },
    {
      "rating": "10",
      "text": "Great movie. It's sad to see trolls come on meta critic can give fake reviews.  Well I can text to you about  this wonderful movie that I really enjoyed. I am going to research this true story of Newt Knight and countless other African enslaved men and women and poor Southerners who struggle to survive doing the civil war. Great movie for the family and yourself. The acting in spot on too."
    },
    {
      "rating": "10",
      "text": "Beautiful and sad, exciting and elegiac in tone, this is the best movie ever made about the Civil War. It is a true story which closely follows historical events. If you have no interest in history, you will be bored. If you love studying history as I do, you will be fascinated. At its heart is a very tender love story between two people whose lives have been unforgiving but who find some measure of peace in each other in the midst of the maelstrom of war.\r There are superb performances from Matthew McConaughey, Gugu Mbatha-Raw and Mahershala Ali. The audience follows Ali in his journey from runaway slave to insurrectionist warrior to happy family man and political organizer. Keri Russell in a small role breaks your heart. They are all trying, in the words of another Mississippian William Faulkner \"not merely to survive but to prevail\". A film that is deeply affecting and causes the viewer to reevaluate everything you thought you knew about the South during the Civil War."
    },
    {
      "rating": "10",
      "text": "This is one of the best movies I've ever seen. The critics missed the boat entirely on this one. I don't understand their negativity - completely unfounded. The acting is superb, the true story amazing - this is how movies used to be made. I guess the critics were looking for something faster-paced, but the director stayed true to the story. And what's wrong with learning a few things when you go the movies? I guess some people have a problem with that too."
    },
    {
      "rating": "10",
      "text": "I'm a huge history fan, so of course I've seen this movie twice already! And checked out their website where you can learn even more about the story and the history of it all (talk about going above and beyond for their movie!). My only fault with this movie is that Matthew McConaughey doesn't look like his usual sexy self, but I guess that is fair (loved him in \"Magic Mike! haha). You gotta check out the end where they show a picture of Newton Knight and it is chilling how similar Matthew looks to the real Newt! Pretty sure he was born to play this role. The lead girl, Gugu, is great too. She is awesome in \"Beyond the Lights\" so check her out in that after you see \"Free State.\" This isn't one of those boring history movies- they back up a cool true story with gorgeous shots, phenomenal acting, and beautiful music. Love love love this movie."
    },
    {
      "rating": "10",
      "text": "A great movie and an awesome true story too! Newton Knight was definitely ahead of his time. Plus, the studio made a website where you can fact check! freestateofjones.info  Put that in your pipe and smoke it! How can people say this movie inaccurate?! Seriously, before writing a review just saying that a movie is \"crap,\" maybe try actually watching the movie and doing your own research."
    },
    {
      "rating": "10",
      "text": "DO NOT AGREE.  Great American struggle.  By the film interlacing of Newton's revolt with the ongoing, lingering \"legal\" racism, which bled into the next Century -  simply a great film & great filming making.\r.\r This Jones event within the context of our hypocritical \"free country\" -  these sub-chapters in our Nation's history. like that of Edward Coles - yes, part of it was bad (really bad),  BUT, there've been some great humans, struggling to live by a higher set of morals.  I salute them and those who document their actions."
    },
    {
      "rating": "7",
      "text": "Free State of Jones commits a few key sins, but for me, I really do not care. Yes, it is a bit long. Yes, it does love speeches. Yes, it does cover too much. Yes, interspersing scenes from the future kills the flow of the plot, even if it continues the thematic elements of the film. Yes, it probably does simplify more than a few things. All that said, I still really liked this film.\r As I greatly enjoy history and have long craved a new film about the Civil War, I was just about to accept any drivel to make me truly satisfied. Fortunately, this one fits the bill and is slightly better than drivel. Matthew McConaughey turns in a typically charismatic and cool performance as a man I would follow to the end of the Earth and jump through a brick wall if he told me to. Not even as Newton Knight, either. I would jump off a bridge if McConaughey told me to without regret or shame.\r A sprawling and ambitious attempt to not only cover the story of Newton Knight, but also the period just before and right after the end of the Civil War in the South including topics such as apprenticeship, the rise of the KKK, inter-racial love, voting, literacy, \"emancipation\", and reconstruction. This often untold area of the Civil War is told very well in Free State of Jones, even if its jumping through time a bit is a clunky way of approaching the topics. That said, each scene it does show covers the topics it sets out to cover very well and accomplishes its main goal: to inform. Even better, it not just informs, but it entertains with tense and well-constructed action sequences that capture the look and feel of the Civil War. If nothing else, Gary Ross did his homework and that is truly admirable.\r Though the general plots expansiveness could have been better handled, Ross does a great job balancing his characters. Focusing in one people from different worlds, he does a good job developing the major players, especially Knight (McConaughey), Rachel (Gugu Mbatha-Raw), and Moses (Mahershala Ali). These characters really have good chemistry with one another and are largely well-written.\r The production design and costume design is another major win for Free State of Jones. With shocking attention to detail from the swamps of Mississippi to the battlefield, the film is masterfully crafted. The costume design for the uniforms and clothing is terrific and really impressive with its period detail. This, in addition to the characters, is where the film's bread and butter can really be found. Ross' ability to create well-developed characters and attention to detail is really evident in these two areas and why I found the film to be better than expected.\r On the negative side, Free State of Jones' use of the future case does further its examination of the power of prejudice. I mean, Newton's great-great-great grandson looks white, yet the fact that Newton had a child with Rachel means that he cannot marry the white woman he is in love with. Many took issue with the film supposedly mirroring the struggle of blacks with those of whites, but to me, it is not doing that. Instead, it is showcasing how deep and far this prejudice go. For all intents and purposes his great-great-great grandson is white. Yet, in the chance he any black in him, he must go to jail for trying to marry a white woman. Incredible stuff that shows how deeply hatred runs. Unfortunately, Ross has no idea how to work this into the film and the scenes play far too briefly and with little emotional impact. Instead, they are like blips that break up the rest of the film.\r Overall, Matthew McConaughey is very good in this film destined to be shown in history classes across the nation. An untold story from the Civil War, the story of Newton Knight and Jones County is an inspirational one of fighting for what you believe in. Though it is a bit long and could have been told better, the acting, characters, and production/costume design more than elevate this one in a well told history film. Above all, I am more than willing to accept this film to try and fill my craving for more historically-based films, especially ones from the Civil War."
    },
    {
      "rating": "10",
      "text": "Free State of Jones\" is a moving, authentic, important film. Matthew McConaughey gives an Oscar-worthy performance as Newton Knight, an historic figure. I forgot I was watching Matthew McConaughey and felt that I was watching Newton Knight. I've really never seen a performance quite like McConaughey's here. His Newt Knight is the most manly man in any room – or swamp – and yet he is also as tender as a mother.\r In the early Civil War battle scenes, he plays a nurse. Knight is not shown mowing down the enemy with impressive, explosive gunfire. Rather, he is shown risking enemy fire in order to save men's lives, or to retrieve and bury the corpse of a boy shot in battle on his first day. My tears flowed freely during these scenes. Later, Knight himself cries after one of his men is hanged. But Knight gets his revenge, an eye-for-an-eye revenge scene that I won't soon forget.\r Newton Knight was a white Mississippi farmer. He was the grandson of a slaveholder, but Knight owned no slaves himself. He served in the Confederate army, but deserted in 1862, after serving for almost a year. He was outraged by the Twenty Negro Law, that allowed families who owned twenty slaves to exempt one family member from service for every twenty slaves they owned.\r Knight and other deserters formed The Free State of Jones, declaring their loyalty to the Union, and flying the stars and stripes rather than the stars and bars. After the war, Knight worked for Reconstruction and married Rachel, a freed slave woman. His children also married cross-racially. He died in 1922. As might be expected, he is a controversial figure in Mississippi. Fans of the Confederacy denounce him as a traitor. Others celebrate him as one white Southerner who had a conscience and resisted white supremacy.\r Newt Knight was clearly someone with a bucketload of charisma. His power inspired men to fight to the death against their own nation. McConaughey radiates charisma in this role. He is masterful and yet intimate. I'd follow this Newt Knight into battle and feel proud to do so.\r \"Free State of Jones\" is receiving negative reviews. It's easy to see why. There is something in this film to anger multiple grievance mongers.\r First, race hustlers will hate this movie. Race hustlers want the official story to be that all whites are supremacists and all blacks are heroic. A film that depicts a white man who worked for black rights is taboo. Race hustlers anathematized \"Mississippi Burning\" and \"The Help\" for the same reason. Such a shame that the race hustlers' ideological blindfolds make it impossible for them to appreciate great art.\r Liberals might hate this film for a couple of other reasons. I don't know if I've seen a movie where almost every scene hinges on how guns are used. Almost everyone is armed, and uses those weapons to keep breathing and to settle disputes. Even little girls have guns and use them heroically. Second amendment fans may love this film. It depicts what they dream of: oppressed citizenry taking up arms to defeat their own government.\r In addition to clinging to their guns, these rebels cling to their God and their Bibles. This is one of the most religious American films I've seen in a while. It's an historical fact that Newt Knight was a devoutly religious Primitive Baptist – he didn't drink, for example. The film drives home Knight's Christianity. He is shown in a long scene using a quill to record a birth in his Bible. In one heartbreaking scene, a slave who has been sexually molested survives psychologically by reciting verses from Genesis. \"Free State of Jones\" practices a muscular Christianity. One eye-for-an-eye scene takes place in a church.\r Republicans will be torn about \"Free State of Jones.\" On the one hand, Knight, like many populist leaders, preaches against economic inequality. \"No man should be poor just so that someone else can be rich.\" I can hear theater seats squeak as Republicans head for the exits. Knight's words, though, reflect the facts. Poor white Southerners were sabotaged by the slave economy and they knew it. That's why they deserted.\r But Republicans, if they sit through the entire film, will see how the Republican Party was the favored choice of freed slaves in the post-Civil-War era.\r There is a narrative problem in the film. The viewer expects \"Free State of Jones\" to end after the Civil War. I actually began tying my sneakers, readying to leave the theater. But the film keeps going in what feels like an anti-climax. Gary Ross, the filmmaker, wants to make a point: the Civil War was *not* the happy ending. The KKK rose up, and Jim Crow became entrenched. Black men who tried to exercise their right to vote were lynched. This is an important point, but the film should have been better structured so its narrative flow didn't stop before the film itself did.\r \"Free State of Jones\" was clearly made by sticklers for authenticity. Everyone looks dirty and tired. The clothes look like clothes people wore in the nineteenth century. A confederate officer's uniform looks baggy and tacky, not sparkling and admirable. Scenes are shot in lamplight. I loved this aspect of the film, as will Civil War re-enactors."
    },
    {
      "rating": "5",
      "text": "Boasting excellent performances and terrific production value, Free State of Jones falters on understanding the plot and pacing of it's story.  It's built like a narrative, but structured like a documentary."
    },
    {
      "rating": "10",
      "text": "I don't usually review movies but the critic reviews led me feel they needed to be contradicted.  The contrast in opinion is stark between critics and movie goers.  This movie is so well done!!   Matthew M., Bravo!   Please watch it in spite of the critics!  Help them to be sent right into insignificance with their slanted views that suit their political agenda.   The American people's voice is much more powerful."
    },
    {
      "rating": "10",
      "text": "\"Free State of Jones\" : whatever your plans were for today...change them and go see this movie. With very few exceptions there is nothing else you can do today to better honor the 4th , the flag and your America than to see and process and discuss what this film has to say and reward those who made it. Also its a great film (really gory opening but once they've made the point they turn that down a bit). This story will touch a LOT of Americans very Personally.. the laws it talks about were still on the books when i was born..and the attitudes.. among other things.. are a poison that continues to sicken america to this day. We  rarely talk about it much in this country and we need to do so more in order to make right..what we only HALF made right a century and  a half ago.."
    },
    {
      "rating": "10",
      "text": "such a great movie. Very moving and gives a realistic view of what was going in the South during the Civil War and Reconstruction. Incredible true story which combined a war movie, a love story and an examination of the politics which deprived African Americans of their rights and made poor whites fight a rich man's war to protect the wealth of the planters who controlled the Confederacy. Real eye-opener. Oscar worthy performances from Matthew McConaughey, Mahershala Ali and Gugu Mbatha."
    },
    {
      "rating": "0",
      "text": "historically inaccurate pile of crap  as far as based on a true story...  otherwise a boring predictable  movie from hollywood set during the civil war,"
    },
    {
      "rating": "9",
      "text": "I went in to the film with no expectations and I left at the end very impressed. Brilliant acting and a fascinating, gritty story. Very much worth the watch!"
    },
    {
      "rating": "8",
      "text": "I have to stand with the positive reviewers on this one. Quite a moving story, especially in the current climate of fear and intolerance. I would only fault it on a couple of fronts: It could have benefited from tighter editing; and the secondary more contemporaneous parallel story is introduced a little late in the game by my reckoning. Matthew McConaughey continues to delight me with ever-more nuanced performances. I contend this movie is well worth the extended viewing time."
    },
    {
      "rating": "10",
      "text": "Amazing movie. Especially as I'm not from USA and didn't know many things which were depicted here it was both emotionally and historically a good movie for me. Matthew Mcconaughey and all the other actors are amazing here and while there were some minor flaws, I still think this movie is one of the best this year."
    },
    {
      "rating": "8",
      "text": "Free State of Jones is a compelling drama that tells one of the lesser known stories of the Civil War. Matthew McConaughey plays the role of Newt Knight a Mississippi farmer that is disillusioned with the Confederate cause. McConaughey offers a solid performance and lends gravitas to some of the monologues given by his character.\r Deserters? Bushwackers? Freedom Fighters? These are all terms that could be used to describe Knights' band of citizen soldiers which are a ragtag assortment of former soldiers and runaway slaves. The film is respectful of the history behind its source material and creates some incredible thought provoking scenes. How the film manages to juggle these themes is not flawless however. There are several jump cuts between the 1800's and the 1950-60's. Despite this I do understand why the director may have chose to do this in an attempt to juxtapose the struggles of the past with those of Knights' descendants.\r At its best the film offers a poignant portrayal of a darker period in our nation's history by highlighting a group of people who fought for a better world and for what was theirs. Its unfortunate that at times the film seems to buckle under its own weight giving the impression the director may have struggled by trying to tell a broader narrative than it had to be.\r If you are looking for action scenes, the film does have them though the battles are fairly limited in terms of screen time. They are shot well but ultimately don't carry the weight that the dialogue and other elements of the film do.\r Free State of Jones is not a perfect film but is still ultimately a riveting watch despite its stumbles."
    },
    {
      "rating": "0",
      "text": "McConaughey's worst in my opinion. The film is inaccurate, full of profanity and gore, and just plain out depressing. I would skip this film and watch something else."
    },
    {
      "rating": "7",
      "text": "فیلم ایالت آزاد جونز فیلمی است که گاهی اوقات افت میکند اما کارگردان خیلی سریع فیلم را به حالت هیجان میبرد و کارگردانی خوبی انجام شده و بازی خوب متیو مک کانهی کیفیت فیلم را بالا برده و کارگردانی فیلم خوب بود ، سکانسی که راچل وارد اتاق جدیدش شد و به تخت دست زد و گفت : پر سکانس بسیار غم انگیز و درامی بود و در سکانسی که بچه ها رو اعدام کردند درام فیلم به طول کلی بیرون زد فیلم خوبی بود اما عالی نبود و میتوانست بهتر باشد ، اما به نظر میرسید فیلم فقط خوبی های نیتون نایت را نشان داده و این ضعف این فیلم است ."
    },
    {
      "rating": "5",
      "text": "Just when I thought Free State of Jones was good, I was correctly mistaken when I saw it completely. Might as well pass this one if you can. A movie that adults won't even sit through 30 minutes of one scene. My evidence? Just don't waste money on it. Free State of Jones may look promising, but don't let that look fool you. It's a trick to let them know you wasted hours hoping for something to some, but it never came anyways."
    },
    {
      "rating": "9",
      "text": "Another gem of history transposed to film, a window into history.  A dozen historians contributed to the accuracy of the details.  This is the Civil War and Reconstruction as THE American tragedy.  Be prepared to watch a lot of characters suffering.  Acting and production design is near or at the level of Spielberg.  Probably unknown to most viewers is numerous communal, cross-racial, intentional communities were tried in the late 1800s.  This was one of them.  This film was probably a labor love for all involved."
    },
    {
      "rating": "8",
      "text": "A movie that tells the truth about the Democrats. The party of slavery, lynching and Jim Crow. No wonder so many critics gave it a bad review. I quite liked it."
    },
    {
      "rating": "8",
      "text": "I am a fan of Matthew McConaughey and I feel that this is one of his better roles. He plays a charismatic leader of a group of people that feel have been wronged during the American Civil War by the Confederacy.I found the Free State of Jones to be an excellent historical period war film. The story is very compelling which kept me riveted to the events of the movie. As someone that enjoys historical films I would suggest this movie to anyone that does as well."
    },
    {
      "rating": "8",
      "text": "Free State of Jones is a story based on true event during the American Civil War. It takes place in the Confederacy in the Southern state of Mississippi. Matthew McConaughey plays a soldier who treats the wounded but ends up “deserting” his unit after a boy he knows gets killed in battle. After forming a ragtag militia he becomes a thorn in the side of a Southern LT who steals food and supplies from locals who’s are barely getting by to begin with. This is a Robin Hood” type of story set in the 1800s.I think it’s  pretty well acted with a bit of action here and there’s. It is definitely a bit long but I enjoyed watching it... The only thing I didn’t like was a trial they kept flashing back and forth to throughout The movie. I definitely thought they could’ve done without! All in all I feel it’s a decent film and if you like period piece movies, especially the Civil War, I think you will enjoy this flick!"
    },
    {
      "rating": "9",
      "text": "Intrigueing, heartbreaking and eyeopening. Apparently many critics thought it was poorly done, or they are feeling some confederate itches because i've seen some really poorly made reviews on this movie.The story tells an untold story from a key moment in the fight against slavery, and shows ones again how rotten humanity and americans in particular have been throughout history. Matthew McConoughey plays excellent, and embodies the sanity and human caring that the world needs. This movie touches my heart strings, and i would love to see more like these."
    },
    {
      "rating": "8",
      "text": "A country that existed for a brief time in the history of American.Once again, it proves that the critics are so dumb. In this people to people and people to filmmakers contact era, no one listens to them. Let them do their own sideshow. This was partially based on the real events that takes place in the following years of 1862. When America was fighting a civil war, a man named Newton Knight returned home from the battlefield where he started to help the farmers who were robbed by the armymen. Its like they are fighting their own war, to protect the land and the crops. They knew the consequence and so they were prepared for it.This is over a two hour long film and I think they had covered everything nicely. At some stage it looked like the Daniel Craig's 'Defiance'. But it reveals many events like changing time and the atmosphere, how they adapted to it along to move on. In the opening scene only they had shown us the war, but very soon it moved away to tell what's happening off the battlefield. Like how it's affecting the people. So the resistance emerges and the days going by they gain large power in the region. Very interesting perspective, though everything in the film was not true despite overall plot was inspired by the history.Matthew McConaughey alone steered the ship. You will like his performance. The locations were good, but most of them were either farmland or swamp. There's a little event that follows the 80 years later, just to disclose some court law debate over interracial marriage. Not a must see film, maybe if you are an American, then it might be, but other than that its a good watch. I hope the people would realise that and watch it.8/10"
    },
    {
      "rating": "5",
      "text": "Free State of Jones is a period piece that has its moments but doesn't quite pack a punch. This isn't to say that it was a bad film, parts of it were entertaining but the screenplay is so muddled that it presents alot of missed opportunities. Might be worth a watch to some"
    },
    {
      "rating": "6",
      "text": "This movie had a lot to live up to with the director and the lead of the film. Matthew gives another great performance on this streak he's been on The movie had some really good action scenes as well but in other areas it falters. Some of the movie is just walking around doing a bunch of nothing and funeral services. Also the part with Newton Knight's grandson shouldn't of been in the movie. But I had some enjoyment out of it."
    },
    {
      "rating": "6",
      "text": "Matthew McConaughy plays a man with modern values struggling against the forces of Conservatism in the deep South of the US, through the Civil War and into the decades after. A secondary story of discrimination against a descendant in the 1950s is told in small segments. It's engaging, but not fully because the main characters are all too saintly or downright wicked."
    },
    {
      "rating": "6",
      "text": "wasn't that bad at all.wanna tell the tales of a white liberal hero who is gonna oppose the existing mentality of people of south.He rebels against the state power and later on somehow against the majority of people who believe in slavery as their own rights.so he is gonna be the savior of blacks(that happens most often in Hollywood).Not an extraordinary and outstanding performance by \"Matthew McConaughey\" but isn't that bad to spoil the whole movie.the only thing that I found interesting was \"Mahershala Ali's\" performance that was good and needs to be praised,and maybe the only one in \"jones county\" that got a well-written personality.movie isn't boring at all;it's based on actual events and is somehow encouraging american society to involve in elections and vote by showing that action as a sainted and honorable kind of action.All in all it can't be a bad experience for movie lovers."
    },
    {
      "rating": "6",
      "text": "It's an average movie that depicts the civil war and the racist conflict of that time. But It also disappoints in giving that detailed and immersive experience of both. It focuses more on the main character, witch did have a pretty big impact on the black society's first step to acceptance, so it is understandable but still not satisfying enough. Sadly the way the story is told is also pretty non-coherent so it's hard to understand everything at first watch. And the movie is simply boring enough not to demand a second viewing."
    },
    {
      "rating": "8",
      "text": "Free State of Jones is not your ordinary film. If you go into watching this with an expectation for action scenes, you will certainly be disappointed. However, if you are able to view this movie with an open mind - and if you are able to adapt to its slower shots - you will find it interesting, and maybe even refreshing."
    },
    {
      "rating": "9",
      "text": "It literally sickens me to my core to read on as the so called professional critics trash this film. Yes it has some flaws but it tells an important story that completely outs the democrat party for what they have been, what they are and what they can never not be. Any person with an iq over 80 should be able to see that something is fishy about a metascore of 53, that's 7 points under Wonder Woman 1984 which is the most expensive piece of absolute trash that Hollywood has generated in years. It is a film that unabashedly tries to commit suicide on a regular basis but never quite fully succeeds because it contains a single immortal credit that saves it from all criticism, a strong female lead. The incredible criticism that Free State of Jones received should be enough to inform any thinking individual of exactly how threatened Democrats are by it's very existence. It inundates them with inescapable and damning truths that are present but hidden still today. They have endeavored to educate people of the opposite, to demonize conservatives, to project their own hate and racism out onto anyone but themselves and they have largely succeeded for many generations. Look at the truth and then observe the den of hissing vipers for what it really is. They truly in their dark hearts miss the white hoods and the lynching but the world no longer accepts such evil and so they have moved underground and from their places of hiding they manipulate society and steer it back towards darkness under the veneer of healing and justice. Do not be a fool and don't be fooled. They hate this movie for no reason other than the fact that they cannot argue against plain and simple truth and such truth puts a wrench squarely into the machinery of their systemic and procedural will to absolute power."
    }
  ],
  "recommendations": [
    "letters_from_iwo_jima",
    "the_pianist",
    "race",
    "snowden",
    "hostiles",
    "a_united_kingdom",
    "the_lost_city_of_z",
    "darkest_hour",
    "12_years_a_slave",
    "apocalypse_now",
    "seven_years_in_tibet",
    "the_imitation_game",
    "lone_survivor",
    "13_hours_the_secret_soldiers_of_benghazi",
    "patriots_day",
    "the_thin_red_line",
    "the_mauritanian",
    "hidden_figures",
    "the_last_duel",
    "the_33",
    "judas_and_the_black_messiah",
    "american_sniper",
    "dark_waters",
    "the_eagle",
    "official_secrets"
  ]
}