{
  "id": 6,
  "title": "Free Guy",
  "starring": [
    "Ryan Reynolds",
    "Jodie Comer"
  ],
  "runtime": 115,
  "genre": [
    "Comedy",
    "Adventure",
    "Science Fiction"
  ],
  "description": "A bank teller called Guy realizes he is a background character in an open world video game called Free City that will soon go offline.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xmbU4JTUm8rsdtn7Y3Fcm30GpeT.jpg",
  "categories": {
    "plot": 6.9,
    "acting": 6.8,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.5,
    "action": 7.333333333333333
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This film surprised me because I thought it was going to be a run of the mill kids movie.   This film is great for what it is and has a ton of fun references"
    },
    {
      "rating": "8",
      "text": "This movie is no masterpiece; it has its fair share of plot holes and contrivances, but man is this movie fun. Like most movies, it is about expectations. Don't expect a gritty sci-fi which faces the morality of artificial intelligence  (but come on it has Ryan Reynolds, you already knew that), go in expecting a fun time. Watch this movie, it is great."
    },
    {
      "rating": "9",
      "text": "' Overall pretty good movie. Loses it grip at the end a little bit though however I imagine the pandemic made things a little harder on them"
    },
    {
      "rating": "9",
      "text": "Ryan Reynolds makes this movie - it’sSo feel good.  Don’t expect some deep weighty movie…. But you’ll we feel good when you leave"
    },
    {
      "rating": "8",
      "text": "I love it. A very good movie with handsome Ryan Reynolds AKA Deadpool. Everywhere is some good easter egg here and I really enjoy it."
    },
    {
      "rating": "10",
      "text": "Personally, I love the movie base on some certain scene and the way they act. So entertaining and loving to watch"
    },
    {
      "rating": "9",
      "text": "This is the best movie I've seen in a while.  If you are a gamer, there are an incredible amount of easter eggs through out the movie that make it even more fun to watch.  Ryan Reynolds is funny as always and plays the role of the oblivious good guy very well.  I would recommend this to anyone wanting to have fun watching a moive."
    },
    {
      "rating": "9",
      "text": "Ryan Reynolds’s way of portraying a character and making an action movie with humor is at a level of its own.The story is refreshing and has funny references to video games."
    },
    {
      "rating": "8",
      "text": "I'm giving this an 8 only because I personally retain ranks of 9 to 10 for masterpieces of storytelling as the base requirement first.This may not be a masterpiece of storytelling but it does have solid plotline with character development, plenty of good scenes that help the viewer achieve an emotional attachment with the characters, and it does all of this without taking itself too seriously or trying to shove plot devices down the reader's throats.A show like this doesn't take itself too seriously and within an ocean of cinematic releases destined to be short-lived in the public memory this one will live on in our memories with a positive feeling associated.The positive messages in this story and the main character's adventure are something we've sorely missed in our light summer blockbusters. To whomever was responsible for the majority of the decisions made in this film: please do more films, your work is wonderful.This enjoyable watch was money well spent with my loved ones and kept us entertained the whole time."
    },
    {
      "rating": "8",
      "text": "Fun and creative Ryan Reynolds vehicle is certainly a breath of fresh air and deserve the status as one of the top movies of 2021. While the premise was done before, it's incredible sense of fun buoyed this flick in every turn. Reynolds should definetelly stick to his usual comedic 'persona' as he is so good at it."
    },
    {
      "rating": "2",
      "text": "Free Guy is an overly long comedy that stretches a decent premise too thin with bland characters and humor that just doesn't match what the movie is going for. Reynolds carries the film a bulk of the way and while the cast is certainly talented, The characters are so insufferable that it is hard to root for anyone because they're so freaking obnoxious.Within the first 20 minutes of the film, What little charm it had died when you realize that it revolves solely on Reynolds giving a rather typical performance playing a character that he seems to enjoy being typecast in. It just sucks."
    },
    {
      "rating": "7",
      "text": "Not big on Hollyweird these days but Free Guy is actually enjoyable to watch. The cringey \"white privilege\", \"man babies\", and \"patriarchy\" lines feel very out of place. But I'm sure it's completely normal for leftists to hear stuff like this."
    },
    {
      "rating": "7",
      "text": "Recently, creative teams apparently have found it irresistible to explore what it means to be human by writing scripts that insert people into video games.  Spielberg’s “Ready Player One” (2018) and the Matthew McConaughey vehicle “Serenity” (2019) are recent examples of this emerging genre.  So “Free Guy” has some interesting predecessors.In this film, Ryan Reynolds’ Guy (see what they did there?!) discovers that he is an NPC, a non-player character in a video game.  He’s a totally disposable automated character uninhabited by a person from the real world, mere window dressing when players enter the game to rob banks, shoot people and engage in an endless variety of senseless, violent mayhem.  But Guy also houses an advanced form of artificial intelligence.  When he meets Millie/Molotov Girl (“Killing Eve” star Jodie Comer), he is immediately infatuated and experiences, wait for it, feelings he’s never had before.  Tragically wholesome rom-com moments ensue.In less capable hands, this story line could have sunk the audience into a sugar-induced coma or devolved into a mind-numbing Ted Talk about “big ideas.”  Fortunately, Director Shawn Levy (“Night at the Museum” series, “Cheaper by the Dozen,”  “Family Trap”) and his screenwriters are too skillful to let that happen.  While addressing important concepts like freedom vs. determinism (sorry, we are now legally compelled to say “personal agency”), the nature of love and the value of friendship, he centers this story on more accessible themes like kindness and generosity.  The offhanded violence committed incessantly against the NPCs is a conversation for another day.  (“Westworld” anyone?)The cast here is first-rate.  Ryan Reynolds is at his charismatic, self-effacing best because he doesn’t have to rely on superhero costumes crafted by Rubbermaid or gratuitous f-bombs (that’s right, “Deadpool”).  Jodie Comer is in excellent form, having apparently perfected a unique combination of wide-eyed wonder and world weariness.  Taika Waititi reprises the role of manic, bumbling villain he perfected in “Jojo Rabbit.”  The film is crammed with cameos by gamers and streamers (Pokimane, LazerBeam, et al).  There’s a welcome Channing Tatum sighting.  There’s even a brief scene with Alex Trebek and contestants on “Jeopardy.”  There are off-screen voiceovers by Dwayne Johnson, Tina Fey, Hugh Jackman and John Krasinski.  But it’s the strength of Reynolds and Comer and the chemistry they build that keep this project from sinking into mediocrity.Other elements that make this film worthwhile are its brief vignettes and priceless one-liners.  One such interchange occurs when Bombshell (Camille Kostek, 2019 SI Swimsuit cover model, real-life girlfriend of football player Rob Gronkowski) enters a bank on the arm of one of the robbers.  After Guy dispatches the robbers, he suggests that Bombshell should be free to make her own life choices.  Bombshell responds that she may not need a man at all.  If only life imitated … A few of the funniest lines:  Describing his coffee, Guy says, “It’s like my tongue had a baby with a sunrise.”  Later, “Ooh, cappuccino.  I enjoy saying that.  It’s like a waterfall with letters.”  After his first kiss with Millie: “I may not be real, but for a second there, I felt pretty alive.”While “Free Guy” is unlikely to make us forget “Citizen Kane” any time soon, it’s better than the standard summer fare, especially in this year’s movie wasteland littered with an overabundance of superheroes and cartoon characters.  This film is breezy, funny and occasionally thought-provoking.  But most of all, in an increasingly unkind world, it’s a pleasant reminder that thoughtfulness, decency and kindness are their own forms of universal truth.  If you can imagine a mash-up of “Ted Lasso” and “Grand Theft Auto,” you have a sense of what this film delivers in full."
    },
    {
      "rating": "10",
      "text": "I have watched Free Guy and they look much better than Ready Player One! Change Free City to Free Life!"
    },
    {
      "rating": "8",
      "text": "Senza dubbio un film divertente con molta azione.Consiglio di vederlo come una famiglia."
    },
    {
      "rating": "7",
      "text": "Un bon film, bien meilleur que ceux qui sont sortis ces derniers mois et cela en dit long."
    },
    {
      "rating": "3",
      "text": "Well, movie is fine but meh, I preferred red notice with Dwayne Johnson lol. 3/10, could've been way better..."
    },
    {
      "rating": "2",
      "text": "The movie is littered with inconsistencies, and is a severe misrepresentation of what MMOs (and game dev for what's matter) look like, a somewhat mix of Saint Row and Wow. E.G., they could have pick up inspiration from things like GMod for the \"mods having god powers\" but no they went full  Dr Strange instead, and don't get me started on the gamers are losers living in basements jokes...It peaked at the Cpt America/Star wars scene,I watched the movie because it was not a sequel or from the MCU and they flopped most of the references (like the portal gun) to overdo this one...The final plot-twist about the island still being in the reflections was maybe the one good idea, but eventually ruined by the island \"appearing\" for all the eyes to see when stepped on...Such a waste a good nice idea, exploring actual \"living\" machine learning AI ruined by people who don't know that world and would rather cram not subtle politics into the viewer face.Sorry if this is a bit unstructured bu I made that account to write it."
    },
    {
      "rating": "5",
      "text": "Free guy is a fantastic concept diluted down and mixed with pop culture sherbet into a sickly goop of discombobulated nonsense. The cast do a great job with the weak screenplay but if you leave your brain at the door and are in the mood this action sci fi fantasy will bring a basic but watchable level of entertainment if you like this genre. Sadly put next to something like black mirror or The matrix it feels like a real missed opportunity to explore the concept of artificial intelligence and be true to the gaming as a hobby."
    },
    {
      "rating": "5",
      "text": "\"Catchphrase!\"More like \"Fun Guy\", ain't I right fellas?Not a fantastic movie by any means and it reeks of \"soulless studio made movie\", but I won't lie, I had fun with this one. Ah **** film Twitter is going to lynch me for this."
    },
    {
      "rating": "5",
      "text": "This movie is a result of non-gamers looked at a generic mmo game once and said \"yeah, i get it. This is what every video game is like\" a generic depiction of games and gamers alike. While not being a bad movie, it's not good either."
    },
    {
      "rating": "6",
      "text": "Truman Show + Westworld + Ryan Reynolds brand humor + impressive special effects. A fun lightweight movie, similar to Pixels, the Adam Sandler movie that got panned but I thought was pretty entertaining. You do have to put your brain away and try not to think about the logic of it. There weren't a lot of big laughs for me, but it ended strong with \"Dude.\" There were also some \"woke\" lines that were cringy, basically to the effect of \"men are all trash\" (it's funny how it's always men who write stuff like that into movies. I guess they're trying to impress their wives/mistresses.) Also a \"white privilege\" line that was just awful. One of those Hollywood apologetic lines; rather than give the brown character more to do, they just \"acknowledge white privilege\" and then continue to give the white characters the best parts. Typical all-words-no-action Hollywood liberals."
    },
    {
      "rating": "8",
      "text": "Один из лучших фильмов, что в последнее время смотрел. Понравилось всё, за исключением дубляжа, он получился посредственный. Ждём сиквел"
    },
    {
      "rating": "2",
      "text": "It's an absurd concept that has great potential for action-comedy hijinks.  And when it sticks to that, it's great.  Unfortunately, the movie actually takes itself seriously.  Rather than \"ha-ha, it'd be crazy if this could happen,\" it tries to pretend its premise is ... how can I put this ... not retarded?  A lot of the stuff they portray as \"in-game\" is entertaining, but the parts in the \"real world,\" which take up way too much of the movie, are even more far-fetched that the \"in-game\" parts.It doesn't help that the movie gets political (\"guns are bad, mmm'kay?\" along with a couple other topics) but it'd be easier to breeze past that if the whole thing wasn't so committed to pretending it was plausible."
    },
    {
      "rating": "7",
      "text": "a fun film, albeit a tad forgettable, but loved the way it depicts adult friendships. movies tend to treat friendship like it's a placeholder until romantic love comes along but this film treats friendship as a fulfilling relationship on it's own. a good number of laughs but mostly light chuckles."
    },
    {
      "rating": "6",
      "text": "If you want to see Ryan Reynolds do his usual thing then this movie will not disappoint. It is funny and a good time. That said, it does feel like it's tailored to kids and not all that fresh."
    },
    {
      "rating": "0",
      "text": "I am simply unable to describe how little my patience is for a Ryan Reynolds movie. Ryan Reynolds is a blight on our planet, and I am seriously considering joining NASA or Space-X, just so I no long have to see him. I hate Ryan Reynolds with a passion."
    },
    {
      "rating": "10",
      "text": "Absolutely loved this movie. The action, comedy and all the nerdy/geeky stuff you could want in a movie is all there. The acting is amazing as usual by Ryan Reynolds and by everyone else as well! Keep on representing Canada EH! 10/10 would recommend!"
    },
    {
      "rating": "10",
      "text": "Wow! This movie's take on video games and coding will turn a few people off, but under the hood this is a great story about AI and it is hilarious. Go see it. Went in expecting a terrible movie and everyone in the theater was laughing and cheering by the end."
    },
    {
      "rating": "10",
      "text": "Amazing movie! You will have a blast watching it. Super funny. Go watch it."
    },
    {
      "rating": "8",
      "text": "Not a gamer, but I still enjoyed this film. Looking forward to seeing it again on the big screen."
    },
    {
      "rating": "10",
      "text": "The critics give harsh reviews to feel like Apex Predators, but the audience knows better. This isn’t a good movie, it’s a Great movie."
    },
    {
      "rating": "8",
      "text": "So much fun to be had with this movie! Visually stunning, very glad I watched at an imax (sad to see it so empty on opening night though).Jodie and Ryan both provide a fantastic performance, and the pace is well maintained throughout. Certainly felt the first half was the better of the two, and didn’t care for the love story…. Luckily they didn’t dwell on it too much.Great fun watch!"
    },
    {
      "rating": "10",
      "text": "Love love loved it! So good, had me laughing and warm hearted . Such a good watch best movie I seen all year. I would watch it over and over again. Good time.  Incredible cast and effect. The best."
    },
    {
      "rating": "10",
      "text": "Amazing movie, must watch. Genuinely surprised me. Watching in cinemas is much better."
    },
    {
      "rating": "10",
      "text": "BEST MOVIE EVER…. IM DEFINITELY GOING TO SEE IT AGAIN IN THEATERS. (P.s. if you don’t like or play video games then you won’t understand the movie)."
    },
    {
      "rating": "10",
      "text": "Great movie. Classic Reynolds. Touches on so much gaming. Tons of stuff going on in the background keeping it a busy movie. Great direction, acting, story, etc. Definitely going to own it"
    },
    {
      "rating": "9",
      "text": "This movies is soo much fun, from start to end, I waited for a movie like this for a long time and this really surprised me. Worth a watch"
    },
    {
      "rating": "10",
      "text": "Free Guy is lots of fun. It's funny, surprisingly heartfelt, and shows a lot of love for video games along the way without pandering or preaching. It exists to entertain the audience and it delivers on that promise.It's everything Ready Player One is not."
    },
    {
      "rating": "10",
      "text": "Amazing movie with an excellent balance of great storytelling, pacing, comedy, romance, and surprises. While intelligently portraying the medium that is video games. Ryan Reynolds doesn’t disappoint, and Jodie Comer does a great job not only acting but singing that sweet sweet remix at the end. Highly recommend."
    },
    {
      "rating": "9",
      "text": "Movies with plots based around video games have been somewhere between mediocre and awful. Pixels wasn't the worst, the Super Mario Bros. movie had an odd charm, but they didn't blow me away. This...kind of did, but maybe not as Disney intended.I was a little skeptical of the movie's interactions with Youtubers in particular, wondering how much of an influence they'd actually make in the film. This film I think is fantastic for the audience of gamers, showcasing the importance of human interaction, and how games nowadays have gotten far better at embracing that part of gaming culture.It was still an entertaining film beyond this nailing of audience, however. Funny, quick humor, great acting, fun characters, keeps the audience going. I would absolutely recommend watching this film, especially if you're a gamer."
    },
    {
      "rating": "10",
      "text": "Truly Loved this Movie!It's probably some Ryan Reynolds best acting since Woman in Gold.But where was the GIANT VE SHARK Dude?"
    },
    {
      "rating": "10",
      "text": "The movie was incredibly hilarious, and just an overwhelmingly fun time. The best part was when they freed Guy"
    },
    {
      "rating": "10",
      "text": "Genuinely sweet, funny and heart warming. Lovely film all around. Thoroughly enjoyed."
    },
    {
      "rating": "10",
      "text": "Cannot rave about this movie enough. Our entire family was pleasantly surprised, we were completely drawn in within 15 minutes and were hooked the entire time! A complete feel good and unique movie with warm hearted comical charm by Ryan Reynolds."
    },
    {
      "rating": "10",
      "text": "As an old gamer I liked it a lot. I understood most of the stuff and I didnt watch too close at things that didn’t make too much sense.."
    },
    {
      "rating": "8",
      "text": "Ryan Reynolds stars as a background Non-playable character in a popular online shooter akin to 'Fortnite', and finds himself becoming more and more conscious and aware of his surroundings and day-to-day life as he becomes bored with his daily programming and evolves into a conscious artificial intelligence that tries to break free of his programmed system. With the help of a human player he happens to fall in love with (Jodie Comer), him and the rest of the NPC characters try to rebel against the online world they've been limited to, and must try and stop a greedy gaming CEO (Taika Waititi) from deactivating and shutting them down for good. The trailers for this film gave off major 'Saints Row' vibes to me, along with other similar online shooters, but I found myself intrigued nonetheless. And I can say that after going in with only modest expectations, this film turned out to be an absolute riot, both literally and figuratively, and I mean in a very good way! I had so much fun watching this film and getting immersed within this world and all the bonkers action and antics it had to offer! There's some surprising and welcome cameos throughout, and like any video game-themed, of course there was bound to be some Easter eggs and references to other games and pop culture references here and there, but thankfully the film surprisingly isn't overly saturated with them, unlike with another particular video game-themed film (Ready Player One). In addition, Reynolds is just as funny and entertaining as ever, bringing in that same chipper attitude that he brings to Deadpool all the time. Jodie Comer also holds her own quite well alongside him, although I wasn't exactly comfortable with the 17-yr age gap between her and Reynolds"
    },
    {
      "rating": "1",
      "text": "Algorithm the movie. What a dumpster fire. Full of clichees and references to other movies and franchises but not a single original idea is to be found. I didnt expect much, but boy was i disapointed."
    },
    {
      "rating": "10",
      "text": "Free Guy was amazing, definitely my favorite video game style movie ever; a perfect blend between comedy, action, and video game style it really felt like a video game as a movie. I loved how original the concept was and the self aware humor was hilarious. I loved all of the pop culture references especially the Star Wars and Captain America ones and the cameos were awesome especially the streamers, Jacksepticeye, Ninja, Pokimane, DanTDM, and LazarBeam, and Chris Evans. The visual effects were spectacular. The acting was phenomenal especially from Ryan Reynolds, Jodie Comer, Channing Tatum, Taika Waititi, Lil Rel Howery, Joe Keery, and Utkarsh Ambudkar. The makeup and hairstyling was great especially on Jodie Comer. The costumes were excellent. An A+ movie."
    },
    {
      "rating": "7",
      "text": "Okay, it's a good and fun movie. You need to get past the part where the developers sold their code to the \"villain\" and then spend the rest of the movie trying to prove that he built his new game off of their AI illegally. It doesn't make sense, but just go with it. otherwise it's a fun movie with a few minor holes here and there, but hey, it's a movie. Just go with it. PS. The love interest at the end is unbelievable and also completely unnecessary but hey, whatever I guess."
    }
  ],
  "recommendations": [
    "jumanji_welcome_to_the_jungle",
    "sonic_the_hedgehog_2",
    "shazam",
    "sonic_the_hedgehog",
    "the_lego_movie",
    "minions_the_rise_of_gru",
    "the_green_hornet",
    "prince_of_persia_the_sands_of_time",
    "megamind",
    "tag",
    "deadpool_2",
    "the_a_team",
    "guardians_of_the_galaxy",
    "thor_ragnarok",
    "despicable_me_2",
    "minions",
    "jumanji_the_next_level",
    "love_and_monsters",
    "incredibles_2",
    "hancock",
    "cloudy_with_a_chance_of_meatballs",
    "tomorrowland",
    "pixels",
    "bright",
    "my_spy"
  ]
}