{"id": 4127, "title": "Frequency", "starring": ["Dennis Quaid", "Jim Caviezel"], "runtime": 118, "genre": ["Science Fiction", "Thriller"], "description": "When a rare phenomenon gives police officer John Sullivan the chance to speak to his father, 30 years in the past, he takes the opportunity to prevent his dad's tragic death.  After his actions inadvertently give rise to a series of brutal murders he and his father must find a way to fix the consequences of altering time.", "releaseYear": "2000", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/aFuw2yow5Og0e2M7uEHQtpS5GPz.jpg", "categories": {"plot": 8.352941176470589, "acting": 7.636363636363637, "ending": 8.25, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 9.0, "action": 8.4}, "reviews": [{"rating": "10", "text": "Wanted to see this movie since it came out when I was 10, but for soooome reason (it's rated R), that was a no-go.Well, I finally caught it in 2020 and HOLY CROW it is *hands down* one of the best movies I've ever seen!It's perfect! Suspenseful, emotional, way cool premise and - what I wasn't prepared for and absolutely why it's rated R - so intense! This movie was marketed as a sci-fi, but it is equally a *thriller.* I for sure would have been horrified (and fascinated) with its darker side as a kid.I'll never understand why this movie isn't better known. For my part, I'm telling everybody. 10/10!"}, {"rating": "9", "text": "Miscellaneous On the jetty you can clearly see modern tagging graffiti, that type of graffiti started later than the 50's."}, {"rating": "9", "text": ".................hiigihihuiohohjooj\":-;!?,.;:^&*()%$#@+×÷=€£●□■▪○☆⊙°•¤《》》¡¿◇♧◇♤{}[]●●■•▪~~~~"}, {"rating": "10", "text": "A+ *************************************************************************"}, {"rating": "10", "text": "One of the best Sci-Fi thrillers of 2000. Frequency has terrific acting, mind bending special effects & an intricate plot unlike any movie before it."}, {"rating": "9", "text": "Kguugihinknnijbuhniojojugyfyfsrewarsyfinhougyffyfyyflnonigufyfigihhfgdgjjgtdearsyfigihyyiyee"}, {"rating": "9", "text": "Sylvester Stallone, Mel Gibson, Harrison Ford, Michael Keaton, Bruce Willis, Kurt Russell, Kevin Costner, Patrick Swayze, Ed Harris, Bill Paxton, Tom Hanks, Michael Biehn, Alec Baldwin, Kevin Bacon, John Travolta, Gary Sinise, Tommy Lee Jones, & Jeff Bridges were considered to play the role of Frank Sullivan."}, {"rating": "10", "text": "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$${}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}"}, {"rating": "10", "text": "&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$"}, {"rating": "9", "text": "One of the Best films of the 2000s!I remember when this was first released in theaters in 2000, and it pretty much got lost in the shuffle of films released around that time. I wouldn't end up seeing it for the first time until the following year on cable- and I was blown away! Former \"NYPD Blue\" director, Gregory Hoblit, makes a really good film about every other picture he directs- \"Primal Fear\", this movie- not so good ones- \"Fallen\" and \"Hart's War\", etc.. But this is his best work IMO.Dennis Quaid plays an FDNY firefighter in 1969 Queens who connects with his 36-year old cop son (Jim Caviezel), living in the present-day, through an old HAM radio- all due to some highly localized electro- temporal spatial effects caused by unusual aurora borealis activity. A serial killer investigation going on at that time ends up coming into the mix, and the two work together to prevent more murders. Brilliant!I know there have been some comparisons with \"Ghost\" and \"The Sixth Sense\", but really, this movie stands on it's own. One of my favorite character actors, Andre Braugher, also co-stars as the best friend of Quaid's character , and Caviezel's partner in the present day. And Shawn Doyle has a great chilling supporting role as the serial killer. Elizabeth Mitchell and Noah Emmerich round out the cast."}, {"rating": "9", "text": "$$$$$$$$$$$$$$$$$$$$$$$$\"\"\"\"\"\"\"\"\"\"\"\"\"▪▪▪▪▪▪▪▪⊙⊙⊙¿¤¤¤¤¤¤¤¤¤¤¤¤¤******************♤♤♤♤♤♤♤♤♤♤♤♤♤♡♤♡"}, {"rating": "10", "text": "×÷×÷×÷×÷×÷×÷×÷×÷×÷×÷×÷÷×÷×÷×÷×÷×÷×÷×÷×÷×÷×÷×÷×÷×÷×÷×÷×÷×◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇"}, {"rating": "9", "text": "John Sullivan: You on the job?Jack Shepard: Long time ago. Do I know you?John Sullivan: Do I look familiar?Jack Shepard: No. What house you work?John Sullivan: 7-4 homicide.Jack Shepard: Hot shot.John Sullivan: No, just working the job. As a matter of fact, I caught a case that goes back to your day. One of the Nightingale murders.Jack Shepard: No kidding.John Sullivan: No. Missing teenager, disappeared back in '68. Found her bones last week buried out by some old diner by Dyckman Street. Mary Finelli. Yeah, talk about dumb luck. The odds of anyone finding that 30 years later and the chance of hitting a dental? Forget about it. The best part is, she's the first victim. She knew the killer, so I bet those old bones are gonna do a lot of talking. Not for nothing, the past is a funny thing. We all have skeletons in the closet, we just don't know when they're gonna pop up and bite us in the ass. Huh, Jack? You changed your MO, 'cause if they knew your mother was the Nightingale, they would have looked at the family. They would have looked at you.Jack Shepard: What are you looking at?John Sullivan: Stealing your life away. You went down 30 years ago, pal. You just don't know it yet."}, {"rating": "10", "text": "&-&-&-&-&-&-&-&-&-&-&-&-&-&--&-&-&-&-&-&-&-&-&-&-&-&-&-&》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"}, {"rating": "10", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"}, {"rating": "10", "text": "Frank Sullivan: [talking about Julia] Well I just knew. She melted my heart. You got anybody?John Sullivan: Yeah, kinda. Something I gotta work out, but she's worth it.[pause]John Sullivan: You go ahead and get some rest. I'm tired too.Frank Sullivan: I almost don't wanna click off here. Maybe we won't get this back.John Sullivan: We will.Frank Sullivan: Ok. I'll be here tomorrow.John Sullivan: I know.Frank Sullivan: I love you son.John Sullivan: I love you too dad. I missed you so much."}, {"rating": "10", "text": "$%^&*$%^&*$%^&*$%^&*$%^&*$%^&*$%^&*$%^&*$%^&*@@@$%^&*@@@+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_"}, {"rating": "10", "text": "`♤`♤`♤`♤`♤`♤`♤`♤`♤`♤`♤`♤`♤~♤~♤`♤`♤`♤`♤`♤`♤`@!@!@!@!@!@!@!@!@!@!@!@!@!@!@!@!=_=_=_=_=_=_=_=_=_=_=_="}, {"rating": "9", "text": "()()()()()()()()()()()(){}{}{}{}{}{}{}{}{}{}{}{}{}[][][][][][][][][][][][]!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "10", "text": "□□□□□□□□□□□□□□□□□《《《《《《《《《《《《《《《《《《÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;÷;"}, {"rating": "9", "text": "A movie that strikes deep and stays with youChanging the past to affect the future may not be a new concept in film, but \"Frequency\" handles it deftly and with heart. The acting is superb, and as far as I can tell the plot is nearly airtight. It keeps you on your toes as the story twists in what feels like six directions at once and keeps you in emotional sync with the characters. The past/present connections are stirring and intriguing, especially the single-flash cuts at pivotal moments. This is one of the few movies about which I can honestly say, \"I laughed, I cried, I was scared stupid.\" Truly the only good movie so far this year."}, {"rating": "9", "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡¡¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡"}, {"rating": "9", "text": "Frequency has a unique time travel story meshed with intense action, grandiose acting and ingenious twists. This is easily one of the classic films of 2000."}, {"rating": "9", "text": "♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♤♤♤♤¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》"}, {"rating": "9", "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡°¡°¡•¡°¡•¡"}, {"rating": "9", "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》******************************************************"}, {"rating": "9", "text": "Incredible movie... even having seen it many times!Didn't see this in the theater, but a coworker told me about it. I wound up buying it on DVD & watching it with my girlfriend and cohort. One of the best movies of its kind! The plot was very good, and flowed well. The action was believable. Many questions undoubtedly, but we have not been able to prove what an actual time shift act would result in. Definitely a movie to keep you on the edge of your seat, and when the timelines converge at the end, it was a total surprise and brought the end in as a great story should!Very few other movies top this... and i am eager for this writer to write something else with this kind of creativity!"}, {"rating": "9", "text": "story is not usual, the story picks you up from here to north lights with these radio frequency.\rbut the film goes down with some scenes, If I need to talk about general, nice! you should watch"}, {"rating": "10", "text": "Dennis Quaid received 16 stitches just above his hairline after being injured in the stunt where he slides down the construction funnels during the warehouse fire. He had to remove his helmet as a story element. If not for that, he wouldn't have been injured."}, {"rating": "9", "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●=_=_=_=_=_=_=_==_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_÷"}, {"rating": "9", "text": "《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪"}, {"rating": "6", "text": "This film is a family drama in which a son communicates with his father, dead for years, through a radio that, through some mysterious means and that the film does not clarify much, opens a temporary portal or something. All those who say this seems implausible have reason to say it, and I understand that because I also thought so. The problem with the script is that it has its origin in such a weak premise because otherwise the story is profound, touching and so pleasing that the logical weakness of the story ends up being forgiven. The characters are also easily appealing and pleasing, being well developed from the psychological point of view. Dennis Quaid and Jim Caviezel are the main actors of the cast and have lived up to expectations, achieving a very pleasant bond between them. The rest of the cast virtually does what it has to do and nothing else."}, {"rating": "7", "text": "One of the most underated movies I have seen. It is not something epic but it's one of the movies that made me and my friends stand up and scream at the end... I don't want to spoil enyting so do not watch the trailer but do watch the movie..."}, {"rating": "8", "text": "Director Gregory Hoblit brings us \"Frequency\", an intriguing science-fiction tale that was as thrilling and shocking as it was heartfelt and emotional. The movie is about John Sullivan (Caviezel) a Cop who has never recovered from the death of his father, Frank (Quaid). However, after a series of miraculous cosmic events, John is given a chance to communicate with his father in the past. Now, when I initially examined this film for what it was - a movie with a respectable premise, but directed by a guy I had never heard of, and starring a group of actors who aren't really well-known - I was rather apprehensive about watching it. Though, after actually watching \"Frequency\" I can say that my expectations were pretty much demolished. What threw me for a loop was the direction that this movie took. All I expected \"Frequency\" to be was a long, drawn out reunion between a father and his grief-stricken son (which sounded to good to me. . .but didn't really sound spectacular). But, about a third of the way in, \"Frequency\" turned into a very intense crime thriller. That being said, the film excels at interweaving thrills and poignancy without making the transitions feel jarring. The acting was very well executed I'd say, for you learn to feel for both Frank and John Sullivan as \"Frequency\"'s intriguing plot thickens. The script was pretty well-written too. Overall, I'd say that \"Frequency\" was an entertaining sci-fi flick that offered a variety of gratifying elements within it."}, {"rating": "5", "text": "Has a good heart and decent acting but the film is virtually a series of plot-holes."}, {"rating": "7", "text": "Entretenida, bastante coherente el guion, parece que podría suceder, ciencia ficción sin ser exagerada."}, {"rating": "8", "text": "When police detective John Sullivan finds a ham radio that once belonged to his late father he is surprised to find it still works and strikes up a conversation with another man about the 1969 World Series. Frequency may contain a few inconsistencies, but overall it’s an enjoyable and heart-warming sci-fi thriller."}, {"rating": "9", "text": "Frequency is a good family movie. The plot of the film does not poorly use the time loop method. Yes, the film does not seem realistic from a scientific point of view, but there are the foundations of a detective thriller. Nice movie to watch with your family."}, {"rating": "9", "text": "++++++++++++++×××××××÷÷÷÷÷÷÷÷======÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"}, {"rating": "9", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■■●●■■●■●$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷"}, {"rating": "9", "text": ":*:*:*:*:*:*:*:*:*:*:*:*:*::*☆⊙☆⊙☆⊙☆⊙☆⊙☆⊙☆⊙☆⊙☆⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙"}], "recommendations": ["gone_baby_gone", "from_hell", "the_next_three_days", "the_little_things", "snitch", "the_fugitive", "donnie_brasco", "the_frozen_ground", "the_town", "the_judge", "the_lincoln_lawyer", "lucky_number_slevin", "knives_out", "breach", "prisoners", "killer_elite", "the_accountant", "secret_window", "changeling", "reasonable_doubt", "the_godfather_part_iii", "the_iceman", "run_all_night", "daredevil", "split"]}