{
  "id": 3004,
  "title": "Friday",
  "starring": [
    "Ice Cube",
    "Chris Tucker"
  ],
  "runtime": 91,
  "genre": [
    "Comedy"
  ],
  "description": "Craig and Smokey are two guys in Los Angeles hanging out on their porch on a Friday afternoon, smoking and drinking, looking for something to do.",
  "releaseYear": "1995",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eqD0jCDIEJ65CmyG63Jaay6bHDp.jpg",
  "categories": {
    "plot": 5.090909090909091,
    "acting": 5.357142857142857,
    "ending": 5.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.111111111111111,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I believe that this is a highly underrated film, most likely because because of the constant swearing and drug use, but even with these vices, the Friday is a fun, quality film that actually contains some important messages, such as the consequences of gun use. A great film for high-school kids to watch with friends."
    },
    {
      "rating": "5",
      "text": "Simplistic story and bombastic acting doesn't make Friday look great to watch. Friday refuses to move the good ol' comedy away because even that good ol' comedy can even sometimes be terrible as well. What's so great about is though is how you get to watch it on a Friday because Friday is only for Fridays."
    },
    {
      "rating": "5",
      "text": "Since I like Ice Cube and this type of comedy, I decided to watch this movie. I wasn't impressed. It didn't disappoint. It's kind of average for me. I don't know who I'd recommend this to. Probably only the biggest stoner comedy fans."
    },
    {
      "rating": "6",
      "text": "There's no plot or anything engaging in \"Friday\". As simple as the title is, it depicts a loose and satirical suburb with some very memorable scenes and lines. Clearly a fun effort from everyone involved, but believe me when I say that this is some lightweight stuff. Take it or leave it."
    },
    {
      "rating": "5",
      "text": "Definitely feel s a little dated and of its time, the jokes are mostly centered around stereotypes or childish things. Was a good hangout movie though."
    },
    {
      "rating": "9",
      "text": "Friday is a film that assures us that even in the ghetto of Los Angeles, there are lessons to be learned. This is not only a comedy, but a beautiful hybrid of funny and in-all-seriousness that is genuine. Ice Cube and Chris Tucker make this a joyride from start to finish."
    },
    {
      "rating": "7",
      "text": "Didn't see much \"ghetto\" in this film, other than some of the stereotypes portrayed in the film. Outside of that, I always liked this film. Seemed a bit childish as times, but that added to the simple humor of this film. Tucker stole this film in his role while Ice Cube proved his writing and/or rapping is better than his acting."
    },
    {
      "rating": "8",
      "text": "Maybe you like Ice Cube and maybe you don't like Chris Tucker because of how annoying he can get in some of his movies, but with 'Friday', it's hard to not like either of them, at least I thought they were both hilarious. This is no brilliant comedy by any means, but it's funny and entertaining enough to stand above most stoner comedies that exist."
    },
    {
      "rating": "3",
      "text": "Wait. Was this a movie? I thought it was like an episode of some ghetto inspired comedy! So let me make this clear for you, if this was an episode from TV Series, then fine! But for a movie its very poorly made! With few funny scenes and characters, this movie is a great time killer. But if you're looking for a good comedy, comeback later when you have absolutely nothing else to watch!"
    },
    {
      "rating": "2",
      "text": "How this one got any positive reviews is beyond me. Vulgar, offensive, and unfunny, Friday's attempts at humor are poor at best and horrendous and annoying at worst. The best thing I can say about this one is that it is believable, which is sad. Other than that, the acting is pretty bad, the writing is atrocious, and the direction lackluster. Truly, for a comedy, and comedies are meant to entertain, I was more annoyed than anything that somebody thought people would find this funny. There is no story, other than brief tales shoehorned in to try and make this one resemble a typical film, and the characters are entirely unlikable. The appeal of Friday is lost on me and must have gone over my head, because I may have chuckled once during my viewing of this one. Horrible."
    },
    {
      "rating": "10",
      "text": "I believe that this is a highly underrated film, most likely because because of the constant swearing and drug use, but even with these vices, the Friday is a fun, quality film that actually contains some important messages, such as the consequences of gun use. A great film for high-school kids to watch with friends."
    },
    {
      "rating": "8",
      "text": "Who knew one weekend could be so ghetto and hilarious? Though it is pretty ridiculous that Ice Cube would be in a good movie besides Three Kings, this movie proved that sometimes you can't judge a book by its cover."
    },
    {
      "rating": "5",
      "text": "I don't understand the popularity of this movie.  There isn't much that happens, just a couple lazy dudes who sit on their porch in Compton all day, and the whole movie is over a single Friday.  Both Chris Tucker, and Ice Cube's characters I found to be pretty unlikeable, especially Chris Tucker's.  Thankfully he doesn't act as over the top and obnoxious as he usually does.  Guys and girls with colorful personalities they know keep stopping by and there are some humorous interactions with the characters, but a lot of the jokes fall flat for me, and are just immature.  John Witherspoon whom plays Ice Cube's father is the highlight of the movie for me and puts on a great performance, but nothing else really stands out for me.  Worth a watch for a few laughs, but I found it pretty lame overall."
    },
    {
      "rating": "10",
      "text": "Friday is way funnier than the other comedies that I have saw. Chris Tucker has the flow of comedy straight out of his mind about weed and stories about the people about the hood."
    },
    {
      "rating": "3",
      "text": "Bottom-line: It wasn’t particularly funny but it feels like it captured a moment in 1995.\r I remember, when I was six, a friend of mine (also age six) saw Friday. He loved it. He would reference it all the time and I never got any of it. It was so frustrating because I didn’t particularly want to see it but I wanted understand what he was referencing. It was like South Park. I never watched it when I was little but most of my schoolmates did. Every, what day was it, Thursday (the day after a new episode came out) I could expect to be left out of the first half of the lunchroom conversation. Anyway, by golly, it only took nearly twenty years but now I get the references to Friday. And let me tell you it was worth it. It is Friday in Oakland, CA. Craig (Ice Cube) recently lost his job. He is hanging out at home with his drug dealing, pothead friend, aptly named Smokey. The local drug dealer, Big Worm, gave Smokey two hundred dollars worth of weed to sell. Instead of selling it, Smokey, well smoked it. He gets Craig involved somehow and now they need to get money or they will be shot. That’s pretty much it, plot-wise. There are some other characters like the neighborhood bully, Deebo (Lister), but they aren’t anything really worth mentioning.\r The humor in Friday varies in subject from crude fart jokes to jokes about obese people. At one point, Smokey tells the “hilarious” story about how he smoked weed with a couple Hispanic gangsters only to find out it was laced with cocaine. It feels like they tried to make the banter between Craig and Smokey a main source of humor but it doesn’t really work. When that delivery actually works, it’s great but here the conversation feels awkward and forced.\r Ice Cube’s acting can be described as a complex series of snarls. You have the one that says, “Sheesh, I’m frustrated” and another that says, “Man, what an inconvenience!” Chris Tucker plays Smokey as if he was preparing to be Ruby Rap in The Fifth Element; he jumps around and yells like he’s hyped on caffeine all while being smooth as butter (or so he thinks). I think because he reminded me of Ruby, he was the only thing that made this movie reasonably palatable (which is saying something because I usually don’t like goofy, silly characters).\r Would I ever recommend this movie? No way. I’am glad I saw it just to cross it off the things to do before I die list. For those of you who are wondering, Next Friday (the sequel to Friday), is painfully awful. I couldn’t get further than fifteen or twenty minutes. Craig moves neighborhood because the neighborhood bully broke out of prison and is looking for Craig. They couldn’t even get Smokey in the movie (“he went to rehab”) so they invented a slew of cartoon characters I couldn’t care less about. Blah. Just thinking about it gives me headache.\r An acquaintance of mine grew up in a rougher part of Philadelphia. One day, he explained to me why he likes those Tyler Perry comedies. They resonate with him having grown up in an African American household and neighborhood. I have a feeling that Friday serves the same purpose. I can only relate- well, I can’t relate to it. I am closer to Mapleton Drive than the world in Friday. The only way I can orient myself is through documentaries and \"serious\" films about life in the ghetto. For example, I remember seeing the crack-head character in Menace II Society and there is one in Friday named Ezal (Johnson). At one point, Craig and Smokey are the targets of a drive-by. In a movie like Menace II Society, such a thing would be tragic but, in Friday, it’s an inconvenience.\r In my IT work, I’m often sitting with a client at his or her computer waiting for it to load. What do you do in those situations? Small talk. I'll ask them how egregiously Hollywood warps his or her profession. Being into computers, my eyes roll when I hear “hack the Gibson” or “enhance.” For another example, what show or movie most accurately depicts the field of medicine? Repeatedly, the answer I receive is Scrubs. Now, being a blonde, white, middle class male, I am struggling to come up with a phrasing that doesn’t come across as racist but Friday makes me wonder what one would say in terms of the cinematic representation of life in the ghetto. Is reality closer to Menace II Society or Friday? Note that I am using these two films as different ends of the spectrum. I’m thinking that reality falls closer to Menace II Society but asking a question like this opens up a can of philosophical worms. In part, it comes down to a question of authenticity.\r What does it mean to represent life in general (not just in the ghetto) “correctly”? Is it even possible? Considering Menace II Society and Friday, what is the purpose of each of these representations? Does the purpose affect the representation? In other words, what are the implications of a film being a comedy versus a comment on society? These are all interesting questions but I’ll save them for later."
    },
    {
      "rating": "9",
      "text": "Classic comedy from the black male perspective. Even If you don't smoke you can probably relate to the peer pressure aspect.To have that many characters nail their part spot on is a credit to Gary F Gray.  Ice Cube and Chris Tucker work perfect together and compliment each other well. The film's depth and emotional layers blend seamlessly through the comedy, a feat hard to accomplish. 9 stars because it's not perfect but it's great"
    },
    {
      "rating": "6",
      "text": "Z jednej strony debilny i nieśmieszny, z drugiej strony doskonałe (bo niezamierzone) prześmiewcze podsumowanie wielu cech społeczeństwa amerykańskiego. Brawo!"
    },
    {
      "rating": "10",
      "text": "If I could I would rate this movie 100. Yeah sure it may be offensive and violent to a certain degree but there is definitely worse out there. This movie has awesome humor and it is one of the funniest movies I have ever seen."
    },
    {
      "rating": "10",
      "text": "Friday is one of my all time favorite movies. Not only is it a movie that Is hilarious, it is a movie that gives a great point. the acting in the movie was great and the setting of the movie was perfect. it gives people an outlook on life in the \"hood\" which wasn't a bad one at all. I wouldn't mind seeing another Friday movie come out in the next few years."
    },
    {
      "rating": "7",
      "text": "(SPOILER!) You chill with Ice Cube and Chris Tucker for 90 minutes....that's the plot.Ice Cube/O'Shea Jackson plays down and out Craig who whilst still living with his parents manages to lose his job on his day off and subsequently ends up chilling with his reprobate pot head friend Smokey played here by the endearingly annoying Chris Tucker. What follows is essentially a series of vignettes of comedic antics that happen to these 2 guys as they sit and chill on their porch on a Friday in Los Angeles.I had overlooked this film for a long time and is a very enjoyable light hearted watch featuring some very entertaining performances from Ice Cube playing against type here as the somewhat simple Craig and a breakout performance from Chris Tucker as stoner Smokey who would shoot to mega stardom shortly after the release of this movie. This is also F. Gary Grays directorial debut who had mainly done music video work at this point who would eventually bring us The Negotiator, an entry into the Fast and Furious franchise and Straight Outta Compton. A particular highlight for me was the performance turned in by the always intimidating Tom Lister Jr. who serves the purpose of antagonist for the movie as the local bully Deebo who's mode of transport is a tiny stolen bike (evil them tune firmly in tow any time he's on screen).Don't expect to be intellectually challenged and the plot is arguably a series of vignettes. However, if you can look past that this, what follows is an easy way to just relax, chill and spend time with these two likeable guys on a crazy sunny Friday in LA."
    },
    {
      "rating": "8",
      "text": "I came across this film on Netflix and thought I've seen the memes on the internet and I'm so glad I did, this is a great comedy. Mixing \"the hood\" in LA, Craig Jones (Ice Cube) and Smokey (Chris Tucker) have got some great funny moments throughout and created a classic and I can see why it garnered the attention  the lattentionm later on. It also had a message of gun control which is still an issue to this day, also full credit to John Witherspoon for his performance. Friday is a fun and filled with quality scenes. The film actually contains some important messages, such as the consequences of gun use in a very inspiring scene. Well worth a watch!"
    },
    {
      "rating": "10",
      "text": "If you're looking for a comedic movie with a weird but nothing near cliche as some are, view this movie!"
    },
    {
      "rating": "10",
      "text": "One of the best movies alltime............................................."
    },
    {
      "rating": "8",
      "text": "A really good comedy movie, Craig Jones (Ice Cube) and Smokey (Chris Tucker) have got some great funny moments throughout this amazing movie."
    },
    {
      "rating": "10",
      "text": "Damnnnnnnnn! You got knocked the **** out! Everyone should know this movie. If you've never seen it thn your missing out."
    },
    {
      "rating": "10",
      "text": "A cult classic with very good comedy and script a must see for all even if it's not your sort of comedy."
    },
    {
      "rating": "8",
      "text": "This is a great movie, haven't seen any of the sequels but the 1995 Friday was not disappointing, the sense of humor, and the simplicity of this movie!"
    },
    {
      "rating": "10",
      "text": "This is a movie I watched growing up. My whole family loved it. Yes, it's crass, and there's a lot of foul language, but ultimately it's a really relatable movie about family, and growing up. One of my favorites, I now realize, after rewatching it as an adult."
    }
  ],
  "recommendations": [
    "21_jump_street",
    "the_happytime_murders",
    "night_at_the_museum",
    "neighbors",
    "superbad",
    "a_million_ways_to_die_in_the_west",
    "bad_santa",
    "this_is_the_end",
    "american_pie",
    "nacho_libre",
    "bad_trip",
    "neighbors_2_sorority_rising",
    "jackass_presents_bad_grandpa",
    "paul",
    "ted",
    "knocked_up",
    "ted_2",
    "the_change_up",
    "jexi",
    "step_brothers",
    "the_night_before",
    "rough_night",
    "thunder_force",
    "wanderlust",
    "cloudy_with_a_chance_of_meatballs"
  ]
}