{
  "id": 1553,
  "title": "Friday the 13th Part 2",
  "starring": [
    "Amy Steel",
    "John Furey"
  ],
  "runtime": 86,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Five years after the horrible bloodbath at Camp Crystal Lake, a new group of counselors roam the area, not sensing an ominous lurking presence that proves the grisly legend is real.",
  "releaseYear": "1981",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/92rGctBMTv4uaSlIBVnhz01kRWL.jpg",
  "categories": {
    "plot": 5.333333333333333,
    "acting": 5.857142857142857,
    "ending": 5.9,
    "soundtrack": 3.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "A definite improvement over the original, but it's still the same cheap scares and a pathetic attempt at creating suspense. It does have more creative kills and the decision-making of the protagonist did surprise me at the end."
    },
    {
      "rating": "8",
      "text": "Friday the 13th Part 2 is a good film, but now that I think about it, other Friday the 13th films are better than this.This film is quite similar to the first film, kind of to a fault. Some of the new characters are interesting, like Mark and Vicky, but others aren't as enjoyable.The death scenes are not that good, besides Mark's. Most of the deaths are on screen for around 2 seconds before immediately cutting away to a different scene!So it's a good film, but not as good as other F13 films."
    },
    {
      "rating": "10",
      "text": "Kikikikikikikikikikikikikikikikikikikikikikikikikimamamamamamamamamamamamamamamamamamamama"
    },
    {
      "rating": "7",
      "text": "The introduction of Jason, some quality kills and a solid cast make it well worth watching. It more than lives up to the original."
    },
    {
      "rating": "7",
      "text": "Neat SequelIt’s a fun horror film, I think that’s all that Friday The 13th needs."
    },
    {
      "rating": "6",
      "text": "This is one of the weakest entries of the franchise in my opinion. It also doesn't fit in with the other films. Some things just make no sense. The opening for instance has Jason killing the films first survivor a few months after the first film. Heres the problem with that he's fully grown, he somehow knows where she lives and travels to her house. Cut to 5 years later and a group of counselors are trying to open up a camp and start being stalking and slashed by a hooded Jason. Amy Steel stars as Ginny one of the franchise's smartest and most bad ass heroines. The movie is fun but it's so by the numbers and the finale leaves one of the biggest questions of the series. What happened to Paul?3/5"
    },
    {
      "rating": "2",
      "text": "This film is a sequel to \"Friday the 13th\" and differs little (or even nothing) from its predecessor. The recipe is always the same and its common to all slasher films. Unfortunately, its the second of an almost endless succession of films of very reduced quality, that have haunted the cinema since then. There is nothing new here: it's more of the same."
    },
    {
      "rating": "4",
      "text": "I give this movie one thing. It's not f**king horrible like the second Nightmare on Elm Street movie. But isn't good. ..Good : Some kills were good. Particularly one with the machete on the face. ..Mixed : It had more jumpscares than kills. The jumpscares work better than what we get today. But, was it a slasher or a mediocre 2010s supernatural/gothic horror? Why scares? At least give terrifying kills if you don't know what to do with it!! ..Bad : With the second movie, the franchise didn't become any better. But it's still the same mediocre direction and mediocre script. Consistency? I guess that's what it is. It begins really stupidly. You can fast forward the first six and a half minutes of this movie. It's just the flashbacks from the previous movie. And people, please stop making \"Alien³\" the target, this movie and Nightmare 4 did the same thing before Alien³. It retains all the negatives of the first movie. Same boring pace, and screenplay and direction issues. The good aspects are lowered down, too. At least Betsy Palmer was there to be someone who performed well. No one does a good job here. The characters are still uninteresting as hell. To make things worse, it has pointless nude and perverted scenes which do not fit in the movie. The opening credits show nothing, it can be skipped easily. Some scenes are just too long, and could've been trimmed. But we can skip that, can't we? Well these are some additional negatives. For my complete thought, you can refer to my review of the first movie. Most of the negatives are retained. I don't want to repeat myself again. ..Conclusion : Turn your brain off and be entertained by this piece of s**t. ..Rating. ..Score : 4.5/10Grade : D"
    },
    {
      "rating": "3",
      "text": "This movie starts right at the end of the last one. We can count on some flash-backs to help us to relocate events and characters. I found it really cool that it involves same characters, same locations, same roads. Whatsoever the overall spirit and atmosphere of the film almost did not change that much. We can clearly imagine how cheesy this movie will be when we see the title of the movie explode in the most pathetic way possible.Let's pursue on the good points! This 80's atmosphere is amazing. The soundtrack is terrific. It is very often too much with these shrill violins but yeah, I love it. They kind of made an effort when they tried to create characters that were not all gigantic clichés. A lot of them are really likeable and interesting. At least they had some potential. Thanks to the soundscape, the scenes are as intense as they can be silly and boring to create the endless crescendo of events that this film ends up being. Eventually we know a bit more about Jason's life and goals.Now let's switch to the inconvenients. Hard to know where to start. There are way too many vulgar and perverted shots. Nothing but a flat plot can explain so much nudity and voyeurism. There is something really indelicate and uncomfortable about seeing all these young women undressing. I know hormones are playing a rough game at that age but wow I felt like I was watching something like 'American Pie' sometimes! There are a lot of couples at the start and those who are not always find a way to get laid. As I wrote I think some characters had an amazing potential that is absolutely not used. It's a shame. Some people are only defined by their huge sexual appetite. I've said enough about the omnipresent over-sexualization of the characters. But not enough about the average IQ level of this bunch of teenagers. There are several situations in which they are as dumb as a rock. First of all Jason always manages to get surprisingly close to them without they notice it. It's not that discreet though! Nor that fast. However we see him numerous times in this film, surely way too often and randomly. The concepts of space and time are totally distorted as everyone (especially Jason) is able to reach any place in record time. Murders happen so quickly that they become laughable.In conclusion this movie takes back the formula of the first one but with more mistakes and clumsiness. The end (no spoil) is literally the same."
    },
    {
      "rating": "5",
      "text": "Wasn't as good as the first one. Pacing was a bit better here. Overall it was a pretty average film with not much to talk about."
    },
    {
      "rating": "4",
      "text": "Friday the 13th part 2 the movie to put Jason as the slasher king. now if you have not watched the first friday the 13th you may not know but Jason is not the killer his mother is because Jason drowned. how did he live in the woods for 20+ years who knows but anyway lets get in to what I do like. what I do like is how good the continuity is with the First film. camp crystal lake has become a legend and the fact that Alice hardy is back (andreinne king) now sadly that's the only things I really do like this movie has a lot more flaws with me then it has things I like. one thing I did not like was Jason's design...really your going to have your main killers mask just be a potato sack now I love sackhead Jason but com on man that's the best you could think of? another thing is the rushed production of the film it just fells rushed the first ten minutes is just Alice rolling around in her bed dreaming of what happened in the fist movie... for twelve minutes and the movie is only 86 minutes long!so the entire meat of the story is only 70 minutes! another thing I did not like about this movie is how little Jason is in this movie in the entire 86 minute runtime I estimate that Jason is in the movie for about 10 minutes.now you might be saying what about in the first friday the 13th movie the killer was only in that film for 10 minutes  well at least it was creative the killers are done in the same manner as the fist movie! anyway that was the review thanks for reading and overall I give this film a 4/10 2/5"
    },
    {
      "rating": "7",
      "text": "It's a slasher film ladies and gentlemen when there is a killer who wants to kill you in front of you and instead of run or attack, you're just waiting and screaming, usual slasher horror movie death, and Friday The 13th Part 2 definitely have those thing, is it better than the first one? Yes, like better better? No, it's just a little bit better, in terms of a story, probably length, and some specific character, i did like the teenager better than the previous one, but i still like the previous main survivor character (Alice) way more than this one (Ginny), same case with the original, despite the flaws, Friday The 13th Part 2 is still fun and entertaining to watch, the reason why i give Part 2 the same score even though it's a little bit better well because it's a little bit better, not better or way better, in the end it is still just ok but again it's an ok movie that it's fun and entertaining to watch."
    },
    {
      "rating": "7",
      "text": "Friday the 13th Part 2 is, in my opinion, a decent sequel in this franchise. It happens to be my favorite. We get Amy Steele as Ginny, who I think is the best final girl in this franchise. She is down to earth, but is able to kick butt when needed.PLOTI told the others, they didn’t believe me. You’re all doomed. You’re all doomed.-Crazy RalphFive years after the first movie, a campground near Crystal Lake reopens with unsuspecting counselors dying because of an unknown killer. Paul (John Furey) is in charge of the counselors and Ginny (Amy Steel) as his assistant and girlfriend. Well, actually old Crazy Ralph tried to warn them just like the previous counselors, but to no avail. It seems, Mrs. Voorhees son Jason isn’t dead and wants revenge after seeing Alice kill his mother.MY THOUGHTSAs a sequel I think I actually like this one better than the original. I also really like Ginny (Amy Steel) as the final girl. I think she is one of my favorite final girls in a series and I wish she would have been in more Friday movies.The kills in this one are pretty good. One of the best in this movie is Mark’s (Tom McBride) death. The machete to the head and then him in his wheelchair falling down the stairs is very memorable. Another kill is the couple who dies after sex. Similar to the Kevin Bacon kill, but this time the couple is impaled together with a spear. One issue is that they leave it up in the air if Paul dies or not. Some believe he does, while others don’t. Paul’s body is not shown with the other bodies, so it’s not known if he dies.I like how they gave us closure with Alice at the beginning of the movie. We normally don’t get to see what happens. I also like the introduction of Jason Voorhees, with a sack over his head instead of the mask (just like the killer in the Town that Dreaded Sundown). Though, it doesn’t make sense how Jason is able to dial a phone to call Alice.As far as acting, I think most ranged from ok to mediocre, with a few exceptions. I think Amy Steel was the stand out. The others were the typical characters that just want to have sex and end up dying. I did like the humor with Ted (Stuart Charno). He was the group clown. I believe most of the clowns in the movies die, but in this case he survives since he stays at the bar instead of going back to the camp.During filming of the first take of her death scene, Adrienne King was injured when the prop ice pick failed to retract as it was pushed into her temple.There is a popular internet debate concerning the fate of Paul. In the opening scene of Part III, there is the suggestion that he does indeed survive the events of Part II. During the opening scene of Part III, there is a news broadcast that says there were eight victims. Now assuming all bodies were actually found, there were eight on screen deaths in Part II: Terry, Crazy Ralph, Sandra, Mark, Jeff, Vickie, Scott, and the cop. This would imply that Paul does survive. Alice from the original film is not murdered at the camp, so she may not be included in the news broadcast’s body count, but Paul says she “went missing,” so her body may be on the grounds somewhere.If you want to see my other Friday the 13th reviews, click here: Friday the 13th Franchise.Let’s get into the rankings:Kills/Blood/Gore: 4/5Sex/Nudity: 1/5Scare factor: 4/5Enjoyment factor: 5/5My Rank: 3.5/5IMDB: 6.1/10Rotten Tomatoes: critics: 2.7/10 audience: 4.8/10Letterboxd: 3.1/5"
    },
    {
      "rating": "7",
      "text": "In some ways I thought that this was better than the original. It follows the exact same formula but I found it scarier! The violence was sadly cut down and that was a shame. Still the film made me jump, held my attention and was really quite tense. If you liked the original then this would be a very good film to watch. Nothing like poetry but how many horror films are?"
    },
    {
      "rating": "2",
      "text": "Don't be horny or you will die. Painfully bland and predictable. How many shots of the killers boots could we possibly need."
    },
    {
      "rating": "8",
      "text": "One of the Series' best movies, with like able and remember able characters."
    },
    {
      "rating": "9",
      "text": "Fridsy the 13th part 2 is Jason's big entry to the franchise. He may look word with the farmer clothes and the pillow case on his head but the story and the acting completely saves that and it has some memorable kills and an awesome final girl who can fight back."
    }
  ],
  "recommendations": [
    "friday_the_13th_a_new_beginning",
    "friday_the_13th_the_final_chapter",
    "friday_the_13th_part_iii",
    "halloween_kills",
    "texas_chainsaw_3d",
    "jason_goes_to_hell_the_final_friday",
    "final_destination_3",
    "saw_3d",
    "final_destination_2",
    "halloween_ii",
    "paranormal_activity_the_marked_ones",
    "saw_iii",
    "the_strangers_prey_at_night",
    "saw_ii",
    "jigsaw",
    "a_nightmare_on_elm_street",
    "the_texas_chainsaw_massacre_the_beginning",
    "spiral_from_the_book_of_saw",
    "i_still_know_what_you_did_last_summer",
    "the_ring_two",
    "hellbound_hellraiser_ii",
    "stay_alive",
    "wish_upon",
    "paranormal_activity_4",
    "the_last_house_on_the_left"
  ]
}