{
  "id": 845,
  "title": "Friday the 13th: The Final Chapter",
  "starring": [
    "Kimberly Beck",
    "Corey Feldman"
  ],
  "runtime": 91,
  "genre": [
    "Horror"
  ],
  "description": "After his revival in a hospital morgue, Jason fixes his vengeful attention on the Jarvis family and a group of hitherto carefree teenagers.",
  "releaseYear": "1984",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5KRBkaF6PdorcFjWiDY4tJy67Jf.jpg",
  "categories": {
    "plot": 5.428571428571429,
    "acting": 5.576923076923077,
    "ending": 6.444444444444445,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Ah, Friday the 13th: The Final Chapter. My favorite movie in the franchise with a nice cast doing some awesome acting and Jason Voorhees bringing out his machete again."
    },
    {
      "rating": "3",
      "text": "This is one of my least favourite of the series. This is when the series started getting stale because it kept to that same formula. And while the kills are enjoyable, Not much else is."
    },
    {
      "rating": "0",
      "text": "This movie is the fourth sequel to \"Friday the 13th\", one of the worst horror film franchises and one of the toughest to kill. Its simply another slasher movie thought for adolescents and carried out by them. Its definitely a movie that is not worth the time it took to watch it because it seems made by amateurs. I just regret that Jason never thought of visiting the studios where the movies about him were made ... maybe the visit would have prevented some disasters like this movie."
    },
    {
      "rating": "7",
      "text": "Jason escapes the morgue and terrorises a family and some friends staying on the lake before he gets stabbed to death by a small child."
    },
    {
      "rating": "7",
      "text": "This is a very good final entry to the series. Yes, I realise that there are many more films to come but this is the one that ends the original franchise before descending into absurdity. Entertaining absurdity. Jason here is not supernatural, he is menacing and brutal. I like both the human and the supernatural Jason but for me this is my favourite in an entertaining franchise. The film is a blood bath as Jason gets into full swing in his hockey mask. The only trouble is that these films are getting mighty shallow, not that they had much depth in the first place! This has to be the most consistent franchise ever, there’s been 12 Jason films and they are always entertaining in one way or another. I wonder what the 13th Friday the 13th will be like? I digress, the ending was not as prolonged as the others which worked well. There was some really sick violence and it was all practical, no CGI or compositing here."
    },
    {
      "rating": "7",
      "text": "This review contains spoilers. This is when it was all supposed to end the first time around. But after a record breaking opening weekend we were of course treated to some seriously gorious(intentional) sequels. The set up is pretty much the same as the seemingly unstoppable Jason targets a new group of horny teens which include a young, cute, weird Crispin Glover with the best dance moves ever. Jason hacks his way through the group with some amazing practical effects by Master Tom Savini. It all culminates with geeky horror kid Cory Feldman who has a lot of FX crap slashing him down in a truly spectacular finale. That being said the film tends to be a bit repetitive and the characters are definitely underwritten. Still the movie packs several punches in what is probably the most by the numbers but thrilling and entertaining film of the first four.3.75/5"
    },
    {
      "rating": "6",
      "text": "So-So “Finale”Like 3, Jason’s kills are the highlights of this movie because of a less than stellar script."
    },
    {
      "rating": "7",
      "text": "This is when it was all supposed to end the first time around. But after a record breaking opening weekend we were of course treated to some seriously gorious(intentional) sequels. The set up is pretty much the same as the seemingly unstoppable Jason targets a new group of horny teens which include a young, cute, weird Crispin Glover with the best dance moves ever. Jason hacks his way through the group with some amazing practical effects by Master Tom Savini. It all culminates with geeky horror kid Cory Feldman who has a lot of FX crap slashing him down in a truly spectacular finale. That being said the film tends to be a bit repetitive and the characters are definitely underwritten. Still the movie packs several punches in what is probably the most by the numbers but thrilling and entertaining film of the first four.3.75/5"
    },
    {
      "rating": "6",
      "text": "The writers of the Friday films - you can create some interesting characters, definitely. So why don't you or didn't you do so quite often? ..Good : After the last two terrible films, this movie felt like a fresh breathe of air. It is perhaps on par with the first one. It certainly is one of the better ones in the series. We get the same clichéd teenagers to get **** up, but surprisingly, we get some good and interesting characters too. The acting is better in this one. The kills are better. The practical effects are appreciable. Even though the teenagers are there to get slashed in the end, some of them were interesting. The kills are good most of the times. The first kill is the one I like the most. And the main thing would be that the characters are more interesting in general. There are characters like Tommy and Rob and Tommy's sister which are very interesting when they come on screen. Whenever they come together, they share some good dynamics. That's the reason I love this movie, to some extent obviously, I don't really love any of the movies in the franchise. Even if there were no Jason and the killings, I would've been fine with those characters interacting with each other. ..Bad : Sadly, the characters I liked have a bit less of screen time than I wanted them to have. As I said, some of the kills are brutal and I love them. But, there's one thing that bugged me - I was not into Jason Voorhees as the main character in this franchise. I was behind Myers and Krueger, right from the beginning. Fourth movie, and still, Jason is just an undead guy with a lesser interesting backstory, who wears hockey mask and kills people. All I can say is that his kills are badass. That doesn't make the character more believable or better. That's the main problem I have with this franchise in whole. I am not behind the main character. And, its contemporary - Nightmare - by the fourth movie they have tried different types of story ideas. And here, it's still the same here's your teenager gang around the camp who are gonna get killed by Voorhees, and there will be a person who stands out. That's all. It gets tiresome and repetitive by this point. And, I was watching these films in a row quite recently. It almost made me quit. There are some things that I liked, for example some of the kills I mentioned and a child character who shines in the end. But, I can see this movie being much, much better. Like in the other films, it doesn't give you any tensed moment. When you are about to get a kill, you get a jumpscare, then while a character is being killed, you are getting some chills, and then .... back to normal again. That's how these films upto this point are. No feel of tension or urgency in the entire runtime. And coming back to the character of Jason .... like I said in my review of first Friday the 13th or may be the first Nightmare film, there's no credibility to the actor playing Jason, in my opinion. I believe it's just director and writer who could make him interesting. Else, they won't hire stuntmen to play the character most of the times. And I should say, the ones I find responsible for making the character good, didn't do a very good job so far. ..Conclusion : This movie was just barely good. It doesn't feel like a typical B grade horror film, like many of those in the franchise. It won't (probably) bore you to death, if you're not watching all of them in a row. ..Rating. ..Score : 5.8/10Grade : C+"
    },
    {
      "rating": "3",
      "text": "Aw sh*t here we go again for the same copied and pasted formula. 'Friday the 13th Final Chapter' starts with an awful introduction bringing us back in the ugliest and least scary moments of the prequel. No strings attached. Don't worry, you don't have to wait a long time to witness the first boobs-flash scene and realize that this particular episode of the saga brought the nudity and the sex scenes to a whole other level. Overall, the vulgarity continues to rise, even after the impressive level of \"Friday the 13th Part 3\" and its incredible focus on teenage girls' butts. Here we have the right to have the bad and muddy jokes in addition to it. And teenagers watching nudity all night long. Moreover, while the prequel sometimes fell into a kind of voyeurism, here we have an official beginning of this perverse inclination since we have the extreme chance to see a ten year old looking at a naked teenager. I don't even have to note the fact that all these stereotyped teenage protagonists are horny as hell and can't go a night without getting laid. Plus they all are as dumb as deaf to not realize what is happening all around them.The acting is very inequal between the actors and it is a shame since some of them had a great potential like Rob. But the movie prefers to show us blood than deeper realtions and interesting characters. Dialogues are terrible. The few 'romance' sub-stories are awful. There are a surprising amount of useless and ineffective scare jumps. Special effects are bad even if slightly better than those of the prequel. In 'Friday the 13th Final Chapter' we also reach a point of gore and sadism never seen before in the series. The crimes are finally getting more creative and darker, which doesn't stop them from being honestly laughable at some point. Jason is still overpowered, invicible and fast as my man Usain, making him a shallow and predictable opponent.Fortunately the movie has some decent parts, like this amazingly laughable dance scene which is totally unforgettable. You just have to enjoy it to make the film worth watching. No spoilers but for once the ending is interesting and different from all those of the prequel."
    },
    {
      "rating": "6",
      "text": "Better than the other two sequels. Likable and relatable characters. Would have been a good finale for the films."
    },
    {
      "rating": "8",
      "text": "This is the best friday the 13th film of when Jason was alive man I loved this film I loved the make up effects by Tom Savini I loved the suspense and the characters weren't half bad (Jarvis family where the best characters) I want to make this review longer and tell about the things I don't like but there isn't! this movie is far from perfect but I loved it! that's the review thanks for. reading and I give this film a 4/5 or a 8/10 great film"
    },
    {
      "rating": "10",
      "text": "I love this movie because it is horror at its purest. The teens aren’t counselors or trying to overcome a previous attack. They are just horny teens who go there to skinny dip and have sex. The kills are great and Jason is in his mask the whole time. The introduction of Tommy Jarvis was critical for the series. This film will always hold a special place in my heart."
    },
    {
      "rating": "2",
      "text": "Friday The 13th: The Final Chapter still have that usual Friday The 13th fun and the brutalness of the death, but the differences is compare the previous three that only happen in the first 30 minutes, and all the fun and brutalness gone just like that in the rest of the film because of the stupidness that are too stupid in terms of a story and characters that literally all of them especially the group of teens members that are all just very very unlikeable, they all stupid, dumb, horribly perform, and all of their death is just so unsatisfying, there is no terror anymore, i'm watching their death like there is nothing happen and maybe that because i don't care about a single character in this movie too, i hated all the group of teens members in this one, the only three character that i don't hate but still meh is Trish, her mom, and Tommy, and they all not in the group, so overall Friday The 13th: The Final Chapter is indeed the first one in the franchise that i cannot stand it because how dumb and awful the movie is and the fact is it is dumb and awful movie that fills with so many unlikeable characters."
    },
    {
      "rating": "7",
      "text": "I have no idea why this movie got rated so low by critics. It's exactly what you expect from a Friday the 13th Movie. Killings, nudity, teenagers with questionable acting and decision making that all end with a chase scene. Maybe slightly cheesy, but that's part of the enjoyment. My only real gripe is the titling. It's obviously not the last chapter. In fact, it's not even the halfway point. It's deceptive marketing."
    },
    {
      "rating": "7",
      "text": "This film is a lot more fun than what I remembered it was. Between Crispin Glover’s dance moves, the increase in the deaths and nudity, and TWINS! Friday the 13th The Final Chapter is a fun movie and a lot better than Friday the 13th Part 3!PLOTDie! Die! Die! Die!-Tommy JarvisIn Friday the 13th The Final Chapter, they take Jason’s body to the morgue. Jason isn’t having it and escapes and heads back to the lake, where a group of teens are renting a house to party. Next door is a mother, her daughter Trish (Kimberly Beck) and son Tommy ( Corey Feldman). In the woods is mystery man Rob (Erich Anderson) who says he’s hunting bears.MY THOUGHTSHelp! He’s killing me! He’s killing me!-RobThere’s so much to like about this movie. Let’s start with the kills. The kill count is higher with a total of 14 kills. There’s more blood and gore as well. Some favorite kills are when the hitchhiker is stabbed in the neck. The banana didn’t deserve that! LOL Samantha (Judie Aronson) gets stabbed in the boat. That one looked painful and I’m adding in the hypothermia she suffered from. Of course I have to add in Jimmy’s (Crispin Glover) death. I watched this one and remembered there was a scene in a Halloween movie with a corkscrew in it. (It was in Halloween H20). And, not necessarily favorite but more memorable, is Rob’s death. The famous cringy “Help! He’s killing me! He’s killing me!” line. It made him sound so bad. Almost forgot, but Jason’s head sliding down the machete was pretty cool. The slow sliding made it creepy.We also got an increase in nudity with this film. There was a skinny dipping scene with several people and plenty of nudity by several people. We also get one girl who strips down to get into a boat at night. And can’t forget the shower scene where you get to see a woman’s butt against the glass. There is an old style film reel with half nude women on it. Poor Ted doesn’t get lucky with any of the girls and ends up watching a pseudo old style porn. Then gets killed for it.During a conversation between Rob and Trish, Rob mentions that his sister Sandra was killed by Jason. Sandra was actually killed in Friday the 13th Part 2 and was played by Marta Kober. She was impaled with a spear while having sex with her boyfriend. I liked that little call back to an earlier movie in the franchise.There was no way I wasn’t going to mention Crispin Glover’s AMAZING dance moves in this movie! It was so bad it’s good? From what I’ve read he was actually dancing to AC/DC’s “Back in Black” when they were filming it. But in post editing they put in Lion’s “Love is a Lie”. Honestly, I don’t think it makes it any better though? It was a weird dance. But I did find it endearing in his character.Now for the negatives. For the most part, I think I don’t like how some of the actors were treated while filming this. I read that Judie Aronson got hypothermia while shooting her death scene. The director kept Judie Aronson in the water for her death scene so long, she got hypothermia. I also heard that the director was so mean or rough with Corey Feldman that when he was killing Jason, he was imagining he was actually hitting the director.Overall a good movie and a fun watch. A definite improvement over Part 3. I’m quite surprised that I like this one so much. I know this may be hated but I may like this one better than the first one.Chronologically, parts 2, 3, and 4 take place over the course of 5 days, from Friday the 13th to Tuesday the 17th. During that time Jason kills 34 people.Last film in the series to pick up immediately where the previous film left off.Distinguished film critic Roger Ebert called this film “an immoral and reprehensible piece of trash.”If you want to see my other Friday the 13th reviews, click here: Friday the 13th Franchise.Let’s get into the rankings:Kills/Blood/Gore: 4/5Sex/Nudity: 4/5Scare factor: 2/5Enjoyment factor: 4/5My Rank: 3.5/5IMDB: 6/10Rotten Tomatoes: critics: 1.9/10 audience: 5.1/10Letterboxd: 3.2/5"
    },
    {
      "rating": "3",
      "text": "Was nice to see a few known actors pop up in this. This one seemed to go over the line with the gratuitous nudity and general horniness from the start. I am getting sick and tired of seeing the bad guys feet walking as a form of tension. Has some better kills at least, the launch from the window was fun, assuming everybody in the house was deaf though. Features an all time weird dance sequence from Crispin Glover. I appreciated the different spin on the ending."
    }
  ],
  "recommendations": [
    "friday_the_13th_part_iii",
    "friday_the_13th_part_2",
    "friday_the_13th_a_new_beginning",
    "jason_goes_to_hell_the_final_friday",
    "seed_of_chucky",
    "halloween_kills",
    "texas_chainsaw_3d",
    "final_destination_3",
    "final_destination_2",
    "a_nightmare_on_elm_street",
    "would_you_rather",
    "i_know_what_you_did_last_summer",
    "the_babysitter_killer_queen",
    "freaky",
    "the_strangers_prey_at_night",
    "jason_x",
    "saw_3d",
    "saw_iii",
    "machete_kills",
    "the_texas_chainsaw_massacre_the_beginning",
    "halloween_ii",
    "stay_alive",
    "paranormal_activity_the_marked_ones",
    "friday_the_13th",
    "house_of_1000_corpses"
  ]
}