{
  "id": 2108,
  "title": "Friday the 13th Part III",
  "starring": [
    "Dana Kimmell",
    "Rachel Howard"
  ],
  "runtime": 95,
  "genre": [
    "Horror"
  ],
  "description": "An idyllic summer turns into a nightmare of unspeakable terror for yet another group of naive counselors. Ignoring Camp Crystal Lake's bloody legacy, one by one they fall victim to the maniacal Jason, who stalks them at every turn...",
  "releaseYear": "1982",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mYkbmw6umfbvPYBwkcOJsKbTCQ1.jpg",
  "categories": {
    "plot": 5.125,
    "acting": 5.166666666666667,
    "ending": 4.142857142857143,
    "soundtrack": 4.0,
    "cinematography": 3.3333333333333335,
    "familyFriendly": 3.0,
    "funny": 4.25,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "I found Part 3 to be entertaining with some good kills, decent characters (some of them), a nice battle at the ending, and Jason Voorhees. Just watch it in 2D.However, some complaints. It is so similar to the first 2 films, the 3D is annoying, and characters like Andy, Debbie, Chuck, and Chili don't have enough development (though Chris and Shelly are well developed). And while the death scenes are better than Part 2's quick kills that cut away after 2 seconds, it hasn't reached its potential gore.So it's good, but it's a weaker installment."
    },
    {
      "rating": "8",
      "text": "Sin tener mucha violencia gráfica, es una de las mejores de la saga, equilibrada, sólida y muy bien filmada, el haber usado cinemascope le da un toque muy elegante lo cual le suma muchos puntos, mi favorita junto con la sexta entrega."
    },
    {
      "rating": "8",
      "text": "Friday the 13th part III hasn't aged nearly as well as it could have without it's gimmicky 3D effects, but it still manages to be one of the most iconic films in the franchise not only because of the introduction of Jason's infamous hockey mask, but because of it's fun atmosphere. Do not take this film or any other slasher film seriously (for the most part). Although I will say that the film's reliance on cliches can often be downright annoying."
    },
    {
      "rating": "6",
      "text": "This suffered a little from being in the middle of the eighties. It took some pop trends on board and didn’t come off better. The 3D effects are really cool on a VR headset ‘huge screen cinema’. One of the best of the eighties 3D horror films. The violence was fine although it felt like it could have been gorier and the story progressed well as we got to see the infamous hockey mask. Follows on from the story of the first closely. Rarely detours from this Friday the 13th saga. Made me jump and held my attention."
    },
    {
      "rating": "5",
      "text": "It's a fun watch with another solid cast of characters and enjoyable kills but the needless 3D addition and repetitiveness tanks it a bit."
    },
    {
      "rating": "4",
      "text": "Dude the soundtrack in this movie is some funky sh*t!Not a good movie by any means, but an absolute blast. It's so hilarious and kinda embarrassing of how they used 3D in the movie. The amount of times the actors awkwardly put things up close to the camera for along period of time. Then again I did watch this in 2D. After giving it some thought, it's strange to think that Jason gets his hockey mask from a Seth Rogen type of character."
    },
    {
      "rating": "6",
      "text": "Starting To Catch SequelitisJason’s kills are still clever, but the script’s skills are starting to wane."
    },
    {
      "rating": "7",
      "text": "There's so much I love about this movie. It's definitely a step up from the last. The setup is the same as Jason targets a new group of druggie, horny teens but this time in 3D. The kills are great. The eye popping scene is the best and the effort put into the 3D effects is really impressive and goofy. From the get go I absolutely loved the disco theme. The acting is pretty bad but in a fun campy way. The final girl is mostly useless but hilarious as she faces Jason down. I love the bikers and the movie is overly entertaining and highly successful mostly because it's not aiming very high. Plus this is the one where he finally gets his iconic mask3.5/5"
    },
    {
      "rating": "1",
      "text": "This movie is the third sequel to \"Friday the 13th\", proving that if Jason is tough to kill, the franchise is certainly harder to die. The recipe is like the films that preceded it: in a haunted camp lives a hard-to-kill monster who loves to exterminate stupid teenagers, improving human genetics by preventing such deformed beings from breeding. I'm being ironic, but the truth is that the film is so bad that it allows me that, as well as being no different from the vast majority of slasher films."
    },
    {
      "rating": "3",
      "text": "If you loved 2, you'll probably love this, but a little less. If you're like me who didn't like 2, this is worth a skip. ..Good : The only positive would be the exclusion of unnecessary nude and perverted scenes. It still has a lot of them, but weren't at least as annoying as in Part 2. Some jumpscares are okay. ..Bad : The acting is just pure stupid. Either they don't act or they are overacting. It opens with the same stupid recap of the ending of the second movie and ends exactly in the same way like the first. Many similarities are there between the second and this one. If you watch the beginning of the movie, that's the way the previous ends, minus some parts, because that'll mean repeating part 2. The entire story is lame as s**t. It follows the exact template and is directed by the same man. It awkwardly mentions sex a lot of times. The characters are still annoying. The main girl is kinda okay. And that's about it. Even the kills are not so great. There are no thrills or tension being built, until it requires the movie to have a kill. It suffers from the same old screenplay and direction probelms. You can read my full thoughts on those issues in my review of other Friday films. I don't want to repeat myself here. ..Conclusion : It was like they travelled through time, read my review for part 2, and said, \"Oh yeah? Here's this!\". F**k this movie. ..Rating. ..Score : 3.1/10Grade : E"
    },
    {
      "rating": "3",
      "text": "I guess we never change a 'winning' team huh? Since the beginnings and the credits we definitely know it is going to be cheesy as hell. The characters are really stupid, some way more than others. At some point I just couldn't stand the face and voice of the famous Shelly, the so-called funny guy of the band. He contributes to induce many unnecessary and terrible scarejumps throughout the film to the point where everything becomes either honestly laughable or excessively boring.Once again these teenagers are full of invasive sexual hormones pushing them to jump on each other like rabbits. The importance of consent is clearly not as strong as it is today. Some scenes would make some feminists scream (and not only because of fear). We are too often on the verge of voyeurism when the camera languidly follows the long legs of these naked young women. By the way Shelly doesn't manage to find his own place just because he is fat and 'ugly'. The only people of color in the film are dumb thugs, thank you the 80's.If I always enjoyed sound effects and music of the series I have to admit this movie pushed things a bit too far. Jason, the music and the sounds he provokes are omnipresent, so that the tension can never subside. This fact just makes music silly and misused.The overall acting is emotionless, not good. Flashbacks are mind-numbing and unattrative. Turns of event are far too often incoherent. Every single murder is committed without any noise. Blood never leaves marks and is rarely saw by the protagonists. Special effects are particularly awful. Jason is overpowered, superhuman, overskilled and overly fast. It is like he can fast-heal the few wounds he has! Especially at the end (without spoiler), things get really over the top and you can really feel Steve Miner's intention to force us to create an irrational fear in ourselves. Personally I couldn't retain a laugh for the heroine who will surely survive with an incurable post-traumatic syndrome. As always the end is tricky, blurred and incomprehensible. But we will remember this movie as the birth of the famous masked Jason."
    },
    {
      "rating": "4",
      "text": "Is too similar to the original film. Very average experience which doesn't try to do anything new or interesting."
    },
    {
      "rating": "4",
      "text": "Girl who was attacked by Jason years ago thinks it's a good idea to take her friends back to the lake before Jason kills them, a biker games and steals a hockey mask from an idiot."
    },
    {
      "rating": "6",
      "text": "Friday the 13th part 3 now you can watch it in 3d or in 2d for this review I watched it on 2d for this review. friday the 13th part 3 is the beginning of Jasons iconic hockey mask and this was one of the first films to be shot it 3d in the 80's other films would come out like jaws 3d and amityville 3d but those two are bad friday the 13th part 3 is the best out of the 3d horror craze of the 80's now somethings I liked. the kills/gore where very good in this this film a one up from the last two films they show the body more and more gore which is good another thing I like is the music it really creates suspense now for somethings I did not like. first of the fake body props oh my god there bad in ricks death there is no way somebody is going too think that's a real head another thing I did not like was how close it resembles the original this film is basically the same only difference is the kills and one is Jason and the other one is his mother anyway that's the review thanks for reading overall I give this film a 3/5 or a 6/10"
    },
    {
      "rating": "7",
      "text": "7.5/10There is surprisingly quite a lot of things that can be appreciated from Friday The 13th Part III and it might be not while you're watching it, it can be even after, like my case, the movie have the best opening scene (not including the usual flashback) so far compare to the previous two, i really really think the opening scene was great, the movie also improve in the death scene which i think the most brutal one again so far, and like previous two i was really entertained and enjoy the movie mostly from the beginning till the end, and also like the previous two the main problem in the movie is in these group of characters, because these characters is really the key of Friday The 13th films, well same like the previous two i still have some mixed feeling about certain characters, there is still a characters that i hate, a characters that i think was ok, and a characters that are just fine, i didn't really care on the main survivor until the last battle between the survivor and Jason, now that is where i really like the main survivor, they make the most creative survivor in the franchise so far with all the things she does and i really really like it, so overall Friday The 13th Part III is surprisingly pretty good enough to make me recommend this one mostly with the help of all the improve brutalness and creativeness for the most part."
    },
    {
      "rating": "5",
      "text": "The first time watching Friday the 13th Part 3 I remember liking it. (Granted, I nearly always like slasher movies at that time). This time watching it, I don’t like it as much. I was kind of annoyed with the main character. And some of the acting by Dana Kimmell and Paul Kratka was frustrating.PLOTHaving survived the previous movie encounters, Jason Voorhees (Richard Brooker) is back when a new set of friends decide to party at a house near the lake. Chris (Dana Kimmell) along with five friends show up at her old family home. There she runs into Rick (Paul Kratka), a potential love interest. These friends need to fight three punks and Jason to survive the night.MY THOUGHTSFor me, the two things this movie is well-known for is: 1) this is in 3-D (even though with rewatches it’s not in 3-D). 2)Jason gets his iconic hockey mask for the first time. Having said that, there is quite a bit not to like.Starting with the continuity of Jason. This is supposedly the day after the events of Part 2 but Jason is so different between the two movies. I get it that it’s a different actor but the whole look of Jason is completely different. Add in the part that Jason may or may not of attempted sexual assault (WTF?) on Chris (Dana Kimmell).There are more kills, about 12. They are somewhat bloody. Some of them are off screen and you only see the aftermath. Some of the good kills are of Andy (Jeffery Rogers) who is split with the machete while doing a handstand. Also, Debbie’s (Tracie Savage) gets a similar kill as Jack from the first movie. Vera (Catherine Parks) was killed with a spear from a spear gun when Jason shot her in the eye. I almost forgot that the eye popping scene was actually pretty good.We get the basic characters that are in every movie. You have the clown, the horny couple, a couple of pot heads, and then you have the heroine and her love interest. The difference is that they added three other people who are part of a motorcycle gang that harasses Shelly and Vera, and become added victims for Jason. The acting is ok, but Paul Kratka as Rick just annoyed me. It was bad. The final girl Chris also annoyed me with her whining and just unbelievability.I felt deja vu while watching this movie. They ripped off so many scenes from the original. There’s a recap at the beginning of the movie talking about Ginny. We have similar kills like Debbie, who died like Kevin Bacon’s character. We have the ending scene where Chris gets into a boat and a rotting and bloating corpse of Mrs. Voorhees comes out of the water just like Jason did in the first movie. We also have a new town crazy who tries to warn them of a killer.I will say the music is pretty good. Plus we get some good kills. And we get the iconic hockey mask for Jason. Overall, Friday the 13th Part 3 is not a good sequel, but far from the worst in my opinion.This is the first Friday the 13th sequel that uses the iconic hockey mask.This movie was actually released on a Friday the 13th.This is the only movie where Jason’s name is not said by any of the characters.This movie takes place the day after the incidents of Friday the 13th Part 2.The last film in the series to have a female only survivor.The only movie in the series to have a pregnant woman be killed by Jason.If you want to see my other Friday the 13th reviews, click here: Friday the 13th Franchise.Let’s get into the rankings:Kills/Blood/Gore: 3/5Sex/Nudity: 2/5Scare factor: 2.5/5Enjoyment factor: 3/5My Rank: 2.62/5IMDB: 5.7/10Rotten Tomatoes: critics: .7/10 audience: 4.2/10Letterboxd: 2.8/5"
    },
    {
      "rating": "3",
      "text": "Do NOT even think about staying by the lake or getting frisky on Jason's watch. We get at least a drop of character development in this one, but are still well within the standard set by the first 2."
    },
    {
      "rating": "6",
      "text": "Other than the Hockey Mask, Gore, 3D, and the Funky Fresh Music, it's just another film for Friday the 13th thats the same."
    }
  ]
}