{
  "id": 1831,
  "title": "Friday the 13th Part VII: The New Blood",
  "starring": [
    "Kane Hodder",
    "Lar Park Lincoln"
  ],
  "runtime": 88,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A young girl who possesses the deadly power of telekinesis accidentally unchains the bloodthirsty Jason Voorhees from his watery grave.",
  "releaseYear": "1988",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xBjEL0k9Cz3QFjnpEK6c8b9Z51o.jpg",
  "categories": {
    "plot": 5.363636363636363,
    "acting": 6.166666666666667,
    "ending": 7.3076923076923075,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Friday the 13th Part VII: The New Blood this is a movie I did not want to see for a long time because it sounded dum someone having like power like what but Jason of course I wanted to see like usual. So this movie I am honest suprised how much I liked it I did not feel bored I like the cast of characters with tina makes this movie so much better 100% percent Jason and yup this is my fav Jason for sure I thought it was Part 6 Jason nope this tops it for sure and yes the kills are cut away which suck but the characters and the pacing and how good jason is I don't mind but in part 5 I did because it wasn't jason and the characters sucked in that movie blowing up Jason at the end seemed very dum that definly didn't kill him I know that I feel like if the kills were cut away this movie would be better for people for me it is dum they had to do that but for the poeple I do get it tho that is really all the problems I have here I think this is one of the better Friday the 13th Movies Can't really think of any problems i have besides the kills that's it really so an allround an a really good movie that i do think should get more love than it gets so I give Friday the 13th Part VII: The New Blood an B+"
    },
    {
      "rating": "10",
      "text": "2020 MOVIE #128:FRIDAY THE 13TH- THE BEW BLOODThis is by far my favorite Friday flick. Maybe because it was the first I demanded to see in theaters at 9 y/o. Or maybe because it was secretly nicknamed \"Frigay the 13th\" because of the boys hooking up behind the scenes as well as 4 out gay actors which include Nick, the main hottie played by Kevin Spirtas ( After Forever) and the adorable William Butler (Leatherface texas chainsaw massacre 3). Or maybe I was just a sucker for the campy, superfun concept which finally gave Mr. Hockey mask some real competition in the form of Tina Shepeard played by Lar Par Lincoln (House 2) a fierce final girl with the powers of telekinesis. That's mostly it but I also feel like this is the one where I started to fall in love with Jason because the makeup is awe inspiring and is performed brilliantly by the wonderful Kane Hodder. No matter what it is, I absolutely love this slasher flick it's near perfect in my eyes and just so damn entertaining. Plus it has the best poster of the series and pretty much ever in my opinion.4.75/5"
    },
    {
      "rating": "10",
      "text": "This Film Brings out the best of Jason Voorhees , it also debuts Kane hodder to play the role as the masked killer"
    },
    {
      "rating": "7",
      "text": "Kane Hodder becomes Jason Voorhees and he does a great job. Tina is also a great lead and one of the best in the series. The kills and other teenager characters aren't as good, but overall I still like this film."
    },
    {
      "rating": "5",
      "text": "There's a lot of bad acting and some pretty awful writing all around but the fun kills were a plus and seeing Jason finally go toe to toe with someone gave for a pretty good final battle, despite having an awful ending."
    },
    {
      "rating": "3",
      "text": "Es disfrutable a secas, me gustó la ambientación y las muertes son muy buenas, pero el concepto, los forzados elementos sobrenaturales y los personajes son una basura, sin embargo, el diseño de Jason es asombroso."
    },
    {
      "rating": "0",
      "text": "This movie was so f**king horrible that I didn't feel like talking a lot about it. So, the review shall feel a little short. ..Mixed : The concept of the film sounds good, at least tolerable. That's all. ..Bad. This movie is just F**KING BAD! I don't know properly, but I feel as if the idea of this movie was conceived from Nightmare 3 and its popularity, but that's it. The idea for this film is quite similar to that of Nightmare 3, or at least a character of Nightmare 3. A girl with telekinetic powers is all set to f**k Jason up. In paper, I admit, it sounds great. But it AIN'T. All we know about that girl is that she can do telekinesis and is suffering from a loss and a regret. That's it. Rest of the film is just boring a$$ s**tty Friday the 13th film. I talked about boring characters in these films, this one's got the totally boring f**ks. It feels like going in the screen and asking Jason to kill all of them as fast as possible. This literally has nothing. Jason kills a bunch of motherf**kers. The ones to be killed have sex and exhibit nudity. That's literally the entire movie. It does nothing else. At all. Plus, to make it worse, they have a plotline with a doctor trying to cure the girl with telekinesis, which makes no sense. And she does many things which are supposedly \"cool\", but are not. And some plot holes here and there involving the telekinesis lady. There's nothing redeeming about this movie. It's just awfully bad. The reason it's shorter? Well, it has nothing to be reviewed at all. ..Rating. ..Score : absolute 0/10Grade : F**k this movie"
    },
    {
      "rating": "4",
      "text": "Girl kills her father using telekinesis but accidentally frees Jason from the chains keeping him in the lake, then fights Jason with her telekinesis before her father's spirit chains Jason up again."
    },
    {
      "rating": "3",
      "text": "jason voorhees jason voorhees jason voorhees jason voorhees jason voorhees jason voorhees"
    },
    {
      "rating": "6",
      "text": "Friday the 13th part 7 the new blood is a very mediocre movie its not bad but it's not bad but it certainly isn't a good movie either. we follow a girl named Tina throughout the story and she is telekinetic and goes to Crystal lake for her doctor. when tina was a kid she killed her father with her powers, when she goes back to where she killed him with her powers she tries to bring back her father and I think Jason and Tina's father are two very different people so as you expect she brings Jason back to life and he tears up the camp kills some teens and that's the movie. the final showdown was really fun because this is the first time Jason had somebody that really challenged him and at the end oh my god the end alright get this...TINA SUMMONS HER FATHER TO DRAG JASON DOWN INTO THE WATER what!! anyway that's the review thanks for reading have a great day"
    },
    {
      "rating": "6",
      "text": "When I was younger, this was one of the Friday the 13th movies that I really didn’t like. I think the whole telekinesis aspect was what I didn’t like. Now, after this rewatch, I don’t hate it as much as I used to. I’m still not fond of it, but I do like Tina a little more now than I used to.PLOTTina (Lar Park-Lincoln) and her mother return to Crystal Lake after being gone many years because of an accident that killed her father. Meanwhile next door is a surprise birthday party for friends. Tina has special telekinesis powers that she accidentally uses and awakens Jason. She must now try to save her mother and the other people from a reawakened Jason.MY THOUGHTSI really like Jason in this movie. I like how the spine is showing in the back. The slash in the face is there as well. This Jason is grittier and grimier than others. This was Kane Hoder’s first go as Jason, and I think it’s my favorite so far. Also, Jason is unmasked the longest in New Blood rather than any of the other movies. We do get about 16 kills in this movie.Remember Crazy Ralph (Walt Gorney) from the first two movies? He does the voiceover during the flashbacks. The director, John Carl Buechler, plays the firefighter who picks up Jason’s broken mask at the end of the movie.The acting was ok. Nothing outstanding other than I felt Kane Hoder’s Jason was a lot better than the previous. Terry Kiser was slimy as his usual characters. I felt that Melissa (Susan Jennifer Sullivan) was over the top with the **** Though that’s more the writing/directing and not the actress. And, I know Eddie (Jeff Bennett) is supposed to be nerdy, but it’s more annoying. Again, not the actors fault. I guess I’m being too critical of the characters in a basic slasher movie. LOLMy main complaint is the whole telekinesis plot line. I just wasn’t buying it. Yes, Jason is a supernatural killer, but that doesn’t mean the final girl should have powers too. I don’t know, I just didn’t like it. And don’t get me started that she doesn’t end Jason, but she brings back her dad to kill him. The dad who has been in the water for many years but doesn’t look like he’s rotted any.Overall, for a completionist like myself, yes watch it. But it’s not one I willingly rewatch just for the hell of it.This film had to be cut 9 times in order to get an R rating.This was the last ‘Friday the 13th’ film to use footage from any of the previous films.At the time of its release, this was the first Friday the 13th film to have a “peaceful” ending that doesn’t hint to Jason or some other killer returning for a sequel.If you want to see my other Friday the 13th reviews, click here: Friday the 13th Franchise.Let’s get into the rankings:Kills/Blood/Gore: 2.5/5Sex/Nudity: 1/5Scare factor: 2.5/5Enjoyment factor: 6/10My Rank: 3/5IMDB: 5.3/10Rotten Tomatoes: critics: 3.2/10 audience: 3.7/10Letterboxd: 2.6/5"
    },
    {
      "rating": "1",
      "text": "A big step back in every aspect. Unfunny, overly serious, boring kills, melodramatic relationships, etc. Takes 20 minutes + to get rolling and that's 25% of the movie. Liked the new Jason design."
    },
    {
      "rating": "10",
      "text": "Friday the 13th part 7 starts off with a weird introduction but quickly turns good by the telekinesis final girl the story and acting is awesome and it has an amazing ending plus it is finally a final girl that is a match for Jason because of her telekenectic powers and it is pretty much Carrie white vs Jason vorhees"
    }
  ]
}