{"id": 1575, "title": "Friday the 13th", "starring": ["Betsy Palmer", "Adrienne King"], "runtime": 95, "genre": ["Horror"], "description": "Camp counselors are stalked and murdered by an unknown assailant while trying to reopen a summer camp that was the site of a child's drowning.", "releaseYear": "1980", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/HzrPn1gEHWixfMOvOehOTlHROo.jpg", "categories": {"plot": 5.666666666666667, "acting": 6.071428571428571, "ending": 6.5, "soundtrack": 2.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 2.0, "action": 6.0}, "reviews": [{"rating": "3", "text": "It's almost as if they didn't even watch the original Friday the 13th before making this. Please ignore this piece of crap, this is hollywood trying to get every buck they can. Thank the lord for redbox. But still, buying gum with my one dollar would've been a better investment."}, {"rating": "8", "text": "people dont give this movie enough credit then it should be getting, i know the same teenageer thing where they go to the woods have sex, get drunk, do drugs and get killed can get boring but you have to look past that, the movie has unique kill scenes and they even made jason smarter to the point where he sets traps, the movie i will admit will get boring and repetitive sometimes they make up for that but adding in boobs and killing scenes, if your a fan of the friday the 13th i say atleast look into this movie and give it a try"}, {"rating": "0", "text": "Why does this movie have a higher score than other Horror movies that are actually better than it? I hated it. It just seemed like another stupid sequel"}, {"rating": "3", "text": "it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.v"}, {"rating": "4", "text": "Everything that I have seen before I found here. The same poor acting that I saw on other horror films I found here too. The same \"scary\" moments. The same archetype murderer. Nothing new. Nothing original."}, {"rating": "1", "text": "Really a very disappointing remake. The film begins with the death of the mother of Jason and Jason as a child who grabs the machete used to kill her. After that scene, the movie is full of clichés and ridiculous characters and already seen the boy with glasses who is a loser, then black and foreign that have to be ridiculous, the girls have to be naked, the boys always in heat and two normal characters. If I can describe the movie in two words are sex and drugs. The good thing about the film are Jason and the deaths of the characters. At least the dead have not been studied repetitive, but all in the spoken to him. However a disappointing film."}, {"rating": "0", "text": "Mind-numbing garbage that doesn't even try to follow the source material its supposedly remaking."}, {"rating": "3", "text": "Jason Voorhees is back for some more slashing and dicing in Crystal Lake. Michael Bay decides to join Producing Lane 101 when it comes to making this. He made the entire franchise lose its mojo. Too boring, so tired, this Friday the 13th calls My Bloody Valentine to join with the rest of the horrible horror films."}, {"rating": "2", "text": "I'm a huge horror film fan and i liked most of the original Friday the 13th films. But in this modern age, filmmakers seems to have forgotten what horror is all about. Nowadays it's just lots and lots of dreadfully boring gore flicks. Horror films is supposed to be about suspense and scare but those things are almost completely abscent in todays films. And this new tradition continues on in this remake. This movie is a total bore and is not worth more than a rent at best."}, {"rating": "5", "text": "The lousy remake \"Friday the 13th\" is only there for the ones who greatly enjoy slash-and-hack movies that includes boobs and blood. If your not one of them, don't even consider watching this."}, {"rating": "2", "text": "wow this is 80s horror in its truest form... lame . ok i dont know why the hell any one goes to the theater and supports theese kind of **** slasher films. every thing about this movie was predictable . i mean i predicted when every person was gona die atleast 2-5 min before it happend . the only scaryy thing about this film to me is that there are people that like this crap. the only reason i give this 2 points is for the 2 nice sets of breasts i saw in this craptacular **** . its not that i dont like slasher films its just that for the love of god make them more innovative then abunch of dumb (and i emphisize dumb) teenagers go out in the woods have sex and get killed or get drunk and get killed and then just keep doing that despite of all the dead bodies and missing people that do or dont show up."}, {"rating": "8", "text": "I was so cruel to this film back then. But I actually like it.The main 3 characters, Clay, Jenna, and Whitney are all amazing. The new Jason is done well in my opinion, and his movements are intimidating. Some characters and some nudity are annoying, and I don't like how Jenna was killed off at the end, but I still enjoy it."}, {"rating": "1", "text": "um, do we really need a 2009 remake of the 1980 horror movie that had became one of the worst movies ever made? no, we didn't want to, but instead they did. god, those people are just being too stupid and naive seeing this crappy remake."}, {"rating": "6", "text": "Friday the 13th, considering all things, is actually not a bad remake, and may be one of the best Friday the 13th movies out there. Yet despite this, that doesn't mean the movie is anywhere close to perfect with the still same laughable dialogue and jump scares that have become yawnable. Still though, this movie isn't bad and worth a rental."}, {"rating": "0", "text": "I like to write reviews based primarily on how much enjoyment I got from watching the film in question. Therefore, my score of 0 speaks for itself."}, {"rating": "2", "text": "Terrible. Just terrible. This movie embodies everything that is wrong with modern horror movies. The characters weren't likable (complete with cheesy dialogue and bad acting), the story was riddled with plot holes, and, to top it all off, the killer had no motive. Watch it if you're a fan horrid movies, which seems silly to me. Otherwise, stay away. Oh, and it's not scary. At all."}, {"rating": "6", "text": "Disappointing remake...can it be classified as a remake?....or a stand alone movie?  The film has it's good points. Jason is again given human traits; the finding of the hockey mask is an interesting and clever scene; including the bag headed version of Jason was a good touch.  Most of the acting was good, but some was just lousy.\rSome clever, effective kills.  I just wasn't scared watching this film.  Too much sarcasm from the characters, I guess.  The ending was a shocker, cliffhanger, though.\r All in all they could have done better."}, {"rating": "10", "text": "It's more effective than the previous horror films: The Final Destination, Prom Night or any cheap horror movie. It's very actable and horrifying.........................."}, {"rating": "7", "text": "Okay, for the record, I have a soft spot for Friday the 13th movies.  Jason is my favorite slasher from the 80's.  So hearing that they were going to remake the Friday movies got me hyped, a lot.  Perhaps a little too much though, as when I left the movie theater, I was a bit disappointed.  Now I own the movie on Blu-ray so that disappointment didn't last long.  If you liked the other Friday sequels like part 4, then you will probably like this movie.  It's cheesy, slasher fun, full of obnoxious **** that need a good axe to the face.  Enough said."}, {"rating": "3", "text": "Wow this sucked sorta this movie was boring and made fun of the horror name i mean please i could go to camp crystal lake and do much better than this"}, {"rating": "4", "text": "The movie hits an awkward spot where it tries to be campy and scary at the same time and manages to be neither. Best part of the movie are the scenes with boobies in them, and I assure you, calling them \"boobies\" is a bit more accurate than calling them \"breasts\". Worst part is that it is in general too predictable and the killings too plain. For example, the foreshadowing needs to be a little more subtle than \"HEY THIS WOMAN IN THE LOCKET LOOKS LIKE YOU!!\"."}, {"rating": "4", "text": "This movie was pretty terrible. At least the irritating teenagers all got killed. You're actually cheering for Jason throughout the movie."}, {"rating": "10", "text": "This was the first R rated movie I've seen, and I must say it was great. I enjoyed the original, and this was a great reimagining of it. There's plenty of breasts, gore and intense moments sure to keep you on the edge of your seat."}, {"rating": "10", "text": "Now that's entertainment! This movie starts off by despaching all the characters with amazing style in the first 15 minutes - OK, damn short movie, but cool... Well that just setup the plot for the rest of the film which was a blast in the best of the slasher-movie sense. Full-on fun."}, {"rating": "4", "text": "Watchable. Not very entertaining. A bit of a letdown. The best of all though which is not saying much."}, {"rating": "2", "text": "Basically nothing more than another forgettable horror movie remake. Compared with the endless onslaught of horror remakes, this file is pretty comparable, but that's not saying alot as most of these remakes offer very little of anything new, and lack the intensity and effectiveness of the originals. Friday the 13th is no exception. I will say that they did a good job with Jason and there were some good kills in this movie. F13 fans will be pleased at the usual amount of gratuitous fornication taking place in this film (a trademark of F13 movies), but those bells and whistles are the only resemblance to the original movies. Gone are the intense music (even during action/murder scenes), the witty humor, and the charasmatic characters. F13 2009 is nothing more than a shell of Sean Cunningham's original classic. Not the worst movie I've ever seen (I've seen some doosies) but quickly forgotten once I was done watching it. Yawn."}, {"rating": "5", "text": "Friday the 13th is a decent remake of a decent original. This slasher movie is nowhere near as bad as other modern horrors and slashers that destroyed the genre but that doesn't make it a very good movie. The script could have been a lot better, contained a lot more substance than it did and porbably went something like - Man in mask kills teen one, kills teen two and continues killing teens until he eventually fails, dies and somehow comes back to life but it's the varying amount of ways he kills his victims that redeem this movie, slightly."}, {"rating": "8", "text": "Why do people say in many horror remakes \"This isn't as bad as Friday the 13th remake.\" What is it about this one that is so terrible? I watched all 11 Jason movies and this REBOOT, not remake. If this was a remake, then Jason wouldn't be in this one. Anyways, what I hear most is \"The guy doesn't even look like Jason Voorhees.\" Let's describe him shall we, this was before he was a zombie so we're looking at Part 2-4. He has a disfigured head, wears a sack on his head till he gets a hockey mask, and he carries a machete. In the remake, he looks just like that. \"The other characters are stupid and are meant to die.\" Guys, did you even watch the other movies...in fact, have you seen any slasher movies? Every character in the Friday the 13th movies are all disposable for Jason to kill, except the main character. This takes place in Crystal Lake, just like the original movies. Jason takes his time killing people, just like the original movies. Most importantly, Jason didn't die. Do I have to mention about the original movies again? What is it about this movie that pissed people off and say its the worst remake. It didn't copy and paste anything and it wasn't anything different from the original movies. What I saw was a Friday the 13th movie."}, {"rating": "10", "text": "So it's not everyone's cup of tea, it' not the best story line, but it is rememberable... Jason Voohees has got to be one of the best horror characters ever invented! It's genius, it's legendary, it's Friday The 13th!"}, {"rating": "6", "text": "For all you complaining about it being a remake and waaa waaaa shut the hell up, if you dont like remakes then don't watch the damn movie, plain and simple!!! And im sorry but this is better than most of the absurb sequels that followed the original, after friday the 13th pt 2, the franchise pretty much stunk. I loved the first 2 movies, but they were not suspenseful, they were just hack and slash. This was a good remake, it is what you would expect from a Jason movie, except he runs(which was nice) instead of walking behind you and then miraciously appearing right in front of you(teleportation much?) If you dont like remakes then dont watch it, no one is forcing you too!"}, {"rating": "6", "text": "Not a great movie, but it's a good movie to see if any one night with friends. Some scenes are very tense and screenplay is reasonably good, is not an exceptional film, but worth watching."}, {"rating": "8", "text": "Shockingly A Good Remake!"}, {"rating": "6", "text": "It's okay, not as bad as people make it out to be. Nonetheless, it still horribly acted by most of the cast but Jared Padalecki and Danielle Panabaker and some of the story elements are almost laughably bad. It still plays out like an 80's horror movie, tons of sex and drugs, teens getting murdered one by one, which should please fans of the original (which was also laughably bad)"}, {"rating": "7", "text": "Un remake bastante sólido y efectivo, creo que supera bastante a la versión original, pero en el fondo no es una película que aporte algo nuevo a la franquicia teniendo los mismos elementos y fórmulas de las entregas previas."}, {"rating": "4", "text": "I expected this movie to be scarier, but it was not. Why am I not surprised anyway ? The series have such a bad reputation. The genre of slasher horror movies has lost its success and I'm beginning to know why now. I'm basically a horror movie watcher, but this didn't really scare me, the whole plot was so flat and predictable. The actors are ok though."}, {"rating": "8", "text": "I came into this not expecting a whole lot but I was happily suprised as to how good this movie is. I don't understand why the critics are saying the kills are not unique. They are phenonal! There were kills in this movie that i've never seen before and i watch a lot of horror movies. The acting wasn't great but padalecki and righetti as the leads were very good as well as ms. panabaker. The rest served their purpose. Mears as Jason was among the best to ever play him. The visuals were specatcular and I was very impressed with the whole movie. The beginning was awesome and grabbed my attention and held throughout the whole thing. Nispel did a great job directing and a horror movie has to be pretty good for me to take the time to post a review b/c most of the newer horror movies and remakes have been terrible, I love the Halloween movies more than any other but this was much better than the halloween remake and I really liked what Rob Zombie did with that film but Friday the 13th was much better. I encourage everyone to go and see this movie and decide for themselves. It will satisfy causual horror fans as well as friday the 13th fans."}, {"rating": "2", "text": "Giving the few jumpy moments when i saw this film, they have managed to turn a cult classic series into a soft porn teen slasher film. Not even worth downloading... Predictable story lines, rubbish acting and a sense of repetition.."}, {"rating": "2", "text": "Very forgettable, absolutely no suspense. about 11 out of the 13 kills are painfully predictable. the movie was so short only because the basic plot couldn't have possibly gone any further; nothing was added to the original story. i think users are giving the movie high ratings based on the fact that they managed to finish the film without passing out of leaving the theatre. semi-entertaining and a great movie are 2 different things"}, {"rating": "9", "text": "this movie was fun to watch! even though it was 2 hrs. long, this film kept me interested all the way to the end! The kill scenes were good, every last one of them , reminds me of the campy-grindhouse trailers."}, {"rating": "0", "text": "Uninspired and pointless."}, {"rating": "10", "text": "Welcome back to Crystal Lake in a chilling re-imagining of the classic horror film. Searching for his missing sister, Clay Miller heads up to the eerie woods of legendary Crystal Lake. Against the advice of police and cautions from the locals, Clay pursues what few leads he has in the search for his missing sister, Whitney, with the help of Jenna, a young woman he meets among a group of college kids up for an all-thrills weekend. But they are all about to find much more than they bargained for. Little do they know, they've entered the domain of Jason Voorhees."}, {"rating": "6", "text": "People friday the 13th 12 times before, on the first few it was called night mare on elm street so i think they people in Hollywood are just running out off ideas that they have to mess with the old classics."}, {"rating": "6", "text": "Although it was predictable and had horrible acting, it was a fun movie to watch with several friends. A good way to spend an afternoon."}, {"rating": "8", "text": "I thought this movie was actually quite enjoyable, much more than the earlier ones that were so bad they were almost comedies, this jason film brings him back with more then just shock and awe, but with an attitude and the real reason to see it isn't just for the nostalgia, it's for slasher film fans to remember why they loved seeing flasher films in the first place."}, {"rating": "8", "text": "Something needs to be made clear. This really is not a horror movie. Jason movies never really have been. Your more likely to hear cheers from the audience than screams. If you want to see oversexed potheads die in fun and interesting ways than you'll enjoy this movie. If you came for giggles you'll enjoy this movie. If you came for fear you will be sorely disappointed. Q.E.D."}, {"rating": "0", "text": "I've been a fan of horror movies for over 40 years and have learned to take \"critics\" reviews with the proverbial \"grain of salt\" I really wasn't interested in seeing this \"remake\", but after reading what the users were saying I went to see it with good expectations. What a major dissapointment and waste of precious time! I don't understand how so many users on this site could give this crap such positive reviews. This time the critics and user Mike P got it right. Uninspired and pointless indeed! Stay away from and stop supporting garbage like this which insults the intelligence of any and all fans of this genre."}, {"rating": "7", "text": "I went to this movie thinking it was going to be terrible and I was wrong. It was surprisingly well-done (not like that poor excuse of a movie \"Prom Night\") and well-paced. The acting was typical horror movie acting (in other words, not oscar -worthy by all means). But in the end the movie delivers."}, {"rating": "9", "text": "True, the new Friday the 13th movie wasn't any different from the other ones other than more sex and gore, but that's why I had so much fun watching this."}, {"rating": "5", "text": "Out of all the \"re-makes\" this one was the best, just the right amount of stupid teen fun and gore. i don't know if it was my t.v. but it was a bit to dark. other then that good movie."}, {"rating": "9", "text": "This remake is more create and innovative aside from the older films and creates a scary and suspencful atmosphere. Jason is far different in \"personality\" than the last movies and acts more human and insane than before. There are things that I would've liked to change, but in general this is a great movie for pure entertainment. Plus an amazing ending."}], "recommendations": ["a_nightmare_on_elm_street", "the_texas_chainsaw_massacre_the_beginning", "see_no_evil", "venom", "the_babysitter_killer_queen", "rings", "jason_x", "drag_me_to_hell", "halloween_resurrection", "cabin_fever", "the_messengers", "the_bye_bye_man", "jason_goes_to_hell_the_final_friday", "texas_chainsaw_3d", "the_grudge_2", "fright_night", "dead_silence", "halloween_iii_season_of_the_witch", "the_amityville_horror", "ouija", "halloween_ii", "the_texas_chainsaw_massacre", "cult_of_chucky", "scream_4", "wish_upon"]}