{
  "id": 2077,
  "title": "Friday the 13th: A New Beginning",
  "starring": [
    "Melanie Kinnaman",
    "John Shepherd"
  ],
  "runtime": 92,
  "genre": [
    "Horror",
    "Mystery"
  ],
  "description": "Homicidal maniac Jason returns from the grave to cause more bloody mayhem. Young Tommy may have escaped from Crystal Lake, but he’s still haunted by the gruesome events that happened there. When gory murders start happening at the secluded halfway house for troubled teens where he now lives, it seems like his nightmarish nemesis, Jason, is back for more sadistic slaughters.",
  "releaseYear": "1985",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sRA9Tb4aQz8EZlbX7xmh8WbzisW.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.318181818181818,
    "ending": 5.454545454545454,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The kills are not that great and yes, this is the film with the copycat killer, but a few of the kills are great, most of the new character are fun, and Tommy is given another great actor.I don't mind the twist, as I see it as Jason's impact is so large and inspirational someone copied him."
    },
    {
      "rating": "8",
      "text": "Friday the 13th A New Beginning I am genuine how surprised this movie was too be the stuff i heard is one of people's least fav to me I think the good is Jason which is cool like the mask in like a greyish tags and blueish tags which is odd but different you will know why when you see the movie why it is like that I enjoy Tommy Jarvis in this but he does not do anything which annoys me because I get the whole be is scared of Jason or something like that and having issues mentaly but it goes no where in this movie ok the mixed are the kills there is some cool ones but most kills in this film are cut aways so annoying like you get excited for a kill than you barley see it which is so annoying I think the negatives is they do way too much nudity wayyy to much and they don't try to build any characters either kills like every character possible in the movie which is so odd to do in a 5th movie or any Friday the 13th movies in general so all round i enjoyable this flick it is different kinda still could of been way better like I mentioned they did not do a lot of good in this mainly because to make another movie which does suck because had some good ideas fall so flat so I give Friday the 13th A New Beginning a B-"
    },
    {
      "rating": "3",
      "text": "La oveja negra de la saga por buenas razones, desde un principio se nota que no es Jason sino el paramedico el que comete los asesinatos, lo cual hace que la película se sienta predecible y carente de estilo, si, los asesinatos tienen el patrón de Jason, pero simplemente NO es el."
    },
    {
      "rating": "6",
      "text": "*SPOILERS* So I think everyone pretty much hated this one when it first came out. It's sort of like the Halloween 3 of the series just alot better mostly because the film still delivers on the tropes that are expected. This time around young Tommy is grown and he is crazy and fine. Still traumatized from the events of the last film he's been put in a house for troubled youth by Camp Crystal Lake (like that makes sense). He's also learned self defense and is still into FX. Well a killer emerges after one of the clients is brutally murdered by the ultra hot bad boy Mark Venturini of Return of the Living Dead. The paramedics come to pick up the pieces and spoiler alert one happens to be his father. His retaliation= He dresses up as Jason and tries to kill everyone. It's a lame twist but the kills are great and the boys are smoking. In the end it's all just overly mediocre and very trashy but it's aged well over the years and is far more entertaining than it was when it initially was released.3/5"
    },
    {
      "rating": "5",
      "text": "It's an okay film with a handful of likable characters. Did try some new concepts for once."
    },
    {
      "rating": "3",
      "text": "friday the 13th part v a new beginning. this is the second film of the Tommy Jarvis timeline following from last film and that's the disappointing thing the previous film was really good and this one is terrible here's the things I like about it. some of the comedy relief characters here's things I did not like. 1 the characters man they where bad even the Tommy Jarvis character which I loved in the previous film 2 the story make up effects now anyone can do better make up them me but one of the kills was the machete stabbing in to a pillow. 3 the story this movies story is all over the place any way that's the review thanks for reading overall I give this film 0.5/5 or 1/10"
    },
    {
      "rating": "5",
      "text": "The adult version of Tommy Jarvis appears and that's a big plus for me. I like the unique take on Jason with this one and thought the kills were solid, As was the cast. It's definitely the kind of movie that grows on you but it's far from perfect."
    },
    {
      "rating": "5",
      "text": "Is This Really Necessary?Though it still has it's scares and kills, This entry into the franchise feels very bland and unnecessary considering It’s predecessor is named “The Final Chapter”."
    },
    {
      "rating": "3",
      "text": "As far as I'm concerned Jason should have stayed dead and buried until 1986 when Tom McLoughlin gave us one of the best films in this roller coaster of a franchise. After four films the fifth decided to present us with a new beginning of the franchise... by doing exactly what the previous films did only with inferior results. If I recall correctly A new beginning actually has the highest body count of any film in the franchise, this is apparently because some of the higher ups felt that there should be a scare of some sort every few minutes. This results in most of the death scenes feeling incredibly rushed and put together haphazardly in the name of exploitation. Obviously the previous films were made with similar intent, but for my money they were better in nearly every aspect. With so many kills all back to back the tension of Jason being on screen is quickly diminished. It doesn't help that he is killing off some of the worst characters in slasher movie history. Thank god most of them die because I never want to see them again. Even Tommy Jarvis, who is meant to be our heroine in this film, is horribly acted and not at all convincing. The film's ending only makes these problems even worse. I suppose I shouldn't spoil it but rest assured you will be disappointed. Perhaps the biggest sin is that with a better written movie with more convincing characters such an ending could have been very effective. I would hope that no innocent man, woman, child or pet goldfish would ever watch this film with any expectations whatsoever. But what bothers me more so than the film itself is that I've hear some call it a hidden gem, a film so horrendous that it is actually entertaining. I call it trash."
    },
    {
      "rating": "5",
      "text": "I identified plenty reasons to enjoy this slasher movie. I like this new version of Jason. The story takes the time to set up and to introduce the different characters. John Shepherd's acting (playing as Tommy) is awesome. Its eyes allowed me to feel distinct emotions from fear to horror. Shavar Ross as Reggie is amazing too and he brings (eventually!) a bit of colour in the overall 'Friday the 13th' cast. Other protagonists are okay, some better and more iconic than the others but surprisingly I felt more empathy in overall for the cast of this movie than for the other ones that I already saw.It's however sad to observe the storyline leaves a lot to be desired. Even if, as I wrote, I found the beginning solid I can't say the same for the ending and especially the last scenes which leave a bad taste of an unfinished product. No spoil but I found the plot twist amazing despite the unstructured side of the conclusion. I am truly concerned and worried about the fact that almost all the 'Friday the 13th' last scenes up until this point end up the same way: a chase in the dark woods under the rain. How many movie directors and producers do nourrish the same fantasies of desperate women trying to escape death ?Obviously they couldn't help but to showcase a bit of nudity, as it seems to be one of the main 'Friday the 13th' characteristics. Here I found this was okay, not that invasive nor forced.Soundtrack is great, even if too noisy from time to time, and often for nothing that thrilling. Lighting and environment are great. The pace is very good speaking for the first half. The rest is way too messy. Kills are uneven: some are great and 'convenient' as many others totally lack in realism. The level of makeup remains to be worked on. Still a great testimony of 80s slasher genre."
    },
    {
      "rating": "4",
      "text": "Tommy from the last one is growing up in an institution of some kind but Jason starts killing his fellow patients but it might've just been Tommy doing it, not quite sure."
    },
    {
      "rating": "9",
      "text": "If The Final Chapter has too many and actually almost every characters on that film so unlikeable, A New Beginning has so many very likeable characters and i love it, again since the first one i still don't have a likeable usual couples characters in Friday The 13th series, including this one, and that's the only two that i still don't like but the rest is likeable and it's more great because A New Beginning set up a completely new type of story, i don't know if they gonna repeat this one in later movie, i hope not, and i like this new story, i enjoy it, A New Beginning kills is not as brutal as all the previous one but again because of a likeable characters and good story it make it better than ever, now there is still some cheesy and silly moment but in here it's not those type of cheesy and sillyness that are bad, i found it funny and entertaining, i enjoy almost everything in A New Beginning, a drastic step up from all previous movie especially The Final Chapter which i hate to death, A New Beginning fills with a lot of likeable characters that make it more fun to watch and also good enjoyable story and fun final battle between likeable characters and Jason, silly and cheesy in a very entertaining way and overall Friday The 13th: A New Beginning is the best in the franchise so far."
    },
    {
      "rating": "0",
      "text": "I created an account just to tell everyone how much this movie sucks. It's not even really a Friday the 13th movie. Jason isn't even in it. The killer is some guy named \"Roy\". I'm an avid Friday the 13th fan, but pass this one up."
    },
    {
      "rating": "6",
      "text": "I remember not digging Friday the 13th A New Beginning the first time watching it. There are two main reasons for this. One is the twist at the end. Wasn’t a fan. It seems like a lot of slasher franchise’s go through this at least once. Yes, I’m trying to tiptoe around the spoiler even though this movie has been out for 36 years! The other reason is the character of teenage Tommy was just bad.PLOTOur survivor Tommy, from Friday the 13th The Final Chapter, has a dream of Jason being resurrected by two idiots. Luckily it was a dream, or was it? We have a 17 year old Tommy sent to a home for troubled teens. After one of the teens kills another resident, more brutal killings happen in and around this home. All clues lead to Jason having returned.MY THOUGHTSOh boy! Where to begin with this one. Up to this point in the series, A New Beginning has the most kills and the most nudity. We get 21 kills (including the two kills in Tommy’s dream). The issue with the kills is that most of the violence of the kills are off screen and we only see the after effects. The kills consisted of slitting throats, stabbings, and a couple of eye gouging. I didn’t find any to be something outstanding. I did like Junior’s head being severed just because he was so annoying!Next up is the nudity. Three of the actresses show off their breasts in this movie as well as some butt shots. Supposedly the sex scene between Tina (Deborah Voorhees) and Eddie (John Robert Dixon) was 3 minutes long but the director was forced to cut it down to 10 seconds because of the MPAA (Boo!).The acting and characters were average at best. I liked Reggie (Shavar Ross). Usually kids in horror movies are annoying and I didn’t find him annoying at all. And Violet (Tiffany Helm) has a dance that rivals Jimmy’s (Crispin Glover) from The Final Chapter.My biggest issue with the acting is John Shepherd as Tommy. I know that Tommy would be suffering from PTSD after his experience. And I know that John Shepherd spent a lot of time researching how people would react, but I just didn’t like how he portrayed Tommy. A possible reason is that Tommy (excluding when Corey Feldman is on screen and anytime Tommy laughs or screams) only says 24 words in the entire movie! I felt like this portrayal is one of the main reasons I rank this movie as low as I do.Now comes the other main issue I have with Friday the 13th A New Beginning. The killer. The movie heavily implies that Tommy Jarvis is so traumatized by his experience, that he starts killing people as Jason. But after watching the ending we know this not to be true. No real clues throughout the movie to hint at the killer. We just get a picture in the wallet with the Sheriff explaining it. Maybe if they had put more clues throughout the movie (and not so subtle you can’t pick up on it) it wouldn’t bother me as much. Don’t get me started with the second ending of the movie with Tommy becoming Jason. I’m so glad they dropped that plotline in the rest of the movies.This is the first film in the series where Jason is actually referred to by his full name: Jason Voorhees.The film takes place in 1989, 5 years after Friday the 13th: The Final Chapter.Coincidentally, Deborah Voorhees shares her real surname with Jason.Mark Venturini and Miguel A. Núñez Jr. co-starred in The Return of the Living Dead (1985), another 1985 horror movie.The hockey mask in this film has blue markings on it instead of red ones, foreshadowing that the real killer isn’t Jason at all.If you want to see my other Friday the 13th reviews, click here: Friday the 13th Franchise.Let’s get into the rankings:Kills/Blood/Gore: 3/5Sex/Nudity: 4/5Scare factor: 2/5Enjoyment factor: 2.5/5My Rank: 2.8/5IMDB: 4.8/10Rotten Tomatoes: critics: 1.8/10 audience: 2.6/10Letterboxd: 2.4/5"
    },
    {
      "rating": "2",
      "text": "A step up in vulgarity in humor, at least now we are getting some unintentional comedy. Some poor and unfortunate mental health portrayals. Overall the most boring kills in the series so far, and it makes no sense."
    }
  ]
}