{
  "id": 2640,
  "title": "From Hell",
  "starring": [
    "Johnny Depp",
    "Heather Graham"
  ],
  "runtime": 122,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "Frederick Abberline is an opium-huffing inspector from Scotland Yard who falls for one of Jack the Ripper's prostitute targets in this Hughes brothers adaption of a graphic novel that posits the Ripper's true identity.",
  "releaseYear": "2001",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/t2WpWM8nBO4sULXr2bDfNEt4qgr.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 7.3,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Was this supposed to be a detective film, a thriller, or a horror story? Because it fails at all three at them. Johnny Depp has been miscast into a bland and uninteresting character while all other characters are simply uninteresting to begin with. Not bad, but completely forgettable."
    },
    {
      "rating": "10",
      "text": "Watch it!!! Perfect!!!! A masterpiece!!!! It's one of my favourite thrillers!!!! Johnny Depp is always perfect in his movies!!! He has a gift!!!!! He's the best actor in the world!"
    },
    {
      "rating": "5",
      "text": "From Hell would almost be interesting if it wasn't for the bungled love story, awful accents and empty conclusion. There are a few nice things about this Jack the Ripper flick but overall it's a mess."
    },
    {
      "rating": "10",
      "text": "Excelente Filme,Ótimo elenco,roteiro,direção e produção.\rCom atuações Brilhantes de Johnny Depp,Ian Holm,Heather Graham,Robbie Coltrane e Jason Flemying.\rSuper Suspense,cheio de vida,supresas e terror.\rBrilhante Filme"
    },
    {
      "rating": "7",
      "text": "The atmosphere in 'From Hell' creates this stomach turning, graphic and this gothic universe where the Ripper lives, and that's why it gave this movie a unique look and feel to it. Johnny Depp once again brings a solid performance in this movie and the overall film is a decent watch."
    },
    {
      "rating": "10",
      "text": "Curti,Muito bom,Excelente,Obra-prima E Perfeição. Eu acho que esses 31 individuos que deram votos negativos de 0 a 3 são retardados que não sabem o que é história e roteiro de qualidade podiam morrer."
    },
    {
      "rating": "10",
      "text": "Mega-Ultra-Hiper Filmaço... Engraçado a dois dias atrás tinha 31 cidadãos que votaram negativo isto é de 0 a 3,aumentou dois retardados em apenas dois dias."
    },
    {
      "rating": "8",
      "text": "I went into this having only seen 'The Book of Eli' by these directors, The Hughes Brothers. I quite liked that film, although I did feel their vivacious stylizations interfered with the telling of the story. Seeing this earlier film of theirs confirmed that suspicion, though it's still a fine film. Though Johnny Depp (the brothers' 5th choice for the lead) does a fine job as the film's protagonist (I haven't read Alan Moore's graphic novel yet, so I can't say how this filmic adaptation compares), it certainly would have been interesting to see how any of their previous choices would have done (in order of their preference): Daniel Day-Lewis, Sean Connery, Jude Law and Brad Pitt (but especially either of the first two). It has a fine supporting cast, is beautiful to look at and is consistently intriguing. I especially liked Heather Graham (I think this is solidly amongst her best work), Ian Holm, Robbie Coltrane and, most significantly, Katlin Cartlidge. Boy, do I ever miss her in films made ever since."
    },
    {
      "rating": "10",
      "text": "................................................................................................................................................................Masterpiece Movie Everything Is Masterpiece the script, the acting, the end.... Who give negative reviews for this movie don't know what is a Great Script"
    },
    {
      "rating": "0",
      "text": "This is a perfect example of both the writers and directors having absolutely no idea wtf they're doing. From Hell is an awkward blend of three genres (detective, horror and thriller) and none of it works well together. It's poorly paced, written and directed. And considering how acclaimed the source material was, This movie does nothing to even come close to living up to it. It's just a total failure across the board."
    },
    {
      "rating": "10",
      "text": "........................................................................................................................................................................................................................great"
    },
    {
      "rating": "4",
      "text": "The problem I had with From Hell was that it felt like I was watching a movie about Jack the Ripper, set in London. I never got that immersive cinematic experience. While the production values were fine, the way things came off reminded me too much of History Channel dramatizations. I'd put that down to overacting on the part of the supporting cast; Heather Graham and Johnny Depp were fine, as was the directing. I must admit that I ended up returning the disc early to get to the next one in my queue. I read spoilers for the rest of the film and the story sounds much more interesting than what I had seen up to that point."
    },
    {
      "rating": "10",
      "text": "An underrated masterpiece, that show one of most interestings point of views of the murders of \"Jack the Ripper\" in the end of 19th century in london.From Hell is based on the book of influent writer Alan Moore, and shows the reason of one of many suspects in \"Jack the Ripper Murders\".The Script of the movie is very well written, with a great directing,and the actors are too another great goal on the movie.Johnny Depp commands the movie with a Great performance as Inspector Frederick Abberline, Robbie Coltrane is Great as sergeant assistant of Depp CharacterIan Holm is Perfect Brilliant as Sir William Gull, (Jack the Ripper himself)Heather Graham is Amazing too, as one of young group prostitute that jack has be killed, this one ends to have an affair with Depp Character while the two runs against the time, to discover Jack identity before The Ripper killed she and his friends.Perfect movie, perfect pace and yet a perfect end and conclusion, A must see movie if you like a great thriller investigative and if you are interested the story of \"Jack The Ripper\",but much people non-sense gets dissapointing with the movie, expected the to be a horror movie, sorry but it isn't the premise of the movie, is a Thriller investigative and works very well in this way that is the way that movie should be and is."
    },
    {
      "rating": "10",
      "text": "......................................................................................................................................................................Great writing and performances"
    },
    {
      "rating": "7",
      "text": "Gaslight murder mystery concerning the efforts from a SY inspector for hunt and find out who is the infamous murder Jack the ripper. Haunting atmosphere, I admit it. I don't know the original book of Alan Moore (Watchmen, The killing joke), but the screenplay is not so disastrous as The League of Extraordinary."
    },
    {
      "rating": "10",
      "text": "What People Want???? A Horror Movie????The movie is about an investigation, and super convincing by the way. Read in synopsis before wanted an horror movie!!!!, the haters can laugh, but the movie is convincing ever in the murder scenes the horror scenes, Great acting, great script! An great underrated movie!!!"
    },
    {
      "rating": "2",
      "text": "The scrutiny is left all the way to our imagination and when the time comes to answer, it never matches the description we had in our head.From HellThe Hughes Brothers, the directors, aren't actually living up to the reputation of the Brothers' show. Not to say that every of such duos have given us the best that there is out there. But if you look closely, you will find one quality embedded in them, in their work. And it is that they are entertaining. They'll hook you in and convince you, no matter how outrightly wrong and questioning their methods would be. And this is really annoying for the makers, since they could never arrest you with their thrills. And to top it off, the film claims to be of horror genre and not for a single moment are you ever enchanted.So shocking, disenchanting the viewers is a secondary element. From script to execution, this gossip-y gullible town thinks similar of its audience who is told to feed off from those same elements. Now one going through those same events than the one's observing would definitely be more into it. And even that is not the case here. Addition to that, these \"ones\" that are told to go through and are in it, also doesn't seem to enjoy.Even the actors, the performance feels too effortful to ever be taken seriously. Johnny Depp, the sung, off-the-boundaries, police detective, is way too reserved to ever put itself into danger. The stakes never communicates with us. And it is primarily because these performers won't care for any of the ongoing fiascos in this spooky town. How are we then supposed to buy into the gossip that they are numb towards. Why would we invest on something so formal and subjectively pretentious. From Hell is from hell. The methods, the laws and the routine is something that would never appeal to us. Why bother, then? is the final reaction we have as we bid goodbye to this doomed town."
    },
    {
      "rating": "8",
      "text": "This film, directed by The Hughes Brothers, has Johnny Depp in the main role and deals with the story of Jack the Ripper, probably one of the most successful killers of all time, as not only was never caught and tried as, even today, we don't know what their true identity. The film plays with this situation to show us one of the most famous theories about the killer's identity: that would be a figure of British royalty or someone close to the ruling circles. The film also shows us the misery and poverty in which the lower classes of London lived, in a time when being poor often meant to live in the limits of the law to survive, and numb the pain of life in abuse of drugs or alcohol. Depp plays one of the inspectors highlighted by Scotland Yard to investigate and arrest the mysterious killer, who only kills prostitutes but that is so fierce and so meticulously bloody that quickly spread terror through the streets of Whitechapell. The actor shone in the role, managing to give the character a contradictory personality, spread in their desire to do justice, in the way he falls in love and in the addictions he feeds.A film recommended for all who enjoy a good cop movie, with a minimum expenditure of bullets and bloodshed."
    }
  ],
  "recommendations": [
    "insomnia",
    "primal_fear",
    "knives_out",
    "the_raven",
    "the_lincoln_lawyer",
    "the_fugitive",
    "the_frozen_ground",
    "morgan",
    "frequency",
    "breach",
    "child_44",
    "arbitrage",
    "donnie_brasco",
    "inside_man",
    "the_iceman",
    "zodiac",
    "chinatown",
    "the_godfather_part_iii",
    "conspiracy_theory",
    "sherlock_holmes",
    "the_little_things",
    "black_mass",
    "lucky_number_slevin",
    "money_monster",
    "secret_window"
  ]
}