{"id": 2365, "title": "From Dusk Till Dawn", "starring": ["George Clooney", "Quentin Tarantino"], "runtime": 108, "genre": ["Horror", "Action", "Thriller", "Crime"], "description": "Seth Gecko and his younger brother Richard are on the run after a bloody bank robbery in Texas. They escape across the border into Mexico and will be home-free the next morning, when they pay off the local kingpin. They just have to survive 'from dusk till dawn' at the rendezvous point, which turns out to be a Hell of a strip joint.", "releaseYear": "1996", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/sV3kIAmvJ9tPz4Lq5fuf9LLMxte.jpg", "categories": {"plot": 7.1, "acting": 7.083333333333333, "ending": 8.6, "soundtrack": 7.4, "cinematography": 5.666666666666667, "familyFriendly": 3.0, "funny": 8.333333333333334, "action": 4.8}, "reviews": [{"rating": "10", "text": "To me, It's incredibly rare for a movie to not only to suck you in but to keep you interested and entertained through out and this movie really did it for me. I loved it."}, {"rating": "9", "text": "This movie has cult status for some and I see why. It is famous for having Quentin Tarantino as actor, George Clooney playing not a good / heroic character and the Salma Hayek scene that even Rammstein covered in one of their music videos. There is also a dividing twist in the movie that is hated by some and praised by others and sadly I cant give you an advise here because of spoilers. I can however say it is one of the movies you either love or hate. For me this twist made the movie more unique and appealing as I have not seen something like this before (Even M. Night Shyamalan cant compete here). Story: The criminal brothers Richard and Seth Gecko are on the run from the police to Mexico after they broke out of prison and robbed a bank while the media enjoys this for the audience ratings (Outlaw heroes). They run into the former priest Jacob, his daughter and adopted son in a motel. So starts the adventure unlike anyone before. The story is fully entertaining and will become something you will never expect. I truly enjoyed it but I repeat my warning that the twist is what many say ruined the movie for them. For me it makes the movie memorable and discuss-worthy. I think this does not even change if you hate the movie. As a sidenote while Robert Rodriguez is the director the script was done by Quentin Tarantino so you can count it as Tarantino film too. Lastly I want to praise the dark humor of the movie here. Actors: We got a good cast here. Lets begin with George Clooney as Seth Gecko. I think he enjoys the chance to be not typecast as the hero / good character. He delivers his role excellent. Then we have Quentin Tarantino as Richard Gecko. He is now on the other side of the camera and it answers the question if a great director is also a good actor with a no. But I must admit he is quite entertaining and so I will give him a free pass. Harvey Keitel plays Jacob Fuller and is probably the best actor in the movie in a sneaking way. Unforgettable is Selma Hayeks performance as Santanico Pandemonium (That is not a typo). Like I said there are countless homages and parodies for the scene including the Rammstein one. Lastly I want to praise Ernest Liu as Scott Fuller, Juliette Lewis as Kate Fuller and of cause Danny Trejo as Razor Charlie. In total we have a good performance and all characters work as well as intended. Presentation: It has the style you expect from a mixture from Quentin Tarantino and Robert Rodriguez. Everything looks convincing and enhances the atmosphere. The soundtrack is excellent and has tracks from The Mavericks, Tito & Tarantula and ZZ Top to name a few. I will say again it enhances the atmosphere. Overall this is a dividing movie which I already put in the love or hate category. For me it works well and is entertaining. I recommend it alone for its strength, humor and being able to discuss it with friends but warn you that it is not for everyone. You can find it silly or hate it with passion too and to be fair I see the point and its validity."}, {"rating": "10", "text": "The famous line, \"No thanks, I've already had a wife\", was improvised by George Clooney. Director Robert Rodriguez never intended it to be in the final cut, but after the studio included the line in a trailer, he felt obliged to include it in the film"}, {"rating": "10", "text": "AlvaradoKTAJun 16, 2014Even on such a low budget, this is the best in the Mexico-trilogy films. Well paced from the opening title to the to be continued promise, every scene has a humorous note. An original script with a good amount of shoot outs, this film"}, {"rating": "10", "text": "One of my favorite Tarantino movies ever. I'm an incredibly big Tarantino fan and this movie is one of his best works. Also 2 of my friends love this movie as much as I do. Great film for Tarantino fans.Fun Fact: The film was written by Quentin Tarantino, but the movie was directed by Robert Rodriguez, which is one of Tarantino's long-time friends"}, {"rating": "10", "text": "Salma Hayek has a real fear of snakes and had always refused to be near them. Naturally when she read the script, she knew her phobia would prevent her from taking the part. Robert Rodriguez conned her into thinking that Madonna was ready to nab the part instead so Hayek spent two months with therapists to overcome her fear."}, {"rating": "10", "text": "There was a special make-up effect in which one of the stripper-vampires has her stomach open into a large mouth. She shoves a bar attendant's head into the large mouth and bites it off. The effect was so graphic that Quentin Tarantino didn't even want to see it. The scene can be accessed in the deleted scenes section on the Special Edition DVD."}, {"rating": "10", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙[][][][][][][][][][][][][][][][][][][][][][][][][][][][]"}, {"rating": "10", "text": "&;&;&;&;&;&;&;&;&;&;&;&;&;&;&&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷$÷$÷$$$$$÷$÷%=$÷%=$÷$÷$÷$÷%÷$÷$$÷÷$$÷$÷$÷$÷$÷$÷$÷$÷$÷÷$÷"}, {"rating": "10", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"}, {"rating": "10", "text": "After his hand has been shot, Richie can't use it. But while Seth is checking into the motel he is cleaning his glasses with the blown up hand."}, {"rating": "10", "text": "jbhvyfuguggjjggjjbjgjgjgjg,,,,,,,,,......,,,,,``````````++++++×××××÷÷÷÷÷=====/////________:::⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"}, {"rating": "10", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■●■●$$$$$$$$$$$$$$$$$$$$$$$$$%&%&%&%&%&%&%&%&%&%&%&%&%&"}, {"rating": "10", "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"}, {"rating": "10", "text": "A brilliant Horror crime thriller !!!!!I rank this move alongside The Lost Boys and Interview With The Vampire as one of the best vampire films ever made.I was very fortunate enough here in Australia that I did not hear much about this movie upon release. My friend rented it out from our local video store and bought it over to my place. Back then, we only had blank movie covers for new releases when they came out so you didn't see the cover or have the blurb on the back. My mate just said you have to watch this.I was loving the film as it was and it went it got to the big reveal midway through the film, it blew my mind. From then on it was all gore and vampire violence and I was cheering. I was not expecting that at all.The movie is very violent but the violence is also met with a lot of humor. I am not the biggest fan of George Clooney, but his character of Seth Gecko remains one of my favorite bad asses in cinema history.If you love vampire movies with a lot of gore and humour then you must check this out. There is a lot of hilarious quotes to be have which I have quoted several tiles over the years. To me, it's one of the last good vampire movies to be made in years and it came out in 1996.The movie is directed by Robert Rodriquez who is an amazing director and it's based on a screenplay by Quentin Tarantino who also stars in the movie as Seth's sleazy murderous brother."}, {"rating": "10", "text": "Suitably sleazy entertainment. The first half of the movie is a grindhouse style crime-thriller, while the second is an over-the-top and goofy vampire movie that doesn't take itself seriously at all and is filled with extremely gory kills. The only things that stay the same throughout are that it's completely vulgar and it's main characters are violent and deranged.\r It can be stupid, offensive, or at times just downright gross. Surprisingly though that's what makes it fun. Watching it turn from a crime-thriller with two deranged leads (Clooney and Tarantino himself) into a dumb, b-movie horror flick feels surprisingly natural, and it's just overall a decent amount of trashy and stupid fun. It's definitely not for everyone, but there's something about it that still makes it worth a look. Just keep in mind this is far from high-art."}, {"rating": "10", "text": "_/=÷×+@#$%^&*()?,.!();:\"'□`~|{}[]♧◇¿¡》♡《♤¤■•□°●⊙○☆▪°°°°°°[♡■|○>•■°◇♤*;&:$==#&........"}, {"rating": "10", "text": "George Clooney and Quentin Tarantino shine in this great vampire flick. Starts as a movie about two criminals on the run. The thing about this movie is it the first and second halves could be their own films. The first half is a interesting tale of two brothers in crime. About midway it turns into a highly entertaining vampire movie. Great quotable dialogue, memorable scenes, some decent performances and vampires. What more could you want?"}, {"rating": "10", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:::::::::::::::::::::::::::::\";\";\";\";\";\";\";\";\";\";\";\";\";\""}, {"rating": "10", "text": "●●●●●●●■■■■■■■■●●●》》》》》¡¡¡¡¡{}{}{}[][][][],_,_,_,_,_,,.,.,.,.+×÷=+××÷+×÷=+\",\",\",\",\",:.:.\".\".\".°¡¡¡"}, {"rating": "10", "text": "It's Tarantino's take on \"a B movie\". You have his moving story plot, top actors...  and lines and scenes so overly campy, it becomes hilarious. To appreciate the silliness, inebriation is recommended."}, {"rating": "9", "text": "This is just such a fantastic bloke film. Grab a few beers and sit back to enjoy this crime-spree and eventual excellent vampire fight. This is a really good film. There is enough violence to keep anyone happy, enough angry characters and enough plot development for all to enjoy. I thoroughly enjoy this film every time I see it."}, {"rating": "6", "text": "A fun and campy horror gorefest, From Dusk Till Dawn certainly ranks up there with the weirdest movies I have encountered during my journey through film. From the major tonal shift to the fact that it exists as a decent movie in many different genres, and to the fact that it stars George Clooney viciously killing vampires, From Dusk Till Dawn is quite the experience. It is never truly a horror film in the sense that it scares you, but it is one in the sense that it truly just lingers within you. Once you watch this one, you have become the undead and will never switch back. Weird turn after weird turn reveal a wildly entertaining if over-the-top film that truly never fails to live up to my expectations for it. It is not a great film, but is a fun one and has some classic Tarantino writing and gore, plus a good performance from George Clooney, and solid direction form Robert Rodriguez. A Tarantino-Clooney-Rodriguez group project can never truly can too awry, now can it? Overall, this one is a nice, light break from more serious horror films during the lead up to any Halloween."}, {"rating": "8", "text": "This movie is directed by Robert Rodriquez and has a screenplay by Quentin Tarantino who also has a role in the film. This is actually one of the first movies by Robert Rodriguez and Quentin Tarantino that I watched and from then on I pretty much became a fan of them both. So, when it came out on Blu-ray a while ago I had to get it for the collection of course.\r When I and my dear wife first watched this movie we did not really know what it was all about. We thought it was just another robbery/criminal story and the first half of the movie it is indeed"}, {"rating": "5", "text": "A fun ride that has a better first half than the second. If this movie had just left out the whole vampire story and just continued with the first half it would have been much more thrilling and possibly become an unexpected success. George Clooney gives a great job and Tarantino, Lewis and Keitel do well also. However, the only reason I wouldn't give this movie full marks is because of the fact that the vampire action reaches levels of pure mindless schlock and forgets all drama, suspense and character. In other words, a good time for horror fans and a bad time for serious moviegoers."}, {"rating": "6", "text": "One of the more clearly defined examples of a film with a classic case of \"A Tale Of Two Movies,\" Robert Rodriguez's \"From Dusk Till Dawn\" has a first half that feels very much like how I expected it to feel (like a Quentin Tarantino screenplay directed by Robert Rodriguez) But the second half descends into an appreciation of B-movie thrills that the filmmakers and I just don't share. That's not to say it's unwatchable. It's just not the movie I signed up for, got invested in, and yearned for in times of canted angles and torso guitars. In the end, I felt it was a fun watch, but also one that could have had either of its two, drastically different halves toned down, allowing for a smoother transition between genres."}, {"rating": "6", "text": "Is it great? No, but it certainly is very entertaining. That being said it isn't much more than entertaining. The kills are great and the action/comedy keeps you watching it but when you look beyond that there really isn't all that much substance."}, {"rating": "6", "text": "Suitably sleazy entertainment. The first half of the movie is a grindhouse style crime-thriller, while the second is an over-the-top and goofy vampire movie that doesn't take itself seriously at all and is filled with extremely gory kills. The only things that stay the same throughout are that it's completely vulgar and it's main characters are violent and deranged.\r It can be stupid, offensive, or at times just downright gross. Surprisingly though that's what makes it fun. Watching it turn from a crime-thriller with two deranged leads (Clooney and Tarantino himself) into a dumb, b-movie horror flick feels surprisingly natural, and it's just overall a decent amount of trashy and stupid fun. It's definitely not for everyone, but there's something about it that still makes it worth a look. Just keep in mind this is far from high-art. I give it a 6.8/10."}, {"rating": "6", "text": "A mildly entertaining movie that starts out like a Tarantino movie and then quickly turns into a horror b-movie."}, {"rating": "6", "text": "“Peachy, Kate. The world's my oyster, except for the fact that I just rammed a wooden stake in my brother's heart because he turned into a vampire, even though I don't believe in vampires. Aside from that unfortunate business, everything's hunky-dory.”"}, {"rating": "6", "text": "From Dusk Till Dawn is extremely trashy, cheesy, vulgar entertainment. This is real 80's pulp mashed together is laughably bad script and screenplay. It's trashy but fun. George Clooney plays Seth Gecko and Quentin Tarantino playes Richard Gecko- another word for rapist in movie history. These brothers care about crime, when the tables turn in an attempt to rob a gas station, the brothers find themselves in big trouble after every cop in the state looks for them. When the boys find a RV to escape- they find three family members in it. Jacob Fuller, played by Harvey Keitel- Kate Fuller, played by Julliete Lewis and Scott Fuller played by Ernest Liu. The story progresses as they go to a club called the **** Twister and get a sexy dance by Salma Hayek. Yeah, that's it. But the second half is about fighting vampires rather than focusing on the story and characters. It wastes too much time. The story is absurd and most people wont like it- especially Tarantino fans. But the real cringe to the movie is this the acting and the all time fun you have in this cheesy flick. It's the most fun you'll have but still- it's flawed. I would say give it a rent and check out your brain at the door."}, {"rating": "6", "text": "The artistic medium of film is very subjective. Every audience member has a different set of criteria they use to measure their viewing experience. Not everyone shares the same set of criteria. If we did, what a bland and uninspired world this would be.\r What I Personally Liked About \"From Dusk Till Dawn\":\rI want to preface this by saying that I have never been that big a fan of television. So this was my introduction to George Clooney and even in an off-the-wall gorefest such as this, it was easy to see he would go on to have a prosperous career in cinema. His presence dominates the screen and his sense of character never falters for one second. We are also treated to Quentin Tarantino's little b*tch boy sidekick of a brother. Tarantino almost always adds some worthwhile humor to his screen roles and this is perhaps the best of his bunch. Salma Hayek is another big highlight of the movie, even though she doesn't have nearly the same amount of screen time. Let's face it, sure she has had better roles in her career which challenged her abilities and allowed her to shine. However, any time you get to see a hot Latin beauty with a six-foot python wrapped around her half naked body it's going to leave an impression. In addition, I wish we could have had more Tom Savini. Seriously. This guy should have stepped in front of the camera more often as it's clear he thoroughly enjoys hamming it up. The music also plays an important part in this production. From the Blasters to Tito and Tarantula to ZZ Top, this is not the average music which accompanies your normal vampire film. These southern-tinged rock 'n' blues pieces go a long way in differentiating this movie from the plethora of vampire motion pictures which seem to populate each and every decade since the creation of the medium.\r What I Personally Disliked About \"From Dusk Till Dawn\":\rEasily the worst part of this movie is Ernest Liu. He is simply not a strong enough actor to bring anything to the table. He's surrounded by larger than life, recognizable actors and his bland performance stands out like a bonfire on a blackened evening. Maybe if Juliette Lewis wasn't playing the role of his sister there would have been a bit more balance to his monotone execution. As it is, he is woefully out of place and I just can't seem to get past his presence in this picture. There are also some fairly heavy pacing problems, particularly before the stylistic switch between hostage drama and horror show.\r My Overall Impression of \"From Dusk Till Dawn\":\rThis is a fun little vampire grindhouse action/horror/comedy but, at the end of the day, it's still just a vampire grindhouse action/horror/comedy. It's bloody. It's campy. It's filled with naked t*ts, flying fists and some really good make-up effects. It's not Shakespeare, but we don't go into this kind of flick expecting it to be so. While it tries its hardest to be original, it's still susceptible to a handful of genre cliches that affect the enjoyment of the presentation. It's simply a middle-of-the-road monster movie with a better than average cast and a bit more humor than most of its competition."}, {"rating": "6", "text": "This film was absolutly fantastic for just over an hour. Literally one of the best things I'd ever seen, clever, funny, cool, well acted. Aaand then this lady turns into a vampire, tarentino dies and the whole thing goes to hell. I've never been so disappointed."}, {"rating": "2", "text": "Two halves of different movies spliced together with total disregard for continuity. The first half is entertaining in its Tarantino expect-the-unexpected content, but the second half treats it as mere disposable prologue, making the entire project disposable - apparently what the filmmakers set out to do. Mission accommplished."}, {"rating": "8", "text": "It's a B movie. It makes no bones about it. At no point does it look in on itself and pretend to be high art, or to have  lasting message. It's tittilation, schlock and some gore. It's playground humor and as such very self aware of that.If judged as high art - it fails. If judged by standards of the horrors of modern political correctness  - it fails.Judged as a B movie schlock horror. A film of its time that hails back to movies 10, 20 and 30 years older (like the Grace JOnes curio \"Vamp\")Then it succeeds.It isn't the best movie ever. But if you know what you are getting (and just a quick look at the cover or read of the tag lines should tell you that) It's pretty good.Reading many of the \"professional\" critics (For professional critics read \"Political ideologues paid to pollute the chattersphere with a monotone regressive message) it's clear many mark this film down on purely idological reasons based on the very tightly defined political views that seem to be the only accepted currency in the rapidly vanishing and increasingly impotent and self obsessed \"main stream media\". That's a shame, but until the MSM burns itself out as it doubles down year on year with its hugely unpopular political agenda, that's just where the world is.Side note; Read the Vox review minutes before I wrote this, Then Google pointed me to associated news items such as Disney writing off 300 million it put into Vox only last year and the 15% of staff they are laying off next week. Two catastrophic events that will undoubtedly lead their idologically blinkered leaders to double down on their failed strategy yet again. And give the next fim that isn't laden with socialist messgaes a poor score.But as virtually no-one watches or reads MSM in any form any more. Who cares?"}, {"rating": "5", "text": "The beginning is great and I prefer that part much more than the part in the bar later. But it is true, you should take the movie to seriously, especially later on."}, {"rating": "7", "text": "Vampires in movies, vampires in TV, vampires in books, animation... Vampires have been done to death. This movie, coming out in the middle of the '90, is just a footnote in the history of vampires in the media. A footnote written by Tarantino and directed by Rodriguez.When I first saw this movie I was sure it's the worst thing I have ever seen. One minute you watch a crime drama, then you blink and it's a b-class vampire flick... Gory, vulgar, stupid movie. Unnecessary movie. Yet I keep thinking about it time and time again, I keep coming back to it... Because it is fun. You see, movie doesn't need to be deep, the movie needs to be entertaining. And this movie does that really well. the music is great, characters are memorable, and the **** Twister... amazing. Also... Santanico Pandemonium!"}, {"rating": "0", "text": "Another bunch of sicko crap from Tarantino, who is one of the sickest wackos ever to come out of Hollywood.  Having Clooney in it only made it worse - if that was possible."}, {"rating": "8", "text": "It may have been cliché, silly and predictable and some of the acting wasn't very good, but it sure was an entertaining and really well made movie. From Dusk Till Dawn is the proof that silly vampire movies can still be fun."}, {"rating": "7", "text": "I think this movie is really good. It is by far the best vampire movie I've ever seen. I really like how the vampires look. Not terrible obvious mask and not so good you'll get nightmares but like directly in the middle. Also the story is funny and suspenseful. I like this movie but it's not the GREATEST. so that's why I gave it a 7."}, {"rating": "5", "text": "What the **** Rodriguez and Tarantino !!! The movie was going smooth in the first half and then it turned into an utter disaster."}, {"rating": "2", "text": "Clooney and Tarantino patronizes the brotherhood with warmth which is a complete shock in contrast to this vampire bloodbath.From Dusk Till DawnRodriguez is searching for a crowd. And with this crowd pleasing pop culture commercial cinema, he may have found it with the help of a big production and even bigger cast. But all the likeable ingredients couldn't make me nod to any of their theories. First and foremost what I found most fascinating is how smart actually the concept and the structure of the script is. Quentin Tarantino's screenplay and Robert Rodriguez's direction are both going in the same direction, their eyes might be on different topics but they are at least in sync, unlike the previous experience of Tarantino with Tony Scott that I found a bit uneven. But this time I am to blame even Tarantino for it. For the structure of the script is incredibly promising and has enormous potential.The script is bafflingly smart. It starts with a crime scene that marks the territory and as it proceeds further and further, the madness multiplies and the boundaries are pushed periodically. Now, this is an engaging journey to go through. Jumping in one from one location to another, one genre to another and one tone of violence to another, but this is all shucked out of the window by the execution. What all Rodriguez had to do was acknowledge the current state, position, scenario that is explored in this wild ride.As soon as he accepts the presence of each character the film should electrify all those elements that were meant to shock the viewers. And it is not that he hasn't tried. With a hands-on camera work that gives a personal look from a character's perspective, he has made us look through their spects plenty of times. But From Dusk Till Dawn, none of the characters notify us physically or verbally of their inner emotions of the world they revolve around."}, {"rating": "8", "text": "From Dusk Till Dawn is one hell of a rollercoaster. Written by the legendary Quentin Tarantino and directed by the almost as legendary Robert Rodriguez, it is a film that shouldn’t be missed if you’re a fan of either of them. Great acting from George Clooney and Quentin Tarantino with special appearances by the great Tom Savini and Salma Hayek. Savini also does the effects, which really shines in this film. There are a few moments where it gets a little too ridiculous and corny, but it’s fun all the same."}, {"rating": "7", "text": "From Dusk till Dawn is a cult movie of some kind. It is unique at least in that Quentin Tarantino plays one of the main roles. And of course, the contrast of the first half from the second is very different. A great cast, a second-half trash of the film and a fun ending. The viewer's film will definitely not leave indifferent"}], "recommendations": ["wrong_turn", "malignant", "vacancy", "desperado", "the_last_witch_hunter", "copshop", "the_cabin_in_the_woods", "the_conjuring_the_devil_made_me_do_it", "pride_and_prejudice_and_zombies", "the_invasion", "scream_4", "hancock", "the_babysitter", "polar", "mindhunters", "the_wolf_of_snow_hollow", "american_ultra", "i_am_legend", "scream_3", "hercules", "the_wolfman", "final_destination", "reservoir_dogs", "ready_or_not", "underworld_evolution"]}