{
  "id": 127,
  "title": "Frozen II",
  "starring": [
    "Idina Menzel",
    "Kristen Bell"
  ],
  "runtime": 103,
  "genre": [
    "Family",
    "Animation",
    "Adventure",
    "Comedy",
    "Fantasy"
  ],
  "description": "Elsa, Anna, Kristoff and Olaf head far into the forest to learn the truth about an ancient mystery of their kingdom.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mINJaa34MtknCYl5AjtNJzWj8cD.jpg",
  "categories": {
    "plot": 5.011494252873563,
    "acting": 4.846153846153846,
    "ending": 4.333333333333333,
    "soundtrack": 6.181818181818182,
    "cinematography": 6.0,
    "familyFriendly": 5.384615384615385,
    "funny": 4.625,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I really like this movie. It's a bit different from the first in terms of tone and music and what kind of adventure we go on, but in a good way. It's not without it's problems (Olaf, while not without his moments, isn't quite as funny and charming as before; Kristoff disappears for a while; I wish we could've gotten more of the new characters), but as far as Disney sequels go, you could do a lot worse."
    },
    {
      "rating": "10",
      "text": "I honestly can't believe how hard some people have been on this movie. The general consensus among them is \"It's not necessary, it's inferior to the first, so it's bad.\" If you ask me, I DISAGREE STRONGLY. Is it necessary and better than the original? No, but that does not mean it's bad. Frozen 2 is by and large a good movie, easily the best Disney has brought out this year. (But given the competition from their awful, lifeless, forgettable, truly unnecessary remakes, that's not so hard to achieve.) I'll avoid spoilers because far too many instagram pages have been leaking this movie all over the place, but here's what I'll say. Frozen 2 is an evolution from the first, kind of like how Toy Story 3 is an evolution from the first two. It's darker, more heartfelt, full of some tense moments, but there's also plenty of great comedy to balance things out. Questions from the first one are answered, but there's also some new ones brought up. It's not as simple and easy to follow as the first, but it compensates by still being very good. In terms of comparing this to other stuff from this year I've seen, it's not better than How to Train Your Dragon: The Hidden World, but I honestly prefer this to Toy Story 4. And of course, I'll take this over any of those cheap remakes any day. At the end of the day, this return trip to arendelle is a worthwhile one."
    },
    {
      "rating": "2",
      "text": "Greetings! I am a huge Frozen fan ever since the first Frozen movie came out back in the year 2013. Sadly, Frozen Ⅱ wasn't as good as Frozen for several reasons. Don't misunderstand me, but Frozen II disappointed me quite alot. Here are the reasons and I hope you guys understand my words and thoughts and of course my feelings about it.Design: the design of the characters was insanely amazing. I love how epic their clothes are. 9/10Animation: the animation was stunning, amazing movements. Some parts seem so realistic, I thought the forest was real. 10/10Music/Songs: the song's weren't as catchy as the songs from the original yet they were pretty emotional. Queen Iduna's lullaby made me cry and Into the unkown gave me goosebumps. Kristoff's song (lost in the woods) was okay. 7/10Plot: the story seemed so interesting in the trailers, but ended up being okay. The idea of finding out why Elsa has powers and the others not, wasn't a very bad idea. You could go deeper into more detail tho... 5/10The ending (the part of the movie I hate the most which caused me to rate this movie with a 2): Now listen closely because you Disney people appear to like the idea of separating the main characters. NO! Don't do that, never do that. You can't just separate two characters from each other after showing us how much they love each other especially when the characters are siblings (everyone dislikes such endings). Frozen is about sisterly love, trusting, promising and having a wonderful time together. There were so many different ways to end this movie. For example; •the spirits could take away Elsa's powers and make her feel relief for the first time in her life. She wouldn't live in fear of hurting someone and could still live in Arendelle TOGETHER with her beloved sister Anna and the others.•Arendelle gets destroyed by the water and gets rebuilted in the enchanted forest, making it easier for Elsa to take care of both of the Kingdoms which could end up being one big kingdom. •everything stays the same as it is now but Elsa lives in Arendelle TOGETHER with Anna and the others and visits the enchanted forest whenever the spirits call her for help.Just don't separate the main characters, don't do it. Such things break our hearts and it makes us hate Disney (especially if you grew up seeing the cuddling, hugging, playing and having a wonderful time together such in Frozen Fever. My heart melted because of happiness. Seeing the sisters together is very touching.) There are so many possibilities and ideas to end a franchise without separating the characters. (Also the Frozen universe never needed a bridge between the magical world and the human world. The Nothurlda seem to have good control of the elements without Elsa doing anything at all as we showing one of the flashbacks). 1/10Characters;Elsa: this time Elsa was more interesting and a bit open minded. What pissed me off is her breaking her promises. I mean she literally broke every promise she made except the one \"I am going to safe the forest\". She promised to not push Anna away, but she pushed her away. Also, Elsa appears very stubborn in this movie.Anna: She was funny (not as funny as in the original Frozen). However, her personality was so different in this movie. She didn't even care if Elsa is leaving the kingdom. She didn't develop any good connections with other characters except of Olaf. Not to mention she almost destroyed her own home without thinking twice. I didn't feel her in this movie.Kristoff/Sven: I think the developers forgot Kristoff's and Sven's existence.Olaf: I really enjoyed his presence this time. He was funny, smart, loud and very sympathetic in alot of scenes.The others: Mattias was cool but sadly we didn't see much of him. The Nothurlda were okay and Yelena was cool. I wish we could see more of them. 4/10"
    },
    {
      "rating": "4",
      "text": "The \"water has memory\" motif and especially Olaf's \"many experts dispute this but it's true\" line feel bizarrely out of place and smack of homeopathic propaganda."
    },
    {
      "rating": "6",
      "text": "Frozen II was a relatively innocuously enjoyable movie to watch or play as background noise, but I found the plot to be weak and predictable, the music wasn't what I would call Disney-esque and the animation left much to be desired. To me I feel that it was a typical Disney sequel that falls short of the original and didn't have the same amount of time or care dedicated to it."
    },
    {
      "rating": "0",
      "text": "They used the popular first movie to make a sequel for woke people. It's not even mature just woke and politically driven. With strong negative/hate message against single, introverted people and white men, disgusting. Because nothing made sense in this film, there are no answers or moments that have anything to do with the original, everyone got an annoyingly different characters, the 'background' story of Adgarr and Iduna is worthless, not well thought out, does not make sense and cannot be explained from Frozen (Frozen 2 ensures that their behavior towards their children has become conscious emotional abuse and lying, and in the same film Disney also tries to get rid of this by showing them cozy moments!). That forest just comes out of nowhere, just like the 'voice'. And the end well they just made up a 'bridge' and so-called 'connection' to give Arendelle a King and Queen in a very sneaky way, without the woke people complaining about Queen Elsa, very pathetic from Disney. And the real villians get the trolls gor their way. For the rest Anna is very annoying and immature in this film, Kristoff is superfluous, Olaf is present and Hans is missed in the film (that part where Elsa's hatred is stupidly invented) Frozen 2 is heavily superfluous there is no story in it, characters look like hobos, everyone is downgraded, there's no magic in it, with the motto go woke, go broke. Just a milked-out mess that should never have been made! For quick cash!"
    },
    {
      "rating": "0",
      "text": "A big let down on a great first movie. The story really makes no sense at all, it must have been made by writers who have never seen the first part. Nothing has been done with character growth, just adding an environment that has nothing to do with Frozen and people who don't fit into Frozen. And magic, where Frozen was about a girl with ice powers, there are suddenly more powers in this film in the form of animals (spirits) which really makes no sense. This whole movie was written by drunken lunatics with a lot of frustration because you can see that a lot in the movie! Zero points is still way to much for this!"
    },
    {
      "rating": "3",
      "text": "Yeesh, this film is... weird. You know, I actually quite liked the first film. It was cute and kinda charming. Not this one though. The story is very messy and forgettable and in my opinion badly written. Most of the new characters were forgettable and bland in my opinion. Also the whole five spirits thing was just.. weird. If they make a third one (which I wouldn't be surprised if they will, it's **** Disney we're talking about here) I hope it will be better thn this, tho I very much doubt it."
    },
    {
      "rating": "6",
      "text": "I loved the first movie and for a sequel, this is ... alright. I enjoyed the animation and some of the gags were genuinely funny. I also appreciated the effort to add more lore to the world of \"Frozen\" to be acted on in future installments. However, the movie falters on things that made the original so popular - the characters are confusing, the songs are underwhelming, and the story itself is muddled and unfocused. Any one of these on their own would have been bad enough but altogether I can't ignore the misses. Elsa and Anna's relationship is the focus again and everything else feels underdeveloped and rife with plot holes. I still enjoy the movie but I will admit it makes me antsy for the inevitable Frozen III, where hopefully Disney enacts some better quality control.Positives:+ upgraded visuals and animation+ Elsa and Anna's relationship is complex+ exploring Elsa's powers is fun and intriguing+ a couple interesting songs+ Olaf is genuinely funnyNegatives:- plot is muddled and uneven- less memorable songs- Kristoff's characterization/arc/song are all bafflingly dumb- Anna's character is less focused, seemingly contrary to the first movie- the story teeters dangerously close to some cringeworthy \"noble savage\" and \"white savior\" tropes"
    },
    {
      "rating": "6",
      "text": "I really enjoyed the first film, but I found the sequel to be a big disappointment. The whole story about the elements doesn't make a lot of sense and feels very contrived. It's like they were making it up as they went along. The whole \"water has a memory\" is just an excuse for them to portray memories as snow sculptures, as it's easier to show that way. The kingdom of Arendelle seems to be a little port with 300 people living in it. There's no villain to speak of. With Elsa we have another story about her self-indulgently running off to find herself, and yet again Anna is the one running behind trying to fix everything. Kristoff basically has a cameo role, and I didn't like the way his main arc ended with him marrying Anna, when Anna was clearly indifferent to him. I also feel it undermines the first film's message about true love not having to always be about romantic love. Olaf is Olaf. Graphics are great and there are some some good songs here, but overall for me this reminds me of The Lion King and Aladdin - two great Disney films that had poor sequels that were best forgotten."
    },
    {
      "rating": "4",
      "text": "Was it terrible.  No.  Was it entertaining... well, not really.   I hate to say I like the first Frozen.  I though \"Let It Go\" and the accompanying scene was one of the best animation/music combos ever.  And \"Fixer Upper\" was a genuinely fun song (can live without Build a Snowman, but still recall it).  I just watched this show and can't remember a tune, much less hum one.  Nobody ever seemed in jeopardy and was there even an antagonist?Frozen 1 was a 9 or 10, even not caring anything about it in advance.  This... pretty lame."
    },
    {
      "rating": "7",
      "text": "The stakes aren't very high in this sequel to the Disney classic, the songs not that memorable, and the plot is weak at best. All in all, though well animated and acted, it feels more like a cash grab."
    },
    {
      "rating": "6",
      "text": "It's like a long lovely trailer where the story never evolve. I think Disney is busy with some other projects"
    },
    {
      "rating": "4",
      "text": "It's even more hollow in story than the first. There are a whole bunch of pointless, boring songs one after another that I started to skip skim though. Story wise barely anything's happening and even that's boring. The characters remain 1 dimensional, except Kristoff who remains 0D."
    },
    {
      "rating": "8",
      "text": "About as good as can be expected for what was arguably an obligatory sequel to something as special as the first Frozen. The filmmakers and songwriters obviously put their hearts into making something that had its own kind of magic while recapturing a lot of what worked in the first one."
    },
    {
      "rating": "6",
      "text": "6 years ago Disney released an animated film that made people go completely crazy.Its success was somewhat unexpected because it was an original film with new characters in the Disney princesses repertoire but it worked great. Also the emblematic song was a massive hit even though I **** hated it.I really didn't see anything remarkable in the film but with 1.29 Billion dollars raised at the box office Disney obviously knew they had gold in their hands and the sequel was inevitable. 6 years later it has finally arrived and it's clear this sequel was born for monetary reasons instead of narrative reasons.Anyways that's not a bad thing, I've always said this is a business and it's perfectly understood and therefore Frozen II plays it safe. It doesn't necessarily deliver the same but obviously there would be no changes in the formula.Maybe something that can bother a certain part of an audience unable to see something with another mentality has to do with the very own mentality of the film focused on current affairs.The message of feminism and feminine empowerment is clear but at this point if people continue to believe they will see something else or that a film directed at a kid's audience doesn't need to deal with such themes, they're just deceiving themselves.The songs just like in the original movie are the spine of the narrative but once again for me they didn't seem really interesting, although ''Into the Unknown'' is definitely the best in the repertoire and I personally liked it more than Let it Go.But this is how Frozen works. The story this time is a bit messier but like in any musical the songs are how the characters express themselves better and this is how the film is made to work in a more suitable way.I confess that Frozen wasn't the kind of film I like from Disney Animation but I know and I can recognize when there's quality and Frozen II despite its defects is a well made film.Frankly I cannot say if it was able to recapture the tone of the first film because even though the original has certain superior elements, this one seemed more enjoyable to me.I don't know, maybe I saw it with a different mindset, especially because of my lack of expectations but I repeat I liked it and there's quality to spare, nothing great but hey; it's more than fine and if you enjoyed the first one, then you will enjoy this one as well."
    },
    {
      "rating": "10",
      "text": "Muy buena película, mejor que la primera. La música es asombrosa, Kristen Bell The next right thing es una de las mejores canciones tristes de Disney"
    },
    {
      "rating": "10",
      "text": "Personally think the movie is great! It’s a bit more serious than the first one, since the kids are a bit more grown up, into the uknown is in my head for the last 3 days"
    },
    {
      "rating": "3",
      "text": "The original Frozen had solid characters and a great, simple plot line that was easy to follow yet powerful. However, Frozen 2 was a letdown. The plot was very vague, the unsatisfying ending left viewers with questions, and the plot consumed the character’s personalities. Also, I think that the message that the movie gave was unclear. On the other hand, Olaf was very funny and the graphics are high-quality. But those two elements do not make up for the disappointment the movie brought. Overall, not worth it!"
    },
    {
      "rating": "10",
      "text": "Must watch! Amazing visuals and music. Phenomenal music! It also delivers important messages especially needed to the youth in this age of times. Truly amazing experience. Pretty sad many review disregard this fact and label it as mere cash grab just due to few plot holes, I mean, in the end, they need money to make more better movies and I personally think they did amazing job trying to shout this important message to the world."
    },
    {
      "rating": "3",
      "text": "I'll start with the positives: The animation is genuinely beautiful. Soaring mountains and exquisitely detailed landscapes showcase just how far animation has come in the past few years.The story, unfortunately, is a huge disappointment. A paper-thin plot driven by conveniences and vague references to magic coupled with a shoehorned B-plot make for a confusing, shallow, and badly paced movie. The musical numbers add nothing to the story and lack the charm and memorability of the original. It's a pity that in 7 years this is all they could do."
    },
    {
      "rating": "6",
      "text": "Having thoroughly enjoyed the first installment, I went into Frozen 2 with certain expectations. Unfortunately, the direction in which the characters were taken, combined with the somewhat lackluster plot made this film fall flat. Is it one of the, if not THE, best looking animated movies out there? Definitely! Their attention to detail is astonishing - with every environment, clothing, etc... crafted with utmost care. That alone, however, isn't enough to save the film for me, bringing the score to a 6/10. It's slightly above average, with incredible visuals and a sub-par plot."
    },
    {
      "rating": "0",
      "text": "Extremly boring. When i stepped into cinema i knew it will be bad. And yes it was. Extremly boring story. Guess how it ends? I wont spoiler but you can think about it, trust me this type of ending are everywhere. From film it became one big cringy song. The story is so chaotic, i never know what they must do, what are they doing, what happend etc. More boring film i never saw."
    },
    {
      "rating": "0",
      "text": "Really awful and bad and extremely predictable and it is for 4 years old children"
    },
    {
      "rating": "8",
      "text": "This is a great sequel to the original movie. It can't quite top the first but it gets close. The animation and acting is top notch. I don't think anybody expects any less in that regard. The most of the film the story is great and doesn't slow down once it gets going. The first two acts are incredible and beat the original film for me. The third act is where this movie stumbles. The climax feels a bit to quick with some strange character choices. It's almost as if they cut a small chunk out of the film. It doesn't ruin the movie but it does leave you not being fully satisfied. The songs are as great as ever and will be stuck in your head for months. Even with the third act being a bit off, Frozen 2 delivers a great sequel that will leave fans pleased."
    },
    {
      "rating": "5",
      "text": "Jezz bored the hell of my brain . too many song none stuck in your head. plot suck and full of loophole . Should go straight to DVD"
    },
    {
      "rating": "6",
      "text": "The original isn't a great movie. It's a solid movie but not great. However, two things that are outstanding in the original, are the songs and score...Two things that, sadly, aren't as good here. There are twice the number of songs compared to the first one, but besides two really good songs, the rest of them, while not bad, feel uninspired, don't sound as epic and even feel forced. It seemed at times that characters started singing just because it's a Disney musical movie and not because it is essential to the plot like the original. There are some musical numbers that even feel pointless or like a lazy way to explain to the audience how the characters are feeling in the exact moment. The plot feels a bit better than the original in the sense that it doesn't have the same dumb twists or plot conveniences. However, that doesn't mean that the movie told a great story. I feel like the main conflict feels forced. In some way the movie reminded me of Finding Dory because of the way that the main conflict is established. It doesn't feel like a \"logical next step\" in the franchise. The story doesn't feel like the natural progression of what was established in the first movie. It doesn't leave a notorious impact in the franchise. If anything, this movie makes itself feel pointless. The new characters are forgettable and don't really play any significant role and the characters we know and love from the previous don't grow or have any arc! Elsa is still the same character in the end. She does learn some things about her past but it doesn't seem to affect her for some reason. Anna feels like the same character as how she was in the end of the first (I feel like her arc was completed already and the writers had no idea where to take her now) and other characters like Kristoff are just there and feel pointless. Olaf is much more annoying here than in the previous one. Sometimes he affects the tone of the movie and you could remove him from the plot and nothing will change and there's that salamander creature who's in the movie for absolutely no other reason than to sell toys...Because he's so cute, \"awwww\". The only thing that I feel it is superior to the original is the animation and the visual effects, but that's expected seeing how 3D animation evolves quickly. Overall, I don't think there isn't anything particularly bad nor anything outstanding. It is inferior to the original in almost every aspect and not even the songs are as good. What was the point of having twice the number of musical numbers if only two are actually memorable? Anyway, if you didn't like the original, this isn't any better, don't watch it. If you're a fan of the original, then...Go ahead. I think you'll enjoy it...I definetly don't want this movie to be nominated for an Oscar but knowing how the Academy always nominates a Disney or Pixar Movie, then yeah, it will get a nomination, but this is far from being among the best animated films of the year."
    },
    {
      "rating": "10",
      "text": "It's too bad to see it once in a theater.  In other words, the best Disney animation ever!"
    },
    {
      "rating": "2",
      "text": "The two stars are for Olaf. Otherwise this would be a zero. Disney has lost its way during the interval of time between Frozen and Frozen 2. Its ultimate goal used to be telling a compelling story. Now its goal seems to be mostly about transmitting political messages, while the other elements of the production are given to an intern to take care of. The original Frozen had a tightly constructed plot, nice pacing, solid character development, and several memorable songs. Frozen 2's plot is a vague bunch of junk that makes little to no sense on any level, though it does manage to convey a politically correct message dumping on western civilization. Its pacing is so sluggish in the first half that I saw two families leave at the halfway point. After the movie ended, as I left the cinema I could not remember a single melody from the movie (other than ones that were recycled from the first movie), and no new characters were introduced that were remotely interesting. The movie was a mess that appears to have been written by committee. It was sometimes boring and sometimes painful. The worst part, though, was seeing the disappointment in my daughter's eyes as she watched. When after the movie she asked me why this or that happened in the story, I tried to invent answers but ultimately just told her, \"because the movie was not very well written.\" I just didn't know what else to say but the truth."
    },
    {
      "rating": "2",
      "text": "The story is convoluted, chaotic, and the impetus is mundane. By the time a lead character attempted a terrorist act in order to \"save the day\", I had already become annoyed an hour ago to the point I no longer cared. How this made it past storyboards is beyond me."
    },
    {
      "rating": "2",
      "text": "Awful, stupid movie. I couldn't wait until it ended. Stupid, convoluted plot. Avoid."
    },
    {
      "rating": "9",
      "text": "I enjoyed myself with this one.First off, this is one of the BEST looking animated movies of all time. It is simply gorgeous looking. The visuals have an excellent use of color and nature. I love that they decided to set this in autumn, which is something you don't often see in animated films. In contrast to the more traditional fairy tale look of the last film, this one is far grander looking. The appearance of the kingdom of Arendelle in this makes the original look so-so.Frozen II feels so different from any other Disney animated film. There are plenty of those that do fantasy, but this is the first one (except maybe for The Black Cauldron) to go for EPIC fantasy. I really loved the various legitimately challenging magical forces the characters have to deal with.The story looks into how Elsa (voiced by Idina Menzel) has her powers and I really liked the setup and the messages they were trying to tell. This is actually one of the more serious Disney animated films. (By their standards. Don't worry there's still plenty for your kids to love.) There are a couple surprisingly dark, dramatic moments. (Again, by Disney standards.)Based on the trailers, I was afraid that comic relief Olaf the snowman (voiced by Josh Gad) wouldn't fit into the change of tone on account of being too light, but the writers adapted the character really well. They have him growing up and being far more philosophical about the world (while still being pure). His musings often steal the show. I actually thought he was funnier in this than the last film.I did think this movie had some pacing issues. The plot just isn't as tight as the first one. There are moments where the writer didn't know how to best utilize the main characters. I do wish they spent more time interacting with a couple of the film's likable but underused new supporting characters.Songs are decent but aren't on the same tier as the last film. Half are just okay. The song Into the Unknown tries too hard to be the new Let it Go. Still, I give the songwriters credit for going with a new style not found in previous Disney films. I liked Show Yourself, Lost in the Woods, and All is Found. The last one is a particularly lovely piece.This isn't quite as good as the original, which knew more what it wanted to be and had a stronger emotional backbone. Still, this has a lot going for it and I think your kids will like it."
    },
    {
      "rating": "6",
      "text": "Ultimately, fantastic animation, above average music (nowhere close to the first), mediocre world building, and a sub-par story.Much like a good portion of this movie, my feelings about it are bitter-sweet. Going into its predecessor with low expectations and getting a fantastic movie I was hoping that the sequel to such a shift for me could break through that sequel-curse barrier. I think it made cracks but got stock with not enough.The music wasn't nearly as good. It has a chilling vocal as the driving story mechanism, but gets so overused. None of the numbers are catchy and there is simply too much Christoph songs.The world building around the magic starts off interesting with elemental influence then Elsa is shown to be their connection/source/living god at this point. It felt forced and like the writers had no idea where they were going. Some cross between Irish/Native folklore, shamanism, and totemism. The ultimate source of Elsa's power is a gift because Elsa approved of Elsa's father's actions...wat. They could have dropped the whole source/5th element and the whole thing would have been much more cohesive.The story and the twist is the same-old people who follow nature do no wrong and are betrayed. Way overdone and with nothing to indicate it should happen from what we see anywhere else in the movie. Very little expansion of Arundel except as token references or basic plot devices. Surprisingly Olaf was much more palatable and actually useful for expressing complex ideas (though in a joking fashion)."
    },
    {
      "rating": "10",
      "text": "Excelente pelicula , totalmente recomendada, si les gusto la primera esta les va a encantar"
    },
    {
      "rating": "7",
      "text": "Beautifully animated; the effects of water, wind, snow etc. are just what you'd expect, in the very best way. The characters we can't help but grow to love are all there, but unfortunately I feel that the script is confused at times and conflicts in the script are what we are supposed to take as conflicts within/between the characters and I personally don't find that this was the intended effect. The plot is somewhat vague, if not inaccessible at times and this leaves me sour on the character's exact motivations. The songs are again, what you would expect in the best way, but I personally feel that the film lacks it's Let It Go moment that made the first film the success it is. My favorite song in the film was actually Kristof's number, a well earned one after his very short song in the first film. I think families and children will enjoy this, but I think you may end up with far more children pestering adults on what was actually happening in the film than is intended."
    },
    {
      "rating": "10",
      "text": "So great! I love the direction they’re taking with Elsa and can’t wait for the next movie!"
    },
    {
      "rating": "10",
      "text": "Хорошое продолжение. Все отлично советую сходить"
    },
    {
      "rating": "6",
      "text": "Generic movie with high quality graphics. Songs are boring and the predictable storyline doesn't really make sense at all. It is just a copy past that doesn't really match with the first movie."
    },
    {
      "rating": "2",
      "text": "Disney has lacked their old magic for a long time now. I went in with low expectations and it was as unoriginal, boring and bad as i expected."
    },
    {
      "rating": "3",
      "text": "Ok, So we went to watch Frozen 2 last night.. Just my son, who is 12 and me.. The reason we did it was we saw the previews last week while watching another movie.. And thought maybe this will be a good one.. I mean it has a lot to live up to.. And in a way it really got me thinking about the market and what little girls really have offered to them at Christmas times and birthdays and such.. Not a whole lot.. Little boys have a whole world of variety.. So with that said, movies like Frozen two, like 1 has to hit their mark.. I mean really.. The reason for it coming out this time of year is for merchandising at Christmas as well that goes with the movie.. Especially for little girls I believe.. This will be the theme's of so many little girls Birthday parties and dresses and such..Now.. With that thought out of my mind.. I have GOT to say what I thought.. This movie was DARK! I mean like DC Comics made this story kind of dark.. Even Deadpool was in a better upbeat light than this movie.. There were TWO scenes TWO! That the little girl behind us was crying.. We could hear it!! And one little kid sitting in the row in front of us had to sit with his mom because of what was taking place.. THIS is not the right message for these little kids and mostly girls.. If the snow wasn't around, with the two stars being dressed all bright and colorful like Frozen SHOULD be... You would think it was taking place at Gotham city where the sun NEVER seems to come out.. That was the feel that was being put on the story.. It was so loosely put together and drab.. It never felt like a big time movie ever the entire time watching. The dramatic climatic scene itself, really didn't make any sense.. And TWO of the big stars died in the movie.. Well for a while.. Hence the crying kids part.. Not going to give any spoilers here.. But wow.. This was NOT the movie I am sure that all the little girls was looking for and hoping for.. And honestly NEEDING... The first one was so much better, along with EVERY girl movie that has come out as well before it.. Just pick any, that would qualify... To me it felt like a world of darkness for our characters and in turn just a marketing scam to some degree as well at the right timing.. I have NOT seen a single review of this movie.. But someone has had to mention the way this movie went and agree with me on my analysis..Well I had to say something.. : 0) And there it is.. \"Malecicent\" with Angelina Jolie from last week was way more put together, thought out and enjoyable than this one.. If that tells you anything.. I know we are, well male species and all, but even I could sense this movie went down a wrong path with this one.. Just way too few laughs and all of it was riding on Olaf the snowman to save.. Not at all a good movie..."
    },
    {
      "rating": "10",
      "text": "I'm a modest fan of the original, and I was pretty excited for this movie once that amazing teaser came out. Boy was I not disappointed! And I'm sure other fans won't be!"
    },
    {
      "rating": "0",
      "text": "Película horrorosa, estúpida y que la verdad muy cliché, esperaba más de esta película, muy decepcionante, no me gusta poner 0 a las películas, pero en serio que esto no tiene nada de bueno"
    },
    {
      "rating": "10",
      "text": "Ignore those hate-spreading trolls that hate just because they like to hate, Frozen II is a really good follow up that is in some ways on par with and in others even better than the first. The animation? Beyond amazing, the best looking animated movie from this year by far. (Sorry How to Train Your Dragon: The Hidden World, it had to be said.) The story and messages? Much darker than the first, and possibly one of the studios darkest in general. I consider it on par with Toy Story 3 in that regard. I could talk about everything else, but I can't get in too deep without talking spoilers and I don't wanna spoil it for anyone. As someone who cannot stand those actually-awful live action remakes from this year, Frozen II was a solid reminder that Disney can still make great stuff."
    },
    {
      "rating": "8",
      "text": "First of all, from my last review everybody knows I’m not the biggest fan of the music from the first movie, mainly due to being overplayed and just annoying in my opinion, but this movie’s music I can admit I really enjoyed it. This could be because I don’t expect people to be singing “Into the Unknown” as much as “Let it Go” but no I actually really enjoyed the music and I think it’s because not just one song had a message but a couple of them did. Although, I will admit there are 2 songs that could have been cut out because they kind of just brought the film to a halt. The score, once again done by Christophe Beck, was even a tiny bit better in this movie. The animation in this film, in my opinion, surpasses that of the first. There were so many shots in this film that were just gorgeous to look at and I wanted to see more of them. As much as I’m praising there are somethings that still bugged me about this movie like inconsistences in the film that bugged me, one thing is even in the trailer. This movie definitely took what was good about the first movie and tried to make that same magic again and sometimes it worked like with the songs but in other, it didn’t such as, with the plot twists. There are two “plot twists” if you can call them that because most people over the age of twelve can figure them out, in this movie and I get why we had them but at the same time they weren’t as good as with Hans from the first. Once again, the voice cast in this is incredible from everybody and I love how they actually gave them character growth. In the end, Frozen 2 is a great family movie and a good follow up to the first. If you enjoyed the first one, you’ll probably like this one."
    },
    {
      "rating": "6",
      "text": "Once upon a retcon, there was a grand old behemoth of an animated film that was so revered and slobbered over, everyone silently knew that its follow-up stood zero chance at living up to its heights. No matter how good it would end up being. With \"Frozen II,\" however, this notion doesn't even really come into play, for things don't particularly measure up to the standards of Disney animated films in general, let alone the standards of a sequel to one of their biggest and most rabidly worshipped successes. Nothing really happens. No one really learns anything they didn't already know in the first film. No one really changes, for better or worse. There aren't even any material consequences for the characters to deal with at the end of the film -- just logistical ones. The songs struggle mightily to find anything interesting to do within the key that they're written in, ultimately leaving next to none of the actual pieces of music at the level of memorability that some of the predecessor's songs sat at (\"Do You Want To Build A Snowman,\" \"Let It Go,\" etc.) It's not a botch job by any stretch, but it is a definite departure in quality from the 2013 hit (which I wasn't even crazy about to begin with)."
    },
    {
      "rating": "3",
      "text": "Whilst one cannot blame the producers for wanting to cash in on the original film's success, this time out it's like watching a precocious child acting up, both irritating and unlikeable. The screenplay is overly complex for adults, let alone small children, and the dialogue and characterisation is often quite patronising. The animation is still great, but the songs fail to hit the heights. A couple of them aren't too bad in themselves but as presented here add nothing to enhance proceedings. The opening ballad is blandly nice, but 'lost in the Woods' is embarrassingly showcased like a pop video of the 80's. As for 'Into the Unknown' it follows all the familiar cadences of 'Let it go' but a classic it definitely isn't! Perhaps we can now say goodbye to Elsa and co and let this franchise go. With box office receipts as they are, I somehow doubt it."
    },
    {
      "rating": "5",
      "text": "TRUTHFUL REVIEW: First off ignore all the high 9s and 10s, this movie is definitely not that. I saw this movie in theaters this weekend and this movie lacks a lot of what made the first film as much of a powerhouse. Starting with the good... Though it’s not a bad movie for plot overall (though definitely flawed), as it continues the story shortly after the first film ended and while it dived deeper into the history of our beloved characters. This movie feels like a piece of art as it’s all about transformation when things are always changing and that is symbolic with the “lost woods” feel. Olaf provides great humor and Elsa/Anna/Kristoff provides character heart. I chuckled when the movie made fun of its itself with acknowledging Elsa’s “Let it Go” was too over played.Now the bad... There’s only like 2 songs that are even decent and sadly even those two don’t hold up to any of the many hits from the first one. The music is a big loss with this sequel as it pretty much made the first movie like it did for Moana. Especially Kristoff’s painful 80s like montage song. Really! It was painful to watch. The story plot though being praised for suffers with how much we are just supposed to accept from water holding memory of the past and though being warned many times to not treading too far “or you’ll be drowned” our characters still don’t learn. Sadly, I was just ready for the movie to end so I could leave."
    },
    {
      "rating": "10",
      "text": "Beautiful, groundbreaking, and astute. Frozen II absolutely nails it not only in its technical aspects but also in its subtle yet poignant undertones. With absolutely STUNNING animation, catchy music, and a rich plot, Frozen II touches upon the sensitive subjects of grief, loss, pain, and identity, making the film so much more than just any other family-oriented movie."
    },
    {
      "rating": "3",
      "text": "I saw the movie on cinema:- from a graphics point of view it was nice, it had good 3d camera angles, very nice graphics- story, it had innovated so little, no new characters, lame subject, max 2-3 moments of really good laugh for a movie for kids is too little, most of the time it was boring. The subject wasn't clear, it was too complicated- sound was good but uninteresting music"
    },
    {
      "rating": "3",
      "text": "I think the overall ratings from critics and users alike are fair here. It’s fine if you enjoyed it, but for me this movie was mostly inane garbage with really good music now and then. Aside from borrowing from “The Fifth Element” the story is your basic “this group of people, who happen to be white, that did something to this other group of people, who happen to be nondescript natives, and the only way to fix this is to do something so that no one really suffers any consequences at all. I will say that I’m not cynical person, but I actually said “f@#k you” out loud at the movie when they had the balls to sing “you are the one you’ve been waiting for you” in a musical number."
    }
  ]
}