{"id": 358, "title": "Frozen", "starring": ["Kristen Bell", "Idina Menzel"], "runtime": 102, "genre": ["Animation", "Family", "Adventure", "Fantasy"], "description": "Young princess Anna of Arendelle dreams about finding true love at her sister Elsa’s coronation. Fate takes her on a dangerous journey in an attempt to end the eternal winter that has fallen over the kingdom. She's accompanied by ice delivery man Kristoff, his reindeer Sven, and snowman Olaf. On an adventure where she will find out what friendship, courage, family, and true love really means.", "releaseYear": "2013", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/kgwjIb2JDHRhNk13lmSxiClFjVk.jpg", "categories": {"plot": 5.066666666666666, "acting": 5.761904761904762, "ending": 1.0, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 2.25, "funny": 10.0, "action": 6.0}, "reviews": [{"rating": "0", "text": "Frozen-It left me feeling 'cold' (I'm so sorry). Maybe it's because I've actually been mountain skiing before and I could pick out all of the gaping flaws with the writing, but the entire film just seemed stupid - it was a stupid premise, with monumentally stupid characters and lots of incredibly stupid coincidences, tied together by a few badly made events that serve no real relevance to the overall plot. Some reviewers of the film may say it will leave you thinking 'what would you have done?' - they have obviously never been skiing, or even have any common sense. Anyone with common sense would have taken a mobile phone up with them. Boom. Problem solved. No problems, no deaths. Even if this film was set in 1950 before mobile phones, who it their right mind would think 'Ooh! Let's go skiing when the man has told us about the severe weather and is about to close up, and let's take our ski gloves off for a cigarette while we're at it, while there's a snowstorm! Let's especially do this with a non-Skier with us! This all seems like a GREAT idea!'I'm afraid this doesn't even deserve to be classified as a Z-movie. Avoid at all costs."}, {"rating": "2", "text": "Resorts do not just turn of the lights and go home. All resorts do grooming at night. There would buy guys on sleds and cats all night. Also I never heard of a weekend only resort. Everything about this mountain has flaws."}, {"rating": "8", "text": "The acting wasn't amazing, sure, but i loved this movie. It was engaging and it really felt like something that could actually happen instead of the usual impossible situations like a zombie apocalypse that movies like this usually have. It's not without flaws but this wasn't exactly a giant budget Hollywood blockbuster and i think it did really well with what it had to work with. Overall I enjoyed \"Frozen\"."}, {"rating": "5", "text": "Extremely predictable, very little substance, and ultimately an eye-rolling bore. This film wasn't horrible, and the performances weren't as bad as I expected, especially with newcomer Emma Bell. One scene in particular is perfectly horrific, brutal, primal, and yet tasteful. The film follows the \"what the audience doesn't see scares them the most\" tactic too well and eventually becomes boring and predictable. However, with a comfortable running time, decent performances, and the aforementioned scene, this film doesn't get my worst rating. Still, I don't see myself watching it again any time soon."}, {"rating": "0", "text": "Lacking and unrealistic in so many ways. One of my favorite parts is how the woman falls asleep with her bare hand on the metal safety bar so they can have her gorily rip it off the next day. Pockets, anyone? Or even more annoying is the fact that none of them actually put up their hood or zipped up their jacket all the way (presumably so they can film their faces), while they get frostbite on their faces. I could literally go on and on, but I'll stop here and save you frustration and time - don't watch this movie."}, {"rating": "10", "text": "This was, without question, one of the most terrifying and suspenseful movies I have ever seen. I have rarely been this affected by a thriller. I am stupefied by the negative reviews here from professional and amateur critics alike. \"Bad acting\"? You have got to be kidding me; these actors were amazing. They made the dread, extreme fear, terror, and horror so real and so visceral that I had to take a few breaks while watching it because it was almost unendurable. Shot entirely on location, in freezing weather, this film literally made me feel as though I were going through what the characters were experiencing. There is only a small amount of gore, and it isn't gratuitous in the least; most of what's gory happens off-screen while the camera focuses on the reactions of the helpless others. Kudos to the entire cast and crew for doing spectacular work on what can only have been a challenging shoot, to say the least."}, {"rating": "1", "text": "The main reason I stayed with this movie was to know how the heck they could fill a whole movie with 3 idiots in a chair. What a dumb ass movie. (A) there are no wolves in New England and they almost never eat people. (b) their ski poles could have saved them lots of ways. They could have put one through the windshield of the vehicle that came by. They could have put the poles over the wires and slid down to the next pole. They could have banged on the metal with them over and over taking turns to send out a help signal. (C) they could have made a human chain from the lift with the lowest person dropping and the other two climbing back up and that person could have run for help.  (D) they could have made a rope by tying their clothes together. (D) one of the boys could have gone hand over hand back to the pole with the ladder early in the evening before everything got frozen over.  By the end of this movie, I was cheering for the wolves."}, {"rating": "1", "text": "Spoilers within:Losey, boring movie.Bad acting, stupid ongoing dribble/dialogue and an utterly ridiculous premise. -man eating wolves (nope, wolves do not eat living humans). -a two inch cable that's razor sharp (uh, piano wire is razor sharp, not salami sized cable)Could have been interesting had it been well-written, and the least bit realistic."}, {"rating": "10", "text": "The actors are all great. its the characters that are bland.  I almost thought this film was stupid and then I realized its genius...  this film is about how Americans are stupid and entitled and have no problem solving skills  are basically uneducated and just react to fear.  its like funny games.  its a big metaphor for how most people in america are incapable of looking at a problem and coming up with solutions.  just throw stuff at stuff or just jump is the best the characters can do.  None of them have ever seen somebody climb down from a great height.  none of them know anything about frost bite. they even have a lighter and don't try to makea signal  fire or just to keep away the wolves. its amazing.  its a perfect example of how Americans just mindlessly enter situations they feel they are entitled to and then just throw a  tantrum when it doesn't work out.  brilliant."}, {"rating": "10", "text": "Thrilling and unexpected, and by far the best indie of the year, and one of the best movies of the year. I absolutely love this movie, and may be a bit predictable, but aren't all horror movies these days?"}, {"rating": "10", "text": "What sharks did for the movie Jaws ski lifts will do for this movie. It is plausible and implausible at the same time which makes it a good movie for conversation.  The tension is high and the acting is good.  It reminds me frequently earlier Spielberg films, such as one called Duel where the props are minimal, yet the viewer is left with heightened awareness.  There is even a reference to Spielberg in the movie - won't spoil it but remember that and pay attention.  Good date flick!"}, {"rating": "8", "text": "\"Frozen\" is the definition of a chiller and it takes you on an absolutely terrifying ride. Assuming this was going to be mediocre at best, I wasn't expecting much, but it really delivered and ended up being one of the most frightening films I have seen in years. Much like \"Open Water\", but on a ski slope, it centers on a few friends who go on a skiing trip and get trapped on the lift when the resort closes for the weekend. Unless they want to wait a week for the resort to reopen, the three friends must take desperate measures in order to survive. The film starts off slow, but builds a tremendous momentum and becomes taut and genuinely scary. It's definitely one where you have to cover your eyes and look through your fingers at times. A must see for fans of the genre."}, {"rating": "9", "text": "The believable dialogue from the tension between the three friends at the start is what really started drawing me in to this unusual thriller/horror, but when things take a turn for the worst it really did grip me.  I think this movie, along with Buried, depends on your ability to empathise with what's happening on screen.  Okay, so there were one or two scenes where I'd have done things differently, but otherwise this is a genuinely enjoyable movie which takes you to places you really might not expect.  And that's still while staying on the slopes, a little too much so for comfort.  I'm glad this was made."}, {"rating": "6", "text": "Broken bones! Eaten alive by wolves! Frost bites! Err, those are only a few of the agonies brought about by the stupidity of the characters in Frozen. This is one disturbing film to sit through and I mean as a whole!"}, {"rating": "0", "text": "It's about as fun as you expect a film about 3 people stuck on a ski lift should be...not very. Adam Green continues to show people that he simply can't write but is still given chances to make films. The characters in this film are laughably shallow and unrelatable. And the plot is full of holes and odd coincidences that seem to just keep adding to the series of wrong turns the characters continue to take throughout the film.Frozen isn't even the kind of film that is so bad that it's good. It's just bad."}, {"rating": "5", "text": "The movie really makes you think, what would you do if you was in the same situation.I was wondering how they could make it last with the three people stuck, they did a decent job.The movie is still to slow for me, worth watching but nothing special."}, {"rating": "7", "text": "Well well well..I didnt think much of this movie going into it, b/c I mean come on how far can they go, how scary can they make it. Anyways I was entertained throughout. Good plot, very probably circumstances. Scary tho and maybe a reason people dont like this is b/c its totally plausible situations, maybe that scares people away from it. Good thriller but not for the weak of heart, there is blood and there is \"ouch\" type parts..anyways for sure worth a watch, good flick I think for those interested in these kind of genres."}, {"rating": "3", "text": "No, not that Frozen, however this Frozen was also critically acclaimed, as one of the best Horror films of 2010. After seeing that it begs the question, were we watching the same movie? 2010's Frozen takes place at a ski resort, where three very unlucky skiers are stranded on a chair lift. Somehow, none of the cameras picked them up and none of the employees at the ski resort realized there were people stuck on their insanely high chair lift. There really isn't a whole lot you can do in a setting like this, so pretty much everything you'd expect to happen, does happen, with little in between. The setting is creepy and I'm sure that getting stuck on a ski lift is someone's worst nightmare, but a whole film just based on that? After the character introductions, this film turns into an hour of talking, with the occasional really bad idea thrown in, and that's it. The Following's Shawn Ashmore stars and he was alright, it's really hard to judge a performance when all the people do is sit in a chair and talk. I honestly don't know what the critics liked about this film and what prompted them to give it such a high rating, because unless you like watching people sitting around in a chair and talking, this film really has nothing going for it. Frozen is painfully slow and worse than that, it's predictable. If I haven't learned by now to ignore my fellow critics and just watch the films that interest me, I probably never will, but please take it from me, Frozen is a film that you can absolutely do without."}, {"rating": "7", "text": "The movie is entertaining for a thriller, but there are many potentials that could have really helped the movie to be much better and more terrifying than it is. The presence of the pack of wolves is smart and it manages to keep me from going to the bathroom because I'm so invested in knowing what happens to the two after Kevin Zegers' character died. I just wish the writers had worked more on the complexity of the interesting plot."}, {"rating": "7", "text": "The movie started with an original idea but the acting and the script were not good enough too maintain the movie on a good level.The movie was realist ant the wolves were terrifying."}, {"rating": "9", "text": "A great little film. I love these films and this one is not an exception, I love it. The mix of horror and thriller really make it come together. The one disappointing bit was the wolf bit where Dan gets eaten, I just think it could have been done a bit better,it just seemed to be a bit like an \"Oh, ok then\" sort of scene. Still, it's still very gripping and reminds me a lot of buried or 127 hours."}, {"rating": "6", "text": "\"Frozen\" (not to be confused with the Disney flick) is a pretty suspenseful but ultimately forgettable thriller. It has a pretty interesting premise which results in a pretty intense movie. It's good to get a few friends together and watch it, but you won't remember it the next day."}, {"rating": "2", "text": "One of the characters decides to jump down 50 feet and break his bones instead of using a ladder which the other characters use later. It's a bit dumb and kind of boring and not really scary. The wolves were cool tho!"}, {"rating": "8", "text": "The writer/director makes the most out of a seemingly uninteresting situation, and the results are grueling and horrifying. The above average acting and bleak orchestral score help make Frozen a truly bone-chilling ride."}, {"rating": "6", "text": "If I talk about the movie \"Frozen \" First I talk about this and not animated by the liveliest have to fly me to \" The Hunger Games: Catching Fire\" , but getting back to this film was a boring oco , but had a magnificent chilling tone."}, {"rating": "7", "text": "better than disney's like literately everything else (just putting this to bypass the minimum character limit)"}, {"rating": "2", "text": "Bewildering. One of those hoes was iceman from xmen. Why couldn't he have uses his ice joints to escape? 2/10"}, {"rating": "3", "text": "Three skiers stranded on a chairlift are forced to make life-or-death choices, which prove more perilous than staying put and freezing to death. (3)"}, {"rating": "3", "text": "The acting was terrible, terrible ending, the middle was the best part and was actually very suspenseful."}], "recommendations": ["crawl", "paranormal_activity_2", "47_meters_down", "the_shallows", "bird_box", "chernobyl_diaries", "devil", "would_you_rather", "sanctum", "paranormal_activity_the_marked_ones", "escape_room", "unfriended", "doomsday", "the_strangers", "the_devil_inside", "slender_man", "paranormal_activity_4", "the_curse_of_la_llorona", "shut_in", "old", "unfriended_dark_web", "countdown", "28_weeks_later", "awake", "the_strangers_prey_at_night"]}