{
  "id": 1275,
  "title": "Funny People",
  "starring": [
    "Adam Sandler",
    "Seth Rogen"
  ],
  "runtime": 152,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "Famous and wealthy funnyman George Simmons doesn't give much thought to how he treats people until a doctor delivers stunning health news, forcing George to reevaluate his priorities with a little help from aspiring stand-up comic Ira.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gEYKD5cWCBGg8Za3hhwDBk3gEsP.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.375,
    "ending": 8.333333333333334,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.588235294117647,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "This would've been much better if Apatow had left his wife, kids and 30 minutes out of it."
    },
    {
      "rating": "9",
      "text": "If Apatow knew what and when to edit, this would be a perfect movie of loneliness, sarcasm, humor and redemption."
    },
    {
      "rating": "7",
      "text": "The movie was a little long and could have been cut shorter but that would have left out what Apatow was trying to accomplish here. I found it to be very funny, comedy and drama is interwoven throughout the entire film, sometimes unfortunately making the viewer feel a little distracted from the subtext of the film. I would for sure recommend the film."
    },
    {
      "rating": "10",
      "text": "Funny People is a intelligent, funny adult film. Now a days the genre of comedy is now sex. We get a number of new movies every year trying to milk the success of Judd Apatow films. Some of them are good and I can name a few. However they need to rely on crude and vulgar actions to get laughs. We get so many of those antics to the point of feeling disgust for the characters, but when the third act comes up we have to cheer for them it's dumb. Apatow's movies are different there fresh in orignatly and the crude and vulgar comedy is kept to a restrictive level. Thus giving us time to know the characters in between the big laughs. The movie starts with George Simmons played by Adam Sandler, he's a successful comedian and actor. He has stared in many films and is a prodigy to all standups. He lives alone and does mostly everything alone. One day he's sitting in a doctors office getting the news that he's been diagnosied with a rare form of cancer. His doctor firmily says it, he needs to try out expermental medicine. We then meet Ira played by Seth Rogen who's a up and coming comic trying to get out of the deli that he works at. One day George performs at a standclub that he has'nt been in three years. He notices Ira's performance and takes him under his wing as a assistant. They form a friendship and where George goes Ira goes. He trys to make ammends with his famliy and with the girl that got away, played by Leslie Mann who is married to someone else. So when George is thinking the worst his doctor tells him your getting better and tells him get a hold of your life again. You must think in a clinched kind of way he changes his personality and treat people better and go for the girl right? wrong, he exploits his condtion and tries to go for the girl. These are characters in a realistic plot. With problems and smart dialouge. Yes theirs crude and vulgar actions but it's done in a way that everyday people talk, with your friends, with your spouse. Judd Apatow did a very mature film proving you can mix vulgar and adaptable characters. This movie is based on everyday people with the only difference is that there Funny People."
    },
    {
      "rating": "0",
      "text": "Movie was waaaay too long. Boring. They should have copied South Park and put a counter so that they could count the number of times they used the F word. It's not shocking. It's not offensive. It's just stupid. The fim maker needs to grow up. Sandler sucked in this film. Will never pay for another Sandler film until I know exactly what it is. This one was the worst film I have seen in 10 years. That's no joke. And neither was (un)funny people."
    },
    {
      "rating": "2",
      "text": "Far too long and NO one in the theater laughed at any of the lame jokes. Was it necessary to use F... so often?"
    },
    {
      "rating": "3",
      "text": "Relentlessly repetitive. Frustrating for what it promises but never delivers. Watch Peter Falk...Cassavetes, if you want an American experience of a existential European film. Biggest sin: it is rarely funny."
    },
    {
      "rating": "2",
      "text": "One of the most unnecessarily depressing and brutally unfunny movies in a very long time."
    },
    {
      "rating": "3",
      "text": "Why do these movies have to be so vulgar? It sucked at the begingiing. But it got better at the end. still a bad movie. Not Funny."
    },
    {
      "rating": "10",
      "text": "It made me laugh and it touched me. It was deeply moving. Plus it felt completely original to me. Believe it or not, Adam Sandler actually has talent. The dirty jokes are hilarious. Great movie, great story."
    },
    {
      "rating": "10",
      "text": "This is an amazing movie. People's taste in humor will obviously vary. I imagine that anyone from older generations that never managed to get comfortable with anything vaguely sexual or crude will probably not find the movie to their liking. People in Apatow's core demographics - i.e. young men - will love it. It is a bit long, but I think most people are willing to spend time with quality."
    },
    {
      "rating": "7",
      "text": "I love Judd Apatow but this fillm is a step down from is others. It let me down but it was a good flick. I hope the next film is better. Seth Rogen is my favorite person in the entire world."
    },
    {
      "rating": "10",
      "text": "This is the best film of the year. This is definitely not a typical Judd Apatow formula comedy, instead it's more of a \"Dramady\". The result of this effort is just wonderful and refreshing in a Hollywood where absolute garbage films like \"GI Joe\" and \"Transformeras\" are more the norm. Adam Sandler delivers an Oscar-worthy performance as the emotionally tortured comic George Simmons, providing a depth of character and insight into the character that makes one believe the movie really is in large part about Sandler and not Simmons. Seth Rogen holds his own in a supporting role as Ira Wright, an up and coming comic that dreams of having the life George Simmons leads until he sees it up close. This film is as I said, the best film of the year by a country mile. It takes chances American films rarely take, and even at its length of over 140 minutes it holds the audience's attention and makes us care about the characters. A truly amazing achievement for Apatow and company."
    },
    {
      "rating": "7",
      "text": "Good for what it was a little to deep for a comedy. Hangover and Bruno still take comedy of the year for me."
    },
    {
      "rating": "9",
      "text": "It upsets me that people aren't giving it great reviews. I loved it. Really funny and its got heart too. I don't know what people were expecting that hated it. Yeah some parts should be trimmed down, but that doesn't make it worse than Transformers. It's intelligent, witty, and yet casual and warm. It's great go see it. And this is the first time I've reviewed on here so I'm going to vent, should there ever really be a 0 for a movie like Dark Knight when it was on here? Or a 10 for Transformers. A 10? It's insulting to other movies. A 0 should be saved for a Nazi snuff film or Hottie and the Naughty 2. Be realistic people."
    },
    {
      "rating": "10",
      "text": "Another great one from Apatow.... I loved Seth Rogen's character... the movie had meaning and \"touched\" you on a deeper level. The jokes are grade A and the story is a mix of funny and serious. All I have to say is \"Judd, keep these movies comin!\""
    },
    {
      "rating": "2",
      "text": "A self-serving disaster. Apatow casts his wife, his kids, his friends and hopes the whole thing will work out. So puzzling is the fact that the standup sequences lack insight and, worse, actual funny jokes. A better title would have beeN \"Cocks & Cameos.\" Sandler's performance was fine, at times wonderfully dramatic, but his story is cheapened by a ridiculous subplot involving (surprise) Apatow's wife and snockering kids. It's a conceit that derails the whole picture. Shame. And certainly not funny."
    },
    {
      "rating": "8",
      "text": "Knocked Up still remains Apatow's best, but Funny People is Apatow in prime form and for the first time in five years, Adam Sandler finally does a good movie."
    },
    {
      "rating": "9",
      "text": "It has being a long time since I saw great movie this year maybe too long.Apatow will be critize for the simple fact that he breaks the barries that he thy self form this is his best movie.Is a drama that starts in very familiar ground but in its development for something very unique with that said I am here to proclame that funny people is one of the best film we have seen so far this year.With Adam best performance of his life and Seth giving us something that many of had doubt that he has the ability to perform in dramas.Also the script maybe a bit loosing at the end but the the end it self was superior and open minded that give you a sense of future to come.Funny People comes from an unexpected source Apatow let away the childish comedies and grew to something superior and vast."
    },
    {
      "rating": "5",
      "text": "The premise was good, but seemed a little self-indulgent on Apatow's part. Way way way too long."
    },
    {
      "rating": "10",
      "text": "Brilliant, funny, a true masterpeice. A great comedic film with just enough depression to make it a drama flick and still be funny. I laughed and cried at the same time, if judd apatow movies are your nitch its a must see. Dont give it a bad review if you just dont like judd apatow, its his style its definately a really good flick for its style. 10 out of 10 (p.s. people think about what you put before you review something)."
    },
    {
      "rating": "9",
      "text": "One of the more underrated films of the year."
    },
    {
      "rating": "0",
      "text": "The worst film I have ever seen. I was in the cinema with about 50 other people...who were actually trying to find funny bits to laugh at. We were all sat in silence. People started leaving after an hour. A complete waste of money. It just went On an On and On and On and On and On."
    },
    {
      "rating": "1",
      "text": "The most boring movie of the year. My wife gives it 0."
    },
    {
      "rating": "6",
      "text": "At 2:20, Funny People is much too long (by about 40 minutes) but is made up for by quite good comedy and a decent storyline. However, many scenes were irrelevant and could have been cut out quite easily. I much more enjoyed Knocked Up, The 40-Year-Old Virgin and Pineapple Express better than this. Possibly Apatow's worst film to date."
    },
    {
      "rating": "2",
      "text": "Way too long and not believable."
    },
    {
      "rating": "10",
      "text": "Critics have been dying to pan Apatow. Some of these 30s and 40s are just embarrassingly obvious that they want to be clever. The problem is... the movie is fantastic."
    },
    {
      "rating": "10",
      "text": "Apatow's best film! you can tell he really put his heart into this one and he hit a homerun. an epic and brilliant comedy with an all-star cast that nail their roles! it has depth not seen in his prior films but not at the cost of any comedy. you will laugh your ass off and be left with something to ponder and reflect on. hangover was great, but there is no question this is the best comedy of the year...critics don't know sh.t about rating comedies. they never have...so many of them miss the boat entirely (case in point: Dumb and Dumber rated 39 on Metacritic)"
    },
    {
      "rating": "8",
      "text": "I really enjoyed this movie. Very funny and somewhat touching, has to be one of Adam Sandler's best performances. The only knock against it is it was about 20mins to long."
    },
    {
      "rating": "10",
      "text": "Can't say enough."
    },
    {
      "rating": "6",
      "text": "The funny parts were funny, but the story was long and mediocre."
    },
    {
      "rating": "10",
      "text": "This film has one of the best stories in a comedy. It is amazing and still lol hilarious at the same time. This movie works both as a comedy with a great story and a movie with a great story that just happens to be extremely funny. If you like Sandler, Rogen, or Apatow you must see this movie."
    },
    {
      "rating": "1",
      "text": "i gave it a 1 for the very few laughs and for Adam Sandlers performance which was, at times, good...... the rest was looong , boring, self indulgent.\rPoor Adam Sandler, he must not be able to say \"NO\" to Judd Apatow and got himself into this mess of a film. Sad for Sandler and sad for the audiences that were literally sighing with boredom in my theatre!"
    },
    {
      "rating": "6",
      "text": "The bad: I left an hour and a half into the movie. The good: It was good enough that I lasted that hour and a half! I don't know, maybe it will be like Punch Drunk Love in that I'll enjoy it better my 3rd or 4th time watching it. But as it was, it's definitely not in my top 5 of Adam Sandler movies."
    },
    {
      "rating": "0",
      "text": "Another lame dick joke bore fest that is 146 minutes!!! 146 minutes? Are you kidding me? Why doesn't anyone call these crapy Apatow movies out for exactly what they are, \"utter garbage!\" Stop telling me this crap is sophisticated and funny. I've seen funny movies and NONE OF THESE APATOW FILMS ARE FUNNY. Knocked up and Forty year Old Virgin sucked too (and were WAY too long!"
    },
    {
      "rating": "6",
      "text": "Apatow's first stinker. The third act made me want to strangle a stranger."
    },
    {
      "rating": "5",
      "text": "The first half of the movie is a funny and moving look at a comedian who questions some of his life choices as he faces a life-threatening illness. However, the second half of the movie veers off into a long, drawn out love triangle story, essentially killing what might have otherwise been a pretty good movie."
    },
    {
      "rating": "9",
      "text": "Very funny, I loved it, don't understand some of the weaker reviews. EVERYONE was laughing so much during this movie. It was a bit long but not too long. It really is like 2 movies in one. The first have is all comedy and jokes with a sprinkle of sadness. The second half was a lot more serious with a hint of jokes. You sure get your moneys worth, i'll tell you that much. Seth was great as always and Sandler always impresses me in movies that have an actual plot and comedy. Go see it, you will have a good time. Better than stupid BRUNO!"
    },
    {
      "rating": "7",
      "text": "Thought it was pretty good. Some very funny moments, and a pretty heartfelt performance by Adam Sandler; get this guy an Oscar nom. Movie is a way too long 2 hours and 20 minutes, though, and feels like it, and the jokes even begin to repeat themselves as the movie goes on (especially those involving a certain male organ.) Very funny movie at times, very touching movie at others, but the very long runtime and seemingly endless scenes of crying and sulking and a very unresolved ending (I found it brave, most may find it frustrating,) will have most people leaving the theater feeling tired rather than entertained. Good movie, if Apatow had cut the script down by about 20 minutes it may have been great. I love the personal feel to it; Apatow has his wife and kids in this, as he did in Knocked Up, and there are numerous real-life home movies of Sandler doing comedy and making prank calls scattered throughout. These are very likable characters and when they banter it's great fun. But it's just way too long a runtime for a comedy, and I'm very surprised that this fact wasn't picked up on in the movie's apparently numerous test screenings."
    },
    {
      "rating": "4",
      "text": "I was bored to death with this movie. The only good things about the movie were Jonah Hill and Aziz Ansari."
    },
    {
      "rating": "9",
      "text": "I love movies that get lots of 10s and 0s. A great work of art should get a strong emotional reaction from people, and I really enjoy great works of art. That's what this movie is, in my opinion. Apatow is like a better version of Kevin Smith, with a hotter wife. I am so glad he has stepped into the hole left by the Coen Brothers and Wes Anderson in making funny, intelligent movies. I can't wait to see what he comes up with next."
    },
    {
      "rating": "7",
      "text": "Overall very good movie, i totally agree with Emily M... the first half of the movie totally rocks, it's funny and moving really pulls you in. But the whole love triangle in the second half just drags, is painful to watch, they could have cut all of it out the movie might have gone down as a classic. Good performances from all the cast, definitly Sandler's best performance since maybe Punch Drunk Love and 50 first dates."
    },
    {
      "rating": "6",
      "text": "Here's the deal. It's not a bad movie, but although there are small bits of mild humor throughout, this movie is not a comedy, but the powers that be want you to think it is. If you're looking for a comedy the likes of \"Hangover\" and some of the other \"R\" rated stuff out recently, this is not your movie. Apparently they don't think they can sale Adam Sandler as a serious actor, and they very well may be right. Not bad - just not that good."
    },
    {
      "rating": "9",
      "text": "A great movie. It is however bound to defy expectations. This is not a funny movie, though it has some very funny bits in it. It is a movie about people who make other people laugh, and about what drives them to do so -- a whole motley of motivations that includes fear, insecurity, anger, lust. Funny people are, it turns out, people who have seen the dark sides of human existence and have developed a uniquely human coping mechanism -- laughter. The writing is as usual in Apatow films whip-sharp, and the actors revel in the space that they have been given by the writer/director to explore ambiguity and nuance. Sandler in particular is a revelation -- a performance that cannot be reduced to any one character trait. We hate him, pity him, love him, laugh at him, sometimes within the same scene. Will not satisfy those who think that comedy is about staged set pieces, but will resonate deeply with those who realize that comedy is a part of normal life. Sure, the movie sags a bit in the second half. But I respected Apatow's integrity in putting it up there at the cost perhaps of the movie's commercial viability. It is shaggy and sometimes misshapen, but then again so is life. It reminded me of an Arnaud Desplechin movie -- not a reference that one is accustomed to in thinking about an Adam Sandler flick, but the one that seemed most apt to me."
    },
    {
      "rating": "8",
      "text": "Judd Apatow is moving towards a more touching comedy and away from the his slapstick comedies. Funny people was a lot of fun, up to the middle where it became embarrassing. The awkwardness lasted about 30 minutes, but the rest of the movie was worth it."
    },
    {
      "rating": "3",
      "text": "Apatow knows how to write funny dialogue. It's too bad he doesn't know how to write serious dialogue, or a cohesive story for that matter. Funny People felt like a somewhat good movie tacked onto a sad attempt at a love story. All of Apatow's funny stuff seemed likes it belongs on a stage being delivered by a stand up rather than mashed up into a terrible movie. Big disappointment, by far the worst Apatow movie."
    },
    {
      "rating": "10",
      "text": "Loved it. This has to be Adam Sandlers best film. It was real, touching, emotional and hilarious. I cannot imagine why people hated it? There was so much detail! The whole Yo! Teach and Jason Schwartzmann thing was too funny, Seth Rogen is cute and funny as always and Sandler actually put in an amazing performance. The Crude humour and Adam Sandler acting like a tool was part of the social commentary of the comedy industry."
    },
    {
      "rating": "9",
      "text": "Has to be one of my favorite films of the 2009-other than a little lull in the second half-i can't comprehend the bad reviews some critic have given this movie."
    },
    {
      "rating": "2",
      "text": "Unfunny and verging on the revolting. I give it a star each for the two young ladies who delivered nice performances. You know what? Men, when they get together, unless they're gay, tend to talk about women's parts, not their own. If standup comedians are different, they should resist making movies about them. Utter tripe."
    },
    {
      "rating": "10",
      "text": "It was more than what I expected. Great movie."
    }
  ]
}