{"id": 554, "title": "Furious 7", "starring": ["Vin Diesel", "Paul Walker"], "runtime": 137, "genre": ["Action", "Thriller", "Crime"], "description": "Deckard Shaw seeks revenge against Dominic Toretto and his family for his comatose brother.", "releaseYear": "2015", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/wurKlC3VKUgcfsn0K51MJYEleS2.jpg", "categories": {"plot": 6.7555555555555555, "acting": 6.463414634146342, "ending": 7.62962962962963, "soundtrack": 5.0, "cinematography": 2.0, "familyFriendly": 6.0, "funny": 4.5, "action": 6.527272727272727}, "reviews": [{"rating": "3", "text": "Before watching Furious 7 I thought it was going to be another poorly written and directed blockbuster movie but I didn't expect it to be this bad.The fact this movie generated more than 1.5 billion dollars makes you think hard."}, {"rating": "6", "text": "Average at best to be honest. There are some really good action scenes but at the same time the plot has a lot of flaws. There are some really unrealistic scenes for this type of Genre as well, for example cars getting parachuted out of a plane, which sounds great but when you watch it, it looks so unrealistic. This isn't a film about super heroes! I have really enjoyed past F+F films but this one certainly wasn't the greatest. Not unbearable but average."}, {"rating": "1", "text": "Beyond belief absurd, stupid, phony, ridiculous, boring, formulaic, gay, silly, lame excuse for lame excuse for utterly preposterous big dumb sequel to too many big dumb unjustified beyond solely box office concerns sequels.  The only thing dumber than this movie is the fact that there will be yet another one."}, {"rating": "0", "text": "Ultimate nonsense! A movies that does nothing but hurt ears, waste valuable time, and make you sick! Even more unreal than what a child's idea of a fictional super hero movie might be!"}, {"rating": "8", "text": "If you go into this movie expecting something that the franchise has never given you, you will be disappointed. This a great action packed, turn off your brain and disregard physics kinda movie. The acting is spotty like it's been in movies before but it keeps you engaged. You can see the CGI in scenes where Paul Walker wasnt actually used but it's not too distracting. Definitely worth seeing in the theaters and will probably own it as well. The best part was how they handled the death of Paul Walker in real life and they send him off in the classiest way possible in the movie."}, {"rating": "6", "text": "The action packed Furious 7 drives on a impossibly narrow stretch of plot; but being part of the Fast & Furious franchise which doesn't exactly abide to the Laws of Physics, just about manages to scrape through. Perhaps it's strongest point is how, given the amount of over the top stunts it contains, still manages to deftly handle Paul Walker's character in an unavoidably emotional last several minutes. R.I.P Paul Walker."}, {"rating": "5", "text": "Generally very spotty and eventually generic. the fight scenes are the only goo thing, but they come too fast, and ofeten too underdeveloped.some inexplicable things happen, and no one seems to have the answers."}, {"rating": "0", "text": "Dumbest movie ever. Boring to the point of annoying the audience. Only car enthusiasts would be mildly enjoy this dull entry. How can anyone find it adventurous or even vaguely entertaining. Nothing in this movie suggests anything of value. The action lacks authenticity."}, {"rating": "2", "text": "Let’s cut to the chase. Again. Again. Dumbing, numbing farewell to Walker.\rFamily are not bullet proof-crash resistant-gravity defying Wallenda’s on steroids.\rIt's time to go super hero or go home.  And why keep a psychopathic killer alive who causes over 50 deaths  and one billion dollars worth of damage to Los Angeles- not enough imagination to come up with another evil villian for Furious 8? Catch the last two minutes if you want to pay your respect to a cool actor - you won't miss a thing."}, {"rating": "4", "text": "Furious 7 is action packed. Too much so. It detracts from the story. Which these movies already had very little to begin with. There was never a climax, as the whole movie tries to be a climax. Too much dramatic music/slow motion scenes and countless one liners that fall flat. I love the series, and Fast Five is one of my favorite action movies ever, but this movie didn't do it for me."}, {"rating": "5", "text": "I really can't like this movie.... I just can't... It's a cliched and generic action movie with cars. In fact, it felt like it was trying to be mission impossible. Don't get me wrong, the action was really fun and that is one of the redeeming qualities of this movie. That and the ending which has a tribute for Paul Walker and it made me cry like a baby. I just couldn't contain the tears. That ending and the action alone bring this movie up to a 5/10 (mediocre)"}, {"rating": "7", "text": "The movie is generic,ridiculous and unrealistic but that is what the franchise is.It really like the other fast furious movies but this time,it is now cliche and no-brainer to most people and for me I like it.This the fast and furious we're talking a dumb generic action movie that is only their to entertain people.I know it has a targeted audiences and I am one of them.It is a dumb movie that works for many audiences.\r And oh Good bye Paul Walker you're the best in the franchise!"}, {"rating": "1", "text": "I have never seen such a bad movie get this rating on metacritic. This movie is amazingly awful. It makes no sense, the acting is terrible, the dialogue is terrible, and the action is surprisingly terrible (shaky-cam, lack of focus, effects over actual choreography) as well. It really is a shame to waste money on making or seeing this movie.\r Amazing foibles: Half CG Paul Walker is like watching a Japanese \"real doll\" placed in an action movie (sorry Paul). The camera angles and dialogue surrounding him is so surreal. I was so distracted by the efforts to pretend he was alive for the whole movie that I couldn't focus on the movie, not that you need to focus to watch this nonsense. Also, the plot makes no sense whatsoever. I can't even describe it. They try to find a device to just track down Jason Statham, yet he finds the crew at every other scene. Also, for some reason they need to drive cars out of a plane to reach a bus transport, yet Jason Statham manages to be at the same place without falling out of plane. Why did they need to do it? They didn't. This whole movie did not need to happen.\r Vin Diesel is old, and just rambles on about family and the streets and other nonsense. HE WEARS A WHITE CUT OFF TO HIS OWN WEDDING. Classic Vin...\r Also, they go to Tokyo as if there is no time interruption from Tokyo drift, yet the Tokyo drift actor is 10 years older than he was in that movie. They really think the audience is dumb as a couch.\r This movie is just a series of scenes of people lining up for the camera and cars doing the same.\r Rant over. Too much. Cant..."}, {"rating": "7", "text": "Fast and Furious is seems to be one of those Franchise who still fun to watch even though it have so much sequel already ( i mean this is the 7 installment of this franchise so...)\r This is another almost mindless fun dump movie to watch for sure with the over the top action , racing scene like driving a car jumping from one building to another building i mean it's for sure really dump and the characters should be dead like a hundreds time already but in the end is it fun ? YES totally .\r One thing to mention though is the characters in this movie , as you might know that Paul Walker passed away while the film is not 100 percent complete , so this makes me want to know how they going to handle his character , and in the end i must say they handle really well and this is probably the perfect ending of his characters.\r Overall this is still the Fast and Furious we know and love about with all of these fun popcorn action scene and the bond between characters makes this movie worth the money to watch."}, {"rating": "8", "text": "Furious 7 is the culmination of numerous chances to set the bar for high-octane action movies that comes together and makes for quite the ride.  Know that this movie doesn't focus on excellent dialogue and intricate plot development.  It's about cars, crazy people, bringing back the insanity of 80s/90s action movies, and the eventual sending off of Paul Walker.  The end sequence that uses Wiz Khalifa's \"See You Again\" is perhaps one of the most tender moment in movies I've seen in a long time, which is so amped up because Paul Walker was not present in the completion of filming this movie due to his unfortunate death.  Seeing a character that was digitally entered into scenes at times was incredible because I never knew the difference.  Furious 7 will certainly please the fans of the series, and if you're an action movie connoisseur then this is an easy recommendation.  Don't come looking for the next Jason Bourne or James Bond series.  This is just simple fun for audiences to chew up for two hours."}, {"rating": "8", "text": "Well I finally got around to seeing this. It's definitely more of the same. I'm always eager to see how each new installment of this franchise will outdo the last in terms of ridiculous, over-the-top stunts and action scenes. Sure enough, this one manages to do it with a car jumping out of a window between two buildings (twice!), Paul Walker climbing out of a bus hanging over a cliff, etc. Regardless, it may be mindless, but it's also undeniably entertaining and has the same great cheesy dialogue, action, and charm we've come to know and love from the franchise overall. Also, the last five minutes of the film, in my opinion, is arguably the best part. You'll see why when you watch this."}, {"rating": "8", "text": "I really enjoyed this movie. It was a very dumb movie but it was also a really fun watch. It knows what it is which is good enough for me, as long as the movies knows that it's dumb then I'm alright with that. Paul Walker's send off was also very touching.\r8/10"}, {"rating": "7", "text": "The film is good, the action scenes are great, the unrealistic film, the story so that is good, but the focus is really on the action, the film is very entertaining and good to watch."}, {"rating": "8", "text": "Despite bad developed villains and an unnecessary appearance of Lucas Black, Furious 7 is by far the best film of the franchise. Great characters and a higher level of action, now with even more amazing car sequences. Script choices concerning O'Conner were correct and gave him a natural and plausible ending in the story that began back in 2001. Special effects are also stunning, specially in completing the remaining scenes of Walker. Seven is enough and another sequel, this time without Walker, won't be the same thing. Sometimes it's better to know when to stop and this is the perfect moment for it."}, {"rating": "3", "text": "How can people love this movie ?\rAfter watching this piece of **** for 2 hours, I wish it would be considered one of the worst movies this year.\rThe fight scenes are boring and seen before, not a single funny moment, half of the lines were super cliche, and the worst thing- THERE'S NO DIFFERENCE FROM THIS FILM TO THE OTHER FILMS IN THE SERIES.\rThis movie is a proof the F&F series isn't gonna be good anymore. This movie is just stupid, boring and just bad."}, {"rating": "10", "text": "Tear Jerkin Tribute:\r I’m pretty big on “men shouldn't cry.” Little did I know I was going to be sitting in a movie theater full of men just as emotional and teary eyed as I was.  Although I never cared for the series of Fast and the Furious movies because I thought they were mostly about street racing, Fast and the Furious 7 really tugged at my heart because it was about family and friends. From the beginning of the movie up until the end it left me anxiously waiting on how the movie would end and how Paul Walker’s character would exit the film. Walker passed away in a tragic car accident in 2013.  Before watching the film, I had a girlfriend tell me how her date was teary eyed towards  the end of the movie. My reaction was “uh that is not cute.” Little did I know that I was about to be snot faced and an emotional wreck. This movie had the right amount of humor.\rBy the first scene I could already tell the movie was going to have impeccable special effects. There was one scene were they drove the cars out of the plane; they were going sky diving while in the vehicles. The cars even had parachutes. WOW, who thinks of these things? I was like a kid watching all the super cool scenes. I was definitely impressed. One critic, on meteoritic.com wrote: “the movie plods along muscling through without much life or spirit.” He clearly was not watching the same movie that the rest of us were watching. From the very start of the movie to the end, there was a smooth flow into the next scene.\rAt one point in the movie you could see the genuine and emotional tie that they had to Brian. Paul Walker’s recent demise had plenty to do with why the emotion and tears at the end of the movie were so hard to watch for many movie goers. It added a warm and touching end to the movie. A specific scene in the movie that was so heart felt and emotional was when the group was saying bye. Dom( Vin Diesel) was saying good-bye to Brian (Paul Walker), but it almost felt like he was saying his good-bye to the character Brian and Paul Walker. It was as if the movie and reality had become mingled into one. Dom says, “I used to say I live my life a quarter mile at a time and I think that's why we were brothers — because you did too. No matter where you are, whether it's a quarter mile away or half way across the world. The most important thing in life will always be the people in this room, right here, right now. Salute mi familia. You'll always be with me. And you'll always be my brother.” Imagine being at a movie theater and hearing this right after watching two hours of action packed-humor.\rI gave this movie an A+. If it can make a grown man cry then it it's a must-watch in my book. You will not be disappointed!"}, {"rating": "3", "text": "very bad film , the acting is terrible, the dialogue is terrible, and the action is surprisingly terrible , this movie is far away from reality how people think that its cool? its like trash! you guys like to listen trash! this movie are like trash how can have so much fans? its because of paul death? wow"}, {"rating": "4", "text": "Whoaaaa what an average movie.It's just another typical blockbuster film.Insane,full of explosion and boring.What make this movie boring is James Wan can't keep the pace and it's tension.The first half was great (From Caucasus Mountains scene until Dubai),but the second until the third (After Dubai until full of kaboom scene in LA) is weaken.It feels like Roller Coaster.The ending was tear-jerking,But it can't save the movie.They need to stop to make another sequel.It's time for Toretto's Family to take a rest. (It's just my opinion)"}, {"rating": "4", "text": "What a ridicuous film! Some delightfully hilarious violence and gleeful action sequences shot with engaging cinematography made for an uproarious experience visually, but that is where the praise must end. The dialogue is beyond terrible, product placement is utterly horrid and woefully integrated, in fact any time a 'storyline' is attempted, the film loses its way entirely. The performances are nothing short of abysmal and the 'male gaze' is thoroughly nauseating. I still had fun as I have a weakness for action films, but don't expect anything beyond some glitzy stunts. 3.99/10"}, {"rating": "4", "text": "ok this movie is far far away from reality,i just watch it yesterday\r its ****\r the main characters kill thousands of bad people with out scratch !!!!\r he jump from building to other with his car with out a scratch"}, {"rating": "7", "text": "Furious 7 is a fast-paced, action packed thrill ride that has little regard for realism in its action, as it should be. Do some parts of the movie seem ridiculous? Yes. Does the comedy fall flat sometimes? Yes. Despite that, the plot holds well enough and there’s a lot of fun to be had in watching the fight/drive sequences, which is what matters most in a F&F film. Lastly, kudos for the amazing send-off to Paul Walker at the end! Furious 7 is a good, fun movie that merits being watched some more."}, {"rating": "5", "text": "I really wanted to like this movie. There haven't been many in the series that I thought were really good. The first one is by far the best in my opinion and I believe that it has to do with the more limited budget forcing more realistic car sequences and more believable action. These types of movies need to get back to the type of chases that made Bullet and the French Connection chases classics that people still talk about.\r I thought having Statham in this movie was going to raise the fight sequences to the quality of movies like The Transporter, but I was wrong. Statham's talents were mostly wasted as were Tony Jaa's. They could have easily been replaced by just about anybody and nothing would have been different. These guys really should have been on opposite sides of this fight so an epic clash could be filmed.\r With Diesel doing voice acting in movies like Iron Giant and recently Guardians of the Galaxy, I feel like there is a very legitimate actor under all of that muscle that has been mostly overlooked or paired with bad scripts for most of his career. This is no real exception. All of the dialogue between him and Rodgriguez was cringe worthy and the filler dialogue between wasn't much better.\r The only thing I thought this movie got right was the tasteful tribute to Paul Walker. The way they handled it brought satisfactory closure to the character but leaves it open for further installments. Although, at this point, I must say unless they are willing to up the quality of the writing and get back to more realistic action (which can be just as entertaining) they should just stop now."}, {"rating": "7", "text": "After Fast & Furious 6, I thought that we really didn’t need another F&F movie. Add the fact that the plot of Furious 7 is just Owen Shaw’s brother (Deckard Shaw) seeking revenge, and Furious 7 seemed like a somewhat unwarranted movie. Not because I was tired of F&F movies, but because I thought there was no reason (at least story wise) to keep making them. (Of course, there was still the mystery of who killed Han, but that’s beside the point.) Nevertheless, I was enticed by the trailers and TV spots for F7. The promise of more impossible car stunts and dumb, crazy action lured me in.\r The plot of F7 is as realistic as you can imagine, with lots of vehicular mayhem in Abu Dubai (that somehow doesn’t get Dom & Co. in trouble?) and a dues ex machina computer program/MacGuffin that can track anyone, anywhere in a matter of seconds (called \"God's Eye\"). But these illogical things are typical of the Fast & Furious movies, and at this point I don’t expect anything different. Due to this though, I’ve heard people negatively compare the F&F franchise to the Transformers franchise. However, IMO the Transformers movies have become heartless, boring, cash grabs. On the other hand, the F&F franchise at least has MOMENTS of comedy, excitement, and true heart. The F&F stars are also likable, and relatable. After seeing these characters together for 7 movies, they’re obviously more acquainted with each other than the average Hollywood movie cast. They have authentic chemistry.\r If anything, Furious 7 is a Michael Bay-esque movie done RIGHT. While many of the events in F7 are really ludicrous, the overall themes of the movie & franchise (family, loyalty, vengeance) help keep Furious 7 from feeling like bloated with CGI and one-liners.  Once again, the latest F&F film has been able to walk the line between just-for-fun, over-the-top popcorn flick and lazy, unimaginative Hollywood sequel. (Though I'm not sure that that will happen again.)\r I definitely had a fun and enjoyable cinematic experience when I was watching Furious 7. The action sequences were as ambitious and over-the-top as always. F&F 7 is determined to top all previous films, and it succeeds--but is that such a good thing? (Nevertheless, films are a type of escapism from our unfortunately too-realistic lives. So don’t feel bad about giving Furious 7 a large amount of suspension of disbelief.) However, I think that this latest movie asked for too MUCH suspension of disbelief. How many more car crashes and shootouts can Dominic Toretto & Co. survive? Are you telling me that Dom stood his own against Deckard Shaw, when an entire Special Ops team couldn't? And why didn't the US government intervene at all when a weaponized DRONE was in Los Angeles, and when Dominic was driving a super-car through skyscrapers?\r I think it’s fair to question the future of this franchise. Furious 7 actually managed to top Furious 6, but how will future films KEEP topping what has been done before?  F&F 8 won’t be the same without Paul Walker (R.I.P). Brian O’Connor was one of the main characters in the franchise, but Paul Walker has passed on. Will Dominic Toretto, Letty, Roman, Tej, and Hobbs be able to sustain this franchise by themselves?\r Also, some of the F&F family are still struggling to have meaningful dialogue, like Tyrese Gibson as Roman and ‘Ludacris’ Bridges as Tej. They both have too many one-liners. Besides that, some actors were little more than cameos to appeal to all demographics--like Tony Jaa (as the martial arts expert that Brian fights), Djimon Hounsou (as the leader of a band of militant mercenaries), Ronda Rousey, and Iggy Azalea. (By the way, also think we should’ve gotten to know Ramsey a bit better.)\r As a whole though, forgiving some of F7’s flaws, Furious 7 is an entertaining movie. It delivers on it’s promise of big budget spectacle, and it also provides a send-off to Paul Walker. (To be honest, I did get slightly emotional during that final scene.)\r I have reviewed 40 movies (on Metacritic and IMDB) including the 2014 and 2015 films: The Divergent Series: Insurgent, Taken 3, The Interview, Exodus: Gods and Kings, The Hunger Games: Mockingjay Part 1, Dracula Untold, The Maze Runner, Nightcrawler, The Equalizer, The Expendables 3, Teenage Mutant Ninja Turtles, Guardians of the Galaxy, The Giver, Sharknado 2, Dawn of the Planet of the Apes, Transformers: Age of Extinction, Edge of Tomorrow, X-Men Days of Future Past, Godzilla, The Amazing Spider-Man 2, The Lego Movie, Divergent, Transcendence, Jack Ryan: Shadow Recruit, and more.\r I also review other TV shows, such as: Agent Carter, Empire (2015), The Flash, Arrow (Season 3), Gotham, The Last Ship, Sleepy Hollow, Marvel's Agents of SHIELD (Season 1 and 2), The 100, I Wanna Marry Harry, Crisis, Gang Related, and more. I also have reviewed the mobile Android games Minecraft: Pocket Edition, Clash of Clans, and Five Night's at Freddy's"}, {"rating": "9", "text": "Furious 7 is just a dumb movie .......a dumb movies that is really great, The ending is really touching and is a great tribute to Paul Walker may he rest in peace the movie is so stupid that it's great"}, {"rating": "8", "text": "Over the Top car stunts, combined with a great sense of fun, and fast paced action sequences make Furious 7 a great example of dumb fun done right. Perhaps the greatest strength of Furious 7 is that it takes the stunts of the last film and ups the ante even more. Even more impressive is that while the whole film thrills the part that will hit you the hardest is the unavoidable ending."}, {"rating": "2", "text": "I'm honestly glad that this is the first entry to the Fast & Furious series I've had the patience to see to the end. I am now acutely aware that there was nary a worthwhile cinematic moment I have missed in the entirety of this seven-film-long franchise. Don't misinterpret what I'm about to say. I'm not going to be broad or **** around what I mean to say so as to avoid making diehard fans of this franchise angry. This is a BAD movie. Not a good movie. Not an average movie. Furious 7 is a BAD movie. My brutality is warranted, I assure you.\r I'll begin with the positives, however few and far between they are. The most laudable aspect of Furious 7 is it's unintentional hilarity. This is also it's most egregious flaw. When I am reduced to stifling fits of laughter during a moment pitched DEAD serious, something is wrong. On the other hand, I can't deny that I had a blast tearing this to shreds. This is a film that wears it's heart on it's sleeve, and I'm probably a bit to blame for being such a cruel . But with a script composed almost entirely of action-movie catchphrases (lines like 'Woman, I am the calvary') and the realism of an Uwe Ball film (I found five planes skydiving from a carrier jet a pretty tasty bit of ludicrousness) I would advise anyone going to see this try to see the mockable quality of Furious 7 as a beacon of humor in what is otherwise a stone-faced watch. Legitimate attempts at laughs are something else entirely, so juvenile, half-hearted, and plain unfunny that they feel awkward and embarrassing (I'm looking at you Tyrese. Just shut up).\r Lin also manages to achieve fleeting instances of legitimate watchability. Some action scenes aren't too silly and some of the dialogue isn't ripe with cliches or bad jokes. The tone maintained throughout is refreshingly devoid of mean-spirited macho vibes, just idiotic ones. The only other mention of positivity I have is that Furious 7 doesn't offend too many sensibilities other than the cinematic. It's not homophobic or racist, like Michael Bay's films, it's just sexist.\r All that aside, Furious 7 is a god-awful seemingly-endless pummeling of explosions and machinery smashing machinery. I wouldn't take up an issue with it if it were filmed with clarity or some sense of artistry. The audio is cacophonous as hell, almost to the point of inducing migraines. The storyline is so ripe with plot-holes, I can't begin to dive into how devoid of logic the procession of events in this film are. Vin Diesel and co deliver their dialogue with such a lack of a enthusiasm, even though I'm sure they were more emotionally invested in this outing over the death of Paul Walker, they fail to show it.\r There is a memorial of Walker at the end that I should mention, which is a legitimately thoughtful, logical ending to his character's arc. It's fitting and respectful that he wasn't killed off. The recreations of Walker are noticeable, though. I appreciate the effort to sow him into the narrative, but you'll take note of his long silences and body doubles. It's a shame, both Walker's death and the repercussions it has on the franchise, particularly this transitional entry.\r The melodrama that Furious 7 pitches at the audience is almost soap-opera-level over-the-top. We aren't invested in these characters, period, and the amnesia storyline (apparently introduced in the sixth film) is unforgivably preposterous. Beyond unbelievable, it's plain cliched and dull. Boring, to be honest. And I shouldn't have that feeling about a film that involves high-octane vehicles crashing into each other.\r I refuse to accept that filmgoers should suspend their disbelief to the extent that Furious 7 demands them to. The fact that film critics have become so lenient to the point where films such as this garner higher aggregated scores than such films as Fight Club is appalling. There is better escapist entertainment out there if you feel like shutting your mind off and relaxing while imagery goes by without coherence. The dehumanization of female figures, inclusion of unfunny, awkward humor, lack of logic, and relentless vehicular mayhem make me feel like Michael Bay comparisons are not unwarranted, yet somehow not drawn by critics that refuse to demonize this level of thoughtless blockbuster entertainment. Avoid at all costs if you haven't yet seen a Fast & Furious film, if you already have, there's pretty much nothing to say."}, {"rating": "6", "text": "The movie is kinda mediocre, didnt stood up to the name of F&F Franchise name...\r I understand it is kinda tribute to Paul Walker and total respect there and last 5min's literally took my breath away.. but the movie didnt stood up to expectation, just no excitement through out the movie...weak story....\r Kinda disappointed as well, still worth one watch..."}, {"rating": "10", "text": "We were very exhausted after watching this movie of non-stop action. We also always love how Letty can be sexy and tough. Of course, we were trying to figure out when it was Paul Walker or when it was one of his brothers. Similar to \"Raintree Cointy\" trying to figure out which scenes were after Montgomery Cliff's horrible car accident. But you can't tell about Paul. They did a great job with a wonderful send off to Paul. We can now watch his other movies remembering him fondly and as if we knew him. For a movie with so much action, it also has much sentiment which is sorely needed to balance the movie and make the franchise worth watching for different personalities."}, {"rating": "6", "text": "Number 5 was best because the story made you think. This movie, like #6, has very little story but lots of action. Action scenes at the end are way too over the top, like jet helicopters and drones chasing cars in L.A. Good movie that could have been great if the movie makers spent more time on story instead of crazy and unbelievable action scenes, how many times does Vin Diesel crash full speed into stuff before we say \"come on, give me a break!\""}, {"rating": "9", "text": "As ridiculous as it's always, James Wan steps in with a lot of surprise without revealing much in the trailers for the Furious fans base, proofing that the risk of franchise fatigue can be excluded as long as the the story keeps moving into new directions. The story succeeds by maintaining perfectly the racing cultures, hilarious fun and unstoppable action sequences from its predecessors, expanding into an explosive scale that audiences might feel that it owns some shades of Mission Impossible and The Dark Knight trilogy. Engagement achieved in this 15-year-old franchise plays an essential factor in delivering unexpected plot, good performance, characters development, cinematography, stunning visual effects, thrilling races and blasting fight; even Brian Tyler puts in an extreme heartfelt effort to bring more stylish, adrenaline-driven, impulsive yet emotional soundtracks. This seventh attempt of speeding appears to be the best entry since Fast 5, with an exception that the beautifully crafted ending may seems perfect as the final film, not only triggering the tears of audiences, but also intentionally a metaphor farewell to beloved Brian O'Conner and an impressive tribute for Paul Walker."}, {"rating": "7", "text": "Furious 7 delivers everything fans of the franchise desire. The same fun characters you’ve grown to love, beyond ridiculous action sequences and pays Paul Walker the farewell he deserves. While I didn’t enjoy it as much as 5 or 6, it’s still a very fun movie."}, {"rating": "7", "text": "This film is not the best in the series, but it still have some great thing to talk about.\rThe actors: not bad, but it got some faint in each charactor.\rThe stunts: Fast n Furious series always make everyone suprise.\rThe music: awesome.\rThe story: a little predicted.\rThe action: awesome.\rWonderful ending for Paul Walker, thanks Paul ! RIP"}, {"rating": "7", "text": "It's what you expect out of a F&F film. I've never been a huge fan of the franchise, but this movie was quite entertaining. The plot was ludicrous and quick, the stunts were crazy, the acting and comedy were fine, and it was unrealistic, but it is a good popcorn flick that will keep your eyes glued to the screen because of all this. I thought this could have been a cash grab off of Paul Walker's death, but this movie proved to be more than that and probably the best film of the franchise. An emotional final tribute to Walker also showed how much heart the cast actually tried to put into this film. Overall, it ain't a must-see, but its a solid and entertaining film that I would recommend to anyone, fan or not."}, {"rating": "7", "text": "Part 7 of the film series actually makes up where Part 6 ceased.\rThe car stunts are the well meaning but each must be aware that this is almost always only CGI effects. The story itself is just what accessories ihrgend just as there is.\rGuest appearances of some women and men are also available.\rThe locations are chosen also top notch.\r Conclusion: Convincing the film boasting large car stunts, but with a weak story leaves many feathers."}, {"rating": "7", "text": "Fast & Furious 7 is in my opinion the best movie in the series, which isn't really saying much considering the entire franchise is just above average. The action scenes were entertaining but there was just way too much of it, also some of these action scenes were complete rubbish. It was a very emotional and entertaining movie overall but it dragged on a bit too much. What i do like about this movie is the very likable cast, especially Hobbs (Dwayne Johnson). Overall it's a good movie that i recommend to anyone with some time to kill."}, {"rating": "10", "text": "It was anicipating for this movies. But, It was really sadden me of Paul Walker death so much. I wish the next Furious will be dedicating to him since this was his last ride...\r The action dosen't seem to bother me...."}, {"rating": "7", "text": "I didn't think I was going to like this movie because generally speaking, I'm really not into these kinds of action flicks that are huge franchise based. But I wanted to see what all the hoopla was about.\r And boy oh boy, was it worth every penny I paid.\r To be honest, I almost fell asleep during the first third of the film. But by the time the plot took flesh and the action started I was bolted wide awake.\r Action-packed, engaging, sometimes even funny.\r I especially liked the tribute to Paul Walker at the end of the film. I didn't know of Paul Walker until he died, and I thought the tribute was a very nice touch."}, {"rating": "10", "text": "Every Fast and Furious episodes in the series are most likely about cars and action scene, lack stories. Which isnt a bad thing, for some reason. I personally do not mind, although i enjoy a movie with better story. However this episode of the seires, which may be the very last we get to see paul walker again has probably the better story of the series and outside of the movie.\r The movie itself isnt that bad, nice action scene, really nice action scene. The story is alright, but considering a movie that is base of the characters' relationships (Family comes first, something I believe on) and cars. The movie it self is a personally taste, whether you like action more or story driven movies. I personally dont get why people dont like watching action movies, it still has a story. The quality of it is a debate for another day, but the entire F&F series actually tells a good story. Believe it or not, since its an action based film.\r However the biggest thing about this film is Paul walker-RIP. Paul walker passed away on November 30, 2013, at first I was sad, I was fascinated by how the movie is going to be developed when it was half done. But the pain didnt stay for long, considering im actually a huge Paul Walker fan. Now that the movie came out, wow. When you finsihed the movie, you realised that this is the last time Paul Walker will be in a movie and LUCKILY its the F&F franchise. Let that sink in, the last, very last, Paul walker's movie.\r Paul walker's impact on the franchise, is something worth applauds for. Not just the relationship with the cast but how well he represented his character. He did it so well, that you cannot imagine another actor playing Brian O'Conner. But at the end its the fact that he died 1.5 years ago from now, the whole cast was in tears because, one of their family just died.\r Family come first, that was what I learnt from the movie. Rest In Peace Paul Walker. You will be missed, in the movie and outside of the movie. To be honest, I dont really know what to write. Im extremely sad that this is the last time I get to see part of Paul walker again."}, {"rating": "7", "text": "If your expecting an excellent, in-depth story then don't bother. But then again, why are you watching a fast and furious film? As a newcomer to the series, I have to admit - it was dumb, but in a good way. Fast cars and exciting over the top gunfights made the whole experience just fun, comical and enjoyable. If you like explosions, guns, cars and destruction (and let's face it, who doesn't?) then you will love this film."}, {"rating": "10", "text": "The applause from everyone inside the IMAX theatre in CC Colombo in Lisbon Portugal at the end of the film summed it all up for me. I intend to watch this one again - definitely worth the watch and glad to see the \"old school\" come back into play here! Even though Paul Walker is no longer with us (R.I.P), I am definitely itching for the follow-up to this one - although there wasn't an ending spoiler (thank god for that! It made Brain's farewell that much more special) there are many lose ends that need ... a continuation :) 5 Star material for me! Action is Action - if you want to see mushy or overly technical films where you need to keep stimulating your brain to enjoy, sure, it's in the cinema next door.  Here, we just want it \"Fast and Furious\"! :D Bring it on!"}, {"rating": "9", "text": "Fast 7 probably has the strongest story of all the F&F movies, as they tie up every loose end. Then there are the stunts, awesome, incredible and breath-taking. Fast 7 is one of the most entertaining movies you will see this year, so I suggest you grab some popcorn and get yourself a seat."}, {"rating": "1", "text": "I was never a fan of this franchise, except 5 and 6 and unfortunately this one was simply stupid. Basically is the same over and over with the \"family\" winning at the end...and the worse is that not even the action scenes entertained me because it were dumb and ridiculous. The acting is poor, the characters are pretty basic, there's nothing new in there, it has become simply annoying. They had Statham and Kurt Rusell but still their characters were badly constructed, The Rock should had way more screen time...And sorry to say this but i notice that CGI Walker was fake, but still i respect them for trying. Overall, don't expect nothing different, it's entertaining but pathetic. Just go watch it because of the last 5 minutes to pay your tribute to Walker and skip the rest...I really don't get why it has this score in Metacritic."}, {"rating": "4", "text": "This movie is literally One Liner: The Movie. I tried very hard to enjoy everything other than the explosions and set pieces, but come on with the writing and acting on display here. I know Johnson can act better. I know Diesel can act AND write a whole lot better, as he was really crappy here. But not a minute passed without some freaking terrible one-liner and some hamfisted dialogue. I like you Vin, you're an awesome guy, but you could have done a whole lot better here. I agree highly with the negative review claiming you need to enjoy motor oil in your popcorn to like this movie."}, {"rating": "10", "text": "As for me this flick was the best action film since Matrix. It was so amazing I do not want to visit movies for a long while. They managed to tie in story and amazing action together which is mostly unique to the video game industry. Entire movie was full of surprises and Jason Statham is a badass villan.\rThe synergy of all these famous actors is amazing. and the stunts were jaw dropping.\rThe only negative part about this movie was how packed the theater was.\rRIP Paul."}, {"rating": "7", "text": "Furious 7 knows its dumb and rides it all the way. Its out of control and fun throughout, with action sequences that are clearly over the top but done well. Its tribute to Paul Walker gives the movie some heart and meaning mixed in between all the action."}], "recommendations": ["the_fate_of_the_furious", "mission_impossible_iii", "transporter_3", "jason_bourne", "salt", "xxx_return_of_xander_cage", "6_underground", "the_marine", "the_mechanic", "infinite", "kingsman_the_golden_circle", "need_for_speed", "the_a_team", "death_race", "bloodshot", "transformers_dark_of_the_moon", "vantage_point", "the_expendables", "crank", "wild_card", "transporter_2", "lockout", "poseidon", "the_expendables_3", "mad_max_fury_road"]}