{
  "id": 281,
  "title": "Fury",
  "starring": [
    "Brad Pitt",
    "Logan Lerman"
  ],
  "runtime": 135,
  "genre": [
    "War",
    "Drama",
    "Action"
  ],
  "description": "In the last months of World War II, as the Allies make their final push in the European theatre, a battle-hardened U.S. Army sergeant named 'Wardaddy' commands a Sherman tank called 'Fury' and its five-man crew on a deadly mission behind enemy lines. Outnumbered and outgunned, Wardaddy and his men face overwhelming odds in their heroic attempts to strike at the heart of Nazi Germany.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pfte7wdMobMF4CVHuOxyu6oqeeA.jpg",
  "categories": {
    "plot": 6.666666666666667,
    "acting": 7.081632653061225,
    "ending": 6.352941176470588,
    "soundtrack": 8.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 5.5,
    "action": 7.473684210526316
  },
  "reviews": [
    {
      "rating": "3",
      "text": "A truly, truly terrible movie. It must be said. The fact that people would call this travesty a \"good world war 2 movie\" is just soul crushing in the worst way. It's hard to find where to begin in this review, so I may as well jump into it. I found myself actually hating all the main characters but one, and the one I didn't hate is purely on the account of him doing absolutely nothing. The film tries to be dramatic and thought provoking but all it really accomplishes is making me feel uncomfortable for no reason at all. It shallow and sporadic in its tone and mother of all thats holy the final two fight scenes are a true travesty beyond compare. I wont spoil anything, but the sheer level of stupidity displayed by the German soldiers is unbridled. Its nonsensical in all ways. Even taking into account the wiggle room afforded by movie magic does this film just insult my intelligence by asking me to believe that the Germans would be so keen as to just throw themselves in front of the enemies guns. Its absurd and breaks immersion and is bad. Just bad. The movie was bad. The characters were bad. The German acting was bad (boiled down to \"SCHENLL FRITZ SCHENLL SHUTZ DIE AMERICANA!\". I walked away from this movie feels disappointed and just downright dirty for having watched it and severely regret spending the $10 I did."
    },
    {
      "rating": "10",
      "text": "Much better than I expected and is a movie even women will enjoy. It is more about relationships built in war and less about the war. Good tank fighting scenes also and the acting is wonderful."
    },
    {
      "rating": "2",
      "text": "This movie was something far from what I expected. When going into a World War 2 movie I have nothing but fond memories of seeing camaraderie and people banding together, mercy and suffering, beauty amongst all the pain in the ways the soldiers interact not only with each other as brothers in arms but with their enemies as warriors of the highest caliber. Respect and honor and so forth. I also believe it's important to involve scenes depicting the depravity of war, war in all its shades from darkest moments, to light hearted conversations, to acts of valor beyond the normal human's comprehension. Fury attained some of these goals yet they were few and far between. It captured the depravity of war than went on to blow it into epic proportions with soldiers cussing at every five second interval, looking at women in captured towns as meat for them to rip into at their own leisure, and what may have been others was now, well, theirs. Fury disgusted me in this showing of barbarism, I feel as if the director looked at World War 2 propaganda and decided that was all their was to the war. I know very well that war has these incidents yet this often? It made me think it was some child trying to convince me of the brutality of his mother's beating by over-exaggerating every detail. The battle scenes were incredible, and executed perfectly even the explicit language had some sense when used in these scenes, aside from the overdramatic effect of some weapons they were quite well done, until of course the final fight scene. Ah, the final scene, where Fury finally attained the essence of camaraderie among the soldiers and made you root for them every second, until you realized they needed no help against the Nazi's they were fighting. To call these SS Nazis, soldiers was almost a laughable idea. The SS were known for their brutality and amazing battle skills, but apparently if you pit them up against a Sherman (a tank mocked by even the American's themselves when sizing them up to any other tank) they fall like flies, throwing their bodies at it until something cracks, refusing to fire weapons thinking it'd be safer to rush the tank and wave their arms wildly to stop the gunfire. You may think an RPG even in World War 2 was able to be fired from a distance, but according to Fury you'd be wrong, and even point blank it seems as if these RPGs can miraculously miss a shot worse than a musket from ages past. It's hard to believe these \"SS soldiers\" could even walk without falling over themselves. I feel if any veteran actually saw this movie they'd wonder why they themselves ever feared these spoon fed children. Some people might say \"Oh, but the Nazi's recruited everyone at this stage in the war, in fact it was stated in the movie.\" in which case I'd say yes, it was stated excellently so in fact. One of the few moments where the American's seemed almost likable was when they executed the SS officer who hung children. But I would also say that although they recruited everyone, the SS was something you were not thrown into unless you deserved it. I found myself almost rooting for the Nazis after the forced execution of a surrendered soldier. Fury made our Golden Generation of warriors seem like monsters. If the director of this film (I had no intention to try to memorize the name of the director after seeing this movie) read into even a piece of war accounts by soldiers and reporters in the field, he/she may have realized the way our soldiers actually behaved was courteous and kind in most accounts, of course there were times when our soldiers were out of line but they were almost always stopped by a commanding officer. Nonetheless the worst part by far was the fact that Fury made the SS look merciful compared to us. I know the cliché of \"young soldier spares enemy because of some level of compassion and fear\" but an SS soldier? Really? An SS soldier would have killed him on the spot, yet it shows our soldiers ruthlessly murder a surrendering Nazi? This movie had few good points, I'm sure if any veteran watched this movie they would be disgusted at how they were portrayed. All in all the movie isn't worth the price of admission, it was a wasted two hours of propaganda to try to slander our Golden Generation."
    },
    {
      "rating": "5",
      "text": "Whenever a Tiger I tank and SS troops appear together in a movie you can bet the federal gold reserve on it that this movie is not about historical accuracy. This doesn't mean that Fury has no a sense of historicity, but  world war II movies are actually never about world war II but about the spirit of the time they are made in. If you don't believe me, just (re)watch Kelly's Heroes and compare it to Saving Private Ryan.\r The spirit of Fury isn't a pretty one if we are to take our queues from the crew that operates her. During most of the movie they never display any redeeming quality that would endear them to us, they are a truly sad crew.  We have reached the bottom of the well as far as humanity goes. Even Apocalypse Now isn't as gloomy as this one. These are dark times were the best are the worst or the other way around. Well, not as bad as the enemy perhaps, who even hang their fellow country women for refusing to resist the invaders in a time that resistance is futile, but as bad as can be and only marginally so.\r The key scene is one where Brad Pitt together with Rookie invade a house where two German women hide out. it is one long protracted threat scene that screams rape with every frame. If you have seen Der Untergang, or have read the Last Battle by Cornelius Ryan, you will be aware of how these women would have felt. It isn't a pretty sight to behold.\r Fury has a scary anchor point, which is that it doesn't matter what you do as long as you do it, because you have been told to do it and nothing else matters. It reminds me of a phrase of the game Mafia II: in the war the president pointed the finger at whom to kill, now it is  the hand that pays me. This movie is thus about moral bankruptcy.\rIn a human society there is no place for any of the crewman of Fury with an exception perhaps for the rookie who is the least tainted. Society can not work with the scumbags that war has created, and who have traded in their morals and compassion for the command: go forward and kill regardless.\r They are the walking dead.\r It just needs a bullet to remind them that they are."
    },
    {
      "rating": "8",
      "text": "One of the best Brad Pitt movies I seen in years. Fury grabbed me and it never let go. It was so good I had to see it 2 more times and still loved it. The performances were spectacular and theme soundtrack was amazing."
    },
    {
      "rating": "9",
      "text": "A great movie about a tank crew that becomes brothers in war. Normally this group of diverse people wouldn't give each other a second thought. Without giving to much away the fight scenes are good and dramatic and the film is rather gritty. I would recommend this to anyone who liked saving privare ryan or other generic yet good war movies.\rSome pretty good acting and constant clashing of beliefs and personalities.\rIt's good to see Brad Pitt in a gory role after War Z."
    },
    {
      "rating": "8",
      "text": "Rarely have I found myself in suspense in movies these days, which is why Fury surprised me. The cast plays well together and offers heavy distinction from character to character, making you feel like no two people are alike. The thing that I enjoyed most about this movie though ended up being the intensity, which is created by good pacing and dynamic events that scale properly, making each battle-driven encounter feel important instead of somewhat overlooked.  Intensity is also built within Fury through the nuanced audio and visual production.  This isn't futuristic in terms of the special effects that happen on screen, but so masterfully do the audio and visual elements work together - everything felt real and impactful, almost as if I was walking with soldiers fighting on the front lines.  Truth be told, Fury ends up being one of the best war movie since Saving Private Ryan."
    },
    {
      "rating": "8",
      "text": "A WW2 film that isn't just about blood and guts. While there is plenty of tense, violent combat the focus is more on how it affects the soldiers involved. In the beginning of the film we are introduced to a tank crew who has just lost a man and have been beaten down by the war. They're tired, irritated, and more than just a little bit sick of each other. Then comes in rookie \"Norman\" (Lerman) who whose innocence is at odds with the psychologically tormented crew of M4 Sherman tank \"Fury.\"\r The movie isn't afraid to show you just how messed up these men have become. They are all superbly cast. Their actions are believable. The war has changed them into vulgar, almost completely unfeeling people. There are moments here that show that the U.S. soldiers weren't just heroes going into Germany and that they showed genuine hate not just towards the Nazi army, but towards German people as a whole.\r It's more of a psychological war film. Yet near the end it turns into your predictable war film. With heroic sacrifices and a long, bloody conflict. The action and gore are cranked up to 10 making it feel more like what you would expect from a war film. It packs the same emotions you could expect from a WW2 film since \"Saving Private Ryan\" came out and changed the game. Mix that with the fact that you can totally predict how things are going to turn out for Lerman's character and you have a film that feels a touch familiar.\r However it's views in the psychological effects of war and attention to detail in regards to combat from behind the controls of a tank make it worth a watch. It's a little bit more than your average war film. With a cast this excellent they would have had a hard time not succeeding even if they did just go for a straight up generic WW2 film. However they went the extra mile and gave us a new take on war combat by showing us tank warfare and taking a look on how war effects people's mentalities. A few familiar aspects of war films are hanging around, but the majority of it is a fresh take on the genre.\r I give \"Fury\" an 8.3/10."
    },
    {
      "rating": "9",
      "text": "Don`t kill me. I`m a history buff and I love this movie. If you`re an Average Joe, just substract 1 from the rating and you`re good.\r Wanna watch a movie? Don`t see any trailers, don`t read any reviews, just go watch it and make your own opinion. I did just that when I heard about Fury. I was surprised it was so good.\rAt first knowing that a top Hollywood actor would take the main role and GASP...LaBeouf and Lerman, I didn`t expect much. But I was wrong, the scenario has put a good weight on the story rather than the men involved. So Pitt is excellent (I want that haircut!!!), LaBeouf gets minimum camera time and Lerman is kept mainly in the background.\rInstead the story focuses on the events which is last year of World War II. My favorite tank, the Sherman Firefly with the 76mm long barrel cannon and YES YES YES, the Panzerkampfwagen VI namely THE TIGER I with the 88m cannon. I would watch this film 20 times for the Tiger scene alone, it is so well made. Actually the last tank battle so well made I watched last was the \"Kelly`s Heroes\" bit.\rAs a whole I think this movie is extraordinary for showing what the World War II really was : killing people, explosions, dirt, pain and fear of dying on a daily basis. No sentiment, just war. Even in 1944 it was hard for the Yanks to fight their way into 3rd Reich as they were faced by nazi fanatics.\rI found the story to be silly but the actual last scene I liked for the fireworks.\rThat said, when I think what a normal viewer would get out of this movie...maybe an image closer to what World War II really was (but still a tad bit unrealistic, you know, the tracers, meh).\rNevertheless, a good addition to film library for every history buff out there."
    },
    {
      "rating": "9",
      "text": "Yet another World War II movie. But done exceptionally well. Incredible attention to details, great acting and cinematography. It reminded me of \"Saving Private Ryan\". The end of war is close but until it does end many more people are going to dye (I am somewhat para-phrasing the main character's words). The movie is very intense and brutal, it kept me on the edge of my chair. My heart was beating so fast, I had to literally calm myself down. True, some battle episodes were not quite believable but it did not spoil the impression of the movie overall. I expect it to be the major contender for the best movie of the year."
    },
    {
      "rating": "7",
      "text": "Fury is a good film that depicts an American tank crew towards the closing of World War II. This movie had a lot of hype coming out and I think it largely was able to live up to most of it. Brad Pitt, Logan Lerman, Shai LaBeouf, Jon Bernthal, and Michael Pena form a fantastic cast of unique and substantially developed characters. The acting of Pitt and Bernthal especially carry the film. The plot, though lacking much premise beyond the war itself, is also developed really well throughout. There is one particular scene towards the midpoint of the film when they're about to leave a city after capturing it that really stood out and is, in my opinion, one of the best scenes in war movie history. Unfortunately, the movie couldn't carry that emotion throughout the rest of the film. The closing battle sequence was a little too \"Hollywood\" and didn't vibe with the realism and grit of the rest of the movie. Because of that, many of the character deaths felt unauthentic and didn't deliver the emotion that they should've. Overall, it's still a solid movie but it had potential to be much better."
    },
    {
      "rating": "8",
      "text": "Maybe not to the caliber and scope of Saving Private Ryan but Fury is one a superb war film. Fury adeptly balances entertainment and accuracy with regards to human physical and mental state during war. The action is great, the score is fantastic and even with an ending that is a little cliché, it still was marvelous."
    },
    {
      "rating": "7",
      "text": "Fury is a film that incredibly brutal and intense at times, but manages to be a stirring and emotional war film throughout due to its focus on brotherhood and the friendships formed during war times. The direction from David Ayer was great here and the war/action sequences were expertly put together. Ayer has a knack for some real great action sequences and Fury is no exception to that. Brad Pitt, Shia Labeouf, Michael Pena, and especially Logan Lerman, were all stellar in their respective roles. The costume design and makeup in the film were also very great as these men look the part and look war battered. However, where Fury is the most successful is in the realism. Incredibly faithful to reality, the film feels authentic, especially when it comes to the blood and gore of war. As a whole, Fury is no Saving Private Ryan, but is definitely the best war film in a while and stands as a very good film in what was a great year for film in 2014."
    },
    {
      "rating": "8",
      "text": "Fury is the most realistic WWII movie I've ever seen, up until the last bit where their tank turned into an invincible fortress and the Nazi's somehow lost half of their IQ and blitzcriged the FRONT of the tank."
    },
    {
      "rating": "9",
      "text": "This movie was pretty great. The only reason it's not 10/10 for me is just because it's not one of my favourite movies of all time, but I cant fault it.\r Shia LaBeouf was fantastic in this movie, his acting was easily one of the more convincing performances I've seen in a long time. The effects in the movie are pretty great, except they put some very odd colouring around the bullet tracers which made them seem like lasers from Star Wars. The fight scenes were action packed and very cool, I really enjoyed them."
    },
    {
      "rating": "8",
      "text": "Fury's a solid world war II movie. The main cast is great, Brad Pitt, Shia, and Logan Lerman particularly. It's not outstanding stuff like Saving Private Ryan, but it's a solidly told and entertaining story."
    },
    {
      "rating": "7",
      "text": "Solid war film ruined by a horrible, unrealistic ending. I'm no WW2 expert, but I know that the Germans would make very short work of an immobile tank with anti-tank rocket launchers. The tank crew could catch them by surprise and kill maybe a dozen or two, but after that the Germans would simply disperse and shoot the tank with bazookas from a safe angle.\r Not to mention using the stupid \"characters die dramatically one by one, from least important to most important character\" cliche. And the simple fact that they should have retreated as there was absolutely no strategic significance in holding that objective (like Don said himself, the war was pretty much over anyway.)\r I really enjoyed the rest of the film though; it does a good job of touching upon the realities of war."
    },
    {
      "rating": "8",
      "text": "\"We were living in trees when they met us. They showed us each in turn That Water would certainly wet us, as Fire would certainly burn: But we found them lacking in Uplift, Vision and Breadth of Mind, So we left them to teach the Gorillas while we followed the March of Mankind.\" (The Gods of the Copybook Headings by Rudyard Kipling)\r War, as it is - even a little bit embellished - dirty and ruthless.\r To understand what \"Fury\" is and why all were so and not otherwise, you should look back a little, and then look around.\r After the \"humiliating\" for the \"imperial nation\" Treaty of Versailles, Germany rather quickly disillusioned in liberal democracy of the Weimar Republic. Although after the hyperinflation economy finally stabilized, but only to be immediately \"decimated\" by the global economic crisis. New energetic leader and disgruntled by the defeat in the Great War military leaders whispered to Germans about betrayal, conspiracy of treacherous West against Germany, which was not defeated on battlefield and capitulated only due to the cunning and treachery of the liberal politicians. And the Third Empire began to \"get up off its knees\" under active and simply tacit approval of the German people, who listened enthusiastically every word their charismatic leader said.\r \"They are prophesying to you false visions, divinations, idolatries and the delusions of their own minds\" (Jer. 14:14).\r With its \"special path\", the bearer of an \"unique Aryan gene\", Germans, according to the Fuehrer was the only beacon of civilization, against which the rest of the world fought. But now Germany is as strong as ever. Western leaders, all these \"Daladier and Chamberlains\" were despised by Hitler as weak-willed and cowardly. They \"swallowed\" the Austrian Anschluss, the annexation of the Sudetenland, the dismemberment of Czechoslovakia, accepted the infamous Munich Agreement. Meanwhile not confined by liberals and democrats and not burdened with the \"bourgeois morality\", the energetic leader behaved with unprecedented arrogance and rudeness. Together with his teacher from the East, he dismembered Poland. Then easily captured France. There only a defiant England left with this funny old man Churchill. Authoritarianism, when critics \"do not rock the boat\" with the stupid \"democracy\", confirmed its benefits - at that time, as democracies swayed in doubts, authoritarianism confidently went forward.\r \"There are no innocent. There are only varying degrees of responsibility.\"\r Meanwhile Jews were murdered in the gas chambers, from the East echelons of slaves arrived in Germany, while remaining were treated almost as mercilessly as by the Soviets. And all this is either with the active support of, or with the acquiescence of, or even indifference of the German people - finally \"raised from their knees.\" \"There are no innocent\" - everyone took part in building of the Third Reich - someone shot, and someone produced shells. Difference only in the degree of responsibility. They're not going to give up - \"carriers of unique gene\" are invincible in battle, they have a \"wonder weapon\" and a great leader.\r \"Each person can err, but to persist in error is peculiar only to fool.\"\r Germans did not give up - they lived in a fictional reality of Goebbels's propaganda by which they were not deceived, but which gave them a great opportunity to deceive themselves and to ignore reality. Lie was their truth. But reality, even if it does not noticed, does not cease to be reality - \"brilliant\" leader who's \"effective\" government wasn't restrained by the \"democratic criticism\", quickly braked his country's neck, exactly because of the lack of democratic criticism, which may have returned him to reality. He also lived in illusions.\r \"And that after this is accomplished, and the brave new world begins When all men are paid for existing and no man must pay for his sins, As surely as Water will wet us, as surely as Fire will burn, The Gods of the Copybook Headings with terror and slaughter return!\"\r So, the reality that the Germans were so hardly trying to keep out of their doors, hiding behind the veil of propaganda lies, furiously smashed the doors of German homes, destroyed walls, killed old people and children, raped women, murdered men - actively supporting, tacitly endorsing or simply indifferent. It turned out that there is truth, despite all lie's efforts to hide it. And if you do not give up in your misconceptions, if you persist in lies - the truth will burst violently, relentlessly, destroying all in its path - there will be no innocent!\r This applies to the past and to the present. \"Fury\" is a reminder to all about the price of \"mistake\" and persistence in delusions. Everyone will pay for the \"mistake\" - active and silent and indifferent - and payment after collision with reality will be cruel. Yet another \"imperial nation\", disillusioned in liberal democracy now tries to hide from reality under the curtain of lies. Russians believe that they have been never defeated by the West on a battlefield, and Soviet Union would have been victorious if not for the West conspiracy. They believe that Russians are bearers of the unique \"genes\" and are only beacon of civilization in the declining world. They despise Western leaders, considering them weak. Russians adore their charismatic leader - Putin. They are happy with the annexation of the Crimean peninsula, murder of thousands of Ukrainians and destruction of Donbas, boasting to turn USA into radioactive dust. They are leaving in illusions, considering themselves innocent. Yet their collision with reality is inevitable.\r \"As it will be in the future, it was at the birth of Man \u0097 There are only four things certain since Social Progress began: \u0097 That the Dog returns to his Vomit and the Sow returns to her Mire, And the burnt Fool's bandaged finger goes wabbling back to the Fire;\""
    },
    {
      "rating": "7",
      "text": "War is something no one wants to expedience. That’s the major message of Fury.\r Four men and a tank, that’s Fury. We follow them during WWII, and it’s truly a moving movie. Norman is one of the main characters, and it’s so clear how the war changes him. That’s a deep aspect of Fury, and one of the most important. Logan Lerman is not a flawless actor, but he totally fits the role as Norman. Brad Pitt is on the other hand bad-ass. The greatest part of Fury is the action sequences, truly awesome. They might be too bloody and extreme but I really enjoy them. There’s no thoughtfulness is war, that’s one thing worth to remember while watching this movie, and the bloody scenes are part of the war. Without any extreme events wouldn’t this movie be so dramatic and realistic as it is. That’s why Fury is a great movie. The realistic action sequences are awesome, so much practical effects. It looks stunning. There are though some vague CGI at some places, which doesn’t look real. The best part of this movie is the first and the third act. The second however is boring and slow.\r Fury is a good war movie. The third act is action-packed and the soundtrack gives the movie feeling and touch. But it’s less impressive than what I expected, I want more action and less talking.\r Fury gets a 7/10."
    },
    {
      "rating": "9",
      "text": "A No-BullSh** type movie period.\r It does not attempt to ease the viewers at any moment.\rThe movie masterfully depicts the grotesque and depressing atmosphere of war and those who are caught up in it while also including many deep intellectual dialogues that we do not really expect out of a WW2 movie.\rIn my opinion, the whole movie was as shocking and powerful like the Normandy landing scene of \"Saving Private Ryan\"."
    },
    {
      "rating": "6",
      "text": "Cool movie it has couple of good scenes . But then you look at the Natzi Solidares and they all are Dumb .. And that really switched this movie from . Epic war movie to dumb down war movie.\r This movie could be Das Boot with Tanks if they fixed some things . Mainly im talking about the fight scenes with  the enemy . In this movie Germans in one scene have RPG's but they never use them against a tank. After the tank stops shooting to change the ammo .. Natzi still shot but still don't use the rpg's. Only later you see the RPG's being upacked . But you see in previous scene many soliders hold them on their back.\r Basicly this movie has too much the standard Round around do nothing can't aim enemy cliche overuse. And that is because the fight scenes are poorly writen."
    },
    {
      "rating": "9",
      "text": "Gerçekten başarılı bir film olmuş. Aradaki hoş sahneler, sizi savaşın içindeymiş gibi hissettiriyor. Önce sertliği öğrenip sonra yumuşacık kalbini görüyorsunuz baş karakterin. Sonu daha güzel olabilirdi ama, mutlu bir son ile bitmedi diyelim.\rLanguage - Turkish"
    },
    {
      "rating": "8",
      "text": "Thanks to the non-stop action,the believable acting,the great action sequences and the really good visuals, Fury is never boring.Even if there is some minor plot holes, this is still a pretty solid movie."
    },
    {
      "rating": "8",
      "text": "Well acted, raw and visceral,  the grim toned Fury is as hard hitting as its title suggests, portraying a gruesome look at both camaraderie and battles during WW2."
    },
    {
      "rating": "8",
      "text": "War, war is a great movie story for a movie, for me. I think is one of the best movies. Story is a psyhological experience of warfare.. So, for me, it's a good movie."
    },
    {
      "rating": "8",
      "text": "Now, first things first, the final fight scene does get a little naff - the SS troops gets attacked by Hollywood and forget how to fight. However, I am an extreme tank buff, therefore this gets an eight because of the incredible tank moments this film includes - and the terror that they spread. A cold hearted war film, 'Fury' is good, just forget about the SS rabble and the terrible love interest.\r8/10 - Ben Hazelden"
    },
    {
      "rating": "9",
      "text": "The problem that critics have with this movie is that refuses to show the american army as a bunch of noble heroes but people corrupted by war as any of other nation. If that is what you want to see you might preffer Eastwood's American Sniper which is straight propaganda. Beautiful photography, the mechanical function of the tanks is hypnotizing, there are various great scenes, not only the ones of combat, and a lot of transgression and philosophy. The down part is the soundtrack that sounds as a cheap Clint Mansell composition.\r El problema que tienen los críticos con esta pelicula es que se rehusa a mostrar a los estadounidenses como heroes de guerra, sino que los muestra como seres corruptos por esta como los de cualquier otra nacionalidad, si eso es lo que te gusta ver preferirás American Sniper que es pura propaganda fanática. La fotografía es hermosa, el enfoque en el funcionamiento de los tanques hipnotiza, hay escenas geniales y no solo son las del combate, hay mucha transgresión y filosofía. Lo malo diría que es la banda sonora, suena como una versión barata de Clint Mansell."
    },
    {
      "rating": "10",
      "text": "Fury is an outstanding movie about the horrors of war and the psychological destruction all-out war brings down on the combatants and civilians that always get caught in the way.  There is no other movie that has ever expressed this better and more forcibly.  The entire movie is intense in every respect.  The battle scenes are as intense, realistic and unnerving as the opening scene of Saving Private Ryan (the storming of the beach at Normandy on D-day).  The in-your-face intensity never lets up thruout the 2+ hr running time.  At movie's end, all viewers will have a much greater understanding as to why soldiers involved in combat will be scarred or adversely affected for the rest of their lives.  The tank crew portrayed in the movie had been pounded literally for more than a yr and had fought in most of the major battles as the allies moved across Europe towards Germany after the landing at Normandy.  It's a movie all should see, but some will feel that it is too intense to remain seated thruout.  I wouldnt describe this movie as entertaining...it isnt.  What it will do is stir you up about the true horrors of war and the monstrous physical and psychological devastation it wreaks."
    },
    {
      "rating": "8",
      "text": "\"ideals are peaceful, history is violent \" this move is much more better than I expected, it is describes as a tank's story but is shows perfectly the atrocity of war, the pride of soldiers and their thoughts. the cast is awsome, Pitt acts in my opinion one of his best performance as the lieutenant , Lermann is the new one, Labeouf, Pena and Berthal are the expert soldiers everyone with a different personality. The two women's house scene is very emotional and the last battle is very very involving. the end scene, when the nazi look under the tank, seeing Lermann is according to me the best scene of the film.\r to see"
    },
    {
      "rating": "8",
      "text": "Even though the characters weren't very sympathetic and the pacing was very uneven, Fury is still a very well directed and emotional film that's definitely worth watching."
    },
    {
      "rating": "7",
      "text": "Well there is a quote from a not so famous hindi movie ”The Dirty Picture” which says\r“Filmein sirf teen cheezo ke wajah se chalti hai ... entertainment, entertainment, entertainment” (Films do well only because of 3 reasons ... entertainment, entertainment, entertainment).\rWell that’s what fury is about. It’s about entertainment. Many of you would think that it’s an illogical movie without any head or toe, but what it does is entertains. According to me movies are just meant to sit back and enjoy. If you think too much, you are not enjoying. Fury has got emotion, drama, fun, action i.e. a perfect recipe for an entertaining movie.\r Every character has done well. Brad Pitt (Wardaddy) looks good as the commander who has promised his men that he is going to keep them alive. The way he tries to teach the new guy (Logan Lerman) to kill is interesting. You see the sophisticated side of him when he is with the ladies. Shia could have had more screen time. But he plays his part well as the Bible. The transformation of the new guy (Logan Lerman) from beginning to the end is good to watch.\r The final battle or you can say the boss battle has its own moment of oomph. The moment where they prepare for the final battle and the SS are approaching will bring you to the edge of your seat. So the movie is good with can do better story, good characters and yes it entertains. Although the movie is lengths away from reality, but it is what people like to watch on screen."
    },
    {
      "rating": "8",
      "text": "Fury is a movie that is not for the light hearted. The cast and director David Ayer give us something that can not be easily forgotten. The realism of Fury is something that can't be understated. The viewer feels they are right there along for the ride as the heart aches of being in a World War are felt. Fury is dark and honest. It doesn't sugar coat War by any means and is something that once again can not be easily forgotten."
    },
    {
      "rating": "8",
      "text": "David Aye's new movie is a great look of World War II, and not only that war, but all kind of war. It's great how it's presented, it's very realistic and you can really feel how horrible and violent it can sometimes get. The actors performances are just astonishing, especially from the two main characters (Brad Pitt and Logan Lerman).\rThe most important thing in this movie is relationships, what kind of relationships can a crew build in a war; and also, what can war turn you into, how war will make you become someone you are not, you want it or not. The action sequences are great, very realistic, not fake at all, and the directing and script, awesome. Sometimes you are going really to feel like if you really are in WWII. The only flaw in this movie is that you are not going to feel really attached to the characters, but everything else is really great, so go check it out."
    },
    {
      "rating": "8",
      "text": "I loved this film, the times handled were inadequate, i liked the incarnation of Brad Pitt as the main character, but don't give you a 10 of the final score because I thought it was very open, i would have liked something a bit clear, but without that deprives the viewer, to conclude the end of the film"
    },
    {
      "rating": "5",
      "text": "I'm not sure what to say when it comes to David Ayer's latest film \"Fury\". It's a movie that rides fine line between mediocre and good. There were moments when I realized how great this film could have been, but those split-seconds were sparse. It's not as it it's particularly unpleasant, it's just not anything new, and none of the characters stuck out to me.\r The plot is pretty commonplace, set in the heart of World War II. We follow Brad Pitt's character, a battered sergeant nick-named 'Wardaddy' who has his hands full commanding his five-men crew in their cramped tank. Dealing with the harsh realities of war and a new man abroad, a young soldier who hasn't been properly trained, they're forced to fight outnumbered and outgunned.\r The movie is exactly what you might expect and that's probably why I didn't enjoy it. I was able to predict every move, all the down to each character's arc, and it wasn't an original experience in any way. It felt as it they went down the list of every great war film collecting each trope they could and threw them in as needed.\r The most redeeming factor is the cinematography but the other aspects can't match it's greatness. The acting is fine, with Brad Pitt and Shia LaBeouf bringing the most to the table. If you're a fan of the genre, you'll probably like this, but I'd recommend skipping it and revisiting classics like \"The Bridge on the River Kwai\" or \"Patton\"."
    },
    {
      "rating": "9",
      "text": "Fury was intense, gritty, realistic, and dark. An experience that any war movie should aim to deliver. A must watch, especially with some good theatre speakers.\r The acting was nothing exceptional, but the visuals and sound... damn, the SOUND!\rWatching this in a theatre was like no other experience. The sound of bullets whizzing past, a shell ricocheting off the armour - I've never heard these seemingly generic war movie sounds, done so masterfully. The thumps of mortar shells exploding next to the tank, travels through your chest and makes you feel like you're actually in the tank.\r Some intense scenes with great realistic visuals left me tearing my seat's armrests out. Not only that, but they also used REAL Tiger and Sherman tanks!\r Gory. Not just artistical gore like in 300, but some creatively done realistic gore. Makes you realise that war is nothing glorious or romantic.\r Verdict: Loved it!"
    },
    {
      "rating": "7",
      "text": "This movie is centered around a crew fighting in a tank in World War II. It takes pieces form various veteren's stories of the war and makes it into one brutal war movie about loss and about dealing with what soldiers have to do in war. The main character is a boy (well, a very young man) who got transfered from typing about the war to fighting in a tank. The emotions he goes through are displayed well by the superb acting (everyone's acting is well done). I'd recommend this movie to any fans of World War II movies."
    },
    {
      "rating": "7",
      "text": "Fury a historical war film about the Second World War , which turned good , especially when they tried to survive the war and only one did, not done me nothing but good plot and good action scenes , a movie a bit rude but decent in the past"
    },
    {
      "rating": "7",
      "text": "Fury has fury.... until some point of errors come in the way. Brad Pitt is perfectly fine for his part of the role and usually it would've, could've, and should've been better."
    },
    {
      "rating": "7",
      "text": "Fury is a gripping, sometimes touching, sometimes fun WWII film that follows an American tank crew across Germany in 1945. The characters and performances from the whole cast are great, and Brad Pitt and Shia LaBeouf give some of their best performances. The story is a little unbelievable, but this movie truly is an action movie, rather than trying to say something deep about WWII. The biggest flaw of Fury is that some scenes drag on way too long, and it feels like it pads the runtime, rather than truly finding meaning in the quiet moments. All in all, it's a fun movie to watch and not think too hard about."
    },
    {
      "rating": "6",
      "text": "Its actually not a bad film, but the ending ruins it. A trackless tank vs a whole SS squadron with anti tank weapons and the sort. It was a bit like watching an episode of He-man. One to avoid for the purists. But if you watch the first half it isn't too bad."
    },
    {
      "rating": "3",
      "text": "One of the most unrealistic concluding war scenes I have seen. Makes Rambo look realistic. A single Sherman would have been destroyed in a few minutes in that scenario. The Germans did not take over all of Europe and parts of Africa and invade Russia being that stupid."
    },
    {
      "rating": "7",
      "text": "This film was a great war movie and was a really the best WW2 film I can think of to come out in the last 4 years about. The cast is great, Brad Pitt and all the rest making a great team and an interesting one, and even though this tank team does have some typical characters you find in WW2 movies (the religious one, the trouble maker, the scared one, the battle hardened leader) they play their roles each so well that you really enjoying watching all their screen time. Effects look great and the film was deliciously savage in gore which I didn’t exit to be so brutal but it adds to the effect of the overall film. The direction can make you feel claustrophobic at times which may help add to the immersion of the men inside the tank but you do get to fully witness the battles that go on throughout too.\rHowever, I did find some scenes a little clichéd and unnecessary to try develop characters but they didn’t properly detracted from the overall movie. Some of the unnecessary scenes did add to the characters but they seemed a little forced into the story and properly could’ve developed them in other ways.\rBasically, go see this film for the chemistry and acting of the main tank men and for the full visceral immersion the film brings of tank fighting in WW2. It really does portray how bleak it was and how morally questionable us “good guys” in the war were. Good film, give it a watch."
    },
    {
      "rating": "0",
      "text": "Very very unrealistic scenario at the end ruin whole movie. Rambo seems way more realistic than this. You can't show enemy that stupid, one disabled tank can't take whole battalion. This tank would be destroyed in few first minutes of the \"battle\".\r So many fake positive votes can't believe it."
    },
    {
      "rating": "8",
      "text": "A great World War 2 movie. It is a world war 2 movie, that achieves great heights without being overly patriotic. It examines how horrid war really is, and how it affects the human mind. There were many remarkable performances as well."
    },
    {
      "rating": "9",
      "text": "A highly enjoyable action war movie with great depth.\r Some of the battle action is not realistic but this does not detract from the deeper massage.\r “Ideals are peaceful, history is violent” states Don Collier (played by Brad Pitt) as he takes a new crew member under his wing. However it is this Norman Ellison played by Logan Lerman who is really the central character in this movie.\r Conscience hits the reality of war, as a Norman young inexperienced American, suddenly takes the role as machine gunner in a US Sherman tank nicknamed Fury in the dying throws of Nazi Germany. Powerless and hardly believing where he is Norman cries, “I have never even seen the inside of a tank”. Movement, power, brutality and destruction follow the tracks of the steel tank, as all hell breaks loose.\r This film is called “Heart of Steel or “Herz aus Stahl” in Germany and this name is very appropriate. Within the few days of combat in the heart of Germany, Norman goes from someone prepared to die, rather than execute captured SS soldiers, to a furious, hard hearted killing machine. As he quickly learns, it is not quite as simple as “kill or be killed”. If he does not kill quickly, his crew members could easily be those which will quickly die.\r If you are looking for much more depth than just an action packed war movie, then this is for you. Every moment life changing decisions are presented. While the moral conflict rages all around him, it penetrates and grasps his heart. As the movie ends, he survives only through the mercy of an SS soldier. Deep in thought he weighs his soft heart at the beginning of the film and his hard heart at the end. The path his heart took seems almost unreal but the film makes it seem logical and plausible.\r The deeper issue of idealism and realism is the heart of this story. Should an idealistic person such as Norman act on moral principles or as most others, act on interests. Ideals without power to put them in practice are shown to be empty but power alone is seen to be brutal. It is said that realism and idealism are different sides of power and must be used together with both heart and discernment. The main characters struggle with this moral conflict. This dark world shows that a man who understands both reality and morality is rare.\r I couldn’t stop talking and thinking about this movie for days. Yes the action is not always realistic as many have pointed out but I think the message comes across powerfully. Ultimately you are drawn to ask,\r “How would I have decided in his situation?”\r The nearest way I can think of to experience this at home today, is if you have the courage to play a Moral Conflict WWII strategy board game! Playford Games beckons you, just like Norman to make decisions not just in real fast paced action but on their path of the heart.\r Could this help to understand how Norman made his choices in Fury, instead of to condemn him?"
    },
    {
      "rating": "7",
      "text": "I enjoyed the movie, but a lot of it isn't logical. For example:\r* A soldier is unlikely to commit murder (shooting German prisoner in the back) with so many witnesses\r* The German girl isn't likely to go to bed so easily and so soon with the hated enemy\r* The other soldiers who enter the German home are implying they would like to rape the girls. They just had sex a few minutes earlier with a hooker in the tank.\r* It's unlikely the Germans would mine the road around a field hospital, which is typically in a safe area and typically would only be used by their own vehicles.\r* Can't for the life of me figure out why the German soldier smiled at the American soldier hiding under the tank and didn't turn him in."
    },
    {
      "rating": "3",
      "text": "This is just another movie that goes with the formula \"Our boys on the ground got their asses kicked! Time to paint a picture how superior our tanks and people were and how evil twisted (and in the retarded last scene) stupid all German soldiers were!\"  Spoilers below!\rOh boy where do we even start characters are very well done Brad Pit does nice job with his rough and well done acting as a tank commander (rugged veteran) rest of the crew is also solid. Story of a boy that becomes a soldier from total rookie seems a little too forced if you ask me because in one day he transforms into veteran-like crewman it is just too fast he has no trouble operating in the tank even tho story states he was not even in tank school. When we ignore few wierd ocasions where direct hit from 75mm PAK (I'm talking about the direct ones not the obvious ricoshets) does no damage to the Shermans the movie gives you nice idea what Shermans were made for supporting infantry and taking our defensive emplacements, also the tension would be pretty good if there would be any connection to other crews which die as the story goes on. Hard to watch is also the scene where Pit orders a Rookie to shoot German soldier which surrendered and begs for letting him (he tells them he has a family and shows him a picture) live but at least it shows that American army were pigs too WHICH IS AMAZING finally somebody had balls to show it so kudos for that! Then we have the crew and city scene where rookie and Brad Pit invade home of two women where they show the difference between rest of the crew and them. Rookie plays piano Pit shares some cigars and eggs which are cooked for them since they act like normal people and not like animals. After the rest of the crew mainly Shane from walking dead (sorry I remember him as that) comes and acts like morons and even tho rookie stands up to them Pit just sits there not teaching them morals at all for me this scene shows great movie making because you see his dilema on his side Do the right thing? or Keep your friendship with crew? he chooses the 2nd one which is understandable but still he is not happy.\rThe tank battle with Tiger is decent scene (if you turn you brain on it is flawed but keeps nice feeling of tension) of course you get the stupid non penetrating hits from 10 meters because logs aperantly stop 88mm AP shots but it was fun. To the last scene which destroyed the film that was so great until now. The crossroad scene shows how some **** can ruin great writing and acting with just one scene sacrificing everything good just to make a \"Heroic\" (also known as painfully retarded) scene. German soldiers would never act like this hell anybody with a brain wouldn't act like this counting ridicilous tactics of the tanks crew that by some magic work amazingly good, hilarious inaccruracy/loses of the Germans, and overdone to the max aspect for heroic death of crew was just funny to me. Also there were some about 1minute pauses in the scene don't you think they would be flanked by that time? this scene has just flaws all over the place. First even if you fire at the best possible moment when the soldies scatter you won't get so many of them and no F8cking way they will keep up frontal attack (every soldier back then knew that front of the tank is the most dangerous place) they would be flanked and destroyed in about 2 minutes with the Germans sustaining only small loses. Second tank gets flanked so crew pops out and guns everybody down I was near walking out of the cinema! If you pop up like this you get killed in a second before you get your hands out of hatch and line up you would be dead, also why the German soldiers can't do the same shooting like tank crew when they have much more experience with? Third two panzerfausts from point blank do not penetrate and required to be point blank! Those things had range... Only the last one does penetrate and even then deals no damage to the tank only kills one crewman which is impossible shrapnell and munition explosion would wipe the crew. Fourth 3-4 shots to the chest from sniper seem like bb gun and Pit just slides down to the tank continues talking for 2 minutes.﻿\rLast scene of the film and even tho we see that **** talk about \"SS ALL BAD U KILL THEM ALL HURRR DURRR!\" is not true because German soldier with SS markings sees him but doesn't raise alarm.\rI feel that crossroad scene needs to be deleted or edited it is way too stupid for audience with brains and way too overdone to be believable by the rest. If the last scene wouldn't be there it would be 8/10 this way it has to be 3/10 sorry to those who done a good film until that point I feel if we ignore this heroic nonsense we won't get good war movies. Thanks everyone for reading this Vladimir Vojta Cech Republic"
    },
    {
      "rating": "0",
      "text": "Total ****\r Not one single second of original movie here, its like they took a bunch of BS move tropes and blended them together.  Then drank the trope smoothie, **** it out and that's how this movie was made.\r Watch anything before you see this, I know you are thinking what I thought.  Hey its a WW2 movie about tanks and I like thanks.  Could be cool to see tanks in action in nice HD, I heard they used a real tiger.... don't fall for that.  Well if you do, download it and skip ever scene that doesn't involve a tank."
    },
    {
      "rating": "7",
      "text": "The movie is not 100% real. There are a lot of parts in the movie, that are just not true. But the movie was still enjoyable to watch. The cast was good, acting was good as well. a solid 7 out of 10!"
    }
  ],
  "recommendations": [
    "12_strong",
    "lone_survivor",
    "black_hawk_down",
    "american_sniper",
    "the_hurt_locker",
    "captain_america_civil_war",
    "greyhound",
    "lord_of_war",
    "apocalypse_now",
    "13_hours_the_secret_soldiers_of_benghazi",
    "full_metal_jacket",
    "red_tails",
    "letters_from_iwo_jima",
    "anthropoid",
    "hostiles",
    "the_thin_red_line",
    "the_outpost",
    "platoon",
    "allied",
    "enemy_at_the_gates",
    "jarhead",
    "tears_of_the_sun",
    "the_eagle",
    "we_were_soldiers",
    "dunkirk"
  ]
}