{"id": 3387, "title": "G-Force", "starring": ["Sam Rockwell", "Jon Favreau"], "runtime": 88, "genre": ["Animation", "Family", "Fantasy", "Action", "Adventure", "Comedy"], "description": "A team of trained secret agent animals, guinea pigs Darwin, Hurley, Juarez, Blaster, mole Speckles, and fly Mooch takes on a mission for the US government to stop evil Leonard Saber, who plans to destroy the world with household appliances. But the government shuts them down and they are sentenced to a pet shop. Can they escape to defeat the villain and save the world?", "releaseYear": "2009", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/jpjG88kTrK7mHnRx4cpLHh8YZwr.jpg", "categories": {"plot": 3.25, "acting": 2.2, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 3.5, "action": 6.0}, "reviews": [{"rating": "1", "text": "Not funny at all. Cheap humor, nice attempt to make us laugh."}, {"rating": "1", "text": "The 3D for this movie was amazing. This might have been due to the fact that we were all alone in the theater and hand-picked the best 3D viewing seats after trying a couple out. As far as the movie goes, it is horrible. Not a single decent joke. Tracy Morgan is just awful as well. Don't waste your time/money."}, {"rating": "10", "text": "Very good. Very funny."}, {"rating": "3", "text": "Bad movie. Not funny at all. Ok, for children it might be more or less funny, but when i watched the movie I leaved the room asking myself : \"what the hell did i just watch?\". Bad, really BAD."}, {"rating": "1", "text": "Guinea Pigs as spies? are you high, Disney?"}, {"rating": "8", "text": "Had a great time with the wife, and the 3D was really good. It will never be compared to Citizen Kane, but you know what you are getting."}, {"rating": "2", "text": "OK, so maybe the kids like it. Youngsters don't need a whole lot to entertain them. But anyone with close to mature social skills will find the human acting poorly done, the script entirely unoriginal to the point that your hair might curl on the should-be motivating moments, and you'll guess what happens before it happens, every time. The only reason this got a 2, and not a 1, is because it is funny in some places. It's not really really funny, but it makes you chuckle. If you want something mindless, this is a movie to watch. If you want to be genuinely pulled in at all, avoid this movie like the plague."}, {"rating": "7", "text": "Cute and funny. I have no idea why so many people didn't like it."}, {"rating": "7", "text": "Cute and funny. I have no idea why so many people didn't like it."}, {"rating": "3", "text": "I thought this would be a great movie but wow i was wrong it was not funny at all and u could see the end of the movie from the begging."}, {"rating": "2", "text": "G-Force isn't a G.\rThe entire film is boring, there are no laughs, and bottom line its plain stupid. The characters aren't likeable, and the plot is preposterous. Really just not a good family or kids movie."}, {"rating": "3", "text": "G-Force has potential to be a great movie with a fun animalistic twist, but the unfunny, witless gags and the predictability of the film ultimately ruin it."}, {"rating": "8", "text": "I took my 7 year old twin grandkids to see it today. If they don't like a movie they ask to go to the bathroom, sometimes 3 or 4 times. They thought it was \"awesome!\". I didn't but I did like it alot. I thought all the voicing was very amusing and my daughter and I laughed out loud over and over when Tracy Morgan or Steve Bescemi held forth."}, {"rating": "8", "text": "The best of disney animal action movie in the world it was very good and thrilling. it deserves a favorable review not average review. It gets a 4 star rating This a better movie than alvin and the chipmunks."}, {"rating": "5", "text": "Awkward but cute with a blatant message about self worth thrown smack dab in the middle, this movie was, as most have said, mildly entertaining at best. While I never found myself bored throughout the movie, I did feel like they could have pulled the whole thing together a little more tightly and still made it kid friendly."}, {"rating": "3", "text": "Wasn't the best movie and it wasn't that funny at all. I expected it to be a little funnier but it was o.k my sons got bored with it. The plot was for kids but needed more animation."}, {"rating": "4", "text": "Though visually it was good, the story and the humor was plain boring."}, {"rating": "2", "text": "Honestly, what do they do to think of a concept for a movie, Spin a wheel that lands on random words like, \" guinea pigs\" and \"spies\". Seriously, who thinks of these things. Don't bother going, its a waste of money like most random things are..."}, {"rating": "2", "text": "\"G-Force\" functions like a Happy Meal. This mini-\"MI\" contains the same meat and potatoes(action) found in your typical Hollywood fare, but it's scaled down(no violence, no profanity, no sex), with the added incentive of toys(guinea pigs) to lure kids. That's smart marketing. Get them hooked on fast films while they're young and Hollywood has itself a customer, a spectacle junkie, for life. Laden with a heavy \"Transformers\" influence, \"G-Force\" is also within shouting distance of Orwellian dystopia, but sadly, never transforms into \"Animal Farm\". Because \"G-Force\" colludes filmically with dominant ideological principles, Speckles(voiced by Nicholas Cage), the \"traitorous\" mole who avenges the deaths of his own kind, gets misinterpreted as the villain, since the post-colonial-minded Darwin(voiced by Sam Rockwell) sides with the humans. Even though guinea pigs are disposable creatures, \"G-Force\" depicts man as infallible, therefore, the diegesis is fraught with ideological purity. A more ambitious film would have the varmints joining Speckles' rebellion, especially after Ben(Zach Galifanakis) lies about their origins. Like the reactionary pig from Chris Noonan's \"Babe\", the guinea pigs sell-out their own species. Since Darwin preaches Ben's concept of family to the disgruntled mole with such fidelity, the bourgeoise guinea pig(look at how uppity he and his G-Force colleagues act in the pet shop) should be crestfallen(and irate) about the suppression of his proletarian background. But like a true patriot, Darwin never questions Ben's authority. \"G-Force\" denies the dialectic at hand by resolving Darwin's moral dilemma with its leanings toward conservative ideology. \"G-Force\" is a happy film."}, {"rating": "7", "text": "G-Force isn't a bad movie. The problem is that it doesn't appeal to a wide enough audience. Also, the climax goes from awesome to lame really fast and 3-D has been used so much in just one year that it has lost it's magic. Nonetheless, G-Force is definitely worth checking out due it's funny jokes here and there and superb voiceovers by Nicholas Cage and Tracy Morgan."}, {"rating": "0", "text": "This movie is horrible and stupid, don't waste your time or money on this crap."}, {"rating": "0", "text": "Too much potty humor. Too much Black Eyed Peas and Lady GaGa songs that never fit the theme. Not very funny. Terrible story. Geared to suit 'funny' in a three year old's mind."}, {"rating": "2", "text": "With 40 or so kids in the movie theater, there was not a single group laugh throughout this entire movie. Not one! On one or two occasions there was a very light smattering of laughter, but that was it. My four year old was bored- at a 3D movie!"}, {"rating": "1", "text": "When the funniest thing that the kids could remember was \"The guinea pig farted!\" I had to see for myself how bad this movie was. It was that bad."}, {"rating": "4", "text": "The graphics were quite good, if your into the whole cute animal talking thing its definitely for you!"}, {"rating": "3", "text": "Guinea pigs form a top-level surveillance counter-Intel team, wishing for the day when they will be formerly introduced as legitimate FBI agents. Yeah, right, who comes up with this stuff? Sure there are some cute tricks and CGI stuff in the movie but none of the human characters are even remotely interesting and the plot is unnecessarily too violent with its images in its wanta be"}, {"rating": "8", "text": "As kids' movies go, this one is above par in terms of watchability. It could use a few less catch phrases and a little snappier of writing, but overall, I found it fairly enjoyable for what it was. The 3D was also done very well -- the CG was very good, and the effects made for some great eye-popping action."}, {"rating": "2", "text": "Childish, Boring, use of racial stereotyping? Yup sounds like and is, a non animated Disney movie."}, {"rating": "2", "text": "I hope you like fart jokes because G-Force has a lot of them. G-Force fails in almost every respect, and will only entertain children. Small children. G-Force is about three guinea pigs who are genetically engineered to talk and be spies. But these rodents are out of the job when they're thrown into a pet shop when the government disapproves of the G-Force team. They meet another guinea pig named Hurley, and together, they escape the pet shop and attempt to save the world from killer kitchen appliances. G-Force offers, quite literally, nothing that's original or anything that I haven't seen before on film. G-Force is always trying to be funny. The gags never stop, but I never laughed a single time. I think I smiled twice, and the second time was a smile of relief when the movie was over! The action scenes were predictably dull. As the movie went on, it became more and more obvious that this film is strictly for toddlers. There are no \"wink wink for adults\" gags. The musical score rips of countless movies, many lines are laughably cheesy. Lots of contradictions in character personalities. When G-Force doesn't feel rushed, it feels slow and dull. We hear \"I've got a feelin'\" three times throughout the tedious duration of the film. Pacing is an issue. The acting is mostly wooden. Need I go on? On the plus side, there are some good visuals (the CGI work is actually pretty good), and the voice work is decent, if unspectacular. Many of the good visuals are present during the \"fly\" scenes where one of the recruits, a fly named mooch, is shown wizzing through desserts, Venus fly traps, etc. If you have kids, G-Force will probably entertain them. But there are lots of other better films out there that will do the same thing. I can't stress this enough: Don't watch G-Force."}, {"rating": "4", "text": "Bland with little entertaining value. My guinea pigs are way cooler than these ones."}, {"rating": "4", "text": "\"G - Force\" was acceptable very regularly, although the idea of ​​agents excel hamsters, and not sobresaleel CGI script that sadly did not like the public."}, {"rating": "4", "text": "\"The world needs bigger heroes\" --- Movie's tagline.\r Well, guess what. These heroes are way too ridiculous to be big. Unfortunately, for such a Disney kiddie movie, this one failed to be what it's supposed to be."}, {"rating": "8", "text": "G-Force is one of many films I didn't expect to get hate. So I'll just say that I enjoy this movie. It's not Disney's best, but I enjoyed the action scenes, the plot, and the characters. I going to get a ton of hate just for saying that, but no-one will change my opinion."}, {"rating": "6", "text": "G Force tiene ideas interesantes, pero en general es bastante cliche y abusa de mucho humor absurdo. Una película solida dentro de todo, con momentos memorables pero que pudo ser mucho mejor."}, {"rating": "10", "text": "Amazing movie. A classic from a more simpler time for a more simpler audience. Great movie for all ages. Society wouldn't be where it is today without the invention of G-Force (2009)"}], "recommendations": ["free_birds", "minions", "the_smurfs", "cloudy_with_a_chance_of_meatballs", "rim_of_the_world", "spy_kids_all_the_time_in_the_world", "zookeeper", "alvin_and_the_chipmunks_chipwrecked", "transformers_revenge_of_the_fallen", "ice_age_dawn_of_the_dinosaurs", "the_boss_baby_family_business", "chicken_little", "yogi_bear", "sausage_party", "the_angry_birds_movie", "the_angry_birds_movie_2", "the_happytime_murders", "diary_of_a_wimpy_kid_the_long_haul", "escape_from_planet_earth", "cloudy_with_a_chance_of_meatballs_2", "we_can_be_heroes", "the_nut_job", "penguins_of_madagascar", "neighbors_2_sorority_rising", "baywatch"]}