{"id": 3560, "title": "Gamer", "starring": ["Gerard Butler", "Amber Valletta"], "runtime": 95, "genre": ["Action", "Thriller", "Science Fiction"], "description": "Mind-control technology has taken society by a storm, a multiplayer on-line game called \"Slayers\" allows players to control human prisoners in mass-scale. Simon controls Kable, the online champion of the game. Kable's ultimate challenge becomes regaining his identity and independence by defeating the game's mastermind.", "releaseYear": "2009", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/rfQtqLHeisaQ4HlYtNremtUl9oP.jpg", "categories": {"plot": 4.3125, "acting": 4.809523809523809, "ending": 6.5, "soundtrack": 5.0, "cinematography": 2.75, "familyFriendly": 3.0, "funny": 7.888888888888889, "action": 6.222222222222222}, "reviews": [{"rating": "7", "text": "Overall this was an adequate movie. The best parts were the actions scenes. The acting  was also very good with a good cast. There were some gaps in the story which made you ask questions. However besides a minor annoyance it did not diminish the value of the movie. I think the problem with the movie lay with the otherstaff such as the director etc. Also this is an action movie. If the viewers go into the movie with this in mind they will enjoy it. If you go into the theather expecting a philosphical movie with academic take on where our world is going you will be deeply diasappointed."}, {"rating": "0", "text": "Terrible. just terrible. and it gave me a migraine, with all the strobing and odd, jerky camera movements and switches. Maybe worse than Crank 2"}, {"rating": "0", "text": "The worst film I've ever seen."}, {"rating": "2", "text": "Big, dumb, and boring. A bunch of bad ideas about video games of the future taking concepts from video games of today."}, {"rating": "0", "text": "This was the worst movie I have ever seen. PS-I am an old man and have seen lots of movies. PPS-Popcorn was OK."}, {"rating": "2", "text": "Literally the worst movie I've ever seen. A confusing mixed bag of things the movie was obviously trying to appeal to the public. Tits, violence, pointless language, terrible dialogue. I mean really...no wonder the theater was empty on opening night. Don't waste your money."}, {"rating": "0", "text": "Avoid! It's sad that a movie like this was even conceived, not to mention funded and actually produced."}, {"rating": "1", "text": "This was one of the worst movies I have seen. The movie was watchable until we saw the guy behind the avatar...he was wierd perverted and those scenes just ruined the movie."}, {"rating": "2", "text": "This is without a doubt one of the worst movies I've seen so far this year. Acting, Script/Story, Editing....all less than 'B' movie quality. Take a pass unless you're a 15 year old nOOb, hopped up on to much Pepsi."}, {"rating": "7", "text": "The film isn't as smart as it thinks it is. That said, it's much smarter than critics have been making it out to be. Viewers should just accept Gamer for what it is...a competent actioner with a relevant tale about social reality being warped by the virtual. You know what...forget all that. The action is fun and the explosions are loud. The critics can just shove off."}, {"rating": "1", "text": "It was a matter of time before someone were to have this story which is not original, to be honest, but I have a little message to give to Butler: \"Let it before you upload your career. Gerard Butler is a good actor, but making these films is auto catalloge collapses and the public began to mold himself into this kind of action movies and honestly I think this man can reach more. The story is stupid, his characters come and go will die, resurrect, they put them out, they bore me. The script is awful and the dialogues are to be tortured, because they intend to put a sentence at all times. \"Gamer\" is a waste of time."}, {"rating": "0", "text": "As a teen gamer, you'd imagine that this movie would be perfect for me! Sadly, everybody seems to assume that every male teen is a horny sex maniac who will disregard an utter lack of story and terrible acting just to see some tits and guns. Reviewers, please don't try and speak for the audience that you think this is intended for when you obviously don't understand them."}, {"rating": "0", "text": "Probably one of the worst movies I have ever seen in my entire life.  I wish everyday that I could get those two hours of my life back to do something more productive then watching this awful, awful movie.  It made no sense, the premise was dull, the acting terrible, and the action scenes were awful.  This is by far the worst Gerard Butler film I have seen and definitely in the top 10 (getting into the top 5) of the worst movies I have ever seen."}, {"rating": "5", "text": "The directors might as well spend weekends remixing videos of speeches on C-SPAN. No sooner did they espy the cool script, than both directors set out to create this movie with something of condescending scorn. Wasting Ludacris' skills and poor Gerrard Butler, who spent the entire film literally fighting to save his career. Among the notable highlights was Butler drinking liquor then commencing to take an unabashed piss into a futuristic truck. A cynical evaluation of videogame culture, virtual sex and cartoon violence filmed with urgent commercial farce. The directors were slapping high fives at a laughable elevated new school Super Mario Brother's plot enmeshed with zeitgeist themes, null character development and a phalanx of irony and cynism devoid of pedantry. Don't look for verisimilitude between saturated zombie pixels.The trailer was better than the movie. No sequel please."}, {"rating": "5", "text": "Mediocre at best. This movie shows promise, but a shaky camera work and grotesque scenes of people living through a fantasy world really soured this experience for me."}, {"rating": "5", "text": "If any one has epilepsy don't see this movie its filled with a low story line and is a cheesy fake pornographic movie!"}, {"rating": "3", "text": "Mike R. gave it a10: Its not so serious like you think And NY Times doesn't like none movie. if you're as eloquent and intellectual as this reviewer, you'll surely love this movie!"}, {"rating": "0", "text": "Gamer; F------ One of the worst, if not THE worst, movies I've ever seen. I went in expecting a goofy good time but left feeling totally disgusted with myself for agreeing to be dragged along to see it. The concept sounds interesting on paper but (aside from a very stylishly shot, but totally pointless futuristic rave scene) the movie just looks terrible, the whole thing lacking much in the way of color, the plot takes itself way too seriously and makes no sense, the violence/sexual themes are gratuitous and unnecessary, and it just grossed me out. There's one point when a huge, mentally ill killer kills two people and is contemplating stabbing to death a girl in an elevator (who is being \"controlled\" by an obese man in a wheelchair, who is pleasuring himself to the images,) and during this scene I began to wonder what I was doing in this terrible movie. The plot felt thrown together with no sort of thought put into it, no characters are developed, no characters are likable, and half the cast is literally killed off in the blink of an eye with no sort of farewell or mention afterwards. Awful, awful movie. It's not even trashy fun like violent movies like Snakes on a Plane, this is just unpleasant."}, {"rating": "4", "text": "Its all boobs, blood, bullets and brainless. Ironically enough the only thing not \"executed\" in this sci-fi re-tread was the awesome concept of the script."}, {"rating": "2", "text": "I am sure this would a great film if you were Stevie Wonder. Actually that isn't true because you would still need to listen to the actors and the really bad script. It is like the writers watched The Running Man and decided it would be cool to mix it with Facebook and a FPS. I hope the writers now work in McDonalds or milk goats for a living. Go watch American Ninja instead"}, {"rating": "0", "text": "One of the worst movies of all time, don't watch this at all, the plot and characters are awful, the action scenes suck, and it just an awful movie all around, there is nothing good about it at all, avoid at all costs."}, {"rating": "3", "text": "Great concept but bad realization. It's damn boring. I can't mention a good part of it. Nobody is recommended to watch this. Avoid it, it's a waste of time."}, {"rating": "0", "text": "This movie is unwatchable. I literally had to stop it at 25' and (with my cousin) advanced the movie to see what happened, more or less, and we watched the very last part of the \"climax\".This is a fine idea. Black Mirror makes the best entertainment with ideas like this one. But then: The WORST acting possibleThe WORST Script possibleThe WORST editing possible (all over the place)4.8? GET THE F OUT!"}, {"rating": "2", "text": "\"The Gamer\" is a game you will NEVER want to play, especially with Gerald Butler starring in it."}, {"rating": "10", "text": "epic"}, {"rating": "5", "text": "Decent popcorn flick, the action was great and the story, flimsy as it was, is an intriguing look into the future. Michael C. Hall and Gerard Butler handle the material they're given effortlessly but there wasn't much for them to work with. John Leguizamo's character could've used more depth, but the same could be said for the rest of the cast. A worthy effort, but the averageness of this buries itself right to the core. All in all, i give it a \"Meh.\""}, {"rating": "1", "text": "Michael C. Hall should get a slap, no, SEVERAL slaps on the wrist for this bomb. I HATE movies like this. The one movie with an absurd over the top futuristic plot that was actually decent is Minority Report. This is just...wow."}, {"rating": "3", "text": "Infuriating... This movie is the iconic monument to what is currently wrong with the world. All the technicalities aside - bad camera work, incessant screen flashing and uncalled transitions; this movie depicts an anti utopia of ludicrous proportions. Lions gate studios have created another DO NOT WATCH title. Gamer promotes technophobia, defeatism and attempts to capitalize on shock value, way past the appropriate amounts. This horrendous picture should be banned on the basis of obscenity. Even if you let assume all the what ifs; you will find that it will never make any logical sense. Sure it's got action, it's got drama, it's got excitement but watching this movie is like eating cherry twizzlers blended with 0 percent yogurt, and a healthy dose of number 7 recycled plastic as a whipped topping. It takes away from sci-fi; it gives bad impression about any human-technology interfacing. This movie reeks of artificial engineering by some forces interested in lowering human-wide IQ levels, it decreased my attention span by 10%; while watching this movie, I have lost 134,586 brain cells; anybody pregnant would instantly give premature birth after watching this atrocity. Please note the trend of all filmmakers to fill the logical voids with irrelevant conversation during which the camera view will shift at least 70 times. It is NOT OK for me to watch something which makes no sense, why would anybody do that? Starring at the wall is better for our psyche than to look at this crap. Would everybody please stand up and say that no matter how much or how little money is spent on a film, what really matters is the ingenuity of the story and the essential soul of the motion picture. Gamer has no soul, no intrigue, it is meant to play with your basic feelings; but at the end you feel like you got raped."}, {"rating": "0", "text": "The first hint that this movie was going to be horrible was the fact that the plot is pretty much taken straight from death race, but spiced up a bit of coarse. So i wasn't surprised in the least that the movie was horrible when i saw it. Just the fact that the 80's are over and there are still completely awful and worthless movies being made kills me a little inside."}, {"rating": "10", "text": "epic"}, {"rating": "3", "text": "Full of stereotypes. I think the editors and the writers were drunk while making the movie."}, {"rating": "9", "text": "Great Movie. Something different from the same crop of boring movies being produced."}, {"rating": "10", "text": "A surreal, hyperintense experience. Not going to be for everyone, but those who like it will love it."}, {"rating": "10", "text": "This movie is worth watching. Just finished watching, and unlike other people here, they will give it a 0 before they even watch it. I think many people out there are underrating it for bad reasons. Yes I am also a gamer but just a casual one. Yes not all gamers are horny fat guys in a basement too, but there is a market out there for those type of people, people who have no life. The point is that this villain took advantage of that market and than continued with the fps games market. Anyhow this movie is good. Ending was.....eh. But I give it a ten to try to average out all the other unfair reviews( Which won't work but I try). It deserves a 8.5 atleast because it was enjoyable. Those who rate it 0 for a stupid reason shouldn't be here."}, {"rating": "10", "text": "It's not even close...WORST MOVIE EVER MADE. Not even sure you can call it a movie. I can't, for the life of me figure out what the hell Gerard Butler was thinking doing this. Maybe he was blackmailed? Lost a bet? Maybe he had no idea that drugged out rave freaks would turn it into what it became. Absolute 100% crap."}, {"rating": "8", "text": "I'm experimenting with a new form of movie review that I'm calling \"If you like...\". The idea is that there are a few factors that would lead you to see a film and I want to try to identify and expand on these in an effort to provide a more useful and spoiler free review.\r Basically I want to give you a reason to see or not see this movie without giving away any plot if possible. I think there's a real need for this type of review and if you do too, please leave some feedback at ezekeal.blogspot.com\r For my first \"If you like...\" I will review the movie \"Gamer\"\r Should you see Gamer if you like...\r Greard Butler\rIf you were a fan of the testosterone infused, over-the-top confidence and love of violence of Butler's Leonidas in 300 or the thuggish wit and comedic dance style of One Two in RocknRolla, you may be disappointed. While there is a lot of personality in Gamer very little of it comes from the stoic Kable. His primary job in this movie is to look like a badass and he handles it well.\r Michael C. Hall \rHall has made a name for himself as the king of premium channel programming. Known primarily for his soft spoken, introspective, gay mortician character in Six Feet Under, and his soft spoken, introspective, asexual, serial killer character in Dexter. His character in this film is anything but soft spoken and probably one of the most enjoyable parts of this film. The southern accent he carries is a little over the top, but absolutely appropriate. If you're a Hall fan and want to see him really break out of his shell I think you will enjoy this film.\r Bonus: A keen eye will spot actors who played particularly violent bit roles in both Six Feet Under and Dexter.\r The Crank Series\rThis is a very polarizing series and relevant considering that Gamer is the first follow-up by the team that wrote and directed the Crank films, Mark Neveldine & Brian Taylor. Crank was an over-the-top non-stop action film to end all over-the-top non-stop action films and Crank: High Voltage made the first one seem boring. Gamer seems to be their first attempt to tame the fast-paced action and rhythmic cutting into a true feature-film narrative. I can't say that it provides the same level of adrenaline, being a somewhat slower paced and darker film, but there are definitely still some \"oh sh**\" moments. And if you dismissed Crank for a lack of story this may be your chance to see what you've been missing in a more familiar format.\r Bonus: Also like Crank you will see a slew of \"that guy\" actors.  This movie is great if you're like I am and enjoy saying \"That's the guy from...\".\r Shooter Games\rBasically if you enjoy shooter film you will enjoy this movie. However, that does not mean that this movie is just fan service to gamers. I think aside from Ludacris's performance, my biggest fear was that Gamer would be a parody of shooter culture with blatant winks, nods, and stereotypes sprinkled throughout the film. I'm happy to say that with a couple small exceptions there was nothing like that. And even better...no catchphrases! How far we've come from hackers. On top of that the movie actually made me want a giant talking Ludacris head on my wall.\r The Trailer\rThe trailer was actually my primary reason for seeing Gamer and, as it turns out, was very true to the film. It is indeed cut fast and hard, so if the flashiness bugs you, it might be a problem. The film like the trailer and Crank does have a rhythmic, musical quality. It's a rare quality in action movies, but seems to fit very well. The only things missing are some of the more humorous and sexual elements, but overall it's a very good representation of the mood.\r Please leave comments and let me know how useful/spoiler free you found this review.I'm experimenting with a new form of movie review that I'm calling \"If you like...\". The idea is that there are a few factors that would lead you to see a film and I want to try to identify and expand on these in an effort to provide a more useful and spoiler free review.\r Basically I want to give you a reason to see or not see this movie without giving away any plot if possible. I think there's a real need for this type of review and if you do too, please leave some feedback at ezekeal.blogspot.com\r For my first \"If you like...\" I will review the movie \"Gamer\"\r Should you see Gamer if you like...\r Greard Butler\rIf you were a fan of the testosterone infused, over-the-top confidence and love of violence of Butler's Leonidas in 300 or the thuggish wit and comedic dance style of One Two in RocknRolla, you may be disappointed. While there is a lot of personality in Gamer very little of it comes from the stoic Kable. His primary job in this movie is to look like a badass and he handles it well.\r Michael C. Hall \rHall has made a name for himself as the king of premium channel programming. Known primarily for his soft spoken, introspective, gay mortician character in Six Feet Under, and his soft spoken, introspective, asexual, serial killer character in Dexter. His character in this film is anything but soft spoken and probably one of the most enjoyable parts of this film. The southern accent he carries is a little over the top, but absolutely appropriate. If you're a Hall fan and want to see him really break out of his shell I think you will enjoy this film.\r Bonus: A keen eye will spot actors who played particularly violent bit roles in both Six Feet Under and Dexter.\r The Crank Series\rThis is a very polarizing series and relevant considering that Gamer is the first follow-up by the team that wrote and directed the Crank films, Mark Neveldine & Brian Taylor. Crank was an over-the-top non-stop action film to end all over-the-top non-stop action films and Crank: High Voltage made the first one seem boring. Gamer seems to be their first attempt to tame the fast-paced action and rhythmic cutting into a true feature-film narrative. I can't say that it provides the same level of adrenaline, being a somewhat slower paced and darker film, but there are definitely still some \"oh sh**\" moments. And if you dismissed Crank for a lack of story this may be your chance to see what you've been missing in a more familiar format.\r Bonus: Also like Crank you will see a slew of \"that guy\" actors.  This movie is great if you're like I am and enjoy saying \"That's the guy from...\".\r Shooter Games\rBasically if you enjoy shooter film you will enjoy this movie. However, that does not mean that this movie is just fan service to gamers. I think aside from Ludacris's performance, my biggest fear was that Gamer would be a parody of shooter culture with blatant winks, nods, and stereotypes sprinkled throughout the film. I'm happy to say that with a couple small exceptions there was nothing like that. And even better...no catchphrases! How far we've come from hackers. On top of that the movie actually made me want a giant talking Ludacris head on my wall.\r\rThe Trailer\rThe trailer was actually my primary reason for seeing Gamer and, as it turns out, was very true to the film. It is indeed cut fast and hard, so if the flashiness bugs you, it might be a problem. The film like the trailer and Crank does have a rhythmic, musical quality. It's a rare quality in action movies, but seems to fit very well. The only things missing are some of the more humorous and sexual elements, but overall it's a very good representation of the mood.\r\rPlease leave comments and let me know how useful/spoiler free you found this review."}, {"rating": "10", "text": "I loved this movie. What a ride. Very cool scenes and concept."}, {"rating": "10", "text": "This movie kicks ass. Butler rocks. Better than expected."}, {"rating": "10", "text": "Its not so serious like you think And NY Times doesn't like none movie."}, {"rating": "10", "text": "Butler and Hall did a great role in this movie and the people that rate it 0 are people who dont like guns firing and good acting"}, {"rating": "7", "text": "This film is a solid 7 out of 10. Worst movie ever made? Come on people that is of no use to anyone. That is not a review and it is simply not true. Gamer is no master piece but it is a well put together piece of pop art with a gaming twist. I thought it handled the concept of a 'human Frag fest' really well. Which of us gamers out there worries about the frailities and persoanlity of the characters we frag in death matches in Halo or Timesplitters etc. The film feels just like that. The game for the gamers is literally just a game and the game for the participants is life or death. The Sims part i thought was a real insight into the human mind and the uses of the internet - what would we do if we could control people? The internet is full of sex and depravity and what Gamer does is show that given the chance to live out fantasies though someone else it would probably lead to people doing all of the sordid things they can't do in real life. Admittedly, the fat guy doing things to himself was a little bit too much to stomach and not a fully true reflection of people playing games. Overall i thought Gamer was a violent film with an interesting twist on the future of Gaming. It is exactly like Running Man and Death Race and all of these don't claim to be anything more than mindless violence and a comedic few one liners. Save it for a DVD release."}, {"rating": "7", "text": "This movie is worth watching. It isn't amazing, but does have some good bits."}, {"rating": "8", "text": "Cool, fast action. And Butler does a fine job."}, {"rating": "8", "text": "Fun movie if you like video games."}, {"rating": "10", "text": "Amusing, and quite likely behaviour from bored, rich people in the future should such technology become available."}, {"rating": "10", "text": "This movie was amazing, everything I was expecting when I went to this movie. If you liked death race, or you like pure action with not to much back story - this is for you. Loved every minute of it."}, {"rating": "9", "text": "Movie taste is just like ass, everyone has one ! it really surprised me this low score ! The movie really delivered what it intended to ! its MY kind of movie, and as i can see, it is the same for other ppl. if you don't like this kind of movie, your critic is as useful as a judge in a golf game. now, for those who enjoy this kind of movie and aren't just wasting their own time and ours... the movie is great, really worth watching !"}, {"rating": "7", "text": "As usual, critics miss the point of a movie like this. Didn't get their payola, I guess. The movie works on at least 2 levels. On the adult level it's a satiric commentary on modern society with its fascination with games like Halo and The Sims. On the horny teen age boy level, it's a kickass action film with all the video game violence, good guys and bad guys, and boobs and bullets a kid could want. I'm amazed that critics bring no context to the film. Gamer is the love child of Rollerball and the Matrix. It explores the theme of the hero versus society. It also has a nice take on how to conquer the world if you're just one man. This movie was no worse and no better than The Dark Knight, but Batman got treated a lot better critically because he's more of a cultural icon. Gamer holds the mirror up to our insane, hedonistic society, and it's not a pretty picture. Having said all that, I kind of liked it anyway."}, {"rating": "6", "text": "Have you every wondered what it would be like if 1987's The Running Man director Paul Michael Glaser took acid laced with LSD and then directed the movie? Well friends you don't have to wait any longer because Gamer is here! Gamer is another fast paced, gory (and sometimes pointless) action film written and directed by Mark Neveldine and Brain Taylor. You may recognize these guys from creating the insane Crank movies staring Jason Statham. Well it appears they only have one way of directing at the moment because Gamer is no different. With heightened colors, sounds, imagery, and a hand held camera, Gamer provides plenty of \"what the hell?\" moments for the audience.Read full review at FlicksWorthWatching.com"}, {"rating": "0", "text": "Absolutely terrible."}], "recommendations": ["polar", "crank_high_voltage", "the_twilight_saga_breaking_dawn_part_1", "bright", "gods_of_egypt", "shadow_in_the_cloud", "the_tax_collector", "doctor_strange_in_the_multiverse_of_madness", "transformers_revenge_of_the_fallen", "the_matrix_resurrections", "the_book_of_eli", "guns_akimbo", "battleship", "red_dawn", "teenage_mutant_ninja_turtles", "the_hateful_eight", "riddick", "bird_box", "hardcore_henry", "army_of_the_dead", "the_a_team", "eagle_eye", "the_emoji_movie", "hitman_agent_47", "jumper"]}