{"id": 3127, "title": "Game Night", "starring": ["Jason Bateman", "Rachel McAdams"], "runtime": 100, "genre": ["Mystery", "Comedy", "Crime"], "description": "Max and Annie's weekly game night gets kicked up a notch when Max's brother Brooks arranges a murder mystery party -- complete with fake thugs and federal agents. So when Brooks gets kidnapped, it's all supposed to be part of the game. As the competitors set out to solve the case, they start to learn that neither the game nor Brooks are what they seem to be. The friends soon find themselves in over their heads as each twist leads to another unexpected turn over the course of one chaotic night.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/85R8LMyn9f2Lev2YPBF8Nughrkv.jpg", "categories": {"plot": 6.758620689655173, "acting": 7.090909090909091, "ending": 6.5, "soundtrack": 6.0, "cinematography": 8.25, "familyFriendly": 3.0, "funny": 6.589743589743589, "action": 7.785714285714286}, "reviews": [{"rating": "6", "text": "The quality of big screen comedy has been well below par for decades. Formulaic kidult pop culture jokes which are just not funny. Game Night is all of these things of course but thankfully there is a saving grace. The story. It’s imaginative and original with lots of twists and turns. The actors are a mixed bag. Jason Bateman plays his usual role here. There is a black couple who really don't do anything apart from stretch one joke  way too long. But the characters of Ryan and Sharon Horgan, Rachel McAdams and Jesse Plemons are very good. It's a movie of smiles and chuckles rather than belly laughs but a lot better than most comedies released."}, {"rating": "9", "text": "Very entertaining, funny and fast-paced with something for everyone: enough action for adventure fans, plenty of chuckles for comedy fans, and some amusingly on-target relationship stuff for anyone who has ever been part of a couple. Jason Bateman's understated line delivery is just spot-on perfect, so funny. Loved it and would recommend to anyone."}, {"rating": "7", "text": "While it may be a little too convoluted for its own good, \"Game Night\" is nevertheless a hilarious comedy that delivers heart and humour in spades thanks to its all-firing cast."}, {"rating": "7", "text": "This is a fun little romp, but don't overthink the twist/reveals, that'll ruin it for you. And I can't be the only one who thinks Jesse Plemons (cop neighbor) looks like a weird younger brother of Matt Damon, so funny."}, {"rating": "7", "text": "This was actually quite a fun and enjoyable action comedy. The whole cast, led by Jason Bateman and Rachel McAdams each had their own great and funny moments. Plenty of enjoyable movie and pop culture references throughout as well. Overall, this was an enjoyable and passable film for a fun night out."}, {"rating": "6", "text": "Game Night is your typical color-by-numbers big budget Hollywood comedy. Yet, in spite of that, there are some really enjoyable moments. The action swings between comedic and tense quite well, and the transitions between scenes are very inventive. The cast all give good performances. The script does have a few distracting plot holes, and sometimes the comedy falls completely flat. It's overall a safe, fun movie."}, {"rating": "9", "text": "This film is much funnier than the trailers and commercials make it look. In fact, I can't remember the last time I've laughed so much repeatedly.Lots of clever lines. Good casting all around. (Jesse Plemons is even more creepily funny than he is in the the trailers, and I'm asking myself the same question I asked when I saw Peter Jackson's King Kong: Why isn't Kyle Chandler in more movies?) Also, the direction was surprisingly well-thought out for a comedy. A lot of effort clearly went into lighting, camera work, and certain set designs.Bear in mind, I wouldn't suggest this film if you're squeamish. The film mines its humor from the characters contrasting with some dark situations. The scene with Bateman's injured arm in the trailer is more hardcore than is let on.If you watch this, be sure to stay through the beginning of the credits. It's one of the funniest bits of the movie."}, {"rating": "6", "text": "Decent, well made comedy. Its a little light on the laughs though, which  is a shame because there are some very funny jokes that do land. Too often though setups are telegraphed and that's when there are jokes instead of just zippy conversation. There's some surprisingly good camerawork and some strong performances from Rachel McAdams and Jesse Plemons but in the end it doesn't rise too far above being 'alright.'"}, {"rating": "9", "text": "Wooh! It has been a while since I've written a review because I feel like the SAT has been eating up my time. It still is which is why I'm writing this while I'm tired and it's late at night and I certainly am not going to be checking my grammar. This movie is great! I think it's going to be a cult classic. My family does not. But, they still think it was highly enjoyable! I think there's something really appealing about the overused game night gone wrong stereotype (if you're looking for more search Edgar Allen Poe Party on youtube, should be the first thing that comes up, great stuff). The cast was phenomenal and there was not one weak link. Every time I think I can pick a favorite character or favorite scene, I have to change my mind because there are just that many good scenes. Seriously though, I'm trying not to give spoilers but I just want to talk about all the great moments. Billy Magnussen better go places with this and Into the Woods. (Don't pretend Agony was not hilarious) I only single him out because out of the main main comedians, he was the only one without real recognition.  I've been hyped for this since the trailer which I thought was hilarious. The rest of my family thought it looked terrible. I thought it not only lived up to the hype but had a lot more jokes than what you saw in the trailer. I loved it. My parents thought it was funny. The audience was having a great time. The humor wasn't crude. With this and Jumanji, we may finally be seeing a renaissance in comedy that exists outside of the superhero realm.Please go see this, I think you'll have a great time."}, {"rating": "6", "text": "I will be honest, I really thought this movie was going to be a colossal failure and although I don't think it was something memorable, it really works.The cast is solid and the gags are also funny enough to keep you attentive and entertained, 100 minutes well spent. Rachel McAdams is a charming goddess and while she could be doing better things she's a great support for the film, however, I would say the only weak link is Jason Bateman and I don't say it because the dude was wrong or wasn't funny, the problem is that in comedies he always plays the same guy and I don't see any acting growth, I think he's just happy with showing up."}, {"rating": "8", "text": "This is absolutely hilarious and such a fun time at the movies. The whole cast works great together and the twists are all so good. One of the best studio comedies of the past few years."}, {"rating": "6", "text": "This is a great movie to watch when you want to relax. Sense of humor is absolutely crazy in positive way, and movie has a really interesting plot."}, {"rating": "8", "text": "The comedy film Game Night is genuinely funny with jokes that work well between characters and within situations. The film is consistently unpredictable and creative, providing inventive ways to create and deliver humour and simultaneously progressing the plot. The overall narrative is competent as well, with decent cinematography and smooth pacing to maintain its compelling story. The characters are although not great or full of depth that can be deeply relatable, they are sufficiently developed with clear differences between personalities and backstories. The solid acting performances also help build the characters. The film is occasionally over the top and some small plot holes might be confusing, but these flaws don’t do much damage to the enjoyment of watching the film. In short, Game Night is not remarkable, but it is a really enjoyable comedy and watching it is a truly fun time.8/10"}, {"rating": "6", "text": "Moments of genuine craftsmanship mixed with insulting storytelling, Game Night shows how far style can carry a complete lack of substance. Tilt shifts shots and a synth soundtrack are used aplenty to give this film a hip and unique feel. There is an ambitious, continuous action shot that is genuinely engaging and subtle uses of CGI that add authentic comedic effects. Performances from Rachel McAdams, Jesse Plemons, Lamorne Morris and Sharon Horgon range from enjoyable to highly memorable. Yet, despite all this praise, the fundamental flaws of Game Night hold the movie back in a major way.While clever details and wit do make their way into the script, the meat of the story is spent meandering through cliche scenes primarily motivated to get cheap laughs. This is to be occasionally expected in a comedy but there comes a point when the story being told becomes practically nothing at all. This issue is only exasperated by the performance of Jason Bateman, who spends much more time coming off as a jerk than anything else. Condescension can be a funny trait to dip into but when it is the only note our protagonist plays, it becomes hard to root for. Deceptively packaged with sleek techniques and a surprise supporting cast, Game Night amounts to a story about almost nothing and an unintentionally dislikable hero.Writing: 2/10Direction: 7/10Cinematography: 7/10Acting: 5/10Editing: 6/10Sound: 7/10Score/Soundtrack: 7/10Production Design: 7/10Casting: 7/10Effects: 7/10Overall Score: 6.2/10Original Article: https://thefilmguys.blog/reviews/augusts-reviews/game-night-2018/"}, {"rating": "2", "text": "A boring cliche comedy movie  which barely had any parts that will make you chuckle."}, {"rating": "0", "text": "Was this movie supposed to be funny? Just wondering, because it's not. It's been years since I walked out on a movie. This turd broke that record. All the jokes are contained in the trailer for the film. Go see something else."}, {"rating": "3", "text": "I am on an island here. I thought this movie was pretty very bad. They cut the \"is it a game or night\" plot WAY WAY WAY WAY too fast...and they did the absolute minimum of stretching out how funny a couple who are overly competitive in board games could be. McCadams and Bateman's story is Bateman unsure if he wants a kid? What? Why? What a lazy rom-com type trope to throw in there for no reason. The side characters add nothing in terms of comedy...and just yeah.. predictable, hollywood, forgettable. If you think Bateman going into a room and making a mess \"uh oh\" is funny...then this movie is for you."}, {"rating": "6", "text": "Your standard comedy these days. Some laughs here and there but at times tries extremely hard at being something it really isn't with the plotting and twists. This is like the highest rated comedy in years and it really didnt live up to the hype although it was better than i thought it would be. Comedy is officially stagnant and close to being a dead genre entirely but this kept it just above the water but not much more."}, {"rating": "3", "text": "While Bateman's screen persona was likeable as usual, the rest of the movie was a disappointing let down. The premise and plot twists were completely unbelievable. The gags and set ups were contrived and unfunny. The rest of the cast were flat and forgettable. Strange this movie scores so highly"}, {"rating": "3", "text": "It builds up well. The first 30% of the movie is all build up leading to the climax. At that point the audience has two theories and it's full of suspense when we try to figure out which one of the two theories are valid.However, just around that time they reveal something to the audience that kills off all suspense completely. After that you already know the ending, you know what's going to happen and the rest 70% is very very predictable and slow!I watched till 1 hour and then dropped it."}, {"rating": "4", "text": "Game Night is entertaining to a point but the plot very quickly loses the run of itself as it drifts into the realm of ridiculous. Stuffed full of every reference to every game you've ever played. Also filled with movie reference upon movie reference just to make sure you're having a good time. At one point there was an audible groan coming from the audience and honestly I felt their pain.Max (Jason Bateman) and Annie (Rachel McAdams) are the ultimate competitive couple who host a weekly game night with their equally competitive friends. However, their usual Game Night changes when Max's brother Brooks (Kyle Chandler) comes along and hosts a Game Night with a twist. This isn't your ordinary Game Night, no this is the ultimate Game Night. Someone will be taken and it's up to the teams to use the clues and figure out where the person has been taken, be the first to find them and win the grand prize. Meanwhile some real kidnappers come along at the most convenient time and crash the Game Night. Hilarity ensues as the teammates rush off to solve this mystery while unknowingly participating in a real life hostage situation with real criminals and real weapons...or are they? What's real and what's part of the game is not clear and this only adds to the comedy. At least that was the plan, maybe Game Night was supposed to be hilarious, maybe if their best jokes weren't shoved in all the trailers as a selling point this would have gotten a few laughs out of me. I guess we'll never know. Jesse Plemons creepy performance was perhaps the best thing in it, the rest was an eye rolling and cringe inducing mess. Not recommended unless you loved the trailer, in that case go ahead."}, {"rating": "10", "text": "I mix between \"The Game\" with \"The man that knew too little\", with sparks of \"The Naked Gun\". I usually dislike Bateman, but with Rachel McAdams is way easier to be good. The script is great, you have every kind of joke possible and most land perfectly."}, {"rating": "0", "text": "Think of the movie HOUSE with Will Ferrell except this movie is 10 times worst with no direction! absolutely garbage in the worst way possible!"}, {"rating": "1", "text": "i will make this short, you would think that with this cast and the story, it would be a funny movie? its not. i walked out of this one. it was insulting. much was too predictable. thats it, all i'm going to say."}, {"rating": "5", "text": "What the hell?!! Whats all this hype around this movie?! There's honestly nothing exceptionally praisworthy or special about it. The comedy is terribly unfunny, every joke is just a reference to some pop-culture sh!t (á la Seth MacFarlane) and the story is just as underwhelming. Game Night is one of your regular American mainstream Jason Bateman comedies (e.g.: Horrible Bosses, Office Christmas Party etc.), but for some reason both critics and the public are raving about it. /I honestly can't remember whan was the last time Jason Bateman gave a legit comedic performance in a film./ The only aspects of the film that stand out are its cinematography, which is inventive at times and Jesse Plemons who was actually pretty funny. Game Night is average at best."}, {"rating": "1", "text": "Don't waste your money.  Not a comedy (not funny at all), not a thriller, not suspenseful.  So everything the movie claims to be is false.  One of a few movies we've walked out of - it was insulting that the makers of this movie thought intelligent people would find any redeeming value to viewers watching it.  It makes me really question how much is being paid to the \"non-user critics\" to provide reasonable ratings, and I still can't believe the user reviews.  In the beginning there was a laugh or two, but then the movie spiralled into a lame and implausible hodge podge of absurdity.  Even if you wanted to call this \"slapstick\" it wouldn't be worth the cost of a ticket.  Seriously, don't waste your time on this total loser."}, {"rating": "7", "text": "I really liked this movie. Even though it is a little what you'd describe in french as \"tiré par les cheuveux\", I think that that is what makes it truly funny: the story takes too many twists and turns, and is very exaggerated at times, which adds a flavor to its comedy. The jokes are not cliché, and the acting is effortless (I never thought I'd laugh this much at Rachel McAdams), and it really has some hilarious moments. Even though it could use a slightly shorter running-time, I'd recommend \"Game Night\" to anyone who wants to laugh something out."}, {"rating": "7", "text": "With John Francis Daley and Jonathan Goldstein's \"Game Night,\" you're not only given one of the funniest big Hollywood comedies in recent years, but you're also given a suprisingly well-directed action romp, and a fun little ode to David Fincher's \"The Game\" as well. It's got a killer, laugh-a-minute pace,  a talented cast (spearheaded by Jason Bateman and Rachel McAdams and rounded out by a shockingly hilarious supporting appearance from Jesse Plemons), and a distinct, visually stimulating take on the matters at hand, ultimately elevating the overall experience to one I won't soon forget."}, {"rating": "8", "text": "Twisty and hilarious, Game Night is simply a delight to watch for those seeking a combination of thrill and comedy."}, {"rating": "6", "text": "Game Night isn't the best idea I have ever seen that actually works. If I have to praise something that Game Night achieved, it's that the film attempted to avert being in the horror genre all together. It thankfully works as it is without being in the horror genre, but the only flaw with it is that it can purposefully drag itself for quite some time during the film. I wish we have more films like Game Night if Game Night ever fixes its draggy length problems."}, {"rating": "0", "text": "Attention, « Game Night » est une comédie américaine… tous aux abris donc ! mais on a beau serrer les cale-pieds et s’y préparer psychologiquement, mettre les derniers neurones (restants) en friche, se remplir la tête d’eau (tiède) rien n’y fait… on ne tient pas !Surtout lorsqu’il s’agit d’une comédie qui se la joue maligne et prétendument ironique (?) à tenter de « caricaturer » les trous du cul agglutinés en soirée (l’after du dîner de cons en somme) qui se font des jeux de société, puis éventuellement un « jeu de rôle », un « Cluedo » grandeur nature… dont on ne sait plus si c’est du lard ou du cochon…Alors, là, on n’a qu’une envie : aller se passer la tête sous l’eau froide ! c’est poussif, mauvais, très mauvais, pas drôle pour un vieux dollar usagé, ça se traîne et ça rame, on dirait une sitcom qui n’en finit pas… mais sans les rires enregistrés. Les comédiens et comédiennes sont uniformément mauvais, très mauvais eux aussi : oui, c’est une comédie amerloque bien nulle à chier, comme on ne les aime pas… du tout ! et on ne la conseille à personne, pas même à ses (pires) ennemis."}, {"rating": "9", "text": "I'm laughing from the beginning until the end, and this movie has unexpected story.."}, {"rating": "10", "text": "A very good movie, enjoyed it a lot. it was hella epic for the win and i only need to fill up 75 characters so hahahah come on please fill it up a bit faster than that please and thank you"}, {"rating": "8", "text": "Fun fun fun fun fun fun fun fun fun fun. Nice geeks references with fast action and creepy Jesse Plemons ;)))))"}, {"rating": "4", "text": "Moderately amusing but uneven.  When you make a plot-heavy comedy, that comedy damn well had better work logically and have all it's loose ends tied up without getting in the way of the laughs.  Sadly, Game Night's excellent case can't save it from being a miasma of confounding illogic and underplayed bits."}, {"rating": "7", "text": "Jason Bateman and Rachael McAdams play a highly-competitive couple who enjoy the titular times with a group of friends. One nite's event turns wrong, resulting in mayhem and comedy. There are a few genuinely funny situations, but the film's strongest asset is Bateman's dry-panic delivery. Almost everything he says gets a laff. The rest of the cast does fine, but the only other comic standout is Billy Magnussen as the dumb blonde. The film is well paced and has a few twists to keep it fun. NOTE: Stay thru the credits for one final punch line."}, {"rating": "7", "text": "A tightly scripted, modern R-rated comedy. None of that letting the actors ad lib everything and running with the best take approach that seems to be becoming the norm these days. Not that there aren't some fantastic improvised, spur of the moment style comedies out there. It's just that too often they suffer from the unrestrained personalities of their stars, which leads to a lack of focus and consistency in the humor. By giving the actors their dialog and firmly controlling the flow of the jokes, Game Night feels like something of a rarity.The real strength is how well the story is handled. It sounds like just another comedy where average people inadvertently find themselves in extraordinary circumstances that place them squarely out of their depth, and for the most part it is. However the well-crafted twists, turns, and scenarios give it an extra exciting edge. It's also the first mainstream R-rated film that actually knows how to handle guns and danger in ways that don't just feel excessive or unnecessary. I wasn't a huge fan of the subplot about the core protagonist's struggle with having a baby as it really added nothing to the mix and felt cliché. Luckily, this is the only dramatic sour spot to be found.The third act twist is a bit much and is where the film (knowingly) jumps the shark into straight out action movie fare. The only other complaint I have is surprisingly Rachel McAdams. You can tell this isn't the kind of movie she's used to doing as she has a hard time playing such a comedic role without completely hamming it up every time she's forced to be funny (which is all the time). Everyone else onscreen naturally slips into the style. Her not so much.Game Night's inconsistencies can't keep it from being a laugh riot though. There is a nearly constant stream of incredibly clever gags to be found throughout. Some of the lines are pure gold and totally quotable. You won't find any of the overused chuckle tricks every other comedy with an R rating is using these days like accidental hardcore drug use or anything like that. No, this movie is original, inventive, and oh so fresh. So definitely give it a watch.7.8/10"}, {"rating": "10", "text": "I've seen this a few years ago when it came out and I remember I enjoyed it a lot. I recommended to watch it with family and made me realize what a fun, crazy ride it is! I rarely enjoy comedies, and on paper this sounds like a another recycled story. But it's so well executed that it's easily rewatchable.  Rachel McAdams is hilarious and her chemistry with Batemen is brilliant. Jesse Plemon's character is memorable. Honestly the entire cast is brilliant. Another aspect that surprised me is how well the action sequences are done. They were thrilling, engaging and playful. Some neat camerawork there.Giving this full marks because it's a solid, fun, hilarious, exciting comedy thriller that is just as good with multiple viewing."}, {"rating": "7", "text": "The premise is unique and very original, The cast does a great job at seeming like genuine friends rather than actors pretending to be friends and there's plenty of enjoyable humour throughout that makes it well worth watching. The ending is kind of meh but I'd still recommend watching it."}, {"rating": "7", "text": "A comedy that pretty much works from the start because of some good chemistry between the characters. There weren't many moments where I was overcome with laughter but throughout the comedy hits in more subtle ways. B+"}, {"rating": "7", "text": "Game Night is like a fun, real-life Game Night: thrilling and funny if done right. It captures the quirks and inanity of 30-something friends gathering to compete and be stupid. The chemistry between Jason Bateman and Rachel McAdams is surprisingly good. If you enjoyed Horrible Bosses and Wedding Crashers, you'll enjoy Game Night."}, {"rating": "6", "text": "Not as bad as I thought it would be but it won't be making any top 10 lists any time soon. Overall good cast, moments of entertainment but nothing to write home about."}, {"rating": "8", "text": "I actually really enjoyed the movie. There were some very intelligent hilarious moments that had me and the wifey belly laughing. Of course I give it 2 thumbs up for not showing any porn! Jason Bateman and Rachel McAdams did a superb and convincing job. The story was very enjoyable. Loved it!"}, {"rating": "8", "text": "\"Game Night\" is probably one of the funniest comedies I've seen in a few years. Jason Bateman and Rachel McAdams play couple who enjoy the titular times with a group of friends. One nite's event, this time involving Bateman's ultra successful brother turns wrong, resulting in a very entertaining, fast paced and flat out funny comedy."}, {"rating": "8", "text": "I was entertained and liked the characters. Occasionally, it tried to be serious about relationship problems - and then it faltered. Plenty of twists and laughs."}, {"rating": "6", "text": "Game night sports a ridiculous comedy screenplay that borders on parody. The 'murder game' twists once too many times to be taken seriously but the casting is superb. As much as I'd love to see a more dramatic realistic take on this concept,  it's clear there was alot of fun had in the making of this movie and overall it's just very entertaining!"}, {"rating": "8", "text": "The short review: An action comedy with lots of laughs and twists, but with a not entirely realistic plot.Related media: There are no related films or books.What's it like?: Jason Bateman's and Rachel McAdams's husband and wife characters love game nights (involving board games), hosts them and are very competitive at them. Bateman's character's brother (Kyle Chandler) return from overseas, hosts one game night where he raises the bar by including a pretend-kidnapping-find-the-clues game. However, things soon get out of hand and it becomes unclear which is reality and which is pretend. A comedy.Pros: 1) There are many funny and silly moments that made my laugh out loud.2) The film is rather surprising and unpredictable.3) There is great chemistry between Bateman and McAdams and between the two other couples.Cons: 1) There is quite a bit of gun violence and blood that made some moments too tense. It is an R-rated film though.2) The film has a plot that strings together a series of events which are unlikely to follow one another, so that's not very plausible then. How would the the different age groups rate it?Children: (This is an R-rated film)Teens: GoodYoung adults: GoodMedium age adults: GoodOld adults: AverageRating: 4/5 (no half scores). It's worthwhile to pay to watch it in the cinema."}, {"rating": "9", "text": "Game Night is a smart, layered action comedy that boasts a well-written, hilarious story. With great underlying themes and some phenomenal performances, this is definitely one night NOT worth missing."}, {"rating": "8", "text": "This is a very fun movie.  Lots of great laughs and a great cast.  Jason Bateman and Rachel McAdams are perfect as suburbanites who get together with friends on a regular basis to play games.  They are both very competitive and Bateman’s character gets stressed out when his brother comes to town.  Always competing with each other, Kyle Chandler is perfect as the jerky brother who takes every opportunity to put down his little brother.  He hijacks their game night and thus begins a chain of crazy events that twist and turn and provide lots of laughs."}, {"rating": "9", "text": "I love original comedy screenplays. This film falls right into that file. I'm shocked at any negative rating given to this film. Just a good ole fun-filled flick with just enough twists and turns to keep you guessing."}], "recommendations": ["tag", "jumanji_welcome_to_the_jungle", "keeping_up_with_the_joneses", "jumanji_the_next_level", "deadpool_2", "neighbors", "rough_night", "the_wedding_ringer", "stuber", "pineapple_express", "identity_thief", "ted_2", "central_intelligence", "date_night", "spy", "this_is_the_end", "jexi", "ready_or_not", "22_jump_street", "pitch_perfect_2", "palm_springs", "chips", "deadpool", "30_minutes_or_less", "the_babysitter"]}