{
  "id": 3097,
  "title": "Gangs of New York",
  "starring": [
    "Leonardo DiCaprio",
    "Daniel Day-Lewis"
  ],
  "runtime": 168,
  "genre": [
    "Drama",
    "History",
    "Crime"
  ],
  "description": "In 1863, Amsterdam Vallon returns to the Five Points of America to seek vengeance against the psychotic gangland kingpin, Bill the Butcher, who murdered his father years earlier. With an eager pickpocket by his side and a whole new army, Vallon fights his way to seek vengeance on the Butcher and restore peace in the area.",
  "releaseYear": "2002",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lemqKtcCuAano5aqrzxYiKC8kkn.jpg",
  "categories": {
    "plot": 6.918918918918919,
    "acting": 7.291666666666667,
    "ending": 6.444444444444445,
    "soundtrack": 6.666666666666667,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Daniel Day Lewis is awesome in Gangs of NY. He really does deliver a sublime performance and crafts a character out of Bill \"The Butcher\" Cutting.  He's sarcastic and funny, brutal and sincere.  Just brilliant dimension and pitch.  Leo Dicaprio on the other hand bombs.  He's too pretty with his choir boy voice trying to act tough.  And act tough he tries  the same angry, concentrated look on his face through the whole movie, spouting overly-dramatized narration at times. He's the character we're supposed to be rooting for?  He's the good guy? Killl him, Bill! Kill him! I shouted in my brain the entire second half of the movie. And sorry Cameron Diaz. You did not make the leap to fill a serious dramatic role. How appropriate you end up with Leo.  A couple of blonde Californians playing 1850's Irish immigrants.  You're both too thin-skinned to be believable in my eyes.  Scorsese must be in love with the access to high-profilers these days. It's the only explanation."
    },
    {
      "rating": "5",
      "text": "Bill the Butcher is the only bright spot in this movie. But what a bright spot he is!"
    },
    {
      "rating": "8",
      "text": "Scorsese does it again. This movie is great no matter what people will/told you! The acting is a top notch, the characters are nice and Daniel Day-Lewis deserved another oscar for this role, in my opinion."
    },
    {
      "rating": "9",
      "text": "This is one of Scorsese's finest accomplishments. Though Leo fails to really step it up and deliver, he does fine and hands the spotlight to the far superior (in this film) Daniel Day Lewis, who is fascinating to watch and at the same time chilling. Though he plays the villain, I found myself rooting for him after the first half of the film."
    },
    {
      "rating": "10",
      "text": "Excellent movie. Amazing acting. Original and chaotically beautiful. Gritty and intriguing. You should give this movie a chance unless the only action you enjoy is the standard \"action flick.\""
    },
    {
      "rating": "3",
      "text": "Just about everything that can go wrong with a film goes wrong here. No unifying theme or idea, poor writing and characterization with equally poor acting, terrible use of music (who the hell chose that song to play during the opening fight?), and a trite use of the twin towers at the very end. Never at any point in this movie are we offered a single reason to care about it or any of the characters and it seems never once did they ask \"why are we even making this film?\" It's a purposeless and overrated flop from a very good director."
    },
    {
      "rating": "2",
      "text": "As a young kid Leonardo Dicaprio's sees his dad killed by Daniel Day-Lewis in a street squabble between immigrants of all feathers and the natives. Not the Indian natives mind you, but those white dudes born and raised in the US from fathers who stole the country from those other natives a few generations before. Get of my property (that use to be someone elses) is their slogan!\rSo Dicaprio swears to do Day-Lewis in as a little kid. Just wait until I am older!  The movie therefore fast forwards sixteen years into the future to come to a halt around the time of the civil war.  We learn that Dicaprio's desire to kill Day-Lewis has not dampened. Has he learned all kinds of usual skills that help progress him and society towards a better goal? Nope of course not: he just knows how to kill people with a knife.\r The next two hours then might see interesting things about the historical background of the US in the late 19th century, say the civil war, or about the life of the immigrants, but nope.. it is all about a gang of criminals. The kind that plague society any time in any setting and is filled with thugs, hoodlums, scumbags, crooks, sadists and profiteers and anyone else preying on society. But perhaps that was the message?The US is made by criminals? A country full of sociopaths? The end of the movie seems to imply as much.\r It takes Dicaprio around two hours to do in Day-Lewis, which he could have done by gunning the guy down in the first fifteen minutes, but he needs to linger because of reasons of  morality. But actually  no noble goal is guiding him. It is just bloody revenge that he wants.Get a life dude!\r There is some kind of romancing going on between him and Cameron Diaz, which is probably in there just to extend the movie even further for it feels like they just go through the motions. Diaz is a unlikable as the others, only she is female, so maybe that is her excuse.\r For my life I can't figure out why anyone would sit through this movie that has such unlikable lurid characters. It almost feels like Goodfellas but with even more abject characters. Perhaps the acting is great, but really, why would you watch two hours of bloody violence, an awkward romance and nothing else? It is just a boring movie about one guy wanting to do in another and taking two hours to do it."
    },
    {
      "rating": "5",
      "text": "As much as I like Scorcese, this movie is boring and pointless."
    },
    {
      "rating": "4",
      "text": "A pretty bad movie from a pretty good director. the only reason it has a four is because Daniel day lewis' performance is fantastic but the movie lacks any sort of purpose. some better editing could have cut out half this movie and at least then it wouldn't have been such a build up to nothing. \"the blood stays on the blade\"? lame. and what was the deal with that opening music? absolutely terrible."
    },
    {
      "rating": "10",
      "text": "the greatest thing about gangs is the way the \"old way\" of corruption ruling the lands slowly collides with the new way of order and reform as the movie slowly winds to a head as it goes on. Against that backdrop is the struggle of young Vallon trying to carry out a vendetta against what he first perceived as a villain in Bill the Butcher, but as time winds on his bad deeds seem to have reason/meaning behind them and he seems almost honorable in his actions. They both grip to their old ways in the face of the changing landscape, physical and political... the dawning of a new world and as Bills eye closed for the final time as if the curtain finally closed on the ways of the old. This movie is a true cinematic masterpiece and my favorite of all time."
    },
    {
      "rating": "7",
      "text": "The movie isn't perfect, but the production design was amazing, and Daniel Day-Lewis really makes the movie with his performance. All in all, I'd say the movie is definitely worth watching."
    },
    {
      "rating": "8",
      "text": "Loved this movie, although moves a bit slow in the beginning to set up the characters. But past that it takes and keeps your attention thanks to Leo and Daniel Day Lewis. This is a bit of a period piece."
    },
    {
      "rating": "9",
      "text": "Gangs of New York is haunting and acted to perfection. Daniel Day-Lewis, especially, is very good here as Bill the Butcher."
    },
    {
      "rating": "10",
      "text": "Gangs of New York is terrific. Its mix of history, crime, love, and revenge come together to create one of Scorsese's best films. Some would say Gangs of New York drags, but for those who love great storytelling you won't be disappointed."
    },
    {
      "rating": "10",
      "text": "This is one outrageously well acted and violent Scorsese flick (like usual). It really shows gangs back in the mid 1800s in comparison to gangs that we've seen in other Scorsese films. The movie is just an old fashioned revenge film, but done with more style. In terms of the great performances by Leonardo DiCaprio, Camren Diaz, John C. Reilly, etc, Daniel-Day Lewis really stands out and gives a tremendous oscar nominated performace. This performance of Lewis' is for sure in my top 3 performances from  him. He was absolutely incredible and the best thing about this movie. Overall, it's an old fashioned revenge film, with Scorsese's take on old fashioned gangs and will be remembered as one of my favorite Scorsese films. I give it an A+!"
    },
    {
      "rating": "8",
      "text": "I can't believe the way people are hating on this movie. It can't possibly deserve a 0 ranking - that's just silly. I think I like this movie more then a lot of people, but let's get real for a moment, guys. Daniel Day-Lewis and DiCaprio both do a great job in this movie (particularly Day-Lewis). The plot isn't amazing, but it's still enthralling enough to keep someone interested, even though it is a little too long. It's not Scorsese's best directed film, but it's still got better direction then 75% of the films made. If you rate this movie a 0, then your rating system is greatly flawed."
    },
    {
      "rating": "10",
      "text": "Picture that friend of yours who falls asleep during action movies. He's always complaining about the clichés, the watered-down plot, the hackneyed action sequences. Gangs of New York is what that friend might dream up given a Hollywood cast and limitless freedom. I was expecting a gaudy, eye-rolling showcase for Diaz and DiCaprio's pretty faces. Instead I witnessed a down-and-dirty masterpiece with inspired acting, dazzling writing, and bold camerawork. The script doggedly avoids empty-headed clichés, instead inventing classic lines for future copycats. One memorable scene takes place on a body-strewn battlefield in the Five Points. Bill the Butcher, folding a blood-stained knife into the hands of a fallen priest, says with dutiful respect: \"you'll need this to cross the river.\" Even the voice-over work in Gangs is fresh, binding the meaty chaos with barbed-wire eloquence. It's a pity some critics label the movie \"indulgent\", simply because it dares to sustain virtuoso vision for nearly three hours. We should be so lucky to have this-a Hollywood movie that bleeds when pricked. It is rare to have characters we not only care about, but whose conflicts and relationships are unapologetically human. Here is a conniving monster with a heart, and a hero who becomes his son. And why was it news to some that the film is not 100 percent historically accurate? This is a story. A story that ignites as grisly, glorious nightmare the way only film can."
    },
    {
      "rating": "8",
      "text": "A painfully gruesome and honest portrayal of racism. Daniel Day-Lewis falls into his role so well half the time you will wonder if he is coming for you."
    },
    {
      "rating": "7",
      "text": "I felt it was a solid film, up until the end. I felt there were two films going on, and by the time there was the epic battle between Day Lewis and DiCaprio, I felt let down. But Scorsese proves he doesn't have to have the present day to make an effective film. I loved watching it!"
    },
    {
      "rating": "10",
      "text": "Awesome film, daniel day lewis is incredible, the story on how the world changes around them is epic and well told. The way the film is directed and told is masterful, as well as the brilliant acting on show, the film shows the bigger picture around them and the message it conveys is extremely well done. A fantastic film"
    },
    {
      "rating": "9",
      "text": "Daneil Day Lewis is amazing in this film and is pretty much the only reason worth watching it for. It can be a little dull at times but most of the time its good and entertaining."
    },
    {
      "rating": "10",
      "text": "Gangs of New York is a vibrant, epic classic. The performances are incredible and the period detailing is unbelievably sumptuous. History lessons have never been so entertaining! Seriously though, Gangs of New York is a movie I never tire of no matter how many times I see it. It's a fantastically directed glimpse into the dark heart of the Union's past. If I were to compile a list of my favorite top 20 films, this one would probably be on it."
    },
    {
      "rating": "10",
      "text": "Daniel Day-Lewis offers up some of the best acting you'll ever see. This man's performance is amazing; I couldn't believe it when I found out he's not even American! If you happen to be a fan of quality movies and acting and have just not got around to this film- you will really appreciate this. Cameron Diaz and DiCaprio along with the rest of the cast also do a fantastic job. The story builds over the duration of the movie and you may feel lost for the 1st hour, but pay attention and it all comes together at the end."
    },
    {
      "rating": "10",
      "text": "people saying its \"boring\" and \"bad acting\" your'e obviously retarded its a great film the acting the music and everything fits perfectly, the cast is great, especially day-lewis who makes the film with his role as the 'Butcher'"
    },
    {
      "rating": "7",
      "text": "Gangs of New York is a pre Civil War film based in, of course, New York. Now, looking at the title of this film, most would think this was a present day gang film in New York with mafias and what not. But it's nothing like that. These gangs are the type of gangs which scrimmaged for food in the city and rely on others to get what they need to survive in the perilous city. The story revolves around a man named Amsterdam, whose father was part of a gang called the Dead Rabbits. His father was killed by a gang leader named William Cutting, otherwise known as \"Bill the Butcher\", who now owns and runs New York. It has been 16 years since Amsterdam's death, and sure enough, Bill still runs the town. The rest follows Amsterdam's life in New York, and his attempts to avenge his father.... Gangs of New York was nominated for 10 Academy Awards, winning none. But to many it was no surprise, for it was extremely close for making the cut for the Razzie's. But I could accept the fact that the film was nominated for Best Picture, for it truly deserved that kind of recognition. The acting within Gangs of New York was more than ordinary. A cast you wouldn't expect to see in a film like this (Leonardo DiCaprio, Daniel Day-Lewis, Cameron Diaz) all played their very best parts. Leonardo did his average acting, but a little more better than usual. I loved Diaz, for I've never seen her in such a dramatic historic film before, and it was entertaining to see how she coped with it. Then Daniel Day-Lewis also did an exciting performance, although I believe he should've been nominated and won Best-Supporting Actor, instead of being nominated for Best Lead Actor. But the cast I liked best were the supporting actors crew. Meaning, the small cameo or occasional performances by actors, was the best part of all the acting. They added emotional or suspenseful impact to the film, and always made it better. Then, I enjoyed the cinematography. It was also nominated for an Oscar, and it was well nominated. I enjoyed some of the screen shots and single shots. Then I enjoyed the Direction. Of course, who couldn't like Martin Scorsese? He never seems to disappoint the audience, with films ranging from the Godfellas to The Departed, he is one true audience pleaser. But then, here comes the cons of the film. One thing was the opening sequence. It was a very pathetic battle scene, made in the worst way possible. It seemed fake on many levels, and thank god the film got better as it went on. Then the other dissapointing asspect was that it's running lenght was very lengthy, and could've been shortened some. Then the last part was that it was historically inaccurate. Otherwise, it was great. The best part of the film though was the fact that two great problems in New York was going on at the same time. One with the gangs, and another with the populace and the government. It was a great idea to base the story on. And as I end this review, I have to say one thing; Scorsese might be the oldest director out there, but I don't think he or his films will ever die."
    },
    {
      "rating": "10",
      "text": "this is a great movie.  i want to watch it again.  it was great.  the storyline was good.  the acting was terrific.  Daniel day Lewis  gave a great performance.    if you didn't like this movie then you don't appreciate history or good quality of work.   fantastic movie.   perfect score."
    },
    {
      "rating": "10",
      "text": "Again incredible movie by martin scorsese. I really like the setting, which I dont see many times. Also gotta love DiCaprio and Day Lewis their roles and the story keeps you watching, I can only recommend it."
    },
    {
      "rating": "5",
      "text": "It's good enough for a historical drama, especially given the absolutely brilliant performance by Daniel Day-Lewis, but Gangs of New York sprawls over its dull story with themes that it never dives into, and a plot that doesn't hit with the same power as Scorsese's previous films."
    },
    {
      "rating": "6",
      "text": "Daniel Day Lewis really carried this film imo and made it worth the watch. DiCaprio and Diaz sucked and didnt fit in at all. The rest of the cast was good. It was interesting at first but it feels a bit too drawn out and it loses interest. It was a decent film but no where near as good as it could have been."
    },
    {
      "rating": "7",
      "text": "Far from Scorsese's greatest films, Raging Bull, Taxi Driver, and Goodfellas, Gangs of New York is still a well made film especially in terms of its historical accuracy. In addition to fantastic performances by  Daniel Day Lewis and Leonardo DeCaprio, the opening sequence as the gangs go into battle and the final sequence as time passes over New York are by far two of the most splendidly done in all of Scorsese's career."
    },
    {
      "rating": "5",
      "text": "Gangs of New York has very nice set pieces and an all star cast that overall puts on a very nice performance. I only wished it all could have came together to make a decent film."
    },
    {
      "rating": "10",
      "text": "My ancestors were in one of the gangs portrayed in this film, I am really proud to see this come to life. I never knew this film existed til just recently."
    },
    {
      "rating": "8",
      "text": "In terms of ranking Gangs of New York as a 'great movie', it does not achieve that. I do not believe, in watching it, that it ever intended to be a purportedly great film. It is very good, as a historical drama film, however. Scorsese does not fail at capturing the idea of The Five Points, the gang warfare, or perhaps most importantly, the political corruption that ran rampant. For all of its faults, it is made up for by representing itself, in a historical term, relatively well. The key selling point to make Gangs of New York a better than film than it might have otherwise been is the ineffable performance of Daniel Day-Lewis. In a career defined by great performances, only his performance as Daniel Plainview in There Will Be Blood rivals his riveting spin on Bill 'The Butcher' Cutting. Adrien Brody in The Pianist won the Academy Award for Best Actor this year, and I do not fault the Academy for selecting him entirely, but I do believe that Day-Lewis was robbed of his most deserving award here. He defines the villain that you love, even though their morals may be flawed. You lose sight of the fact that you are watching an actor during the film, as I see Day-Lewis become Bill The Butcher. The scene in which he sits in the brothel bedroom, discussing Priest Vallon with Amsterdam, is one of the greatly acted scenes in cinematic history, although much of the movie could be attributed with that title. If you are a fan of historical dramas and of great acting performances, I believe that Gangs of New York would pique your interest, and suggest it for you."
    },
    {
      "rating": "6",
      "text": "Gangs of New York is extremely ambitious and Scorsese tries to cover a lot, but in doing so, he really covers none of it. A lot of things were touched on, but none of it ever felt satisfying. In spite of that, the film was far too long. Thus, a lot of things could have been cut since they did not have a major impact on anything and then the film could have focused in on more important aspects of the film in better depth. Finally, the film is a little violent for my taste, though shortening it would undoubtedly satisfy the issue. Ultimately, the scope Scorsese attempts to go for is the film's true undoing, as everything else is great. The sets and costume design are marvelous. The foundation laid by the film for the rivalry between the \"natives\" and the Irish, plus the desire for revenge is great. The corruption aspect was very welll done as well. Then the final shot of New York over time and the final words by DiCaprio are beautiful and perfect for the moment. In terms of acting, Daniel Day-Lewis is phenomenal. Cameron Diaz was also fine, I have no idea why she gets so much hate for this role, as I had no issues with her. She was not phenomenal by any means, but she was fine. I love DiCaprio, but he was certainly spotty in parts, though he was fine for the most part. However, there was far too much fluff added onto the main plot that really comes off as extra. I wanted to love this one, but I simply cannot."
    },
    {
      "rating": "8",
      "text": "A bunch of good actors, decent story, interesting time period for a criminal gang movie. Great direction. A bit long (as all of Scorsese), but still totally worth watching."
    },
    {
      "rating": "7",
      "text": "Gangue de Nova York  um bom filme porém não  o melhor do grande Martin Scorsese que detém em seu currículo filmes melhores mais  uma bela produção."
    },
    {
      "rating": "8",
      "text": "Martin Scorsese is a director of astonishing power and Gangs of New York is a movie of astonishing imagination, ambition, and scope. The first fifteen minutes are as dazzling as any images ever put on screen. The rest of the movie veers from brilliant to flawed, but it is unfailingly arresting, provocative, and powerful. The struggle between good and evil is represented at every level, from the internal struggles within Amsterdam to the massive battles between the immigrants and the natives. Scorsese also puts the combat in Five Points within the context of the riots in New York after the Union began conscripting soldiers. His reach is over-ambitious at times, but he has a sure hand with the narrative and fills each frame with splendid images. After the terrible fighting is over, Scorsese shows us how the city was delivered, in both senses of the word. Superfluous voice-overs and flashbacks are very annoying, Thomas' character is poorly conceived, and Cameron Diaz, though game, is badly miscast. DiCaprio just manages to stay on top of his role, but Day-Lewis gives a career-topping performance of such ferocity that the character almost bursts out of the screen. In the end, a bit slow but great in a sense."
    },
    {
      "rating": "10",
      "text": "Se um filme de quase 3: Hrs não te entedia pode apostar que esse filme é excelente como Scarface 1983.\rGangs of new york é cheio de humor,ação,tensão,suspense e atuações brilhantes de Leonardo DiCaprio,Daniel Day Lewis e Cameron Diaz. Com um roteiro brilhante. Esse é um dos top de Martin Scorcese..."
    },
    {
      "rating": "8",
      "text": "Gangs of New York had my eyes glued to the screen as an amazing, stunning, historical piece to Martin Scorcese's filmography, until the final third of the movie where it fell a little flat. The plot twists and smooth storytelling Scorcese is famous for just went into thin air. I don't want to spoil the movie, but after a major scene between Daniel Day-Lewis and Leonardo DiCaprio, the movie gets a little banal and dried up until one of the very last dramatic scenes. The pace and the throbbing heart that kept this movie alive just suddenly fails to keep going. The story slows down, and not much happens for a while. Now, don't get me wrong; this \"final third\" isn't the worst part of a movie I've ever seen. It's just that compared to the rest of the movie, this part lags and is a touch dry.\r Other than that, this is a great movie with a talented cast and a great director. The story isn't all that complicated, but Scorcese's great filmmaking talents pull it off and make it interesting. It is for all I can see historically accurate, and it really has the feel of the violence and desperation of that time period. This is officially the second best role of Daniel Day-Lewis, in my opinion. (The first being Lincoln, of course"
    },
    {
      "rating": "6",
      "text": "Gangs of New York just isn't spectacular.\rWith extremely unlikeable characters along with a slow dreary scenery. Gangs of New York impresses but is plagued with an overly long plot that doesn't entertain the way it should."
    },
    {
      "rating": "9",
      "text": "Martin Scorsese takes us back in time to a blood-filled and corrupt America in 'Gangs of New York', a story about a young man's revenge during a violent time in the city, and his discovery as to who he really is.\r The story begins where we see a man named Priest Vallon (Liam Neeson), the leader of the \"Dead Rabbits\" as he goes to war with the Natives led by the evil Bill \"The Butcher\" Cutting (Daniel Day-Lewis). The fight ends with Bill ultimately killing Priest, leaving his son, Amsterdam, to run away, vowing revenge on The Butcher.\r Years later, Amsterdam (now played by Leonardo DiCaprio), returns to New York, still planning his revenge. He runs into a former childhood friend named Johnny (Henry Thomas) who takes him to Bill, who doesn't recognize the now older Amsterdam. Bill welcomes Amsterdam with open arms into his group, and sees that Amsterdam is a worthy addition to his gang. Amsterdam also runs into a snitch named Jenny (Cameron Diaz), she has had some history with the Butcher, and seems to also not be very fond of him either.\r Scorsese does a good job re-creating the aesthetic of 19th Century America, this is a rich, lively, blood-filled take on a more violent and corrupt America. Daniel Day-Lewis steals the show as the menacing Butcher, he has the sharp charisma to pull it off very well. DiCaprio also does a good job to play the dark and damaged young hero, driven by revenge and hatred, he has the sympathetic charisma to pull that role off well.\r The film can get melodramatic from time to time, and some of the scenes involving the structure and some of the fights can feel messy and scrambled. But, Scorsese packs a punch and directs it with such focus. This may not rank with Scorsese's best efforts, but it's one many fans of the director should see."
    },
    {
      "rating": "9",
      "text": "Really loved the movie and I regret that I didn't watch it much earlier, only now. The acting and the scenes are really amazing there and even though it was really long, it was enjoyable all throughout it."
    },
    {
      "rating": "7",
      "text": "Of the Scorsese movies that I've seen, Gangs of New York is probably the weakest. It's not terrible, but not particularly great either. It's a period piece set in the middle of the 19th century, mainly during the midst of the American Civil War. The story is centered around Amsterdam Vallon, and his mission to avenge the death of his father at the hands of gangster Bill \"the Butcher\" Cutting. The storyline is somewhat interesting (especially with the events of the Civil War surrounding it), though it ventures into generic territory at times. DiCaprio is uninspiring as Vallon, and Cameron Diaz looks out of place for the entirety of the movie. Daniel Day Lewis is by far the best part of this movie. He carries the movie with his stellar performance as Bill Cutting. Additionally, the mid-1800s setting design is very well done. Though it has several faults, Gangs of New York is still a solid movie."
    },
    {
      "rating": "10",
      "text": "The painful birth of one of most emblematic towns of United States; a town forged by immigrants of assorted origins, and the constant wars between the multiple clans, moved by the jungle law. Outstanding cast makes it compelling all along the almost three hours."
    },
    {
      "rating": "8",
      "text": "Daniel Day-Lewis' performance in 'Gangs of New York' outshines everything else that's great about the movie, including Jay Cocks' well-researched script and Martin Scorsese's superb direction.Interestingly enough, when viewing the film after all these years, Leonardo DiCaprio's performance isn't quite as good as one might remember and Cameron Diaz's performance isn't quite as bad.  Nonetheless, the movie is a spectacle from the first scene to the last, and despite a slightly bloated run-time, it offers a robust portraiture of one of the most tumultuous periods in New York's  fascinating history."
    },
    {
      "rating": "8",
      "text": "The first half is captivating but the second half fails to keep the momentum. Cameron Diaz may have been in over her head in this one. Leo is solid and the supporting cast all works well. Daniel Day Lewis as the butcher is an epic performance that brings thoughts of Val Killer as Doc Holliday and is the real reason to return gain and again."
    },
    {
      "rating": "7",
      "text": "This film shows how Amsterdam Vallon tries to avenge the death of his father in a gangs fight by removing the power and influence of Bill 'The Butcher' Cutting, his father's murderer. Directed by Martin Scorsese, the film has a script by Jay Cocks and a cast led by Leonardo DiCaprio, Daniel Day-Lewis and Cameron Diaz. It was nominated for ten Academy Awards.This film is interesting but, as far as I realized, doesn't correspond to reality. The historical accuracy remained away from this movie most of the time. But the script is interesting. It has some points that I don't understand but it works, focusing on the fight between two rival gangs for control of the poor neighborhood of Five Points. The most powerful gang, the \"Natives\", thought the Italian and Irish immigrants were a danger to America, forgetting that they had also been immigrants in the colonial period (the true Americans are the indigenous tribes who were butchered to build USA). From this seed, the film shows how the US received waves of immigrants from Europe and how it was important for the country. The film also focuses on the civil war, the differences of opinion around it, and the poverty of the poorest sections of society.The actors were well in their roles but Daniel Day-Lewis deserves a special mention. He monopolizes the film with a careful interpretation of a particularly complex and difficult character. DiCaprio was also good, but remained in a role he knows well: the good guy, very cute, seeking justice. Cameron Diaz also brings no surprises, with her usual dose of Latin charm giving greater knavery to her character, already quite opportunistic and cunning. Action scenes are many and quite graphic, so the most sensitive stomachs should be prepared. The visual and sound effects are good and help to enhance the film. The scenarios were very well imagined, although some of them are too unrealistic, and the same can be said of the costumes. Nevertheless, the film is generally reliable enough to be appreciated. The soundtrack is a disappointment because it has a sonority too \"rock\" and doesn't fit well in a period film. It seems copied from films like \"300\" or \"Mad Max\"."
    },
    {
      "rating": "4",
      "text": "'Gangs of New York' is fantastical nonsense. I honestly am not sure if it's an unfunny comedy, like the equally overrated and awful 'Gone Girl'.Scorsese's directing of the actors is even worse than in his weak 'Goodfellas' formulaic reworking 'The Departed'. The casting is terrible, and the direction was clearly unclear, as it's like each actor was acting in a different film. The plot is completely moronic and unbelievable, and the fictitious gang in their bizarre top hats look stupid. Daniel Day Lewis looks like The Cat In The Hat, whilst hamming and camping up his role to the max, but then sticks out like a sore thumb as the other actors, unsuccessfully, attempt to play it straight. The film's wholly made-up and impossible conclusion just adds bad science into the mix, to go with all the historical inaccuracies. 4/10."
    },
    {
      "rating": "8",
      "text": "The story of the movies revolves around Amsterdam Vallon (played by Leonardo DiCaprio) who is young Irish immigrant to the US and recently released from prison. With the view of seeking revenge from his father’s murdered Bill cutting (played by Daniel Day-Lewis). Bill is the leader of an anti-immigrant gang and possesses great hold over the region. Amsterdam is aware of the fact that the revenge he is seeking can only be taken if he gains the trust of Bill. The journey of Amsterdam turns into a fight for his own survival. He also makes attempts to become well known among the people of the 1860s living in New York and have irish origins. The film was directed by Martin Scorsese and produced by Harvey Weinstein and Alberto Grimindi.A number of truisms have been portrayed by the movie, both broadly and contextually. The life in the Five points has been efficiently depicted by Martin in the film. Attention to the smallest of details was paid by him and his team. The customs, language and set accurately depicted what five points had looked like. It will not be wrong to say that some of the audience might had got the feeling that they were actually at the five points. There were two reasons for the popularity of five points i.e. the nativist and the Irish street gangs. Problems among the blacks, the protestants, the Catholics and the Irish have also been presented in the movie. Moreover, a historically accurate portrayal of the riots that occurred as a result of the Conscription Act of 1863 have also been presented in the film. However, the deconstruction process indicated that the places were nothing but almost purely fiction. Gangs of New York by Herbert Asbury does provide inspiration and historical background for the film to some extent. Herbert was a newspaper delivery man and become famous because of his salacious writing about the underworld of New York. However, his writings were usually based on myths rather than actual facts. There is no doubt that the area of five points was known for its violence, however exaggerated scenes filled with bloodshed and explosions have been presented in the movie. The five points’ author Tyler Anbinder, a Professor, claims that, contrary to the common misconception, the city was more productive and less violent and dangerous. A great many immigrants that arrived there were skilled workers.The movie is set in the year 1862 when a young immigrant of Irish origin named Amsterdam Vallon comes back to the area of Five Points area in the city New York to seek the revenge for the murder of his father from Bill “the Butcher” cutting.In my opinion, the is perfect as far as the acting, production, direction etc. are considered. It can be taken as a “more than one-time watch” movie if you ask a cinephile. However, there are a number of historical accuracies and inaccuracies depicted by the film. For example, more violence has been depicted in the movies than that that actually used to happen in the five points area of New York city. Murders and armed attacks were not as common as portrayed in the film. It can be said that the movie did depict historical events. However, the intensity of the violence related to those very events has been exaggerated to a considerably high degree. No doubt the movie can is quite entertaining, especially for those who are fond of watching violence and crimes in movies. Moreover, crimes were also brilliantly depicted by Martin in the movie. Note that Martin Scorsese is famous for his one-of-the-kind incorporation of crimes in his movies"
    },
    {
      "rating": "10",
      "text": "Scorcese in his best form, spellbinding performances by Day Lewis and Liam Neeson"
    }
  ],
  "recommendations": [
    "american_gangster",
    "the_godfather_part_ii",
    "donnie_brasco",
    "the_godfather_part_iii",
    "news_of_the_world",
    "hell_or_high_water",
    "a_most_violent_year",
    "lawless",
    "black_mass",
    "darkest_hour",
    "public_enemies",
    "wall_street",
    "nightcrawler",
    "creed",
    "the_eagle",
    "casino",
    "body_of_lies",
    "the_last_duel",
    "man_on_fire",
    "captain_america_the_winter_soldier",
    "bonnie_and_clyde",
    "the_hurricane",
    "raging_bull",
    "widows",
    "live_by_night"
  ]
}