{"id": 3280, "title": "Gangster Squad", "starring": ["Josh Brolin", "Ryan Gosling"], "runtime": 113, "genre": ["Crime", "Drama", "Action", "Thriller"], "description": "Los Angeles, 1949. Ruthless, Brooklyn-born mob king Mickey Cohen runs the show in this town, reaping the ill-gotten gains from the drugs, the guns, the prostitutes and — if he has his way — every wire bet placed west of Chicago. And he does it all with the protection of not only his own paid goons, but also the police and the politicians who are under his control. It’s enough to intimidate even the bravest, street-hardened cop… except, perhaps, for the small, secret crew of LAPD outsiders led by Sgt. John O’Mara and Jerry Wooters who come together to try to tear Cohen’s world apart.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/1eW9kFSuTQfyMvZKtxlnwKRBvI.jpg", "categories": {"plot": 5.9655172413793105, "acting": 6.324324324324325, "ending": 4.333333333333333, "soundtrack": 5.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 8.166666666666666, "action": 6.625}, "reviews": [{"rating": "7", "text": "On paper, and based on the preview, this is a movie that I absolutely should have loathed. Reminded me a bit of the old Warren Beatty / Madonna debacle Dick Tracy.  Even as I enjoyed the first third or so, I expected the other shoe to drop.  I was happy to be wrong.  It's no LA Confidential, but I had a lot of fun with this film.  The casting choices are solid (Robert Patrick and Michael Pena are terrific), it's exciting if not extremely profound or innovative in terms of storytelling, but with modest expectations, I think action fans and fans of the lead actors will get what they need out of it.  It actually got a rather widespread round of applause in my somewhat film-snobby theater."}, {"rating": "8", "text": "Don't go into this expecting LA Confidential and you're half way towards enjoying a fun comic book style movie with over the top violence that is almost entirely stylish over any type of content.  Reminded me a bit of Last Man Standing with Bruce Willis, although this is slightly more fleshed out, the action is well choreographed and the dialogue is macho more than meaningful.  A lot of cool characters including Robert Patrick's bit as a gunslinger who just doesn't miss.  Brolin and Gosling play their part to keep everything ticking over whilst Penn is maniacal as Cohen.  This isn't a deep film, but it is a good old shoot em up with snappy one liners, cool characters and lots of style.  Go to see it!"}, {"rating": "9", "text": "I really, really enjoyed this movie. Excellent acting, and pace.  Unlike many movies today, it was not \"too long\"  the script was clean.  Sean Penn was ferocious and very scary.  I hope he wins an Oscar.\rGood comedic relief also.  My expectations were fully met."}, {"rating": "9", "text": "I didn't know what to expect when I considered seeing this film--I was worried that there would be too much action and try to be something that it shouldn't. Gangster Squad is a heavily cliched film which does almost everything right. Are cliches all that bad? I don't think they are. A good introduction to all of the characters is key for this kind of film. The antagonist played by Sean Penn blew my mind and made me enjoy every moment he was on screen. Only problem I noticed with the introduction is that it drags on for longer than it needed to do so--taking up too much of a film which could have been longer. The mind-set needed to watch this film is that of what the classic gangster films used to be like. It's a classically designed and cliche gangster film which blew me away and only just misses out on the perfect score due to length."}, {"rating": "10", "text": "This movie is fantastic. Ton of blood, action, and suspense. If you like those types of movies, than Gangster Squad is for you. Right from the beginning, the movie had my attention."}, {"rating": "7", "text": "In 1949 Hollywood, a gangster from New York (Sean Penn) muscles his way into the West Coast crime syndicates. To bring him down, a renegade cop (Josh Brolin) assembles a team of outsiders (including Ryan Gosling). This is a time when everybody smoked and women were called \"tomatoes.\" This film's elegant period style and suave, snappy dialogue verge on parody, but director Rubin Fleischer manages to keep a sense of fun, while loading it with plenty of fights (fists and guns). The performances are enjoyable and the pacing never lags. While this isn't exceptional in any way, it's still thoroughly entertaining."}, {"rating": "5", "text": "Gangster shoot'em-up movie (with almost no shooting in the first hour), which feels like a mix of short scenes from various, unrelated films. It has a great cast that never manages to meet the expectations, great setting that is never really explored, and mediocre attempts to create deeper characters that fail miserably in a mish-mash of cliches."}, {"rating": "7", "text": "2013 for me seems to be completely over saturated with sequels and copy cats. I know people have been saying that for years but this year I have seen a lot. Its not necessarily a bad thing in my opinion though. Good movies leave people wanting more and therefor its understandable that movies like gangster squad are made. Right away and all the through I was constantly reminded of \"The Untouchables\", its influence on this movie are undeniable. A group of cops go above the law to bring down the mob. Once I accepted that and moved on I was entertained thoroughly. This movie has loads of action and lots of big name actors who keep it interesting. Most notably is Sean Penn who has a great performance as the mob boss. It makes me wish he played more characters like this because he definitely stuck out as the best. In the end I would call this movie a cross between the plot of \"the untouchables\" and the characters from something more comical like \"Dick Tracy\". Although it isn't as incredible as lots of gangster movies its still a good worthwhile watch."}, {"rating": "6", "text": "Don't mistake Gangster Squad for a serious gangster movie. It's an action movie that features A-listers and decent production design. Let's all just acknowledge this is the best we're going to get from the multiplex this early in the year."}, {"rating": "10", "text": "The rapidly expanding Los Angeles of the 1940s and 50s  the time when the aeronautics industry was becoming prominent, the freeway system being built, Disneyland was launched and the Chicago and east coast mob was moving in on Nevada and southern California  has become a favourite subject of the period crime film these past 20 years. It began with Barry Levinson's Bugsy, set in this new criminal milieu, and Lee Tamahori's Mulholland Falls, which centred on the ruthless cops hired to tackle these largely Jewish newcomers (known as the \"Kosher Nostra\"). It continued with two films based on James Ellroy's fact-based novels, LA Confidential and The Black Dahlia. The vicious New York gangster and former featherweight boxer Mickey Cohen came west via Chicago, sent by Murder Inc's Meyer Lansky to assist Ben \"Bugsy\" Siegel. In Bugsy, Cohen was on his way up in the mid-1940s and impersonated by Harvey Keitel, and in LA Confidential, when at his 50s peak, by Paul Guilfoyle. In the naive, heavy-handed, handsomely designed Gangster Squad, he's played as a preening, psychopathic monster by Sean Penn. We first see him using two cars to tear a Chicago interloper in two behind the \"Hollywoodland\" sign, thus establishing him as the monster who's corrupting the pure, law-abiding Los Angeles. The film is virtually a cross between those 1970s thrillers in which Vietnam veterans return home to clean up their tarnished homeland and Brian De Palma's The Untouchables, where Kevin Costner's Eliot Ness recruits an elite band of cops to break Al Capone's stranglehold hold on prohibition Chicago."}, {"rating": "8", "text": "Don't let the critics scare you away, because they always tend to hate movies like this one. Obviously people should have a certain mindset when watching a movie called \"Gangster Squad\". The movie is everything you expected it to be: A stylish shoot 'em up with top notch acting and lots of dead bad guys. It has a ton of humor and I laughed out loud more times than I do in a lot of modern comedies. It had a few emotional moments as well, but nothing to make you tear up. Not that anyone would watch this movie because they want to cry. It's a great story and I love this ind of movie."}, {"rating": "8", "text": "Very good movie and as others have mentioned, much more graphic than expected but in a good way.  Did a great job of portraying the era and had a little bit of everything."}, {"rating": "8", "text": "This started out as a serious gangster movie and ended in a wild west shooting style. Interesting characters, while the movie is deep and tells a scary story its full of meaningless shooting and action. An interesting mix thats good for all fans of the wild west and 1940s america."}, {"rating": "9", "text": "The acting was really good,the special effects were good and the movie was entertaining.Sure there was some unbelievable scenes and the movie was predictable at times but it's still one hell of a great movie."}, {"rating": "8", "text": "7.9/10................................................................................................................................................"}, {"rating": "10", "text": "Angels:  This is a good gangster movie.  The dialog is tough, and smart, the characters are interesting,  The plot is exciting, the scenery and costumes are very stylish, and the violence is, well, very violent.  What is not to like. I have an admission to make.  This movie is really an 8/9, but I gave it a 10, because I wanted to raise its average to combat the 'haters'.  Because of the negative reviews I almost did not go to see the movie, but my buddy out-voted me, and I am very glad that he did.  Did I say that Sean Penn and Ryan Gosling knock the ball out of the park?  Look, those boys really get into character,  and I am a sucker for pretty boy Ryan.  Now, the critics say, this movie is no LA Confidential.  Which must be true, because it's called 'Gangster Squad'.  A very enjoyable night out."}, {"rating": "7", "text": "It's just a fun movie. I'm a sucker for gangster movies and history, and while at times this is over the top it's still a beautifully shot and decently acted film. Just go in with an open mind and don't be expecting \"Goodfellas\" and you'll enjoy yourself."}, {"rating": "9", "text": "I really enjoyed this movie from beginning to end.  It COULD'VE been an epic movie like other gangster movies in the past, but sadly it's only 1 1/2 hours long.  I think this movie should've been a 3 hour epic, or nearly 3 hours...and more story-focused.  But I thoroughly enjoyed it and will be watching it again tomorrow."}, {"rating": "8", "text": "Writing about this movie, but avoiding spoilers, I will say that I'm baffled by the reviews stating it's mediocre or awful. I went into this movie expecting entertainment. Any film by the name of \"Gangster Squad\" is not expected to be highly storytellling. It's a classier version of a shoot-em-up. Great humor and subtle nuances made this film very entertaining. Josh Brolin, Sean Penn, and even in a quirky way Ryan Gosling all stood out with memorable acting. The only person that felt a little cut-and-dry was the one who played Brolin's character's wife (I'd throw that to the writing and not the actress herself). I honestly felt this movie was somewhat reminiscent of Dick Tracy, but less colorful. The action, the style, and the cinematography were all on point and the edit made to remove the Movie Theater scene (which delayed the movie's release in the first place) and replace it with something else is quite seamless. There were some surprise cast members that I didnt know were in the movie, but added very very well to the story. I give this movie an 8 out of 10 (would be 8.5 if it had the option) as there are some minor flaws  and points where I feel it was rushed in some areas, but I thoroughly enjoyed it. I will buy the DVD when it is released and hopefully there is bonus footage, so it wont feel so rushed. Would recommend to friends and strangers alike. I'd say just watch with an open mind and not for the movie to be taken DRASTICALLY seriously, and just as a friday night flick."}, {"rating": "10", "text": "A movie like this should be rated on it's entertainment value, and this movie is brilliant. I don't understand why people don't like it? It is an all round superb movie, in fact i loved it so much i'm going to see it again. It was very emotional at some parts and shocking at others. No major issue stood out at me at all. I love that era and location in history and this movie was perfect for entertaining that."}, {"rating": "10", "text": "Amazing movie    ."}, {"rating": "2", "text": "Really surprised this film has so many positive ratings. Sure, it's a great movie...that should be nominated for Best Picture at the Raspberry Awards. All flash and no substance, which is what the majority of Hollywood dishes out anyway. Minus the big name actors, this movie could go straight to Redbox and nobody would notice."}, {"rating": "1", "text": "Pure garbage. It's a mystery how this cast agreed to such a poorly-designed premise.  The result amounts to a complete waste of time. Watch something else."}, {"rating": "8", "text": "Gangster Squad provides exactly what I expected but also wanted. It has violence, tommy guns, cool suits, and a lot of attitude, which is precisely what a gangster flick should contain. The movie is a terrific throwback to the days when mobsters ran wild and had everyone eating out of the palm of their hand. Director Ruben Fleischer (Zombieland) shows no mercy when it comes to the characters getting their hands dirty. He tells a ferocious and foul tale based on true events, but balances it with some good old-fashioned fun and more humor than one might expect from a film like this. Fleischer creates a thrilling, stylish atmosphere and has a hell of a cast to bring such a flashy yet corrupted, dangerous time in our history to life.\r Set in the City of Angels in 1949, boxing champ-turned-mobster Mickey Cohen (Sean Penn) is running the streets and owns just about everything and everyone in town. Cohen does not have his sights set on just one or two cities in California. He is way too greedy for that. He wants control over the entire state. While most just turn a blind eye, Police Chief Parker (Nick Nolte) wants to take Cohen down and get him out of his city. But he knows he cannot do it within the confinements of the law so he brings in a war hero turned cop named John O"}, {"rating": "7", "text": "This film has received many bad reviews, but not because it's a bad movie. The truth is it's just not what people expected it to be. When you hear about a mafia movie, you expect an epic, inside look like with Goodfellas or Casino, but Gangster Squad is from the cops point of view and more like The Untouchables. Gangster Squad is based on a novel and is about an off the books LAPD operation aimed at bringing down Micky Cohen. In the 1940s, LA had a growing mafia problem on it's hands, and Mickey Cohen was set to become the next Al Capone. Unbeknownst for decades, the LAPD sent a group of cops, who didn't play by the book, after Cohen and by going after his business interests, they attempt to destroy his growing empire. The story is a great one, well deserving of a film adaptation, but what people didn't like was how it turned into an action film. This story has all the makings of an epic mafia drama, an you will be hard pressed to find a better performance than the one Sean Penn gives as Mickey Cohen. It was somewhat disappointing that they didn't get more into Cohen and his operation, but for what it was, it was a great film. As for the cast, it features some of Hollywood's best an brightest as old school meets the up and coming stars of the big screen. Every one from the stars to the ancillary characters give Oscar worthy performances that will be sadly overlooked. because of the nature of the film. If you're looking for a classic mob drama, you're going to be disappointed, but if you want to see an action packed cop movie with a mob element, then Gangster Squad is the film for you."}, {"rating": "10", "text": "I really like it    ."}, {"rating": "3", "text": "What went wrong? I saw the trailers for Gangster Squad and thought that this looks right up my street. Good collection of actors  Penn, Gosling, Brolin tied to some lovely art design (I'm a sucker for 1940's America). This should be a great  or at least decent  slice of the cinema cake. Sadly, it's all frosting. When a film starts with a guy being ripped in half by 2 cars and another guy getting his hand ripped off by a lift, you may be expecting a gritty film. But Gangster Squad is all gloss and the violence, far from being helpful, detracts because its so comical. Think Sin City, but without the subtlety. It sets the scene for an film with a very uneven tone (is it character ensemble, action film, comic book, historical?) and a script that is so simple it would make the A-team look deep. With a gaping plot hole that is signposted miles away. There's very little to recommend here beyond the visuals. The characters are so cliche that the actors cant do any justice with them (Penn could well be basing his character on villains from Dick Tracy) and the twists have so little swerve that you know where the film is going long before you get there. There's nothing original here and nothing to keep you interested. A shame."}, {"rating": "5", "text": "\"Gangster Squad\" is a thoroughly enjoyable crime noir flick, resplendent in its violence but lacking in emotional depth. Sean Penn shines in what is otherwise a forgettable film."}, {"rating": "6", "text": "Great cinematography, but the film itself leaves a lot to be desired, more style less substance. There are a lot of things this movie gets right, but from a narrative perspective, it isn't very strong. Sean Penn, cinematography and the shootouts are the true stars of the film"}, {"rating": "9", "text": "Can't help but think that critics have an agenda. This is a really good movie. I really liked the way it was stylized and filmed. It is a bit funny sometimes but a great experience through and through. Shall watch it again. Highly recommended."}, {"rating": "7", "text": "it's an alright action movie set in the 1950s or something. It's loosely based on a true story, even though it's obviously not how the real arrest went down. But it's a fun movie with great acting and some good action scenes."}, {"rating": "4", "text": "If Gangster Squad was going to be released in September, then how come the movie pushed back to January 14? This isn't \"L.A. Confidential 2.0.\" I'd say \"Gangster Squad,\" how could you. I was really aware that the film was not just the violence, but the horrific tragedies in Aurora and Newtown. This is one of the most disappointing movies of 2013. Mediocre script, bad choices of picking gangster characters, poor acting. They f***ed up."}, {"rating": "6", "text": "A pulpy action throwback that effortlessly achieves its goal to entertain thanks to a top-shelf cast, dazzling direction, and a fast-paced screenplay chock-full of snappy 1940s-style patter."}, {"rating": "9", "text": "5;6; دربار7; ای6; کتاب چیز زیادی 6;5;ید8;6;5; ا5;ا 1;ک ک6;5; خ8;ب باش7; ای6;جا 7;5; کار خاصی 6;دار5; ک4;ا 5;یچرخ5; ببی6;5; ک7; چی 7;ست؟"}, {"rating": "0", "text": "The movie fails to entertain period.\rThe story-line is a seen it a million times before and it was done better.\rCharacters are unbelievable, uninspiring and dull\rThere are mediocre special effects thrown in hear and there like car chases and fist/gun fights.\rAll in all do not recommend to anyone but people who have absolutely nothing else to do."}, {"rating": "5", "text": "This movie deserves it's mediocre reviews. The start scene involving the chief over dramatized, the scene with Emma Stone and Ryan Gosling horrible and trying to be dramatic. Why are cops attacking the mob with standard handguns? I like the whole the war is over that sentence and theme was repetitive. Don't pay for this film I had such high hopes, especially with the cast. But it's just a let down."}, {"rating": "6", "text": "\"While i was not in love with the film nor is it a masterpiece in anyway, shape or form. But it sets a good tone in its classic backdrop. Featuring some pretty good performances. The bottom line is GS is entertaining but insanely forgettable. Its just good\"  B-"}, {"rating": "5", "text": "You've seen Goodfellas, Scarface and LA Confidential? Then you've seen Gangster Squad. All cliches and no substance, the best thing in it are the cars."}, {"rating": "6", "text": "LA Confidential highlighted the fall of Mickey Cohen as a decision made out of greed and corruption within the police force. Gangster Squad argues the opposite, that Cohen failed because of the righteous and the honourable, even if their methods turn out to be questionable. What is ultimately an action film,  Gangster Squad delves into the Cohen era but rarely tries to say anything meaningful in favor of the tongue in cheek actioner the studio clearly envisioned. The film opens to Mickey (Sean Penn) owning LA, much to the chagrin of the police commissioner (Nick Nolte). Therefore he sets up an off the book squad of officers with one goal, the destruction of Cohen's criminal organisation, by any means necessary. The film does play like a poor mans untouchables and doesn't hold a candle to the masterpiece that is LA Confidential but Gangster Squad is a solid action romp across the city of angels with a group of actors clearly having a whale of a time. Josh Brolin leads the titular squad with his charming everyman shtick, Michael Pena and Robert Patrick make a great odd couple pair of gunslingers and Sean Penn camps it up the the extreme as Cohen but the charm of the film lies with Ryan Gosling who plays a cop who thinks hes too smart to play cop and get involved. Gosling impresses with the choices he makes for the character and his chemistry with leading lady (if her limited presence warrants the leading part) Emma Stone, although that was already proven by Crazy Stupid Love. Stone herself doesn't really have much to do and therefore doesn't stand out but she's serviceable at least and has a classic noir quality to her. The downside to the film is that it is just a by the book actioner with a workable but not amazing director who doesn't really try to impress. A car chase halfway through the picture is shoddy and highlights the flaws in the direction although a shootout in Chinatown impresses in the moment. The script however is playful and entertaining meaning the character interactions pop. The film ultimately lives in the shadow of other great gangster films and never really lives up to their pedigree but as an action flick it entertains for its run time, just don't try and recount the events of the film a week after seeing it, you might just find you honestly can't remember them."}, {"rating": "5", "text": "You can look at this two different ways. As a movie, its fine. It's got gun fights, slow motion, fist fights and car chases. On the other hand, it's supposed to be inspired by the story of the real gangster squad. In a recent article, John O'Mara's granddaughter was interviews to hear about he legend behind the man. She quoted her mother as saying \"They used their brains, not bullets\" and went further on to explain that violence sells, so violence wins. Her mother also said that her O'Mara fired his gun once in his career, and it was a warning shot.\r So where does this leave us with the ultra violent, hero cop hurrah? in the middle, which is why I gave this movie a 5. I'm a huge film noir buff. I love everything from Bogart in The Maltese Falcon all the way to Pearce  Crowe in L.A. confidential. This movie falls short in being a caricature of a golden era, and doesn't do the men justice who helped put Cohen away. It's still a decent movie, and I'm not squeamish towards violence (as long as it has its place). That said, all the style, violence and charisma this movie has still leaves me a bit uneasy knowing the white washing the characters went through to make them square jawed, all American heroes. This movie would have done better with less action and more truth."}, {"rating": "6", "text": "This ho hum gangster flick has one of the greatest pedigree in recent months, but has no ambition. Great actors? Check. An acclaimed director? Check.  What you have though is simply a straight up action film. nothing more. If you want a more visceral and greater take of this 'rogue cops vs gangsters' sub genre, than look up 'The Untouchables'."}, {"rating": "5", "text": "No amount of flashy cinematography, classic callbacks to gangster films of the past or an all star cast can save Gangster Squad from being a mediocre mess of mixed tones, laughable dialogue and over the top drama that is based on a true story, with obvious elements entirely fictionalised for the big screen. Sean Penn puts in what can only be described as an exaggerated performance as Mickey Cohen, a powerful gangster in the west coast who wants to control the whole lot, he talks confidently and is surrounded by an entourage of cronies and paid off cops who help him sleep easy at night. Penn's physical appearance in the film is quite comical, with one shade of orange too many, but hot-headed cop John O'Mara (Josh Brolin) is always right behind Cohen, picking up his mess and causing problems as a one man wrecking crew, until he is assigned as the head of a special group tasked with taking down Cohen, guerrilla warfare style. This is where the onslaught of violence ensues which seems unnecessary, each and every big member of the cast, whether its O'Mara, Wooters (Ryan Gosling) or the secretive and deceiving Grace Faraday (Emma Stone) are underdeveloped with next to no motive for going \"off the books\" in their attempt to bring down Cohen. It isn't all a lost hope though, it's been ramped up and glamourised to combine classic elements of noir films to create a visually striking piece, but this always falls flat with the films content, the biggest downfall being cartoonish and amateur writing that tries to be smart but comes off as a TV movie with a Hollywood budget, the cast can are only as good as the material, Sean Penn showing signs of excellence as the ever unpredictable mob boss, but the film film keeps going on a tone that almost feels like a parody, an inconsistent tone doesn't help the situation, we see hotshots and pretty girls, then we are introduced to a barrage of gunfights and car chases, but then we have retaliation that is muddled and brought down by that damn dialogue, seriously, the film is way out of its depth. A chemistry between Gosling and Stone is non-existent, while the film delves deeper into predicability with a final act that only solidifies this stance, it's fun and enjoyable, but writing on the wall. Gangster Squad should be seen for its visual spectacle and talented cast which also includes Robert Patrick, Michael Peña, Anthony Mackie and Giovanni Ribisi, but certainly not for its attempts at a serious tone which is dragged to the mud with a questionable script and cartoon whims from its characters, who just appear to enjoy playing dress-up, looks can indeed be deceiving."}, {"rating": "2", "text": "With a cast this great, and a premise so promising, one would expect this movie to be incredible. Unfortunately, this movie sucks big time. It's boring, overly long, and it does not utilize the great tools at its disposal. A real disappointment. Yuck.\r Rewatch LA Confidential instead of wasting your time with this drivel. It's a much better crime drama with  in a similar setting."}, {"rating": "4", "text": "I was excited when I saw the previews for this one but very disappointed. Reminded me of Boardwalk Empire but without the good characters and twists of storyline. If it wasn't for Sean Penn's character/effort I would have turned this off before it was 30 minutes into the film. Credit the set design and costume design as it was easy to believe the scenery. But, if that is the best thing I can say about the movie (other than Sean Penn) maybe that is enough said!"}, {"rating": "5", "text": "Good acting, time period cars, clothes and firearms seemed peroid correct.  However, the production and directing of this movie is where it loses me.  If you got 8 bucks to blow and less than 2 hours to kill go for it, other wise see something else"}, {"rating": "2", "text": "If there was one movie in 2012 that I was most excited to see, it was Gangster Squad. The trailer had a distinct visual style that impressed me at the time, the cast could not have been any better, and it looked like a fun gangster film that would also be a great addition to the genre itself. Then when it was delayed to 2013 for re-shoots after the Aurora, Colorado shootings I was disappointed to have to wait until 2013 for this movie. Well, I"}, {"rating": "6", "text": "Ferociously edited and directed with some style even if the screenplay is some what suspect. As written here this gangster squad veer between, at best, opportunistic and, at worst, downright inept. The film is always fast moving and entertaining and the production values are excellent. Josh Brolin gives the best performance as the squad's leader John O'Mara. Sean Penn is at his scenery chewing worst as arch villain Mickey Cohen and Ryan Gosling, in an unusually bland role for his superb actor, is rather colourless. Emma Stone has little to do as the obligatory female love interest as is also the case with many well known faces in supporting roles. Still, as undemanding entertainment you can do a lot worse."}, {"rating": "5", "text": "Gangster Squad has a great style and some great actors; unfortunately the writing keeps it from being so much more than it could've been.  When coming into this film I expected to be bored to death, but the film is actually very entertaining and fun which will please many audience members.  There is a lot of violence and action that made this feel like a mix of"}, {"rating": "1", "text": "Wow. How some people can rate this movie high goes beyond my imagination. But lets tell why this movie is just a disaster. A historically interesting story is turned into an avalanche of clichés, probably a candidate to one of the biggest considering the cast. Acting, despite this star cast, is absolutely terrible. Story is unlogical and the ending is just one enormous pile of clichécrap. I honestly felt like demanding my money back from seeing this at the cinema. If you want to see a gangster movie from the era, there are plenty of good options. This one is just horrible."}, {"rating": "3", "text": "Gangster squad directed by Fleischer, a really bad movie, almost ridiculous, the director can not make a gangster film, stereotypical characters, in short, the movie is crap boring haphazard."}], "recommendations": ["shooter", "the_equalizer", "copshop", "street_kings", "the_italian_job", "2_guns", "jack_ryan_shadow_recruit", "demolition_man", "snatch", "american_ultra", "inside_man", "lawless", "a_walk_among_the_tombstones", "public_enemies", "angel_has_fallen", "true_lies", "skyscraper", "the_mechanic", "payback", "killer_elite", "the_losers", "run_all_night", "the_equalizer_2", "desperado", "true_grit"]}