{
  "id": 2877,
  "title": "Garfield: A Tail of Two Kitties",
  "starring": [
    "Breckin Meyer",
    "Jennifer Love Hewitt"
  ],
  "runtime": 78,
  "genre": [
    "Animation",
    "Comedy",
    "Family",
    "Adventure"
  ],
  "description": "Jon and Garfield visit the United Kingdom, where a case of mistaken cat identity finds Garfield ruling over a castle. His reign is soon jeopardized by the nefarious Lord Dargis, who has designs on the estate.",
  "releaseYear": "2006",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/osfMaHucgLtHtsMa6TQLTooE3G7.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 5.333333333333333,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.666666666666667,
    "funny": 3.3333333333333335,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This movie rocks."
    },
    {
      "rating": "2",
      "text": "It's weird and wacky humor made it a so-so movie. If you are a cat lover then you'd love it, but that's not all that counts. My sister quotes, \" It's better than Over The Hedge \" but i don't think so. I think that it is more of a \" badly humorous \" movie."
    },
    {
      "rating": "10",
      "text": "This movie couldn't be better!"
    },
    {
      "rating": "2",
      "text": "Someone obviously used a bunch of false names to spam the votes and give this movie three 10's in a row. BTW this movie is rubbish."
    },
    {
      "rating": "7",
      "text": "It moved slowly but was cute and kids will like the antics.  Garfield is CGI while the humans and other animals are non-animated.  Very good for families."
    },
    {
      "rating": "7",
      "text": "It was nice, so much better than the first one. Its enjoyable and funny. The kids and everyone who likes Garfield will love it. I think that this time the story was better and the plot was better developed. Bill Murray is excellent and so hilarious as the voice of Garfield."
    },
    {
      "rating": "10",
      "text": "this movie is nearly as good as the godfather it is one for the whole family must watch"
    },
    {
      "rating": "10",
      "text": "The greatest film of all time."
    },
    {
      "rating": "10",
      "text": "best movie of all time final verdict:\r1000000000000000/1    BOTHER WATCHING!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "3",
      "text": "Garfield no es chistoso en ciertos momentos, es tierno pero la historia es una basura, es entretenido pero no convincente tiene sus cosas buenas y sus cosas realmente ridículas y malas"
    },
    {
      "rating": "10",
      "text": "Fun Stuff. I highly recommend it."
    },
    {
      "rating": "0",
      "text": "Okay, so the first Garfield movie already sucked enough, so they come back with a second one to make the audiences feel like committing suicide even more? Urgh! If I can say anything about this movie to the people who feel like seeing it, you have to be 4-10 to actually enjoy it."
    },
    {
      "rating": "3",
      "text": "Garfield pulled a sequel and improved a bit in terms of duration and plot, but still very bad in the script and in the animation and motion capture , I feel Garfield, from the first movie I damage my entire childhood."
    },
    {
      "rating": "7",
      "text": "It was a lot better than the first I think. Was it great? No. But it was alright and I found myself actually enjoying it."
    },
    {
      "rating": "5",
      "text": "\"A Tail Of Two Kitties\" surprised me. It was actually a tolerable movie. The jokes are barely there, and the performances are all wooden, but I seemed to somewhat enjoy this comedy. Garfield moves and looks a bit better than the first movie. I won't say it was a good movie, but it was a pleasant surprise."
    },
    {
      "rating": "7",
      "text": "an improvement over the first movie"
    },
    {
      "rating": "2",
      "text": "The first Garfield film was tolerable as it was occasionally funny. Garfield: A Tail of Two Kitties however over uses voice portrayed real world animals and it's humour will make kids under the age of 7 laugh but will make everyone else yawn."
    },
    {
      "rating": "7",
      "text": "Enjoyable to watch. Great movie for kids,teens and some adults. I would watch this if it's friday night or i'm on vacation somewhere! I think it's a pretty good \"Garfield\" movie."
    },
    {
      "rating": "3",
      "text": "Now THIS on the other hand has one word to describe it: BORING! It's really boring and a disgrace to the first Garfield movie, which was actually funnier, this is NOT."
    },
    {
      "rating": "4",
      "text": "I recently watched it on TV, right after the first. Not as sophomoric as the first one, nor as campy, but still lacks what makes the comics funny: a brain. The parody is long dated, and lacks any satire that the comics possess. The acting is retarded at best. Especially Jennifer Love Hewitt. The romance is supposed to be tumultuous and funny. Instead it makes me want to s**t and vomit at the same time."
    },
    {
      "rating": "10",
      "text": "GOTTA WATCH THIS MOVIE 100000000/100000 WATCH THIS MOVIE GARFIELD IS GOD PRAISE GARFIELD PSYPRBSFAN1 IS COMPLETELY RIGHT PLEASE DONT FLAG THIS REVIEW!!!!"
    },
    {
      "rating": "10",
      "text": "WOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOW\rBest movie 2006!\rIt made me feel alive again, I've never seen a movie this great before.\rDefinitely deserves a 10/10!"
    },
    {
      "rating": "9",
      "text": "this film is the movie version of sex, the best film released on jun 16, 2006. a god send of sensation sent straight to my testicles. i lost a stable marriage to this movie. my kid don't know my name because i live this film"
    },
    {
      "rating": "4",
      "text": "In Garfield, all we had was a CGI Garfield and real animals. In this one, Garfield is doubled by another CGI cat that looks similar to him named Prince. If A Tail of Two Kitties can at least entertain you, then it's only best to say have fun watching this movie."
    },
    {
      "rating": "7",
      "text": "Way better than the first but the acting is still bad and the cgi is still painful to watch but the story is kinda better and the movie is very decent."
    },
    {
      "rating": "7",
      "text": "It improved upon the first movie, and I thought it was fun to watch. The story was new and something I didn’t expect from a Garfield movie, but it worked really well! The animation seems a little better, but still might need some work. I think everything was well made, but not the best movie ever."
    },
    {
      "rating": "10",
      "text": "I can‘t remember what this movie was about really, but back when I watched it, it was probably good so 10/10"
    },
    {
      "rating": "6",
      "text": "Ok movie. I like it better when he messes with Odie. It was like they were trying to be more cute in this movie."
    },
    {
      "rating": "2",
      "text": "stuffing your face as usual.I gotta have a good mealGarfield you fat cat you are so big and fat why are you so fatI eat, Jon. it's what I doit's time to kick odie of the tabledont do it garfielf, that's our pet dog odieyou're going into orbit, you stupid muttGAAAAARRRFIIIELD!!!time for a nap. I'm a cat who loves to snoozegarfield you lazy catI hate alram clocksI'm am hungry I want some lasagayou're eating us out of house and home, garmfieldenough with The Chit Chat let's get some grub goingGRUB TIME...where Are the 3-cheese pizzasI ate those foodwhere Are the taco shells ?I ate those foodwhere did all the hamburger helper gobrupYou're such a bad kitty that's it I've had it with you that does it I'm done that's the last straw grarfileldthe sequel"
    }
  ],
  "recommendations": [
    "marmaduke",
    "alvin_and_the_chipmunks",
    "the_spongebob_movie_sponge_out_of_water",
    "ice_age_dawn_of_the_dinosaurs",
    "herbie_fully_loaded",
    "diary_of_a_wimpy_kid_dog_days",
    "hannah_montana_the_movie",
    "alvin_and_the_chipmunks_chipwrecked",
    "chicken_little",
    "yogi_bear",
    "alvin_and_the_chipmunks_the_squeakquel",
    "kangaroo_jack",
    "the_smurfs",
    "the_game_plan",
    "minions_the_rise_of_gru",
    "the_croods_a_new_age",
    "barnyard",
    "spy_kids_all_the_time_in_the_world",
    "zookeeper",
    "the_spongebob_squarepants_movie",
    "the_babysitter_killer_queen",
    "the_cat_in_the_hat",
    "the_boss_baby_family_business",
    "sonic_the_hedgehog",
    "bedtime_stories"
  ]
}