{
  "id": 552,
  "title": "Garfield",
  "starring": [
    "Bill Murray",
    "Breckin Meyer"
  ],
  "runtime": 80,
  "genre": [
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "Garfield, the fat, lazy, lasagna lover, has everything a cat could want. But when Jon, in an effort to impress the Liz - the vet and an old high-school crush - adopts a dog named Odie and brings him home, Garfield gets the one thing he doesn't want. Competition.",
  "releaseYear": "2004",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/OxMkPvxxroH5TBTaeXxEEDwxOl.jpg",
  "categories": {
    "plot": 5.444444444444445,
    "acting": 6.2,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.75,
    "funny": 5.133333333333334,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Garfield is as bad as you think it could be. Children will no doubt be entertained and laugh at it as I did when I was kid. Now that I’m older I laugh at how bad it is. How Bill Murray wound up in a terrible movie and he would’ve been good as Garfield if there was a good script. Unfortunately, this is a thin story with boring characters that are dully acted. It’s a waste of everyone’s time and I feel bad for all the parents who got dragged by their kids to see this."
    },
    {
      "rating": "2",
      "text": "The comics have smart, witty, and sometimes satirical humor. Here, it's an adventure movies with a Cat saving a Dog in live action. With a campy love plot between Jon and Liz which in the comics is just a laugh riot of \"No\". This movie is a disgrace to Garfield and to Jim Davis. F**k it, I say. And stick to your newspapers."
    },
    {
      "rating": "3",
      "text": "Garfield I expect nothing , unless the entire contempt , this movie is for little children , but also was the family film live-action CGI I have seen, also too short, and terrible script, horrible animation THAT S**T IS THAT ?!?."
    },
    {
      "rating": "4",
      "text": "If Garfield got the hanging of the CGI effects, there would be no way that Garfield can totally outdo himself from making this movie look like a mess."
    },
    {
      "rating": "7",
      "text": "I am shocked at how badly received this film is. It has great animation, a decent story, it's funny and suitable for everyone. OK it is cheesey, predictable and perhaps not got the greatest acting, but sometimes a film where everything goes to plan and has a happy ending is a good thing."
    },
    {
      "rating": "6",
      "text": "I think it was alright, I used to really like it, but then I grew up to Marmaduke and forgot about this for a while, I think many people might disagree though. But the real question was, why did Bill Murray do Garfield? It just looks confusing when you hear about it. I would at least go by calling it a movie."
    },
    {
      "rating": "10",
      "text": "Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK  Garfield shot JFK"
    },
    {
      "rating": "3",
      "text": "What \"Garfield\" doesn't have is the sophisticated humor the comic had. What it has is a messy dialogue with a terrible script."
    },
    {
      "rating": "8",
      "text": "It has captured the spirit of the show an awful lot better than it could have, and it results in a family movie that is actually a ton of fun."
    },
    {
      "rating": "7",
      "text": "Woah, this movie gets WAY too much hate. A 27? Believe me, it's a lot better than that. Bill Murray was perfect as Garfield, in fact, his performance as Garfield was the best Garfield performance ever. It's true that John behaved a bit TOO differently from his cartoon self (the original John was a bit of a loveable nut whereas this one is just a bit absent-minded). But Garfield was well captured and it's not like they dumbed it down or anything- like the comic, there are lots of moments where the title character makes a witty comment on something (I.e, after having fallen into a van full of boxes of Lasagna he says \"Once again, my life has been saved by the miracle of lasagna\")  it's a fun movie, much better than they say."
    },
    {
      "rating": "4",
      "text": "This movie is similar to The Flintstones, Scooby-Doo and many other cartoon series adapted to live-action movies. I really hated this movie it was so stupid, so dull and so ridiculous. The character of Garfield was terribly made not only because of the effects they used but the performance. And not only Garfield, also all the rest of the cast was so terrible. A movie to be forgotten."
    },
    {
      "rating": "5",
      "text": "Garfield Garfield is a cat who lived with a young man and he did unpleasant stuff at home so the man who cared and look after Garfield disliked Garfield when he did unpleasant and naughty stuff. One day the young man who looked after Garfield decided to take Garfield with him to the hospital. When the young man arrived at the hospital he was told to take a dog home with Garfield. When they all arrived home Garfield dislikes the dog that was taken home with him. Garfield was not being kind to the dog.  When the young man looks after the dog Garfield was so angry. So Garfield decided to mess up the home and pushed the shelves and furniture.  The part that I like was when Garfield communicates with his carer and other dog. The film had a great ending."
    },
    {
      "rating": "5",
      "text": "An OK live action film of the famous cartoon strip. Manages to keep the same sense of humor as the comics and it's good that Bill Murray did the voice over as he did with the cartoon show. Overall more of a movie for the youngsters."
    },
    {
      "rating": "0",
      "text": "I really like garfield but this movie it's a waste of time and the cat it's very stupid."
    },
    {
      "rating": "6",
      "text": "a decent adaptation of our lovable comic strip character"
    },
    {
      "rating": "8",
      "text": "This was a good movie. Garfield and Bill Murray are awesome! The storyline was great. The animated Garfield character was amazing. The characters were good. Garfield is better than the critics said it was and I would recommend it. Garfield >>>>>>>>>>>>>>>>>> Math and French Homework"
    },
    {
      "rating": "0",
      "text": "La serie animada de Garfield marcó positivamente mi infancia, pero esta película no tiene por donde salvarse, es deliberadamente pésima y sin ninguna gracia."
    },
    {
      "rating": "6",
      "text": "It is decent but could have been better like the cgi and the acting. But everything ranges from bad to okay so this movie is decent but flawed and will disappoint a lot of people."
    },
    {
      "rating": "6",
      "text": "this movie shows the essential spirit of Garfield, but never develops a good climax, the plot have a lot of dissipated potential.\rit's good, with a happy ending and absolutely not a waste of time."
    },
    {
      "rating": "10",
      "text": "Classic, One Of My Favorite Movies. Bill Murray As Garfield Was Just One Of The Funniest Things I've Ever Seen, Yeah I Know This Movie Is Hated, But Still Very Funny And Liked It Since I Was Little."
    },
    {
      "rating": "6",
      "text": "I think it was good overall, but needs a lot of work to be great. The animation isn’t the best, but it can look great at times. The story I thought was mostly good, it was fun to watch. I think it is good, but not as good as as other movies."
    },
    {
      "rating": "6",
      "text": "note six the movie is cool, good, funny the movie is not bad nor very good this is a movie love or hate my opinion is a movie more or less"
    },
    {
      "rating": "10",
      "text": "Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job. Jfk was an inside job."
    },
    {
      "rating": "7",
      "text": "This movie means a lot to me cause it was one of the first movies I watched when I was very little and I still love it t this day."
    },
    {
      "rating": "10",
      "text": "Never watched the Garfield movie, but how can it be? Right?I mean it has Garfield in it, so it has to be good in my oppinion 10/10"
    },
    {
      "rating": "10",
      "text": "This is a moving and glorious documentary about our Lord and savior. May his lasagna always be warm and bountiful. Death to Mondays!"
    },
    {
      "rating": "5",
      "text": "\"Garfield: The Movie\" definitely does not have the consistent humor that the cartoon had. Honestly, I don't think adults will find much fun with this movie, but most kids should still be entertained for most parts, since they probably won't notice the problems from the awful dialogue and script."
    },
    {
      "rating": "5",
      "text": "I thought that for a kids movie, its pretty good. I felt that its not really anything to write home about, so to speak, I've seen more imaginative storylines for/in kids movies before but there's nothing really all that bad about it either.It won't really make all Garfield fans happy, for more adult fans like me, you will, if your not aware of the target audience the movie was made aiming for (ie young kids), be a bit disappointed. Its true to say that kids do like Garfield comic strips etc., but they are also popular to older people too, some of the comic strips are really quite witty. I thought that using Bill Murray to voice Garfield was a good choice, you can get a feel for Garfields arrogance through his voice, he voices him well and the dialogue does have some witty points, again nothing all that amazing or really to write home about but still, not bad all the same.With the story being what it is, don't expect something outrageously great, it is a bit thin on the ground and I do feel that perhaps a more interesting or less predictable story could have been devised, to make this a bit better... having said that, I did manage to watch through to the end of the movie, I didn't feel like it was as bad as some kids movies where im completely bored rigid and can't stand to watch any more. Which is impressive considering yes im a fair bit older than the target audience lol but still, as a Garfield fan with a chance to see it for free, why not watch say I?! I do feel that I missed a bit, with my memory of the middle part of the movie a bit fuzzy and now I wonder how some parts of the story made sense but overall I felt it still entertained me as much as could be expected for a kids or family movie. If I had young children, I would have no worries or doubts about putting this on. The only real downside to me was that the story could have been just that bit more, well, interesting or better really... more imaginative. The sequel, a tale of two kitties, interests me more but ill most likely still wait until thats shown on freeview TV again possibly at Christmas before I check that one out lol though I do also feel that perhaps a bit more interesting dialogue could have been added, that might have made it funnier for older audiences to satisfy older Garfield fans. As it was, it was ok, still a somewhat average but decent entertaining movie for kids (a good introduction to Garfield for children) but it maybe could have been better, thats how I feel overall."
    },
    {
      "rating": "10",
      "text": "Heaven hath come to cinema. Bow down to your fat orange lord, mortals, else you shall perish."
    },
    {
      "rating": "8",
      "text": "Like this movie. I always enjoy the real versions of animated movies. This was done well. Garfield being pissed off at Odie for John bringing him home."
    },
    {
      "rating": "10",
      "text": "Не понимаю почему этот клёвый фильм оценили так низко его оценили. Мне кажется люди немного совсем чуть-чуть зажрались!"
    },
    {
      "rating": "2",
      "text": "stuffing your face as usual.I gotta have a good mealGarfield you fat cat you are so big and fat why are you so fatI eat, Jon. it's what I doit's time to kick odie of the tabledont do it garfielf, that's our pet dog odieyou're going into orbit, you stupid muttGAAAAARRRFIIIELD!!!time for a nap. I'm a cat who loves to snoozegarfield you lazy catI hate alram clocksI'm am hungry I want some lasagayou're eating us out of house and home, garmfieldenough with The Chit Chat let's get some grub goingGRUB TIME...where Are the 3-cheese pizzasI ate those foodwhere Are the taco shells ?I ate those foodwhere did all the hamburger helper gobrupYou're such a bad kitty that's it I've had it with you that does it I'm done that's the last straw grarfileld"
    },
    {
      "rating": "6",
      "text": "A family film that barely resembles its source material, Garfield is a bizarre fever dream that I sort of wish never happened.One thing I liked about this film was Bill Murray as the voice of Garfield, I think he was ultimately the best choice to play the fat cat. But he was given very little to work with in the final film, especially since the script is so poorly written. Everything else is a mixed bag, I was mostly indifferent on Garfield's CGI design but it makes little sense for other characters to have completely different appearances - particularly Nermal and Odie. It was odd to see Breckin Meyer and Jennifer Love-Hewitt play both Jon and Liz respectively. They obviously didn't really look into the characters all that much, as they are played as a romantic duo as opposed to the eccentric Jon being a foil for Liz's pessimistic nature. In spite of this, there is very little comedy between the two either. Much of the comedy is displayed through Garfield, which is generally hit or miss. I hated the whole \"Nudge, nudge. Wink, wink.\" attitude whenever it came up, but I admired the slapstick / visual humor as it works quite well for young audiences.I can't really recommend this film for anyone above the age of 7, but it is a remarkably average film for a family viewing. Do with it as you will."
    },
    {
      "rating": "4",
      "text": "As a massive fan of the garfield comic strip this movie disappoints it's sad to see that this movie is that bad."
    }
  ]
}