{"id": 4537, "title": "George of the Jungle", "starring": ["Brendan Fraser", "Leslie Mann"], "runtime": 93, "genre": ["Adventure", "Comedy", "Family", "Romance"], "description": "Deep in the African jungle, a baby named George, the sole survivor of a plane crash, is raised by gorillas. George grows up to be a buff and lovable klutz who has a rain forest full of animal friends: Tookie, his big-beaked toucan messenger; Ape, a witty talking gorilla; and Shep, a peanut-loving pooch of an elephant. But when poachers mess with George's pals, the King Of Swing swings into action.", "releaseYear": "1997", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/wqH88gO6MmdyUFtS4RNz9zCczL.jpg", "categories": {"plot": 7.0, "acting": 7.666666666666667, "ending": 7.0, "soundtrack": 7.0, "cinematography": 7.0, "familyFriendly": 7.0, "funny": 7.214285714285714, "action": 7.0}, "reviews": [{"rating": "10", "text": "Entertaining as well as excellent."}, {"rating": "8", "text": "One might be tempted to review it with bumpers; because it’s for kids, give it a break. But George of the Jungle is better than that. It’s a smart, witty family comedy, bursting with charm and good cheer. It may be silly, but it’s a real film, with real filmmaking qualities, and a real heart."}, {"rating": "10", "text": "Top quality film. Oscar worthy. Shunned by all award ceremonies. Brilliant performance from Brendan Fraser, great animatronic ape. Anyone who claims this film is poor, doesn't have taste."}, {"rating": "7", "text": "What can I say? An entertaining and fun movie. It is however a little too overlong, Thomas Haden Church is underused and some of the story leans towards the predictable side of things. However, it is very nice to look at, the scenery is colourful and the sets are splendid. Even the cinematography is very good. The music is fun and catchy, it is probably just me but after seeing this film I have had the main title song stuck in my head for days. The script is witty and quotable and the jokes are funny. And then the performances really do add to the sense of fun. Brendan Fraser gives a very likable lead performance, and Leslie Mann is appealing as Ursula. As the intellectual ape \"Ape\", John Cleese is fitfully amusing. But the star of the show is the sardonic and hilarious narration from Keith Scott. Overall, a fun and entertaining movie, not perfect, but I recommend it. 7/10 Bethany Cox"}, {"rating": "5", "text": "As one part of the lyrics on the entire song said, \"WATCH OUT FOR THAT TREE!\" Well, I wanted to use that line to say this: This George of the Jungle did not watch out for that tree."}, {"rating": "7", "text": "Typical 90s live action comedy very funny in parts very slow in others mild the rest."}, {"rating": "8", "text": "Brilliant performances from Brendan Fraser & Leslie Mann highlight this disney comedy, it is hilarious."}, {"rating": "9", "text": "This movie is so conscious of the fact that it's supposed to be a bad movie that, through hilarious fourth-wall references et al., it becomes a great movie. Charming, hilarious, and most importantly, fun!"}, {"rating": "10", "text": "This is absolutely my favorite movie. It's stayed in my heart since my childhood, for it is a perfect children's movie....for children. And me."}, {"rating": "7", "text": "This is a film that marked the generation that had 10 to 16 when it opened in theaters. Unquestionably fun from beginning to end, is one of the best family films that Disney did at the end of the century, out of the animation field. This is obviously a film partially spent in a jungle with a man, George, who is literally clumsy version of Tarzan. Made to play and laugh a lot, the film is full of funny moments and even the bad guy, Lyle Van de Groot (played by Thomas Haden Church) is the most humorous I've seen, even in films of this kind.The involvement of actors is very good, but the spotlight go to Brendan Fraser, who played the main character in an absolutely brilliantly. Leslie Mann gave life to the little girl, Ursula, whom George predictably falls. She also had an inspired interpretation, and even his shrill voice gave a hand in the creation of the character, which is a rich and spoiled girl. John Cleese, one of the greats of the current mood, excellent as was voiced Ape, a monkey gifted with a very human intelligence. Thomas Haden Church also did not disappoint the audience, eager to laugh."}, {"rating": "7", "text": "It's a goofy movie. That being said, there's some funny jokes that only as an adult you would understand. It's overall a cute movie. Brendan Frasier comes off sweet, sincere and just a good guy. Ursula is sweet and cute and an excellent supporting actress in this movie. The parents are funny, I love Ape's accent and his lines are hysterical. Is it a brilliant movie? No, but it's funny and it leaves you with a good feeling and some laughs :) it's nice to have movies that don't take themselves too seriously."}], "recommendations": ["role_models", "pitch_perfect", "some_like_it_hot", "meet_the_parents", "robots", "coming_to_america", "music_and_lyrics", "paddington", "freaky_friday", "50_first_dates", "ice_age", "pitch_perfect_2", "clueless", "the_royal_tenenbaums", "paddington_2", "forgetting_sarah_marshall", "the_addams_family", "johnny_english", "get_smart", "igor", "over_the_hedge", "ace_ventura_when_nature_calls", "delivery_man", "how_the_grinch_stole_christmas", "friends_with_benefits"]}