{"id": 1138, "title": "Get Out", "starring": ["Daniel Kaluuya", "Allison Williams"], "runtime": 104, "genre": ["Mystery", "Thriller", "Horror"], "description": "Chris and his girlfriend Rose go upstate to visit her parents for the weekend. At first, Chris reads the family's overly accommodating behavior as nervous attempts to deal with their daughter's interracial relationship, but as the weekend progresses, a series of increasingly disturbing discoveries lead him to a truth that he never could have imagined.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/mE24wUCfjK8AoBBjaMjho7Rczr7.jpg", "categories": {"plot": 5.0, "acting": 6.2, "ending": 5.1875, "soundtrack": 7.666666666666667, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.444444444444445, "action": 5.0}, "reviews": [{"rating": "10", "text": "When I first saw the previews for this movie, I thought 'I'm sure Jordan Peele is using the tone of overt racism to make a more interesting point.'  I was not disappointed.  He sets you up with a barrage of left jabs that started in how the trailers were cut and how the movie plays through most of it's length, and then he delivers a stunning right hook in the major twist of the film.  Great portrayals from everyone and a movie that will make you want to watch it again to find the hidden threads that you should've seen and foreshadow what's to come."}, {"rating": "2", "text": "I am so sick of all the shill reviews on this site and for this film. What the @#$% was that I just watched? The first 2/3 of the film was a Lifetime interracial romance and the final third was all M Night S'lan! Deceptively pitched as a horror film, it was a mostly boring mystery - not thriller - mystery. Jordan Peele (\"Key and Peele\"), who wrote/directed, got to live out his racial-retribution fantasy, good for him, but it's disgusting racism just the same. And no it's not satire, but anti-white racism, what is wrong with you people?! This should be shamed and pilloried not glorified. Again, what is WRONG with you?!"}, {"rating": "3", "text": "This was a long and boring movie. Every 'scary scene' was predictable. The midpoint didn't build anything up to the climax, the climax was just a few scenes with a lot of blood.The reason pleople rated this movie high is because they are afraid to be called racist if they don't..."}, {"rating": "0", "text": "What a **** film, everything was entirely predictable. Nobody I saw this with was as impressed as all the critics are saying﻿. How this film is unique enough to garner all this praise is beyond me. Apart from it's \"muh racism\" message it is completely forgettable."}, {"rating": "3", "text": "It's the new movie everyone is talking about and critics are raving about, as for me, I couldn't wait to get out...of the theater. Guess who's coming to dinner? It's a black man coming home to a rich suburban white families house for the weekend, and despite their black servants, they're extremely nice to their daughters new boyfriend, too nice, something weird is going on. Yes, something weird is going on, only Chris Washington (Daniel Kaluuya) is too stupid to realize it! He's so deeply in love with his girlfriend of all of four months, that not only can't he see what's going on right in front of his face, but he doesn't try to talk to her about it, he doesn't try to investigate any of it, he just sort of goes with the flow. People are raving about this noir thriller, when it is one of the most poorly written films I've seen in a while. Major plot holes aside for the moment, there is absolutely no character development, no chemistry between the actors, and worst of all they don't even reveal the main plot until twenty minutes before the thing is over! Yes, it's weird, yes, something is going on, but the writers don't even hint at what that is! They don't even give us a chance to figure out what it could possibly be. At first it was interesting and I was hoping there would be clues to help us figure out what might be going on, that maybe Chris would find evidence or over hear something, but no such luck. Maybe there could have been a scene without him, that gave us some insight, there was absolutely nothing until the very end, when it was all thrust into our faces and even then it really didn't make a whole lot of sense. Without giving anything away, they never answer the fundamental question, why black people? I never liked traditional noir, but at least most of the time the acting is good and you have some idea of what's going on. This film is just one big circle of confusion and to be honest with you, aside from some terrific comic relief, I hated every minute of it."}, {"rating": "2", "text": "I loved the trailer! that's why I went to see the movie. But heres the problem, the whole movie is just like the trailer. if you seen the trailer? then you seen the whole movie. theres was ONLY ONE small twist in the whole movie, everything else was predictable. I was looking for more depth in the story. Overall a very big disappointment."}, {"rating": "0", "text": "What an absolute piece of garbage this was. It was SLOW as can be and then turned into the most ridiculous storyline ever.  READ THE USER REVIEWS . The critics sold-us out on this one probably for fear of being called racist."}, {"rating": "0", "text": "Worst movie ever. Another attempt to blur racial lines. The black man is hero, white people are bad and the genetic and sexual stereotype myth is shamelessly brought out. Wanted to walk out in the first 15 minutes."}, {"rating": "10", "text": "\"Blum's house\" has been surprising us more and more, and \"Get Out\" is proof of this development. The film leaves us fascinated from beginning to end, and in a short time it can complete itself completely, without leaving any doubt. One of the best films of this genre, for sure. Amazing. 10/10"}, {"rating": "10", "text": "Excellent film. The racial implications being made are so profound. Very interesting film. Well done Jordan Peele!"}, {"rating": "10", "text": "Amazing movie. I haven't really been into horror films, but this changed that for me."}, {"rating": "10", "text": "Get Out-simply one of the great horror films of the 21st century. No other way to put it. A masterpiece all over, and can you believe this came from JORDAN PEELE from the Key and Peele show? The best thing about this film is that it doesn't focus on the scares much. Sure, the scares come and when they do they're great. In fact, it could be a brilliant thriller film if it wanted to. It's not one of those movies which have way too many scares, with no focus being put upon the storytelling. The pace of the movie is really fast, which is good as in some horror films you feel like they focus more upon the setup and just deliver jump scares at the end. The performances are really good. Daniel Kaluuya is brilliant in the film. Just watch that scene where he first goes into the Sunken Place, excellent acting. I think Allison Williams goes really under the radar as she also gives a good performance. The screenplay and score was outstanding building that feeling of dread and realization that he couldn't get out of the place but was just stuck here. The story is fabulous with so many inventive and creative things making twists all the time. The final act is great, right when you understand everything on one go in that TV conversation scene. There's no wonder that this film won Best Original Screenplay at the oscars"}, {"rating": "10", "text": "Amazing! Only a cry baby wouldn't it. There wasn't really scary moments as much as suspenseful!"}, {"rating": "10", "text": "I can't get this movie out of my head. FANTASTIC MUST-WATCH MOVIE! Everything about this movie has been amazing making me not want to look away for a second."}, {"rating": "9", "text": "Il film è fantastico con una regia di Peele, nuovo nel mondo del genere horror/thriller, fantastica veramente curata e senza sbavature. Il punto forte del film non è la trama abbastanza intuibile dopo le scene dell'asta bensì il ritmo e le colonna sonora che si fanno rispettivamente più intenso e cupa col trascorrere del film. Mai visto prima un horror che ponesse così tanta ansia e inquietudine allo spettatore. Film consigliatissimo, l'ideale sarebbe vederlo da soli magari dinotte"}, {"rating": "5", "text": "I'm a big horror/thriller fan so I intentionally avoided reading anything about \"Get Out\" prior to watching because I like to be totally surprised.From the very first scene of the movie it pile-drives the viewer with racial tensions so heavily, with no nuance, that for the first twenty minutes I was expecting a really clever twist later in the film.  I figured it was all misdirection for a huge plot twist.  However, after about 45 minutes I started realizing that maybe it wasn't trying to be clever and was simply playing it straight.  Although I held out hope for a major twist it became obvious that the \"twist\" was going to be that the girlfriend was part of the family cult, and I was very disappointed to be right.\"Get Out\" reveals itself to be, in the final analysis, just a middling thriller.  I was shocked to discover that it had received almost universal acclaim.  In my honest opinion, this film is only receiving high marks because of either blind racial solidarity or the fear of being labeled a racist by writing a less-than-glowing review.  It's a competent production - it looks great and has a cool soundtrack - but the actual plot is so flimsy that its attempts at satire are weak.  I can't imagine why anyone honestly thinks that this film is anything other than a mediocre popcorn-muncher that just so happens to include a hot-button political issue in its premise.Daniel Kaluuya gives a great performance as does LilRel Howery.  If it wasn't for them, this movie wouldn't even have been worth watching.  I was disappointed in Catherine Keener's performance; I've admired her past work but here she just phones it in.  The rest of the cast was so boring they're not even worth mentioning.My favorite part of the movie was when Walter, the groundskeeper, came running out of the darkness at Chris.  It was so strange and off-putting that it made the hair on my arms stand up!  That's the kind of stuff you hope for in a horror film but sadly those moments were in short supply.  The other parts that were supposed to be \"odd\" were just forced and cringe-worthy (for instance: Georgina's near-meltdown when her and Chris have their one-on-one conversation).\"Get Out\" is too hollow to be considered profound and too self-indulgent to be considered good entertainment.  However, I think that the director has the talent to someday make a film that lives up to his vision."}, {"rating": "9", "text": "There are no words to describe how amazing \"Get Out\" is. Perhaps the most incredible part of this movie is that Jordan Peele, not typically known for horror movies, has arguably made the best horror movie of the year. The outstanding performances from the cast and the best original screenplay of the year only add to this."}, {"rating": "10", "text": "This was one of the greatest movies I have ever seen hands down. Amazing, just pure perfect horror movie. I am a white guy and was rooting for blacks all the time. Just perfect movie. Man I wish I watched it earlier and in theatre and supported Jordan Peele"}, {"rating": "10", "text": "Most here providing negative or low scored reviews because they believe it’s racist against whites or feel it is or isn’t a comedy, are not versed on the history of America nor black culture beyond rap.  The horror is aimed more at black people because this is a deeply rooted fear. Whites have taken or tried to take everything...now they come for the only thing black people have left. Their bodies. It draws upon influences from history in RL, such as Emmett Till and the horrific and controversial nature of his death, and also the belief that physically Black people are superior. Also the mistrust of white people that has been bred into blacks, and the reverse, speaks to racial disharmony, even within this very thread. Also speaks to further ignorance people have of each other and situations. One person here didn’t understand the movie, so so they believed the success had to do with the lead actor being black, another believed there is a reverse racism.  Neither of those is true.  The very definition of racism makes it impossible for such a thing for reverse racism to exist. The word you’re looking for is prejudice. But not so here either.  This is simply a writer who was able to exploit a fear, of a community of people, who happen to not be white. The critical acclaim comes from the fact that these fears have never been on display so openly before.That is why very few if any black people found this movie funny, but did find it horrific, even though fictional.If you didn’t get the gist of the movie, I urge you to research Emmitt Till, George Stinney, Black WallStreet and History Channels Bio On Lynchings and then watch this again, imagining what it’s like to grow up with that knowledge in your head and what would make you afraid we’re you that person on screen.  Not you, sitting at home in you white skin. Would you watch this movie and think, that could never happen, laughing, or think oh god...what if they did try this...what if they did try?!If you are he’ll bent on believing white men and women are being subjugated and you don’t want to believe otherwise, then skip the research and go watch another movie.  You don’t want to get it, and no one is forcing you to."}, {"rating": "6", "text": "Get out is not bad, but neither is good.It doesn't know what it wants to be. Imo it shines when it tries to be a satirical comedy with horror tints, like one of those trash horror movies that try to convey a message.Too bad it happens rarely, most of the time it tries to be scary, without being it. It can't even be a thriller because the director spoiled the \"Truth\" in the first five minutes of the film, so you don't get the feeling of discovering the bad guys or something like that.If it was a black (pun intended) humor comedy with horror tints in a slasher way it would've been awesome (every scene with lil rel howery is great), but when they try to sell you this thriller-esque \"Who knows whats going on here and if there is something to fear\" it is just pointless because you already know."}, {"rating": "1", "text": "This movie is bizarre and horrifying, though not in the right way. Left us feeling very flat and disappointed"}, {"rating": "1", "text": "I went into this movie with high expectations and was thoroughly disappointed. This was the most overrated piece of junk I have ever scene. Hmmm let me guess a movie written by a black film maker where predictably the hero is black, the white people are all evil and everyone is supposed to completely ignore the onesidedness of any attempt at social commentary. But beyond that the movie just wasn't very funny, very interesting or very scary. The only reason critics are praising this is to not get called a racist and to avoid being swept away by the wave of \"Oscars so white.\" It would be refreshing AND TRULY SURPRISING for a black film maker to make a movie, any movie, where the central theme wasn't racism, now THAT would be noteworthy. I won't hold me breath. Until black film makers embrace the fact that they are more than just spokesman for the black race as a whole, that they can convey ideas beyond \"being black\" they will never produce anything that we won't see coming a mile away."}, {"rating": "6", "text": "It's not that the emperor has no clothes, but he may only be wearing a tshirt and shorts. Part of the problem was certainly due to the fact that I saw this on video after the hype and critical reaction had been built so high that it couldn't possibly have lived up to its 87 Metacritic score and 99% Rotten Tomatoes score. If you like your social satire to be \"hit-you-over-the head\" (repeatedly and literally) obvious, then this might be the movie for you. I guess knowing Jordan Peele's other work, I shouldn't have expected \"Guess Who's Coming to Dinner,\" but I did expect maybe an ounce or two of character development and nuance. This doesn't have that. All the tropes have been done before (did you know that white people play lacrosse and like to ask black people about the NBA?).That said, there are plenty of things to like about this movie. The acting is pretty solid (with the exception of Catherine Keener). Daniel Kaluuya is fantastic. Allison Williams, despite a pretty weak track record, holds up her role with aplomb. Milton \"LilRel\" Howery steals the show with his role as the comic relief/truth teller. Peele's direction does a fantastic job with capturing the creepiness inherent in the setup. It's worth a watch when it makes it to HBO or Netflix, but you may be upset if you shell out the $6 or $7 to see it on PPV."}, {"rating": "9", "text": "This is one of the best horror-thriller movies I've seen in a long time.The story is really good, they give you more and more reveals as the movie goes along, Jordan Peele has a lot to say about race but he says all this commentary without sounding pretentious or preachy, it's a movie you should know nothing about and watch it directly.The characters were fantastic, they were all interesting and entertaining to watch and that's because the acting was perfect, the main character wasn't stupid which is a problem I have with horror movies, here he was calm and logical.I really recommend it, the only con I have is that the ending goes a bit too far, I won't spoil anything, but it did become ridiculous to a certain point, I know it's an exageration to prove the movie's point but it was a bit distracting."}, {"rating": "9", "text": "Jordan Peele really was a great director in his first production, showing abilities that many others older in the branch have not been able to do with so mastery. The film in itself is a great criticism to the racism in the United States and the people that pemosam that not Are racist because they voted for obama or have a black friend. The first act is normal a little cliche but it is not tedious, in a short time the movie shows that something is wrong and since then the inquetación does not stop, the soundtrack helps a lot in that set She passes everything that a horror soundtrack has to have.the second act is very good it increases a lot the self theories that probably will not be certain the third act really closes in an integral way frightening and courageous together the film is great there are no execessos Daniel Kaluuya, the humor works even in this genre and the plot is Very well told and closes perfectly.note 93"}, {"rating": "3", "text": "Sad and pathetic rip-off of Skeleton Key. Poor acting, predictable plot, little suspense and practically zero scares. Critics clearly had too much tea praising this dud. I am looking at you Mark Kermode."}, {"rating": "1", "text": "GET OUT is an absolutely downright excellent horror film.  Brilliant pacing, & acting.BUT - reverse the races in GET OUT and we'd have a complete *outcry* against this movie being nominated for BEST PICTURE in 2018's Oscars.[ SPOILER ALERT ]The slow, methodical physical and sexual torture white people (including some Asians) vote in this film to perform on a black man because he decided to share a white family's home equally so - proving the dear love he had with a white woman was and will always be fake - coupled with the black man's final resolution of the only way out is a complete slaughter of the whites and then slow, determined strangulation of the white girl who dated him.... Excuse me?Switch the races --If that were a white man visiting a black family --- a Caucasian man visiting an African American family and dating that African American family's daughter --- and the black family did the torturing of the white man ....  resulting in black (instead of white) executions, capped beautifully off with a white man's slow strangulation of a young black woman to free himself from her and her black clan's clutches.  Okay - would that be offered as Oscar's BEST PICTURE OF THE YEAR ?An uproar at the very least would be thrown against this heralding of a white man killing African Americans to purportedly escape from the black man's clutches, and the slow strangulation of an African American woman justifiably and rightfully so it can never happen again;  that should not be a Best OSCAR Picture of the Year.Then -- why is this nominated for OSCAR Best Picture of the Year?Oh I guess since they're whites being killed off and strangled it's okay.Best horror film - fine. \"Best Picture of the Year\" .. wow.Though as noted an amazing horror film in pacing and acting, its twisted racial abuse and senseless killing storyline makes me give this a 1."}, {"rating": "3", "text": "This has to be the most ass-backwards anti-racism movie ever made. It's not a call for understanding, it's a paranoid revenge fantasy, and it made me sick to my stomach."}, {"rating": "3", "text": "Contrary to the many takes and reviews that this movie has received, this movie is neither enlightening, fresh or most importantly, entertaining as a whole. The most dissappointing aspect of the movie is that the director actually succeeds in capturing the proper mood of eeriness that hooks the interest of the audience when watching a movie of this category. Unfortunately, the movie crashes and burns when all the pieces start coming together - or rather does NOT come together. The symbolism comes hard and heavy, and many audiences will already know the racial undertones that the plot conveys.  It is actually solidly acted with all the actors going full bore into their respective characters, and the story creates the mood of off kilter discomfort very well when it comes to the interactions between the straight laced protagonist and the surrounding cast.However the movie devolves into a series of illogical missteps that completely undermines the intent of the movie. Nothing is more dissapointing than seeing a movie start off with great promise and anticipation for a satisfying conclusion, than to see it totally fall apart at the wheels no sooner than the start of the second act, and this is precisely when this movie loses its appeal completely.Serious, possibly thought provoking situations foreshadowed at the start of the movie break down into outright buffoonery more akin to a Wayans brothers Scary Movie plot. One particular development is a shark-jumping moment that makes the movie go from psychological thriller to full on science fiction. Many of these twists and the direction that the movie goes into seem to have been to make a symbolic or overt social commentary, something I understand is a point the film is attempting to create. However, the method is clumsy and ridiculously heavy handed. The most disappointing part is that the commentary is on point - but the sacrifice made to story, plot and logic is so insulting to the audience that the imagery is dulled to an afterthought. Many guides to the hidden meanings of this film exist, but as a movie watcher, should we really need to have a guide book to a story in order for it to make any semblance of sense?I am fairly harsh on this movie because it is one of those films where the initial plot is interesting enough to capture you, you invest your time to learn more, and the result is a slap in the face. You feel cheaply tricked by the time the end credits roll. Most importantly, the subject matter that this movie explores deserves quite a bit more than this schlock."}, {"rating": "0", "text": "It's a must see if your a racist. Zero for creativity and zero for being racist."}, {"rating": "6", "text": "I went in with high expectations which is probably why I ended up rating it low. The movie started out slow but picked up towards the end. The writing was good but I felt that Daniel Kaluuya mumbled in certain scenes. My recommendation is to go in with no expectation and you will enjoy it."}, {"rating": "6", "text": "Firstly this is a misclassified as a horror,it's a mystery and it begins very very well like M Night Shyamalan at his best.The 'Guess who's coming to dinner with foreboding vibe' is a novel touch The middle third was M Night at his not so best. A weird 'Stepford Wifish' party of upper class whites micro-aggressing like no tomorrow. The last third let the whole movie down. I could have written it better myself on the back of an envelope on my home on the subway. Pity, this had potential."}, {"rating": "1", "text": "The fact that the liberal media has pandered incessantly to this horrible B movie makes it insulting that it is still carrying a 99% rating on Rotten Tomatoes. Not only is this movie slow , predictable and poorly staged, it is filled with anti-white, racist cliches and messages. The idealist trust funded,  post grad crowd that is lauding this film, is the same audience that the movie is making a mockery of throughout. Can you pseudo intellectual idiots not see a slam in your face when you see it? And how can you not view the film as racist?"}, {"rating": "5", "text": "A lousy set up with a solid and clever last 30 minutes. The first hour is full of cringe-worthy dialogue with every white person acting as a caricature. It drags so much to get to the point, I thought I was going to leave. But when the plan is revealed and set into motion, it becomes an engrossing thriller. As a first time director, Jordan Peele does a pretty good job; but his screenwriting needs a bit of work."}, {"rating": "1", "text": "Pretty mediocre movie. In the beginning it was a little intriguing, and then the intrigue began to be gradually delayed until I got bored. But most of all I was disappointed by the ending. What kind of doctor is this - he already cut the patient's head and threw half of his skull into the rubbish bin, while the donor was still watching TV in the other room."}, {"rating": "4", "text": "This has to be one of the most overrated movies of all time.   It's got an identity crisis, it doesn't know if it wants to be a horror or a comedy or a racial commentary and it fails in all three.The horror isn't very scary, the comedy is sparse and the racial commentary amounts to 'man, white people say dumb **** over and over and over again.The major premise of the white people's motivation doesn't add up and as others have said it takes over an hour before it's revealed what the plot of the movie is.If, like me, you're not from the US, you're going to find this agonizing over the correct way to behave to black people really tiresome too.In it's favour, some of the acting is pretty good.  I recommend to avoid."}, {"rating": "5", "text": "A mediocre B horror flick with a dumb ending. Mediocre because lots of stuff thrown into the movie is just a diversion and has nothing whatsoever to do with the plot. It's there only to trick you and is left as a hanging thread never explained. And in the end the answer to what's really going on is just ridiculous and kind of cliche. I thought the director was M. Night Shyamalan, that's how bad it is. But it turns out the director is black, and that I suspect explains the positive reviews. It's celebration is about political correctness. And so people conjure grand statements about how the movie is a commentary on racism, when it's nothing more than a mildly entertaining, unoriginal, long drawn out substandard Twilight Zone episode. It makes no sophisticated point about anything, and it doesn't work well as a drama or story. But it will keep you occupied as you empty your bag of popcorn."}, {"rating": "9", "text": "This movie is not about white hate. I'm sure this is what black people actually feel like when meeting a white family for the first time. But this first time run at making a movie by Jordan Peele was a hit. The anxiety in the movie is so well acted that the whole audience was holding their breathes in the theater. If you're looking for a perfect thriller to keep you on edge, this is the movie for you."}, {"rating": "9", "text": "Superb movie that deals with prejudices towards both black and white people in a groundbraking way. The cumulative hallucinatory sequences gives thought to the grotesque way how society is still racial devided. A must see movie that shakes your foundation."}, {"rating": "9", "text": "Being central-right myself I am completely disgusted by these user reviews. What is this endless need to find racism in everything. The family most likely doesn't like black people although they never express it in words. Can someone now explain to me how this makes the movie racist towards all white people? Stop making everything about race and just enjoy this amazing thriller."}, {"rating": "9", "text": "Fantastic film. What a gripping and compelling plot. What a refreshing horror/thriller movie in February when we usually get crap.The movie was incredibly well acted and it kept you on edge the entire time. The movie was surprisingly very funny as well. Jordan Peele does a fantastic job on his first big film."}, {"rating": "10", "text": "One of the best horror movies/social satires ever made. Well acted, brilliantly written, gorgeously shot, this film is one of the best of the year, if not THE best."}, {"rating": "9", "text": "One of the best thriller/horror movies of the year, 'Get Out' does exactly what it sets out to do. It's creepy, and weird, and for the most part, during its first 45-50 minutes or so, you won't be understanding what the hell is even going on. When details start to untangle, a horrific, and disturbing concept is presented, and it's ought to make you feel very uncomfortable and on the edge of your seat, right until the ending that provides great closure. The (pseudo-)action sequences at the end are brutal and very well-made. The acting from the cast is on point. I loved this film a lot. It will deliver the creeps right down to the bottom of your spine."}, {"rating": "10", "text": "One of best ideas for horror genre. Unbeatable debut of director Peele; who achieves an brilliant story about hidden racism, supported by unexpected, ingenious turns from comedy to thriller, thriller to horror. Whitford and Keener remarks as the parents of evil."}, {"rating": "2", "text": "The movie was just not good, I am really tired of **** movies being over glorified by hacks and shills.. The whole m night shyamalan last 3rd of the movie sucked bad and illogical.Just avoid this mess and go watch the blob (1988), now that is a kickass horror flick."}, {"rating": "10", "text": "This movie it is original, different and special.. i love everything about this movie.. It is my favorite horror movie ever... In 20 years people will use this movie like exemple to diffrent great movies."}, {"rating": "10", "text": "Holy jeezums, Get Out is fantastic! I was expecting to like it and get a fun horror movie, but I wasn't expecting a horror movie on par with The Shining.Its themes on racism are good, but I find that the themes of morality and immortality even more fascinating. What the villain(s) do is undeniably ungodly, but is it even racist? I won't go into spoilers, but this movie raises a lot of interesting questions. Can something be racist and not racist at the same time? What the villain(s) do of course is horrible, but their reasoning, though still morally wrong, can be interpreted as both racist and not racist at the same time! You can argue that them going after black people specifically is racist, but another person can argue that it's in a weird way, admiring black people... just in the most evil way possible.Get Out messes with my head, and it is very very clever with how everything is set up and resolved."}, {"rating": "4", "text": "This movie's score is so inflated that I decided to create an account to counter it. Overall, this is a very mediocre, if not bad, movie.The movie has a great cast and is technically well made, but to enjoy either you have to get past a ridiculously dumb and incredibly predictable plot. It's listed as a horror movie but it never actually gets scary as the premise is just too far-fetched. For some reason it tries to do jump scares and even gore towards the end but never does it manage to be effective. Sure, the characters create a suspenseful atmosphere but it never manages to create any suspension of disbelief. I read other reviews that mention plot twists but I have no idea what they are talking about. Everything plays out in the most predictable manner.As far as the social commentary goes, the movie depicts a world in which every white person cannot avoid making racial remarks for one second. I guess it fits the ridiculous premise, but I found it hard to draw any parallels to reality because of how grotesque the narrative is.While it is watchable, it is very difficult to take seriously. Come on; there's even a scene in which a character summarizes the plot to outsiders and everybody just laughs at him because it is utterly ridiculous."}, {"rating": "0", "text": "So much for the thriller suspense and horror with a message. What a joke.It is a eugenic tale about black superiority (sport, sex) over white people."}, {"rating": "0", "text": "Worst horror movie I have ever seen.Teletubbies are way scarier than this boring movie"}], "recommendations": ["antebellum", "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_", "the_mist", "us", "midsommar", "the_purge_election_year", "signs", "v_for_vendetta", "the_lobster", "the_exorcism_of_emily_rose", "bird_box", "black_box", "ready_or_not", "brimstone", "dark_skies", "colossal", "enemy", "chernobyl_diaries", "the_shape_of_water", "devil", "hereditary", "splice", "a_perfect_getaway", "better_watch_out", "what_happened_to_monday"]}