{
  "id": 4076,
  "title": "Get Hard",
  "starring": [
    "Will Ferrell",
    "Kevin Hart"
  ],
  "runtime": 100,
  "genre": [
    "Comedy"
  ],
  "description": "When obscenely rich hedge-fund manager James is convicted of fraud and sentenced to a stretch in San Quentin, the judge gives him one month to get his affairs in order. Knowing that he won't survive more than a few minutes in prison on his own, James desperately turns to Darnell-- a black businessman who's never even had a parking ticket -- for help. As Darnell puts James through the wringer, both learn that they were wrong about many things, including each other.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rJPbS2cYOYhDCjT5NmW1Fm6gFl3.jpg",
  "categories": {
    "plot": 5.823529411764706,
    "acting": 5.846153846153846,
    "ending": 5.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.222222222222222,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The first 20 minutes of so of the movie are pretty mediocre but they set the stage for the hilarity that ensues in the next hour plus, where Will Ferrell and Kevin Hart are comedic geniuses. They play the same roles they typically do, with Hart being a pint-sized black man with a lot of bark and little bite and Ferrell being the big, lumbering air head who's innocence and ignorance somehow make him endearing and obnoxious at the same time. However, those roles blend together perfectly in this movie as the two have great on-screen chemistry. The supporting cast is also fantastic and this movie is, overall, a really good comedy that most people will likely enjoy."
    },
    {
      "rating": "7",
      "text": "Not the funniest movie I've ever seen in my life and my expectations were high, but Get Hard is still pretty funny and I suggest any fan of Will Ferrell or Kevin Hart see this movie. I think the racism was a little over hyped, sure there is some racist humour but its not as plentiful as the critics have been saying. Will Ferrell is really funny as he always is and Kevin Hart wasn't bad either, he had some pretty funny moments. One of the things that was disappointing about Get Hard was that they were putting too many jokes in that were just not funny and there were several but other than that I would enjoy seeing another movie with Ferrell and Hart together and it seems like the two have bonded over the shooting of the movie and I would not be shocked to see it."
    },
    {
      "rating": "7",
      "text": "Just got back from seeing this movie, and I am surprised to see that the critical reaction has been not-so-good. My friend and I both laughed out loud a number of times. Will Ferrell and Kevin Hart are both just naturally funny people, and if you like their type of humor, you will enjoy this movie."
    },
    {
      "rating": "4",
      "text": "Bafflingly unfunny considering some of the talent involved, \"Get Hard\" is a stereotype-ridden disappointment that misfires with most of its jokes and bungles the opportunity of chemistry between its leads."
    },
    {
      "rating": "5",
      "text": "\"Get Hard\" 10 Scale Rating: 5.5 (Decent) ...\r The Good: The premise is an amusing one and Ferrell and Hart make for a great odd couple. As their relationship turns from one where they are simply using each other to one of true friendship, it is believable and sincere. Hart's lines are hilarious and you can tell that he was allowed to ad lib often. Ferrell had his moments too and there were a few scenes that I couldn't help but laugh out loud at.  Craig T. Nelson and T.I. did excellent jobs in supporting roles. Not as funny as it should have been, but a decent comedy all the same.\r The Bad: I expected more hilarity from this duo and the film is inconsistent in that regard. Most of the amusing scenes were given to Farrell as opposed to Hart, which was disappointing. Hart is clearly on the top of his game and Ferrell has lost a step or two. Some aspects of the ending were too silly and went too far. Lastly, the film relied too much on racist and homophobic humor. I don't personally  mind such jokes if done well, but they felt forced and dated here."
    },
    {
      "rating": "3",
      "text": "Get Hard tries to be a over the top, racist, profane and vulgar comedy. But the laughs are overused, and add no spice to the aging theme. The story plays out with James King (Will Ferrell) who gets convicted of a felony he never committed, and he gets sentenced to 5 years in a maximum security prison in San Quentin. James uses the help of his car washer, Darnell Lewis (Kevin Hart) to teach him the basics of prison, and how he can survive in the godforsaken place. But, Darnell never went to prison! Get Hard uses James to use his racist stereotypes against Lewis to make it funny. Sure, Kevin Hart does his best, and gives us some belly laughs, but Will Ferrell's racist, rich and totally bonkers, James King is one of the worst things about Get Hard. The pair do well together, even against the badly written script, the mediocre direction and the bland story, to create a funny movie. I appreciate the ways Get Hard takes you under the \"hood\" of prisons, and tells you about rape, and assaults in prison from a funny perspective. And, T.I gives a good performance as a Crenshaw Kings boss. All this, could have summed up to a really funny movie, but Get Hard doesn't try enough to get that medal. It's badly written, racist, offensive and gives us the worst Will Ferrell performance in years. But, if you don't get offended easily, Get Hard may be fun for you."
    },
    {
      "rating": "5",
      "text": "Hart and Ferrell could read sections out of the phone book, and we'd still laugh.  So no, the material isn't as good as you'd expect given both of their previous work, but there are plenty of laughs to sustain you."
    },
    {
      "rating": "1",
      "text": "Feels like they just made it up as they went along.  Sometimes that works...well, not really, and it doesn't work here either.  More proof that Kevin Hart USED to be funny."
    },
    {
      "rating": "1",
      "text": "An abysmal failure of a film on nearly every level. Scattered minor funny jokes are what saves it from me a zero. The movie left me with a headache and a sickness of what comedies have become today. Absolutely  horrible."
    },
    {
      "rating": "4",
      "text": "Albeit there are some funny parts, such as Will Ferrell's character explaining economics to gangsters, this movie is just one tired out middle school prison rape joke with racial stereotypes."
    },
    {
      "rating": "10",
      "text": "I cannot remember the last time I laughed so hard watching a movie in theatres! And that is countless years at least. I thoroughly enjoyed every part of it."
    },
    {
      "rating": "7",
      "text": "I hate when people complain about offensive humour (talking to all the feminazis, SJW's, neckbeard MRA's and culture vultures) because it is mindlessly immature and funny in situation like this. To start, this movie had a decent premise, kevin hart has to teach wil ferrell to survive in jail. Awesome idea for a comedy. Does this movie fulfil it's potential? Kinda. On one hand, the chemistry between the two actors is great, I love how will ferrel has to fit in with the ghetto and I loved the amount of slapstick comedy this had to offer. However, there were some points in the movie where I thought it would be easier to just move the conversation along as nothing particularly funny was happening. Overall, Get Hard will make you laugh for the majority of your experience and is filled with offensive humour and stereotypes."
    },
    {
      "rating": "3",
      "text": "Just like in my Unfinished Business review as I explained why I watched it and all that stuff...well for this one I checked it out myself just because I had a little interest for this movie and wow talking about a miss fire this movie was. This is going to be a short review for this garage movie, why well I haven't got anything else to say about it because why should I go into such much detail for this movie that I will not remember it in a few days time.\r The story is about a millionaire faces a prison sentence following a fraud conviction and in order to survive life behind bars, turns to Darnell Lewis to toughen up.\r Listen March has been a slow month for me because there are some of the new releases that I haven't checked out yet and yes I pretty much review movies everyday and I do have my breaks time again, but screw it life is short so start reviewing. The title \"Get Hard\" sounds like a porn video you will come across on PornHub.com, why can't they just called the movie Get tough or something like that, because people are going to take the title not very well and it would be really awkward to shout it out it in public. Anywhere with the other disappointments so far in March that I had interest that turned out to be a big massive f**k you to the auditions and me, and Get Hard can join those titles because this movie sucks.\r The jokes in the movie came off sexist and kind of racist and you should know by now that I can't stand those jokes because I can picture in my head that all these people out there are getting hurt by this and stupid humor is unacceptable.\r Kevin Hart and Will Ferrell are fine in the movie but I rather like to see them in better movies than this. But overall as I said early on this movie isn't going to be talked about probably never again by some people, but for me your going to this again...in my worst of the year list right next to Unfinished Business."
    },
    {
      "rating": "9",
      "text": "Comedy finds a winning duo in Hart and Ferrell. The two are able to bounce jokes off of another with ease thanks to their surprising chemistry. Ferrell does what he does best here, and that's playing an over-the-top and absurd character. Hart's character is more down to earth and tasked with preparing this airhead for prison despite not actually going there himself.\r Along the way plenty of laughs ensue. There are plenty of hilarious one-liners and larger set pieces. It's also gives a very amusing look at gang and prison lifestyles. The vulgar and often raunchy style of the humor means that this isn't going to be for everyone, and a lot of the racial humor is bound to offend many, but those without a stick up their butt who don't think everything needs to be prim and proper are sure to find plenty of laughs. Sometimes it's just fun to laugh at the profane, and \"Get Hard\" gives us plenty of reasons to do that.\r It's probably one of the first comedies I've seen with Kevin Hart that doesn't hold the talented comedian back. He's allowed to be his quick-witted, profanity-spewing self when it comes to the jokes and the whole thing is much funnier as a result. The film also makes great use of Ferrell's talent for playing out there characters. The results are hilarious as the two comedians work together excellently. It's a very funny comedy that I recommend as long as you can put up with some offensive humor. Provided you can do that there is a lot to laugh at here. Get Hard takes a potentially disastrous duo and brings them together perfectly.\r I give this movie a 9.3/10."
    },
    {
      "rating": "7",
      "text": "An old concept with a new pair.\r First of all I don't wanna compare it with any movie like the others did. Many reviews bashing that it was rip-off of 'Big Stan'. Yes kind of similar theme, but there's a lot of difference. The concept was the same and the story happens in an alternate way like 'what if'. That means one takes place outside the prison and the other one in the prison. If you're a movie fanatic, you would enjoy the show other than going after flaws and resemblance.\r I had seen many weird combos, and I felt same feeling for this Will Ferrell and Kevin Hart, when I first heard about it. Like usual, once I watched the movie seem to be okay. Quite a show and equally good, one of the funniest combinations to entertain. I had a few good laughs and enjoyed the film. I would love to get a sequel for this, because these men coming together are double fun. So it should not be wasted ending with a one-off movie, but at least a duology or maybe a trilogy. Gosh, my crazy thought and expectation!\r 6.5/10"
    },
    {
      "rating": "10",
      "text": "loved this movie, I love the characters, will was funny in this movie but the only problem would be the racial stereotype jokes plus kevin hart wasn't annoying in this one so that's a plus."
    },
    {
      "rating": "1",
      "text": "I get it. Kevin Hart is laughing all the way to the bank. But I wanna laugh, too.  When I shell out 14 bucks.\rGet Hard is hard to swallow.  (pre-teen titter)  No, Get Hard limps across the screen.. (pre-teen titter) Somebody had to find this sketch in the garbage pail of the writer’s room at SNL. But the hits keep coming.  Let’s pair Hart with a lame white dude. Josh Gad. Will Ferrell. Who’s next?  Justin Bieber.  No, wait no he did that this week on Comedy Central. And that was funny!"
    },
    {
      "rating": "9",
      "text": "So, apparently, a guy tries to learn how to survive in prison. Honestly, it's not that bad. Well, sure, there were some racism, rape, etc. but, it has some funny moments. Especially that police riot training scene. It made me laugh to the floor. If you are into Kevin Hart and Will Ferrell, you should see it. If not, well, you should at least see it anyway. My suggestion, go check out the movie."
    },
    {
      "rating": "10",
      "text": "Hilarious Comedy, I have no idea how this is is getting negative reception... Will Ferrell and Kevin Hart manage to be a comedy duo that is just flatout hysterical"
    },
    {
      "rating": "9",
      "text": "Ok so I knew from the Preivews that it wasn't  going to be a smart comedy that u don't have to really think to enjoy and that's just what I did I really am missing something here I guess I thought it was fine I laughed alot enjoyed the plot and story of friendship I say go see for yourself trust me u will have a blast"
    },
    {
      "rating": "5",
      "text": "Get Hard is moderately funny, but it's uneven humor can't transcend the racism, cliches, and sheer stupidity. The film is full of flat underdeveloped characters, that you never feel for, and the plot which had some potential falls flat, partially due to sporadic pacing. That being said if you shut your brain off the film has it's moments, and Ferrel and Hart have great chemistry."
    },
    {
      "rating": "4",
      "text": "When a pompous investment banker (Will Farrell) is convicted of a crime, he hires the only black man he knows (Kevin Hart) to prepare him for prison. The premise is promising, but the movie relies on lame predictable subjects (gay panic, racial stereotypes, obvious villains) instead of genuine comic writing. Hart's motor mouth provides most of laffs, while Farrell's broad, buffoon style is often annoying. There are memorable out comic moments and almost nobody in the supporting cast adds any humor (T.J. Jagodowski's friendly gay is an exception). The dialogue feels like writer/director Elan Cohen let the 2 leads improvise most of the bits and didn't exercise any control on their effusive styles. Their chemistry's not bad and there are some funny parts, but more often it just tries too hard."
    },
    {
      "rating": "4",
      "text": "The story of a rich businessman employing a black valet to help him prepare for a prison term seems like a rich vein for comedy, unfortunately here it is seen as a vehicle for misogynistic and homophobic low brow laughs that fall very flat. There are a couple of good laughs but they are mostly buried under an avalanche of insulting stereotypes and unfunny improvisation. As with most of Ferrell's recent films the director seems reluctant to call cut, allowing scenes already unfunny to drag on interminably. Ferrell is due a return to form at some point, but this isn't it."
    },
    {
      "rating": "2",
      "text": "Another disappointing comedy.  Kevin Hart and Will Ferrell have potential to make a classic instead they made a film obsessed with racial stereo types and prison rape.  D"
    },
    {
      "rating": "2",
      "text": "Right at the start it is offensive and not really funny just shocking.  Did they make this movie so we would become disgusted with anything Gay or hate anything to do with white men."
    },
    {
      "rating": "0",
      "text": "This film is set up against a despicable backdrop of\rSexiest\rRacist\rMisogynistic\rImplications, that make it impossible for a considered human being\rwho may not enjoy holding black people up as strippers, thugs and slaves\rand white people up as rich self interested ignorant ass bankers.\rI keep forgetting its 1950....why watch carp people. This movie is\rpure Mc Donald's."
    },
    {
      "rating": "4",
      "text": "Below average. The film relies heavily on stereotypes, racism and homophobia to get it's laughs. The film has a \"countdown\" premise, where the main character James King (Ferrell) has just a month to get prepared for jail by his mentor Darnell (Kevin Hart) for a crime that he didn't commit. I feel like Ferrell has a lot more comedic lines than Hart and that Hart was there mainly so that Ferrell could make the jokes. The best way I can put it is:\r If you like shows like Family Guy, you'll probably like this."
    },
    {
      "rating": "2",
      "text": "I wonder if Kevin Hart and Will Ferrell wake up in the morning and say \"I'm sure glad I made that puerile piece of **** \"Get Hard\" and managed to offend everyone who watched it\"."
    },
    {
      "rating": "4",
      "text": "The movie lacks originality.  The movie overuses vulgar and racist comedy .  The movie had some funny parts but for the most part I was bored and could not wait for the movie to end."
    },
    {
      "rating": "3",
      "text": "Get Hard is supposed to be a comedy, but during the entire movie I laughed about three times. The movie ain´t interesting, and while it brings a creative story it fails on reproducing it. The acting by the main characters, Will Ferrell and Kevin Hart, isn´t bad at all and they do try to makes us laugh but they fail completely.\rThe storyline is completely predictable, you can see the end from miles away.\rOverall it´s not worth it, don´t see this movie unless you see it for free and have nothing better to do, it´s a complete fail."
    },
    {
      "rating": "2",
      "text": "Why would I want to 'Get Hard' when this movie should 'Get Hard' to try any new ideas for at least once? Come up with at least new ideas when making this movie."
    },
    {
      "rating": "2",
      "text": "It's just racial and offensive jokes, nothing more than that. It's just a waste of time."
    },
    {
      "rating": "6",
      "text": "Okay, I should start off by saying I love Will Ferrell movies, so am biased.  Also, I work at a prison so know exactly what they are talking about in the scenes.  So, if you DON'T love Will and don't know much about prison life, you may not like this, but I really enjoyed it.  It's not a GREAT movie like Blades of Glory was, but it's GOOD and enjoyable, and the cast is great.  Lots of stereotypes are made fun of, and as usual Will is fun to watch."
    },
    {
      "rating": "6",
      "text": "Having being sentenced to ten years in a maximum security prison hedge fund manager James King (Ferrell), realising that he isn’t cut out for life behind bars, seeks the aid of Darnell (Hart) who he thinks can get him ready for prison life. Anyone that has ever seen a Will Ferrell comedy will pretty much know what to expect here. The lead duo do have good on screen chemistry, which does help sell a fairly mediocre script and provide some laughs, but this is a far cry from Ferrell’s best work in films such as Anchorman and Elf."
    },
    {
      "rating": "8",
      "text": "there are some spoilers in this review but most of them are from the beginning of the movie.how understanding kevin hart is in this movie makes not down to earth james king (hedgefund manager arrested for a crime he didnt commit) funny. when he first meets kevin hart will ferrell becomes scared because he isnt comfortable around black people and he tries to play it off. however the chemistry between the two actors makes the scene seem more like a misunderstanding then it otherwise would have. will ferrell is basically playing the same character hes played in a thousand movies. he seems like a much zanier not down to earth version of his character from stranger than fiction. kevin hart really makes this movie but will ferrell interactions with the crenshaw kings are actually pretty amusing."
    },
    {
      "rating": "6",
      "text": "As average as most of Will Ferrells movies unfortunately, I'm sure he can do better than that. Summing up: an average comedy movie making fun of stereotypes about black people and prison life. I guess you can watch this if you have nothing better to do, but otherwise it's not worth it."
    },
    {
      "rating": "7",
      "text": "I appreciate what Etan Cohen's Get Hard has to do and has to offer, I loved Get Hard! It's not the best R-rated comedy but I loved that it's roars it's R rating, and is laugh out loud funny at times, and the chemistry that Will Ferrell and Kevin Hart is easy going. James King (Will Ferrell) is a rich and is a financial analyst  he has a huge mansion in Bel Air, lives with a soon to be married beautiful fiancé Allissa (Allison Brie) and is promoted by Allissa's father Martin (Craig T. Nelson). Kevin Hart plays Darnell he is a hardworking car wash operator, lives in Crenshaw with his supporting wife Rita (Edwina Findley Dickerson) also smart daughter Makalya (Ariana Neal). Darnell wants to get Makayla and Rita out of the neighborhood and school hoping his daughter will go to another school. James is convicted and fraud sentenced to 10 years in San Quetitin. So he wants Darnell, the guy who washes his car, to help him survive in prison Darnell didn't go to prison, James just thinks he did because of his skin color. James is flat out racist, I honestly didn't care if he goes to prison or not that's how unlikeable he is. The cheap script by Etan Cohen (Tropic Thunder), Ian Roberts (Martin & Orloff) and Jay Martal gives us a few laughs here and there but honestly they know better than this mediocrity so does Ferrell and Hart but they make this mediocrity funny at times. The talented Allison Brie and Craig T. Nelson are miss cast they put nothing good here to the table playing charactures. 3.0/4 stars"
    },
    {
      "rating": "6",
      "text": "\"Get Hard\" Is the newest comedy from Will Ferrell and Kevin Heart, It's a buddy comedy based around Kevin Heart teaching Will Ferrell's character how he will survive in prison as a old white guy.The humor is this movie if very offensive and vulgar but is what you come to expect from this type of comedy. Some jokes are extremely funny and the addition of great improve between Kevin and Will really adds to the jokes, but some jokes fall horribly flat. Most other actors in the film don't leave much of an impression on you, most of them only appear at the beginning or end of the film. Will and Kevin work great together in this film and if your a fan of buddy comedy's I'm sure you will enjoy this but \"Get Hard\" Isn't anything special."
    },
    {
      "rating": "7",
      "text": "Okay... This is way too underrated. I know it is not perfect and funny as ride along but seriously... The cast is strong, both actors were great, and the plot was just you average comedy plot."
    },
    {
      "rating": "6",
      "text": "If you expect some really witty comedy then this is not for you. But just some funny comedy to pass the time and have some laughs I think this is ok"
    },
    {
      "rating": "7",
      "text": "It has it moments. There's a few quotes from this movie that has me laughing pretty hard. It was worth the rental for sure. It's not amazing, but some of the lines are just hilarious. Not everyone's best work, but a solid showing regardless. I wasn't looking for perfection in story telling, I just wanted to laugh, and this flick did it for me."
    },
    {
      "rating": "4",
      "text": "Get Hard strives to be completely funny and exciting, but fails to do so. There may be some laughs present, but besides that, Get Hard is not anything worth remembering."
    },
    {
      "rating": "9",
      "text": "A funny movie with a funny title. Not for kids by the way. I wouldn't recommend this title, but I think it is funny enough to give it a 9/10. Thank you"
    },
    {
      "rating": "6",
      "text": "I thought it was pretty funny. I enjoy a good Will Farrell movie even though they can go one way or the other.. Happy to say with Kevin Hart this was a good match and I laughed quite a bit."
    },
    {
      "rating": "10",
      "text": "hILARIOUS FILM. NOT THAT BAD. WATCH IT FOR A GREAT LAUGH. NOT FOR KIDS THOUGH. this is rated r. see the other guys with kids. this is an adult film but its a good one."
    },
    {
      "rating": "6",
      "text": "Pretty funny movie. Two of the most funniest people around. The movie was just your average type comedy movie but worth to see it at least once."
    }
  ]
}