{
  "id": 3593,
  "title": "Get Smart",
  "starring": [
    "Steve Carell",
    "Anne Hathaway"
  ],
  "runtime": 110,
  "genre": [
    "Action",
    "Comedy",
    "Thriller"
  ],
  "description": "When the identities of secret agents from Control are compromised, the Chief promotes hapless but eager analyst Maxwell Smart and teams him with stylish, capable Agent 99, the only spy whose cover remains intact. Can they work together to thwart the evil plans of KAOS and its crafty operative?",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/c1x9EYmTTe9xTM8DclELORwC1PN.jpg",
  "categories": {
    "plot": 8.555555555555555,
    "acting": 8.75,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.454545454545454,
    "action": 7.333333333333333
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I was almost rolling on the movie theater floor I was laughing so hard. This movie is hilarious. Steve Carell is amazing, Alan Arkin is great, Anne Hathaway blew me away and Dwayne Johnson pulled of a great comedic role. I can't wait to buy the DVD!"
    },
    {
      "rating": "8",
      "text": "I enjoyed this very much. Prior to viewing I was concerned Steve Carell might play the character too slap stick. But was greatly impressed by the way he used more of his\"Micheal\" character from \"The Office\". The links in the movie to the old TV series was a great plus too."
    },
    {
      "rating": "8",
      "text": "Steve Carrell was very good as Maxwell Smart-- he reinvented the character and has an excellent deadpan delivery. It was also awesome to see Alan Arkin in this as well. It has a fairly predictable and standard plot, but I laughed a lot, and that's what I was looking for."
    },
    {
      "rating": "1",
      "text": "Absolutely horrible. If your IQ is under 75, you may enjoy this movie. Otherwise, please do not watch this."
    },
    {
      "rating": "4",
      "text": "The set up is perfect, but for being an almost two hour film, the laughs are pretty sparse, and Steve Carell seems to be sleepwalking through his role."
    },
    {
      "rating": "5",
      "text": "I was in need of a laugh so I decided to watch Get Smart and to be honest I didn"
    },
    {
      "rating": "4",
      "text": "Get Smart stays stupid.\rThe entire movie feels like a bad joke. Carrell isn't funny, Hathaway does nothing, and Dwayne Johnson is well, Dwayne Johnson. The action is pathetic and the \"spy\" aspect does nothing for the movie and its terrible script."
    },
    {
      "rating": "5",
      "text": "The comedy is too light for me? Or heavy? I don't know. I fell asleep too much and I didn't regret it. This movie also reminded me of Johnny English or The Tuxedo. I mean, the concept. Two agents, man and woman, have to become a partner. However, I like the part when Agent 99 had to pass the laser trap and she did it exactly like in striptease moves. But when Max tried to copy her, a very big mouse suddenly came out of his tux. Haha, got me lol."
    },
    {
      "rating": "4",
      "text": "\"Get Smart\" is a terrible spy copy-cat movie. It does nothing right with its crude jokes, dumb action, a not-funny steve carell, stone-cold Hathaway, and homosexuality (Dwayne Johnson)?"
    },
    {
      "rating": "10",
      "text": "The action was better than I expected. As far as the humor goes, all the scenarios that Max gets himself into are, for the most part, hilarious. Side characters supply great one-liners,too."
    },
    {
      "rating": "3",
      "text": "Great actors, wasted on an aimless script and flimsy plot. What's more, the entire thing lacks any of the charm, wit, and unbridled silliness of the original TV show. In fact, the humor is downright dark. I would've settled for a half-baked throwback than this overcooked clinker."
    },
    {
      "rating": "4",
      "text": "Wow, people are so easily entertained these days! Can't believe all the 9 and 10 votes for this pretty boring movie. There were a few funny scenes, like Bill Murray as the guy in the tree, but overall . . . zzzzzzzzzz. Very predictable and just not that funny. Not as bad as Zohan, and definitely not as bad as Wild Hogs, but still pretty disappointing."
    },
    {
      "rating": "3",
      "text": "The new Maxwell Smart should have taken a clue from old Max. Steve Carell's comic talent doesn't fit. The pieces from the classic 1960 TV show are there. Not much more. This spoof action comedy is exaggerated, foolish and poorly adapted from the original. There are very few laughs. Anne Hathaway playing a sexy athletic leggy Agent 99 is about the only boost. Alan Arkin is wasted. And could have done without the Rock. Carell is too charming and lacks the right convincing sound."
    },
    {
      "rating": "3",
      "text": "WHAT A WASTE! My G-d! Steve carrell is still the man but the script, direction and tone were an unbelievable disappointment."
    },
    {
      "rating": "3",
      "text": "Utterly dull and completely humor free. Just a terrible shame the script was so off key and the direction was lame. Save your money."
    },
    {
      "rating": "2",
      "text": "This movie is HORRIBLE. 90% of all the good parts are in the commercials and trailers. They even showed clips for Get Smart in the First Look before the movie even came on. Outside of what you see in the trailer, just isn't funny. This movie is a stone cold MESS"
    },
    {
      "rating": "1",
      "text": "One of the worst movies i have ever since. didn't laugh once."
    },
    {
      "rating": "8",
      "text": "It has been a few years since I have seen a comedy movie that had me laughing as often and as hard as Get Smart. The cast of Get Smart prove to be a huge asset in this James Bond type secret agent comedy. If you enjoyed Dumb and Dumber and other easy going comedies from the 80's and 90's, this movie will knock your socks off."
    },
    {
      "rating": "9",
      "text": "I am a fan of the original. I feel this remake did it justice. Great writing, acting, humor, special effects/stunts. It made me laugh out loud on multiple occassions. My two teenage kids really appreciated it too."
    },
    {
      "rating": "2",
      "text": "Basically, this film pisses on the memory of the original, infinitely superior television show."
    },
    {
      "rating": "8",
      "text": "\"Get Smart\" did a wonderful job of both staying true to the original series, and bringing it into the 21st century. The direction was well done and Steve Carrel was a great Maxwell Smart."
    },
    {
      "rating": "10",
      "text": "It was impossible to stop laughing while watching it. Steve Carrell played his part very well, as well as Anne Hathaway (who looked exceptionally beautiful) and the humor was both for adults and children. That might've been the best movie I've ever seen."
    },
    {
      "rating": "8",
      "text": "Get Smart blends plenty of spontaneously funny moments and clever, witty jokes with solid performances from Steve Carell and Anne Hathaway to make easily one of the more hilarious comedies I've ever seen."
    },
    {
      "rating": "9",
      "text": "This movie had everything, action, mystery, and nonstop comedy. All the actors worked well together and were great spies! Steve and Anne worked well together as well as th rest of the cast. Highly recommended!"
    },
    {
      "rating": "5",
      "text": "A few good laughs and a few good smiles. Honestly, that's all I was looking for. Get Smart is not meant to be a quality piece of filmmaking--rather a light, mild-actioned flick starring two likable actors, Steve Carell and Anne Hathaway."
    },
    {
      "rating": "5",
      "text": "Normal."
    },
    {
      "rating": "8",
      "text": "Get Smart is great fun, made so by an awesome cast. Carrell and Arkin are just being themselves here, but they fit in so perfectly."
    },
    {
      "rating": "9",
      "text": "A silly movie with nice visuals and an atmosphere that is harmless. It is extremely fun to watch, and all the characters are just like he TV show in the 60's. Steve Carrel is perfect for the role, and many scenes are hilarious as he uses some classic Maxwell Smart catchphrases."
    },
    {
      "rating": "6",
      "text": "Steve Carell and Anne Hathaway's charm make \"Get Smart\" worth viewing, but the movie eventually collapses through predictable gags and uninspiring action."
    },
    {
      "rating": "10",
      "text": "Get Smart was an absolutely fantastic movie! It is filled with action, a TON of comedy, and suspense that will leave you breathless. The visual and special effects on this movie is a definite crowd pleaser. The actors were superbly phenomenal and were well-suited for their parts. Great movie, great actors, great effects, great storyboard, and a great pleasure to watch!"
    },
    {
      "rating": "8",
      "text": "A funny movie that revolves around Carrell and his antics. The story is not great nor does it make perfect sense, but it keeps the movie moving and Carrell keeps the jokes coming."
    },
    {
      "rating": "9",
      "text": "Steve Carell is at his best. He is incredible as Maxwell Smart. The story line is solid and helps introduce this great spy comedy to a new generation.\r Watch it online for free: https://www.primewire.ag/watch-309-Get-Smart-online-free"
    },
    {
      "rating": "9",
      "text": "Excellent work! Very, very funny."
    },
    {
      "rating": "9",
      "text": "The critics don't know what they are talking about. I took a chance and skipped out on Love Guru which was more hyped to go see Get Smart and i definitely made the right decision. Keeps you laughing for 90% of the movie, which is a hard thing to do with a movie as long as this (2 hours). Steve Carell was funny as hell and Get Smart is definitely a must see for this summer."
    },
    {
      "rating": "9",
      "text": "Great movie, very funny, perhaps a bit cheesy in some parts, but overall, a very enjoyable movie."
    },
    {
      "rating": "10",
      "text": "This is like the best movie ever compared to THE LOVE GURU which is like the worst movie ever."
    },
    {
      "rating": "8",
      "text": "Really cool film. Funny and actually good quality action flick too. Critics maybe taking life too seriously? Life is too serious a thing to not be made fun of!"
    },
    {
      "rating": "9",
      "text": "One of the funniest movies Ive seen lately. Along the lines of Dumb and Dumber type humor, it pulls comedy off of a dying style, and makes it work wonderfully."
    },
    {
      "rating": "5",
      "text": "At the end of this film I had the feeling that the makers wanted to leave the door open for perhaps a sequal or two. Sorry , but it just didn't work. It never felt right. Maybe you just can't go back? It wasn't Carells fault ,but this film never seemed to feel like anything more than a made for tv movie made to play durings a ratings week. Maybe with lots more TV hype and a 1 day only showing like that it would have seemed better? Or , maybe it isn't 1965 anymore and the whole spy spoof has gotten old.(remember the dreadful last Austin Powers?)."
    },
    {
      "rating": "9",
      "text": "This is a very excellent movie. At the beginning, you start to think this is not going to be good, but it really is a terrific hilarious movie. This is a movie that you like better after seeing it the first time, as well. I recommend everyone see the movie. It has a great cast with great characters, Max, (Agent 86) 99, the Chief, Agent 23, Laraby, and many other characters. I would also recommend people to see the original TV show of Get Smart. It's hilarious. See this movie, and see it a second time, it is much better after seeing two times!"
    },
    {
      "rating": "10",
      "text": "One of the funniest movies I have ever seen, and you can hardly go half a minute without laughing, as Steve Carell does an excellent job in his role. It is ridiculous and ridiculously funny, it is a must see."
    },
    {
      "rating": "9",
      "text": "Loved it. Great casting, hilariously funny, wonderful action scenes combined with a lovely nod to the t.v. show."
    },
    {
      "rating": "8",
      "text": "I laughed out loud more than once. Steve Carrel's charm shown through the average script."
    },
    {
      "rating": "10",
      "text": "This movie will be a classic. Like Star Trek's replacement ST-TNG it is hard to fill the predecessor's shoes. This one did a nice job."
    },
    {
      "rating": "9",
      "text": "Very funny. True to Steve Carell's comedic history; perhaps funnier than the original."
    },
    {
      "rating": "10",
      "text": "Get Smart is a hilarious movie, but not only is it funny the action scenes are top notch. The story isn't extremely deep but is cleverly crafted. you have too see this movie it is the best movie I've seen all summer."
    },
    {
      "rating": "10",
      "text": "Get Smart Gets a 10 because it Gets me laughing, even after its over. And for those of u who don't Get this movie, Get funny, or Get bent."
    },
    {
      "rating": "8",
      "text": "Better than expected!"
    },
    {
      "rating": "7",
      "text": "A few laughs and a descent plot come together to form an above average summer comedy."
    },
    {
      "rating": "7",
      "text": "Predictable and sometimes deadpan it may be, but Get Smart proves to be a lot more entertaining than you might expect."
    }
  ],
  "recommendations": [
    "horrible_bosses",
    "role_models",
    "the_longest_yard",
    "the_wedding_ringer",
    "meet_the_parents",
    "forgetting_sarah_marshall",
    "ride_along",
    "horrible_bosses_2",
    "ace_ventura_when_nature_calls",
    "masterminds",
    "tower_heist",
    "johnny_english",
    "spy",
    "zack_and_miri_make_a_porno",
    "the_pink_panther",
    "stuber",
    "date_night",
    "the_other_guys",
    "30_minutes_or_less",
    "central_intelligence",
    "hot_fuzz",
    "ride_along_2",
    "dodgeball_a_true_underdog_story",
    "the_watch",
    "50_first_dates"
  ]
}