{
  "id": 1098,
  "title": "Ghostbusters II",
  "starring": [
    "Bill Murray",
    "Dan Aykroyd"
  ],
  "runtime": 108,
  "genre": [
    "Comedy",
    "Fantasy"
  ],
  "description": "Five years after they defeated Gozer, the Ghostbusters are out of business. When Dana begins to have ghost problems again, the boys come out of retirement to aid her and hopefully save New York City from a new paranormal threat.",
  "releaseYear": "1989",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yObYPMA58DnTMvJooFW7GG6jWAt.jpg",
  "categories": {
    "plot": 7.083333333333333,
    "acting": 7.533333333333333,
    "ending": 6.6,
    "soundtrack": 7.666666666666667,
    "cinematography": 5.0,
    "familyFriendly": 7.285714285714286,
    "funny": 6.25,
    "action": 7.2
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I saw this movie years before seeing the first one, which is probably why I liked this sequel better than the original. Still, I love it because it was the one that made me a huge Ghostbusters fan."
    },
    {
      "rating": "8",
      "text": "Not a bad follow-up to the original. Though there are some typical sequel staples, like more characters, more special effects and a similar plot line, this film fares well."
    },
    {
      "rating": "8",
      "text": "Ghostbusters II didn't suck, in fact, it's wasn't too bad at all, although it sure is the failure of this movie, and everything thinks it's bad, but after the atrocious 2016 Ghostbusters movie, which It made them think Ghostbusters I and II look perfect, still looking for Afterlife next year in 2021.The humor is alright, while it may not be a good follow up, but the movie has some improvements that are not shown in the first movie, our Ghostbusters are still likable, and maybe the newer Ghostbuster.I didn't think Ghostbusters II is a poor follow up, but it's decent at best."
    },
    {
      "rating": "7",
      "text": "Ugh.  Reviewed wrong \"ghostbuster.\"  But reviewing the old movie from memory to replace the misplaced review.  So 2nd ghostbuster has more horror element to it, and it was a good continuation.  It definitely ran out of steam on the gimmick and the throwaway characters by the end of this movie.  If ghostbuster had more enduring character like Constantine, it would've been a longer-living franchise."
    },
    {
      "rating": "10",
      "text": "Having to see the new 2016 Ghostbusters movie made me realize how good Ghostbusters II was.\rIs the story as good as in the original? No. But the writing and characters are as intelligent as in the original."
    },
    {
      "rating": "7",
      "text": "Ghostbusters II was a movie I absolutely adored as a child. As an adult I can definitely see some cracks, especially when compared to the original. Nether-the-less, this sequel still has it's moments. Whether it's laughing out loud at an alien with a room at the Paramus Holiday Inn or getting a chill from that creepy painting, Ghostbusters II offers a lot of nostalgic good times."
    },
    {
      "rating": "6",
      "text": "It tried to be a copy of the first one and was a disappointment. However, there are a few things that are worth seeing like lady liberty walking while being controlled by an Nes controller."
    },
    {
      "rating": "3",
      "text": "50 minutes into the film and I shut it off. The characters I couldn't care less about, and I couldn't give you their names even if I tried, the \"comedy\" was not very funny at all, the plot was boring, and the action was underwheelming to save the least. Despite all of this, however, I don't completely hate this movie, and its not awful, but its a painfully mediocre movie, and one of my biggest dissapointments, and I’m sure we all know from experience, that a dissapointing film can be a lot worse than one that is just straight up bad."
    },
    {
      "rating": "9",
      "text": "This one is actually better than the first one by a bit. Ghostbusters is a great movie in the 80's and I really enjoyed it. The ghosts were better this time. The theme song is back. The plot and storyline is good. I enjoyed the part when the Statue of Liberty came to \"life\". The Second Ghostbusters is very good and I recommend you watch it and once again, if ya hate Ghostbusters, you're silly as J. Bieber. I really recommend you watch this one, and unlike 1, this one is underrated."
    },
    {
      "rating": "6",
      "text": "ghostbusters 2 comes out 5 years after the first one did which by the way why isnt it up on metecritic for us to review? its a 10 by the way. the second one isn t near as good as the original and after 5 years its not like it was a rushed sequel like alot of movies are theese days . its still entertaining with some good humor and when i was a kid i went to see this at the movies like 4 times and loved it. but that was 22 years ago and im older i may have game it a 10 then but its a 6 now. it borrows to much it feels like from the first and the comedy isnt as funny as what the original was nor is the action which GB1 blended both so well together. still its a ok film that could have been far worse."
    },
    {
      "rating": "2",
      "text": "Ghostbusters 2 largely ended up trying to copy what made the first film such a hit and honestly just ends up failing to live up to that hype. The plot is even worst this time around, The characters almost instantly forgettable. If it wasn't for the natural charm and chemistry that the cast brought to the table, This movie would be an utter bomb."
    },
    {
      "rating": "6",
      "text": "Not nearly as good as the first film in the Ghostbusters series, but like the first still manages to capture the viewer in the strange world of the paranormal--In a comedic way."
    },
    {
      "rating": "8",
      "text": "Ghostbusters was a very huge franchise, let's admit that for once. But I don't think anyone would have expected the series to get as popular as it did. Set five years after the first movie, our Ghostbusting crew is at it again. However, at the time of release, it wasn't met with the same feedback as the first one. So, what exactly happened? Well, let's jump right in.\r The last time we left them they had saved the city of New York from a mean old mother hubbard, but since then they experienced a decline and not really seen much ghost activity. Heck, some of them moved on like Peter Venkman (Bill Murray) having his own TV show and Egon Spengler (Harold Ramis) doing scientific work elsewhere. Winston and Ray (Ernie Hudson and Dan Aykroyd) are still the Ghostbusters, but more of attending parties for kids than actually capturing the supernatural. That is, until pink slime starts appearing from all over Manhattan and they have to reunite to see what on earth is going on. Little do they know about the bigger picture that is about to unfold. ...See what I did there?\r Aykroyd and Ramis are back on the writing chair again, to bring us another adventure from our Saturday Night Crew plus one. I actually liked that Hudson's character, Winston was given more time to interact with the cast than before. There are some pretty good moments with him and the other that really shine through on what was a movie full of doubt. Will the villain work? It really is an interesting choice to give a more active role to the main big guy, Vigo the Carpathian by manipulating other things and people to do his work. ...Well, more active than Gozer. (To be fair, it really couldn't do much without getting revived first.)\r I'm going to assume you seen the film already. I mean, You clicked the arrow that revealed this critique to begin with.\r There are some very funny moments here just like the first one, but none that actually made me laughed my bum off. Well, except maybe when testing the pink slime on a toaster, that was pretty cute I think. I also think some of you might have noticed that not many of the jokes they set up try to cross the line, more for kids to understand (at the time at least.) Plus, some changes that will make the casual fan go: \"Wait a minute, I thought Egon and Janine had a little thing going on here. Why is Janine going for Louis now?\" That answer brings us to the cartoon show airing around the same time, The Real Ghostbusters.\r From what I could gather, the series started faithful to the movie and had two seasons worth of spooky fun for kids and adults alike. However, anyone in production or watching the series would tell you that seasons 3 though 7 ended up dropping some of this to focus more on kids specifically, including making the plots more childish and essentially changing the show to Slimer and The Real Ghostbusters. No kidding, that green disgusting blob from the Sedgewick Hotel? He ended up taking more time than the actual cast we should have been focusing on! Thank goodness the movie doesn't do that, but some of the minor details from the show ended up sneaking into the product we did get. And I think that's what drove people up a wall along with those who only saw the first movie setting their expectations too high on the sequel.\r A real crying shame too, the plot is great, the character interactions are fun and most of the charm of the original is still there. It just ended up in an inconvenient place at the wrong time. Please, understand where I come from by saying so: It took what was great and maintained the status quo, and to me that is very good."
    },
    {
      "rating": "4",
      "text": "sorry, i missed it..Ghostbusters IIMaybe, if focused less on the sub-plots assigned to the characters and more on the screenplay then it would have come off far better than the first one since the screen time was on their side."
    },
    {
      "rating": "3",
      "text": "Vilhelm Von Homburg who plays one of the terrorists in Die Hard stars in this 1989 sequel to 1984's Ghostbusters as an evil ruler trapped inside a painting at a museum but soon gets found out he's watching somebody (Sigourney Weaver) who works there. As the river of pink slime beneath the city causes havoc in the city and is connected to Vigo inside the painting (Homburg) the Ghostbusters must stop him and retrieve Dana Barrett's (Sigourney Weaver) baby from the unholy ruler who tries to become one with the kidnapped child. Bill Murray, Harold Ramis, Rick Moranis, Dan Aykroyd and the gang return for his silly sequel that lacks the class and excellent energy of the original. Unfortunately Ghostbusters II doesn't deliver like it's predecessor and even the humour isn't as funny as the original so overall a complete flop."
    },
    {
      "rating": "5",
      "text": "Potentially better than the first but has the same general stupidity that gets old fast."
    },
    {
      "rating": "7",
      "text": "The sequel to the mid-80's hit is just that little bit better than the first thanks to just having a little more action and laughs as well as just being a bit more updated also. Again, because its from the 80's I was late seeing it until probably the late 90's and while I liked it, it's just sitting in that average stage for me. Great to see all the main players from the first film back of course with the addition of a few newbies. Overall a decent sequel that manages to top the first, just"
    },
    {
      "rating": "5",
      "text": "II is not nearly as good or funny as the original, but little bits and pieces are amusing, especially Dana's boss that doesn't ever utter a coherent word."
    },
    {
      "rating": "10",
      "text": "I often hear some complains that this is a weak sequel. I fully disagree. It has all the strengths of the first movie including the awesome cast, humor and immersive story. They even added a bit of new stuff. Even after countless rewatches I still did not find any convincing evidence why some see this as failure. If you want to see a good example for a truly weak sequel just watch Highlander 2 (I am a fan of this franchise too by the way and it is pretty hard sometimes). Closest thing to a complaint is maybe that they use the formula for the first movie too much. But even this is no real failure if the first movie is that great and the result this much entertaining. The story starts a few years after the events of the prequel. The Ghostbusters had saved New York and probably the whole world (or mankind). Like many heroes they got blamed for the events in the aftermath and are forbidden from doing their jobs. Because the paranormal / ghost activities are on a very low to non existing level too there is nothing they can do. However a true vacuum does not exist for long and so a new adventure starts for our heroes. I stop with this set up to avoid spoilers. The story works well and it is an enjoyable ride to the memorable climax. Again they have Harold Ramis and Dan Aykroyd for the script and Ivan Reitman as director which is a success formula. The humor works great and the scene were the Ghostbusters are back in action is legendary good. The great actors / actresses return into their iconic roles. Bill Murray is back as Peter Venkman, Dan Aykroyd as Raymond Stantz, Harold Ramis as Egon Spengler and Ernie Hudson as Winston Zeddemore (Luckily has more screentime than in the first movie). These four have become pop culture legends and fully deliver again in this movie. The actors have a great chemistry together and fun in their roles. It ends however not with those as we got a great support of other actors. We got again Sigourney Weaver as Dana Barrett and Rick Moranis as Louis Tully. Both are are some of my favorite actors and so great to watch. I want to also praise Annie Potts as Janine Melnitz, Harris Yulin as Judge Stephen Wexler and David Margulies as the mayor of New York. Smaller but really enjoyable roles. Special additional praise for the villain played by Wilhelm von Homburg and voice actor for the villain  Max von Sydow (Nailed it perfectly). I fully enjoyed the humor. Again we got good jokes, memorable scenes and the characters being themselves;-) The special effects again are really good for its time but aged a bit badly. Still good enough for me and they created their own style. The music is truly good. Overall if you enjoyed the first movie this will be a equally good experience. It captures everything that makes the first movie great and adds a bit to it. Easy recommendation for me."
    },
    {
      "rating": "9",
      "text": "Amazing sequel to already cold-stone classic Ghostbusters. Less funny but hilariously entertaining and telling beautifull metaphore about spreading love and happyness to heal the world. Rick Moranis stole the whole show."
    },
    {
      "rating": "7",
      "text": "I know this movie was far inferior to the first Ghostbusters, but it definitely had its moments and a lot of memorable scenes. Even the ridiculous one where they drive the statue of liberty in New York City. Although this movie was dissapointing, it was still good. 7/10 (Good)"
    },
    {
      "rating": "5",
      "text": "[ Written on May 21st, 2016 ] Despite it being a sequel to the original Ghostbusters, I don't think this one did such a success in my opinion. Mainly it's because how the original topped the golf club like a hole-in-one, but the sequel just went off like it couldn't want to do it anymore. Hey, at least they tried on this one."
    },
    {
      "rating": "9",
      "text": "A lot better than people remember. If you saw it years ago and got caught up in the flow of thinking it's bad, watch it again with adult eyes and you'll see there is a lot of goodness to take away from this. Granted it's the family friendly Ghostbusters, not the one targeting a young adult audience, but there's still a lot of quality here. Trust me, try it, watch it and analyse it with your geek eyes."
    },
    {
      "rating": "7",
      "text": "DecentGhostbusters II isn’t as good as the first one, But it’s humor definitely helps it."
    },
    {
      "rating": "7",
      "text": "Ghostbusters II. I ain't 'fraid of no ghost! Four brave hunters return to the streets of New York. And everyone again knows where to call. Ghostbusters! The sequel did not get worse, but the main villain is probably still not as colorful as it was in the first film."
    },
    {
      "rating": "6",
      "text": "This movie is the sequel to the popular film \"Ghostbuster's\", released four years earlier. The main cast it's unchanged, with Bill Murray playing Dr. Venkman, Harold Ramis as Dr. Egon (more geek than ever), Dan Aykroyd as Dr. Stantz and Ernie Hudson as Winston. Sigourney Weaver keep's the role of Dana and Rick Moranis continues to give body and talent to the bumbling Mr. Tully. In this film, the company will be re-activated to face a new danger, the evil Lord Vigo (Wilhelm Von Homburg), a medieval warlord who resurfaces in New York with the darkest intentions.As expected, the booming and highly profitable \"Ghostbuster's\" quickly spawned a sequel. However, contrary to the bad reputation of this kind of films, this sequel reasonably maintain the level of the previous film, despite being sentenced to didn't become so popular. It's the curse of any sequel to a film that reaches such popularity. In fact, both the technical team and central cast are inherited from the previous film, holding the responsibility very well, although Murray can't have been so funny such we already know how he will behave. In addition to the natural predictability, perhaps the smaller laughter guilt is also the politically correct, a barrier that shouldn't be exceeded in family comedies, but that was tight in this film compared to the first one. In addiction, Peter MacNichol comes in the role of Dr. Janosz Poha, a completely new character that gave a breath of fresh air to the film. Years later, MacNichol will redesign this character in another movie, in Leslie Nielson's company (Dracula: Dead and loving it). The special effects continue to be important part of this film, although apparently become more subtle than the first one. The soundtrack is, perhaps, one of the biggest disappointments. Apart from the leitmotiv \"Ghostbuster's\" ever popular, it doesn't bring almost nothing remarkable.Although this film suffer from common ailments to most sequels, especially those that were made to resoundingly popular films, it manages to works well and please the majority of the public who saw and liked the first movie. It's a film for all audiences, familiar, fun and popular even today."
    },
    {
      "rating": "4",
      "text": "Somehow Harold Ramis and Dan Aykroyd saw that wasting almost the whole second act on Dr. Peter and Dana's awkward, tedious and utterly uninteresting troubled relationship, and then adding insult to injury with Louis Tully and Janine Melnitz's even more cringeworthy and excruciatingly painful-to-watch relationship is a better idea than finding some plausible explanations for almost everything related to the main plot, in general, and the ludicrously terrible villain, in particular!I mean, WHY?! The first act was really promising. It had a couple of funny spooky moments, some hilarious gags, and the cast seemed to be even more charming and energetic than it was in the original. Also, the premise is quite good (and served the humor quite a lot); but the execution is rather embarrassingly messy and nonsensical, and the laughable, scrappy third act is a case in point. I have never been a fan of the original; but this sequel is so frustrating, since the build-up was surprisingly quite neat.(4.5/10)"
    },
    {
      "rating": "6",
      "text": "Bastante inferior con respecto a su predecesora. Si bien sigue teniendo algunos momentos divertidos, estos son pocos y la historia es bastante mediocre. El antagonista principal es una vergüenza si lo comparamos con Gozer."
    },
    {
      "rating": "10",
      "text": "All around awesome sequel. Carries seamlessly from the first and gives Ghostbuster fans another fresh installment of ghostbusting action and joy. It never gets old and never disappoints. Been waiting for Ghostbusters 3 ever since I saw the sequel in theaters as a kid. Just can't get enough of this world and this story."
    },
    {
      "rating": "7",
      "text": "Entertaining over the top amazing!great music and theme song,acting was iconic.CGI was **** was decent.the comedy and punchlines were amazing. venkmen and egon was hilarious as hell love the do,re,egon scene,sarcasm was amazing and love the scene who u gonna call he-man it was hilarious.nice addition to another ghost-buster at the end whole ending was over the top but engaging compare to 1st one it wasn't that great but it was entertaining and fun sequel!"
    },
    {
      "rating": "7",
      "text": "Siempre he defendido esta película, no entiendo por qué la gente le tiene tanto odio. Está al nivel de la primera."
    },
    {
      "rating": "7",
      "text": "Although not as good as its predecessor, Ghostbusters 2 is a decent sequel that brings up a new and surprisingly entertaining story. However, it feels like the story also piggybacks on the story that happened in the first movie with similar events. It’s honestly hard to be biased about this film since I personally grew up with it just like Jaws 2. However, I recommend it if you’re a ghostbuster fan like me and so many others."
    },
    {
      "rating": "10",
      "text": "Easily my most favourite movie all time. They took what worked in the previous movie, add mood slime and some nods to the Real Ghostbusters, and you have a great movie!"
    },
    {
      "rating": "7",
      "text": "underrated sequel, not as good as the first one or afterlife but better than 2016"
    },
    {
      "rating": "7",
      "text": "A decent movie, but suffers because of it bassically being a rehash of the original"
    }
  ]
}