{"id": 1326, "title": "Ghost Rider", "starring": ["Nicolas Cage", "Eva Mendes"], "runtime": 114, "genre": ["Thriller", "Action", "Fantasy"], "description": "In order to save his dying father, young stunt cyclist Johnny Blaze sells his soul to Mephistopheles and sadly parts from the pure-hearted Roxanne Simpson, the love of his life. Years later, Johnny's path crosses again with Roxanne, now a go-getting reporter, and also with Mephistopheles, who offers to release Johnny's soul if Johnny becomes the fabled, fiery 'Ghost Rider'.", "releaseYear": "2007", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/8LaVQiXBsnlo7MXCPK1nXTVARUZ.jpg", "categories": {"plot": 4.857142857142857, "acting": 3.7777777777777777, "ending": 5.5, "soundtrack": 8.0, "cinematography": 3.0, "familyFriendly": 4.3, "funny": 3.0, "action": 4.733333333333333}, "reviews": [{"rating": "6", "text": "Good first attempt into bringing the Ghost Rider to the big screen. This was an interesting film of an interesting character. Nicolas Cage and Peter Fonda were good, I didn't like the portrayal of Blackheart in this movie. Mark Steven Johnson wasn't the perfect director for this one, and the CGI effects weren't that great."}, {"rating": "0", "text": "What a joke. No wonder it rotted in the can for two years. The director can now add yet another cinematic abomination to his hysterical resume. Ditto for Cage, who looks ludicrous. WICKER MAN and GHOST RIDER in the same year? Bravo. Almost as good as his last double-play: WEATHER MAN and LORD OF WAR. Cage time and again manages to limbo under the low, low bar he set in CON AIR. Basically, Coppola's nephew keeps churning out the virtuoso performances. When will Nic Cage be exposed for the ham and fraud he is? Another 20 mil for the hack. Yeah, I know he was in Leaving Las Vegas, but he's long since spent whatever capital he earned from that. Whoever sees fit to pay Cage and this director is not fit to draw breath, let alone greenlight motion pictures. Shame on everyone involved. The money spent on this dreck could have fed orphans or gone to disease research."}, {"rating": "9", "text": "This movie was amazing. I'm not joking. The effects were cool, it had a decent story, and it was just overall a cool movie. I think the people who don't like it are just people that expect every movie to be comparable to a Steven Spielberg movie. No seriously, people compare movies part of smaller series like this to masterpieces."}, {"rating": "5", "text": "Somewhat entertaining and Cage is okay but this film has terrible flaws in its writing and mediocre visuals."}, {"rating": "3", "text": "What makes \"Ghost Rider\" so terrible is not the childish dialogue or Nicolas Cage, but the story. The plot madly stomps on everything, pulverizing the whole movie into a ugly piece of scrap."}, {"rating": "10", "text": "The reason why I'm giving it a ten is because first I'm a huge ghost rider fan. And I love marvel comics. Whatever people say about marvel movies it shall still bring out the awesome. Oh, yes the movie well let's see its all about a daredevil (Johnny Blaze) who made a deal with the devil to save his father from cancer. I know he's an idiot but he was seventeen. But he's father dies not from cancer but from a stunt he tried to do. But the deal was to turn Johnny into the ghost rider. The devils bounty hunter who was sent out to kill his son blackheart. And..and enough said just watch the damn movie!!"}, {"rating": "7", "text": "..............................................................................................................................................A Very decent action movie is not terrible like almost everyone says."}, {"rating": "2", "text": "When this movie first came out, I was really excited. I was really hoping for a scary and exciting superhero movie. But after watching what was so suppose to be excellent, this was pure crap. First off, the so-called horrorifying visuals and fight sequences sucked. They really bored the crap out of me. Second, the screenplay was just absolutely terrible. I mean seriously, a 5 year old could have wrote this. Third, there was some bad acting. Not all the actors were terrible, but Eve Mendes was just bad. She may look sexy, but she really couldn't pull off her character (Roxane). The storyline may be somewhat decent, but overall, it's just a terrible comic book rip-off."}, {"rating": "2", "text": "I've changed my rating for this movie many times as I've gotten older. Hopefully, this will be the last time. Ghost Rider starring Nicholas Cage, Wes Bentley and some other people. Yes it's so bad I don't even remember who else was in it because every character is changed for the sequel so, who cares. Oh wait Eva Mendes, she was in it. Okay so as always let's start with the bad. Nicholas Cage is awful, awful, awful as Johnny Blaze. They could have casted the guy from The Room and it would have been better. See the problem is he should have known he couldn't act with a terrible script provided by Mark Steven Johnson so he should have just given a Wicker Man performance. Unfortunately, his performance is awful because it's forgettable. There was not a single memorable quote in this movie at all. Not to mention zero character development. They barley gave a name for Eva Mendes' character. The visuals aren't even that great and that jacket is so cheesy, it gave me chills just looking at it. Also, there were so many puns that weren't funny in anyway. As for the good parts of the movie, well they weren't really good. There really just the okay parts that made me not give this movie a 0 rating. Anyway, Sam Elliot gives a decent somewhat cheesy performance. The only pretty good part of this movie was the graveyard scene which was well executed and exciting. In the end, Ghost Rider is poorly acted, badly written, filled with somewhat bland special effects and bad puns. Ultimately despite some redeeming moments, Ghost Rider receives a 2/10 score."}, {"rating": "0", "text": "There's not one good thing i can say about this movie."}, {"rating": "1", "text": "One of the worst movies ever to be created, terrible acting, terrible story, terrible special effects, terrible casting. I'm actually surprised this movie made it to the cinemas nevermind DVD."}, {"rating": "2", "text": "One of the most coolest characters from the Marvel Universe is instantly destroyed with a mediocre cast and a dumb narrative. Nicolas Cage , you are not the perfect actor for this kind of movie ."}, {"rating": "7", "text": "I love this film, I love Ghost Rider, don't get me wrong its a terrible movie but damn i just have a place in my heart for this film because it really showed me that their are different types of superheros besides Spiderman, Batman, Superman etc and really made me want to explore and get a better understanding of the characters. Plus the films about a biker with a flaming skull for a head, BADass.\r -Guilty pleasure film gets 7/10"}, {"rating": "3", "text": "A few days ago, Ghost Rider star Nicolas Cage made news by defending his appearance in a film based on a comic book by summoning up names like Goethe and Thomas Mann, and talking about comics' potential to reintroduce timeless themes in a \"pop-art contemporary manner.\" And he's absolutely right. Or he would be if he were talking about Batman Begins or the Spider-Man series, recent comic-book adaptations that got both the spectacle and the depth right. But he couldn't have been talking about Ghost Rider.\r Cage is a comic-book fan from way back (he has a son named Kal-El, and his own stage name comes from Marvel hero Luke Cage), and he's circled around comics-inspired movie projects for years. Too bad he landed on this one, which reinvents a bizarre Marvel hero born of a 1970s enthusiasm for motorcycle-stunt heroics. Director Mark Steven Johnson previously botched an adaptation of Daredevil by being unable to decide what kind of movie he wanted to make. Here, that isn't a problem, assuming he set out solely to make the kind that fills moviegoers with buyers' remorse.\r Played in the opening scenes by young actor Matt Long, future Ghost Rider Johnny Blaze inadvertently brokers a deal with Mephistopheles (Peter Fonda) to save his father from cancer, only to watch his dad die in a motorcycle crash the next day. (There's always a catch with those supernatural pacts, isn't there?) Understandably upset, he embarks on a career of daredevil stunt-riding, gaining fame and fortune by jumping across football fields. But when Fonda comes calling, Cage gets transformed into a supernatural force for vengeance with a flaming skull-head and the ability to ride his motorcycle up the side of skyscrapers.\r Any potential the film had for making pop art in a contemporary manner is drained away by the familiar demands of second-tier action blockbusters. Cage has some fun with the role, making Blaze a kind of Zen Elvis with a strange fixation on Carpenters songs, but the film's priorities lie with the digital effects and not the story, and even the effects aren't that hot. Eventually, Ghost Rider devolves into a long fight between Fonda's even more evil son Blackheart (Wes Bentley) and Ghost Rider, with Cage largely disappearing to make room for a CGI flaming skull. At least they got the cheekbones right."}, {"rating": "8", "text": "Ghost Rider. The most insane punisher. A dynamic and sometimes funny (thanks to Nicolas Cage) film. The music and effects are top-notch. Is that a little funny, looks like a small skull against the background of broad shoulders."}, {"rating": "4", "text": "Apesar de amar o figurino e a direção de arte em volta do personagem \"Ghost Rider\", o filem me impede muito de ir além disso ao entregar um roteiro muito fraco, com interpretações abaixo da media e uma vibe de herói da marvel da década retrasada.Não acredito que seja um filme ruim. Dá pra levar nessa duração, só podia ser bem melhor mesmo.Audio: English, with Portuguese subtitles. Samsung Mini-System MX D630 [5.1]Quality: 1080p SDR [Netflix]"}, {"rating": "3", "text": "When I had seen pictures of Ghost Rider for the first time, I was really impressed. I really wanted to know what this badass dude is capable of doing, so I saw Marvel's TL;DR video on it. I really loved the idea. So I thought let's give the movie a try. And, well, here I am.The movie begins with a narration. The black and white flashing effects could make any Indian TV serial look like a flipping virgin. Once that was done, the scene changed to the young Johnny Blaze as the stunt driver. He accidentally sells his soul to the Devil, and now the Devil cures his father of a disease which was never talked about before. And suddenly Daddy Blaze dies because Devil wanted to not let Johnny have any relations. And I COULD have believed that, except that Johnny still gets to be with all his friends and he VOLUNTARILY leaves his girlfriend.One very weird habit about Johnny Blaze is the way he points his finger at people and says \"You!\". He does it as a child, he does it as an adult. I'm supposing this wasn't a thing in the comics, and even if it was it could have been done away with, since it wasn't something important and it looked stupid.After he grows up to be Nicholas Cage, he has become a stunt rider who defies the laws of physics using badly edited scenes. When he finds Roxanne played by Eva Mendes aka discount Priyanka Chopra, he starts talking to her awkwardly about her personal life in front of the camera even though he could have done it before or after the interview. And Roxie leaves him because she isn't interested in him anymore. Like, then why did you even come to take his interview? It's established that she's the boss so she could have sent one of her employees to do it.And then Johnny drives behind Roxie in a poorly done green screen and promises her that he will meet her at dinner. But then a new villain, Blackheart comes up with a Bollywood-style CGI entrance and a terribly executed jumpscare. Because of him Johnny turns into Ghost Rider and does everything except doing the very thing for which he had been made Ghost Rider.And the next day when he meets Roxie she doesn't believe the person she's interviewing. Like, read the room, Roxie! The road is melted with motorcycle tyre marks. What makes you think she's lying? And then at night Johnny tells her that he becomes a monster every night. And Roxie says he shouldn't make excuses about this. Normally we'd have accepted this scene, but just one scene ago he was shown to make fireballs with his hands. So why didn't he just make one in front of her to prove it?And then he fights an air dude who's that generic \"Ha ha ha! You can't beat me! I am... no wait, wha... NOOOOO!\" type guy. After that Ghost Rider fights and kills Blackheart, Devil comes back to take his powers. But Johnny refuses. It was supposed to look like a very touching moment signifying that Johnny hated his powers but now grew into liking them, but it didn't feel anything like that. Throughout the movie he only felt like he was okay with these powers and they didn't bother him much.This movie has done everything badly - the score was terrible, the scene cuts looked sudden, the CGI was terrible for 2007 (Superman Returns came a year ago and nailed the CGI), the acting was Raspberry-worthy. The only reason I'm giving this 3 is because it's Ghost Rider. At least they tried. And also because it's so bad that it's hilarious."}, {"rating": "3", "text": "One of the worst comic book adaptions I've seen.Corny dialogue, a lazy script and some dull action scenes combine to produce this train wreck of a movie."}, {"rating": "3", "text": "What a Horrible Marvel Movie! So Overrated marvel movie next to fantastic 4 (2015), elektra and ghost rider 2"}, {"rating": "3", "text": "----------------------------------2.8/10-----------------------------------"}, {"rating": "9", "text": "Exactly what I would expect from a movie about a blazing demonically possessed motorcycle jock. First movie I've seen this year that was a hoot to watch--no it wasn't a brainy flick, but I think I can let it pass on that mark, but until Spider Man 3 comes along, this is definitely the best comic-to-film event out there. Campy, a great cast, excellent special effects, and a plot that made precisely as much sense as any comic book plot should. Great!"}, {"rating": "3", "text": "Awful, even for a comic book movie. It's so bad that sometimes it's funny, ala \"Snakes in a Plane\"."}, {"rating": "7", "text": "This is a movie about a biker from hell with a flaming skull. Seriously, this isn't Schindler's List with demons. For what it is, it's a fun ride."}, {"rating": "9", "text": "Really cool action with Nicolas Cage and stunning FX."}, {"rating": "3", "text": "A hilarious movie. 3 points only because it was entertaiing to watch such a stupid film in action. I cannot believe they spent so much money on making this quiet action movie that is awkard for the entire film. Very entertaining but very bad. A guilty pleasure but obviously an awful film."}, {"rating": "10", "text": "The movie flows real well, never a dull moment. It has its fun,dark, cool, and even light moments. The special effects were very cool, and I liked the story where the main character was trying to make sense of his predicament. Do not expect Casablanca, it is a movie about a flaming skull chasing demons. Expect fun, you might have a good time."}, {"rating": "4", "text": "Very Cheazy. Looked like a hurried made for TV, Power Ranger like movie. Don't think for a minute that because it's a Marvel Comic Movie you can get away that."}, {"rating": "4", "text": "Avi Arad, you are an imbecile and a buffoon. The debacles that were Daredevil and Elektra should have been warning enough. Quit messing with these Marvel characters you fool."}, {"rating": "7", "text": "I actually didn't think it was that bad. A decent action movie. It had it good parts."}, {"rating": "3", "text": "This movie was an embarrasment for Marvel. Started out somewhat decently but almost became Catwoman at the end."}, {"rating": "3", "text": "It's horrible, nothing to see at this movie !"}, {"rating": "2", "text": "Some cool cinematics, but few. Awful plot. Fell asleep before the end, and it was a noon showing."}, {"rating": "7", "text": "Did I see a different movie? I can't believe this is getting slammed so badly. Sure it's cheesy and campy, but I had a great time. Recommended!"}, {"rating": "9", "text": "No one who actually saw this movie could rate it poorly unless their expectations were too high or else they went to see it specifically determined to hate it. Ghost Rider is worth watching, end of story."}, {"rating": "0", "text": "Absolutely garbage. The acting was horrendous, the special effects was terrible as the plot. I staring at on screen at 2 hours and i was very boooooooooriiiiiiiiiiiiiing like i had wasted over an hour of my life. There is NO story, no emotion, NOTHING. Please do not waste your money on this movie. I normally dont criticize movies like this, and most of the people might think bad, but this is going too far. This movie should not have been released. It was incredibly drawn out, which isnt surprising given the fact they had to take no story and stretch it over a couple of hours. The previews make it look bad enough, but if you see the movie you will discover the degree of awfulness this movie possesses. Take my word, dont put yourself through it. Im sorry, but any person who enjoyed this movie is at the same level intellectually as a 2 year old."}, {"rating": "2", "text": "Don't waste your money. The only reason it made box office hit list was because everyone thought it would be as good as the rest of the comic book movies."}, {"rating": "0", "text": "Dreadful from start to finish. Full of cheesy gags and cliches. Caused me to laugh when I probably shouldn't have, while the actual \"humour\" in the film was about as funny as contracting Hepatitis. I never had high expectations for this film, and was appalled to discover that Ghost Rider couldn't even reach those low opinions I had of it in the first place. Unlike several other comic adaptations, Ghost Rider should forever remain in a book, rather than move across to the big screen, so actors like Nicolas Cage don't have to embarrass themselves fulfilling a role that shouldn't have been issued to anyone."}, {"rating": "6", "text": "I actually kinda liked it. I had dreams about it for 4 days. I had one just last night. In all of them I am ghost rider. BACK TO THE MOVIE. It was good although it could o been better."}, {"rating": "8", "text": "A very well done movie. It's definitely worth a look."}, {"rating": "10", "text": "Ghost Rider is my No.1 all time favorite movie. I mean come on now, whats not to like about it. It's got a skeleton wearing all black leather, on fire with a chain wrapped around his body and a gun on his back, riding on a awesome chopper that's also on fire and sounds like something bad out of hell. What's not to like about it. Oh ya, and Nicolas Cage is extremely awesome, and Eva Mendes is extremely hot."}, {"rating": "4", "text": "Ghost Rider had great potential to rank among the elite comic book flicks, but no, it decided to suck instead. The acting and dialogue int his film is simply atrocious, and you won't know whether to blame the actors or the script for it. The action scenes are poorly scripted and have no substance or meat to them. They are an utter bore to watch. While the CGI effects look nice and there might be maybe two or three action scenes worthy of mentioning, Ghost Rider just falls flat and even a rental will make you feel as if you wasted your money. Go see Watchmen or The Dark Knight instead."}, {"rating": "9", "text": "A good superhero movie. Good action, okay dialogue. Nic Cage and Sam Elliot where awesome. Also Black Heart was cool. If your expecting this to be Iron Man then don't watch it just be thankful it isn't as bad as the 2003 Hulk."}, {"rating": "0", "text": "I've always thought that Cage was a one-trick pony. Well, make that two tricks. He did manage to play a good drunk in Leaving Las Vegas. However, all his other roles are pretty much just variations on a theme. GR is no exception. Too bad--I usually like the Marvel flicks, even the Fantastic Four."}, {"rating": "10", "text": "Surprisingly faithful but fun and quirky. An interesting film that does get bogged down in the origin too much. Although that's a criticism of most origin superhero movies these days. The concept and performances show real promise and as usual with these things now the origin is over we will be able to see what the character can do in it's sequel."}, {"rating": "8", "text": "This is on par with second class comic book adaptations like hellboy, daredevil, and the like. If you've seen the second trailer and felt compelled to see this, you won't be disappointed. Never you mind that red lighted 27 metascore."}, {"rating": "7", "text": "doesn't take itself too seriously, parodies westerns, good movie overall."}, {"rating": "5", "text": "This movie was better than I expected. Then again, I wasn't expecting it to be any good at all. As far as I was concerned, of all the parts of this movie, the humorous elements did the best job of working the way I think the director intended. Problems: The love interest was totally pointless, the special effects frequently stole the show from the action, and there were problems with logic (didn't the caretaker say the demons couldn't step on hallowed ground? Why was Blackheart able to confront the priest in the church for the contract?) and common sense (Did the cops really let Roxanne walk in front of them as they all opened fire on the Ghost Rider?). At least I saw this movie for free."}, {"rating": "2", "text": "A movie that starts with an already thin hope for fun ends up sucking even worse."}, {"rating": "10", "text": "This movie was awesome!!!!!I I saw it last night with my wife and i'm still talking about it. It's about time moviemaking expose comics at best. The story, dialogue, acting, cinematography, action and adventure is one of the best i've seen marvel do. If you want to see a class A movie watch this. I usually dont write reviews but this movie was so good i had to write one to motivate all to watch it. GREAT MOVIE!!!"}, {"rating": "6", "text": "Good special effects overall. Loved Cage. The dialogue was as bad as any Kung-fu theater mivie I have ever watched. Character development was virtually non-existent. But a fun movie overall if you don't go in expecting too much."}], "recommendations": ["ghost_rider_spirit_of_vengeance", "catwoman", "teenage_mutant_ninja_turtles", "jumper", "indiana_jones_and_the_kingdom_of_the_crystal_skull", "suicide_squad", "the_legend_of_hercules", "the_mummy_tomb_of_the_dragon_emperor", "the_twilight_saga_eclipse", "seventh_son", "into_the_storm", "i_am_number_four", "van_helsing", "immortals", "transformers_revenge_of_the_fallen", "the_meg", "poseidon", "legion", "national_treasure_book_of_secrets", "bloodshot", "the_eye", "the_twilight_saga_new_moon", "mission_impossible_iii", "underworld_evolution", "dark_phoenix"]}