{"id": 1890, "title": "Ghost Ship", "starring": ["Gabriel Byrne", "Julianna Margulies"], "runtime": 91, "genre": ["Horror", "Mystery", "Thriller"], "description": "After discovering a passenger ship missing since 1962 floating adrift on the Bering Sea, salvagers claim the vessel as their own. Once they begin towing the ghost ship towards harbor, a series of bizarre occurrences happen and the group becomes trapped inside the ship, which they soon learn is inhabited by a demonic creature.", "releaseYear": "2002", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/o8xH46GiXAFmeFKpIstXJ5FqAL1.jpg", "categories": {"plot": 6.666666666666667, "acting": 6.444444444444445, "ending": 6.285714285714286, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "It had great acting, great practical effects, an interesting story and it was overall pretty entertaining.Sure, it was cliché and some CGI effects might look a little bit dated but, it's still a solid movie."}, {"rating": "8", "text": "The scene on the foredeck where the Captain and the passengers were dancing, and the scene in the ballroom, was a common tradition at the time near the end of a trans-Atlantic voyage. These were usually held as the ship approached the end of the trip, near the coast and these Balls were called the \"Captain's Ball\""}, {"rating": "10", "text": "The ghost captain tells Gabriel Byrne's character that the Antonio Graza rescued a ship called the Lorelei. Rescuing this ship is what eventually led to the destruction of the Antonia Graza and the death of all its passengers. \"Die Lorelei\" is a German poem about a siren-type woman who lures boats to ruin and sailors to their deaths"}, {"rating": "9", "text": "Inventive, very scary film that is almost claustrophobic in it's atmosphere.  Great effects to boot.  Although ghost ship movies have been done before, this is still a fine movie.  The opening sequence rates a bravo, in my opinion."}, {"rating": "9", "text": ""}, {"rating": "7", "text": "A very Briliant introduction sequence. The rest of the movie is less succesful but the introduction is one of the most inspired ones I ever seen"}, {"rating": "10", "text": "In 2016, the media website ComingSoon named the film's opening scene one of the greatest in horror film history."}, {"rating": "10", "text": "The Italian in the ship's log is incorrect when Epps looks up Katie's entry. She is listed as \"viaggendo solo\". The word \"viaggendo\" is incorrect, and should be \"viaggiando\". Since Katie is female, the adjective \"solo\" should also agree and be \"sola\", so the entry should read \"viaggiando sola\"."}, {"rating": "7", "text": "When we think we've seen a bit of everything in horror, comes a movie that surprises us with something new. It can be good or bad, better or worse achieved, but has the added value of novelty. This is one of this cases: movies about haunted houses come in droves, but movies about haunted ships is something different. The director (Steve Beck) and screenwriter (Mark Hanlon) did a reasonable job and got a very interesting story, without the dead times and gratuitous violence that infest the actual horror films. The cast, headed by Gabriel Byrne and Julianna Margulies, also did a decent job, although I believe that Byrne would be able to admit that this was not one of his best films.Blood abounds, there are scenes able to revolve the stomach and times when we really got stuck to the screen, but its not an overly graphic film. Everything rests beautifully in a slightly blurred picture, a very threatening and gloomy environment discreetly accentuated by sound effects. The decadent scenarios of the ship were designed in the smallest details, and are elegantly compared to their \"original\" aspect, through the use of a kind of \"hallucinations\" that closely resemble temporal flashbacks. One of the most impressive moments of the film, however, is its opening scene. Its something that we simply are not expecting to see. The end is not as strong because we, from the middle, can predict some of the key points in the outcome, removing impact to the climax. In the middle of the film, the director and screenwriter were lost, revealing themselves unable to better develop the plot.I confess that this film impressed me when I saw it for the first time. I loved it then, and it still is one of my favorite horror movies, by its potential and its scowling environment more than by it's quality. Not a great movie, its not a work of art, but its entertaining and gives some nice chills."}, {"rating": "10", "text": "Anachronisms The handgun Francesca uses right before her death is a model that didn't exist in 1962. It is a Czech CZ-75, first marketed in 1976."}, {"rating": "10", "text": "Anachronisms The ship is shown to have large round indoor aquariums in several places. The technology did not exist in the 60's to create this type of rounded acrylic."}, {"rating": "10", "text": "Nice variant on the haunted house premiseThe ragtag crew of a salvage boat run across an old abandoned ocean liner that turns out to be haunted by the unrestful spirits of people who were all murdered on it back in 1962.Director Steve Beck relates the enjoyable and involving story at a steady pace, adroitly crafts a pleasing spooky atmosphere, and stages the shock scenes with flair and skill (the boffo grab-you-by-the-throat gruesome opening multiple murder set piece packs a wicked punch!). The inspired script by Mark Hanlon and John Pogue offers a few neat twists as well as a valid reason for why the salvage crew can't simply just leave the ship once they realize something is seriously amiss. The sound acting by the tip-top cast helps a lot: Gabriel Byrne as crusty captain Murphy, Juliana Margulies as the gutsy and resourceful Epps, Ron Eldard as the rugged Dodge, Desmond Harrington as antsy greenhorn Ferriman, Isaiah Washington as the easygoing Greer, Alex Dimitriades as smartaleck Santos, Karl Urban as the scruffy Munder, and Emily Browning as helpful ghost girl Katie Howard. The luscious Francesca Rettondini slinks it up nicely as sultry singer Francesca. Kudos are also in order for the excellent art direction, Gale Tattersall's glossy cinematography, and John Frizzell's shivery score. An on the money fright film."}, {"rating": "3", "text": "Good lord, what a brainless film. Don't waste your money renting this on DVD or even your bandwidth torrenting it from the internet. Just stay away. Believe you me, it's not worth the trouble of trying to make sense of the overall plot. To discover halfway throughout the movie that one of the main characters, Jack Ferriman, is actually a sub-servant of Satan himself is just too damn far-fetched, even for the most optimistic viewers. One of the ONLY redeeming factors about 'Ghost Ship' is a disemboweled scene early on in the picture. That's it!"}, {"rating": "3", "text": "Terrible ending, No scares, Plain blood and gore...Its a cluttered mess with and no enjoyment. The only good thing that made me put 3 instead of 0 was the typically same but worser Titanic."}, {"rating": "10", "text": "&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷"}, {"rating": "5", "text": "there are 3 reasons that it's unfavorable:1. failed to give us scares2. doesn't make sense3. bad ending"}, {"rating": "4", "text": "I saw this movie yesterday with a bunch of friends. The plot was so interesting, that instead we chose to chat about Random stuff such as Halo. At some points acting like the \"Unskippable\" guys for The Escapist. The plot failed to captivate us, and all the coolest people die first. Fails to be scary, however the ending is quite amazing."}, {"rating": "4", "text": "It is a very bad movie .. but the idea is good."}, {"rating": "4", "text": "More like Sea No Evil.Anywhere...It's not quite the sinking ship that some people have made it out to be, as there were some interesting and entertaining aspects in the movie that made the overall experience watchable. I mean the flashback scene that shows the passengers on the ship and how they died was so over the top that I'm still amazed just thinking about it. Also it was a lovely surprise to see a young Emily Browning.However, the movie itself is filled with problems. The visual effects are outdated, some of the acting is a bit iffy, and I feel like the director who previously made 'Thir13en Ghosts' the year before, just made the same movie but this time it's on a ship.I find it really annoying how early 2000's horror movie, for whatever reason, has a heavy metal soundtrack to it. I'm glad that died out."}, {"rating": "5", "text": "Неинтересный и нестрашный фильм, картонные персонажи, шаблонные пугалки. Но, признаться, есть капля интересного в этом море, которое называется посредственность."}, {"rating": "10", "text": "``````````````````````````¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿?????????????????????????????"}, {"rating": "10", "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°¡¡¡_@_@_@_@_@_@_@_@_@_@_@_@_@_@+@+@+@+@+@+@+@+@+@+@+@+@+@+@"}, {"rating": "7", "text": "Not bad at all. I enjoyed watching it."}, {"rating": "0", "text": "A movie so bad, so horribly wretched that it reminds that suicide exists."}, {"rating": "6", "text": "Ghost Ship is not a terrible movie, far from it. It opens very strongly with a brutal and scary opening sequence. It does look good, with a good and atmospheric vessel setting and the effects are much better than the cheap and over-used ones I was actually expecting. The ghost is sexy yet quite frightening as well, there are definitely some nice jumpy and suspenseful moments. As well as some good photography, decent direction and a spooky but not obvious music score. The acting overall is better than average, Julianna Margoyles has the most interesting character and she is very good here. The support cast support her solidly, especially Karl Urban, Issiah Washington and Alex Dimitriades. Ron Eldard is also good though he does have some of Ghost Ship's worst lines, while Desmond Harrington has a brooding presence if occasionally a too obvious.Gabriel Byrne is somewhat of a disappointment though, he seems to be aware that his character isn't in a lot of the movie and he doesn't seem to be making of an effort as a result. The script does have poor moments, coming across as stilted and clichéd, while apart from Margoyles the characters are never realised fully. The story gave me a mixed reaction, it does have a great tense atmosphere and some nice creepy moments, plus it does deserve plaudits for not being completely predictable, but it is sluggishly paced a little too often and while creepy apart from the opening sequence there is never anything particularly scary. The last 30 minutes are underwhelmingly silly and the only scene really that I'd consider predictable.Ghost Ship does have its faults, but overall it is a decent movie with a good atmosphere, decent acting and a great opening sequence. I just wish the pace, script and ending were better and that I learnt more about the characters. 6/10 Bethany Cox"}, {"rating": "6", "text": "The beginning and the end of this movie is really the only good thing about the movie. Everything else is just a crew chasing around a ghost girl trying to figure out what happened to her. Pretty boring."}], "recommendations": ["mirrors", "antlers", "the_ritual", "house_of_wax", "winchester", "the_others", "the_possession_of_hannah_grace", "annabelle_creation", "hanna", "final_destination", "the_woman_in_black", "cube", "the_crazies", "candyman", "color_out_of_space", "the_shallows", "the_unholy", "eli", "vacancy", "insidious_chapter_3", "event_horizon", "crawl", "the_lodge", "the_invisible_man", "twister"]}