{
  "id": 1321,
  "title": "Ghosts of Girlfriends Past",
  "starring": [
    "Matthew McConaughey",
    "Jennifer Garner"
  ],
  "runtime": 115,
  "genre": [
    "Fantasy",
    "Comedy",
    "Romance"
  ],
  "description": "When notorious womanizer Connor Mead attends his brother Paul's wedding, he is forced to re-evaluate his behavior as he comes face-to-face with the ghosts of girlfriends past, present, and future, along with his deceased uncle. The experience changes his attitude and allows him to reconnect with his first and only love, Jenny.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yNn5NjNQF8m7w05Jqk2kEW2XOfU.jpg",
  "categories": {
    "plot": 4.6,
    "acting": 3.6666666666666665,
    "ending": 2.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.5,
    "funny": 3.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Its a chick flick don't have too many expectations."
    },
    {
      "rating": "10",
      "text": "Wow! I'm so surprised! This movie was actually funny! I loved it !"
    },
    {
      "rating": "8",
      "text": "They make a really nice couple, i enjoyed the movie and i would also recommend it.. even though it is a copy of a Christmas movie i think."
    },
    {
      "rating": "0",
      "text": "Wow...this was horrible. It looked cute, but ends up being a weirdly awkward sexual referenced failure of a summer romance flick!"
    },
    {
      "rating": "1",
      "text": "Even though there were some nice moments in this movie, that does not un-do the other many dicpicible moments. It was crude, rude, deplorable. I cannot believe that Matthew & especially Jen would have anything to do with a movie like this. I won't even rate this movie as a movie you should wait for on dvd...no, it's a movie that I will warn people to NOT SEE...don't waste your money!!"
    },
    {
      "rating": "5",
      "text": "Not sure why this movie was released in the spring as compared to the Christmas season but it"
    },
    {
      "rating": "6",
      "text": "Cute, fun movie to waste some time in. Good date movie. Should have been rated R, very adult goings on."
    },
    {
      "rating": "3",
      "text": "My friend and I went to see this after school one day. You'd think that just because their was a lot of people in 1 room, you think the movie would've been good. Well, it failed. I'm a movie kind of girl, i enjoy Oscars, but none-the-less, i enjoy a cool chick flick. But this was stupid! I mean, really, this womanizing jerk, AKA Matthew's character Connor is just as predictable. AWFUL. AWFUL. AND AWFUL!"
    },
    {
      "rating": "4",
      "text": "The Ghost of Girlfriends Past is so young; an eternal teenager who haunts Connor Mead at his brother's wedding because, one surmises, the lothario had something to do with her death. Cheerfully playing the curator of his own romantic history, the former Allison Vandermeersh was on the receiving end of a careless kiss from Connor at a basement party. They were high school contemporaries. In all probability, the dead girl has issues with Connor, a fact that \"Ghosts of Girlfriends Past\" largely obscures since her comportment betrays no blatant malevolent signs which would be detrimental to the irritating lightness of this purported romantic comedy. But subtle signs subsist, in spite of the film's broad comic tone. Arranged by Allison's control of time and space, Connor revisits a scene from his formative years; his non-a**hole years before mom and dad expired in a car wreck, where he tells the girl on a the swing, \"I'll keep it forever,\" because the ghost knows that the Polaroid is his most prized memento. With glee, Allison repeatedly rewinds this moment when Connor's older self denies ever having expressed himself so vulnerably. At the aforementioned party, Allison clearly wasn't part of the in-crowd(the glasses and braces are a dead giveaway), so her makeout session with Connor(off-screen, following the secondhand kiss) was quite possibly the highlight of her short life. The dead girl, after all these years, revels in being his first conquest. If \"Ghosts of Girlfriends Past\" was more honest, it would have included a scene in which the photographer asks Allison about the details surrounding her death. Sadly, her character is underwritten. Instead of ripping off Charles Dickens' \"A Christmas Carol\", the narrative might have benefited from having just one ghost: a ghost with a long memory and bruised feelings. The film seems unaware that Connor owes The Ghost of Girlfriends Past an apology. His redemption is too easy."
    },
    {
      "rating": "8",
      "text": "I found a lot of humor and some romance in this romantic comedy. The lead, Mathew Machonahey plays a sleazy photographer but realizes that with the help of ghosts from girlfriends past. I enjoyed this movie and recommend it."
    },
    {
      "rating": "2",
      "text": "I took my mom to see this for mother's day as it was her pick being her day... I absolutely hated this movie. Typical predictable manufactured Hollywood garbage. I completely LOVE Jennifer Garner but even so, I found the flick painful to sit through... The only reason it got a 2, mom loved it; and I love my mom."
    },
    {
      "rating": "8",
      "text": "Loved it. A bit raunchy, stupid, predictable but very funny, endearing and lovable."
    },
    {
      "rating": "6",
      "text": "Just a normal shallow chick flick. It's great for a simple date, but don't expect an Oscar. It meets the expectation of just a decent flick."
    },
    {
      "rating": "2",
      "text": "Here's a novel idea; cast Matthew McConaughey in a romantic comedy as an over-confident womanizer... wait, how many times have we seen this? Well, there is one silver lining here; if you've seen one McConaughey movie, you can check it off your list and there's no need to ever see another one."
    },
    {
      "rating": "2",
      "text": "I would give it a 0 or a 1 except it has SOME redeemingly funny parts with the the woman who plays Gretchen from Mean Girls (I dont know her name). Besides that, as David H said... \"Here's a novel idea; cast Matthew McConaughey in a romantic comedy as an over-confident womanizer... wait, how many times have we seen this?\" I simply don't understand how anyone working on this movie THOUGHT it could be successful."
    },
    {
      "rating": "0",
      "text": "I've seen many movies in my nearly 40 years of age, but this one shocked me with its utter stupidity and moronic content, forgive my French. Every woman in this movie is portrayed as a complete whore and a prostitue while each man is depicted there as a sex deprived and preoccupided narrow minded maniac with only one idea in their shallow mind: humping, humping and humping again. Does it sound anything like real people around us? I mean there are people like that but by far not EVERYONE around us! Nasty, disgusting, immoral, repulsive, much like stepping on a slug with your bare foot. Watching this movie was not only a complete waste of time but also a whole world of negative emotions. If you wanna puke, that's your movie!"
    },
    {
      "rating": "4",
      "text": "The thing about Matthew McConaughey is he thinks he is hotter than just about anyone else and his conceit is quite irritating. This is a very predictable romantic comedy, not very well written and few performances that stand out. Nothing special at all."
    },
    {
      "rating": "6",
      "text": "Considering this was a \"chick flick\" I actually enjoyed it. Its based on an idea similar to 'A Christmas Carol\". I actually decided to purchase it after I had viewed the trailer on another film I purchased.I'm a big fan of films with a ghost type theme anyway, so thought I would give this one a go, although I'm not normally a fan of chick flicks, I found the story to be enjoyable."
    },
    {
      "rating": "10",
      "text": "The most beautiful film I have ever seen, really. I had seen this film so many times, and every time I got excited every time. Fantastic interpretation of Matthew Mcconaughey, Jennifer Garner and Michael Douglas. I advise everyone to see it at least once in their life, you can't live without seeing it"
    },
    {
      "rating": "7",
      "text": "It works, it's not the best romcom I've ever seen but it's by no means the worst. It ticks all the boxes, however some of the dialogue is close to vomit inducing."
    }
  ]
}