{
  "id": 293,
  "title": "Ghostbusters: Afterlife",
  "starring": [
    "Carrie Coon",
    "Finn Wolfhard"
  ],
  "runtime": 124,
  "genre": [
    "Fantasy",
    "Comedy",
    "Adventure"
  ],
  "description": "When a single mom and her two kids arrive in a small town, they begin to discover their connection to the original Ghostbusters and the secret legacy their grandfather left behind.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xCTn3IA729UuyvB4rY65fiOOzUv.jpg",
  "categories": {
    "plot": 8.25,
    "acting": 8.818181818181818,
    "ending": 9.0,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.375,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Maybe a 10 is too high, BUT this is how you treat a beloved franchise right. Lovable charakters, a good script and most of all: Passion for the project. The new flick is filled with easter eggs, you may call simple fanservice, but isn´t it all about that? The fans? We waited such a long time for a GOOD new Ghostbusters movie and now we have it. The old crew passes the torch in a respectful way and beside of that: This movie is lots of fun. Perfect popcorn entertainment. Don´t listen to the critics, just grab your popcorn, lay back and enjoy a really heartwarming Ghostbusters film."
    },
    {
      "rating": "3",
      "text": "Everything about this film seems as cold and lifeless as the titular ghosts in need of busting. It's a hollow cash grab chock-full of lazy writing and \"by the numbers\" fan service. It's so devoid of soul that it plays out like a lackluster series of story beats generated by an algorithm. This film does not deserve a fan score lower than the most successful requel that is Scream (2022)"
    },
    {
      "rating": "10",
      "text": "Loved every single part of the movie, I've waited for this movie for more than 25 years and it exceeded my expectations, even dreamed about it for a couple of days. The final part got me crying and I'm not the type of person that cries watching movies"
    },
    {
      "rating": "9",
      "text": "Great film. Kept it simple. Kept it true to the previous material while spicing it up with a modern touch. Don’t go into it expecting a marvel movie explosion and just remember this is a quirky film from an era when movies could be just that and last the test of time. I think today critics and Hollywood kill what we love as movie goers, and that’s to just have something fun and different to watch. Breath of fresh air verses the super hero and Netflix movies that’s been thrown out this last decade."
    },
    {
      "rating": "10",
      "text": "This was a fantastic movie that captured the spirit of the original movie while still being able to find its own way. The actors and actresses in this movie bring a new energy into the franchise, and a perspective that I think lacked in the original. While some might scoff at the idea of not having Bill make puns every five seconds, the humor in this is no less entertaining for those who can put the gatekeeping aside. It is filled with plenty of call backs that will establish itself as a knowledgeable successor to a beloved franchise."
    },
    {
      "rating": "10",
      "text": "My son and I absolutely love this new Ghostbusters movie. To us, the story is very well written to include the old Ghostbusters play their parts and way better than 2016 Ghostbusters portrayal of original Ghostbuster characters play meaningless parts. This movie has heart, it ties into the 1st movie and is inclusive to old fans and new fans including the children. I wish I could of seen adult Oscar or Rick Moranis' character, but seeing that it was the new generation starting from Egon's family maybe the next sequel might have those two in it. If the feeling you got from watching them altogether made you feel like a kid again on the tonight show, this is exactly how I felt when I got to watch this new movie. It made my eyes water. I hope you all enjoy this movie and experience."
    },
    {
      "rating": "9",
      "text": "As a fan of the movies I initially was very skeptical about this reimagining of the film. However I can honestly say did this film was an excellent addition to the Ghostbusters world, as well as a great love letter to the original two films. I felt that it was very smartly written almost in equal to the very first Ghostbusters film it follows certain beats that was expected but very well done. I think the cast was excellently chosen everything was well acted and came to a very emotional ending in short I love this movie"
    },
    {
      "rating": "10",
      "text": "Is Ghostbusters Afterlife a perfect film? NO.Does it stand on its own without relying on nostalgia and the strength of the original?Also no.But you know what? It didn't have to. Ghostbusters Afterlife was exactly what it needed to be.. a loving homage to a beloved film series and a touching family film with just a hint of the subtle \"horro\" the original brought to the table. There were parts that made me jump.. parts that made me laugh.. and, most importantly for this film, parts that made me cry. I don't admit this lightly, the end of this film hit me hard and I loved it!I understand some folks being put off by the reluance on nostalgia and rehashed story beats... but I DON'T CARE! As a fan who saw the originals in the theaters as a kid, and taking my children to see this one now... when so many terrible and half-hearted sequels have been shoved out 9ver the last decade...... this was precisely what I wanted and I can not stress enough how much I appreciate everyone involved in this movie for bringing so much passion and respect to a franchise that so important to me.Very few movies over the last 10 or so years have really hit me emotionally.  But this one delivered a gut-punch in the best possible way."
    },
    {
      "rating": "8",
      "text": "The movie does fan service, which is more important for a long awaited sequel from the 80s sci-fi comedy."
    },
    {
      "rating": "10",
      "text": "This is the Ghostbusters movie that Ghostbuster fans have been asking for in decades! Passing the torch style, that's all we ever wanted so we can continue to have more GB movies made. This movie made me love Ghostbusters all over again"
    },
    {
      "rating": "10",
      "text": "Great movie!! Once again the critics miss the mark. This movie is dramatically better than that last reboot. The quality of the 2016 movie had me extremely worried about this one but they nailed it!"
    },
    {
      "rating": "3",
      "text": "Afterlife is the kind of movie that leans heavily into the nostalgia factor and does little to really open the door to the next stage of adventures. I think fans view it more positively than they would have if the 2016 film never existed because when you have such a negative film that preceded it, You can only go up from there. And while Afterlife is by no means a bad movie, especially in comparison to the 2016 film or even GB2, It certainly isn't a memorable one.The characters are underdeveloped to a fault. The mother is given no backstory at all, There is a character called Podcast because he has a podcast, and Trevor is your typical male teenage character. The story is painfully slow at times and the CGI looks dated even for a film from 2021, specifically, I'd like to point out the god-awful Walmart scene so heavily featured in the trailers.The only two redeemable things about this movie are Paul Rudd and Mckenna Grace. Rudd perfectly captures the few attempts at humor in the film, which is more often missed than hit, but he is frustratingly absent in the second half. Grace is the true star of the film and really helped make it tolerable as this was very much her journey.All in all, Fans are gonna enjoy it for the nostalgia factor but I feel over time it would be received as highly. It's tolerable but forgettable. There isn't a single stand-out moment in this film and it runs for at least a good 20 minutes too long IMO."
    },
    {
      "rating": "9",
      "text": "I was a bit hesitant to watch this movie. Being a big fan of the first two movies and the video game that essentially was GB3, I was hearing mixed reviews all over the place. To all the haters: You're wrong. Afterlife is a love letter to the legacy of the first two movies and clearly was written with allot of love and respect. True, it does rehash allot of elements and has allot of fan service, but it's not as bad as some critics make it out to be. Afterlife essentially finishes off the story that started in the original Ghostbusters and also manages to have it's own identity. Grace Mckenna steals the show with a fantastic performance, and at such a young age. Clearly this is an actress that'll be really big one day. Paul Rudd is his usual self and brings allot of charm. Newcomer Logan Kim is a hoot, clearly not as seasoned as his costars, but his charm grows on you and compliments Mckenna's character nicely. Carrie Coon is okay, but I feel allot more could have been done with her character. The rest of the cast kind of just fade into the background. Fortunately all the cameos are used sparingly and don't steal too much of the spotlight.Overall:Ghostbusters Afterlife is a welcome addition to the Ghostbusters franchise and a great conclusion to the original story arch. From here Ghostbusters has the chance to start a new chapter, which is slightly teased in the post credits scene."
    },
    {
      "rating": "10",
      "text": "I wasn't expecting to be touched by this movie, cinema for the last few years has been lacking. So my expectations were low, especially in regards to the 2016 film as films appeared to only be about content less content. In contract, Ghostbusters: Afterlife was fun, wholesome, original and uplifting. It was refreshing to go to a theater, pay a bunch of money, and actually being entertained. It was almost shocking how good this film was.After seeing the character development, especially that of Phoebe Spengler (McKenna Grace), playing a character who is someone who is not neuro typical, brought me to tears. My daughter was recently diagnosed as not Neuro typical. So when I saw Phoebe's character develop into a thriving, confident, butt-kicking character, it really touched me. Thank you for writing this, and for McKenna Grace portraying this character. Keep it up."
    },
    {
      "rating": "10",
      "text": "The movie was very well done and if you are a Ghostbuster fan you will probably cry at the ending the feels are so there best movie I seen in years it takes me back to good old times and better times thx you for making it if you're a film critic and your rating this movie low you're a piece of garbage and your whole life is nothing it means nothing you are nothing dare film critics who like to give a movie a bad rating because they think they are something in life when they are nothing but a **** loser think about that you said pieces of **** that don't appreciate good movies"
    },
    {
      "rating": "10",
      "text": "Good memories, unpretentious, very 80's, classic... Recommend, for the fan to remember and the new ones to know a great film franchise"
    },
    {
      "rating": "5",
      "text": "What a great film!Obviously nothing can replicate the original but this took me back to when I was 8 years old when I desperately wanted to be a Ghostbuster. And, now I still do. Absolutely love it.Without giving too much away, a couple of extremely touching scenes in this film and the actors must have had a great time making this. I want more!!"
    },
    {
      "rating": "10",
      "text": "this is just a loveletter to the franchise. a perfect end for the OG ghostbusters and a Promising new start to the new ones. as a fan, please watch it."
    },
    {
      "rating": "8",
      "text": "Great film which is made for the fans. Make you laugh and cry. Mckenna Grace is utterly brilliant in it."
    },
    {
      "rating": "9",
      "text": "Absolutely smashes it out of the park it in every way. Don't worry if you haven't seen any other Ghostbusters movie, writer/director Jason Reitman deftly handles catching viewers up on what they need to know, without it feeling forced or plodding, while at the same time creating some excellent call backs to the previous films for long time fans."
    },
    {
      "rating": "8",
      "text": "Ignore the \"Critics\". This movie was fantastic. A warm, fun, friendly, heart warming movie that ticked all of the nostalgic boxes whilst passing the torch to the next generation. It also serves as the ultimate tribute to Harold Ramis and had me in tears."
    },
    {
      "rating": "10",
      "text": "if you're a fan of the ghostbusters movies and have seen ghostbusters, ghostbusters ii and seen all the video clips from ghostbusters the video game 2009 then this will be a good ghostbusters story. i wouldnt call it ghostbusters iii or ghostbusters iv, but its great fan service and its an ok popcorn cruncher. for random movie-goers who havent seen ghosbusters 1984 - its a 7 of 10, for fans of the franchise its a solid 9+. its not perfect, but its not a typical hollyweird/pedowood destruction of a franchise."
    },
    {
      "rating": "9",
      "text": "Are you troubled by strange noises in the middle of the night? Do you experience feelings of dread in your basement or attic? Have you or your family seen this movie yet because it is glorious! Jason Reitman has surely delivered in this long awaited sequel to the original ghostbusters! The thing I find most about movies today is that when they make a sequel, they sometimes drift apart from the source material. But here, Jason takes his father's franchise and makes the best possible sequel any fan could ask for!"
    },
    {
      "rating": "10",
      "text": "For those who watched the first ghostbusters movie, this is a must!I loved it and I vividly recommend it."
    },
    {
      "rating": "9",
      "text": "Just a fun movie. If you like the Ghostbusters, you will like Afterlife. Simple as that."
    },
    {
      "rating": "9",
      "text": "I honestly don't think you could make a better love letter of a movie. It hit all of the right notes, and did them with style, grace, and respect to the original material (especially compared to the 2016 movie).Lots of moments when my 11-year old daughter was really happy about it and bouncing up and down on the couch, so it's not just nostalgia in play. (And quite a few moments where me and my wife were applauding the screen which is really rare). Unlike many movies I've seen in recent years, it managed to compellingly grab my attention and inspire awe at several points. (Now that probably is nostalgia in play).There's two credits scenes, one mid-way, one at the end.Direction was awesome. Script was very well done and on point. Production design was fantastic. And bonus unexpected Olivia Wilde. Cinematography was great too, and unlike too many recent films, properly lit!Well done to everyone involved. So much heart, love, and respect in this one.So much heart and love in that story too. :)"
    },
    {
      "rating": "10",
      "text": "We alll absolutely loved this movie. It’s quite obviously high on nostalgia, but the acting - from the new crew in particular- is fantastic, story moves along nicely and the effects are superb. Will be back for a repeat viewing."
    },
    {
      "rating": "8",
      "text": "A heartfelt and lovingly crafted ghostbusters experience that prominently features engaging new plot and characters while still serving the fans the member-berries most of us long for. Although it falls short of absolute perfection, this was a well deserved entry into the canon and I look forward to watching again!"
    },
    {
      "rating": "10",
      "text": "Great film which is made for the fans. Mach mach better than movie 2016. Similar style like original 1984"
    },
    {
      "rating": "9",
      "text": "The OG Ghostbusters is a 10 the 2016 was a negative number (take your pick between 1 and 10 billion.  This is a solid 8.5, this is what we should have gotten in 2016.  Paul Rudd steals the show of course but the kids did great. Yes there are plot holes but it's a fun family movie. The end should make you cry."
    },
    {
      "rating": "10",
      "text": "Ghostbusters: Afterlife was great; my favorite Ghostbusters movie since the original. The visual effects were exceptional; some of the best I've seen in awhile especially the terror dogs and the mini stay-puff marshmallow ghosts. Mckenna Grace's performance was superb also Logan Kim, Paul Rudd, Carrie Coon, Finn Wolfhard, Annie Potts, Bill Murray, Sigourney Weaver, Celeste O'Connor, Ernie Hudson, Dan Aykroyd, Shohreh Aghdashloo, and Olivia Wilde gave pretty great performances too. The writing especially the screenplay was excellent; the dialogue was really funny loved the jokes that were written for the character Phoebe that her character comes up with. The makeup, hairstyling, and costumes were terrific especially on Mckenna Grace. Also the music was great."
    },
    {
      "rating": "8",
      "text": "The beginning 2/3's of this film are absolutely fantastic. I will admit the overall tone is a little all over the place, but I think I can forgive that. If you love the original Ghostbusters, go and see this movie. Unfortunately, I must admit it felt like they dropped the ball towards the final act and it did end up feeling a little rushed. I think it would have benefited from an extra 20 mins to really get the final act to the same level as the rest of the movie. Maybe this is something that could be rectified with an extended cut? Overall, I'd say it's a good laugh, and it managed to restore my faith in the franchise after the unspeakable reboot we were served in 2016."
    },
    {
      "rating": "10",
      "text": "Amazing movie, it has been a long time since Ive enjoyed a movie without lecturing me, or anything.Finally Thank you"
    },
    {
      "rating": "8",
      "text": "As good as it gets for a reboot. Wasn’t expecting to enjoy it as much as I did"
    },
    {
      "rating": "9",
      "text": "Fans of the originals will be in heaven watching this, the tribute to Harold Ramis was beautiful"
    },
    {
      "rating": "10",
      "text": "Bustin’ makes me feel good. A worthy epilogue of sorts to the original 2 films."
    },
    {
      "rating": "9",
      "text": "Was better than I thought it would be. Nostalgic and tastefully done. Loved it."
    },
    {
      "rating": "9",
      "text": "Great Movie that Adults that grew-up watching Ghostbusters can take their children to and they can also enjoy."
    },
    {
      "rating": "10",
      "text": "Fantastic film, enjoyed every second of it and brought me back to when I first saw the original the first time round, kids really enjoyed it too! A perfect Sunday afternoon family trip to the movies."
    },
    {
      "rating": "10",
      "text": "Just came back from the cinema. I have a feeling I can't clearly describe, something about a movie I've been waiting for like 25 years, and that movie gave me everything I wanted from it... Crying and feeling empty now... 12/10"
    },
    {
      "rating": "8",
      "text": "Thoroughly enjoyed this movie. Honors the original movies as well as Harold Ramis.  Had my theater cheering at the end.  Looking forward to seeing this again.  Stick around for the mid and end credit scenes."
    },
    {
      "rating": "8",
      "text": "Loved this. Recaptures the magic of the first movies and while it's total fan service, it's the good kind. Thoroughly enjoyable and the cast are wonderful. The critics once again are so wide of the mark. Such a worrying trend we've seen these past few years of critics being completely out of touch with public opinion."
    },
    {
      "rating": "8",
      "text": "Do not listen to the critics.  This is a great continuation of the Ghostbuster saga, more so than the so called reboot a couple of years back.  Sure, it feels like an old Amblin film, but that particular tone really fits what this film attempt to achieve. One negative point is that the film does feel more low budgeted in comparison to previous efforts but other than that, it is a great film and a must for Old Ghostbuster fans like myself."
    },
    {
      "rating": "10",
      "text": "Who you gonna call!Love this movie fans and family make movie for fans and Family'sIf you love Ghostbusters 1 & 2 you loved this movie I am not afraid of ghostI like the girl's"
    },
    {
      "rating": "8",
      "text": "GHOSTBUSTERS: AFTERLIFE delivers everything one could love about the original in the vehicle of a nostalgia hungry family adventure film. Reminiscent of The Goonies and Stand by Me, AFTERLIFE utilizes it's children actors to their fullest. Every one of them shines with McKenna Grace and Logan Kim being the obvious stand outs. The movie succeeds with both it's touching family story, whether that's the family you find or the ones you're stuck with, and it's mystifying sci-fi horror side. It's a splendid movie that was very obviously made for fans of the original, although it still doesn't quite capture all of it's appeal. Nevertheless, it's a great sequel to one of the best horror comedies of all time, and a great family movie all on it's own."
    },
    {
      "rating": "8",
      "text": "I very much enjoyed this film. I thought it was going to be woke garbage like they've been doing to movies and shows lately, especially remakes, but I was pleasantly wrong. The nostalgia made me so happy, but it didn't just rely on that, even though it technically had to. It successfully attempted to make its own story that held itself up without the ghostbuster crutch. Favourite scene was when the little marshmallow men were wreaking havoc. OMG, it was so funny and they were so cute! I loved Paul Rudd in this. He played his role very well. I also liked most of the actors. Podcast was one of the biggest highlights. SO funny! Now, here are some things I didn't like: I wasn't a big fan of Phoebe. She sort of eventually grew on me, but she was quite obnoxious. She seemed way too rude for my liking, but she didn't ruin the movie or anything. It was still enjoyable. I also didn't like how there weren't many different types of ghosts. They had some big scenes of nostalgic ones, but others were shown very quickly as if they were trying to rush the 3rd act to end it. I don't know if they're making a 2nd film, I don't think they necessarily should, even though I wouldn't be mad if they did, but there were very few ghosts in this. I also wished all the kids were teens, like Phoebe and Podcast, but again it didn't ruin the movie. Overall, I enjoyed it and I would definitely come back and rewatch it."
    },
    {
      "rating": "10",
      "text": "The moment when Phoebe grabs the neutrino wand at the police station gives the entire movie a free pass in my book. That was an incredibly subtle, clever and accurate point of characterisation. Even some of the biggest GB fans forget about Egon's sudden temper when he gets pushed too far, and the fact that Phoebe was shown to have inherited that very specific character trait was genius. It really proved these people cared about getting this movie right. 10/10"
    },
    {
      "rating": "10",
      "text": "truly a great movie keeps to the lore of the first movie with a surprise of who the Villain  is and a interesting twist to the  Lineage of the ghostbuster crew truly a recommend to watch for  people that love the ghostbusters franchise."
    },
    {
      "rating": "9",
      "text": "This was a great movie!  It was very heartfelt, well acted, and consistent with the theme and tone of the original.   It even has a similar sense of humor as the originals.Highly recommend for any fan of ghostbusters and for anyone wanting a fun adventure movie.Now, as some reviewers have pointed out, it does contain a good bit of fan service,  but it doesn't detract from the movie,  in reality such call-backs either logically fit with the story- of grandchildren solving the mystery of who their grandfather was, or other fan service amount to only fractions of a second,  and aren't dwelled on."
    },
    {
      "rating": "8",
      "text": "Ghostbusters: Afterlife is a wonderful new entry in the Ghostbusters series! It isn’t flawless, I have some personal nitpicks, but they don’t ruin the ride for me. This movie is fun, scary, and at it’s core is a story with heart. If you are a ghostbusters fan like me, if you watched the cartoons, love ghostbusters 2 for all it’s flaws, then you will love this one! Don’t expect perfection, but it’s totally worth the wait! Tons of originality, yet also tons of little references and easter eggs… (especially to the first movie) some may say it has too much fan service, and at some parts, they may be right, but I would rather have a movie with fan service (even if a bit overdone) instead of one that disrespects the legacy of a franchise I love."
    }
  ],
  "recommendations": [
    "sonic_the_hedgehog_2",
    "minions_the_rise_of_gru",
    "entourage",
    "my_little_pony_the_movie",
    "john_carter",
    "the_spongebob_squarepants_movie",
    "ghostbusters_ii",
    "it_chapter_two",
    "the_lego_movie",
    "sonic_the_hedgehog",
    "despicable_me_2",
    "the_peanuts_movie",
    "stardust",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "tmnt",
    "ghostbusters",
    "tomorrowland",
    "speed_racer",
    "shazam",
    "the_witches",
    "sing_2",
    "zombieland_double_tap",
    "the_princess_bride",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "thor_ragnarok"
  ]
}