{
  "id": 335,
  "title": "Ghost",
  "starring": [
    "Patrick Swayze",
    "Demi Moore"
  ],
  "runtime": 127,
  "genre": [
    "Fantasy",
    "Drama",
    "Thriller",
    "Mystery",
    "Romance"
  ],
  "description": "Sam Wheat is a banker, Molly Jensen is an artist, and the two are madly in love. However, when Sam is murdered by his friend and corrupt business partner Carl Bruner over a shady business deal, he is left to roam the earth as a powerless spirit. When he learns of Carl's betrayal, Sam must seek the help of psychic Oda Mae Brown to set things right and protect Molly from Carl and his goons.",
  "releaseYear": "1990",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/w9RaPHov8oM5cnzeE27isnFMsvS.jpg",
  "categories": {
    "plot": 7.5,
    "acting": 7.181818181818182,
    "ending": 8.0,
    "soundtrack": 7.5,
    "cinematography": 9.0,
    "familyFriendly": 5.0,
    "funny": 7.666666666666667,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I love Ghost. It is a film that manages to be both romantic and glamorous, sometimes even at the same time. And it also manages to mix the sentimental and the supernatural wonderfully. The production values are great, the special effects are a treat and the costumes, lighting, sets and cinematography are top drawer.The soundtrack also fits accordingly. Unchained Melody is a touching song and used to great effect here. The script is of good quality, and the story has a great premise with a poignant love-beyond-the-grave theme and a ending that proves that pure schmaltz actually does work. Jerry Zucker's direction is very good.I love the performances too. Patrick Swayze gives one of his best performances as the murdered banker who tries to warn his girlfriend that she is in danger. Demi Moore isn't as good, in fact she is just okay to start with but gets better through the course of the movie. It is Whoopi Goldberg who steals the show in a performance that is outstanding, her presence doesn't jar at all and livens up what could have been a maudlin atmosphere.All in all, a great film with a great premise and worth seeing for Swayze and Goldberg. 9/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "A beautiful movie with a touching story and an incredible cast. Whooping Goldberg made me laugh during this movie and she dilivered an awesome performance. Patrick Swayze is my man crush."
    },
    {
      "rating": "10",
      "text": "This is one of the best movies that I have ever seen. Excellent characters. Perfect plot. Not a single mistake. Ingenious. Masterly. Beautifully. Exciting"
    },
    {
      "rating": "10",
      "text": "This Is Another Great Movie It's One Of The Best Whoopi Goldberg Movies That I Ever Seen This Movies Stars Whoopi Goldberg, Demi Moore And Patrick Swayze It's About Patrick Swayze Who Lives With Demi Moore And Then All Of A Sudden Patrick Swayze Becomes A Ghost After He Died By A Murder He Is A Ghost And He Literally Dosen't Touch Anything At All Soon Enough Patrick Comes Into Whoopi's Apartment And They Are Not Getting Along Very Well And Then Soon Enough The Ghosts Send The Murder To Hell And Then In The End Of The Movie Patrick Starts To Die After He Was A Ghost For A While It's A Great Movie You Should Buy A Copy Of It Ot Renting It Off At Netflix"
    },
    {
      "rating": "8",
      "text": "Wrenches at every inch of the heart. Beautifully executed. Films like this don't come often enough and when they do, you most certainly know it. Whoopi Goldberg at her finest."
    },
    {
      "rating": "7",
      "text": "What we have in 'Ghost\" is a film with many brilliant performances, an interesting, intriguing but often bumpy plot which is often full of unexplained queries and questionable motives, and a romantic burst so powerful and heavy that it has all the makings of a tragic fairytale. Tragic being the most important word here, as Patrick Swayze plays a Sam Wheat, a handsome man with a handsome bank job and a beautiful girlfriend, Molly (Demi Moore). Sam gets shot while out one night with Molly after trying to protect her from a crazed mugger, but Sam succumbs to injury, setting up the rest of the film as Sam attempts to discover why he is still on earth.\rSeeking out the help of the reluctant Oda Mae Brown (Whoopi Goldberg), an apparent psychic, and con artist, can here Sam speaking to her. But as we learn more about these characters, particularly Sam's best friend, Karl (Tony Goldwyn), its clear that the death of this man was no accident, something I personally feel took a lot of heart out of the film and turned into an attempted thriller which it didn't need to be. But as the story unfolds, Sam is looking for various ways to convince a grieving Molly that he still around and that she is in danger. The performances are stellar from all four leading characters, but it has to be the hilarious but focused performance of Whoopi Goldberg that needs particular attention. The way she commands the screen and interacts with the other leads is an honour to watch, showing various sides of the character she is portraying several ways and all in the one film is remarkable.\rIn terms of the story, the dialogue leading up to the tragic event seems to give away what is going to happen anyway if you listen closely, remarking several times about long lives other such things. Also, the appearance of what can only be angels from above and shadows coming from the ground is never really explained, we know the purpose of them, but a more in-depth explanation wouldn't have hurt, especially after the events of the film unfold, it ends up turning into a murder mystery which does become a hindrance on the romantic side of the film, which can't be ignored, there are some truly touching scenes in the film, with Moore and Swayze sharing a believable and heartfelt chemistry.\rThere are many reasons to see this film, more so for the love story being told, but there are other plot developments going on that do hinder what could have been a more fluid and simple story."
    },
    {
      "rating": "6",
      "text": "Ghost, especially the clay scene, is painfully cheesy. But the feel of the whole movie and the way it plays out is inspiring, even if the setup has been done a hundred times before."
    },
    {
      "rating": "6",
      "text": "Ghost does have a bumpy plot at times but Whoopi Goldberg's charming performance is the highlight of this film. The late Patrick Swayze and Demi Moore also put on solid perfromances"
    },
    {
      "rating": "1",
      "text": "Une comédie sentimentale qui ne pisse pas loin et malgré une certaine originalité dans son sujet -ou plutôt le cadre de son sujet… sujet lui-même aux poncifs niaiseux- elle s’avère aussi fantomatique que beaucoup trop anecdotique malgré un Patrick Swayze tout à fait convaincant. Il faut dire qu’elle échoue en termes de drame -à moins d’aimer la collection Harlequin- mais également en matière de comédie…La faute évidemment à Whoopi la bouffonne wesh-wesh qui en fait des tonnes, une sorte d’alter ego féminin d’Eddie Murphy en somme… mais en… encore pire ! si tant est que ce soit possible bien entendu… et ça l’est, hélas ! quant à Demi, ça ne marche qu’à moitié comme trop souvent avec elle… sauf très rares exceptions.C’est donc beaucoup trop gnangnan et concon pour que ça fonctionne, sans compter les raccourcis, les facilités et les incohérences : bref, Ghost, c’est surtout du vent en fait !"
    },
    {
      "rating": "6",
      "text": "you'll go to heaven..GhostAn interesting idea to project a concept that is clearly dark into a suave romance and good old drama with great music and moments which reminds you of the old romantic novels that plays its major part on the metaphorical emotions."
    },
    {
      "rating": "6",
      "text": "This ultra-romantic film addresses two main themes: the power of love and the afterlife. The title may deceive, make us think that is another horror film about hauntings. Well ... it's about ghosts but does not scare anyone. The script is based on the sudden death of Sam and in his attempts to contact his wife, now widow, and warn her about a deadly danger lurking around her. Simple but effective, the script works well, plays with a universal belief, shared by millions of people, places deep questions and earned for its author, Bruce Joel Rubin, an Oscar for Best Original Screenplay.The main roles are played by Patrick Swayze and Demi Moore, two experienced actors who don't have disappointed the public, providing us with very good performances. They have created a good visual chemistry, which helps to enhance the romantic mood of the film. Compelling is the performance of Whoopi Goldberg, one of the most striking of her career. She gave life to a funny medium that starts to be a fraud. The film also features several innovative special effects, for the time, and look good on the screen."
    },
    {
      "rating": "7",
      "text": "On the one side, it is a sad and good story. But on the other side the movie is too much mystery and I didnt like the feminist elements."
    },
    {
      "rating": "9",
      "text": "Very Well DoneGhost continues Dirty Dancing star Patrick Swayze’s success streak."
    },
    {
      "rating": "10",
      "text": "I believe that the genre of this film is romance, if that's right, it's the only film on the subject that I like!"
    }
  ]
}