{
  "id": 520,
  "title": "Gifted",
  "starring": [
    "Chris Evans",
    "Mckenna Grace"
  ],
  "runtime": 101,
  "genre": [
    "Drama",
    "Comedy"
  ],
  "description": "Frank, a single man raising his child prodigy niece Mary, is drawn into a custody battle with his mother.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9Ts7Vc4wLlpI9oox9mkVUE1tBHy.jpg",
  "categories": {
    "plot": 7.918918918918919,
    "acting": 7.8125,
    "ending": 8.0,
    "soundtrack": 6.0,
    "cinematography": 6.0,
    "familyFriendly": 6.0,
    "funny": 7.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "A sweet film that while contrived at times, still gives you enough in the characters to get you to fall for it.  The performances are all good and it's good to see Marc Webb making smaller films again.  B"
    },
    {
      "rating": "6",
      "text": "i think of therefore i am..GiftedThere is a genuine soul in it but besides that it is exactly what it seems like and nothing deeper than that for the director plays on the surface despite of possessing a character driven script. Marc Webb is good but fails to utilize the utter potential of its brilliant script by Tom Flynn. Chris Evans still needs to ante up his game for in some sequences McKenna Grace and other supporting cast overpowers him. Gifted needed better execution and editing especially carrying off such high pitched dramatic sequences that is supposed to mesmerize the audience."
    },
    {
      "rating": "7",
      "text": "Good movie. Falls short in a few areas, and is quite predictable, but, it gives you everything you go in wanting and expecting out of one of these child prodigy movies. One of the better feel good movies of the year."
    },
    {
      "rating": "8",
      "text": "One's fighting for the child and the other's for her gift!Films about battle for child custody is a very familiar theme. There are lots of great films you could find. This is just another, but another great among them. There's actually nothing special about it. It's simple and emotional. The characters were slightly different, and agenda for courtroom drama is interesting aspect of the film.A single uncle who is a by-default guardian for his niece since her mother had died. But the seven year old kid is a math prodigy like her mother. He wanted her to live a normal life like everybody else in her age. That's what her mother wanted as well. When her grandmother learns about the gift, is now seeking a court intervene to provide all she needed to nurture her gift, since she's very rich. So the kid caught between adult's fight, how the rest of the narration folds are emotionally told.I'm not a fan of Captain America, because he's not the Captain Earth or Captain my country. Other than that, Chris Evans is not a big marketable star. But this was a pretty cool performance. The kid too was awesome. The last time I saw her was from 'Mr Church'. Well written and directed. Easily one of the best drama films of the year. A good message film as well. Families should watch it.8/10"
    },
    {
      "rating": "10",
      "text": "On January 17th 2009, visionary and talented music video director Marc Webb made his feature length debut with the totally original and highly unusual romantic/comedy/drama 500 Days of Summer. The film, which went on to be a total critical success, box office spectacle and cult classic, made a name for Webb, who, with his original first film, landed the second leg of Spider-Man’s totally unnecessary “The Amazing” series reboot. Webb, who went on to direct two instalments of our friendliest neighbourhood superhero, re-casting Peter Parker with Andrew Garfield, [in our opinion] the best Peter Parker we have seen so far, was unable to tap into what made Summer so great, and really showed audiences how little creativity and imagination exists inside studio tentpole films. Sadly, while Webb’s Spider-Man films went on to make a ton of money, it proved that just because your movies make money after such a beloved independent film, does not mean that audiences actually adore your body of work. Luckily for audiences, Webb has finally returned to the small scale end of filmmaking, with his newest film Gifted; an emotional and human story of extraordinary circumstances, set with ordinary people.Sadly, while big name studios continue to cultivate independent break-out directors for their high-profile tentpoles (Colin Treverrow and Jurassic World, Jordan Vogt-Roberts and Kong: Skull Island and Gareth Edwards and Godzilla) we are hoping that the day arrives that these absolutely amazing visionaries find a way to blend the creativeness that once made them recognized, with the profitable property they are in charged of brining to the big screen.This time around, instead of Spidey, director Marc Webb had the chance of directing the Avenger’s Cap in this emotional and human story of selflessness and unconditional love. Gifted is by no means a large scale film, despite having Captain Avenger himself front and centre.Evans plays Frank Adler, an ivy-league educated man who, until recently, was given the responsibility of raising his brilliant but deceased sister’s daughter Mary Adler (Mckenna Grace). Frank’s sister Diane was a brilliant mind, who was on the cusp of solving the Navier-Stokes Existence and Smoothness Millennium problem; one of seven of the Millennium Prize Problems. Now, if you are any no way mathematically inclined and have no idea what a Millennium Problem is, here is your history lesson. A Millennium Problem consists of seven of the most complex and difficult mathematical equations known to mankind (yes, they really exist).Upon learning of Diane’s suicide, Frank acts as Mary’s de facto guardian, and keeping his promise to his sister, devotes his life to keeping Mary’s life as normal as possible; which includes enrolling her into public school in Florida, having friends [even if her only friend is a fifty year old Motown-loving neighbour Roberta Taylor, played wonderfully by Octavia Spencer], and most of all, making a life for herself outside of her wicked mathematical talents.On Mary’s first day in school, despite Frank’s wishes to stay under the radar, Mary does the complete opposite of Frank’s demands, acting up and showcases her math skills, immediately becoming the star-studded student of the school, especially to that of her teacher, Bonnie Stevenson (Jenny Slate) and school principle Gloria Davis (Elizabeth Marvel). Mary, unable to contain her big personality in such a little shell, is beyond herself and really not able to contain her spunky personality. Noticing her immense gift and talents, Principle Davis is willing to give Mary a free ride and ticket to a prestigious private school nearby. Frank, who gives his own very convincing case, declines all of the offers given to Mary, insisting she live a normal life filled with childhood instances, friendships and most of all, playfulness.While Frank and Mary seem to be blending into their humble and comfortable lives in Florida, both of their lives are shaken drastically with the emergence of Frank’s mother (Mary’s grandmother) Evelyn (Lindsay Duncan), who believes that Mary’s mind is a gifted one-in-a-billion mathematical prodigy mind, who should continue her late mother’s legacy and begin working, while still a child, on the Millennium Problem, given her very abstract and young handle of advance calculus problems and solutions. What continues is an ugly and emotional custody battle for Mary between her Uncle Frank and Grandmother Evelyn."
    },
    {
      "rating": "10",
      "text": "It's the kind of movie we need with all the negativity in the media. A story about unconventional family. What is normal anyways? The moments we spend with the people we love are all we have in the end.You get so invested in the characters that you don't tend to over analyze other aspects of the plot.To each his own, but my assumption is if you don't or didn't like this movie you may be quite cynical."
    },
    {
      "rating": "7",
      "text": "A very strong low-key film that thankfully plays to director Marc Webb's strengths. It's not the most original idea in the world and the film is rife with cliches, especially concerning the way the central character's prodigal intelligence is portrayed, but the film works. It's the little details that keep the film fresh."
    },
    {
      "rating": "6",
      "text": "Because of the poor script and dialogues, 'Gifted' fails to be deep and captivating movie, but for sure there is a potential in it - more backstory, memories and so on. But I think 'Gifted' successfully provide the message, that most of the time the true and right way to deal with one  complicated situation is located somewhere in the middle of more points of view. Actors/acting, cinematography and runtime were decent."
    },
    {
      "rating": "8",
      "text": "Gifted is a formulaic and predictable movie. But it redeems itself by being a well crafted and well acted movie. Chris Evans, McKenna Grace, Lindsay Duncan, and Octavia Spencer all deliver thoughtful and skilled performances. The eye opener is McKenna Grace whom I have seen only once or twice in sitcoms. Here she delivers a remarkable range and assurance I have not seen from her before and in few child actresses ever. Definitely an enjoyable movie that will tweak your heartstrings, even if you can see what's coming."
    },
    {
      "rating": "10",
      "text": "What an amazing movie.  This movie touched my heart in so many ways.  The performances of Chris Evans, Octavia Spencer and Mckenna Grace are outstanding.  Go and see this movie.  You won't be disappointed"
    },
    {
      "rating": "10",
      "text": "Gifted tells a grounded and emotional story about a young girl with an incredible mind for mathematics, which causes a custody battle to ensue between her uncle and grandmother over what her future should become. At its core it tells a really touching story about the relationship between the little girl (Mary) and her uncle (Frank). They really have a father/daughter relationship, and throughout the film we get to see how much they care for each other. And it only helps that the casting and performances are really great as well (especially the young girl) as it makes you really get invested in the story."
    },
    {
      "rating": "10",
      "text": "This is one of the most emotional movies for me that I've seen this year. Not only does the cast alone have superb acting but that adorable girl just rings my heart. I'm not saying this is a good movie, I'm saying it's a great movie. It will earn a place in your heart like no other. 10/10 and A heart-warming badge and seal of approval."
    },
    {
      "rating": "1",
      "text": "This is one of the most poorly written movies I have ever seen. That is not hyperbole. I registered for an account to write this, immediately after watching the movie. The first two acts of the movie are quite enjoyable. The plot is formulaic, as others have said, but it has charming performances and is nicely shot. It all falls apart under the complete nonsense of the third act, to the point of (fairly extreme) frustration.Who wrote the third act of this movie? Have they met other people before, or just heard about them? Are they doing well in their lives, or was this a desperate cry for help from someone who has been deprived of human interaction for far too long? Do they have even a passing knowledge of the American judicial system? At the very least have they seen another movie about a court case, or have they only heard about one from a stray radio signal in the isolation pod they've been raised in? How are we, as an audience, supposed to go on with our lives knowing there's another soul out there, somewhere in the vast wild, experiencing such unbelievable anguish?In summary, despite a good performance from the always-great Chris Evans, I now hope Thanos kills Captain America in the next Avengers movie."
    },
    {
      "rating": "6",
      "text": "A man, Frank, goes to court against his mother Evelyn for custody of his 7 year old mathematical genius niece Mary who he has been taking care of her since his sister, her mother, also a mathematical genius, committed suicide six and a half years previously. He wants his niece to have a normal childhood unlike his sister who didn't have a choice except to live up to her mother's expectations! Oh yes, let's not forget his next door neighbor Roberta who is a mother figure for Mary. Let's throw in Mary's teacher Bonnie who discovers Mary's brilliant abilities and Frank's hunky looks. Let's not forget a one-eyed cat named Fred and why not throw in some foster parents? With all this you have to go to court for the 'who will win custody'---DUH!--suspense.Do you hear the violins on the soundtrack? Can you feel/see the director Marc Webb and screenwriter Tom Flynn using all the cliches to manipulate the audience? (Darn it but they fail to explain a throwaway comment about why a professor quit a lucrative job but you will know..)The surprising thing is that this movie works. It will get the laughs out of the audience and in a minute the tears will flow.The only thing missing are those violins on the soundtrack, instead getting some grating sounds here and there plus a pop tune when needed.There is no faulting the acting with Chris Evans as Frank, Jenny Slate as the teacher, Elizabeth Marvel as the school's principal, Lindsay Duncan as Evelyn, Octavia Spencer as the next door neighbor all delivering the cliches as if they are brand new, said and done for the first time. A special well done to Mckenna Grace as the 7 year old Mary, here and there precocious when needed, who delivers with the tears, anger, smiles and mathamatical smarts when called for, whether she understood the problems or not!There is one scene showing a couple of families welcoming a new baby which, though not necessary, add unexpected warmth.Shot mainly in Florida,except for one Boston scene, the film is bright with even the cliche beach, boats and bird scenes looking fresh.This weekend you will either go to the latest \"Fast and Furious\" franchise sequel or \"Gifted\" the touchy-feely 'date' movie. Guess which one I recommend?"
    },
    {
      "rating": "0",
      "text": "I LOVE Chris Evans and Jenny Slate, and was excited to watch this.  It was one of the WORST movies I've seen in a long time.  It was just on the edge of being so bad it's funny.  The dialogue was incredibly awkward, and the music was sooooo terrible it stood out."
    },
    {
      "rating": "7",
      "text": "A Beautiful movie sure to keep you on the edge of your seat,A movie of accepting responsibility, Love, and keeping a Loved one's request, which clashes with another relatives desires to achieve success and Fame."
    },
    {
      "rating": "6",
      "text": "Chris Evans is best known for his action roles, so this movie gives him an opportunity to work a dramatic angle. He plays a single man who's rearing his spirited young niece (Mckenna Grace). She's a math genius, but he's determined to raise her like a regular kid. Meanwhile, the grandmother wants to spirit her away to a life of intellectual pursuit. Grace turns in a lively, charming performance, Olivia Spencer (as the neighbor) once again successfully plays feisty, but Evans just plays it earnest without much depth. The dilemma is presented with sufficient significance, but the trite plotting, bland writing and lack of emotional resonance keep the film from achieving it's potential."
    },
    {
      "rating": "8",
      "text": "In what will sadly be known as one of the year's more unsung gems, \"Gifted\" seamlessly weaves together a gripping ethical dilemma with simple, stick-to-your ribs drama, crowd-pleasing performances, and a healthy, yet far from exploitative dose of human pathos. This film also acts as a fantastic jumping off point for the budding talents of the young McKenna Grace, and as a much needed landing pad for the directorial skills of director Marc Webb. It may not offer a whole lot in terms of innovating the \"child prodigy\" sub-genre, but that is not - in any way, shape, or form - to say this isn't a perfectly inoffensive and enjoyable film in its own, slightly predictable right. Here's hoping Marc Webb steers closer to more grounded, human dramas from now on, because this one is right on the money."
    },
    {
      "rating": "8",
      "text": "Moving and playful story about love and commitment. Surprising good dramatic role of Chris Evans and Lindsay Duncan. Marc Webb once again shows the film in a similar touching atmosphere and I'm surprised that I also liked this film."
    },
    {
      "rating": "8",
      "text": "Despite some moments of predictability and a handful of underdeveloped elements, this delightful, crowd-pleasing family saga otherwise delivers the goods when it comes to hearty laughs and earned heartfelt reactions. The generally crisp, insightful script, coupled with terrific performances by a great cast, make for a winning combination that readily satisfies. Easily one of the better offerings in an otherwise-disappointing 2017 movie season thus far."
    },
    {
      "rating": "8",
      "text": "The creepy real-world resonance here is how Progressives, Cultural Creative Progressives, in the Trump era, may fear being hunted the way young mutants are hunted in this genre.genX-Xmen, hunted mutants on the run.  If you like or can see promise in the genre, this is about as good as a TV pilot could be.  Has the big talent guns:  Bryan Singer, Len Wisemen, Laura Donnaly, Amy Acker (last of my beloved Person of Interest) and a Stan lee cameo."
    },
    {
      "rating": "6",
      "text": "At best, 'Gifted' is overly sentimental, a movie that tugs on the hearts of many movie-goers and features stellar lead performances by Chris Evans and Mckenna Grace. Director Marc Webb ('(500) Days of Summer') tells the story of a freelance boat repairer named Frank (Chris Evans) who ends up going into a legal battle with his mother (Lindsay Duncan) for custody rights for his intelligent niece Mary (Mckenna Grace), who happens to excel at solving complicated maths equations. Upon her first day at school, her teacher Bonnie (Jenny Slate) is impressed at her skill to quickly solve maths problems, but is also dismayed at her attitude towards other people. Mary isn't as sociable with people in her age group, and likes to spend most of her time with adults, since she is able to talk to them about things she finds interesting. I admired this movie enough to get on board emotionally with the characters, it's very well crafted, and at times, it can be emotional. Mckenna Grace has a bright future for someone as young as her, and she and Evans carry this movie effortlessly. The only problem here is that the story is not unique, there are other movies - arguably better ones - out there that tell these stories, and provide them with original twists. This movie pretty much walks down the path you expect it to, as far as writing goes. 'Gifted' is the kind of movie you watch for the characters and the acting, but the story could have used more of an emotional punch, and maybe a more original execution. Other than that, this is a movie not to be missed."
    },
    {
      "rating": "7",
      "text": "Gifted skates by with its good performances (youngster McKenna Grace is a standout) and engaging premise, even if most of its ingredients feel familiar."
    },
    {
      "rating": "7",
      "text": "Gifted doesn't break any molds, and tells a story you've probably already seen a couple (or more) times before, but even with that said, the way it tells it more that makes up with its flaws. The acting is very good, and it presents itself with emotion and passion, and for an emotional story that is the most important part. And best of all is the relationship between our two main characters that is the build block that maintains the whole picture. As noted, it does have flaws, some scenes are clearly pointless and some of the relationships between characters apart from the main two are bland and not very well fleshed, and unfortunately they don't make the \"villain\" if you want to call it that, very relatable, which in the first place it's the issue. The fact that at no point in the film I found myself saying \"Oh, yes I can relate to her, this is clearly a tough situation\" is proof of a failure in the movie's part for presenting a compelling narrative in that aspect. Nevertheless, with good to great acting, good tracks, some laughs, and a great connection with the main characters, Gifted showcases a good emotional subject and a movie that can be clearly enjoyed. Final verdict: 7.5"
    },
    {
      "rating": "10",
      "text": "Gifted is a drama packed and emotional movie. It's really good in so many ways. The performances of Mckenna Grace, Chris Evans, and Octavia Spencer is outstanding. And whoever is reading this, you should watch Gifted. You won't regret it."
    },
    {
      "rating": "8",
      "text": "Critics who complain \"Gifted\" is formulaic and predictable fail to take into account that typical movie audience members see far fewer films than they do and therefore are not quite so easily bored.  The movie is engaging and compelling: it is primarily a drama, but it incorporates occasional humor.  The actors, especially the young Mckenna Grace, perform their roles very believably.  The sometimes intrusive and inexplicable use of songs in the soundtrack seems contrived, and the story takes a couple of improbable twists and turns.  I nevertheless felt invested in the characters and I enjoyed \"Gifted\" immensely."
    },
    {
      "rating": "5",
      "text": "What was the purpose of this movie? There are better examples of films that display gifted people such as Matilda, Hidden Figures etc. The acting and lines were a big \"meh\". A good movie to see with your mama just as I did..."
    },
    {
      "rating": "6",
      "text": "Film with a predictable plot, you know what will happen, although the way you tell it will not prevent you from letting go of a tear. The performances are weak, the only redeemable is the small actress McKenna Grace, who will surely surprise us in the future."
    },
    {
      "rating": "10",
      "text": "Loved it! I really enjoyed this show...I hope it stays on! The story line was awesome and I love the take on meta human. Love Xmen so this show is right up my alley."
    },
    {
      "rating": "8",
      "text": "I thought the actress who plays Mary Adler - the main character (McKenna Grace), did a good job. She certainly seemed quite intelligent/inquisitive and assertive. I was pleased to see Octavia Spencer also present in this film, as a neighbour who enjoys having Mary around at times - I'm a big fan of Octavia as an actress in general. The story was interesting - having seen other films about child prodigies, I empathised with the man, Frank (played by Chris Evans), who has his niece's welfare at heart. I've heard and seen enough stories about child prodigies to know it isn't always in the childs best interests to try to nurture extraordinary knowledge, to put it one way. I won't say any more so as not to provide spoilers but I did find this to be a somewhat emotive film and thus an engrossing and decent watch overall. There are some moments which some may write off as a bit too sappy, cheesy at worst but in this sort of a film, I'd say their almost mandatory and it wasn't unnecessarily maudline in a ludicrously over the top way as such. Its a thoughtful film with some good performances and I appreciated it and would recommend it to others, just be aware that there is a fair bit of jerky camerawork, which isn't great but that and the sappy moments aside, this is a really quite solid film with good performances."
    },
    {
      "rating": "10",
      "text": "It's my favorite movie ❤️❤️❤️❤️❤️. I'd watching it a million times"
    },
    {
      "rating": "9",
      "text": "Awesome variants character development. Powerful words to use. Lots of variables story"
    },
    {
      "rating": "10",
      "text": "This film made a strong impression on me. I cried watching this movie, although I cry very rarely. The film has strengths and weaknesses, frankly the plot is simple, but the atmosphere it creates is beyond words."
    },
    {
      "rating": "10",
      "text": "It's amazing to me how Mark Webb handles stories with conflict, the way each emotion can be displayed and easy for the audience to interpret. For other directions, maybe Evelyn would be cast away as the evil mother, who wanted to lock her granddaughter away, Disney style. But Webb is able to capture her life's story, evoking sympathy, in just a few scenes. Another part that is great about this movie are the relationships. It's hard to think of a set of characters that don't have their relationships unpacked to a certain degree, and that makes it so much more encapsulating, raw, and emotional. Not to mention stunning performances from McKenna Grace and Chris Evans, this movie is undoubtedly a 10/10."
    },
    {
      "rating": "10",
      "text": "This is one of my favourite movies and I just love this movie. The young star McKenna Grace play this role to perfection"
    }
  ]
}