{"id": 4623, "title": "Ginger Snaps", "starring": ["Katharine Isabelle", "Emily Perkins"], "runtime": 108, "genre": ["Horror"], "description": "The story of two outcast sisters, Ginger and Brigitte, in the mindless suburban town of Bailey Downs. On the night of Ginger's first period, she is savagely attacked by a wild creature. Ginger's wounds miraculously heal but something is not quite right. Now Brigitte must save her sister and save herself.", "releaseYear": "2000", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/ozohDiJd7Oi65NEf8B0ya7lR9Fr.jpg", "categories": {"plot": 8.142857142857142, "acting": 8.5, "ending": 10.0, "soundtrack": 5.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 10.0, "action": 7.0}, "reviews": [{"rating": "10", "text": "I absolutley love this film. It's truly a classic with it's dark comedy, smart writing, and great acting. It's comparison between lycanthropism and puberty is unique. One of my favorite films. Buy it now."}, {"rating": "10", "text": "This movie is a great dark comedy horror that is one of my all time favorites, including the sequels (Ginger Snaps Back & Ginger Snaps: The Beginning) although they are no where near as good as the first film. But like so many other B &/or independent movies Ginger Snaps is not very well known nor is it given the credit it deserves.  If you grew up an outcast or love anything morbid then you will fall in love with teenage twins Bridget & Ginger & their gothy twisted sense of being. If you've ever wanted to hit a snobby bully with a field hockey stick or think that different ways to commit suicide are interesting then this is a must see. If not or if you are that snobby bully then I still recommend you see this film. It's one werewolf movie that doesn't disappoint!"}, {"rating": "7", "text": "It was not a ground breaking movie, nor a bad movie by any stretch. A lot of reviews (especially at IMDB) overthink the plot (like this was some deep scifi flick) and state that its yet another tweeny horror movie... it is not a teen horror flick. There is no retarded teenage love story in this movie nor any nudity nor a bunch of topless guys. There are no cheap gimmics in this movie designed to draw teens. It is a straight forward horror drama about two sisters and how they try to cope with one turning to a werewolf. The quality of the film is definitely limited; this was not a big budget flick but at the same, the low budget and lack of CGI really give it a very natural eerie feel similar to how old horror movies used to be. The only exception is the werewolf itself which looks pretty 80s (in a bad way) but was not really in the movie for very long any way and the movie is not really about cheap scares anyway. I always felt like older horror movies were much more convincing due to narrower camera perspectives (smaller resolutions and angles) and use of imagination (making people think) over CGI and special effects. Todays average horror flick is very bad (more like garbage) and has mostly devolved to formulaic snore fests requiring over the top violence and gore (a la Saw or Hostel) and/or cheap surprise scares which stop working once a person gets older. This was a nice change of pace and I plan to watch the next two movies."}, {"rating": "10", "text": "What a movie, its great."}, {"rating": "10", "text": "One of the best Canadian films I have seen - One of my favorite movies of all time!"}, {"rating": "10", "text": "Amazing! One of my favorite movies!"}, {"rating": "9", "text": "The whole movie is awesome, from the scenery and the community the whole story is put in, to the monstrously gory practical effects. The ending, though, along with the musical score, brought tears to my eyes. Brutally, unabashedly melancholic. The Canadian answer to \"Donnie Darko\"."}, {"rating": "10", "text": "This is my 2nd favorite movie of all time and the best werewolf movie. This movie should not even get ONE bad or mixed review this deserves a 10/10 for sure."}, {"rating": "10", "text": "At first you might think it is a funny teenie horror comedy, that is true.\rBut in the end might  pass the laugh. The movie will be bloody, creepy and sad!"}, {"rating": "10", "text": "This is so good!"}, {"rating": "10", "text": "My favorite character is Brigitte Fitzgerald. I really love the ginger snaps movies. It's the coolest movie i've ever seen."}, {"rating": "10", "text": "Liked it very much.....excellent movie."}, {"rating": "10", "text": "Very good!"}, {"rating": "10", "text": "Impressive!"}, {"rating": "7", "text": "The story was interesting, the movie had plenty of gore and great action scenes and the practical effects were well made. Unfortunately, the acting was pretty bad and the movie was kind of boring, It's not a bad movie, it's just overrated."}, {"rating": "10", "text": "This film is just a classic, interesting characters and questionable fashion..what more could you want! The more you watch it the more things you notice too..\rGive it a watch!"}], "recommendations": ["the_cabin_in_the_woods", "cursed", "the_possession", "wrong_turn", "drag_me_to_hell", "cabin_fever", "saw", "the_babysitter", "underworld_evolution", "malignant", "annabelle", "dead_silence", "the_wolfman", "friday_the_13th", "see_no_evil", "the_eye", "the_return_of_the_living_dead", "hostel", "the_hills_have_eyes", "wish_upon", "the_texas_chain_saw_massacre", "scream", "the_babysitter_killer_queen", "dark_skies", "it_follows"]}