{
  "id": 2297,
  "title": "Girls Trip",
  "starring": [
    "Regina Hall",
    "Queen Latifah"
  ],
  "runtime": 122,
  "genre": [
    "Comedy"
  ],
  "description": "Four girlfriends take a trip to New Orleans for an annual festival and, along the way, rediscover their wild sides and strengthen the bonds of sisterhood.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fM1h8CwtdileV3zlemXx7UWJjOP.jpg",
  "categories": {
    "plot": 3.4444444444444446,
    "acting": 4.5,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 1.0,
    "familyFriendly": 3.0,
    "funny": 6.071428571428571,
    "action": 2.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The latest film in the women-gone-wild trend features 4 college friends (Regina Hall, Queen Latifah, Jada Pinkett Smith, Tiffany Haddish) who travel to New Orleans for a weekend full of raunchy fun. There's lots of crude language and coarse insults with Haddish riotously leading the charge. As expected, they push the limits of outrageousness with exposed body parts and bodily functions. Meanwhile, the inevitable emotional moments (which drag down the final 30 minutes) revolve around female empowerment, friendship and loyalty. While there's nothing especially original here, director Malcolm D. Lee is skilled at the high-energy pace and raucous attitude that appeals to his audiences."
    },
    {
      "rating": "2",
      "text": "somebody please write a comedy that stars black women proving that humor and sexuality can be intelligent, subtle,and classy instead of crass. Material that does not impose breast baring, ass twerking and dick-sucking images on the female characters. In the deepest recesses of the movie making industry's mind, the black female is often typecast as an oversexed 'ho' prowling the streets for men or an insanely irrational, angry and combative female. this movie perpetuates both stereotypes.sure, I'm black, female and glad that the movie stars four black women in their own comedy genre based on the raunchy night or week-end out-just like white men or women.Great. But the next step/challenge is to create believable black female characters who move and connect with the audience without needing to commit vulgar acts on fruit.  After more than two hours of this crude movie, i wished to delete my 'recent history' but there was no delete button in my brain."
    },
    {
      "rating": "1",
      "text": "Great cast totally wasted on vulgar and dull movie. I am halfway through and won't force myself to watch the rest of it.  I honestly don't understand the high Metascore; this isn't somehow subverting \"frat boys gone wild\" movies -- it IS a frat boy movie, only with black women.  1 point for a bit of dramatic flair, no points for humour, which ranged all the way from dim to gross.  Disappointing, considering the collective talent in the cast."
    },
    {
      "rating": "1",
      "text": "This flick was a huge waste of talent. This group of talented actors gamely go through the motions of trying to give their characters some heart, but all the while they are wallowing in a ridiculous pool of muck. \"Gross out comedy\" can be done well, but here it is not so. As a white viewer, I have to admit that I don't know how four black women interact amongst themselves, but I am quite certain there are not four women of any color who would ever come close to this level of constant and purely gross, demeaning stupidity. F-bombs? Sure, we got truckloads. Wet, noisy oral sex simulated with fruit at a breakfast table? Check. Worshipping big dicks? Yep. Talking about asses and what comes in or out of them? Incessantly. A woman hanging on a wire above a crowd of people and accidentally urinating on them? Sadly, yes. And that was so fun, we also get a SECOND woman hanging on a wire above a crowd of people urinating on them, this time intentionally. It seemed the only thing missing was for these characters to literally throw poo at each other. I seriously suspect they have saved that scene for the director's cut."
    },
    {
      "rating": "2",
      "text": "Tired and cliche ridden this sad effort breaks no new ground in the 'good girl/bad girl' gone wild genre.  It has a better cast than it deserves and the New Orleans setting is NOT but to the good use that it should be."
    },
    {
      "rating": "2",
      "text": "I really wanted to like this movie, with all the noise it generated and good reviews, but I actually found it not funny, the situations are exaggerated, they don't feel natural like in for example Bridesmaids."
    },
    {
      "rating": "0",
      "text": "An abominable, deplorable, brain-dead, slapstick disgrace. If your IQ is in the 80's or lower, you're gonna love it. 90 upwards and you're likely to commit suicide by the time you even finished watching the trailer."
    },
    {
      "rating": "0",
      "text": "HORRIBLE LADIES AND GENTLEMEN-DO NOT WASTE YOUR TIME AND ESPECIALLY MONEY!!!!!!!!! WOULD VOTE NEGATIVE 10 IF WE COULD. Yet another horrible ridiculously bad vulgar girls gone bad movie depicting all of us woman as brain dead desperate vulgar whores not to mention a totally gratuitous depiction of the homeless as diturbed, mindless sexual deviates, for absolutely no reason. Terrible rehashed script peppered with the N word and other vulgarities and constant dick references as if it were written by a 10 year old boy FOR another 10 year old boy. My friend's and I (all woman, 4 white, 3 African American from 22-32 years old) demanded a refund after this fiasco and management actually happily provided one for all of us saying it wasn't the first time. HORRIBLE LADIES AND GENTLEMEN. DO NOT WASTE YOUR TIME OR MONEY"
    },
    {
      "rating": "3",
      "text": "I think it gets such good scores only because black people and women. Seriously it's the same like all **** nowaday comedies. Don't know whats the difference between this and Rough Night. Both movies are filled with ugly flat jokes and horrible story. I don't like todays reviewers, don't be political, we want real reviews not fake one."
    },
    {
      "rating": "5",
      "text": "Comedy films should know where they should be going whenever it comes to laughter. Unfortunately, Girls Trip is little to hardly any laughs whatsoever, but it's still watchable regardless of the absent of laughs. Also please keep in mind that Girls Trip also is very sensitive to viewers that are not expecting to laugh at comedy films so it makes it fair to give it the score it deserves."
    },
    {
      "rating": "7",
      "text": "With no expectations going in, I had a real fun time with Girls Trip. Most of the comedy hits and there are a few hysterical moments here. All of the ladies are good but to me Tiffany Haddish was the stand out.  She provided most of the best scenes of comedy. This is just an overall good time and definitely worth a watch. B+"
    },
    {
      "rating": "3",
      "text": "Im annoyed that this is the movie I chose to go see. I feel like my IQ was just lowered. I loved the cast and the overall story, but the humor was stupid, raunchy, gross bathroom humor that I personally don't care for. Maybe when I was 18. I will say that most of the rest of the theatre was laughing hysterically, so I guess its just me. I would love to see the same movie again with more intelligent humor."
    },
    {
      "rating": "8",
      "text": "“Girls Trip” is rated R, justifiably, for “crude and sexual content throughout, pervasive language, brief graphic nudity and drug material”. After 30 minutes, watching that women can be as stupid, crass and vulgar as men, I was ready to walk BUT I am so glad I didn’t!There is one of the funniest scenes I have seen in a comedy in decades and without giving too much away it involves Tiffany Haddish (as Dina,) half a grapefruit with the end cut off and a hole in the middle plus a banana! Yes it is crude, sort of adds to a stereotype about Black men but Haddish will be remembered for years just as the scene in “There’s Something About Mary” with Cameron Diaz and ‘hair gel’.On the other hand there is a urination scene that puts any men have done on film to shame and debases the women and then repeat it even though it is so fake.The main thing going for “Girls Trip” is the feeling you get that the 4 leads; Haddish, Regina Hall (Ryan), Queen Latifah (Sasha) and Jada Pinkett Smith (Lisa) have truly been friends since high school and all have problems to be dealt with which they eventually do. Regarding the latter there is a touching scene that eventually got the Black women in the audience to cheer, shout at the screen and laugh.For each woman there is a man with the pairing of Lisa and Malik (Kofi Siriboe) with the latter, unknowingly, responsible for the grapefruit scene and demonstrating it, against his will, in a later scene while very successful Ryan is married to very successful hunky looking guy, Stewart, (Mike Colter) though Sasha’s ‘man’ happens to be a lamp---sorry, you will have to see it—while Dina will go after any male who is breathing! Julian (Larenz Tate) is a guy who has been friends with the women since childhood and, obviously, is in love with Ryan.While there are many cameos including Common, Sean Combs, Mike Epps among them, both Deborah Ayorinde as the fierce ‘other woman’ and Kate Walsh, as a stereotyped White woman, stand out.Yes the ladies get drunk, take a ‘trip’ on 200-year-old absinthe, do and say absurd, ‘dirty’ things, have a dance-off concentrating on the booties and breasts but you just know the actresses are having fun showing actors how to do it!I must add having a large group of Black women in the audience added to enjoying the movie though I must add I observed a Black man with his wife(?) was not enjoying himself one bit!I would say you could miss the first 30 minutes of this 2 hour and 2 minute movie but I don’t remember at what point the grapefruit scene takes place and you shouldn’t miss that scene as crude and gross as it may be.“Girls Trip” is a movie to relax, laugh, enjoy and watch how women can be there for each other unlike men."
    },
    {
      "rating": "10",
      "text": "A delight beginning to end. The best studio comedy since Bridesmaids with just as much heart and just as many laughs. Tiffany Haddish scores huge and nearly runs away with the movie a la Melissa McCarthy, but the talented actresses all have their times to shine. A seriously good time with just enough true feeling to make it not all feel too slapstick. It's a case of the perfect cast coming together for maximum enjoyability."
    },
    {
      "rating": "7",
      "text": "Overlong but worth it for Tiffany Haddish and the women's hysterical absinthe-laced night out. One critic said it \"feels like the first of its kind: a raunchy, endlessly entertaining comedy written by and starring black women.\" They're right and there needs to be more like Girls Trip."
    },
    {
      "rating": "10",
      "text": "Its an 8 but im giving it a 10 just to upset the right wing sjw's. HAHAHHAHAHAHAHHAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA"
    },
    {
      "rating": "7",
      "text": "Just feels more natural R Rated than Girls' Night out. Could have been even better but the long runtime and the unnecessary romantic/drama elements held it back"
    },
    {
      "rating": "10",
      "text": "I don't know why I hesitated to watch this movie.. I love the (vulgar) humor in it, I really do laughed my butt off! At the beginning of the movie it started a little slow for me, but if you can get through that it will be an amazing movie for a fun evening. Also with a message in it. This is my kind of humor and they did a very good job on it I very much enjoyed it! 10/10 I can guess it's not for everyone enjoyable, but I liked it."
    },
    {
      "rating": "6",
      "text": "Although there are some laughs and originality involved, overall Girls Trip is loud, overstuffed and not as enjoyable as critics make it out to be."
    },
    {
      "rating": "5",
      "text": "Hilarious in parts, this is a film which has a number of very memorable moments interspersed with some very slow exposition and a storyline that is functional but mildly irritating. The pacing is too slow, and at two hours, this is a film which needed to be much sharper than it was. The laughs are fairly constant, and a few scenes had the entire cinema in fits of uncontrollable glee, but sadly there is nothing much more to recommend this. The performances are solid, but the commentary is painfully obvious, as is the sponsorship. A film to enjoy with your choice of poison at home with friends, but not a cinema recommendation. 4.89/10"
    },
    {
      "rating": "8",
      "text": "I love comedies. I really do, but they hardly ever live up to my expectations. A decent comedy for me is one that makes me snort or \"blow air\" threw my nose. I don't find my self laughing out loud a ton while watching comedies. So when I do find myself laughing out loud, and laughing out loud often...I know I'm watching an excellent comedy. And that's what Girls Trip was. This may be a female led film that is primarily aimed towards females, but it was just damn funny. The jokes are over-the-top and they don't hold back. They get pretty dirty, and that is what I loved the most about this film. It was simply a pleasure to watch this with a couple of friends and laugh together. Even if you're a dude, I'd give this one a watch. You'll laugh way more than you think you will."
    },
    {
      "rating": "6",
      "text": "This is an amusing and entertaining watch, although it is decidedly cliched and features some quite lewd/brash humour and behaviour. Its a pretty basic watch I suppose but of course that means its an easy watch. I don't necessarily like particularly films with very extroverted groups of women, or ones with loads of sexual jokes and the like in them but I thought this one was ok. I did laugh at times - not all the time but now and then and I enjoyed some scenes due to the plot line, the scenarios the girls found themselves in, while unlikely, they were sometimes fun to watch. This felt to me more like a film length TV show than an outright feature film as such but for what it is, its not too bad. Its not exactly a greatly memorable film but its ok."
    },
    {
      "rating": "3",
      "text": "Girls Trip is one of the most overhyped, overrated films of all time, the praise  Tiffany Haddish received from critics wasn't warranted, some of the scenes felt like a ripoff of Jackass/The Hangover, specifically the scene where Jada Pinkett's character is entangled on a rope and let's loose a large amount of urine on a crowd. This film should have been nominated for worst screenplay, worst supporting actress(Tiffany Haddish) and worst picture at The Razzies."
    },
    {
      "rating": "7",
      "text": "I found the movie quite entertaining; mostly because of Tiffany Haddish. Her vulgar antics were often over the top, and the other cast tried to keep up.The story itself is nothing special; but is a refreshing take on the \"boys out on the town going wild\"-genre that we have seen so often.There are a few vulgar moments that could have been excluded, and I didn't really understand the festival they all gathered for, but I watched to the end, and that is something I can't say I do with every movie I see."
    }
  ]
}