{
  "id": 797,
  "title": "Glass",
  "starring": [
    "James McAvoy",
    "Bruce Willis"
  ],
  "runtime": 129,
  "genre": [
    "Thriller",
    "Drama",
    "Science Fiction"
  ],
  "description": "In a series of escalating encounters, former security guard David Dunn uses his supernatural abilities to track Kevin Wendell Crumb, a disturbed man who has twenty-four personalities. Meanwhile, the shadowy presence of Elijah Price emerges as an orchestrator who holds secrets critical to both men.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/svIDTNUoajS8dLEo7EosxvyAsgJ.jpg",
  "categories": {
    "plot": 7.612244897959184,
    "acting": 7.612244897959184,
    "ending": 7.26530612244898,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 8.384615384615385
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I usually find that critical consensus is spot on, but in this case I wonder if we saw the same movie. Far from perfect (with action that's a bit clunky) but very entertaining and a completely worthy capper to Shyamalan's superhero trilogy. I honestly wonder if a lot of critics went in expecting an ACTUAL superhero film rather than one that is quite literally about examining what it might look like if supernatural beings were really among us. My advice, go see it but keep in mind that it had a budget of $20 million (no, I didn't accidentally leave off a zero) and think about the ways it subverts the genre while still being a part of it. A solid, clever film."
    },
    {
      "rating": "9",
      "text": "It is completely incomprehensible to me how critics could rate a film at such a low ball.All elements of the film (plot, play of actors, rezhisura) are made very high quality. And, even with a biased or subjective opinion, I would never not put the film below 6 out of 10."
    },
    {
      "rating": "10",
      "text": "Critics are complete idiots more often than they believe they aren't and this movie is no exception. If you enjoyed Unbreakable and Split then this movie will certainly not disappoint as the plot is just what it needs to be. Without giving anything away, this isn't a standard 'let me just blow things up and fight aliens' movie as it is far more grounded than that. What this movie is in fact representative of is the complicated struggle between what is the 'good' and what is the 'evil' as well as what is the 'crazy' and what isn't the 'insane'. What you should expect from this movie is a riveting balance of suspense, drama, various plot twist that are actually really good, more action scenes than Unbreakable or Split, and an incredibly well-casted cast of talent. I made an account just to review this film because the critics completely missed the cinematic mark on this one, well the ones that rated it anywhere in the yellow or red - they can go kick big rocks."
    },
    {
      "rating": "0",
      "text": "What???? We were waiting for This 19 years? $20 milion budjet??? А теперь нормальным языком. Единственный Адекват это Брюс, которому нужно было и двух злодеев и бабу эту дуру из за которых погибло опять много людей включая злодеев, остановить но это не случилась, вместо хеппи энда - трешь.  Баба еще хуже злодеев, она здесь главный злодей. Лишив жизни единственного героя данного фильма (и еще кучи людей) , она осталась не наказанной.  Тупость концовки зашкаливает. Как раз из за такого фильма не кто не пойдет геройствовать и спасать чью то жизнь, потому что его утопит коп или кто он там в луже воды."
    },
    {
      "rating": "7",
      "text": "Even though its not quite the spectacular finale people were hoping for, Glass still delivers an entertaining and quite satisfying end to the, unbreakable trilogy."
    },
    {
      "rating": "0",
      "text": "Jackson is disappointingly absent for most of the film. Pacing is a massive issue, I feel like the story never picks up and stays flat throughout. And that ending...my god. What a terrible ending, Arguably the worst ending I've ever seen. It took what was already a bad movie and made it an utter disaster."
    },
    {
      "rating": "0",
      "text": "Это просто отвратительное зрелище, не советую никому, это просто пиздец..."
    },
    {
      "rating": "10",
      "text": "An incredible film and end to the trilogy, thanks M. Night.   I liked the ending.   Don't understand the critic hate, maybe because he self-funded this?"
    },
    {
      "rating": "8",
      "text": "This movie is NOT 33%.  Its not a D, or C movie - its a bold, different, and enjoyable super hero movie, and that's what people are faulting it for - that it's not a \"Avengers\" or \"Spiderman\".  It's certainly not perfect - and I'd admit I wanted it to be a traditional super hero movie going in and was initially dissapointed that it wasn't - but its still a good, enjoyable movie (with flaws). Too many people are expecting a traditional super hero movie with this movie but forgetting this was never a traditional super hero franchise.  Unbreakable and Split are unconventional, quirky, slow movies. Also important is that this director does not make traditional super hero movies.  He makes movies that defy audience expectations. This movie definitely does that, and that's its strength.  The third finale to the trilogy is different, its bold, and it goes against the expectations of your traditional super hero movie, and ends the trilogy in a way that is consistent with what we are familiar with in the director's previous movies (including those in the trilogy). I applauded this movie for finding a different way to do a superhero movie, and think this is one  of the \"good\" M. Night movies, and would watch it again.  A worthy part of the trilogy, even if I don't agree with all the choices in this movie."
    },
    {
      "rating": "8",
      "text": "A really nice ending for that trilogy. The acting was amazing. The story was solid, in the sens that it tied everything and it stayed true to a certain level of realism. I think there was a long moment in the middle that was divided of action, and maybe some actions scenes are weaker then some others. It was also a psychology film in many ways. It was disturbing, captivating. The ending was very satisfying. Night Shyamalan controlled it's craft here without going overboard. I give it a 80%."
    },
    {
      "rating": "9",
      "text": "This is a gritty down to earth portrayal of the superhero genre. I heard so much a about the final act being a issue in reviews. Nope I was fine with the outcome of the last act and the ending. It left me a sense of hope and wonderment. Glass was a class act and not a Superhero film for the kiddies. Looking at the overall rating of both critique and user reviews? Well this film looked like it developed into niche experience."
    },
    {
      "rating": "8",
      "text": "It was a good movie. Not a great movie, definitely not like Unbreakable, but a good movie that follows the premise of the last two films in the series. Seriously, it was good. Most negative reviews just don't get the importance or power of the superhero genre's deconstruction. Superhero origin films can't all be the same formula, with the same tropes. In my opinion, this film is better than most hero and antihero films out there right now, at least it portrays heroes in an almost realistic world (I repeat, almost realistic)."
    },
    {
      "rating": "9",
      "text": "Excelentes personajes, actuaciones impecables, trama y argumento muy solido y con buen cierre. sin duda de las mejores peliculas de lo que va el año 2019, esperemos Jocker tambien cumpla a estas alturas."
    },
    {
      "rating": "8",
      "text": "An Interesting take on the Superhero topic. The movie isn't by any means perfect it still has some flaws like the ending and the character arc from David Dunn. Still the movies raises some interesting Question about Heroism and having Superpowers in an modern and realistic Time like our World. About the ending (no Spoilers)..... yeah i didn't liked it but after all it isn't a Marvel Movie =). So i kind of understand why this Film ended this way. Its an gritty down to Earth superhero movie. Even having superpowers these people are still human beings and things....Just Happen, even when you don't like it it still can happen. As someone who loves Reading Comics i found fast an connection with the Story, its was like a Love Letter to Comics and it influence to the Real world. This is a Film were i Think \"This is what the Superhero genre needed\". I personally find \"Glass\" really Great, and I cannot understand the Mixed Reviews."
    },
    {
      "rating": "7",
      "text": "A good movie with a descent twist..... A usual M Night shyamalan movie. Must follow previous movies of the series (split,unbreakable)."
    },
    {
      "rating": "7",
      "text": "Glass is directed and written by M. Night Shyamalan, with a simple role as we saw him in Unbreakable and Split. Starring James McAvoy, Bruce Willis, Samuel L. Jackson, Anya Taylor-Joy and Sarah Paulson.Bruce Willis returns as David Dunn as does Samuel L. Jackson as Elijah Price, known also by his pseudonym Mr. Glass. Joining from Split are James McAvoy, reprising his role as Kevin Wendell Crumb and the multiple identities who reside within, and Anya Taylor-Joy as Casey Cooke, the only captive to survive an encounter with The Beast. Following the conclusion of Split, Glass finds Dunn pursuing Crumb's superhuman figure of The Beast in a series of escalating encounters, while the shadowy presence of Price emerges as an orchestrator who holds secrets critical to both men.Glass was one of my anticipating movies list since I watched Split and surprisingly reveal that it's a sequel to the 2000's Unbreakable, which I liked. So yeah, I was very excited to see these three characters gathering together in one movie.. sadly it's the last movie of that trilogy.. and we will get to that ending in the spoiler review. But for now, let's do the spoiler-free review!Okay, as the title says \"Underrated, but disappointing\" the movie is underrated, but let me say that it's not, because not everyone is gonna like this movie.. yeah, maybe underrated, but still disappointing. The first act of this movie was pretty cool, I loved it, the third act also is pretty, no no.. the final fight, because it was pretty epic I enjoyed it very much.. the conclusion and the ending were a little bit messy, the twist was cool, but the \"character\" wasn't that convincing, and I felt like it's not how this character should've been, because it reminded me with Unbreakable, and how it was rushed, Glass is giving us a little more surprising one, but not well crafted.The second act is my biggest flaw with this movie, it was super slow, and confusing.. like how Glass is getting out of his cage? How is he just getting in any room he wants with no keys? Also it's not what you wanted to see from these characters, especially Anya Taylor-Joy, I loved her in Split, but in this one.. she's just there. I mean Spencer Treat Clark had a better role in this movie. Sarah Paulson is also bad, I didn't like her character which was \"You're not that, you're that!\", even her performance was emotionless and in the second act she was just there to go to a room from a room to say and to give us info we already know or ones that we don't care about! So yeah, the second act was new for this trilogy,but still it lacks a lot!James McAvoy is pretty good in this movie just as he was in Split, once more he's the best thing in the movie but I have a flaw with it, which is a spoiler so, I'm gonna talk about it in the spoiler review... Bruce Willis is very good as well, but I have the same flaw which I found with James McAvoy's character, but even more! Samuel L. Jackson is not there most of the movie, but once he's there, he gave the movie a good spirit!! He has also one of the best scenes in the whole trilogy, as we saw in the trailer, when he was moving with his wheelchair and the beast the killing some people behind him, that was pretty cool!Glass disappointed me, but still it's a fresh movie and I'm gonna give it a positive review, don't get me wrong, but I like Split more, but in the mean while, I liked it a little bit more than Unbreakable. I'm gonna give Glass a B!Thank you, guys as always for reading my review, look forward for my spoiler review, and if you liked it, you can click on my name up above and read my other reviews."
    },
    {
      "rating": "10",
      "text": "Absolutely fabulous movie filled with compelling performances and characters you genuinely care about. Contrary to everyone else the third act reveal really was unexpected and awesome for me and took the story in an interesting new direction. While everyone was fantastic in their respective roles James McAvoy and Samuel L Jackson were the clear standouts. I suggest everyone give this a shot if you are willing to have an open mind and are okay with the movie going in directions you wouldn't expect. This is Shyamalan's film after all and I was thoroughly entertained and genuinely moved by it from beginning to end. Congratulations to everyone involved in closing out this unique trilogy in just as introspective and quietly compelling manner as those films that came before it."
    },
    {
      "rating": "7",
      "text": "NO SPOILER TIME Glass is the final movie to M. Night Shyamalan's trilogy that started with Unbreakable in 2000 and I have to say I really enjoyed this movie. The plot and story telling was pretty good but the way it is presented inst the best, Its better for a movie to let people figure things out. and how the movie is told is very similar to how Unbreakable was which was pretty good. there is minor things in this movie that all adds up and can annoy you, well at least it did to me as far as camera angles, editing, and writing. the performances was great especially Samuel Jackson and James Mcavoy, Bruce Willis could've done better and I mean a lot better but he wasn't given much to do. Some character were defiantly not needed even towards the end because it'll show why they are not needed. toward the end/ third act things kinda took a weird end that some people will not expect and might be disappointing. The structure of the movie was a little unbalanced and which is why I say Bruce could've done more. Towards the end also He quote on quote \"Shyamalaned\" it but He still has a lot to learn and improve on for himself and I praise this man for his hard works. go see it if you love the previous moviesSPOLIER TIME YOU HAVE BEEN WARNEDGlass is the final movie to M. Night Shyamalan's trilogy that started with Unbreakable in 2000 and I have to say I really enjoyed this movie. The plot takes places fairly close after the events of Split from what I can remember from the movie, and from how it is laid out it was also really good but I wish the directing would have left a lot of the surprises for the audience to figure out and theorize about instead of it being told to us about what happened. the pace of the story telling was fairy close to unbreakable's pace, a nice slow burn. I really wanted the movie to expand to more than just the asylum and a few other minor locations. We never ended up going to tallest building made and that would've been sweet to see but we were just teased. The theme of the movie fitted everything in a nice way but not much was done for to make it a thriller, Split was a thriller movie and that felt like one but this one was great on the theme of sci-fi and drama with action mixed in. The art was pretty good and seeing Mr. Glass new suit looked fresh and everyone had their classical outfits that made it a charm to watch and not much other stuff to say about the art. Cinematography was interesting, new and sometimes plain annoyingly not wise, the angles that looks like it takes a lot of time to do was fine but there was so many extremely close up shots and awkward angles, but it wasn't too annoying to the movie because the cuts were about evenly good nothing to go off on. Same goes with the editing, it was interesting and wasn't anything annoying. The fonts at the start of the movie kinda got in the way but it was a style choice I'm assuming. Acting was about 50/50. I loved Samuel L. Jackson as well as James Mcavoy, and they did a great job. As far as Bruce Willis I wanted him to do more in this movie because I felt as though he was pushed to the side a lot and he could've given a better performance I know he could've. and more could've been better from pretty much all supporting casts. Anya Taylor-Joy in my opinion had no reason to be in this movie and served no purpose in my opinion. Spencer Treat Clark also did a great job too, almost perfect too. the writing of this movie was pretty good, there was a lot of things that could've been done smarter. Kevin could've wrapped a pillow around his head, Mr. G didn't have to do this suicide mission, and my goodness the ending of this movie was not satisfying, everything before the main characters death was great and enjoyable and I find it disrespectful to the fans of these characters and the way they went out and it was all in silly ridiculous ways and the people who saw it will most likely agree. Music was good too and every piece fitted every scene just fine. as far as originality it fine and I really do see this as an origin story to maybe M. Knight's next series of films, possibly. The secret organization wasn't really needed but we have it and it sets up a few questions. It kinda doesn't make since this organization didn't go to David's house when they heard a man survived a train crash so these people were forced in. Overall This movie was good and enjoyable and if acting was done a tad bit better it would've been even more better. The ending sets up a possibility for more superhero like moves from M. knight but we will just have to wait and see. There is a lot of small things M. knight needs to work on from here on and I applaud him for sticking with this movie and finishing it. He is truly a good man and has a passion for movies like very few others. Please see Unbreakable and Split before this movie and after those two. If I were to grade this movie it would get a 86 percent, but for reviewing over all it gets a 7 out of 10"
    },
    {
      "rating": "7",
      "text": "This movie is legitimately a 8.5-9.0 until the last 20-30 minutes of the movie. This makes the outcome even more disappointing. M. Night does what he does best and overplays his hand with an awful twist and no grounding to be seen."
    },
    {
      "rating": "8",
      "text": "This script could've been better along with the conclusion, M. Night seems to be getting his groove back."
    },
    {
      "rating": "9",
      "text": "A compelling psychological thriller starring Samuel L. Jackson, Bruce Willis, and James McAvoy. Shyamalan is back. You see the returning of his greatness in multiple scenes of this movie, as well as another refreshing take on the superhero genre. We also get very good performances from everyone."
    },
    {
      "rating": "10",
      "text": "Solo ignoraré las críticas, la película me ha encantado y es lo que más importa."
    },
    {
      "rating": "8",
      "text": "------------------------------------------------------------------------------------------------------gud"
    },
    {
      "rating": "7",
      "text": "After many years M Night Shyamalan finishes a trilogy that many of us never knew we wanted until Split came out a couple years ago. Though the first two acts are extremely slow, he climax and conclusion of the film leave you wondering and will likely split many audiences. Personally I find the twists that the director throws in at the end to be thought-provoking and interesting. all of us could likely think of an infinite number of scenarios in endings that may have suited this story better, but this one really isn't all that bad. This is is one I would definitely want to see again to see if knowledge of where the story goes affects how one might view the rest of the film. B-"
    },
    {
      "rating": "9",
      "text": "Just dont listen to the critics, if you loved Unbreakable and Split u will like this one."
    },
    {
      "rating": "9",
      "text": "One of the biggest underlying themes in the previous two entries of Shyamalan's surprise trilogy is that the potential for extraordinary powers rests inside all of us and that our minds are the key to unlocking them. This message is brought to the forefront for this closing chapter acting as the heart of the story. The real villain in Glass isn't the beast inside McAvoy or even the returning titular anti-hero. It's the people who try to explain away the incredible in order to keep us locked away in a prison of the mundane.In a time where we have been trained to want/expect big flash and spectacle from our superhero movies, Shyamalan stays true to the world he created some 19 years ago. This is means that even when it looks like things are about to take a turn for the grandiose, Glass sticks to its guns by remaining grounded and small-scale throughout. It's a nice change of pace from the standard blockbuster formula that's become the norm for our superpowered adventures.The performances are incredible. Bruce Willis is genuinely acting again for the first time in years and McAvoy once again stuns with his ability to embody so many different characters in what is essentially one role. There's a scene where he is forced to cycle through all of the different personalities he portrays rapid-fire and it is absolutely incredible. The real star of the show for me though was Samuel Jackson, although I'll admit I'm a little biased as this has easily become my favorite role of his due to how easy Shyamalan made Mr. Glass to empathize with.The ending is the only real downside. It's sad to see these characters suffer such tragic fates. The disappointment is somewhat alleviated though by the third plot twist that allows the film to conclude on a more positive note, but ultimately it's still just bitter-sweet at best.Glass is thrilling in it's smallness. There's a fascinating plot here that's backed by some great subject matter. It's definitely an atypical superhero movie for this day and age, but it's no less exhilarating in its own way than the more traditionally exciting works of Marvel, DC, or any of their imitators. Shyamalan created an original work when he could have just used the modern cinematic universe mold, and it's hard to not respect that."
    },
    {
      "rating": "8",
      "text": "It has an epic start and a very good 2nd act. The ending might be \"split\" but the \"glass\" is \"unbreakable\" personally. I think its worth a watch and is mostly good with a bit of bad."
    },
    {
      "rating": "6",
      "text": "Not as good as Unbreakable, and a notch lower than Split, and although it still has some interesting moments and some great performances they are letdown by an overwrought story."
    },
    {
      "rating": "10",
      "text": "On this Movie i don't understand the critics. Its a down to Earth Superhero movie. Sure the ending is for some disappointing but M.Night has balls to end a movie like that and i respect him for that.I really enjoyed it, but it isn't a movie for everyone. Its really slow paced and it takes it time. But still the Movie raises some interesting questions about Heroism and having powers. I really like stuff like that.If you liked Unbreakable and Split you may like this one too. But don't expect an big Showdown to the universe Of these Movies. Glass is something different and i am Glade it exists."
    },
    {
      "rating": "7",
      "text": "GLASS will shatter the expectations of anyone who comes in looking for a satisfying conclusion to a trilogy that never was. Like both its predecessors, UNBREAKABLE and SPLIT, they are all standalone movies in their own right. That being said, GLASS is an audacious social commentary about the superhero landscape that's been paved in mainstream cinemas. GLASS is a flawed movie, but I respect it for having its own identity, and even more for the reflective ending that makes us question who the villain really is."
    },
    {
      "rating": "9",
      "text": "The film is good, watched in one breath. But before the start it is worth watching the first two films in the trilogy, otherwise much will not be clear"
    },
    {
      "rating": "10",
      "text": "DON'T LISTEN TO THE CRITICS! M. Night has done it again! I was at the edge of my seat trying to figure out how this will end and then when it does my jaw drops, which is is a common recurring thing that happens when I watch M. Night's movies and that is very well a GOOD thing, which means he is doing something right!This movie is not like any other superhero movie I have seen. M. Night brings such a realistic bend. From the fight scenes, which are played out like it truly would be in real life, the conflict through the characters of battling the belief in real super powers, to the whole demeanor of the movie, it has such a realistic and literal vibe to the plot that sets it apart from all the other superhero movies and making the audience truly believe that the concept of superpowers could actually be real. Its stunningly executed from the cinematography, score, color scheme, plot and all of the above. Not to Mention James McAvoy's acting was presented stunningly. I didn't think his acting could get any better after Split, but it did! WHY HASN'T THIS GUY WON AN OSCAR YET!?!?If your looking for a remarkable superhero movie like no other, I wouldn't recommend any other movie than this one!"
    },
    {
      "rating": "6",
      "text": "So I was really looking forward to this once it was revealed that the films 'Unbreakable' and 'Split' were tied together and that Bruce Willis and Samuel L. Jackson's characters from 'Unbreakable'would be meeting James McAvoy's from 'Split'. For those unfamiliar with the stories to both those films, in 'Unbreakable', Bruce Willis and Samuel L. Jackson play individuals with unique traits and abilities. Having gone his whole life surviving several severe accidents and realizing he just might be immortal, David Dunn (Willis) uses his superhuman strength and psychic abilities for good and helping others, while a fragile and crippled man named Elijah Price (Jackson) acts as a resentful villain to Willis's hero. In 'Split', McAvoy plays Kevin Wendell Crumb, a man who not only kidnaps young women, but also happens to have multiple personality disorder, one of these personalities being a large, dangerous, and aggressive one known as 'The Beast.' This film unites these three characters together and ultimately pits them against one another. While this premise had been in the making for years and sounded so cool as an idea and the way it was teased at the end of 'Split', I have to say that I was quite underwhelmed with the execution of said idea in this film. I really felt like it had great potential, but this film really took forever to get moving at a decent pace and mostly felt like build-up and set-up, with the final half hour being the only somewhat exciting portion of the film. It just seemed to take a while to find its footing and wasn't sure what it wanted to be. Another thriller? Another action film? A drama? It certainly felt like a drama to me, as it took forever to get into the action and thriller elements that made 'Unbreakable' and 'Split' pretty solid films. I will say that as expected, the acting from all was outstanding, with McAvoy once again juggling and shifting back and forth between so many different personalities and expressions seamlessly, and Willis and Jackson both having some great and worthwhile moments of their own as well. Overall, the acting was definitely a highlight, and on paper, the premise sounded so perfect and cool, but the film's uncertainty with its pacing and exactly what genre it wanted to be or stick with made it fall short of my hopes and expectations unfortunately. But if for anything, see it for the nostalgia from Willis and Jackson, as well as for McAvoy's brilliant performance (or should I say performances thanks to his multiple personalities.) Seriously, he's easily steals the show, just as he did in 'Split'! Oh and of course, since it is M. Night Shyamalan directing again, you're right to expect some sort of twist at the end."
    },
    {
      "rating": "9",
      "text": "There is so much to say. I've seen a lot of super heroes movies in my life, and it is the best trilogy I've seen so far. It's simple, well crafted, it's human, the actors are really good, all of them. It's not perfect because anything is, but the cirle is neatly closed. I'll just say this: Thank you everyone for your hard work."
    },
    {
      "rating": "7",
      "text": "It's good, not great. And it's a lot of good, with the exception of two or three major things (mostly plot points, but one thematic element that's just super sophmoric more than anything else) but it could've been worse. It's not what I really wanted to the final chapter of this trilogy I never thought would happen, but it's an ending, anyway. It's not perfect, but definitely not a disaster. It's also quite funny, and not unintentionally like several other Shyamalan films. James McAvoy is easily the MVP and kills every time he's on-screen."
    },
    {
      "rating": "10",
      "text": "Good movie don't understand what all dug. The film is not a blockbuster it is essentially philosophical. It's not the Avengers and the action is not here to be a movie conversational. Generally I liked it. And still this film many did not like because of the trailer. Everyone was waiting for the other Avengers but alas, this is a good psychological movie"
    },
    {
      "rating": "8",
      "text": "Honestly, if you like the other two, you will 100% percent enjoy and appreciate this one. There are flaws in this fun but the grounded and realism of these superhero characters feel good in Glass. People have reasons to not enjoy this and the ending is iffy but overall, its very fun and enjoyable. Go in with an open mind and not expecting action like Marvel or DC. Its a different kind of superhero film"
    },
    {
      "rating": "10",
      "text": "Great and very harshly criticized. Shyamalan is consistently putting good movies out now and people are really hating on him."
    },
    {
      "rating": "10",
      "text": "I just left Glass and my mind is boggled at the Critics Score.  Mr. Shamalan has done us proud and tied up the trilogy with a perfect bow.   As a part of the trilogy, this movie deserves a 10.   Between the critic score for this movie and what they scored for The Last Jedi, I guess it is user scores only for me from now on.   ALWAYS check User scores, IGNORE critic scores, or don't waste your time checking reviews at all because the critics are clearly under some influence other than the desire to steer us towards quality filmmaking."
    },
    {
      "rating": "6",
      "text": "M. Night Shyamalan reunites the stars of his 3 biggest films (Bruce Willis, Samuel L. Jackson and James McAvoy) into a sort of trilogy finale to Unbreakable and Split. Willis is not reviving his role from Sixth Sense, he's playing another character with superhuman powers. This trio is brought together in a psychiatric hospital, where Sarah Paulson's talky character tries to convince them that they're just deluded. While the premise starts with some promise, the rambling pace and sometimes confusing writing keep it from paying off. There is a conclusion (that may even augur a new world of superheros), but it's more frustrating than satisfying. A few moments of intensity don't make for a taut thriller."
    },
    {
      "rating": "7",
      "text": "M Night Shyamalan's trilogy capper is definetely a controversial film. Why? Because of his instinct to be original, and not in subjugating to the audience's expectation.  The original 'Unbreakable' actually suffers because of this...It was a moderate box office success due to its high budget, and ends up being a cult classic.  This one is more of the same variety...going to a certain direction that will baffle audiences, yet is essentially a 'logical' conclusion in light of what is happening in this genre. I will not spoil the controversial 3rd act, but be prepared to be surprised. Whether you like it or not, we need film makers of this ilk."
    },
    {
      "rating": "6",
      "text": "I tried hard to go into this movie without any expectations. I mostly succeeded although I had read some reviews (\"normal people\" user reviews - not the useless professional critics' reviews). Some user reviews gave me the impression that there was a fantastic major twist at the end that's bigger than Sixth Sense. Yes, there was a twist at the end but not quite at Sixth Sense levels. Still it was a nice twist.Overall the movie had great veteran actors in the 3 main \"superhero\" parts who all gave very good performances for their parts - James McAvoy, Bruce Willis and Samuel L Jackson. You'd expect that, and you got that. Their performances held the movie up. The movie itself - without giving anything away - wasn't as \"twisty\" as I expected but it does keep you on edge due to the tenseness of all the characters, particularly McAvoy's \"Split\" character. In the end I did get the similar feeling I got when I watched Unbreakable. (I haven't watched Split yet). It was OK satisfying but not over the top. I think the problem M. Night Shyamalan is that Sixth Sense was so extraordinary that it is very hard for him to top that. Overall, it's a reasonably satisfying movie, but I felt that I wanted more fleshed out. Personally, I give it a 6/10"
    },
    {
      "rating": "7",
      "text": "\"Glass\" is a good movie, but it is not good enough for 2019. \"Unbreakable\" came out in 2000, the year that \"X-Men\" sparked a superhero renaissance. If \"Split\" and \"Glass\" could have shifted back 6 to 10 years, as the MCU brought a new renaissance, then Shyamalan's trilogy would have been brilliant. Today, superhero projects dominate movies and television, from \"Watchmen\", \"Deadpool\", \"Avengers\", and the Arrowverse to \"The Incredibles\", \"Big Hero 6\", \"The Lego Batman Movie\", and TWO types of Teen Titans. All seven of the main actors of \"Glass\" have been in superhero or comic book projects as well. The world has elevated past with Shyamalan wants to offer. \"Glass\" is worth seeing, but it is too late to the superhero party. Don't see it in Imax either."
    },
    {
      "rating": "7",
      "text": "Shyamalan's take on the popular superhero franchise truly stands out from the rest, making an overall intriguing and original movie. Despite this, I'm ashamed to admit that I was disappointed on after my first viewing of the film, as I expected so much more from the last movie in the 'Unbreakable' trilogy. The positives of 'Glass' really do shine, however, I found that the movie dragged, and the poor pacing was the movie's largest and most noticeable flaw. James McAvoy returning as Kevin and the other personalities was a real pleasure to see; his performance was fantastic. Although McAvoy stole the spotlight, every character in the movie, even supporting characters, played a significant role and made the film work. Although I would have loved to have seen more from certain characters, their setup during at least the first half an hour of the movie was done perfectly. For me, the movie started to lose momentum around the middle. The pace was much slower and it was hard to understand where the film was actually going. It is until the end where it makes sense and for me, the film's finale saved it from becoming painfully average. Overall, M. Night Shyamalan has made a decent follow up to the previous films. It is certainly not a bad movie; it is a good movie, even though I felt disappointed after my first impressions of 'Glass'. I am satisfied with the way it turned out."
    },
    {
      "rating": "9",
      "text": "I have no idea what to say, except 2 things...1. I enjoyed the film.2. I have issues with the parts of the climax."
    },
    {
      "rating": "10",
      "text": "Go and see this movie. It is awesome. Blows away the disney garbage. It does not rely on CGI in every scene. Both me and my son had a blast at movies with this one."
    },
    {
      "rating": "10",
      "text": "Don't Listen to the critics. If you liked and understood Unbreakable and Split, this movie is a layered Masterpiece. With complex themes, meta narrative and multiple good plot twists, this movie thrills the heart and the mind. I can't wait to re-watch it to look for more foreshadowing, hints or just details, of which there are plenty to discover."
    },
    {
      "rating": "10",
      "text": "This movie is not without its flaws however, the style acting and characters create a wonderful aura that I just love."
    },
    {
      "rating": "7",
      "text": "First of all, all three of the main leads did marvellous jobs as their characters. Now I haven’t seen Unbreakable yet but I still felt like I understood everything that David and Elijah stood for. I had already seen Split, the other movie in this series, so I already knew how great James McAvoy would be in this movie. He just brings so much energy to each and every single personality making them all seem like a different person. Some of the side characters though didn’t stand out as much for me and just seemed two dimensional. One of them being the doctor. She had no major character development and just seemed like a last minute addition. Spencer Treat Clark, who plays Joseph Dunn, brought nothing to the film and just seemed really bland. Just like any M. Night Shyamalan, there is a plot twist but in this film, there isn’t just one, not two but three. One of them is actually really good and will shock people but the other two are just dumb and should’ve just been taken out. This film is two hours and six minutes long and man does it feel longer than that. There were some parts that were enticing for me and brought me into the story but a majority of the film had me zoning out a lot. The film had my attention for one of the final scenes in the film and that was really it. This film feels like three different movies as well. There were some awkward transitions in this film and some weird moments where the camera was shaking. In the end, Glass in a decent film that I think could have and should’ve been better."
    },
    {
      "rating": "10",
      "text": "I cannot understand why people are being so harsh on this movie. This will most definitely develop a cult following as the years pass, much like unbreakable in my opinion."
    }
  ],
  "recommendations": [
    "avengers_age_of_ultron",
    "terminator_genisys",
    "twelve_monkeys",
    "i_am_legend",
    "next",
    "tomorrowland",
    "edge_of_tomorrow",
    "the_prestige",
    "the_maze_runner",
    "hancock",
    "inferno",
    "now_you_see_me",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "bright",
    "maze_runner_the_scorch_trials",
    "i_am_number_four",
    "the_suicide_squad",
    "vanilla_sky",
    "nobody",
    "gemini_man",
    "the_5th_wave",
    "it_chapter_two",
    "riddick",
    "poseidon",
    "the_last_witch_hunter"
  ]
}