{
  "id": 586,
  "title": "Godmothered",
  "starring": [
    "Jillian Bell",
    "Isla Fisher"
  ],
  "runtime": 113,
  "genre": [
    "Family",
    "Fantasy",
    "Comedy"
  ],
  "description": "A young and unskilled fairy godmother that ventures out on her own to prove her worth by tracking down a young girl whose request for help was ignored. What she discovers is that the girl has now become a grown woman in need of something very different than a \"prince charming.\"",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/80tDCErk6ymHS7YfvqJcbnnTtqa.jpg",
  "categories": {
    "plot": 3.9166666666666665,
    "acting": 3.875,
    "ending": 3.3333333333333335,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 5.428571428571429,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Cute enough film, however the story is quite inconsistent and the same recycled modern fairy tale with minor plot device changes. Overall enjoyable but nothing spectacular."
    },
    {
      "rating": "4",
      "text": "This is perhaps the first film that feels truly built for Disney +, but it also shows how little they have to bet on the service in order to provide new releases for their subscribers.But is Godmothered funny? No, it really isn't.Jillian Bell is incredibly obnoxious, while Isla Fisher's character is just the punchbag who has to put up with her.And I can't help but think that maybe the film could have been more useful if the story had taken a more adult and sardonic perspective, and I think both actresses would have worked better that way, but this is Disney, and the results gets clouded by the lack of personality and purpose."
    },
    {
      "rating": "7",
      "text": "Godmothered is a delightful family movie and a worthy successor to Enchanted, told from the perspective of the iconic fairy godmother. Like all crossover tales from fairy land to harsh reality, the movie is full of laughs and contrasts. Jillian Bell is amazing as Eleanor, the go get em fairy godmother who doesn't take no for an answer. The lessons of the film are beautiful... Fix your own problems and find your own form of true love. We had tons of fun watching this as a family."
    },
    {
      "rating": "7",
      "text": "Pretty similar to \"Elf\" just not as charming. With that being said, it's funny (at times), wholesome and a movie you can watch during the holidays."
    },
    {
      "rating": "10",
      "text": "A fun if a little tired \"fantasy meets reality\" tale.\"Why is a fairy godmother sleeping on a stack of mattresses like the Princess & the Pea?\" It's questions like this that will routinely pop up while viewing this Disney movie and this is due to the fact that when it comes to fantasy world-building Godmothered is more about easy and quick referential humor than it is about making a lick of sense. When watching this movie we are not expected ask such questions as \"Why are the fairy godmothers unaware of the advances of technology?\" or \"How exactly does one apply to be a fairy godmother?\" unfortunately, that kind of questioning bombarded me throughout this movie's interminable two-hour running time. Isla Fisher was fine as the jaded woman who never got her \"Happily Ever After\" but the writers never really gave her anything more the a bunch of tired \"working woman\" cliches.On the plus side, Gary the house-working racoon was quite fun and the subplot of the eldest daughter's performance anxiety was rather sweet and not all the fish-out-of-water gags failed, sadly, the potential to be more was there it just wasn't utilized all that well.Overall, Godmothered could have been a fun satirically look at fairy tales but the script was more tired than inspired. For a better take on \"fantasy meets reality\" watch the Amy Adams film Enchanted instead."
    },
    {
      "rating": "6",
      "text": "Not good. I don't hate it though, it's harmless and means well.'Godmothered' is an extremely forgettable 2020 flick from Disney. Jillian Bell leads, with Isla Fisher supporting. I actually think it would've worked best the other way around, with Fisher portraying Eleanor and Bell playing Mackenzie. I like Bell from 'Workaholics', but she isn't lead worthy enough in my opinion; at least based on this. Jane Curtin also appears.The plot is very formulaic and lacks originality, especially with a few cringey, \"how do you do fellow kids\"-esque jokes. It's a very basic fish-out-of-water schtick for the majority. The ending is sickly, even if it has its heart fully in the right place."
    },
    {
      "rating": "6",
      "text": "Quando vi o trailer achei que o filme seria muito bom, mas a verdade é que ele é bem clichê. Não apresenta nada de novo e é exatamente igual a todo filme de contos de fada padrão da Disney."
    },
    {
      "rating": "2",
      "text": "Godmothered is a mediocre film. It deals with a lot of themes that kids would find boring, but also deals with comedy and themes that adults would find boring. So who is this movie for? It's hard to say.The film starts out poorly. Most of the comedy is just \"fish out of water does silly thing\". The dialog isn't clever or good, the jokes aren't funny, and the main character Eleanor is annoying. When we meet Mackenzie, the more adult themes come into play. She is syndical and never happy, which is the opposite of Eleanor who is too happy. This clash in personality could have worked but the writing wasn't good enough for it to happen.The middle of the film, when Eleanor starts using more magic to help Mackenzie and her family, is the enjoyable part. But it doesn't make up for the flaws with the ending. The end is a cheesy message about how love can be different and not just a princess and a prince. Fine message, but executed poorly.The acting is mediocre, the cgi is bad, there's not much character development and what is there isn't really earned and almost comes out of nowhere, as if it happens only because the movie needs it to. In the end Mackenzie's romance goes nowhere, making you wonder why it was even part of the movie. (It was only there for the anti \"fairytale ending\" ending). We then get lectured on how the \"old fashioned\" way is bad and we need to change. In short, this movie is not funny, boring, and anti fairytale. Nothing I want from Disney or any movie really. I don't like Disney's recent trend of hating on their old work and roots. Enchanted handled this better. Plus the animated sequence from this film was done poorly, please just hire someone who can animate."
    },
    {
      "rating": "8",
      "text": "I think the movie was fantastic I love how Disney is enhancing happy ever after and true love!"
    },
    {
      "rating": "1",
      "text": "Are we just not gonna talk about how one of the main character is a Black Girl playing a white girl... the girl has White Face makeup on. Movie was tacky. I’m really not sure why they thought it was okay to cast an African American girl PORTRAYED as a full white person the whole movie. Not cool"
    },
    {
      "rating": "10",
      "text": "There could be many reason to pick apart this movie or any movie for that matter but the light hearted nature and message is exactly what was needed.  Gary will always have my heart!  Got me through a tough holiday season!"
    }
  ],
  "recommendations": [
    "the_willoughbys",
    "dora_and_the_lost_city_of_gold",
    "rise_of_the_guardians",
    "ella_enchanted",
    "despicable_me_2",
    "brave",
    "the_secret_life_of_pets",
    "onward",
    "cloudy_with_a_chance_of_meatballs",
    "despicable_me",
    "rio_2",
    "the_star",
    "turbo",
    "despicable_me_3",
    "nanny_mcphee",
    "meet_the_robinsons",
    "the_lego_movie_2_the_second_part",
    "hotel_transylvania_2",
    "bolt",
    "enchanted",
    "christopher_robin",
    "storks",
    "shark_tale",
    "frozen_ii",
    "ferdinand"
  ]
}