{"id": 1299, "title": "Gods of Egypt", "starring": ["Nikolaj Coster-Waldau", "Brenton Thwaites"], "runtime": 127, "genre": ["Action", "Adventure", "Fantasy"], "description": "A common thief joins a mythical god on a quest through Egypt.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/hzH7fwaTyQNITLo40Hu3R7cVMqv.jpg", "categories": {"plot": 7.28125, "acting": 6.78125, "ending": 5.5, "soundtrack": 3.0, "cinematography": 6.0, "familyFriendly": 6.0, "funny": 7.333333333333333, "action": 7.85}, "reviews": [{"rating": "9", "text": "Right now let's agree on some basic beliefs. Egypt is in Africa. That does not mean that everyone one in Africa has dark skin. Is that really how far people have fallen. Right away, we stereotype all African's as black. How absurdly incorrect. The movie was well balanced, it's the circumstances that are elsewhere that are effecting this movie.\rThis movie was a fun ride, and for some it is exactly what some people were looking for. The story was put into place, and you can find a excellent villain in Butler. The acting was light, but not without it's darker moments. The vision was exceptional in how far they wished to push the boundaries of storytelling. The movie was well paced, with an epic climax. Maybe everyone is not going to like it. Still you can guarantee yourself that everyone will remember it."}, {"rating": "10", "text": "I'm not sure why this has so many low scores. Especially for \"all of the gods being white\". There was actually a black god, I guess they watched a different movie than I did. The only thing I did not like about this movie is some of the romance scenes and some of the CGI wasn't very believable and for lack of a better phrase, \"Gay looking\".  This movie is action packed, and the story is pretty solid. I'm going to have to give it a 6 or 7 out of 10, because it was clearly above 5, which is what I consider to be average. I'm going to give it a 10 on metacritic to balance all of these people who aren't able to see the black god of wisdom."}, {"rating": "10", "text": "I seriously don't understand what's all the hate for this movie. Its a well-crafted, quality, entertaining piece of art. Other than the typical Egyptian myth, magic and romance, it has interesting new ideas that were well-flashed out. I won't go into details for fear of giving away the plot lines, but safe to say that its got a touching romance story, likable & lovely/macho characters, impressive CGI effects and good pacing with enough action to satisfy. I love it! Better than many other Egyptian movies."}, {"rating": "10", "text": "I watched this after seeing the trailer and reviews first so I expected a really dull experience. Instead of that I got a decent amount of fun, the movie is far from terrible how many describe it. Yes, some bad acting here and there but not that bad. Good story, action, cast, effects also not as bad as they say etc. I gave it a 10 because of the unjustly low average score, otherwise I'd give it a 7."}, {"rating": "6", "text": "A fight among the gods, for the Egyptian empire.\r I like this director, but this is not his best work. I think the Hollywood fed up with Greek stuffs, now they're looking at the ancient Egypt. Where's the next stop? India? This film was not a bad idea. I liked the story, a mission based concept, but I did not like the CGI. Visually, it was okay, though those CGI characters felt like they're from sci-fi. I think they inspired by the ancient Egyptian arts. Other than that, this film is enjoyable.\r At least I knew about Greek deities, I learnt a few words and names about Egypt mythology through this. Gerard Butler in a negative shade was good and the other actors too decent. I was not interested in this film, but now somewhat I enjoyed it, that mean they should stop it here, no sequel please.\r I had no issue with the casting, it is a marketing strategy. You can't just put a new foreign face in front of the camera and make money out of it. Cinema itself means fake display. Age, skin, death, everything is fake. So people must learn to accept it similar to when a black, Malaysian or Indonesian man says he's a mooslim, but genetically he's not, just converted to.\r Well composed stunt sequences, especially bloods with liquid gold, totally got the PG13. Least expected film of the year, but got entertained better. It got the mixed response and mostly negative feedback from the critics, but who knows you might have a good time like I did. So you could try it if you want in your free time, because it is not worth to spend your valuable time.\r 6/10"}, {"rating": "5", "text": "Not sure where to start with this movie.. though a great cast but in an entirely wrong movie. The special effects were good but that's to be expected from a \"blockbuster\" but the character relationships and mediocre acting suspended believe to disbelief. Though this movie will undoubtedly appeal to a lot of folks I just found this to be a one time watch and painful one at that."}, {"rating": "8", "text": "Look, I can't say this was a thought-through, well directed gem (because a couple of their facts are wonky),but it was genuinely enjoyable. I gotta give it credit for its stunning graphics, because the movie looks amazing. All in all, I thought it was really entertaining, and it's beautiful the whole way through. Isn't that what movies are about?"}, {"rating": "7", "text": "I went into this movie with pretty low expectations. I rented it from the library so there was absolutely no cost for me other than time spent watching the movie. I have to say it wasn't terrible. The CGI effects are outdated, but other than that it was ok. Gerard Butler and Nikolaj Coster-Waldau both do excellent jobs. Brenton Thwaites is utterly forgettable as Bek. Everyone else does a fine job as secondary background characters.\r The movie is entertaining rather than a work of art. I enjoyed this much more than I did Suicide Squad, Batman vs. Superman, or heck even Civil War. I think the movie took an inordinate amount of flak because the lead characters were white and there were cries of \"white washing.\" For the record 1) classical Egyptians (or modern ones for that matter) were never black. 2) Egypt was conquered by Alexander the Great so a large chunk of Egyptian rulers (e.g. Cleopatra) were actually of Greek decent (i.e. white). I mean should more of the actors have been brown or Mediterranean hued? Sure. Is that what should define a movie? Not really. Judge it on its merits."}, {"rating": "9", "text": "Pretty good adventurous mythical movie about ancient Egypt, with some cool effects, good and bad heroes and characters and the whole Egyptian mythology displayed on screen (maybe slightly altered, but ok). It was fun to watch and I think my 2 hours were well spent. Why the negativity, people ? What did you expect, a social drama ? Read the title before going to the cinema..."}, {"rating": "0", "text": "Visually ZERO. Story ZERO. Acting ZERO. You could drop a sudden \"sharknado\" in the middle of this mess and you would not bat an eye---it would count as story development."}, {"rating": "10", "text": "helps you commit suicide.............................................................................................................................."}, {"rating": "3", "text": "Ham and Cheese fest with lousy CGI. The acting is so hammy and much of the dialogue so stupid that it's almost like comedy.  Maybe it would have been a game breaker on getting the film made.  But they should have made this an R film and given it a harder edge.  Then perhaps it would not have been so incredibly silly."}, {"rating": "10", "text": "This is a good movie.  The acting was good,\rthe pacing was rushed at some parts (for example, when Jamie Lanister\rreluctantly gave the man-cub the bejeweled bracelet-- there should have been a pause there;\rhe should've looked conflicted for more than half a second, which is what we see--if I were giving the mortal\rmy deceased girlfriend's bracelet, it would move me for at least a few seconds).\r This movie has both plot and character development.\rLeonidas was blood-thirsty, so I did not like him at all.\r I think many of the low reviews come from Christians\rwho watch the film and suddenly realized that their religion wasn't as original or unique\ras they thought.  I guess they missed the part in the Bible where god mentions other gods."}, {"rating": "8", "text": "Just watched it on Blu-ray - had to wait until now since it was repeatedly delayed. Was supposed to be shown in the cinemas here, but at the last moment they changed their minds, pulling it. Too bad, I would have loved to watch it in 3D.\rI think it's a great movie in the vein of \"Flash Gordon\" (1980). Funny and doesn't take itself too seriously."}, {"rating": "2", "text": "What a mess of a movie. It's just a bunch of glowing CGI nonsense slopped all over the screen while actors, both with and without talent, wander around. This is not a movie I would pay to see but even catching it for free on television doesn't mitigate how much of a waste of space it is.Despite the garishness of it all, there were a couple character beats that held some potential, but sadly that went mostly unrealized. It just wasn't a good movie. Even as  mindless action, it didn't really work, because the preponderance of bad CGI just made everything feel too cartoonish."}, {"rating": "0", "text": "This is movie is really bad, it is a totally lost of money go to see it on the cinema.Is so bad, i don´t have more words to describe this ****,what was thinking the director and the writers?"}, {"rating": "10", "text": "This movie is fantastic! A good thing beying Wronged. I just loved the whole filme because it has a big story and chains us from the start to the end."}, {"rating": "10", "text": "I am astounded at the bad reviews. The movie was very entertaining and well done, the images stunning, better than many sci-fi movies. Perhaps the reviewers are Christian or Muslim bigots trying to suppress this movie (all religions are fantasy bigotry meant to control the masses). I was glued to the screen for the entire time. I even cried over parts that touched my heart. I will see it again and again since it is now on my list of favorites."}, {"rating": "10", "text": "I don't usually write reviews but this one definitely deserve it, I don't care who was playing it, how much budget it was thrown into, as long as the movie is great, I'm satisfied. For fantasy movie lovers, ever since LOTR and Avatar nothing ever came close. The special effects might make u roll your eyes a bit but it definitely doesn't deserve the hate. Go watch for yourself and decide."}, {"rating": "10", "text": "I  honestly don't know what people are complaining about. I absolutely enjoyed this movie. I just finished watching it and I  could watch it again right now. I thought it was very well done. I love egyptian mythology movies and there is such a small amount of them  done in this genre that I found this very welcoming. Boo to all the haters! Go and watch your boring reality crap if you can't take this at the entertainment value presented to you. You're probably the same kind of haters that bag out Stargate!"}, {"rating": "7", "text": "I had to see this film because it was directed by Alex Proyas, one of my favorite directors.  Although the movie is certainly not a classic, it isn't as bad as the reviews indicate.  I was never bored and I thought the special effects fit the tone of the film.  All the actors seemed to be into the movie, especially Gerard Butler and Brenton Thwaites.  I also enjoyed Geoffrey Rush as \"Ra\" the sun God.  I felt that the movie was trying to capture the spirit of some of the old classics like \"Clash of the Titans\", and for me it succeeded on that level."}, {"rating": "10", "text": "I found the movie very entertaining and don't really understand why it gets so many bad reviews. It's a fun mix of mythology, action and fantasy. Some great visuals and epic scenes, one of my favourites beeing Ra's fight upon the sun barque against the god of darkness and chaos Apophis! I could imagine that the CGI could maybe look a bit unrealistic or cheesy on a normal screen, but seeing it in 3D on the big screen it actually looked rather convincing and cool. And it's not easy to display gods and their epic fights in a way that does them justice without getting too over the top. Gerard Butler is allways fun to watch, and the others are doing ok. Some lines are cheesy, but overall the characters are likeable. Script and story are ok too. I liked the way they portraied the gods. Wielding terrible power, but not almighty, and rather human like in character. More entertaining and closer to the mythological source material than other movies like Clash of the Titans, or Thor. And yes they cast white actors (among others) to play egyptian gods which is not ideal, but understandable. If europeans can deal with a black Heimdal in Thor (you know, the god that is literally called \"the whitest of the Aesir\" and \"the white As\" in the source mythology), egyptians should be able to handle a white Horus. Hey at least Toth was black and Anubis was a Jackal. What more do you want? ;)"}, {"rating": "8", "text": "When I first watched this, i kept on thinking about all the negative critiques it got. After i had seen it, none of them seemed to matter. This movie will never be Oscar worthy, or a great literary masterpiece but it is fun and entertaining. Watching movies isn't always about deep thinking, or, epiphanies, sometimes it is just about having fun, and the actors above all, give us that."}, {"rating": "8", "text": "Wow, so much hate for this movie? Did I missing something? Did the director shoot a panda in real life of something? Honestly, the movie was fun to watch. Over the top? Crazy? Elaborate? Sure. But did any of you go into the movie expecting otherwise? I loved the sets and the animations were fun. The back and forth was enjoyable too. For those of you expecting a documentary about Egypt, or a Shawshank redemption heart puller, can I ask what made you expect either?"}, {"rating": "7", "text": "I watched it with no expectations due to the fact that I always make an average between critics reviews and user reviews. This movie was super fun, good action , interesting story, yeah there are some cheesy parts what I asume you expect it as the movie is a fiction, action -adventure title. I say give it a chance , I liked it ."}, {"rating": "9", "text": "I made the mistake of not going to see this in the theater due to the horrible reviews.  Huge mistake on my part.  My son & I absolutely loved this movie when we watched it tonight.  Extremely entertaining and well crafted.  We loved the overall storyline and smirked at the humorous areas.  The special effects were well done though a little heavy at times.  Loved the actors. Overall nicely done.  Going to watch it again tomorrow."}, {"rating": "7", "text": "This is a solid entertaining movie that is getting way too much hate for asinine reasons. The effects are very good most of the time, while unfortunately falling short during some scenes. The story is fine for an epic popcorn style movie, yet again, a few scenes show through where the acting falls short. If you look past these shortcomings and come in with a positive attitude and don't expect anything intellectually groundbreaking - this movie is totally fine. It's probably the best Egyptian themed movie you're going to see for a new few years. Ignore the critics and just watch it for yourself."}, {"rating": "8", "text": "I don't see why there's so much hate for this movie. It was clearly meant to be little more than a green-screen action spectacle, but this one leans heavily on its mythological elements, which some will enjoy more than others. The action ranges from so-so (obviously green-screen pyramid fight scene) to cool (magical babes riding giant flame-throwing cobras) to incredible (anything with Ra and the hell monster).\r I'm guessing that a lot of the negativity is a result of the writing. It's true, the dialogue is lacking and there are several cheesy lines, but the benefit of the fast-paced script is that it conveys the solid world-building clearly. The story moves at a good pace, and the characters are likable and act in ways that make sense. None of the main characters do anything stupid, and the villain doesn't make dumb decisions. So that's already an improvement over most films of this genre.\r I want to believe in this world and I would like to see sequels with these characters but unfortunately due to this film having an estimated disappointing performance, that doesn't seem to be likely.\r The only things worth complaining about are a lack of a memorable script and the very green-screen look, which is a result of everything being shot and lit a little too perfectly and being comped into backgrounds that can resemble a very well-rendered PS4 game. I am a big fan of director Alex Proyas' \"The Crow\" and \"Dark City\". This is not his best work but I definitely think it's being overly thrashed. If you enjoyed \"Prince of Persia\" and \"Clash of the Titans\", you'll probably enjoy this, too."}, {"rating": "8", "text": "I never write reviews on metacritic. However I felt I had to balance out  all the hate this movie is receiving. The movie is pretty good, it is something different and visually stunning imo.\r Don't listen to the critics , just rent it and see for yourself."}, {"rating": "7", "text": "Don't go into this movie expecting an accurate, scientific study of Egypt and Egyptian lore.  This is just meant to be a fun, action-packed visual thrill ride against the backdrop of a mythical Egypt.  The visual effects were imaginative and spectacular.  The action scenes are paced well.\r This movies main weakness is character development.  The main character seems like a super-human homeless person, which doesn't make much sense.  Of course, it's hard to feel for the Gods, because, well, they're Gods with precious few flaws to make them relate-able.\r If you just want to turn your brain off and see action, near death escapes, and creative visual effects, this is the movie for you."}, {"rating": "7", "text": "This movie is terrible, it really is!  This movie, however, makes a really good guilty pleasure movie, it's mindless entertaining and laughable in a really horrible way!!!"}, {"rating": "9", "text": "I don't know why all these reviews are so bad when me and my mother saw it in 3d and we both thought it was good.  I would say it's about as good as 300 part 2.  I would give it a 10 but I'm an honest reviewer and there is always something that can be improved upon so the only movie I would give a 10 to would be a movie that absolutely blows me away and does everything perfectly.  People who give this a score lower than a 6 can absolutely be disregarded as bias and comparing it to a movie that they think it should be.  Graphics are amazing in 3d, the story is pretty good and I couldn't find anything wrong with the movie as a whole.  I watched a video review of this movie before I went to see it and it was giving it a bad rating, then I came to this website to see what the review was and also got a bad rating so I had to go see it myself and now I am baffled by these ratings because it is actually not near as bad as everyone is saying."}, {"rating": "8", "text": "This movie was pretty fun to watch. No the CGI wasn't perfect, and no the mythology wasn't followed strictly, but who said it was supposed to? This is another fun action movie with some touching bits thrown in every now and then. If you like action movies, I would say go see it. It isn't as action heavy as London has Fallen, but it is still fun nonetheless. I do feel like it got a bit too long in the tooth by the end of the running time, it felt like it could have ended maybe 15 or 25 minutes earlier."}, {"rating": "6", "text": "I think this movie does not deserve such backlash from critics. Yes!!! there is whitewashing but that does not necessarily mean the movie is boring and offensive. Its absolute FUN!!. Alex Proyas really did a lot of work on this."}, {"rating": "6", "text": "CGI CGI CGI... That about sums up what I actually like about this movie. From watching the trailers, this movie became on my must-see list just because of the impressive and glittery CGI. The only damper to the amazing CGI was the size difference b/w the gods and mortals. That looked weird and amateur. As for the movie itself, I couldn't and still can't understand gods dying. Why are mortals called 'mortals' if even gods themselves can easily die en masse? All-in-ll, this movie is only getting a 6 and not a 2 or 3 because of the CGI. If you enjoy CGI, you must watch this. Hail CGI!"}, {"rating": "10", "text": "This is family/fairy tale/adventure movie. I have enjoyed it a lot. Besides I was positively suprised that this movie digs deep into Egyptian mythology and is mostly very accurate to this. I give 10/10 not to rise up average score but becuase I really like that movie so much. For me it was fresh and fun."}, {"rating": "5", "text": "Egypt, the pyramids, the Sphinx, who hasn't studied them in school?  I always knew they worshipped many Gods, but how did that all come about?  This movie provided the back story on how the Gods related to each other, fought each other, etc.  I was never that interested to research this, but the movie made for an interesting story.  I didn't know the Gods were bigger than humans; had to do \"Lord of the Rings\" film tricks to make that happen.  Okay, the rest of the film was a lot of computerizing: buildings, armies, etc, interesting to see at first, but loses its charm over 2 hours."}, {"rating": "5", "text": "Gods of Egypt is a big, original, spectacle film that feels have if all the money was spent on the spectacle with a lack of any originality. The film mirrors a number of films, most amusingly Disney films such as Aladdin and The Lion King, and attempts to pursue a big budget film for the eyes, though anyone with reasonable sense would laugh at the misguided ideals brought up within the picture. The film did provide a spectacle, however, with a number of interesting characters and interesting moments throughout. The plot makes little sense and the whitewashing element so heavily discussed is greatly prominent within the film, and many parts of the film come off a cheesy or unattempted humor. The film was interesting overall, and for those looking for a fun movie for the family or friends to watch would probably enjoy it, though looking past the great effects and colorful characters, one would come to find out this is only just an OK Movie."}, {"rating": "8", "text": "Borderline cornball classic. Lots and lots of delicious eye candy. Don't dismiss this movie due to poor critic response. There is an outer space scene. A dozen crazy monster like characters. Multiple super silly love stories. Action galore. Glee inducing dumb dialogue. If they could have just committed to being a screwball movie this would have been a classic. You might want to see this movie. You will almost surely be entertained."}, {"rating": "3", "text": "This movie suuuuuucks. How can they spend this much money for this much suck?\r Just wait until it shows up on netflix and then just make sure you never click on it."}, {"rating": "8", "text": "This movie is getting slaughtered only to the overly pedantic.\rCurrently in theaters, there is nothing else that will give you that ultimate fantasy / battle feel.\rThis movie oozes 'God of War' and while the CGI at times looks cheap, it is a rather fun, interesting and action packed narrative.\rI never felt bored at any point during the film. It fully commits to its own plot.\rDon't go watch it if you're going to judge it with your politically correct goggles on.\rThis was a great film in 3D."}, {"rating": "0", "text": "Awful, just awful. Makes Clash of the Titans look good.\rIf you want Egyptian entertainment, see The Mummy series instead, much better and more entertaining.\rThe only good thing about this movie releasing is I don't have so see that trailer anymore. Silver lining."}, {"rating": "0", "text": "I only got through the first 50 minutes of agony of this movie. Before I wrote this I tried hard to think of any redeemable quality about this movie and couldn't think of a single thing. The writing sucks, the acting sucks, and the cgi sucks. This is another example of cgi just destroying a movie. YOu have to have a balance of real sets with cgi. I'm not kidding when I say I don't think there was a single real set made for this movie. Just stay away or reccommend this movie to someone you hate."}, {"rating": "2", "text": "This whole genre has been a cinematic failure and with this film the trend continues stronger than ever. From over the top special effects trying too hard to please audience, to poor character development and dialogue, there really wasn't much to write home about. In fact, I was really just wanting it to end,"}, {"rating": "0", "text": "What. A. Terrible. Movie. Worst movie i have seen. DO NOT RECOMMEND TO WATCH. Cheesy, goofy acting, writing is god awful, I can't explain how awful the CGI is, welcome back to 2003. This is supposed to be good????????? And the director calling critics idiots? How worse can this get, just don't watch it. Please. For your money."}, {"rating": "2", "text": "130 million has burned this film.\rIt looks visually good but that do a lot of movies. But if we take the story, screenplay, cast and the rest under the microscope shows the whole misery.\rA fürchtbar dreary and boring movie with weak actors and a bad director.\rToo bad about the money."}, {"rating": "3", "text": "\"Gods of Egypt\" is a movie that the first part was interesting , but the second was very boring , very boring , I loved the special effects and music , but that does not may redeem , and the results is more worst than \" Knowing\" ."}, {"rating": "6", "text": "Big, pompous, and flashy. It's an overblown, fantasy CGI-fest. Admittedly though it's better than the rest of it's ilk. It's still got it's cheesiness, but what saves the movie from being terrible is that it manages to keep a mostly straight-face about itself. It never dives into any camp or self-aware humor. That ultimately saves it's stupidity from being, well, just too stupid.\r It's got some interesting twists on Egyptian mythology. Things get pretty crazy and weird at times. That's something that ultimately works in it's favor. The amount of crazy crap going on keeps things moving even when the movie is focusing on overly familiar themes of revenge, redemption, and love. The cast itself is great. For whatever reason though, the director (Alex Proyas) has Brenton Thwaites acting way too calm in the face of danger. To the point where it doesn't make any sense. Nikolaj Coster-Waldau of Game of Thrones fame is the highlight. I've never been a big Gerard Butler fan, but he was really good as the villain.\r There is a lot of CGI used here. The emphasis on the movie seems to be big spectacle. There's a problem with that. This isn't the best CGI. It's not terrible and things can look really good at times. However there are other times where things look way too fake and you can tell they are just standing in front of a green screen. The movie just isn't pretty enough to really sell everything.\r It's some nice doses of humor, action, and craziness. The plot is familiar and the romance cliché, but the cast is entirely onboard. It's a little too over-the-top and out there and the special effects just aren't that special. It's the type of movie where you're either onboard or your not. However even if you are up for it, it's hard to deny there's plenty of more satisfying entertainment out there. Still, it could've been a heck of a lot worse and it does have it's thrills and imagination to keep from being a complete waste. There are just better alternatives out there.\r 6.5/10"}, {"rating": "3", "text": "While Gods of Egypt has a somewhat dopey charm, the fun starts to end in the second half and the bore starts to set in.  The action scenes are laced with poor CGI and many effects made popular in the late 90's.  Can't say it's all bad, but I can't sit through it again.  D+"}, {"rating": "8", "text": "Rented this movie from Redbox not expecting much but was actually surprised as to how good it was.  Some great performances with some surprising appearances from actors who I had no idea were in the movie.  It's nice to see the spotlight on the god of the Egyptian mythology for a change.  Though normally appearing as humans, the Gods can revert to their animal form when fighting which makes for some cool battle sequences and visuals.  The fearless mortal thief character was a nice addition to the adventure, grounding the story a little while providing some humor and fun.  A movie worth checking out."}], "recommendations": ["hercules", "morbius", "poseidon", "jupiter_ascending", "jumper", "underworld_evolution", "into_the_storm", "guardians_of_the_galaxy", "the_last_witch_hunter", "pandorum", "the_darkest_hour", "i_am_number_four", "the_book_of_eli", "the_mummy_tomb_of_the_dragon_emperor", "bright", "gamer", "riddick", "the_mist", "journey_to_the_center_of_the_earth", "clash_of_the_titans", "polar", "transformers_revenge_of_the_fallen", "volcano", "bloodshot", "aquaman"]}