{
  "id": 827,
  "title": "Godzilla: King of the Monsters",
  "starring": [
    "Kyle Chandler",
    "Vera Farmiga"
  ],
  "runtime": 132,
  "genre": [
    "Science Fiction",
    "Action"
  ],
  "description": "Follows the heroic efforts of the crypto-zoological agency Monarch as its members face off against a battery of god-sized monsters, including the mighty Godzilla, who collides with Mothra, Rodan, and his ultimate nemesis, the three-headed King Ghidorah. When these ancient super-species, thought to be mere myths, rise again, they all vie for supremacy, leaving humanity's very existence hanging in the balance.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fQ40gmFM4p03tXwMxQQKh2cCBW4.jpg",
  "categories": {
    "plot": 8.1,
    "acting": 7.85,
    "ending": 7.8,
    "soundtrack": 8.5,
    "cinematography": 7.5,
    "familyFriendly": 6.0,
    "funny": 9.0,
    "action": 8.681818181818182
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This isn't a Shakespeare play. This isn't Driving Miss Daisy. It's GODZILLA. Grab a big bucket of popcorn, sit back and enjoy the movie for what it is. Just plain fun"
    },
    {
      "rating": "10",
      "text": "I honestly don't understand why people require a sophisticated human story arc in a Godzilla film. Went to see it tonight with mrs and we both had a blast. If you're in for an epic monster showtime you won't be disappointed. The pace is good and I actually felt kind of a monster tension thoughout the film. Long live the king!"
    },
    {
      "rating": "9",
      "text": "I grew up watching monster movies and I came to this with my family hoping for the same thrills. I did not leave disappointed, rather stoked that this engine is firing on all cylinders. More action and entertaining than the Cranston iteration which set this movie up. Some groaner lines but it's a monster movie 9/ 10"
    },
    {
      "rating": "8",
      "text": "With a somewhat inventive history, it has better interpretations and production values ​​than its predecessor.This film is the predictable sequel to \"Godzilla\", with the appearance of a legion of monstrous creatures called Titans. I liked, in general, the 2014 film, and I went to see this film with some interest, believing that finally Godzilla was having a more interesting treatment from the cinema. And I confess that I am not disappointed, as the film is even better than its predecessor in some important points.The film takes the point where the previous one ended and reveals to us the efforts made since then, to create a way of understanding and reproducing the vocalizations of the monsters already awake. It is with this technology that Emma Russel, allied with a group of mercenaries, tries to wake up the sleeping monsters that Monarch monitors. She thinks it will restore a natural balance in the world, perhaps through a massacre. I confess that I found this part of the script somewhat confusing. Against her is ex-husband Mark, who argues that all monsters should simply be killed or left to sleep. It doesn't matter, the fact is that they wake up the only one who should have been left to sleep: the Guidorah hydra, the only one that has the capacity to wake everyone up and control them to slaughter Humanity. It is now up to Godzila and her fellow humans to contain this threat, even if it means the partial destruction of the world.As in the previous film, there are good and bad things in this story. It's a little hard to believe that creatures like that would spend thousands of years sleeping without being detected by curious humans. On the other hand, the film makes good use of material from classic legends involving monsters (Scilla, Kong, the Loch Ness Monster, Hydra and others). I was not convinced by the supposed alien origins of Hydra, I think it is a little credible detail of the script. There is also a time when everyone seems to stumble over Atlantean civilization, but that is never even mentioned.The cast's work is more enjoyable in this film than in its predecessor. For a start, I felt that there were more possibilities to connect with the characters. This bet made the film gain more interest as we feel more involved in the action and care more about what happens. Godzilla, in this respect, is a character in his own right. Among the human cast I would positively highlight Kyle Chandler and Vera Farmiga. Both do a good job, even though the character of Farmiga is very difficult to understand and unworthy of our sympathy. Watanabe continues to maintain the good performance that started in the previous film, ending it brilliantly. I don't know if all the merit belongs to the actor or if the screenwriter also reserved better material for the actor, but the truth is that it worked very well. Bradley Whitford, Aisha Hinds, Ziyi Zhang and Sally Hawkins do a good job of support. Millie Bobby Brown is almost left in the film and has little to do but be in danger when the script needs an extra reason for the characters to move faster.The film maintained the good production values ​​of its predecessor. And there is no doubt that there is a lot of money invested. A grandiose and impressive CGI, with scenarios of pure destruction everywhere, the bet on a more luminous environment, which allows the public to better see the destruction of the world and the epic battles that are fought among the human ruins. Now we see better what the first film kept wrapped in dust and shadows. The monstrous creatures also seem to me better worked and realistic. We also have impressive sound and visual effects, good post-production work, with excellent mixing and editing, well-crafted special effects, good sets, costumes and props.Overall, it is a satisfying action and sci-fi film, with a somewhat elaborate story that works well if we don't think about it too much. You can pass the time, although it is not a work of cinema art. Godzilla will certainly continue to be a recurring monster in cinema, even though it does not give rise to really good films."
    },
    {
      "rating": "7",
      "text": "Ya, I've watched this movie one night and by saying personal experience, I must say this was an ultimate movie. Cunningly this movie wins audience hearts. A good story also makes it perfect. I would suggest others to watch this.Author @ www.readere.in"
    },
    {
      "rating": "10",
      "text": "love every minute of it. action packed, entertaining movie with amazing CGI. Best Godzilla in my opinion. Nothing beats awesome Godzilla roar !"
    },
    {
      "rating": "10",
      "text": "This score is based on exactly what the movie is supposed to be. You don't see this movie in hopes of being moved by the actors performances. You don't see this movie for the overall story. You don't see this movie and compare it to other genres. You see this movie to watch giant monsters destroy things and be in awe over the graphical fidelity of these creatures and the destruction they cause! This movie deserves a 10 based on this premise. Its fun and it is riddled with amazing graphics, fanfare and enough different monsters to keep you in awe all the way through. So grab some popcorn and ENJOY THE SHOW!"
    },
    {
      "rating": "10",
      "text": "100% over the top craziness. Love it. Cut back on the boring human part, focused on the monsters, just the way it should be."
    },
    {
      "rating": "8",
      "text": "(no hagáis caso a nadie e ir a juzgar vosotros mismos es mi consejo) Una mejora considerable de la película 2014 que se hizo años atrás, los titanes se dejan ver mas, hay mas peleas, el reparto no da tanto asco como la anterior y todo fan de Godzilla se sentirá contento al ver a los clásicos enemigos y aliados del monstruo japones volver de manera soprendente, la musica combina muy bien con un tema dinamico para Godzilla, para nada es una decepción aunque si tiene ciertos fallos sobretodo por los humanos aunque se deja pasar por la acción que hay, sin duda una gran película que podría convertirse en la mejor del rey de los monstruos."
    },
    {
      "rating": "0",
      "text": "Je me suis dit entre deux avances rapides que quand même, ce machin pouvait bien valoir deux (deux **** points, oui, oui...) au moins pour la gamelle, pour les \"effets spéciaux\" et \"les\" monstres, car ô surprise, il y en a plusieurs...!Mais la quantité ne fait pas la qualité et ce scénar de nanar bricolé par quelques stagiaires qui ne devaient plus avoir toute leur tête (elle devait être au fond du cul, très certainement) ce scénar qui pue de fion donc, c'est juste pas possible... Surtout que par ailleurs, le film se traîne notablement (et assez lamentablement) délayé et dilué sur ses deux heures dix (!) à raconter ses conneries qui ne font -même- pas rire ! les acteurs et les actrices sont tellement mauvais qu'on dirait des clowns tristes qui viennent de marcher sur un rateau.Quant au petit père Godzilla, on ne le voit que très peu au début, puis un petit peu plus... tout à la fin... et c'est tout ! il fait vraiment sa star et des caprices là, et c'est pas sympa du tout pour son public ! Bref, decidément en dessous de tout et au 36ème sous-sol de la nullité, ce Godzilla, ils peuvent se le mettre quelque part et s'asseoir dessus !"
    },
    {
      "rating": "9",
      "text": "It is a godzilla movie, if you want those big monstersfighting, you wont be disappointed, it has a good history with the monsters, the human history is horrible but that does not matter."
    },
    {
      "rating": "10",
      "text": "Really this is a bad movie according to critics. This movie is Godzilla not the next godfather or citizen. Watch the movie for what it is a Godzilla movie. The movie should be about the monsters because Godzilla is at its heart a monster movie not a drama."
    },
    {
      "rating": "10",
      "text": "Beautiful movie , Godzilla is beautiful , Mothra is more beautiful , Rodan maiby beautiful , King ghidora beautiful , ready for Godzilla vs King Kong"
    },
    {
      "rating": "8",
      "text": "Fantastic movie, but much better without all the people around the King of the Monsters!"
    },
    {
      "rating": "10",
      "text": "Awesome set up movie for the fourth installment to come out in 2020 and I can't wait!"
    },
    {
      "rating": "9",
      "text": "Incredibly amazing. Don't let critics or rotten tomatoes to stop you from watching this movie. Cool visuals and graphics, more monsters fights scenes, exactly what audiences need! Best monster movie so far, really worth to watch it!"
    },
    {
      "rating": "10",
      "text": "I think this movie is amazing and I would definitely recommend it to anyone who likes kaiju movies.Trust me if you like kaiju movies you will definitely like this."
    },
    {
      "rating": "10",
      "text": "Don't over hype a movie and then be upset when it doesn't live up to your standards."
    },
    {
      "rating": "9",
      "text": "Now THIS is how you make a good Godzilla movie better (I'm talking to you Roland Emmerich).  Godzilla KOTM delivers on all fronts (IMO).  It's a great summer action blowout, a fantastic monster movie, and a stellar sequel to the 2014 film that launched the MonsterVerse.  This time, more attention is put on the monsters, giving us some spectacular monster fights.  And just when you thought King Ghidorah couldn't be more of a bad-@$$ in the Toho films...surprise!  Don't get me wrong, the film is far from flawless (the ending alone had me facepalming).  And with some of the characters, it was like they forgot there's still a 3rd film coming.  But for all that it's worth, KOTM is a perfect addition to 2019's summer blockbuster movies.  I most certainly recommend seeing this film."
    },
    {
      "rating": "10",
      "text": "There was some unnecessary human drama throughout the movie and Tywin Lannister was criminally underused but boi did King Ghidorah delivered. I'm sick and tired of MCU and other Superhero movies with lame candy-ass villain which are an afterthought. King Ghidorah shows how a villain should be made. As for the main protagonist Godzilla, he was awesome as well, not as awesome as King Ghidorah but still awesome."
    },
    {
      "rating": "9",
      "text": "The movie is exactly what it needed to be. It was filled with giant monsters from the Godzilla universe in a way we have never seen. The designs are honestly some of the best for Godzilla movies. The movie was an absolute blast all the way through. Yes the human scenes may not of been the next Citizen Kane though if you went in looking for great human drama then you do not understand what it is to watch as Godzilla movie. Never in the history has Godzilla been about the humans in reality. Godzilla has always been about the clash between mega sized Kaiju. A lot of people have bashed it seeming to not have the right expectations for a Godzilla movie. Though honestly the writing in this movie is still better then a lot of the other Godzilla movies. Honestly just go in hoping for lots of great Kaiju on Kaiju action."
    },
    {
      "rating": "8",
      "text": "I didn't like any western adaptation of Godzilla. Disappointed, I always came home to watch something from old Japanese movies. But I liked the last Kong and announce King Ghidorah. During the screening, it turned out that the new film adheres to classic films with both on-screen action and a brilliant soundtrack. It is probably the music that finally won my heart. Old songs in a new arrangement, great monsters and great fights! Again, for two hours I could feel my childhood. That was the goal, right?"
    },
    {
      "rating": "9",
      "text": "As a Godzilla fan you'll definitely love this movie! I felt like a little kid in the theaters! I know some fans had a problem with them constantly cutting away from the fights and back to the humans but I didn't even notice it when I first saw it. I was completely happy with all the action I was getting and it was a great dose of nostalgia!"
    },
    {
      "rating": "2",
      "text": "Oh my God this movie was bad. I couldn't bring myself to watch half of it. The movie was just boring with no characters that i cared about. Effects were cool I guess but that is to be expected from a movie by Warner Bros. I just don't like this movie."
    },
    {
      "rating": "10",
      "text": "Way better than the overrated Avengers EndGame.Godzilla KOTM is not perfect but is a movie made with passion and love."
    },
    {
      "rating": "10",
      "text": "Exceeded my expectations"
    },
    {
      "rating": "8",
      "text": "I really enjoyed watching watching the movie and seeing a lot of the old titans coming back but I wished there were more fighting and especially between Godzilla and Mothra vs Rodan and Ghidorah"
    },
    {
      "rating": "9",
      "text": "Good action, good acting, good storyline.  Just the right balance between the human and monster storylines.  If you like the cheesy black and white Godzilla movies, you’ll like this movie for the nostalgia aspect alone.  This movie is the best Godzilla movie yet!"
    },
    {
      "rating": "10",
      "text": "Finally Hollywood understood how to create a proper Godzilla movie. Has it great, interesting characters? Not really! Has it huge Monsters (or Kaijus) and epic battles? Definetly! So, what are you looking for when watching a Godzilla movie? Right! Huge Monsters bashing the sh** out of each other and destroy whole landscapes. And THAT´S exactly what you get with King Of The Monsters. It´s not the best Godzilla movie, but definetly the best US-Godzilla. Haters gonna hate, but if you love Godzilla and want to have a good time at the movies, then this is for you."
    },
    {
      "rating": "9",
      "text": "A fantastic Godzilla movie, way better than its 2014 predecessor, with much more Godzilla, loads of kaiju action, and an actual cast of likable and interesting human characters. Bringing back the big four classic monsters from Toho, this movie brings Godzilla, Mothra, Rodan and the evil Ghidorah to their full potential while staying true to their classic lore. The only downside is that you don't see as much Mothra and Rodan as you the other two monsters fighting for the fate of the world and there is one ugh scene where Godzilla and Ghidorah charge at each other, only to cut away to the monarch ship watching them fight from a distance. Aside from that, with a tremendous music score, I highly recommend anyone who loves the Godzilla movies or have an interest in the franchise to check this one out."
    },
    {
      "rating": "9",
      "text": "Despite mediocre human drama, the movie delivers exactly what it promises, huge and amazing monster fighting with some good fan service and some of the best visual effects of the year"
    },
    {
      "rating": "10",
      "text": "Very enjoyable movie. Not as much snarky humor as more recent movies have had. A trait which turned me off of watching American entertainment in general.I am concerned that critics killed this franchise as I was the only one in my theater to watch it."
    },
    {
      "rating": "8",
      "text": "- The movie provide a lot of epic scene, but wrapped in a very good proportion- The intensity is much higher than previous Godzilla.- The Godzilla is much more dinamic- The visual is better than previous Godzilla. The fight scene is visible and clearer- If the previous Godzilla is scored 67, then for me this one is deserve much higher score"
    },
    {
      "rating": "9",
      "text": "Awesome movie!Now the human elements are hard to keep up with especially the bad human's motivation. But the monster fights and fan service were awesome. I think it worked out."
    },
    {
      "rating": "8",
      "text": "It was a great solid movie... only downside I have is that they kept moving away from fighting scenes."
    },
    {
      "rating": "8",
      "text": "Si la trama fuera como los efectos especiales seria la mejor, ojala mejoren este aspecto, si no fuera por los monstruos esta pelicula no seria nada"
    },
    {
      "rating": "8",
      "text": "Has anyone in the history of the world gone to a Godzilla movie expecting it to be Citizen Kane? Yes, the story is thin. Yes, the army and government are set on destroying Godzilla even after he saved the world 5 years ago. Yes, every human in the movie makes dumb, bad decisions until the point they realize they have to work with Godzilla not against him. In short, it's a Godzilla movie. Don't go expecting the best script ever. What you will get is amazing visual design and effects (Godzilla, Mothra, and King Gidorah look amazing; Rodan is less stunning), awesome battles between humans and kaiju and between kaiju, bad dialogue that will nonetheless make you laugh out loud over and over. In short, it's a great monster movie. Don't expect any more than that and you will be delighted. If you have seen the two movies that preceded this one in the Monsterverse series (Godzilla and Kong:Skull Island), it will remind you more of the second one than the first. Snappy dialogue, great action, solid entertainment."
    },
    {
      "rating": "10",
      "text": "For long time Godzilla fans, this movie has everything you could ever want. Phenomenal"
    },
    {
      "rating": "10",
      "text": "Godzilla fan here. I have watched all Godzilla movies ever made, from the Japanese ones to the American ones. I know the big lizard here since I was a child and I can say a lot of things about this movie. Go watch, it is good! More bellow.If you are a casual watcher (i.e. I don't really know Godzilla, just like monster movies), don`t you worry, this movie is packed with monster actions. The plot is interesting, and the actors did their job well, all of them. The writers made a good job of making the whole flow of the movie interesting, so even if you do not see monsters, you are paying attention.If you are a Godzilla fan like me (The original Godzilla). This is a great adaptation. There are easter eggs from all movies you can think of, but I will say they are more focused on Godzilla Final Wars (2004) and Godzilla, Mothra, and King Ghidorah: Giant Monsters All-Out Attack (2001) as source material here. But they take Easter eggs from Godzilla vs Destroyah (1995), Godzilla Destroy all Monsters (1968), you named it. DONT MISS THE MOVIE, IT IS REALLY GOOD ADAPTATION."
    },
    {
      "rating": "9",
      "text": "Fantastic, action packed movie. It gives exactly what everyone was wanting with more monster action along while making the human plot more bearable and not so overwhelming."
    },
    {
      "rating": "10",
      "text": "The best American Godzilla movie. The monsters and the fights are great. The human story was okay. The movie loyal to the Toho universe. I can't wait to see Kong vs Godzilla."
    },
    {
      "rating": "10",
      "text": "A Dream for Godzilla fans. Complains about Characters and the plot are mostly unjustified. The action, CGI, Lighting and Cinematography are fantastic. Not to mention the wonderful Soundtrack. Can't wait to see it again and get my hands on the Blue Ray"
    },
    {
      "rating": "8",
      "text": "Happy. Thank You. More. Please.If you loved Toho's Showa era kaiju movies, I really don't see why you wouldn't at least enjoy this sequel/love letter. It's a genuine blast! The many beautiful nods to the franchise (the good kind of fan service) will surely warm your heart and the wonderful score might even cause a nuclear meltdown in there. While the pure sensory overload of the last 20 minutes could border on assault to some and be considered too much, I don't really get the haaarsh criticism. I might be as bold to call the critics out and ask:Do you even like these kinds of movies? This franchise? What exactly were you expecting?Edwards' 2014 Godzilla - a very well made disaster film - cracked open the rusty gates of Hollywood's monster madness. Then Vogt-Roberts got to put his foot in with his stylish take on Kong, and now Dougherty finally kicked them down with King of the Monsters. Hopefully Wingard will be pushing at open doors with Godzilla vs. Kong come next year.Fingers crossed..."
    },
    {
      "rating": "7",
      "text": "This is NOT for your Hitchcockian uncle. This is NOT for fans of drama and character development. This IS for people who want to have a good time and watch Godzilla smash a three headed dragon into a skyscraper. It’s well made and very entertaining, and much, much better than the critics say it to be but not by much. I loved the lighting, the stage like locations and, although it got a bit hard to watch at points, the shaking edits. The colour grading in this film is spectacular. The limited blue and red colour scheme gives it an ancient, colossal feel to it.The monsters we’re alright. I found monster zero to be dull, to say the least, Godzilla was okay, in my opinion Mothra was the best of them. But the monsters aren’t everything.  The actors do their best to ask with a poorly written script and try to pull off characters that really in the end don’t have a character. Millie Bobby Brown pulls it off well. I definitely don’t agree with this point as much is the critics,  The characters are simply meant to push the plot along and they succeed in this.It succeed on the title at least, it very much is Godzilla: King of the Monsters! But in the end it results a spectacle of colours, lights and Godzilla breathing blue fire out of a dragon head, so if you are into that, go see it (definitely in IMAX)!"
    },
    {
      "rating": "8",
      "text": "Very loud, very dumb, and very entertainingThe third film in the \"MonsterVerse\" franchise, King of the Monsters is a direct sequel to Gareth Edwards's 2014 Godzilla (sadly, he didn't return as director), and sets up Godzilla vs. Kong, which is scheduled for release next summer. However, whereas Edwards held Godzilla back and made the action feel smaller by focalising it through the human characters, new director Michael Dougherty inverts that formula, putting Godzilla front and centre and shooting the action in such a way as to make it seem as grandiose as possible. He isn't half the director Edwards is, but King of the Monsters works well in a braindead summer action movie kind of way. Sure, there are significant problems (all the best shots are in the trailer, the plot is laughable, the characters are so thinly sketched as to make those in the first film feel Shakespearean), but all things considered, I enjoyed it.Five years since Godzilla defeated the MUTOs, many more creatures (now dubbed Titans) have been found in various forms of hibernation. In charge of studying and protecting them is Monarch Sciences (introduced in a fledgling state in Kong: Skull Island, which took place in 1973). However, when an eco-terrorist, Jonah Alan (Charles Dance) steals a bioacoustics device designed to communicate with the Titans, he uses it to awaken the only non-terrestrial Titan, a fearsome three-headed dragon known as King Ghidorah. Arguing that humanity has brought the planet to the point of destruction, Jonah believes that a global Titan conflict would wipe out most of human civilisation, allowing the planet the time it needs to heal. And so, as Ghidorah awakens the various Titans, Godzilla emerges to stand against him.Godzilla was originally conceived as a metaphor for the destructive power of nuclear weaponry, and King of the Monsters has one eye on its themes too (eco disaster, biodiversity, co-existence with other species, military impulsiveness). But really, the sermonising script by Dougherty and Zach Shields is so badly put together that any thematic concerns dissipate into nothing. And yes, it does address the fact that through inattention and greed, humanity is on the brink of ensuring its own extinction. The problem is that the eco themes are so preachy, they come across as background irrelevancies at best, and distracting moralising at worst.And there are other problems with the script. For example, not one, not two, but three characters sacrifice themselves for the greater good, resulting in none of the sacrifices really meaning anything. Another scene that doesn't work is the death of a major character, which happens so suddenly, amidst so much chaos, with the camera on even focused on them, that in the very next scene, the film has to show us their face on a monitor with the word \"Deceased\" written underneath. There are also far too many scenes of characters standing on the bridge of the Monarch flagship, the ARGO, spouting exposition at one another.There are also some spatial hijinks going on. I get that the ARGO is supposed to be  super-advanced, but it seems capable of flying from one side of the planet to the other in about ten minutes. Another issue is that Zhang Ziyi plays twins. Except I didn't even realise there were two of them until I read a few reviews. Sure, I noticed what I thought was a singular character appear to be in two places at once, but because the ARGO had already been globe-hopping, I just put it down to the film's lack of geographic realism. The fact that it's so easy to miss that there are twins is spectacularly bad writing.But for all that, I thoroughly enjoyed King of the Monsters. Although the trailer did promise what the film can't deliver on (Claude Debussy and pensive apocalypticism), aesthetically, there's a lot to admire. The sound design is suitably deafening, and Lawrence Sher's cinematography has a well-judged sense of scale, especially in the 2.39:1 3D IMAX format. The film also does some interesting things with colour, coding the Titans in binary elemental shades. There are also some extraordinary individual shots (most of which have been spoiled by the trailer); Mothra spreading her wings, Ghidorah perched atop a volcano with a crucifix in the foreground, the reveal of Godzilla's lair. And the final shot is a goosebumps moment with which no Kaiju fan could possibly be dissatisfied. Purely at the level of craft, this is a hugely impressive film.Citizen Kane it most certainly isn't, but who expected (or wanted) it to be. The key to really parsing it is to consider the context, looking at what it was trying to be. And in this sense, it's a success. Sure, the script is hideous, and Dougherty struggles to accomplish what Edwards did with ease; bring his own personality to the spectacle. However, if you approach it for what it is, a dumb summer blockbuster about large monsters punching each other, you'll like it just fine."
    },
    {
      "rating": "8",
      "text": "realmente bacan, complio con lo que querian mounstros no se que mas quiera la gente"
    },
    {
      "rating": "8",
      "text": "Godzilla: King of the Monsters may not best a best-picture worthy movie, but you know what, it was a Hell of a fun time to watch. This movie gave us awesome kaiju fights, that's what matters."
    },
    {
      "rating": "9",
      "text": "Freaking awesome. Just needs a bit more monster battles instead of the human characters. I love it."
    },
    {
      "rating": "9",
      "text": "This was a movie definitely for any fan of Godzilla. Not perfect by and stretch but fun to go see none the less. It tried to cover a lot of stuff from past Godzilla movies like the missile removing oxygen, which is how they killed him in the first Godzilla movie from 1954 to King Ghidorah being from Space. If I had one gripe about the movie is it played to hard on the one character trying to redeem her self at the end. I could had lived with out that whole family moment, just my opinion. Either way It was a really fun and great movie. Nice to see some of these creature get a proper treatment with modern special effects."
    },
    {
      "rating": "7",
      "text": "It's not perfect but I still enjoyed it. There are still too much human for me. I might give it a second watch. Do not expect Academy Award level of writing. It is a kaiju film. Not an Oscar one."
    }
  ]
}