{
  "id": 2331,
  "title": "Godzilla",
  "starring": [
    "Aaron Taylor-Johnson",
    "Elizabeth Olsen"
  ],
  "runtime": 123,
  "genre": [
    "Action",
    "Drama",
    "Science Fiction"
  ],
  "description": "Ford Brody, a Navy bomb expert, has just reunited with his family in San Francisco when he is forced to go to Japan to help his estranged father, Joe. Soon, both men are swept up in an escalating crisis when an ancient alpha predator arises from the sea to combat malevolent adversaries that threaten the survival of humanity. The creatures leave colossal destruction in their wake, as they make their way toward their final battleground: San Francisco.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iBZhbCVhLpyxAfW1B8ePUxjScrx.jpg",
  "categories": {
    "plot": 9.714285714285714,
    "acting": 9.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Holy re-release Batman! Not only does this movie bring back the everything that made me jump with love and joy, but there's even more of it. Although I will say that the 1998 wasn't that bad, I thought it had good FX and pottential, and I loved the underated 2000, but this forever will be the best Godzilla movie. However, there is a good chance that the new one, with its rumor of being darker, grittier, and more intense, may overpower this, but until then, let's enjoy ourselves, and unleash the hardcore Godzilla fan everyone has inside them."
    },
    {
      "rating": "10",
      "text": "Directed by Ishirō Honda and featuring the special effects by Eiji Tsuburaya, Gojira starred Akira Takarada, Momoko Kōchi, Akihiko Hirata and Takashi Shimura. It was an instant box office smash in Japan. Although many elements are similar to the American version the structure of the story is different. The film begins with the mysterious destruction of a couple of ships near Odo Island. When people come to investigate the occurrences they experience some type of attack at night during the height of a hurricane. Then the scientists arrive to study Odo island where they encounter a giant reptilian monster standing over the hill roaring at them before fleeing to the ocean.\r The story also revolves around the human characters, such as the lead scientist Archeologist Kyohei Yamane, his daughter Emiko, who is engaged to her father’s colleague, Daisuke Serizawa, but is in love with a salvage ship captain, Hideto Ogata. A core scene and plot point of the movie is the break up of Emiko and Serizawa. Before she can break off her engagement to Dr. Serizawa he shares with Emiko his secret weapon he invented, a device which can destroy oxygen in water. After witnessing the horror and the destruction that this device can do to living things Serizawa has Emiko swear to reveal his secret to no one.\r Amidst these interpersonal relationships Godzilla begins to attack Tokyo and with each attack being more destructive than the last. Emiko is overcome with grief as she views the destruction Godzilla has brought to her city and nation. She also nurses a her wounded boyfriend, Ogata, who survived Godzilla’s rampage. With the government unable to defeat Godzilla and fearing more death and carnage Emiko betrays Dr. Serizawa and reveals his secret of the Oxygen Destroyer. At first Serizawa refuses to use his weapon. After being convinced of the wisdom of using the weapon Serizawa burns the research papers.\r The Japanese Navy brings Ogata and Serizawa to Tokyo Bay to use the weapon to destroy Godzilla. Once the weapon is deployed and Godzilla writhes in agony and is dieing Serizawa cuts the chord to his oxygen tank to sacrifice himself so that the secret of his weapon dies with him. Emiko and Ogata witness the demise of both Serizawa and Godzilla yet there is no comfort in their victory due to the loss of Serizawa coupled with the awareness that the atomic age has released forces that may strike again.\r For myself both the original Japanese version and the adapted American version are equally good movies. There is a somberness to the tone of the film and an urgency along with despair and helplessness that would never be repeated in the franchise again. As Godzilla evolved into a more child friendly franchise Toho studios did not attempt to recreate the seriousness of this first film for many years. Once they did try to a more serious attempts at a Godzilla movie in the late 80s and beyond they could never achieve the the same mood and tone this one set. One of the reasons, in my opinion, that the later movies failed to recreate the same mood is that all Godzilla movies has Godzilla fighting another monster (except the 1984 reboot) and those rampages by the big guy seem more motivated toward defeating a threat by another monster than Godzilla being a threat himself. In the original movie Godzilla was something mankind had brought upon himself and was reaping what he sowed. That was not the message in these later films. I also think the black and white cinematography and the distinctive musical score by Akira Ifukube also helped set the mood. When Toho begins to make Godzilla movies once again, or if the planned American movie gets made, I hope they take lessons from the one that started it all."
    },
    {
      "rating": "10",
      "text": "After decades of countless criticisms, crappy less-than-b-quality movies(not to mention the UTTERLY horrible and unfaithful 1998 \"remake\"), im glad to see that the Gman (the true Gman, not the creepy, speech impetted guy from half-life) finally gets some of the pat on the back he deserves. Honda does(or did...) a VERY good job of getting it through to our little americanized brains that, Ahem, NUKES SUCK. Well so did James Cameron with Terminator and T2, but as good as he did it, nothing can beet the master. Godzillas trademark... Godzillaness is all here. Plus a little (if i may say so myself) Barney the dinasaur-like message to kids... then again, dont get your kids to see this, they might fall asleep or get really fricken insultive of your old-timey self, but if they ever did understand the message(unlikely with todays kids) they WILL have horrific nightmares of the BMFRCM( Big Mutha ****** Rubber Clad Monster) stomping on theyre homes and ruining their barbies and GI joes with the charring and scathing nuclear fires that Ishiro Honda likes to call American Payback. This is without a doubt, THE best foreign monster movie ever made, hands down."
    },
    {
      "rating": "10",
      "text": "There is no denying the massive cultural impact that Godzilla has had. It was really the first Kaiju film and from there, It spawned dozens of films. Thanks to this movie, Godzilla has become an epic franchise that has lasted for decades and for good reason. Godzilla, both the character and this film, remains untouchable."
    },
    {
      "rating": "10",
      "text": "Godzilla might lack the special effects of todays standards, but the story and message of this film is a very great importance. Filled with suspenseful scenes as well as emotional ones where Godzilla would make his debut in a nice touch on the monster genre."
    },
    {
      "rating": "8",
      "text": "An absolute master piece.\rNicely done characters and GREAT portrayal of Godzilla.\rNice Screen play and script.\r Crushes its sequels and its 2 American made films just like how it crushes Tokyo."
    },
    {
      "rating": "6",
      "text": "Para haber sido hecha en 1954 tiene efectos especiales bastante convincentes, y la historia mas o menos original en su momento, pero el tiempo si que le paso bastante factura, haciéndose bastante predecible. Algo que si le tengo que criticar, incluso para la época son dos cosas. Primero que esta película se hubiera apreciado mucho mas a color, no solo los efectos, sino el escenario y Godzilla en general. Hubieron películas a color mucho antes que Godzilla, quizá fue para ahorrar costes, pero no deja de ser un punto negativo. Y segundo, siento que el descubrimiento del doctor para acabar con Godzilla es muy conveniente y esta rotisimo.En resumen, una película decente para la epoca, aunque si que es muy aburrida y predecible de ver a día de hoy."
    },
    {
      "rating": "10",
      "text": "This is a perfect example of how to make a kaiju movie. It's suspenseful, has brilliant acting, and has a plot that's surprisingly similar to \"Jaws\". In fact, Steven Spielberg even says that the 1954 Gojira was his inspiration for that film. One of Japan's best films, along with Seven Samurai,Spirited Away, and a modern day recreation of this classic \"Shin Godzilla\""
    },
    {
      "rating": "7",
      "text": "Its scary, Its terrifying and its sad. Especially that one scene with the mother and the kids. Some traumatizing ****"
    }
  ]
}