{"id": 2828, "title": "Going in Style", "starring": ["Morgan Freeman", "Michael Caine"], "runtime": 96, "genre": ["Crime", "Comedy"], "description": "Desperate to pay the bills and come through for their loved ones, three lifelong pals risk it all by embarking on a daring bid to knock off the very bank that absconded with their money.", "releaseYear": "2017", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/4nfWsdsJfO5srRZgxiWC9xHub0W.jpg", "categories": {"plot": 4.6, "acting": 5.4, "ending": 7.0, "soundtrack": 7.333333333333333, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.0, "action": 4.8}, "reviews": [{"rating": "6", "text": "Before you walk into “Going In Style” you know what to expect: jokes about the aches and pains of old age, sex, wisecracks about slowing down, the old men ragging on each other, their wanting to pass their wisdom on to younger people who don’t want to hear it and so on.You will also experience sitting back and enjoying old ‘friends’ like Michael Caine, Morgan Freeman and Alan Arkin not to forget Ann-Margret. It has been 51 years since Caine made “Alfie” with that wink in his eye and a smile, enjoying his character just as he does in this movie with, maybe, a little more gray hair and wrinkles in his face. He and his partners in crime, Freeman & Arkin play off and to each other like the pros they are.Like watching Shirley MacLaine last week in “The Last Word” the more affection for the performers you bring to the movie the more you will enjoy it.It was good seeing Matt Dillon again and hope to see him in 20 years with the same cache the old guys have. While it was good seeing Ann-Margret I wish they had given her a little of the dancing to do. The only embarrassment to me in the movie was Christopher Lloyd but whether that the was the role, the acting, the writing or the directing it was hard to tell.This weekend will be a battle between the openings of this old folks picture and the new Smurf movie. In the battle of gray versus blue who do you think will win?"}, {"rating": "6", "text": "Like many other recent \"going-of-age\" films (\"Last Vegas,\" \"Hope Springs,\" \"The Intern,\" etc.) Zach Braff's update to 1979's \"Going In Style\" is about as safe and as innocuous as you can get, almost to the point where I can neither recommend nor advise against seeing it. It's one of those well-meaning movies that just seems to exist without venturing above or below par. And, while it's fantastic to see the three legendary lead actors bantering and ribbing each other onscreen for a healthy running time, I can't help but feel that there could have been a more comedically adept screenplay in the mix here. Overall though, not an incredibly vapid experience, just one that could have delivered on its premise much more effectively, in my opinion."}, {"rating": "6", "text": "What I appreciated about Going in Style was how it got to the point unlike other films like it. It's supposed to be about older men robbing a bank and that's what it is. Not a great film and it does search for a more emotional feel, which hits with mixed results. But it was a decent one watch film. B-"}, {"rating": "6", "text": "Going in Style is not a bad movie.  It is not great.  It is not a masterpiece.  It is an AirplaneMovie™.  If you didn't know an AirplaneMovie™ is a movie that you don't have to see in theatres but that you have to see on an airplane.   Michael Caine, Morgan Freeman, and Alan Arkin team up in Comedy/Drama, Going in Style.  It is great to see Michael Caine, Morgan Freeman, and Alan Arkin together bonding, having fun.  Christoper Lloyd, Kenan Thomson, and Ann-Margret costar in the movie too.  They are the real standouts.  They are my favorite parts of the movie.  If they starred in it I am sure it would be a 7 or 8 out of 10.  But, they did not star in it.  When the stars of your movie were not as good as your costars, I don't know if you are the best stars.  That is one of the reasons I gave it a 6.  If you want to watch Going in Style just watch the original.  It is not at all because the remake is bad.  The remake just isn't great.  Overall, Going in Style is a movie you watch if you need a good laugh or you wanna see some famous actors team up together to make one big box office bomb.  It's an AirplaneMovie™ though so what did you expect?"}, {"rating": "7", "text": "Going in Style shows that Old Guys still rule! While it's not an award winning film by any means, It can tickle your funny bone when you need a good laugh. Michael Caine, Alan Arkin and Morgan Freeman are an acting gold combo and put on a good performance."}, {"rating": "10", "text": "3 Legends in one funny movie! This movie is better than Last Vegas and The Bucketlist combined!! Going in Style demonstrates the strengths of both the legendary actors and Zach Braff as a director!!!!"}, {"rating": "2", "text": "very mediocre film. The story is not new, uninteresting, predictable and rather tedious. Humor on the verge is not funny. Watching this movie is quite difficult."}, {"rating": "1", "text": "Cringe fest as a term has seldom found a better mate. Going in style is a boring movie, which reflects the production line mentality that has become Hollywood. It was one long predictable picture, with the faces of actors we all love. This will undoubtedly satisfy certain people, and as such, it will probably even meet it's projected sales goals. This is the problem with so many goods and services these days. Even mediocrity sells, and there is nothing we can do to change it."}, {"rating": "5", "text": "Going in Style goes nowhere in style, remarking every single so-called style in the entire film a pathetic excuse of what we actually call style. In other great terms, this movie actually tries to be at least watchable if not in style. Regardless, watch if only recommended but don't even try to love this film since there's no style in the entire film whatsoever."}, {"rating": "7", "text": "I really enjoyed this movie!  Who doesn't love Morgan Freeman, Michael Caine and Alan Arkin?  They are wonderful together playing three friends facing financial disaster when their pensions are taken away.  Caine's character, Joe, is present when his bank gets robbed.   But, the bank and the company they worled for are really the bad guys here.  How are people supposed to live after retiring?  Joe comes up with a preposterous idea and is met with much derision and resistance.  The plot goes on from here and it is fun to watch these three try to solve their financial problems.  Matt Dillon shows up as an FBI guy, Ann-Margret plays a love interest, and Christopher Lloyd plays a friend who has likely lost his mind.  It is all great fun to watch.  If you are an older person, don't let the negative reviews keep you from going.  And, young man Zach Braff directed!  Love that!"}, {"rating": "4", "text": "You are older than you ever were before. Now you are older than you ever were before. Now you are officially older than you ever were before. Day by day, minutes pass by, and we all fear the approaching retirement age, when we face unimaginable health problems to remind us of our vulnerability. We begin to question, “Where did our lives go?”Going in Style explores the feeling of seniority when the past only looks like a presentation of lost opportunities. Although here, it seems like getting old means time to ignore authority and commit thievery. So nothing can possibly go wrong, right?Three old men drive director Zach Braff’s buddy movie, all of them Academy Award winning actors. One of them, portrayed by Michael Caine (The Cider House Rules, Sleuth) lives with his daughter and granddaughter, which adds to the pressure of his overdrawn checking account. Another one of them, portrayed by Morgan Freeman (Million Dollar Baby, The Shawshank Redemption), lives with his longtime roommate, and refuses to make public his desperation for a kidney transplant. The longtime roommate, portrayed by Alan Arkin (Argo, Little Miss Sunshine), has had it with his living as a music instructor, and fights the urge to start a romance with a convenience store clerk who can’t stop flirting with him.All in all, these three senior citizens will waste no more time, and their leader (Caine) decides to rob a bank after experiencing a robbery first-hand. He understands his desire to stop living mundanely, and takes action to ensure a satisfying retirement.First they try to shoplift a convenience store, which is actually quite a hoot to watch. Alas, their first baby step fails pretty miserably. Some extra preplanning is needed by an experienced professional, who coincidentally happens to be a Mexican named Jesus. Yes, I know: “Wow. A professional Mexican terrorist in New York City—exactly what our country could benefit from!” Seriously, such a casting decision in light of recent events is morally irresponsible.Anyways, on they go into a month-long setup for the big day, a situation open to numerous narrative possibilities worth over four minutes of montage, even though it winds up doing just that. Too bad for us, as their plan deserves a much deeper exploration into the meticulous detail; but what we are shown still looks well thought out against the unkind legal system. While the police force’s functionality may defy believability here and there, you’ll overall buy into their wild adventure against the law.Then the mission’s stakes continue to get higher as they don “Rat Pack” costumes at the official heist. Awesomeness lands in these three old men’s endeavors of the little time they have left, especially when considering the individual conflicts each of them faces. Yet when the whole scene finally comes up, it does not last as long as desired.Thankfully though, the attempted bond between the three leads should guarantee an impact, both with one another and their outside families. I say “attempted” because none of the performances by any of the cast delivers any genuine sorrow for the quiet moments. All players here fall along the lines of poor, below average, or somewhere in the middle. Christopher Lloyd (Back to the Future) gives the only good performance as the old loon who runs the men’s elderly community, even though his dialogue suggests nothing beyond weak comic relief.You may by now see Going in Style as a mere Redbox rental worth a one-time watch, and only if you’re a man over middle age seeking a unique perspective of growing old. Well I can certainly attest your assumption—this type of entertainment probably would work better if aired straight to TV. You can expect a slightly satisfying taste, just don’t expect to remember any of it a week later."}, {"rating": "9", "text": "This was a good movie for all ages! I HIGHLY recommend this movie for taking your parents or grandparents to. One of the funniest movies I've seen this year!!"}, {"rating": "4", "text": "3 retirees (Morgan Freeman, Michael Caine, Alan Arkin) discover their pension fund is being discontinued, so they decide to rob a bank. Surprisingly, the heist itself isn't the finish line, there's a whole post-robbery investigation they have to elude. The ageist jokes (even out of their own mouths) are in abundance, but the laffs are minimal. This cast is talented, but only Arkin has any humor in his portrayal Christoper Lloyd's clueless character is an insult and an embarrassment). Considering that director Zach Braff has a history in comedy, he didn't impart any of his skills to this movie. It doesn't help that the script is flat and predictable."}, {"rating": "7", "text": "In an alternative way, against all the odds, they fought it!This was a remake of the 1979 film of the same name. I haven't seen that, but I enjoyed this version. I did not say I liked, but very entertaining. From 'Grandma Gangster' to 'Stand Up Guys', there you could find a few more that all these films have commonalities. The old fellows try to do something out of their age and strength can cope. So, for fun, this film will do just fine.The poster says it all, but the film reveals much detail, like with small twist and turns. Three lifelong friends suddenly feeling the heat after their pensions got messed up. Apart from that, serious health condition and other financial struggle force them to rob a bank. The film is going to tell us their preparations for the action and post heist developments with some close encounters.No one particular, but all the three veteran actors were good. Good to see them in such energetic film, other than supporting roles in other big flicks. Zack Braff too was good at his direction. I did not like that much his previous feature film. This is a commercial film, but well done. He says it is a reboot, not a remake. And seeing decent success, there could be a sequel. Simply watch it and have fun, but don't analyse deeply, which might only disappoint you.6.5/10"}, {"rating": "6", "text": "Always amusing, occasionally laugh out loud funny, respectable throughout, but perpetually predictable, \"Going in Style\" prospers thanks to the seamless chemistry of it's legendary actors."}, {"rating": "3", "text": "Pretty much what expexted, a low effort production    with a throwaway script and wasted talent.  Didnt know Zach Braff was    responsible for this"}, {"rating": "6", "text": "'The Bucket List', 'Last Vegas', and 'Going in Style' - the complete trilogy of \"I'm too old for this **** for Morgan Freeman's career.Then again, even at a young age Freeman still looks old.Anywhere, the amount of charm and class displayed on screen by Cain, Freeman, and Arkin made this movie a step above average."}, {"rating": "6", "text": "Movie doesn't really bring many new things to it and it is quite predictable, but overall it is like a feel good movie, with plenty of good actors and quite watchable."}, {"rating": "5", "text": "You forget this movie the moment you leave the theater. It doesn't get very boring, has some funny moments and slight amount of action and tension, but has absolutely no influence on you. It's just a movie that you can watch, enjoy and forget. I don't regret watching it, but I wouldn't watch it twice."}, {"rating": "5", "text": "Get ready for the grandfather of all heist films! Three old-timers are planning to rob the bank, partly for revenge, partly for having something interesting to do before succumbing to senility.There’s still fun to be had when you are beloved male movie star reaching his 60’s or even more. There’s a ton of age-appropriate roles on offer, such as tender grandpa, dirty grandpa, weird grandpa, or just some senior citizen who starts something unexpected and finds some new life thanks to this.„Going in Style“ relies on tender grandpa and still capable senior citizen cliches to offer yet another joyful comedy-drama-lite – it deserves to be called a genre already – where you can watch some of the more beloved actors of our time crumbling away with style.This time, there’s even more of them than I expected. We have two true stars (Michael Caine, Morgan Freeman), one well-known and loved actor who’s not exactly a star (Alan Arkin) and even some has-beens, such as Christopher Lloyd – still offering some creepy variation on his schtick from „Back to the Future“ – and Ann-Margret.So, there’s gonna be as much geronto-fun as you can digest AND fun comic relief turn by „SNL“ regular Kenan Thompson. This is the only thing in the movie that feels fresh and alive.Caine, Freeman and Arkin are screen legends capable of making every movie a little bit more interesting and enjoyable just by appearing in it. The sad part is, there is so little interesting or truly heart-felt going on that one is tempted to call in „Going in Style“ a wasted opportunity.The characters, the relationships, the dialogue, the approach – all is so shallow and bland. But, of course, it was probably never aimed much higher than a pleasant if boring 96 minutes in the company of some of America’s coolest senior citizens.Also, this must be one of the most unconvincing bank heist movies of all time. I get it, we are aiming for real here, but the way it plays out is just stupid. Was the writer even trying?It’s certainly a wasted opportunity for director Zach Brach. He was a popular sitcom star in „Scrubs“ (2001-10) who also surprised us by writing, directing and starring in „Garden State“ (2004) – delightful little movie worthy to be called a modern classic.But 2010’s have brought little to confirm he’s still a player. And „Going in Style“ seems more like drowning in saccharine-flavored mediocrity than anything to get excited about. Why do it at all, one might ask. Did he value hanging out with Freeman, Caine and Arkin more than trying to help his career?You can find a bunch of watchworthy movies and TV series about getting old, both artsy and mainstream – it’s quite popular topic. With „Going in Style“ being mainstream almost to a fault, I’d like to offer a recommendation of same sort – „Men of a Certain Age“ or „Grace and Frankie“, for example.Senior screen legends should also think about „The Expendables“ style all-star-project, where they could also include Robert De Niro, Christopher Walken, Al Pacino, Kevin Kline, Romany Malco, Sam Elliott, Mary Steenburgen or anybody else regularly willing to do this kind of nice but calorie-free entertainment.The all-star-approach would save us some time of watching most of them doing it separately. OR, they could choose to not endlessly repeat themselves and do non-mainstream movie about getting old for a change.Watch the trailer and save another 94 minutes. Almost all good bits are in there!"}, {"rating": "9", "text": "Perfect movie. I had big fun watching this movie. Funny jokes. Story is amazing but still easy to understand (that is quite rare in movies). Only one thing that is so annoying is sound, dabing is perfect but the music. Music was good aswell, but the music was so loud and the dabing was so quiet. When there was scene only with music i had to lower the volume. Highly recommend."}], "recommendations": ["last_vegas", "chef", "17_again", "morning_glory", "the_intern", "logan_lucky", "my_spy", "the_dilemma", "the_hustle", "wanderlust", "arthur", "moneyball", "bad_boys_for_life", "orphan_first_kill", "no_strings_attached", "the_boss", "sandy_wexler", "paul_blart_mall_cop", "burnt", "the_guardian", "the_second_best_exotic_marigold_hotel", "lucky_number_slevin", "the_town", "silver_linings_playbook", "blow"]}