{
  "id": 3820,
  "title": "GoldenEye",
  "starring": [
    "Pierce Brosnan",
    "Sean Bean"
  ],
  "runtime": 130,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "When a powerful satellite system falls into the hands of Alec Trevelyan, AKA Agent 006, a former ally-turned-enemy, only James Bond can save the world from a dangerous space weapon that -- in one short pulse -- could destroy the earth! As Bond squares off against his former compatriot, he also battles Xenia Onatopp, an assassin who uses pleasure as her ultimate weapon",
  "releaseYear": "1995",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/z0ljRnNxIO7CRBhLEO0DvLgAFPR.jpg",
  "categories": {
    "plot": 6.864864864864865,
    "acting": 6.2,
    "ending": 7.222222222222222,
    "soundtrack": 7.166666666666667,
    "cinematography": 9.0,
    "familyFriendly": 6.0,
    "funny": 8.555555555555555,
    "action": 7.166666666666667
  },
  "reviews": [
    {
      "rating": "9",
      "text": "This was, and still is my favorite Bond movie as of yet. [***SPOILERS***] I still get chills seeing Bond take a tank through a solid wall, straight onto the streets, and chase the villain (with his girl) through the town. I can't say if my favoritism toward this movie is enhanced by my liking of the video game but nevertheless, I love this movie and love James Bond."
    },
    {
      "rating": "9",
      "text": "I absolutely loved this film. Pierce Brosnan is the most action packed of all the bonds yet."
    },
    {
      "rating": "9",
      "text": "The first Brosnan Bond is competent, and the action delivers. Sean Bean makes an interesting villain. The film FEELS considerably older than the other three, meaning it feels the most vintage, but the other three Brosnan Bond films are capable of greater technical feats."
    },
    {
      "rating": "8",
      "text": "Goldeneye is one of the best, if not THE best 007 movie in existence. Brosnin makes a strong entry into the franchise (one that he never came close to topping) and the cast is padded out with ultra-memorable villains (Alec Trevelyan & Xenia Onatopp). Who could ever forget James Bond romping around the streets of St. Petersberg in a hulking tank?! Of course, sometimes it's hard to divorce the delights of Goldeneye the movie and the Goldeneye N64 game but they actually support one another in tandem. A memory of either would be incomplete without the other. Excellent stuff all around."
    },
    {
      "rating": "8",
      "text": "While not the best version of GoldenEye, it's still safe to watch James Bond go at it again. This movie deserves a Golden Eye for the outraging moments in the film."
    },
    {
      "rating": "9",
      "text": "This is one of my favorite Bond films.  It does everything right: The storyline is fast-paced, the action is well shot and smart, the villain(s) is interesting, and there were of course some hot babes.  Brosnan is really good in this one as he acts arrogant but not overtly cold like Daniel Craig.  There's a perfect blend of action/serious moments and some more comical moments."
    },
    {
      "rating": "9",
      "text": "I'm going to try not to sound like a fan boy despite the fact I am a huge Bond fan and Goldeneye is my favourite of the Bonds. So without further ado, here it is.Goldeneye isn't flawless but it comes pretty close with it being a great restart of a franchise that had been unfortunately damaged by some truly terrible movies (The Living Daylights and License to Kill). The film chooses to introduce Bond to the modern world complete with post Cold War ideals and some great action sequences. If anything the main draw of Goldeneye is that following a rather dull revenge story (License to Kill) it manages to bring the fun back to the series with a new Bond (Pierce Brosnan) who clearly understands the character more than Moore, Lazenby and Dalton ever did. Goldeneye while reverting Bond back to his fun loving self also allows Brosnan room to breath with him showing a vulnerable if not scarred character that was conveyed in the books despite the fact Goldeneye is the first film not adapted from a Ian Fleming story although the title does allude to Fleming.The main flaw with Goldeneye is that it shoehorns the characters of Jack Wade and Valentin Zukovsky in for some light comic relief that really does fall flat which is a shame as Robbie Coltrane is a great actor.However despite this Goldeneye has some entertaining characters such as Alec 'Janus' Travelyan (Sean Bean) and Boris Grishenko (Alan Cummings) who are not only fun but well acted. If anything this film feels fantastically tense with the finale being especially good thanks to some skillful direction by Martin Campbell and a ball point pen."
    },
    {
      "rating": "10",
      "text": "Best Bond movie ever!  In the cloud of the best movies ever.  The only Pierce Brosnan movie that came in, killed, and went home, thus causing a thunderstorm that lasted for a decade from this one event.  You just don't overtop this movie.  It is a monument to the endurance of the essence of Bond, and Ian Flemming's ghost that keeps its heart pumping.  James Bond will Return."
    },
    {
      "rating": "10",
      "text": "This is the BEST James Bond film ever made as it is full of style, amazing action pieces that really dazzle and entertain, Pierce Brosnan is an excellent Bond (wit, humor, action, style, brutality), Xenia Onatopp is the greatest creation of a villain and Bond girl (because her weapon is Bond' worst nightmare), the villain is truly threatening and played very well by Sean Bean, the title song is awesome and classic Bond, the script for this film is VERY well written and witty, etc.  Everything about this film screams classic Bond and it is by far the greatest spy film ever made and has yet to be topped.  Amazing film."
    },
    {
      "rating": "2",
      "text": "GoldenEye is a action and adventure film from 1995 and directed by Martin Campbell.. Actor Pierce Brosnan plays James Bond in GoldenEye and he's joined by Sean Bean as the villain and some lady villain who's actually quite sexy and so is Izabella Scorupco. The main problems with GoldenEye is pretty much everything starting with the soundtrack because Tina Turner's GoldenEye song is horrible and bad and also James Bond played by Pierce Brosnan has not got any cars with gadgets unlike most of the Bond films. The story in general isn't great and Sean Bean's acting is so bad infact usually he's a great actor but he's horrible in this and laughable and rotten to the core. The woman villain played by Famke Janssen is incredibly sexy and seductive but weak as a villain and laughable and is completely neutralized by Brosnan. The action scenes aren't that great including an army tank with Pierce Brosnan inside chasing the villains which is laughably stupid and a lot of the cast and characters are either annoying, poorly cast or unnecessary and bad. GoldenEye is without doubt to me one of Pierce Brosnan's worst Bond films and certainly a stinker to the Bond collection."
    },
    {
      "rating": "4",
      "text": "GoldenEye probably has the worst actors a Bond movie has ever had. The dialogues are crude and almost all of Bonds stunts are extremely unrealistic. The Pierce Brosnan movies are a shame for the series, yet GoldenEye is one of the best in his career. The reason why I give it at least 4 points is: rememberable scenes (bungee jump, Judi Dench's first 'M' appearance, Death scene of the main villain) and as action crime it's not a complete failure. You can watch it, but you do better with Connery's, Dalton's or Craig's Bond."
    },
    {
      "rating": "5",
      "text": "For a Pierce Brosnan Bond film, probably his best. The drawback? Its a Pierce Brosnan Bond film. Goldeneye is worth watching, but if this is your first Bond movie, watch miracle that happened that is Casino Royale."
    },
    {
      "rating": "8",
      "text": "While not a classic or the most authentic bond film, I enjoyed it immensely. This is the bond film of my childhood and along with the Golden Eye game on the n64, is very memorable. There is the usual great cheesy monologue. Boris: \"Speak to me!\" ... priceless"
    },
    {
      "rating": "8",
      "text": "As a James Bond action film, it's certainly one of the best.  It's also a great action movie.  Perhaps it is not as artistic as some other movies, but it succeeds for what it is.  Definitely a strong recommendation towards GoldenEye."
    },
    {
      "rating": "10",
      "text": "Never gets old or boring tastes just like a fine wine and cheese selection.For England James."
    },
    {
      "rating": "8",
      "text": "One of the best Bond movies of all time, and not to mention that even a game of the same title is better than the movie. Great action, great excitement and some great stunts. Some of the characters in this movie are simply just the beginning of their new careers since they're interesting."
    },
    {
      "rating": "10",
      "text": "GoldenEye is one my favorite Bond films ever! Pierce Brosnan is the best James Bond character ever. The action scenes are too great. Two of my favorite Bond girls is Natalya Simonova (played by Isabella Scorpuco) and Xenia Onatopp (played by Famke Janssen). My coolest villians that I really love is Alec Trevelyan 006,Boris Grishenko,and General Ouromov. The music was so great that it make me chills to listen to it. Martin Campbell directed this movie,but I put my first spot is Casino Royale. Even I love to play the original GoldenEye for the N64 and also I saw this movie since I was 10,after I played the game. But I love them both."
    },
    {
      "rating": "8",
      "text": "This is the seventeenth James Bond film, and first of four starring Pierce Brosnan as 007. It is also the first of two directed by Martin Campbell (Casino Royale).After a mission to destroy a nerve gas factory in the Soviet Union goes bad, 007's friend and fellow MI6 agent 006, Alex Trevelyan (Sean Bean) is executed by Soviet General Ourumov. Nine years later, after the Cold War is over, a secret Soviet weapon called GoldenEye is stolen by Ourumov and a sexy former Soviet fighter pilot, Xenia Onatopp (Famke Janssen), who kills her prey by squeezing them to death with her thighs! Now with the GoldenEye in the hands of the mysterious, unseen crime-lord Janus, Bond must travel to Russia to track down the weapon before it is used on the world. While in Russia, 007 learns that Janus is really Trevelyan, and he plans to use GoldenEye to launch a deadly electromagnetic pulse from a commandeered Russian space satellite, disabling the entire electrical and computer grid in Great Britain, throwing their financial status into chaos, as revenge for his parents death. With the help of a beautiful Russian computer programmer, Natalya Simonova (Izabella Scorupco), Bond must race against time to reach Cuba and find Trevelyan's secret headquarters before he succeeds with his sinister plot of revenge.It had been six years since the last 007 film (License to Kill), and Pierce Brosnan had finally brought back the style and charm that Sean Connery had originally brought to Bond in the 60's, mixed with the sly humor that Roger Moore instilled into the character during the 70's and 80's.Along with a new Bond, 007 also has a new boss, Dame Judi Dench as \"M\". She is perfect in her no nonsense approach, and has become a staple of Bond films since. Also, new to the series is Samantha Bond as Miss Moneypenny, in which her playful banter back and forth with 007 is reminiscent of the early Connery/Lois Maxwell days of the 60's. Sean Bean makes a really good nemesis to Bond, even though he really isn't in the movie all that much. Famke Janseen's incredibly sexual Onatopp is a throwback to the villainesses of old, and the gorgeous Izabella Scorupco is the best Bond girl in a long while. The impressive supporting cast also includes Joe Don Baker, Robbie Coltrane, Alan Cumming and a funny little cameo by Minnie Driver.This is a really entertaining movie and the best Bond since 1983's \"Octopussy\"."
    },
    {
      "rating": "8",
      "text": "Not being a particularly big Bond fan I wasn't sure what to expect from this but I really enjoyed it. The actual plot about the Goldeneye and what that's all about is a bit flakey but to be honest I never really noticed that because the performances were really good across the board and the action sequences were fantastic. Pierce Brosnan's Bond avoids being arrogant to the point of annoyance like I found other Bonds to do, bringing a fresh-faced enthusiasm to the role. Good fun!"
    },
    {
      "rating": "6",
      "text": "A decent Bond film, Brosnan is very good and Bean also but there are issues with the story and screenplay."
    },
    {
      "rating": "7",
      "text": "The flick, \"GoldenEye\" is certainly one of the best James Bond films ever made (the greatest in the Pierce Brosnan era) so in a film series which encompasses more than twenty movies I would say that is quite an impressive feat. This feature manages to bring to the big screen everything you love about these pictures e.g. large amounts of action, sexy Bond girls and really horrible villains you can't wait to see get their comeuppance by 007. Perhaps the only drawback is the lot itself which takes a backseat to the theme of betrayal."
    },
    {
      "rating": "8",
      "text": "Definitely my favorite Bond movie. Not the best, but it's still good. Pierce Brosnan's debut as Bond is very convincing, and the movie is very fast paced."
    },
    {
      "rating": "10",
      "text": "I believe this was Pierce Brosnan's best Bond film. If this is your first Bond movie and you liked it, watch the older ones first, they are more like this. The newer bond films, with Daniel Craig, are good movies, but they are not the same as the older Bond movies, the older movies center more on action and comedy while the ones with Craig focus on Action. Golden Eye was a great movie with both comedy and action, and a crazy sadist chick, which I found was pretty funny. PS. oo7 is awesome."
    },
    {
      "rating": "8",
      "text": "This movie feels refined and unique. It still feels that way today, it's definitely stylish and puts new cards on the table. It's a wonderful experience and has so many cool moments and the movie is just magnificent in every way. Pierce Brosnan shows he may be the most fun Bond and combines everything of what we loved with previous Bonds and puts them onto his with something new on the table as well. Bond is put up against few of the best villains in the series and up with some of the best action scenes in the series too. Such a great movie and easily one of the best!"
    },
    {
      "rating": "6",
      "text": "On the one side Brosnan is a good Bond, he fits to him, especially the hand fighting scenes are much better than in the last decades. The character Bond was also changing and is interesting here: More serious, cooler and raw.But the story is stupid. Some action scenes are even more ridiculous than in the past Bond movies. In addition some characters in the movie were annoying, because so dumb or feminist (like the new M)"
    },
    {
      "rating": "8",
      "text": "GoldenEye is the Bond movie of the 90s in that the script includes topics such as safe-sex, computer hacking, women in power and the end of the cold war. The overall feel of the movie hasn't aged as well as it could have, however its a fun ride."
    },
    {
      "rating": "3",
      "text": "I watched all 25 from Dr.No to Spectre, I place Goldeneye at 19/25.This is the first Bond I saw as a child, and seeing it again as an adult, I had middling expectations. They were not met.Goldeneye is just poor.A few good points:Decent action, sometimes even impressive (great use of the Arecibo Observatory)A well-played villain with an original backstoryMemorable sound and special effects (Goldeneye exploding over Severnaya)The rest is good for the trash can, I'm afraid.Brosnan was the most deadpan, charmless, expressionless Bond. In his first outing, they tried to make Bond \"new\". So how does the deadpan actor meet his \"novelty\"?Well for example, with Moneypenny.Moneypenny tells him that she's going out with someone. He tries the old-style charm on her. Says \"what am I gonna do without you\".She responds with the \"you've never had me\", in an all too obvious \"free woman that don't need no man\" moment.So here's a thought, when you want to renew your franchise.If you want to replace a very dated trope, that happens to be a witty, harmless, complicit, and charming banter between two characters that were portrayed more or less as equals in their appreciation of one another.Don't replace it with a \"now you don't matter no more because I'm a free woman.\"Because that isn't replacing it, that's just destroying it and replacing it with nothing.M being now a woman is kind of in the same vein. The will to renew a very dated franchise is noted, but falls flat: M supposedly is a paper pusher that isn't respected by Bond's old-style, instinctive methods. Except the entire argument they have falls flat, and it does so twice, too: once when Bond's gut feeling never was going to tell him whether Goldeneye existed or not, and it's just shoved in the dialogue, and the other when M makes a long-winded speech about how Bond doesn't respect her, and how she's a strong woman boss who thinks he's a dinosaur, only to end her speech by looking at him all motherly and saying \"come back alive\".The conversations are just generally fake, the emotion absent, the wit too.Goldeneye is saved by a solid string of good action moments, sound work and special effects.Actors, 0. Script, decent at best. Dialogues, 0. Charm, 0.Not worth rewatching, even drunk."
    },
    {
      "rating": "10",
      "text": "The seventeenth James Bond movie and strong debut of Pierce Brosnan. In hindsight it was also his best James Bond movie. Many see it as relaunch or restart of the franchise because the previous movie License to Kill was too different from the established formula (But is still a really good movie and for some the best entry in the franchise). Because of legal arguments the movie was delayed and at the end Timothy Dalton did not reappear as James Bond. Pierce Brosnan who was a candidate before but could not take the role because of his contract for Remington Steele was available and chosen. The intro flashback shows a mission were James Bond and fellow 006 agent Alec Trevelyan infiltrate a chemical weapons facility of the Soviets. Not all goes according to plans. A few years later James Bond is on a new mission were he has to prevent the stealing of a new type of helicopter which is immune to electromagnetic pulses (EMPs) which is just the first step in a far bigger plan. From here on the story takes momentum. It has a surprisingly well thought out story and great twists. A fine combination of plausibility and fiction that makes it enjoyable. In combination with the great cast we get a remarkable experience and highlight of the franchise. Lets start with Pierce Brosnan. He gives a great first performance and I say while he is not my favorite Bond he makes the best debut until Daniel Craig surpassed him (Sean Connery and Roger more started weaker and improved to their cult status with the later performances;-). There is Sean Bean as Alec Trevelyan aka 006. He is excellent and easily a highlight of the movie. Might be even considered a spoiler that I name him here as Sean Bean is by many called “Spoiler on two legs” as his roles are famous for one thing;-). Then we have a strong cast of women with Famke Janssen as Xenis Onatopp who is a force to be recognized and Izabella Scorupco as Natalya Scorupco who while having no fighting capabilities is not a damsel in distress and can fend for herself with her smart thinking. Also I really enjoyed Gottfried John as Colonel Ourumov and Judi Dench as M. She is a no nonsense leader and terrifying but also someone you want to have on your side as she is capable, smart and has true leadership abilities. Then the humor returned to the Franchise. The Timothy Dalton movies turned down the humor and here they added more (Not on Roger Moore era level). It works well and is fitting. The sets are again amazing as are the gadgets. From Q played by Desmond Llewelyn we got a cool **** and an amazing wheelchair to name a few new toys. The soundtrack has one of my favorite title songs with Goldeneye by Tina Turner. Still high up in the list of best songs in the franchise. Overall this was a refreshing movie and I consider it one of the top movies in the franchise. An easy must see recommendation."
    },
    {
      "rating": "8",
      "text": "To me, even the opening of this film can’t be beat. The movie is a bit slow in the middle though. Most James Bond films are though. FamkeJanssen is the most tempting Bond villain. While Bronson easily does his best work as Bond as well."
    },
    {
      "rating": "9",
      "text": "One of my favourite quotes from this film you know. As for GoldenEye, I consider it the best of the Pierce Brosnan Bond films. Pierce Brosnan makes for a great and likable title character, and Judi Dench is rock-solid as always as M. Izabella Scorupco is a splendid Natalya and I loved feisty Xenia, marvellously played by Famke Janssen, who kills her victims by crushing them between her thighs, while Janus is wonderfully mysterious as a villain. Technically, GoldenEye can't be faulted either. The cinematography is beautiful, while the locations are superb and the stunts perfectly done especially the car chase through the streets of St Petersburg. The music and theme song are very memorable too, the pacing is brisk and the script and plot are well intact. GoldenEye mayn't be the best Bond film ever, but it is for me one of the more enjoyable ones. 9/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "The first and best Bond movie with Pierce Brosnan! It was a shame they didn't make more Bond movies with Timothy Dalton coz I think he was a very good James Bond, but I have to admit Brosnan does a decent job portraying Bond. He's handsome, funny, and sophisticated, although less manly than Connery or Dalton.\r I liked the first scene where 006 and 007 work together, it's refreshing to see Bond have an almost equally good companion. We'll see a similar thing again in Tomorrow Never Dies with Michelle Yeoh.\r Sean Bean as Bonds friend Alec does a good job. The dutch Famke Janssen as Xenia Onatopp is just amazing. She's sexy but lethal!\r Boris Grishenko was very annoying, for sure he was meant to be that way but he really got on my nerves and i wanted to take his pen and shove it up his... the thing on which you sit and you can take it with you!"
    },
    {
      "rating": "10",
      "text": "This is the best awesome bond film ever. Pierce Brosnan is one of the best actors in the bond series. Goldeneye is one of my favourite films of all time."
    },
    {
      "rating": "5",
      "text": "\"Goldeneye\" unveils Pierce Brosnan as the coffee-bar James Bond: mild, fashionable and nice in a very 90's way. Mr. Brosnan, as the best-moussed Bond ever to play baccarat in Monte Carlo, makes the character's latest personality transplant viable (not to mention smashingly photogenic), but the series still suffers the blahs.\r Today's Bond does have the Internet and a credit sequence resembling a pretentious music video. And he has a girlfriend with advanced computer skills (Izabella Scorupco, a deep-voiced model who looks as good as Mr. Brosnan, which is saying a lot). Still, he often seems adrift. And this film is missing such basics as the cold war and the James Bond theme music. The absence of the latter is sure to throw some audience members into a two-hour Pavlovian twitch.\r Judi Dench, as the first woman to play his supervisor, M, is on hand to call Bond \"a sexist, misogynist dinosaur\" so that you won't have to. But the real problem is not a matter of Bond's antediluvian quirks. It's that \"Goldeneye\" bears no stamp of Ian Fleming beyond its title, which was the name of his Jamaican home. This film's screenplay, by Jeffrey Caine and Bruce Feirstein from a story by Michael France, features only flat repartee and fairly desperate homages to the Fleming style.\r And so many other action films have borrowed from the Bond formula in the 33 (yes!) years since \"Dr. No\" that this one has a hard time looking special. A plane, a motorcycle, a huge dam, a bungee jumper and nerve gas all feature in the opening sequence, yet it still lacks the novelty that starts the best Bond films off with a bang. And Mr. Brosnan, who makes a fabulous clothing model and has mastered the one dramatic mode this role requires of him (wry), is not at his most believable during action scenes. When Bond rides in a tank through St. Petersburg during a scenery-crunching chase scene, Michael Dukakis comes to mind.\r Clinging desperately to the idea of Russian villainy for old times' sake, the plot involves Russian gangsters trying to exploit a secret space-based weapons program to sabotage financial markets in the West. And its chief villain is 006 (Sean Bean), who was once Bond's colleague and now calls him \"Her Majesty's loyal terrier.\" Beyond this, it's enough to note that character actors include Robbie Coltrane as a Russian hood and Joe Don Baker as a C.I.A. man, and that settings can be drably industrial unless the film is pointedly visiting Switzerland or the Caribbean, where it practically screams about the scenery.\r Though 006 has the poor form to bait Bond about his past, wondering theatrically whether all those vodka martinis can silence the screams of all the men Bond has killed, most of \"Goldeneye\" is relatively restrained. Martin Campbell, who previously directed the sci-fi prison film \"No Escape\" with Ray Liotta, supplies shootouts and explosions at reliable intervals, and without any special frills. The film's gaudiest feature is a vicious Russian named Xenia Onatopp (Famke Janssen), who bites and claws her lovers and has a way of confusing sex with death. Her nutcracker thighs, not to mention her name, suggest that the Bond babe is as ready as 007 was for a timely overhaul.\r In the product-placement department, BMW, Perrier and the becoming Bond wardrobe are all advertised. \"Goldeneye\" is as much a merchandising event as it is a wishfully nostalgic movie."
    },
    {
      "rating": "8",
      "text": "People don't change, do they? A James Bond in a changing world with new customs, but not totally him. The formula of the series is present but it feels like some of the inertia of the previous movies is missing. But I don't want to say that this new chapter is bad."
    },
    {
      "rating": "7",
      "text": "aka. The only GOOD  Bond film to star Pierce BrosnanI will always have a soft spot for this particular entry because it is the first 007 film I ever saw and there is also the added nostalgia of the then revolutionary N64 video game.While the script is far from the greatest, the tight glossy direction provided by Martin Campell (Casino Royale, The Mask of Zorro) and abundance of great action sequences (Ex. Bond bungie-jumping off a dam, the tank chase) more than make up for it.This particular entry also has arguably the best group of villains out of all the Bond films that includes the S&M-obssessed Xenia Onatopp (greatest…name….ever), the hilariously over-confident computer hacker Boris Grishenko and the always awesome “dies in almost every movie” Sean Bean as the treacherous 006.Although the video game admittedly had a WAY better soundtrack than the one provided by Eric Serra (The Fifth Element, Leon: The Professional) for the film."
    },
    {
      "rating": "4",
      "text": "And he is here, the ultimate saviour of the franchise, he is going to line up quite an audience to watch him do, well, anything.GoldenEyeCampbell raises the bar. It was light and easy to do so, and yet he failed to place it in the major leagues. The franchise does this every time, they take a big break and hype up their upcoming project and tease the fans to a degree that they go vulnerable enough to chug up any bizarre made up story that somehow revolves around the same cheesy, ethically wrong icon. And I guess, it's that very same controversial debate that what is it so absorbing to watch three hours of gangsters creating havoc and still root for them. But at least, there is some sort of originality and authenticity in every new version of Martin Scorsese's mean street boys.Here, this almost a Royale personality, has been revoking his license for commercial cinema as a get out clause which never was and shouldn't be an excuse to low quality cinema. And Martin Campbell, the director, isn't adding anything new to it, yet with such huge fumbles in the past, this seems like a project where a lot of work was put on. And similar is our new hero Pierce Brosnan ready to be drooled over, he puts on a lot of effort even in the long chase sequences, unlike Roger Moore he doesn't just sit by in a boat.But what comes in natural to Brosnan; a highly appealing personality, is never reflected back by him with equally sincerity. And when he does work hard, his performance makes sure you are aware of it, such an effortful is his process and painful our experience. Sean Bean, a worthy foe sweats hard for it just like Famke Janssen who yells loud for the effects, combining them lies a noteworthy set of evil partner which is undermined by Brosnan's stealy cold look with his blue-grey eyes and yet they called it a GoldenEye."
    },
    {
      "rating": "6",
      "text": "Directed by Martin Campbell and produced by Barbara Broccoli (daughter of Albert Broccoli, who stepped down for health reasons), has screenplay by Jeffrey Caine and Bruce Feirstein, and is the seventeenth film in the franchise. It was produced after a long gap of six years, due to legal problems involving firms that had rights to the franchise. And it's very different from what was in the eighties, beginning with the cast: a veteran Judi Dench gave life to M, and for the first time the role was assigned to a woman; the role of Miss Moneypenny was awarded to Samantha Bond and 007 was assigned to Pierce Brosnan. From the list of previous films only survived Desmond Llewelyn, the eternal Q. In the film goes even Izabella Scorupco in the role of Bond-girl Natalya, Joe Don Baker in the role of Jack Wade, Robbie Coltrane in the role of Valentin Zukovsky, Alan Cumming in the role of Boris, Famke Janssen in the role of Xenia Gottfried John in the role of General Ourumov and Sean Bean in the role of villain Alec Trevelyan.In this film, James Bond seeks to combat Janus, a powerful criminal who stole a Russian mass destruction weapon, Goldeneye. To stop the villain that threatens to destroy London, he will ally Natalya, a Russian expert computer working on the Goldeneye project before it being stolen.This is the first Bond film to be released after the end of the Soviet Union, when the film industry had questioned the appropriateness of continuing the franchise. Despite the doubts, Pierce Brosnan took the role and the task of bringing his character to a new era of \"invisible enemies\" (using the words that M will say in \"Skyfall\", ten years later, when faced with precisely the same doubts). Although not one of the best films of the franchise, \"Goldeneye\" knew, in fact, update it. Brosnan is not surprising in his role but can be up to the challenge. Surprising is Judi Dench, in the role of M, achieving a remarkable performance. Its the first time that MI6 boss assumes a major role in the plot, and shows even little appreciation for Bond, considering him a relic of the past and something to be discarded, as to seem a form of play with the criticisms made to the franchise before the film's release. The chosen locations are excellent and some of the film's scenes are worthy of memory. This is the case of the tank sequence in St. Peterburg's streets, or the final fight in the antenna. The script is also well thought out, despite having decided to completely ignore the novels of Ian Flemming. The story revolves around the end of the USSR and the \"remains\" that were all this past: we do not speak only of weaponry but also of people, as Bond and Alec, were marked by decades of cold war. The theft of Russian weapons may be the introduction of the new Bond world of terrorism? Perhaps. The opening theme of this film, sung by Tina Turner and consists of Bono, in my opinion, one of the best of the entire franchise."
    },
    {
      "rating": "4",
      "text": "A movie more suited to Timothy Dalton isn’t nearly as good of a fit for Pierce Brosnan. He looked pretty uncomfortable and unsure of himself, not what I expect for James Bond. Timothy Dalton displayed more confidence and charm in The Living Daylights ( less so in Licence To Kill but that had more to do with the rubbish script and direction than his abilities). A shame that after the promise the Dalton era showed for the series with it’s more gritty and down to earth approach that the series headed right back to the worst aspects of the Roger Moore and Sean Connery era immediately after this movie. I blame a good chunk of that on Brosnan as he didn’t have any real vision for the character. He’s full of fluff when he talks about this so called vision he had of making the character more like he was in the novels. The World Is Not Enough and moments here and there were the closest he ever got. Most of the time he was just a pale imitation of Roger Moore and Sean Connery. His initial goal was to blend the 2 actors and their take on the character with somewhat of the more gritty Dalton take but it never quite got there."
    },
    {
      "rating": "7",
      "text": "This explosive, thrill-packed adventure pits James Bond against a vengeful adversary who controls an awesome space weapon capable of global destruction. (MGM)"
    },
    {
      "rating": "10",
      "text": "The best James Bond film, and an extremely fun adventure from start to finish with a great balance between a serious and weighty plot with the humour and charm of the Bond character."
    },
    {
      "rating": "8",
      "text": "GoldenEye ... Oh ... how much I liked GoldenEye. I was very happy for the change of actor, because I didn't have to do Dalton much and on the contrary I consider Pierce Brosnan to be the best actor Bond. The plot is very famous. Location as if you were. The tempo is also great and I really enjoyed the whole movie. The end is great and for me it's just one of the best Bonds ever."
    },
    {
      "rating": "9",
      "text": "I think this Brosnan's best film as 007. Right from the start, Brosnan knows just what to do and gives off so much charm and class. The film bringing in another 00 agent and having him become the main villain is just done so well, more so with great acting with Sean Bean. The action is thrilling and will keep on you on the edge of your seat the whole time, like the opening plane scene, the tank chase, and explosive finale on the telescope. Even more than 25 years later, still holds up as one of the finest Bond films."
    },
    {
      "rating": "10",
      "text": "Stary dobry film Najlepszy. Bond też najlepszy. Polecam.Bpnd jechał BMW Z3."
    },
    {
      "rating": "7",
      "text": "Brosnan marks a solid debut with a brisk debut that takes Bond back to his roots."
    },
    {
      "rating": "7",
      "text": "Pierce Brosnan makes his acting debut as James Bond in the first film set after the Cold War. In this film, Russian bad men seize command of a unique space weapon. This gadget, which can send out EMPs that destroy all technology in the affected areas, is essentially a gigantic satellite nuke that is controlled by a \"golden eyed\" apparatus. Combining this with their brand-new assault helicopters, which are immune to EMPs, creates a serious issue. Before the terrorists strike the UK and then the rest of the world, James must put a stop to them. This film reveals a beloved aspect of James Bond. Offering endless one-liners with a strong erotic appeal"
    },
    {
      "rating": "10",
      "text": "Easily one of the best Bond movies ever made, with a great mix of action, characters, humor, and all the other aspects we come to expect from the 007 franchise. Also one of the few Bond movies to have a truly powerful heroine in it in Izabella Scorupco's Natalya Simonova."
    }
  ],
  "recommendations": [
    "the_spy_who_loved_me",
    "the_man_with_the_golden_gun",
    "the_world_is_not_enough",
    "from_russia_with_love",
    "octopussy",
    "casino_royale",
    "tomorrow_never_dies",
    "diamonds_are_forever",
    "for_your_eyes_only",
    "die_another_day",
    "no_time_to_die",
    "indiana_jones_and_the_last_crusade",
    "spectre",
    "you_only_live_twice",
    "thunderball",
    "true_lies",
    "the_incredible_hulk",
    "unforgiven",
    "captain_america_the_winter_soldier",
    "the_rock",
    "lethal_weapon",
    "spider_man_homecoming",
    "entrapment",
    "spider_man",
    "the_hunt_for_red_october"
  ]
}