{
  "id": 1783,
  "title": "Gone in Sixty Seconds",
  "starring": [
    "Nicolas Cage",
    "Giovanni Ribisi"
  ],
  "runtime": 118,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "Upon learning that he has to come out of retirement to steal 50 cars in one night to save his brother Kip's life, former car thief Randall \"Memphis\" Raines enlists help from a few \"boost happy\" pals to accomplish a seemingly impossible feat. From countless car chases to relentless cops, the high-octane excitement builds as Randall swerves around more than a few roadblocks to keep Kip alive.",
  "releaseYear": "2000",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qo5Ifam64rDlp4oprXGhK5X0qIs.jpg",
  "categories": {
    "plot": 5.375,
    "acting": 5.875,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.583333333333333
  },
  "reviews": [
    {
      "rating": "9",
      "text": "One of my favorite movies. I'm not really sure why. I like cars, I like heist movies, I adore Angeline Jolie. Indifferent about Cage.\r As I said, I don't know why I really like this movie. I just do. I can watch it over and over, and I never get tired of it.\r Overall:\rI know this isn't a great movie, but it is a guilty please that I just can't turn away from."
    },
    {
      "rating": "8",
      "text": "WTF how does this movie have a sub-40 score on this website?Come on now, this is obviously not the best movie ever, but it certainly does not deserve a rating in the 30's.This movie has plenty to enjoy - Angelina Jolie, Nick Cage, awesome cars, and of course....\"Eleanor\".This movie was so influential that plenty of people spent upwards of $100k to have a replica of Eleanor made for themselves...ya know, not me, but rich a&&holes."
    },
    {
      "rating": "10",
      "text": "still watching it in 2019! its a great action movie film. critics don't know what they are talking about..."
    },
    {
      "rating": "7",
      "text": "Awesome movie. Cool cars and great acting. Giovani, Cage and Jolie command your thoughts. The problem,  just another action film with a clasic ending in hollywood."
    },
    {
      "rating": "1",
      "text": "a stupid movie about criminals doing horrible things. It is not about the love of cars, it is about some bastard criminals stealing them. Horrible movie in my opinion. It's also a bad influence on young people, glorifying criminals. Always the same **** Horrible disgusting action scenes involving criminal activities. Doesn't interest me a bit. Why always the same nonsense?"
    },
    {
      "rating": "4",
      "text": "This is a car movie, a heist movie, and a Nicolas Cage movie. If you understand and accept these things about it ahead of time you'll be okay with this movie. However, even from that perspective, this movie isn't that great. There's better car movies, there's better heist movies, and there's even better Nicolas Cage movies.\r A lot of the characters are a little flat and samey. A lot of the cars they talk about don't get much screen time; since they need to deal with 50 car car thefts in one night they don't have enough time to really show any particular car. The action sequences are good but nothing phenomenal.\r This is the kind of movie you should maybe watch once just to have seen it, but that's about it."
    },
    {
      "rating": "3",
      "text": "A laughably poor pass for an action flick.\rI was literally Gone in 60 Seconds with a horribly simplistic and terribly unrealistic plot with poor acting, and despicable slothfulness from the screenplay."
    },
    {
      "rating": "3",
      "text": "Laughably bad, brain-melting action goo."
    },
    {
      "rating": "5",
      "text": "Outro filme mau produzido, sem roteiro as cenas de ação são tediantes os personagens estúpidos e a trama francamente uma das mais ruins que ja vi,  quase um péssimo filme."
    },
    {
      "rating": "6",
      "text": "Classic mainstream action movie with over the top scenes, superficial characters and holes in the story. Anyway the tempo is good, so the movie is not boring."
    },
    {
      "rating": "7",
      "text": "Definitely a cheesy action movie but it was fun to watch.  I will say that this movie is just as good as the first two fast and furious movies and the acting was actually pretty good."
    },
    {
      "rating": "9",
      "text": "This movie is never going to be a great \"think\" piece but it was never intended as such. It was intended as an action adventure escape from the pressures of real life. The cars are fantastic, the chase scene is fantastic, and - here's a welcome departure from the norm - we get to see an action film with characters played by people with actual talent. (i.e. Ribisi, Cage, Jolie, Duval, Patton) As for the morals police out there, remember that all of these characters, save Atley Jackson, had left the business and only came back in to save Kit. Also, when all is said and done, all the characters young and old have decided to live a \"straight\" life. So if you truly believe the only time we can appreciate the human experience is if those humanas are a pious as you obviously view yourself to be, then I suggest you stick to the Left Behind series and leave the movies about real life and real people to those of us sinners who can not only accept faults in others but recognize them in ourselves as well."
    },
    {
      "rating": "4",
      "text": "Movies about cops and robbers are a classic theme of cinema. The organized crime, in turn, is an undesirable reality. This film is excellent when trying to portray the methodical way in which these thieves act, even from a pure and unpretentious fiction film, which doesn't want to be an artwork but merely entertain its audience and give us good action moments. Pursuits that look like street racing, shootings, almost-ruthless bandits, resolute policemen and a good guy trying to help his troubled brother. Oh, and Angelina Jolie playing a character who takes advantage of her physical attributes.The script, of H. B. Halicki and Scott Rosenberg, has nothing extraordinary except the huge amount of cars to steal. But the script falls into an error of many theft films by making the thief a true hero. Memphis Raines (Nicolas Cage) is a retired thief who is forced to steal to save his brother. He acknowledges that is wrong and tries to prevent his brother from stealing but, if we exclude this ideas, the rest of the film is like a \"glorification\" of car theft. At this point, the script needed to have been amended. I think this film could be more interesting with some more profound psychological conflicts surrounding that, and that troubled familiar relationship. Our society is quite degraded today, why not explore the conflict \"good vs. evil\" in another way, instead of making the street villains the good guys? The film has two very good things. First, it has a star cast led by Nicolas Cage, Angelina Jolie, Robert Duvall, Giovanni Ribisi, Christopher Eccleston, among others honorable names. A cast too good for this kind of movie. Maybe the film would gain if the director and the writers had been more demanding with the actors, pushing them to their best and allow them to explore the full potential of each character, but this did not happened. For example, Jolie's character simply does not make any honor to her talent. Its just body. Second, the action scenes. Some of these are classical, but are always well, and the visual and sound effect make them even better."
    },
    {
      "rating": "8",
      "text": "Love this movie growing. Before the Fast & the Furious, there was Gone in 60 Seconds. Nicholas Cage and Angelina Jolie. Awesome movie!"
    },
    {
      "rating": "8",
      "text": "⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙》⊙@;@;@;@;@;@;@;@;@@;@;@;@;@;@:@:@:@:@:@:@:@:@:@:@:@:@:@:@"
    }
  ]
}