{
  "id": 4087,
  "title": "Gone Baby Gone",
  "starring": [
    "Casey Affleck",
    "Michelle Monaghan"
  ],
  "runtime": 113,
  "genre": [
    "Crime",
    "Drama",
    "Mystery"
  ],
  "description": "When 4 year old Amanda McCready disappears from her home and the police make little headway in solving the case, the girl's aunt, Beatrice McCready hires two private detectives, Patrick Kenzie and Angie Gennaro. The detectives freely admit that they have little experience with this type of case, but the family wants them for two reasons—they're not cops and they know the tough neighborhood in which they all live.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oGzH1P6w59UlkbxivvmHsiGsUKG.jpg",
  "categories": {
    "plot": 5.703703703703703,
    "acting": 6.966666666666667,
    "ending": 6.888888888888889,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Oscar-worthy.High five to a talented filmmaker."
    },
    {
      "rating": "10",
      "text": "Powerful! A mystery that twist and turns, compelling ethical dilemma, and really exciting! The best movie I've seen this year."
    },
    {
      "rating": "10",
      "text": "Quite powerful and thought provoking. Exactly what a film like this should be."
    },
    {
      "rating": "7",
      "text": "Child gets kidnapped, Aunt & Uncle hire detectives to find her, Police already investigating, things go wrong.Ben Affleck's directing debut which is a very real story based in the Boston area.Some of the accents are quite hard to understand at times but the acting is good & the twists & turns in the story work well."
    },
    {
      "rating": "8",
      "text": "A gritty down and dirty Boston flick that leaves you pondering questions that you may find you don't have an answer for. If you are the type that doesn't enjoy a movie with a happy ending that don't even put Gone Baby Gone into your DVD player as it will leave you with an empty feeling inside and will eat away at you logic and ethical viewpoints. If on the other hand you can handle a depressing ending than Gone Baby Gone is a movie that provokes a myriad of question and ethical discussion topics while also providing top notch acting and superb directing by first timer Ben Affleck."
    },
    {
      "rating": "9",
      "text": "This is a remarkable film.This proposition of every single detail is stunning.By the rule of the movie was going sometimes they missed some emotion and Technics.And the acting was great"
    },
    {
      "rating": "5",
      "text": "This movie was JUST OK. It had some good moments, but it has a lot of problems. The structure is weak, the story itself aint great, but some of the performances are good. It's great to applaud people when they try new things (Ben Affleck directing) but let's not lose sight of the overall picture. As a first time director, he did a great job - kudos - but the movie itself is not better than \"We Own The Night\" or \"Rendition\" movies that scored much lower here."
    },
    {
      "rating": "0",
      "text": "Wow what a HORRIBLE MOVIE!!! Monotone dialogue, cliche story. Embarrassing for both Affleck's!"
    },
    {
      "rating": "3",
      "text": "Exactly one hour into \"Gone Baby Gone\" a brain-numbing, dog ear-twitching screech sang out across the theater. I looked 'round the seats, and to my left wrist, and realized that film had come to a shocking, sudden halt. But...no...no...here we go...it slowly started up again, like the T departing Ashmont station, and continued on for a complete second hour, before finally docking in a not-believable, yet still debate-inducing, last few scenes. Now, I'm not prepared to say Ben Affleck's direction is straight bad. In fact, the first half is actually pretty good, combining different cut styles, varied pacing, and a knock-out performance from Amy Madigan (PS. engrave her name on an Oscar). But once the plot starts twisting, it's like a snake in Affleck's hands. Even Casey's performance veers off into boredom. Ultimately, the film's only saving grace is the philosophical question it poses: What is \"best\" for a child, and who gets to decide? But even that plays out in a kind of surreality which never makes clear why a woman like Helene would get to keep her child, and how the kidnappers thought they'd get away with it. As for the setting, Affleck does a great job at protraying the true grit of Boston's outskirts (an image I hope its residents soon attempt to improve). Based on his name, he's got a long directorial career ahead of him, and based on the first half of \"Gone Baby Gone,\" he's got potential to work with."
    },
    {
      "rating": "5",
      "text": "There is some great local color, nifty action, nice moral conflict and a couple credible performances (Affleck and Harris), but this falls short of being the a cool movie it could have been because of its unforgivable performances (the abducted girl's mother), some weak ones, an overall lack of clarity and, guess what, there's a reason there are no detective stories where the guy brings his girlfriend along with him as he solves the crime, it's because she'll RUIN EVERY SCENE SHE'S IN."
    },
    {
      "rating": "5",
      "text": "Really good acting, but.....the story was disjointed. I was disappointed."
    },
    {
      "rating": "5",
      "text": "More overrated, predictable tripe. Laughable action scenes in beginning. Cringeworthy, long-winded expository speeches at the end. Affleck shows hack ability as director--film looks good, but inability to coax performances out of anyone but his brother is fatal. Reaction shot after reaction shot---embarrassing."
    },
    {
      "rating": "0",
      "text": "This is not an original movie. This is almost an exact copy of \"Along Came a Spider.\" I had to ask myself for a refund cause it bored me and the plot was so obvious."
    },
    {
      "rating": "1",
      "text": "Major flaw-if Affleck's character was so morally righteous to expose Freeman and his associates, why does he hide the fact he murdered a man by shooting him in the back of the head?"
    },
    {
      "rating": "3",
      "text": "This movie is pretty bad. It was slow, drawn out had too many twists that were not really twists and it was just plain boring. The only good part (which earned it a 3) was the end where it forced you to think about your own moral compass and which way it would have pointed you. It also shows the nature of people thinking they know what's best for other people. I like movies that have a point but I didn't like having to suffer through this movie only to see the point in the last 5 minutes."
    },
    {
      "rating": "4",
      "text": "Very disappointing! I wanted to like it, but the story jumped around so much, I could not get into it. I'll admit, I read the book it's based on, which is very good, but they were unable to bring it through clearly onscreen. You never get a chance to know the characters at all. Looks like they fooled a lot of critics though. Again, I am so disappointed!"
    },
    {
      "rating": "5",
      "text": "Being from Boston, I was really looking forward to this movie. I had heard great things about it, but was really let down. I'm not sure what all the hype is about. Sure, it's pretty authentic to the local flavor and some great Boston accents. Other than that, the plot kind of fell flat. I didn't feel any connection to the characters, was bored for the first 45 minutes, and found myself wondering what I was missing."
    },
    {
      "rating": "4",
      "text": "The Affleck's doesn't have so much sympathy on the screen.Casey is bad, he was the perfect guy to be Robert Ford in The Assassination of Jesse James By The Coward Robert Ford though. Anyway, this movie could be the greatest in 1992, not in 2007. It has so many cliches and the script has so many lacks... I can't imagine how the crictics figures out this movie could be good."
    },
    {
      "rating": "3",
      "text": "This movie is not very good. at all."
    },
    {
      "rating": "3",
      "text": "People who reacted negatively to Gone Baby Gone are probably missing the point. It's not about plot twists, or predictability, or the fact that the story is dark. ( Review from Chris ) How can you skip over these points.I thought films made you want to watch them not endure them.Gone Baby Gone is predictable, dragged out and has more plot holes than a swiss cheese. Yes it did provoke some thought at the end and for that it get 3 points. The other 90% of the film unfortunately fits into my most hated category. Not quite bad enough to laugh at not good enough to be immersed in or taken somewhere. I would say avoid this film however I am fairly sure my review will not be popular."
    },
    {
      "rating": "9",
      "text": "Thoroughly disturbing. Well filmed. Well acted. This is not a movie for the lighthearted. See it and judge for yourself"
    },
    {
      "rating": "4",
      "text": "How did Casey Affleck get a role for which he was quite clearly unsuited? What was the director thinking? Er...Oh.A strangely-accented Affleck Junior is woefully miscast in this slightly clumsy, over-simplified version of the Dennis Lehane novel. Read the novel, if you like that kind of thing. Don't see the movie. One rare true note is struck by Amy Ryan who plays the conflicted, unsympathetic mother perfectly."
    },
    {
      "rating": "5",
      "text": "It wasn't awful. I didn't find this movie to be boring at all. I enjoyed it because it managed to built suspense and raise curiosity about the resolution. But there are so many things holding Gone Baby Gone back. For one, it was confusing. Simple as that. Two, Casey Affleck. Not only was his character flat and uninteresting, but I also didn't buy a word he said, especially when he tried to be a tough guy with his fighting words and his pistol whipping. Every time he started intimidating guys in bars or giving some morally self-righteous speech about why other people are wrong I just said \"Please.\" He was very much a typical protagonist in a Hollywood film and not at all a real person. Three, the scene when Ed Harris is questioning the mother in her house is just awful. It's full of cliches and pointless yelling (ex: Harris sweeping all the bottles off of the kitchen table in a burst of anger and then firmly slamming his palms on the table and demanding answers). And four, it is really a ridiculous plot when you think about it. Just listen to it (Spoiler Alert): A seventy something year old police chief looses his 12 year old daughter. Then he spends decades surrounded by the impoverished and unfortunate youth of the drug and violence ridden neighborhoods of Boston. So, for no reason, all of a sudden he decides to kidnap one random white girl and take her home after forty years of never doing anything like that even though he's seen kids lives go down the drain ever day. Not only that, it wasn't really his idea. It was suggested to him by some other cop (Harris) who also seems to gain this desire to \"give a kid a chance\" out of nowhere. And the other main cop involved (Affleck) has a seemingly healthy relationship with his girlfriend. But that relationship ends with no discussion or second thoughts when they have a minor ethical disagreement even though they both meant well. Also, for some reason, this also boring and undeveloped character of a girlfriend cries herself to sleep every night when she thinks the little girl is dead, even though she never met this girl and has only been on the case for a few days. The same unrealistic emotion seems to exist with the aforementioned police chief and his wife when they kidnap the \"lost\" girl. After keeping her for a week, they are all of a sudden unable to be separated form her and the cops have to pry the child from the wife's arms while she breaks down in tears. In the end, it entertained me and made me think...but I didn't buy any of it."
    },
    {
      "rating": "10",
      "text": "Awesome flick. Great movie about right and wrong and what one has to go through to make the right choices. Awesome performances from all and Casey Affleck (despite some critics views) is perfect for the lead. Gritty, powerful, and thought provoking. Well done."
    },
    {
      "rating": "9",
      "text": "There is a compelling ethical question raised skillfully that will haunt viewers."
    },
    {
      "rating": "6",
      "text": "The Bottom Line here is that the Afflecks bit off more than they could chew. This story needed seasoned craftsman of story-telling, not a couple of novices."
    },
    {
      "rating": "8",
      "text": "Duality of man at it's peak... Left me asking questions about the kinds of moral choices we all have to make. Affleck gets a little pretentious in his extra shots like other actors this year, but overall the writing is great, the revelations are surprising, and the acting and characters are so real I felt like I know Boston now. Go see it!"
    },
    {
      "rating": "8",
      "text": "Am a huge fan of Lehane's Kenzie and Gennaro novels and walked into this a bit skeptical that Afflecks and co. could pull of the big screen translation. Happily, I was wrong--though there is little 'happy' in this dark and morally ambiguous story. One review above notes rightly that Michelle Monaghan's role has been sharply reduced from the book. Since the doe-eyed Monoghan's miscast as the whip-smart Gennaro, that may be just as well. The younger Affleck, who at times looks like he's 17, more than picks up the slack. His seething performance is frequently terrific, as is the direction. A borderline-great but frequently difficult film."
    },
    {
      "rating": "7",
      "text": "An excellent directorial debut following his under-rated role in Hollywoodland, you don't have Ben Afflect to kick around anymore! Even better is the direction he has given his brother Casey to the top of the actor want-list and a good shot at an Oscar nomination. Gone Baby Gone is a great suspense thriller with a cast that acts up a storm and a probable Ensemble nomination from the SAG. Welcome back Ben, we knew the wait would be worth it!"
    },
    {
      "rating": "7",
      "text": "Go see it. Would like to have seen more about their relationship before this case. Like why such a wimpy guy is perceived as a toughie! Great story, great acting."
    },
    {
      "rating": "7",
      "text": "The character-driven scenes are great. Affleck has an ear and an eye for body-language and dialogue, and his cast responds with gusto. But he still has a lot to learn about telling a story. The central ambush scene is almost incomprehensible, and crucial plot twists are sprung on the viewer with little or no set-up."
    },
    {
      "rating": "8",
      "text": "This is a solid film with a great conflict at its core. Casey Affleck is great here. Michelle Monaghan is great, though I wish we saw quite a bit more of her character. I'd also say that the editing choices felt just a tad slow at times, especially the shot at the end with Casey watching TV."
    },
    {
      "rating": "9",
      "text": "Thought-provoking with an excellent cast even down to the extras who looked 100% authentic -probably because they were. This movie deserves more credit than the critics have given it. Ben Affleck has more than made up for Gigli."
    },
    {
      "rating": "9",
      "text": "Great plot twists that keep you on the edge, in the beginning and end. The middle gets a little slow, but overall, this is one of the best movies of 2007. Raises great ethical questions that leave you thinking. These are the kinds of films that America needs!"
    },
    {
      "rating": "10",
      "text": "Being from the Boston area, I can truly say that Gone Baby Gone really captures the true essence of the city and it's slums."
    },
    {
      "rating": "7",
      "text": "Patrick(Casey Affleck) and Angie(Michelle Monaghan) are a handsome couple. Whatever room they're in, the baby-faced detectives turn heads. Smarter, thinner, and more well-rounded than the rest, better days are ahead for Patrick and Angie if they get lost. But he's happy here. He thought she was happy, too. Circumstances change, however, like in Sam Raimi's \"A Simple Plan\", and their love is put to the test. When Patrick decides to follows the letter of the law in \"Gone Baby Gone\", Angie realizes that she and her high-school sweeheart have grown apart. Casey needs to endorse his neighborhood, so he does \"the right thing\". He needs to defend his life, her life, and their life together. But Angie only wants what's best for Amanda. F*** ego! That's a man issue. Patrick may have the authority to prevent a little girl from escaping working-class Boston, but not a grown woman, who probably has grown tired of being a Jane Austen character. Next time, she'll go for a rich man."
    },
    {
      "rating": "8",
      "text": "I'm giving it an 8 only because it was so damn rough and uncomfortable to watch at times. I can't remember the last time I heard a woman annunciate the C word in a movie with such conviction. I'm no prude and I've seen hundreds of caustic movies before, but I guess unlike the Pulp Fiction's of the movie world which are pure in your face nihilistic entertainment, the subject matter in Gone is about as dreadfully real as one can possibly imagine and one that every parent on earth shivers at the thought of. The direction was nothing new but B. Affleck did a great job with what he has learned in the past, whether studying other directors or learned what not to do while on the other side of the camera. And how Amy Ryan didn"
    },
    {
      "rating": "9",
      "text": "This movie is what you call a can't miss movie it has all the makings of a great film and let me be say that it is a great crime film at that, probably one of the best since Street Kings and Narc. It's execution and style almost borders on Noir and it does so with oh so much style and grace. Ben Affleck proves that he's as good an actor and screenplay writer(Good Will Hunting) as he is a director. Ben Affleck surpasses his previous screenplay which he won the Oscar for( which was just as good here) and creates an intricately woven and malicious Crime Mystery. When I first heard about this movie I had absolutely no interest in crime films I was more into Sci-Fi then crime. But now after almost three years and finally deciding to see this film I'm glad I did. This crime drama is powerful in it's execution and sinister in it's play on words and scenarios. It moves along like a wicked little machine taking you here and there and everywhere in it's story all the while keeping you totally in tune with the plot and the going on's of the film. It's so wrapped up in it's story that when you start watching it your slowly but surely drawn in and to tell you the truth this movie won't let you out until it's over and done with. This movie has a very well rounded cast of actors that all display there talents above there normal status quot, Casey Affleck is one who stood out in this film his strong performance drove this film and made it something more than just your run of the mill crime film, his performance stole the show him and Ed Harris blew away anything they've done in the past and have made a strong stand here and came out on top. Michelle Monaghan was beautiful as always but she got sandwiched by Cast Affleck and Ed Harris' strong performances and is almost a throw away in the film(which her character was anyways.) Morgan Freeman who's small but pivotal role was not a scene stealer but he did exceptionally well for the time he was on screen. All in all this film is something you can't miss, it's a study in the devious corrupt nature of man and the true meaning of justice for children. It's a film that you can see over and over again and it will still have the same affect as the first time you watched it. It's a devious ride of sin, lies , love and making the right choices even if they affect those around you. Gone Baby Gone is a movie that is going down in the crime section as one of the best of all time, and it rightfully deserves it this films delivers non-stop mystery and deceit that is hypnotizing and engrossing, All in all this is a can't miss thought provoking Crime drama that must be seen to be believed. Gone Baby Gone delivers."
    },
    {
      "rating": "10",
      "text": "Very good movie, one of the best endings that i can remember. Definitely recommend watching."
    },
    {
      "rating": "9",
      "text": "Slow at first but picks up speed and leaves you really thinking about whats best for children"
    },
    {
      "rating": "6",
      "text": "After an engaging and reasonable 45-55 minutes, the film descends into the ridiculous. Only Casey Affleck, Amy Ryan, and fair to good production values keep me from giving this a 4."
    },
    {
      "rating": "10",
      "text": "Great film of 2007!"
    },
    {
      "rating": "10",
      "text": "One of the best this year! Casey Affleck is a star."
    },
    {
      "rating": "8",
      "text": "Amy Ryan and Ed Harris are going to be players in the oscar race. Affleck's screenplay could get a nod as well. Tight, well done film"
    },
    {
      "rating": "9",
      "text": "Definitely not a feel-good movie, but it's an excellent film. One of the most realistic pictures I've seen in a long time. Kudos to Ben and his little brother. Honestly, I went to see this because of Morgan Freeman, but Casey caught my attention more than Morgan did! Hard to outshine the great MF, but I feel like Casey did it here."
    },
    {
      "rating": "10",
      "text": "I loved the movie. Simple as that. It made me think - a Hollywood movie hasn't done that in a long time. I really couldn't tell this was a first-time director's work. Kudos all around."
    },
    {
      "rating": "10",
      "text": "The return of Ben Affleck has come, hard. Never acknowledged as a great actor, Ben Affleck did, once, contribute something of quality to the world of Hollywood cinema: he co-wrote 'Good Will Hunting'"
    },
    {
      "rating": "8",
      "text": "Great movie except the ending was too depressing."
    },
    {
      "rating": "9",
      "text": "Best ending to a moral thriller ever!!! The script and acting were top notch!!!"
    },
    {
      "rating": "8",
      "text": "Excellent movie....would be better only with English subtitles as the Boston accents at some times are over the top and render some of the dialogue indecipherable...."
    }
  ]
}