{
  "id": 1815,
  "title": "Good Will Hunting",
  "starring": [
    "Matt Damon",
    "Robin Williams"
  ],
  "runtime": 127,
  "genre": [
    "Drama"
  ],
  "description": "Will Hunting has a genius-level IQ but chooses to work as a janitor at MIT. When he solves a difficult graduate-level math problem, his talents are discovered by Professor Gerald Lambeau, who decides to help the misguided youth reach his potential. When Will is arrested for attacking a police officer, Professor Lambeau makes a deal to get leniency for him if he will get treatment from therapist Sean Maguire.",
  "releaseYear": "1997",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bABCBKYBK7A5G1x0FzoeoNfuj2.jpg",
  "categories": {
    "plot": 8.342857142857143,
    "acting": 8.545454545454545,
    "ending": 8.5,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.5,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is a great movie.  I got out of it that it is a sham that without pushing that a life would be wasted and I can\"t stand wasted lives.  he wasn\"t even on drugs.  It also stresses the importance of getting your emotional stuff in order.  Untill that was in order, he had no faith in himself.  I guess your environment really really determines that.  Great movie.  you can learn so much from it.  That is why I am not into action movies because I can\"t learn much from them that I can\"t use in life if you know what I mean."
    },
    {
      "rating": "9",
      "text": "Good Will Hunting is a dumbfounded wonder of a movie. With exceptional performances from Robin Williams, Matt Damon, and wait... Ben Affleck (oh and he co-wrote the movie with Matt Damon)."
    },
    {
      "rating": "10",
      "text": "Brilliant script and great direction, Good Will Hunting is a must-see movie. Amazing performance by Matt Damon. The Greatest Math Janitor Film Of All Time"
    },
    {
      "rating": "9",
      "text": "Good Will Hunting is a very endearing movie; you can really feel Will's internal struggle, and every emotional scene in the film feels authentic rather than sappy. Bravo."
    },
    {
      "rating": "10",
      "text": "Brilliant performances and good message about self growth and realising your potential"
    },
    {
      "rating": "10",
      "text": "The magical feeling you get by watching \"Good Will Hunting\" will make you question the meaning to filmmaking and life as a whole. When Sean Maquire (Robin Williams) states \"you'll have bad times, but it'll always wake you up to the good stuff you weren't paying attention to\" leads me to think of the negative moments in my life that inspired me to be a big-time movie fan. Good Will Hunting will express the deepest emotions your mind can possibly experiences by bringing you tears, laughter and even anger.\r Rating: 10/10\r A+ = 10\rA = 9\rA- = 8\rB+ = 7\rB = 6\rB- = 5\rC+ = 4\rC = 3\rC- = 2.5\rD+ = 2\rD = 1.5\rD- = 1\rF = 0"
    },
    {
      "rating": "10",
      "text": "Great movie annnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd yeaaaaaaaaaaaahhhhhhhhhhhhhhhhhhhh"
    },
    {
      "rating": "10",
      "text": "HOW is this movie only an 8.9? A brilliant movie. A work of art. A must-see!"
    },
    {
      "rating": "9",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "9",
      "text": "Marvelously original, and bolstered by a strong performance of Damon, and a equally strong, sarcastic, and cynical role by Robin Williams. Minnie Driver is interesting in her role, playing this half-sophisticated, and half-normal character, one who can go to Stanford and still make a joke about a blow-job. Ben Affleck and everyone else helps give the film it's stance. Love this movie"
    },
    {
      "rating": "10",
      "text": "Good Will Hunting is such a brilliant movie and it's especially a masterpiece and a half. The movie's got such an amazing story and it's about this lad who's called Will Hunting (Matt Damon), who's this very intelligent genius at mathematics and he's really good at solving all the difficult mathematical problems.However, when he starts to face an emotional crisis, he starts to see many different psychiatrist's until he finds the right one who can help him and his name is Dr Sean Maguireto (Robin Williams), who later helps Will recover.The movie's got some amazing performance's from all of the cast, especially from Will (Matt Damon) and Sean (Robin Williams), those two are honestly brilliant and the two of them bring their characters to life so well.The dialogue which is given and received from each character throughout this movie is all very strong dialogue. The dialogue which this movie's got never feels weak at any moment and every single bit of the dialogue comes out very strong.The movie's cinematographer Jean-Yves Esoffier does such a beautiful job on capturing each moment and each emotion from each character so beautifully, he honestly does it so well.Also, the chemistry between Matt Damon and Robin Williams throughout this movie is honestly great and it adds so much to their friendship in this movie and it works perfectly.The pacing in this movie is honestly great, each main moment which ends up happening throughout this movie is all well built up and it's so beautifully well done.The movie's even got some brilliant humour, which is well scattered throughout and all of the humour works very well in making me laugh in some sort of way.Finally, the movie's got some really great emotions and they're all well built up with the great pacing and it really adds to their characters as a whole throughout this movie.The movie's even got some brilliant character development with the main character Will, It's so beautifully well done and it works so perfectly due to the events, which end up happening to him.The love interest in this movie, which is between Will and Skylar (Minnie Driver) is so beautifully well done and the certain events, which end up happening throughout their relationship are all well built up.Overall, Good Will Hunting is such a brilliant movie with such an amazing story, amazing performances, very strong dialogue, beautiful cinematography, great chemistry, great pacing, brilliant humour, great emotions, brilliant character development and such a beautiful love interest.I'd honestly recommend Good Will Hunting, if you're wanting to watch a very beautiful Drama/Romance movie. It's honestly worth the watch, it's so amazing."
    },
    {
      "rating": "10",
      "text": "'Good Will Hunting' is a drama that earned $225 million, whereas the budget of the movie is $10 million. It was directed by Gus Van Sant in 1997.The movie is about a twenty-year-old genius and the influence of his difficult childhood on his life.The high-level acting and well-written script attract moviegoers all over the world. The script was written by Ben Affleck and Matt Damon. 'Good Will Hunting' won two Academy Awards: the Academy Award for Best Original Screenplay and the Academy Award for Best Supporting Actor.Written by Anastasiia Shystovska"
    },
    {
      "rating": "10",
      "text": "This is honestly one of the best films I have ever seen considering the year it was made great actors, amazing plot, truly incredible"
    },
    {
      "rating": "10",
      "text": "Great movie. Learn to be more mature and get past the use of the 'f' word as you love to call it, otherwise go watching finding nemo."
    },
    {
      "rating": "10",
      "text": "Incredibly well written and well executed piece of art. Feel good movie on the level of the story but also on the level that there are still true writers and films out there that don't need lame special effects and corny action to compensate for the terrible script."
    },
    {
      "rating": "10",
      "text": "This movie was released befor I was born. I watched it as a child - didn't understand several things.\rWatch it with sixteen when university will be an important part of my life and see the movie much different.\rThe best moment for me was the baseball match when I was younger. Now it's the great monologue of Robin Wiliams."
    },
    {
      "rating": "10",
      "text": "Good Will Hunting is a modern day classic about finding one's place in the world, and conquering your fears. A touching, inspirational film with a great script, great performances (Matt Damon, Robin Williams, and Ben Affleck really shine) and good cinematography. Good Will Hunting is guaranteed to uplift anyone who watches it."
    },
    {
      "rating": "10",
      "text": "Good Will Hunting is an incredible film about growing up and believing in yourself. Its got a lot of great lessons and would be a great watch for adolescents. Great writing, great casting, great performances, and a large emotional impact all help the movie to be truly special."
    },
    {
      "rating": "10",
      "text": "Solid performances all around, especially by Damon and Robin Williams. It's a touching and inspirational film that explores several issues in life."
    },
    {
      "rating": "8",
      "text": "Great movie! Heart breaking, romantic, and had some good humor in it. Truely a great movie about a brillient kid who gets in a little to much trouble. It inspired me to reach for my goals. Overall a great movie."
    },
    {
      "rating": "9",
      "text": "¤¡¤¡¤¡¤¡¤¤¡¤¡¤¡¤¡¡•¡•¡•¡•¡•¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"
    },
    {
      "rating": "10",
      "text": "Good Will Hunting: Now I said I couldn’t review this movie because I wouldn’t be doing it justice but I’m only doing it because of the brilliant Robin Williams, Rest In Peace to a actor we lost too soon. So yeah this movie is another one that everyone should see because the way Matt Damon and Ben Affleck this art is that they fake you out in the beginning making you think it’a a comedy but then you get introduced to Robin’s character and then the movie flips into a drama. So the main person I really want to bring light on is Robin because he is so amazing in this roll he goes from being a humble person to grabbing Matt’s character by the neck and that’s what makes him feel more real, he has emotions and with his perfect performance he brings weight to a certain type of character and I don’t think I can ever unsee the way he plays him and I don’t want to either. Overall watch it. Ranking: Masterpiece."
    },
    {
      "rating": "10",
      "text": "Personally, my favorite movie of all time. I first time watched this movie back in 2009 on Netflix and I was captivated by Matt Damons character as well as Robbin Williams. This is a movie is littered with valuable life lessons and never act hot-headed or arrogant. It's a movie that teaches humility and I was so moved by it. The acting was phenomenal, great cinematography, and absolutely great writing. An absolute A+!"
    },
    {
      "rating": "9",
      "text": "Fantastic film. Great, very reflective story and amazing direction by Gus Van Sant. Robin Williams, Matt Damon, Ben Affleck andStellen Skarsgard's performances are exceptional. All of the characters are relate-able, the story makes you think about your own life in reflection."
    },
    {
      "rating": "10",
      "text": "The only negative reviews I hear of this movies are by people who either cant stand violence or strong language (and one about it being to simple from the guy who watched inception and still has his mind blown). This movie is very real to me, though the genius of the main is hyperbolized (in my opinion) It just goes to display the internal struggle of what to do with your natural gifts, and just how much negative influences during your childhood effect your growth. Plus the Jokes in this movie are HILARIOUS! Even if you didnt like this movie you cannot tell me you didnt like the apples joke, or the old couple."
    },
    {
      "rating": "9",
      "text": "-----------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"
    },
    {
      "rating": "8",
      "text": "Good Will Hunting is one of the greatest American Movies of all time. It is both Robin Williams and Matt Damon's best performances, and Robin Williams won the Academy Award for Best Supporting Actor. Good Will Hunting is both wise and deep. It really makes you stop and look at yourself and life."
    },
    {
      "rating": "10",
      "text": "This movie is nothing but a masterpiece. The characters all have so much depth, and the actors all pull them off beautifully. The writing was genius, especially for Damon and Affleck having been so young at the time. The only downside now is Harvey Weinstein's involvement, but there's no changing that now."
    },
    {
      "rating": "10",
      "text": "Will: [during a therapy session, after his job interview with the NSA] Why shouldn't I work for the N.S.A.? That's a tough one, but I'll take a shot. Say I'm working at N.S.A. Somebody puts a code on my desk, something nobody else can break. Maybe I take a shot at it and maybe I break it. And I'm real happy with myself, 'cause I did my job well. But maybe that code was the location of some rebel army in North Africa or the Middle East. Once they have that location, they bomb the village where the rebels were hiding and fifteen hundred people I never met, never had no problem with, get killed. Now the politicians are sayin', \"Oh, send in the Marines to secure the area\" 'cause they don't give a **** It won't be their kid over there, gettin' shot. Just like it wasn't them when their number got called, 'cause they were pullin' a tour in the National Guard. It'll be some kid from Southie takin' shrapnel in the ass. And he comes back to find that the plant he used to work at got exported to the country he just got back from. And the guy who put the shrapnel in his ass got his old job, 'cause he'll work for fifteen cents a day and no bathroom breaks. Meanwhile, he realizes the only reason he was over there in the first place was so we could install a government that would sell us oil at a good price. And, of course, the oil companies used the skirmish over there to scare up domestic oil prices. A cute little ancillary benefit for them, but it ain't helping my buddy at two-fifty a gallon. And they're takin' their sweet time bringin' the oil back, of course, and maybe even took the liberty of hiring an alcoholic skipper who likes to drink martinis and **** play slalom with the icebergs, and it ain't too long 'til he hits one, spills the oil and kills all the sea life in the North Atlantic. So now my buddy's out of work and he can't afford to drive, so he's got to walk to the **** job interviews, which sucks 'cause the shrapnel in his ass is givin' him chronic hemorrhoids. And meanwhile he's starvin', 'cause every time he tries to get a bite to eat, the only blue plate special they're servin' is North Atlantic scrod with Quaker State. So what did I think? I'm holdin' out for somethin' better. I figure **** it, while I'm at it why not just shoot my buddy, take his job, give it to his sworn enemy, hike up gas prices, bomb a village, club a baby seal, hit the hash pipe and join the National Guard? I could be elected president."
    },
    {
      "rating": "10",
      "text": "This is one of my all time favorite movies. The grit and grime of the kind of life that most wish to look away from. Matt Damon was truly inspiring in his performance and insight. I wish that more movies were as real as this one (with the exception of 'Will' being a genius)."
    },
    {
      "rating": "8",
      "text": "Very emotional movie. Great performance by Matt Damon and Robin Williams, pretty complex characters with their own stories. One of the movies which makes you look at life from a different angle."
    },
    {
      "rating": "8",
      "text": "i dont like robin williams but his performances here is worth commending. he played his character perfectly about man in pain very naturally. the movie is about will (matt damon), facing his trials and tribulations in his life despite being a genius. good acting from the cast too."
    },
    {
      "rating": "10",
      "text": "Damon, Affleck, Skarsgard, and Williams all give fantastic performances, but that isn't what makes this film special. What makes this a classic is the writing by Matt Damon and Ben Affleck. They make the characters seem real, and makes the viewer invested in them."
    },
    {
      "rating": "10",
      "text": "It comes quite clear that the critics that gave the movie a negative review did not understand the excellence of the acting. Especially from Robin Williams, has he ver made a movie like this? No. The intelligence of this movie is outstanding, no fancy effects or crazy dramatic turns, just human life at it's peak. A beautiful movie, don't over analyze it, but do recognize how it makes you look deep into life."
    },
    {
      "rating": "5",
      "text": "The premise and Robin Williams are great, but the rest is utterly a  disappointment.http://themoviefreakblog.com/2012/06/02/review-good-will-hunting/"
    },
    {
      "rating": "8",
      "text": "What it is to be enveloped by ignorance for your own self, not knowing what you want and what you do with your life? Even people with talents are not insured against this possible daily burden. The greatest pain is to live, going downstream. But hugging life, we should not lose the much needed faith. There is something good there, in the future, hiding and waiting. Waiting for us, who, in the meantime, are on the spiral of time. Getting closer.A movie about the need for self-knowledge. About the turns of life. About love."
    },
    {
      "rating": "8",
      "text": "It's over-long for a film of its nature, but despite the length, the film does not lag. In fact, it is beautifully filmed, exceptionally acted, brilliantly written, and---in the end---extremely heartwarming. It is a triumph."
    },
    {
      "rating": "5",
      "text": "I saw this movie for the first time last night and I'm sad to say it has not held up well. The audience is meant to believe that Matt Damon's character is smart because he writes mathematic gibberish on a black board conveniently placed in a walk way for a janitor to draw on, I was never convinced he was the genius the movie claimed him to be. The movie has good acting if you consider characters yelling and swearing at each other for 3 quarters of the movie for little reason and for nothing you will care about. In the end I never cared about the films characters nor did I find them relatable. Pass"
    },
    {
      "rating": "2",
      "text": "What a bunch of pseudo-intellectual claptrap. This is a movie written from the perspective of a college undergrad who thinks he's impossibly clever, but is really just a big dummy full of stupid ideas (e.g. the Howard Zinn and Chomsky references -- are there two bigger moral imbeciles on the planet earth than those two twits?). Matt Damon's character is a witless jackass. Who could possibly care about this goon? The rest is so absurd that it's laughable. The film positively groans under the weight of its pretentions. There are few things worse than patently ignorant people showing off their \"intelligence,\" such as it is. This is the sort of film that does serve a purpose, however. If anyone likes it, you know right away they really have no clue about what makes a good film. And they probably really enjoy congratulating themselves on how smart they are."
    },
    {
      "rating": "0",
      "text": "I waited a whole decade to finally see this movie. It was horrible. Why is it called \"Good Will Hunting?\" There is a scene where Will holds a man down and beats him until there is blood coming from not just the victims nose, but his mouth as well. If I were to do that to someone, would I be considered \"good\"? I sure hope not."
    },
    {
      "rating": "8",
      "text": "Good Will Hunting is pretty good. The story is predictable but what makes it enjoyable are the characters, the acting, and the relationships (particularly Will’s relationship with Williams’ character as well as his relationship with Ben Affleck’s character). It’s a nice feel good movie. My only issues come from the last third/fourth of the movie where we have to sit through a lot of arguing as well as moping and doping even though its obvious that the film will end on a happy note and what that note will be specifically. Since this is a Robin Williams movie where he plays a teacher that inspires a pupil, I feel its fair to compare it to Dead Poet’s Society, which is a better film. I found the arc of the students’ in that film to be far more interesting and I like how the happy ending comes at the cost of some tragedy. Additionally, that film was not as predictable. With all that said though I still enjoy Good Will Hunting it’s a heart-warming film with a good message that pulls at your heart strings. It makes you laugh and cry as well as remember a time when cell phones did not exist and the Dunkin Donuts logo looked different. It is cliché and predictable but I’m willing to overlook it because the characters are likeable and the relationships are fantastic especially in the first half (second half/third is where the clichés fall in). This is definitely a movie that everyone should see at least once in their life."
    },
    {
      "rating": "2",
      "text": "Alright, I am going to go straight ahead and say that in no way do I understand how people manage to like this movie.\r Absolutely everything in this film is outright terrible: the premise of two grown men going out of their way to help some guy \"because he's a genius\", the cliché boring love interest and friend subplots, young Damon showing his \"intellect\" by citing old books with a super-serious face, Affleck picking up girls (extra cringy!), Williams remembering his wife's farts (literally), Minnie Driver's story about geriatric blowjobs, Casey Affleck jerking off (not shown explicitly, thankfully), the battered \"do what you really like, don't miss your true love\" morale... The list could go on forever, or for about two hours, to be exact.\r The only bright spot is Robin Williams (when he's not remembering his wife's farts, obviously), his performance is solid, his smile heart- warming, his wrists very hairy.\r What I also don't get is why people have doubts whether Affleck and Damon actually wrote this piece of trash. I mean come on, saying that someone isn't capable of even coming up with something as bad as Will Hunting is probably the worst insult there is."
    },
    {
      "rating": "3",
      "text": "I recently had the opportunity to see Good Will Hunting for the second time. I had not seen it since its video release in 1997. It's funny how 15 years can change your opinion about a movie. I was lukewarm to the film back then, but now  15 years wiser  I see it in a new light.\r I had initially dismissed this film as a two hour study of a bunch of unlikeable and unbelievable people. But now it is evident that Matt Damon deserved his Oscar nomination for his portrayal of the title character, the good Will Hunting.\r Damon does a yeoman's job making us believe in someone who is not only a math genius with a photographic memory, but a barroom-brawler, cynic, janitor, lover, and all-around down-to-earth working-class Joe. Damon and his compadre Ben Affleck also deserved their Oscar screenplay win for creating a character more fantastic than any from the mind of J.R.R. Tolkien.\r Robin Williams also deserved his Oscar win for having us buy his interpretation of an all-knowing beard-sporting eye-glinting joke-cracking-but-no-nonsense psychologist.\r Affleck, director Gus Van Sant, and the rest of the cast merit mention as well for trying to get us to like and accept all the unappealing and implausible characters who populate this fantasy world.\r All this leads me to believe that I should revisit films like Showgirls, The River Wild, Divine Secrets of the Ya-Ya Sisterhood, and The Greek Tycoon. Maybe I was a little too harsh in my initial assessment of these as well."
    },
    {
      "rating": "6",
      "text": "The movie itself is OK, and  some of it is really interesting. But, two Afflecks in the same movie? I mean, whose idea was this? Was it suposed to be funny?"
    },
    {
      "rating": "8",
      "text": "Good Will Hunting is one of the greatest American Movies of all time. It is both Robin Williams and Matt Damon's best performances, and Robin Williams won the Academy Award for Best Supporting Actor. Good Will Hunting is both wise and deep. It really makes you stop and look at yourself and life."
    },
    {
      "rating": "10",
      "text": "This movie is one of the best movies I have seen. After seeing it a second time and seeing some of the unaccidental coincidences by the producer, the movie shows many different angles. This is one of the cleverest movies I have seen, very intriguing."
    },
    {
      "rating": "9",
      "text": "Amazing movie, great acting, perfect screenplay. And I think I speak for a lot of people when I say, I think it's time Damon and Affleck hooked up again on a screenplay."
    },
    {
      "rating": "10",
      "text": "A great movie. Matt damon did way more on the screenplay than Ben Affleck. It's clear they realized who was more talented some time ago."
    },
    {
      "rating": "8",
      "text": "Great performances & dialogue with Robin Williams in fine form as psychologist Sean Maguire.I still have a strong dislike for Ben Affleck though he did co-write this so fair play to him.Also nice soundtrack with lots of the late Elliott Smith featuring."
    },
    {
      "rating": "10",
      "text": "Of the works of art I have experienced, this has struck a deep impression within me and remains to be my favorite film of all time.  To begin with, the story is not only a wonderful concept but also devoid of idealistic clichÃ©.  It was the kind of story that carried itself through the journey; situations fabricated to nudge the plot along were very sparse.  The entire movie flowed out smoothly, avoiding the impression of multiple disjointed scenes, instead following a cohesive line of thought, and yet integrated within was a well-paced emotional rampage.  It balanced on the edge of fact and fiction, using â"
    }
  ]
}