{"id": 2316, "title": "Good Boys", "starring": ["Jacob Tremblay", "Brady Noon"], "runtime": 89, "genre": ["Comedy"], "description": "A group of young boys on the cusp of becoming teenagers embark on an epic quest to fix their broken drone before their parents get home.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/tximyCXMEnWIIyOy9STkOduUprG.jpg", "categories": {"plot": 6.222222222222222, "acting": 6.636363636363637, "ending": 7.0, "soundtrack": 9.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.875, "action": 5.0}, "reviews": [{"rating": "5", "text": "Unfortunately the trailer spoils a large portion of the gags, but there’s enough packed into the movie to still laugh throughout.The themes closely hew to Superbad, though with tweens in the throes of middle school and puberty rather than on the verge of college.The main kids great—Lucas was especially compelling with his earnestness—and the story carried through some fun scenarios that the writers filled with interesting (but minor) characters.Overall, 'Bad Boys' has a fun story, good comedy, and is filled with heart despite being raunchy."}, {"rating": "5", "text": "There are some genuinely funny moments in Good Boys, but the majority of them were shown in the trailers. Much of the rest of the jokes either fall flat or rely on the fact that it's 10 year olds telling dirty jokes to get laughs. As for the story, well, it feels like it was just stitched together with a bunch of duct tape. It doesn't flow well and the conclusion isn't very satisfying, either. With all of this being said, though, there's still enough here to walk away mildly entertained, but I had much higher expectations."}, {"rating": "1", "text": "(Mauro Lanari)\"That's Not Really Funny\" (Eels 2001). They're 11-year-olds, they're taken for \"Stranger Things\" but \"El\" isn't there. Despite an appealing cast and ultimately thoughtful message, \"Good Boys\" is undermined by an eagerness to repeatedly indulge in profane humor: Seth Rogen strikes again."}, {"rating": "1", "text": "This was a garbage movie. Even some of the funny jokes fell flat in the delivery. It was clear from the beginning this movie was going to be annoying and it was."}, {"rating": "8", "text": "While a very crude movie that heavily relies on low comedy , it was still a very engaging and hilarious movie that I loved watching and wouldn't mind watching again!"}, {"rating": "2", "text": "Hi, I'm an Internet addict who goes on many chat with strangers sites and I'm just so disappointed this film didn't have many women in it. I only ever talk to the opposite sex because everybody else on chat with strangers does. So for someone like me who spends 12 hours on a website every day just to get about 5-10 sexy pictures from women when I could be getting a lot easier, this film just didn't work out for me and I really missed people saying M or F. Well I don't know what else to say as I'm a selfish lazy Leftie."}, {"rating": "9", "text": "Hillarious!!! Loved this movie and never imagined it would be this funny. A must see, if you want to just laugh!!!"}, {"rating": "10", "text": "This R-rated comedy is about a trio of tweens (Room and The Predator's Jacob Tremblay, Last Man on Earth's Keith L. Williams, and Brady Noon) who want to learn how to kiss for an upcoming party. The kids are naive and their attempts to learn land them in a series of increasingly insane situations. And I loved it.The movie is insanely funny. Joke after joke lands. I haven't laughed so much during a movie in a long, long time.The three leads are all distinctive and likable. The actors do an excellent job. The entire cast is strong.They do try a little too hard at points to push the boundaries of what you can do with children in a movie. There is one scene that is especially uncomfortable. I'm not trying to censor, but ask yourself: how far is too far?The film has a good ending, but I felt a few parts could've been edited down. The film runs briskly at an hour and a half. Part of strength is it pacing, jumping constantly from situation to situation without driving a joke to death. However, you expect things to slow down once you reach the wrap up.Unless you feel uncomfortable with children in some pretty mature situations, I highly recommend this."}, {"rating": "10", "text": "Watched this movie with my 19yo son. Both of us laughed the whole time. Sometime with these movies all of the funny stuff is in the trailers. Not even close with this one. Laughs upon laughs."}, {"rating": "2", "text": "Just an ABC afterschool movie / episode of The Wonder Years with a lot of the word f---. I have no problem with the language; my problem is that the movie's not really funny."}, {"rating": "10", "text": "Best comedy ever. I left the movie theater  feeling like I was going to have abs from laughing so much."}, {"rating": "7", "text": "Three sixth graders want to go to a kissing party, but first they have an adventure that includes a drone, drugs, sex toys and lots of F-words. Anyone who's watched the trailer has seen most of the funniest moments, but there's a raunchy innocence that keeps it fun. The boys create enjoyable characters and the pace only slows when they take time for the emotional friendship crap. The idea of dropping the classic high school nerd comedy to middle school allows the writers to ramp up the kids' unknowingly comic responses. It's not as hilarious as hoped, but it still provides enjoyable pubescent hi jinks."}, {"rating": "6", "text": "These kids are incredibly mature and smart, don't be fooled by their presence, language, behaviour or their entire vibe.Good BoysStupnitsky is a good sitcom director. You would think that a film that has a script like an hour long special finale of the season, the co-writer and director Gene Stupnitsky would play safe on delivering this content with the promise and expectations he comes with. For, I think his confidence on directing this film is extraordinary. As a proof, you can see all the slow motion shots that he has installed in here. It is natural to take such scenes for granted or find it difficult to pull off, but his decisions doesn't go waste by, especially because his shots aren't bloating or exaggerating or celebrating, and instead is just mocking the seriousness and the priorities of these characters.And that remains to be their sense of humor towards.. well, everything. Their tendency to lean towards unintentional edgy humor whose birth is actually coming from the know-it-all attitude that every student ought to and does breathe in that stage of their life. Now, saying that or showing that isn't enough. Their definite knowledge or incompetency to grasp the adult social rigmarole is never enough for us to care about them.And hence every single character is given that kryptonite, no matter how hypothetical, that they collapse within a snap after coming in contact with. We, as an audience, too connect instantly with it. Not because it is a metaphor to something we can dot across the frame, but that very piece of information that they carry. There is no need to dig so deep or read between the lines in that aspect of the narration. For when it comes to ground this celebration into a- might I say shocking- vibrant message, the film holds on to our weakest nerve-- or should I say mine-- and it is, these Good Boys saying goodbye."}, {"rating": "10", "text": "Hilarious from start to finish! And overall a very good movie as well with lots of ❤️"}, {"rating": "7", "text": "It isn’t as funny as “Superbad” or as well-written as “Booksmart,” but I found myself laughing a constant amount, several times long after the punchline."}, {"rating": "10", "text": "Funny as hell, surprisingly good and wouldn't expect half the stuff out of these kids mouths, can recommend."}, {"rating": "0", "text": "this wack  to wack my taste wont watch this crap not fan seth Rogen thes people here in so no from me il rate it 0 and this black boy is bad acter"}, {"rating": "6", "text": "It's a strange thing, watching a comedy whose most successful jokes you've already seen and heard a few times over due to excessive trailer watching (alas, so goes one of the few drawbacks of going to the theater 1-2 times a week). It doesn't always render a comedy unwatchable or even mirthless, but it will typically diminish the potential returns for entertainment overall, ultimately making the experience feel a bit like going back and listening to the greatest hits of a band from your teen years that you've already moved on from. \"Oh, yeah. I remember this one. Neat.\" Thankfully, though, this issue doesn't actually comprise the epitaph of \"Good Boys.\" Yes, the best bits are in the numerous \"red band\" trailers, but there are a number of surprise laughs along the way, whether it be the use of an unforeseen alternate take or a full-blown entire joke you actually haven't seen yet. There's also the added benefit of emotional resonance -- or at least a valid attempt at conjuring it up -- and a trio of performances that should elicit a smile at the minimum. It's a pleasant, albeit familiar, effort in a realm of cinema that's all too focused on topicality and timeliness, featuring a noted emphasis on telling funny jokes first before even considering the fact that they'll be coming from the mouths of children."}, {"rating": "8", "text": "Good Boys is a cute and funny film about three sixth-grade best friends caught between the pressures to grow up and a desire to stay young. There are several very funny parts, including some where one can only wince at the boys' evident discomfort. The trailer probably gives too many jokes away. And there are scenes where one must suspend disbelief. All in all, it is an enjoyable film for adults and older teens."}, {"rating": "1", "text": "I've seen a lot of crude comedies in my life time and this one is one of the worst.  Script is AWFUL and the poor, unfunny jokes speak for themselves.  Superbad is 10x better than this pile of crap.  All of the kids in this movie are no name actors and it certainly shows.  I wanted to turn it off after the first 15 minutes because it was that boring and unfunny.  I am a huge fan of crude humor movies like Blockers and Superbad and Knocked Up, etc., but this is just garbage.  The script is just horrendous.The only worse movie than this I've seen in my life is Scary Movie 5, which gets a 0.  The problem here isn't the bad language at all, but how FORCED the terrible jokes are that always fall flat.  I've never seen dumber jokes in a R rated movie before.  This movie is definitely targeted to the tween/teen audience.  Adults who laugh at this movie definitely have the minds of a 12 year old.  The kids and crude jokes from IT were 100x better than these kids."}, {"rating": "7", "text": "Went into this movie not expecting much, but instantly it connected with me. The comedy was good, the child actors were good, and they even managed to stick a well placed coming of age theme in. Great job!"}, {"rating": "5", "text": "Save your money and wait for video. The funniest parts of the movie were in the trailers and felt try hard for laughs rather than just a part of the flow of the movie. I wanted to like this movie so hard but it failed to deliver."}, {"rating": "6", "text": "I know it's a cliche, but most of this movie's best moments are in the trailer.  However, there are 4 or 5 key magical moments that are NOT in the trailer and which make the film worth seeing.  It's a feel-gooder. All three of the main Tween actors are fantastic, but Keith L. Williams is the breakout star.  I expect great things from him in the future. I also like the directors use of Uroboros in terms of music. (You'll see.)"}, {"rating": "9", "text": "One of greatest coming of age movies of all time. Obscene, foul-mouthed but very very funny. A sweet film with real heart. It's about friends, family and fitting in. The scenes and emotions reminded me of my own awkward youth and teenage awakening. The movie will probably resonate with every male over 12. Great soundtrack too."}, {"rating": "6", "text": "Good Boys is a decent comedy effort that is a simpler and younger version of Superbad. Not hysterical, but it does the job and it harkens to being a kid."}, {"rating": "7", "text": "Its nothing close to SuperBad or Booksmart but it was surprisingly funny. The cast had great on screen chemistry and the story was funny"}, {"rating": "5", "text": "Predictable and unrealistic... It has some very funny parts if you suspend belief, but overall it is very predictable.Seriously, two girls will spend $700 to buy a drone to trade for two hits of molly, instead of just buying the Molly themselves.There are a few scenes inspired by 70s and 80s classics like Fast Times or Animal House, but they fail to capture enough of the nostalgia to improve the movie in any significant way.  Anyway, this is a rent but don’t buy situation."}, {"rating": "8", "text": "Really funny movie and might become a classic comedy in future. Maybe not the funniest comedy ever but certainly one of the best of last years."}, {"rating": "9", "text": "Just about every scene is great. The cast is perfect and the writing is top notch. I really enjoyed it!! I just don’t understand anyone who rated this below a 6. They must have not graduated sixth grade or just have no sense of humor. Sure, it’s not Superbad funny but it’s the best comedy to come out in a far too long time."}, {"rating": "8", "text": "\"Good Boys\" was hilarious.I laughed for 90 minutes.It reminded me of my childhood.I was not bad like them. Anyway, I enjoyed. You will laugh and love this movie."}, {"rating": "1", "text": "This is a sick movie. Adults are watching boys in a R rated movie a movie the boys shouldn't watch or be in it.  People go a long way to be a pervery."}, {"rating": "7", "text": "The great step from childhood to puberty through three kids who must to recover an apparatus they borrowed without permission. The odyssey allows some gags, right; the final result is a few uneven but the final act is the one that takes the merits."}, {"rating": "0", "text": "The absolute worst amateurish movie I have ever been forced to watch. It's not funny and is an embarrassment for the entire movie industry. Period."}, {"rating": "8", "text": "The scenes at the beginning are strangely short and seemingly randomly stitched together, but besides that this movie is very funny albeit a little predictable. 83/100"}, {"rating": "5", "text": "If you ever thought you needed a version of Superbad with the protagonists being younger, well here's the result.It's basically the same. You know what kind of humor it points to, evidently trying to make you laugh easily because apparently the laughs will come out without problems and without trying harder because it's suppose to be ''funny'' to see kids the kind of situations the story shows.It's not a disaster but it could be worse although that's not really a relief."}, {"rating": "7", "text": "Basically Superbad but with kids and no where near as funny. It did still deliver laughs but after seeing the trailers was expecting there to be many more. Only rated 14A here in Canada and I can understand why, it is very raunchy but there is much worse out there. It is more heartfelt then expected and it has a good balance of heart to laughs. Its a good movie for a quick laugh. Has a short run time but doesn't need to be any longer. If your a fan of Seth Rogan and the stuff he does give this one a shot."}, {"rating": "8", "text": "Excellent comedy film from some years with a actual and not stupid humour. Also, this is truth story about men's friendship which have been moved to point of real place of start a men's friendship. Sofa boys is forever"}, {"rating": "7", "text": "It was funny enough. Definitely had its moments, Superbad it's not but it has its own thing going on. And those kids were definitely stupidly funny. I can honestly recommend giving this film a glance... at least once."}, {"rating": "3", "text": "The infinite monkey theorem postulates that, over an infinite period of time, a monkey randomly hitting keys on a typewriter will eventually replicate the complete works of Shakespeare.  “Good Boys,” apparently, was written by a one-handed simian using a typewriter with several missing keys.Invited to a kissing party that includes the cool kids from school, Max (actors’ names are withheld from this review, to protect the innocent) wants to learn how to pucker up.  He decides to use his father’s drone to spy on some older girls in the neighborhood to gather the necessary information.  When the drone goes missing, Max and his pals experience a frantic couple of days trying to replace the drone before Max’s dad finds out.  In many ways, “Good Boys” is a youthful version of the film “Superbad,” with the handicap that it doesn’t have an older, more accomplished cast that can use its force of personality to make the holes in the script less obvious.  As a result, “Good Boys” is itself superbad.The script for this film just seems lazy.  Basically, it’s a two-note tune – 12 year olds dropping f-bombs at every opportunity while demonstrating they are completely interested in but completely clueless about anything having to do with sex.  Whenever the writers don’t know what to do, expect an explosion of profanity and/or the appearance of a sex toy.  (Admittedly, the appearance of “Dad’s CPR doll” was funny, the first couple of times.)Some critics have appreciated this film because of the juxtaposition of the crude humor with “sweet” moments when the three sixth graders briefly confront disappointment and the recognition that the texture of their lives is constantly changing.  I disagree with this kind assessment, because none of the life lessons seem hard-earned.  All the sweet moments rely on the protagonists reverting to child-like behavior, not any sense of forward movement, additional insight or personal growth.Ultimately, “Good Boys” feels like a comedy sketch much too short to support the weight of a full-length movie."}, {"rating": "0", "text": "Wow. I didn't know why I never heard of this movie until yesterday. So I just watched it and NOW I completely understand why I never heard of this movie! Because is sucks donkey-holes with a one inch wide straw!"}, {"rating": "5", "text": "Although initially fun to watch 10 year olds using foul language and playing with sex toys, it ultimately gets over used and boring. That's when you realize this movie doesn't really have a point."}, {"rating": "8", "text": "I found this movie to be a lot more lighthearted than its trailer implies. The movie is not nearly as vulgar as is suggested, though still quite a bit. The ending of the movie comes with a fantastic message for kids and teenagers alike. Although not particularly a movie for kids, it harkened me back to the day that I was a kid through its fantastic representation of child life and struggles. The jokes are fresh and funny, along the lines of Superbad and other alike comedies. The acting is also spot on for such young actors, they've done a fantastic job for what I assume is their first movie. I would recommend this to anyone that wants both a laugh and a few heartfelt moments, in line with Seth Rogen's signature style."}, {"rating": "5", "text": "Best comedy ever. I left the movie theater feeling like It isn’t as funny as “Superbad” or as well-written as “Booksmart.\""}, {"rating": "6", "text": "I expected more from this film with the names attached to it. Still worth a watch but could've had more kick to it."}, {"rating": "5", "text": "This is a pretty typical Superbad typer film, with young teens. There's some reasonably amusing moments, though its pretty predictable but an easy watch, so I guess its ok. Also, I definitely wouldn't recommend this if you don't like the American term 'sippy cup', which is a put-down said quite often throughout. An ok film, no more. I wouldn't recommend it as such, no."}, {"rating": "5", "text": "South Park in real life. The kids swearing schtick doesn't hold up for the entire movie but there are laughs to be had. C+"}, {"rating": "0", "text": "A really dull waste of pixels. Not sure who it was aimed at but it sure missed me. Obvious, tired, predictable and unfunny. One of the worst films that I've seen this year... Actually the worst...Surprised to read some positive reviews. I struggled to find anything good to say about it."}, {"rating": "4", "text": "This isn’t all that outrageous like it should have been. It’s only 1 hour 45 and this felt long aswell, I don’t recommend."}, {"rating": "10", "text": "Good movie and I love it hhshshhshshshshshshshhdhdhdhdhdhdhdhhdhdhdhdhdbdbdbH2hwhehwhe"}, {"rating": "6", "text": "Sausage Party was one of the last films Camera 12 showed in San Jose before closing permanently. Jacob Tremblay’s last film was so bad that The Guardian dared people to go see it and some writers breathlessly marveled at other writers’ willingness to sit through the whole film. All these things considered, I had feared that Good Boys would be a toothless reproduction of a classic Apatow comedy, one that cleaved too closely to its source material and tried to squeeze the last few drops of humor out of tired scenes from a well-tread genre with slightly younger actors. But.I am pretty frustrated by how much I liked this film. I’m surprised by how much of the film was an indictment of toxic masculinity and a companion piece to the other coming-of-age (“also called a Bildungsroman if you’re feeling fancy,” says Wife) movie from this summer, Booksmart. Good Boys proves that no one director has a monopoly on foul-mouthed boyhood antics and that comedies about children don’t need adult cameos to put butts in seats.Both films are about growing apart. Both films focus on inflection points in relationships and try to find ways to navigate compassionate separation. Good Boys does so through the motif of hermit crabs outgrowing their shells. The Venn diagram of competence and adventurousness allows for the three leads to inhibit different permutations of the same qualities, present variations on a theme, which creates some wonderful moments of tension and complementary motivations. The gun scene is probably my favorite, unexpectedly perfect moment in the movie.The movie parodies the self-seriousness of sixth grade, the rigid social structures and etiquette that regulates all interactions between children. Parody does not spare the toxic masculinity of frat culture–in a succinct and cutting scene that leaves no stone unturned, including the wonderfully repugnant jubilee of a young man’s, “Guys! She just dropped all charges!” Even scenes that reuse material from past coming-of-age films, the stuff in the trailer I was so worried about, find a novel way to spin jokes that feels fresh and clever.Do not feel guilty about this unadulterated joy of a film, one whose quick and joke-packed script has a rolling laugh for nearly the entire film. In fact, when a joke fails, like the lone incest joke of the film that left Wife stunned, the silence of the audience is itself pretty humorous and shows how energetic and enterprising the script is, even if it doesn’t always get the tone of its humor right."}], "recommendations": ["neighbors", "knocked_up", "jackass_presents_bad_grandpa", "ted_2", "hall_pass", "neighbors_2_sorority_rising", "superbad", "the_40_year_old_virgin", "the_happytime_murders", "jexi", "21_jump_street", "bridesmaids", "cloudy_with_a_chance_of_meatballs", "step_brothers", "this_is_the_end", "the_hangover", "rough_night", "a_million_ways_to_die_in_the_west", "ted", "funny_people", "sisters", "the_change_up", "the_croods_a_new_age", "the_dictator", "sausage_party"]}