{
  "id": 3847,
  "title": "Good Time",
  "starring": [
    "Robert Pattinson",
    "Benny Safdie"
  ],
  "runtime": 102,
  "genre": [
    "Thriller",
    "Crime"
  ],
  "description": "After a botched bank robbery lands his younger brother in prison, Connie Nikas embarks on a twisted odyssey through New York City's underworld to get his brother Nick out of jail.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/s6DJXJU3HzX24Ij3VWg5MfVGHrI.jpg",
  "categories": {
    "plot": 7.104166666666667,
    "acting": 7.114754098360656,
    "ending": 7.333333333333333,
    "soundtrack": 7.333333333333333,
    "cinematography": 7.375,
    "familyFriendly": 3.0,
    "funny": 9.25,
    "action": 8.11111111111111
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Robert Pattinson cherishes this opportunity to get grungy. He plays a small-time crook who's obsessed with the freedom of his mentally-challenged brother (a quietly-nuanced Ben Safdie, who also co-directed with his brother). This results in an adrenaline-fused series of chases and encounters that get him deeper into a morass of chaos and calamity. Since the entire narrative pivots around Pattinson's character, it's crucial that he brings an anxious vitality to his role. He succeeds. The Safdie brothers are self-consciously edgy in their use of gritty imagery and a hand-held style to ramp up the intimate anarchy. In an attempt to tweak the tension even more, they've added a soundtrack that's often obnoxious and weirdly incongruous. This isn't Pattinson's first attempt to escape the tyranny of \"Twilight,\" but it's definitely his most striking."
    },
    {
      "rating": "6",
      "text": "From the very beginning, the Safdie brothers' Good Time is a very good time. Telling a conventional story in a rather unconventional way, Good Time nonetheless can never escape the banality of its plot, even if its camera work, score, and acting are all top-notch. Directed with great flair and this gritty, television-esque level of grain akin to Dog Day Afternoon, Taxi Driver or Thief, Good Time is a film about a man who needs $10,000 to bail out his brother after the two of them robbed a bank. Given that his brother is mentally handicapped, the problems faced by Constantine Nikas (Robert Pattinson) are only worsened, let alone his own inability to get out of his own way. A classic screw-up character who has a set goal that leads to him breaking the law further in an effort to get out of the hole he dug himself, Good Time blends that with Rain Man or Of Mice & Men in depicting the relationship between Connie and his brother Nick (Ben Safdie). Thrilling from beginning to end, Good Time provides strong genre entertainment but not much else.This conventional story, no matter how much it is told unconventionally, and its cliche characters are truly what holds Good Time back from being a great film. As it stands, it is largely an above average film with some style and flair, but no sense of originality in its writing. It is a director's showcase where the writer's seemed to just fly through the writing of the film after watching a 1970s gritty New York-set crime film marathon. Encountering drugs, people who are all too willing to let a stranger spend the night, fellow criminals, and scummy bail bondsmen, the film's cliche plot - man needs money for any number of reason - tossed in with his cliche inability to make anything work or stick makes the film one that feels as though it has been done many times before. While the characters are fun and easy to sympathize with, they often operate as nothing more than average stock characters. Starring a screw-up with a good heart, a dimwitted brother along for the ride, an anger-filled mess up of a girlfriend who leeches off relatives, and a weird side character who the protagonist meets that introduces a new way for them to possibly make money, Good Time never really feels fresh. Instead, it often falls flat and never really sunk its hooks into me personally. Rather, it felt like a showy and decadent attempt to distract from its plain and run-of-the-mill plot by checking off a list of modern touches that indie audiences adore: neon lights, a synthy score, and a previously disregarded actor firmly establishing themselves as a star in the lead role. As a result, Good Time is never bad, but is never great. Instead, it seems to just settle into being a fun ride while it lasts, but one that will slip away from memory quite rapidly.The film often seems to try and play itself a modern \"edgy\" drama, akin to moments from Deadpool or Kingsman where it tries to play up the lurid underworld of the characters too much to the point that it tries too hard. Showing this world of crime and drugs, Good Time makes its point pretty quickly that these characters are ones living in a dark world that has them in a terrifying spiral of crime and disorder. Yet, with characters constantly yelling at one another, a BSDM-themed theme park called \"Adventureland\", and a rough sex scene that seems cut from a porno than reality, the film is like a teenager's attempt to seem mature. By yelling at one's parents and indulging in anything to make its situations seem more x-rated and adult, children often masquerade as adults and will frequently yell out, \"BUT MOM, I'M AN ADULT NOW.\" At times, Good Time feels like the cinematic equivalent of this annoying not-quite-adult person through its incessant portrayal of items that children believe to be adult, namely with regards to sex and drugs.Driving forward on pure convenience, the film often seems to defy logic throughout with characters acting out scenarios that seem so far removed from reality that they could only occur in a film. Namely, the sequence where Constantine is allowed to stay at this stranger's house with her teenage daughter and no questions are asked. Who, in their right mind, allows just anybody to stay in their home when they are an absolute stranger? The same occurs with the daughter, who proceeds to hang out all night and go to White Castle with these two complete strangers. All of this comes after her seeing the news report about Connie being wanted by the police. In spite of him kissing her, there is no way she missed that report. The bank robbery is also rather implausible, especially with the response by the teller. Only giving a robber what one has in their drawer and then scribbling a note about it is impossible to give them more because of policy is a policy that no bank has. Bank policy regarding robberies is to give the robbers anything they ask for, not stop at the drawer and blame policy for not giving them more."
    },
    {
      "rating": "7",
      "text": "Pattinson really impressed me. His acting was very good. The movie as a whole kept rolling along and had an entertaining intensity to do so. I was hoping for more conclusions but the script made it clear that there weren't going to be many. The little surprises made it worth watching. Successful outcomes were continually promised to the characters if they kept attempting dangerous tasks. It kept building and building and that, in itself, gave the picture quality and value."
    },
    {
      "rating": "8",
      "text": "A real gritty and dirty film that is compelling and gives us Robert Pattinson at his best. The character he plays is sleazy and Pattinson plays him straight, he has one motivation and that's to save his own skin. A-"
    },
    {
      "rating": "6",
      "text": "While initially suspenseful and largely atmospheric overall, the story grows progressively implausible the further one gets into it. Clever coincidence and fortuitous synchronicity gradually descend into bald-faced contrivance, leaving viewers hard-pressed to believe in the credibility of the narrative. By film's end, it will become obvious that a good time wasn't had by all."
    },
    {
      "rating": "7",
      "text": "It's a little like watching an episode of COPS, given some semblance of a plot.  It's also like watching a train wreck in progress.  Our primary characters are criminal lowlifes of the sort who, naturally, will become enraged if they need a car and you don't agree to \"loan\" them your car.  They are also proof of the age-old police adage that crime makes people stupid.  And the film is never so much on-target as when our chief genius starts hurling insults at another lowlife by way of telling him what a loser he is.I guess you could call it a caper flick, as it does begin with a robbery.  But that's where the planning ends and the chaos begins.All in all, an entertaining ride."
    },
    {
      "rating": "8",
      "text": "Good Time is a thriller that will grab you and not let go. Everything about this film is so well crafted and intense, from the stunning shots to the overbearing sound design. Robert Pattinson gives what is easily his best performance, and you end up rooting for this sleazy, scheming character he plays. The Safdie brothers show us a really unique side of New York City, and Ben Safdie also plays a really nuanced, mentally challenged character. This is truly a great film, and I cannot wait to see what the Safdie brothers do next."
    },
    {
      "rating": "7",
      "text": "Good Time is an engaging, gritty movie with excellent acting. I think Josh and Ben Safdie could potentially be a future Coen brothers in terms of working together.Acting: The acting is stellar overall. Robert Pattinson was amazing, stepping way out of his romantic roles. Ben Safdie also had an excellent performance for the scenes he was in, and is a promising actor and director. Buddy Duress was good, Jennifer Jason Leigh was amazing in her two scenes, and Barkhad Abdi was good in his one scene. Overall, the casting was great and all the performances were amazing.Characters: The movie had an abundance of characters, all very good especially because of the performances. However, I wished they would have focused more on Ben Safdie, Pattinson's brother in the movie. He was really good and they somewhat ditched him only a third into the movie for a completely different story-line.Music: I've seen many reviewers say that the soundtrack was bad and intrusive. I found it to fit in with the movie's feel and style most of the time, but there were plenty of scenes where it did get a bit too loud and distracting. There were a few scenes where it works really well, spreading a feeling of uneasiness.Cinematography: I don't like sitting in the front rows of movies. My neck hurts and I have to look around to see what's happening instead of seeing the entirety of the screen. However, in this movie I had no choice but to sit in the second row, as they were the only available seats. But, it worked very well with this movie, as since the movie pretty much consists of intense close-ups and constant shaky-cam, I felt completely immersed in the movie. I did get a headache by the end, but it was worth it. The movie has a distinct style that I liked, making he movie gritty, grimy, and engaging throughout. The lighting was also done really well, and I really liked some of the set pieces (Adventureland, etc.).Script: The script wasn't necessarily really special, but considering this is pretty much his first movie with a larger budget, I think he did fine. Again, can't wait to see these two's movies in the future.Plot: I didn't have a problem with the plot, though the pacing is off sometimes. It remains very fast-paced throughout, but it does slow down somewhat unnecessarily sometimes. It was also hard to tell what happened in a few scenes. There were a few parts where it took me a while to figure out what happened, partly because of the dark lighting, which I'll excuse because it was still done well, and partly because it was fast-paced in scenes where it actually would have helped to slow down just a bit.Overall, Good Time was exciting, fast-paced, and fun to watch. It may give you a headache, but I think it is pretty worth it. I am looking forward to the Safdies' movies in the future, however I do hope they can end up being flexible enough with their style. Though I do like their intense, up close, intimate camerawork, it could get old after a while. I know their 2014 movie, Heaven Knows What, is basically the same style, so I hope they are open to switching it up if they have to."
    },
    {
      "rating": "4",
      "text": "I liked this movie but I don't think it was anything special. It had some impressive camera work and an interesting plot, but the characters seemed really flat apart from one who actually had an interesting backstory about how he ends up in the situation. It was all a bit long and drawn out and the music tended to be quite jarring during some of the rather mediocre action sequences. Pretty bland."
    },
    {
      "rating": "7",
      "text": "The death spiral of \"what next\" when you're a bank robber trying to break your disabled bro out of the jail/hospital and nothing can go your way. Decent cast. Not too sure why it's important. Feels like a guilty pleasure, these movies, as you watch horrible act after horrible act. Nothing pleasurable about that."
    },
    {
      "rating": "10",
      "text": "Robert Pattinson has never shown me he was a great actor until now. A bank robbery doesn't exactly go according to plan which then sets in motion a chain of events that spiral more and more out of control. Desperate, hilarious and brilliant. Good Time is a gem of a movie and you'd do well not to miss it.Over the course of one night Connie Nikas (Robert Pattinson) tries to free his brother Nick Nikas (Benny Safdie) from prison. And thus mayhem ensues. Good Time sets itself apart from other heist/crime movies due to its extreme unpredictability and the intense grip it has on you from the moment it starts. The level of anxiety I felt during this film was incredible, and this wasn't helped by the stress inducing soundtrack. Original and very fitting, when the music is done right you really do notice it. Robert Pattinson was brilliant in Good Time and if I'm saying that then you know it's true. Gritty crime at its best, what more do I have to say to get you to see it? Highly recommended, this is honestly one of the best crime movies I've seen in recent years."
    },
    {
      "rating": "9",
      "text": "New York City has been enticingly shot a million different ways.  'Good Time' makes it a million-and-one.  From the neon lighting, to the cleanly executed close-up shots, to the invigorating musical score, the film maintain a frenetic (and sometimes frantic) pace that keeps viewers on edge the entire run time."
    },
    {
      "rating": "9",
      "text": "A24 is at it again with this flashy and colorful trip of a film! Robert Pattinson is in top form, and the film is fast-paced quite often and rarely lets up! It echoes the vibes of other classic crime films, such as 'Taxi Driver', 'Dog Day Afternoon', etc, while at the same time maintaining a unique and imaginative look at a robbery gone wrong. Overall, my only minor objection is that the film is maybe even a little too fast-paced and free-flowing often times, but hey! After all, that is was made this film such a Good Time!"
    },
    {
      "rating": "9",
      "text": "Easily one of the funniest, most inventive films of the year. It's fast moving like Trainspotting, but has the grimy feel of KIDS. Pattinson is fantastic, but the movie would be nothing without the bravura performance by Buddy Duress who plays ex-Con Ray and who brings HUGE laughs. (Can't mention what role he plays in the film without giving away a major spoiler.)  I would be shocked if this film doesn't catapult him to much bigger and better things. Jennifer Jason Leigh, of course, is brilliant in a smaller role. I knew absolutely nothing about this film before seeing it, and I was really happy that I didn't - it's how I'd recommend you engage with it. Skip the trailer, don't read much up on it. Just see it."
    },
    {
      "rating": "9",
      "text": "Exciting, gritty, edgy and consistently engaging grimy thriller with a career-best performance from Pattinson as a stressed, strained but sympathetic crook in a literal race against time to save/help his mentally handicapped brother."
    },
    {
      "rating": "10",
      "text": "A uncanny, unthinkable Robert Pattinson is the soul of an action thriller that contains the inertia for catch the viewer attention and have it on the edge of seat. One of greatest surprises of 2017."
    },
    {
      "rating": "8",
      "text": "I came for a good time, and I had a good time. FLick was kinetic, a lot happens. It's literally, for a lack of a better explanation, basically watching a **** continue to **** up and **** up and **** up to the point of exhaustion. Visually it's stunning, every shot is vibrant and alive. Also THIS is a better use of soundtrack to evoke theme, sensation and authenticity of shots and overall beats of the flick, it conveys the emotion of the flim.The Film's soundtrack is essential to the viewing experience. It evokes a lot of energy of the flick. Unlike Baby Driver, where the soundtrack feels like Edger Weight just wanted to force tracks that he personally loved into the film, I believe that by doing this Wright takes away focus from the narrative of the actual film, it becomes part of the narrative unevenly, opposed to being a device to move or thematically convey identities or thematics of the film. Tonally his track listening id argue also takes away from the actual tone of the film, making its narrative uneven. Good Time seems to understand this, and uses the soundtrack as motive and driving force to enhance themes and great a tension, its not there to basically just be there, it serves to create a feeling, and evoke the passion or the anxiety of the characters. It was excellent film. I loved it. i'd definitely watch Good Time again, cause it was a good time."
    },
    {
      "rating": "9",
      "text": "\"I think something very important is happening and it's deeply connected to my purpose\".This was more than a good time. The hype with these character for causing crime made for one intense movie experiences. This is a ticking time bomb of a film.Robert Pattinson is **** fantastic in this. Sorry for the language, but it needed to be said. A fully realized performance that will be talked about for years to come. Few films can make you feel on edge like Pattinson. The Twilight days are past him now and it's time to move on.Another performance that shouldn't be overlooked is Benny Safdie, who plays Pattinson mentally challenged brother. Safdie is also the director of the film. Directing and acting wise was all stellar.It's unpredictable in different ways. You never fully know how certain scenes are gonna play out. Not just that, but how funny and incredibly sad it can be. You either laugh at the stupidity of the characters or weep at the depressing reality of it all.'Good Time' ranks with the very best of the year.What a great way to end a brilliant year like 2017."
    },
    {
      "rating": "8",
      "text": "The best acting work I've seen from Robert Pattinson results in another success for A24, a thriller not unrelated to the norm and yet it's one that balances its narrative strengths on a very solid way managing to maintain a frenetic rhythm that catches you and won't let you until the end.When I heard about this movie, I did not really believe in it, therefore I did not have a preconceived idea of what I would see but i'm glad of it because it's always good to receive this kind of surprises when you least expect it."
    },
    {
      "rating": "9",
      "text": "One of the best movies of the year. Great acting, great directing, awesome writing, clever premise and a powerful message that is relevant. Explores mental illness in modern society in a story where many of the character's motivations are simultaneously selfish and selfless. An alarming film about desperate people living in our world. Robert Pattinson's performance leads the way!"
    },
    {
      "rating": "10",
      "text": "One of the best films of the year, Good Time is exactly what the title claims, and then some. It's an hour and thirty minutes of manic brilliance, with all-too-real action and characters that break your heart and horrify in equal measure."
    },
    {
      "rating": "2",
      "text": "“Good Time\" was written by Ronald Bronstein and Joshua Safdie and was directed by Mr Safdie and his brother, Ben. Ben Safdie also stars in the film with Robert Pattinson and, in a much lesser role, Jennifer Jason Leigh. This an amateurish, poorly written and frankly quite boring film about one brother’s attempt to get the other out of jail after a botched bank robbery. ‘The film, like the robbery, is poorly executed, coordinated and directed. Never has a film’s title more inaccurately described the theatrical experience  tor the last thing the viewer will have is a ‘good time”. I give the film a 2.0 because the creators had good intentions but ended up with a terrible result. What is most surprising, and, in fact, scary, is that so many well thought of professional critics really loved this film. It was based on their reviews that I went to see the movie which once again proves that getting paid for what you do or write doesn't mean you are good at it or deserve the sums you are paid."
    },
    {
      "rating": "2",
      "text": "There are times when I wonder if the critics saw the same movie as I did such as the one I saw this afternoon, “Good Time”. This movie has an 83% (out of 100%) rating and there are many 4-5 star reviews and except for watching Robert Pattinson after the first 5 minutes of dying his hair bright blonde I couldn’t find any redeeming features. Yes it is interesting to see how far he has come, in the acting department, since the “Twilight” series but the screenplay by Ronald Bronsteing and Josh Safdie, the direction by Josh and Benny Safdie and the photography of Sean Price Williams are helter-skelter, with plenty of violence in most of the scenes.There is some interesting acting by Pattinson, Benny Safdie and Buddy Duress but equally embarrassing ones by Peter Verby and Jennifer Jason Leigh.As bad as the movie is, though Pattinson and Safdie do their best to make it good, the ‘music’ by Oneohtrix Point Never provides one of the most horrendous scores this year, if not decade.In spite of the critic’s reviews I can’t/won’t recommend “Good Time”."
    },
    {
      "rating": "4",
      "text": "A mess of a film. Alternately frenetic and dull, the only thing I found completely consistent was the interesting, humane, yet high-voltage performance of Robert Pattinson."
    },
    {
      "rating": "0",
      "text": "One of the worst, laziest, illogical, empty films I have EVER seen. I cannot believe the critics on this. It really makes me think the system is dirty. This is a loud, boring, nonsensical movie. There are plot holes everywhere, long shots of cars driving on the street, loud music, and a  laughably (not intentional) sentimental ending. I could (but won't) list all the lazy, sloppy and idiotic choices this movies makes, but I don't blame the filmmakers. I blame the \"film critics\" who can't see the difference between a good movie and a complete waste of time and money. Only A.O. Scott recuses himself."
    },
    {
      "rating": "0",
      "text": "Wandering, no real plot, I think they were trying to make an artsy film. Instead it was tedious and truly bad acting on all accounts."
    },
    {
      "rating": "10",
      "text": "I believe this is one of the most underrated movies in recent years. While the storyline and theme are simple, the underlining themes and nuances make the movie incredibly complex. This film will keep you on edge the entire time and pull you into the story. I would highly recommend watching."
    },
    {
      "rating": "10",
      "text": "This film is great with it's acting and with it's cinematography.There is nothing much that i can talk about , it's simply one of the best films of 2017"
    },
    {
      "rating": "7",
      "text": "The independent filmmaking medium has really built the careers of a lot of known filmmakers. Tarantino, Soderbergh, even Nolan -- at one point or another -- had to rely on the tactics of indie filmmaking in order to get a proverbial foot into the door of the industry they all loved so much. With \"Good Time,\" the Safdie Brothers have crafted their \"Reservoir Dogs,\" their \"Sex, Lies & Video Tape,\" their \"Following.\" This is a richly engrossing, character-driven thriller with so much to offer on the plotting and structure front. It hearkens back to the bare-bones, premise-centric thrillers of the 1970's, yet totally appeals to so many mainstream, post-modern sensibilities at the same time. It looks great, the performances are all top notch, and even the music is indelible. The Safdie's have my genuine attention now and I can't wait to see what they do next."
    },
    {
      "rating": "8",
      "text": "A gritty, anxiety-inducing heist-gone-wrong film capturing the kinetic energy and depressing vibe of those eeking out a living (legal and illegal) in the big city. The acting is phenomenal with a powerhouse performance by Robert Pattinson and a surprisingly poignant performance by co-director Benny Safdie who plays Pattinson's brother. A wild ride."
    },
    {
      "rating": "6",
      "text": "Chemisty between actors really works, photography is precise and competent, movie gives us some different points of view about crime and everything around but why this one left out the focus in the plot started on movie's beggining, which is very interesting and unusual approaching that could be harnessed, and simply turns the lights in subplot?"
    },
    {
      "rating": "7",
      "text": "Robert Pattinson is incredible in this, very odd and somewhat grungy thriller."
    },
    {
      "rating": "9",
      "text": "Grueling, tense, well paced and well acted. One of the best thrillers of 2017."
    },
    {
      "rating": "9",
      "text": "It was a good time. A great movie, and probably pattinson's best performance yet. I am curious to see what the Safdie brothers will bring in the future. This guys have potential."
    },
    {
      "rating": "10",
      "text": "This was a real surprise.  Quentin Tarantino said if you know where a movie is going after 30 minutes, it's not really a movie.  I never knew what to expect next, an excellent script, excellent performances all the way around-including the first really good Robert Pattinson performance that i know of. But really, every actor was amazing in every role.  Photography was also very well done, unique night cinematography was tremendous."
    },
    {
      "rating": "9",
      "text": "Superb. Has the energy of an early Scorcese film. Oozes coolness.  Good Time is  the only film I've ever watched twice in a row."
    },
    {
      "rating": "7",
      "text": "Its pretty much non-stop intense and thrilling, but towards the end it starts to get less so. 70/100"
    },
    {
      "rating": "9",
      "text": "This movie is pulp fiction level story telling with thief level cinematography. It's a modern urban folk-tale. Robert Pattinson is stellar as a criminal on the lamb. He's a total sketch-ball whose redeeming quality is his love for his learning disabled brother- although even that ends up doing more bad for his brother than good. Multiple twists, vivid imagery, the movie is called good time for a reason. One of my favorite movies of 2017. I saw it twice in one weekend."
    },
    {
      "rating": "7",
      "text": "A smart thoroughly thought out heist that goes wrong just as it was expected and planned.Good TimeThe Safdie Brothers are smart chaps. In fact, they are very good at conning you. You'd think that it works well with their throwback genre to those neo-noir film, but it has actually got nothing to do with it. I bet that if they made a rom-com with a similar outline, you will be jolted with the pleasures of euphoric experience. There are plenty of heavy themes that sets it all on fire, but considering the sideline political satire that the films excuses its way out in narrative is incredibly poignant and sharp. For instance, Robert Pattinson is cornered in a situation in a park at night and in order to get out, he uses racial tension among the police to walk out safe and sound.Now this is how you should actually address an important notice to the society, not to endorse, but frame it as an inseparable purpose of the storytelling. Speaking of Pattinson, his wide eyed sinister-y look captures the essence of the unsustained energy ball wandering or released out in the world by us, is a straight out fascinating pull off, that I will be honest, was not ready for. But we are getting ahead of ourselves, as much as space the film offers to its actors, the film is immensely invested on disenchanting you with its tricks.Every step of the way, every act, the script is always contradicting their own and your theories of where to go with whatever they have in hand. And is probably why the title Good Time is an amazing achievement. For this is an exhausting experience. In a sense, that by the time they are done with you and the characters, the deliberately tedious job or duty that they fulfill gives you an unnerving relief when it let goes off the tiny materialistic possessions. We have something promising here and also surprisingly satisfying."
    },
    {
      "rating": "4",
      "text": "While Pattinson's performance is to be applauded (seriously, what a performance, it's awesome), the rest is just bad.A script that lurches back and forth, characters that are laughable and situations that not even the craziest nut in the neighborhood would believe.A good performance doesn't save a disaster."
    },
    {
      "rating": "8",
      "text": "Kinda gave me The Terminator vibes and it was intense almost throughout. Music and acting are solid. A few too many convenient plot holes to advance the story are a little silly and the final act takes a little long to deliver."
    },
    {
      "rating": "6",
      "text": "Moral of the story : If you lie down with dogs, you get up with fleas, don't help bad guys."
    },
    {
      "rating": "7",
      "text": "The first A24 film I've ever watched was Good Time, which I knew absolutely nothing about before I watched it. All I had seen before watching it was the Blu-Ray cover at Best Buy, and it didn't really tip me off to what kind of movie it was. Essentially, it's the story of a man, named Connie, who robs a bank with his handicapped brother and his brother ends up getting arrested, and so it follows Connie as he tries to get him out of prison. It's a fast-paced thriller that was quite entertaining, and really it's quite realistic, which was surprising. I don't expect movies to be realistic. They are movies, after all. But Connie's one-night journey comes off as the kind of night somebody could actually have if they were desperate to free a loved one from prison as fast as they could. And that impressed me, and made me even more interested in the film. The cinematography is also quite good, although I am a sucker for the \"outrun\" style color palette. This was a nice shakeup from the films I've been watching lately. Interesting premise and solid execution."
    },
    {
      "rating": "8",
      "text": "Um verdadeiro filme devasso e, ao mesmo, atraente, onde Robert Pattinson dá o melhor de si. \"Good Time\" mostra um lado desesperado, hilário e brilhante. Tudo isso misturado de uma forma inteligente..."
    },
    {
      "rating": "7",
      "text": "\"Good Time\" foi uma ótima oportunidade de Robert Pattinson mostrar realmente o seu talento na representação. Uma história desesperada, eletrizante e brilhante.7/10"
    },
    {
      "rating": "6",
      "text": "O maior ponto do filme são as atuações de Robert Pattinson e Benny Safdie, que apesar de atuarem em cima de personagens não muito... interessantes, trazem carisma de onde não tem e demonstram muito realismo em determinadas cenas.A historia é rasa, cujo o desenvolvimento me lembra muito os filmes do Tarantino/Scorsese, mas nesse caso, não me agradou muito. Faltou algo, e mesmo o filme me prendendo, não houve satisfação em terminar de assisti-lo."
    },
    {
      "rating": "9",
      "text": "Honestly, I cannot trust Robert Pattinson after his performance in the \"Good Time\". The movie itself is an absolute must see. Underrated piece of art. I actually can't really think of a bad thing about this movie. The thing that really made this movie for me is it's realism. I mean, the acting, the writing, all those camera shots and well-written, sometimes reliable and insanely realistic characters and situations. When the credits started rolling, I was shocked. These days, Hollywood conveyor delivers one boring sh*t show after another, and movies like these really stand out to me. Overall, brave, dark as life itself, real and f*cking amazing movie."
    },
    {
      "rating": "7",
      "text": "\"As soon as he hears the word JAIL, he f**kin' freaks, talkin' about \"I'm not getting ripped off by one of you punks again\" and he just f**kin' steps on the gas. And that was it, and just takes off. Then I hear the word COPS, I lose it, like I gotta f**k out of here. \"I'm not going back to jail man, I'm not going back to jail.\" So I happen to get one of the doors open before he locks the door. And this guy's crazy, he's f**kin' driving, speeding down the road 30-40 miles per hour and I know we're getting closer and closer to prison. I know where my local police is, it's not far. And I'm NOT going back to jail. So I looked down at the pavement and just jumped.\""
    },
    {
      "rating": "9",
      "text": "This film is incredible. Robert Pattinson stars as a man willing to do almost ANYTHING to help his mentally disabled brother. In short, it's the story of one single night where Pattinson's character must use everyone and everything he possibly can to do so. Pure chaos and anxiety underscore this entire film. The tone is so claustrophobic and intense, in part thanks to the brilliantly themed camera work, that the runtime absolutely flies by, never letting you leave the edge of your seat. Between this film and The Lighthouse, I am fully convinced of Pattinson's acting chops. He did his glittery vampire thing for a few years to make some money and now ifs clear he's pursuing projects and creators that have real voice and vision behind their projects. AND he's rising to the occasion that such creators require to achieve their vision. The suffocating way that this film is shot requires a lot of ifs actors. Every slight facial movement is amplified and Pattinson pulls off this cutthroat well-intentioned criminal perfectly. Apparently some real guerilla, ask-for-forgiveness film making was employed in this film's production and it really shows. Its frantic, nerve-wracking, and extremely high energy. Highly recommend."
    },
    {
      "rating": "7",
      "text": "I originally watched this movie, because I randomly stumbled upon it. At that point I had no idea who were the Safdie brothers or that this movie will make this huge of an impression on me. It definitely has some flaws, but the way everything was shot and cut together it made the whole experience pretty amazing. The script and the direction were truly mesmerizing and it makes the viewer understand the whole situation of the main protagonist. Robert Pattinson does a great job bringing his character to the screen. In just a couple of years he managed to turn himself into one of the best young actors out there. Even though, his performances have improved a lot in the past three years, this movie really shows how great he can be. When watching, you truly understand the tragic existence of both main characters as seen through the eyes of Pattinson. There is no world where I can praise the directors, writers and actors in this movie without mentioning the soundtrack. The electronic feel which creates suspense in the right moments is truly remarkably utilized in this film. It is a must - watch."
    }
  ],
  "recommendations": [
    "bad_times_at_the_el_royale",
    "widows",
    "a_most_violent_year",
    "end_of_watch",
    "the_accountant",
    "the_equalizer_2",
    "a_most_wanted_man",
    "blackhat",
    "the_infiltrator",
    "the_next_three_days",
    "broken_city",
    "tenet",
    "split",
    "a_walk_among_the_tombstones",
    "drive",
    "the_place_beyond_the_pines",
    "man_on_fire",
    "reminiscence",
    "no_country_for_old_men",
    "prisoners",
    "beirut",
    "breach",
    "a_history_of_violence",
    "the_rover",
    "knives_out"
  ]
}