{"id": 3112, "title": "Good People", "starring": ["James Franco", "Kate Hudson"], "runtime": 90, "genre": ["Thriller", "Crime", "Action"], "description": "Tom and Anna Wright, a young American couple, fall into severe debt while renovating Anna's family home in London. As the couple faces the loss of their dream to have a house and start a family, they discover that the tenant in the apartment below them is dead, and he's left behind a stash of cash—$400,000 worth. Though initially hesitant, Tom and Anna decide that the plan is simple: all they have to do is quietly take the money and use only what's necessary to get them out of debt. But when they start spending the money and can't seem to stop, they find themselves the target of a deadly adversary—the thief who stole it—and that's when very bad things start happening to good people.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/zNhzWvhOJ18Twl5oKanVWT7bcSk.jpg", "categories": {"plot": 5.285714285714286, "acting": 5.0, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.333333333333333, "action": 4.0}, "reviews": [{"rating": "8", "text": "Solid movie.  The gangsters had some views on honor that made it more interesting than other gangster films I've seen.  I didn't find it boring at all, it kept changing continuously and it was suspenseful when it should've been.  I'm a James Franco fan but this might be the worst I've seen him and he was completely serviceable.  Overall this is a tactically complicated story with an underwhelming couple as the main characters---but after all, they're supposed to be normal people with strange choices at hand."}, {"rating": "4", "text": "With high caliber leads of James Franco and Kate Hudson, a thriller movie, even though it has familiar premise, should have had more success in presenting its story. Instead, it squanders the cast by cumbersomely slapping silly plot device or inconceivable plan. Jodie Foster and young Kristen Stewart in Panic Room were better on creating thrill than Good People, this is clearly not the intended result from a movie with award winning cast.\r The Wrights couple has been through a lot, they are currently a bit financially challenged. After relocating to London, they rent their basement to a strange man, only to find out that said man is actually stashing good amount of riches. As more suspicious people come for the money, they are involved in some shady affair with corrupt cop, thugs and thieves. It's not complicated in nature until the movie deems it to be and resorts in Home Alone-esque plot twist.\r The best in the series of awful production is predictably the acting, especially at first act. Both leads perform well to create a couple with actual real life problem. It might not draw the audience right away, but the foundation is certainly there. Unfortunately, the movie progresses into over-the-top conspiracy with cops and drug dealers. The pacing is inconsistent as well, with most of the time spent on establish the Wrights, but a few scenes later on details are glossed over for convenience's sake.\r Cinematography looks okay, although a bit too much bleakness as if London is clouded whenever possible and the indoors are terribly lit. Some of the plans to resolve the situation are not exactly plausible, that's putting it mildly, I’d say they are downright dumb. The plot relies on characters performing unrealistic behavior which is contradictory since it originally tries to convince audience that these are just normal people in bad situation.\r Poorly crafted, falls apart at the end, Good People seems like it's titled for the purpose of creating puns, since almost nothing else good comes out of it."}, {"rating": "0", "text": "Boring, preposterous and idiotic, contains really lame dialogue from London gangsters that stretches credibility even further, even though the premise had stretched it thin enough from the start"}, {"rating": "6", "text": "I saw this movie 4 years ago when it was called Ca$h, but that was a comedy and this was a thriller, still it's amazing just how similar the two films are. Good People and Ca$h are so much alike, that I don't know how the producers of this film didn't get sued! Good People takes place in London and focuses on another young couple down on their luck. They're about to lose everything when their downstairs tenet dies and they find a bag of cash in the ceiling. Much like the couple in Ca$h, they face the dilemma of keeping the money or turning it into the police. Of course they have to keep the money for there to be a film, but shortly after, the rightful owners show up and want their cash, leaving the couple on the run. James Franco and Kate Hudson play the young couple and to my surprise, despite their very different styles, they had great chemistry, but that's really all this film had. It's very hard to review a film that is so similar to another, because I find myself unimpressed by the second film and wonder, if I hadn't seen the first, would I have enjoyed the second? As far as thrillers go, it wasn't much different or better than you'd expect it to be, despite the big names in the cast. Ultimately, Good People isn't a bad film, but I preferred the story in a more comedic form with Sean Bean playing a foul mouthed, wise cracking gangster. If you're a fan of any of the cast members, you should see this film, because it definitely wasn't boring, but it really wasn't anything special."}, {"rating": "7", "text": "The combination of good people and bad money!\r Much better film than I expected. Looks kind of a French thriller, but based on the novel of the same name. It revolves around a young American couple who moved to London, where they're on the verge to lose the inherited house after the severe debt. Luckily they find bundles of money from their dead renter. Since it was a bad money they wait for the right time to spend it, but what follows is their nightmare who ends up running away from the most dangerous men.\r This is really a good story and a well made film, but I don't understand how it was so underrated. Obviously the critics did their job like usual, but the film fanatics turning it down as well which is a very sad. I know it feels so familiar, but very entertaining with lots of edgy moments. Especially the final battle between all the group at one place was very good, yet they kept it so simple. Both the lead actors were fantastic, including a small contribution by Tom Wilkinson.\r It is a small story, that mostly takes place in a week. But the pace was excellent and it comes to the point without making any delay in the form of development. Yet there remains some mystery like how the guy died in the couple's rented apartment. Excluding those which only brings cliché if it goes deeper, the film definitely worth watching and I feel happy for watching a good thriller after a long time. So I recommended it.\r 7/10"}], "recommendations": ["live_by_night", "man_on_a_ledge", "the_loft", "the_accountant", "3_days_to_kill", "the_town", "honest_thief", "cold_pursuit", "the_commuter", "21", "knives_out", "taken", "those_who_wish_me_dead", "no_escape", "the_little_things", "the_next_three_days", "savages", "limitless", "taken_3", "in_time", "the_bank_job", "a_walk_among_the_tombstones", "skyscraper", "lucky_number_slevin", "jane_got_a_gun"]}