{"id": 3836, "title": "Goodbye Christopher Robin", "starring": ["Domhnall Gleeson", "Margot Robbie"], "runtime": 107, "genre": ["Family", "History", "Drama"], "description": "The behind the scenes story of the life of A.A. Milne and the creation of the Winnie the Pooh stories inspired by his son Christopher Robin.", "releaseYear": "2017", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/a6IK3hMlUHzXZZVLBTh0WZ5KoAb.jpg", "categories": {"plot": 7.454545454545454, "acting": 6.666666666666667, "ending": 6.0, "soundtrack": 5.0, "cinematography": 8.5, "familyFriendly": 8.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "Goodbye Christopher Robin was a very good retelling of how the famous stories came about. Margot Robbie and Domhnall Gleeson played their characters very well. Showing becoming a famous author is not all fun and games. Wil Tilston plays young Christopher Robin with the perfect mix of charm, innocence and aggression that you could ever want. This is a film you need to see."}, {"rating": "6", "text": "At the beginning I thought that this movie would be more solid, but it never managed to find a balance on the issues it handles and in the end it affects the result. The story is good and the actors do a good job as well, that's the reason why this movie doesn't fail."}, {"rating": "7", "text": "Alan Alexander Milne (Domhall Gleeson) returns from the World War I to his beloved wife Daphne (Margot Robbie). Three years later, the couple has a boy, whose name is known to every child on the planet - Christopher Robin Milne. He was one of the character in the most famous series about the bear Winnie the Pooh written by his father-writer. But a very few people know that behind the process of creating this fairytales was a tragic story that changed the destinies of Milne and his son.Simon Curtis in the director's chair and it means that film will support by beautiful cinematography and sentimentalism. As in his previous films (\"My Week with Marilyn\", \"Woman in Gold\"). But this movie about the border of public creativity and personal life, about where to stop and do not translate the child's fantasy into commerce. And let the methods of the british director are obvious and chaotic sometimes, but he was able to show the sold childhood of a writer's son. Milne just tried to give the world a fairytale, which world needed so much, he did it all. A beautiful film that skillfully speaks about what had to go through both Alan Milne and Christopher Robin Milne before revealing the adventures of Winnie the Pooh."}, {"rating": "7", "text": "I saw this previewed when I went to see Victoria & Abdul (which is a must see, in my opinion). I immediately connected to it because of my affection for Winnie the Pooh. However, upon seeing Goodbye Christopher Robin, I feel a wanting for more. I wished there was more drama, especially with the orneriness of Christopher's mother and the way Blue dropped CR off at that boarding school. Perhaps the film was true to the integrity of the story, or perhaps the movie's real message is lost on me. Regardless, it was a cute movie. I'm glad to have seen it, but I'm not chomping at the bit to see it again (nor recommending it to a friend)."}, {"rating": "10", "text": "Amazing movie, Surpassed my expectations and then some. Beautiful touching story , great cinematography and writing. Margot Robbie did an amazing job. I absolutely recommend. This never got the buzz it should have. Go watch it. Won’t be disappointed"}, {"rating": "5", "text": "The acting is fine but this film is very dull and not particularly well-written."}, {"rating": "5", "text": "Leaves a pleasant taste in your mouth with its ending, but struggles tremendously to find its footing at any other point. That's not to say it doesn't ever steady itself out, but it does so only sporadically, always looking to jar the audience with its inconsistent emotionality and uneven approach to who the hell the main character is supposed to be. There's also an eyebrow-raising amount of enmity levied at the \"Daphne Milne\" character, some of which seems almost conspicuously biased and impossible to pin down in a historical context, ultimately leading to a general sense of doubt in this being as true as the filmmakers let on. Domhnall Gleeson is a champ and Margot Robbie is as game as usual, but I just couldn't get as invested in this as anyone involved wanted me to."}, {"rating": "8", "text": "I saw this on the plane. When I think of movies, I also remind myself that movies serve different purposes; be it entertain through humour, action, suspense or story telling, movies are here to capture our hearts, minds and fascination, hopefully a sprinkling of all things.As a kid, I was very fond of Winnie the Pooh and his gang of friends, so selecting this movie was out of curiousity and interest in the how/how it came about. I really enjoyed the story, it's ups and downs, the character development and how touching each phase of the movie and story is laid out. For me, an 8 is very high in my ranking system. Really enjoyed the movie and the story. In all it was quite moving and touching as well."}, {"rating": "5", "text": "On the worldwide scale Winnie the Pooh is a wonderful, cute and funny tale, mainly for kids. Indeed, one cannot promise, that fairytales are created in peace, with smile on a face. Still, I have found this story too cynical. Also there was a hope that all toys will also be showed as living things.All in all this is quite an interesting story, but again its mood is not quite appropriate."}, {"rating": "8", "text": "Excellent movie. I recommend it. It makes you miss your childhood no matter how old you are. One the best movies I've seen in the last days."}, {"rating": "6", "text": "There is probably a decent movie in there, but too often this comes across as nothing more than a big budget tele-movie."}], "recommendations": ["christopher_robin", "me_before_you", "joy", "the_glass_castle", "breakthrough", "moonrise_kingdom", "the_fault_in_our_stars", "big_fish", "hereafter", "onward", "collateral_beauty", "gifted", "eddie_the_eagle", "me_and_earl_and_the_dying_girl", "blue_valentine", "a_beautiful_day_in_the_neighborhood", "captain_fantastic", "her", "the_age_of_adaline", "the_perks_of_being_a_wallflower", "the_blind_side", "a_bronx_tale", "the_secret_life_of_walter_mitty", "the_book_thief", "the_giver"]}