{
  "id": 4148,
  "title": "Good Luck Chuck",
  "starring": [
    "Dane Cook",
    "Jessica Alba"
  ],
  "runtime": 101,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Cursed since childhood, dentist Charlie Logan cannot find the right woman. Even worse, he learns that each of his ex-girlfriends finds true love with the man she meets after her relationship with him ends. Hearing of Charlie's reputation as a good-luck charm, women from all over line up for a quick tryst. But when Charlie meets the woman of his dreams, he must find a way to break the curse or risk losing her to the next man she meets.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eGxaRbDfxBWPysoxkOfYgkwflxJ.jpg",
  "categories": {
    "plot": 3.1666666666666665,
    "acting": 3.3333333333333335,
    "ending": 5.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 3.757575757575758,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "In DC comics lore, there exists an Anti-Life Equation, which serves as proof of mathematical certainty that life, hope, and freedom, are all pointless. Good Luck Chuck is the Anti-Funny Movie; it proves that even in a modern world where we get to see films like Superbad and Knocked Up, the idea of laughing is not worth it."
    },
    {
      "rating": "0",
      "text": "i never hated dane cook untill i seen this filth. this has to be one of the worst commedy's ever made. even sexy jessica alba in her underware isnt worth seeing this even for free...hell even if you paid me. if you find a copy of this film burn it ."
    },
    {
      "rating": "1",
      "text": "Dane Cook has never been funny once in his entire life and Jessica Alba is just here to be looked at like always.  Yawn."
    },
    {
      "rating": "4",
      "text": "Though its about a romance between Alba and Cook, you can almost feel an epic tug-of-war going on between the two of them; Cook trying to make the film dreadful, Alba trying to make it just bearable."
    },
    {
      "rating": "2",
      "text": "Oh dear.  The only thing worse than an unfunny rom-com is by trying to make the film more appealing by adding in pointless, sexist nudity scenes and more unfunny but puerile gags.  It gets two more points than it deserves because I smiled three times and Dane Cook, Jessica Alba and Dan Fogler at least tried (a bit).  Still, you'd think that Jessica Alba is too good for these types of films by now, but no.\r Avoid at all costs."
    },
    {
      "rating": "2",
      "text": "How does Jessica Alba expect to be taken seriously as an actress when she stars in crap like this?"
    },
    {
      "rating": "2",
      "text": "But, its JESSICA ALBA hello, do reviews even matter at all."
    },
    {
      "rating": "1",
      "text": "Wow. Dane Cook is a funny guy, meet him a few times bouncing at comedy clubs. How he keeps finding his way into these terrible movies that aren't funny bogles my mind. My advice is that you go see him perform stand-up, if you want to see Mr. Cook at his laugh yourself stupid best."
    },
    {
      "rating": "0",
      "text": "This movie was HORRIBLE My impression when I saw the previews was that it was a family comedy. So I watched it... WITH MY FAMILY Huge mistake. I ended up stopping the movie about 20 min in. I figured I can handle a few boob scenes. This movie is not worth seeing, unless you enjoy watching other people have sex. Or if you enjoy watching other people have sex, with your family and friends. Its ridiculous what they can put on movies now a days. The beginning of it shocked me beyond reason.. Those little kids, and that little girl, topless... Absolutely out of this world.. Mark Helfrich Josh Stolberg Steve Glenn Might as well be pedophiles or porn directors. What a huge waste of money. I hated this movie Cannot say it enough. Dane Cook, your not that good looking, you do not need a movie to boost your self esteem. Pretty sure women will not sleep with you like that in the real world. Jessica Alba, you could of done better. Not a movie for such a pretty, young, talented woman as yourself. Suprising you took the part... Anyway, the only other thing this movie has to offer is the infamous fat Dan Fogler. That dirty sick sad little man. Horrible jokes, horrible lines. Typical guy who never gets anything and wishes he did. No one in the room laughed once during it. Please people, keep young eyes AWAY from this movie. And couples, do not watch it, watching your boyfriend get an erection during a movie...well its not somthing you want to expeirience. I am off of my soap box now. Let the critizing and judging begin."
    },
    {
      "rating": "2",
      "text": "By far one of the worst movies I've ever seen. When will Hollywood realize that if they want a poor excuse for a film, they will put such unfunny wanna-be actors in such as, I don't know, Dane Cook? Not to mention the uncalled for sex scenes. I'll admit, there are times when a sex scene is needed, but this was grotesque. It was as if Mark Helfrich was just trying to give the American High School kids something to talk about instead of focusing on a good movie. The script, well...have you seen it? I give it a rating of two, for pity's sake."
    },
    {
      "rating": "0",
      "text": "Seconded on the Jack Mathews comment. \"Fogler gets my vote for the worst performance of the year.\" I felt like they wanted a combination of both Jack Black's and Jason Alexander's characters from \"Shallow Hal.\" I felt insulted watching this, and as I rent it out to people at Blockbuster video everyday, I feel sympathy more than anything."
    },
    {
      "rating": "2",
      "text": "I thought that there might have been a chance that this movie would have been entertaining... but I was wrong."
    },
    {
      "rating": "0",
      "text": "Believe the critics on this one. One of my friends has been telling me how funny this movie is. So, I finally watched it and it is bad. I fast forwarded through much of it. I can find something entertaining in most movies, and I tried really hard to like it, but it was no use. Stupid, crude, unfunny, full of every ridiculous cliche. Please don't subject yourself to this."
    },
    {
      "rating": "2",
      "text": "After Chuck(Dane Cook) is bamboozled by his best friend, \"Good Luck Chuck\" goes so wrong, it almost turns into performance art. Either Cook is a terrible comic actor, or Chuck is mentally ill. Either/or, the film still sucks; proving that the balancing act between tasteless humor and heart that the Farrelly Brothers pull of is indeed a high-wire marvel. Chuck's desperation to win Cam's heart will cause the audience some discomfort. You'll wonder why she just doesn't call the cops. Jessica Alba is not funny. If you think she is, well, that's just a reflection of your real life, in which you'll laugh at the sexy girl's jokes in order to sleep with her. Alba makes you aware of Cameron Diaz's wondorous ability to be glamorous and endearingly neurotic."
    },
    {
      "rating": "1",
      "text": "This movie is terrible. Dane Cook is just not funny."
    },
    {
      "rating": "1",
      "text": "Can we get a big petition going to ask Dane Cook to stop acting and continue his real comedy - stand up?"
    },
    {
      "rating": "1",
      "text": "Bump into the pole? Drop the cup of water to Dane's d**k? This movie is like a cartoon with most ridiculous accidents. This worsens Dane Cook!"
    },
    {
      "rating": "0",
      "text": "Was disgusting and crude...horrible excuse to watch a porno in a movie theater...i was uncomfortable to the point that i walked out, very disappointed and shocked at what i saw"
    },
    {
      "rating": "0",
      "text": "If a romantic comedy manages to turn Jessica Alba into a confusing, unlikable character, imagine what you might think of Dane Cook after seeing this. I wouldn't watch a 5 minute short film on one single character from this movie."
    },
    {
      "rating": "2",
      "text": "All that's saving this from a zero is Jessica Alba's unbelievable ass."
    },
    {
      "rating": "3",
      "text": "Just downright no good. Jessica Alba's rocking body is the only good part of the movie. This movie is about as funny as having the flu."
    },
    {
      "rating": "0",
      "text": "Is the Dane Cook thing over yet? Please. This movie is awful and never funny. When you act, Dane, you need to be more natural ...you need to be less self-impressed and show a bit more humility and vulnerability. Now instead of writing a letter to the \"future\" Dane Cook, you should write one to the \"past\" Dane Cook and tell him not to take this role."
    },
    {
      "rating": "0",
      "text": "This movie is aggressively stupid. Dane Cook is an embarrassment to humanity."
    },
    {
      "rating": "1",
      "text": "Ok it just sucks people. I work at a DVD rental store and un-recommend it to people as the ask me if it's good (making sure to do so loudly enough that anyone else in the store doesn't make the mistake). Oh, and if you didn't know who Dane Cook was before this movie, you're not missing much."
    },
    {
      "rating": "1",
      "text": "This was disgusting and crude."
    },
    {
      "rating": "1",
      "text": "Jessica Alba needs to get a better agent. She can't act worth a dang, but she's cute and she's popular. Surely she can do better this piece of crap. I give it 1 out of 10, and that's being kind!"
    },
    {
      "rating": "1",
      "text": "What is disappointment! I saw this at a pre-screening and I love Dane Cook! But this is a soggy, stupid \"romantic comedy\" that completely misuses its talents. Why would anyone be involved in this pile of tripe is anyone's guess? It is not funny, and worse, not sexy. Much worse than any straight to DVD I've seen in a while!"
    },
    {
      "rating": "0",
      "text": "To the person who said this movie was \"well done and funny\" Did you not notice the boom mike at the top of the picture every time the scene was in a bedroom or enclosed space? What about the scenes where a person was talking and half their face was cut off by the extreme closeups? If this movie was well done or funny at all, \"Dragon Wars\" deserves to sweep the Academy Awards. This movie is an affront to comedy, and each ticket sold only perpetuates American culture as the lazy, unintelligent clusterf.ck of repetitive motion that it has become."
    },
    {
      "rating": "0",
      "text": "Horrible, I already hated Dane Cook but he should just stop making movies, if its not with Jessica Simpson it will b Jessica Alba, next it will be Jessica Biel, in the same romantic comedy in which he tries out physical comedy, Ben Stein would do a better job."
    },
    {
      "rating": "1",
      "text": "The problem is, none of the characters are believable. Dane Cook as a Dentist, Jessica Alba as Peguin expert and a Cosmetic Surgeon who can't get any and resorts to a grapefruit. Come on. Then the over the top sappy \"try to keep\" then \"if you love someone let hit go\" segues? If I wasn't at the premier I would have walked out. I'm not sure whether to feel pity for the director's debut or for all the poor schmucks who will shell out cash to see this."
    },
    {
      "rating": "1",
      "text": "Do not go to this movie. save your money. maybe 3 laughs. The only one who thinks Dane Cook is funny is himself. Jessica Alba is beautiful, but look at her somewhere else."
    },
    {
      "rating": "0",
      "text": "Horrible...The producer should kill himself for putting this horrible movie together. Dane Cook should kill himself for being Dane Cook. To anyone who hasn't seen this film....DON'T WAIST YOUR TIME!! This movies is worst than a zero..and that's being nice."
    },
    {
      "rating": "5",
      "text": "A sparingly funny film with some truly revolting characters."
    },
    {
      "rating": "9",
      "text": "Seriously, people need to cut this movie some slack. For the people saying that this movie was too gross, super bad was way grosser and it still got good reviews. I watched this movie today I would laugh at all the stupid jokes Stew made I smiled and laughed half way through the whole movie. I say that people should learn to loosen up a bit."
    },
    {
      "rating": "10",
      "text": "I think that this movie was great. It was funny, I couldn't stop laughing threw out the whole film."
    },
    {
      "rating": "10",
      "text": "Simply put, this movie is hilarious! I laughed all the way through it. The people who gave it bad ratings need to lighten up and get a sense of humor."
    },
    {
      "rating": "10",
      "text": "This movie was by fare one of the best i saw in the resent past. I really dont know why people would like this movei. Maybe just because there are sooo many boobies to see ^^ lol Its another great DaneCook hit!"
    },
    {
      "rating": "10",
      "text": "Very tasty, it is kind of funny, but very sexy, breathtaking, heart-pumping, very good to the range that Jessica Alba goes."
    },
    {
      "rating": "7",
      "text": "This movie had its funny moments. I always liked Jessica Alba but never got to see her movies since she stars in the ones I have no interest in. I'm guessing she is up for taking lame roles. Nonetheless this movie was not a complete fail especially considering it made good revenue on release."
    },
    {
      "rating": "6",
      "text": "despite the movie being a cheaply made, mean spirited gross out comedy, I can't say i didn't get my fill of rauchy jokes and gags.I can say i was mighty satisfied."
    },
    {
      "rating": "8",
      "text": "I really don't know why people are hating. Dane Cook was amazing in this movie"
    },
    {
      "rating": "5",
      "text": "I thought parts of the movie were funny but the jokes became tiresome and repetitive. Please no-one compare this to Superbad. The characters in Superbad were always funny and endearing and the storyline was brilliant. Good Luck Chuck was just 1 and a bit hours of crude and sometimes disturing boob jokes with no chemistry between the characters. Jessica ... what were you thinking??"
    },
    {
      "rating": "7",
      "text": "Not the best movie you'll see this summer, but funny, entertaining, and surprisingly enjoyable. Try as they might, there's no convincing performance of any on-screen chemistry between the two leads. So once you get past that and just enjoy the movie for the oversexed sidekick and slapstick humor (a la Superbad), it's not that bad of a \"romantic\" comedy. Despite the cheesy overdone and predictable \"romantic comedy\" themes, I found myself (and everybody else in the theater) laughing throughout the movie. Dane Cook is at his best when he's obviously improvising his lines. The movie lives up to its R rating with the colorful language and many bare breasts (and Cook's butt)."
    },
    {
      "rating": "9",
      "text": "I understand that the movie is having many flaws... it gives wrong impression about the culture and ethics.. Yes. we cannot enjoy the movie if you try to find out the good message out of it.. BUT.. really I enjoyed the performance of Jessica Alba.. and Cook.. Jessica Alba proved once again that she is the Best."
    },
    {
      "rating": "8",
      "text": "I like it. I'm not a fan of Dane Cook. Because his acting on the stage is what makes his jokes funny, his CDs suck. But I thought he did a good job with this movie. It was funny - I understood his frustration and laughed because it was like a game. The actors looked like they were having a fun time. At times this movie was also touching, at others it was down right nasty. And near the end, I didn't know exactly where the story was going to flow. I didn't understand Cook's strategy, which I don't think he did either. Stu isn't as repulsive as others say. He doesn't repulse me nearly as much as the dialog in Super Bad. He's clearly a loser, but that's what makes him funny. After a while, he ends up being kind of an A-hole, but I think - maybe I've had a friend like that."
    },
    {
      "rating": "8",
      "text": "I thought this movie was hysterical. Not all movies need to have deep meaning. The best friend was a little over-the-top, but I found Cook & Alba hilarious. Lighten up!"
    },
    {
      "rating": "2",
      "text": "Was it funny? No. It was just Dane Cook being disgusting."
    },
    {
      "rating": "7",
      "text": "Here is only reason I gave this movie any good rating. Well actually there are two reason: One you get to watch Jessica Alba for a good majority of this movie. Sure I would have preferred this movie had a much better story. But then the second reason is that you get to see Jessica in her underwear. This is also based solely on a machismo desire to see really beautiful women wearing pretty hot briefs. I will not argue in any way that there is any credible reason, other than these two, to actually see this movie."
    },
    {
      "rating": "4",
      "text": "It's an extremely uneven movie that delivers some comedy every now and then, but relies on the constant repetitive jokes of simplicity. It's not always bad, but after a straight hour of it, you'll be looking for at least ONE inkling of intelligence in this slow, mostly uninteresting comedy. Dane is Dane, no real available comments on his acting, because it's not really acting at all, it's just Dane. As far as Jessica Alba goes, she just does what she's supposed to: act dumb with a big heart. As for uneven, it stretches itself in moments of big reaches for hilarity, and then coming back to an absolutely absurd love story, and terrible dialogue with pick-up lines commenting on a girl being like a penguin, and how they're awkward when they're out of water, and beautiful in it. How that was supposed to make Alba feel when he said that, i have no idea. Dane's friend is half hilarious, half annoying. You'll eventually tire of him (along with just about everything else in the movie) but he is able to have his moments. The one who seems to pull out the best is Alba's brother, the marijuana man. Every time he's put on the screen it's funny, and sticks to what this script was supposed to exude all along: good-natured comedy. But when you water it down with drab, overdramatic lines of love and loss of love, you end up with someone completely unentertaining. And the last half hour or so of this movie is absolutely atrocious, which brings any humor you experienced in the first parts to completely go out the window. The ending credits however, are a joy. They're the funniest part of the entire movie, which, however sad it may be, at least gives you some hope Dane can still be funny. Sadly, you won't still want to be in the theater when the credits finally make their way down."
    },
    {
      "rating": "8",
      "text": "Though I can understand people's aversion to raunchiness, this movie is more than that. I appreciated the style of humor, Dane Cook's acting, and more. This movie rises above most 'romantic comedies' as finally the guy has some morals."
    }
  ]
}