{"id": 1832, "title": "Goodbye World", "starring": ["Caroline Dhavernas", "Adrian Grenier"], "runtime": 101, "genre": ["Drama", "Comedy"], "description": "When a mysterious cyber-attack cripples civilization, a group of old college friends and lovers retreat to a remote country cabin, where they must cope with an uncertain future while navigating the minefield of their shared past.", "releaseYear": "2013", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/1WEzts5eapNbxglUSNUXUrs98CR.jpg", "categories": {"plot": 3.857142857142857, "acting": 5.3125, "ending": 5.142857142857143, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 10.0, "funny": 9.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "There are some movies would have been better in a longer format, something very much prevalent in British television: the one-off three episode series. As the \"Welcome Home\" song ended and the credits finally stopped rolling, I felt that I wanted to see more of this story. I would describe the atmosphere as a more pleasant The Walking Dead, when they were still on Herschel's farm. I generally like character studies, especially if it is done well, like Sundance Channel's Rectify.\r There was something really compelling about the very flawed characters, and the understated acting helped a lot. I really like Ben McKenzie in this adult and no-cheese acting work. Actually it goes for Adrian Grenier as well, as I have not been a fan of his; I don't hate him in this movie. I liked all the characters, really.\r From the outset, there is inevitable comparison to It's A Disaster, a comedy from 2012. Although they are pretty much going for very different genres, there have the similar premise of friends stuck in a house while the world ends outside. I like both movies and it doesn't feel like watching the same thing twice, but if I had to choose, I would choose Goodbye World, only because it is better written for the genre it is made for. It's A Disaster was funny, but it was not so funny.\r What goes against this movie is that the resolution and story overall is approached from a rational intellectual perspective, which is not realistic. \"We are the enemy,\" as Laura said. People are not naturally good, which everyone in this movie is, except for the cartoon villain Damon. The optimistic outlook of this movie is what might have drawn me to it, but it is also its biggest flaw."}, {"rating": "10", "text": "Great movie, good actors nice story, didn't like the ending but it' definitely a movie worth watching :) by the way nice soundtracks. The critics were to harsh with the movie..."}, {"rating": "4", "text": "Goodbye World crutches heavily on it's actors making the best of a bland apocalypse script that avoids any serious confrontation with the real world, leaving them to carry-on living their meaningless self-righteous lives in an isolated utopia."}, {"rating": "0", "text": "I saw the first 45 minutes and and shut this off – reading the ending\rin the plot section of Wikipedia. It's a shame these folks weren't\rkilled off in this supposed apocalypse. I think the part that utterly\rhad me pissed, were the characters' apathetic POVs to what was going on\routside their space. The ultimate in narcissism where the world is\rcoming to an end and all they can do is kvetch about their pitiful\rrelationships. Reminds me of those Goth kids in South Park....\r Some people found the story well-written; I think they they didn't\runderstand the story and tried to cover it up by saying it was\rwell-written. I've even taken five minutes and my FIRST review on Metacritic\rto let people know to not waste their time. BTW, \"living off the grid\"\rwith a WiFi code of \"Spaced360\"?? Sounds like grid living to me."}, {"rating": "4", "text": "Okay, what if you could combine the \"Big Chill\" formula (i.e., reunion/reminiscing/rekindling relationships amongst a bunch of friends after many years) tossed with the Post Apocalyptic genre sprinkled with some mumble-core? Why, you would get \"Goodbye World\", of course. Off-the-grid homeowner James and Lily host old college friends who coincidentally converge there just as American society begins to collapse. Is such a mixture of genres a good thing? Well, if you have characters you like and care about undergo the trials and tribulations inherent in a world without rule of law whilst engaging in mundane everyday talk (the essence of mumble-core), then the answer is, \"yes\". The problem however, is that the characters in this movie are so unappealing and annoying that I never was able to nor did I want to care about them--I was waiting for rampaging zombies or foreign invaders to thin the herd, but I didn't even get that satisfaction, as \"Goodbye World\" is not an action/horror/suspense post apocalyptic movie, but more of a film where we are expected to intently listen to the characters talk (and talk and talk), moving our heads to and fro trying to study them and empathize and invest our emotions. Based upon their chit-chat I was able to conclude that the characters: talk behind each others' backs, cheat, engage in one-upmanship, deal with ulterior motives, think only of themselves, live for attention, and steal teddy bears.\r Their actions are annoying too. Most of the characters (except three) are guests staying at the off-the-grid location. All they do is smoke pot, get into pissing contests regarding the past, skinny dip in the hot tub, snog immodestly, compare pubic hair grooming, sunbathe, and conduct themselves with no regard to the repercussions for the group's chi. Furthermore, their actions and self-absorption don't come off as authentic, what with the world ending and all. And two of the characters have intimate knowledge of the societal collapse occurring as well. I understand that no one is perfect, and that a well fleshed-out character is not one punched out from a cookie-cutter, but are we to believe that they are so self-centered that they disregard the bigger picture that looms over them? What about survival? Establishing order in their group? Assigning responsibilities? Protecting themselves from roving bands of brigands? Speaking of protection, our heroes only have a sole ancient (1880's!) Webley revolver for firepower. James even exclaims upon first seeing it, \"How dare you bring a loaded gun into my house!\". Seriously? I'd have given a heads-up. Was that gun a deliberate choice by the film makers, or a cut rate rental deal from the props department armorer? James prepped for everything, yet he had no arsenal at all. How could you plan to live off the grid, prep for the collapse of society, stockpile food and medicine, grow vegetables, and not have a single weapon to safeguard it? Perhaps he planned to \"stone\" his enemies, and I didn't mean throwing rocks.\r There is a high point in the film where the characters confront two soldiers who wish to use the home as a base camp, and are turned away, being reminded about the Third and Fourth Amendments of the Constitution (quartering troops and unreasonable searches). The actors did a commendable job considering the script handed to them, as did the director, cinematographer, and editing staff. But as with any failure, upon review you could say that something could have been done to rescue it, and this film is no exception. I would have rewritten the script, lessened the \"mumble\", and added more \"core\" and given the characters a little more accountability considering their actions and attitudes than what is finally revealed. The rivalries and ripped relationships amongst the characters are resolved at movie's end, but the emotional payoff is so minimal that I was left dissatisfied. It's like getting a Happy Meal without the toy,\ror a salad with blue cheese when you wanted ranch."}], "recommendations": ["greenland", "the_purge_anarchy", "sas_red_notice", "children_of_men", "divergent", "vivarium", "smallfoot", "contagion", "the_titan", "downsizing", "the_first_purge", "the_rhythm_section", "machine_gun_preacher", "snowpiercer", "crash", "colossal", "noah", "into_the_wild", "elysium", "the_space_between_us", "nerve", "voyagers", "chaos_walking", "lucy", "the_adjustment_bureau"]}