{
  "id": 1149,
  "title": "Goosebumps",
  "starring": [
    "Jack Black",
    "Dylan Minnette"
  ],
  "runtime": 103,
  "genre": [
    "Adventure",
    "Horror",
    "Comedy"
  ],
  "description": "After moving to a small town, Zach Cooper finds a silver lining when he meets next door neighbor Hannah, the daughter of bestselling Goosebumps series author R.L. Stine. When Zach unintentionally unleashes real monsters from their manuscripts and they begin to terrorize the town, it’s suddenly up to Stine, Zach and Hannah to get all of them back in the books where they belong.",
  "releaseYear": "2015",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aeZT9pqEgrmXOGdESFkAuVjX6kw.jpg",
  "categories": {
    "plot": 6.457142857142857,
    "acting": 6.9375,
    "ending": 4.8,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.8,
    "funny": 6.9393939393939394,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "A different story line than the usual teenager-scary-monster genre.  Well written with intelligent remarks from the teenagers themselves, what a surprise!  Is this a movie about a real person who writes scary monster books?  Good movie, but not great."
    },
    {
      "rating": "7",
      "text": "\"Goosebumps\" is a great, fun thrill ride for the whole family filled with great jokes and wonderful chills. Jack Black is perfect in his role and the young main stars shine."
    },
    {
      "rating": "6",
      "text": "There was a real nostalgic feeling for me when I sat down to watch this film.  After it was over I felt mildly entertained.  My main problems with the film come from some weak story elements and some average CGI.  In the end Goosebumps is a pretty fun ride for all ages.  B-"
    },
    {
      "rating": "10",
      "text": "Goosebumps Is Great Family Movie But Never Watch TV Show But This Movie Is Awesome This Film Release After Hotel Transylvania 2 This Film From Soby Pictures Animation"
    },
    {
      "rating": "7",
      "text": "Just the right amount of nostalgia and campy fun.\r For most movies, being formulaic would be a flaw. This is not the case with Goosebumps, it takes full advantage of the nostalgia effect and instead of going for edgy dark atmosphere, it stays within the boundary of its fun juvenile antics. It brings mild comedy of horror with surprisingly decent visual effect as well as healthy amount of witty jokes.\r The set-up itself will be a reminiscence of retro horror and 90s gimmicks. From the quiet suburban life where the sneaker-wearing teen protagonists would wander off due to boredom, the strangely oblivious adults who only realize the dire problem far too late and all the PG-13 monsters, it just reeks of nostalgia. However, the movie also balances this with a few modern touches so it would be accessible to previous and current generation.\r Plot isn't complicated, the trailer or synopsis pretty much script the whole thing. Monsters from the book roam a once peaceful city and a merry band of teens must save it from destruction. There are a few developments here and there, but none too major or shocking which is understandable for family movie. Granted, there are a couple of plot holes or a few scenes where it feel too frantic, but audience would mostly be lenient considering the silly nature of the movie.\r Its greatest asset aside nostalgia is the humor. The cast does a fine job delivering the timely quips and awkward situations even during chaotic danger, or rather it works from the irony of being in such danger. There's surprisingly good chemistry between them, beyond just stereotypical teen escapades. Jack Black does his usual eccentric persona. While it's not great, it's presentable, plus the movie needs a big name for push.\r Goosebumps is arguably predictable and can be hectic at times, yet it has sufficient nostalgia charm and witty humor for an entertaining family oriented adventure comedy."
    },
    {
      "rating": "5",
      "text": "Goosebumps is a fun adaptation of the popular books for kids that will certainly please kids and entertain the adults who watch it with them. The acting and story are pretty standard and this one is a great example of a film that takes literally zero risks. However, the film remains cute and entertaining, plus the special effects are very cool. Plus, as someone who loved the Goosebumps books, it was cool to see the monsters I read about come to life on the big screen. Finally, the lore behind their existence and all that is pretty interesting and compelling, so points for that. Overall, Goosebumps will entertain, but certainly not wow at any moment. It is a children's film through and through."
    },
    {
      "rating": "6",
      "text": "Though we do team up some of the cutest teens in a tweenish flick and the comedy of Jack Black, this type of plotline feels all too familiar, like if you crossed Jumanji with Hocus Pocus."
    },
    {
      "rating": "7",
      "text": "Goosebumps pays a successful homage to it's source material with its fun filled adventure. The film could have been scarier, but is fine for its target audience."
    },
    {
      "rating": "7",
      "text": "Entertaining fast paced family friendly creature feature that's highlighted by eye-popping special effect and fun performances from Jack Black and a bunch of Hollywood future stars. It's a bit manic at times, but that's okay because it seems to suit this style of film. It sort of reminded me of an episode of \"The Twilight Zone\" or \"Outer Limits\". It also sets itself up for a sequel, which I'm sure will happen."
    },
    {
      "rating": "7",
      "text": "\" Goosebumps \" was a book series adapted R.L. Stine of course , pleased the young and old, and this adaptation has been very successful, especially when Jack Black plays the writer and the living doll, a fun and irreverent movie."
    },
    {
      "rating": "7",
      "text": "6 points because it didn't had anything new to say and because it was a really messy movie. It used all of the characters from other movies, not adding much of new character; it was like tricking the children. For showing love, fear, cry and laughter we could see more explainable actions in \"Inside Out\". But i give it one point for Jack Black for accepting to play in this movie, and I'm sorry for not giving more points to Jack Black because then it will give more points to the Goosebumps. But we need to always remember that this kind of movies are very sensitive for our children and the directors need to accept to create this movies very wisely, with a Psychologists's view."
    },
    {
      "rating": "6",
      "text": "To begin with ,I'd like to say that this movie is funny enough,in some places scary a bit and you're getting into this with smile.\r But the movie itself is suffered from some flaws.Well,I want to recount some pros and cons.\r Pros:\r+good acting\r+good actors\r+parent-child relationships\r+the trailer\r+the twist\r I was surprised by Jack Black.He's a very strange actor for me but in this film he did a great job.\r I don't know whether you'll agree with me or not but I saw here relationships between parents and children.I'm sure everyone's experienced and undergone such situations.I couldn't keep laughing when I saw the first acquaintance between the father of this girl and the boy.Haha,that's well done.\r In addition,the most important thing of any movies is to attract your attention to it and it did.\r There was the perfect twist.Guys,I was shocked when I knew the girl had been unreal and written by his real father .\r Cons:\r-plot holes\r-some scenes are ridiculous\r-unreal love story\r-poor plot and script\r-undeveloped villain\r-a cut -and-dried out ending\r The writer says:\"I've sold 400.000.000 books.How could he sell these books if they were magic ,locked and written by \"a soul machine\"?May be the others had been written owing to some outdated PCs?If he'd sold such ones,would all human beings have been in danger!...All HUMAN BEINGS...Where's a logic and sense?\r Guys,gnawing of wolves,fast and furious love,hollow shops special for you and you're not explained why Stine did create his daughter ...Why?Why is she dead?Where's his wife?\r But all-in-all,I can say that I'm not in love with it but I do like it and despite some flaws ,I do recommend it with popcorn and Coca Cola in the theater."
    },
    {
      "rating": "5",
      "text": "I thought this was going to look a bit stupid from the start. I was corrected wrong, but not the greatest thing you guys can ever see from any Goosebumps installment."
    },
    {
      "rating": "7",
      "text": "Goosebumps crams too many monsters into too short of a runtime to make the best of the beloved book series and does so without leaving a single goosbump on even the youngest viewer's forearm. That being said, the story is full of good fun that nails nearly every scene perfectly for the target audience in which the books are aimed. I, being 21 years old, may have only found the film slightly enjoyable here and there, but I'm aware I'm not the target audience. In conclusion, Goosebumps doesn't get it all right and doesn't quite leave enough for us outside the target audience, but for those between the ages of four and fifteen this is a damn good attempt."
    },
    {
      "rating": "7",
      "text": "The premise of this movie was good, always been a fan of the Goosebumps books as a kid and the TV Show, this movie was okay, a few good jokes and appearances from classic goosebumps characters, Jake Black was good but other than that the movie didn't live up to my expectations, mostly due to the bad CGI and acting, but the worst is they didn't feature the Goosebumps theme song.... I did enjoy the cameo of RL Stine though. All in all this movie was just okay."
    },
    {
      "rating": "9",
      "text": "It isn't really based off the books or the tv shows only the characters or monsters. This movie doesn't deserve bad reviews only if you hate goosebumps in general."
    },
    {
      "rating": "3",
      "text": "Understand .....  this is a review from a mature adult.  If I was 8 to 16 years old again I guess I might have liked this.  It is not for mature audiences. Like other animated movies which always get high rating numbers this was no exception. So I feel kind of guilty posting a low grade but it is outside my genre"
    },
    {
      "rating": "8",
      "text": "I thought this was going to be complete garbage at one point. But let me tell you this was an exciting, and hilarious, family experience. The spooky elements tie really well into this jumanji-esque escapade packed with ghouls and ghosts. Sure, the CGI looks kinda fake, but it wound itself quite well with it's 'Gothic Exotic' atmosphere. Great time at the movies for everyone even if the cliché's  make a firm appearance."
    },
    {
      "rating": "6",
      "text": "Enjoyable and entertaining for sure. But Goosebumps misses what pleased me the most about Stine's stories: the fear. This film isn't scary, maybe in a few scenes in which Slappy appear because of his dark sense of humour. Putting all monsters in just one script, besides all cliché characters, without any kind of real development didn't do well to the final result (we also have a few holes in the story). The comedy isn't bad but the excess of it jeopardized the terrror from the books. Goosebumps is funny, can't deny it. But it could have been much more than it was."
    },
    {
      "rating": "8",
      "text": "It may not be the perfect movie and may be a little too long, but is sure is a great movie to watch with your whole entire family that you will enjoy! There were a couple of good scares, and the acting was pretty great too. If you teens are looking for a perfect horror movie with plenty of jump scares, this will not satisfy you; but if you are an adult who enjoys Jack Black movies, chances are you would like this film. There is plenty of jokes; some work, some don't; but overall, I think this film is a very fun film to watch with your children."
    },
    {
      "rating": "9",
      "text": "With lighthearted humor, impressive animation, and even some emotional moments, Goosebumps brings R.L. Stine's characters to life, if at times a little too overcrowded on the screen."
    },
    {
      "rating": "0",
      "text": "Now, I know what everyone reading this is thinking. And yes, the whole concept of giving this film a dirty zero, may shock some, \"may\". But in all reality, I'm not merely attention seeking. Because believe me, there are many attention whores out there, lurking on this web, giving dishonest and overall baffling reviews, especially when it comes to actual decent movies. Now, if you truly wish to continue reading this, get prepared, because I'm going all the **** out on this piece of ****ery film! And I don't give a jack **** about what you think, okay?\r So, to begin on why I think this film deserves to suck on some sexy testicles sacks, I'll start with the overall concept they were trying to go for here.  As you've already been informed, it's a film about the author of the original, unaltered Goosebump books. Now, I haven't actually read the books, yet. But I can tell they were mixing and searching through their best and brightest ideas, to ultimately create a classic of a film. And honestly, it could've been something to remember.\rJumanji did it much better. Here's why: it blandly panders to the teenage demographic, with frequent pop culture references and unnecessary and inappropriate jokes, that barely mix in with the actual film's true nature. For instance: the whole \"new kid\" on the block concept has been done in almost literally every 1980's/1990's movie. We're past this, this is 2015. Regardless, it's obviously ripping off many other films, most likely better than it.\r Another bugger - Jack Black may have given it his all, and you can tell through his acting in this film. But he was still an overpaid, wasteful use in this title, only casting him because people will see it. And I did, sadly. And this, I just wanted to go back, watch all the wonders of our time. Is that truly too much to ask? Now, in truth and my current truth, we stand between the unnecessary and freaking stupid teenage society, bringing up the dumbness from our other (adult) culture. Considering everything, the CGI itself was pretty poor. Not the worse ever (cough, cough, Shark-****ing-nado), but still pretty poor. And the creatures themselves don't really get enough screen-time, well, except the giant praying mantis.\r Another thing: the love story was worse than Twilight! Well, I mean, that's up for debate. Anybody wanna debate... I thought not. Anyway, you could see it coming from a mile away, about where they first mat. It's really cheesy, and just plain lazy story tale writing. With such great title recently, including decent love stories, this was a true shame and tragedy. And speak of tragedy, that \"un\"consensual kiss between the girl and the douchebag. So it's okay if a girl surprise kisses a dude, but not the other way around?!  That's just the gateway to reverse rape! It's pretty poor morality, especially coming from a movie advertised generally by kids. It was expected, but she should've at least leaned in to show she was gonna snog him. I mean, you could obviously tell she looked like a spoiled, lousy tart! But even so, she should've have done that without giving another hint or saying first. Geez, what a dynamite whore! Terrible message. No woman on man mouth rape, thank you very much. If I were him, I'd hit that **** (Not really) But still.\r Anyway, regardless of this, the movie still had some good. For example: it made you laugh unintentionally. But I'm not counting that, okay? So, what's the catch, eh? Welp. It's the principle, actually. It's a stupid teenage flick that only serves as pop culture, rather than real scars or enchantment. I was so confused with the emotions, honestly.\r At the time: it was a beautiful day. There were children excited, seats all ready, as I walked into the theater. I lied back, and began watching this torture. With movies like these, directors who strive... SHOULD BE ****ING A DUCK,,,\r My final verdict for this poorly advertised flick of ****ery, made by morons, for other morons who disrespect the books and bring overall shame to our modern society. This film... gets a ****ing ZERO out of ten. Class dismissed - sincerely, a pissed off 8 year old."
    },
    {
      "rating": "8",
      "text": "A horror-comedy for the whole family. Admittedly that's made possible by doubling down on the comedy and not really delivering any horror, but what can I expect from a movie aimed at all ages? It's silly and a heck of a lot of fun.\r Any R.L. Stine fan will get a kick out of all the references and familiar monsters onscreen. Jack Black brings the man himself to life in incredible ways. He has always been best at playing genuine characters complete with unique personality quirks and that's no different here. The rest of the cast is just as likable, with the standout being Ryan Lee as the comic relief character.\r It's a healthy dose of humor and excitement with something for the whole family. Some jokes do fall flat from time to time, but overall the laughs are plentiful. A perfect and non-scary way for the kids to start getting acquainted with monsters in preparation for the horror movies of their futures, and a real treat for those who got their start on the Goosebumps books. It's charming, funny, and a heck of a lot of good fun, longtime Goosebumps fan or not.\r 8.7/10"
    },
    {
      "rating": "10",
      "text": "i enjoyed it. did not even get bored it was a nice movie was over before i knew it.  the monsters where interesting some of them you may even have seen before."
    },
    {
      "rating": "9",
      "text": "This is definitely a movie worth watching if you either love Jack Black's movies, remember Goosebumps, or are just looking for that one special halloween movie for everyone to enjoy. Go and see Goosebumps, you WON'T be disappointed.\r (Movie goers beware, you're in for a scare.)"
    },
    {
      "rating": "3",
      "text": "Childish, foregone, boring, One of those films that you forget the day after. I have already wasted 100 minutes and now i have to write at least 150 characters."
    },
    {
      "rating": "10",
      "text": "The visuals were beautifully spooky and creepy. The writing and humor in the movie was hilarious. Jack Black's voice over performance for Slappy was great. Jack Black's and Dylan Minnette's performances were stupendous. One of my top 10 favorite Halloween movies."
    },
    {
      "rating": "5",
      "text": "There seems to be a lot of talk about how this film isn't nearly as bad as it should have been. And while that may be true, in the sincerest way possible whilst residing in the cynical franchise driven Hollywood big-budget culture, it's also kind of like saying that getting punched in the chest isn't as bad as you thought--it could have been your face. How about not getting punched at all? This isn't a very good film. It's fine, has its fleeting moments. The 3D isn't even well utilized."
    },
    {
      "rating": "8",
      "text": "A interesting idea, the movie revolves around RL Stine and how the books he wrote came to life. A unique idea, the movie is reinforced with a wonderful staff. People who grew up in the 90's and with Stine's books will find this a amazing foray into the Goosebumps universe.\r I think most of the negative reviews come from the fact there are so many Jack Black haters. He is a great actor, an amazing musician and a wonderful comedian.\r A family movie for sure, everyone, young and old can enjoy this film."
    },
    {
      "rating": "6",
      "text": "Not a unique concept, but the rest were completely surprised me.\r Technically, this was a another version of 'Jumanji', but a different universe. Originally it was not meant to be like that, because it was adapted from a series of children's book of the same name into a single movie. All the characters from the different books (book series) brought into one place, thus 'Jumanji' effect.\r When the fictional book characters come into the life, a group of youngsters team up to save the town from invasion. A tale that takes place in one day, especially most of the narration was a one night adventure. Totally an unexpected movie, but still not a masterpiece than just entertaining product. Maybe the actors were the reason, especially inclusion of Jack Black was the turn out. His second collaboration with the director after 'Gulliver's Travels'. And not to forget the CGI work was very acceptable for a little production like this.\r This theme was a very old, but the characters were unique. Maybe it was a box office lucky, but people won't simply acknowledge for useless things. This film's success was the effort of hard work. I won't surprise if they decide to make a sequel. I meant the same team, not the lower grade filmmakers and actors.\r 6½/10"
    },
    {
      "rating": "10",
      "text": "To be honest, I started this movie being real nervous. I grew up on Goosebumps and was real worried they may have ruined the name. However, I was not disappointed and loved the movie! It had a nice story line, a twist, great effects, and great acting. I love Jack Black and think they picked a great R.L. Stine. I think one issue could be that today's generation MAY not appreciate it as much as us 80's and 90's babies will. But, I am sure there are those parents out there who have passed on their Goosebumps books to their kids and have kept the name alive."
    },
    {
      "rating": "4",
      "text": "It's a bad version of Jumanji.\r I don't know why this movie doesn't work. It has decent effects and a likeable cast.\r Jack Black made some weird choices in character development but I can't pin the failure of this flick on that.\r It just doesn't work and I was happy when it was over."
    },
    {
      "rating": "5",
      "text": "As a child I loved watching/reading Goosebumps and going into this film I was really hoping it could capture the enjoyment I had as a child. But sadly it didn't quite do that, But It sure tried. As and adult I found the movie very stereotypical and predictable but I'm sure as a child the film would of felt much more interesting. Most scenes just felt odd and like their could have been so much more done, most rely on heavy amounts of special effects. But I'm sure a younger audience will find this much more enjoyable, once you seen past the typical story and the oddness of Jack Black being R. L. Stine. Seeing all the different monsters from past Goosebumps shows and books, It felt extremely nostalgic seeing most of them and remembering watching them as a kid and no sleeping that night. All together I like what they tried doing with Goosebumps but just feels as it falls short and could have been much more. Proceed with cation."
    },
    {
      "rating": "8",
      "text": "If you wished they would make more films like they did the 90's similar to Jumanji. Then Goosebumps is for you. My only complaint is Jack Black talking for the dummy and the Invisible Boy. They both sound too much like Poe from Kung-Fu Panda."
    },
    {
      "rating": "5",
      "text": "I was never a Goosebumps fan. Never read the books, but I did watch a couple episodes of the TV show. So based on that knowledge, this movie wasn't anything spectacular or noteworthy, but I find it enjoyable.It fits very well with the festive season of Halloween."
    },
    {
      "rating": "10",
      "text": "Readers beware. They're in for a scare because it's Goosebumps! Best books. This movie of it has better picture quality and most beautiful capacity. Great movie for the whole family. Kids, teens, and adults can totally be impressed with it because it has a adventurous message."
    },
    {
      "rating": "8",
      "text": "Goosebumps is a fast-paced, funny and surprisingly heartfelt adaptation of RL Stine's popular books. Playing out just like an actual Goosebumps book, the film may be too cgi-heavy for some, but in spite of this, fans should enjoy it. Jack Black was very good as RL Stine, but he was even better as Slappy the Dummy. He really did make a great villain. Dylan Minnette, Odeya Rush and Ryan Lee gave solid performances too. There was plenty of humour that both kids and their parents could enjoy, with some interesting characters and pretty good visuals to boot. In short, Goosebumps is a nostalgic treat for fans of the series and should win over new fans too. 8/10."
    },
    {
      "rating": "8",
      "text": "this movie was particularly enticing as it put a spin on the classic goosebumps without driving to far from the original, however if i had one complaint it would have to be Jack Black i do not believe he was the right choice for this film. it seems when it comes to jack black he is only good depending on who he plays i personally believe that maybe Nicholas cage or Liam Neeson would make a more intimidating father figure. on the other-hand i feel that the child acting was particularly good and all of the characters seemed real and enticing. so should you watch goosebumps..... the simple answer is yes you should its an adorably quaint film with light horror elements that will keep your younger children interested and your older children in a state of silence as the movie moves quickly forward."
    },
    {
      "rating": "6",
      "text": "I had really really high hopes for this movie because I grew up watching goosebumps and I thought this would be a great throwback to that. Also, I am a huge Jack Black fan so I was thinking what could go wrong... well... the fact that they did NOT play the goosebumps theme song, not even in the credits made it definitely lose a star. Other than that I thought it was pretty funny and I jumped a few times. Overall, it was decent and brought much nostalgia."
    },
    {
      "rating": "8",
      "text": "Goosebumps is basically a children's film about a group of monsters attacking a town. In theory, this could have gone very basic. However, I was surprised by how above and beyond this went.The dialogue is fun and the cast is really good. Jack Black steals the show as the tightly-wound author R.L. Stine. There are a lot of different monsters in this, and they are all pretty fun.Only downside is that as good as Black was at playing Stine, he is kinda weak as the voice of Slappy the ventriloquist dummy. There is just something off about the voice like Black was trying to deliver something but just couldn't properly realize it."
    },
    {
      "rating": "7",
      "text": "I am a big fan of the TV show, and enjoyed this. The plot was excellent, and not like anything from the show. They also added a twist, and it was a good one. Worth a watch, even if your not a fan."
    },
    {
      "rating": "8",
      "text": "This is an enjoyable and creepy movie that is funny and fascinating. It also has some nice personality injected into it."
    },
    {
      "rating": "8",
      "text": "I think Goosebumps the movie is decent. I know it's for kids and it can be cheesy at many moments but it did a good job. The humor is awful though and so are SOME of the characters. Well anyways it's a decent movie with flaws like any simple movie would have."
    },
    {
      "rating": "2",
      "text": "Predictable, and doesn't make R.l.Stine art worklook good...Jack Black? Please, give me a break, total failure..........................nnnnn..........."
    },
    {
      "rating": "8",
      "text": "This movie is surprisingly fun and enjoyable. Many of the jokes were really funny, and the movie doesn't really have a boring or dull moment. Not all the jokes work, but the ones that do, and the entertaining plot and characters (R.L. Stein), make this movie really worth watching."
    },
    {
      "rating": "7",
      "text": "Without exaggeration, Goosebumps is one of the best comedy movies I've seen in a while. The humor works almost perfectly. Specially, as all the characters are so likable, even Champ who is this kind of dumb characters that are often turn out to be very annoying in many other movies like this. Honestly, sometimes Champ went too far, and some of his jokes fall flat, but that didn't make this character annoying, not in the slightest! I can't believe how many times I laughed out loud! Almost every single joke hits the mark. This movie also is as heartwarming as it is funny. Also, it has some very clever twists and turns that surprised me.Jack Black is so funny, even more funnier than he was in Jumanji: Welcome to the Jungle, IMO.Dylan Minnette is very good and adorable as always, but if you really want to see him acting, watch Don't Breathe or Netflix's series 13 Reasons Why. Odya Rush also is good, and Jillian Bell is hilarious as aunt Lorraine.Unfortunately, although I was engaged and very entrained in very second in this movie, I didn't really care, or rather worry about the characters. I didn't feel they were in danger. So this movie absolutely doesn't work as a thriller. As a PG-rated horror movie, this movie, of course, doesn't have to scare me. But the problem is that it becomes a bit tedious and lukewarm almost every time it tries to be scary. The visual effects could have been better, but it really don't have to be. Actually, I prefer to see the CGI in this quality, because it fits the campiness and the charming silliness of the movie, just like the original Jumanji. I can't believe how much I liked Goosebumps. I kept putting off watching it, and I thoroughly regret. I can't wait to watch the sequel!(7.5/10)"
    },
    {
      "rating": "7",
      "text": "Without exaggeration, Goosebumps is one of the best comedy movies I've seen in a while. The humor works almost perfectly. Specially, as all the characters are so likable, even Champ who is this kind of dumb characters that are often turn out to be very annoying in many other movies like this. Honestly, sometimes Champ went too far, and some of his jokes fall flat, but that didn't make this character annoying, not in the slightest! I can't believe how many times I laughed out loud! Almost every single joke hits the mark.This movie also is as heartwarming as it is funny. Also, it has some very clever twists and turns that surprised me.Jack Black is so funny, even more funnier than he was in Jumanji: Welcome to the Jungle, IMO.Dylan Minnette is very good and adorable as always, but if you really want to see him acting, watch Don't Breathe or Netflix's series 13 Reasons Why. Odya Rush also is good, and Jillian Bell is hilarious as aunt Lorraine.Unfortunately, although I was engaged and very entrained in very second in this movie, I didn't really care, or rather worry about the characters. I didn't feel they were in danger. So this movie absolutely doesn't work as a thriller.As a PG-rated horror movie, this movie, of course, doesn't have to scare me. But the problem is that it becomes a bit tedious and lukewarm almost every time it tries to be scary.The visual effects could have been better, but it really don't have to be. Actually, I prefer to see the CGI in this quality, because it fits the campiness and the charming silliness of the movie, just like the original Jumanji.I can't believe how much I liked Goosebumps. I kept putting off watching it, and I thoroughly regret. I can't wait to watch the sequel!(7.5/10)"
    },
    {
      "rating": "7",
      "text": "This was not bad at all. Goosebumps fans were looking forward to see this and this movie suited them"
    },
    {
      "rating": "6",
      "text": "this movie is just ehhhhh...... it has good monsters barely any screen time for them and a cliche about main character gets the girl and when the girl comes back after death it was clearly expected its just normal high school setting mc meats a girl something happens becomes bad, bad thing becomes worse something happens to a character leaving the high school mc to stop the bad thing and then gets the girl and then they live happily ever after but this movie dose leave room for a sequel which there was ehhhh. decent but not deserving of a 5    6/10"
    },
    {
      "rating": "8",
      "text": "I use to be into goosebumps as a kid. Love the show too. I have to admit this was an awesome movie."
    }
  ]
}