{
  "id": 1140,
  "title": "Goosebumps 2: Haunted Halloween",
  "starring": [
    "Jeremy Ray Taylor",
    "Madison Iseman"
  ],
  "runtime": 90,
  "genre": [
    "Adventure",
    "Comedy",
    "Fantasy",
    "Family",
    "Horror"
  ],
  "description": "Two boys face an onslaught from witches, monsters, ghouls and a talking dummy after they discover a mysterious book by author R. L. Stine.",
  "releaseYear": "2018",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/t2wy38iiMpB8WsgJi3lYeDnGh2H.jpg",
  "categories": {
    "plot": 4.875,
    "acting": 5.8,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.857142857142857,
    "funny": 6.25,
    "action": 5.5
  },
  "reviews": [
    {
      "rating": "4",
      "text": "The first film was a nice surprise, full of a few genuinely creepy moments and surprisingly dark humor. This is aimed at a much younger demo, and without Black there to lead the charge it just all feels aimless."
    },
    {
      "rating": "7",
      "text": "The last film legitimately took me by surprise. It was more fun than expected. This one is more what I'd thought the first would be: Serviceable. The entire thing is decent, but it is very standard. Jack Black's entertaining R.L. Stine is a bit part here and the interesting dynamic and obstacles of the kids from the first film is missing here. What ensues is a very by-the-numbers children's film. The actors playing the kids do a good job but they're given the most basic of characterizations and conflicts (complete with predictable school bullies). Wendi McLendon-Covey, Chris Parnell, and Ken Jeong all have fun supporting roles, but they're not big parts.Monsters are fun. They are even a couple scenes with Slappy that are a little scarier than expected. Kids should like this. At worst, parents will probably be indifferent. The movie is okay it just doesn't stand out."
    },
    {
      "rating": "8",
      "text": "The visuals were beautifully spooky and creepy just like in the first one. The writing and humor was funny but not hilarious like in the first one. The acting performances were fantastic especially Ken Jeong, Madison Iseman, Jeremy Ray Taylor, Wendi McLendon-Covey, Caleel Harris, and Chris Parnell. This one was not as good as the first one but it was still pretty entertaining. One of my favorite Halloween movies."
    },
    {
      "rating": "6",
      "text": "Amazing got chance to see it free on moviehubx dot com replace DOT byget it there free every thing"
    },
    {
      "rating": "5",
      "text": "Remember 2015's Goosebumps? No? Neither did I since the movie was just too forgettable in my opinion. Prepare for a sequel that no one wanted but the crew just had to make it so that they can make more money. By that, I mean expect it to be not funny nor scary. It's just another forgettable movie you'll probably forget about once you go out to see better movies."
    },
    {
      "rating": "6",
      "text": "Let me lead with the first Goosebumps film from 2015 was a delight. It had a surprisingly heartfelt backbone to the family friendly carnage with a set of well known actors giving it their full attention – no slumming around. Not to mention a fantastic way to adapt the spirit of the long running series. (My first was in 6th grade in 1992; I think it was “Say Cheese and Die”)However, Goosebumps 2 is much lesser than first one. It feels like one notch above a TV movie. Think of the film you expected for the first film. The movie here is likely around the quality you expected. Since it’s a sequel, one expects to use what worked the first time and build in a different way. But this is very much the first one again with some details changed.With being a sequel, it takes too long to get to the expected Halloween/Monster mayhem with a really sketchy set of scenes to get to it. Set ups that would work for a movie of the week but not so much on the big screen. Undercooked way to get to Slappy, and later to the monster fun. Odd as the mayhem starts about 20 minutes after it did the first time around. It’s a sequel, be bigger! When it does happen, the film is a blast with great production design for the creatures, including green orb head witches and a giant spider made from balloons. The sequence when Slappy gets the gang back together is amazing and gets the spirit going. There is a notable cheapness to the whole she-bang even when it goes as the film keeps finding excuses to exit the town getting attacked (I’m pretty sure there are piles of dead), ranging from “let’s talk in this alley” to “hang out with as annoying as normal Ken Jeong for a minute”. Jeong plays the character in a way that makes those who laugh just because he is there happy. Broad and groan-worthy. He does have the Halloween yard set up I want so bad though.This all leads to a very rushed and easy ending. How convenient is it? It doesn’t feel done. Like there is about to be the next, real climax. But it doesn’t happen. Just wrapped up in a bow with really weird voice-over. And several subplots left unresolved.On the plus side – the monsters look great, there is fun in the sequences you came to see. The design on Slappy is very well done – it’s not Black doing the voice this time but a reasonable facsimile. I’m pretty sure many of the extras characters straight up died. There is great report between the leads and some well-done humor and nods to horror franchises. I’m not sure if one bit was a direct nod to Halloween III: Season of the Witch or just a coincidence as I have Halloween on the brain (cough podcast cough) – and I’m watching Halloween III as I write this. We do get Jack Black on hand for a little bit, but almost feels like he’s added in when they realized he can stop by for a day during The House with a Clock in its Walls downtime.Goosebumps 2: Haunted Halloween is not a terrible movie. It’s just a disappointment after the first entry showed this concept can be done better. I personally hoped the sequel would be a Horrorland type thing instead of essentially the same plot. For family-friendly horror-fantasy on the big screen, go see House instead.C+"
    },
    {
      "rating": "5",
      "text": "This is a good movie to watch with your kids. I recommend watching it before Halloween due to the movie's plot but it could also work as a nice Sunday family watch. This movie is better than original and improves it in every way. The story is a semi-direct continuation of the 1st movie. The adventure and acting is good. The CGI are suprisngly good. All action set in this ideal american town is well directed and will keep viewers interested and deeply involved in the movie. I find this movie far better and more suitable for younger audience than the Tower Clock movie with Mr Black. This movie was definitly not intended for younger audience but Goosebumps 2 is solid and should be given a chance. Light, good, easy watch. Easiest 5/10 I have ever given."
    },
    {
      "rating": "7",
      "text": "Better than the first at times and Slappy is definitely better. Feels more like the Goosebumps series than the first. Which was more about family fun than scares or creepiness.Although I don’t remember Slappy having powers in the first. I thought I would miss the cast from the original. The new cast is pretty good though and the sequel is so entertaining I forgot I missed them lol."
    },
    {
      "rating": "3",
      "text": "This movie is for little kids. Little little kids. Needs more Jack Black to make this a bit more watchable, but I guess he was too busy filming 'The House with a Clock in Its Walls'. Also, did Halloween 2018 steal a subplot from this movie? A girl at a Halloween party with her boyfriend, but she would later find him cheating on her. Whoever did it first, it's a weird rip off."
    },
    {
      "rating": "5",
      "text": "\"Goosebumps 2: Haunted House\" was a movie that was regular, because of its style that turned out to be more childish than the first, with unnecessary scares, and irregular performances but with a good story and interpretation of the villain Slappy."
    },
    {
      "rating": "4",
      "text": "It will definitely appeal to the taste of the audiences to which it's addressed but in general terms is a very poor sequel and although I didn't like the first one at all, at least that one had more comedy and entertainment, something scarce here and therefore it becomes another disappointment."
    },
    {
      "rating": "5",
      "text": "So disappointing. The first one was a joyful ride with likable actors/characters. This sequel takes a far more childish route and is full of bad acting, but all the blame can't be put on the cast - the dialogue and sequence of events that unfold are poorly put together. It takes about fifty minutes for the action to get started and once it finally does, it's wrapped up all too quickly. However, I can't deny it is pretty fun when the monsters do finally make their entrance. In the end, though, I'd say just re-watch the original from 2015."
    },
    {
      "rating": "3",
      "text": "\"Goosebumps 2: Haunted Halloween\" Is a funny, thrilling, scary for all ages. But.. It mocks the Set out for \"Goosebumps\" so its basically the same story again but with new characters. The animation is fluffy and ugly. The movie has everything in awe but not so much to the plot."
    },
    {
      "rating": "2",
      "text": "I can't stand watching Nacho Libre, but I will admit when I am wrong. Its directorial prowess and Jack Black's powerful performance as a man who just wants to do right by the people he cares about is one that has me in tears every time. It honestly beats Kevin James in Here Comes The Boom, they are two wonderful films cut from the same cloth, but tailored by very unique minds.2/10"
    },
    {
      "rating": "5",
      "text": "This movie just makes me want to watch the first one again. The humor, character, drama, dread and animation all pale to the original. Jack Black is way too underused and mostly in it for a few quick laughs here and there, Slappy's plan is stupid and he goes about it in the weirdest ways, and the group dynamic of the first just isn't there anymore, they don't play off of each other as well. This movie could've been a lot better, but the lack of Letterman and a decent budget sadly bring it down to a mediocre level."
    },
    {
      "rating": "5",
      "text": "This was a bit out of the content what we were talking about: monsters, halloween but this movie did not try their best about those"
    },
    {
      "rating": "5",
      "text": "Not the same actors. The actors that are in it aren't good actors. At least the scary monsters were good. If it weren't for Jack Black saving the movie. I would have given this a 1 rating."
    }
  ]
}