{
  "id": 4257,
  "title": "Gravity",
  "starring": [
    "Sandra Bullock",
    "George Clooney"
  ],
  "runtime": 91,
  "genre": [
    "Science Fiction",
    "Thriller",
    "Drama"
  ],
  "description": "Dr. Ryan Stone, a brilliant medical engineer on her first Shuttle mission, with veteran astronaut Matt Kowalsky in command of his last flight before retiring. But on a seemingly routine spacewalk, disaster strikes. The Shuttle is destroyed, leaving Stone and Kowalsky completely alone-tethered to nothing but each other and spiraling out into the blackness of space. The deafening silence tells them they have lost any link to Earth and any chance for rescue. As fear turns to panic, every gulp of air eats away at what little oxygen is left. But the only way home may be to go further out into the terrifying expanse of space.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wmUeEacsFZzDndaeOtNNmy26rYJ.jpg",
  "categories": {
    "plot": 4.264705882352941,
    "acting": 2.9642857142857144,
    "ending": 3.1666666666666665,
    "soundtrack": 5.5,
    "cinematography": 4.75,
    "familyFriendly": 6.0,
    "funny": 10.0,
    "action": 6.181818181818182
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Everyone knows that both Sandra Bullock and George Clooney played their rolls beautifully. But one thing I want to mention that blew me away was the unsung hero of sound design. HOLY HELL it was spectacularly done. For a setting that has no sound and to make it seem that way is a feet that is out of this world (sorry for the pun). It may sound easy just to remove the Atmos effects but really, having done sound for TV myself it is very difficult to cover up. This is a film I will take notes from in the future."
    },
    {
      "rating": "10",
      "text": "Intense and gripping!  This movie was shot as a simple survival story in space...  but I connected to it even more at a much deeper level.  The way that the cinematography was shot, I felt I was in space floating with Sandra Bullock's character, Dr. Ryan Stone... that was a technical achievement in itself...  But  I was also able to feel what it was like to be in the mind of her character.  I feared with her, struggled to survive with her, felt the hopelessness of life and accepted death with her, and then, found air, found new life, and was born again with her.  Sandra Bullock has put on an Oscar worthy performance, and it sure did help with Alfonso Cuaron being at the helm to guide this film.  What a genius.  It's been awhile since I've been deeply absorbed into the thoughts and feelings of a character on screen.  This movie was truly a journey and an experience into the mind and soul of Dr. Ryan Stone's character.  Wow, such an amazing film.  An unforgettable experience!  Must see in theaters with the biggest screen you can find."
    },
    {
      "rating": "10",
      "text": "Wow! I rarely enthuse about any film these days, but this is something very special. Gravity is not only intense, devastating and ultimately life affirming, but has single handedly changed my opinion of Sandra Bullock, an actress who I normally have no time for. Full marks."
    },
    {
      "rating": "10",
      "text": "In a year where some movies pass off as cheap entertainment, this movie delivers and shows the wonders and thrills of cinema. It's absolutely breathtaking while showing both the beauty and the horrors of space. The acting, visuals, cinematography, everything is about this movie is just flawless. Overall, this is truly one of the best movies ever made. It's freaking awesome! Be sure to check out my YouTube channel, \"TheMovieManLife\" for all things movies!"
    },
    {
      "rating": "1",
      "text": "It was Bullock's Cast Away. 90 minutes of ho-hum, I'm floating in space from one station to another, until I finally parachute down to a remote lake. We saw it in 3-D, but each of us fell asleep several times. When we woke up, more of the same...Sandra frantically pushing buttons in Russian and then Mandarin, hoping that she pushed the right one. When she was floating in space, she desperately reached for parts of the three space stations, and fortunately was able to grab something at the last minute. Big surprise.\rThere was about 10 minutes of interaction with Clooney, but the rest of it was her mumbling to herself. Waaayyyy overrated."
    },
    {
      "rating": "1",
      "text": "It is difficult, if not impossible, to convey how utterly dreadful \"Gravity\" is without a viewer having at least a small taste of experiencing it yourself. Given the overthrowing praise the film is receiving, countless thousands will waste 90 minutes of their life wading through this oddly lifeless film.  The tedious screenplay evokes the worst of James Cameron but adds hundreds of Sandra Bullock \"Aaaaahs.\"  Water boarding couldn't be this painful. By the 30 minutes mark you will be begging that a massive asteroid pulverize any survivors on screen; by the 60 minute mark you will beg for the 3D effects to deliver an asteroid to your own skull. They shoot horses, don't they?"
    },
    {
      "rating": "1",
      "text": "Its Diablo 3 and the latest Sim City only this time on the big screen. Ie looks great but quickly gets boring and leaves you feeling like youve been had."
    },
    {
      "rating": "2",
      "text": "This movie has been so hyped that people are afriad to say they don't like it.  I didn't like it.  I was bored, Bullock didn't act she just hyperventilated through the movie.  Clooney was only comic relief.  Explosion scenes were unrealistic. In a \"gripping\" movie, when the hero lives, the audience applauds.  NO applause here. Only comments of disappointment were heard on the way out. I wanted to like this movie as I did Apollo 13.  I would not recommend this movie to anyone, even on Redbox!"
    },
    {
      "rating": "1",
      "text": "What? Was this a joke? Is there some sort of conspiracy to give this amazing reviews?\r Incredible visuals, amazing technology. Otherwise, I am pretty sure the script was written in about 40 minutes, after drinking a case of bud light lime. SPOILER: The plot is just a never ending sequence of barely surviving tragedy. The only thing that could have made it more absurd would have been if a shark attacked her after she escaped from the pod at the end."
    },
    {
      "rating": "3",
      "text": "Visually stunning, but preposterous.   Within 15 minutes, I said this is ridiculous.  Not even superman could have as many lives as Sandra Bullock.  The dialogue is also lame.  There is some emotion, but you really don;t care.  There is no comparison to 2001, except that both movies take place in space."
    },
    {
      "rating": "3",
      "text": "There are some beautiful visuals, but like the rest of the movie, they are repeated and repeated ad nauseum.  If not for them, though, the movie would have no redeeming features.  Too much of it takes place inside spacecraft that isn't functioning properly, and Bullock's hapless, rather unlikable character had me drumming my fingers, wanting to just doze off, and wondering how long we would be subjected to her suffering and fiddling futilely about.  Her tedious character is in most scenes; Clooney has more life, but disappears early on, and returns only briefly.  Might be worth seeing for the occasional beauty of it, if you don't expect anything in the way of story or character development."
    },
    {
      "rating": "3",
      "text": "I was very disappointed with this movie. I was expecting much better, but this was by no standards a terrible movie. It just could have been much better. Two things I loved in this movie were the cinematography as a whole and the action sequences. The effects were good and the camera angles/shots were fantastic, and the action sequences were well-produced. However, this does not make up for this movie's mediocre plot. The story was extremely repetitive, very simple, and somewhat boring. Along with the underachieving plot, I thought that Clooney's acting was uninspired and lazy, Bullock over-acted to the point that she got very annoying and unconvincing, there was minimal character development, and I did not feel any sympathy for the characters. While this movie had some of the best cinematography I have seen in a while, the rest of it was poorly done. This movie is not worthy of any oscars other than cinematography, and truly is not worth your time."
    },
    {
      "rating": "0",
      "text": "This movie is the JAWS of this generation. Gravity is a silly action movie, where the ignorant audience believes they are watching a real event happening in space. There are so many flaws in the science, I lost my disbelief. Yet, the visuals were stunning. But visuals alone, don't make a good movie. The story of Gravity was also bad, filled with clinches and up to the last minute escapes.\r The critics got this movie way wrong. A very big disappointment for me, when I thought I was going to see a serious science fiction movie. But all I got was a space circus drama."
    },
    {
      "rating": "0",
      "text": "I expected bad, and wow did I find it. I'm all for suspending disbelief, but this.. was so in your face about what an idiot you had to be to enjoy it.\rShe checks her watch and has 7 minutes and 30 seconds before another round of space junk, then.. just puts on a space suit.. and still has over 2 minutes left.\rLet's not even go down the \"he let her go because\" road.\rOr the \"wow, it's sure convenient to have all the space stations so close\"\rOr finding a drifting Sandra after How Long?\rOr maintaining an impossible radio connection for how long?\rOr the whole \"stuff got destroyed\" and now it's amazingly fast and going to eat you!\rOr the whole \"chain reaction\" in the first place?\rAND BIG FREAKING DEAL with the 17 minute opening shot! It's not like it was all filmed in real time, it's just a long CGI scene.\rSpace danger was the key, and when it's so horribly unreal I couldn't buy in. Like a supposed Dracula with pink blood running down his fangs.\rTerrible."
    },
    {
      "rating": "0",
      "text": "\"Oscar-worthy\" BS is put out there by publicists and PR folks; sorry, it was PAINFUL. Unbelievable, far-fetched, and so badly acted. A vanity project to end all vanity projects. Tom Hanks had cast away. This is her BS. Sorry, you're not that interesting. Your character is unbelievable. Your acting stinks."
    },
    {
      "rating": "5",
      "text": "Watched this movied in 3D. It is as beautifull as it is boring and predictable. The camera shots, the 3D, the spectacular views and special effects  all this is very well done. Actually the 3D is probably the best 3D i've seen in a movie. Also, I can't name any other movie that would be about Space, but not about aliens or a catastrophic end of the world (the end of Facebook in this picture probably does not count). They took an interesting idea and made a cliche movie out of it. That is why I can only give it a 5, maybe a 5.5 due to the fact that they managed to make it with only two and a half actors.The movie is not bad, it's just not very interesting and very cliche in the details of the plot. I would give it a 7 or 8 if they removed all the psychological crap you see in teenage movies about \"being unable to move on\"."
    },
    {
      "rating": "0",
      "text": "WTF...This is one of the worst movies I have ever seen. I am scratching my head thinking what if anything I can see good about this movie. Oh Oh! I found one. I like the main two characters but not in this crap bag of a movie. I would like to ask them why the even accepted being in the movie. I'm not going to say anymore or I will piss people off. Go waste your money. You were warned."
    },
    {
      "rating": "0",
      "text": "I honestly don't know what to say about this film. Special effects were amazing, the film was an absolute technological marvel on par with Avatar and Lord of the Rings. The action and all aspects of this film were very artistic and beautiful. The acting was hard to judge because of the space helmets, but the voice acting that you could hear through the com was realistic and helped add to the suspense and emotions of the film. The problem with this film is that you don't really care about the characters. They seem like amazing people walking around in space, and you get to know a little bit about their home lives, but it just wasn't enough. Really the story was all premise, which I find rather boring and aggravating in a film. 2 people floating around above the earth trying to get back home. That really is all there is to the story, so it gets pretty boring. Add to that the complete lack of an interesting compelling script, and you get a movie the was pretty pointless. If all you need is good visuals, then you will love this film, if you need something a bit more sophisticated, then you will hate it. I would have rated this film higher for the visuals and technology, but seeing as it is already extremely overrated I will just give it a zero."
    },
    {
      "rating": "0",
      "text": "Sure it looks great but thats not what movies should only be about. Not to mention casting two celebrities who pretty much make the film not work because they are too famous. Both are overrated and are only there to make profit. Children of Men was brilliant but this? Give me a break.. Should have hired Sigourney Weaver..Ripley would have pulled herself outta that mess."
    },
    {
      "rating": "6",
      "text": "Overrated. The effects of course are amazing and the cinematography, I will say, is phenomonal... everything from the pre-production to the filming to the post must have been mind numbing for the filmmakers, but to me, a movie has to have the following to be good;\r1. characters you care about... not in this one.\rStarting the film in space was not smart. I don't know if they were trying to set some sort of record of having the smallest cast, which it already doesn't, if you've seen 'Buried' you will know what I am talking about. Well maybe there were 2 people in that I'm not sure. Anyways, you never really felt for the main characters... you don't care if these people go off into space... I mean I guess unless you care about Sandra Bullock and George Clooney personally...\r2. Morals. Yes, it did have a very obvious moral; never give up. But it didn't change my outlook on anything really... Just a simple pretty basic message.\r3. a great story with a creative way of telling it, along with brilliant individual scenes. You should be able to leave the theater asking your fellow movie goers which part they liked best. In this you can say \"when she's breathing a lot\" or \"when she almost dies by the inconvenient debris which never ever happens but for some reason has happened to 3 different shuttles in the past hour\"\r4. Music that connects you with the characters, and with the moment, and how you should be feeling... you need a GREAT composer if you want a great movie.\r I'm tired of all these films coming out that are so critically acclaimed, but for what? Where are the films where you leave the theater just thinking about it over and over, where the film really sticks with you? Where are the films that you can leave thinking to yourself, \"wow, that will be a classic?\" I mean maybe in past generations, all the films they saw they just said \"eh\" and now we think they are classics... but if not then I'm just disappointed. Maybe I'm not as deep of a thinker as the critics, but all I can say about this film is it probably took a very very long time to get these special effects down... but honestly... I've seen more visually stunning things at OMSI, and Disneyland, and most rides at Universal Studios. I don't know why people are saying this is a once in a generation movie... It is certainly not one I will remember too well."
    },
    {
      "rating": "0",
      "text": "Dull performances and paper thin characters populate this mercifully brief film.  Despite impressive visuals, the film never really comes alive.  Bullock sets feminism back 50 years by portraying a hysterical, incapable astronaut  while the most basic rules of science and space travel are all but ignored.  Those looking for genuine sci-fi should avoid this film at all costs."
    },
    {
      "rating": "1",
      "text": "I offer you five re-imagined film review synopses of Gravity: An IMAX 3-D Experience:\r In the great farcical tradition of Jacques Tati, this madcap caricature of modern alienation and space age technology playfully follows its heroine through an improbable labyrinth of ineptitudes, follies, and physical gaffes.\r A heart-wrenching portrayal of a mother’s search for human contact after the meaningless death of her daughter.\r This reboot of Méliès’s Voyage dans la lune harkens back to the golden age of silent cinema, when action, set design, and camera tricks took precedence.\r A futuristic spin on the classic road trip movie, Gravity is the story of two people who find themselves helplessly drawn together by a natural force beyond their control—friendship.\r À la Godard and Tarantino, Caurón dishes out his share of cinéphile fodder, with nods and winks to the Cold War Red Scare camp of such classics as Red Dawn."
    },
    {
      "rating": "3",
      "text": "I'm giving 3 just because of the music and the special effects but man the story and dialogues are indescribable horrible, what was this guy thinking when he wrote this? besides several silly plot holes on the sci-fi, I wouldn't recommend anyone to watch this plain waste of time."
    },
    {
      "rating": "0",
      "text": "Way overrated.Uninteresting characters with flat performance from main actors. I wouldn't put this movie under sci fi just under oscar bait."
    },
    {
      "rating": "0",
      "text": "I'll die and even then I still won't get why people overestimate this movie wayyyyyyyyy too much. It's the most pointless, trash movie I've ever seen."
    },
    {
      "rating": "3",
      "text": "just bad... extremely overrated...   clooney's arrogant, obnoxiously smug pseudo astronaut banter & pointless \"chivalrous\" suicide... bullock's endless \"oh's\", \"oof's\" & howling??? very irritating.  mindless, illogical from start to finish.  she should've gotten eaten by  a bear or crocodile at the end...slick visuals and sound design can't overcome the grating, infantile script..."
    },
    {
      "rating": "9",
      "text": "这是一部很美很简单的电影，从画面到情节都很简单，布洛克的独角戏演得不错，配乐不错很渲染气氛。\r但是，这部电影的价值只能在IMAX3D中才可以被释放，只有在那里才可以感受到它的震撼，不然就没什么意思了。"
    },
    {
      "rating": "10",
      "text": "İzlediğim en iyi gerilim filmlerinden bir tanesiydi. Özellikle uzaydaki o meteor parçaların uzay istasyonuna çarpınca kalbim yerinden çıkacak gibi oluyordu..."
    },
    {
      "rating": "6",
      "text": "What we have here is a movie with beautiful visuals; however, the plot attempts to be profound similar to Kubric's films and just cannot hold up.\r I still find myself trying to figure out how this movie has won critical acclaim when there are so many holes in the plot line, that it is distracting to think logically while watching the film. This is especially true for science buffs. To sum it up, the movie offers cool visuals while functioning on the level of self-importance. If you truly want to see a great space movie, turn to Kubric's Space Odyssey; it is breathtaking."
    },
    {
      "rating": "3",
      "text": "Gravity raises our expectations with his trailer but gives us an extremely predictable and tedious script, a pity that two incredible actors like Clooney and Sandra are involved with such a boring film."
    },
    {
      "rating": "3",
      "text": "Sandra Bullock and George Clooney did great performances, but that does not help this movie. The story does not make sense .It doesn't help that the characters were stupid in this movie, I don't mean that they didn't have knowlegde but they were physically not able."
    },
    {
      "rating": "4",
      "text": "Absolute trash.I love Bullock and Clooney. And I fell sorry for them. Was watching this in 2019 and I have never felt so frustrating. Absolute nonsense and unscientific movie. If you didn't watch it, won't do that."
    },
    {
      "rating": "5",
      "text": "This is not a sci-fi movie, this is an action movie set in space. Not a great one either, given the blatant disregard for simple physics. This is big studio efforts to bring romantic films into space. The first of a few."
    },
    {
      "rating": "3",
      "text": "\"Gravity\" is an over-hyped mess.  Intended to be seen on the biggest screen possible, there is little gained from repeated viewings, yet much is lost.  At the end of the day it's a run-of-the-mill survival film, albeit one with terrible physics (one of its self-proclaimed strong points via marketing)."
    },
    {
      "rating": "10",
      "text": "Filme com efeitos especiais bons e um suspense do inicio ao fim e com historia otima, e com otimos atores escolhidos, e um bom tema escolhido e um bom filme produzido em 3D."
    },
    {
      "rating": "8",
      "text": "O filme tem ótimos efeitos especiais, porem, a história é muito ruim e totalmente chata, sem muita emoção, uma coisa mal feita, mas como eu já disse, os efeitos especiais deixaram o filme muito foda, fazer uns efeitos no espaço não é tão simples e conseguiram deixar simplesmente excelente, só faltou bons escritores para o filme ficar perfeito."
    },
    {
      "rating": "8",
      "text": "Gravity ist einer der besten Filme seines Genres. Er überzeugt nicht nur durch durch seine Schauspieler, sondern auch durch einen ungewöhnlich hohen Grad an Realismus. Die Story ist extrem packend und die Situation wird durch Sandra Bullock extrem gut dargestellt und die zwei Stunden vergehen wie im Flug. Allerdings werden die agierenden Personen Charaktäre nicht sehr gut ausgeleuchtet und die Protagonisten bleiben blass. Alles in allem sehr gute 8 von 10 Punkten"
    },
    {
      "rating": "6",
      "text": "No entiendo la emoción y el fanatismo por esta película, a mi sinceramente no me fue ni me vino."
    },
    {
      "rating": "8",
      "text": "The cinematography and the soundtrack is suited well for a film like this but I think the story takes place in one place and that is out of space, which stories that deserves respect is apart of the beauty and the evolution of cinema."
    },
    {
      "rating": "5",
      "text": "I watched this movie yesterday or the night before last and, frankly, I was a bit divided about it. I expected something more. The script is simple: in the near future, a severe blast causes a chain reaction destroying most orbiting satellites and launching a shower of space debris compromising the survival of a team of American astronauts who were repairing the Hubble Telescope. It's a plot that works but has serious credibility problems based on the great improbability of all our satellites being destroyed at the same time. It also totally ignores some science issues such as the abundance of space junk in Earth's orbit and has a plot hole that rubs the absurd: how the astronauts were able to listen to dogs in China if they were not even able to communicate with the own base in Houston? Sandra Bullock is the main character, in the role of a scientist who was selected for that mission by being an expert on the subject. The actress is good and her quality is unquestionable but I think her character wasn't well thought. Despite being a rookie in space and showing little training, her character is able to decently decouple herself in a ISS shuttle and in a Chinese one, something her training would probably never have prepared her for not being strictly necessary to her mission. There is a latent contradiction here, and it does not to be a physical or a genius to realize that and to detect others in the film. George Clooney is a good supporting actor but sometimes his posture, somewhat childish and relaxed, prevented me from actually feeling any tension, not to mention that the way he dies is absolutely cliché. The direction of Alfonso Cuaron works reasonably, and I think I realized some scenes that intentionally copy great films of the past in order to to honor them. This is beautiful and symbolic. The end of the film also seems loaded with symbolism.The technical issue, however, is beyond reproach. CGI is absolutely grand and the images of our planet are breathtaking. I liked cinematography and soundtrack, discrete but competent. The way they put the actors floating weightless also seems incredible and realistic, just like the ships, tools, space suits and even the floating debris. Visually, the film is powerful and realistic but it's not the first time I say this: it's not a CGI storm that makes a good movie. The script has to be good. And the fact is that the script of this film, although it works, has a lot of holes, errors, absurd moments and contradictions. No matter how improbable is the situation the movie shows, the audience has to feel that it's real and it's happening. And I could not feel it here."
    },
    {
      "rating": "8",
      "text": "A must see in theaters. Very glad I didn't just wait for this on Bluray! Intense graphics alone are worth the price of admission. Now I'll admit this was a little thin on story but if you want some eye candy  go see it."
    },
    {
      "rating": "8",
      "text": "WAY overrated. For a thriller, this was actually very good. The suspense almost... made it feel like the air became more dense. But the problem was the lack of storyline. It was quite short and just delayed parts of the story with too long suspense. Overall, a pretty good movie."
    },
    {
      "rating": "8",
      "text": "A fantastic spectacle in terms of intense scenes full of top-notch CGI. The acting, despite the minimal dialogue, is clearly good and the story is very simplistic but entertaining. It's absolutely worth at least one watch, as it's a quality adventure from the all-is-normal beginning to the been-through-hell ending. It isn't a masterpiece, though. I don't feel it deserves a score of 96 but it's still at least an 8/10, if not an 8.5/10. However, it doesn't quite have the same effect on blu-ray as it did in the theater. I recommend you watch it on as large a TV as possible."
    },
    {
      "rating": "10",
      "text": "In all my years of being an avid film-goer, I have never been so captivated by 90 minutes of cinema. Gravity is a paragon of art, that displays that there are no technical boundaries with regards to special effects. Do not think that this film, being a survival film set in space, will trudge through its entire length with no intense moments. It promises to deliver, and after the first 5 minutes you are catapulted into an adventure filled with exquisite beauty and moments that will have you holding your breath."
    },
    {
      "rating": "9",
      "text": "A movie that shows to the public, how a small story can be at same time a big story. Afonso shows us where the human can go and how can go. You have to watch at less 3 times to really understand what Gravity is. Surprised me 9/10."
    },
    {
      "rating": "9",
      "text": "GRAVITY  Don't Let This Go!\rIt's a Visual Paradise. The film transports you to space in every cinematic way possible.\rSandra Bullock was good, the premise was amazing and your heart will be racing through the whole experience!\rCamera and Direction  was innovative\r3Dfx and vfx  were breathtaking\rSound Effects  AWESOME!!\r Go watch it  An experience you won't forget!"
    },
    {
      "rating": "9",
      "text": "A spectacle to say the least; Gravity is a beautifully executed anxiety attack with no intention of letting up. A film well worth its universal acclaim."
    },
    {
      "rating": "10",
      "text": "This is a gripping and thrilling film that kept me on the edge of my seat all the way through. The graphics were AMAZING! I actually thought they filmed this in space because it was SO realistic. George Clooney was great and funny even in the most serious parts of the film, and Sandra Bullock made it so realistic! It totally attacked my emotions and I felt physically and mentally exhausted afterwards. I recommend this to everyone and it may sound like a boring old space movie but it will blow you away!!! I highly recommend this so go watch it NOW!!"
    },
    {
      "rating": "10",
      "text": "Beautiful. Gripping. Stellar. Riveting. An artful masterpiece of a film; the best space film of all-time; will become a timeless classic. This film IS Sandra Bullock."
    },
    {
      "rating": "10",
      "text": "Rating this a 10 just to balance out the negative reviews from the people who just don't get it. If any movie warrants this kind of fandom loyalty which I usually don't care for, its this movie."
    }
  ]
}