{
  "id": 4058,
  "title": "Great White",
  "starring": [
    "Katrina Bowden",
    "Te Kohe Tuhaka"
  ],
  "runtime": 91,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A sea plane is destroyed in a freak accident, five people find themselves drifting on a raft. At the mercy of the tide and with no hope of rescue, the helpless situation takes a horrifying turn when they are terrorized by a ravenous great white.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2wEVked59Y00NKK4Vj0FgzUzdPH.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.0,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "While I haven't had the chance to really dive too deep into the Shudder library yet, even with the titles I haven't liked their lineup of exclusives has proven noteworthy thus far, with long lost Romero works, a healthy amount of foreign horror, and a pair of deranged Nicolas Cage led nightmares among so much else. The streaming service's first shark flick though is about as generic as you can get, featuring the same level of prestige found in your average Syfy original. Something that can be seen in the poor quality of its CGI predators.It makes use of an oceanic survival scenario similar to the likes of The Shallows or 47 Meters Down and places an emphasis on its characters in an effort to ape the big hits. The setup never introduces any dangers beyond just watching a group be hunted while adrift on their raft at sea however, and although attractive the cast is stuck portraying individuals who are little more than bland, uninteresting stereotypes. All of which makes the time spent with them in-between the next sight of a knifing dorsal fin kind of a bore.The man-eating action itself is decent, but admittedly that's a pretty hard thing to mess up. There's a reason why we've seen an endless amount of movies based on these creatures come out since the release of Jaws after all. My favorite parts are the shots below the water's surface of people's legs kicking in dark as they swim due to their unexpected tension. They really missed the opportunity to scare the crap out of viewers by having a shadowy outline appear onscreen during those moments. The highlights for most people will take place in the final act where the survivors are forced to confront their aquatic foes face to razor-toothed face.Still, nothing here is going to blow you away. It's thrills are competent enough to make for a passable watch, with the biggest problem outside of the weak writing being how cheap and ugly the sharks look. Those flaws are ultimately what make this feel like a made-for-TV or straight-to-DVD production in spite of its efforts to be a little more respectable than the typical B-movie alternative. As a result, I can't truly recommend this as the film is a tepid time passer even at its best, but if you've exhausted all the better options out there it isn't the worst way to get your fix of blood and gills. Just don't expect anything terribly remarkable, particularly compared to the rest of the stuff that is available with your subscription.6.5/10"
    }
  ],
  "recommendations": [
    "the_shallows",
    "crawl",
    "47_meters_down",
    "jurassic_world_fallen_kingdom",
    "the_predator",
    "doomsday",
    "alien_resurrection",
    "transformers_age_of_extinction",
    "frozen",
    "jurassic_world",
    "the_meg",
    "monsters",
    "the_ritual",
    "jurassic_world_dominion",
    "skyline",
    "war_of_the_worlds",
    "army_of_the_dead",
    "supernova",
    "predators",
    "the_last_days_on_mars",
    "prometheus",
    "riddick",
    "underworld_blood_wars",
    "texas_chainsaw_3d",
    "rampage"
  ]
}