{
  "id": 2311,
  "title": "Grease",
  "starring": [
    "John Travolta",
    "Olivia Newton-John"
  ],
  "runtime": 110,
  "genre": [
    "Romance",
    "Comedy"
  ],
  "description": "Australian good girl Sandy and greaser Danny fell in love over the summer. But when they unexpectedly discover they're now in the same high school, will they be able to rekindle their romance despite their eccentric friends?",
  "releaseYear": "1978",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/czVhhAaSBFpakur7U8pOIDV9NUG.jpg",
  "categories": {
    "plot": 7.4,
    "acting": 7.333333333333333,
    "ending": 8.75,
    "soundtrack": 7.666666666666667,
    "cinematography": 8.0,
    "familyFriendly": 8.0,
    "funny": 8.571428571428571,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "8",
      "text": "don't talk that way..GreaseGrease is a fresh script that came out of this bubbly and gay bakery that feeds and fulfils each and every need of the youngster and if not anything the songs definitely has to work."
    },
    {
      "rating": "9",
      "text": "'Grease' has got all the elements of a fantastic musical - stunning choreography, hilarious humour, and impressive singing - all rolled into one explosive (and really addictive) film"
    },
    {
      "rating": "10",
      "text": "I've seen Les Misreables, Haispray, Chicago and Mamma Mia. All of them are great but none of them can touch the magic of Grease. My heart arranged a melody while i was watching that movie. It was the greatest movie musical ever. My big brother thinks it stupid, but in my opinion he's just jealous. It's the one that i want, it takes back those summer nights, and it goes together like rama rama rama kadinga da dinga dong. I'll remember it forever like hoo-bop sha wadda wadda yippity boom de boom\rChang chang changitty chang sha-bop That's the way it should be Wah-oooh, yeah!"
    },
    {
      "rating": "10",
      "text": "This is an amazing film and is impossible to recreate and everyone should ignore the Chicago Reader."
    },
    {
      "rating": "0",
      "text": "I hate this film its one of the worst films i have ever watched so i give it a zero if i could i would give it negative 9999999999999999999999999999999999999"
    },
    {
      "rating": "5",
      "text": "Wow. GREASE is atrociously overrated and mis-praised. And, yes, I say that after the airing of TV's worldwide annoyance \"Glee\". GREASE just can't be stood by me."
    },
    {
      "rating": "2",
      "text": "Horrible movie, with people trying to hard to be cool. If they took the singing away it might be watchable.It is one of the most cheesy movies ever.I hate movies that break out into a song after every little thing."
    },
    {
      "rating": "10",
      "text": "Travolta and Newton-John has got some skills!"
    },
    {
      "rating": "3",
      "text": "This movie just had catchy tunes with a c list acting ensemble. It was soooo bad. I guess it was a hit because it was different then all the other movies' endings but that doesn't mean it wasn't bad. Just because it was old doesn't mean that it was a classic."
    },
    {
      "rating": "8",
      "text": "Travolta has a body and knows how to move it. A dancer for sure."
    },
    {
      "rating": "10",
      "text": "Geez that Chicago reader sure has a nasty view upon the film but this is the best film is the century. John Travolta shines as the main character who brains great chemistry with Olivia Newton john."
    },
    {
      "rating": "10",
      "text": "This is surely one of the few 'cool' musicals. Travolta, the model of a man. Newton-John the model of a woman. Dance sequences that are so fluid you think they could melt at any moment. Classic Lines, cult cast, the heaven of musicals. 'Tell Me more, Tell Me more'. I can't, just watch the bloody film."
    },
    {
      "rating": "9",
      "text": "Couple have Summer romance, she goes back to Australia, School starts, she didn't go to Australia, they meet up again, singing & mayhem ensue.It really is hard not to like this & it's been parodied a million times. The story is silly, acting pretty dodgy (Stockard Channing is great though) & it's camper than a row of tents.The songs though are brilliant & you just get sucked into the whole thing & you can't help singing along & enjoying it."
    },
    {
      "rating": "8",
      "text": "I am usually a horror film kind of guy but I found this film to be pretty good actually. A little corny and stupid at times but still it was good and worth the watch."
    },
    {
      "rating": "6",
      "text": "Has some quite good songs and is somewhat entertaining but also pretty dumb."
    },
    {
      "rating": "9",
      "text": "Well, I was born in 1999, so the movie is old for me, but I Love It. I have some kind of admiration to oldies (music, films, artworks, tv shows). I like the movie because it's simple but funny and great. I love the songs and I am willing to play Danny at a Grease musical at School, someday. I will give the movie 9 out of 10 marks."
    },
    {
      "rating": "8",
      "text": "A classic...I hated some of the songs (two or three) , but overall, it was fantastic...a movie to remember! A movie for a nice late afternoon with cheese, wine, and friends!"
    },
    {
      "rating": "9",
      "text": "The songs are what make this feel-good musical work, and while it is corny as long as you can enjoy it for what it is then it won't matter. Lead by a great cast and full of great performances, Grease is definitely up there as one of my favourite musicals :) Both Travolta and N-J are great together and really stand-out in this film. The dancing and ensemble also really impressed me, and there are some good laughs in there too. Overall an enjoyable film that any musical lover should enjoy!"
    },
    {
      "rating": "5",
      "text": "I'm being king in rating Grease the movie a 5. IMHO they overdid everything especially dumbing down the whole movie! Did we really need stupid cartoon graphics during the musical scenes?The original play was based on Balimore life in the late 50's. Forrest Park Sr. High. Instead they based Rydell high in California. These and other things made this 1978 blockbuster tedious."
    },
    {
      "rating": "10",
      "text": "Fantastically upbeat musical. Love the 50s theming, makes for a refreshing change for a modern musical. Characters are funny and lovable. Great Cast. A must-see!"
    },
    {
      "rating": "9",
      "text": "Olivia-Newton and John makes the perfect and most memorable duet from the 70s. The best of feel-good films are ones which reminds you of your past, and 'Grease' has truly earned the title to be one of the best feel-good films ever made."
    },
    {
      "rating": "9",
      "text": "Randall Kleiser enlightens everyone on June 16th in 1978 with a classic film that is still enjoyed by all ages 36 years later in the year 2014. The movie Grease provides a new twist on teenagers in the fifties. Grease is based on the 1971 musical Of the Same Name by Jim Jacobs and Warren Casey.\rThe quiet, shy and blonde haired Sandy is played by Olivia Newton-John, who is a teenage girl in 1958. She intends on enjoying a quiet family vacation on the beach, when she surprisingly meets who could be the love of her life, bad boy and T-bird Danny Zuko, played by John Travolta. Because this movie is a musical, the dance numbers are one of the strongest assets of the movie.\rWith an award winning cast, Travolta and Newton are a great pair. Along with Jeff Conaway as Kenickie, Stockard Channing as Rizzo and Didi Conn as Frenchy,  The movie Is surrounded mostly by the T-Birds and Pink Ladies.\rGrease’s soundtrack was the best selling album in 1978. All of the songs consisted of   ballads sang by some of the cast members during the movie. A lot of the songs were by bands like Sha Na Na, and artist such as Cidney Bullens , and Stockard Channing. For example, when Sandy becomes friends with one of the Pink Ladies, Sandy tells the story of her lost love to a group of girls at lunch as they have lunch outside with an iconic song called “Summer Nights.”\rThis movie is definitely for the theatre lovers out there, but can catch the attention of anyone with the bright energy of the movie. Later, one of the T-birds has to prove the whole gangs social status with a car race against a rival gang members car. Things really start to get as thrilling as a musical can get when Danny has to surprisingly race his car against the rival’s car.\rThe 110 minute romance and musical keeps the viewer entertained with the articulate group dance numbers and catchy songs. You can actually feel the chemistry between Newton and Travolta throughout the entire movie. Sandy finds herself enrolled at the same school as Danny, Rydell High, where they pick up where they left off that summer.  Considering the age of the movie, Metacritic gives Grease a generally favorable score of 70 out of 100. This film is a must see for all ages!"
    },
    {
      "rating": "8",
      "text": "I will admit I didn't like \"Grease\" very much at one point, but like some other musicals, it has grown on me. It is just a fun film, yes with some corny dialogue and some slow moments, but the performances, choreography and songs more than make up for any misgivings. I like how \"Grease\" is filmed, the cinematography is smooth, and the costumes are lovely to look at. The script has some nice raunchy humour, if a little corny at times. Also there is a nice compelling story in general, even if it is slow in spots. The performances are of high energy. John Travolta, is it just me or wasn't he really sexy here? I thought Tim Curry was sexy in \"Rocky Horror Picture Show\" but Travolta's Danny who swivels his hips like Elvis brings a different kind of sexiness as well as acting like a tough kid, which he isn't really. Olivia Newton-John, dressed in whites and creams looks beautiful and is appealing as Sandy, she is almost unrecognisable in the final musical number. Stockard Channing provides a voluptuous contrast as Betty Rizzo, and does it with swagger. What makes this movie enjoyable are the song and dance numbers. I wasn't keen on the songs when I first saw the film seven years ago, but as I have been re watching the film over the years, like the film they have really grown on me. \"Summer Nights\", \"Hopelessly Devoted to You\", \"Grease Lightening\" and \"We Go Together\" are classics. Overall, this film is fun, you mayn't like it first time, but if you give it another chance it could well grow on you. 8/10 Bethany Cox"
    },
    {
      "rating": "4",
      "text": "Now Let me just say this I hate characters I hate story but good god the only reason it gets a 4 is because the music is a timeless masterpiece.Sadly thats ruined by the terrible story and the terrible characters"
    },
    {
      "rating": "9",
      "text": "¿What you get when you gather the high school gallant and a naive blonde? You get one of the musical comedies of ever times, from Broadway to the big screen, and there for the eternity. A delight that hasn't lost freshness yet. Catchy songs. An essential of 70's."
    },
    {
      "rating": "8",
      "text": "Danny Zuko, a cool guy with a reputation to keep, and Sandy Olsson, a correct girl that plays nice with life, have met on the beach during their vacations of school, they spend a whole day there and became very in love with eachother, after the day is out Sandy supposedly goes back to Australia, where she is from, and Danny will go to the local school for one last semester. The thing is that they end in the same school, and when they meet again she notices that he isn't the same person anymore, and he don't want to go into a different stereotype for keeping impressing his friends. Directed by Randal Kleiser and based on Grease by Jim Jacobs and Warren Casey.This movie is about adolescence and loving relationships, it did a very nice and fun job showing how they both, in a very stereotyped way, would deal with the teen love, showing both sides on how they did speak about that to the boy with his boy friends, and the girl with her girl friends, the boy being the most maleficent and pushing everything to the most exaggerated as possible, while the girl is the most conservative as possible. The story not necessary is giving good examples to follow in here, like people making fun of the virginity of some character, or only making her that cool when she is dressing something dirty or smoking, but yeah, 70s. They did a good job on putting the songs in context, you can clear see in some moments that they aren't really singing in the scene, this could took you out of the movie, but generally it wasn't that much of a problem. The characters are very stereotyped, you have the group of boys that are bad boys and pretend to be the most bad asses as they can, you have the big nerd that one likes, the truly bad boy with a scar in his face, the group of girls that gossip about stuff. There are some moments that you can really relate of what did happened during the school, in others the characters could be so annoying that you just want the scene to go on. The movie is very funny, they could pic the necessity of the boys to try to be bad asses and they could turn that into a lot of very good moments of jokes, the movie overall is funny. How they used the mannerisms of the characters, in special Danny's, to make jokes was great, like how he walks or how he always have a hair comb to brush his hair, that was so on point. It is good that each character have their particular characteristics and personalities, it helps in we believing that they exist and in we caring for them, we quicly learn how they are, and get them, in the girls group this happens fast with pretty much all of them, in the boys one, some are a bit aside.The giant thing about this movie, what makes this so great and classic, is surely the songs and the choreography, it is simply amazing this combination. The songs for the film are all made by Jim Jacobs and Warren Casey, that had Broadway performances, in here the all actors, really all of them, have done such of a great singing job, they all had good vocals wich was essential to make those songs permanent in our heads. The coreography in general for the scenes, don't happen in all the clips, but in the ones that it does happen are very well done, the synchrony aren't necessary perfect, but it feels so natural, so simple and so happy that it definely can contagious, and the single dances moves, specially made by John Travolta are just fantastic, it is impossible to watch that and don't go all the way for repeating, his dance feels a lot different, is like things that anyone can do, and that is fantastic. This songs really have made me dance some movies and smile a lot, those clips are definely holding up for forever, because they are great.The movie have some fantasy aspects, that i'm not sure how it does applies in the movie, but it get all together with the story, showing what could possibly be dreams for their lifes. The montage is very nice, some moments we get smart transitions, in other nice sequences without cuts, some pretty shots are done in here.John Travolta did a great job while singing, a incredible in dancing, but a not so good in acting, during dramatic moments mostly, he was funny, but in dramatic parts he didn't convinced me at all. Olivia Newton-John is also a great singer and dancer, during some parts she was just a delight to watch. Stockard Channing plays a grouch girl, in other times very risky, her mannerisms was also pretty interesting, and again a very good singer. All the characters are supossed to be teenagers at school, but all the actors are way older than that and you can easily notice this.This movie is fantastic because of his spirit, it completely made me want to shake my body after watching it with dances and songs completely unforgettable."
    },
    {
      "rating": "10",
      "text": "Excellent songs, Excellent cast and Excellent coreographys and the first Pop classic in the hystory (You're The One That I Want)That's the one that we want"
    },
    {
      "rating": "7",
      "text": "Grease is a vapid, campy, so sweet for its own good, and over-the-top musical that has a terrible message, inconsistent storytelling, unfocused plot, and a stretched running length. But it features wonderful catchy songs, a charismatic and insanely energetic performance from John Travolta, who has an incredible chemistry with Olivia Newton-John, and characters that almost all of them are fleshed-out. If all these things aren't enough to make this movie charming what else could be?(7/10)"
    },
    {
      "rating": "9",
      "text": "with a well-structured plot, memorable songs of all time. Grease is one of the best musical films ever, especially with the performances of John Trovolta and Olivia Newton-John.The icon Teens of the 70s."
    },
    {
      "rating": "10",
      "text": "The best musical movie of all time. Travolta and Newton John were in their prime.The music is fantastic, right from the opening scores by Frankie Vallie and the four seasons throughout the end of the movie.Unique in it's genre, a must see with very high rewatch value. This, along the movie goonies, might be the one I have rewatched the most."
    },
    {
      "rating": "8",
      "text": "A good musical that many will like but if you're into more serious musicals like the miserables then this is not for you. This film is more about teenagers with their romantic relationships."
    },
    {
      "rating": "7",
      "text": "Of course this is a cheesy film and I suppose it shows my age a bit, in that one of my first reactions was the usual 'wow, this is surprisingly sexual film about teens' - the drive in scene particularly so (where have I been?! lol). The lyrics in some of the songs are quite amusing!. It's certainly entertaining - not exactly a deep film but a bit of fun and with some catchy tunes, this is a fun enough musical. Not great, not awful but a reasonably good film with quirky characters - a decent musical certainly. I suppose I would recommend it, yes. It makes me laugh knowing how old the cast are, given the age their characters are meant to be. Makes you think...but its an enjoyable film regardless, not one to take entirely seriously I suppose, all things considered. For younger people, it's perhaps a little like a film version of Glee(?!)."
    },
    {
      "rating": "8",
      "text": "I liked it, but the songs were the worst of the palicula and for that reason I am going to give it a 7."
    },
    {
      "rating": "7",
      "text": "This oddly enough is the one and only Musical I like. I like a couple of the songs too. It's a classic, everyone in the world knows this movie."
    },
    {
      "rating": "9",
      "text": "It is nice movie. sex and rock´n´roll. nice. nice music. characters in this movie is beautifull. i love it. :)"
    },
    {
      "rating": "7",
      "text": "There are times when Grease really kicks in. I'm fond of Channing singing \"Look at me, I'm Sandra Dee, rotten with virginity\" and then telling an imaginary Troy Donahue, \"I know what you wanna do.\" And most of the big musical numbers work, especially the showstopper: the sunlit Danny-Sandy duet to \"Summer Dreams.\" Greasy kid stuff it all may be, but just like rock 'n' roll, it'll probably never die."
    },
    {
      "rating": "10",
      "text": "Saturday Night Fever is groovy but have a dark story, Grease is the same, it's groovy but have a happier story and that's why if i can pick between Saturday Night Fever and Grease i simply choose Grease, Travolta did it again with his masterful dance and sing, added with all terrific perfomance, dance, and sing by the others, Grease is a funny, groovy, happy, and extraordinary film, i highly recommended."
    },
    {
      "rating": "0",
      "text": "This movie amplifies degeneracy to a disgusting extent. In no world should this be rated PG. This entire movie is just a bunch of teenagers played by fully grown adults who bully and talk bad about their peers and have sex, all without consequence. A must miss."
    },
    {
      "rating": "7",
      "text": "El inicio del cliché que es un clásico en la actualidad. Es entretenida y simple"
    }
  ]
}