{"id": 380, "title": "Green Lantern", "starring": ["Ryan Reynolds", "Blake Lively"], "runtime": 114, "genre": ["Adventure", "Action", "Thriller", "Science Fiction"], "description": "For centuries, a small but powerful force of warriors called the Green Lantern Corps has sworn to keep intergalactic order. Each Green Lantern wears a ring that grants him superpowers. But when a new enemy called Parallax threatens to destroy the balance of power in the Universe, their fate and the fate of Earth lie in the hands of the first human ever recruited.", "releaseYear": "2011", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/fj21HwUprqjjwTdkKC1XZurRSpV.jpg", "categories": {"plot": 7.195652173913044, "acting": 6.615384615384615, "ending": 6.666666666666667, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 6.0, "funny": 9.0, "action": 7.214285714285714}, "reviews": [{"rating": "0", "text": "I came into the movie expecting it to be bad but reasonable summer movie entertainment. Being an avid metacritic reader, I was fully aware of score of 40 and the bashing the critics gave this movie. What drove me to what the movie was the trailer (which seemed reasonable) and the fact that the user score was 6.7, suggesting that this movie is full of mindless but fun action.And how I was wrong. Really Really wrong.This movie lacks action. For a movie about a lantern who's powers were only limited by ones imagination; a fittingly ironic plot considering the lack of imagination in the writing, storytelling, acting and CGI found in this movie.  I counted only 3 action scenes of 30 secs each in this whole movie, all of them nicely summarized in the trailer. On might thing me shallow and argue that a focus on character development could be interesting, like in Ironman. This would be possible if not for the terrible writing AND acting in the story. None of the characters were believable if you are over the age of 6. I guess knowledge of the characters prior to the movie might help fill in the backstory which was never really explored in the movie. It seems mos of the people who enjoyed the movie were fans that grew up with GL. Unfortunately for me I do not fit this category . Honestly, 10 minutes into the movie I was already bored. The actors were all cliches and none of them were even convincing. The same plot lines were repeated around 30 times and again and again. I honestly felt like walking out of the cinema because it was that bad. Overall, stay far far away from Green Garbage and watch Xmen again if you have to.I feel bad for contributing to the revenue of this movie. For those who enjoyed this comic, watch it and feel free to disregard what I say."}, {"rating": "10", "text": "A very good movie for a first run at this particular hero! R.R was the right choice. A good balance of action both in the suit and out. I look forward to number two!"}, {"rating": "8", "text": "It's a good movie. It's got action, sci-fi, a beautiful woman, a charming male actor, a super hero... The movie's problems lie on its dialogues; and on its obviousness. But it's definitely not a Elektra. It's more like a Hulk 2."}, {"rating": "7", "text": "This movie's special effects are super good and this movie also features quite a lot of action. I did not really like Hal Jordan's suit in this movie as it looked like it exposed too much of his flesh. Nonetheless, the character is great in this movie. Overall, this is a good movie."}, {"rating": "6", "text": "Ryan Reynolds dons a green energy suit and defends Earth from outer space giant alien heads and a crazy scientist? Okay. Not perfect. But its fun all the same, and what superhero movie isn't?"}, {"rating": "6", "text": "We can work with this. Don't do it again. There is no reason to reboot it. There is a decent world created, as long as the script and effects aren't as shoddy, then everything will be fine. No more floating poo monsters next time please."}, {"rating": "4", "text": "I don't think I've ever seen so much effort put in to a movie for such mediocre return. What I mean to say is that almost every scene of this movie is absolutely beautiful. Seriously breathtaking visuals. And yet, it's so overwhelmingly boring. What an odd dichotomy. Worth watching if for nothing else than a study in how important it is to have a strong script before you pour so much money and talent in to a project like this."}, {"rating": "8", "text": "This was a really good movie. I didn't read any reviews before I saw it so my expectations were unaffected. I was hoping for a good eye popping visual feast with a cast that didn't disappoint. Well it was a good as I hoped. The acting avoided the cheesiness that sometimes plagues films like this. I was pleasantly surprised that during the relatively lighthearted moments (read: not dark like Batman) it still maintained seriousness and the characters never crossed the line on believability with overacting. By comparison this movie was better than THOR in my opinion. The only thing I can critique is that it was a little short. They could have added about 20 minutes to flesh out the character development a bit more, but overall it still worked pretty well. I thought Ryan Reynolds did a good job. His character seemed like an unassuming approachable guy that got chucked into this role of responsibility, but had the raw potential to be a hero under the right circumstances. It was believable in a similar way as Peter Parker in Spiderman, but more so because Hal wasn't a dork to start ou with. Heck in costume Reynolds even looks like Lantern in the comics. I think he was a good choice ultimately. I can't wait for the sequel. If you were lucky enough and stayed for the closing credits you had a chance to see Sinestro put that yellow ring of fear on and bask in it's evil. Smells like sequel materiL to me. Can't wait.."}, {"rating": "8", "text": "While I can see why many critics disliked it, Green Lantern is NOT deserving of the bashing it's been getting.The superpower of being able to create anything you could imagine through willpower has, in my opinion, always been unbeatable in terms of HOW COOL IS THAT? I knew going into the theatre that although it probably wouldn't be executed as well as I would have liked, a story like Green Lantern couldn't possibly fall into the \"been there, done that\" list of superhero movies. I've took notice when I first began reading comics that DC characters tend to be more fantastic and space-bound than Marvel, which tends to focus on internal issues. So far, DC hasn't had as many shots as Marvel in films outside of their Batman/Superman franchises, so I was really hoping Green Lantern would be new and exciting.It was disappointing, yes, but it's definitely not a borefest to the average moviegoer with no invested interest in the comics or characters. It's action-packed, funny, very cool powers with very cool effects, romantic, and certainly fresh in the sense that I can't recall any other superhero movie that's been released that had a place like Oa be a major part of the storyline. I also want to mention that as a female comic book fan, I tend to take notice of how the female leads are treated throughout the movies. In the past few decades, I've never really been all that impressed by the love interests outside of Lois Lane. Before the movie was even announced, I had already known that the only iconic characters that would be able to hold  a candle to Lois would be from DC. I had high hopes for Carol Ferris, and while she wasn't executed all that well, she's still impressive to me. There wasn't much focus on it, but I think more people should consider that she's a pilot and is business savvy. Having seen films like Spider-Man accurately portray Mary-Jane Watson and keep her as a plot tool lead the way to comic book movie formulas, for me, the fact that Carol saved Hal from death counts for something.I'll hold off on saying I loved the Carol in the movie, but the writing made her recognizable as Carol Ferris, and simply because there haven't been many women in comic book movies that have impressed me, I'm going to give Carol Ferris the credit I would never give to characters like Mary-Jane Watson, Pepper Potts, Betty Ross, or Jane Foster etc. The DC women I feel I can respect and look up to, and I'm very glad to add Carol Ferris onto that list with Lois Lane. I expect the same for Catwoman in the next Batman installment. Overall, the movie is very what much what you expect from the trailers. Yes, it probably could have been the next Star Wars and is one of the only comic book franchises with that type of potential, but it wasn't. However, just because of that, it doesn't mean that this film should be bashed because Thor or X-Men: First Class handled themselves better, in my opinion. Green Lantern at it's best would blow everything else out of the water. At it's mediocre, it's on par with the rest of them.This is, of course, speaking in the context of what I was looking for when I went to see it."}, {"rating": "7", "text": "To telll the truth, after reading some truly savage reviews by some of the critics I have learned to trust, I intended to skip this film.  But as a kid I loved Green Lantern more than Superman, Batman and Supergirl combined.  After Wonder Woman GL was my fave.\r Now I'll tell you right off, this IS the film to leave the deepest part of your brain home.  Don't expect deep thought or, y'know, ideas.  This is a comic book.  Come to life.  That's all.\r That said, its a whiz-bang, crazy wild ride.  Whether you're riding in the **** of a fighter jet with an experimental robot plane hot on your exhaust or you've encountered a dying, handsome purple alien who has just given you the mother of all crackerjack prizes--and a free charger to boot--if you're Blake Lively's title character Hal Jordan you've got just the right aw, gee-ness to carry it off.\r Lively's Hal isn't a great brain, but he's a brave guy and a s**t hot seat-of-the-pants pilot.  And the flying scenes in and out of vehicles make me want a power ring of my own.  All the necessary plot points are here, the plucky girlfriend, the staunch buddy and the evilest evil since Sauron.  And then there's the Green Lantern Corps.  Not since Luke Skywalker strolled into the cantina have such an amazing array of alien life forms been gathered together.  And here Hal makes some friends.  I won't tell you about them lest I spoil the fun.\r If you want intellectualism, check out anything by Lars von Trier.  If you want a rollicking good time to go with your popcorn--see Green Lantern."}, {"rating": "8", "text": "Not the greatest hero flick I've ever seen, but it's enjoyable.  I thought Ryan Reynolds did a good job as Hal, and Peter Sarsgard's perfomance as Hector Hammond was great. I also couldn't get over the scenes on the beautiful planet Oa. Hopefully the sequel (yes, there will be a sequel; if you sit through the credits for a little while, you'll learn this) will be a little better."}, {"rating": "8", "text": "The movie was fun. Acting was well executed. Especially mark strong as sinestro, it's not his fault the writers dropped the ball with his character. But the problems with his character could be fixed with a sequel. The rest was fine compared to the comics."}, {"rating": "8", "text": "I thought the movie was very good.  The pacing as great as it seemed like there was never a dull moment.  There was excellent balance between action scenes and story development, humor and seriousness, as well as internal and external conflicts.  I think it's a shame the movie seems to be getting the low scores it's getting.  I thought this was not only a good super hero movie, but a pretty good science fiction movie as well.  It is definitely worth seeing for yourself."}, {"rating": "8", "text": "Although the cheese factor takes away from the story at times (not surprising given the lead actor) it was refreshing to see a superhero movie that is proud to be just that. Green Lantern isn't afraid of its spandex, or colorful alien backdrops. When Hollywood attempts to make larger than life icons more realistic for the average audience (such as turning the X-Men into a biker gang, Galactus into a large ominous cloud or beefing up the Batman by sporting him in armor) they only seem to succeed in producing a less believable action flick instead of what we wanted to see: a silver screen adaptation of the well-rounded comic book crime fighters we love"}, {"rating": "8", "text": "First thing I need to say is this is not a thinking movie. It's a superhero flick. So if your intention is to watch a movie that'll make you feel warm and fuzzy, or make you cry, or make you ponder the nature of life, don't see this. What this movie is, is an exceptional representation of an iconic superhero, which is a rarity today. I had initial concerns about Ryan Reynolds playing Hal Jordan as he's a very quirky actor, but he pulled it off well. Carol Ferris wasn't as well played, but she was still passable. What really struck me about this movie was how it really stayed true to the origin of the green lantern and yet at the same time dumbed it down for casual audiences. As a for instance, those of you who have read the comics know that Parallax's backstory is long and complicated and one can't really understand it without understanding the war of light, but the movie makes a few minor changes and makes him an acceptable villain to someone who hasn't followed the comics. This is getting a little long-winded, but what it boils down to is Green Lantern is DC's Iron Man: A healthy amount of action, true to the origin, accessible by both long-term fans and casual viewers, and not too much cheesy crap."}, {"rating": "8", "text": "I saw Green Lantern with a number of friends, one new to the character.  We all agreed it was a fun movie and good story.  Basically the reviewers got it wrong, not even sure the reviewers watched the same movie as we did. Overall a good time."}, {"rating": "8", "text": "There is a fine line between a good movie and a great one â"}, {"rating": "7", "text": "If you loved the comic book series, then you will totally get this film.  All others, just go find something else to watch.  The 3D version of this film was actually a worthwhile endeavor as opposed to being a distraction like so many other movies with the word 3D tacked onto them.  Not destined to take in as much as most Marvel efforts, this DC Comics movie still does the Green Lantern mythos proud.  I'd rate this as a strong contender for your matinee dollars and a reserved recommendation for your evening greenbacks.  Enjoy and let darkness fear your might."}, {"rating": "10", "text": "This movie is a lot better than what many critics are trying to make it out to be. I am a fan of the Green Lantern super-hero idea (and not just because my favorite color IS Green) but because of the fact that the powers of a Green Lantern is that while a chosen one wears the green ring, he and/or she and/or it can create virtually anything they can think up of in their mind. The character designs, C.G.I. and special effects were all amazing, and the actors/actresses' who made up this movie all played their parts to perfection! Comic book fanatics will be especially pleased, as this movie explores in great detail, the origin of one of the greatest Green Lanterns (some would even argue the BEST Green Lantern ever) known as Hal Jordan. If you want to see action, romance, and humor in a comic book superhero movie, than this is a great movie to see! :D And a sequel is definitely not out of the question, I recommend checking it out to see what I mean. I thoroughly enjoyed it and I highly recommend it! :idea: Enough said! ;)"}, {"rating": "10", "text": "Green Lantern is so much better than so many other films that have been released recently I expected schlock from all of the negative reviews but I found it to be fun, visually engaging, and the characters interesting,and likeable.  This is NOT A BAD MOVIE.  It is not perfect but it doesn't insult your intelligence and isn't ultra violent like most.  I seriously don't understand the bad reviews it didn't deserve it.  This was way better than Transformers- all of them. Also better than the Jar Jar Binks Star Wars atrocities."}, {"rating": "10", "text": "i think some of the criticism was very harsh indeed. Ok it is no masterpiece but it's very entertaining and has decent humour. I think the problem was with the plot and the lack of real enemy. Also the whole idea that ou can create any weapon you like it's too easy and maybe not too interesting on the big screen. Regardless I would like to see a sequel."}, {"rating": "9", "text": "I may not be a huge Green Lantern comic  book fan, but Ryan Reynolds delivered in his role as Hal Jordan. I'm not quite sure why the critics have been bashing this movie, because it's a pretty solid popcorn movie. If you're expecting Citizen Kane from Green Lantern, then you've only got yourself to blame.  A solid superhero movie and pure escapism!"}, {"rating": "9", "text": "As someone who has been reading comic books since I was 12, I have to say that GL was great. After watching Superman Returns and the last three X-men movies I had almost given up hope that any superhero screenplay would be anywhere close to the source material (Superman having a son? Jean Grey killing Cyclops? blasphemy!) GL, and the Dark Knight before it, renewed hope that Hollywood can make a comic movie without completely rewriting 50 years of character development. Other than the presence of Paralax, 90% of the Hal Jordan origin story reflects what you find in GL: Secret Origin (by Geoff Johns), which keeps this from becoming just another cringe worthy attempt to cash in on the wave of superhero films since the late 90's. That being said it isn't Shakespeare, so if you're looking for a heady drama you're not going to find it here. Overall it was a great summer adventure that keeps you entertained for an hour and a half, which is just what it is supposed to do. The Pros - True to the source material- Ryan Reynolds plays Hal like he is supposed to be: flawed, but working to overcome his shortcomings- Amazing character design for the other GLs (Sinestro, Killowog, Tomar)- Enough (but not too much) humor to prevent it from being dark and dreary. GL isn't Batman, and isn't supposed to be.- Didn't feel like it was overloaded with visual fx, but they still looked awesome- Good dialog overall. no \"are you an angel\" (to quote phantom menace) lines in this to make you wonder what the writer's IQ isThe Cons - needed a bit more action, if they make a sequel they should find a villain who's main ability isn't that he's a \"thinker not a doer\"- not enough character development for the supporting cast. other than Carol the average audience wont really be able to tell you anything about Tom, Killowog, Tomar, etc. and if you haven't read the comics you really won't know why Hals older brother is an assbottom line: not a bad job for GL's first time on the silver screen. I'd give it an 8.5 if they'd let me"}, {"rating": "7", "text": "I enjoyed Green Lantern. So the pacing was all over the place, they overloaded on exposition and they stuffed too much into one movie. I still really liked it. It was a shame it wasn't closer to the original mythology, because I think that the story suffered where they strayed from the comics, and there was really no reason to. Hopefully the relatively negative response from critics won't discouraging DC from putting some more second and third tier characters on the big screen. In the end, I found the movie pretty enjoyable."}, {"rating": "7", "text": "im not a massive dc fan. being a big fan of marvel. so i probably enjoyed this more than a dc fan. sure it wont win an oscar. but its an enjoyable film to watch an everyone i went with enjoyed it, so ignore all the critics an just go watch it. an decide for your self"}, {"rating": "10", "text": "I thought it was much better than what the critics thought,  I would recommend it.   I thought the special effects were good and tha Ryan Reynolds was excellent in his role.  Remember they had to spend time with the background of the story,"}, {"rating": "10", "text": "My husband & I really enjoyed Green Lantern alot!!!  We thought Ryan Reynolds was great and the special effects were very good. We think the critics were way wrong - Green Lantern was so very much better than Thor the bore,  Hope they do a sequel wirh more romance between Reynolds & Lively"}, {"rating": "10", "text": "The movie was really entertaining.  Critics got this wrong.  Yes, the movie was a little short and a bit rushed.  It should have been 15 minutes longer.  However, aside from that, the special effects were pretty good and the origin story was pretty close to the comic.  I hope they still make a sequel with Sinestro as the villian."}, {"rating": "8", "text": "I really don't get all the negativity. This was a fun movie that introduced me to the Green Lantern universe. Did I have complaints? Yes. First of all, the actress playing Carol was horrible. Second, while not completely terrible, the pacing definitely needed some work. But these complaints are only minor compared to the fun I had watching this movie."}, {"rating": "8", "text": "I liked this movie for what it was, a superhero movie. It won't win academy awards but it was fun to watch. Just make sure it's what your looking for before you see it."}, {"rating": "9", "text": "Yeah critics shame on you. I really liked this movie. Critic's are fools and trolls and shouldn't be trusted. Make up your own mind and support a good movie. I mean i thought Thor was awesome, but i still think Green Lantern deserves way more credit. I saw no problems with the plot at all other than changes that they made from the comics which is always expected from Hollywood. Ryan Reynolds acting was good had a good story and he wasn't annoying like as Deadpool in Xmen."}, {"rating": "10", "text": "Books often don't translate well to film. A good writer can make it work. The acting in the film is fair, but no actor can transform a bad script into a good film. Those who chose the script should be hit with the bill for failed sales at the box office. Their opinion of the public verges on contempt and therefore the public shows its contempt by ignoring this trite effort at cinema."}, {"rating": "9", "text": "I was surprised how good this film was. First, you have the \"professional critics\" saying that it's a bust and then, the users? I walked into the theater expecting Fantastic Four! It was legitimately well done and brilliantly written! The weak points were the score (I couldn't hum a single line from the film if you asked me to right now. It's very forgettable.), one line delivered by Hal's friend (\"But doesn't the hero always get the girl?\" The audience just sat there, confused. It was completely out of context and made NO sense.), and the apathy the audience is supposed to feel for the Dr. He may have wanted the girl, but I'm not sure I believed that. Also, his dead was a little underwhelming. The movie gets very \"real\" in a couple of parts...and they are both believable. Reynolds has always been a phenomenal actor, but he really shines here. These people tearing the film apart were in a bad mood. They had to be. Of course...these are the same people who told me Thor was a good film. Ha. You will enjoy it. I can almost guarantee it."}, {"rating": "9", "text": "Green lantern was a wonderful comic book movie come to life after all these years. it was brilliant & bold to use the cgi effects to give an Epic action sequence, including the costumes. Hectors mutated head was very realistic, and Parallax even more deadlier  than the comics.  This is an all entertaining movie for everyone."}, {"rating": "10", "text": "I may be one of a select few people, but I don't listen to reviewers to decide what I watch. In fact I HAD to create an account just so I could further prove why I'm glad I don't. Everywhere the critics have it voted worse then I have ever seen a movie rated. Yes it had some minor flaws, but I still don't believe it deserved HALF of the brash words it received.Let me start off by saying that I am an AVID green lantern fan, in fact I was going into this movie EXPECTING to be disappointed. Just because I felt that it could never convey what I believed the Lantern Universe deserved on the big screen.I was still looking forward to it, even with my negative expectations.I truly believe from the bottom of my 'comic book guy' level of 'fan-dom' that it could not have portrayed Hal Jordan and the lantern Universe any better.Yes, There were some issues with the plot, and I truly thought that the Hector Hammond story arc, could have been saved for a later movie. I also felt that there were things that did NOT stick to the comics but overall it was close enough to stay ballpark accurate for the fans and coherent enough for the newcomers.Now, while I did think there were minor flaws, the one flaw that bothers me most is everyone keeps comparing it to something IT IS NOT.It is not The Dark Knight, it is not Iron Man, nor is it by any means trying to be either one of them.While I love them both the problem with those movies is the dark and sombre tone to them, and the lack of connection to the characters themselves. Think about it, Batman can only do what he does because he is a billionaire, same with Stark. While that is a nice setting, Green Lantern does away with that altogether and basically says: \"No.\" No you can not join us, no matter how smart you are, no matter how rich you are, you have to be CHOSEN.There is absolutly nothing else like it, maybe that is why the critics hate it, they don't really know how to review it.In today's dark, gritty, and all around perverted style of comic book movies, Green Lantern actually does us a favor and tries to be different.Instead of gritty caves, murderers and terrorists it gives us a place we can escape from the human concerns and tragedies that surround us.Every scene that had both Hal as a lantern, as well as the other members of the corps left me wanting more. Every scene where he was just plain ol' Hal gave me more insight to what was going on in his head, and yes the script was corney at times, but it was SUPPOSED TO BE! That is actually Hal's character. The part of Sinestro was amasing as well, often times I forgot he was an actor.People now-a-days complaining about 'Obvious CG' need to remember one bloody thing.\"The original Star Wars/Star Trek movies/series USED MODELS ON STRINGS!\"WHO CARES?! Frankly I didn't notice anything obsurd about the CG, nor did it ever feel out of place. In fact I felt that it was the most stunning CG I have EVER seen. When we were on OA it felt how OA should feel, magestic yet completly alien. When we saw the other lanterns it was the same.I am finished with this review but I leave you with one final and important thought.I went to see this movie with my fiancÃ©e and my best friend.Neither of them had an understanding of the comics yet, when all three of us walked out of that theater after the credits had finished rolling and the screen turned off.We all asked the same question:\"When is the next showing?\""}, {"rating": "9", "text": "I saw this movie (in 3D) with two friends of mine... et we loved it ! I say there are a few flaws in the script, but it's not that important. And... It's what \"I\" wanted to see in the fist place. Great action, great fun !!! I can't wait to see what they will with Sinestro in the second movie... LOVED the whole thing ! G-R-E-A-T !P.-S. This movie make me want to join... the Grenn Lantern Corp. LOL. :-)"}, {"rating": "10", "text": "How there can be such huge fans of Harry Putter and say this movie wasn't great is beyond me.  Funny, action pact, awesome special effects, great message that wasn't environmental.  Great movie for the whole family.  Thank goodness for finally a great comic book movie since Iron Man 1!!"}, {"rating": "5", "text": "The movie started off well enough and seemed to introduce some interesting concepts but the movie felt rushed. It really felt like whole scenes were missing. It was almost like they edited two movies into one and chopped it down, the end result is like someone trying to smash puzzle pieces that don't fit together. Some parts didn't make sense but it was...enjoyable, I guess? I didn't leave fully disappointed, just slightly disappointed but I wasn't expecting very much to begin with. Stiff acting at times and hammy performances at others, they special effects were actually way better than I expected. I liked the ring on ring action sequences the best but the ending monster battle just sucked."}, {"rating": "10", "text": "I liked it. Adventure with a side of humour. Ryan Reynolds was great.  Clancy Brown is a great voice for Parallax. Peter Sarsgaard is a great villain (Hector Hammond) . I'll probably see it again!"}, {"rating": "8", "text": "Thoroughly enjoyable movie and shouldn't that be what movies are!  Great action scenes, not enough main bad guy for my liking.... and not enough Sinistro either! Roll on Green Lantern 2..."}, {"rating": "7", "text": "Disappointing. While the cast does a generally good job with what they are given, and the visual effects are pretty good, the dialogue is poorly written, the pacing sometimes suffers, and the movie tries to do too much in too short of time."}, {"rating": "8", "text": "Fact: Green Lantern has a history spanning over four decades and DC tried to cram a lot of it into a 2 hour flick. Is it any wonder then that the content seems a bit rushed or compressed? I think not, yet consider it a foundation movie. Okay, many DC Hal Jordan fans will probably not appreciate some of Hal's ring constructs. Hal never used complicated machinery like mini-guns or Anti Aircraft guns, but at least they kept to the more contemporary treatment of overcoming fear rather than the original fearless concept, definitely more believable! The more missing bits for me were more the camaraderie of the Corps, they have always been something like the Musketeers, all for one and one for all. Still they did come save Hal from burning up in the sun, too little too late for me personally. If you are not a rigid fan of the comics you can appreciate the struggles of the Hal Jordan that suddenly and very unexpectedly is handed over such power. You can even root for him as an underdog against the somewhat condescending alien species who look down on the young emotional humans. But they got one thing right, though often doubting, Hal never gives up and fights for his friends, the world, and yes also the universe. Sinestro, Kilowog, Tomar Re, and Abin Sur were well portrayed and most comic book fans would appreciate that but have wanted to see more. The final scene was classic Sinestro and well positions the sequel in what could become a great franchise if they don't try to cover so much in the next movie. 53 million the opening weekend may make the sequel a reality and if so they need to have a stronger plot, more Corps camaraderie and more character interaction between Corp members that somehow manage to unite in purpose despite such diversity."}, {"rating": "7", "text": "This movie is trying to make it a better DC comic book film that brings the awesome The Dark Knight and Superman, but I'll admit that this movie is more less than the other superhero films that doesn't get hype that too much. Green Lantern is okay and decent, but this movie is a lot of fun to see in summer and we can see it in 2D instead of wearing in 3D. The background is pretty awesome to look at, the action is so cool, the effects are pretty damn good (I love it when the Green Lantern is using his powers to fight with cool techniques that transform into anything), the cast is okay, and the story was a bit strange, but it works for a comic book movie."}, {"rating": "10", "text": "I honestly have no idea what the reviews are talking about, Green Lantern was amazing!I loved every thing about it. The fights were awesome, Oa looked fantastic, Hector was creepy as hell, Ryan was wonderful, the CGI was great, the pacing was near-perfect and the jokes were spot on! Sure it wasn't 100% faithful to the comics, but what movie is? GL was very fun and exciting. And all of this is coming from a big GL fan.I went in expected to be disappointed, but I came out with a huge smile on my face. I can't wait to go see it again!"}, {"rating": "7", "text": "I actually really enjoyed Green Lantern and I might have to put that down to that I love comic book movies or the surprise of liking it even after reading bad reviews. I had no knowledge of Green Lantern history going in so maybe it helped coming in fresh. I was really impressed by the 3D and SFX. The fact that the lanterns can create anything just by thinking about it is so kick arse cool. Hal Jordan (a surprisingly good Ryan Reynolds) is likeable and I stuck with him.Now thats not to say that there are not bad points. Its all so predictable and the two enimies are really cheesy. To even think that this came from the same studio that gave us the truely epic Batman movies that are so in a different league. Think taking a Ferrari (Dark Knight) out for a spin on a racetrack and then a Lada (Green Lantern). The Ferrari you will always remember but hairing around in a Lada would be fun when it lasted.  If you just want a good popcorn Friday night and some light hearted fun this is worth seeing."}, {"rating": "7", "text": "This movie won't make you think however it has a solid story and solid acting. If you are a fan of the comic book this is a must see, for the general public overall its not a bad movie."}, {"rating": "10", "text": "This movie does not deserve the critic reviews that it has received so far.  It almost seems that the reviews are paid by Marvel studios!  Special effects were excellent!  The 3D was arguably the best executed since Avatar. Even Thor looked fuzzy and out of focus compared to this movie.  The story could have been better and the pacing was off and that means this movie will not win an oscar but i never tried to.  This movie is meant to be family fun while managing to give GL fans many of the things we wanted to see. This movie does not bastardize the concept or the story that was developed over so many years in print. I give this movie a 10 to make a point. It does not deserve a 10 not does it deserve the current critic score of  39. IMDB has it right.  These ratings just go to reduce my trust in  metacritic and rottentomatoes reviews.  Go and Enjoy the film."}, {"rating": "6", "text": "Putting aside all of the wonderful superhero movies that came out this year. Green Lantern isn't actually that bad. I was expecting it to be worst, but I guess only Daredevil will only dare to go down that level.I was really hoping that the movie was longer, so that we can see the development of the characters more. I believe that they really edited this baby. It feels as if the whole story was forced to us in 1 hour and 40 minutes. It would have been good if they focused on the childhood of Hal Jordan, before he became Green Lantern.While it does have good visuals, it over saturates you to the point of its overwhelming to see all these images all at once.The acting was okay, it wasn't as bad as I had imagined it, before I saw it. There really was no chemistry between Blake Lively and Ryan Reynolds. The supporting cast did a good job, Mark Strong and Peter Sarsgaard (But the screaming was too much to handle :p)Over-all I think that if you give this movie a chance you might find something in it to like. It gives you good visuals and scenery of the different planets.This movie doesn't really stack up to this years hit superhero movies. But it's not a bad movie."}, {"rating": "6", "text": "O.k. Hal's transition into Green  Lantern is a bit,unrealistic,Yes, I know it's a \"Movie\" about a \"comic book superhero\",but I believe the purpose of the theater  is to turn fantasy into reality...so at least allow the characters to be a bit grounded towards reality. However on a whole, the movie was awesome and yes I would recommend it......"}, {"rating": "6", "text": "This movie is very watchable and entertaining for a superhero movie. The special effects look expensive and the acting (esp Ryan Reynolds and Blake Lively) is decent. It makes for an excellent eye-candy piece, especially if you buy it on blu-ray. However, as a faithful interpretation of the Green Lantern lore, I found the movie to be merely okay. The director obviously knew where the characters are generally going to end up. The teaser at the end is very accurate of the character's (Sinestro) fate. However, the movie focuses too much on the character of Hal Jordan and not enough on any of the other green lantern corps members. We never truly get into Sinestro's head or realize what a brute badass Kilowog really is. Overall, I thought Green Lantern First Flight was a far more enjoyable origin story for Green Lantern, even though it is animated. I think 10-20 years down the line when they make a new Green Lantern, (assuming this one does not receive a sequel) this version will be the equivalent to tim burton's Batman being compared to chis nolan's Batman Begins."}], "recommendations": ["aquaman", "john_carter", "superman_ii", "jumper", "percy_jackson_sea_of_monsters", "dreamcatcher", "i_am_number_four", "batman_v_superman_dawn_of_justice", "terminator_genisys", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "hercules", "the_twilight_saga_eclipse", "the_a_team", "glass", "the_green_hornet", "hancock", "gods_of_egypt", "edge_of_tomorrow", "tomorrowland", "poseidon", "seventh_son", "venom_let_there_be_carnage", "bright", "the_twilight_saga_new_moon", "i_am_legend"]}