{
  "id": 4523,
  "title": "Green Zone",
  "starring": [
    "Matt Damon",
    "Greg Kinnear"
  ],
  "runtime": 115,
  "genre": [
    "War",
    "Action",
    "Adventure",
    "Drama",
    "Thriller"
  ],
  "description": "During the U.S.-led occupation of Baghdad in 2003, Chief Warrant Officer Roy Miller and his team of Army inspectors are dispatched to find weapons of mass destruction believed to be stockpiled in the Iraqi desert. Rocketing from one booby-trapped and treacherous site to the next, the men search for deadly chemical agents but stumble instead upon an elaborate cover-up that threatens to invert the purpose of their mission.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/czFIaeukSxNEccysQeys1PCkuOG.jpg",
  "categories": {
    "plot": 6.458333333333333,
    "acting": 5.9,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.6,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.125
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The movie is realistically constructed compared to those war movies that spent millions of dollars with famed stars labeled in it. But problem with \"Green Zone\" is, they take things too seriously."
    },
    {
      "rating": "3",
      "text": "I really wanted to like this film. I'm as liberal as anyone but this was way over the top in my opinion. \"Wish fulfillment\" is the best diagnosis of what went wrong here--with crappy dialog and overly simplistic, one-dimensional characters (poor Greg Kinnear) it felt like a 12-year-old writing a historical-fiction war story for a creative writing assignment. Normally like Ebert, but he was way, way too kind to this film. Entirely forgettable film meant to cheaply evoke frustration over a national tragedy for commercial gain."
    },
    {
      "rating": "7",
      "text": "It's a little hard to follow if you don't rememebr , or care to remember the Iraq War and the search for WMD. It is part fact & part guesswork plot wise. If you believe George Bush was a good president , than don't see this film. Our Iraq war was a mess and history has already shown that whatever happened and why , the whole reason behind the invasion was a hoax. The movie is one persons attempt to explain why we wasted all that time,money, and lives. Dick Chaney would not give this film thumbs up. I thought it was well done."
    },
    {
      "rating": "0",
      "text": "This movie is driven purely by politics, complete revisionism covered up with cosmetic truths about the beginning of the war. Again Hollywood insults us with the belief that we care about their political opinions."
    },
    {
      "rating": "0",
      "text": "It's not surprising that Damon would agree to star in a movie that is just another slice of 'progressive' pie."
    },
    {
      "rating": "2",
      "text": "Anti-republican propaganda at it's best."
    },
    {
      "rating": "4",
      "text": "What happened to the smart intelligent adaptation of Imperial Life in the Emerald City, which we were promised? Not here I can tell you that. Instead of a critical examination of the role of civilian leadership in the reconstruction of Baghdad, we get a rah-rah-rah, there is no WMD in Iraq and we've all been duped! No look at Matt Damon act passionate and champion a cause after it is already mainstream. This isn't analysis of the political leanings of the film or cast, rather this is an outline of the plot structure. Formulaic and so overtly black and white that it is cringe worthy. Their is no moral grey, the bad guys are simply bad guys and the good guys have no moral flaw, beyond \"they're too just!\". The characters are so cookie cutter that you can't root for the good guys and the bad guys are so generic that you don't care if they get away with it or are killed. The resolution of the film is empty, because it so blatantly puts an oversimplified message ahead of a good story and characterization. That is the biggest problem in the film, by taking a political non-fiction book and turning it into a fictional military 'thriller' that is heavy handed in its message it loses all meaning and turns you away from caring. Where a subtle hand was needed, we got a megaphone wielding wacko screaming from the roofs."
    },
    {
      "rating": "5",
      "text": "Green Zone is essentially what you find in the Bourne films with an underwhelming and heavy-handed script. The action and direction is solid, but political agenda is misplaced."
    },
    {
      "rating": "3",
      "text": "Just didn't really enjoy it. not deep enough and the action is pretty sensless. Very little good things to say about this film."
    },
    {
      "rating": "5",
      "text": "This Matt Damon's worst movie ever for me I think when people go to see it they may be disapointed, I was, I went in there thinking it was going to be a whole different genre and had come out of it thinking that's not what I was expecting at all ."
    },
    {
      "rating": "0",
      "text": "Silly hyper liberal BS. Newsflash folks, we won."
    },
    {
      "rating": "1",
      "text": "Complete distortions of the facts!! Hopefully this movie will bomb!"
    },
    {
      "rating": "10",
      "text": "Paul Greengrass up until around 2001 no one knew whom this Irish up and coming director was that is until he directed the second of the three Bourne films \"The Bourne Supremacy\"(2004) that became the highest grossing film for the series at that point. one of Greengrass' most critically acclaimed films following on the heels of  his universally acclaimed \"Bloody Sunday\"(2002). Three years later  Greengrass directed one of the last decades   most acclaimed  and most controversial films \"United 93\"(2006) based on the true story of the heroism of the passengers and there tragic death when they forced the plane into a nose dive  causing it  to crash near Shanksville, Pennsylvania. The film was a massive critical success but meet with extreme criticism form audiences alike over its touchy source material. The year after Greengrass and actor Matt Damon  re-teamed to star and direct the third(and possibly final installment)  of the hugely successful Bourne series  with  the \"Bourne Ultimatum\"(2007)  which proved to be the highest grossing and biggest critically acclaimed hit of the series bringing a crashing final close to the saga of Jason Bourne. For nearly three years Greengrass was  working on a new project that while may lack the enthusiasm of his early works  is no less thought provoking or  thrilling as his  earlier works. This film is one of his best and a film that not only gives you the views of why we go to war but if the reasons we do go to war are really for the right reasons.  When I first heard of Paul Greengrass'  \"Green Zone\" back in  late 2009   I can say that I was  extremely excited  to see  Greengrass and Damon  back together again making a big action picture again  I could almost picture how this film would  have played out in my head(no thanks to my limitless imagination). I saw Damon playing a solider fighting against another Government conspiracy involving some sort of political assassination or cover up  that he exposed. I was eager with anticipation however, when I found out the release date of this film my anticipation dwindled. It dwindled not because I found out the film might not be as good as it appears but it dwindled because I would have to wait three months into 2010 to see one of my most anticipated films of 2010. After nearly two months of waiting I finally was able to see Paul Greengrass' \"Green Zoneâ"
    },
    {
      "rating": "8",
      "text": "This is Matt Damon's movie! He owns it! Even though we all know there will be no WMD's, and the movie has a tragic ending for the future of Iraq and reminds us how George Bush's private lie-of-a-war cost 4000 American lives, Matt's acting and the movie's good directing keep us involved and hopeful for a better outcome for truth. This is a documentary with plenty of added action."
    },
    {
      "rating": "10",
      "text": "Great movie. lol@ James F. We did not win, we have not won, we cannot win if we continue to lie and mislead. Why should the truth be considered liberal, unless of course anything spoken by a conservative is lies, lies and more lies."
    },
    {
      "rating": "10",
      "text": "That was one good movie. It kept me on the edge of my seat the entire time. Matt Damon is one heck of an actor. By the way, does anybody know what happened to all the WMD ? Even if nobody seems to care anymore, I would like to know where they are..."
    },
    {
      "rating": "0",
      "text": "I've long believed that the more incompetent the Director, the more likely he/she will cut a film into untold billions of cuts.  Loved the first Bourne movie.  Nos. 2 & 3?  No.  And no-er.  Do you really need 6 or 7 different 1 second shots showing a suitcase being put into a locker, or of someone entering a cab?  Green Zone?  Worthless.  Irrespective of Ideology, a film should be viewable, watchable.  Paul Greengrass, by this metric, is a complete hack.  And this is the last movie of his I will ever see.  Methinks Porn is his calling."
    },
    {
      "rating": "9",
      "text": "Not a war movie, no. But an elegant, perfectly paced thriller? Yes. Paul Greengrass has accomplished something here that he couldn't with the Bourne films, because the audience can believe everything he's telling them."
    },
    {
      "rating": "7",
      "text": "Stephen Glass, the reporter who fabricated articles for The New Republic, never killed anybody with his lies. He can be forgiven. \"Hack Heaven\" didn't result in wounded flesh and shattered bone. In \"The Green Zone\", Amy Ryan portrays a Wall Street Journal reporter named Lawrie Dayne, who is obviously a stand-in for the New York Times journalist who sold the WMD story to the public. Disappointingly, the film goes easy on her, since Lawrie is depicted as a victim, a burned writer, misled by her fellow countrymen. Clark Poundstone(Greg Kinnear), a Pentagon Special Intelligence agent, gives Lawrie the run-around on the airport tarmac when she requests a meeting with Magellan, Clark's informer. Thereafter, the naif scribe notices Warrant Officer Roy Miller(Matt Damon) talking to a senior CIA officer, and subsequently, in her hotel room, she admits to filing a story based on hearsay. While the character of Roy Miller functions like Oliver Stone's take on New Orleans D.A. Jim Garrison in \"J.F.K.\", our anger towards Lawrie is tempered, because the filmmaker cushions the blow of her war propaganda by giving this opportunistic journalist, SOME scruples. Across her visage, there's a look of humiliation while she relays her shaky reporting methods to the dumbfounded soldier. Lawrie was the government's tool, but she believed her story; believed in Clark. He betrayed her trust. Although \"The Green Zone\" is a superior action film with camerawork that can only be described as virtuoistic(perhaps, genius), the story should be told through the reporter's eyes; a reporter who is the anti-Woodward, the anti-Bernstein. \"The Green Zone\" may be a conspiracy movie, but the filmmaker doesn't go far enough. It's too fair, too balanced, since in all probability, the real-life Lawrie Dayne was \"The President's Woman\". If moviegoerswants to see Matt Damon kick ass, they can watch any of the three Jason Bourne movies."
    },
    {
      "rating": "8",
      "text": "evaluated as entertainment with some bonus for being grounded loosely in real events, it succeeds and is consistently engaging. Taking a large story and creating a central character as a hero is nothing new."
    },
    {
      "rating": "7",
      "text": "Revisionist history but great action."
    },
    {
      "rating": "7",
      "text": "Was quite enjoying it till i had to leave because my wife got nauseous from the camera work!"
    },
    {
      "rating": "10",
      "text": "Green Zone is another Matt Damon/Paul Greengrass camera-shaking actioner. Although this one lacks originality, it still gets the job done. It is exciting, pulse-pounding, and great popcorn fun."
    },
    {
      "rating": "0",
      "text": "Worst Iraq/Afghan movie, ever! Not realistic in the least. Boring and slow. I actually walked out of the movie, because the identity of \"Magellan\" was to obvious....and, the scenes are just not anywhere close to authentic. Really, troops riding around with no doors on the vehicles? Bikinis and beer? Really?!? Not a shread of research was done to make this movie reflect the actual conditions in Iraq. Zilch. I was angry, and sleepy---so, I left. Don't waste your money."
    },
    {
      "rating": "8",
      "text": "All in all a good film. Effects a little on the cheap side, you get the feeling your on a sound stage, not in a Baghdad alley way. But, still a good film, demonstrating the arrogance of the DC power structure, and a film that will make all but the staunchest hawk wonder WTF we are doing in Iraq. Damon was charmingly good, the rest of the cast competent. An engaging two hours of film."
    },
    {
      "rating": "0",
      "text": "Boring movie. Wish I hadn't gone to see it."
    },
    {
      "rating": "9",
      "text": "A thrilling film that should serve as a reminder to all of us."
    },
    {
      "rating": "8",
      "text": "This movie was better than I'd heard it would be. It's not as good as the Bourne film by Greengrass or United 93, but worth seeing in the theater. I think it's best for viewers to just let the story be a thriller set during the initial stages of the Iraq War--don't nitpick it for being fully accurate historically."
    },
    {
      "rating": "9",
      "text": "Moves along very well, the 'idealistic message' is nicely balanced with 'real politics', believable, makes its point while not lecturing. Plus: guns, explosions, martial technology, and large Hollywood names willing to risk reflection concerning 'how this mess all came about'."
    },
    {
      "rating": "10",
      "text": "Gotta give it a ten because it's political. Some critics compare it unfavorably to Hurt Locker for that reason Hurt Locker let us know that there is still room for the Good Cowboy -- out there in the wilds of Iraq -- inscrutable, deep, superior competence with things that hurt and kill, solitary like Shane and Hondo, misunderstood by lesser men, killer of faceless, bad by definition, Natives, moved to affection, compassion and honor by young boys, seems in some deep way to know why the Wild West and the Desert Sands are ours. If we have a man like that there, how can it be Bad? So clearly, Hurt Locker was not political. Green Zone's politics are its MacGuffin. That we were lied to is unfortunately old news, but the action is fast, the lines are not bad -- Damon's a very good soldier."
    },
    {
      "rating": "9",
      "text": "This movie was fantastic. The story builds a what-if scenario about why we didn't find WMD's and runs with it to make a great thriller. I don't think this film was made to get the Bush administration incarcerated. So ignore all the negative reviews bashing it as liberal propaganda. Sure its got very critical interpretation of the way the war was handled, but demonizing the U.S. government makes for much better than a bunch of Iraqis. That would be a cowboys and indians movie, and those are boring."
    },
    {
      "rating": "10",
      "text": "Wow, was I surprised. This movie is not what you think it is. \"Green Zone\" is one of the best pictures of the year and has fundementally changed the actioner archetype. It's the best."
    },
    {
      "rating": "10",
      "text": "Unbelievable stunts and great action. It is mesmerizing and stunning from start to finish."
    },
    {
      "rating": "10",
      "text": "Fantastic action movie that ties its political message in very well without forcing it or over doing it. Whether you agree with it or not, its still a very well done movie. Obviously James F. below must be one of the people who will blindly follow orders because thinking hurts. I have several friends in the military and have no ill will against the men/women who serve, I thank them for there service and intentions, but to say we won is a joke. Tell me, what did we win? What do we have to show for it? The government throwing around the lives of are citizens for there own agenda must stop... and this movie portrayed it extremely well. Matt Damon was perfect for this role. As it was said in the movie, \"The reasons we go to war always matter\"."
    },
    {
      "rating": "1",
      "text": "If you believe that Bush lied us into war and we fought it \"because of WMD\" in order to impose a \"modern Democracy\" there, you will love this film. Amazing that this crude, awful script was greenlighted, even by these Brits (Greengrass, Fellner, Bevan, etc.). Loved the last shot of the oilfield, guys. And really clever having Judy Miller work for the Wall Street Journal instead of the NY Times. One cliche after another, including the handheld visuals which were a carbon copy of \"Hurt Locker\"'s. It was, quite simply embarrassing to watch."
    },
    {
      "rating": "9",
      "text": "Slick Bourne style action set in an Iraqi War Background with the focus on the myth of WMD's. Excellent film, but it helps to know a bit more about the war."
    },
    {
      "rating": "7",
      "text": "Excellent thriller, pulls no punches about the real reason we invaded Iraq. Newsflash, folks, the fact that we won doesn't make it right."
    },
    {
      "rating": "6",
      "text": "It's like Greengrass is trying to shoot this movie from a kayak. Enough with the wobbly camera, Paul! This technique has had its day. It's understandable in the 'Cops' TV show, but let's get back to trying to explain stuff happening on the screen instead of going for the 'you are there' effect. Greengrass's Bourne movies, while great, were hurt by this silly camera ploy. It's film-student-esque. Anyway, the rest of the movie is good--plot, acting and action. I still recommend it."
    },
    {
      "rating": "10",
      "text": "Very Good movie....Fast paced thriller with a bold story to the Iraq war.....and to James F who said: \"Sily hype liberal BS. Newsflash folks, we won.\" what exactly did we win? A war based on false pretense? To quote....\" it's not up to you to decide what goes on here(Iraq).\""
    },
    {
      "rating": "9",
      "text": "I gave it a nine as it was a respectable film a Matt Played His Rolw Well Great Film."
    },
    {
      "rating": "7",
      "text": "It was pretty mind numbing, though a taught military/political thriller. The camera work was very jumpy, and several patrons left after the first few minutes. A scopalomine anti nausea patch might be helpful! The quasi historical basic plot involved a search for the WMD in Iraq, and then a search for the source who had given intel to the US. I have no idea if it was based on fact or part of the \"great left wing conspiracy\" (think Oliver Stone). So 4/5 stars, with reservations for the squeamish or for those with a need for historical acuracy."
    },
    {
      "rating": "8",
      "text": "We won? What air-craft carrier are you living on. This movie may be fiction, but it seems like a documentary on Dick Cheney in his very own wonderland. I loved it."
    },
    {
      "rating": "10",
      "text": "This movie was great! My husband and I havent been out on a date since our 2 year old son was born. We went to see this movie last night and we had our doubts but this movie was awesome. I don't favor action movies but this movie i could see over and over again! Matt Damon always brings great things to the table. Green Zone has a great plot and wonderful actors. You never know what will happen next, and it keeps you wanting more even at the end."
    },
    {
      "rating": "9",
      "text": "Top film, great action good political commentary. It's not left wing it's true."
    },
    {
      "rating": "8",
      "text": "Thought it was a pretty watchable movie; the storyline was somewhat believable even though I may/may not have fully agreed with its political message."
    },
    {
      "rating": "5",
      "text": "Live Review! Alright, the opening scenes were pretty well done...great use of sparse visuals to convey the chaos of the beginning of the war. Script not so much...very heavy handed. Ok, this is getting pretty silly. Action is well done, and the direction continues to impress. Very reminiscent of director's other work. However, the script is soooo weak. It seems like it's trying to boil all the problems about the war down to a few archetypal characters: the cynical old expert that no one listens to anymore, the close minded younger administrator that refuses to see the big picture, the crusading grunt that follows the good no matter where it leads...none of these people are developed as...people. Everyone does a pretty good job with what they have to work with, however. I think we are sliding further and further out of reality. This film is certainly no \"Hurt Locker.\" It is more fun, to be sure. The \"truth about WMD\" is the apparent heart of the story, which everyone watching this film already knows, and this might be the weakest link in the film, from a strictly 'thriller' standpoint. 1:11:00 into the film and Bush is declaring victory. It's these moments that pull you out of the fantasy of the 'thriller' aspect of the film and remind you that what it's using for fodder is a war that cost thousands of American and allied and hundreds of thousands of Iraqi lives, and to accomplish a completely imaginary goal . Not a plus for getting lost in the story, which continues to be heavy handed and rushed. Good scene between Damon and Iraqi General character. However, the narrative which has been slowly shifting from WMD to the beginning of the insurgency is unfortunately lacking in lots of elements, attempting to blame the coming violence on debathification and the disbanding of the military alone. This is a gross oversimplification, and if you are trying to inject a message into your action film, you are going to have to be judged by the message as much as the action. Ok, the film's over, and here's my verdict. The direction was great, and the actors all put in good performances. The story was very spotty. The weighty message of the film seemed to be \"America wanted the war and duped it's own military into fighting it for spurious reasons.\" This story has been told much better and much more honestly by filmmakers and media alike. I suppose if you enjoy your talking points with explosions and chase scenes, then this film is definitely your cup of tea, assuming you agree with said talking points. I enjoy a good thriller and I enjoy a good exposé but mixing the two very rarely succeeds, and this film is no exception."
    },
    {
      "rating": "8",
      "text": "Very Good, Intense thrilling, good Action excepted that the plot is all politics that its an anti-war movie. I'm sick of those guys. Supposedly it would have been better if Paul Greengrass did the script since he did an excellent job on United 93 instead of Brian Helgeland who didn't know anything about the book."
    },
    {
      "rating": "5",
      "text": "So-so movie. So many guns & ammo & explosions that you'd think Tarentino directed,. Didn't expect much & wasn't disappointed. So wait for the DVD."
    },
    {
      "rating": "1",
      "text": "General same-y sort of action film. Doesn't really bring anything new to the table of movies, and its a plot that sounds like bbc movie night, with a bigger budget! I almost fell asleep multiple times and the only think that woke me up was when I went to the toilet, and stopped off at the candy counter on the way back. Although through this, I thought the filming and camera work, although nauseating at times, was quite good, but acting was really the same old action star stuff, not too persuasive."
    },
    {
      "rating": "10",
      "text": "Simply the best movie of the year. The best war/ political thriller of the decade."
    }
  ],
  "recommendations": [
    "the_hurt_locker",
    "13_hours_the_secret_soldiers_of_benghazi",
    "zero_dark_thirty",
    "the_kingdom",
    "valkyrie",
    "jarhead",
    "lord_of_war",
    "red_tails",
    "12_strong",
    "the_monuments_men",
    "equilibrium",
    "snowden",
    "argo",
    "the_1517_to_paris",
    "patriots_day",
    "source_code",
    "lone_survivor",
    "closed_circuit",
    "elysium",
    "american_sniper",
    "the_purge_election_year",
    "blackhat",
    "london_has_fallen",
    "greyhound",
    "pearl_harbor"
  ]
}