{
  "id": 4282,
  "title": "Greenberg",
  "starring": [
    "Ben Stiller",
    "Greta Gerwig"
  ],
  "runtime": 107,
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "description": "A New Yorker moves to Los Angeles in order to figure out his life while he housesits for his brother, and he soon sparks with his brother's assistant.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jAsN4vPpycVxC89QlA6NYBXRuK7.jpg",
  "categories": {
    "plot": 5.935483870967742,
    "acting": 6.6976744186046515,
    "ending": 6.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 5.333333333333333,
    "action": 5.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Greenberg is a brutally honest and raw look at what is is like to wake up and be 40 and realize your life is not what you expected and you aren't who you thought you would be. Ben Stiller is excellent and shows he can be more than a one trick pony.  This is first time I have actually forgotten Ben was Ben in a role. He is troubled frustrated, arrogant and abrasive, acting out and inappropriate. You have to wonder why Florence would find him attractive and keep coming back for more. Brilliantly written and shot, it showcases life in LA as only one who actually lives here knows it. Jennifer Jason Leigh produced the film and as in past collaborations with Noah Baumbach show they are auteurs of creating emotional train wrecks that make us uncomfortable but can't stop watching"
    },
    {
      "rating": "3",
      "text": "This was a potentially good movie ruined by the classic combination of a Big Star wanting to be in a small indie film.  It.  Having to watch Ben Stiller in every scene was so painful, especially when Greta Gerwig and Rhys Ivans were so good.  There was no nuance or depth or humanity to his character.  It reminded me of Punch Drunk Love, in which Adam Sandler just looks stone faced the whole movie, which seemed to be his way of 'Acting'.  A similar self-involved character, the dad in Squid and the Whale was so much better with Jeff Daniels, a much much better actor.\r I am sure that this is why Alexander Payne retains control over casting.  Imagine a good script, good director, and a Big Star know for a specific type of comedy is forced on you.  It ruins the movie."
    },
    {
      "rating": "3",
      "text": "First of all, if you're expecting any moments where Ben Stiller freaks out in the movie and makes funny voices, you'll be sadly disappointed (which is a positive in my mind). However, that's the only good thing about the film. Baumbach struck out for me again. I hated Margo at the Wedding, and while this was slightly better than that film. It was still bogged down with so much complaining about getting old (which seems to be a predominant theme in Baumbach's movies), that I couldn't enjoy it. I actually think most of the actors did a fantastic job, but in the end, it is the screenwriting and the directing that is a monumental fail for me. Nothing redeemable about this movie."
    },
    {
      "rating": "3",
      "text": "Don't believe the critics (75? Really?) this film is a stinker. Ben Stiller trying so hard to act, and you never forget for a minute it's him. Loathsome characters, unfunny dialog, a really jaundiced look at Los Angeles which I'm sure many people who don't live here will think is true. It's not. It's a tiny little slice of a microcosm of horrible narcissists who hang out with people like Jennifer Jason Leigh and make this world a slightly more depressing place. Don't subject yourself to this film."
    },
    {
      "rating": "2",
      "text": "This movie couldn't move any slower. It seemed longer than a 2 1/2 hour movie we saw yesterday. How disappointing--a bad movie and almost two hours of our lives we'll never get back. Some people got up and left the movie, even at the price of movies these days."
    },
    {
      "rating": "2",
      "text": "Great performances couldn't save this insufferable script. Only a few laugh out loud lines (pretty much all included in the trailer). I loved The Squid and the Whale and found Margot at the Wedding morbidly fascinating, but his movie was a chore to sit through. You're either going to love it or hate it, so don't spend theater ticket prices and just wait for it to come out on DVD or On Demand."
    },
    {
      "rating": "0",
      "text": "Utterly boring and pointless. Doesn't even have a point of view, in the sense that it makes Los Angeles look like it has some sort of character. Could be set anywhere. Ugh."
    },
    {
      "rating": "2",
      "text": "Tedious, boring, predictable, interminable movie. Very disappointing."
    },
    {
      "rating": "2",
      "text": "Just dragged. The story went nowhere and the characters were boring. Don't know what the producers saw in the script."
    },
    {
      "rating": "1",
      "text": "Boring, nothing redeemable,and I am a Ben Stiller fan...the audience was unresponsive, and in the lobby after the film, lots of complaints...no one liked it."
    },
    {
      "rating": "3",
      "text": "I was so, so very disappointed in this movie because I absolutely loved Noah Baumbach"
    },
    {
      "rating": "3",
      "text": "Ben Stiller channels Woody Allen, but without Woody's wit, insight, and intelligence. Just another self-loathing neurotic doing a dull vanity piece as self-therapy."
    },
    {
      "rating": "5",
      "text": "Overrated piece of crap. the movie didn't go anywhere. watching gerwig made me feel claustropobic and there were only a handful of good scenes. overall the movie was slow and painful to sit through. just because a man is angry, bitter and caustic, that alone is not enough to make a movie around."
    },
    {
      "rating": "1",
      "text": "This is one of the worst movies i ever saw. I kept waiting for the point, or it to make ane sense. The reel broke 1/3 of the way through,& house lights. came on till theyfixed it. I was going to leave then, & should have Waste of my time."
    },
    {
      "rating": "1",
      "text": "I've seen worse movies, but not many."
    },
    {
      "rating": "2",
      "text": "Nearly complete bore. A couple of laughs here an there were not enough. Plotless and pointless. Too bad, I love Ben Stiller. He couldn't single-handedly save this yawner, but he tried. I kept looking for the nuances all the critics must have seen. Couldn't find anything. Renewed my contempt for the megacritics. Zzzzzzzzzzzz."
    },
    {
      "rating": "0",
      "text": "Could see nothing positive about the movie. A waste of time."
    },
    {
      "rating": "3",
      "text": "This was a disappointing movie. Surprised that it received such critical acclaim. It was boring, had no real plot or direction, and lacked any sort of dramatic tension to propel it forward. The funny moments were few and far between. It was another one of those indie flicks that are about nothing and think they can get away with it. Granted, I like a lot of those indie flicks, but this one did not cut it."
    },
    {
      "rating": "2",
      "text": "A horror movie. The film convinces you these people may exist which is chilling. The Stiller character is 90% zombie and 10% pure evil. His romantic interest is 50% zombie and 50% 3 year old child......totally dysfunctional. The movie should never have been made."
    },
    {
      "rating": "2",
      "text": "The best part about this flick was the cashews i snuck in. how refreshing, i thought... no explosions, no blaring fx, just a story. then it started... a snail slow pace. it'll pick up fer sure, i thought. ha! in a pig's behind! this self-absorbed (stiller, not me) creature... fresh out of a 'hospital'... trying (more at being an ass than getting civil) to put his life back together. from the look of it, he'd always been an ass. and the earwig woman... why'd she fall for him? ickypoo. don't see this movie. guaranteed to put you off your popcorn."
    },
    {
      "rating": "4",
      "text": "This is painful to watch--cringeworthy from first to last--but well written, well-directed and well-acted. Still, why does it get a 75 score on Metacritic --it's a draining experience to watch and you are bummed when you walk out (unless you already left in the middle). Okay, these are (unfortunately) pretty real people and complex enough, not typical Hollywood stereotypes--but does that really make this worthy of all this critical praise. Are these critics all Florences at heart? (i.e., masochists)?"
    },
    {
      "rating": "0",
      "text": "Dreary, boring and pointless."
    },
    {
      "rating": "7",
      "text": "It doesn't surprise me that, after-the-fact, I found out that this movie was directed by Noah Baumbach.  The direction is unique, painfully slow at times (intentionally) and physically makes me squirm in my chair while watching because the uncomfortable things happening to the characters in this movie are entirely too real.  Mid-life crisis is an understatement here.  A man so arrogant that he believes he's better and deserving of so much more than he's received in life, which has turned to pure bitterness.  At the same time, that bitterness is tempered with sporatic episodes of maturity and responsibility.  That dichotomy results in very schizophrenic behavior toward the friends and family he loves.  At times he's defensive of the mistakes he's made that brought him to the misery he is currently experiencing, while he also calms down and realizes that he shouldn't blame and that he, in fact, is causing his own misery.  It's painful to watch and so uncomfortable to the viewer, especially me who experiences bouts of the same thing every now and then (though to a lesser extent).  One almost has to be older to appreciate what this movie is saying, but even those open to its content have to also get past the brutal way Noah brings it to the screen.  The Squid and the Whale was depressing enough.  It makes me wonder how depressed Noah is to consistently present this much raw pain.  However, what makes the movie is its optimistic, and sweet, ending."
    },
    {
      "rating": "0",
      "text": "Minimalism is no excuse for a poor screenplay, and artsiness is no justification for poor direction. Paolo Sorrentino is a minimalist director, and his films are brilliant. David Lynch is an artsy director, and his films are brilliant too. The problem with Noah Baumbach's films -well, ONE of the problems with his RECENT films- is that he seems to have picked up that terrible habit that Wes Anderson had for a little while until a couple of years ago. See, Anderson too thought for a few years that he could get away with compiling a series of quirky vignettes and calling it a screenplay. Thus, The Life Aquatic with Steve Zissou (2004) and The Darjeeling Limited (2007) are nowhere near as accomplished and coherent as Rushmore (1998) and The Royal Tenenbaums (2001). Bottle Rocket (1996) is a different case, as it was his first film. Its imperfections have to do with lack of experience, and they are easily forgiven. Anderson's latest film, Fantastic Mr. Fox (2009, co-written by Baumbach, by the way), saw him come back to form. Now, Baumbach's best film to date is clearly the outstanding The Squid and the Whale (2005), after which, he decided to hit us in the head with the bluntly morose Margot at the Wedding (2007). Greenberg, unfortunately, is in the same vein of the latter, not the former. It is so absolutely bourgeois (anyone outside of the upper middle-classes simply does not exist), that Sofia Coppola might feel challenged when it comes to the position of \"Most White-Bread Director in the World.\" Ever since The Squid and the Whale Baumbach has been directing films that are uninspired and uninspiring collections of eccentric details and overly wacky situations. No story, no depth, no character development. Just irritating, adolescent forty-somethings complaining about their Beaujolais. Ignore the hype. This is not a good film."
    },
    {
      "rating": "3",
      "text": "Wow! I was really expecting to like this movie and it was just ridiculous. This film tries way to hard. There are periods of slight entertainment and good humor, but holistically this movie doesn't even warrant the time if its watched free of cost. Da, that was stupid movie."
    },
    {
      "rating": "10",
      "text": "Ben Stiller really proves to be a great actor. He makes you love and hate Greenberg at the same time. He has a very awkward personality, but in the other way you sympathise with him. The film's dark humor is very well thought of. Great script. I had a few laughs. If you like black comedies, this is a film you have to see. 2.0"
    },
    {
      "rating": "7",
      "text": "Very interesting premise; some very powerful scenes; high-quality acting. Just wish the lead character were not so thoroughly hard to like and the ending were stronger. But well worth seeing."
    },
    {
      "rating": "9",
      "text": "Excellent movie. Greta Gerwig is a true revelation. The dialog is fantastic. Definitely on a level with the director's other outstanding film, Margot at the wedding..."
    },
    {
      "rating": "10",
      "text": "Brilliant movie. SEINFELD meets ANTONIONI"
    },
    {
      "rating": "9",
      "text": "This movie isn't for everyone, but if you like indie type movies and enjoy quirky and sometimes dark humor, give this one a shot. Ben Stiller and all the other actors give great performances. His character is a self absorbed jerk, but I think many of us can find a little bit of ourselves in him if we take the time to look. It's not a feel good movie where you are rooting for the character and he overcomes his failings and ultimately redeems himself for a cheap dramatic payoff. It is just a good story with a valuable message to us all. Even if you don't take anything else away, it is still a damn funny movie."
    },
    {
      "rating": "8",
      "text": "If you like a self-absorbed narcissistic protagonist (Stiller) admist similar people in LA, you'll love this movie. Greta Gerwig as the easy-going housesitter, is a gem. Rhys Ifans as an old band buddy gives a solid andhonest performance. The cinematography is creative."
    },
    {
      "rating": "8",
      "text": "Stiller does a good job of portraying an narcissistic artistic type guy who once had idealistic dreams but now finds himself middle-aged and feeling bitter at life. Not a film for everyone, but this is a good film. Despite how unlikeable the character Greenburg is, you still end up kind of living him and hoping he will find more happiness."
    },
    {
      "rating": "8",
      "text": "People who rated lower than 2 are idiots who saw Ben Stiller's name and expected Meet the Fockers."
    },
    {
      "rating": "10",
      "text": "An excellent film, funny, moving, sharp, engrossing. Ben Stiller gives his best performance yet, and Greta Gerwig is an instant star with her excellent performance. It is a dark comedy, but in an odd way, it's director Noah Baumbach (The Squid and The Whale, Margot At The Wedding)'s most hopeful film."
    },
    {
      "rating": "9",
      "text": "Much better than I thought, judging from the low reviews here. A moment in the life of a forty-year-old that probably rings true for many. (You know who you are)."
    },
    {
      "rating": "8",
      "text": "In an evident time of depression, several modern Independent filmmakers have focused on the lowliness and deadbeats of society. Noah Baumbach's exceptional Greenberg focuses on a 40 year old one time musician (Ben Stiller) who has just been released from a mental hospital.  When attempting to adjust to society, he faces a living that honestly emulates the emotion of present day urban life in its dismal state.  And taking on a similar position of most Indie films, the film conveys that love can still be present in any circumstance.The film commences with a quirky Steve Miller Band song that undoubtedly contrasts with the rest of the movie.  The audience is then introduced to Roger Greenberg, who is returning to his native Los Angeles to house sit for his brother. Greenberg is a loser; This can be seen as he reconnects with his past acquaintances  who have, unlike himself, moved on from their dreams and faced the responsibility of life.  But although it seems as if Stiller's character has nothing going for him, he develops subtle fondness with his brother's assistant who is played by Greta Gerwig.  The film then balances between Greenberg's \"relationships\" and how he deals with the mediocrity of his existence.Stiller takes on a role similarly to how Jim Carrey played in \"Eternal Sunshine,\" and almost completely matches the dramatic level in which Carrey  performed.  Greenberg's intricacies are played well enough to strike emotion with the audience who possess a sympathy for the character. Stiller does not act like a mainstream Hollywood actor in this film.  He does not necessarily execute a good dramatic performance, but acts in a way that forms emotional depth and honesty. He is also backed with solid performances by Greta Gerwig, who performs in a direct but unstable manner, and Rhys Infans.Greenberg is categorized as a \"Dramatic Comedy,\" which in fact that categorization could be seen falsely.  While there are some laughs, the movie emphasizes true emotion and does not simply attempt to try to create humor.  Apart from the one-liners, (\"Does the pool overflow?\") the movie is as dramatic as one can get.  But that is what is so appealing about the movie; the shell of the movie can be assumed as a comedy but the interior is a true viewpoint of current life.With all positive aspects said of Greenberg, there is somewhat a sense of emptiness within plot.  The film does not necessarily go anywhere.  While there is some development within Greenberg's relationship, nothing really develops around the character.  The film simply focuses on the beginning of Greenberg's stay in Los Angeles and the near end. While this is not a major problem as the movie is not intended to be a storyteller, but a vantage point, it prevents Greenberg from reaching near perfection.Greenberg is not for everyone.  An average moviegoer will not find much entertainment in the story or its exterior.  The gem that is in the movie, the emotional depth, must be found by analyzing the character itself.  If you are not willing to think during the movie, it is best to skip Greenberg.  But if you are, you will find an extraordinary film that you will be thinking about for weeks to come."
    },
    {
      "rating": "8",
      "text": "Great performances from Ben Stiller and Greta Gerwig. Smart, funny script from Baumbach. Not as good as \"The Squid and the Whale,\" but will definitely hold up as quality film in the Baumbach/Anderson canon."
    },
    {
      "rating": "9",
      "text": "I feel the need to defend this film. I feel like I understood where Noah was getting at. The entire film was meant to be minimalist and awkward. Greenberg, being an unlikable character has to be unbearable, and the audience must feel the discomfort that the characters do on screen whenever he is present in a scene. The film is about the reality that most people grow up to be nothing and simply take up room. Greenberg felt as though he had some sort of life calling but chickened out and ruined it for the rest because he was selfish. He did nothing just as many people do here in real life. He was stuck in his past. In one scene which he is sitting with several teenagers he is essentially acting the same age as them; refusing to grow up and conversing about the contradicting ideologies of their generations. When a friend approaches him and tells him that he has come to \"accept the life that he did not plan,\" Greenberg refutes his opinion. It is because most people cannot accept the irrefutable reality that is unpredictability and instead find it easier to find comfort in productivity. Greenberg was more of a mirror to 20-40 year old's than any other film I have ever seen. I recommend it 100%."
    },
    {
      "rating": "10",
      "text": "Easily one of my favorite movies of all time. This movie has an emotional depth like no other."
    },
    {
      "rating": "10",
      "text": "Another great film made by a interesting and intelligent director.. Obviously, this film is for people who are capable of abstract thought and not for the mindless dreck that encompasses most of America. If you didn't like this movie, you are not smart enough to be going to real films.. where u see this as boring, the thinking man will find truth in great writing and original thought. here's how you know I'm right: you went to see this movie because ben stiller is in it. sad sad sad.. how dumb people are."
    },
    {
      "rating": "1",
      "text": "Excellent work by Gerwig and Ifans don't offset Stiller's self-absorbed performance in this boring drama about a self-destructive character. Writing and directing produce one singular boring piece of dreck."
    },
    {
      "rating": "5",
      "text": "Two words: Simple Jack. (Fans of Tropic Thunder will get my reference to the Oscar-bait film Stiller's character starred in.) I get why viewers hate the film. And I get why critics basically like it -- it's so not Hollywood mainstream. The seduction scene was so explicit, so awkward, so awful and so hard not to watch. But it stuck in my head."
    },
    {
      "rating": "6",
      "text": "I loved this film but I agree with many of these reviews which criticize the casting of Affleck.  Baumbach is famous for his unlikable characters, but Stiller's performance is so distracting and forced that he nearly ruins this film.  An excellent script and breathtaking performances by Greta Gerwig and Rhys Ivans saved the film for me."
    },
    {
      "rating": "5",
      "text": "I wanted to like Greenberg. I really did. I am a fan of subtle slice-of-life indie dramedies. I am a fan of Ben Stiller.  I was not a fan of Greenberg, though.  I was entertained through most of the movie, and it kept me intellectually stimulated at parts, but in the end it left me feeling nothing but disappointment.  There was no emotional connection to the characters in the film, and each character never showed any more than 2 dimensions.  They were all generic indie characters who never seemed to have an internal motivation.  Everyone seemed to behave based on what they prescribed character type was meant to be.  Do not get me wrong, this is not a bad film by any means, but it is also nothing I am going to remember a few years down the line.  I would much rather watch this movie again than sit through Stomp the Yard 4."
    },
    {
      "rating": "7",
      "text": "The first time I watched this, It was very difficult to understand, and I think that can be said for pretty much all of the people who saw this movie. I had to review it again to understand it and I realized that Ben Stiller gave quite a good performance and the writing is actually quite good and funny. Some of the events still confuse me, but I still defend this movie, saying it has good writing, great performances and an unconventional storyline which is hard to find these days."
    },
    {
      "rating": "9",
      "text": "This should be nominated for Best Drama. Baumbach has a great skill in creating character nuance that is not always pleasant, but certainly realistic. Those unaware of their own personality blind spots will feel uncomfortable during this movie. However, Greenberg is fully formed and expertly played by Stiller. There is a part of Greenberg in all of us."
    },
    {
      "rating": "5",
      "text": "I'll admit, I came to this film knowing I might not like it; I'm generally not a fan of Ben Stiller (at one point I had to fight an image of Simple Jack out of my head), and knew it was a Baumbach film (I wasn't a big fan of Margot at the Wedding). The reason I was interested was Greta Gerwig. Thank God for Gerwig and Rhys Ifans, who save the film from being a complete wreck. Ben Stiller's Roger is so unlikeable it's maddening; it gets tiresome very quickly. The film gets more interesting toward the end, when Brie Larson and Juno Temple bring some much needed levity, but it's too little too late. Ultimately, it's just not the type of film I respond to wholeheartedly."
    },
    {
      "rating": "0",
      "text": "I want an hour and a half of my life back. There's really nothing more to say about this movie. I am posting a review hoping to save a few people from wasting their time."
    },
    {
      "rating": "9",
      "text": "Honest and tought provoking; normal life isnt always fun and inspiring as many other movies try to portrait. This is more close to the avarage-joe. This movie gives the opportunity to take a good look at the mirror and ask ourselves of our life goas and relationships."
    },
    {
      "rating": "8",
      "text": "Sometimes, I'll never get Metacritic's users... even they have a huge amount of logic to talk about same with the critics on this site. This movie's one of the examples for user logic. Don't listen to the users. Greenberg's worth going to and you'll love every single second of it."
    }
  ],
  "recommendations": [
    "the_upside",
    "the_king_of_staten_island",
    "revolutionary_road",
    "the_fault_in_our_stars",
    "uncut_gems",
    "her",
    "meet_joe_black",
    "manchester_by_the_sea",
    "the_curious_case_of_benjamin_button",
    "there_will_be_blood",
    "inherent_vice",
    "the_gambler",
    "the_bucket_list",
    "seven_pounds",
    "match_point",
    "gone_girl",
    "hereafter",
    "boyhood",
    "up_in_the_air",
    "burn_after_reading",
    "the_intern",
    "the_blind_side",
    "the_cobbler",
    "lost_in_translation",
    "me_before_you"
  ]
}