{"id": 2030, "title": "Green Book", "starring": ["Viggo Mortensen", "Mahershala Ali"], "runtime": 130, "genre": ["Drama", "Comedy"], "description": "Tony Lip, a bouncer in 1962, is hired to drive pianist Don Shirley on a tour through the Deep South in the days when African Americans, forced to find alternate accommodations and services due to segregation laws below the Mason-Dixon Line, relied on a guide called The Negro Motorist Green Book.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/7BsvSuDQuoqhWmU2fL7W2GOcZHU.jpg", "categories": {"plot": 6.2615384615384615, "acting": 6.865671641791045, "ending": 6.6, "soundtrack": 9.333333333333334, "cinematography": 9.0, "familyFriendly": 4.333333333333333, "funny": 8.222222222222221, "action": 0.0}, "reviews": [{"rating": "8", "text": "Green Book is probably one of the most satisfying films ever created based on the historical events that took place in the 60s America. The two main wise guys, Nikolai from Eastern Promises (Viggo Mortensen) and Juan from Moonlight (Mahershala Ali) had the best set chemistry based on a true friendship that I have ever seen on the big screen I tell you what. To be honest, this film had me mistaken that it’s a PG-13 rated film but not an R rated film because of the superb directing and writing that this film has accomplished on and honestly, I had a legitimate great time seeing it. If I were you, go see this film – capiche?"}, {"rating": "10", "text": "A story worth filming! Worth watching! And absolutely worth 10/10! I don't know what's wrong with some of the people who rated it so low, but honestly - i don't care. I loved every second of it and without any doubt - will watch it again! I think \"The academy\" did its job right, this time around!"}, {"rating": "10", "text": "Adorable story, funny, dramatic. Actually, I don't want to destroy the film, putting stupid words and making dumb review.. just watch the film, it's one of the best."}, {"rating": "10", "text": "This movie was fantastic - although I've read much about the racism in the US back then, the performance by Mahershala Ali and Viggo Mortensen really painted the picture vividly, and showed the difficulties and abuse an African-American faced in even attempting to climb the social ladder. But all this was conveyed and brought forth in a truly likable and warm narrative through the chemistry of Ali and Mortensen, and inspired hope in changing hearts by shining like a sun and not blowing like the wind."}, {"rating": "10", "text": "This is probably one of the best movies of this century.First of all, it has great acting and thought-provoking story. The music and the characters are vivid.Definitely recommend it!"}, {"rating": "9", "text": "It’s been a very long time since I have heard an audience applaud spontaneously after a film in an ordinary local theater, but it happened today after a screening of Green Book. And I must admit I had to agree with the audience verdict about this one. Perhaps the “message” was obvious, but the commitment, believability, and humanity of the two main actors (Viggo Mortensen and Mahershala Ali) was extraordinary. I really felt like I took the journey with them. This is definitely one of the best films I have seen this year – beautifully written, directed, and acted."}, {"rating": "9", "text": "Easily one of my favorite movies of 2018.  I can see why cynical movie critics can't embrace it, but it's got all the ingredients of a feel-good movie, with some harsh realities, and what it takes to be a good friend.  I loved every minute of it."}, {"rating": "10", "text": "\"Green Book\" is a fairly true story of a gifted concert pianist and his hired Italian driver making a swing through the Deep South in 1962 at the height of Jim Crow before the civil rights battles really started.    The actual \"green books\" were indeed real, and were handed out at gas stations or other locations to help African Americans find locations to eat, sleep and otherwise be entertained without being harassed by the ignoramus separatist white racist idiots especially in the South.    Viggo Mortenson plays a Bronx semi-wise guy Italian who needs a few months employment as his club where he is employed as a bouncer, the famous Copacabana is undergoing renovations, and lands a job as a driver for Dr. Don Shirley, brilliantly played by Mahershala Ali.    Both men are absolutely genius in their respective roles, as Shirley, a gifted and very erudite and intelligent concert pianist play off each other during this two month tour of the Deep South.    It's a shock to the system of the time with a white man driving the affluent and privileged African American around between gigs, and the film carefully examines the strife and attitudes of the day and age without getting into some of the truly horrendous events that also happened.    The film doesn't really cover a lot of new ground here, and has its similarities with \"Hidden Figures\", the blockbuster from a few years ago without being a derivative.    Without being a spoiler, we are witnessing the gradual closing of the gap of understanding the world as both men know it, including Dr. Shirley's own unawareness of the awful poverty he witnesses during the trip of his fellow African Americans, and learns that Tony, his driver lives in very modest circumstances of his own in the Bronx.    This is a movie where we don't really see a cataclysmic event, but rather the common behaviors of a Jim Crow south, where patrons in cities like Memphis and Birmingham want to be seen as \"cultured\" and have no problem with Shirley performing at their private swanky parties, but that tolerance stops obviously the second the show's over.    \"Green Book\" serves a duel purpose:    the enormous racial divide, class divisions and the courage it took for more open minded people of all races to begin to stand up and unite against the profound hate that sadly still exists today, but was a genuine threat to life and limb back then.    It's a great movie and highly recommended."}, {"rating": "9", "text": "Two days after seeing A Star is Born, which I loved, I saw Green Book--a more impressive move. Funny. Touching. Great acting. I'd give it a 10 but for a few details I didn't like. Hard to believe this story reflects real events and attitudes of 1962. The nation has taken many steps away from that era, thank goodness."}, {"rating": "8", "text": "This charmer is based on the real relationship between a rough-edged, Italian-American bouncer (Viggo Mortensen) and the refined African-American jazz pianist Don Shirley (Mahershala Ali). Lip is hired to drive Shirley on a concert tour thru the Deep South in the 60s. As expected, they go from contrary attitudes to an endearing, mutually-beneficial friendship, so it's up to the filmmaking to create something special. Both of the lead actors give deep and affecting performances. Director Peter Farrelly (best known for silly comedies) has maneuvered between racial discord and human interaction with skill, assurance and a few laffs. The script, while predictable, still manages to create an involving narrative."}, {"rating": "8", "text": "Based on real events and real people, this film is about relationship between a famous black pianist Don Shirley and his driver Tony, a New York bouncer of Italian origin.The name 'Green Book' refers to a hotel travel guide in the Deep South where black people were allowed to stay in 1960th. Obviously, racism (especially in the South) is one of the main themes of the movie.It's also about family, dignity, courage, self-identification, and many other things, foremost about an earning to connect, to feel close. It is a serious drama peppered with funny episodes.Great performances from both leads. Believable script, detailed nuances.Overall, the movie is quite enjoyable to watch."}, {"rating": "9", "text": "Funny, breezy, emotional and impactful. Great performances and screenplay. Just an enjoyable movie with a tiny bit of a message (even if it doesn’t get as deep as it maybe could have)."}, {"rating": "8", "text": "Green Book is directed by Peter Fairly and is about the journey and friendship between Tony Vallelonga, an Italian driver played by Viggo Mortensen, and Dr. Don Shirley, a black pianist played by Mahershala Ali, as they journey though the south in the 60's. That concept sounds pretty simplistic but this film executes it so well that you don't think that. The relationship between our two leads is portrayed excellently. The film is at it's best when it's just the two of them having a simple conversation. Viggo Mortensen plays Tony Vallelonga perfectly as the typical Italian during the 60's, his comedic timing and delivery makes him hilarious but relate able and is balanced excellently Mahershala Ali's stoic and dramatic portrayal as Dr. Don Shirley. Peter Fairly has established him self as good comedy director with the Dumb and Dumber movies, but this the first time that I have felt like he has hit that perfect balance of drama and comedy. In conclusion this is the best film of the year so far and if you haven't seen it yet then see it immediately."}, {"rating": "6", "text": "With the noise it made recently, I could say I was bit disappointed. Overall it was a decent movie but not worthy of the names it grabbed. I think anyone would agree that this movie is like watching a re-mastered version of “Driving Miss Daisy” with much focus on the recent changes.Times were simpler back in 1989 when “Driving Miss Daisy” was released and the focus was only on the story and relationship between a Jewish women and Black driver. But in almost three decades’ focus became less and less towards the story and more on “How to force the academy members to vote for this movie?”. Movie spills its beans way too early and even with that pace, every single step is predictable. Even upcoming scenes could be predicted with exact timing and words. Either writers wanted to stick to the real story too much or they wanted to not show anything to antagonize either color. And as a product of their effort, the output was mediocre.As far as acting goes, Mahershala Ali is on average. Beside one scene, his acting looks like an effort. For a person like me who has seen him for several years, on House of Cards giving a brilliant performance before he became famous, his portrayal was a huge let down. His effort was visible but he resisted taking risk. Viggo Mortensen on the other hand was closer to the character he was playing. He did not come up with the sharp Italian ascent we’d expect since God Father but his body language was very impressive. Ironically, Viggo was nominated for a similar role 11 years ago for “Eastern Promises”.The Green Book is not a bad movie and definitely not a bad idea, but it sure was wasted to milk the recent black cow."}, {"rating": "10", "text": "\"This based on a true story\" film is an unexpected surprise. Few films are able to combine compelling drama and comedy without stretching one genre or the other. If you had given me a list of one hundred candidates for the role of a semi-educated 1960s nightclub bouncer from the Bronx, I probably would have placed Vigo Mortenson I  at the bottom of that list as a likely candidate for the role. And he knocks the role of Tony Lip outta the park. Mahershala Ali, who won an Oscar for his role as the ominous drug dealer in Moonlighting is no less a surprise as the somewhat prissy and bottled-up jazz pianistDon Shirley.In balancing issues of racism and violence with laugh-out-loud humor, director Peter Farrelly is this film's third surprise. Along with brother Bobby, Farrelly is most famous for dopey and base comedies like the \"Dumb and Dumber\" flicks.I was amazed by Farrelly's deft handling of transitions that move from Tony's knuckle-headed ignorant insights to the humiliations heaped upon a refined black man in the mid-twentieth century Deep South by hypocritical sophisticates.Green book is an emotional, artistic and fulfilling  gem."}, {"rating": "10", "text": "Fabulous movie!  Go see it.  You won’t be disappointed.   My review ended up under Green Room!  Did not realize that Green Book didn’t come up."}, {"rating": "10", "text": "One of the best movies of the year.  Both performances are fantastic.  Inspiring and heartfelt."}, {"rating": "6", "text": "Prepare to sit through a very long \"before\" as the movie explores Tony's thuggish, comic-book background. (Cross a Mafiosi and a New Yoaker, that's Tony!) Then sit through a well-meaning but laborious exposition of how he and a self-centered, judgmental black musical genius develop a (dare we say it) quasi-affectionate relationship. After one hour I took my leave, but maybe you'l  stay longer and tell me how it ends..."}, {"rating": "8", "text": "Though its softened edges and cautious approach might irk some of the more discerning viewers in the audience, its \"Green Book's\" benevolent nature and engaging thematic material that should be commended above all. Generally more of a comedic filmmaker, director Peter Farrelly handles the story behind Don Shirley and Tony Vallelonga's true-to-life friendship with a surprising patience and care, ultimately lending a tremendously feel-good experience. Spearhead all of that with some unsurprisingly magnificent performance work from both Mahershala Ali and Viggo Mortensen, and you've got yourself one of the better movies of the year."}, {"rating": "6", "text": "Oh no, not another movie about racism in American! Although this in not a bad flick, it is basically boring. I ended up clipping my toe nails while watching it, and didn't miss a thing."}, {"rating": "9", "text": "They just don't make 'em like this anymore. Peter Farrelly's 'Green Book', inspired by true events is a conventional drama, but a pure and heartwarming one. Tony Lip (Viggo Mortensen), the working-class Italian-American bouncer hired to be the driver/bodyguard/assistant to a virtuoso African-American classical pianist with multiple PhD's while he tours throughout the American South during the 1960s is just as you expect it to be.Both characters are brilliantly acted by two of the best actors working right now, and their personalities, especially Tony's, are somewhat stereotypical--but the genius of Farrelly is how he manages to make them blend in to one another with such ease, such humanity, warmth, that they dissolve into something simple, straight-forward, but beautiful.Racism in this story its so obvious that its delicate to mention it. When Tony hangs out with the other drivers while Dr. Don Shirley (Mahershala Ali) performs, he is annoyed when Don tells him to behave himself at which Tony argues that he was just having fun. Shirley's reply sparks unease when he says that you had a choice whether to be in or not, they did not--I don't need to tell you that Tony was the only white driver among them. Throughout old-school vibey camera and cinematography, for these entire two hours these two characters have an unmatched chemistry. Their simplicity makes it easy to work with. They are both human, they have flaws, regrets, secrets, memories, rituals, principles--they both sacrificed, they both loved, hated, cried and laughed, and so did we.In the end, the film ends with a sweet albeit utopic, unreal silver lining. But, for once, I liked that. Racism is still alive, yes we know that. We don't need another film to act all knowledgeable trying to portend something. For once, let's resume to family and friends rather than preaching to the entire society. It all starts there. This film is not as much about racism as it is about people.In fact, the only thing keeping this film from being a masterpiece is the fact that, in a burst of anger, Dr. Don Shirley screams out all the concepts and insights which should be hidden so that we discover them for ourselves. \"Yes, I live in a castle, Tony! Alone! In which white people pay me to play piano for them because it makes them feel cultured. But as soon as I step off that stage I go right back to being just another n***er to them. Coz that is their true culture and I suffer inside alone coz I'm not accepted by my own people coz I'm not like them either! So if I'm not black enough and if I'm not white enough and if I'm not man enough then tell me, Tony, what am I?\" The quintessential question. No one could have said it better."}, {"rating": "8", "text": "This was a simple yet culturally significant, funny, and often times very heartwarming and crowd-pleasing film while also providing important social commentary regarding race and discrimination. The film follows an Italian-American bouncer (Viggo Mortensen) who is hired to drive an African American pianist with a Doctorate in music (Mahershala Ali) on his musical tour through the American South in the 1960s. From the film's opening moments, I knew I was in for a charming and great time, cause despite the serious historical subject matter and depiction of racism throughout the film, every moment in the film is played out surprisingly light-hearted but never too much so as to remind us of the important cultural and historical significance of these different and difficult times in America. In addition, Mortensen and Ali play off each other perfectly from start to finish, seemingly forming a genuine bond and friendship as the film progressed. I was especially impressed with Mortensen however, who not only had so many great and funny moments and lines, but also showed serious commitment, gaining approximately 40 lbs or so for his role. Overall, despite the film's rather safe and restrained depiction of racism and prejudice, it nonetheless remains very mature and insightful regarding these themes and depictions, and the performances and chemistry between Mortensen and Ali are undoubtedly the film's biggest charm, with all of these elements coming together to make the film a mostly smooth yet satisfying ride."}, {"rating": "9", "text": "A superb fact-based road trip buddy film featuring two of the unlikeliest of travel companions. This tale of an African-American pianist and his New York Italian driver on a concert tour of the American South in 1962 hits all the right notes without belaboring its message while effectively capturing the unusual friendship that grows between the film's two protagonists. Excellent performances by Viggo Mortensen and Mahershala Ali are punctuated by a script that's full of laughs, poignancy and heart. An underrated gem that deserves high marks and well-earned accolades."}, {"rating": "8", "text": "Green Book, ünlü siyah caz piyanisti olan Don Shirley'nin (Mahershala Ali), Tony “Lip” Vallelonga (Viggo Mortensen) ile bilrikte, Amerika Birleşik Devleri'nde güneye doğru yapmış olduğu turneyi bize olabildiğince sıcak bir biçimde anlatan bir yol hikayesi. Green Book, o dönemde siyahi kardeşlerimizin güvenli bir şekilde konaklayabilecekleri otelleri ve yemek yiyebilecekleri restoranları gösteren bir seyahat kitapçığı. Yönetmenin filme neredeyse hiç bir dokunuşunun olmaması, filmin hikayesinin ve senaryosunun sıcaklığını hiç bir şekilde etkilememiş gibi. Mahershala Ali'nin devleştiği filmde içinde bulunulan dönem bize olabildiğince yansıtılmaya çalışılmış. Kısacası Green Book, çok fazla yönetmen etkisi olmayan ama izlenmeye değer oldukça eğlenceli bir hikaye filmi."}, {"rating": "8", "text": "'Green Book' barrels past some initial hokeyness to take us on a poignant journey through the deep south ... and into the heart of America's persistent deficiency in overcoming racial inequality.Mahershala Ali and Viggo Mortensen both disappear into their roles as only actors of their caliber can, making every scene so captivating that the movie's 130-minute run time feels half as long.  There's plenty of contemplation and outrage to go around.  However, it's the genuine laughs that truly round out the film, providing a full range of delightful (and sometimes dizzying) emotions that quickly come and pass like mile markers on the side of a highway."}, {"rating": "8", "text": "“The Green Book” derives its name from The Negro Motorist Green Book, an annual publication from 1936-1966 designed to help people traveling while black to find friendly lodging, restaurants and gas stations and to keep from running afoul of a variety of arcane local laws (if you’re interested, learn about “sunset towns”).In 1962, Dr. Don Shirley, a classically trained pianist, left his opulent apartment above Carnegie Hall in NYC to tour the Midwest and Deep South.  The record company sponsoring his tour had the good sense to hire a driver/bodyguard/valet to help him navigate the perils of the South in the period just before the Civil Rights Act.  Tony (Lip) Vallelonga was hired for those roles and worked with Shirley during his two-month tour.  The challenges faced and overcome by Shirley are entirely predictable – overt racism, harassing cops, etc.  But “The Green Book” is not intended to be a history lesson.  It’s a story about enduring friendship.As the two lead characters, Mahershala Ali (House of Cards, Oscar for Moonlight in 2016, a can’t-wait upcoming role in True Detective, Season 3) and Viggo Mortensen (Lord of the Rings series, A History of Violence, Eastern Promises) perform a series of memorable duets.  Unable to rely on his Danish-American heritage for this role, Mortensen (Tony) adopts a Bronx accent that would fit right in on The Sopranos.  This makes perfect sense, given that the real Tony Lip had a recurring role in the series.  (Regrettably, for all his talking, our Tony never lets loose with “Ba-Da-Boom, Ba-Da-Bing.”)  His rough-and-tumble, street-smart approach to the world stands in stark contrast to the well-educated Dr. Shirley (Ali), who struggles mightily because he is neither black enough not white enough to fit in anywhere.  Dr. Shirley’s struggles to teach Tony diction, manners and Oxford English (Oxford, England, not Oxford, Mississippi) are highlights of the film.What drives the narrative, though, is the bond built between the two men.  Tony is in awe of Dr. Shirley’s regal bearing and erudition (Shirley earned a doctorate in Music, Psychology and Liturgical Arts).  Shirley, in turn, sees Tony’s good heart and envies the passion and wonder through which he views the world.  Spying a road sign announcing a KFC up the road, Tony enthuses, “Kentucky Fried Chicken in Kentucky – when’s that gunna happen?”  The chemistry between the two is funny, touching and the glue that holds this film together.Director Peter Farrelly (There’s Something about Mary, Dumb and Dumber, Stuck on You) has reined in his slapstick impulses and over-reliance on visual humor.  The result is thoughtful, honest and memorable.“The Green Book” does not offer its audience profound insights into the human condition.  But it does suggest, as Shirley’s character discovers, that occasional human interaction, in small controlled doses, might actually be worthwhile."}, {"rating": "10", "text": "Even if it's similar to other movies, Green Book manages to teach very valuable lessons that you thought you already knew, showing a different point of view, while being incredibly entertaining. I've laughed out loud during many parts of the film, thanks to the charming performaces of the two leading actors (Vigo Mortensen and Mahershala Ali)."}, {"rating": "1", "text": "I don't understand all the fawning here in the user reviews, since those are notoriously always more honest, minus the trolls who often don't even see the film or give it 0's without giving constructive reviews----but I think this is being way overrated and for AA marks as well.  While the 2 leads are indeed outstanding actors and have been in the past, that just doesn't make up for the timid and craven story structure in a time period and place that from what we've viewed before for Academy consideration---Selma, 12 Years a Slave, The Butler, etc.---was just far from a peaceful place where this protagonist only gets roughed up once, and is so cursory a scene related to the \"Odd Couple\" type film, that you don't even notice it, nor trials/tribulations that this character just must've had to endure in that time period. It just doesn't convince me of the true story or reality, nor does the acting in many instances, sadly.  That, and mainstream theaters in this USA are getting to be a crowded pain with new recliner seating that has pushed ticket prices through the roof, and made films just plain hard anymore to get out and see.  Perhaps the DVD will offer more explanations for these obvious shortcomings---just didn't cut it for this viewer, truly hoped it were better, but alas probably mostly because of the direction/production."}, {"rating": "8", "text": "\"Green Book\" is the true story of Dr. Don Shirley, the great classical/jazz pianist and his famous 1960's tour of the deep south accompanied by his driver, Tony Lip Villelonga, as they travel together using the infamous Green Book which served as a guide for African American travelers as to where they could and could not find accommodations in the southern part of our nation. As the book so brutally states in its logo \"avoid aggravation on your vacation\".The film stars Mahershala Ali as Dr. Shirley and Viggo Mortensen as Tony Lip Villelonga. Directed by Peter Farrelly who co-wrote the screenplay with Bruce Currie and Nick Villelonga, this is a warm and deeply moving story of the plight of a talented world class musician who, like most black entertainers in that era, could perform and entertain in the \"white only\" establishments but could neither sleep nor eat there. The film serves as a great reminder of how demeaning and wrong the culture was in all too many parts of our country and how so many of its citizens were robbed of the dignity and rights they were otherwise entitled to have and enjoy. Although Mr. Ali's performance was noteworthy, the true star of the film is Mr. Mortensen who, deviating from his normal \"leading man\" role, portrays the Bronx born and raised Tony Lip Villelonga with sensitivity and caring in spite of, and perhaps maybe because of, his Italian American heritage and upbringing.I give this film an 8.0 rating and suggest that it be seen by all who wish to understand where we were as a nation 56 years ago, where we are now and how far we still have to go."}, {"rating": "8", "text": "The performances of Mortensen and Ali make this movie worth watching. Both actors really bring their characters to life and make this movie a must watch."}, {"rating": "4", "text": "Very vanilla look at racism in America. Rather boring. Don't waste your time seeing it. Watch Spike Lee BlacKkKlansman for the real thing."}, {"rating": "9", "text": "A film that tended to by to glossy on some of its subject matters, but because of the phenomenal chemistry and performances by Viggo and Mahershala you can't help but laugh and cry. Definitely the feel good film of the year. Overall a low 9 an A."}, {"rating": "10", "text": "Easily in the running for Best Picture. The theater was filled with laughing outburst throughout and the audience left with a gleeful buzz. The 3 negative critiques should be banned from the site. 9.75 is my final tally because I'm old enough to remember the racial divide in the 60's and I grew up in one of the southern cities displayed in the movie."}, {"rating": "5", "text": "Meet Frank “Tony Lip” Vallelonga, who back in 1962 was challenged to remain upright alongside greater authority against his will, except that isn’t clear from the shallow focus of Green Book. The real Tony had a marriage much like Clark Gable teaching Claudette Colbert how to hitchhike, but the crunched cinematic events with Tony’s wife, Dolores, move too quickly. Rather, focus falls more on getting to know Tony through travelling musician Don “Doc” Shirley, whom he drives across the country as his personal chauffer.While Tony takes on a stereotype reversal against his Italian blood, Dr. Shirley goes against Black stereotypes by his consistent calmness. Plus, the thinner Black companion writes better than the pudgy Italian, who is more familiar with Black musicians than the Black man is. By that retrospective, the Italian is internally Black, and the African is internally White. While Dr. Shirley loathes the prejudice of his new friend, he asks what defines “Blackness,” which turns out quite effective for us viewers to hear. So henceforth, dumb and smarter progress on a journey full of Kentucky Fried Chicken while everyone back at Tony’s home eats clams on spaghetti, all where you ache to see the resolution.Between each person, both from the ensemble and two leads, the details guarantee chuckles. One of those humorous touches that fuel the teal Cadillac toward its warm finale includes when Tony folds an entire pizza in half, then chomps down onto it, big. Even if counting the more dramatic moments, small moments put you on its side. These moments kick off instantly with a performance of, “That Old Black Magic” to open the feature, and the momentum of this small moment collection continues without halt.Yet here’s the problem with this well-meaning story structure: no big moment ties any reasonable story arcs together. From the main arc of Tony left in his own little universe, it just makes everybody else impossible to connect with, especially Dolores, who never succeeds to teach her husband anything valuable. While Don has the advantage of flaunting way more screen time, he’s no easier to relate to since he almost matches Jesus-levels of moral perfection, even though he’s clearly not. Case in point: this “king of the jungle” keeps ivory tusks as trophies, suggesting an engagement in illegal animal poaching.It’s particularly weird how this film aims for a PG-13 rating; there’s no reason for it to do so, for its lack of inappropriate content doesn’t mean teenagers will overlook the cheap production values. They’re still used to watching televised recreations of their own drama; most of them aren’t ready for a story like this. As for the parents, the moms won’t take such a boring character like Dolores seriously, since her makeup in bed after waking up still looks perfect! Many dads also won’t relate to Tony’s type of masculinity very well—one that always has a cigarette in his mouth of missorted life priorities. His pompous ego that shines through the symbolism of a stolen jade rock supposedly gets a change of heart once he listens to Don Shirley’s traveling band, except that impact is not felt from the audience’s perspective; the band in truth is about the same amount of fun to listen to as any old street musician.Many other missed opportunities prevent this picture’s intentional importance from resonating long term. Throughout his travels, Tony writes down that he is basking in the beauty of the US south… beauty that by the way seldom reveals itself to us viewers, as the image often lets a map visual take up space. It’s not just stylistic inconsistency that’s the problem, other glossed-over narrative points are missed to their advantage, particularly one hot dog eating contest. Among numerous incomplete philosophies that just fill up page space without a payoff later, one said by Tony includes, “whatever you do, do it 100%.” Pretty deep, ain’t it?At the end of the day, most of the characters in this feature just act racist without justification as they themselves become offensive caricatures, such as one White manager at a theater who refuses to clean a piano for Dr. Shirley’s performance. This overall attitude loses the impact upon Tony’s sin as racial connections overbear the focus in a way that feels manipulative rather than personal. Such shame-filled preaching lacks subtlety, particularly in a poorly executed scene when the Cadillac car breaks down beside the glares of Black field workers, a scene that served no real plot purpose.At this point, a boy taking out his anger through an imaginary tree monster would be better to watch than the skimmed long-stretching beauty of Green Book. I believe Mr. Vallelonga’s story might have been better if Participant Media focused more time on his home within the Bronx, that way we could see how Tony’s unemployment affected others around him."}, {"rating": "6", "text": "To a certain extent I don't think this film is a disappointment but I do think that maybe it has achieved an undeserved appreciation.I say this because Green Book is a film that cannot help feeling shallow and condescending.It's very predictable and that inevitably affects it way too much and the way it tries to sweeten up the narrative in a subject that shouldn't be treated in this way, it clearly ends up affecting the general functioning because it's unable to make what you're seeing feel more real despite being based on a true story.It's not a bad film but definitely its strengths are Mahershala Ali and Viggo Mortensen, not the rest."}, {"rating": "10", "text": "All I need to know about film critics is that the putrid The Favourite rates a 94 and Green Book a 70. Green Book is one of the best movies I have seen this decade. It is funny, dramatic, relevant, touching, and is the rare picture that leaves you feeling good as you leave the theatre. I don't agree with the \"white saviour\" criticism from artsies, and I am a liberal. The leads are absolutely stellar and the Oscar was deserved."}, {"rating": "3", "text": "“The world's full of lonely people afraid to make the first move.”Green Book checks all the boxes of an Oscar bait movie: period setting (1960’s), based on a true story (but maybe not that true), respected/award winning actors (Viggo Mortensen and Mahershala Ali), a name director (Peter Farrelly), deals with race (segregation in the American South), characters from different backgrounds learning from and about each other (but they’re so different!). Specifically,Green Book is about the friendship that arises between Tony Vallelonga, a white nightclub bouncer from the Bronx, and Dr. Don Shirley, a black classical pianist from Midtown Manhattan, when Tony becomes Don’s driver and bodyguard on a tour through the Jim Crow South in the 1960’s. Their friendship could make an interesting story but the approach taken by co-screenwriter Nick Vallelonga (Tony’s real-life son) and director Peter Farrelly is so familiar as to be dull beyond belief.Tony Vallelonga, or Tony “Lip” to his friends, is played by Viggo Mortensen in what is without a doubt his showiest performance. Typically, his performances are so subtle and without ostentatiousness (even when he is playing a Russian gangster or the devil), that he disappears into his character and never draws attention to himself. This is not the case with this working class, unsophisticated, loud, tough guy bigot. Mortensen hits every note required by his role; there’s just not a lot to his character. Still, in the tradition of nominating great actors for their most mediocre roles, the Academy has nominated Mortensen for Best Actor.The same goes for Mahershala Ali as Dr. Don Shirley. There should be a lot for his character to work with: being an educated, sophisticated, and successful black musician playing high profile venues and exclusive parties in the Jim Crow South. He is ostensibly the guest of honor at the private parties of wealthy high society people but they will not let him use their bathroom. He should be the lead character and we should feel his inner struggles and emotions beyond him just trying to remain dignified. Instead, Dr. Shirley is a reserved, private, and lonely person which is a pretty good excuse for a white screenwriter to not have to get into the head of a black character. All that is required of Don Shirley is to be serious, refined, dignified, and, most of all, be unamused by Tony’s shenanigans. Ali won the Best Supporting Actor Oscar for his role in Moonlight, and he is nominated for Supporting Actor again, but, as with Viggo, this is nowhere near his best work. Ali delivers what his underwritten role requires, but having an actor like him play this part is like having his character play chopsticks.Green Book gets its title from the real-life travel guide published for black motorists during segregation so they could find a restaurant, gas station, or hotel that would accept them without trouble. This book is barely used in the movie. You would expect it to play a larger part since it is what the movie is named after. Green Book presents itself as a story about race and class, but really it is a mismatched buddy road trip movie. The problem is that is not good at being either. Will the laid back, sloppy guy and the serious, neat guy drive each other crazy? I'll admit I laughed at some of the gags and jokes, but the punchlines are not original.Mortensen and Ali work well together but there’s not enough to make their characters or their relationship feel like something you haven’t seen a dozen times before in other movies that deal with race and friendship. This is a just a recital not trying to be anything new. By the time Tony and Don are racing back to New York to make it home in time for Christmas dinner I had gone giddy from an overdose of clichés. Will Green Book make you feel good and provide two hours of inoffensive, unchallenging entertainment? Maybe, but when you can predict every beat and every scene what’s the point of watching? There are high quality actors, costumes, and production design but ultimately Green Book is nothing more than a big budget Hallmark Channel Hall of Fame movie."}, {"rating": "0", "text": "This movie is poison. Its main problem is while its story deadens your soul, you feel good watching, because Mahershala Ali and Viggo Mortensen have such electric chemistry. As Wife puts it, the film posits that racism is something that an eight week road trip can resolve.The geographic chronology of this film suggests that the country becomes more racist the farther south you go, when what is clear to anyone in the know, is that racist institutions exist in large and subtle ways in every corner of the country. Wife says that Dr Shirley addresses that point after the bar scene when he asks Tony if it would’ve gone any different at a bar in his neighborhood in New York, but it’s clear that otherwise confusingly banal scenes of #notallwhitecops helping Tony and Shirley on their ride home in the snow are meant to signal something unnecessary and facile about the forces of inclusion and progressivism in the country. Seth Stephens-Davidowitz’s book Everybody Lies talks about how Big Data show racial animosity is not a North-South divide so much as an East-West of the Mississippi divide (if memory serves).There’s a fair bit of soap-boxing, self-congratulatory progressive liberalism, back-dated to 1962–what Wife called the “simpering” morality of one of Dr Shirley’s musician friends who eulogizes his “bravery”. The deepest the two ever get in discussing racial politics is during a fight toward the end of the film, when Tony accuses Shirley of not being black enough, which triggers a powerful cut scene back to the trailer that brought audiences in the first place, but doesn’t push the ball much further down the field. Dr Shirley calls Tony a moron again and they wisely agree to disagree, rather than dragging themselves into a nasty discussion about institutional racism and white privilege. There are a lot of straw man arguments that the script, in part written by family of the protagonists, sets up to avoid any real reckoning with racism, and they’ve been more thoughtfully lampooned everywhere months ago.Most interesting thing I thought Wife said about this film was that it was missing a Winter Sequence. There weren’t really any stakes to the film, no conflict to prompt action, change, or growth from our main characters. The lack of a winter sequence is what makes the film a feel-good film, but that also sucks the air out of the script and makes it feel a little brain dead.Every good actor is allotted a certain number of bad movies. There’s nothing wrong with this story being told, necessarily. It’s just not that it’s an especially insightful or needed story and it might actually be kind of actively hostile to the goals it seems like it’s striving towards."}, {"rating": "9", "text": "Did I feel a little manipulated after watching Green Book?  Yes.  So what.  Nothing wrong with making a movie that makes you feel good about race relations.  A refreshing role reversal taking place in 1962 where the African American is the educated, sophisticated person teaching the prejudice bully from the Bronx about life (and vice versa in some cases).  Although they run into the usual cliched circumstances while touring the South, the movie is basically about two opposites who become friends and learn from each other.  A lot of humor along the way and terrific performances all around, especially from both leads."}, {"rating": "8", "text": "A treat!I was very hesitant about going to see \"Green Book\" starting with it being directed by Peter Farrelly who was known for such 'low' films as \"Dumb and Dumber\" and \"There's Something About Mary\" which dealt with obscene language and scenes though big hits. It also sounded to me like a takeoff of \"Driving Miss Daisy\" only with a white driver and a black passenger which would probably be 'Hollywoodized\" and \"the Odd Couple\" thrown in as the arc of the movie and it is..I went only because I am a long time fan of Viggo Mortensen and was impressed with Mahershala Ali in \"Moonlight\". I expected to see a so-so film with good performances and we certainly saw the latter but it won me over showing the Carnegie Hall apartments, though I never did see one like Ali had. Also the scenes supposedly filmed in the Bronx was not a Bronx I was raised in but all of a sudden I was laughing and then being touched and going through layers of emotions.Yes Viggo Mortensen as Tony Vallelonga and Mahershala Ali as Dr. Don Shirley are cliches in many scenes but they are both such good actors you believe what they are saying and doing not to forget the touch of family that Linda Cardellini as Tony's wife brings to an Italian Bronx thug who does love his wife and 2 sons, along with other family members.Based on a true story I must admit I had never heard of Dr. Don Shirley but his story of being a black entertainer who is going to travel through the south in 1962 it is reasonable that he would hire a Tony 'type' to be his chauffer and, in a sense, protector. A lot of cliches are nothing more than stereotypes and much what we see and hear of Shirley and Vallelonga sound and seem familiar which is sad because we aren't surprised.\"Green Book\" is being sold as 'a true story of a friendship' and it is just that with many laughs and tears supplied by two brilliant actors who bring more to the script than the script brings to them. There are a couple of scenes that took me by surprise which if talked about would mean spoilers and should be discovered on their own but one question I would love if anyone knows if  Mahershala does his own piano playing or is it Hollywood magic?Both \"Green Book\" and \"The Hate U Give\" are two of the best films I have seen this autumn and though both deal with race they are completely different and also have leading performances that should get nominations , if not actual wins, for their performances."}, {"rating": "9", "text": "\"Green Book\" is simply a fantastic film. It takes on many important themes through a simple, lovely story, and layers them with so much moral. It has some very funny bits and lines of humor, but it also has several tender, even heart-warming, some heart-breaking moments. The writing is deft, and the characters are extremely lovable, audiences will sure find themselves bonding with them as they bond with each as the story progresses. The chemistry between Viggo Mortensen and Mahershala Ali is so natural, and the performances from the two are just excellent. This is a very neat, masterful film-making."}, {"rating": "7", "text": "Green book prepares soil using tactile sense of friendship as in Mean Streets and GoodFellas, roading genre of Vanishing Point (without that action), but fails in turns protagonist almost a neanderthal and wanting makes the racism entering in first plain without looks small, when happens precisely opposite."}, {"rating": "7", "text": "A Star Is Born made me cry at the end, this made me smile hugely. This is a real crowd-pleaser I'm sure. I wouldn't give it Best Picture myself. Oscar bait in every sense though, and sometimes it felt like that was the calculated purpose behind the story. Preferred it to BlackkKlansman too. But neverthless, a great film."}, {"rating": "10", "text": "Best wide release movie of the year.  Great acting, directing, cinematography. Has it all.  How a movie like the favorite ends up with a Metacritic rating of 90, and this a 70, it is difficult to fathom."}, {"rating": "10", "text": "Based on the real life events of Don Shirley (Mahershala Ali) the world-class African-American pianist about to go on tour in the Deep South. He hires Italian-American bouncer Tony Lip (Viggo Mortensen) to drive him and deal with any issues that may arise. Together they put aside their differences and form an unlikely friendship.It may be set in the 1960s but it's still very relevant today and although Green Book feels the need to drive home this point a little too often it's a terrific film. Viggo really has found his inner Joe Pesci for this role and plays it to perfection. The story is well written and well paced but what makes Green Book so good is the chemistry between Viggo and Mahershala. It finds the balance between drama and humour, a crowd-pleaser that seems to be accurate for the most part. No matter how true a film claims to be it will never be completely accurate, so just sit back and enjoy this unique story with a superb cast giving it their all. Can we also just take a moment to appreciate the composer Kris Bowers who worked as a body double for Mahershala's piano performances and transcribed Don Shirley's music by ear to use in the film. It's mesmerising and Green Book would not have happened without that level of dedication. I loved this film, you'll love this film, go see Green Book, you won't be disappointed. Highly recommended."}, {"rating": "10", "text": "No me lo esperaba, pero Green Book me sorprendió mas de lo que pude imaginar ya que cuando vi que había ganado el galardón a Mejor Película estaba muy escéptico ya que mi mirada estaba puesta en otra película, pero en fin, ahora digo que su victoria fue inmensamente merecida, no sólo por la historia y los temas que trata con tanta elocuencia como lo es el racismo sino por las impecables actuaciones de la dupla protagónica que entre sí generan un sin fin de contrastes y emociones que te hace quererlos mucho desde el principio hasta el final."}, {"rating": "8", "text": "Two of the year's most engaging performances lead this biopic about clashing personalities coming to understand each through intimate conversations and sincere empathy. Green Book made me laugh as it made me reflect about the society its era, a time where empathy and culture were defined by shallow preconceptions about each other."}, {"rating": "8", "text": "Director Peter Farrelly is certainly best known for his big-hearted, light comedies; from Dumb and Dumber to There’s Something About Mary, Farrelly has shown himself to be a sure hand at the genre. His new film, Green Book, employs much of the same warm comedy, but along with a far more dramatic narrative.Green Book is the (though now debatably) true story of Italian-American bar bruiser, Tony “Lip” Vallelonga (Viggo Mortensen), who finds work as a driver for a renowned black pianist, Dr Don Shirley (Mahershala Ali) as he embarks on a concert tour across the Deep South. The film explores the growing friendship of the two men against the ugly backdrop of segregated America.There is plenty of fun to be had in Green Book; as expected of Farrelly, there’s an effortless charm to the film, supported by belly-laughing humour and spirited characters. The script is occasionally a little clunky, but what truly ensures the success of Green Book is its performances (both Oscar noms). Viggo Mortensen leads as Tony, a big-mouthed big eater, impressively humorous but also adding an emotive touch to a role that could have easily seemed like a caricature. There’s a huge heart to Mortensen’s lively performance that is somewhat captivating. This is played off nicely by Mahershala Ali, on usual expert form as Dr Shirley. Ali’s composure and poise lend his performance this quiet gravitas that seems to find its true culmination in the film’s most powerful scene, as Tony and Don argue in the rain as two minorities unaccepted in 1960s America. It seems a shame, however, that the aforementioned scene is the closest that Green Book gets to really addressing its subject. The racial themes of the film are swiftly glossed over for the most part, even from the beginning where we see an apparently prejudiced Tony dispose of the drinking glasses of two black workmen, only to be seen happily kneeling on the ground playing dice with a group of African Americans some twenty minutes later. The film doesn’t just discuss race; class and sexuality are also lingering themes, but both feel all too briefly mentioned. There are certain scenes that do tackle the issues head on and I loved those moments, but much of the film is coated in a layer of sentimentality that, certainly by the third act, becomes almost sugary.That being said, however, I loved the warmer and lighter points of the film as much as I loved the more dramatic. Though helped certainly by the brilliant performances, Green Book’s sentimentality doesn’t stop it from being voraciously watchable. The final act drags, suitably like a car with a flat tyre, but otherwise the film is infectiously entertaining, bringing across its narrative in the most accessible way. In the end, perhaps Green Book isn’t intended to be a gritty account on race relations; though there is more opportunity for nuanced drama, it feels far more like a feel-good crowd-pleaser.In the end, Green Book may be a little simplistic in approach for more cultivated audiences, but it remains a thoroughly entertaining romp, made successful by two standout performances."}, {"rating": "1", "text": "Great idea, bad execution.Just another predicted movie from the us.The real story really touched me and that's the only reason to give this movie 1/100"}, {"rating": "8", "text": "The old adage “Walk a mile in someone else’s shoes” takes a whole new meaning with this delightful film. It also proves another proverb true, “To really know someone, travel with them.” I almost didn’t recognize my beloved Viggo, previously cemented as Aragorn in a classic trilogy. But his depiction of Tony Vallelonga in this movie is really memorable, he slides into the role with the same ease as he digs into a bowl of homemade pasta and meatballs. A worldly wisdom, a straightforward honesty, and a strong moral code of a man who grew up in rough streets. Swift with the blunt fists and the sharp words alike. Mahershala Ali as Shirley was also really well played, a man truly lost between worlds, belonging to none, with a blistering genius that only increases his isolation. One truly feels sorry for his self deprecating analysis as a puppet on strings, an erudite carnival showman, a bizarre exhibit surrounded by racism. The lovely message of this movie is the ability of these two men to learn from each other, to embrace each other’s world views, and in the end to valiantly rise in friendship and mutual respect. We could all learn from their journey, especially to never underestimate the knowledge and wisdom we can share to become better people.As with any period piece I adored the authentic reproduction of a bygone ‘simpler’ age steeped in dark racism and hate. The nostalgia of the past is a dangerous thing when it whitewashes what really happened in sundown towns and plantations, even after the civil war. The Green Book is as insidious a piece of literature as Mein Kampf, born from the same cauldron of hate."}], "recommendations": ["hidden_figures", "the_help", "judas_and_the_black_messiah", "belfast", "42", "the_white_tiger", "race", "the_hate_u_give", "captain_fantastic", "12_years_a_slave", "legends_of_the_fall", "ingrid_goes_west", "20th_century_women", "the_glass_castle", "fighting_with_my_family", "bombshell", "the_last_king_of_scotland", "blackkklansman", "the_danish_girl", "the_best_exotic_marigold_hotel", "minari", "nomadland", "american_beauty", "the_big_sick", "the_imitation_game"]}