{
  "id": 1037,
  "title": "Greenland",
  "starring": [
    "Gerard Butler",
    "Morena Baccarin"
  ],
  "runtime": 120,
  "genre": [
    "Action",
    "Thriller",
    "Drama"
  ],
  "description": "John Garrity, his estranged wife and their young son embark on a perilous journey to find sanctuary as a planet-killing comet hurtles toward Earth. Amid terrifying accounts of cities getting levelled, the Garritys experience the best and worst in humanity. As the countdown to the global apocalypse approaches zero, their incredible trek culminates in a desperate and last-minute flight to a possible safe haven.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bNo2mcvSwIvnx8K6y1euAc1TLVq.jpg",
  "categories": {
    "plot": 4.142857142857143,
    "acting": 3.217391304347826,
    "ending": 4.0,
    "soundtrack": 2.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 1.0,
    "action": 6.461538461538462
  },
  "reviews": [
    {
      "rating": "6",
      "text": "\"Greenland\" isn't about comets hitting Earth, it's about the Garrity family surviving this crisis by staying together. And that character-centric approach is what holds this film together."
    },
    {
      "rating": "9",
      "text": "At first, the film appeared to not be very good - by the title and the fact that it looked like just a copy of 2012. HOWEVER, although very similar, this film is extremely memorable, with its strong cast and, amazing acting and cinematography. I massively recommend this"
    },
    {
      "rating": "10",
      "text": "I Absolutely Friggin Love this movie. I recommend it Very Highly. I've watched it probably 100 times, and I Still Love it. A+++++ for Me."
    },
    {
      "rating": "8",
      "text": "Finally, a disaster movie that's not a disaster. Sure, like all disaster movies, there's plenty of Deus Ex Machina to keep our protagonists safe and sound to the very end, but there's just enough science here to make me think. And disaster movies never make me think, just sigh and roll my eyes.I'd say, as far as big budget disaster movies go, this is the best one of the bunch."
    },
    {
      "rating": "8",
      "text": "John Garrity (Gerard Butler) is a man trying to put his life in order. Despite being a successful structural engineer; he has recently moved back home with his wife Allison (Morena Baccarin), and their son Nathan (Roger Dale Floyd).John and Allison are attempting to rebuild their marriage and despite some awkwardness at first they are moving ahead. In the new film “Greenland” life is about to become far more complicated for the Garrity family in the form of a comet that is set to pass very close to earth.The authorities have told the public there is no cause for concern but John notices a large group of military aircraft in the skies shortly before he receives an automated call from Homeland Security telling him to come to an evacuation location with his wife and son.Not sure what to make of the message; things become abundantly clear when a “harmless fragment” strikes and destroys a city on live television.With panic setting in the Garrity family head to the evacuation site only to face complications which leave them separated and facing many dangers and obstacles as they attempt to reunite and get to safety before the big chunk hits in two days.The film is very engaging and what really stood out for me was how the film relied on the cast versus an array of special effects and action sequences which are so common for films in the disaster genre.Despite the circumstances the characters were very relatable and the tension of the pending impact helped shape their actions instead of being a countdown to an elaborate array of FX sequences showing cities being devastated. While there is footage of this sort; it is generally confined to news reports versus being the focal points.Butler was very strong in a departure from his usual action oriented parts as a father trying to make things right in a world that is falling apart around him. It was also nice to hear him using his natural accent for a change as well.While some may wonder about the timing of releasing a disaster film at the end of 2020 and during the Holiday Season the film is so engaging that it did not matter to me in the slightest.“Greenland” is a film that came in under the radar in terms of hype and expectation but has delivered an enjoyable and memorable viewing experience that is not to be missed. 4 stars out of 5"
    },
    {
      "rating": "7",
      "text": "Very entertaining. You might be put off by the title but don't be. Jump right in."
    },
    {
      "rating": "6",
      "text": "The movie was ok but some of the story seemed a bit dumb, some of it was interesting to see though what would happen in such type scenario. Acting was great, but I don't see why critics praise this movie so high in general. Not bad movie, but nothing incredible"
    },
    {
      "rating": "7",
      "text": "It is a well-done panic movie. I really enjoyed it. A long time ago, someone says \"the dinosaur extinction was due to a meteoroid. \"This might happen again. The plot was good. I like actors. Good movie!"
    },
    {
      "rating": "7",
      "text": "Hey streamers after an exciting weekend of movies, I decided to take it down a notch. I said to myself, \"What can I watch that no one is even thinking about? . . . Hmm . . . Greenland!\" The most forgotten part of the world and now, a movie from December that was once in theaters. Greenland stars our favorite Spartan, Gerard Butler, as John Garrity. We follow John as he and his family fight for survival as Earth is in danger from a surprise dangerous comet. John, his estranged wife, and son travel to what they think will be a sanctuary, as cities across the globe are destroyed. The Garrity's become forced to fight the increasingly dangerous society around them. The countdown begins to utter destruction, but will they make it out? I know sounds intriguing right? Let's see how it turned out.First off, who let King Bach in this movie?! He wasn't even that bad either, for what he did. Ok, back to the real. Greenland is \"le turn up\". I mean yes, this is the exact same movie as every other \"the world is ending\", or some catastrophic thing is killing the earth type of movie, but I feel like watching this particular family added value. For some strange reason, I actually cared what happened to the family and that's a good sign. My boy Gerard wasn't overselling anything and I was buying heavy. I could feel myself in his and his wife's shoes throughout the movie. Yes, I may have left his son behind at some point, but I could understand the fight I would have for my own child and wife. And on top of that, I felt there was a genuine nature to scenes in this film. Particularly, in one scene where Mr. 300 is like, \"We aren't taking your child with us! Are you crazy?!\" (not verbatim) But in reality it wasn't because he didn't want to help, it was because he didn't want to hurt the child further in the end. It's an early scene, but really captures the feel of this movie. Now with that said, again this movie is as basic of a story as you can get. We have the world possibly ending, looters, bandits, good people, bad people... blah blah blah. You really have to look for the character interaction to enjoy this flick. And there's a slight feel of World War Z at one point. That being said, the cast fits well together. What doesn't fit is the CGI at times. You'll see the one fire scene where you're like \"this is the fakest looking fire,\" but yet, you still worry that this character may get burned. Same goes for the comets. The comets looked horrible, but resulting explosion and destruction is great.Quiet as it's kept Greenland would've been pretty good to see on the big screen. Not necessary, but a couple of scenes would've been pretty good on the big screen. As far as end of the world scenarios go, Greenland was a pretty solid depiction and worth a big box of fresh streaming popcorn. And you wouldn't even be mad at yourself with a bowl of popcorn during the matinee in theaters."
    },
    {
      "rating": "10",
      "text": "Okay, I've created an account just for this movie, I'm also Brazilian so sorry for Any English mispronounce. Well I've never made a critic about anything before, I'm going to start by the bad part of it. Well, its pretty cliche (hang on keep reading) its graphics effects are acceptable but not great, at least this is what I noticed during the movie. On the other hand, the movie is unique, mixing aspects thats remind us of movies like the impossible. As I wrote back in the beginning the movie is cliche, but in its own way, the narrative construction is built so well that keeps you hanging on the edge of your sit all the time. The CGI, may not be so great of course but if you are looking for a great experience, such a great dramatic story, you should definitely give it a try."
    },
    {
      "rating": "8",
      "text": "One of the best disaster flicks I’ve seen in a long time. Possibly one of the only good apocalypse movies free of stupid plot holes or corny stuff. Once the action starts it doesn’t let up, and not in a bad over the top kind of way."
    },
    {
      "rating": "7",
      "text": "For me, this is the best disaster movie of all Time, because it feels so real."
    },
    {
      "rating": "10",
      "text": "A good film taken in a newdirection. More about surving the meteor than stopoing it. Heartfelt, good storyline, keeps you interested, good axting. Recommemded"
    },
    {
      "rating": "10",
      "text": "Way better than expected.One of the top disaster movies out there. Good cast, thrilling pace and beliable situations.If you like the genre and you have 2 hours to spare, you'll enjoy this one!"
    },
    {
      "rating": "8",
      "text": "Greenland may not be excellent at anything, but he is good at everything, it is an above average experience in a highly saturated genre that in addition to having its own identity, has a heart."
    },
    {
      "rating": "8",
      "text": "In a well-realized and truly scary scenario, a rouge comet starts to break apart and crash into Earth, raining down city-destroying firestorms and threatening a “planet-killer” event. Gerard Butler and Morena Baccarin set aside their marital estrangement to travel thru an incredible gauntlet of obstacles to save their marriage and son. Every time they overcome one setback, yet another erupts to make their journey even more challenging (while stretching credibility a bit). Director Ric Roman Waugh, who also worked with Butler on Angel Has Fallen (my review), has crafted an even more gripping action film, while ramping up the emotional moments. Add this harrowing disaster and the fallout (literal and physical) and the result is a highly involving sci-fi survival adventure."
    },
    {
      "rating": "7",
      "text": "A better movie than critics suggest. A very interesting and compelling look at Apocalypse-level survival logistics that felt very plausible. And unlike many disaster movies these days it actually delivers a bit on the disaster aspect, it's not all words and obscured glimpses.The family drama admittedly was at best half-backed, but Butler and Baccarin are so charismatic they pulled it off."
    },
    {
      "rating": "2",
      "text": "I can't for the life of me believe such an educated couple have such a dumb clueless babyfied 7 year old boy who acts like a 2 year old girl thanks to clueless mom and the poor day trying to babysit both if them while the mom complains about everything he does while she coddles the boy who can't think for himself to sVave his lufe"
    },
    {
      "rating": "0",
      "text": "Absolutely awful acting, very disjointed storyline with lots of pointless scenes. A monumental waste of 2 hours, would not recommend watching"
    },
    {
      "rating": "1",
      "text": "If you've been spoiled, over years, by an entertainment industry that aims to strip any substance of their movies, the plot, characters and their development, perspectives on our existence in extreme circumstances or any meaningful insight into the relationship of life and death, loss and pain, morals, freedom, love and salvation in the face of existential threats... then you might stand to watch this movie till the end. If you've not yet given up on cinema as an art form, we suggest you avoid going anywhere near this movie, much like this entire production avoided any substance that would even faintly move us in any way, in fact much less than that, it didn't even satisfy our already stripped down expactation of merely decent CGI and grand pictures. We're happy to go into detail on what bothered us the most. As that pertains to every single aspect of the movie, we'll just list them in order of how much they disappointed our hearts, insulted our minds and overall tortured our soul.The plot is overall inconsistent, feels rushed and dumbed down, unrealistic and without any depth, rather the opposite, exaggerated and reductive and with it, reducing the characters and the entire dialogue down to a 10 year old's skillset of writing a (disaster) movie; leaving one to question with how many movies an industry can burry its claim to be an art form and stop putting money where it doesn't add any quality, but put up a facade any idiot can see through. I pray for our cast, as we would spirale into depression upon reading the script and try to build a character from nothing through merely method acting and emotions, which in the end failed miserably and left us unattached and almost in a continously cringy state. Any role next to our main cast (the family) was so shallow, that we could only laugh at the irony of them being killed or never seen again after a minute of being either of use for the plot or for a cheap shot at the darkness of human interaction in crisis.Being rushed through a shallow, colourless story, leaving no room for any depth of character throughout the movie, there was no chance to feel for them. Paired with continous inconsistencies, you're left more annoyed by their hardship than anything else, as they added no quality to human development and of what it means to be human in the time of crisis. (SPOILER)They missed their only chance when Butler killed another man in self defense being left in awe, because the entire scene was so random, the fight started on such an insultingly dumb premis and dialogue and ended on a shot of the only useful side character being killed immediatly after giving Butler the most crucial information out of nowhere.Pertaining to everything else: We are no experts. Our minimum requirement for a movie in general, is not feeling like our life's time was stolen, happy to feel even slightly entertained without having to give up on every standard.We were shocked, reading the reviews of the so called critics. Even if each and every one of them were Gerard Butlers closest friends or better yet, family, we would still say you failed him, by being this dishonest about the movie. We cannot believe how low the bar has fallen even for movies of which we expect close to nothing."
    },
    {
      "rating": "0",
      "text": "The most astounding Hollywood propaganda film. The USSR would be proud. Enjoy."
    },
    {
      "rating": "1",
      "text": "Make no mistake, the environmental apocalypse that you would think is the main focus of the movie is not.  That's third on the list of this movies intention. First, it's values-preachy, cliché family drama with the Dad attempting to atone for his cheating ways, with far too much time spent on predictable and shallow family drama dialogue.  Second, the movie is a woke vehicle filled with contrived, virtue signaling clichés.  Literally every brown skinned person is \"good\" and \"honorable\" and the white folks are nothing but morally corrupt hillbillies.  And then there's the meteors falling that you wish would blow the whole lot of them to hades.  I truly fear that such terrible filmmaking is becoming the new standard, where authentic character development, good dialogue and subtlety that allows the viewer to feel engaged and THINK, are dead.  Instead, audience is treated like morons that need to have thoughtless clichés beaten over their head so they \"get it\". I recently saw \"The Sound of Metal\" and cried because it had been so long since I saw a thoughtful, genuine movie.  More of that please and less of this movies' mindless awfulness."
    },
    {
      "rating": "3",
      "text": "Apocalyptic, end of the world stuff... Yawn!I can take these kinds of movies if they are created and made simply to entertain, and aren't intended to be some moralistic pedantic 'togetherness conquers all' crap...But that's exactly what this film is, one that asks the audience to get invested in characters who are bland and annoying, inside a narrative that (to anyone with even the slightest level of intellect) makes literally no sense.It's par for the course, story-wise....Mass fragment comet predicted to miss Earth instead, at the last moment, is skewed in our direction and predictions come in of an Extinction Level Event (ELE). Main characters (Husband, Wife and 7 year old (Diabetic) Son) are chosen to go to an airforce base for evacuation as husband is a high level civil engineer.However, the son loses his Insulin in the car, forcing Husband to go back for it leaving Wife and Son at the base. But, Son's Diabetes was only very recently diagnosed and prevents wife/son from getting on plane......So, all three are tasked with going to wife's father's house... And from there to Canada to get a plane to Greenland where the military planes are heading...Will they make it? Of course they do, but we have to spend 90+ minutes watching them do it.The film isn't truly terrible, it barrels along at a steady enough pace. The problem is the aforementioned presupposition that everyone in the audience will simply believe the scientific nonsense the film requires them to.Nothing makes sense and, above all, the ending is just ludicrous.Most of the run-time of the film revolves around making sure husband brings along a three month supply of insulin... Thus, if the family come out of the bunker after nine months... Son should have been long dead, but of course he isn't! Also.. Nine(!!) months for the particulates in the atmosphere to dissipate? Nine months after a Nine mile wide chunk of rock hits Western Europe at several thousand miles per hour! Even the grossly stupid must have realised such an impact would have caused a Nuclear Winter that would have lasted decades, if not centuries!"
    },
    {
      "rating": "1",
      "text": "Wow, I hate to slam new movie releases in the midst of a pandemic, but this movie deserves to be slammed. Unsympathetic characters making preposterous decisions to support a reheated plot borrowed from the movie \"2012\". Spoiler alert: The 2128 mile final fight to safety takes place using a Cessna Skycourier with a max range of ~ 1000 miles. The \"1\" point is for a realistic portrayal of how quickly society degrades and we all turn back into savages once we can no longer text each other."
    },
    {
      "rating": "6",
      "text": "Primarily, it's a disaster soap opera and in the first five or ten minutes the entire plot is revealed:  a comet is coming and most of us are probably not going to survive.  All that's left to discover is how many obstacles the screenplay puts between our main characters and safety.  The big surprise?  A Kentucky farmer has no handguns, just one bolt action rifle, to hand his daughter and son-in-law.  Personally, I don't think that's credible.The film is moderately entertaining but lacks innovation and forget about plot twists."
    },
    {
      "rating": "6",
      "text": "I think that the only purpose of this movie is to make you hate human beings and rooting for their extinction"
    },
    {
      "rating": "6",
      "text": "Fiction attached to \"reality\" or \"reality\" attached to fiction? The point is that it has action and Butler, which are practically synonymous."
    },
    {
      "rating": "2",
      "text": "I learned people are **** in real life, don't need to watch more of it in cheap family drama show. Boring, shallow and derivative."
    },
    {
      "rating": "6",
      "text": "Was Okay it did feel like every other disaster movie it didn't really have anything new about it. It wasn't bad just kinda one of those average films that I will probably not watch again. It does feel a little bit like a B movie at times and there are obvious similarities with the movie 2012."
    },
    {
      "rating": "6",
      "text": "(English / Español)English Abstract Director Ric Roman Waugh is said to have made a film that privileges the human scale over showmanship and special effects. Is there any truth to this. But the \"human\" plot falls into a few commonplaces, in the face of a cosmic catastrophe that the US government faces with a secret plan much better planned than its policies against Covid and that constitutes one of the few original elements (and involuntarily ironic) of this film.…………………………………………………………………………………………………………………………………………………………………………English Abstract Director Ric Roman Waugh is said to have made a film that privileges the human scale over showmanship and special effects. Is there any truth to this. But the \"human\" plot falls into a few commonplaces, in the face of a cosmic catastrophe that the US government faces with a secret plan much better planned than its policies against Covid and that constitutes one of the few original elements (and involuntarily ironic) of this film.…………………………………………………………………………………………………………………………………………………………………………English ReviewThe Earth begins to be hit by a series of fragments of a strange comet on a collision course with it. The marriage of John and Allison Garrity (Gerard Butler and Morena Baccarin), who was in the process of separation and their young son Nathan must suddenly undertake an eventful journey to a safe haven.Director Ric Roman Waugh is said to have made a film that privileges the human scale over spectacularity. There is some truth to this, as the film is not lavish in special effects, but they are elegant and effective and the crowd scenes are accomplished. In addition, it has the ability to “fragment” the threat and its effects. The \"human\" plot focuses on a family, unlike other catastrophe films that address a finally convergent choral structure. But he incurs in a few common places, betting on unbreakable family ties, his misunderstandings and reunions, an anticlimactic sentimentality, desperate, violent and / or miserable behaviors of the save oneself who can, enhanced by government secrecy. Many scenes (and perhaps the entire movie) could apply to any global threat. But this time one that also occurs in the heart of the Empire.In this case, the US Government seems to have its secret anti-catastrophe plan much better planned than its policy against Covid, with an elitist and utilitarian approach that constitutes one of the few original (and unintentionally ironic) elements of the film...............................Reseña EspañolLa Tierra comienza a recibir el impacto de una serie de fragmentos de un extraño cometa en curso de colisión con ella. El matrimonio conformado por John y Allison Garrity (Gerard Butler y Morena Baccarin), que estaba en proceso de separación y su pequeño hijo Nathan deben emprender súbitamente un accidentado viaje hacia un refugio seguro.Se dice que el director Ric Roman Waugh ha hecho una película que privilegia la escala humana por sobre la espectacularidad. Hay algo de cierto en esto, ya que la película no es pródiga en efectos especiales, pero son elegantes y efectivos y las escenas de masas están logradas. Además, y a diferencia de Impacto profundo, tiene la habilidad de “fragmentar” la amenaza y sus efectos. La trama “humana” se concentra en una familia, a diferencia de otras películas catástrofe que abordan una estructura coral finalmente convergente. Pero incurre en unos cuántos lugares comunes, apostando a los inquebrantables lazos familiares, a sus desencuentros y reencuentros, a un sentimentalismo anticlimático, a los comportamientos desesperados, violentos y/o miserables del sálvese quien pueda, potenciados por el secretismo gubernamental. Muchas escenas (y acaso la película entera) podrían aplicarse a cualquier amenaza global. Pero esta vez una que también ocurre en el corazón del Imperio.En este caso, el Gobierno de EE. UU. parece tener mucho mejor planificado su plan secreto anti catástrofe que su política frente al Covid, con un criterio elitista y utilitario que constituye uno de los pocos elementos originales (e involuntariamente irónicos) de la película.…………………………………………………………………………………………………………………………………………………."
    },
    {
      "rating": "2",
      "text": "A typical American disaster movie which always ends well. Garbage CGI, too much angels music and drama. Also the acting of the soldiers it's just too much to be real. It's just ****"
    },
    {
      "rating": "6",
      "text": "It’s an adequate, involving enough afternoon watch (faint praise: better than Geostorm) and for those with a certain destructive itch that still needs scratching, this should do the job."
    },
    {
      "rating": "1",
      "text": "Decent plot, but literally every bad person is a bearded white guy with a southern accent, and every good person is non-white. It’s woke from end to end. Maybe the white characters represent the Hollywood sexual predator producers as they see themselves, but clearly they haven’t talked to a normal human in a few years."
    },
    {
      "rating": "5",
      "text": "while it still has the classic disaster movie trope of man has bad relationship with his wife but he has a kid and that serves as his moral compass, bc apparently disaster movie men only have empathy if they have children and failing/failed marriages, but that’s more a complaint abt disaster movies. other than that the movie is a top tier disaster movie."
    },
    {
      "rating": "10",
      "text": "Okay, this is a great on the edge of your seat movie. Even though the end of days is coming, the movie focuses on humans and what they would really do to survive. Will make you think. Can't wait for part two if they make it. Hope they do"
    },
    {
      "rating": "1",
      "text": "Le titre induit un peu en erreur (malgré le sous-titre français ‘le dernier refuge’), car Greenland n’est pas le pays vert… mais le Groenland ! il le deviendra sans doute à la faveur du réchauffement climatique… mais pas tout de suite. Ceci étant posé, Butler et sa famille (et d’autres sélectionnées, triées sur le volet à ce qu’il paraît) doivent se magner le cul pour évacuer vers le Groenland !Le film décrit assez bien la panique, l’urgence et le chaos de la catastrophe catastrophique mais nous sommes néanmoins régulièrement catastrophés devant d’abord un temps d’exposition trop long, puis par une guimauve ridicule et trop présente.Les incohérences et les raccourcis sont aussi beaucoup trop nombreux et un manque de rythme se fait aussi sentir, régulièrement : on baille devant les péripéties et les clichés et franchement le diabète du gamin nous les casse très sévèrement (il parasite les trois quarts du film). En définitive, on finit cette daube en avance rapide, et même là, on a du mal."
    },
    {
      "rating": "4",
      "text": "Generic disaster movie with an annoying family, very predictable, nothing new or original. Avoid, not worth your time."
    },
    {
      "rating": "0",
      "text": "Very bad ending. Poor research. Don’t even understand how the world could have water settle down after over 1200ft of tsunami."
    },
    {
      "rating": "9",
      "text": "What sets this film apart from a lot of disaster movies is how realistic it is. Instead of the film taking place after the aftermath, it takes place a few days before. It shows how so many will just panic and go crazy. Great writing, good Special effects and great acting."
    },
    {
      "rating": "7",
      "text": "I always enjoy natural disaster movies (and Gerard Butler). It was entertaining and stressful enough."
    }
  ]
}