{
  "id": 1872,
  "title": "Gremlins",
  "starring": [
    "Zach Galligan",
    "Phoebe Cates"
  ],
  "runtime": 106,
  "genre": [
    "Fantasy",
    "Horror",
    "Comedy"
  ],
  "description": "When Billy Peltzer is given a strange but adorable pet named Gizmo for Christmas, he inadvertently breaks the three important rules of caring for a Mogwai, and unleashes a horde of mischievous gremlins on a small town.",
  "releaseYear": "1984",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gDSfs0hqAQVJ9jIHbX3AJ3StTVG.jpg",
  "categories": {
    "plot": 7.5,
    "acting": 7.285714285714286,
    "ending": 5.5,
    "soundtrack": 9.0,
    "cinematography": 8.0,
    "familyFriendly": 7.571428571428571,
    "funny": 7.176470588235294,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Comedy and horror prove to be strange bedfellows in this Christmas movie. One that feels like an attack on the commercialism of the holiday, among other things. The humor is juvenile, but violence is gruesome. There are some surprisingly brutal deaths. It makes for a movie that almost misses any kind of audience. The jokes are a little too silly and rambunctious for a lot of adults, and it might just be a little too dark for youngsters. Especially when one character gives her shockingly macabre reason for hating Christmas.I do believe there is a certain age range where this movie would provide a perfect first foray into the horror genre as it's just lighthearted and goofy enough, while packing a surprising bite, to prepare newcomers for the bigger and badder scary films out there, without subjecting them to too much too soon. It can build up an appreciation for horror movies without giving them more than they can handle at a early age. Don't ask me what that age range is though, as I'm not quite sure myself. Perhaps early tweens?Despite it's odd amalgam of qualities, Gremlins apparently struck a chord with so many regardless as it's something a pop-culture hit. Admittedly, I found it to be quite entertaining myself. Certain qualities such as the incredibly memorable \"Gizmo,\" helped it succeed. I still can't say that all of the elements came together perfectly, but they came together well enough to make for a likable film and a delightfully odd choice for the holidays. I just wish it had been more concise in tone. It jumps from childishly silly to serious and savage without much connective tissue in between to make for less jarring transitions."
    },
    {
      "rating": "9",
      "text": "Nice practical effects, cute little Gizmo and a very interesting plot make for a Christmas movie that can match up to the likes of Die Hard. . . . . . . ."
    },
    {
      "rating": "10",
      "text": "Gremlins is a classic 80`s movie With a mix between comedy and terror,Your story is well told and very fun,Gizmo is one of the cutest characters in the cinema,This movie was part of the childhood of many people."
    },
    {
      "rating": "10",
      "text": "Gremlins (1984)Sinopsis:Una población pintoresca se transforma en un lugar terrorífico tras la llegada de una criatura algo inusual.Sinopsis:Un clásico indiscutible tanto del cine como de la cultura pop en general siendo el adorable Gizmo uno de los personajes más icónicos de la historia del cine. La última vez que vi esta película fue hace muchísimos años y no la recordaba, supuestamente es una comedia de horror pero en lo personal no tiene nada de terror, hasta me atrevo a decir que fácilmente es una película familiar teniendo a Steven Spielberg como productor y la ambientación navideña le ayuda bastante.Sencillamente me encanta y pese a la edad que tiene ha envejecido muy bien, lo único que importa aquí son los lindos y rebeldes gremlins, punto.Valoración:5 ⭐ de 5 ⭐"
    },
    {
      "rating": "3",
      "text": "Sans doute assez novateur à son époque pour son mélange de comédie et de (petit) film horrifique, Gremlins étonne encore aujourd'hui par l'animation de ses marionnettes et quelques scènes rigolotes avec tous ses **** gnomes agités qui fument comme des pompiers et se bourrent la gueule, entre autres bêtises...Le film hélas peine à démarrer comme cette \"saloperie de voiture étrangère\" et ne se réveille qu'au bout d'une heure seulement ; en outre ses gags sont souvent poussifs et le côté cracra des nabots verdâtres risquent de faire peur à nos nains à nous, trop habitués aux gentilles gogoleries de Disney.Le film a donc mal vieilli, non pas par sa technique mais par sa mollesse et son humour facile, trop adulescent pour convaincre, déjà en son temps. Alors, pour conclure, n'emmenez pas le gremlin au macdo après minuit : il deviendrait un yéti ou pire encore... on aurait des Hanouna partout !"
    },
    {
      "rating": "8",
      "text": "Gremlins is an interesting, creepy, funny, and fascinating film. It really makes me laugh and smile."
    },
    {
      "rating": "6",
      "text": "The film is visually beautiful (thanks to the direction of Joe Dante) and starts very well as long as it maintains the horror tone. In the second half it ends up in the grotesque losing some of its purpose, namely that of being a horror film. It remains an enjoyable movie tough not a great one."
    },
    {
      "rating": "9",
      "text": "Very entertaining movie with a good humour of the green gremlins overtaking a village and just have fun in their minds. But the cute gizmo is the star of the movie, for example when he is talking. Even today you can watch this movie, because the story is fun. But on the other side there are some horror elements also and both of them are working here (even for me, who doesnt like horror)."
    },
    {
      "rating": "9",
      "text": "I will admit some of it is very silly, but all the same it is infectious fun from start to finish. Directed by Joe Dante, produced by Steven Spielburg and written by Chris Columbus, Gremlins has quickly established itself in my opinion as a comedy horror classic. The direction is rock solid throughout, and is super efficient. The script is funny and inventive, and the story growing from a very simple idea is engaging and delightful. Plus all the characters are credible. And I have to say Jerry Goldsmith's music is a treat, that man knows how to compose a good music score I can tell you. Haunting, shocking and exciting are three ways to describe the score here. The gremlins are the scene stealers here, at first they are very cute then all of a sudden when they start causing carnage they are quite the opposite. But the acting from the human actors is just as good. Zach Galligan is bland at first, but as the film gets going and you know more of his character you warm to him. Hoyt Axton is indeed a hoot as the inept inventor, and Keye Luke is great as the Grandfather(Mr Wing). Also watch out for a young Corey Feldman as Pete Fountaine. Plus the Christmas speech makes it essential Christmas viewing. All in all, silly it is, but it is clever and consistently engaging. Not only that, it succeeds at both comedy and horror, and that isn't easy to do. 9/10 Bethany Cox"
    },
    {
      "rating": "6",
      "text": "Somewhere between horror, comedy, and a Christmas movie, Gremlins has a little something for everyone. Doesn't hold up quite as well now as it did when I was 7, but Gizmo is still adorable and the \"bad\" gremlins are still kind of scary. The problem with this one is that it feels like a kid's movie that is too dark for kids and maybe a little too formulaic for adults."
    },
    {
      "rating": "5",
      "text": "Obviously, very interesting film. It's like a movie version of an old sci-fi short story, even the setting and mood seem very unreal like what our imaginations would create when reading such a story. Or a kind of high budget (for the time) B-movie. Some of the scenes are great. I also have a lot of respect for those behind the mogwai and gremlins, they are all distinct and believable as if they were real. That said, the film has some serious downsides. First, way too much screen time is spent on the gremlins. Yes, that is the name of the film, but it just feels like them wrecking havoc goes on forever and I just keep wanting it to end but it doesn't. The gremlins were not interesting or scary, they're just like weird lizard creatures. I wish more time had been spent with Gizmo and the other mogwai before the latter transformed. The human characters were too underdeveloped, they really don't have that many lines overall when you consider the whole film. The city they were in had almost no other people in it most of the time. It bugged me that Gizmo was stored in some random old box in the Chinese trinket shop and also people just casually accepting Gizmo as if it were a normal everyday living thing everyone knows about. Having people seem more shocked by it would have made more sense. Negatives aside, it's a classic and I recommend watching it if you haven't."
    },
    {
      "rating": "4",
      "text": "more commercial than it accounts for..Gremlins Gremlins is a plot driven fictional horror about a metaphorical pet that ensues chaos as it gets loose in a town on a Christmas Evening. Despite of being a feature primarily for kids, it can be a bit smarter and even brimmed with horrors for it to be what it is, but it also can annoyingly pathetic even for its younger audience. The human characters are one dimensional than the creatures projected in here. Gremlins gets more runtime than any of them here and unfortunately they aren't appropriately depicted, neither are written with conviction nor is the art designing or animation to the point. Some visual effects have gotten it right but it should be mandatory considering the premise that utterly relies upon it. All the side tracks and sub-plots attempts to offer some gravitas to the tale and keep it grounded but it fails miserably on it due to the chalky writing that is at best null to the core debate of the feature. As mentioned earlier, it is short on visuals effects, cinematography, background score, sound department, which gets more and more annoying as it ages on screen, and editing. The performance objective too, isn't fulfilled as anticipated where only the protagonist's father is bang on his bucks as he is flat out hilarious with his sketchy tools. Chugging down the unfathomable mischief in around 100 minutes, it overstays its welcome especially in its last act. The screenplay by Columbus has a heart but is misplaced whilst Dante's execution too isn't appreciative enough to breed either the sincerity or the crisp of it. Few hilarious gags and creativeness on the the creature are the only high points of this lost feature. Gremlins is more commercial than it accounts for and also misuses its makers name into luring in the audience for there is very little Spielberg-ness to explore in it or even craft for the matter."
    },
    {
      "rating": "5",
      "text": "\"Gremlins\" is a film that marked the imagination of the youth of the eighties and nineties. In this film, the young Billy (Zach Galligan) bought a strange creature, apparently Eastern and property of an old Chinese, who warned him to the grave danger that could come if the creature, Gizmo, was not treated properly. The young man didn't understand the message: unable to see that Gizmo wasn't a toy or a pet, he did everything he couldn't and eventually gave rise to a plague of wild monsters, the Gremlins, capable of causing chaos and destruction wherever they go.Directed by Joe Dante, the script was done by Chris Columbus, a producer who specializes himself in teen films ( \"The Goonies\" or the early films of \"Harry Potter\" franchise) or containing relevant and pedagogical messages (\"Bicentennial Man\", \"Jingle All the Way\", \"the Help\" etc.) and with the participation of Steven Spielberg as executive producer, something who helped to sell the film. After all, at that time, he was the most famous among the film's producers.This film is usually classified as a horror comedy but I don't see it from that perspective. For me, it's an educational comedy, a film that uses comedy and soft-horror to teach an important message that we can consider almost ecological: certain things, in particular animals, should be treated with respect and care, because the consequences that can come from our negligence are rarely good. It's a family film, dedicated to young people but that will easily please the adult audience."
    },
    {
      "rating": "10",
      "text": "Literally the best movie ever made hands down. Absolute perfection. The perfect blend of horror and comedy. Oh, and remember, if your air conditioner goes on the fritz, or your washing machine blows up, or your video recorder conks out, before you call the repairman, turn on all the lights, check all the closets and cupboards, look under all the beds, 'cause you never can tell. There just might be a gremlin in your house."
    },
    {
      "rating": "7",
      "text": "Horror mixed in with comedy with proven points on why one should follow the rules. There are some gruesome scenes however the comical reactions from the characters makes them seem less. This movie will teach some lessons why putting a smile on your face. This is still one of my favorite movies to this day."
    },
    {
      "rating": "5",
      "text": "Another example of an 80s movie that comes with way more hype than substance. Most of the people that hype this movie up seem to forget that they were about seven when they first saw it and, as an adult seeing it for the first time, it’s pretty annoying. Maybe as an adult watching the film again, after having seen it at a younger age, it gives you nostalgia for the film, but saying it “holds up” as an adult is purely a misnomer. The movie starts, and carries on with, sitcom-level acting that allows just enough stupidity to necessitate story progression and just enough ingenuity and luck to allow the protagonist to solve their problem. That sounds like a subpar movie to me. Maybe at seven years old I would have been amazed and then be able to justify that amazement at an older age, but that amazement isn’t there for me and I’m not going to fake it because the fans of this movie can’t handle their favorite movies not being universally recognized as classics."
    },
    {
      "rating": "8",
      "text": "Gremlins is a comedy, horror fantasy film made in 1984, the same year as great films such as Beverly Hills Cop, The Terminator and Ghostbusters were made. Gremlins spawned only one sequel but it was great and even better than this original one in my opinion.... GREMLINS was made in 1984 as I said by director Joe Dante who also did The Howling. In Gremlins we see Phoebe Cates, Zach Galligan, Judge Reinhold, Corey Feldman and many other actors and whatever but Gremlins is a very simple story and it consists of somebody's dad getting this mogwai fireball creature for his son for Christmas and there's three golden rules he must follow. The main two are never get his new pet wet and keep him away from bright lights and sunlight but being a dopey and clumsy guy Billy (Zach Galligan) gets him wet and this reproduces an army of the little creatures who are cute but later form cocoon's and hatch into bigger and more nasty creatures who wreak havoc on the community and town. The idea is good and we have great scenes such as the gremlin getting mangled in a food blender or something, we have Gizmo having darts thrown at him from the gremlins, we have one gremlin exploding in a microwave and they even watch Snow White and the Seven dwarfs in cinema. Also in Gremlins there always seems to be snow on the ground, Christmas lights up, a film filled with lighting and bright colours, some very good and likeable characters and the acting is okay. Overall I'd say it's a great film but I still think Gremlins 2 was better with the electric gremlin, brain gremlin, bat gremlin and spider gremlin."
    },
    {
      "rating": "10",
      "text": "Joe Dante's original... Gremlins is a 1984 horror kind of comedy and it's basically about a father wanting to get his son something for Christmas and he looks in some bizarre antiques shop and buys a harmless little creature called Gizmo who's a mogwai.... He gets given a set of rules to abide by like don't get the creature wet, don't expose him to bright lights or sunlight and don't feed him after midnight... Surely enough he gives the gift to his son and by accident the harmless creature gets exposed to water and it multiplies more then they go into cocoons then the cocoons hatch then you've loads of evil creatures causing havoc in Kingston Falls... Zach Galligan and Phoebe Cates are great in this, Gremlins is funny but mainly dark and chaotic. Check the sequel too called Gremlins 2.... Both great films and Gremlins really captures the Christmas spirit and some of my best parts of Gremlins is when one gremlin is spinning fast on a ceiling fan in a bar and a bar full of gremlins drinking alcohol and smoking cigarettes, also the famous pool scene and the chainsaw scene plus Mrs. Deagles stairlift going fast until you see her fly out the window to her death and the gremlin creatures giggling and there's even a dude dressed as Santa with Gremlins all over him.  ... The stripe gremlin is my favourite. Gremlins is great and very entertaining!"
    },
    {
      "rating": "8",
      "text": "Gremlins (1984) is a great comedy-Christmas-horror film to watch around Christmas time."
    },
    {
      "rating": "7",
      "text": "Gremlins is a good family entertainment which is fun and thrilling to watch. Movie's on the point and pacing is also good. The story is little bit childish and straight forward but that doesn't ruin your experience. Overall, the movie is enough for you to get entertained."
    },
    {
      "rating": "7",
      "text": "Chinese junk shop pet gets wet, makes babies, they eat after midnight, become gremlins and then kill the townspeople in a jovial manner, all at Christmas."
    },
    {
      "rating": "6",
      "text": "El momento en el que la vi no era el adecuado, pero aún así, tiene su gracia, por algo es de culto."
    },
    {
      "rating": "7",
      "text": "7.5/10While Gremlins doesn't lived up to his classic name fully, mostly they did, and when it happen it's fun, it's funny, it's cute, it's scary, and it's great."
    },
    {
      "rating": "6",
      "text": "It was a bit of a messy print. There is a lot of damage to the original film. Shame really, as all of the rest of it looked so good. I especially liked the gremlins, they were fascinating. I love the music! The noises that the creatures made were brilliant. Good use of surround too. Quite a cute film with plenty of excitement and humour. The gremlins were so funny and the absolute star of the movie. It is memorable but there is something about it that I wouldn’t watch often."
    },
    {
      "rating": "9",
      "text": "The Best \"Tiny Terrors Films\" Ever made. Also did I mention I was scared of this when I was younger."
    }
  ]
}