{
  "id": 1370,
  "title": "Greta",
  "starring": [
    "Chloë Grace Moretz",
    "Isabelle Huppert"
  ],
  "runtime": 98,
  "genre": [
    "Mystery",
    "Thriller",
    "Horror"
  ],
  "description": "A young woman befriends a lonely widow who's harboring a dark and deadly agenda toward her.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9hBpFyJ3pGdupXbaC2L7nGvLMBn.jpg",
  "categories": {
    "plot": 6.642857142857143,
    "acting": 6.2105263157894735,
    "ending": 7.111111111111111,
    "soundtrack": 3.6666666666666665,
    "cinematography": 7.8,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 6.909090909090909
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This movie was very good!! The acting was magnificent, the cinematography was excellent, the quality was great, the story was unique."
    },
    {
      "rating": "7",
      "text": "Frances McCullen (Chloë Grace Moretz) is a waitress living in New York City with her friend Erica (Maika Monroe), still reeling from the death of her mother one year prior. One morning Frances finds a handbag on a subway train; the ID inside confirms the bag belongs to a Greta Hideg (Isabelle Huppert). Frances visits Greta to return the bag and Greta invites her in for a cup of coffee.Greta tells Frances she is a widow from France, whose daughter is still there, studying in Paris. Frances begins to spend time with Greta to keep her company, despite Erica's objections that their friendship is unnatural. One night while having dinner at Greta's, Frances finds a closet full of multiple handbags, identical to the one she found on the train. Attached to the bags are names and phone numbers, including Frances'.Frances, disturbed by her discovery, decides to cut ties with Greta. Greta begins to stalk Frances, seeing herself as a replacement for Frances' late mother; she rings her multiple times and even turns up at the restaurant where Frances works, causing a disturbing scene that results in Greta being hospitalized. Greta also stalks Erica; Frances and Erica pursue a restraining order, but are told it could take months. Frances later finds out Greta is Hungarian not French, and that Greta's daughter died years ago.Frances is torn between going to live her father or going on vacation with Erica. Erica then suggests Frances tells Greta she is going away but should actually stay at home. The next morning, Frances is kidnapped by Greta; she locks Frances in a wooden toy chest in a secret room, then uses Frances' cell phone to separately text Erica and Frances' father, that Frances is with the other. When Frances is released from the chest, she finds articles of clothing and IDs of other young women Greta has previously kidnapped.Erica and Chris eventually get together and learn that Frances is not with either of them. As time passes, Greta forces Frances to learn Hungarian and how to play piano. During a cooking lesson, Frances cuts off Greta's finger and knocks her unconscious. Frances tries to escape but all the doors and windows are sealed. Frances runs into the basement to search for an exit and finds one of Greta's previous victims. Greta sneaks up behind Frances and wraps a bag around her head until she passes out.Chris hires Cody, a private investigator, to find Frances and investigate Greta. Cody learns that Greta was a nurse who had been let go for drug abuse. Cody meets with Greta in her home. Frances, gagged and bound, attempts to get his attention by shaking the bed, but Greta blocks out the noise with music. When Greta is out of the room, Cody figures out there is a secret room behind the piano. Greta suddenly appears and plunges a syringe into his neck. He draws his gun as he loses consciousness, and Greta uses it to shoot him dead.An indeterminate amount of time passes. Greta leaves another handbag on the subway and a young woman brings it to Greta's home. She invites the girl in and makes them a pot of coffee; Greta drinks her cup and starts to feel faint. The woman takes off her wig and reveals herself to be Erica, who has drugged Greta. She mocks Greta and tells her she has been searching for the handbag on the subway for a long time. Greta passes out and Erica finds Frances. As they try to escape, Greta, regaining consciousness, emerges from the shadows and grabs Frances before passing out again.Erica and Frances place Greta's unconscious body in the toy chest and leave, using a small metal statue of the Eiffel Tower to lock it shut. After they leave the room to summon the police, Greta begins to rattle the lid of the chest and the statue moves a bit."
    },
    {
      "rating": "8",
      "text": "While Greta has its faults it is still a great B movie in every aspect of it! If you haven't seen it I highly recommend it"
    },
    {
      "rating": "7",
      "text": "A relatively innocent woman (Chloë Grace Moretz) finds a handbag on the subway and (instead of the standard NYC reaction…alerting the bomb squad), she tracks down its owner (Isabelle Huppert). At first, they form a bond, but the mother figure slowly becomes clingy and then downright possessive (literally). Huppert brings her laid-back French style to the character's creepy persona. Director Neil Jordan is a master of the slow, tense camera and he manages to imbue the film with a low-level dread. There are a few minor frights to add to the tension. While there's one major hole in the logic, this film still provides an interesting anA relatively innocent woman (Chloë Grace Moretz) finds a handbag on the subway and (instead of the standard NYC reaction…alerting the bomb squad), she tracks down its owner (Isabelle Huppert). At first, they form a bond, but the mother figure slowly becomes clingy and then downright possessive (literally). Huppert brings her laid-back French style to the character's creepy persona. Director Neil Jordan is a master of the slow, tense camera and he manages to imbue the film with a low-level dread. There are a few minor frights to add to the tension. While there's one major hole in the logic, this film still provides an interesting and mildly-tense physiological thriller.d mildly-tense physiological thriller."
    },
    {
      "rating": "8",
      "text": "Greta is an intense thriller with a grear cast. The movie is refreshing & most of the jump scares are provided by Isabelle's character. Greta is from the director of Interview With The Vampire. This is his best movie since that movie was released which was 1994. He still has refined skills and can engage an audience, B+."
    },
    {
      "rating": "8",
      "text": "°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°°•°•°•°•°•°•°•°•°\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",■¿■¿■¿■¿■¿■¿■¿■¿■¿■¿"
    },
    {
      "rating": "8",
      "text": "°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°°•°•°•°•°•°°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•"
    },
    {
      "rating": "10",
      "text": "Payoff is the final half hourA peculiar atmosphere that is hard to describe is at work here. Some of it might be due to Huppert's presence, as though she's wandered into this movie from another world(or planet). But the director no doubt deserves credit for bringing a subtle strangeness to the look of the whole project. Aside from the gimmick of the purse that starts the action, the entire first half is an annoyingly familiar stalking story - so that the intensity of the exciting final twenty minutes is both welcome and frightening. The subway, street scenes and outdoors look like NYC, but perhaps the interiors were filmed on studio sets in Europe to accommodate Ms. Huppert and the director (Mr. Jordan) ? I'm guessing here, but it could explain the unusual feel of the production."
    },
    {
      "rating": "10",
      "text": "@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%%$#"
    },
    {
      "rating": "10",
      "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"
    },
    {
      "rating": "8",
      "text": "Brilliant actresses, gloomy atmosphere and sinister tension make for one of the greatest psychological thrillers in recent memory.Greta is a very good psychological thriller that convinces with excellent actresses, gloomy atmosphere and sinister tension from start to finish.The film starts very quickly and the main plot is introduced in the first five minutes already which is a very dynamic approach. A young female student who has recently lost her mother and now lives estranged from her father with a dynamic roommate finds a purse in a subway. She decides to bring the purse to her owner, an elderly and lonely lady who lives estranged from her daughter and has lost her husband and dog. The student pities the lady, buys a new dog with her and starts meeting her regularly despite her roommate's doubts. One day, the student discovers that the lady is hiding several bags identical to the one she had found in a closet and realizes that the old lady specifically places them around town in order to meet new people. The young student stops seeing the lady but the latter is obsessed with and keeps stalking her. The more the young student tries to escape from her, the more determined the elderly lady gets to win her back by any means necessary.The acting performances in this psychological thriller are particularly outstanding. Chloë Grace Moretz convinces as empathic, fragile and good-mannered student who falls into a dangerous trap. Isabelle Huppert delivers the goods as dangerous, egocentric and unstable widow who takes advantage of the young student's weaknesses and who has some skeletons in her closet.Thanks to a well-paced start, the movie quickly creates a sinister atmosphere. The first signs that something is amiss with the elderly lady are already present in the first ten minutes of the film. She brutally bangs against a wall in her own house to prevent the neighbours from making too much noise. She immediately tells episodes of her tormented life to a complete stranger. She makes philosophical remarks pretending to know the desires of a young woman she has just met. From then on, things slowly spiral out of control as the strange old lady becomes a most dangerous psychopath who is nevertheless underestimated far too long.The tension rises throughout the film. The viewer can empathize with the young lead character who initially feels intrigued by the elderly lady, then confused and upset and progressively scared and terrified. The exposition is appropriately short, the rising action is intensively detailed, the climax is shocking, the falling action is eventful and even the resolution leaves you on an uneasy note that walks off the beaten path.The story of a dangerous stalker might not be completely new and some twists are easily predictable. Still, the exceution of this movie is particularly gripping thanks to brilliant actresses, gloomy atmosphere and rising tension leading to a memorable ending. Anyone who likes psychological thrillers should watch this movie."
    },
    {
      "rating": "8",
      "text": "My friend and I loved this movie!  Isabelle Huppert is great as the sweet, caring, psycho Greta.  Chloe Grace Moretz is also wonderful as sweet Frankie, a young innocent not used to city ways.  When she finds a purse on the commuter train, her first instinct is to return it to its owner.  Roommate Erica (Maika Monroe) says no New Yorker would touch that bag, it could be a bomb!  But, Frankie meets Greta and they each find the mother and the daughter they are looking for.  Such a sweet story.  They were meant to find each other.  Nothing creepy here, folks.  Yet.  One night, Frankie comes for dinner and makes an alarming discovery in a cabinet in the dining room.  We are right there with her when she sees it.  Uh oh.  Our hearts begin to race.  Get out of there!  She does get out of there, but this sweet story is just getting started.  Once the train leaves the station, it goes at breakneck speed to Crazy Town.  You want to get off, but you can’t.  I see Greta as the new Freddie."
    },
    {
      "rating": "9",
      "text": "Greta does what every great thriller should - it keeps the viewer on the edge of their seat with thrills and tension until it all cuts to black. From the get-go, the script wastes no time getting started, and other than a few hiccups where the character's direction may seem a bit contradictory to the struggles they're facing, its near perfection. Chloë Grace Moretz gives the best performance of her acting career to date and, equally-so, Isabelle Huppert proves she was the creepiest and most convincing woman for the task of sharing a name with the film's title."
    },
    {
      "rating": "7",
      "text": "This movie wasgreat!. The perfect balance of suspense and horror. It had an interesting background and storyline. It was bone-chilling but just not fun.I would recommend it though!"
    },
    {
      "rating": "9",
      "text": "Given the poor critical reviews of this film, I went into the theater with low expectations and was pleasantly surprised at how good it is. This is a solid thriller that Edgar Allan Poe would have admired.  The cinematography is well done and the two leading ladies are excellent.  It's probably the creepiest movie I've seen in the last ten years.  If you like creepy movies, this one will scratch that itch. Likewise, I would recommend NOT watching the trailer as it contains some spoilers.  I would have enjoyed it even more had I gone into it knowing nothing."
    },
    {
      "rating": "7",
      "text": "A great cast and a great ending overcome a silly script. Yes, there are problems with logic such as Greta (Huppert) popping up in places she can't possibly be, and Frances (Moretz) making dumb choices that bring her back to Greta. But the movie is greater than the sum of its parts, and 'Greta' has some good moments that makes it worth watching."
    },
    {
      "rating": "8",
      "text": "«Η Χήρα» δεν κομίζει ουσιαστικά τίποτα καινούργιο σε ένα μάλλον κορεσμένο είδος, αλλά αυτό δε σημαίνει πως δεν είναι μια διασκεδαστικότατη, απολαυστική, αλλά και επίκαιρη προσθήκη, ειδικά σε μια εποχή που το stalking έχει γίνει χάρη στα κινητά τηλέφωνα πιο απειλητικά οικείο. Ενώ, όμως το σενάριο που υπογράφουν ο ίδιος ο Τζόρνταν και ο Ρέι Ράιτ, αποδεικνύεται συμβατικό και προβλέψιμο, ο σκηνοθέτης και η πρωταγωνίστριά του αναβαθμίζουν τελικά την ταινία και την οδηγούν σε νέες κατευθύνσεις."
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡:.:.:.:.:.:.:.:.:.:.:.:.:.:.:"
    },
    {
      "rating": "10",
      "text": "---------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■●■$$$$$$$$$$$$$$$$$$$$$$$$$$$$+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷"
    },
    {
      "rating": "10",
      "text": "♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"
    },
    {
      "rating": "10",
      "text": "{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}[][][][][][][][][][][][][]!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "8",
      "text": "Realmente llegas a creer en que Isabelle Huppert es una vieja desquiciada y Chloë Grace Moretz nada mal tampoco, ambas muy comprometidas con sus personajes."
    },
    {
      "rating": "9",
      "text": "O filme acerta em vários pontos, em sua filmagem, na criação de personagens e situações. Elenco perfeito! Atua e entrega exatamente o que a cena quer nos passar, o ambiente de paranóia e obsessão é criado perfeitamente fazendo desse filme uma grata diversão."
    },
    {
      "rating": "1",
      "text": "One of the worst movies of the genre I've ever seen. Nonsensical writing for the characters and to say there are major glaring plotholes would be the understatement of the century. How such a script ever got approved is beyond me, it genuinely feels like it was written by a child. And if it weren't for the music so desperately trying to sell you on the \"standing around MENACINGLY\" type scenes, you may find yourself pondering whether the movie was originally intended as a spoof of the genre."
    },
    {
      "rating": "6",
      "text": "I came in with super low expectations and actually found it pretty fun. But not funny in the way that many critics suggest.  I've seen this sort of movie done better many times before."
    },
    {
      "rating": "10",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•"
    },
    {
      "rating": "10",
      "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"
    },
    {
      "rating": "5",
      "text": "Basically what this all adds up to is maybe I had a reason not to take the bait to see “Greta”. Even with Chloë Grace Moretz and Isabelle Huppert in the main roles, the film is enjoyable at best with some suspenseful moments and build up tension and criminally underwhelming at worst as the real issue here lies in the predictable story, the fault in decision making for the characters and the slow burning build up not going anywhere once we get to the ending. The film, to me, is not relatively boring but if Moretz and Huppert weren’t here in, it probably would’ve been a different story. To be fair, it is one of Chloë’s better movies on her resume but that’s not really saying much. Like every other film, this one had potential via its director and screenwriter but magic doesn’t always formulate to the silver screen......and this is just one of those instances where the initial set-up is just lacking in subtlety to the point that this movie might as well be a satire."
    },
    {
      "rating": "6",
      "text": "Just looks like a modern ripp off from Stephen King's Misery. But is still enjoyable even if the tense and \"horror\" are way softer. The performance from Chloe Grace Moretz and Isabelle Hupert are the strong part of the film and probably save the lack of innovation in the screenplay and direction. But of course Hupert isn't Kathy Bates and doesn't scare the sh*t out of you as Annie Wilkes was able to do."
    },
    {
      "rating": "6",
      "text": "Greta, in the studio synopsis, is described as an 'eccentric French piano player' and Isabelle Huppert playing her could have taught Baby Jane Bette Davis a few things in playing/being crazy. This is a female dominated film with, more or less, cameos by Stephen Rhea as a private detective andan estranged dad played by Colm Feore. His daughter, Francis, played by Chloe Grace Moretz, rooms with Erica, played by Maika Monroe, her best friend who has a spacious brick apartment bought by her father in New York City. Francis finds Greta's purse on a subway and returns it to her and to say anything more would spoil the craziness, that makes no sense but is a lot of fun to watch and all will be forgotten by the time you leave the theatre. Well, not all, because watching Isabelle Huppert flipping a table, no spoiler as it is in the preview as is something she does with music that you will laugh at with guilt feelings, maybe!Neil Jordon, a favorite director of mine since \"The Crying Game\", adds his very odd take on people of all kinds and he has willing accomplices with his actresses, especially, again, with Isabelle Huppert. His direction, and her acting, certainly aren't Oscar winners let alone contenders, but they are certainly entertaining.There are many holes in the screenplay written by Jordon and Ray Wright and many scenes you will laugh at which I don't think was intended. Plus if you want violence and jump out of your seat surprises you may or may not find them here depending on your ability to suspend belief at the movies.Did I like \"Greta\"? Do I recommend \"Greta\"? Yes and no--how's that for being definite? Or is it a 'red herring' you might find in the movie?"
    },
    {
      "rating": "5",
      "text": "Is it a psychological thriller? A campy romp? Well, that's what the film itself is unable to decide. While it does each of those things well, it doesn't mesh them together at all effectively, abruptly switching gears from the former into the latter in the final act. Had director Neil Jordan decided which of these approaches he wanted to use, he would have had a much better picture on his hands. Alas, though, we have a film that's almost as schizophrenic as one of its two principals. Despite these issues, one can't help but commend Isabelle Huppert for her moxie in being willing to yet again take on a part where she's willing to do anything and do it well. It's too bad, though, that she didn't have a better vehicle here to show off what she can really do."
    },
    {
      "rating": "6",
      "text": "The cast was first rate, so why wasn’t this movie better? Chloe Grace Moretz was likable and interesting to watch, and you cared about her. Isabelle Huppert was menacing enough to make you wonder what would happen next. So what was missing? Style and panache in the direction, tighter editing, and better pacing. I blame Director Neil Jordan. A movie with such a good cast and a decent script should not have felt like it lasted more than two and a half hours when it was only 98 very long minutes."
    },
    {
      "rating": "5",
      "text": "I am a fan of Neil Jordan's direction/writing.  Greta I find lacking, either it is a commentary on the complete ignorance and incompetence of millennial's in general,or, it is weak on horror.  It starts out as a competent homage to Hitchcock style suspense, believable and well paced.  But, when \"Frances\" decides a face to face to tell Greta a lie; it falls apart fast.  And, \"Frances\" has flight or fight reflexes that make no sense at all given her earlier realization that Greta is unhinged in a big way.  I mean, really, she finally takes a rolling pin to the old broad, but, does not hold on to it; and, maybe, break out the glass on the front door, grab a loose chair and hop out, screaming for help?  Of course the movie would have only been 70 minutes long, but, they could have had a trial!  And, if you are going to put Greta in the toy box, at least close the door, and push the piano back!"
    },
    {
      "rating": "4",
      "text": "Self-care marks the first step to saving other people, and there are many ways to better yourself. For instance, you can avoid ultra-processed foods, along with that 10% increased cancer risk. Or, maybe you can only watch movies that actually have a reason to exist, those that convey the situation of self-care to generate outer-concern, something that the latest horror-suspense, Greta, fails to achieve.Nobody gullible enough to buy a ticket to this feature should do so, otherwise, they would have to fight drifting asleep before the predictable climax. The Z’s are bound to happen as the events leading up to the climax rely on one cheap way to suck thrills out after another, including an out-of-place scene when an elevator keeps going down, down, down, and closes in on the passenger. That trippy scene matches a comparable level of goofiness to when the main actress, Chloë Grace Moretz, throws her phone as she shouts, “goddammit,” as if a supporting actor from history’s worst movies. When clumped together, these pathetic moments force the suspense away.It’s sad that our world now has to associate itself with these characters’ idiocy, because the protagonist, Frankie, does the opposite of what one carrying common sense would do. She does not deserve to be cheered on, or anyone else in the passive ensemble for that matter! That goes as well to Frankie’s stalker, Greta, who is stupidly overpowered without reason as to why, while her actress, Isabelle Huppert, doesn’t shy away from knowing her doomful career ahead.Though the projection of our happiness generated by a piano is somewhat successful. That instrument sits in Greta’s lonely house as her only true company, not to mention the only sign of sanity as it sets a contrast apart from the millennials she seems to take obsessive delight in. The sound design around this music of eighty-eight keys works off your greatest fear as it’s set against the unhuman tick sounds of a tense metronome. In the few scenes that little tool tick-tick-ticks, the circumstances allow you to now forever associate that noise to a tell-tale heart.These elements do at least address what our true fears are, even when zero confrontational advice comes out of it. Upon their first meeting, Greta leaves Frankie many calls, perhaps around eighty in a single day, all containing terms of endearment that when said the umpteenth time escalate your nerves: Chérie, Sweetheart, and Darling. Yet Greta’s actions turn quickly more ominous, including an outburst among restaurant patrons after spitting gum into Frankie’s hair.The film gradually gets more and more discomforting as it goes along, which works well enough considering that the first act sprinkles around joyful doses of familiar imagery. Inside a cathedral, soft candle glows suggest the wisdom that Greta seeks from youth, considering that she barely even knows how to use an old Nokia phone—or so believed. Away from the stalking chaos, Frankie circles on a bike around her roommate, who does yoga in the center of their apartment. This circular imagery enables you to relax before they’re both put in harm’s way.Unfortunately, all these intense emotional moments do nothing to progress your well-being beyond the mundaneness of life. Even the characters in this movie don’t seem motivated to ever change. Heck, it’s addressed quite frequently that Frankie lost her mom a year prior… so what? Why care? It doesn’t say! It’s hard to care about the antagonist as well, seeing how the writer/director Neil Jordan ignored giving Greta a chance for redemption, suggesting she falls short of displaying any good, making her much less realistic than a vampire.There’s the argument that bad people must be seen as bad and punished for doing so in a story; but before you draw a black/white conclusion about whether or not someone deserves forgiveness, just think: in someone else’s mind, you are the villain of his/her story. Does it press an “evil” label on you too? Does it mean you deserve no redemption? In that same way, the best movie antagonists are human, with both good and bad traits about them. Would Hannibal Lecter still be regarded as one of the greatest on-screen baddies of all time if he wasn’t unusually polite? Don’t expect any characters controlled by this horrendous script to do anything besides push the plot forward. That goes to the roommate, and that goes to Isabelle Huppert’s awful accent that offends her own race.In fact, this big crapload simply should never have been made, as it lacks any motivation, not for art, not for money, not for anything. Detestable trials will always come your way with the intent of helping you change for the better, but Greta instead prefers to hold back on challenging you."
    },
    {
      "rating": "5",
      "text": "Basic suspense disguised as something more substantial.Don't get confused, Isabelle Huppert can hardly give more strength to the story while from Moretz I'm not expecting anything anymore. Honestly.Disappointing, not mediocre but rather disappointing."
    },
    {
      "rating": "6",
      "text": "Insubstantial and forgettable, but Huppert makes it moderately entertainingWritten by Ray Wright and Neil Jordan, and directed by Jordan, Greta is a schlocky B-movie through-and-through, with a completely ridiculous plot and over-the-top final act, all infused with a ludicrous generic campiness. It's one of those films that's so utterly horrendous in almost every way, it's actually kind of enjoyable. Very much in the tradition of stalker-thrillers such as Body Double, Fatal Attraction, and Single White Female, although nowhere near as good as any of them, there's precious little of anything going on in the film, as Jordan seems to have nothing to say. It is, however, good for a few laughs (not all of which are intentional).Frances McCullen (Chloë Grace Moretz), a young Bostonian, is sharing an apartment in New York with her college friend Erica Penn (Maika Monroe). Having recently lost her mother to cancer, she is all-but-estranged from her workaholic father Chris (Colm Feore). When he finds a handbag on the subway, she returns it to the owner, Greta Hideg (Isabelle Huppert), who explains her husband died some time ago, and her daughter is living in Paris. The two strike up a friendship, with each filling an emotional void in the other's life. However, when Frances makes a discovery which changes the nature of their relationship, she tries to cut ties with Greta, who has no intentions of allowing Frances to walk out of her life.Neil Jordan's eighteenth film, Greta is a B-movie before it is anything else. And although Jordan doesn't seem to be in on the joke, taking the material relatively seriously, Huppert is clearly having an absolute blast with the part - whether it's literally dancing across the set as she commits homicide, spitting chewing-gum into Frances's hair, gleefully engaging in some DIY emergency medicine, or overturning a table as if her life depended on it. She practically winks at the camera a couple of times.Thematically, the film flirts with a few issues, but never really penetrates any of them. One could read it as a satire of NYPD inefficiency, the ineffectiveness of the justice system, and the misnomer that in a post #MeToo society, it's easier for women to report instances of stalking and harassment and be believed. However, none of these themes are explored in any significant way.From an aesthetic point of view, the film looks great. Anna Rackard's production design contrasts the dark brown classical feel of the interior of Greta's house with the bright, grey, modernist look of the girls' sleek apartment. There's a really well-mounted scene where Greta is following Erica, and neither Erica nor the audience ever actually sees Greta, but we know she's there, because she keeps sending Frances picture messages of her pursuit. Nick Emerson's editing is especially impressive here, cutting rhythmically between Erica, Frances, and inserts of the picture messages. It's a very unsettling scene, and a unique way to stage a chase.On the other hand, the aesthetic lets the film down in terms of location. Although set in New York, it was shot primarily in Dublin, and it shows; from the sequence of the traffic lights to the side of the road on which the cars drive to the street signs. It's very distracting, and really wouldn't have required that much effort to fix.And there are a myriad of other problems. For starters, there's the script, wherein none of the characters are given much in the way of interiority or psychological verisimilitude. There's little emotional complexity anywhere in the film, no real sense of any of the characters having an unconscious. Frances comes across like a cog in the screenwriters' machinery, only behaving in such and such a way because the plot dictates it, with scene after perfunctory scene doing only enough to get us to the next scene and nothing else. Neither Moretz nor Monroe are able to escape the generic moulds of their character-types; the bright-eyed and innocent newbie whose kindness will be her downfall, and the tough friend who seems churlish and cynical but who ultimately proves to have been right all along.Greta is a rote stalker-thriller that looks great, but offers nothing we haven't seen before; it's essentially a potboiler in a nice suit. No different from any of the late 80s/early 90s obsession thrillers, it's hard to figure out what Jordan was aiming for with this. You can't call it a psychological thriller about obsession and loneliness, because it does nothing with these themes, but you can't call it a self-aware B-movie, because Jordan doesn't seem to be fully cognisant that it's campy schlock. Huppert's performance elevates the material significantly, but even she can't paper over all the cracks. It's been 23 years since Jordan has made anything significant, and on the evidence of his last few films, it's going to be a while before he does so again."
    },
    {
      "rating": "6",
      "text": "Palomera. Pero la historia es floja, predecible, y el final es interesante."
    },
    {
      "rating": "5",
      "text": "Not too sure what to make of this. Can anyone be that naive? I was kinda bored."
    },
    {
      "rating": "0",
      "text": "Greta is the child of uber rich parents and is a pawn in politics.  She reads off a script and tweeted out a plan put together by uber rich people with dates to send tweets, exactly what to say and other things for her and celebrities to say/tweet.  Greta and Rhianna both tweeted copied and pasted tweets from the \"plan\" on the dates specified. Her \"handler\" in India was imprisoned for LIFE as a response to the tweeted plan that was intended to disrupt the government of India and it's food supplies. She can not answer questions about the topics she speaks on because she doesn't know what she is talking about and can't intelligently talk about her topics unless she is reading from a script.  She is one of the biggest political frauds of the century, but certain people idolize her.  I fear for this country and the people who idolize her and canonize her in things like this movie.Independent thought is dead if you let the uber rich tell you want to believe via propaganda like this."
    },
    {
      "rating": "10",
      "text": "********************************************************》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》"
    },
    {
      "rating": "7",
      "text": "(Mauro Lanari)Explaining practically nothing of the causes of the protagonist's mental instability (loneliness: really?), Jordan does not provide coordinates that make the development of the story predictable, so he creates an unhealthy film that goes on, scene after scene, disturbing and suspenseful."
    },
    {
      "rating": "8",
      "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"
    },
    {
      "rating": "8",
      "text": "Suprised at the low ratings!Okay, this film wasn't amazing but it wasn't awful either! I actually quite enjoyed it! I must admit, it does have a typical thriller story line but it certainly kept me entertained! Quite creepy in a weird way! Also, I thought the acting was good! Give it a go!"
    },
    {
      "rating": "0",
      "text": "Literally the WORST movie I‘ve ever watched. If I could I would travel back in time to stop myself from watching"
    },
    {
      "rating": "1",
      "text": "The crazy lady must work for the CIA. She can move in and out any house undetected and can randomly kill people without consequence. There is also apparently no stalking laws in NYC.This movie is both implausible, but VERY slow."
    }
  ],
  "recommendations": [
    "lady_macbeth",
    "the_way_back",
    "ingrid_goes_west",
    "stoker",
    "personal_shopper",
    "panic_room",
    "the_card_counter",
    "unforgettable",
    "the_rhythm_section",
    "nightcrawler",
    "allied",
    "elle",
    "the_autopsy_of_jane_doe",
    "shame",
    "my_cousin_rachel",
    "afternoon_delight",
    "hotel_artemis",
    "land",
    "the_manor",
    "k_pax",
    "locked_down",
    "breaking_in",
    "leave_no_trace",
    "swallow",
    "promising_young_woman"
  ]
}