{
  "id": 1617,
  "title": "Greyhound",
  "starring": [
    "Tom Hanks",
    "Stephen Graham"
  ],
  "runtime": 91,
  "genre": [
    "War",
    "Action",
    "Drama"
  ],
  "description": "A first-time captain leads a convoy of allied ships carrying thousands of soldiers across the treacherous waters of the “Black Pit” to the front lines of WW2. With no air cover protection for 5 days, the captain and his convoy must battle the surrounding enemy Nazi U-boats in order to give the allies a chance to win the war.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kjMbDciooTbJPofVXgAoFjfX8Of.jpg",
  "categories": {
    "plot": 6.7727272727272725,
    "acting": 7.421052631578948,
    "ending": 8.666666666666666,
    "soundtrack": 6.0,
    "cinematography": 5.5,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 7.7894736842105265
  },
  "reviews": [
    {
      "rating": "7",
      "text": "\"Greyhound\" is an effective, old-fashioned, and straightforward WW2 naval warfare film. Its technical accuracy is admirable although it comes at the cost of more fleshed out characters and plot."
    },
    {
      "rating": "7",
      "text": "Good war movie. The story is intense. Maybe too technical with the dialog but justified. The emotions are subtle and with strong acting from everyone. The FX are really good. Some small exceptions with the water effect but not distracting. I give it 75%. It's a small and very focus aspect of the war on sea but well done in many ways."
    },
    {
      "rating": "7",
      "text": "I was entertained. Nothing special by any stretch. Fine if you have nothing left to watch."
    },
    {
      "rating": "7",
      "text": "The movie was good but they didn't do enough research on how the military does things correctly. For example, The saluting was off a lot of the times but a lot of war movies do that so i guess we cant be that mad"
    },
    {
      "rating": "10",
      "text": "Oh to have seen this in theaters, but alas it was not to be. Nevertheless, I thoroughly enjoyed curling up on the couch with this drama. It was simple yet captivating. I felt it was excellent and just the movie I wanted to see right now. Not all heroes wear capes."
    },
    {
      "rating": "10",
      "text": "The best movie i've ever seen ,so to the point not wasting time ,epic movies ever!!must see ofc"
    },
    {
      "rating": "9",
      "text": "A movie that excels where most other war movies fail.Its been such a long time since I last saw a war movie that nailed accuracy without being too technical so well. The visual and sound effects are incredible. The movie keeps you on your toes, and I personally found it very entertaining. The fact that I am very interested in WW2 and that I am a Naval Architect probably affect my view of this movie, but thats why this is simply my opinion. However, I think that this movie is one of the best examples of naval warfare from ww2 out there. The ship dynamics, maneouvres and the human interactions on board are magnificent. My only complaint would probably be the cheesy German U-Boat commander intercepting their radio channel and howling like a wolf. The rest of the movie is very very realistic and you can see that a lot of research and experts collaborated to produce a movie with an outstanding quality. This movie will probably receive bad critics from people who are just not interested in a Naval Warfare, or that want something more fictional like Midway, but nobody can deny that this is an extremely well made movie with a few Hollywood moments that remind us that this is still a movie based on a novel.A must watch if you like WW2."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)The Tom Hanks as actor and screenwriter of \"Greyhound\" has subverted the one as co-producer of \"Band of Brothers\". If in the TV miniseries the war was little more than a pretext to deal with ethical and existential issues (including the interviews with survivors: is Hobbes really right when he defines the human condition a pan-bellicism regardless of weapons?), vice versa here there are expensive battle in CGI and a pious, God-fearing, perhaps bigoted single protagonist (\"Jesus Christ is the same yesterday, today, and forever\", Hebrews 13:8): \"Fury\" + \"The Good Shepherd\". Elisabeth Shue passed through there by chance."
    },
    {
      "rating": "9",
      "text": "An intense ride that doesn’t let up until the end, but it’s a tight film at only an hour and a half total. This movie runs at breakneck pace, and manages the tension with a thrilling score. The acting is top notch and the entire movie is gorgeous. The scope is huge, if theaters ever come back this will be worth seeing on the big screen. Apple scored huge on this one: this is easily worth the price of admission, and some."
    },
    {
      "rating": "8",
      "text": "91 minutes of Edge-of-your-Seat WWII drama!  A great screenplay & laudable performance by Tom Hanks!  Thank you!"
    },
    {
      "rating": "9",
      "text": "Tom Hanks plays a Navy captain who leads a convoy of ships thru the Atlantic to deliver men and supplies to the Allies during World War II. Most of the film's 90 minutes has him slinging commands to his crew, as they try to outmaneuver the destructive Nazi U-boats. Even though the dialogue is full of sailing commands and jargon, writer Tom Hanks has made sure that the tactics and intentions are clear. Hanks the actor creates a character of dedication and determination. Director Aaron Schneider has kept the tension taut and makes the actions feel almost claustrophobic, even though it's set on the high seas (which often look obviously CGI). Even if you're not a fan of war movies, this one is well crafted and involving."
    },
    {
      "rating": "8",
      "text": "I really enjoyed it. It’s quite the dad movie. The characters are pretty thin, but it wastes no time getting into the action. If you don’t go in expecting the next Fury or Saving Private Ryan, it’s an entertaining time."
    },
    {
      "rating": "7",
      "text": "This was a better than bad, technical war at sea movie, done through the literal fog of war.  This is not some flowery drama with an overly complicated plot.  Ships went to sea from America to England supplying men, arms, and fuel, German subs didn't want them to get there.  They fought it out a lot, it was confusing, and lots of boats and men were lost.  That's it, that's the movie.  I liked it."
    },
    {
      "rating": "6",
      "text": "This might be a spoiler, but the cinematography was kind of hard to swallow if you will. Their ship is alone in the middle of nowhere and all of a sudden giant ships show up out of nowhere. Just not believable. Also, the story is missing a lot. I ask myself now; what was that about? I really don't know. It's vaguely about Merchant Marines getting attacked by Germans. That's it. Not too oddly, the acting was superb. Just no script. Oh and Black Butlers Matter."
    },
    {
      "rating": "8",
      "text": "The film wastes little time getting into the action. Playing out as a tense thriller, the viewer is left on the edge of their seat for much of the film. It fails to build much on any character which is one negative but the pacing works to its advantage as well. The Sound is haunting as well. Not the best War film you'll see but a very good one that's worth the watch and then some."
    },
    {
      "rating": "10",
      "text": "Dynamic performance in this fast paced, visually spectacular movie makes for good, exciting entertainment"
    },
    {
      "rating": "10",
      "text": "Awesome movie, thanks Tom Hanks!  I enjoyed watching with my family. Not many good films are made these days..."
    },
    {
      "rating": "10",
      "text": "This is a 9 out ten, losing 1 point for the lower CGI. This movie is epic, best movie so far this year. Tom Hanks hasn't been this good in awhile. Do not pay attention to people complaining about having to hear the commands over and over again, the have never been in the military and do not understand."
    },
    {
      "rating": "9",
      "text": "Intense action and a compelling story. Hank's takes it from average to great."
    },
    {
      "rating": "4",
      "text": "Left full rudder. War, a boat, a captain, an enemy. Will they manage to escape, will they fulfill their task? Anyway, a lot of action and still boring."
    },
    {
      "rating": "5",
      "text": "Well this shows that those handing out 10s cannot pay attention.  When convient, the director of cinematography had the internal shots actually bobbing, but otherwise, even during massive chop the crew were perfectly stationary.  Also when convienent, the crew on the deck had water on their face, which means that in only one scene when the Captain (Hanks) was on the main deck, was that true.  The rest of time everyone was perfectly dry regardless of the waves they were cutting through.The main problem with this is that it is CGI, directed by people that have no idea of naval reality (have never been on a ship of any kind), but are experts on jargon and spectacle.  Even the CGI begins to fail by the middle of movie, and everything decends into a trope filled action movie.  So many shills convinced me this was great, and I believed them.  Sony has a lot to be ashamed of with this and TLOU2 false YT claims.  They have lost a lot of honor (face)."
    },
    {
      "rating": "10",
      "text": "No LGBT, no **** no feminists, no trans and other SJW trash... Thank you Tom Hanks! This movie is awesome!"
    },
    {
      "rating": "10",
      "text": "Великолепная игра актеров,захватывающий сюжет,который не оставляет времени на передышки,ничего лишнего.Все современные меньшинства на своих позициях,чернокожий экипаж корабля на своем месте,геи-транссексуалы еще не родились,феминистки только возрождался из пепла кала.12 Томов Хенксов из 10."
    },
    {
      "rating": "10",
      "text": "Best movie of 2020 FOR SURE.  It was an intense film that had me hooked in the first five minutes, but it made you cry at the end like when you cry for George Bailey at the end of \"It's a Wonderful Life\".  And as usual Tom Hanks delivers, makes you really feel, know and love the Captain character.  Love it!!  Can't say enough good things about it.  I want to watch it again."
    },
    {
      "rating": "10",
      "text": "one of the best movies in a long time doe not listen to the critics reviews."
    },
    {
      "rating": "3",
      "text": "An hour of Tom Hanks shouting commands into an intercom in an unrealistic setting with bad CGI."
    },
    {
      "rating": "1",
      "text": "An uninspired and entirely unremarkable  chase movie at sea. Among many of the film’s obvious deficiencies was a recurring musical theme that sounded like whale whining. That really took me out of a bunch of scenes. So too did the god awful CGI, which, at times, looked like it was made at a local high school."
    },
    {
      "rating": "10",
      "text": "The movie was so good, as soon as it was over I watched it again. And I almost watched it a third time."
    },
    {
      "rating": "1",
      "text": "Seems like Tom Hanks has lost his \"it\" factor, after a long spree of subpar movies I think it's safe to say he's now washed up. Sad"
    },
    {
      "rating": "0",
      "text": "this movie is factually wrong on all levels and I weep that Tom Hank's is associated with this film."
    },
    {
      "rating": "4",
      "text": "Intense war movie but unfortunately the average Hollywoodian glorification of the american navy against the usual villian. I read a lot about the WW2 naval warfare and especially UBoot war and the presentation in this movie is simply very wrong on most levels. It is sad as it could have been a good movie. German UBoots would never attack that way, not seek radio contact nor surface so close to a destroyer, nor shoot at them with a deck gun from so close. Why? Because they would not have had any chance to survive,,,,,"
    },
    {
      "rating": "7",
      "text": "Durant la Bataille de l’Altantique, l’on suit les diffficultés d’un escorteur-grenadier commandé par un bigot (très bien incarné par Tom Hanks qui prie beaucoup) mais totalement dévoué à sa tâche et bien plus encore… c’est tout juste s’il ne va pas sauter sur le sous-marin des Boches et lui péter la gueule à coups de clé à molette !J’exagère bien sûr, car globalement le réalisme est relativement respecté ici, même si le grand spectacle (très efficace) se taille la part du lion. En tout cas, pas le temps de dormir ou même de casser la croûte puisque soit le Commandant Hanks est au régime, soit il doit encore et toujours batailler juste au moment de bouffer… ça en devient désopilant et limite ridicule mais que voulez-vous, pas le temps de grailler, c’est la guerre !Tellement au charbon le gars qu’il a des ampoules aux pieds… à force de donner des ordres et.. d’aller d’un bout à l’autre du poste de commandement ou sur la passerelle, pourtant pas bien grands, ni l’un ni l’autre…! heureusement que sa copine lui a acheté des chaussons juste avant de partir…Du coup, on se demande s’il ‘agit d’une comédie… mais non, normalement ce n’est pas le cas… quoique… avec le sous-marin allemand qui se fout -en plus- de sa gueule régulièrement à la radio (?!)… on peut se le demander. Quand même. Et les chaussons, putain !Cela étant, les images de synthèse sont superbes et les combats très bien rendus ; la réalisation est toujours claire à part parfois quelques plans un peu trop nerveux sans doute. Le rythme général reste excellent grâce au métrage réduit (largement moins d’une heure trente hors générique de fin !) et il se passe toujours quelque chose, c’est la guerre !La gloriole typique du film de guerre amerloque (typique) est étonnamment réduite en tout cas et ne sévit qu’à la toute fin ; on constate pour le reste des affrontements acharnés entre la meute des sous-marins et les escorteurs qui doivent et tentent de protéger l’immense convoi… c’est toujours difficile et dangereux même avec le radar et le sonar… et cela le film le restitue avec un brio étonnant, finalement."
    },
    {
      "rating": "6",
      "text": "It is not a true story and for some reason that is a big deal to me.  It's procedural, there are just so many good true stories that if it not going to be  super artistic it should be true."
    },
    {
      "rating": "6",
      "text": "Effective and compelling, yet the focus feels trapped in small ambitions, especially considering the poor development that is given to the characters in order to to exalt the action.It helps a lot that it doesn't extend its duration any longer than it should and that makes it more malleable and therefore, more digestible.I'm not so sure if a theatrical run had been successful, but this is definitely one of those Tom Hanks movies that is content to hit the bare minimum."
    },
    {
      "rating": "6",
      "text": "Greyhound was a movie that flew under a lot of people's \"radar\". I did watch the initial trailer and I admit I was not really that impressed. However, with the coronavirus shutting down every cinema and theatre, Greyhound was instead put out on Apple's streaming service which I honestly believe was for the best. The basic synopsis is \"U.S. Navy Cmdr. Ernest Krause (Tom Hanks) is assigned to lead an Allied convoy across the Atlantic during World War II. His convoy, however, is pursued by German U-boats\". Greyhound is directed by Aaron Schneider, no clue on him, with a screenplay by Tom Hanks who is also the main star. Tom Hanks has written screenplays before but those were comedies and \"Greyhound\" however is a more serious movie. So I was mildly interested to see what Tom Hanks would produce. Starting with the praises, after watching the movie, I really appreciated the fast pacing of the movie. A fair amount of people might think of this as a negative but I personally believe this worked in the movies favor. There are constantly dangerous encounters for the Greyhound and situations that keep as the audience invested. The action scenes are thrilling to watch even though its just boats shooting at U-boats. I also love the sound design in this movie. Every missile shot feels big, every gunshot is loud and the torpedos flying underwater has an unsettling sound that feels like a ticking time bomb. The effects are also pretty good though noticeably CGI but not to the point that it ruins the movie. The music score does its job in building tension even though it does overuse a lot of the same honking noise every time.A thing I wasn't expecting with the movie was the really realistic take on how these ships are operated during a war. Seeing how the soldiers operated on these warships was very intriguing for someone like me who isn't a serious history buff. The dialogue was very convincingly realistic and I am glad they didn't shy away from the fact that people of African-American Ethnicity were mostly just messed attendants. However, realism also creates some problems as well. Nearly every dialogue in this movie involves some jargon and for the most part the audience would be able to comprehend what they were talking about. Nevertheless, there are a fair amount of dialogue that just feels really confusing to non-army technical people which is a majority of the audience. While I did praise the movie for its realistic take, there is a certain thing in this movie that just kind of took me out of the movie. Throughout, the second half of the movie, the Germans for some reason find the radio frequency and just taunt the Greyhound for no reason except being an over the top villain. It just tears me away from the realism of the movie as it just feels incredibly stupid and not believable whatsoever. This movie also goes through a sort of \"Dunkirk\" way of storytelling which is focusing on the scenario these people are in rather than developing the characters. This worked for Dunkirk but it didn't really work as well here. The film begins setting up Ernest Krause (Tom Hanks) by having him ask Evelyn Frechette (Elisabeth Shue) for marriage to give him some backstory but it doesn't really amount to anything by the end of the movie. Ernest Krause is a such a straight-up military man that it makes him a very boring protagonist to watch. It worked in Dunkirk as we can see the main character's personality and their struggle for survival. In Greyhound, however, a majority of the characters are very lacking in any personality which makes it less interesting to watch when they are talking. Additionally, there isn't really any dramatic moments that happen in the movie. It justs \"the U-boat has appeared!\" and \"the U-boat is gone!\" for a majority of the movie with some missile shooting. It does this for 90 minutes and then the movie ends.  Once the movie ended, I didn't really retain any memorable moments from the movie and just had an \"okay\" reaction.Overall, the movie is all right. The movie succeeds in giving a tense submarine-thriller showing the ins and out of sea warfare that is interesting to watch and engaging enough to keep watching. The enjoyment will come from seeing how the Greyhound sailors deal with the life-threatening situation. It doesn't have compelling characters or story but it does what it aims to do right and that is good enough."
    },
    {
      "rating": "8",
      "text": "7.5 Entertaining look into WW2 Naval warfareGreyhound is a film I really enjoyed, it has great pacing and is a thrill ride from pretty much beginning to end.  Tom Hanks is great and really carries the film.  The focus is really on his character and the internal struggle with doubt and the responsibility he feels for the safety of his ship and the ones he is tasked with protecting across the Atlantic.  Character development of Captain Krause(Tome Hanks) and the supporting roles are lack luster but this is really my only complaint with the film. I feel the films main goal is to convey the intensity and minuscule room for error in the heat of these naval battles in a realistic way. I think it exceeds in this and it was nice how real it felt with all the appropriate naval jargon being thrown around.  Too often with Hollywood they feel they have to dumb down the dialogue for the audience and it was nice to see that wasn't the case here. The film was an intense 90 minute look into what it might have been like to be one of these brave men of the Navy we owe so much to.  Greyhound does rely heavily on CGI and while I am not usually a fan of this, for me it really didn't take away from my enjoyment this time. I recommend this one for anyone with even a slight interest in WW2."
    },
    {
      "rating": "8",
      "text": "splendid! Excellent movie! As always Mr.Tom Hanks deliver us a thrilling World War II movies!"
    },
    {
      "rating": "3",
      "text": "Totally unexpected from Tom hanks.. The movie is full of technical flaws.. No attention was given to the marine details."
    },
    {
      "rating": "9",
      "text": "Sometimes, reality is enough. Strip away all the Hollywood tropes and hyperbole. Take away the superfluous manipulation of emotions. Just let the magic be the recreation of a thing as it was, history as it happened... and that is enough. This is a time and a place of something that really happened as it happened. And why would you need more?"
    },
    {
      "rating": "8",
      "text": "Probably one of the best put together war movies in quite a long time. (It's not as interestingly shot as 1917 but that is a special case unto itself).Not a super complex and twisty plot, the bad guys have a bit of pointless mustache twirling which would have in reality resulted in them being located and blown out of the water super fast but overall it's entertaining fast paced action flick."
    },
    {
      "rating": "8",
      "text": "Good bordering great is how i would sum up Greyhound. The movie has its shortcomings but overall the positives greatly outweigh the negatives. First off, unlike a lot of modern day movies Greyhound doesnt try to include an overly personal interest story at its core but rather it just displays the struggle of merchant convoys in the atlantic during a pivotal time during ww2, the battle of the atlantic. Its gripping from the day we first see Hanks on the ship and doesnt let you go until they are being sent off again without going over the top and leave little breathing space. Submarine warfare was one of technical devices, a game of cat and mouse(and luck) and this movie does a great job in displaying that. Its not about a single hero heroic soldier taking on the evil nazis. and thats another thing, other than those stupid radio broadcasts from the german sub, this movie luckily doesnt go down the \"evil\" nazi route. Theyre also just soldiers doing their duty. The visuals are great without only a few blemishes to tarnish the good picture but those I can just overlook. Where the movie does lack is the realism in the way the german subs behave. Given that this is set after the entry of the US in WW2 germans were no longer using their deck guns let alone when a destroyer was in gun range. A german sub would never ever surface inside a convoy unless they had to due to damage, subs didnt fight destroyers or escorts, they ran from them. The list goes on and on. Funny enough, the destroyer part of things does seem quite accurate. But this will not a major gripe for most movie goers i assume as the topic is somewhat specialized and the average in a cinema wont know a lot about submarine tactics. Overall, its no Band of Brothers, the Pacific, Saving private Ryan etc, but its a good movie nonetheless."
    },
    {
      "rating": "7",
      "text": "A fine WW2 thriller that doesn't fool around and gets to work immediately. That's probably the most pregnant defining quality of Greyhound as it, led by a wonderful Tom Hanks, keeps you on your toes and provides ample thrills for anyone who likes WW2 stories about convoy duty, marine adventure, and the spirit of the Allies. A very good late-night watch with your chums. TN."
    },
    {
      "rating": "8",
      "text": "I enjoyed it, Tom Hanks' acting was impeccable as always plus it had nice naval action etc. I mean it is hard to depict naval battles in movies to make it interesting and also realistic, but this movie seemed to do nice job."
    },
    {
      "rating": "8",
      "text": "В целом - фильм экшн, только экшн показан реалистично - никто небоскребами друг в друга не швыряет и все постоянно не взрывается. Сюжет - слабый, что для фильма такого рода ожидаемо. Весь фильм о том, как в море встретился конвой кораблей гражданских различных с боевой группой охранения с одной стороны и несколько немецких подлодок с другой - об этой встрече весь фильм. Как показано взаимодействие членов экипажа - мне понравилось. Бои - тоже понравились, нет гипердинамики и тупого переизбытка спецэффектов, есть работа людей и ее результат. Есть несколько решений, непростых, которые принимает капитан. В целом - отличный фильм, который стоит посмотреть, но классикой он не станет никогда, никаких сюжетов великих, персонажей великих интересных, дуги характера и т.д. здесь и в помине нет. Здесь есть одно боевое столкновение. Но показано интересно, затягивает, героям сопереживаешь, посмотреть стоит. Единственное что лично меня напрягало - капитан религиозный, я думаю когда ты отвечаешь за большое количество людей, тебе надо не на волшебного деда на облаке рассчитывать, а на свои силы и на свою команду. А капитан тут конкретно повернут. Но в целом он действует эффективно и опять же, не было цели показать идеального суперкапитана, которого в жизни быть не могло, тем более в данной ситуации - он бы на флагманском линкоре служил, а не в конвое. Так что хоть меня эта черта капитана и напрягала, но в логику фильма она отлично ложится. Так что да, фильм очень неплох, смотреть однозначно советую. Если ждете развлекухи типа марвел и т.д. - сразу мимо проходите."
    },
    {
      "rating": "9",
      "text": "By far the best movie of 2020 and one of the best \"war movies\". The \"Greyhound\" is as free as possible from Hollywood clichés, from vulgar melodramatic \"characters development\", fake moralizing and grotesque action scenes. And this is paradoxical, since the entire film is a continuous action that \"grabs\" and does not let you to the end. This is because the \"Greyhound\" strives for maximum truthfulness, does not speculate with pretentious phrases, does not seek to \"squeeze a tear\" from an audience with melodramatic scenes and does not moralize. We see a sea convoy across the Atlantic through the eyes of a destroyer captain during an attack on the convoy by a \"wolf pack\" of German submarines. We witness the burden and loneliness of power experienced by the commander when making decisions - is it worth to save the crew of a sunken ship, or to leave them to certain death in cold waters and rush to protect other ships from the enemy? How to dodge torpedoes? Should the radio silence be broken? How to outmaneuver a submarine? Sleepless days, lack of air support, feet trampled in boots to blood, numerous small and important decisions that entail consequences, including lost of human lives, put pressure on the captain, burdening him with a load that he cannot and should not share with anyone. At the same time, the captain of the \"Greyhound\" does not hate the enemy, he is a Christian who overcomes his fear and burden of loneliness in power by entrusting himself to God, relying on Him. Captain of the \"Greyhound\" is a \"good shepherd\", a shepherd dog, protecting his \"herd\" of ships from the \"wolf pack\" of submarines. The film is attentive to details and very realistic, it is devoid of sentimentalism, but at the same time, it is extremely emotional, seeking to influence the audience not by dialogues, but by what is happening on the screen, small details without words. No propaganda or false moralizing, just a commander doing what he must and a team whose lives depend on his decisions. 9 out of 10."
    },
    {
      "rating": "10",
      "text": "Хороший фильм, если не обращать внимания на рикошеты торпед и кораблей а также на «шедевральную» озвучку главного героя."
    },
    {
      "rating": "7",
      "text": "Greyhound tries really hard to be the 1917 of the Navy, but just falls short. Despite having epic action and compelling set pieces along with nice cinematography, there isn’t much more than that. Tom Hanks is great, but his character isn’t. There’s not really any substance beyond ‘looking cool’, but at the same time, it wasn’t really aiming for that. It was aiming to take the audience on a journey into the middle of the Atlantic during WWII, and as far as that goes, it succeeds with flying colours."
    },
    {
      "rating": "8",
      "text": "A wonderful film about the war. No snot, a minimum of romance (2 minutes for the whole film), the work of the convoy is simply shown."
    },
    {
      "rating": "4",
      "text": "It was just all the same for me. How can you make a movie like this and do nothing with it and Tom Hanks looked clueless the whole movie, so i gave it a 4"
    },
    {
      "rating": "7",
      "text": "it deserves more than the 64. definitely a 75 for its focus and good editing in tight spaces. whole show at the sea, in the battleship with fantastic sound. clever use of sound to aid sight, as a submarine emerging in high waves is hard to see. and the submarine should b hard to see.i thought this was much better than sean connery Hunt for red october. at least we could hear tom hanks.don't miss it at theatre unless ur home sys is top-end"
    }
  ],
  "recommendations": [
    "12_strong",
    "deepwater_horizon",
    "red_tails",
    "13_hours_the_secret_soldiers_of_benghazi",
    "lord_of_war",
    "armageddon",
    "apollo_13",
    "pearl_harbor",
    "dunkirk",
    "master_and_commander_the_far_side_of_the_world",
    "elysium",
    "valkyrie",
    "everest",
    "midway",
    "captain_america_civil_war",
    "top_gun",
    "avengers_infinity_war",
    "lone_survivor",
    "the_grey",
    "the_finest_hours",
    "mortal_engines",
    "battle_los_angeles",
    "anthropoid",
    "allied",
    "flight"
  ]
}