{
  "id": 761,
  "title": "Grown Ups 2",
  "starring": [
    "Adam Sandler",
    "Kevin James"
  ],
  "runtime": 101,
  "genre": [
    "Comedy"
  ],
  "description": "Lenny has relocated his family back to the small town where he and his friends grew up. This time around, the grown ups are the ones learning lessons from their kids on a day notoriously full of surprises—the last day of school.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5vLeJchL3zosBj10CJP1h54xyBs.jpg",
  "categories": {
    "plot": 3.4,
    "acting": 2.727272727272727,
    "ending": 0.0,
    "soundtrack": 5.0,
    "cinematography": 1.0,
    "familyFriendly": 1.8,
    "funny": 2.13953488372093,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "There is clever shock value and forced shock value. For 100 minutes Grown Ups 2 assaults you with some of the most tasteless, gross, and insulting comedy known to mankind. The bar has been set so low for this franchise that I am actually scared to see even trailers for the inevitable third film. Mark my words; Grown Ups 2 is so insufferably awful it will win Razzie awards. Good luck searching for a worse comedy in 2013."
    },
    {
      "rating": "0",
      "text": "The ending of Grown Ups 2 encapsulates the cultural legacy of Adam Sandler: He is simultaneously farting, burping, and sneezing while having sex with Salma Hayek.  Mr. Sandler how does it feel to be a complete and utter sell out?"
    },
    {
      "rating": "0",
      "text": "Forced to see this movie with a couple of guys, and I had very low expectations (and I thought the original grown ups was good). I was 100% correct. This movie is one of the worst films I have ever seen in the past decade. There is no plot/story whatsoever, a bunch of pee/poop/ass jokes that even kids can't laugh at, and terrible acting by nearly the entire cast. This film is so bad it should not be considered a movie, but a f****d up, very bad sitcom from the 90s that never hit tvs. Never see this movie in your life."
    },
    {
      "rating": "0",
      "text": "people that likes bad comedies like grown ups 1 and 2 and other bad movies are idiots and losers that needs to get a life, that you shouldn't trust them you should trust the critics and smart people like me! but what's the use of telling you not to see it, you'll still see it anyway, so why am i wasting my time with you?"
    },
    {
      "rating": "0",
      "text": "The hope is that whatever studio execs Adam Sandler blackmails into funding his garbage will eventually call his bluff and tell him to release the photographs and video of their crimes. Sandler, who earned $37m in 2012, releases yet another unfunny and offensive film on the public. That he genuinely thinks his films have worth reveals more about Sandler's state of mind than the state of the industry. Eventually the rest of Hollywood will see the light. Terrible."
    },
    {
      "rating": "1",
      "text": "Have you watched The Hangover? Well, this is basically a water down, kid friendly version of it. The story is unappealing and some of the gags just drag on forever. You will get a couple of laughs but that doesn't make up for the irritating characters and cheesy dialogue."
    },
    {
      "rating": "3",
      "text": "I give this a 3 because of SHAQ alone. I laughed on occasion (mostly because of SHAQ) but when you look back on this film you begin to realize just how stupid it really is. I know it's Adam Sandler so don't expect and Oscar nominee but this was on a whole other level of stupid. The fact that this was top box office shows just how dumb our country is. Save this for a rental at home. 2.5/10"
    },
    {
      "rating": "0",
      "text": "The worst movie I've ever seen. I didn't even smile once, let alone laugh. I wasn't expecting much, but I was expecting at least a 3/10. The absolute worst part about this movie is that Sandler and his washed-up buddies laugh at ALL of their own jokes. On screen. That is not good. Just an insult to films as a form of entertainment."
    },
    {
      "rating": "1",
      "text": "This was horrible, I felt like I was being attacked by an onslaught of rejected Saturday Night Live sketches. Don't watch it, I don't want Adam Sandler to carry on with these films, we need him to return to the good old days or at least fun films like Hotel Transylvania!"
    },
    {
      "rating": "3",
      "text": "If your a fan of stupid movies watch Grown Ups 2 but if you like good movies watch something else.  This is what you get when Adam Sandler makes a movie a piece of garbage that is not worth 12 dollars to go see I mean I felt like they should have at least bring down the price a couple of bucks because I felt like I wasted a night of my life. Now I will say this though some parts will make you laugh but it's not enough to take your mind off the stupidness of this movie. I have to say this though I felt this movie had potential a lot to because it has such a funny trailer but when you watch this you fell like you watched a lie. So I would give it a little less if I didn't  laugh at something's but this is a movie that you rent and watch with your friends because I rather get it a redbox for 1 dollar than pay 12 for this garbage."
    },
    {
      "rating": "1",
      "text": "This was a complete waste of time to watch. Everything was off  color or topic or whatever . Apparently ever aspect of this turd was hit with a shovel ."
    },
    {
      "rating": "1",
      "text": "This movie annoyed me in so many ways. I just had to shut it off. Everything about it is pointless. They just go around town doing nothing.They made Grown Ups 2 just to for the sake of it. You could tell they had no story for it."
    },
    {
      "rating": "1",
      "text": "This is one the worst comedies I've ever seen. There was not one funny joke and anyone who has a sense of humor above an 8 year old will find this movie garbage. It feels like a bunch of rejected SNL skits that Adam Sandler took and morphed into  this frankenstien of a movie."
    },
    {
      "rating": "2",
      "text": "This sloppy second of semi-funny predecessor looks like a collection of leftover clips parsed hastily together. Grown Ups 2 is not for anyone who has actually grown up. To add to its misery, the appreciating audience for boobie and pee pee humor is not able to see it due PG-13. Razzie award awaits."
    },
    {
      "rating": "2",
      "text": "Although I must admit, I did laugh several times, most of this humor is silly, dumb, and frankly, not funny.  Even though I didn't expect this movie to be good whatsoever... I was still very disappointed.  Don't waste your money going to see it in theaters, wait till it comes out on DVD.\rThe first movie is better by far."
    },
    {
      "rating": "2",
      "text": "Short answer \"Grown Ups 2\"  complete waste of time! It's not the worst comedy movie of the year (Scary Movie 5 reserved that title), but having that cast and delivering this  dull, dumb, pointless picture"
    },
    {
      "rating": "0",
      "text": "Please Mr Sandler stop embarrassing yourself with these god awful movie just do something different and for the rest of the cast I like Chris Rock David Spade Kevin James but why do films like this they have not meaning not funny in anyway what happened to these actors they use to be good now i have lost hope my advice stay away from this piece of"
    },
    {
      "rating": "1",
      "text": "This is one of the worst comedies EVER. Almost as bad as Bio-Dome and Freddy Got Fingered. The only reason it escapes a 0 is the fact that I chuckled at one scene. That's it. One scene in a 100 minute movie. What a waste."
    },
    {
      "rating": "0",
      "text": "I thought the first movie was bad but leave it to Adam Sandler to once again out do himself in the god awful film department.  The movie has no story to speak of and the plot was forgotten in a haze of bad bodily function jokes and Nick Swardson once again trying way to hard to be funny and failing at every turn.  The film sets up dozens of potential plotlines but most are forgotten about or quickly thrown back in to try and recover by giving it a poorly constructed resolution.  To top it off, the jokes in the film are so painfully bad that it should come with a warning that expecting mothers should avoid the film and how it will destroy your ability to ever find joy in this world again.  The worse part, Adam Sandler will make sure to be a part of something even worse in 2014."
    },
    {
      "rating": "3",
      "text": "Okay, so because this movie is a sequel and we all know how sequel's generally only exist due to the production team wanting to cash in on the success of the first movie, this review is based on this movie living up to the same standard of it's predecessor. Grown Ups (The first one) was quite a heart-warming film, about a group of childhood friends reuniting to bid their Basketball couch farewell, who seemed to have given all of them a sense of purpose and drive to continue their lives into adulthood. The second film, has none of the first movie's seemingly moral stature. There doesn't seem to be any apparent plot, and it merely follows the group of friends around their everyday existence in their neighborhood. There were a few minor chuckles here and there, but with the amount of lame, \"teenage\" toilet humor jokes, it's clear that the only reason this movie had a theatrical release was because of the cast, and I suppose also because they expected the same crowds that flocked to the first installment. This movie was a disappointment, and not worth paying money to watch at the cinema. Wait for dvd, even better, wait till your local broadcaster airs it, because technically it's a bit embarrassing people would contribute to a million plus in box office sales, as it certainly isn't worth it."
    },
    {
      "rating": "2",
      "text": "Grown Ups 2 is not like 1. It is gross, insulting and stupid. Occasionally, you will get laughs, but you will most likely be grossed out by the things that they do in this movie. I mostly didn't like the movie."
    },
    {
      "rating": "0",
      "text": "This was a horrible movie. I can't say anything positive about it. WHERE'S THE PLOT? They gave the masses this atrocious movie, just to make a great amount of money off of prepubescent boys. The humor offended me greatly with insipid toilet jokes that a twelve year old could think of very easily. Where's my $11 refund check? If you want your I.Q to be drastically lower after a short amount of time (approximately an hour and a half), view this movie."
    },
    {
      "rating": "1",
      "text": "Holy god, this was bloody terrible, the 'only' laugh and kinda excitement I got out of this film was when one of the cast members wore a Devo outfit for that Costume party.\r(1 for Devo)"
    },
    {
      "rating": "1",
      "text": "I can't believe I used to like Adam Sandler, but now I hate him, and this movie is a perfect example, unfunny jokes, and even more painful celebrity cameos. This is one of Sandler's worse movies, and somehow worse than the original, which is saying something, think some about that."
    },
    {
      "rating": "0",
      "text": "This movie isn't really a movie. Rather it is a series of fart joke skits edited together with one bad joke repeated through said fart skits.  0/10\r The first movie had some funny parts, this series of fart jokes edited together feels like a money grab. Very poorly written and directed. By far the worst Adam Sandler movie of all time, even worse than 50 first dates."
    },
    {
      "rating": "0",
      "text": "This is an insult to movies. The first one was already awful, but the sequel is way more awful, with laughable acting and nonsense flat plot, that tries to make us laugh, buy it only make us want to walk out of the theatre before it finishes."
    },
    {
      "rating": "0",
      "text": "OMG This sequel sucks SO BAD!! The first Grown Ups was bad enough. All of the storyline if there even is one, plot, characters, dialogue, jokes, etc, are just TERRIBLE!!! Most of Adam Sandler's recent movies (except maybe Pixels) are bad. Avoid this movie at all costs."
    },
    {
      "rating": "0",
      "text": "OMG This is the worst piece of crap I have ever seen! The jokes aren't even FUNNY!!!!! The previous one was bad enough. This movie has crappy dialogue, storyline, etc. Avoid this movie AT ALL COSTS!!!!!! Buy Super Smash Bros. Brawl instead."
    },
    {
      "rating": "0",
      "text": "This movie was horrible on so many levels, from all the gay and pee jokes, to the objectifying of women and awful acting. This movie is not a comedy,it is a hot, steaming pile of crap... which would be a WHOLE lot funnier than this nonsense. If you feel like dropping your IQ over 100 points,  this is the movie for you. The fact that this movie and the first one makes money goes to show how bored people are."
    },
    {
      "rating": "2",
      "text": "This movie is awful and lazy, even by Adam Sandler standards. It's just pretentious how bad his films are now because he knows people will pay to see any of his crap. People were laughing throughout this and look if you like Sandler movies then more power to you. Just know you're sense of humor isn't too intelligent and Sandler thinks you're an idiot."
    },
    {
      "rating": "0",
      "text": "I had a free pass to see any movie this weekend, and I chose this since it wasn't redeemable for IMAX 3D Pacific Rim, after the extensive use of lame fart jokes and lack of plot I did something I've never done before: I walked out"
    },
    {
      "rating": "0",
      "text": "I wish, I really really wish, I had something nice to say about this film. I won't be mean (my score of 0 I feel is mean enough) but this is a film, people worked on it, actors...\"acted\" in it, and it was boring, horrible, 7th grade-level humor at it's best."
    },
    {
      "rating": "0",
      "text": "This is the worst \"comedy\" ever made, and literally the worst movie I've ever seen...do something else and don't waste your time or money on this, it's just rubbish and DONT DARE to compare this to the sacred expendables 2 but for comedians, just don't."
    },
    {
      "rating": "2",
      "text": "Adam Sandler's very first sequel... my A**! It's just another excuse for Sandler to hang out with his buddies. Honestly, it feels like all of Sandler's movies are sequels of one another. The real problem with this movie is that its not funny. The only thing I laughed at were the raft scenes. Other than that, it was just completely stupid and unfunny! Be sure to check out my YouTube channel \"TheMovieManLife\" and let me know what you think. Overall, it's a waste of time and potential!"
    },
    {
      "rating": "1",
      "text": "The only reason why this movie was made was because Adam Sandler wanted us to pay $6 and 50 cents to watch him have fun with his friends.This movie is horrible and I can't believe that people like this."
    },
    {
      "rating": "1",
      "text": "Although I am a huge Adam Sandler fan, I felt he really let us down in this movie.  Easily one of the worst he has put together.  Yet I will go back for the next but the loyalty is starting to run out."
    },
    {
      "rating": "4",
      "text": "I don't think there was really even a story behind this movie. Some parts had a bit of humor in it, but other parts were really stupid. Taylor Lautner just made the movie about 20x worse."
    },
    {
      "rating": "3",
      "text": "I really wanted to like Grown Ups 2: I've developed a soft spot for Adam Sandler and I enjoy feel good movies. stupidity is fine, crudeness is to be expected but there's no excuse for lazy acting or a poor script. The backstories are boring except for David Spade's character  who brings most of the laughs. Sandler is just wastefully unfunny. James is himself as usual (which isn't a compliment) I preferred him in 'King Of Queens' and Rock doesn't unleash his full potential. This movie really missed Rob Schneider and botched the talents of Steve Austin and Taylor Lautner by not giving them enough screen time. Everything feels forced and the laughs are beyond lame."
    },
    {
      "rating": "6",
      "text": "Grown Ups 2 is(of course) the second installment in the Grown Ups series and maybe Sandler's first sequel, but does the film surpass the first one? Everyone from the first film (and then some) are back for more wacky adventures, delivering what you Grown Ups fans would expect. Beyond the film's exterior, you can see that the children are getting older and the main characters are trying to accept that, but it's just shrouded in crazy jokes. In most parts of the film, vomiting, homosexual undertones and male butts are the butt of the jokes, so it's not for everyone, but I'm pretty sure that teens would love it. Although there are way better comedies out there, this is a guilty pleasure of mine. The film's very colorful and filled with life and it's fun to watch once in a while. But all in all, it depends on the type of person you are. So if you liked the first one, I'm pretty sure you'll enjoy this. Not much has changed."
    },
    {
      "rating": "1",
      "text": "I can barely explain how bad this movie is, It's horrendous and why?  Well the first problem in the movie was the jokes they're so immature it'll only make 9 year olds giggle and that about it.  It's plot doesn't get any better its just a bunch of adults acting like they're 18 and doing stupid crap There's NO POINT IN IT!  The last movie was so much better than this because it actually had something to tell, A story.  But this is Awful why couldn't the movie have some more adult jokes other than a baby talking (Not like i've seen that before *FacePalm*) and a bunch of fart jokes?  Just why Hollywood... Why?"
    },
    {
      "rating": "0",
      "text": "My expectations were low when I watched this movie but apparently not low enough. All the funny scenes are shown in the preview so don't bother to watch this movie. Another Adam Sandler movie. I'm not sure how he keeps getting funded for these movies and why we keep falling for them?"
    },
    {
      "rating": "1",
      "text": "Lo único que hicieron con esta película es recordar que no hay esperanza para la carrera de Adam Sandler como actor y Dennis Dougan como director; casi todos los roles en esta película fracasan casi por completo, cero risas, cero diversión, cero entusiasmo, cero homenaje, porque todos estabamos esperando que esta espantosa y barata película terminara y pudiera apagar la televisión. Una vergüenza total aún peor que la ya basura primera parte. Una de las peores películas del año y destinada a competir en los Razzie Awards para ver como (otra vez) Adam Sandler gana el \"Peor Actor del Año\" y (otra vez) Dennis Dougan gana al \"Peor Director del Año\" y finalmente ver como la película triunfa en lo único que va a triunfar: ser una deshonra ganando la estatuilla a la \"Peor Película del Año\". Traten de evitarla."
    },
    {
      "rating": "0",
      "text": "adam sandler's grown ups 2 is funny but i enjoy the first one . it is a crazy film buts whats crazy then a guys who are rembering the childhood memories back in the day ?"
    },
    {
      "rating": "8",
      "text": "Despite being panned by so called professional critics and normal people I would still recommend Grown Ups 2 to any comedy fan. Some days I feel as if people forget what movies are made to do and that is entertain. A comedy movie is meant to make you laugh and Grown Ups 2 did its job in my case. Many people complain because they think Grown Ups 2 has no plot, but the plot is Lenny and the crews life. The overall theme in this movie is family life, unrealistic family life, but still family life. You can't walk into a Adam Sandler movie believing your going to see a high powered dramatic movie. People just need to take a break from life and actually enjoy a movie. If you are willing to take a break then Grown Ups 2 is the movie to see."
    },
    {
      "rating": "8",
      "text": "Why so serious, i mean why does a film have to be perfect, me and a couple mates went to see this film and we laughed most the way through, the jokes were stupid yes and when it tried to be serious it falled flat, also Adam sandlers  \"wife\" was the worst actor in the film by far. But the film was entertaining so yer."
    },
    {
      "rating": "7",
      "text": "Pretty Much It's Like The Original with The Majority Of The Characters Returning, Jokes Are Hit ,Miss, The Story Is Kinda Paced Reasonably, A Nod to The 80's is Nice For Those 80's Fans Out There"
    },
    {
      "rating": "7",
      "text": "Why does this movie get so much hate? Sure it doesn't have a plot,but it doesn't fail to entertain. maybe it repeats some fart jokes but that doesn't matter because it entertained me"
    },
    {
      "rating": "7",
      "text": "If you have ever gone into an Adam Sandler movie expecting to see an Oscar award winning performance then you set your self up to be disappointed.  This movie is funny!  Yes, it is disgusting at times, that is what makes it funny.  It's called \"shock value\". I'm tired of critics ripping movies apart because its not what they wanted it to be; take it for what it is and enjoy it.  Go see this movie with an open mind and have fun!"
    },
    {
      "rating": "8",
      "text": "Nobody goes into this movie thinking THIS is the film that will win Sandler an Oscar. I went to this movie for a few laughs and got more than I expected. I thoroughly enjoyed this film and don't understand why people are judging it by any standard other than what it is: a comedy. A Sandler comedy at that. If you've seen his other movies you know what you're getting into. For what it is, it's great, or very good at least."
    },
    {
      "rating": "10",
      "text": "I don't see why this movie got bad reviews! While the plot seemed to jump from one to another, the move was still amusing and entertaining. This movie made my summer!"
    }
  ]
}