{
  "id": 3374,
  "title": "Grudge",
  "starring": [
    "Yılmaz Erdoğan",
    "Ahmet Mümtaz Taylan"
  ],
  "runtime": 104,
  "genre": [
    "Thriller",
    "Drama"
  ],
  "description": "Ahead of a promotion, a police chief becomes entangled in a deadly incident and uncovers an intrigue fueled by grudge that threatens his colleagues.",
  "releaseYear": "2021",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/6fhqb5JegWJGMuomR3Jqmo0Skqn.jpg",
  "categories": {
    "plot": 6.1,
    "acting": 5.666666666666667,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Clunky, clumsy, contrived, and horribly paced, Kin is an ineptly made piece of media. The mix of genres and styles serves only to distract and conflict with each other, rather than further the story. The CGI is okay, but everything about this movie feels cheap, which is a shame, as it is set in Detroit, which I find to be a very interesting location. The story itself is so heavy-handed and unbelievably stupid that I nearly turned this off at the 30 minute mark. This movie runs at about an hour and forty minutes, and it is an hour and forty minutes I will never get back. The finale of this movie is so mind-bogglingly idiotic that I nearly put a foot through my television screen. The one good thing about this movie is the performance from Myles Truitt. I hope he finds better work in his career than Kin."
    },
    {
      "rating": "7",
      "text": "While the dialogue was very cliché, the story was predictable and the ending was downright stupid, Kin was still a good surprise. The acting is good, the story was interesting enough, the CGI effects were very well done and the movie was quite entertaining. Even if you're not a big sci-fi fan you might appreciate it."
    },
    {
      "rating": "1",
      "text": "Superficial, predictable, gaudy and without any drop of originality, Kin is a complete mess that tries so hard with the mixturing of various genres and wastes a solid cast that only accepted to be part of this DOA for a good paycheck."
    },
    {
      "rating": "1",
      "text": "It was very painful to watch, cliché etc everything about that movie is horrible."
    },
    {
      "rating": "7",
      "text": "A pretty simplistic sci-fi movie but fairly well acted, with decent CGI and a good potential for characters and story development. A couple of slow moments but overall a nice surprise as there is a pretty nice alchemy between the protagonists."
    },
    {
      "rating": "10",
      "text": "This movie is a fantastic prequel. I love the relationship between the characters. This is going to be big!"
    },
    {
      "rating": "6",
      "text": "Not a bad movie. Solid performances, great chemistry between characters and some pretty good visuals at least salvage a weak script into a watchable film."
    },
    {
      "rating": "6",
      "text": "I found the movie itself watchable and nicely paced, but some of the story was a bit silly and a bit over the top - the realism was lost in it. I mean I get that there are people from different galaxy in it, but I mean about realism about how people made their decisions there. Especially Franco just deciding to attack police station. And police was shown being so scared. Plus ok, maybe Franco didn't care that it might be suicidal mission, but why all his team decided to attack too. First part of movie was good, but second was too silly, also the two persons from another galaxy or whatever ended up not even doing much, yes they played a big part, but it could've been set much better - either more about the futuristic/other galaxy part of it, or without it all and made like a gritty drama focusing more about brothers relationships"
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)The Baker Brothers or The Duffer Brothers? \"Kin\" proposes itself as a spin-off of the nostalgic operation \"Stranger Things\": equally slobbish in citing \"Terminator\" but with Quaid who apes Willis with hair and Franco who guarantees a more ferocious version. Truly a \"strange thing\" that it was met with both a critical and commercial failure."
    },
    {
      "rating": "7",
      "text": "It’s really a 6.5 but I’m rounding up because it’s basically an 80’s/Disney/superhero movie given a more adult treatment and it doesn’t do the PG/G thing. Sure it has flaws and although its plot is a little ridiculous (much like Jupiter ascending or superhero movies) it does have some cool story aspects and comes across well. I imagine that people expecting Midnight Special were disappointed and people expecting something from Disney+ were a little put off but that’s because different is easy to reject. It’s no where near the quality of Unbreakable but I like movies that portray genres in totally different ways."
    }
  ]
}