{
  "id": 3050,
  "title": "Grudge Match",
  "starring": [
    "Robert De Niro",
    "Sylvester Stallone"
  ],
  "runtime": 113,
  "genre": [
    "Comedy"
  ],
  "description": "A pair of aging boxing rivals are coaxed out of retirement to fight one final bout -- 30 years after their last match.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jTq9jYTKKo6EhQPso4xTMpPYYXW.jpg",
  "categories": {
    "plot": 7.464285714285714,
    "acting": 7.833333333333333,
    "ending": 6.9,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.416666666666667,
    "action": 6.888888888888889
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I came in not expecting too much but was very happy with the film.\r Yes there were a few throwaway tribute gags to the old boxing films and by half way through things get a little predictable. But I can enjoy the virtues of the film.\r The problem with modern films to me is that characters do things that don't make sense and just act to move the film forward, this incongruence is glaring but in this case each character was actually acting in character.\r Not really a fan of DeNiro, his performances are usually that showy, he doesn't usually play an actual human being more panto villain. Stallone was his usual old self and didn't embarrass himself and everyone else in the case were great, Arkin didn't emulate Meredith at all which was a great choice and Hart was pretty amusing as the comedy relief.\r The critic snobbery is of course no surprise, they hate anything with Stallone, this is fact. They could have written their reviews months ago, they are that predictable.\r I'm giving it a ten because I liked the characters and script that's what I'm all about."
    },
    {
      "rating": "4",
      "text": "Sylvester Stallone and Robert De Niro play ex-boxers who never settled their rivalry (in the ring and in love), so they decide to stage a final bout. These two screen icons toss around age and fat jokes, but mostly play the drama. Luckily, Adam Arkin provides crusty comic commentary and Kevin Hart brings wise ass chatter. Still, the script is only occasionally amusing, painfully predictable and not at all compelling. If you insist on seeing it, be sure to sit thru the closing credits for two surprise cameos that create the film's funniest moment."
    },
    {
      "rating": "7",
      "text": "A funny comedy with enough of a sentimental, feel good type story to keep viewers entertained. Both Stallone and De Niro do a fantastic job, and fans of their earlier works will get a kick out of seeing \"Rocky Balboa\" and \"Jake LaMotta\" duking it out in the ring. Supporting cast members Kevin Hart and Alan Arkin bring a lot of laughs.\r Overall it's a very enjoyable comedy, although I wouldn't call it a great one. It can be slow sometimes and some of the earlier attempts at humor do fall flat. Still, it end up managing to be both funny and enjoyable enough for me to recommend it for at least a rental. For my total score I give it a 7.8/10-Good."
    },
    {
      "rating": "4",
      "text": "This Movie feels like a long joke that never got funny, you hear Robert De Niro and Sylvester Stallone (my childhood icons)  in a movie about boxing you think this is probably going to be funny, in the end it is not. The story is terrible and the character feel like they are written for guys in their 30s to 40s, Alan Arkin  is funny at times but then also very disgusting the same thing with Robert De Niro very disgusting he talked for a movie that came out for Christmas that families probably went to see. It is something to see just because Stallone and De Niro is in it but overall if you're not a fan of them then this is not something to see"
    },
    {
      "rating": "4",
      "text": "Grudgematch's parts are somehow greater than it's whole. You have two legendary actors, Robert DeNiro and Sylvester Stallone. A great supporting cast including Alan Arkin and Kevin Heart. You have a great director and screenwriter. Through some misfortune, the movie itself nowhere near lives up to its premise. Robert DeNiro and Sylvester Stallone are great. Kevin Heart's character however, comes off as annoying and cringy. The score is uninspired and bland. Way too much time is spent on the personal relationship drama, and the fight that is promised does not live up to its expectations. The drama however, is quite well done, but when contrasted by Kevin Heart's spastic comedy, everything feels off. The script is way too safe and plays it by the book way too closely. There's not enough here to warrant more than one viewing, unfortunately."
    },
    {
      "rating": "9",
      "text": "Grudge Match tells the story of two boxers Henry \" Razor \" Sharpe ( Sylvester Stallone ) and Billy \"The Kid\" McDonagh (Robert De Niro ) Won each other for one match . 30 years later, they met at a crucial Grudge Match . The film proved to be a comedy in the genre with great jokes and great acting.\r Sylvester Stallone played perfectly \" Razor .\" His character soperezhivaeshdazhe knowing that he will win .\r Robert De Niro is Sylvester Stallone opponent because his story is very touching.\r Grudge Match is a very funny comedy with a great cast , good sauntrek and a good storyline ."
    },
    {
      "rating": "7",
      "text": "The humor and fun tone of Grudge Match keeps it light and entertaining as you make your way through the formulaic plot. Film buffs will enjoy seeing Rocky Balboa and Jake LaMotta fighting on the big screen. The movie will not survive as a classic, and makes a strange choice for Christmas, but offers a little more than expected."
    },
    {
      "rating": "6",
      "text": "Grudge Match is a little fun with a lot of missed opportunity.  The script felt mashed together in a day or two without much revision.  The movie lacks intention that could have made it a really great experience.  Instead I felt like it was just OK.  If you're being selective about what to see in theaters right now, perhaps this one is best left until its available at a Redbox."
    },
    {
      "rating": "6",
      "text": "While you can still have fun with this movie, I still wish this could have been better than just being a plain comedy. It doesn't really feel like you're watching a big rivalry between Sylvester Stallone and Robert DeNero, it feels more like slapstick comedy no one will remember, but never the less, it still brings in laughs and touches a little on the main stars. Overall, it's a decent re-hash of former Rocky and Jack! I give it a B-! Be sure to check out my YouTube channel, \"TheMovieManLife\" for all things movies."
    },
    {
      "rating": "8",
      "text": "I don't see why the critics were so hash. I thought this was a very funny and entertaining movie. As always, the users tend to be more accurate than the critics on this site."
    },
    {
      "rating": "6",
      "text": "Va bene, a mente fredda si finisce per pensare che, in fondo, è una stupidata. Però, stando al gioco, ci si diverte per un centinaio di minuti senza troppi pensieri: basta lasciarsi andare alla sfacciata inverosimiglianza e osservare i due vecchi leoni fare il verso al proprio passato e sovente gigioneggiare appoggiati a una storia in cui non mancano spunti e battute (dopo pochi minuti, De Niro proclama ‘sono un grande attore’ mentre a Stallone viene vietato di prendere a pugni i quarti di manzo in una cella frigorifera). Razor (Sly) e il Kid (Bob) si odiano da trent’anni – da cui il titolo originale ‘Il match del rancore’ - per motivi sportivi e sentimentali: da quando il primo ha rinunciato al confronto che avrebbe dovuto sancire la superiorità di uno dei due (e alla boxe tutta) dopo che il secondo gli ha messo incinta la fidanzata (Basinger e, nelle immagini degli anni Ottanta, la figlia Ireland). Dante, il tascabile erede del vecchio promoter (un Kevin Hart che fa parecchio il verso a Eddie Murphy), prova a resuscitare la sfida per soldi e i due, dopo qualche tentennamento accettano: Razor ha un posto di lavoro traballante e mantiene il vecchio allenatore (Alan Arkin fa il Burt Young senza la vena di amarezza ma con un rumorosissimo apparecchio acustico) mentre Kid è un vanaglorioso figlio di buona donna e non può certo tirarsi indietro. Inizia così l’allenamento parallelo, in cui si inserisce il figlio della colpa come manager di papà, e si arriva alla grande sfida davanti a mezza Pittsburgh: dodici round di irreale scazzottamento a guardia bassa (del resto i due sono stati protagonisti di match cinematografici tra i più sanguinolenti della storia) al termine del quale Razor grida ‘Adrianaaaaaa’ – no, ok, stavo scherzando – e Kid recupera un po’ di dignità. Ambientata in una periferia urbana abbastanza anonima, la sceneggiatura di Tim Kelleher e Rodney Rothman delinea due antagonisti tagliati con l’accetta mettendo via via più a fuoco il confronto tra un ‘buono’ e un ‘cattivo’ o, quantomeno, un ‘simpatico’ e un ‘antipatico’: Stallone è monolitico come di prammatica nell’interpretare il rude-ma-sensibile Razor mentre De Niro (il cui doppiaggio lo fa sempre sembrare strafatto di elio) utilizza il suo ghigno beffardo per rendere la meschinità che contraddistingue il suo personaggio. Il grande Bob dà l’impressione di divertirsi e rende assai di più rispetto ai tanti ruoli ‘alimentari’ interpretati di puro mestiere in varie commedie degli ultimi anni, e anche gli altri attori sembrano condividere l’atmosfera generale, con la spalla comica di Arkin che si fa preferire a quella sopra le righe di Hart, mentre Basinger – il cui personaggio è nonna di un bimbo di otto anni – rende lustro ai miracoli della chirurgia estetica. Il regista Peter Segal mette in immagini il tutto senza voli pindarici, ma con una buona attenzione al ritmo e un’inevitabile attenzione al citazionismo visivo: il risultato è un onesto prodotto medio che si regge sul carisma dei suoi interpreti e che assolve al suo compito di divertire senza troppi retropensieri accompagnato da una simpatica colonna sonora d’epoca (‘Back in black’ degli AC/DC accompagna Razor sull’ultimo ring). Da notare che i titoli di coda sono inframezzati da un paio di scenette conclusive (non al termine del rullo, perciò non c’è da aspettare tanto): in una, Dante cerca di organizzare un nuovo incontro fra Tyson e Holyfield – li chiama per cognome per farli riconoscere, si suppone – prendendosi i suoi rischi."
    },
    {
      "rating": "7",
      "text": "The actors from the 80s coming together mean it must be something great. There's no youth left in them for a concept like this, but the alteration of the story well suited for these fellows. As far I know Robert De Niro is not made for hardcore stunts, surprisingly he managed to give his best in this movie. And no need to praise Sylvester Stallone when it come to a movie based on boxing.\r The trailer was different that what I saw today in the movie. It totally misled me, I thought the movie was about computer game where two ex champions meet, but it went way beyond to the final battle. My eye was on De Niro, his entry in unfamiliar arena, the boxing. For Stallone it is like the return of Rocky Balboa.\r A little bit of fun and a little bit of drama. The story commenced with the early life of two rivalry boxers and moves all the way to the next 30 years. The uncomfortably settled life forces them to come together one final time and the rest of the story brief these legend's preparation for the grudge match. Recently saw plenty of movies based on old guys, but this movie is not that often you see. Well crafted movie, but only a just above the average, which mostly a time pass movie."
    },
    {
      "rating": "4",
      "text": "Grudge Match is one of the most desperate ideas for a film I can recall. I've grown up watching and loving Sylvester Stallone & a Robert De Niro. And the 10 year old boy in me wanted Rocky Balboa vs Jake La Motta to be great. But realistically it's absolutely ridiculous. Ultimately this is a cringe worthy parody just trying to cash in on the former glory of two much loved and iconic characters. I love the Rocky films, but this is one boxing film too many for Sylvester Stallone. And it's embarrassing here to think Robert De Niro was once the Raging Bull. Alan Arkin is fun in a supporting role and I suppose for a glimmer of nostalgia that the fight is worth a watch once. But otherwise this is a tired and cheap gimmick."
    },
    {
      "rating": "4",
      "text": "This is not the best film to come from stalone  but it is not god awful it's got the right amount of comedy and doesn't take it's self to serious and doesn't go over the top  worth a watch"
    },
    {
      "rating": "10",
      "text": "I really like this movie a lot. Kinda reminds me of \"Rocky.\" If you guys actually like the movie \"Rocky,\" then you're going to love \"Grudge Match.\" I suggest seeing it."
    },
    {
      "rating": "5",
      "text": "\"Grudge Match\" 10 Scale Rating: 4.5 (Mediocre) ...\r The Good: While the vast majority of them were in the previews, the film did have a couple of amusing scenes and lines. The idea and set up were solid and at least kept my interest enough to see it through to the end.\r The Bad: The dramatic elements miss the mark completely and I didn't really care about any of the subplots. The film is completely predictable and full of cliche scenes that we've seen in several other movies. While DeNiro was serviceable, Stallone was pretty much awful. Even Kevin Hart's comedy couldn't save this one."
    },
    {
      "rating": "7",
      "text": "Such low reviews and for what? It's not golden but it's still a pretty funny movie. If these critics expected an action flick, they went to the wrong movie. Grudge match is more of a comedy than anyhting but it also has a story to it that is entertaining in its own right. If not a 7/10, it's at least a 6.5/10. People complaining that the main characters are too old must ont understand that that's the whole point of the movie. They're rivals from a long time ago and now, after retiring, they have to go back to training ot box one more time. It's not  worht a purchase but it's worth a watch."
    },
    {
      "rating": "3",
      "text": "Undoubtedly, one of the biggest disappointments De Niro has given.It's a shame to see it in this."
    },
    {
      "rating": "8",
      "text": "A tale of family of rivals of closure. I think I had more fun with this than any of the Rocky movies. Beyond all sense and reason these two big, but ageing stars pull off a convincing boxing movie."
    },
    {
      "rating": "8",
      "text": "Hilarious,entertaining,fun and satisfying movie!the acting was legendary and fun,the story was amazing,even for a spoof type thing the characters and there shades of original movies and its references were amazingly showcased,the music was good love the Rob's entry departed theme at the ending fight,the characters were uniquely fun and amazing,the starting intro with the offer to rematch and the characters overview and rivalry between Rob and Sly it was fun,the CGI suite fight was Hilarious and amazing,the supporting characters and past story was engaging and brilliant,after announcing the rematch the training scene and prep was awesome.lighting as a trainer for sly he was awesome old guy he's and Kevin hart's racist talk fights were damn hilarious,the father son duo of Rob and his son and his grandson they were amazing,the club scene with kid and that driving scene for grandson of rob it was over the top and little careless thing for Rob,the ex wife of Sly and there relation was amazingly developed although the past thing was little depressed and then new start it was awesome,the starting training at club of Rob with fat trainer and some scenes in it were hilarious,the whole rematch setup and up's and down's of both characters were fun to watch,the shades of there original character's and there morals with family and others were amazingly showcased like Raging bull's attitude towards self-destruction and play-boy thing and Rocky's warm and kind thing it was amazing.the sarcasm here and there were brilliant,the set-up for final match and the promotion for it specially the parachute stunt with both oldies it was Hilarious AF,the climax 20 min were literally Gold the fight entrance was awesome with the jokes specially the Rob's in wrestler's overview announcing the advert of his car showroom and \"Sundays open\" it was funny AF then the fight it was amazing the crowd thing felt alive and the punches were awesome it was amazing to watch them fight in similar fashion like originals the Eye thing for Sly and the dramatic turn at last it was literally emotional the rivals realizing and supporting to each other with the family and all as Kevin say's \"its emotional\" it was literally.the ending result and the look on there faces it was sweet and brilliant its literally beautiful and emotionally satisfying end to movie,and off-course the post credits with mike Tyson and the Hangover 4 jokes it was funny and legendary scene and the horse pee dancing TV show scene before post credits that was literally hilarious and fun,the whole movie is sarcastically amazing it was sweet,emotional,entertaining and fun,its a amazing Movie!"
    }
  ],
  "recommendations": [
    "central_intelligence",
    "spy",
    "the_longest_yard",
    "red",
    "spenser_confidential",
    "the_nice_guys",
    "red_2",
    "deadpool_2",
    "horrible_bosses",
    "logan_lucky",
    "tag",
    "jumanji_the_next_level",
    "due_date",
    "friends_with_benefits",
    "role_models",
    "pitch_perfect_2",
    "the_green_hornet",
    "this_means_war",
    "jumanji_welcome_to_the_jungle",
    "the_wedding_ringer",
    "the_break_up",
    "tower_heist",
    "horrible_bosses_2",
    "night_at_the_museum_secret_of_the_tomb",
    "knight_and_day"
  ]
}