{"id": 1004, "title": "Guardians of the Galaxy", "starring": ["Chris Pratt", "Zoe Saldaña"], "runtime": 121, "genre": ["Action", "Science Fiction", "Adventure"], "description": "Light years from Earth, 26 years after being abducted, Peter Quill finds himself the prime target of a manhunt after discovering an orb wanted by Ronan the Accuser.", "releaseYear": "2014", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/r7vmZjiyZw9rpJMQJdXpjgiCOk9.jpg", "categories": {"plot": 7.2745098039215685, "acting": 7.758620689655173, "ending": 5.375, "soundtrack": 8.25, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.914893617021277, "action": 7.625}, "reviews": [{"rating": "10", "text": "Highly recommend. Definitely the funniest marvel movie I've seen so far, though very different than what they've been doing. It's an ensemble sci-fi adventure comedy with clever dialogue and a memorable cast of characters. Similar group dynamic to what we saw in the avengers, made all the more impressive by the fact that they haven't had several movies to introduce the characters.\rIt has very little to do with the avengers specifically and instead widens the lens to encompass the greater marvel universe, making use of characters and alien races we've seen bits and pieces of before (most notably in the Thor films). The tone is very unique, bouncing effortlessly back and forth between comedy and genuine drama with an array of action scenes in a wide variety of set pieces.\rIf you've been following the marvel movies so far, you'll want to see this since it helps to expand the cinematic universe while setting the stage for the future avengers films (though in some ways it feels like it's setting up Avengers 3 more than 2). On the other hand, if you haven't been following the franchise very consistently or not at all, it still works as an adventure movie. The main characters have little or nothing to do with any of the movies so far, and while there are one or two faces we've seen before, especially in the villain department, you won't need to know them to be able to enjoy it. There's an important macguffin that ties into the larger story, but it's basically just there to drive the plot along. If anyone has been living in a cave somewhere for the past ten years or so, I'd be interested to hear what someone who hasn't watched any of the marvel movies thought of this."}, {"rating": "10", "text": "I just saw guardians of the Galaxy and all I can think is WOW. That movie was amazing, the acting was top notch, the effects were breathtaking, and the general tone and theme of the movie was thoroughly pleasant. I didn't think a movie could have such a well thought out plot, have masterful effects, and be hilarious. Seriously go see it."}, {"rating": "9", "text": "Dont believe the reviews, this movie is WAY better than a 77.  Its my new favorite marvel movie.  form the hot zoe salanda as gamora, to the awesome groot and star lord, this movie is very well balanced between sadness, action, laughs and epicness.  Very well done Marvel Studios.  You will greatly enjoy this movie, i cannot guarantee that enough.  Go watch it now."}, {"rating": "5", "text": "I guess im one of the few people who didn't enjoy this movie. first of all the comedy in this movie fails; maybe im not into this kind of humor, but the comedy failed terribly for me. the comedy in this movie is the kind of comedy where you feel like you gotta force yourself to laugh to make the attempted joke funny. the audience is laughing.... OH WELLL I GUESS THIS IS MY CUE TO START LAUGHING SINCE EVERYBODY ELSE IS LAUGHING. it got to the point where people were laughing and snickering at every tidbit in the movie, cause they thought that part was supposed to be a cue for the audience to laugh. nobody knew what was and what wasn't supposed to be funny!\r I guess I could call the humor in this movie DRY HUMOR cause the jokes are executed with a lack of exaggeration, and dry humor doesn't make me laugh out loud. dry humor just tells my mind that im supposed to be laughing at something.\r and that's what this movie fails at ultimately. this movie is a **** joke! never once was I worried about these evil guys destroying and taking over the galaxy! I was never worried! I was never at the edge of my seat! the movie didn't fill me with intensity and epic feelings! I couldn't because everybody was too busy laughing at each other and making a joke out of everything! soooo I wasn't laughing, I wasn't at the edge of seat in intensity, this movie just fails all around!\r the only good part of this movie was the somewhat epic ending with the bad guy, but even that got ruined with an attempted funny joke. the ending battle did get me laughing, cause it was so ridiculous you had to laugh. sooo this movie did make me genuinely laugh ONE TIME! but in doing so it ruined a totally epic battle that this movie had going at the time! soooo they sacrificed an epic final battle for a laugh. good choice director.\r overall, special effects were amazing, the only good thing about this movie. some touching moments here and there, a somewhat epic final battle, and you got yourselves a satisfactory, mediocre, marvel movie. lol goddamn marvel movies have been going downhill lately. seriously I would only watch this if you got nothing else to do on the weekend, but im pretty sure you can find things to do a lot better than this average film lol"}, {"rating": "1", "text": "It was memories of a joyless screening of Captain America that made me approach this new Marvel adventure with caution. A caution borne of years of instinctive experience of crass movies aimed at the lowest possible denominator. I make it a rule never to walk out of any film, but in between admiring the face of my watch and battling yawns with as much zeal as our eclectic on screen heroes were battling each other, I very nearly succumbed to breaking with this self enforcement. The film starts badly and never recovers. One of the most mis- judged elements is the vein of humour running throughout that is puerile, lacking the benefit of any real wit or genuine laughs.\rThe story may be simple but there is so much superfluous chatter to draw out the running time that it becomes a language unto itself, which is probably only decipherable by teenage boys or others interested in all things 'Star Wars'. Trying to emulate that 70's classic, and I use the term loosely, the film has its own double act comprising of a very vocal racoon and a selfless tree who are clearly modelled on the characters of R2D2 and C3PO.\rThe cast enthusiastically inject more energy into the material than it deserves, but one remains baffled as to what actors of the calibre of Glenn Close and John C Reilly are doing participating in this nonsense.\r Technically the film is outstanding. Cinematography and Special Visual effects are on the money and the Production Design is striking even if one set looks suspiciously like it had previously been used in 'Elysium'. Furthermore the Make-Up should easily walk away with an Oscar next year. However, excellent production values do not a good film make and as a movie the force is just not with it."}, {"rating": "6", "text": "Colorful flick with cartoony characters and action -- I'll bet it was more fun in the theater, especially if you could bring a couple of 11-year-old boys. I'm past that point in life, but noted (and laughed at) some of the obligatory pop-culture jokes aimed more at parents. (Funny note: Michael Rooker, \"Merle\" from \"The Walking Dead,\" shows up as a teal-skinned intergalactic redneck!) I gather most people didn't mind that plot was silly, the hero a dope and the raccoon inexplicable ... it's an OK \"popcorn movie\" and achieves that purpose well."}, {"rating": "5", "text": "Not even impressive special effects and sporadic laughs can save this incredibly mediocre offering, whose hype is ultimately more substantial than its story or characters. Given some of the summer's other (and much better) action-adventure releases, I'm at a loss to understand why this picture has drawn such a huge and undeserved response (unless it's because there's nothing else new out there, and this is the best option available)."}, {"rating": "6", "text": "After all the hype and box office numbers, I finally get to watch Guardians. Actually, I watched it twice because I thought I missed something everybody else seemed to have gotten and yet still don't see why this movie is so hyped.\r Yeah, entertaining...yeah, nice visuals...was the story rushed, absolutely...was the editing crappy, without a doubt...because I guess unlike everyone else, I kinda want to get the whole story and not the condensed version Guardians was left with (SPOILER: think Rocket crying over Grut...absolutely amateur editing).\r Besides all that, I was entertained so can't ask for more...well, I can and should get more but eh, it's Hollywood 2014...nothing but reboots and hacks so an original plot, you know, band of fighters join to together to save the gal..ax...y....okay so Star Wars did it first, so what at least you have space ships and al...ie...ns....okay so a hundred other movies, same thing. My point is, 4 good jokes in the movie, that's it and the rest is rebooted, regurgitated sci-fi crap."}, {"rating": "6", "text": "If you are into this space-opera/superhero/action genre stuff, then \"Guardians of the Galaxy\" is a must-watch for You. If you are not, then be sceptical and do not expect to see the greatest movie ever.\r A huge weakness for this film is it's screenplay which is a huge cliche. Or maybe it is a parody of itself. Either way, if you have any experience in watching movies, you will always be able to predict what is going to happen next. Although one of the main aspects of the film is the fate of the entire galaxy, there is never really anything at stake. The climax is cheap and predictable\r On the other hand, \"Guardians of Galaxy\" can be surprisingly fun at times. All actors are good too, even though the characters are all black and white - this is a classic good vs. evil fairytale after all. Visual effects are outstanding as well and if You are going to watch it, watch it in 3D, because 3D always covers some of the film's weaker aspects and failures.\r All in all, \"Guardians of the Galaxy\" is not a terrible movie, but I would not be as psyched about it as the rest 95% of Internet is. Seeing its success, we should brace ourselves -  the sequels, spin-offs and reboots are coming."}, {"rating": "6", "text": "Guardians of the  Galaxy is childish, clumsy and looks like a mess all in one but still manages to entertain enough to make it worth watching. Depending how you look at it, you'll either find it completely stupid or entertaining. I say its both."}, {"rating": "5", "text": "Unbelievable with positive reviews from critics and users. For me this movie was messed up with same old super-hero Marvel story. There was no real villain and that one was weak.  What fancied me was the walking tree, 'I am Groot' and Yondo's whistling arrow.  To sum up this was an average action flick. OMG, sequel is already in production."}, {"rating": "2", "text": "Another dull slog of CGI, this time flanked by two jar-jar binks. The occasional funny one liner largely ruined by contrived sappy scenes and the end of every scene predictable in the worst way."}, {"rating": "7", "text": "Seriously a dance off? This movie is the most overrated piece of turd, but a turd with heart and soul that seems to be missing from quite a few Marvel movies. Wish they had ended a bit differently, but oh well."}, {"rating": "5", "text": "not 5 stars, 5 / 10.  wait for video because the movie isn't enough of a spectacle that something will get lost on the small screen.  in fact, a lot of it plays like a very high quality episode of a TV show.  if this was a tv show, i might have been into it.  But as a film, i'ts a bit repetitive and doesn't arc very well start to finish.  all the stuff that makes it feel like a \"movie\" seems shoehorned in, which is why you have a 3rd act which races up on you once you get there, and all of a sudden you're thrust into an epic battle that you don't really care about.  \"Guardians\" values jokes over drama, and it's not funny enough to get away with it."}, {"rating": "5", "text": "Don't go in believing the hype. Worth a matinee pricetag but not the blockbuster hollywood so desperately wants us to believe it is and clearly needs this summer (the worst hollywood summer season in years.)\r The heroes of the movie consist of a talking raccoon, a green woman assassin, a muscle bound mercenary, a talking tree and a funny human front man. The movie seemed to be confused on whether they wanted to make a a superhero film for the kids, a serious film targeting adults, or a rom-com teenager film. It felt like the movie never settled in to a theme and about a dozen times I found myself thinking \"that was out of place.\"\r For example, the main hero, played by Chris Pratt, starts off the journey on an abandoned planet where he turns on his 80's walkman, dancing and using the native lizard creatures for microphones to find an orb to make some coin from a collector. Its very fun, light and seems like a great movie that even the kids can come to. It then bounces towards the middle of the movie where the drunken raccoon \"rocket\" breaks down over his history, saying he didn't want to be created and at one point even tells his co-hero that he doesn't care that he lost his wife and daughter, in a move that probably sounded better written than they pulled off on film. Then add in and awkwardly long flip off scene from the main hero to the camera, an awkward blacklight \"sperm joke, and finishing the movie with a \"We're the guardians of the galaxy, **** punchline.\r I did find myself however enjoying the special effects and was surprisingly impressed by the acting from a tree, raccoon and former WWE wrestler.\r Worth seeing once, but it could definitely have done without all the hype."}, {"rating": "8", "text": "WOW, just wow. Aside from the obviously excellent production value and impressive action sequences, \"Guardians of The Galaxy\" masterfully tells the tale of five heroes, each unique in his/her own right, setting aside their differences to defeat the forces of evil in the galaxy; its such a cliched plot but director James Gunn manages to breath new life into it with his funny, exciting, and light-hearted style of directing (add in the charming performance of Chris Pratt as Starlord with it too), a huge factor that really won me over for this amazing movie. Easily the best Marvel superhero movie up to date. #IAmGroot"}, {"rating": "8", "text": "Fun, 80's style space caper flick coming from..Marvel Studios. Great ensemble cast and chemistry and some pretty strong visuals buoyed this success story, a super hero flick based on an obscure comic book series. The bad stuffs: the so called 'Marvel template': villains and plots are so similar to 'Thor: The Dark World', and of course, not as great as the previous Marvel outing, The Winter Soldier. But, Hey..I can't complain..welcome to the new golden age of comic book movies"}, {"rating": "9", "text": "One of the best movies of the year that was unfortunately not recognized at the awards. When you can take an underdog Marvel comic and make a group of rich, deep characters with great character development you've created an amazing movie."}, {"rating": "6", "text": "Guardians of the Galaxy is mildly entertaining and sometimes comedic. It's overloaded with CGI and action sequences and is often unbelievably stupid. But after all it doesn't take itself seriously and asks us to extend the same courtesy. In the end the loud, charismatic and energetic superhero flick does succeed a whole lot more than it fails."}, {"rating": "10", "text": "(Updated May 2017 in lieu of GOTG2) >The Short Verdict: A Marvel film that takes the franchise in a total different direction. Hilarious, fresh, nostalgic soundtrack-wise and unmissable.>Related Media: There are comics based on this group of heroes a few decades ago but I read that the comics are not that good. The heroes featured in the comics are also not the five in the film.>What’s it like? A human man, a green female alien, a pink male alien with scarred skin, a cybernetic racoon and an anthropomorphised tree must put their differences aside to team up to defeat an alien bent on revenge. Just like the Marvel’s Avengers story then… The story is fun, hilarious and fresh, the soundtrack is nostalgic and the action scenes are well done.  >Pros:> 1. It is great to have the Marvel franchise go in a new direction and come up with fun new characters that most people have not heard of. >2. The story is fun and hilarious. >3. The soundtrack consists of several popular songs from the 70s and 80s that were very nicely placed in the film. >Cons: >1. It was slightly poorer towards the end. Only slightly though. >How would the different age groups rate it?Children: ExcellentTeenagers: ExcellentYoung adults: ExcellentMedium age adults: ExcellentOld adults: Good>5/5 (No half scores) - Good enough to watch it in the cinema and to buy the DVD."}, {"rating": "9", "text": "This is by far my favorite marvel movies out so far, its in league all of its own compared to the others. Nothing against marvels other superhero movies, this just had that little extra that made it awesome. With a wide array of characters being portray by a great cast of actors, this is a 2 hour long movie of solid entertainment. You follow a group of misfits turned unlikely heroes with the goal of saving the galaxy from a **** crazy antagonist with plans of destroying said universe. Most importantly, you get to see Chris Pratt's name on the big screen which is pretty cool for those who saw him come up as the goofy actor on parks and recreation. I went into this expecting more of a kiddish movie based on the pg-13 rating but I was pleasantly surprised to see marvel held very little back, what with swearing, some brutal killings and at least one dick joke, good ol' rating system. All in all this is an awesome movie that pretty much everyone has seen by now, but if you haven't, get your ass to the nearest theater and see it on the big screen for best results, going not sober also wouldn't hurt the experience as a whole."}, {"rating": "6", "text": "A fresh installment into the Marvel Cinematic Universe, \"Guardians of The Galaxy\" is a fun adventure featuring an interesting leading ensemble of characters. The film's visual effects really help to bring the various extra-terrestrial settings to life. The pop compilation soundtrack is an additional fun factor to the film's light-hearted humour.\r However, these features seem to make up for and mask \"Guardians\"' lacking plot in which a forgettable villain seeks to destroy the universe while the protagonists take measures to stop them, something not too dissimilar to other Marvel movie story lines (\"Thor: The Dark World\" in particular). This cliché plot needs to be given a rest, especially when the film doesn't seem to really accentuate that particular threat and its implications.\r Other than colourful alien worlds, there is nothing else that this film seems to offer or present other than its entertaining cast and humour. I really would have liked for a better insight into Peter Quill and his experiences, having been taken away so suddenly from Earth, and a better look at the various worlds we are presented with in the film. Star Wars is a great example of showcasing distinct planets that we become accustomed too and can easily recognise; \"Guardians\" needs to take a page or two from that book.\r I have a feeling that the direction in which this film could have been taken in was shunted due to the fact that Marvel wanted to introduce key plot points that would feature and play heavily in the overall arc of the Marvel Cinematic Universe and its Phases, especially with the expanded introduction of Thanos, whom we can speculate will be the ultimate villain in an \"Avengers\" movie. Though I understand that this film had the appropriate setting and theme in which to officially introduce these plot points, it feels like it drags it down from feeling like its own, separate entity and not just something that has to very specifically tie into Marvel's current plans for their movies.\r \"Guardians of The Galaxy\" is a particularly entertaining film with the crux of its popularity seemingly accumulated from the wild response to the vivid and discrete ensemble of characters and the film's lively and amusing tone. The cliché plot and forgettable villain disappointingly drags \"Guardians\" down. Don't be fooled by the critics' consensus; this film is good but its notable errors prove that there is definitely room for improvement. Origin stories often tend to fall into this trap but leeway is obviously permitted as the filmmakers get to find their footing and subsequently and hopefully deliver a more developed story and villain for the sequel.\r Is \"Guardians\" worth the watch? Yes! But, don't expect anything more than just a fun comic-book movie."}, {"rating": "3", "text": "Behold! Every line of Bad Villain Dialogue in cinematic history: IN. ONE. FILM.\rBehold! Lack of writing talent covered up by saturating the script with pop culture references!\rBehold! A glowie blue MacGuffin!\rBehold! A special effects extravaganza that is not much to look at!\rBehold! A script lacking direction, heart, wit, and sense!\rGuardians of the Galaxy puts the \"senseless\" back into senseless fun."}, {"rating": "0", "text": "I thought this movie was extremely overrated. Nothing but mind-numbing CG action and attempts to be funny for 2 hours. I feel like I already watched this movie half a dozen times before by watching the latest Marvel films.. and I'm leaving equally unsatisfied."}, {"rating": "4", "text": "There were some funny lines and amusing performances, but overall it was noisy, incoherent, everything was thrown at the screen (including the kitchen sink). Obviously, Marvel views its audience as a bunch of 10 year olds (probably is, too) whose attention can only be maintained if something explodes every 30 seconds. After an hour, it gets incredibly boring."}, {"rating": "0", "text": "I can't for my life understand why people joined the circle jerk of Guardians of the Galaxy being the best movie ever made. Special thanks to Kyle Smith from NYP who gave this garbage the movie score it deserved."}, {"rating": "3", "text": "It is totally beyond me why this movie got such good reviews and ratings.   I guess now I believe in the saying that the masses generally have bad taste.   The simplest of storeline with moronic dialogues (I mean even for a comedy; they are not even trying), a list of most cliché of \"jokes\" and a complete lack of chemistry between characters.  That's what this movie is about.  If you were looking for even the faintest clue that this movie was produced for intelligent beings, you won't find it.  I wonder if the people who enjoyed this movie let the eye candies, the light show and the explosions capture them and put them into a trance where their brain is completely shut off.  Does the masse love \"cheesiness\" and cliché that much?   Do they no longer wish to find even the tiniest bits of wit or originality in humour?  Do they even still know how to appreciate such a thing?   One of many examples illustrating the lazy juvenile writing of this movie :  Girl waits for guy at entrance of a pawn shop (or whatever) and gets him into a conversation.  Guy juggles this precious object that pretty everyone wants to get their hands on. Girl snatches it from him and runs away on foot in broad daylight.  I mean seriously.  Don't they even try?  And people accept this below mediocre work?\r I'm glad I only digitally rented this movie.  My girlfriend and I had enough of it half way through.   I give 3 points for visual and sound effects and make-up.  Everything else is a big zero."}, {"rating": "8", "text": "The funniest marvel movie so far. The plot was pretty simple. The only thing that didn't fit is that it was way too comedy. I'm not complaining about movie's humor. It was spot-on an all jokes were really funny but fans expected more action. The CGI were pretty cool.  It contained a lot of easter eggs about future marvel movies. To sum it up, it was a pretty good movie. I''ll give it 8 just for lucking the action I expected."}, {"rating": "10", "text": "This is the first time I've rated a film as 10/10 on Metacritic.  It is absolutely great fun and is refreshingly original.  I wish it was longer though, I am now craving the sequel already to come soon and will be definitely purchasing this on Blu Ray !"}, {"rating": "7", "text": "Guardians of the Galaxy plays it the safe Marvel way, with plentiful of action, a lots humor, unique and wacky direction and a fairly generic villain."}, {"rating": "10", "text": "This movie has to be one of Marvel's best. The characters had very good buildup and allowed the audience to know all 5 characters easily, since each one of them shined in their own moments and varied in terms of skill. The movie had many good comedy aspects that made me laugh a good amount of times, and the action sequences were very memorable. 10/10."}, {"rating": "7", "text": "This was probably the most suprising movie of the year. I'm not a big fan of the Marvel movies. I like them for the most part but, they aren't that impressive. However, this one suprised me. The script was really good in terms of the characters and \"galaxy\" building. The plot itself and the villian were kinda weak but, it doesn't  tarnish the movie all that much. Overall, it's probably the best movie based on a marvel comic ever made. You should probably see it. 8/10 - Very Enjoyable."}, {"rating": "10", "text": "Хороший фильм с прекрасными персонажами, крутым экшеном, захвативающием сюжет, да что говорить, просто сходите на него и посмотрите."}, {"rating": "9", "text": "A very good Marvel Studios movie, giving me the Star Wars idea. The effects are good made, enjoyable for the eye and the brain. It still has good fashioned jokes but a rather movie like that seemed to me a bit silly as the jokes were a bit childish, still funny for us.\rActing is good, they really made it good there. Characters are also cool - a talking rodent, a talking and transforming tree, a modified woman turned into a living weapon and a big muscular guy that is looking like Agent 47 on steroids and on alcohol. Not even want to talk about the other characters (negative guys and misc.) The antithesis was there too. But in the end positive always wins, while negative is still right a bit. Doesn't actually affect anything on me.\rThe story (plot) isn't actually that bad. Placed into a sci-fi contemporary Earth time, 2015 probably, it's like Star Wars which is good, aliens everywhere and big ships - everything good for a movie of that kind.\rAs my review stays like the antithesis, I rate 9 because the positive isn't always right. Enjoy watching this movie; if you didn't go watch it now 3D!"}, {"rating": "10", "text": "I was expecting a lot from this film but I've never said that a film from Marvel could go this way. It has a subtle humour, it has lovely figures and for f***** for the first time since X-Men a franchise shows some humanity, some emotions and different types. James Gunn has done a great job. He did everything right what avengers did wrong. I LOVE IT."}, {"rating": "7", "text": "A true masterpiece in terms of comic book movies!Guardians of the Galaxy is a great Sci-Fi movie filled with   fantastic action sequences filmed properly, great visuals that makes you feel you're right in the middle of every scene and the best humor in a comic book movie I've seen so far.The movie shows the adventure of the five heroes:Peter Quill(better known as Star-Lord), Drax the Destroyer, Gamora, Rocket raccoon and Groot as they become the greatest heroes in the galaxy."}, {"rating": "8", "text": "As a Marvel Movie lover, I went to watch this movie with an open mind and an excited feeling. Let me start by saying that I really enjoyed it, but it didn't seem to fit in with the other Marvel movies for some strange reason. The Super Hero Movie Craze lately shows superheros as they would occur in our reality now. Everything can be explained. So, maybe I just haven't accepted that all alien life forms are fluent English speakers (I know, it's a movie, but at least explain it). But Rocket and Groot make the movie for me. And Dave Batista makes for a really good Drax. Gamora, I wasn't so sure of. Being one of the fieriest warriors in the Universe wasn't really put across. But, a thoroughly enjoyable movie nonetheless!"}, {"rating": "10", "text": "A great movie to watch with your family and friends.This Movie is really fun to watch and enjoyable.Highly recommended and I know you'll love this movie with a lot action,Loveable Characters and an nostalgic Soundtrack that keep us glued to our sits."}, {"rating": "8", "text": "Fine Marvel movie with some jokes here and there, but really! This was pretty cliched and it's literally the typical Marvel movie, which was still pretty funny. I saw this on opening night and my theater was only halfway full."}, {"rating": "8", "text": "It isn't a masterpiece but it's a fun sci-fi super hero type flick nonetheless. The characters are well developed and the humor succeeds for the most part. Whether you're a marvel fan or not, there's a good chance you'll enjoy this movie. The plot is well told, the CGI is great, and it's just an all-aroud good movie. Again, it probably won't blow you away (so to speak) but it's worth watching at least once, if not multiple times (I've seen it twice and enjoyed it both times)."}, {"rating": "8", "text": "Guardians of the Galaxy is one of the best, if not the best, Marvel Cinematic Universe's movie. It's really enjoyable to watch. I recommend this to everyone."}, {"rating": "8", "text": "Guardians of the Galaxy is another blast for Marvel in 2014 and it does deserve that same spot for Marvel blasting us away in non-crossover movies and what I meant by non-crossover movies is that the Avengers don't count."}, {"rating": "5", "text": "Visually stunning movie, astonishing worlds, great effects and also amazing make ups. But the script was bad. Honestly, I don't like that superhero movies, they are simply identical and cliche for me. That's why I admit I haven't watched many movies with that superhero **** boring stories. That one I decided to give a try, because of the goddamn cute Grud. And the whole time he was the only reason I didn't stopped the movie in the middle. Also, Chris Pratt was very annoying. :)    Anyways, boring story, terribly boring script, annoying man-character and cute treeish creature! For me, waste of time."}, {"rating": "9", "text": "Another marvel masterpiece. Guardians of the Galaxy really nails the tone of a movie like this. It can be serious or straight zany. They really got the family dynamic and making all of the guardians lovable. They fight, they argue, they try to work together and you really get a sense of a family here. The marvel universe felt even bigger now with this film introducing new races, planets, technology and even giving Thanos more screen time. The worlds and creature you see feel like they good exist and are very inventive and entertaining. The humor is perfect. It has just enough and is timed perfectly and always feels natural. The action is straight up awesome. Every action sequence is shot so well and the action flows perfectly. The effects are colorful and gorgeous. The plot is great but the villain was pretty meh and didn't have much going for him witch is practically my only flaw. Definite recommend if you haven't seen this already."}, {"rating": "1", "text": "Never ever felt a movie three times as long as it really was. My husband and I, we were relieved and glad when the credits started rolling. The special effects were incredible but the two-dimensional heroes, the lame jokes and the flimsy story ruined the fun for us.\r The first few minutes were good but, after the abduction, everything went faster downhill than Rocket Raccoon could talk. We were so bored out of our minds, even the bombastic visuals and the showdown couldn't lift our spirits in the end.\r I'm really baffled about so many people describing the dialogues as \"clever\" or \"witty\". I found them to be incredibly stupid, not funny and just lame. I never watched a movie before where the heroes a) loved hearing themselves talk, b) where they talked non-stop and c) had absolutely nothing to say.\r The CGI-effects made this an A movie, the rest is barely C-material."}, {"rating": "0", "text": "One of the most boring movies i have ever seen. I cannot understand how people like this garbage that much. It is not worth watching. What a waste of two hours in my entire life."}, {"rating": "6", "text": "The latest Marvel mashup brings a ragtag gang of unusual characters together to save the universe. Led by a sweet, swaggering human (Chris Pratt), the group includes a tree creature, a green woman, a literal hulk and an armed raccoon. This opens things up for irreverent humor, which isn't always that funny. Action is inevitable, but most of it's fast & noisy without standing out. There's also lots to look at, including dozens of fun creatures and some cool design. The playful tone and unusual individuals make it entertaining, but the underlying lack of originality keeps it from soaring."}, {"rating": "10", "text": "There are very few movies that perfectly blends comedy, action, and wonder. As you watch the movie, you can be connected with the characters as they develop before your eyes. Each character, important or less,  is developed with care and with the right pacing. The comedy is well timed and easily understandable for most people. The universe is vast, but never overwhelming, allowing deep immersion. The tools, ships and beings can be connected to our world in a way that is both believable and imaginative. Most of all, the sound track is on cue, setting mode perfectly to the scene it is partnered with. This movie is a prime example of a good summer blockbuster."}, {"rating": "7", "text": "Guardians of the Galaxy, predictably, turns out to be just another good (but not outstanding) quality blockbuster movie, with lots of passable action, absolutely flat plot and moderately funny jokes (this time around there's more focus on the jokes). I should also note that this movie has a great soundtrack comprised of many 70s hit songs.\rThe thing that's very uneven in GOTG are the characters. The protagonist team is mostly good - Chris Pratt fits the role of space Indiana Jones well (although sometimes being too childish), Dave Bautista (Drax) is surprisingly funny, the Racoon is alright (although constantly angry) and Groot with its big eyes is just cute. However, the character problem starts with Gamora, who is Zoe Saldana painted green. Not only her character is cliche, but also her looks are just ridiculous and terrible. Sadly, the same applies to many other characters in this film. The crowd, consisting of many \"aliens\" is really just a lot of painted people, which looks pretty damn stupid. What is more, the main antagonist suffers from the same issue. I'm sorry, but an ugly blue **** in a rubber suit with some black **** splattered around his face just doesn't seem too menacing to me.\rAnyway, is it a good movie? Yep. Is it worth watching in a cinema? Pretty much, there's not too much competition now. But is it something outstanding, something memorable? Not really, just another quality blockbuster from Marvel, which shows despite the setting having been changed to outer space."}, {"rating": "4", "text": "I was disappointed the movie is nothing like the trailer.  A lot of things blowing up and crashing for 2 hours.  Boring movie and repetitive.  Only the NY Post reviewer gave it the low rating it deserved."}], "recommendations": ["thor_ragnarok", "thor_the_dark_world", "the_a_team", "hercules", "the_lego_movie", "avengers_age_of_ultron", "thor_love_and_thunder", "shazam_fury_of_the_gods", "poseidon", "deadpool", "bumblebee", "riddick", "serenity", "incredibles_2", "the_lego_ninjago_movie", "jack_the_giant_slayer", "megamind", "monsters_vs_aliens", "deadpool_2", "bloodshot", "hotel_transylvania_3_summer_vacation", "edge_of_tomorrow", "gods_of_egypt", "rampage", "minions"]}