{"id": 2635, "title": "Gully", "starring": ["Kelvin Harrison Jr.", "Jacob Latimore"], "runtime": 81, "genre": ["Drama", "Crime"], "description": "A slightly dystopian vision of LA, we follow three disaffected teenagers, Jessie, Calvin and Nicky, all victims of extreme childhoods, running supreme hedonistic riot as they try to work out a way in life.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/dydDu5jkXXXyxgx1THa9BQLkGq0.jpg", "categories": {"plot": 0.0, "acting": 0.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 2.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "0", "text": "I'm here to avenge my captain. Your team with you, Jack.P.S. Amber Heard is a very big and fat feminist pig.P.P.S. СНГ - сила."}, {"rating": "0", "text": "just a bad movie all around. terrible plot, terrible acting and terrible writing."}, {"rating": "10", "text": "I liked how the movie unfolded, I thought it was different and special.I Liked The soudtrack too, Dua Lipa it’s a very Good Artist"}, {"rating": "0", "text": "Disastrous movie. I was not able to even see one positive thing about this. Do not waste your time."}, {"rating": "0", "text": "Terrible movie, the plot is all over the place and the character building was the worst. Everything about it is so forgettable, it's just a waste of time"}, {"rating": "2", "text": "The movie was pretty much boring. I feel that the direction of the movie was poor, withouth spoiler i have to say that the overall pace of the movie was its biggest defect. It is very sad to see this kind of product when the cinemas are struggling to secure its deserved place in the entertainment culture. I will return to the cinemas, but i assusre you not to watch movies such as this."}, {"rating": "0", "text": "Yep, very rotten. It's not because of the ameture acting of course. Halfway through the movie is just dragging you into a plot that you already know what's going to happen anyways. But hey, if you have money to waste and time to give up, it's a good flick. (If you're okay giving abusers money for being the abuser, lol)"}], "recommendations": ["the_day_the_earth_stood_still", "knowing", "abduction", "2012", "the_legend_of_hercules", "the_happening", "i_care_a_lot", "doctor_strange_in_the_multiverse_of_madness", "the_emoji_movie", "skyline", "wonder_woman_1984", "the_bye_bye_man", "dark_phoenix", "legion", "shadow_in_the_cloud", "national_treasure_book_of_secrets", "wanted", "the_new_mutants", "shut_in", "the_tax_collector", "the_mummy_tomb_of_the_dragon_emperor", "suicide_squad", "the_room", "mortal_kombat_annihilation", "battleship"]}