{"id": 7, "title": "Gunpowder Milkshake", "starring": ["Karen Gillan", "Lena Headey"], "runtime": 114, "genre": ["Action", "Crime", "Thriller"], "description": "To protect an 8-year-old girl, a dangerous assassin reunites with her mother and her lethal associates to take down a ruthless crime syndicate and its army of henchmen.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/5AaKulwpUtkscAokKWtLenGTfVS.jpg", "categories": {"plot": 5.0, "acting": 3.9473684210526314, "ending": 6.6, "soundtrack": 6.333333333333333, "cinematography": 6.8, "familyFriendly": 3.0, "funny": 4.285714285714286, "action": 5.428571428571429}, "reviews": [{"rating": "5", "text": "Not the worst thing, some fun action sequences, but the script and over-acting leave a decent amount to be desired."}, {"rating": "2", "text": "Thought it was poor. Failed totally to interest me because it offered nothing new that has not been done before.The story was awfully weak. I did not understand the importance of that little girl. Did i miss something?Beside from the weak writing and poor attempt at humour (was there any funny scenes?) Only the three librarians had any charisma to them. but they are just side characters.The fight scenes was so flat and dull. Karen Gillan was stiff and wooden in her fight moves. Other than that, she just spent all her time moving trough her scenes with a cold stare on her face trying to portray that stone-cold-killer as best as she could, but she came out more cute than intimidating..A very bad John Wick copycat.. Not even a worthy Popcorn flick filler.See Atomic Blonde instead if you have not already.. Had way more spunk in it than this rubbish.."}, {"rating": "2", "text": "A steaming pile of a movie masquerading as a cool late 90s style flick… murder isn’t cool. Even with a bright color palate."}, {"rating": "2", "text": "A poor attempt at a John Wick style movie. Pointless plot, poor character motivation, just ok action. Definitely don't waste your time with this one."}, {"rating": "2", "text": "Feels like a rough cut, there's a lot of dead space in the edit. The action sequences are trying so hard but it's all a bit flat. Clearly it's trying to sprinkle in the visual styles of far superior flicks and feels nondescript because of it. To do so little with such a cast is quite amazing."}, {"rating": "0", "text": "2 minutes into the first fight scene and I honestly thought I was watching an AIRPLANE! parody of a John Wick movie. The choreography is that bad. You can actually count the beats during the bowling alley scene, its that wooden. Gillian pulls off a better bad ass as Nebula than whatever she's trying to do in this film. I don't have much else to say about the others in the film. I was laughing so hard because this wanders into parody territory too fast and hard to care. It deserves cult status next to 'The Room' for sheer awfulness."}, {"rating": "1", "text": "terrible script, bad acting (not bad actors), trying too hard to be cool only by ripping off from more talented filmmakers. tokenism, expositing trendy girl power vibes by men. if you like being treated as a mindless sucker give it a try."}, {"rating": "0", "text": "This is not a movie this is garbage. Deleted after 15 minutes. NetFlix wasted cash buying or producing this garbage."}, {"rating": "1", "text": "Terrible john wick RIP off. Everything about this movie is unoriginal and cheap.why is lena headey second billing? Angela Bassett, Michelle yeoh, and Carla G are bigger stars."}, {"rating": "3", "text": "Style over substance.A great cast wasted, there’s potential here but the poor writing, uninspired action and aimless direction make this a forgettable movie."}, {"rating": "0", "text": "Another movie for femcels, meets all the woke principles of diversity & inclusion. As expected it's just a film where they swap out men for women and give them the same character traits. Basically it's \"strong female character\" propaganda. You can guess the religion of the writer."}, {"rating": "2", "text": "This is suppose to be another one of those timely \"feminist\" movies with strong female characters and a bunch of evil men, yet funny enough, the director/writer manages to turn it into an anti-female movie, considering how dumb, unfunny and uncool the characters are. The strong female cast (and Paul Giamatti) have never been worse. It's a feat to make these talented actors this terrible and flat. I could probably make a comment about every single line and every single scene in this movie, describing how stupid, unfunny and amateurish it is, but i wont waste more time on this dreck."}, {"rating": "3", "text": "This movie was so close to be AMAZING! Acting is perfect! Action fun and clever! Story, good enough. But the writing, directing, and editing are all slightly off making this movie feel disjointed.Dialog can't be saved by this S-skill level cast.Editing is too slow making the story drag and then ramp up too high with their hyper-cut action. Directing can't pick a tone. Serious drama one min and whimsical caper the next.Give this movie to a skilled editor, leave them alone for a few months and I bet they will have the first film in a franchise."}, {"rating": "0", "text": "Netflix'in tüm filmlerinde olduğu gibi dibine kadar feminist kafayla çekilmiş bir film. Kadınların erkekleri rahatlıkla dövdükleri, erkeklerden çok daha güçlü olduğu bir film. Gerçeklerle bağdaşmamakta."}, {"rating": "0", "text": "Terrible, woke garbage. Female assassins, weak white men, etc. I colossal waste of time"}, {"rating": "3", "text": "Bad copy of John Wick, but where all bad guys are men and all good guys are women"}, {"rating": "3", "text": "A 99 cent version of John Wick. It's a classic case of style over substance - it's characters are flat, tries too hard to be cool, the dialogue is atrocious, the story is weak. You would bank on a movie like this to have great action but it doesn't; the fight scenes are poorly choreographed and lack intensity. Karen Gillan feels miscast - her stone-faced flat performance required an intensity that she didn't bring."}, {"rating": "10", "text": "i thought it was wonderful lots of action and fighting also a pretty good story"}, {"rating": "9", "text": "Karen Gillan was great.   Not sure why everyone is hating it. I had a fun time for a silly popcorn flick."}, {"rating": "10", "text": "Guess who doesn’t like this movie? I’ll give you a hint, it’s the same trash that gave the monumentally stupid and awful “Run Hide Fight” glowing reviews. And great job of completely giving up on policing/moderation, MetaCritic! We now get to see comments filled with anti-semitism, racism, and sexism by mouth-breather scum all over the place."}, {"rating": "9", "text": "If you enjoy watching chicks kick ass, this movie nails it. Karen Gillan plays an assassin who gets into trouble with the crime org that pays her. Into the fray comes her mom (Lena Headey) and several other women (Angela Bassett, Michelle Yeoh and Carla Gugino). This movie is over the top in many ways, including the particulars of this underworld. The action is plentiful with lots of hard knock hand-to-hand and gun battles. Fortunately, director Navot Papushado manages to create original ways to dispense brutality, often with a comic book approach that renders it less violent and more cool. The final showdown is especially fun."}, {"rating": "8", "text": "The movie does not take itself seriously. It is a fun movie with some great visuals, some good and inventive action set-pieces, a quirky humour sense and good acting. Overall, a great movie!"}, {"rating": "7", "text": "It's a black comedy...  It isn't meant to be taken seriously...  I enjoyed the absurdity of the shootouts because they were funny...  If you approach it as something to be laughed with and not at you might find yourself enjoying it..."}, {"rating": "0", "text": "Unwatchably bad. Couldn't get past the first 8 minutes due to the poor .... everything."}, {"rating": "10", "text": "Gunpowder Milkshake was awesome. The fight scenes were badass, the fight choreography was outstanding. The performances from Karen Gillan, Lena Headey, Michelle Yeoh, Carla Gugino, Angela Bassett, and Chloe Coleman were exceptional, to me they are one of the best acting ensembles I've ever seen. The costumes were excellent especially ones wore by Carla Gugino, Michelle Yeoh, Angela Bassett, Karen Gillan, and Lena Headey. The makeup and hairstyling was superb especially on Carla Gugino, Angela Bassett, Michelle Yeoh, and Lena Headey. This was an A+ movie to me."}, {"rating": "2", "text": "(Mauro Lanari)Does female emancipation pass through a \"Kill Bill\" multiplied n times or a matriarchal \"John Wick\" with choreography of bullets and other brutalities? I don't think so at all. Then, however, the sudden masterpiece of \"French Disko\" (Stereolab, 1995)."}, {"rating": "8", "text": "i need prequels, sequels, spin-offs and an entire expanded Gunpowder Universe. I'm gonna watch this at least two more times ! this movie is gonna make The 355 look bad when it comes out later on in the year, not to put them in competition but this was miles better than Black Widow."}, {"rating": "7", "text": "Gunpowder Milkshake premiered on Netflix this weekend with an intriguing title and a top-notch cast. The high octane, action flick directed by Navot Papushado is full of style but low on originality as it borrows from John Wick and Kill Bill schools of assassin cinema. Here’s the story: Sam (Karen Gillan) was abandoned by her mother, Scarlet (Lena Headey), when she was only 12 years old. Scarlet was an assassin, who had to leave her daughter after a job went wrong. Sam was left to be raised by the crime syndicate, The Firm, who expect to to carry out their bidding with precision and ruthlessness. On a fateful job, Sam kills a man, who got caught up in a situation because he’s trying to protect his 8 year old daughter, Emily (Chloe Coleman). Sam takes it upon her to protect Emily and dismantle The Firm as they turn on her with the help of the Librarian (Michelle Yeoh, Angela Bassett, and Carla Gugino). Girl power, butt kicking and lots of shooting ensue.As these action thrillers go, the viewer wants to be grabbed and never let go of until the final shots. Unfortunately, Gunpowder Milkshake does not do that. Sure, there are early action sequences that are entertaining like a funny fight between Sam and some henchmen in a bowling alley, but there is a lot of exposition and these early fights get repetitive. Unlike a lot of movies these days, I must commend Papushado, who co-wrote this film, on writing an original story as so many are based on other IP. Sequels and franchises abound. Papushado, however, seems to have culled together this story from a mish-mosh of other assassin plots and stuck an ensemble of women in the main roles. Even though it’s an original story, it lacks originality in the plot and the derivative nature of the story is not so great. On the other hand, it really doesn’t matter the ins-and-outs of the story because we’re really just here for the fighting and action.In the plus column for Gunpowder Milkshake, the ensemble of women here is a big draw. Game of Thrones fans want to see Lena Headey as an action star. She’s fierce and smart. She even gets some good one liners, here and there. As a mother-daughter story, the movie tries to put some emotional stakes to the story between Sam and Scarlet. It works somewhat. The other standouts are the trio of Angela Bassett, Carla Gugino and Michelle Yeoh. Whenever these three are on screen, you know it is going to be fire. The energy infused in the film comes from these women taking the reins and never letting go. In fact, their all-too-brief scene in the first hour probably hurts the film because you’re just waiting for them to come back. Bassett, Gugino and Yeoh almost save the movie in the second hour.I’ll also give a quick shout out to the costume design. There is a lot of color used throughout the film. Neon is a striking motif that the filmmakers have used. The color and costumes add to the energy and visual depth of the film. Lastly, some of the action scenes, especially in the second half, are quite cool when it goes beyond the same-old-same-old shoot outs. The characters get to be clever and athletic, which is always entertaining.I suspect there will be a sequel and, hopefully, the filmmakers will realize that the gold for the Gunpowder Milkshake franchise is in Lena Headey, Angela Bassett, Michelle Yeoh and Carla Gugino. Take note, Papushado.Ultimately, Gunpowder Milkshake is a fine action thriller with an unoriginal assassin plot but with a great supporting cast. There is a lot of style here and, if you like shoot-outs, then you will have your fill of those as well. For me, this is a good stream on a Saturday night with a bowl of popcorn, if you can get through the slow and repetitive first hour. For those looking for a John Wick and Kill Bill mash-up, grab your big box of popcorn and enjoy."}, {"rating": "7", "text": "There are some great shots here, but some serious misfires on the music during fight scenes, they don’t compliment each other well. But Overall it was a fun movie with some clever ideas and worth a watch"}, {"rating": "8", "text": "excellent[ ek-suh-luhnt ]adjectivepossessing outstanding quality or superior merit; remarkably good."}, {"rating": "9", "text": "Gunpowder Milkshake movie is stylish, beautiful, action-packed, violent, and funny. The action sequence was a mixture of John Wick and Jackie Chan. Director Navot Papushado and Cinematographer Michael Seresin transform a generic script into a blast. There was a smart use of a camera and lightning. The music, color grading, costumes, makeup, production design, and the whole atmosphere was brilliant.I loved the library scenario and the classic literature language used for the guns. It reminds me of the John Wick movie.The script was decent and predictable to some extent but the direction and Cinematography made it more interesting. Also, I can't forget the funny fighting moments. So It's a must-watch movie."}, {"rating": "7", "text": "People like to overthink the quality of movies and they end up ignoring if they enjoyed it. I liked it. It was fun, slick, clever and obviously had a female John Wick flavor to it. But that's not a bad thing. It could have used better, more memorable villains and a stronger, more creative plot. Also, why is it always Russians? But other than that I enjoyed it. That's good enough for me."}, {"rating": "3", "text": "Every part of the movie is so overhyped and all the women power thing. Every fight scene is decently designed and good. But the movie deals more with girl power and the mean gangstars are portrayed as idiots. Secondly, coming to the climax, it happens in a coffee shop where the russians and the other women will meet. It is a holy place for Russians and other gangstars so all of them are not allowed to use their weapons inside the shop. While using this weakpoint againist the russians, the women uses the guns inside and kills all of them. It is like killing them off guard, what kind of fun it is when you shoot from back? It is like admitting you dont have guts to face the other person from face. Thats is not good, fighting equally is agreeable but not shooting when off guard.The actress did a very good job in acting and all action sequences. That is to be appreciated."}, {"rating": "2", "text": "Really wish I'd come here before watching. You know everything that will happen, 10 minutes before happens. Thinks it can make up for being boring by at least being 'stylish', which it would have been considered... 20 years ago. A complete waste of an A-grade cast and not-bad cinematography, this is a hall of mirrors, childish scripting, and anemic choreography that will totally disappoint anyone who has seen more than 3 good action films since 1990."}, {"rating": "8", "text": "i need prequels, sequels, spin-offs and an entire expanded Gunpowder Universe. I'm gonna watch this at least two more times ! this movie is gonna make The 355 look bad when it comes out later on in the year, not to put them in competition but this was miles better than Black Widow."}, {"rating": "5", "text": "This movie is a totally shameless ripoff of John Wick only with an all female crew, but much less believable or interesting. Replace the High Council with the \"Firm\", the Continental Hotel with the \"Library\" and \"Diner\" and well...you get the picture. It's just alright."}, {"rating": "7", "text": "It's fun, but the music choices are poor throughout and I can't help but feel given the awesome cast, that it should have been better than it was.  More Michelle Yeoh could have added to it for sure."}, {"rating": "5", "text": "After watching trailer I thought it looked kinda cool and will be interesting and with good action but in the end the story wasn't that good and a bit dumb in general and action could've been better. It was average. I wouldn't say bad though (maybe some reviews also are lower because it does feel a bit like a bit of version of John Wick but anyway action movies do often seem similar anyway)"}, {"rating": "5", "text": "It reminded me of Smokin' Aces, Terminal, John Wick, Hotel Artemis and Atomic Blonde, and just a little bit of Wanted.So it goes without saying that originality is not a highlight of this story.And if you want to add other cliches, she has an adolescent trauma in the absence of her maternal figure, and while escaping from other assassins, she ends up taking care of a little girl.I don't deny that within what fits, it makes this functional, but the style is completely disposable.Although it will only be distributed by Netflix in the US, Gunpowder Milkshake looks totally like a film made to get lost in its catalog after you get some fun with it the first few days after its release, because it's obviously a novelty.But to believe that it deserves a sequel like the one already being developed, makes me wonder what kind of faith the producers have in it, because its quality does not justify a second part.The female cast was pretty good though."}, {"rating": "5", "text": "The story and characters are unfortunately very bare bone. It doesn't help that some of the action is incredibly goofy and has fights that rely on the men being idiots.However, the action is very stylistic, with some nice use of blood and gore. Plus the score composed by Frank Ilfman is very good and there is some great use of music within the film. The cast do a pretty good job as well. The movie is enjoyable if all you want to see is someone get stabbed or shot."}, {"rating": "7", "text": "I enjoyed the movie even though it was hilariously stupid, especially in the dialogues. But an amazing movie after a hard day of work. Nice cast too :)"}, {"rating": "5", "text": "A decent action movie: Good actors in an interesting setting with colourful set pieces but with flat characters and subpar dialogue."}, {"rating": "2", "text": "Sam (Karen Gillan) bekommt den Auftrag gestohlenes Geld wieder zu besorgen. Dabei ändert sich Ihr Ziel und Ihre neue Aufgabe ist es das Mädchen Emily in Sicherheit zu bringen. Der Film ist eine dreiste Kopie von John Wick. Er übernimmt die geschichtlichen Elemente von John Wick die gut sind und versaut diese. Sams Charakter ähnelt sehr stark dem von John Wick bzw versucht es. Sie wirkt total lustlos und emotionslos. Sie hat immer den gleichen Gesichtsausdruck. Die Chemie zwischen Ihrer Mutter und Emily passt null. Emily ist mir auch egal und ihre Gags sind cringe. Generell ist der Humor sehr cringe und unangenehm. Die Charakterentwicklungen gehen viel zu schnell (wenn man das Charakterentwicklungen nennen kann). Die Action ist auch langweilig der Endkampf geht viel zu schnell und ist lahm. Die einzigen Szenen die ok waren ist wo Sam kurz gelähmt ist. Die Charaktere sind mir alle egal und austauschbar. Es wird in einigen Gags auch auf das Thema Fenimisus eingebaut und das in schlecht. Es gibt soger ein paar Aussagen die Frauen schlecht darstellen und es wird nicht darauf reagiert. Die Effekte sind auch schlecht, das Blut sind null realistisch aus eher wie Saft.Logik ist hier auch nicht vorhanden. Ein Eis das drei Stunden steht sieht einfach aus wie als, ob es frisch ist. Ein paar Tode sind auch unlogisch und zu übertrieben dargestellt. Es gibt wohl mindestens eine Fortsetzung, aber ohne micht der schlechteste Actionfilm den ich gesehen habe.2/10"}], "recommendations": ["kate", "haywire", "miami_vice", "sabotage", "immortals", "atomic_blonde", "desperado", "mechanic_resurrection", "bloodshot", "collide", "mission_impossible_ii", "the_italian_job", "brick_mansions", "the_last_stand", "baby_driver", "angel_has_fallen", "extraction", "jiu_jitsu", "underworld", "the_transporter_refueled", "iron_man_2", "jolt", "elektra", "the_marine", "parker"]}