{"id": 3099, "title": "Guns Akimbo", "starring": ["Daniel Radcliffe", "Samara Weaving"], "runtime": 95, "genre": ["Comedy", "Action"], "description": "An ordinary guy suddenly finds himself forced to fight a gladiator-like battle for a dark website that streams the violence for viewers. In order to survive and rescue his kidnapped ex-girlfriend, he must battle Nix, a heavily armed and much more experienced fighter.", "releaseYear": "2020", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/2kNnf7BwRCEm4bcFkdiE0T4U25s.jpg", "categories": {"plot": 5.1, "acting": 5.466666666666667, "ending": 5.333333333333333, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.25, "action": 6.666666666666667}, "reviews": [{"rating": "5", "text": "This had the potential to be a gem but ultimately it's just okay. Radcliffe, Weaving, and Dennehy all do a fantastic job. The writing and cinematography are what holds this movie back from being anything better than average."}, {"rating": "4", "text": "The tone of the movie jumps from comedy to satire to surreal to action. The action is hyper-cut and doesn't flow. The acting is on point if the intent of the movie was satire. Movie could of been very fun in the hands of the right director and editor."}, {"rating": "3", "text": "Easily one of the worst films I have sat through recently. It is fairly entertaining but it is also, at times, ridiculously irritating and obnoxious."}, {"rating": "0", "text": "Seems like a kind of career killing movie. Might not be worth it posting this on your CV."}, {"rating": "1", "text": "no sense, so many errors, no connection, the story has not a message or doesn't make sense, just sell it for the actors?! come on guys"}, {"rating": "6", "text": "This was actually a pretty funny and good mindless movie.I feel like this movie was made by **** and you can hear it from the dialogue and see it in certain scenes and i think thats **** hillarious.Overall a pretty god action movie with lots of memes and you can see Harry Potter getting beaten up  and also being a total loser like the people who enjoy Harry Potter movies.Soundtrack was also dope."}, {"rating": "2", "text": "\"What is it about?\" Wife asked. \"Harry Potter with Gun Hands in a Social Media Battle Royale.\" The wide release for this movie was this weekend, so there's always a chance it will go through a Cats-like recall where the director will try to salvage his movie after pulling the trigger (ahem) on a poorly executed (hemhemhem) movie.  Absent that, there's not that much to say. Despite the fact that Harry Potter, Samara Weaving (Ready or Not, but made to look like a traumatized albino), and the venerable Ned Dennehy (whom I know best from the Good Omens miniseries as a Duke of Hell) act the hell out of trashy script, they lack the ability to put a new spin on some tired social media battle royale commentary genre tropes (how did this become a genre so quickly?). As you already know, dear reader, I'm still pretty uncertain about how to feel about Assassination Nation, whose premise was also a critique on doxxing and social media culture at large along with the sexualization of teen girls, because I haven't been able to have a sit down with anyone older than sixteen to talk about the movie, but I do have pretty firm feelings about 2016's Nerve and last year's Escape Room. I consider Nerve (and maybe Assassination Nation???) to be the high water mark of social media adventure films of this decade. If we can't agree about that, we're not going to agree about anything below, because Harry Potter and the Night of Two Hundred Bullets feels highly derivative of Nerve in its premise and delivery, with maybe even less to say about social media than Escape Room, which just goes to show how little thought went into the plot of this movie. Nerve shares some important similarities in that it 1) has some young adult star power, 2) its premise relies on the idea of a wildly popular social media fight club type organization set in the near future, and 3) the protagonists find a way to turn the tables on the organization in the end. The difference is Nerve slowly ratchets up the tension by making the dares go from being innocuous voyeuristic challenges to nasty, violent conundrums. HP and the Third Person Shooter starts at an 11 and stays there. We don't have a sense that the director has any subtle views about the public's interaction with violence in media. Viewers of \"Skizm\"'s show are an omnipresent Greek chorus, possibly (Friend suggested) a heavy-handed audience surrogate that doesn't add much to the pleasure of watching, but definitely makes you think that the director would've been busy reading poetry during gladiatorial games in Rome. In fact, the one note performance by everyone in that chorus has kind of the opposite of its intended effect, because it makes the critique of social media nastiness feel like hand wringing. Without being able to see our surrogates using social media passively, actively, and then ruthlessly, it doesn't feel nuanced. When Radcliffe's character self-deprecatingly describes his relationship with social media (while dropping trow in an office bathroom) as endless cycling through \"three apps\" on his phone, its at once over-simplistic and unhelpfully accurate. He's right, but Miles isn't (only) creeping on Instagram and scrolling through Reddit, he's also secretly obsessed with some pretty filthy internet subcultures, so to say that he's One of Us, an everyman internet denizen, doesn't quite ring true. It's not the only place Harry Potter and the Free Fire Fiesta with Worse Aim actively undermines itself.The fantasy sequences feel oddly counterproductive since they're almost entirely critiques of anti-feminist tropes of women as reward (thank you, Anita Sarkeesian and B* Magazine--everything you touch is gold), but in the act of drawing our attention the movie's attempt to move away from the trope, it perpetuates the stereotype. The movie tries to come off as clever and twee about making progressive plot choices, but also attempts to get away with showing its audience the wish-fulfillment it thinks they might want to see. The inability to let a definitive choice stand without observation and voice over navel-gazing pervades the film and gives it a unfinished quality.Lastly, Harry Potter and the Gun Fight With Witty Banter is confused about its tone. Obviously, the premise of the movie is shooting (cough cough cough) for absurdist comedy, but there are moments, particularly concerning the objectivity of violence, that come into conflict with that tone. Miles's first and inglorious kill--which, by the by, is reminiscent of Rhythm Section's first kill in the field (!)--features an unhelpful voice over, \"No one ups, no extra lives, I just killed that guy.\" Instead of giving us the chance to watch Radcliffe show his trauma, we're fed a milquetoast and feeble thought bubble. Similarly, there's no retrospection when it comes to the point blank assassination of Miles's friend or Nix's father or even the off-brand M&M policeman giving off Charlie Day vibes toward the end."}, {"rating": "5", "text": "I give Daniel Radcliffe the credit for doing so many diverse roles but he needs to start selecting better.This frantic mix of Hardcore Harry and Nerve barely makes it.It's entertaining for some moments but the juice runs out after a while."}, {"rating": "3", "text": "It's quite fun in places, but honestly, you can't help but want Miles to get ended. He's extraordinarily unlikeable. The film plays as some kind of woke power fantasy (of which there are lots of little social critiques in there, if you look), and by the end he's somehow gained professional gunfighting skills in about 100 bullets.Nix goes from a crackshot that can take out an entire room for fun, to missing Miles consistently with automatic weaponry, from about 15 metres. The characters skills go to the level where they are required for the plot to progress."}, {"rating": "9", "text": "Really fun action movie, reminds me of 2 of my favorites - Shoot Em Up and Crank 2: High Voltage. That Radcliffe has turned into a very compelling actor and he is making interesting choices, he has proved he's capable of much more than Harry Potter in movies like Swiss Army Man (the excellent farting corpse movie) and the show Miracle Workers."}, {"rating": "8", "text": "Awesome craziest badass bloody voilently funny!edge of the seat from start on!sure there were little logic defying moments yet great action and amazing acting makes a amazing watch!"}, {"rating": "7", "text": "Radcliffe and Weaving shine as the leads. The two alone make the film worth watching. Guns Akimbo isn't a perfect film but it's a pretty darn entertaining one that kept me invested from start to finish. The only glaring negatives for me would be the CG is a little disappointing at times and the pacing is a bit uneven.Aside from that, It's still well worth checking out. The amount of fun you have watching it more than make up for its shortcomings."}, {"rating": "10", "text": "Офигенный фильм. Я ржал как конь так что 10/10"}, {"rating": "10", "text": "Epic Neonoire Actionmovie! A rollercoaster ride with Daniel Radcliffe and Samara Weaving."}, {"rating": "10", "text": "The best film of last year.Куча отсылок, классные шутки, оригинальный сюжет и безумно прекрасная музыка"}, {"rating": "10", "text": "очень классный фильм, есть над чем посмеяться)), шутки из разряда \"не для всех\", именно поэтому очень много кому фильм не понравится)), но всем не угодить)), я рад что посмотрел этот фильм)) получил огромное удовольствие от этого похода в кино. Дениэл Редклифф очень хорошо и в тему сыграл здесь)))"}, {"rating": "8", "text": "Really solid tongue-in cheek movie, with interesting characters. I especially liked Nix, who after initial \"oh I am standard fake heroine\" turned out to be absolutely brilliant and iconic :)Would watch part 2!"}, {"rating": "10", "text": "Extreme on point to nowadays situation - which is - humankind is in deep deep place where sun will never shine.Fun for stupid. Heavy narrative for thinking watchers.Brilliant work with such budget. Camera work, after effects, all young talents. Everything worked out in this Film."}, {"rating": "5", "text": "Let me start by saying that you get to briefly see Daniel Radcliffe full frontal here, however it is a prosthetic. I’m not sure if that’s a spoiler or possibly the only reason you might have to give this a viewing. It’s not a great movie, but it was very entertaining. I’d say that the overall ratings across the board from critics to users is pretty accurate. The acting is not very believable and there are some issues with how in one scene a character is a never miss a shot badass, practically taking on a small army, to being completely unable to hit a single squatting target from 15 feet. I get that if they had it would have ended the movie in 15 minutes, but there could have been a better way to mitigate this. As violent as this movie is, and it is very violent, the gore never comes across as “real” opting for mostly digital blood with few practical effects. I’m not sure if this was a choice for the overall style of the movie as there is a narrative parallel to video game esque violence and how “we the viewers” are are becoming desensitized and thus worse as members of society. That doesn’t track. The few side plots here don’t track either and as a result I didn’t care about anyone in this movie. Not a single character is actually developed beyond the lead. While I’m glad I watched it I can’t honestly say it’s worth a watch."}, {"rating": "10", "text": "Great violent gore fest where the movies \"Crank\" and \"Gamer\" had a baby and got this masterpiece called \"Guns Akimbo.\"Can't wait for the sequal(s)"}, {"rating": "1", "text": "The premise might be interesting in a Kafkaesque way, but it's shot like a film student's first film. Clichés abound, from the spinning camera to the slow motion bullet animation. My suspension of disbelief can stretch a good long way, but it broke the third time a villain didn't take an easy shot that would have unceremoniously put both Miles and the audience out of their misery."}, {"rating": "10", "text": "Gun Akimbo is the sweet jelly center you find when you mix real life with believable Chaos.. The movie lays it's own foundation and builds it self up into something truly unique.  Every so often during its beautiful display of Artful Violence it always points a mirror to audience and society. This makes you think but you quickly realise you want to get back into the chaos. It has a lot of messages it wants to get across to the audience and does it in a way that doesn't make it feel like it's being forced on you. Gun Akimbo is Bold, Beautiful and Brutal. It's knows this, you will know this and you will love it for it."}, {"rating": "0", "text": "Feminist Feminist Feminist Feminist ..........................................................................."}, {"rating": "5", "text": "This movie is perfectly acceptable as a popcorn flick. The premise that it sets up is an interesting one but I don't necessarily think that it was fully fledged out or realistic in its execution. Daniel Radcliffe pretty decently portrayed a nobody in my eyes and watching him try to do ordinary things while having guns bolted to his hands is pretty funny. But a lot of the pursuit and combat sequences are jumpy and feel a bit one sided. Overall it's a pretty goofy movie and doesn't necessarily need to be watched, but it could serve well as a movie night with friends popcorn flick."}, {"rating": "9", "text": "Guns Akimbo: This has to be one of the most underrated movies of all time. From the poster and trailer it looks like a half way decent film oh no when you watch it, it’s so much better than that. The cinematography just shows the hyper violent of the the one of the villains Nyx and shows the other character Miles as a more freaked out person. The long takes also fantastic. But the movie is a hyper violent film and it doesn’t really hold back too much it does use CGI blood which is a bit of a red flag but it’s not so in your face enough when that it gets annoying. The cast is perfect with what they are giving the standouts are Daniel Radcliffe who’s American accent is so good that if I didn’t know that he was British I would think he’s America. Samara Weaving is so good in this and the way they made her look not attractive enough to be a badass woman that it’s crazy what she does she gets so many bullets shot into her and doesn’t die that it’s crazy. The movie is also self aware you see copies of Doom 2016 on Miles’s table he makes comments about how guns are louder in real life and that Rambo should be dead for firing that machine gun. The director is a VFX artist to he did the Avengers, War for the Planet of the Apes, The Wolverine and Man is Garbage. Overall this is a underrated gem of a movie that is so good that you need to see."}, {"rating": "7", "text": "For fans of movies like Crank, Hardcord harry etc or really REALLY dumb action movies. There is a plot but it's stupid and you really wont care. Grab a beer, popcorn, turn off your brain and enjoy, stupid action flick with good performances and production values but the story is only predictable and only a tangental framework to hang the action scenes on."}, {"rating": "7", "text": "It's hard to say something definite about the movie. There are so much different aspects. But, if in the short term. It's a good mindless movie, quite fun with GREATE operator's work and music. A love everything in the film, except the plot.  It's soooo stupid sometimes, and shooting from the main hero needed to begin much earlier, then almost in the end of the movie."}, {"rating": "7", "text": "I dunno I liked it, it was a bit silly but I treated it as an action movie with a bits of comedy, so why not. Dont expect greatness of it, just watch it for a bit of fun."}, {"rating": "9", "text": "MUCH better than 90% of the trash Hollyweird pumps out these days, and it didn't push any political SJW agenda either. I loved this movie, but sadly I doubt it will get a sequel."}, {"rating": "10", "text": "The movie is lighthearted adult fun. If you liked Deadpool - go ahead and watch it."}, {"rating": "6", "text": "Неплохой трешачок. Сюжет очень простой. Из игры актеров понравился только Редклифф"}, {"rating": "6", "text": "On paper I should absolutely love this movie. My new favorite actress stars in it Samara Weaving of Ready or not along with the oddly charming Daniel Radcliffe of Harry Potter. The trailer showcases anime style violence, a weird video gamish plot and R RATING for extreme violence and gore. But somehow for the first 2/3 it just doesn't gel together. The setup concerns a loser type young man who does alot of hate blogging and ends up pissing off the creators of an online running man type gameshow. He awakes from being assaulted with two guns fused to his hands and the surviving gamer (Weaving) on the hunt for him. The movie is action packed but for the first half it doesn't connect. When it does it becomes a unique ultra violent, cartoonish cinematic experience. Although it's not great there's definitely enough here to merit a light reccomendation.3.25/5"}, {"rating": "6", "text": "This movie is basically like Crank and Nerve smashed into each other at 100mph and had a baby. It isn't as good as Crank, but it is better than Nerve and still a ton of fun."}, {"rating": "7", "text": "Daniel Redcliffe is stapled with two weapons or, as he himself says, nailed down with an entire hardware department and has to assert himself and survive in a questionable cage fight for life and death (\"Sketch\").Basically I had fun with it, this movie is not great, but it is nice for simple entertainment. Linking the film with the various everyday conditions of the internet and social media worked for me.In addition, there were very cool action moments, which, although not close to the real action heavyweights, could deliver funny moments to the protagonist through this Akimbo story.You can watch the film. 7/10 headshots."}, {"rating": "8", "text": "Crazy ass, Uber violent, blistering movie. It’s like the makers of Crank did some lines and decided to make a movie like Gamer and Nerve all rolled up in one."}, {"rating": "10", "text": "Guns Akimbo was amazing performance from Daniel radcliffe. I can't wait for the sequel."}, {"rating": "3", "text": "La premisa es buena, pero mal ejecutada. El exceso de cambios de plano rapidos en las escenas de acción sirve para ocultar la falta de realismo en las peleas y tiroteos. Lo cual no seria un problema si no fuera por que la pelicula intenta transmitir un mensaje critico con la sociedad i la tecnologia. La indecisión entre seriedad y comicidad junto con un argumento flojo con momentos de grima a lo largo de la pelicula (escenas, dialogo, musica,...), dejan con un mal sabor de boca. Por lo menos nos deja el meme de Radcliffe con albornoz, calzoncillos, pistolas y cara de recien salido de una rave. No repetiria."}, {"rating": "7", "text": "Samara Weaving is on another **** level. like she is perfect in everything she does"}, {"rating": "8", "text": "A super fun movie that moves at absolutely breakneck speed. It has great action and is pretty funny; though not all of the jokes land, and the plot isn't exactly a masterpiece. It isn't for everyone, but it's definitely worth a watch if you want some dumb, fun action that doesn't take itself too seriously."}, {"rating": "7", "text": "This movie is definitely a little underated. Even tho this movie may not have blown up at the box office or will ever be a smash hit, the actor's all did there jobs well even Radcliff who continues to prove his not just some type cast childstar actor. The movie itself doesn't dig very deep into characters but i dont think it needs to. Pretty neat concept and storyline very enjoyable."}, {"rating": "6", "text": "A fun little film that knows what it is, just turn your brain off and enjoy. Daniel Radcliffe is brilliant as ever and the story is pretty dumb but serviceable. My only true problem is the girl, nix is a complete badass at the start taking on waves of baddies but when it's time for her to kill Radcliffe she gets nurfed and can't shoot for crap  ."}, {"rating": "0", "text": "The only reason the reviews are at a 6 is because of Daniel Radcliffe, without them it would be a 2. This movie exploits them for their fame and tarnishes their name. The writing is astoundingly, ridiculously awful. I can't even say the realism is bad, because at this point that would be a compliment. This movie plays like the writer never wrote a script or dialogue before, and the producers didn't know what they're doing. All of the fault is on the writer/director, producers, and possibly the other companies involved for somehow mutually approving this. None of them are doing their job well. There's only so much the actors in this movie can do to stop the head honchos from making a bad movie.It would be cool if The Critical Drinker did a 30 minute review on this and say everything I wanted to and more."}], "recommendations": ["free_fire", "limitless", "kingsman_the_golden_circle", "taken", "gamer", "repo_men", "hardcore_henry", "lucy", "machete", "the_purge_election_year", "red_sparrow", "the_kingdom", "bright", "run_hide_fight", "dragged_across_concrete", "infinite", "london_has_fallen", "ant_man_and_the_wasp_quantumania", "skyscraper", "shadow_in_the_cloud", "crank", "nerve", "wild_card", "crawl", "sucker_punch"]}