{
  "id": 158,
  "title": "Hacksaw Ridge",
  "starring": [
    "Andrew Garfield",
    "Sam Worthington"
  ],
  "runtime": 139,
  "genre": [
    "Drama",
    "History",
    "War"
  ],
  "description": "WWII American Army Medic Desmond T. Doss, who served during the Battle of Okinawa, refuses to kill people and becomes the first Conscientious Objector in American history to receive the Congressional Medal of Honor.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jhWbYeUNOA5zAb6ufK6pXQFXqTX.jpg",
  "categories": {
    "plot": 8.86,
    "acting": 8.916666666666666,
    "ending": 8.6,
    "soundtrack": 8.5,
    "cinematography": 8.5,
    "familyFriendly": 7.5,
    "funny": 7.333333333333333,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Wow! What a movie! Honestly, there is no reason to get into details, this flick is just an amazing movie experience from the first second! It starts a little bit dramatic, becomes a romance, turns into a comedy, spends a few minutes in the drama again, and then just dives into a bombastic war-action, with everything working perfectly together to get you involved with the story (which is clever, isn't real life a blend of different genres too anyway?) Just sit, avoid distractions and enjoy!"
    },
    {
      "rating": "10",
      "text": "Wow I just watched this movie the other day and it was Insane. I will start with the story which is about Pfc. Desmond Doss who won the Congressional Medal of Honor for saving 75 men in the Battle of Okinawa during WW2 for those who don't know their history. The story is executed perfectly in the roughly 2hr and 15min movie. The first half shows his life and boot camp and the second half the Battle at Hacksaw Ridge. The movie is based on a true story as well which makes it that much more grounded. The acting is tremendously Superb. I mean Andrew Garfield killed it lol. No pun intended. I know some people don't like him but he was great at portraying a convicted individual who's beliefs were being attacked. The other three standouts were Capt. Glover played by Sam Worthington and Sgt. Howell played by Vince Vaughn and finally Tom Doss played by Hugo Weaving. They all were Impeccable in their acting. The action was honestly some of the most Intense I have seen in a Military Movie to date and I have watched a ton of Military films and I have studied military history. The depiction of the battle of Hacksaw Ridge was very authentic and extremely heart palpitating. The Japanese were and are in my opinion the greatest threat that Americans have ever faced in battle. They were extremely formidable and were not afraid to die at any given second. I digress but the battle was bloody and full of shock value but not unrealistic by any sense. The cinematography was honestly perfect in every shot and frame. I will close by saying this is honestly the Best Military movie I have seen to date including in my opinion surpassing \"Saving Private Ryan\" and Mel Gibson as always is a Beast of a director. I was honestly in tears at the end of the movie when they showed the real life interviews of the actual heroes of that real life event. Go and Watch this movie."
    },
    {
      "rating": "10",
      "text": "An astonishing, powerful movie that is a wonderful return to form for Mel. Some of the most intense, terrifying war scenes ever filmed, all in service to a moving story about how God works through faith to do incredible things. I usually hate WW2 movies but this one blew my hair back!"
    },
    {
      "rating": "7",
      "text": "We might have seen hundreds of movies about America going to war and watching it through individuals perspective. There is nothing new in watching an american war hero. There is blood and gore, rawness of war, but the depth of character or an idea is missing. promising start with predictable end."
    },
    {
      "rating": "10",
      "text": "Incredible all round performances don't take anything away from the themes and direction of this film as it leaves you stunned and exhausted. A film I truly hope wins Mel Gibson , Andrew Garfield best director and best actor and I hope best picture as well."
    },
    {
      "rating": "10",
      "text": "This was the best movie I have ever seen , you didn't regret watching this at all  , it should definetly win an orscar ! Great life lesson and very emotional"
    },
    {
      "rating": "7",
      "text": "Corny as hell but also vital, intense and at times truly transporting. The chaos of war is wholly apparent here. It's not just quick edits, it's cohesive editing done quickly and with precision to create impact. It's astonishing how powerful some of these scenes are.But all the drama doesn't really work. Or it works like you expect but even cheesier and more obvious than you thought possible. Garfield is good, but his good old boy voice sums up this movie perfectly. What the hell is that mixed up with all this other good? Why is the dichotomy so alarming? If it's intentional it doesn't work."
    },
    {
      "rating": "8",
      "text": "The script is kind of basic but what really helps make this film shine is the fantastic directing by Gibson and the wonderful acting by the cast. Garfield did a great job as lead and Weaving did a fantastic job in his small supporting role. I also wanna give a shout out to Vince Vaughn. I did not expect such a good performance from him but he really shined and did a phenomenal job."
    },
    {
      "rating": "10",
      "text": "Great film, great story, great portrayal and most of all a great message!...how many films have that nowadays? Just a classic! highly recommended and one to keep in your classics collection."
    },
    {
      "rating": "7",
      "text": "Leaving the not so amazing Spiderman franchise really was the best thing for Andrew Garfield’s career. His recent movies show his real potential as an actor and this is no exception. Vince Vaughn is horribly miscast, thankfully his character has very little to do expect look angry and shout at everyone. The supporting cast are perfectly chosen, even Sam Worthington (I know I was surprised too).Hacksaw Ridge is an intense war movie that dives headfirst into the violence and true horror of war. Although there’s only so many times you can see a soldier flying through the air in slow motion before it loses its effect there’s no denying the battle scenes are shockingly brilliant. Based on an incredible true story it’s a must see for Mel Gibson fans. However, you will have to sit through a good 40 minutes introduction that was nearly boring me to tears. If you make it through that it’s all uphill from there. Recommended."
    },
    {
      "rating": "10",
      "text": "This movie is no average movie. It is a true story, and thats what I enjoyed the most about it. Sadly the movie takes a while to pick up, but when it picks it... It f**king picks up! The movie is filled with gore and horrifying visuals, it shows the horrors of war and how scary man truly is. Acting is amazing, the dialogue is perfect, Andrew Garfield did a great job. Mel Gibson proved him self again with this must watch classic. Some people said the movie preaches a lot about Christianity, I'm not saying it doesn't but at the same time its not really an issue, it didn't bug me or anything. There are no perfect movies but this one is surely close to that. Hands down my favorite movie of 2016."
    },
    {
      "rating": "8",
      "text": "The war scenes are done extremely well, the more dramatic scenes just lacks a little of the same punch.  Overall I can't help but admire the end product even if I couldn't fully embrace it. A-"
    },
    {
      "rating": "10",
      "text": "Mel Gibson really did a great job! Such an inspiring story! The visual effects, the acting, the editing - top notch! I think this movie is just amazing on every aspect and i give it a 10/10. No movie on this world is perfect, but 10/10 means simply - a masterpiece!"
    },
    {
      "rating": "7",
      "text": "It is not clear for me who can put the low scores for this movie. the film kept me in suspense all along.The battle scenes are gorgeous. There is not a single superfluous scenes or dialogue."
    },
    {
      "rating": "10",
      "text": "Gibson develops all character fantastically in this true story film. His direction creates so many intense and scary moments that has you on the edge of your seat. All actors and actresses play their amazingly. This is the best movie of 2016, its a shame it did not get recognized as much as it should have."
    },
    {
      "rating": "10",
      "text": "Andrew is the best actor and Mel the best director. Amazing film EVERYONE should see.  GO see it on the big screen because it deserves it, before it's gone. GO. Love this film. Has everything great in it!"
    },
    {
      "rating": "10",
      "text": "Amazing movie,so powerful and grips your heart. It was amazing how this movie focused on doing what your heart and values are and sticking to them no matter what pressures you may get. Sad and painful at times and emotionally effects you. It really made me think on life issues after watching the movie. I cried and was really touched by this awesome movie. Have not been so emotional from a movie for a very long time. It made me feel so much empathy. I loved the story and the actors were amazing. Many issues addressed in the movie and powerfully done. If I could give it a higher rating I would I it grabs you from beginning to the end. Highly suggest you see this movie."
    },
    {
      "rating": "7",
      "text": "An excellent film that crosses genres, and in doing so succeeds in telling an absolutely incredible true story. Every actors performance shines, and its an incredible return to directing for Mel Gibson. If you like War films, you cannot miss Hacksaw Ridge."
    },
    {
      "rating": "9",
      "text": "Hacksaw Ridge marks the return of Mel Gibson to directing after a long hiatus. The movie tells the true story of Pvt. Desmond Doss who was the first conscientious objector to receive a congressional medal of honor.The story itself is fascinating and Gibson does a good job of establishing the characters first. We learn early on what Desmond's motivations and beliefs are and how he carries those beliefs through the duration of the film. It's great that this characterization is handled by Andrew Garfield who is so damned likable in this movie that it's easy to become invested in this incredible story. The cast is also supported by other notable actors like Hugo Weaving, Sam Worthington and Vince Vaughn. I was initially concerned that Vince Vaughn may be an odd fit, however he was a pleasant surprise and sold me on his portrayal of a drill sergeant. These underpinnings and character building make the payoff at the end all the more worthwhile. Desmond's beliefs are tested numerous times especially during basic training. Nothing tries those convictions more however than the carnage of battle. The film doesn't flinch when it comes to depicting the carnage of the battle of Okinawa. The violence and brutality of the pacific theater is shown with disturbing detail. All the gore and carnage highlight Desmond choice to go into battle without a gun. It creates a riveting contrast and in my opinion one of the best films of 2016."
    },
    {
      "rating": "10",
      "text": "The glorious return and redemption of Mel Gibson as director. The Battle of Okinawa is narrated in a realistic and visceral tone that envelops the viewer. Andrew Garfield in the role of heroic Desmond Doss is outstanding."
    },
    {
      "rating": "8",
      "text": "Mel Gibson knows how to make a brutal movie; the violence is in your face. Showing how violent the battle was only amplifying the courage Doss had to go into this without a gun.  I for one could not. Though the film seems like two different movies the impact of the second half would not be possible without the first. Everyone involved is on top of their game. Andrew Garfield continues to prove why he’s one of the best young actors in the business. Shy of a few scenes that felt out of place the film is great, but seeing Doss in archival footage at the end and hearing the story added to the impact of this man’s actions."
    },
    {
      "rating": "8",
      "text": "Hacksaw Ridge is based on the real life experiences of Desmond Doss, an American pacifist combat medic, who served during World War II.Mel Gibson may not be the most popular man in Hollywood these days (with good reason to be honest) but he does know how to make intense movies. Much like most Hollywood movies Hacksaw Ridge does take liberties with the source material but the story is well told and the battle scenes, which take up pretty much the whole of the movies second half, are brilliantly shot making for one of the best war movies of recent times."
    },
    {
      "rating": "8",
      "text": "Great return to form for Gibson, very moving tale with good direction, visuals and acting."
    },
    {
      "rating": "8",
      "text": "Mel Gibson, along with Martin Scorsese, has a finger on the pulse of Christianity. In The Passion of the Christ, Gibson's much maligned film, he brilliantly captures Jesus and his essence. Though many hate the film, it is a personal favorite of mine. Powerful and brilliantly capturing Jesus through the eyes, rather than words, Gibson's film is one that struck at my very core. Hacksaw Ridge did the exact same thing, but rather than showing Jesus himself, he shows how the words of Jesus and actions of those who follow Him can transform lives. Transcending human definitions of courage, the powerful true story of Desmond Doss - a conscientious objector who saved 75 lives on Hacksaw Ridge as a medic - is a brilliantly told and entirely powerful film. For those who are not religious, the film may come home as hokey and corny, which are fair criticisms. But, as a Christian, I ate it up with a spoon and went back for seconds.Perhaps the biggest flaw of Hacksaw Ridge is how it wears its influences on its sleeve. In particular, Full Metal Jacket. With the first half being set in basic training with a hard-nosed and funny drill instructor, Sergeant Howell (Vince Vaughn), and the second half coming full force with violence, explosions, and shooting, the film lacks the thematic ruminations of Full Metal Jacket while embracing their visceral impact. It is hardly original in this set-up and it is unfortunate that Gibson just ripped off that film - it transcends influence - and gave it his religious twist. The film's first half is also further maligned by cliches with the introduction of Doss's wife, Dorothy (Teresa Palmer). Sweet and romantic, the romance always feel incredibly nostalgic and innocent, but never really feeds into his character development too much. The picture in the Bible or the picture as a \"Oh wait, I almost forgot\" gift from a girlfriend to her boyfriend heading off to war is a tried and true cliche that is about reaching the end of its run too, right? The cliches of the first half and then the Full Metal Jacket structure render the first half largely being the weaker one by far.Fortunately, the second half is impeccable. Bloody and brutal, the film's violence can be a bit numbing, but is beautifully captured. Expert staging and choreography plus brilliant cinematography with an emphasis on the greens and browns of battle and bombs, contrasted by the deep blood red of violence, the film is absolutely terrific. It may be a bit comically over-the-top, but Gibson painstakingly captures both the strategy and the violence of war, infusing it all with great tension and thrills. While many cite the second half as being far weaker (as they do with Full Metal Jacket), it is brilliant in my opinion. Yet, one of its greatest complaints is how it contrasts with the first half and the pacifism on display there. Personally, I see no issue. Desmond wanted to go to war and this is war. He knew there would be blood, so the audience and the film understand there must be blood. It is a war film and though Doss's tale is vastly different than many other soldiers, it still must show the brutal reality of war and Gibson does so brilliantly.Yet, the film finds its greatest power in the last half hour. As Doss races back and saves 75 different men, painfully lowering them down the ridge after his own men had long gone aside from two guards, the film turns into Church. Begging God to let him save one more and asking God what his purpose is in this battle, the film is moving, powerful, and entirely resonant. Though a bit preachy, Gibson's film shows the struggle for Christians in violent situations or the world as a whole. With chaos all around, how do we live up to Jesus' example? Where are we needed and what is our purpose in this world? Doss is confronted with these questions in the heat of the moment and must act quickly, performing what he believes to be God's purpose for him in war. With his bravery and courage quietly performed, Doss is a man that serves as pure inspiration for anybody searching for this purpose in this world as an agent of God or anybody seeking to be brave in an unconventional fashion.A striking tale of bravery with a tinge of pacifism and an anti-war message, Hacksaw Ridge is a powerful, riveting, and truly gorgeous film. Just as with The Passion of the Christ, it play more resoundingly with Christian audiences, but it is a great war film in its own right. It may be too cliched and influenced by other war films at points, but Gibson knows violence and uses that knowledge to craft brilliantly smart battle sequences that resonate nearly as much as its appeals to its Christian target audience. Hokey and corny, Hacksaw Ridge is the cinematic version of Church and plays strongly at fears of Christian persecution. Yet, in spite of that, it is undeniably powerful and a terrific film for audiences willing to go along with its spiritual core."
    },
    {
      "rating": "9",
      "text": "Both an inspiration story of faith and staying true to your beliefs and a genuinely frightening portrayal of the horrors of war! Hacksaw Ridge showcases Desmond Doss's amazing story with fantastic acting and terrific action sequences that are directed brilliantly and effectively."
    },
    {
      "rating": "8",
      "text": "Mel Gibson shakes off the rust and dust of a decade-long directorial hiatus by returning to the genre that brought him such esteem behind the camera in the first place - the war epic. And, if you as a viewer can get past the somewhat cheesy, made-for-TV-esque stylings of the film's shaky first act, you may still be in for a treat. Because the film's latter two-thirds is nothing short of one of the most breathless, violent, and invigorating war film experiences I've seen in quite some time. Gibson's directorial prowess throughout this sequence is so absorbing and effective that it very easily removes any memory of the shortcomings dwelling within the film's opening moments, giving the viewer the inspiringly resonant experience they signed up to receive. High marks also go to all cast members - Garfield, Weaving, Vaughn, Worthington, and Bracey included - for facilitating this truly immersive experience."
    },
    {
      "rating": "8",
      "text": "On the battlefront, his intention was to save the lives.The film was awesome, mainly because of the good message it carried out. That's not it, the film was well made with the wonderful cast and their great performances. The special effects were top notch, as well as the location where the majority of the second half takes place. This is a US-Australian co-production. Mel Gibson returned to the director's chair with a bang after exactly a decade. It got six Oscars nominees, so let's wait and see how many awards it grabs.It was the World War II theme, based on a real person and events. It tells the story of an American youngster named Desmond Doss, who joins the army to contribute to his nation. But for his religious point of view, he struggles during the training. After managing to make through, the remaining film focused to reveal his bravery on the battlefield against the Japanese armed forces at Okinawa in a place called Hacsaw Ridge.The story was based on one of the ten commandments. Doss, who strongly believes in that carries the same ideology to the combat zone. But all the initial part of the film reflects why he is very on to it. Especially after a fight with his brother in his childhood, followed by saving a severely injured man in a road accident just before deciding to join the army. So it is like both, a war film, as well as an anti-war theme. Most importantly, it tells us the bravery of a man, like of something Gandhi in the battlefield.He did it in what he had believed, but my perspective differs. I liked the film, as a biopic and the message it delivered. Very entertaining too, but when it comes to Doss' belief, I think it was flawed. In the first place he would have not joined the army if he's true to the commandment. That's the basic rule of the commandment if one wants to adopt it.He was just one of the unique person with such idea and luckily succeeded following it in a hostile situation. Only if you think all his episodes from an atheist perspective, that's how you would feel. One of the major reasons for that is, when he saves his men by letting his enemy die. But appreciable effort, at least from the Americans perspective. A true hero for his nation. One of the best war films ever. Instead of saying a must see film, I would say don't miss it.7.5/10"
    },
    {
      "rating": "10",
      "text": "Hacksaw Ridge is a truly epic, emotional, and unique take on a war story. Mel Gibson does a great job portraying the story of an unbelievable war hero who's accomplishments were meant to be told through film. Though the graphic violence and intense combat may not be for everyone to stomach, Hacksaw Ridge still provides a good balance of comedy, heart, action, and triumph! A must see inspirational story of courage and determination, this movie is a truly fantastic war flick."
    },
    {
      "rating": "9",
      "text": "Andrew Garfield turns in an amazing performance.  I wasn't a big fan of his, till I have seen some of his recent performances.  For me he immensed himself in the role, and made you feel that you were reliving the true story.  For me talking about acting in this movie Vince Vaughn stole the movie, and showed all of us that he can act.  His role as the drill sargent totally iced the movie.  A must see movie with the story, action, and characters binding in a memorable movie you won't forget!!"
    },
    {
      "rating": "10",
      "text": "What a fantastic movie Mel Gibson's finest movie yet he sure hits home with this fine masterful film Andrew Garfield sure is quite solended as a man who doesn't belive in guns and doesn't want to fight his own men considered him a ciward butvhe proves to be the bravest of them all"
    },
    {
      "rating": "7",
      "text": "It is two stories. A love story and the battlefield story. It is well made and it connects the two. I don't know how I feel about it. It isn't American Sniper that touches the audience, nor is it Braveheart, an almost perfect movie. If you are interested in the subject it will satisfy but if not then it won't."
    },
    {
      "rating": "10",
      "text": "Saving Private Ryan and Hacksaw Ridge both have the ability to affect you long after you watch them. Hacksaw Ridge affects you in a particular way because it was presented to us through the story telling mind of Mel Gibson, who is one of the greatest directors of our time. Hacksaw Ridge also sticks with you because it captures the sharp contrast between daily life and the field of battle. I felt a deeper sympathy for our veterans than I have ever felt after watching Hacksaw. It's a powerful movie and it deserves a watch."
    },
    {
      "rating": "10",
      "text": "Hacksaw Ridge is one of the best films I've seen this year and the best war film I've ever seen!\rThe action scenes are horrific and excellently made, and the actors performances are amazing.\rI Will definitely recommend this movie and even go watch it again!"
    },
    {
      "rating": "10",
      "text": "Best movie of 2016 hands down. An incredibly powerful, moving tale of courage, humility, and faith. Sleazy, pandering Oscar-bait movies about blacks and gays are a dime a dozen these days, but a movie that actually portrays the true story a heroic and devout Christian with respect is something we almost never see. Bravo Mel!"
    },
    {
      "rating": "9",
      "text": "Mel Gibson finally returns after an unjust hiatus, and we finally get to see what we have been missing out on. 'Hacksaw Ridge' is a fantastic, brutal war story about Desmond Doss (Andrew Garfield), a conscious objector, who refuses to carry a weapon after a traumatic experience in his life. At the core of the movie, its about faith, despite all the blood and carnage, it's a very christian film. \"Help me get one more..\" Doss prays, \"Just help me get one more..\" as he crawls through the grime and corpse filled landscape, like a saint going through the gates of hell. Yet, he saves 75 wounded soldiers without firing a single shot. 'Hacksaw Ridge' is in my opinion, the best movie of the year."
    },
    {
      "rating": "10",
      "text": "Hacksaw Ridge is directed by Mel Gibson and stars Andrew Garfield, Vince Vaughn, Sam Worthington, Luke Bracey, Teresa Palmer, and Hugo Weaving in a story that takes place in the time of World War II where Desmond Doss played by Andrew Garfield enlists in the United States Army to become a combat medic and his participation in the war was for him to save lives instead of taking them. Now I'm a big WWII nut, I love the time period, and as much as I know about it, this story was nothing but unknown to me, but I now know a big part of the battle of Okinawa a little bit more clearly. Hacksaw Ridge is culmination of what it's like to have something as your beliefs tested and questioned while struggling to stay faithful in what you believe in. The film itself is a shockingly realistic re-enactment of of the pinnacle of the pacific theater of war during WWII, Mel Gibson re-catches the attention of the world as he makes his comeback to the directing world with a film so emotionally deep and such frighteningly realistic scenes of brutal war violence that it's easily comparable to Saving Private Ryan when it comes to showing the audience what it's like to see the horrors of war through someone else's eyes. Andrew Garfield surprised me so much, he really held the film up, when I first heard he was going to have the lead role I was very nervous because his role as Spider-Man in the Amazing Spider-Man films was not that great so to hear that he was taking the helm in a very serious role such as Desmond Doss made me very skeptical of how he might portray his character in this film, but after seeing this film I was totally blown away by how much dedication he gave to Desmond, honestly if he does not get at least a Golden Globe or Oscar Nomination I will be really mad. The supporting cast was amazing, I was surprised to see Vince Vaughn in serious role compared to comedian Hollywood normally views him as. Sam Worthington was also amazing, before this, I have not seen him in very many movies since Avatar but this was definitely one of his better roles that he has ever done. As for Luke Bracey, Hugo Weaving, and Teresa Palmer, they were also amazing in the roles they had. The acting in this film is one the best aspects of the film, but to me what really made this film unbelievably great was the cinematography, the production design, and the make-up made this film really shine with undeniably realistic and graphic battle scenes, beautiful wide shots, and the gore in this film is so gruesome that it's very difficult to forget it all, but that's how war is. Out of all the World War II films I have seen in my life, Hacksaw Ridge is now one of my favorite WWII films I have ever seen, and I am very impressed with Mel Gibson's directing work in this film, I can't wait to see other films in the future that he will direct because Hacksaw Ridge is in my opinion a unforgettable masterpiece, and one of Mel Gibson's best director work since Braveheart and The Passion of the Christ. Hacksaw Ridge is a film to remember in the coming future."
    },
    {
      "rating": "10",
      "text": "Hacksaw Ridge is why I go to the cinema. It provides an experience that is entertaining, emotionally impactful, and keeps me thinking about it long after leaving the theatre. It maybe has too many 'Hollywood' (pun intended) actors for my taste, since the film is set during WW2. But they all deliver really great performances, especially Andrew Garfield as Desmond Doss. He did such an amazing job that you really care about what he believes in. The writing and depiction of the war were also great. Gibson doesn't shy away from showing you the realities of war and the effects (both physical and psychological) it has on people. Doss' backstory was done very cleverly and makes you truly understand why he won't kill. The music and cinematography (especially during battle scenes) are beautiful. I'm so glad I got to see this movie right before Remembrance Day. It truly is a spectacular film based on a spectacular true story. When it comes to the ending, all I can say is wow. I didn't see it coming. You must be a heartless human being if you don't tear up at least once during this movie. Do yourself a favour and go see it right now!"
    },
    {
      "rating": "9",
      "text": "Wow! I was completely blown away by this film! Mel Gibson has done what I considered to be the unthinkable: He's proved that he's still got what it takes to make a compelling and engaging film, even after all these years of his weird and controversial nature and personality, especially post-Passion of the Christ release. Anyhow, I digress. This was one solid and engaging war film from start to finish and quite possibly the most violent one I can recall since Saving Private Ryan. Nonetheless, it still manages to stand out rather well this way. As for the cast, Andrew Garfield gives what I'd heavily consider to be his greatest performance yet! Other familiar faces such as Sam Worthington, Vince Vaughn, Hugo Weaving, Teresa Palmer, etc round out the great and talented supporting cast in this film. Overall, despite a few moments of predictability throughout, they're more than made up for through the sheer power of the film's remarkable true story and hero along with the harrowing yet memorable war sequences in the film's second half. Simply put, it's just one solid film and a surprisingly pleasant return to form for director Mel Gibson!"
    },
    {
      "rating": "10",
      "text": "Absolutely loved this film. It, for me, is one of the greatest war movies of all time. The movie, in my opinion, is a perfect war movie. I have no clue why the critic review is as low as it is. If you haven't seen this movie yet, do so now."
    },
    {
      "rating": "10",
      "text": "Incredibly visceral and inspiring film!  Andrew Garfield deserves an Oscar for his performance.  It's a shame that Mel Gibson has gone 10 years since directing \"Apocalypto\" which is another stellar piece of movie making."
    },
    {
      "rating": "9",
      "text": "I'm seldom inspired anymore at the movies. More and more I'm weary with the same old formulas - superficial story telling and quick buck cash-ins. Our films seem to be a reflection of our culture these days, aimless, unsure of themselves, fearful of taking a stand on anything.\r Hacksaw Ridge is a moment of clarity in a weary world. It is a beautifully constructed film, well paced, technically brilliant - but the substance of it is quite profound. This movie has a soul, and it speaks to the viewer in a way that most of the trash that gets flung on our screens just can't match.\r Uplifting romance, solid values from a time when the West knew who it was and what it stood for, and breathtaking war scenes showcasing both the horror and profundity of the conflict.\r And it's all wrapped up in a subtle package that has gentle undertones of faith and hope. I'm not religious - I struggle to believe - but the balance here is perfect; it doesn't preach, but there's something in there that speaks to the soul and I have to say... it's so refreshing.\r Go see it."
    },
    {
      "rating": "9",
      "text": "Hacksaw Ridge is one of those rare movies that reminds you even in the worst situations, that it can still bring out the best in a person. Through Mel Gibson's harsh direction and Andrew Garfield's humbled performance, they craft one of the absolute best movies of the entire year that will make you want to stand up and cheer by the time it ends."
    },
    {
      "rating": "8",
      "text": "This film is based on the true story of a conscientious objector (played by Andrew Garfield) who saved the lives of 75 men during the bloodiest battle of WWII. Before hitting the battlefield, the narrative sets up the events that formed his beliefs, the woman back home who supported him and the intense antagonism he faced from the Army. His rich, yet subtle performance once again proves that Garfield is one of the finest actors of his generation. As for director Mel Gibson, the romantic and emotional elements are richly told (albeit in a traditional structure and style), but it's the staging of the battle that makes the strongest impression: The most gruesome and violently brutal depiction of the horrors of battle since \"Private Ryan.\" Even though it could easily lose 30 of its 131-minutes, this remains a potent drama and an affecting portrait of a brave and principled man."
    },
    {
      "rating": "7",
      "text": "Hacksaw Ridge is a 50/50 movie for me. I didn't particularly enjoy the first hour of the movie, but boy, did the second hour make up for it.Plot: As I mentioned, the first hour of the movie was very melodramatic as well as cliched and borderline boring. It's a typical love story, everything works out conveniently, and some of the line delivery and scenes are cheesy. However, the second hour is pure brutality and war violence, that is so well done and filmed excellently. It was like watching two completely different movies (like Full Metal Jacket but not executed quite as well). But, the advantage of having the first half so happy and dandy, it makes the second half so much more brutal, which I'm not sure is intentional or not. Otherwise, the second half was done well; shot perfectly, great sound editing and mixing, good enough story. It's just the first half that brings the score down a bit.Characters/Acting: Andrew Garfield did an excellent job, earning the Oscar nomination. Do I think he should win? No, but he deserves the recognition. Otherwise, the acting from the supporting cast was good, but it was mainly a showcase of Garfield's character and acting. I didn't like Vince Vaughn's portrayal of an army sergeant. I didn't think he was fit at all for the role, and didn't seem menacing enough to be a drill sergeant. The problem is, when he insults all the privates when prepping them, it feels very Hollywood and doesn't match the lighthearted tone the first half of the movie had. Full Metal Jacket actually had a matching tone and, although funny, it made you feel uncertain about whether or not you should laugh. Vince Vaughn just looks like too funny or nice of a guy to be seriously shouting insults as a sergeant.Cinematography: The cinematography was great in Hacksaw Ridge. It captured the sheer brutality of war, and the action was amazingly directed. As controversial as Mel Gibson may be, he knows how to direct action and warfare.Other: The movie was a bit heavy-handed; there were plenty of Jesus allegories throughout the run-time of the film that can be seen as propaganda. For example, there's a scene of Garfield having water poured onto him as he looks up at the sky, arms at his side, being cleansed of the blood that cakes his skin, all in slow-motion, while emotional music plays. I also didn't enjoy the depiction of the Japanese. They are portrayed as absolutely ferocious, disgusting, ugly creatures that MURICA must defeat. Their caricatures are exaggerated and Gibson really tries to get the point across that the Japanese are the bad guys, and you should be rooting for MURICA.Overall, Hacksaw Ridge is half cheesy-cliche, half brutal, well done, action. This is not a movie for the squeamish."
    },
    {
      "rating": "10",
      "text": "Mel Gibson has the ability to create movies with a gripping tension line from start to finish. At 2 hours 18 minutes, I didn't for a second feel the need to check my watch and I surely didn't lose interest in the film at any point. This film portrays the incredibly extreme reality of war and can oftentimes leave you gob-smacked by the images on screen. Mel has found many moments that will make you feel like you are 'in the movie' as the battles rages on. Something I particularly liked about this film was that the essence of the film continued to come back to the value of life on both the U.S soldiers and Japanese side. Heart wrenching and raw; I had a strong visceral feel toward this film. Great performances by Hugo Weaving,Teresa Palmer, all the young gun actors that had cameos and of course -Andrew Garfield.Andrew Garfield, open-hearted and well connected to the character, he certainly does a great job of bringing Desmond Doss to life/doing the character justice. This young actor has been handed powerful emotional content and has reciprocated by giving audiences a home run performance. Oftentimes overlooked; Andrew Garfield has put his talent on the line and *fingers crossed* will continue to be given the opportunity to shine in large future projects. By the time credits start rolling, you will need (atleast) a few more minutes to digest what you have just seen to fully process the heart-wrenching tragedy/reality of war and the heroic young man that dared to push against the grain. A VERY, VERY POWERFUL FILM. A MUST SEE."
    },
    {
      "rating": "9",
      "text": "Honestly, compared to all the other garbage that's put out there with no effort at all. This movie is a true work of art as it's well written and has exceptional acting. This movie doesn't demonize anyone, as it's based on a solder that vows to never touch a rifle. My heart was beating during the war scenes and I feel like this movie was a true work of art."
    },
    {
      "rating": "8",
      "text": "Hacksaw Ridge is the new adventure of Mel Gilson on epic cinema. The film is about a soldier that refuses to carry a weapon, the fight for his decision and its display at war. Like his previous works, we face an event in history of humankind, but from the point of view of one single individual. The focus for the protagonist is something characteristic in Gibson’s movies; the evaluation of human character at its daily basis, because the human concept has been lost through centuries, that’s why we start this journey with the sacrifice of Jesus, accompany the fight of William Wallace and escape beside Jaguar Paw, to finally rescue in battle with Desmond Doss. Here you discover that the real human is the one that stands by its own beliefs, fights for justice, defend the weak and takes care for his kind, but also struggles with inner and outer troubles, inner like pride, doubt, overconfidence, even innocence; and outer like discrimination, ignorance, fear. So hesitation is allow, questioning the act, feelings and thoughts; however the objective from the protagonist is enormous, bigger that himself and for that reason he moves forward no matter what. Mel Gibson is known for the strong direction, without reluctance on showing how it really was, and this film is no exception. There are amazing camera shots here, to details like finger on the trigger, spilled blood, lacerated limbs, mice eating human remains and many more; all these in order to portray the war more accurately and vividly, like nothing you have seen before or even can imagine. There are no words to describe the great performance of Andrew Garfield and Hugo Weaving or the epic soundtrack."
    },
    {
      "rating": "8",
      "text": "Bravo went in not expecting much walked from watching one of the best movies of the year. Just wow! A war movie done right. Great acting from the main cast, great story and even a great musical score! Skip that fluff that's lala land and watch this. You won't regret it!"
    },
    {
      "rating": "9",
      "text": "Rarely has a tale of courage ever been so finely told. Is Mel Gibson the greatest director of all time? If he's not, there ain't too many better. The epic, raw power emanating from this tale, especially in the second half of the film, needs to be experienced on the big screen for sure. The first half of the film was a little bit slower than I imagined, but that hardly takes away from the spectacle. Second best movie of the year, behind Silence. 8.5/10"
    },
    {
      "rating": "9",
      "text": "Supporting actors were absolutely fantastic in this film. This might honestly compete with Saving Private Ryan or Black Hawk Down for best war movie of all time. It's that damn good. I'll have to admit though, the first half was just a TAD bit boring but the second half just makes up for it and does a lot more. Very powerful film."
    }
  ]
}