{
  "id": 3889,
  "title": "Hairspray",
  "starring": [
    "Nikki Blonsky",
    "Zac Efron"
  ],
  "runtime": 117,
  "genre": [
    "Comedy",
    "Romance",
    "Drama"
  ],
  "description": "Pleasantly plump teenager Tracy Turnblad auditions to be on Baltimore's most popular dance show - The Corny Collins Show - and lands a prime spot. Through her newfound fame, she becomes determined to help her friends and end the racial segregation that has been a staple of the show.",
  "releaseYear": "2007",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/g1yQLFeAo7ZNdCPY1F7yytnn2UP.jpg",
  "categories": {
    "plot": 6.888888888888889,
    "acting": 6.666666666666667,
    "ending": 9.2,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 8.25,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "I was very disappointed in this movie. All the dance numbers came across as flat and cried to be seen on stage. All the 'kids' were great but of the adults only Latifah and Janney really shined. Travolta never became Edna until the last number and \"Timeless\" came across as wasted time. Walken was flat and I waited 3-4 years to see Pfiffer back on screen only to feel she was miscast (and the makeup job horrible!) IF I will buy the DVD--wish would really surprise me--it would be only for 3 or 4 of the musical numbers."
    },
    {
      "rating": "5",
      "text": "Glorified Disney movie. Travolta completely misses the point of a man playing Edna, oh why didn't they use Harvey Feinstein, who was born to play this role? Also, most of the young actors are just not up to the task."
    },
    {
      "rating": "6",
      "text": "Filled with wonderful musical renditions of the now-classic Broadway musical, Hairspray is a delightful and charming adaptation of the stage version and it's mediocre predecessor film."
    },
    {
      "rating": "4",
      "text": "One thing for sure, this movie is definitely not my type. But in some way, it was entertaining at some parts which is why it only JUST gets a 4."
    },
    {
      "rating": "9",
      "text": "One of the best movies I've seen and yet, I'm not really into musicals. The movie just made me stand up and dance all my way to the best \"You Can't Stop the Beat\". A movie with true and quality content, not the crappy films that are being released. Simply great!"
    },
    {
      "rating": "10",
      "text": "This is one movie that you will be guaranteed to walk out of feeling genuinely happy!"
    },
    {
      "rating": "10",
      "text": "I am a huge fan of the Broadway Hairspray; I even played in the pit with a touring company of it. The composer, Mark Shaiman, is a genius. Who knew that a gay Jew could write such funky music? Anyone who likes movie musicals even a little bit will LOVE this movie. My only complaint (which applies to almost all filmed dancing now)"
    },
    {
      "rating": "10",
      "text": "Just when you thought Hollywood couldn't do anything feel-good, it comes through with this. Blonsky, Efron, Kelley and Bynes are awesome -- and they aren't even the \"name\" players. John Travolta goes where Harvey Fierstein and Divine have gone before. Great job. Motormouth wasn't written for Queen Latifah, but she redefined it. This generation's \"Grease\"? This movie has more substance and better music."
    },
    {
      "rating": "10",
      "text": "A wonderful, exciting, charming musical film with expert performances by the entire cast especially the marvelous Travolta and Blonsky. Go see it."
    },
    {
      "rating": "10",
      "text": "People applauded at the end of some of the dance routines and at the end of the movie. For good reason!"
    },
    {
      "rating": "9",
      "text": "You know, I'm not one that SHOULD like this movie. I'm a 15 year old guy. My girlfriend dragged me along to this movie and at the beginning I thought, \"My God, save me.\" As the movie progressed, I started to like it more and more. By the end, I was smiling the entire time. This is a very, very enjoyable movie. Give it a chance."
    },
    {
      "rating": "9",
      "text": "Great story; great songs - I felt good about taking my 8 year old daughter to it. We both had a great time."
    },
    {
      "rating": "10",
      "text": "This movie was the best movie this year! ( besides Rataouille ) John Travolta was at his best as a woman. If I could, I would of gave this movie a hundred!"
    },
    {
      "rating": "9",
      "text": "The buzz was good on this one, but I only liked the Broadway show, and I was apprehensive about John Travolta from the previews. But from the first moment I got sucked in to the sheer pleasure of this one. It is a sweet confection with a moral that played much better on film than on stage. Great visually, wonderful choreography and a terrific cast. I recommend it without hesitation."
    },
    {
      "rating": "3",
      "text": "John Travolta and Christopher Walkin were totallly mis-cast."
    },
    {
      "rating": "9",
      "text": "an excellent movie, with a wonderful cast and moral greater then all modern movies hairspray puts a unique twist on a challenging yet exciting time period in our history. the singing and dancing were fantastic and the actors helped the show maintain its high energy level. the only let down was the fact that they cut two great songs: the big doll house and mama I'm a big girl now, resulting in the lyrics changes in without love that were not to my liking. otherwise a great movie to be enjoyed by all"
    },
    {
      "rating": "1",
      "text": "Very colorful, likable for the first 15 mins, and then it just became annoying! Travolts sucks a woman, he didn't look like one, didn't move like one, or speak like one. Also this is a \"MUSICAL\" so why are actors singing when they don't have the talent too sing!"
    },
    {
      "rating": "3",
      "text": "Terrible acting, terrible music, Queen Latifah was terrible Michelle Pfeiffer was worse, and Christopher Walken needs to learn to decline roles."
    },
    {
      "rating": "5",
      "text": "Had high expectations, and I know it's supposed to have a bit of a camp feel to it, but John Travolta just kind of killed the whole movie, and none of the musical numbers were very memorable in my opinion. I did like the nod to Waters, Ricki Lake and Jerry Stiller, though."
    },
    {
      "rating": "1",
      "text": "This movie will not appeal to any man who does not have a strong desire to live in San Francisco. or key west. It is about the most mind numbing thing I have watched this side of rush Limbaugh. There will always be people who like any crap served to them because they think they are sophisticated. but this move it not. I think Travolta days are better spent flying instead of acting if this is the best he can do. I strongly sug. you do not spend your money on this film, I down loaded it from the net and even though I did not pay for it, I felt cheated out of my time and want it back."
    },
    {
      "rating": "3",
      "text": "It fails on almost every level to be the amazing-ness of the 1988 original.  Also, John Travolta acting as some bubblegum version of Divine is tacky and downright cinema blasphemy."
    },
    {
      "rating": "9",
      "text": "A wonderfully entertaining movie. A very funny script with so many diverse characters. They all come together and shine in their performances. Just flat out enjoyable."
    },
    {
      "rating": "10",
      "text": "Bravo! This is the best movie I have seen in years. The songs, dancing and music make this movie an enjoyable musical. Even if you don't like musicals, you are sure to walk out of the cinema or switch off your TV smiling."
    },
    {
      "rating": "10",
      "text": "This is one of those films that is sure to put a smile on your face. I can't think of the film without getting a song stuck in my head. Well worth a watch"
    },
    {
      "rating": "9",
      "text": "The best movie musical of all time."
    },
    {
      "rating": "10",
      "text": "Easily my favourite musical and it's not hard to tell why because its full of catchy songs and stand-out performances from the cast. Not only is it a great concept but it's crosses over from a Broadway show to Film so easily! Nikki Blonsky in her first major role is just a delight and she is joined by so many talented stars here, but there's no looking past John Travolta and his hilarious portrayal of Edna! Overall a delightful film to watch and it will always be one of my favourites :)"
    },
    {
      "rating": "8",
      "text": "Ended up watching this because family put it on tv, and i didn't expect much.\rHowever, it was actually very entertaining, musical film really not my thing but definitely worth the watch."
    },
    {
      "rating": "7",
      "text": "Hairspray is a delightful revival of the cult classic. John Travolta is hilarious in his role as a women, and the movie prances along with respect to the original."
    },
    {
      "rating": "7",
      "text": "The opening was great and emerged self-confidence inside me. And the story was good actually. Somehow, something's missing here and I'm not quite sure what that is. Is it because it tells the story of the '60? I don't think so. Chicago's setting is away later than this and I love it so much. Mmm, maybe it's the songs??? Well, I guess they're really not my fave. Yet I'm happy enough to find that this movie is not telling the story of beauty salon as I've predicted from the cover and the title.\rQueen Latifah is here and she's a lot skinnier than in Chicago. But I like her better in Chicago. And I don't see something special in John's acting besides the fact that he acts as an obese woman."
    },
    {
      "rating": "8",
      "text": "I sat down to watch this film after owning the DVD for years, but never actually watching it. I have to say, I was pleasantly surprised. A feel-good film with great acting, a good story, and great musical numbers, Hairspray delivers on just about every level and exceeded my expectations."
    },
    {
      "rating": "0",
      "text": "The original is better."
    },
    {
      "rating": "0",
      "text": "My girlfriend wanted me to go see it, so i did for one reason, because John Travolta is in my favorite movie of all time (Pulp Fiction), but seeing him play an overweight woman made me leave the theater and my girlfriend before it was over, that really genuinely sucked."
    },
    {
      "rating": "1",
      "text": "A terrible, overlong, bland, stupid, unoriginal, overblown, hammed-up waste of space, for reasons that are too glaring and all-consuming to even begin discussing here."
    },
    {
      "rating": "3",
      "text": "If you have never seen a train wreck, watch this movie, it is an hour and a half boring music video with no let up, i felt like sceeming,, \"STOP THE MUSIC\""
    },
    {
      "rating": "3",
      "text": "Good performances from Nikki Blonsky and James Marsden, otherwise this is a cringeworthy excuse for entertainment. The songs and general over-exaggerated performances made me wanna throw up, and the plot was poor and implausible."
    },
    {
      "rating": "10",
      "text": "Wow! I haven't felt this good at a movie in quite a long time. It was emotionally peppy, the music was awesome, and John Travolta's role as Edna quickly moves from stunt casting (look, it's Danny Zuko in a fat suit and a dress) into a fully realized character that you actually believe is a shut-in longing to break free. Also, this Nikki Blosky is an amazing revelation, easy to fall in love with. I can't fault this movie for anything, it's been a long time that a musical has been this fun."
    },
    {
      "rating": "10",
      "text": "Great movie, i usually dont like this kind of movies, like musical and a lot of songs on it, but i think is very funny, and the chubby girl looks amazing in this film, is great... See it on the movie theater!!!!"
    },
    {
      "rating": "10",
      "text": "In a summer and year of so many three- and sequels, I find this film to be so upbeat and great. Yes, it's a \"remake\" of the John Waters film, which is great by the way, but the music and songs are brand new and specifically done for this movie. John Travolta was quoted saying, that the reason he did this musical (after having been in one of the most popular musicals of all time - Grease), that the director's enthusiasm was so enormous and contagious (not a direct quote, but you catch my drift). This enthusiasm is apparent in all the actors, and while I love Michelle Pfeiffer and John Travolta, I think the kids along with James Marsden are a great team here. Wow wow wow - I feel good after this movie!"
    },
    {
      "rating": "9",
      "text": "I went with my 2sisters 2 c it. Even though I,m a guy I did enjoy it, much better than dreamgirls. That girl was so energitic it nearlly rubbed of me, as I nearlly joined my sisters on the dancing back home"
    },
    {
      "rating": "10",
      "text": "A great movie, loved every minute. Great songs too."
    },
    {
      "rating": "7",
      "text": "I gotta admit I went into this movie expecting to hate it. I love the John Waters original with Divine and I was ready to rip apart another big Hollywood commercialization of a great cult movie with the big old gimmick of casting John Travolta as Edna. Well, I've gotta suck it up and admit it. Hairspray is one great entertaining movie. When I saw Mr. Waters in a cameo 5 minutes into the film, I figured he must have at least, given the makers his blessing. The thing is, the movie is infectious and grows on you as you watch it. You never really believe Travolta is a woman, but the character somehow grabs you in a great big bear hug and never stops squeezing. Travolta could be looking at a Supporting actor Oscar nomination. Nikki Blonsky makes an impressive debut though not as scene stealing as Jennifer Hudson in last years Dreamgirls. The supporting cast are all very good, especially Allison Janney who practically steals the movie in one knee dropping hysterical scene. The credits are all top notch with the music complimenting the socially aware story with cheery foot tapping lyrics and even a gospel style anthem sung by Queen Latifah that reminds you of the serious subject. The finale of Hairspray sums up the movie perfectly- \"You can't stop the beat\", and I admit it, you can't!"
    },
    {
      "rating": "10",
      "text": "I can barely breathe. huff huff. It was WONDERFUL!."
    },
    {
      "rating": "4",
      "text": "Did anyone else find this film a little racist? The squares are demonized in such a way as to suggest a more or less bankrupt culture, and then it's Funk to the rescue. There seems to be no end, in this film, to the pontificating, bible thumping verdict that all white people need to do is to adopt African American culture wholesale. The treatment of the white people in this film is no more sophisticated than the way white people treated African Americans in, let's say, the 50s. The pendulum has now swung quite a ways since then, yes? Should we not be concerned about the obvious racism in this so-called fluff film? Is it not disturbing that no one seems to care that we so easily swallow this mess of negative stereotypes? I'm disturbed when, in older films, I see African Americans being marginalized. I'm just as disturbed by this very commercial entertainment and by the lack of responsibility required from the filmmakers to treat each character as a human being. There's much to love in most cultures today. I just don't understand why we feel the need to sanctify one over the other. It's worrisome, to me."
    },
    {
      "rating": "0",
      "text": "This movie has to be the most stupid and pointless movie ever made. Teletubies is better than this. I walked out of the theater in the middle of the movie and demanded my money back. I recommend that no one should see this movie."
    },
    {
      "rating": "10",
      "text": "It was a brilliant, feel-good movie with an excellent musical soundtrack! If you were a fan of the original Hairspray you immediately clocked John Waters as the flasher."
    },
    {
      "rating": "8",
      "text": "Great music, never a dull moment, well done!"
    },
    {
      "rating": "10",
      "text": "John Travolta totally stoled this movie. I am a big fan of both the original and the stage musical and just felt he made Edna his own and when he sang and danced it simply rocked. This movie is one of most entertaining events I have seen in awhile!"
    },
    {
      "rating": "10",
      "text": "I loved this movie. Very amazing talent and awesome story/sequencing of events."
    },
    {
      "rating": "10",
      "text": "One of the best films I've seen in theaters in years. Pure fun from beginning to end. I've seen it thrice and will watch it thrice more this week."
    },
    {
      "rating": "10",
      "text": "This is the best movie I've seen this year so far. I'm officially predicting John Travolta will take home the Golden Globe and probably even get an Oscar nod for his amazing performance. His role was an easy one to over or underplay, but he got it just right. It's a shame uptight men insecure with their sexuality can't appreciate the fun and brilliance of Travolta's performance and of this movie. And as far as the allegation that this movie racist against whites, I'd say please stop sleeping in history class like Tracy!! This is actually the way it was in the early 60s. White people wouldn't let black people mingle with white people, sit at the same lunch counters or drink from the same drinking fountains or use the same bathrooms and in places like Baltimore, this kind of treatment didn't end until the civil rights movement in the middle 60s. That's what this movie was really about, the birth of the civil rights movement. I actually found the portrayal of the Amber and Velma characters very realistic and not at all racist, as that's exactly how some white people were in 1961, that's how they behaved that those were the beliefs they held, which is why the civil rights movement, Martin Luther King, Jr. the bus strike of Alabama, the march on Washington, happened. I knew quite a few Ambers in my high school days myself. I loved the score, the songs are catchy and fun and let's give props to James Marsden as Corny Collins!! He was great as Scott/Cyclops in the X-men films, but who knew he could sing and dance like that? I loved him!!!"
    }
  ]
}