{"id": 1154, "title": "Halloween 5: The Revenge of Michael Myers", "starring": ["Donald Pleasence", "Danielle Harris"], "runtime": 97, "genre": ["Horror", "Thriller"], "description": "Presumed dead after a shoot-out with the Haddonfield police, Michael Myers is secretly nursed back to health — and returns a year later to kill again and once more targets his young niece, Jamie. Jamie is now recovering in the local children's hospital after attacking her stepmother and losing her voice. Her mental link with her evil uncle may be the key to uprooting her family tree.", "releaseYear": "1989", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/rYvP6yMXCIVHnkVtwGaAXFmpzkB.jpg", "categories": {"plot": 4.478260869565218, "acting": 4.45, "ending": 5.333333333333333, "soundtrack": 4.333333333333333, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.5, "action": 3.6666666666666665}, "reviews": [{"rating": "10", "text": "In my opinion, this is the best movie of the Halloween franchise, it's my favorite. Danielle Harris' acting was perfect and honestly, she got me speechless. What a talented little girl! She nailed the part. Michael Myers in this movie is creepier then ever... a 10/10"}, {"rating": "8", "text": "A very underrated sequel,i understand why some hated it,but i loved it,very fun movie,a direct sequel to 4,if only it was given more time to complete the script,it would of been better,but it's still a good flick"}, {"rating": "7", "text": "Michael returns again in this rushed sequel that's still quite a bit of fun. Picking up a year after the events of its superior sequel. Jamie now lives in a foster home and is mute. Once again played by a solid Danielle Harris. After falling down the well in the last film he's saved by a homeless dude and awakens a year later to try and get Jamie once again. This entry is a little uneven tone wise. There are weird lapses in humor most because of two goofy cops. Michael is still in pretty strong form but his victims are mostly forgettable. Sadly Ellie Cornell is only in a small part and the new final girl Tina isn't as strong. It all leads up to a questionable finale and although nothing is on par with the rooftop sequence from the last film. The laundry schute scene is pretty terrifying."}, {"rating": "1", "text": "Where do i begin with this piece of trash movie? It's so boring , characters are awful aside from Loomis. I can't even consider it a horror movie. This is a just a massive failure to be a direct sequal to 4 which was pretty good."}, {"rating": "0", "text": "ok seriously, when did people started praising halloween 5 and 6? they are stupid"}, {"rating": "10", "text": ":*:*:*:*;*;*;*;*;*\"*\"*\"*\"*\"*\"*:*:*:*:*;*;*;*;*;*;*;*;*;*☆⊙°°••°⊙☆☆⊙°••°⊙☆☆⊙°••°⊙☆☆⊙°☆"}, {"rating": "6", "text": "Ok Halloween 5 The Revenge of Michael Myers There is a lot of bad and good to me Ok the bad well Tiana as character one of the worst in the franchise Now Jamie is not that good to me in this movie also Well in the very beginning we go back to Halloween 4 where a transforms happens but then we are back into this children health care where she is having visions what could make sense if they did right like in the first act she can't talk or scream weird that's what bothered me about that character I really do hate they killed one of the best characters in the Halloween franchise, Rachel, for some reason they had to kill her for some reason but when Tiana try's to find her she does not die mhm They thing I hate the most in this movie is the man in Black Just Very stupid and free's Michael at the end why ok the good Michael Myers is fine but the mask I can say it is but I did not mind it most part in this movie when he is far it looks alright nothing crazy tho But the kills in this movie are unique definitely the farm kills are cool one of my favorite kills also Dr. Lommis is good also he is just trying to defeat Michael But it is hard when he does not know where he is or doing Also Halloween 5 feels like Fall So all Round a frustrating follow up to Halloween 4 it is entertaining tho that's why I did enjoy it what it was trying to do but did too much So I give Halloween 5 The Revenge of Michael Myers An C-"}, {"rating": "5", "text": "Mr. Director, was it necessary to be too oversmart? You almost ruined a film with seemingly good potential. Why? You really wanted to give us this annoyance? ..Good : There are barely any good things I remember in this film. The story direction they decided to go after they kind of undid the final moments of the previous film was okay. What they tried to do with Dr. Loomis was fine. But all these good things were executed improperly. ..Bad : By bad, I mostly mean frustrating. I liked the character arc they tried to give to Dr. Loomis. But they crossed a line. He was obsessed with bringing down Myers - fine. He is more obsessed in this film - that's okay. But he wasn't an **** in the previous films. If it wasn't for the previous films, I would clearly understand the characterization given to him in this film was that of a selfish **** He is simply annoying, even though I know what he was trying to do. The obsession factor overshadowed the likeability of the character. And, there has been no character development for him to act that way. The main character from the previous film gets killed off and instead we get a very annoying character as our final girl. I am not against the final character of the previous film getting killed. I am against the way they do it. It feels too disrespectful to a character I loved in the previous film. Some choices of music is quite annoying as well. You get that goofball music when the stupid ass **** dumb cops arrive, as if we didn't know that they were stupid ass **** dumb cops. They (spoilers for part 4) undo the thing with Jamie taking on the mantle of Myers from the ending of the previous film for just some psychic **** which feels like dishonest treatment of the thrill the previous had. It just doesn't feel right. Alright. I can digest all of it. But the main thing that bugs me and a lot of other fans is that it was just a mess to set up another mess titled \"The Curse of Michael Myers\". The entire set up for \"cult of thorn\" **** is the only thing that makes a slight amount of sense, that too because, it was explained in the next film. But again, all the good it does is to make us feel that the cult **** isn't forced. ..Conclusion : I really wanted to like this movie. I really did. But it makes so odd choices for some characters and continuity that all the choices simply overshadow the actual intent of the director. It doesn't feel right. ..Rating. ..Score : 5.5/10Grade : C"}, {"rating": "7", "text": "Defining a new element to the franchise they tried, and the end it didn't turn out great. But i still enjoyed it anyway."}, {"rating": "3", "text": "John Carpenter's 1978 'Halloween' is wholly deserving of its status as a horror classic. To this day it's still one of the freakiest films personally seen and introduced the world to one of horror's most iconic villainous characters Michael Myers.Which is why it is such a shame that not only are all of the sequels nowhere near as good but that the decline in quality is so drastic. Ok, the original 'Halloween' is very difficult to follow on from, but most of the sequels could at least looked like effort was made into them. To me, and many others it seems, 'Halloween 5' is one of the worst of the series. Even with its attempt at a grittier tone, it is far from a thrill ride and there is very little scary about it, other than one scene and how poor quality the film is.Danielle Harris and Don Shanks give strong performances, as does Ellie Cornell in the limited screen time she has. Donald Pleasance does his best and succeeds in creating an unnerving presence, but his character is now too much of a caricature which is at the writers' door not his.There is one effective scene, that with the laundry chute which is actually pretty freaky. The setting has a haunting eeriness when it is not hindered by the low-budget-looking rushed-looking filming.Sadly, most of the time it is with the editing being especially amateurish. The direction is also sloppy, especially in the dramatically inept non-horror scenes. The music is here a drawback when it was one of the better elements of the three previous sequels. Here it sounds cheap, goofy and would have sounded out of date even in the 80s most likely.'Halloween 5' is also seriously lacking in atmosphere and the darkness and grittiness doesn't come through enough because too much of the film is dull and descends into overly-silly camp. Again, 'Halloween 5' feels more of the same, the chilling scares, nail-biting suspense and the feeling of being unsettled. There is nothing creative or shocking about the scares or deaths, it's all by-the-numbers, over-familiar and indifferent. Everything is just too predictable and dull in pace to be remotely suspenseful.Stupidity is also all over the film. So many moments are intelligence-insultingly ridiculous and almost illogical. The characters mostly are very bland and annoying, especially Tina. High quality of acting and dialogue is never to be expected in a 'Halloween' film, but both are especially bad here. The script is so last-minute sounding and not even half-baked and outside of the aforementioned the acting is terrible.In summary, one of the worst of the series. Scary and thrilling are the two last words to describe this revenge. 3/10 Bethany Cox"}, {"rating": "4", "text": "A) Don't get me started on the whole mental connection angle. B) That Michael mask is just come on man. C) The magic is almost completely gone with this one... the body count rises while the tension-building is down to trace levels. D) The ending leaves you with some unreasonably heavy questions... questions which Part 6 proceeds to answer in the most regrettable way.+2 points for that Jamie chase through the basement (muted piano track and all...) it was a flash of brilliance, up until the finish. As in, a highlight of the entire series."}, {"rating": "4", "text": "This Is Getting SillyHalloween 5 is just a big mess, And because of that, You can’t take it seriously."}, {"rating": "2", "text": "They took everything that was good about Halloween 4 and threw it out the window. From the ridiculous opening to that ridiculous ending, The entire plot was just utter garbage."}, {"rating": "3", "text": "Piss poor storytelling.Jamie and Loomis are fine, and there's a few good kills, but I could write a better version of this.Tina is annoying, and should've died in the beginning instead of Rachel. For a character that's supposed to be important, when Tina dies, there's still a half hour to go. What an unnecessary piece of sh*t.The Man in Black parts are really stupid. This reflects rushed production, as they just quickly made crap up and said \"that's a good decision.\"And Michael sucks in this film. And the ending is so empty! 3/10"}, {"rating": "4", "text": "Jamie's in a mental hospital, Michael is not dead (of course) so he kills her step-sister and her friends, mostly on a farm, then escapes from prison with the help of some guy we don't see."}, {"rating": "4", "text": "No thank you. Halloween 5 is Halloween 4's less original cousin. She likes to act like number 4, dress like her, walk and talk like her, but she is just empty inside. Plagued with the infamous rushed-studio schedule and weak script, Halloween 5 is a mess of a film. Shot and released within a year of part 4, we see Jamie Lloyd in a mental institution voiceless and unable to cope with the previous year’s events. Briefly mentioned is the ending of Halloween 4, and it is explained away as her trauma. Donald Pleasance returns as Dr. Loomis, and the cast is rounded out by a group of unlikeable teens. This is a typical 80s slasher that promises and delivers nothing except an unmasking of Michael Myers, which is really nothing to write home about."}, {"rating": "7", "text": "It improved a little from the 4th movie but its still not great. But the story is a bit odd but anyways its still scary. I am not sure if I recommend this movie but I can say its not that bad."}, {"rating": "0", "text": "..................................................................................................................................................scary as ****"}, {"rating": "4", "text": "Almost too funny to be considered a horror or a Halloween film. Besides Donald Pleasance, everyone appears to be phoning in this movie to cash a check."}, {"rating": "6", "text": "More Curse of Thorn and little Jamie, this time with an insanely stupid opening and all sorts of loose ends. That it still kinda works in spite of that is really quite amazing."}, {"rating": "0", "text": "I really shout this is one scary horror film. the atmosphere and style of the movie worked for me and the killer michael myers is very intimidating! 10/10"}, {"rating": "7", "text": "I think this movie is corny and milked to the max but the movie is good and scary. But the series is still ongoing....oh my god this series is seriously milked."}, {"rating": "7", "text": "Halloween 5: The Revenge of Michael Myers. The story continues. The continuation of the adventures of a masked man with a kitchen knife was surprisingly more interesting than the previous film. The atmosphere of the cinema is intriguing again, and the tension builds up again. Some of the most illogical moments still enrage, but fortunately there are fewer of them."}, {"rating": "2", "text": "The audience score here is exactly why I never listen to the audience ratings of movies. This movie just continues to bury and spit on the original’s simple concept and story. None of these characters matter. This is around the time that Halloween went from being the slasher everyone ripped off to the slasher no one watches. They got worse with their kills, the one thing that kept the later slashers interesting, while they continued to add convoluted and nonsensical plot points. It’s bad when movies by Rob Zombie can make your’s look worse by comparison but that’s what we have here. This movie, along with 6, represent rock bottom for this franchise. Thank god for Halloween 2018."}, {"rating": "6", "text": "Halloween 5 was enjoyable to watch but this movie had a lot of potential.The Plot was very simple and could have been more effective especially the ending which was senseless. The script was uneven. In acting, Pleasance nicely played the role of Loomis. Don Shanks is a terrific Micheal. Supportng cast is rubbish.Overall, it is an enjoyable part but with weak plot, weak screenplay and senseless climax."}], "recommendations": ["halloween_ii", "halloween_iii_season_of_the_witch", "hellbound_hellraiser_ii", "halloween_resurrection", "halloween_the_curse_of_michael_myers", "scream_2", "halloween_4_the_return_of_michael_myers", "i_still_know_what_you_did_last_summer", "leatherface", "the_amityville_horror", "jason_goes_to_hell_the_final_friday", "scream_3", "sinister_2", "jason_x", "the_possession_of_hannah_grace", "ghost_rider_spirit_of_vengeance", "halloween_kills", "a_nightmare_on_elm_street", "friday_the_13th_part_2", "the_curse_of_la_llorona", "halloween_h20_20_years_later", "friday_the_13th_a_new_beginning", "halloween_ends", "final_destination_2", "dead_silence"]}