{
  "id": 2117,
  "title": "Halloween H20: 20 Years Later",
  "starring": [
    "Jamie Lee Curtis",
    "Josh Hartnett"
  ],
  "runtime": 86,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Two decades after surviving a massacre on October 31, 1978, former baby sitter Laurie Strode finds herself hunted by persistent knife-wielder Michael Myers. Laurie now lives in Northern California under an assumed name, where she works as the headmistress of a private school. But it's not far enough to escape Myers, who soon discovers her whereabouts. As Halloween descends upon Laurie's peaceful community, a feeling of dread weighs upon her -- with good reason.",
  "releaseYear": "1998",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lqLXUm3oK59sGJKRH2Zjj2m3iMg.jpg",
  "categories": {
    "plot": 7.631578947368421,
    "acting": 6.285714285714286,
    "ending": 7.2,
    "soundtrack": 9.333333333333334,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "I seriously don’t get why a lot of Halloween fans love this movie. Michael Myers is not scary at all he’s more laughable. The score is terrible and doesn’t even feel like an Halloween movie. Actually did dig the change from haddonfield but it doesn’t do anything with it. The mask being changed 3 times and with one cgi scene just makes this movie more **** The only good thing about this movie is Jamie lee Curtis."
    },
    {
      "rating": "7",
      "text": "I'm not sure why it gets so much undue hate, especially compared to some of the others. It brings Laurie back, deals with her PTSD, retains the Shape's mystique by giving him little in the way of backstory or reason for returning now of all times. The mask isn't great and it's a bit of an awkward mix of a teenage post-Scream self-aware slasher, Halloween film and character study but it's fun and engaging without wearing out its welcome. The ending is fantastic as well. So much deserved catharsis."
    },
    {
      "rating": "10",
      "text": "I went to see this movie in the theatre expecting it to be pretty awful. After all, how many of you expect the 7th movie in a horror series to be any good? Anyway, I came away pleasantly surprised, and this is now probably my 2nd (or 3rd at worst) favorite in the entire series. Really a nice wrap up to the whole Laurie/Michael storyline, and this is where it ends in my mind. Don't be fooled by Resurrection and the fact that Jamie Lee is in it - that movie is a farce and Jamie Lee's appearance is nothing more than a shameful cameo.. H20 is suspenseful, well written, and well acted. Good job!!"
    },
    {
      "rating": "9",
      "text": "very nice sequel to the original"
    },
    {
      "rating": "7",
      "text": "This movie will always have a place in my heart as it is the first horror movie I ever saw. I saw it before the other Halloween films and so I thought it was the greatest thing I'd ever seen. Truthfully, it is not a bad horror movie. Hartnett and Williams are a lot of fun to watch and Jamie Lee Curtis never disappoints. The problem is that nothing beats the first Halloween and to even try is a fruitless endeavor"
    },
    {
      "rating": "7",
      "text": "This is easily the best modern film of the franchise. Bringing back Jamie Lee Curtis is a huge plus and with a solid supporting cast and story to help round things out, H20 ends up being one of the better Halloween films."
    },
    {
      "rating": "10",
      "text": "Amazing movie! A direct sequel to \"Halloween II.\" This (like other \"Halloween\" movies) doesn't get enough credit for bringing something new to cinema. I love it!"
    },
    {
      "rating": "7",
      "text": "Heaps & miles above any other Halloween installment trying to succeed the original. Though this film in many ways is unnecessary, it serves as a decent sequel to the original and perhaps even surpassing HII as the better sequel. H20 serves as the true Halloween 3, but only quickly highlights HII's events. This film references more to John Carpenter's Halloween and almost acts as a tribute to that film (and perhaps even Alfred Hitchcock's Psycho.) H20 probably doesn't deserve praise, but Jamie Lee Curtis is back as Laurie Strode to take on Michael Myers. It's a revenge movie, but no where near as good as Mother's Boys- both of which are personal guilty pleasures of mine."
    },
    {
      "rating": "8",
      "text": "A very good sequel that is a love letter to the original fans,the only thing that it was missing was a good soundtrack and the classic Michael Myers mask,a good story,good flick overall,but it could of been the best of the bunch"
    },
    {
      "rating": "9",
      "text": "Finally a halloween movie that is almost good as the original but this movie is still flawed don't get me wrong but the movie is very interesting and creative."
    },
    {
      "rating": "10",
      "text": "the epic finale to a series that has become stale and stupid. this is way better than the thorn trilogy.and yes, im aware of resurecction. that film is, idiotic"
    },
    {
      "rating": "10",
      "text": "Jamie Lee Curtis returns to reprise her role as the traumatized sister of Michael Myers, Laurie Strode. She delivers this character with much independence and courage. This movie has a fantastic storyline and a fantastic cast. A direct sequel to the first two \"Halloween\" films. Honestly if time would let it, this could be the true \"Halloween 3.\""
    },
    {
      "rating": "6",
      "text": "A 'Scream'-type sequel to the original Halloween, featuring the return of Jamie Lee Curtis. This film suffered from seemingly being slapped together as a cash-cow for Dimension Studios rather than a stand alone film."
    },
    {
      "rating": "6",
      "text": "Halloween H20 was a good part in halloween franchise but it had a lot of potential.This film is a direct sequel to both the original and Halloween II. It totally ignores Halloween 3, 4, 5, 6 (good for them).The story was simple and screenplay was also not upto the mark. Action and violence is was not so intense. The direction was good but simple. Among the actors, only Jamie Lee Curtis did better job.Overall, HALLOWEEN H20: 20 YEARS LATER does everything right, but with a lot of flaws."
    },
    {
      "rating": "8",
      "text": "Jamie Lee Curtis returns in what was probably the last enjoyable film in this series until David Gordon Green's 2018 sequel and what should have brought the series to a close. From the start, the film ignores Halloween 3-6 and acts as if they never existed and instead plays out as a sequel to Halloween 2. Its a very good sequel and probably the 3rd best of the series next to the original, you can tell the director tried here to undo the Cult of Thorn mess and bring Michael back to his more mythological ways where instead of being a unstoppable mass murderer who rips the heads from people's bodies. Plus I really enjoyed the score here and the atmospheric close-quarter shots, it reminded me a little bit of the original Alien as it brought a certain tension and chill to the film that hadn't been seen since the original. The only problem here is the film runs short at 90 minutes and could have benefited from being at least 10 or 15 minutes longer with more content."
    },
    {
      "rating": "9",
      "text": "It has a good story and its like the original. It is still really scary. This is just what I wanted and Michael's death in this movie (no spoilers who kills him) is really cool! I recommend it!"
    },
    {
      "rating": "3",
      "text": "The true sequel to Halloween II, it tries with great effort to utterly defecate on any quality that the preceding sequels hadn't already deprecated Curtis reprises her role, as does Nancy Stephen's. However the former obliterates any memorable qualities her character possessed, while the latter exasperates the trivial featuring of her character's existence. While failing to falter into the cesspit that the previous entries dug, it fails to deliver scares or quality that the first two films established (more-so the first.) Halloween VII is best viewed in trilogy format with the first-two, if you understand you're going from an \"A\" film to a \"C\" film to a \"D\" film. Please with all love ignore the final film in the franchise, unless you're open to experiencing rest to the franchise (literally)."
    },
    {
      "rating": "6",
      "text": "So-SoH20 is better than most of the previous sequels, But it’s still not as good as the first two."
    },
    {
      "rating": "6",
      "text": "Retcon where Laurie has a new name and teaches her son at a private school before Michael tracks her down and kills some of the kids, Laurie's new love interest, but not the security guard."
    },
    {
      "rating": "7",
      "text": "The first real showdown of Jamie Lee Curtis's Laurie Strode and Michael Myers happened 20 years after the original film and it's fun but not much more. Getting the brilliant Kevin Williamson of Scream to jump on board was a smart decision to capitalize on the smart slasher craze of the era but in truth it's only mildly successful. It does nothing to really correct any of the franchise's inconsistencies unlike the 2018 version. It is however a hell of a lot of fun. They take in joy in playing up the expected cliches as well adding to the meta execution with stuff like Janet Leigh a.k.a. Psycho a.k.a Curtis's real life mom complaining about the shower drains and driving her original car. After a series of decent kills we move on to a short but effective finale where the two behemoths go head to head. Something completely ruined at the start of the next film. Sexy Josh Harnett, future Oscar winner Michelle Williams and LL Cool J hamming it up also star. Michael himself is different and I'm not sure I love it. He seems mindless and a little goofy with a spiky hairdo and I do wish they used the iconic score more instead of reject Scream tracks. All in all it's a bit of mindless fun that closes out her story nicely."
    },
    {
      "rating": "7",
      "text": "For all its weaknesses, I give this movie major points if only for trying to undo some of the damage to the series from parts 5 and 6; the director is clearly trying to shed some of the franchise' bad habits by de-canonizing the ridiculous \"mark of Thorn\" timeline. The return of Laurie Strode is strictly good news, as we can finally expect a more fitting conclusion to her story than an off-screen car crash"
    },
    {
      "rating": "7",
      "text": "I saw many people say \"direct sequel to the original movie\" lol.. the other halloweens movies they enter to the history too, the begenning of this movie, they show us all the papers about the all murders from Myers incluyed Halloween 4, 5, and 6 and spin offs so this secuel dont have much sense like 20 years later and forgot her daughter and have another son? Is a good secuel but not the best, i think Halloween V , 6 and 2 was much better.. obviously i dont mentioned Halloween resurrection because is complete crap"
    },
    {
      "rating": "3",
      "text": "wow. can we get any gayer? YES! its called halloween resurrection! i cant even believe jamie lee curtis signed on to this abomination of a film. not only does michael myers' mask make him look like he has down syndrome, but nothing about this movie is scary. NOTHING."
    },
    {
      "rating": "3",
      "text": "It was ok. Still a little too generic for my taste and the acting was pretty horrible too. The kills werent all that good either. Takes far too long to get into as well. Just another generic addition to the series."
    },
    {
      "rating": "7",
      "text": "This review contains spoilers. This is the best Halloween movie since the original. The fight with Michael alone makes this worth watching. Too bad it wasn't really him. I feel like this would have been a good place for the series to end."
    },
    {
      "rating": "10",
      "text": "Ignoring Halloween 3-6, getting rid of Jamie and the Thorn cult, and bringing back Laurie Strode makes Halloween H20 a great film and a step up for the Halloween franchise. The ending was amazing, until Resurrection ruined it. I gotta admit, this is my favorite Halloween film."
    },
    {
      "rating": "10",
      "text": "..................................................................................................................................................scary as ****"
    },
    {
      "rating": "10",
      "text": "H20 was really actually scary it has alot of tense and volume to the music that actually scares  the hell out of you when myers jumps out or the friends jump out as an accident. same story , same plot ,same old dumb resurrecting thats what SUCKS ! about the franchise , just kill him hits simple , but thats annoys me about the film series. But this actually a good movie it takes back 20 years of Jamie Lee Curtis' Character \" Laurie Strode\" it's a good Steve Miner film i am not sure if the original   director of halloween John Carpenter had a different view of the story though. Grade A\r( i am a huge fan of Carpenter 's halloween series there is so much things that halloween can reveal about Myers  tell the unthinkable film of halloween)."
    },
    {
      "rating": "7",
      "text": "This is the best Halloween movie since the original. The fight with Michael alone makes this worth watching. Too bad it wasn't really him. I feel like this would have been a good place for the series to end."
    },
    {
      "rating": "7",
      "text": "I'm not a big fan of the Halloween franchise and this is not the movie that will make love the franchise.The acting was great but there is some serious plothole.The death scenes were not so good either but,the movie was good."
    },
    {
      "rating": "7",
      "text": "Halloween H20 This movie is Meh Laurie Strode returns and her character make since what's been going on with her life and her past so she worries about her son Michael Myers in the very beginning I like but after that, not so much mask change And Michael Myers Really does not do much accept follow Laurie Around This movie Has really boring characters that u don't care for the 3rd act Is good to me And the Ending was nice also not much in this movie So I give Halloween H20 Or Halloween 20 years later An C"
    },
    {
      "rating": "9",
      "text": "Really really surprised how good this was. The poster and the dumb-ass name put me off for years, was afraid it was gonna be Dawson's Creek meets Halloween, but it's totally not. The tone, the cinematography and the font, music, is all closer to the original two than probably any of the others preceeding it.All I want to know is how this story proceeds after Laurie cut Michael's **** head off. Pretty final, right?"
    },
    {
      "rating": "5",
      "text": "'Halloween H20', (such a stupid title) is a decent attempt of giving life to a tired franchise and bringing some closure, which later got ruined by 'Resurrection'However, this movie aged really poorly, in my opinion. A lot of cheesy and annoying fake scares that got repetitive really quick. How many times can people walk into each other or grab shoulders. Basically a 90's slasher movie.Still, Jamie Lee Curtis is fire."
    },
    {
      "rating": "6",
      "text": "I felt quite a strong return to form with this Halloween outing. This was the true final part of the trilogy. It really ramps up the excitement in the last twenty minutes. The story tries to be clever but who cares really. It was violent and there were plenty of scares so it filled the role really well. If you want to save some time then take this as the final part of the original trilogy and forgive the first slow hour."
    },
    {
      "rating": "9",
      "text": "Tied up with 1981's Halloween II, the second best in the series. Jamie Lee Curtis is back and it gets better. The whole film is very suspenseful and creepy from start to finish."
    },
    {
      "rating": "10",
      "text": "This is a great film. One of the best thrillers ever made. It's actually much better than the first, in my opinion. This film is quite thrilling, the music made it thrilling actually. The best thing about it is that it scares us rather than showing us gore and stuff like that. Oh yes, the gore is minimal, there's also no sex/nudity. Great film!"
    },
    {
      "rating": "6",
      "text": "Halloween H20: 20 Years Later. He took up the knife again. Soft restart turned out to be too soft in my opinion. The story itself is interesting, continuing what Halloween II (1981) ended with, but the implementation is very poor. Almost nothing happens throughout the entire movie. You can safely go about your business and return around the end of the film to understand who is who and what will begin now. If, for example, we compare it with the very first film, then there the tension grows very gradually, and I really liked it, but in this part, unfortunately, it’s not even close. The film only saves Jamie Lee Curtis, only because of her you can watch it."
    },
    {
      "rating": "8",
      "text": "Not sure why it gets so much hate??? I personally love this over most entries in the franchise."
    }
  ],
  "recommendations": [
    "halloween_4_the_return_of_michael_myers",
    "halloween_ii",
    "a_nightmare_on_elm_street",
    "halloween_the_curse_of_michael_myers",
    "halloween_resurrection",
    "halloween_iii_season_of_the_witch",
    "jason_goes_to_hell_the_final_friday",
    "halloween_5_the_revenge_of_michael_myers",
    "friday_the_13th",
    "curse_of_chucky",
    "jaws_2",
    "the_omen",
    "the_texas_chainsaw_massacre_the_beginning",
    "i_still_know_what_you_did_last_summer",
    "scream_3",
    "bride_of_chucky",
    "fright_night",
    "the_texas_chainsaw_massacre",
    "cult_of_chucky",
    "scream_4",
    "poltergeist",
    "hellbound_hellraiser_ii",
    "friday_the_13th_part_2",
    "the_amityville_horror",
    "jason_x"
  ]
}