{
  "id": 9,
  "title": "Halloween Kills",
  "starring": [
    "Jamie Lee Curtis",
    "Judy Greer"
  ],
  "runtime": 105,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "The nightmare isn't over as unstoppable killer Michael Myers escapes from Laurie Strode's trap to continue his ritual bloodbath. Injured and taken to the hospital, Laurie fights through the pain as she inspires residents of Haddonfield, to rise up against Myers. Taking matters into their own hands, the Strode women and other survivors form a vigilante mob to hunt down Michael and end his reign of terror once and for all.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ir9eyz1mtgsohjvo7UYtqUfFuES.jpg",
  "categories": {
    "plot": 2.9782608695652173,
    "acting": 2.2941176470588234,
    "ending": 4.214285714285714,
    "soundtrack": 0.0,
    "cinematography": 3.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.375
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Reminds me of an infomercial where everyone is overly bad at doing things. Mike Myres is killing people all movie but you don't ever feel like he's good at it, you just feel like everyone so stupid. I'd feel the same as Mike if I lived around people that stupid."
    },
    {
      "rating": "3",
      "text": "Starts off like a retro slasher film, a bit cheesy, a bit predictable but you let that slip because you think they might do something better than the 2018 film… No, it just spirals into exactly the same film as before, just worse because this time they rely on a dozen characters pulling the story along. There’s no plan, just people running around either being killed or trying not to be killed. None of the cast do a convincing job, and some are basically exactly the same as before. The only thing that makes you keep watching, is how creative Mike Myers gets at killing people. I really don’t know how this film was allowed to be made.Come on. Kill this franchise off already."
    },
    {
      "rating": "0",
      "text": "worst movie I've seen in a decade or two. just plain awful. starts with a 14 year old getting lost on the street he lives on. gets way worse from there"
    },
    {
      "rating": "1",
      "text": "\"Evil dies tonight”, unless of course they decide to squeeze another movie from this dying franchise, then evil won’t really die tonight, but maybe next time, or the time after that. You’d think after over 11 movies and particularly the way the 2018 adaptation of Halloween ended that the whole franchise would have finally finished by now. Well here we are with another forgettable horror that you’re far better off skipping altogether. Halloween Kills is yet another reminder that the Halloween franchise needs to stop.The seemingly never ending saga of Michael Myers and Laurie Strode (Jamie Lee Curtis) continues in a downhill fashion adding yet another movie to a series that peaked in 1978 and never should have had any sequels. Despite the events that took place in the previous movie, Michael Myers has achieved superhuman status and emerges from the flames like a demonic phoenix, ready to brutally slash everyone and anyone to pieces again. But in a town that have been haunted by Myers for years the townsfolk have finally said enough to the notorious boogie man as they now take matters into their own hands, much to the dismay of the local police department who are failing to reassure everyone that they can handle this. But this ain’t no normal serial killer apparently. Bullets, knives and fire cannot stop the inhuman mask wearing psychopath from returning to his home on Halloween.For those of you here for the gore, you won’t be disappointed, it doesn’t hold back. There’s a whole bunch of disposable characters practically queuing up to be violently hacked to pieces. For those of you here for Jamie Lee Curtis I hate to disappoint you but she is criminally underused. The trailer paints a different picture of the movie’s focus, I was expecting it to be Laurie and her daughter (Judy Greer). They are both underused, with the film shifting much of it’s time to new characters with vague connections to the first Halloween movie. Halloween Kills really cannot help itself when it comes to reminiscing the original Halloween but all that accomplishes is you’re constantly being reminded as to what a good horror looks like and not this absolute rubbish that is not worth your time or money.Halloween Kills is desperately clinging on to a classic horror with the result being a franchise that like the terrifying Michael Myers refuses to die. I love horror movies but Halloween Kills has nothing going for it, it’s not scary and at times it’s actually boring. Honestly it makes Halloween 2018 look like an absolute masterpiece. Not recommended for anyone. I know it’s the Halloween season and the perfect time to watch a good horror movie but believe me when I say Halloween Kills isn’t it, do yourself a favour and stick to the original 1978 version instead."
    },
    {
      "rating": "3",
      "text": "This movie has great camera work, terrible acting storyline and perceived realism. \"Michael is in the back seat, go look.\". Actors just standing there staring at Michael doing nothing to defend themselves. Just looking at him when an easy escape is near they meet their demise with their stupidity. Just 30min into the movie with the cop not knowing how to aim had a clear shot at killing Michael. The firefighters  could have at least swung at Michael with their axes. Instead they stood their doing nothing but looking at him spray him with a hose"
    },
    {
      "rating": "1",
      "text": "This is one of the worst movies I’ve ever seen. The plot is all over the place, acting is mediocre, and the cliche horror tropes are exhausting. I love the Halloween movies and this recent iteration is an absolute disgrace to the franchise."
    },
    {
      "rating": "2",
      "text": "In Halloween Kills, Michael Myers have been blessed with the very most amount of plot armor possible. First he's outnumbered by a hoard of firefighters, but slaughters them one by one, each one waiting for their turn to die. Then he's outnumbered by a hoard of 20+ cocky townsfolk who beat, stab and shoot him to the ground, just to get up and kill them all in the same manner, because suddenly they're all weak scared dummies just taking it. Several times during the movie there's clear opportunities to kill him for sure, but each time they do something moronic instead; a light kick to the head instead of pitchfork in the head, a knife in the shoulder instead of knife in the head, and so on. Plot armor, because he can't die since there's a third movie. This amount of plot armor is just a sign of terrible writing. The acting is terrible, the dialogue is terrible and the entire movie is pointless and doesn't move the \"story\" forward."
    },
    {
      "rating": "3",
      "text": "So far, this is the most disappointing movie release this year. It's like someone said...let's take Halloween but make it more like Michael Meyers is John Wick. The gore and effects are good and there's a ridiculously high kill count. But the rest of the movie is an exercise in frustration watching people make the absolute stupidest decisions and just barely put up a fight. People literally just stand there in one place for extended amounts of time and just wait to be killed. Crowds of like a dozen people all just stand there and wait their turn to die. People decide to split up into smaller and smaller groups. I can't. Then basically everyone dies...both \"legacy\" characters that all just get introduced out of nowhere only to be immediately killed and established characters from the last movie. There's a big dramatic scene where it's some commentary on \"who's the real monster\" when mob mentality is the centerpiece of this movie. *spoiler* they cause the death of a different escapee when everyone knows damn well Michael Meyers does not look like the Penguin. This movie just made me mad. The first movie had so much going for it and they messed it up hardcore and completely shifted the tone and direction. Also just like the first Halloween 2...Laurie Strode is in a hospital bed and out of commission basically the entire move, relegated to a barely there background character."
    },
    {
      "rating": "1",
      "text": "Sorry but it was not entertaining at all. Just make you furious of how mentally deranged the people in the movie are. Nobody seemed to put up a fight against him they all just accepted their death. The top cast had little screen time and it felt like the movie was all over the place. Good gore effects but I'd rather watch paint dry"
    },
    {
      "rating": "3",
      "text": "Halloween is such a weird franchise with its constant reboots and different timelines, weird 3rd anthology movie and Busta Rhymes. Halloween (2018) was a surprisingly decent sequel/reboot and I was definitely interested in a sequel. So does this sequel live up to the 2018 version or is this another failed sequel?Firstly, it does live up to the title as Michael Myers kills A LOT of people. The kills are also quite enjoyable to watch and it is a blast to see him take down multiple individuals. Actually, Every scene featuring Michael Myers is a highlight including him stalking his prey is fun to watch. There is also a flashbacks sequence that occurs in this film that involves using a filter to make it seem like the original 1978 movie. They also used makeup instead of CGI to bring back Dr Loomis and it looks phenomenal. The scene also fixes a plot hole from the 2018 version so that was appreciated. Surprisingly, Halloween Kills explores some social commentary about mob mentality. It shows how the fear of Michael can turn people evil as well. However, the social commentary is dampened by how stupid every character is in this movie. So many characters in this movie make the stupidest decisions ever made. So many characters for some reason love splitting up instead of sticking together. The movie also shows that it is clear people can buy guns yet we will see a bunch of people try to fight Myers with baseball bats and hockey sticks. There is also one scene where a couple hears that someone is in their house but for some reason don't go outside and call the cops. One massive annoyance in this movie is that people for some reason, don't just gang up on Myers and instead come at him one at a time like complete morons. Furthermore, these people don't seem to ever try GOING FOR THE HEAD. It also baffles me that none of the characters realises where Myers is planning to go when it was extremely obvious.The story is also a complete let-down. In Halloween Kills there are two parallel plot lines, one with Myers and one with the mobs. While the mob social commentary is interesting, the plotline doesn't have any bearing on Myer's plot. It instead feels like it is taking a lot of screen time from what the audience wants. Additionally, Halloween Kills seems to change how Myer's operates compared to the previous canon films. In Halloween (2018) there was a motive that Myers is returning to finish Laurie but Halloween Kills decides to just toss that motive straight out of the window. Michael Myers also felt like a psychotic killer in the previous canon films but in Halloween Kills he must have supernatural powers because he is surviving way too many unbelievable injuries with ease and magically teleporting. He also seems to know martial arts now or something because he is doing some \"IP Man\" style kills when fighting multiple individuals. One of the big disappointments is how they handled the iconic Halloween character, Laurie Strode. Throughout the film, Laurie is just in a hospital talking and monologuing. Her scenes are so irrelevant that you could remove her character and the story will still be the same. So if Laurie is not the protagonist then who is? Well, the movie splits the screen time between Laurie's daughter Karen (Judy Greer), granddaughter Allyson (Andi Matichak), Tommy Doyle (Anthony Michael Hall) the child who survived in 1978, a straight couple and a gay couple. The problem is that there is not really a clear protagonist and they just split the screen time between a bunch of less interesting characters. None of them has enough screen time to develop their characters and none of them is even that likeable either.Overall, Halloween Kills is unfortunately a very bad sequel. It does provide the fun slashing kills that a fair amount of fans would want and enjoy. However, it is difficult to fully enjoy this film when there is a high amount of stupidity in it. This franchise was rebooted to remove itself from the ridiculous supernatural nature but seems to be making the same mistakes. Halloween Kills was a middle instalment that doesn't build up to anything for the final instalment. The inevitable conflict between Michael Myers and Laurie for Halloween Ends just feels less meaningful now. Hopefully, Halloween Ends somehow does better."
    },
    {
      "rating": "2",
      "text": "This movie is DOG **** I can't even begin to explain how cheesy and stupid this is. It doesn't even feel like a Halloween movie. People do the dumbest things, and it's Mike isn't a good killer it's just that everyone is that painfully stupid. The death scenes felt out of a D list movie. The special effects were so bad you'd swear this was a 90's movie. This is one of the worst movies. It was too long and the entire subplot about mental patients was idiotic."
    },
    {
      "rating": "1",
      "text": "Easily one of the worst movies I have ever seen, which is disappointing as I read the previous installment was terrific. Don't waste your time or your money."
    },
    {
      "rating": "0",
      "text": "Woke AF. It ticks all boxes...I confess I did not finished the movie.I cannot understand why they need to push their agenda in everything.If you want to watch this for entertainment only, be ready to be dissapointed, a lot of woke crap is coming your way."
    },
    {
      "rating": "0",
      "text": "Wow! i can genuinely say this is one of the worst movies i have ever seen! The plot is so bad that i wouldn't be surprised if it turned out that they'd just asked a class of six year olds to write it. The (over) acting is terrible, and Jamie Lee Curtis is hardly even in it. Then there's the really obviously ludicrous parts, like when a whole town of people mistake a little old man who stands about 5'4\" for the huge towering broad shouldered Michael Myers...apparently not only is he completely invincible in the most ludicrous way, he can also shrink several feet...at least as far as the morons in this town believe. As for the ending scene..the less said the better. This could have been a good opportunity to finally kill this awful franchise off at last. Instead you can look forward to yet another crappy movie to come.Though  This time you will know for sure that he is Supermyers and cannot be killed..which will make for an even more tedious and pointless film."
    },
    {
      "rating": "0",
      "text": "Not worth watching please watch anything else . This movie literally is just dragging . It feels like the fast and furious franchise"
    },
    {
      "rating": "10",
      "text": "Terrifyingly goodIntense from start to endBest horror of the year.Great story line."
    },
    {
      "rating": "1",
      "text": "You could really feel the drag in this movie. Literally nothing happens because half of the movie is flashbacks. These flashbacks happen from so many people's perspectives and it's recapping in the middle of the movie as if we already forgot who they are and why they are relevant to Myers. But that's just it, they aren't relevant. As far as logic goes, I get that there is a serial killer on the loose, but that doesn't mean that most of the town should be losing their god damn minds. There is like a marathon of people running through the hospital.I gave it one point for the way Myers creatively kills the victims even though the logic is still out the window. You got a guy in a mask with huge blindspots, walks 3mph, and only kills up close. Meanwhile, you have tons of people with guns that like to shoot at pointblank range."
    },
    {
      "rating": "8",
      "text": "I liked it a lot. It was a fitting sequel to Halloween (2018). Critics are complaining about the script- come on **** no one was expecting or wanting it to be The Seventh Seal or Citizen Kane… it’s a fun slasher movie!"
    },
    {
      "rating": "1",
      "text": "By Far the worst Halloween movie over the top kills trying and hide a poor story.At one stage the town are chasing a mentle patient around a hospital like it was a scene from Benny Hill with or with out a mask never could be confused with Michael Myers hysteria or not. I think its the only time i have watched a movie and wanted the whole town to die."
    },
    {
      "rating": "1",
      "text": "This movie was god awful.  My God where to begin the movie from the start was so cringe literally all the way up until the final 2minutes.  They didn't use Michael properly at all, it felt more like a Jason movie then Halloween.  The only very good thing this movie did was Michael Myers himself and his mask.  The town trying to rally was so cringe  it was disgusting.  I do not recommend this movie what so ever.  I wouldn't even watch it on peacock if I where you.  Majority of the movie was focused on Tommy trying to rally up the town.  Evil dies tonight will ge a new meme.  God this was cringe horrible trash.  Don't waste your time."
    },
    {
      "rating": "9",
      "text": "Filme maravilhoso Michael Myers mais violento do que nunca!Entendo um pouco os diálogos não serem tão profundos por ser o meio da nova saga, guardando assim o espetáculo para o final!"
    },
    {
      "rating": "0",
      "text": "I don’t have enough words to explain the full depth of how bad this movie isOkay to start off short it’s a dog **** movie. (Even by halloween standards) Freddy vs. Jason on a skipping dvd would make more sense then this movie. You will leave actually upset you spent money on This train wreck.  Watching paint dry is a better experience. It felt like someone skimmed every other sentence about the franchise and has never watched a Halloween movie. Michael has always toed the line of being “immortal” and makes you question it.which is what makes them interesting movies .  Whoever made this read “Michael is indestructible”. He starts off by killing firemen with axes 10 on 1 and kills them all unscathed. Which okay BUT THEN GETS KILLED BY A RAGTAG LYNCH MOB AT THE END. AFTER BEING STABBED REPEATEDLY AND HIS NECK BROKE BY TWO SMALL WOMEN. Then he gets up because he’s “a spooky embodiment of evil” and kills the entire group that kicked his ass the first time. There is no consistency.Literally it feels like a bad AI wrote the script of a Michel Meyers movie. Made no sense loses it’s own plot 3-4 times in the movie and then tried to make a twist where their is no set up. It leaves you frustrated you payed to see it."
    },
    {
      "rating": "0",
      "text": "This movie was God-awful. It was all over the place. It wasn't scary - it had some gore, but mostly it was a bore. Other than an exercise in over-the-top diversity casting - there's nothing here that stands out.  Save your money or rent the original."
    },
    {
      "rating": "2",
      "text": "I’m sorry but this movie it was pretty awful. No story progression, no plot progression, just a bunch of senselessness and extremely dumb people. I wish they would’ve sacrificed this movie and just made it two movies, but this feels like a filler episode of a CW show where it’s pointless."
    },
    {
      "rating": "0",
      "text": "The film is pure garbage. Acting without emotions (I watched student movies where actors who played for free worked harder and expressed emotional states), shot at speed from one shot ... a pure waste of time. Those who can give this movie a higher rating than 1 are ordinary bots and nothing else!"
    },
    {
      "rating": "1",
      "text": "David Gordon Green should absolutely stick to comedy. This dude straight up SUCKS at horror films. His work is a toxic addition to a storied franchise. They could hire literally anyone and get a better product than Green offers. Literally anyone. Tommy Wiseau would be weirder. Ed Wood would be campier. Uwe Boll would be more offensive. Anyone would provide a more entertaining product than DGG. Dear god, fire this guy and don’t let him even TOUCH another horror franchise."
    },
    {
      "rating": "9",
      "text": "An intense, thrilling gore fest that respects the ominous, omniscient nature of Michael Meyers. Great score. Decent story for a slasher. Is it perfect? Of course not but its a solid watch."
    },
    {
      "rating": "10",
      "text": "Amazing movie! Collective trauma. Mob mentality. Healing old wounds. And brutal kills. It did what needed to be done."
    },
    {
      "rating": "3",
      "text": "When I walked into the theater to see this movie I was extremely excited with the completion of my Halloween marathon to see the next chapter in this franchise and I was disappointed. the first half of this film is amazing with great suspense and it felt like a lot of care and effort was put into it but the second half was terrible Laurie gets out of her hospital room once in the entire movie. The second half felt rushed and unfished and that's the problem with movies coming out in 2021 they had a lot of time to produce a good chunk of the movie and then covid struck and they had to rush the second half to get it in theaters by October this year to make money. they really milk the plot of the protesters lead by Tommy Doyle and a big chunk of the film is taken place in the hospital and Michael doesn't even step a foot in the hospital in the entire runtime of the movie this movie was made for money to piggyback off the success of Halloween 2018 the movie just gets worse and fells more uncared for as the movie went on. watch it if your a fan of Halloween but otherwise stay away from this film like it is Michael Myers"
    },
    {
      "rating": "0",
      "text": "I’m a life long Halloween fan. Ofcourse nothing to me can touch the original. This new film Halloween kills set a new low for the franchise. It’s so bad that it’s worse than the notoriously worst Halloween films that are resurrection, Halloween 5 & the rob zombie remakes. I can’t describe how a whole load of nothingness the film is. The plot non existent. Jamie the lead character has like 10 minutes screen time which was completely cringe. It’s like she turned up for the quick easy money pay day as the reality kicks in that she won’t land a role as big as this any more. The way the movie was shot baffled me, even Halloween resurrection was filmed better. The kills were so frustrating and they didn’t even show them, they shown the final sequence of the film in a slow motion killing spree that left viewers and long term fans wondering what on earth they just watched. The lead characters and the return of a few characters from the original Halloween film seemed forced and quick. They also looked aging and tired, uninspired and lacking that touch that makes an actor today. Some scenes were completely pointless and lead nowhere. Such as the chasing of Lindsey or the chase of the mental patient. The lines were cringe worthy. ‘Evil dies tonight’. The vibe was dead. The film had no soul. The potential the film had was wasted. This would’ve even been a bad television movie if it hadn’t been released at cinemas. Michael Myers didn’t even seem like Michael Myers. No thrill of his appearance whatsoever. It was like it was a copy cat from the retirement home. The music was once again dependant on the music of old.It’s extremely sad to me that this film had to be shot like this and released. They killed the franchise with this film more than every film after the original together. Don’t support blumhouse. They massacred this film in the wrong way."
    },
    {
      "rating": "4",
      "text": "Remember Lonnie? The kid that Dr. Loomis scared from behind the bushes in John Carpenter's Halloween? How about Tommy and Lindsey, the kids Laurie Strode babysat while being stalked by the \"shape\"? Well I hope you care about those characters a lot because they have more screen time than Jamie Lee Curtis' s Laurie Strode, along with once Sheriff Brackett and a bunch of secondary characters around town. While Laurie is recuperating from her injuries in the hospital, the townsfolk become an unruly mob on the hunt for Michael Myers. And the many victims of Michael are these secondary characters who are introduced just to be killed off moments later. Sure, Halloween Kills is the middle of a trilogy, but considering what happens it could have been wrapped up with a single sequel instead of being spread out over three movies. And I hope you like the phrase \"evil dies tonight\". You'll hear it about 47 times."
    },
    {
      "rating": "5",
      "text": "Halloween Kills has committed the terrible sin of all the other sequels in this franchise, and what seemed like an incredibly notorious return, fades into a film that at its worst, never gives reasons to justify its existence.I really believe it was a massive mistake to pick up the narrative right where the 2018 movie ended, because it took out Laurie Strode off the game.This in its eagerness to give prominence to the people of Haddonfield, who until now had always been stupid victims in Michael Myers' path.In this one, they still continue being stupid victims, they just put up a little more resistance.There are a lot worse things about the Halloween franchise, and that by no means exempts all the glaring flaws in this film, but frankly I didn't find it that horrible either.I've seen things in the genre that are way worse, and Halloween Kills is merely inconsistent and flawed, which is a shame considering all the expectations it created.I read negative reviews because of the violence that unfolds on screen, but if you're watching a film about an unstoppable murderer, I think it is ridiculous to complain about it.It's not that it's justified, its own concept revolves around violence.Taking into account these results I no longer have any illusions about Halloween Ends, but considering that I just read that that film will have a 4-year time jump, it's fair to intuit that at least it will not be as abrupt and empty as this disappointing sequel."
    },
    {
      "rating": "2",
      "text": "The only good parts of the film are the kill scenes. Most of the acting is subpar except for Curtis, who is in a bed unconscious for most of the film. Skip it and just watch the original."
    },
    {
      "rating": "1",
      "text": "Another pathetic attempt to make a Halloween mean something and falling FLAT! There is nothing believable about 1 single piece of dialogue in this entire movie. Laurie's long monologues contradict everything she says and does later. Every character is wasted. Myers is good but the kills are boring because the characters he kills are basically cartoon characters! The \"Mob\" isn't believable especially after confusing Danny Devito's stunt double for 7' Myers!? Then the finale is killing a main character that no one cares about anyway, so Myers can finally stand and look out a window? Now I see why this movie was laughed out of Venice Film Festival (it didn't belong there anyway) and the massive PR campaign from JLC to talk about how deep this movie is, surprise it's not deep it's just a pretentious crappy sequel to a money grab reboot."
    },
    {
      "rating": "6",
      "text": "it was good until the last 20 mins. Michael is a phony. Not a fan of the ending at all seems really fake"
    },
    {
      "rating": "10",
      "text": ""
    },
    {
      "rating": "10",
      "text": "GOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOOD GOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOOD GOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOOD GOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOOD good"
    },
    {
      "rating": "1",
      "text": "One of the worst Helloween movies I've ever seen. The story is almost non-existent compared to the previous films and is completely forgotten by the need to portray as many murders as possible in the most brutal ways. You really have to be a psychopath to make this movie."
    },
    {
      "rating": "2",
      "text": "Zero plotline. Forced politics which don't even have any ultimate impact on it's \"characters\" which were written like a Shakespearean High School play. Terrible dialogue, and a nonsensical ending."
    },
    {
      "rating": "9",
      "text": "THIS MOVIE KILLS!Halloween Kills is a worthy sequel to 2018's Halloween. If you are going in expecting a fun and kinda chessey slasher film then this is the movie for you. This movie has kills left, right, up and down, and they are brutal. The acting if fine and the characters are ok, but some are not as developed as others. And there are some people in this movie that are straight up dumb, and that's ok every now and then but it does get annoying after a while. There are two issues I have with this movie. 1. Lorie Strode takes a back seat in this movie and was pretty disappointing. 2. Is there is this sub plot involving an escapee that should not have been in the movie it was very dumb. Other than those two issues everything else was great. The kills, like I said are the series best and there are a lot. And another big win is this movie's score it is thrilling and intense in all the right moments. Near the end of the movie is when everything went nuts and it was a blast. The town comes face to face with Michael and it is epic. Last but not least is the cliffhanger ending that may or may not disappoint some viewers. I liked it though. Overall 85/100"
    },
    {
      "rating": "9",
      "text": "I don't understand critics, but then again I just saw a list where one of them had Halloween II 2009 as the 7th best Halloween and Halloween III as the 2nd best.. so that tells you how much you need to take their opinions into account if they have a film that has NO Michael Myers in it at #2.. but what is #2? Halloween Kills! What more can you ask for?! This is Michael at his most brutal, he wants his house back and he'll kill anyone who stands in his way. Halloween Ends comes next year so im sure you can guess somewhat what happens but I promise you, you ain't seen Michael Myers until you've seen Halloween Kills."
    },
    {
      "rating": "7",
      "text": "Halloween Kills is not as good as its 2018 predecessor, but it is still a well done, and interesting, horror film that is worth seeing, but has some flaws. It should be stated that the ending of this film is pretty disappointing, and that is being kind. To some, the ending of Halloween Kills may ruin the whole experience of seeing the movie entirely, which is a real shame because there are some really cool things in Halloween Kills that are more worth remembering than the ending."
    },
    {
      "rating": "9",
      "text": "Critics have a history of not enjoying horror movies much like they dont like action movies. Fact is if I listened to critics then half of the movies that I like that they dont I wouldnt have seen. Halloween Kills is like the Empire Strikes Back in the trilogy in terms of the heroins Laurie and her daughter and granddaughter thinking they got rid of michael myers only for the killer to survive and go on a rampage of revenge. The mob mentality wanting to put a stop to the menacing force that thrives on brutality and murder. I enjoyed it and looking forward to Halloween Ends next year."
    },
    {
      "rating": "3",
      "text": "Barely used Jamie Lee Curtis…A lot of the deaths were overkill too. Very disappointing and didn’t live up to the media hype."
    },
    {
      "rating": "0",
      "text": "The movie feels very cheaply made, the actors (even the well known ones) act like they only gotten a few bucks for their work and the plot is like a 10 year old wrote it.It is however very brutal and graphic. Sometimes massively over the top, very unlike Michael Myers. But it literally makes no sense. I thought cheap movies from the 70s were bad, but this is a disgrace for pretty much anything and anyone involved.It still boggles my mind how I sat through it. Maybe Im becoming desperate after so many bad movies in the last few years."
    },
    {
      "rating": "7",
      "text": "Halloween Kiils adds to a very successful franchise giving the audience more blood, gore and kills. Gives it a great spin and worth the ride."
    },
    {
      "rating": "7",
      "text": "HALLOWEEN KILLS is most certainly visceral and certainly brings the kills galore, but hides away it's one shiny spot - Laurie, the true final girl. It's bounds and leaps from the almost perfect film that came before it, and without a single focus to hold on, it's 3rd act stands on wobbly legs. At times the denizens who hunt Michael Myers through the streets of Haddonfield come off as stupid instead of brave and angry, and some of the dialogue sounds hokey, almost ridiculous. It's bloody and nihilistic and tragic, and really, not much else. Regardless of all this, HALLOWEEN KILLS stands as a solid part 2 in David Gordon Green's trilogy, that maybe lacks in some places but **** brings it in others. Excited to see how it all \"ends\"."
    },
    {
      "rating": "7",
      "text": "Mais violento, mais gore e mais sanguinario que o primeiro filme, esse é um bom filme, apesar da principal protagonista dos filmes do halloween ser deixada de lado"
    },
    {
      "rating": "8",
      "text": "Definitely the most violent entry in the Halloween films. You could definitely tell this movie was a mid point in the story and setting up the big finale in Halloween Ends. It’s definitely entertaining and a film that would be an easy rewatch."
    },
    {
      "rating": "7",
      "text": "A gory slasher from start to finish. I liked the flashbacks from 1978 and then back to 2018. Some kills felt a bit lame and hidden but others were Rated R perfection. Felt a bit of satisfaction that my prediction for which main character would die came true, even though it came in a bit of a lame way. All in all, not bad, good horror movie."
    }
  ],
  "recommendations": [
    "friday_the_13th_part_2",
    "halloween_ends",
    "halloween_resurrection",
    "friday_the_13th_part_iii",
    "friday_the_13th_the_final_chapter",
    "texas_chainsaw_3d",
    "friday_the_13th_a_new_beginning",
    "jason_goes_to_hell_the_final_friday",
    "saw_3d",
    "jaws_the_revenge",
    "stay_alive",
    "halloween_ii",
    "the_strangers",
    "paranormal_activity_the_marked_ones",
    "paranormal_activity_4",
    "halloween_5_the_revenge_of_michael_myers",
    "28_weeks_later",
    "saw_iii",
    "transformers_age_of_extinction",
    "the_texas_chainsaw_massacre_the_beginning",
    "the_devil_inside",
    "final_destination_2",
    "the_final_destination",
    "doomsday",
    "machete_kills"
  ]
}