{
  "id": 1805,
  "title": "Halloween II",
  "starring": [
    "Jamie Lee Curtis",
    "Donald Pleasence"
  ],
  "runtime": 92,
  "genre": [
    "Horror"
  ],
  "description": "After failing to kill stubborn survivor Laurie and taking a bullet or six from former psychiatrist Dr. Sam Loomis, Michael Myers has followed Laurie to the Haddonfield Memorial Hospital, where she's been admitted for Myers' attempt on her life. The institution proves to be particularly suited to serial killers, however, as Myers cuts, stabs and slashes his way through hospital staff to reach his favorite victim.",
  "releaseYear": "1981",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gL3dPbbZInWn4U9jd87uoFGOdot.jpg",
  "categories": {
    "plot": 6.225806451612903,
    "acting": 6.0,
    "ending": 6.625,
    "soundtrack": 7.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This one was not as good as the first one but it was still entertaining. The suspense was still thrilling and scary. The writing and story was not that great unlike the first one. Jamie Lee Curtis's performance was stupendous just like in the first one. I also loved the musical score and soundtrack they were amazing just like in the first one."
    },
    {
      "rating": "10",
      "text": "ok for one people need to start commenting on the right movie, this is the original halloween 2, the sequel to john carpenter's not that crappy rob zombie bulls**t, second of all this movie is good, alot more killing, alot more story and alot more of everything, this movie is a must have and will be one of the best horror movies of all time"
    },
    {
      "rating": "8",
      "text": "Not bad sequel at all. In this film was more kills and of course explosions."
    },
    {
      "rating": "7",
      "text": "Holds up fairly well. I'm surprised at how silent this film is. Long stretches of it are borderline boring, with little music and so much \"suspense\" that it dissipates into nothing, in a lull of disappointment, before screaming back again. This movie looks and sounds great, the ending isn't superb but it works. Mr. Sandman is a near brilliant song choice. I love Loomis. \"I shot him 6 times!\""
    },
    {
      "rating": "7",
      "text": "Halloween takes place literally seconds after the first installment ends, and though all seems good for Laurie Strode, the villainous Michael Myers is not dead. This sequel is a splatter version of the original, with less scares but with more impressive effects."
    },
    {
      "rating": "7",
      "text": "Not as good as the original but still a scary movie but with corny acting and soon the series will be milked even more and more. The first 2 movies are the good ones."
    },
    {
      "rating": "7",
      "text": "It’s Still ScaryIt’s not a classic like it’s predecessor, But this sequel still has satisfying scares and kills."
    },
    {
      "rating": "8",
      "text": "1 - People are idiots. This is John Carpenter's version, not Rob Zombie's, I plan on contacting Metacritic and asking them remove the reviews that are based on Zombie's film and not Carpenter's. As for my take on the film - It was suprisingly a rather good horror movie that actually lives up to the first film in everyway."
    },
    {
      "rating": "8",
      "text": "Scary sequel picks up right where the original left off.  Not enough character development in this film, and it's riddled with plot holes.  Also, Jamie Lee Curtis is too old here to be playing a 17 year old high school girl (and that awful wig!).  Not as atmospheric as the original, but has some great scare scenes and  a suspenseful chase scene.  Could have done without the gore."
    },
    {
      "rating": "8",
      "text": "Halloween II. He goes for new victims. A worthy sequel to the first film. Although now there is no that pumping tone that was in the first film, the second part turned out no worse than the first."
    },
    {
      "rating": "8",
      "text": "I definitely one of those who prefer the 1981 version to the 2018. Although I think that's a better film this one is way more fun, sleazy and entertaining. Picking up right after the events of the first film Laurie is rushed to the hospital where Michael follows and continues his killing spree. It also revealed that Laurie is his sister. The film has a great dread induced  atmosphere and some great shocks. But there is an air of ridiculousness about it. Some of the kills feel very silly like the iv death. That being said the cinematography is great and its very fun.8/10"
    },
    {
      "rating": "8",
      "text": "Rick Rosenthal's Halloween II is a great film but not the best sequel. The first film did a fantastic job with incorporating minimal violence but this one focuses a lot more on gore. And some of the people in the film are just waiting to be killed. But Michael Myers and Dr. Loomis are still fantastic characters and the music is still flawless."
    },
    {
      "rating": "8",
      "text": "An underrated sequel that makes an amicable attempt to recapture the same magic that made the original so famous, and although it may have ultimately failed, it is still an entertaining slasher flick."
    },
    {
      "rating": "8",
      "text": "Laurie's in hospital on the same night as the last one, she's Michael's sister now but he finds her and chases her around the hospital, killing nurses, doctors and cleaning staff where needed."
    },
    {
      "rating": "10",
      "text": "Halloween II is an excellent horror film that stands aside from the original Halloween. However, Halloween II really never received the credit it was due. This is partly because most horror movies attract a young immature audience, and secondly related to the fact that John Carpenter did not direct and reincarnate Halloween. Aside from this, what Halloween II does show us is strong -continuity- from the original with a deeper storyline. This is one of the few sequels overall that nicely stands out on its own."
    },
    {
      "rating": "8",
      "text": "Halloween 2 is honestly one of the better films in the series. It may not justify its existence as much as the original but it still holds up. Its soundtrack was fantastic, the kills were great, and its nice the fact that this film explains why Michael wants to kill Laurie."
    },
    {
      "rating": "7",
      "text": "While i do think that this film should have taken more of the same pacing and direction from the previous film, Halloween II still remains a rather good slasher film even if it is taking a more Friday The 13th approach as the film does still have its rather intense sequences and creepy musical score. now some people don't really like how Michael became much more savage and rage filled when he murdered somebody in this film but i personally thought it was a good progression for his character he was tired of running around and chasing after Laurie so in turn his lust for her blood increased which made him extremely intimidating.7/10"
    },
    {
      "rating": "7",
      "text": "I like this movie if you watch it after Halloween. I honestly loved this this. Also this is not the Rob Zombie movie!"
    },
    {
      "rating": "7",
      "text": "While it doesn't live up to the original classic, it serves as a great follow up and ties in flawlessly. The atmosphere is still there along with the amazing soundtrack and the conclusion was very well done. The first hour does move extremely slow but picks up with intensity in the last half hour. Donald Pleasance as Dr. Loomis was once again the standout performance.  Definitely a must watch in the franchise."
    },
    {
      "rating": "9",
      "text": "Why do people hate this movie? I thought it was one of the best sequels. The story is good and its still as scary as the last one. The only flaw is the setting feels really I don't know bland."
    },
    {
      "rating": "10",
      "text": "WTF wrong wwith \"critics\" they love Halloween 2018 (only fan service) but these for me the true best secuel from Halloween."
    },
    {
      "rating": "10",
      "text": "Halloween II 1981 Is a To me A Really good Sequel To Halloween 1978 I really like this movie We do not even go years into the future which is good because sequels do that and they make no sense but anyway we startup as Laurie goes to the hospital while he kills some people in the neighborhood While Michael gives hints around the town While Laurie is in the hospital healing after when Loomis Figures out he been all over the place He kills so many people in the hospital This movie to me is a really good sequel I really don't have any complates Michael Myers mask is good The ending is pretty good also The Score is Still Really good They changed it up a bit gave it variety And also there Is a lot of gore in this movie that includes needles the first kill in one of those houses and the bathtub scene that is a complaint to people not to me It makes Michael Myers feel scarier and tense So yeah I am gonna Give Halloween II 1981 An A"
    },
    {
      "rating": "9",
      "text": "an excellent follow-up to Halloween"
    },
    {
      "rating": "10",
      "text": "Well, this film is one of the only sequels to match the frights and scares as the first. One of my personal favorite Halloween films. Even though Jamie Lee Curtis's character doesn't speak throughout most of the film, she delivers her character with depth and range. Truly scary film."
    },
    {
      "rating": "10",
      "text": "..................................................................................................................................................scary as ****"
    },
    {
      "rating": "10",
      "text": "It`s a brilliant sequel (and soo underated),it`s just as good as the first one!"
    },
    {
      "rating": "7",
      "text": "This sequel was at best the first sign, and at worst the very reason, that the magic of Carpenter's 1978 classic could never be re-captured again. This movie has a few strong points: the hospital makes a creepy (if misused) setting, the story wisely picks up right where the first movie left off, and frankly, it's just more Michael... However, there are so many areas where HII fails short of the original that the whole project ends up failing. Michael suddenly takes on some very unbecoming traits for the sole purpose of driving the plot; witness the zombie-like pace with which he \"chases\" Lauri through the hospital basement... he looks like he'd rather stretch the scene than actually catch her. They also did away with many tension-building elements, such as the silent stalking that made the first one so stylishly effective, Finally, this was the movie that introduced the whole brother/sister backstory, and while this was a tastefully moderate piece of plot exposition, it was the beginning of the \"let's explain what Michael Myers is thinking\" phase that stripped all the mystery from The Shape and ultimately gave us abortions like \"The Revenge\" and \"The Curse.\" I have a soft spot for this movie if only for the few bits of atmosphere carried over from the first one, but I have to see it for what it is: the first step in turning a great movie into a crappy series."
    },
    {
      "rating": "10",
      "text": "Halloween 2018 best secuel? really? Halloween 2 is the true and best secuel."
    },
    {
      "rating": "10",
      "text": "Incredible atmosphere that really sets a good mood for a fantastic horror flick,good acting,great soundtrack,suspense in the chase scenes is also very well directed,props to Universal for making a good movie :)"
    },
    {
      "rating": "8",
      "text": "Halloween II is a lot better than the lame original, more blood, more gore, it is so much better! TWO THUMBS UP!  Rick Rosenthal really had the right idea making this movie with more blood"
    },
    {
      "rating": "10",
      "text": "First, the critics are stupid as hell.Second, THIS IS THE 1981 FILM NOT THE 2009 ROB ZOMBIE FILM! To all you people who think this is Halloween II (2009), you're wrong and you need to search that movie on this website again.Third, I really liked this movie. It's a direct sequel to the original, the acting is pretty good as well as the opening. Even though the sequels don't have good explanations to how Michael Myers would have survived, I don't blame that problem on this film. I know this movie has more gore, which could turn some people off, but I still enjoy this film."
    },
    {
      "rating": "2",
      "text": "I am a big fan of Rob Zombie, but I really don't know what he was thinking when he created this disaster. Other than the fact that Michael Myers is running around this doesn't feel like a Halloween movie at all. There isn't much more to say. It was very, very disappointing for me."
    },
    {
      "rating": "5",
      "text": "I loved RZ's 1st 2 flicks. This one is his weakest. The girls are dumb and annoying, expecially the lead, who spends most of the movie crying (when she's not partying). This is a chick flick for the goth-depraved-and-proud crowd. The action is all a blur due to hand held jittery close-up's. The suspense and fright of Carpenter's original is totally missing here, despite (and maybe because of) the constant intensity. There's a good funny moment with Weird Al and a good inside joke with McDowell."
    },
    {
      "rating": "6",
      "text": "I don't understand this. THESE ARE REVIEWS TO THE WRONG MOVIE! Alright, now time to review the ORIGINAL Halloween II. The first Halloween was a great movie, and while this one is stale and definitely cliche, it does have a good ending, some scary scenes, and is probably the best sequel that the series has had. Not good necessarily, but it isn't horrible. Rental at best."
    },
    {
      "rating": "5",
      "text": "Bottom Line: Slashings. Slashings. More slashings. For whatever reason, Michael Myers enjoys it, but even seeing it, Halloween II comes across as dull.\r To barely alter the most famous quote from THE SHINING: â"
    },
    {
      "rating": "1",
      "text": "Acting: Not that great. The character of Dr. Loomis got very annoying. But, he seemed to annoy all of the other characters as well so maybe that was intentional. I doubt it though. Michael Meyers is, well, Michael Meyers. he's a silent big dumb lumbering character. Laurie Strode is in the movie for a whole 15 minutes total at best. all Jamie Leigh Curtis (speaking of her, Tony Curtis died today or yesterday I'm not sure which. But RIP Mr. Curtis. and Gloria Stewart.) had to do was scream and run. Just like the last one to be honest. That's all that any characters had to do. It was just weak or annoying performances all around. 2/10Plot: Actually, brace yourself: There was no plot. It was simply 90 minutes of Michael Meyers walking around killing people. The first one had intrigue, it had stakes. You actually cared what was going on and why these things were happening. With this, there's none of that. It is 90 minutes of solid killing. No stakes, no plot devices no deviation form that plot. Nothing. It was an empty plot. 0/10Screenplay: There was no screenplay either for 60%-80% of the movie. It was again, just Michael Meyers killing. 50% of the lines that were there were just \"we have to find and kill Michael Meyers. He isn't human\" or a variation of that. The rest of the lines were dull and unimaginative. 0/10Likableness: well, despite everything else, I liked the kills. There were some interesting kills in the movie. Some were ridiculous but others were interesting and well done. There is nothing else to like in the movie. 3/10Final Score: 5/40 12% (S)Also, I will say this. This movie is unfortunate because THIS WAS SUPPOSED TO BE THE LAST ONE!!!!TRIVIA TIME: 1. Believing Rick Rosenthal's version of the film to be too tame, John Carpenter shot a few gory scenes that were added into the film despite Rosenthal's objections.2. In the scene where Michael tries to attack Laurie as she's climbing through the window the scalpel that he's holding was actually just an eraser on a stick.3. To get the role of Michael Myers, Dick Warlock revealed that as he passed by a room, the Michael Myers mask was on a table. He put the mask on and walked into Rick Rosenthal's office and stood there. After Rosenthal continuously asked him who he was and he didn't reply, he took off the mask and asked if he could play Michael Myers."
    },
    {
      "rating": "4",
      "text": "(First of all, Quite a few idiots commenting on this. They have the wrong film - This is the original Halloween 2 and not the remake)\r Overall, It was a rather generic horror film. I find it rather stupid that Michael couldnt hunt down a girl with a bum leg and many other injuries. Also it ended rather stupidly as well. The acting was average, A little bit better then the previous film. Its no where near as good as the previous film. I expected better."
    },
    {
      "rating": "6",
      "text": "Relying more on blood-let than the debut, it builds fear but loosens it into a pit of mayhem that abounds through Dr. Loomis' foreshadowing madness, and Laurie Strode's ever-growing lust for innocence and freedom. Not as beloved as its predecessor, not scorned and forgotten as its sequels. Halloween II works best as an optional viewing. Just above the threshold of average, for the fact that The Shape still maintained that quality of fear-invoking evil (before becoming a clown in the sequels.)"
    },
    {
      "rating": "5",
      "text": "I'm kind of in the middle here. This movie was good, but it had some bad aspects to it. The plot wasn't as strong as the first one, but it wasn't weak either. I give it a solid 5.0/10; no more, no less."
    },
    {
      "rating": "6",
      "text": "Obviously better than H4-6, but still doesn't hold a candle to the original. I'll give HII some credit for trying to wrap up the Michael Myers story (not for good sadly), however, the HII doesn't even attempt to succeed on the original's scares, but rather feels more like a cash in. It just becomes a generic slasher, but far more boring than even Friday the 13th mediocrity. You might be more satisfied watching H20, which is another attempt at recreating Michael Myers' epic \"conclusion\"... (not for good sadly)."
    },
    {
      "rating": "6",
      "text": "This movie takes place exactly after the final events from the last movie in 1978, from now on, Michael Myers will hardly focus his killing hunger in Laurie Strode, while she go to a hospital because of her fight with Michael in the frist movie, a big blody chase will happen in that hospital. Directed by Rick Rosenthal and Written by John Carpenter and Debra Hill.In the first movie the story was good because it was functional in making we care about the characters, in this sequel, we don't really care more about any other character, we still care about Laurie, but only because of what we saw in the first one, if you only watch this one, most likely won't care about anyone, but considering that this is a sequel, that is not a problem, we still gonna care about Laurie, and maybe care more about other characters that are in here again, but in overall with other characters, we don't really give a damn, wich is a problem, in the first movie i did cared about other characters, like Laurie's friends, in here it didn't had that appeal, so a lot of the deaths weren't very shocking. The movie have some dialogues that aren't really interesting, but still, it doesn't dominates the whole film, there are some natural dialogues that people would really do. They decided to do some revelations in here that for me, was kind of out of place, it was like nothing to do with anything, it is a spoiler, but i don't that, that worked out. In this story they decide to go for Michael Myers in a more mystical way, going more for a supernatural path, that, for me, immediately takes away the fear a bit, it made things not so easy to relate and fear as in the first one, but considering the way that they are going in here, it was ok.The Michael Myers look in here, is a bit different, in his mask now, you can see his eyes most of the time, personally, i prefer how they did in the first movie, where in his eyes in the mask, it was all black, but i get it, it is a small change for things not look the same, is a good change after all. The kills are good, not great, but good, comparing to the first movie, Myers have a more diversified storage, he use now different weapons to hit his victims, there are also scenario things that he use wich was different, he also is a stalker, but not by far so creep as in the other movie, where you could not just feel the despair and also relate yourself with that situation, in here, since that you are in a hospital, the stalker thing got a little weaker, but still worked a bit.This movie isn't even by far as scary as his predecessor, i didn't had much moments during this one that i felt unsafe or creeped out, they couldn't repeat that atmosphere where anything could come out of anywhere in any moment, you pretty much knew where things was going to happen, it didn't had much surprises in his attacks, there is some jump scares, some tense moments, but still, it ain't by far as scary as the 1978 one.The movie becomes really good when the one on one moments start once again with Laurie and Michael, the persecution was tense, how broken she was after the events that already have happened, her will to escape from him was really nice to watch, while Myers quietly was walking behind of her. These moments were so dope, that reforced how badass the character of Laurie Strode is, she running around, in a very weak position, in unknown territory, that was really nice to watch.Jamie Lee Curtis was definely badass, she didn't had much dialogues, but where she gain me again in this movie, was at the moments where she figures that Michael is there after here, her faces of rage or fear was very nice. Donald Pleasence as Dr. Loomis was once again very good, i could get his affliction on Myers, his need to caught him and also how feared he was of him at the same time.The soundtrack is once again made by John Carpenter, and it is once again fantastic, it isn't the exact same as the others, it does have some peculiarities that are very nicely done, the soundtrack in here really pumped me up, it was done, once again, with maestry.As a slasher movie this definely worked, it ain't that much of a horror or a tense film, but it can be fun to watch the one on one between Laurie Strode and Michael Myers."
    },
    {
      "rating": "6",
      "text": "If there's a movie, that serves as a sequel for a movie that wasn't primarily designed for any sequel, this type of a movie is perhaps the best you can expect. Not saying it is a great film, but, it is likable to some extent. ..Good : It serves as a direct sequel to the original classic. It (initially) picks up the factors of what made the original Halloween so great. Most of the times, we feel as if Michael Myers is everywhere, but at the same time, nowhere. The last 10 to 15 minutes are quite intense. It doesn't spend more time setting up the characters that were in the original film, and simply focuses on furtherance of the story. This might be on the negatives for some people, I am aware about it. What I don't know is why. We already know about the characters from the first movie. It is simply a direct continuation of the first film. Rather than a sequel, it feels like the second part of a two parter. If you haven't seen the first film, you won't know them. You should've watched the first film, before watching any sequel or second installment. Yes, this movie doesn't work as a standalone movie. But, even if it did, there would obviously be at least some things you need to know from the first film. I will talk about the decision of going gory in the bad aspects, in a much elaborated manner. We just consider for now that it is gory. Some of the gory kills are awesome. Particularly one with a nurse and hot boiling water in the tub. I won't say how the kill is brought about, but the kill is insane to watch (I don't want to give the spoilers). The music is pretty much the same. Carpenter didn't redo or remix the original score, but made it slightly different and it works for the movie. One final thing. This movie makes the original somewhat better - may it be by giving a good continuity to the story or by making some bad story decisions. If we cut away the end credits of the first film and the opening credits of this film, we get one giant Halloween movie. I would say that if Halloween wasn't given any sequel, I would've been totally fine. In fact, that would've been the best decision. But, this film exists. And not as a mere cash grab. So, whenever I rewatch the original, I can never help myself not watching this movie, right after the completion. That **** happens very few times with me. And whenever it does, I love it. This is perhaps the biggest positive of this film. ..Mixed : I liked how Myers was related to Samhain (Google that **** if you want to know more about it, and it's not a spoiler here) but there has been absolutely no build up to that part. And right after that we get another twist which makes Myers a focused killer. That explains a lot of things, but again, some parts of both the movies are (kind of) contradicted as he killed many people in a random manner. ..Bad : In my positives, I said that, initially, it picks up the factors of what made the original film good. At the beginning, it resembles a lot to Carpenter's film, but slowly and steadily it shows its inferiority. It loses the subtleness of the first film gradually, and, it focuses on more gore and unnecessary nudity. 1980 gave us Friday the 13th which had poor story and focused on gore and it got popular. This movie did not need to be a response to that. Apparently, Carpenter did some reshoots to make it more Friday-ish. That was a mistake. It could've been just like the previous film, without any Friday **** And, if they wanted gore, they could've done it by being primarily focused on the story and suspense. Also, Michael Myers walks like Frankenstein. The reason that we loved him was because he lied somewhere between human and evil. His gestures were all human. Here, he resembles a zombie. This is nothing but another response to Friday the 13th. Also, there are some illogical things in the screenplay. (Not a spoiler) Michael Myers is related to Samhain because the a character sees \"Samhain\" written in blood on a board. It was definitely Myers as per the story, but why would he do that? Also, if you clearly follow the story, all Michael did to write that feels totally stupid. Completely illogical. And there are other stupid things. Some of the characters are merely stock characters who are there just to get killed. A lot of them are stupid people who do stupid and nonsensical things to make us laugh, forcefully. It had a potential to be much better than this. ..Conclusion : I won't say it is a well deserved sequel for the original (by which I mean the original doesn't really deserve this), but I would say that it deserves to be the sequel to the original. There are flaws in this movie. But it can be watched - right after the original. It will never serve as a standalone film, but as a sequel to something that wasn't really designed for a sequel, it does its best to make itself worth being a sequel to an amazing film. ..Rating. ..Score : 6.8/10Grade : B"
    },
    {
      "rating": "5",
      "text": "Halloween II was a disappointment. The story, and suspense which made first part masterpiece was missing in this part.The setting was a bad idea, a hospital which is almost empty. The suspense of this movie was not even scary. At one time I was thinking that why producers greenlit this type of senseless story.Overall, you may enjoy it little bit but at the end it will be disappointment."
    },
    {
      "rating": "8",
      "text": "This directly follows on from the previous film and cannot really be faulted as it is more of exactly the same. It is almost like the first film never ended. It is slightly more graphically violent and that is an improvement. Also the tone is slightly more serious, again an improvement. I did enjoy this sequel. There was a slight sense of a bigger budget for this film but that didn’t spoil it at all. The film has more pace and the characters are just as good. If you have seen Halloween (1978) then you might as well watch this one, especially if you enjoyed the first one. You will enjoy this too. It’s not as original but everything that made the first film successful is here too and this time ramped up to be slightly more entertaining in my opinion."
    },
    {
      "rating": "8",
      "text": "Not as good as the original Halloween movie but it is still great in its own right. I like both of these Halloween movies and the way Zombie did them. For people who are going to see it for the story. Your review should not even be counted because you do not rate a Slasher based on its story.. there really is none or its usually very simple. You have to rate it completely different from other movies. Anyways like I said it was a good movie."
    },
    {
      "rating": "2",
      "text": "Not impressed."
    },
    {
      "rating": "0",
      "text": "One of the worst movies of all time."
    },
    {
      "rating": "0",
      "text": "The worst movie I have ever seen."
    },
    {
      "rating": "0",
      "text": "I didn't like it too much!!! But ha they say they might have a part 9 hopefully we'll enjoy it!!"
    },
    {
      "rating": "0",
      "text": "I think they could did much better they did excellent in part 1 why not this one? And can someone give me a little news on Halloween 9.Thanks."
    }
  ],
  "recommendations": [
    "halloween_iii_season_of_the_witch",
    "halloween_5_the_revenge_of_michael_myers",
    "i_still_know_what_you_did_last_summer",
    "halloween_h20_20_years_later",
    "hellbound_hellraiser_ii",
    "halloween_the_curse_of_michael_myers",
    "halloween_resurrection",
    "scream_2",
    "the_amityville_horror",
    "a_nightmare_on_elm_street",
    "insidious_chapter_2",
    "halloween_4_the_return_of_michael_myers",
    "saw_ii",
    "the_grudge_2",
    "the_texas_chainsaw_massacre_the_beginning",
    "sinister_2",
    "the_texas_chainsaw_massacre",
    "dead_silence",
    "poltergeist",
    "final_destination_2",
    "cult_of_chucky",
    "friday_the_13th_part_2",
    "the_thing",
    "jason_goes_to_hell_the_final_friday",
    "the_last_house_on_the_left"
  ]
}