{
  "id": 1868,
  "title": "Halloween III: Season of the Witch",
  "starring": [
    "Tom Atkins",
    "Stacey Nelkin"
  ],
  "runtime": 98,
  "genre": [
    "Horror",
    "Mystery",
    "Science Fiction"
  ],
  "description": "Dr. Daniel Challis and Ellie Grimbridge stumble onto a gruesome murder scheme when Ellie's novelty-salesman father, Harry, is killed while in possession of a halloween mask made by the Silver Shamrock mask company. The company's owner, Conal Cochran, wants to return Halloween to its darker roots using his masks -- and his unspeakable scheme would unleash death and destruction across the country.",
  "releaseYear": "1982",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/WABfdeaThFYXCySGIOvRNv2sSW.jpg",
  "categories": {
    "plot": 5.242424242424242,
    "acting": 5.0,
    "ending": 5.4,
    "soundtrack": 6.5,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Boo hoo, it doesn't have Michael Myers in it. Yes it does and it makes a fine addition to the Halloween franchise. Rank it below the original and well above all the other sequels."
    },
    {
      "rating": "10",
      "text": "10/10 as a stand alone film to watch during Halloween,8/10 as a continuation of the Halloween film franchise. creepy atmosphere and great characters. truly worthy to watch during Halloween day."
    },
    {
      "rating": "10",
      "text": "..................................................................................................................................................scary as ****"
    },
    {
      "rating": "10",
      "text": "I don’t care what other people think, I think Halloween 3: Wizard Blood is perfect for me. Because it is a film that knows where it is going, it takes another path and prevents the saga from being too repetitive. Because Halloween isn’t just about a serial killer. Halloween connects a party with candy, you can put anything, like different monsters, and it will always be Halloween. And why smash the movie just for the masked killer’s absence. It looks like you’re not watching the whole movie. All that bothers you is his absence, think about the staging, if on the level of suspense it is effective etc. I found the film ultra entertaining, because I’m carried away in this mysterious investigation and makes me want to see what happens next. And the film has a lot of suspense and the atmosphere is heavy.The atmosphere is successful thanks to his music that perfectly ambianced, not to mention the excellent theme, an abstract theme composed by John Carpenter and Alan Howarth.Well, the movie’s as **** up about some things as well. We can also take example on the scene of the hospital where the guy in the car was hyper badly camouflaged and was hyper burned at the first viewing. But fortunately Halloween III does not take the obvious flaws and this saves the film rather well."
    },
    {
      "rating": "7",
      "text": "This movie gets such a bad wrap for dumb reasons. It would be cool to see different events happen around Halloween. Kinda like an anthology series.But no, lets have more terrible Halloween sequels that kills the mystery of Michael Myers. Audience members can suck sometimes."
    },
    {
      "rating": "7",
      "text": "The most underappreciated of horror films, the ugly step-child of the Halloween franchise that doesn't deserve its ill reputation. When I think of Halloween (the holiday) I think of children wearing the masks from this film and that incredible, indelible, iconic shot of trick r' treaters silhouetted against the sunken sun, the sky orange going on black, looking out over the low lights of Phoenix from the hills above. Damn that's nice. Oh and that insanely catchy Silver Shamrock song. So much memorable from such a strange, casually plot irrelevant movie. It doesn't really do one thing exceptionally well - besides presentation. The plot is fine, silly verging on nonsensical. The blood and gore are mostly pedestrian but with glimmers of imagination (if only the family murder scene didn't devolve into snake bites). The main characters are likable ciphers - there are a few insights into them but it's mostly matter of fact without much more than a passing interest. Without a better way to put it and hating this turn of phrase - they don't make them like this anymore, whatever the hell that means."
    },
    {
      "rating": "7",
      "text": "The best b horror film ever! B horror films aren'r normally good, but this one is so entertaining, kinda creepy, but overall a cool movie, and is one of the best out of all the Halloween sequels"
    },
    {
      "rating": "10",
      "text": "This movie was super great! It was extremely terrifying! I kinda wish they had gone on with this anthology idea."
    },
    {
      "rating": "8",
      "text": "I distinctly remember being in Grade 8 when the film came out, and for four major reasons: 1) The excellent TV commercial, with John Carpenter's spooky music and the spider crawling out of the mouth of the mask; 2) The decent book adaptation written for young adults, that I read at the time, and thoroughly enjoyed; 3) Karen Carpenter died of a heart attack from anorexia nervosa; and 4) Major songs on the radio around that time were 'Centerfold' by The J. Geils Band and 'Bette Davis Eyes' by Kim Carnes. Though I had not yet seen the previous two films and wasn't old enough (the R-rating, and my parents were somewhat strict about that kind of thing), I really wanted to see it, but over the years, I never really got around to it, until recently I found used the entire 'Halloween' franchise on a 10-blu ray pack, and no longer have any sort of excuse, really.\r I loved Wallace's work in 'Stephen King's It' (except for the last half-hour, but that's probably the book's fault and not the director's) and I thought his 'Vampires: Los Muertos' was rather underrated, so an added attraction for me was to watch his directorial debut here. He impressed me. I enjoyed the film and all of the extras on its blu ray very much. If you like horror films at all, you should watch this.\r Protagonists Tom Atkins and Stacey Nelkin are very good here, and I liked Dan O'Herlihy even better than when I had previously seen him in 'The Virgin Queen', 'Imitation of Life', 'The Cabinet of Caligari', 'Good Against Evil' and the first two 'RoboCop' films, and, as always, Dean Cundey provides excellent cinematographical work and the soundtrack by Carpenter and Alan Hogarth is dependably solid. Don't bother with the negative reviews that came out at the time the film was released: Most people were upset that the film didn't have Michael Myers in it, and didn't give it a chance. Find out for yourself--in my humble opinion, it's worth both purchasing and at least a rewatch."
    },
    {
      "rating": "7",
      "text": "For a long time I really didnt want to even give this a chance because of the dreadful reviews and lack of Michael Myers, but I finally watched it and was quite surprised with how utterly bizarre and unsettling it was. As a standalone film it's very efficient though the story is quite ridiculous, but executed quite well due the atmosphere and ominous visuals. Honestly i have to give this and film credit to breakaway from the normal formula and really go for an insane concept. One of the best soundtracks of all time once again from Carpenter and more unbelievable cinematography from Dean Cundy."
    },
    {
      "rating": "8",
      "text": "Halloween 3: Season of the Witch may not have had Michael Myers in it, but it's one of the better entries in the franchise. The anthology of this movie is pretty great and the characters are amazing."
    },
    {
      "rating": "8",
      "text": "Halloween III Season of the Which is a good concept but it takes too long to get to the villain of the movie Not as many kills The main character is fine I actually don't hate em like other people I really do like the concept of this movie but it gets boring because there is a lot really going on in this movie I do what another movie like this Because I feel like now it would work not back when this movie was Made I give Halloween III Season of the Witch An C"
    },
    {
      "rating": "5",
      "text": "No Michael but a company that makes Halloween masks are being culty, making androids and try to brainwash kids through a TV ad with an annoying song."
    },
    {
      "rating": "3",
      "text": "What pile of hot garbage an overtly weird film with an extremely annoying and uninteresting plot that makes literally no sense, the characters were no where near as like-able as Laurie Strode or Dr.Loomis, the soundtrack is horribly over stylized and messily chopped together to the point where i want to stab myself i the ear. i know a lot of people complain Michael isn't in this one so i wont elaborate to much but why did the filmmakers think that this the direction that the audience would want this franchise to go in.3/10"
    },
    {
      "rating": "5",
      "text": "Mediocre ThreequelAfter a masterpiece first film and a decent second film, Halloween is starting to feel a bit ridiculous in the third outing."
    },
    {
      "rating": "5",
      "text": "Congratulations, Halloween franchise. You tried. Yes, you failed. But you tried. ..Good : I know a lot of people hate this movie to death, and I do understand why. I hate this movie too. Just not as much as the others do. There are some good things I need to address about this film. The first one would obviously be the fact that it dared to take a totally different direction and give a totally different story idea. That didn't (or doesn't) work. But that's a different thing. At least it dared to completely neglect the first two films, for its own good. Had it been successful, we might have got a totally different Halloween franchise. Who knows? Also, I think the ideas used in this film are not bad, either. I dig the ideas behind it. I always loved fantasy and witchcraft with adventures that have something to do with the ones following some sort of a cult kind of a thing, or some fictional ancient history, if they're not cheesy as hell. That's the reason I love a number of Disney fantasy films and a lot of these type of horror films. Tom Atkins does a fine job in his part. His doctor character doesn't compare to Dr. Loomis from the first two, but is kind of entertaining at what he does - though, his character is one of the biggest flaws of the movie. Dan O'Herlihy does a fine job as Cochran. I haven't seen his other films, but I am positive that the other performances by him are better - as much as I have heard about him. He has a feeling of presence in the movie and gives many creeps. The way they open up the story as the movie progresses is appreciable. Also, the intense scenes do deliver. The entire film may not be well directed, but certain parts are. The music that plays for the Halloween commercial felt really disturbing to me. It was a mere rehash and pacman-ed version of \"Mary had a little lamb\" but hits the nerves where it should. It spooked the hell out of me, honestly. ..Bad : There are a lot of many bad things in this movie. The first one would be the tonal inconsistency. And, that's mainly due to the characterization of Dr. Challis. He is well acted, no doubt. But, he is out there to investigate something, and ends up having sex with someone at the most awkward time. He is kind of a womanizer and also kind of a generic hero at the same time. That doesn't mesh very well. So, from a mystery-fantasy movie, we divert to sex comedy very often. He tries to get in the pants of many ladies in this film. And all of it is just because we need some sex scenes. Completely unfit for a movie like this. This is one of the main reasons I hate this movie. Then, there are some sci-fi elements to it, which feels like a cheap and rejected idea for Blade Runner. Except for saying that it is \"advanced ancient technology\", it does nothing to explain the **** We just need to accept something that doesn't even feel remotely possible as a fact. And those type of things are the things I hate the most in a **** sci-fi movie. I don't even think that Blade Runner is a movie that will ever resemble reality. But, it is well put over and superbly directed. The ideas definitely win the viewers over. But this piece of **** uses the sci-fi **** merely as a plot device. You can use any fantasy element in the way you like, if you can give us a good product. But sci-fi means a little more of convincing stuff than just blant fanstasy. Every good sci-fi film has some degree of acceptability of the ideas put in it, even though it may never be realized at all. This movie completely misses that point. ..Conclusion : On the whole this movie is a frustrating movie. Some good ideas and the totally different direction it takes is appreciable. But, in the end, it is just a mystery-fantasy wannabe which is simply a tonally inconsistent and whacky sci-fi movie. ..Rating. ..Score : 5.1/10Grade: D+"
    },
    {
      "rating": "2",
      "text": "The premise was interesting but it was very poorly executed. The cast doesn't seem the least bit interested in what they are doing and there are so many plot holes that the movie quickly devolves into utter nonsense."
    },
    {
      "rating": "3",
      "text": "Absolutely atrocious in almost every way. I admire the fact that they did try to propel the story in a different direction but the direction they took was not very good"
    },
    {
      "rating": "6",
      "text": "In the Halloween series yea it doesn't fit in the series at all and its plain stupid. But it was a bit scary and own it's own its not that bad. I wouldn't recommend it but its decent."
    },
    {
      "rating": "6",
      "text": "An original sequel to Halloween. John Carpenter originally wanted each Halloween movie to have its own theme and original story. Aspects of \"Season of the Witch\" are quite frightening, however the effects don't always work. Though this film was panned it has, in my opinion, stood the test of time."
    },
    {
      "rating": "1",
      "text": "I’m sorry guys, but this is one of the most ridiculously awful films I have ever seen in my entire life. Forget about the fact that this movie has nothing to do with Michael Myers for a second, this movie has one of the most ridiculous plots imaginable that it truly does come off as insulting to the ordinary human’s intelligence. The children are killed by a chip inside of their masks that activate when they watch the Silver Shamrock Commercial!? Are you serious? It looks so dumb on the camera!  What happened to the escalating moments of terror that John Carpenter gave us in Halloween? Or moments of gore that Rick Rosenthal gave us in Halloween II? Both movies brilliantly showed us the true brutality of Michael Myers’ nature. This movie was just laughable mess from start to finish. The acting is also unbelievably overdramatic, it’s truly impossible to take anything this movie offers seriously."
    },
    {
      "rating": "4",
      "text": "Reasons I don't like this movie is  1: This should be a stand alone movie it has nothing to do with Michael Myers. 2: I don't like any of the characters and the story isn't good. 3: That damn Halloween song won't get out of my head."
    },
    {
      "rating": "1",
      "text": "It is mediocre but this is very strange and seems to be the most dumb and ridiculous but can be entertaining but there shouldn't have been a 3rd movie."
    },
    {
      "rating": "6",
      "text": "I like this flick,not bad at all,if only it wasn't called Halloween 3,great soundtrack,a solid story,i understand the hate,just watch it as Season Of The Witch,not as Halloween 3"
    },
    {
      "rating": "5",
      "text": "As soon as a strange man, seller of masks for halloween, end up in a gas station, saying that people will kill all of them he is sent to a hospital a few days before halloween, in the same night he got brutally murdered by a strange and mysterious man and no one knows the possibly reason for it. So his daughter, Ellie Grimbridge, and the doctor who attended the man, Daniel Challis, go investigate the last steps of the seller and try to find out what could have happened to lead into that. Directed and written by Tommy Lee Wallace.This movie creates a mystery since the very beginning, with a nice persecution sequence at the very beginning, where you don't understand much what is going on, but later on the movie it got pretty clear what could have happened. I think that the hospital scenes wasn't much well applied, like the man could surely speak, he was just repeating the sentence \"they will kill all of us\" or something like that, there are moments that people got shocked and say only one thing, but i didn't got convenced that he couldn't have said more, or at least showed the mask more clearly to the people there or something like this. I believe that they could have placed some dialogues where they did explained why not call the police or something, or at least put the cops somewhere in this film, a mysterious and brutal murder have happened in a hospital and not even a comment about cops, that felt like a flaw for me. A thing that i really enjoyed in the script here, was that strange and fully of secrets in that small town that they went, the whole atmosphere in that place was strange, people looking, cameras watching everything, weird people, you could just feel that things wasn't going well around there. The development of the plot durint the second act in the small town, together with the some other details, i think that it is satisfactory, it goes calmily and little by a little we got know more about what is going on there, who is living there, what business happens, that wasn't anything great at a point to make you care much about anyone, but, for me, it was decent. Toward the end things got almost 100% off, in a point that can screw things up, i don't really mind strange things, i like the incomprehensible, really enjoy to think about it, but there is somethings that isn't really here, it got ridiculous, like a mask become into a bunch of snakes and flies with worms, sorry, but that is way to overly unreal and nonsense, durint the escape from the factory, things got way to dumb with some really weak writing decisions, since the mask throw, and that completely nonsense part where Challis put down those brooches and suddenly all the robots got destroyed, even those that weren't hitted by the symbols, except for one, the Ellie one, wich doesn't make any sense, first she being a robot and actually help Challis to escape from there and not giving away his position in any way, and later on she tries to kill him just for the sake of it, there was no necessity for she to be a damn robot and narratively didn't really made much sense, but it was kind of nice the battle in the end, it makes sense, no, but it was a bit fun. And also the part before that all, where Challis apparentely knows exactly how to turn on all of these computers and put the commercial there in all the screens, thing that he have saw it before, but it wasn't in that proportion.The story remembers from Halloween 2 the mmystic aspect that was added, using the same name as before used, i'm not sure if this is really cannon with the others, in virtude that nothing except for this is mentioned and that they used the same actress from before to play other character in here, but i would say that it is.This movie is definely not a horror movie, even that it tries to be sometimes, you don't feel fear watching this, it tries to be a slasher, in sometimes it does work, the kills aren't very creative, but are definely distressing. It also tries to be a investigation movie, wich worked.Stacey Nelkin didn't made me buy that she was sad or affeard of something in much moments, she was functional, during romance moments she also was ok with her lines, she mostly spoke with not much emotion, but as i said, she was functional. Tom Atkins pretty much plays the hero in here, he does convince as a doctor, he could make me believe that he wanted to help in some moments, he also was very functional. Dan O'Herlihy is in here, and he is definely fun, the way that he speaks is nice, he have that malice where he is doing something good, but behind that all it have something hidden, he have some good sarcastic moments. Nancy Kyes that played Annie in the first Halloween movie is here, but to play Linda, Daniel's Ex-wife, she is here more as a homage to the original movie i think, if this is cannon thre was no reason to put her in here except for this, she don't have much lines, but she convinced me in what she did."
    },
    {
      "rating": "6",
      "text": "As a sequel to Halloween II this film fails. As a standalone it works well. Still miles better than H4-6, Resurrection, and possibly even Rob Zombie's dreadful reboots. Season of the Witch at least has some originality, which the other entries in the series lacked. It's a underrated film in general with a grown cult following. Like most 80's horror films, definitely a guilty pleasure, but really it's really not as bad as you'd think. Just don't treat it as a proper \"Halloween\" movie as that it is not. However, the influences of John Carpenter & Debra Hill had on HIII give the film that classic Halloween 1 and 2 vibe that other entries in the series lacked. Season of the Witch is a underrated film. It actually gets worse from here."
    },
    {
      "rating": "6",
      "text": "A Halloween movie with no Michael Meyers? Given most of the sequels were dreck, the third outing is an entertaining watch as a Halloween-themed thriller."
    },
    {
      "rating": "7",
      "text": "First of all, ignore the reviews which are giving this movie low rating just because it doesn't include Myers. You should know that this was planned as first part of anthology.Halloween 3 is an enjoyable movie with some new concept. The acting is quite good, the story is ridiculous however entertaining. The music is composed by John Carpenter, so is excellent and this helps to build up some great moments of suspense.Overall, this movie is underrated and needs to be given one more chance as it has potential."
    },
    {
      "rating": "4",
      "text": "John Carpenter's 1978 'Halloween' is wholly deserving of its status as a horror classic. To this day it's still one of the freakiest films personally seen and introduced the world to one of horror's most iconic villainous characters Michael Myers.Which is why it is such a shame that not only are all of the sequels nowhere near as good but that the decline in quality is so drastic. Ok, the original 'Halloween' is very difficult to follow on from, but most of the sequels could at least looked like effort was made into them. 'Halloween III: Season of the Witch' had a generally negative critical reception and is still considered by many one of the worst of the series, but has garnered fans overtime. To me, 'Halloween III: Season of the Witch' is not that awful, but it is not a particularly good film either.It is often criticised for straying too far from the formula and not feeling at all like a 'Halloween' film. Actually these complaints are understandable, but a lot of people have also argued that there is much more wrong than just being unrecognisable as a 'Halloween' film. Actually, didn't mind at all that it tried to be different rather than being a retread like 'Halloween II' was, sadly it just didn't work out. Judging it as a standalone, 'Halloween III' also manages still to be problematic.'Halloween III' is not a complete mess. It is one of the better-looking and more polished sequels and has a suitably eerie look. The music has a spine-chilling atmosphere and has a real eeriness. The song is similarly very catchy.A couple of the deaths are disturbing and Dan O'Herlihy tries his best.Like the previous film, the drawbacks are numerous and significant. There is more creepiness than with 'Halloween II', even if just sporadically, but tonally it still doesn't feel right. The weirdness of the story is overkill and parts are unintentionally funny. The science fiction elements feature excessively and confuse the storytelling, as well as because it is more silly than eerie it dumbs it down.Once again there is very little scary or suspenseful. A couple of the deaths are more disturbing but most are not that creative or unsettling. The story was a decent idea that could have been creepy but was instead silly and with even more stupidity and illogic than the previous sequel.Many have said that no awards will be given for good dialogue and acting. That's putting it lightly. The script is clunky and cheesy ineptitude throughout and the acting, Dan O'Herlihy excepted, is pretty awful and fails to do anything with such dull and annoying characters. The gore is gratuitous, the ending is a big head-scratcher and the non-horror scenes are ineptly directed (in a film where direction reeked of inexperience), written and acted.In summation, mediocre and not so happy. Not quite as bad as reputed though. 4/10 Bethany Cox"
    },
    {
      "rating": "8",
      "text": "Halloween III: Season of the Witch is unduly criticized. Yes, this is not a direct continuation of the first 2 films. But Halloween III is a good mystical thriller for its time. There really is an interesting plot here, the development of which is interesting to follow. Yes, the very idea of the plot looks delusional even now, almost 40 years after the release of the film. But there's suspense here and a great open ending where the protagonist loses. And the film is not stretched in contrast to the first 2 parts of Halloween, it has optimal timing. I recommend watching it for everyone, even if you are deterred by Carpenter's absence from the director's chair and the film's ratings. One of the best Halloween movies."
    },
    {
      "rating": "3",
      "text": "Halloween III: Season of the Witch. Where are the witches? Surprisingly and shockingly bad film in almost every category. The main villain is unknown who, the main character only runs from room to room, the plot is completely stupid. This is not Halloween. This is a strange film in its own right."
    },
    {
      "rating": "7",
      "text": "Definitely an enjoyable movie, however, I can see how Halloweens fans would be bitter if they didn't known in advance that there was not going to be a Michael Myers. The plot itself is interesting and unique, but there are certainly some rather notable potholes that should should been addressed"
    }
  ],
  "recommendations": [
    "halloween_ii",
    "hellbound_hellraiser_ii",
    "book_of_shadows_blair_witch_2",
    "the_thing",
    "insidious_chapter_2",
    "sinister_2",
    "halloween_5_the_revenge_of_michael_myers",
    "dead_silence",
    "the_grudge_2",
    "the_grudge",
    "poltergeist",
    "the_curse_of_la_llorona",
    "the_conjuring_the_devil_made_me_do_it",
    "the_amityville_horror",
    "a_nightmare_on_elm_street",
    "dark_skies",
    "blair_witch",
    "annabelle",
    "halloween_the_curse_of_michael_myers",
    "malignant",
    "devil",
    "the_possession",
    "the_eye",
    "i_still_know_what_you_did_last_summer",
    "cabin_fever"
  ]
}