{
  "id": 1282,
  "title": "Halloween: The Curse of Michael Myers",
  "starring": [
    "Donald Pleasence",
    "Paul Rudd"
  ],
  "runtime": 88,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Six years ago, Michael Myers terrorized the town of Haddonfield, Illinois. He and his niece, Jamie Lloyd, have disappeared. Jamie was kidnapped by a bunch of evil druids who protect Michael Myers. And now, six years later, Jamie has escaped after giving birth to Michael's child. She runs to Haddonfield to get Dr. Loomis to help her again.",
  "releaseYear": "1995",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/noCnM8nEI2bEDSdKHh0RKbwBwbC.jpg",
  "categories": {
    "plot": 4.071428571428571,
    "acting": 4.888888888888889,
    "ending": 3.75,
    "soundtrack": 2.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Danielle Harris wanted to reclaim her role as Jamie, but turned it down when Dimension Films refused to pay her the $5,000 she wanted. Harris stated in an interview that when her agent learned that filmmakers were looking to cast an actress who was at least 18 or older to play Jamie in this film, she was only 17 but wanted to do the movie enough that she got herself legally emancipated from her parents at the suggestion of filmmakers so that she could work longer hours without having to go to school. Harris spent time and thousands of dollars on the legal process, but ultimately turned down the film due to her own dissatisfaction with her character's story and Dimension's refusal to pay her a salary that would have recovered her legal fees. Harris also stated that she eventually met and befriended J.C. Brandy, who took over the role of Jamie in the film and was treated poorly on the set because Harris turned down the role."
    },
    {
      "rating": "8",
      "text": "Howard Stern was originally offered the role as radio \"shock jock\" Barry Simms, but turned it down."
    },
    {
      "rating": "8",
      "text": "Ok, Halloween The Curse of Michael Myers What a surprise After Halloween 5 no hope this movie not so bad I thought this would have done too much of the bat the kills are decent the best one is the exploding one, Ok Tommy Is not that good, to be honest but he is fine to do what that character needs to do Kara Strode What a decent character Lommis Is just Trying to really get this done within this movie he just wants to relax The cult was not too much in this movie What I thought it would of have been Michael Myers Is amazing in this movie looks great I like what Michael Myers does like the house thing that was dope So All round Halloween The Curse of Michael Myers was a Suprise to me So I think u should check it out I am gonna Give Halloween The Curse of Michael Myers An B-"
    },
    {
      "rating": "8",
      "text": "I'm reviewing the producer's cut here,cause it's a far superior movie to the theatrical cut,more complete,but if Farrands was allowed to have his own full vision of the movie without studio's interference,it would of been better,but a good sequel nonetheless"
    },
    {
      "rating": "10",
      "text": ".........................................................................................................................................scary as ****"
    },
    {
      "rating": "10",
      "text": "The symbol used in the film is suggested to the druid symbol and thus Celtic. In reality it's the rune thorn/thurs and is Germanic. However, it is indeed related to magic."
    },
    {
      "rating": "10",
      "text": "Tal vez se malogró mucho el concepto de la saga, pero realmente esta es una muy buena secuela, vemos a un Michael Myers más siniestro y aterrador desde la primera película."
    },
    {
      "rating": "10",
      "text": "°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡=_=_=_=_=_=_==_=_=_=_=_=_=+@+@+@+@+@+@+@+@+@+@+@++@+@+@@"
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡¡●●¡●¡●¡●¡●¡●:;:;:;:;:;:;;::;:;:;:;:;:;;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:"
    },
    {
      "rating": "10",
      "text": "Ohjgjnkvuhiguhiguhudfsraeduhomlmlmonihigutsraqeyuoojkjohuftdtfgiihihhiihhiihih"
    },
    {
      "rating": "10",
      "text": "--------------------------------------------------------○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"
    },
    {
      "rating": "10",
      "text": "《《《《《《《《《《《《《《《《《》》》》》》》》》》》》》》》》》》********************************************************"
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "10",
      "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆⊙°•☆⊙°•☆⊙°•☆⊙°••°⊙☆•°⊙☆•°⊙☆☆"
    },
    {
      "rating": "10",
      "text": "{}{}{}{}{}{}{}{}[][][][][][]()()()()()()()()()()()()()()!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆...................,,,,,,,,,,_____________________________"
    },
    {
      "rating": "10",
      "text": "&\"&\"&\"&\"&\"&\"^\"^\"^\"^\"&\"&\"&\"&\"&\"&\"&\"&\"&\"\"&\"&\"&\"&\"&\"&\"&\"&\"&●●●●●●●●●●●●●●●●●●●¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤......."
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤.........................\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\""
    },
    {
      "rating": "10",
      "text": "+++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "7",
      "text": "This review is for the theatrical cut which I prefer. As long as we ignore Michael getting his eyes shot out at the end of 2. This entertaining but flawed sequel has some definite lapses into weirdness with the druid stuff the Myers worshipping cult. But I love the feel of the movie. It's one of the more seasonal entries of the bunch. It also has a creepy, dread inducing atmosphere and it's quite stylish in its execution. The cinematography and rock version of the theme are cool and Paul Rudd is fun and sexy as a grown up Tommy Doyle. Sure it's filled with cliches and it's all a bit goofy but it's another solid entry in the Myers franchise."
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■■●●■●■●■●■●■$$$$$$$$$$$$$$$$$$$$$$$$$$$$÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%"
    },
    {
      "rating": "10",
      "text": "$,$,$,$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》"
    },
    {
      "rating": "7",
      "text": "After the disappointment that was Halloween 5, this sequel does its best to atone for its predecessor’s mistakes which it does very well. Alan Howarth returns with an atmospheric and dark score that’ll send chills down your spine, George P. Wilbur is back and better than ever as a brutal and down right horrifying Michael, and last but not least Donald Pleasance brings an amazing performance as the persistent Dr. Loomis. This is the closest they’ve gotten to the original movie and is worth the time checking it out."
    },
    {
      "rating": "0",
      "text": "..................................................................................................................................................scary as ****"
    },
    {
      "rating": "0",
      "text": "Why do a bunch of idiots praise crappy guitar solos, terrible writing, random jump scares, strobe lights in your face every 4 seconds, and an illogical story?"
    },
    {
      "rating": "10",
      "text": "=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:____________________________♡◇♡◇♡◇♡◇♡◇♡♡"
    },
    {
      "rating": "2",
      "text": "Halloween: The Curse of Michael Myers is loud, flashy, confusing, stupid, and annoying! It is awful and not scary.The Producer's Cut of this film is not that good but it's way better than this."
    },
    {
      "rating": "0",
      "text": "Halloween the curse of Michael Myers is so **** that the studio was forced to drastically overhaul it before its theatrical release, but that didn't help things much. Both versions of this atrocity are quite simply disrespectful to the work that John Carpenter and co. put into the original classic. Do not watch this film under any circumstances. It is dreadful."
    },
    {
      "rating": "4",
      "text": "I've seen both cuts of this film, while the Producer's Cut of the film is a decent film, the original cut that was shown in theaters is a true death blow to this once proud, franchise. Mired in more \"Cult of Thorn\" nonesense, the original cut of this film is best left in the corn thresher"
    },
    {
      "rating": "3",
      "text": "Trainwreck Of A Horror MovieWow, This is one awful Halloween movie, and that’s a damn shame."
    },
    {
      "rating": "3",
      "text": "A gore fest with a confusing plot and randomly Paul Rudd thrown into the mix. The film's producer and director both had different visions of how this film should be created, the studio had even worse ideas, and this is the result."
    },
    {
      "rating": "0",
      "text": "Easily the worst one in the franchise and one of the worst movies I have ever seen."
    },
    {
      "rating": "3",
      "text": "The Curse of Thorn is put mercifully to rest, but at least these movies were trying to build something new. The theatrical cut of this is immense garbage. I wish I could see the Producer's Cut, if only to say I did (there's no way it can save this), but it's not included in the Scream Factory complete collection, so it can't be that good can it?This movie is seriously so awful, boring, braindead and disjointed. It doesn't work ever, at all for any reason."
    },
    {
      "rating": "6",
      "text": "The producer's cut is far superior to the theatrical cut. While the original cut focused more on the gore, The producer's cut provided a clearer and better story. It's still not a perfect movie by any means but it's still a pretty enjoyable movie. But again, Why bother waiting until the 6th film of the franchise before finally adding some lore to it?"
    },
    {
      "rating": "3",
      "text": "John Carpenter's 1978 'Halloween' is wholly deserving of its status as a horror classic. To this day it's still one of the freakiest films personally seen and introduced the world to one of horror's most iconic villainous characters Michael Myers.Which is why it is such a shame that not only are all of the sequels nowhere near as good but that the decline in quality is so drastic. Ok, the original 'Halloween' is very difficult to follow on from, but most of the sequels could at least looked like effort was made into them. 'Halloween: The Curse of Michael Myers' is a prime example of this, a film with very little to recommend and just very poorly done in many areas.Starting with the very few good things, Paul Rudd and Donald Pleasance, in his last film before his death from heart failure not long after (although his screen time is far too short and was clearly severely truncated), come off in a good way in the acting department.The exploding head death is a pretty fun one and the setting is eerie. As far as praises go, that is it.'Halloween: The Curse of Michael Myers' was directed by someone who had an apparent dislike for Pleasance, the main reason for his limited screen time most likely, and had no interest in directing the film or the 'Halloween' series in general, and it shows loud and clear on screen. Even the direction in 'Season of the Witch' and 'Halloween 5' wasn't this indifferent or inept.Sadly the effectiveness of the setting, which actually is eerie, is hindered by the filming and editing being pretty amateurish, the photography often is far too dark and drab and the editing makes bacon-slicer-like editing seem coherent in comparison. The music, like the previous film, is here a drawback when it was one of the better elements of the first four films. Here it sounds cheap, goofy and would have sounded out of date even in the 80s most likely.Everything looks, sounds and feels like it was made in a rush and with absolutely no heart, accounting for the constant sense of incompleteness. There is nothing scary or suspenseful, it's unintentionally campy, uncomfortably strange and by the numbers with a convoluted story that makes no sense whatsoever, an abrupt ending, dull pacing and the man in black/cult plot that is just bizarre and just muddles everything. Michael Myers is just not creepy enough and looks goofy.Very like the previous sequel, there is nothing interesting or endearing about the characters (though none are quite as annoying as Tina in 'Halloween 5'). The script especially sounds incomplete and the acting, apart from Rudd and Pleasance (whose screen time, as said, is far too short), is subpar to put it lightly. J.C. Brandy is a pretty poor replacement for Danielle Harris.Overall, don't expect any terror, scares, fear or thrills here, you'll be disappointed. 3/10 Bethany Cox"
    },
    {
      "rating": "4",
      "text": "Halloween: The Curse of Michael Myers. Terrible doesn't mean scary. That is the word - Awfully can be called the final film about the adventures of Michael Myers. It is not at all clear what is at the beginning, and even more, so it is not clear what is at the end. This is the only part that leaves behind a huge number of questions. Why is Jamie Lloyd in a strange place? Why does the boy go into a trance? What happened after the previous film?"
    },
    {
      "rating": "1",
      "text": "Euh.. c'est bien de la merde, c'est inutile, ça n'apporte rien à cette saga, qui meurt depuis le 4ème épisode. Ce 6ème a quand même pour but de faire relever le niveau, j'ai quand même envie de vomir quand je dis ça.. mais quand vous voyez un Halloween ayant comme titre \"La malédiction de Michael Myers\", tu t'attend pas à un culte du cinéma de l'horreur et à un succès. J'ai l'impression que les producteurs insistent beaucoup sur le fait que c'est essentiel de rallonger cette pauvre franchise juste pour la faire souffrir encore plus et la faire tomber à l'agonie. Voilà c'est très nanardesque comme titre, surtout que ça a été recherché par le pauvre Joe Chapelle, réalisateur incompétent nous faisant exhiber sa Filmographe bien médiocre.En faite Halloween 6, ça n'apporte rien oui.. mais si ça a pour but de faire kiffer les amateurs de gore et de continuer dans une linéarité scénaristique faible et à la fois complètement banale. Je me dit qu'on devrait s'en passer et en arrêter là, et attendre 40 ans après pour recevoir l'excellent Halloween 2018, comme ça on garderait que les 3 premiers épisodes, oui j'ai cité Halloween III parce que je l'adore, je suis complètement fan ! et garder ceux de Rob Zombie ^^ Surtout qu'en plus il essaye de rajouter une histoire un peu plus complexe, plus recherché afin de bien faire remplir son contenu et donner un nouveau chemin à la saga, mais si ça devait être original, hum.. c'est raté parce que ça ne sert toujours à rien.. et pk a t-il 6.6/10 sur Metacritic ? C'est pas mérité, c'est de la merde.. ça nous montre que du gore et rien de plus ! bref à éviter !"
    },
    {
      "rating": "2",
      "text": "Halloween: The Curse of Michael Myers was the worst and unnecessary part. This movie was not even needed. They could have easily ended the franchise with Halloween 5. This movie was neither scary nor entertaining. This movie only had bad qualities.The plot was senseless, direction was bad, the traditional halloween music was missing, the characters were okay. There was lack of screen time for Michael Myers and Dr. Loomis. There were too many unanswered questions. It seems even director didn't know in which direction is movie going.Overall, this was one of the worst movie of halloween franchise and you can watch it if you want a good sleep."
    },
    {
      "rating": "5",
      "text": "Michael's not actually bad, he's just possessed by runes or something and there's a cult but he can be stopped by placing rocks in front of him and there's a chance that he fathered a child with his own niece."
    },
    {
      "rating": "2",
      "text": "The movie had WAY too much potential to be what it was. Honestly, the film is like a 4, but I'm rating it lower because it could've been a 10 movie. Jamie Floyd and her arc was probably the best part of Halloween 4&5 (I liked her more than. Laurie). However, they tossed that away with a pointless death scene in the beginning despite being the protag for two straight movies.What? Excuse me? But Why? That moment beginning alone summarizes the rest of the movie. The writing had interesting elements (I know I am in the minority, but I like the Thorn Curse plotline), but it needed more time in general. The plot is unusually intricate, which is unique for a slasher, but it needed to be explained better as it seemed to be confusingly rushed in. As a result, I can only imagine that the people who DO care are scratching their heads at what information was given, and the people that DON'T care are annoyed that you wasted their time with a convoluted plot in a slasher film.The acting was cheap, a good deal of the scenes were cheap, and the beginning was en media res, expecting you just to go along with what supposedly happened between Halloween 5&6. The ending was another \"muh inconclusive\" ending which honestly is just silly as we've been here far too many times. This might just be me, though.Micheal was okay...even if he teleports and now has some weird and unfair sixth sense to find relatives. The kills are nice. So if you're just looking for a dumb, cheap slasher flick, the movie is still good for that. However, there are plenty of other slashers if you're looking for that, as Halloween lost its competitive edge back during 5. Anyways, sorry for seething, but I am just hurt to watch such potential go to waste because the producers didn't want to put the effort, time, and money into a movie that requires high ambition to work."
    },
    {
      "rating": "3",
      "text": "Some great moments of violence. The problem was that the great concept was poorly executed. The story progression is often slow and confusing. Some good ideas emerged though. I just couldn't help but think that this film could have been so much better. Turn it on, sit back and let it happen, it’s fine."
    }
  ]
}