{"id": 1771, "title": "Halloween Ends", "starring": ["Jamie Lee Curtis", "Andi Matichak"], "runtime": 111, "genre": ["Horror", "Thriller"], "description": "Four years after the events of Halloween in 2018, Laurie has decided to liberate herself from fear and rage and embrace life. But when a young man is accused of killing a boy he was babysitting, it ignites a cascade of violence and terror that will force Laurie to finally confront the evil she can’t control, once and for all.", "releaseYear": "2022", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/4TWCHSziUs6vhpUYVAjcIUXSWwv.jpg", "categories": {"plot": 4.041666666666667, "acting": 5.636363636363637, "ending": 4.821428571428571, "soundtrack": 9.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 8.333333333333334}, "reviews": [{"rating": "9", "text": "I love this Movie!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "0", "text": "I signed up for a movie, where Michael Myers just kills his victims in the most brutal way possible but instead I got a love story where our beloved killer only gets less than 10 minutes of screentime. Screw the mfs who wrote this!"}, {"rating": "1", "text": "This is not the way you end Halloween. Michael Myers deserved better. This is terrible, cringy, anticlimactic... Its just bad"}, {"rating": "10", "text": "This movie was **** amazing. Apriciated what they have done and it landed with me. The kills are beutiful and the end of Michael himself is amazing"}, {"rating": "9", "text": "This is something else. ‘It’ is something else.Wow. That was unbelievable. Such a ride from beginning to end. \"Halloween Ends\" is not what I expected. It is far better. David Gordon Green has crafted such a beautiful conclusion in a way that doesn’t follow any of the previous movies. There’s a mystery transcending Mystic. He found a way to craft not suspense, but supernatural evil. Evil and violence as diseases or sicknesses to which any of us may be vulnerable. Maybe that's what made this unsettling. I felt vulnerable.“Halloween Night 2019” appears on the screen. Now, this had me doing mental math for about ten minutes before I inevitably gave up the ghost. \"Halloween 2018\" and \"Halloween Kills\" take place on the same night 40 years after John Carpenter's original masterpiece Halloween. Corey Cunningham (Rohan Campbell) is our babysitter the following Halloween. When you see Laurie Strode that is this year, 2022, four years after Michael returned.Welcome \"Halloween Ends\" with an open mind. It’s slow and steady suspense. As the scent of a candle slowly diffuses throughout a room Halloween Ends transforms into the Halloween, we all know and love.The music will have you wondering if you’re in the right theater. I assure you that is indeed the case. The background music is like something from a cartoon. “What am I watching?” I thought. I don’t recall any Halloween movie starting this way. The movie opens with Corey babysitting for a married couple. Unimaginable tragedy strikes and the aftermath leaves him traumatized to the present day.Laurie Strode (Jamie Lee Curtis) narrates her memoir in progress at home with her granddaughter. Unlike the previous two installments, Laurie is living a normal life. My first thought is, “She is not prepared for Michael.” She has gone from living as a hermit in the woods awaiting Michael’s return to living in a town where she’s ostracized. From the townspeople lies a real sense that Michael is not a force of nature but either a run-of-the-mill serial killer suffering from mental impairment.It is exactly the opposite which makes the shape so disturbing. There is no provocation. And where are these folks getting the idea Michael is impaired and a victim of abuse from Laurie? Absurd.Michael is just evil seemingly transcendent at moments. Four years later, I witnessed Corey struggle with verbal abuse, self-blame, guilt, loss of a promising life & assault. But almost immediately you can tell something isn’t right with him. Something is missing, an emptiness has infiltrated not from the outside but from within. How is that possible? When you watch notice how Corey shifts in demeanor.Allyson (Andi Matichak) has repaired the relationship with Laurie following the death of her mother. Outside of that Allyson is very lonely. Laurie is all she has yet it becomes clear she seeks a romantic partner. LAURIECOREY, PSYCHOPATH OR FREAKSHOWLaurie is Corey’s savior, and dare I say friend when they first cross paths. Only she could empathize with his predicament. Both carry the “babysitter scar” of Michael in unique ways. It is asked, “which one are you freakshow or psychopath?”A game of cat and mouse emerges between the two. In the absence of Michael, Corey fills in as a substitute teacher. He begins to exhibit “symptoms”. Rohan's character grows fascinated by Michael. He is present where the shape would’ve been during Carpenter’s original Halloween. The question becomes not who is Corey but what is he?Notice how he moves from here on out. Let me ask you this: Is the shape Michael Myers as an individual or is it infectious like an idea or sickness?Of course, Michael has to make an appearance otherwise it wouldn’t be Halloween. It is fitting where he’s been chilling all this time. Via a comment made by a homeless man, it’s revealed that Michael has been surviving not in hibernation mode.Michael is aged and rusted in a sense. As he kills there’s a physical revival. Halloween Kills concluded with Laurie stating “The more he kills. The more he transcends.” Well, what does he transcend into? Gordon explores this and allows Michael to strike Laurie closer to home than ever before.Michael has another enemy this go-round. Someone who seeks to take his power. Three epic battles are progressing and concluding at the same time.Overall, Halloween Ends scares in all the right places. It’s unsettling to the core and edges you forward with intrigue. You won’t feel quite right when exiting the theater. G#d help you if you leave into the night.Funny enough as I left the cinema someone yelled out “Is that Michael??!!” The response was, “No, that’s Jarred.”"}, {"rating": "3", "text": "That was just a bullsh*t movie, and not how the series should have ended. _"}, {"rating": "8", "text": "Not the finale I wanted for me but an enjoyable movie by David Gordon green I enjoyed the movie, yes the pacing isn’t great but I enjoy the different take of this movie with kinda 2 Michael meters that was different I like how different this one was but for me personally I enjoy these 3 films I always wished for better character development but sadly we did not but Laurie was the best in this movie but all around an enjoyable movie, not a great finale tho so I give Halloween ends a B- 80%"}, {"rating": "8", "text": "The 4th chapter in the battle of good and evil in the long running saga between strode and myers finally comes its conclusion and ultimate end in this somewhat ok'ish fourthqual.Two movies ultimately mashed together. On one side you have a bullying and then ultimate break down resulting in a satisfying revenge killing on the bullies themselves. Then you have the other part of the movie which is the Laurie vs Michael.Will critics hate this movie? Absolutely they always do.Do I like it? For what it is, yes as a halloween movie and conclusion to the halloween saga that started in 1978."}, {"rating": "3", "text": "This movie is a mess. It takes place 4 years after the last one and absolutely does not feel like it belongs with the other films. A kid who Michael Myers takes under his wing to become the next Michael Myers but then he's just killed off later? This movie is pointless, and the confrontation between Michael and Laurie, very anti-climactic. Very disappointed."}, {"rating": "10", "text": "[Halloween Ends] I kinda liked it. Could've been a much better finale chapter for this trilogy, but overall i appreciate how (David Gordon Green’s) did something very new and took risks. The battle between Laurie and Michael Myers at the end was iconic but short. What matters is that Laurie won."}, {"rating": "2", "text": "When i think that nothing could've been worse than Hellraiser the reboot, comes Halloween Ends, the conclusion of the reboot trilogy or whatever they called it, and all i can say that what a piece of garbage, what a skunk this movie was, this is not a Halloween Michael Myers movie, this is somebody elses movie, 90% of this film fills with possibly the worst on-screen romance couples that i've ever seen in movie, Allyson and Corey relationship is the weirdest, strangest, and stupidest romance couple i've ever seen, it did not work for 1 goddamn second when they are together for me, now i don't care if they make it intentionally to make people pissed off, if that's the case then congratulation you guys did it but that doesn't make me change my goddamn mind that this movie is **** it's **** it pissed me the **** out, all the narration things that Laurie's done was just sound silly, the deaths are not even effect me anymore because of what the **** is happening during the whole ****ing movie, this is an awful stupid romance film with some serial killers in it, where the woman of the couples is a dumb mother****er and the boy is an ugly psychopathic maniac, it doesn't make any sense, Halloween Ends was an insult, it supposed to be a satisfying epic bloody conclusion with of course Michael Myers as the lead of the film and that's not even the ****ing case, i won't spoiled it but you will know when you watch it and you will have the same ****ing question on who's movie is this, and it just became the worst thing that ever came out this year, i'll give my another point just for the last battle between Laurie and Michael Myers, even that super final conclusion of the battle is predictable, Halloween Ends is painful to watch, the other good thing is that i'm watching this movie free at home not paying it to see in the theaters because if that's the case i want my money back absolutely, it's horrible, it's awful, i will forever pretend that this movie never exist, Halloween Ends is just simply the worst movie of the year so far and possibly until the end of the year."}, {"rating": "8", "text": "I really enjoyed this movie. It's quite different from the others. There is a clear message regarding the existence of serial killers."}, {"rating": "10", "text": "The movie was great I loved it ! Everyone has there own opinions about it some liked it some didn’t"}, {"rating": "10", "text": "****Spoiler Review****For those not liking this movie y'all are missing the point. The parallels between Lauri, Michael, and Corey was it was yrs later and people had moved on no longer enraged or fearing Michael which is what gave him strength (explained in Halloween Kills). From the aftermath the town then focused their ire on Lauri. Both Michael (physically) and Lauri (mentally) were left weakened from the experience. Corey who was weak, was bullied but grew stronger after his encounter with Michael and killing the homeless man and the rest of his victims. Michael grew stronger when Corey brought Officer Mulaney in the sewer to be killed (where Michael lived as a homage to the Return of Michael Myers where he was nursed back to health before killing the homeless man who nursed him). After killing Nurse Deb Michael grew slightly stronger the same way Lauri grew stronger once she realized she had to protect her granddaughter from Corey. Corey's intent was for he or Michael to kill Lauri so Allyson (even though she was gonna leave) wouldn't have anymore ties to Haddonfield. With Michael back the town would've forgotten about Corey as being a psycho. In the end Michael wasn't fueled by enough anger or fear to be the killing machine he truly is but still could've killed Lauri who didn't have enough hope left to fight him. Michaels main scene in this movie was just to finish the job and kill the ultimate Final Girl Lauri which was the culmination of all of these movies. Also I think Corey killed that kid Jeremy I don't think it was an accident like it was portrayed in the movie. A Director's Cut will be great for this movie to piece certain things together. This movie'll be a Cult Classic as more people start to \"get it\". Mark my words."}, {"rating": "8", "text": "(No spoilers) I understand if this isn’t what a lot of fans were looking for, but as a lifelong fan who’s seen, honestly, too many Michael versus Laurie movies now, I really enjoyed being surprised by a different kind of story. I loved the new character and really enjoyed how Michael and Laurie had their parts to play. I have a few small complaints that I’ll leave out to avoid spoiling anything, but I think it’s a good ending and gave a fresh thrill to the franchise for me."}, {"rating": "3", "text": "Zum Teil ganz gute Ideen, die aber richtig schlecht umgesetzt wurden. Wenn man schon die Schriftart von Season of the Witch verwendet, sollte man immerhin einen atmosphärischen und GRUSELIGEN Halloween-Film abliefern. Außerdem entschädigen die wenigen guten Kills am Ende nicht für die 90(!)-minütige Wartezeit, welche von Minute zu Minute unerträglicher wird. Immerhin halten die Titel der neuen Trilogie ihr Versprechen ein und der Schrecken hat jetzt (bis zum nächsten Remake) ein Ende. Schaut lieber nochmal Halloween III als für diesen Dreck hier Geld auszugeben."}, {"rating": "0", "text": "i loved halloween 2018... i loved halloween kills but this movie is so bad ... Don't waste your hard earned money just to be disappointed... Stream it"}, {"rating": "7", "text": "Halloween Ends was better then the last one but was for me somewhat of a disappointing conclusion to the stories of Michael and Laurie. The writing was main problem it just wasn't great; the dialogue was cheesy at time, I really didn't like the decision to have the character Corey try to be the new Michael Myers and do the majority of the killings in the movie he basically replaced Michael in the majority of the movie, I didn't love the way Michael died, I liked the fight between Laurie and Michael's fight, but felt it was somewhat anticlimactic with crushing his body, and I didn't like the small screentime of Lindsey and of Michael and Laurie together but I like that they still were able to come up with interesting kills and that they really killed Michael Myers. The performances of Jamie Lee Curtis, Rohan Campbell, Andi Matichak, and Kyle Richards were superb. The special effects were outstanding. Overall I wanted more from Halloween Ends, the conclusion of the Halloween series and the characters of Michael Myers and Laurie Strode."}, {"rating": "9", "text": "Needed Michael on the screen more, hate to see him go. I wonder who the next shape will be"}, {"rating": "3", "text": "Horrible way to end an iconic movie! So disappointed in the direction they chose. It’s like bad acting, low budget and just all around disappointment. Michael Myers and Laurie deserves so much better than this. They should be ashamed of themselves."}, {"rating": "3", "text": "After 12 previous entries, fans deserve a better--more satisfying--conclusion than what's on offer here. John Carpenter's Halloween is a model of narrative economy, succeeding largely on expert pacing and atmospheric dread. From the beginning, the focus is on Laurie and the Shape. The latter assumes a prominent role even when he's off-screen as the other characters either talk about him or allude to stand-ins (the oft-cited 'boogeyman').The team behind this sadly hodge-podge affair take the opposite tack. They try to juggle multiple concurrent plotlines, none of which are especially cohesive or interesting. Contrary to the film's marketing, Laurie isn't even the main character; instead, the focal point (insomuch as there is one) is her granddaughter, Allyson and Allyson's misunderstood love interest, Corey. Their supposed romance is not only dimwitted but stultifyingly dull. Moreover, the Shape barely appears and when he does, his behavior is inexplicable set against longstanding canon. This mystifying choice is compounded by ham-fisted attempts to turn him into a literalized metaphor for the dissemination of evil. Let's just say David Gordon Green is no Luis Bunuel.Unfortunately, these attempts to give the film 'layers' it can't support contribute to the film's overarching aimlessness. For a film that bears the weight of capping off a cult favorite series, it's surprisingly meandering. Characters make decisions without any evident rationale or simply against all reason. The result is a chopped-up mess--and not the kind you'd expect given the genre. Don't get me wrong. I'm sympathetic to the notion of doing something unexpected. But that's about all I can admire about this effort. Its formlessness renders any attempts at real scares or tension moot. Only in the climactic 15 minutes or so does the film find its footing, however shaky. The ultimate showdown between Laurie and the Shape is all-too-simple and brief--hardly the cathartic event fans hoped for. The post-violence coda, which has the feel of an 80s-style Afterschool Special, only adds insult to injury."}, {"rating": "9", "text": "apesar de alguns erros e pouco tempo de tela do Michael Myers, eu realmente amei a reconstrução da narrativa e a progressão do novo \"protagonista\". O filme fecha uma saga com primor e se por um milagre o Corey voltar, a franquia continua tendo um potencial absurdo para se reinventar ainda mais."}, {"rating": "0", "text": "It is really a shame that it took 4 writers to pen this atrocity of a movie. This was not just horribly writing it lack any basic imagination. I sure hope this is truly the end…"}, {"rating": "1", "text": "No suspense, confusing plot, weirdly a romance thriller at best. Some good kills and makeup but this was a let down."}, {"rating": "0", "text": "The plot was forced and was just altogether awful. I didn't think there could ever be a Michael Myers movie worse than Ressurection but they outdid themselves. Michael is only in the movie for like 10 minutes and what could've been a very satisfying end to this particular trilogy timeline, was nothing short of anticlimactic."}, {"rating": "6", "text": "I liked the 2018 one, didn’t’t like Kills and for about 75% of this I liked. There was a pretty cool story and where it was leading to that I somehow enjoyed. But overall not bad, had a decent time with it"}, {"rating": "10", "text": "Es una muy buena película, me gusto el desarrollo de personaje de cory y su historia, sentí el final de la pelea de michael contra lory un tanto mal hecho, siento que debería de haber ganado michael, pero fue una muy buena película y la mejor trilogía de películas de terror,hasta aquí mi reporte"}, {"rating": "0", "text": "This film was written so poorly that it lowered my iq enough for me to end up now living and swinging with chimpanzees."}, {"rating": "0", "text": "There would be more entertainment watching me poop out the large popcorn and crisps i had while while watching this community college written garbage. This film is an insult to Halloween fans and will never ever be cannon to me. Maybe some arrests should be made so less dog excrement such as this is made in future. You'll get more enjoyment watching Rob Zombie Halloween 2 and Halloween Ressurection back to back... everday,  until November 1st, at least they're actually slasher films and not written by a person with learning difficulties. Delete this film from record right now, i'm triggered... and going to rewatch the real halloween films. Up yours David Gordon Green."}, {"rating": "0", "text": "Do yourself a favour and stay away from the cinema at all costs, don't even stream it. 0 is even an incredibly high score for this writing Diarrhoea."}, {"rating": "0", "text": "David Gordon Green should have stayed in sewers after filming along with his script."}, {"rating": "8", "text": "Acabo de salir del cine y aquí voy. De toda la saga esta entrega FINAL es la más divisiva de todas, tiene serios problemas de ritmo y a nivel argumental empieza siendo muy errática e irregular, te plantean de manera muy positiva la evolución de los supervivientes lo que hace que uno se pregunte el como se sobrelleva un ataque homicida en tan poco tiempo hasta que llega el momento en donde todo comienza a descarrilarse. Algunos la amarán, otros la odiarán al extremo y por un instante podrán empatizar con todos los que vieron Viernes 13 Parte IX en su momento, pero con la diferencia de que ENDS sabe redimirse y con un demonio que lo logra, el tercer acto es épicamente satisfactorio."}, {"rating": "0", "text": "First off it’s a 53 minute build up. Not a lot of kills and the ending sucks. Basically they should’ve kept Rob Zombie. And Micheal was old AF in this movie…"}, {"rating": "6", "text": "I have to start off by saying a 6 is me being VERY generous. I appreciate them trying something new but it just doesn't work in my opinion. The 1st hour and a half of the movie isn't really even needed. Don't even get me started on the awful ending. The 1st movie of this \"reboot/continuation\" was by far the best, they should have ran with that ending and had Michael pull Laurie into the fire."}, {"rating": "0", "text": "This is one of those films that if you manage to finish it, you're asking yourself, \"What were they thinking?\"Halloween Ends is supposed to be the final in a new trilogy to the Halloween franchise. The first two films weren't terrible, but this last one goes completely off the road with what's expected from a Halloween flick.They took the focus from Michelle Myers and instead decided to spend most of the movie on a relationship between two victims and the psychological effect Michelle had on the town of Haddonfield.Myers finally makes his appearance, much later than he should have, to reveal that he is badly beaten and injured from his last encounter and I guess he now has the ability to psychically control people? How does that even work when most of the other films establish he is more of a force of nature than anything else? He always gets back up, that's what makes him dangerous.Eventually the entire town gets together to basically funeral march Michelle down to the local dump to throw his body in a grinder. Even though the movie spent a majority of it's time reinforcing the idea that people either don't believe in Michelle or blame his family for what happened. It's weird and surreal, especially given the context the film provides. Seriously, this film is a mess. Hopefully some day someone will get their hands on the franchise and do it some justice."}, {"rating": "0", "text": "I will never understand how anyone would like this. I though Halloween Kills was bad, but this takes the cake as the worst horror possibly ever. I wish I could unsee this. I hope Michael comes back and kills anyone involved in this trash movie, it would be more kills and more entertaining than this fake \"horror\" film."}, {"rating": "2", "text": "Terrible. The Halloween reboot had so much potential, and I truly didn’t think they could do worse than Halloween Kills. But somehow they succeeded. The plot was all over the place, the characters were thin and without direction. Laurie was embarrassing…here she was in. Halloween, essentially a nutcase trapped in her mind and her house even thought Michael is locked away, and now he’s free and she’s baking pies and writing a book? I’d love to meet her therapist."}, {"rating": "3", "text": "Halloween does indeed come to an end, but unfortunately, so does the franchise's dignity. This movie triumphantly shows its new OC, Corey as the successor to Michael but also doesn't treat Michael with the same amount of menace or respect we've come to known him in other films. Rather, it has Michael merely as a concept and an idea that we as the audience, must project the idea that evil is not the Boogeyman, but a transferrable virus caused by our nurture. Michael contradicts this idea and is evil by nature. Therefore, the film treats him as a disposable entity, contradicting the themes in Halloween 2018 and Ends. This movie tries further to be more subversive and reject Michael but in the end, can't hold enough of its plot to find proper pacing, a consistent message and enough screen time for Michael to have any impact or menace. A very poor movie indeed. I like Corey as a character, but not at the cost of him becoming an object for the film's message about society being corrupted by violence and pain."}, {"rating": "2", "text": "Straight trash . I was bored for most of it and the fact that the film makers basically made Michael a push over in this movie is just sad ."}, {"rating": "2", "text": "What a disappointing finale to Jamie's final appearance as Laurie. It feels like the director didn't have any story in mind for the conclusion of Michael and Laurie so brought a random character to pad the time. This doesn't remotely feel like a Halloween movie and instead feels like someone shoved another movie into it. I'm angry at the director for thinking this story was acceptable. Halloween H20 and even Halloween (2018) were a better finale to the franchise than Halloween Ends. I recommend just watching Halloween (2018) and not even bothering with Kills and Ends. Halloween Ends fails to deliver a proper satisfying finale while being a movie with a lot of missed opportunities. Michael should've just died in the fire because this is lame and disrespectful."}, {"rating": "8", "text": "The movie was amazing imo. I loved the execution of a lot of the ideas and story in the movie."}, {"rating": "8", "text": "A departure from the last two movies. We see Michael's protege doing most of the killing. While we don't see Michael Myers as much it goes to show that evil is everywhere and anyone can take form of the shape. A decent ending to this trilogy closing the final chapter on the saga between Michael Myers and Laurie Strode."}, {"rating": "2", "text": "A baffling and befuddled attempt to reset a trilogy at the 2/3 mark. Introducing and executing a new central character to the storyline was tone deaf ."}, {"rating": "0", "text": "Terrible. Seriously just terrible. A terrible trilogy capped off by the worst film of the franchise. Resurrection is better than this."}, {"rating": "1", "text": "I don’t know who thought this story was a good one to tell and wrap this trilogy up neatly, but everything here is awful, unsatisfying, and unnatural as can be. My man Michael Myers gets crapped on for the entire hour and fifty minutes. I thought Halloween Kills was mediocre because it was purely a stepping stone to what would be a triumphant end - nope; just two lackluster flicks back-to back."}, {"rating": "3", "text": "An insultingly bad send-off to an otherwise enjoyable franchise. They should've taken an extra year or two on this movie it really needed it."}, {"rating": "7", "text": "Honestly, it was not as bad as the reviews have said. You need to not watch this expecting Oscar-worthy performances. Watch this as just another Halloween slasher movie & a continuation of the Lori saga. The story continuation itself was excellent, JLC's acting was fantastic, & while it wasn't much of a hack & slack film like most of the previous ones (I didn't think the last one was very scary either) it was still an average movie worth watching. If I had to classify this as anything, it's not a typical horror movie, I'd consider a new sub-category: horror-drama. That's what most of this & the previous film seemed like to me."}, {"rating": "3", "text": "I get what they were going for here, and I appreciate the attempts to shake up the formula, but it just didn’t work. Takes too long to get going, and once it does the kills are lame and the ending is pretty bad. Weak way to end a solid-enough reboot trilogy."}, {"rating": "0", "text": "You literally can't get bigger garbage than this, makes Rings of Power a 10/10 masterpiece. I want a refund NOW."}, {"rating": "1", "text": "As a movie on its own, it's boring, confusing, and convoluted. As a movie in the Halloween franchise, it's actively insulting. It is not a slasher movie, first off. Michael Myers is barely in it, the kills are largely off-screen, and there's no one to care about character-wise anyway. Everyone is an idiot or a jerk.Also, it makes you wonder why this was a trilogy when it had nothing to do with the previous entries. I'd watch Halloween Resurrection every day for a month before I watched this again. F this movie."}], "recommendations": ["halloween_kills", "friday_the_13th_a_new_beginning", "friday_the_13th_part_2", "halloween_ii", "halloween_5_the_revenge_of_michael_myers", "saw_3d", "halloween_resurrection", "jason_goes_to_hell_the_final_friday", "halloween_h20_20_years_later", "halloween_iii_season_of_the_witch", "hellbound_hellraiser_ii", "final_destination_5", "spiral_from_the_book_of_saw", "final_destination_3", "texas_chainsaw_3d", "halloween_4_the_return_of_michael_myers", "friday_the_13th_part_iii", "friday_the_13th_the_final_chapter", "saw_ii", "jigsaw", "a_nightmare_on_elm_street", "the_strangers_prey_at_night", "halloween_the_curse_of_michael_myers", "saw_iii", "saw_vi"]}