{
  "id": 1002,
  "title": "Halloween 4: The Return of Michael Myers",
  "starring": [
    "Donald Pleasence",
    "Danielle Harris"
  ],
  "runtime": 88,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "The apparently comatose Michael Myers is being transferred from one hospital to another, but he wakes up when the ambulance crew talk about his surviving niece, Jamie. After slaughtering his attendants, Myers sets out to find his one living relative who is, fortunately, being cared for by a kind and resourceful foster sister named Rachel. Meanwhile, the ever-cautious Dr. Loomis remains on the killer's path.",
  "releaseYear": "1988",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eFSOkXF9n9hsfGv45MDsPixiOyx.jpg",
  "categories": {
    "plot": 6.611111111111111,
    "acting": 7.6875,
    "ending": 8.166666666666666,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This is very much a return to form for the franchise and remains one of the best of the franchise IMO. Everything works, Everything just clicks. I love it."
    },
    {
      "rating": "10",
      "text": "\"Halloween 4\" stands with the original \"Halloween\" on my list of favorite Halloween movies. The storyline to this film was fantastic. The acting was brilliant. Too bad that we didn't hear much from Ellie Cornell after this movie and Halloween 5, but she is a fantastic actress. Danielle Harris's portrayal of Jamie Lloyd, Laurie Strode's 9 year old daughter is what makes this movie my favorite. Brilliant actress. And of course, Donald Pleasence never ever disappoints."
    },
    {
      "rating": "8",
      "text": "Is it as good as the first one? No. Is that a fair statement? No. Halloween II did its fair share to distance the franchise from its brilliant roots, and with no Carpenter on board, H4 didn't stand a chance to fully right the ship. That said, it got plenty of things right; this is probably the best of the many, many sequels in the series. Can't say I was crazy about Michael's mask in this one, and the opening murder scene is too much of a stretch, even for this kind of movie. On the plus side, the atmosphere and viewer psychology of the first movie are back; the traumatized town in a blackout makes an awesome setting, and there is a better balance of scare scenes versus down time, which tricks you into letting your guard down in time for big moments. And even though I was never that crazy about the ending, it is undoubtedly a clever attempt at bringing the franchise full circle. Of all the different canons of Halloween out there, the I-II-4 trilogy is the best, as long as you pretend that 5 and 6 never happened."
    },
    {
      "rating": "7",
      "text": "Good movie. . . all of you need to stop being so b!tchy.\r.................................................................................................."
    },
    {
      "rating": "9",
      "text": "In my opinion the best sequel of the series even though we're supposed to believe Myers grew his eyes back after being shot out in the last sequel. Besides that its pretty damn amazing. Myers returns in strong form cementing his position as one of cinemas greatest villains. Picking up over ten years after the events of the first two films. Laurie Strode has passed and left her daughter behind. A new family is fostering her and Michael returns home and will stop at nothing to get to her. The performances are solid all around but Ellie Cornell as Rachael makes one hell of a final girl. However the MVP goes to Danielle Harris as young Jamie. It's truly one of the best genre performances ever. The movie also has some thrilling stalk scenes including the best scene in any slasher film, the rooftop chase. All in all it's a well paced, suspenseful franchise sequel best."
    },
    {
      "rating": "10",
      "text": "My favorite \"Halloween\" movie. I think it was very creative and twisted and just beautiful. I loved it very much! The actors and actresses were great, especially Donald Pleasence and Danielle Harris. Check it out."
    },
    {
      "rating": "10",
      "text": "..................................................................................................................................................scary as ****"
    },
    {
      "rating": "10",
      "text": "The intro alone sells the movie,the story,soundtrack,acting,directing was all very well done,a great sequel to great horror franchise,check it out,and enjoy!"
    },
    {
      "rating": "10",
      "text": "after the halloween 3 which was a confusing film , which i did not understand why they made a trilogy with out Micheal Myers , Now halloween 4 returns an shoves it in are faces which actually makes us feel better and we can forget about halloween 3. the story didn't piss me off its actually a character of Laurie Strode's daughter in the film which was actually shocking  but she have done better ? ..... YES. But its still well same its deals with rage , sex killing scene which sucks and dumb Myers resurrecting. Grade A"
    },
    {
      "rating": "7",
      "text": "I think Halloween 4 is decent. The main characters are great and a few of the scares and kills are nice, but the rest is just ok to me.And who the hell wrote in 4 idiotic truckers acting like their the police, shooting innocent people?! That's just really stupid"
    },
    {
      "rating": "9",
      "text": "Halloween 4 the return of Michael Myers Is a good movie to return to Michael Myers the pros in this movie are Jamie And Rachel Of course Lommis is the best part of the Halloween movies Michael Myers I like also but the one thing I hate at the end his shoulders are boky so it looks weird I actually don't mind the mask too much it is bad at first The cons Brady is not that good and there are some story problems of this movie All round Halloween 4 is a good return to Michael Myers So I give Halloween 4 The return of Michael Myers a B-"
    },
    {
      "rating": "0",
      "text": "Only 2 words can describe this movie, it sucked. A monstrous disappointment. Wait, no it ain't! the second, third, 4th and so on Halloween movies sucked! The first was great, don't see the rest."
    },
    {
      "rating": "6",
      "text": "A very mediocre yet entertaining piece of the franchise from the late 80's. While it was nice to see the franchise get back to its roots by brining Myers back, it's weighed down by a forced plot and some extremely cheesy moments. Pleasance as Loomis keeps it most interesting when even some of the scenes with Myers are just plain stupid. Overall it's ok at best but very forgettable."
    },
    {
      "rating": "6",
      "text": "After being shot, blinded, blown up & set on fire Michael took a little R&R and has now come back somehow by reasons not quite explained for Halloween 4. Obviously this movie was made to milk Halloween for whatever credibility it had left as a franchise and it fails to reach the heights of the first one or even the 2nd one. That being said, Halloween 4 is by no means a bad movie, its still quite watchable. Laurie Strode is gone but Dr. Loomis returns again somehow, though played expertly by Donald Pleasance. The other 2 leads, played by Ellie Cornell and Danielle Harris are incredibly well acted and along with Pleseance help carry the movie well. All in all, its not a bad movie by any means its just not that good either."
    },
    {
      "rating": "9",
      "text": "The most under-rated of all the Halloween sequels and in my opinion the best sequel of them all. It still falls into the gore hound trap that was started with all of the original Halloween imitators out there as a way to compensate the lack of suspense of the original. Donald Pleasance offers his gravitas to Dr. Loomis and grounds the entire production giving it the tie in to the original two movies. It is a shame they could not get Jamie Lee Curtis back for this chapter, but the character of Jamie Lloyd gives a new face to the victim and provides an ending that still, after all these years gives me chills to watch. It is a crying shame that they chickened out with further sequels to take the franchise in new directions laid out by this movies ending with two absolutely atrocious sequels after this one. As far as I am concerned out of the original Halloween 6 movie franchise there is the original, II and 4."
    },
    {
      "rating": "7",
      "text": "This movie was never going to be as good as the original, but thats expected. However, that doesn't mean that its not a good film. It was good for a fourth installment. The story has shifted from Lori Strode and that added new elements to the film. Loomis is back and is doing a good job as always. Overall, it was a good effort and is one of my favorite slasher film sequels."
    },
    {
      "rating": "6",
      "text": "Perfectly fine. The police force actually responding to Loomis's insanity right away is a nice and welcome realistic touch. It's a subtle and yet completely innovative plot point. How often do police take the crazy theories in these movies seriously and do something about it?"
    },
    {
      "rating": "10",
      "text": "this is way better than Halloweens 1 and 2."
    },
    {
      "rating": "6",
      "text": "This movie is alright, I think that either:Halloween II- Halloween 6 or Halloween:Resurrection are the best. This one could be a lot better. I don't hate it or anything, it just could have been a lot better."
    },
    {
      "rating": "6",
      "text": "This is one of the better Halloween movies. It isn't perfect, but I really like it. The only real complaint I have is that Michael Myers is all bulky like a football player and his mask looks really cheap."
    },
    {
      "rating": "7",
      "text": "The 4th movie is as good as the 2nd but not as good as the original. But the acting is kinda corny and the scares are good but not as good as I wanted to be."
    },
    {
      "rating": "6",
      "text": "It’s OkayDespite being not on par with the first 2, 4 is better than 3 in this case."
    },
    {
      "rating": "7",
      "text": "I wouldnt say its great but its still decent. The new characters are kinda like able. Its a good movie okay? It is scary and it returned to Michael Myers instead of Season of the Witch."
    },
    {
      "rating": "5",
      "text": "Halloween 4 had potential but it failed. The movie had all the elements which made first part masterpiece but these elements were not effective in this part mainly due to less interesting story, less suspense, plot holes, senseless screenplay and bad direction. It seemed like director didn't do his homework. He made Myer's tall, healthy and his mask was also little bit different.Only good thing was the performance of Danielle Harris who plays Jamie. She plays the character with complexity, fear, determination, and desperation so well.If you're a fan of the original Halloween, you will like Halloween 4 to a certain degree. But just like many sequels, it cannot live up to the original."
    },
    {
      "rating": "8",
      "text": "A nice effort, especially considering it is part 4 of a horror series. One of the best of the sequels, however I would rate it 4th in line behind the original, part 2, and H20. A definite WTF ending (which I thought was pretty corny in all honesty), but for the most part pretty well executed. It did seem to lack some sort of intensity present in the earlier sequels however. Definitley seems to be a pretty well received sequel judging by the other comments, and I too would recommend it."
    },
    {
      "rating": "7",
      "text": "A pretty good and enjoyable sequel. even if it's a little campy at points, Halloween 4 is at least a major improvement over it's ludicrous predecessor Halloween III: season of the witch."
    },
    {
      "rating": "5",
      "text": "Although the whole idea of Michael Myers is getting tedious at this point, there is no denying this film is well-made.  For having a \"4\" tacked on the end of it, it's really not bad.  It maintains a foreboding and ominous mood throughout, and does a good job at convincing you of the time of year (moody lighting, foggy streets etc.).  Another thing it has going for it is a pretty creepy ending.  The atmosphere alone makes it a good halloween-time rental, but it's all been done before."
    },
    {
      "rating": "4",
      "text": "Acting was ok but the kills were pretty generic and I expected better. Also i find it really hard to believe that a full grown man couldnt outrace a little girl. I love Halloween but my god, Its just so stupid at times."
    },
    {
      "rating": "3",
      "text": "The Return of The Shape! Long awaited by fans, and long scorned by critics as squandering any praiseworthy qualities of the first two films, Halloween IV manages to revive the series by revealing a new character that was later abandoned in the true successors to the originals (Halloween VII, Halloween VIII). While it does at least attempt to provoke some fear, it is through great time wasted that those few seconds of fear are brought. A  race through across the rooftop is literally the only memorable scene in this abysmal film. While not as weak and boring as the sixth installment, it does lack the enthralling camp of the fifth film, or the second to continue this direct plot."
    },
    {
      "rating": "5",
      "text": "I thought it was ludicrous to create a sequel of the original two featuring the daughter of Jamie Lee Curtis' character. This was not badly filmed and the death scenes made me jump, but overall was not a great plot and seemed like a typical 80s slasher."
    },
    {
      "rating": "6",
      "text": "Obviously a step down from the original and even from Halloween II. H4 revives Michael Myers who was AWOL in HIII: Season of the Witch with gimmicky and clichéd plots. The themes present in H4 are mostly borrowed from the original, which isn't a bad thing, but without Jamie Lee Curtis or John Carpenter's involvement everything just feels a bit tacked on. Donald Pleasence's return as Dr. Loomis makes is bearable to watch, but just barely."
    },
    {
      "rating": "5",
      "text": "Halloween 4: The Return of Michael Myers. It would be better not to come back. Unfortunately, a very weak sequel to the previous two films. The plot itself is very good, but the behavior of many characters is just horrible. But this part is much better than Halloween III."
    },
    {
      "rating": "8",
      "text": "Great, halloween sequal really compares to the original. One of the bests of the franchise."
    },
    {
      "rating": "5",
      "text": "Michael wakes up because he has a niece and now, he needs to go kill her but in the end, she gets possessed by him and stabs her step-mother."
    },
    {
      "rating": "4",
      "text": "Everything about this film is just a big dissapointment, new mask of Michael Myers looks awful, kills are not showen to the viewers, story just in classic film so... Nothing new, nothing to watch."
    },
    {
      "rating": "10",
      "text": "1988's Halloween 4 is definitely one of my favorite Halloween films. Good acting, fun kills, likeable characters, etc. A must-watch"
    },
    {
      "rating": "8",
      "text": "O filme é bom,sem dúvida é uns dos melhores da franquia,mas não mais que o 1 e o 2,fico triste ao ver as pessoas falando que esse filme e ruim,pois sem dúvidas o 3,o 6 e o ressurreição são piores,acho que se não fosse a máscara do Michael myers que é zuada,as pessoas teriam uma melhor visão sobre o filme,pois é um dos filmes da franquia que mais tem terror."
    }
  ]
}