{
  "id": 89,
  "title": "Hancock",
  "starring": [
    "Will Smith",
    "Charlize Theron"
  ],
  "runtime": 92,
  "genre": [
    "Fantasy",
    "Action"
  ],
  "description": "Hancock is a down-and-out superhero who's forced to employ a PR expert to help repair his image when the public grows weary of all the damage he's inflicted during his lifesaving heroics. The agent's idea of imprisoning the antihero to make the world miss him proves successful, but will Hancock stick to his new sense of purpose or slip back into old habits?",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7DyuV2G0hLEqHeueDfOqhZ2DVut.jpg",
  "categories": {
    "plot": 5.625,
    "acting": 6.928571428571429,
    "ending": 6.733333333333333,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 6.0,
    "funny": 6.411764705882353,
    "action": 6.7272727272727275
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The story was weak in a lot of places, however, the acting and over all entertainment factor made up for the missing content to a certain extent. Now THIS is a film that begs for a remake with a more fully fleshed-out script and better plot and character development."
    },
    {
      "rating": "5",
      "text": "As a satire and comedy it is hilarious, as an action movie - the special effects were awesome, but the story was pretty damn weak after the first half of the film. I can see why it got somewhat poor reviews - it's worth seeing purely for the comedy though."
    },
    {
      "rating": "8",
      "text": "is an hilarious twist on the modern-day version of a superhero. He destroys cities while fighting crime, and he is often intoxicated during the process. He is rude and crass to everyone he meets. Does this guy need help? Sure, and its going to be a great experience to watch."
    },
    {
      "rating": "4",
      "text": "presents an interesting premise, but is disappointingly messy in its delivery. The film simply tries to be too much at once. The first half has a huge focus on humour, and while somewhat entertaining, the jokes are cheap and crude. In the second half  abruptly turns into a painfully lame melodrama. I felt the romance element between Charlize Theron and Will Smiths' characters was totally unnecessary. Jason Bateman steals the show and is one of the few redeeming factors in this mess of a film. Let's hope that the upcoming sequel has a better idea of what it wants to be and gets the formula right this time."
    },
    {
      "rating": "5",
      "text": "\"Hancock\" has a great super start with a interesting premise. However as the movie progresses, you soon know the movie's worthless."
    },
    {
      "rating": "2",
      "text": "Some say that Will Smith makes anything watchable, and in most cases I'd agree. Not so with **** It's the inconsistency that gets me - it really doesn't know whether it wants to be a relatively dark origins story, or a comic take on superhero conventions, or a social satire. It tries to be all of these, and therefore fails to be any of them. It's not dark, funny or clever enough. Will Smith's charisma and some nice effects can't hold up the car crash of a screenplay or make the \"twist\" in the last act even remotely surprising. It's just not very good."
    },
    {
      "rating": "7",
      "text": "I am so torn with scoring this movie. It was like two different movies. The first half was great but then it took a sharp turn in a different direction and for me kind of got stale for me. I would give the first half a strong 7 but the second half a low 6. Will was great and I loved Bateman too. The last half of the movie simply left me feeling unsatisfied."
    },
    {
      "rating": "9",
      "text": "Whenever I first watched this movie, I just thought wow! Why I like it is because it's unique to other superhero movies. One of the best films I ever watched."
    },
    {
      "rating": "10",
      "text": "Great comedy/action/etc!!"
    },
    {
      "rating": "0",
      "text": "No. Just no. HORRIBLE execution. Don't let them steal your money!"
    },
    {
      "rating": "3",
      "text": "Thank God i finally have a reason to punch Will Smith in the face, not to count the pointless story."
    },
    {
      "rating": "8",
      "text": "Definitely one of the better of Will Smith's last few movies. Its a nice twist as compared to most mordern day Marvel/DC movies at this day and age. Will Smith plays the title character with a certain charm and charisma yet at the same time brings depth to Hancock. Some story elements aside, Hancock is a good time for those who enjoy action with a nice sense of satire when it comes to super hero movies."
    },
    {
      "rating": "10",
      "text": "It's an awesome superhero movie! Who knew that a woman was his kryptonite!"
    },
    {
      "rating": "0",
      "text": "Seriously a wast of time and money seeing this Hollywood churn style of atypical and poor movie making. All hype and no style. This movie has set the African American community back fifty years with it's pathetic plot and characters.. Maybe BET can do something with it."
    },
    {
      "rating": "8",
      "text": "For the first 65 minutes of \"Hancock,\" I was ready to give the movie a perfect 10. We saw great action, strong performances from the leads, original storyline, thought-provoking themes, and a great twist. But then at the climax, the film went down hill. The villain came across too much as a plot device than a real character, and the explanation of Hancock's powers gave me the \"that's it?\" reaction. So because of those two things, I have to bring the rating down by two notches. Still, it is worth the price of admission and worthy of a sequel/prequel and buying on DVD."
    },
    {
      "rating": "8",
      "text": "Clever and fun with good pacing and effects. Charlize Theron plays it cool as a cucumber and Will Smith brings some real heat to this movie. For some reason, Will Smith's recent action movies haven't gotten the lovin' they deserved. This one deserves plenty."
    },
    {
      "rating": "0",
      "text": "This movie blew harder than Will Smith did while trying to get the roll. The twist was sh*ttastic, and the plot was stupid. Smith played himself at a bachelor party, and Charlize Theron was just a lazy bystander who added at least some amount of talent. Jason Bateman was the only shinning part of this hell ride. Effing worst film of the year. Well, just above Disaster Movie."
    },
    {
      "rating": "10",
      "text": "LOVED this movie. I don't understand why it has received so many poor reviews. It was really entertaining and not just the same old superhero type of movie, I think it was a cut above the rest and can thoroughly recommend it to anyone looking for an hour and a half of fun escapism."
    },
    {
      "rating": "6",
      "text": "Smith's self affliction gets old pretty soon. as does the plot, mired in its own indecisiveness. was this really the spawn of the watchmen chronicles? its either a weak morally charged story that forces introspection, or its one of those weak summer action pseudo cutesy comedy with a vintage penchant for tepid plot structure. pick one and you may be marginally satisfied. trying to squeeze both in doesn't fit and makes for a luridly awkward story."
    },
    {
      "rating": "10",
      "text": "I thought it was one of the funniest movies ive seen in years alot better then these dumb criticts are beter then other movies theve reviewed like zohan are you kidding me that got a 54 and hancock a 48 zohan was garbage worst adam sandler movie ever made im sorry hancock deserves a way better score i personaly give it atleast a 98 the movie was great it was fun entertaining and full of laughs i recomend everyone to go se this movie screw the criticts the dont know anything."
    },
    {
      "rating": "8",
      "text": "70 min of great movie, 20 min of mediocrity. Still, one of the great summer movies this year, not that that says much."
    },
    {
      "rating": "7",
      "text": "Enjoyed this a lot more than I thought I would. Listen people. It's summertime. Movies are supposed to be fun. This one is. And the acting is actually pretty solid. Funny? Exciting? Visually stimulating? Check, check, and check. I found myself wondering how Iron Man got such strong reviews while Hancock seems destined for critical mediocrity, and the simple fact that the thought even entered my mind should tell you all you need to know. Do yourself a favor and drop ten bucks to see this flick, because all the action translates best to the big screen."
    },
    {
      "rating": "3",
      "text": "I am a huge Will Smith fan and have seen each of his 4th of July Mega movies, but this Hancock is terrible. The story line was ridiculous and boring. I wanted to walk out and leave the other five people who were suffering thru this as well. Will's choice in appearing in Hancock seemed to be a \"must\" do movie even if it is bad. He has to do better to keep his loyal fans happy. Hey, we stuck with him after that Wild Wild West disaster."
    },
    {
      "rating": "9",
      "text": "This movie is well worth your time. I am a huge will smith fan, but skeptical of this role. I didn't think this was going to fit him, but I was wrong. Will smith is spectacular, along with opposite Charlize Theron, and suprisingly well Juno co-star Jason Bateman. A must see amongst all movies this summer."
    },
    {
      "rating": "8",
      "text": "You really have to judge for your self. Its a good movie. Love the mix of comedy, drama, and action; but i wish it was longer. Unique storyline. Would watch it again."
    },
    {
      "rating": "3",
      "text": "This movie was a piece of .....literally. The story was horrible. Not even the good actors/actress made it any better.....just not a good movie."
    },
    {
      "rating": "8",
      "text": "A really interesting twist of ideas combined with decent acting and cinematography. Not bad at all."
    },
    {
      "rating": "10",
      "text": "I dont care what critics think, i watch a movie and decide for myself. Sometimes critics dont know what their talking about. I think they just watch to many movies in the long run and are unhappy with their jobs. I loved this Movie and want to watch it again."
    },
    {
      "rating": "8",
      "text": "I was pleasantly surprised by this movie. Action is good, comedy is spot on, and good performances all around. I recommend seeing it."
    },
    {
      "rating": "6",
      "text": "What the hell was Peter Berg thinking? The first 50-55 minutes of this film was brilliance. Pure brilliance. Not soon after, Berg lost his mind. It's as if they brought in M. Knight Shyamalan to write and direct the final half hour of the film. The first hour was memorizing. The script was extremely amusing and tight. The last half hour was a piece of cow dung. As a movie that had forest fire potential, it faded to nothing more than an also ran."
    },
    {
      "rating": "9",
      "text": "Nice twist,critics are stupid.Not much of a family movie,but it was good.Very funny good to see a super hero movie without marvel and dc."
    },
    {
      "rating": "5",
      "text": "David Denby compares the chemist of Smith and Theron to Bogart and Bacall...Is he on crack? The abrupt plot shift is a wtf moment that did not ring true, almost like it was two plots combined in one movie...multiple writers? Iron Man and Hulk are much better."
    },
    {
      "rating": "9",
      "text": "I really enjoyed this movie. Good story, good acting. I guess the professional reviewers think they know better about how to critique a movie, but they missed the boat on this one."
    },
    {
      "rating": "6",
      "text": "I didn't care much for Hancock. Here's a guy with abilities normal people can only dream about and he spends 80 years moping around and acting like a jerk. It's not fully explained why he acted like a jerk for so long or how he acquired his super powers in the first place, but no matter. Things get destroyed, and it's fun to watch. We even get several chuckles along the way courtesy of Hancock and his PR specialist (Bateman). Late in the story, we finally learn of the interesting history between Smith and Theron's respective characters--a dynamic which should have been explored and explained a bit more. Instead, we're taken straight to a final underwhelming showdown (one where Smith makes his super-emotional, pursed lipped Oscar face) and a somewhat predictable resolution. In other words, Hancock moves too quickly from climax to conclusion. (That's what she said. Ha. Ha.) It was good for me, though."
    },
    {
      "rating": "4",
      "text": "First 1/2 is pretty good, (otherwise this movie would get a 2). The twist has to rank as one of the most pointless and unnecessary in all of history. Second half is one of the sappiest, poorly written, focus group tested films in recent memory. Blech."
    },
    {
      "rating": "5",
      "text": "Over all this movie was ok. The flying could have been done a lot better every time will smith jumped off something is looked like he is 100% CG."
    },
    {
      "rating": "3",
      "text": "Should have been rated R we walked out after 15 minutes due to the excessively foul language."
    },
    {
      "rating": "6",
      "text": "Don't get me wrong. as Debbie (Leslie Mann) in Knocked Up plaintively put it, \"I LIKE Spider-Man\"...and Iron Man, and Hellboy...given that every third summer action movie of the last few years seems to have been a superhero flick, what choice do I have? But as enjoyable as many of the big screen Big Two adaptations (DC and Marvel) have been, I mostly prefer my zap-pow-crunches to be delivered from outside the box, because lesser-known adaptations and original screen creations can devise their own mythologies and ask questions that fanboy pressure can bar the established brand names from doing. I loved Pixar's The Incredibles, which examined the life of a superhero family whose powers were not only unappreciated but outlawed, M. Night Shyamalan's Unbreakable, which demonstrated how painful the life of a man who doesn't experience serious injuries can be, and the vastly underrated Dark Horse adaptation Mystery Men, an often hysterically funny and surprisingly rather sweet treat dealing with folks who have no superpowers whatsoever but conduct themselves as though they do. And I WANTED to love Hancock, but here's an example of a movie that would actually have done well to have been a bit LESS ambitious. The title character (Will Smith) is a drunken, self-loathing misanthrope who raises curmudgeonliness to the level of near-psychosis, and whose superhuman acts are roughly equivalent to a Boy Scout who not only drags a little old lady across the street who doesn't want to go, but gets her hit by a car in the process. Clearly a public relations makeover is in order, and the nicest PR man in film history (Jason Bateman) is up to the task. We know most of this from the trailers, and it's mostly amusing; had Hancock stuck to this simple but sturdy premise, we all would have fared the better for it. Unfortunately, there is the matter of the much-whispered-about Big Twist, which is not only notably jarring but seems like a cheat because the moviemakers provide too few script clues ahead of time to let the moviegoers have the joy of doing the math. (I sort of halfway figured it out in advance, but only by realizing that one big-name cast member was suspiciously not being given enough to do, looking at my watch, and saying to myself, \"I'll bet THAT changes soon!\") Moreover, the shakeup leads to a series of climactic, big-scale action set pieces that director Peter Berg (The Kingdom; the agony-of-defeat anti-sports flick Friday Night Lights) is incapable of staging or shooting. Robert Wilonsky accurately described Berg's directing style as angry; his first behind-the-camera effort was his best by far--1998's uncompromising, bracingly offensive and very, very funny Very Bad Things, but Berg's problem is that he films every subsequent movie he's made the exact same way, whether the material calls for it or not. What Hancock DOES prove, however, is Will Smith's unassailable charisma even when playing a totally unlikable character; small wonder he's known as The Man Who Owns July 4th. Smith is great at taking mass audiences to places that maybe they'd rather not go without him; he made 2006's punishing and depressing The Pursuit of Happyness that Christmas season's second biggest hit. As unsatisfying as Hancock's third act is, Smith still deserves credit for roping in $200 million for a movie that by all rights should've had shorter legs than the director of Iron Man ended up with at the end of Very Bad Things. Hey, did I mention that that one is STILL Peter Berg's best movie?"
    },
    {
      "rating": "3",
      "text": "This movie didnt know what it wanted to be it started as a comedy with a few decent jokes here and there, then it went all drama, then action. i couldnt keep up. in aword: awful."
    },
    {
      "rating": "9",
      "text": "This was the best superhero movie of the summer only behind Dark Knight. Really this was a fantastic twist on the genre and it worked not too mention Will Smith is simply amazing in these big summer epic roles!"
    },
    {
      "rating": "8",
      "text": "Oh come on, the movie isnt THAT bad. Sure, the plot's thin, and the characters are un-developed, but it's enjoyable on the whole. The twist doesnt really ruin the movie at all, but it was a bit sudden. A good movie, with plenty of funny moments."
    },
    {
      "rating": "4",
      "text": "Started out as an enjoyable action-comedy, then completely falls apart at the plot twist, becoming dismal and plodding. The jerky hand-held camera work grows old quickly, and is a gimmicky contrived annoyance, making some shots annoying to simply watch. One of the worst endings ever."
    },
    {
      "rating": "9",
      "text": "This movie has everything you could want in a summer blockbuster -- great humor & action. Will Smith is fabulous but Jason Bateman almost steals the show."
    },
    {
      "rating": "8",
      "text": "Once again, the critics prove they have the intellectual depth of a carrot. As with all super-hero movies, this one does require some ability to suspend disbelief, but it certainly doesn't deserve the negative attention it's received to garner a \"49\" rating. The effects are superb, but effects don't make a movie. What makes a movie is the story. This one has it. The characters, at least the three primary characters, are three dimensional, as is the plot. If you got \"Unbreakable,\" you'll get this one, and you'll appreciate it. If \"Unbreakable\" was beyond your understanding - as it also was for some of the same critics - then \"Hancock\" will be beyond you as well. For me, it was one of the better super-hero flicks we've seen."
    },
    {
      "rating": "9",
      "text": "This movie is good, i don´t know why the majority don´t think the same, it´s original because put a black as a hero, it is very fun, and has good special effects, that´s it, if the history in the end is not so good, that´s alright, but still, the movie is very good."
    },
    {
      "rating": "7",
      "text": "Actually 7.5. Like \"My Super Ex Girlfriend\" I fell in love with the premise of the movie before I even entered the theater. Will Smith does a decent job as the alcoholic super hero but like most hollywood fare once the character \"redeems\" himself the starch kind of falls out of the movie."
    },
    {
      "rating": "10",
      "text": "Once again critics have made them selves look stupid. This movie apart from Iron Man is the best movie of the year so far, big statement I know but this film has everything, action, romance, comedy and drama. It is a superhero movie with a heart, and is humanistic, everyone is waiting for the new Batman but for me the lead characters in this film are outstanding(not Oscar quality but very good all the same). Maybe most critics like to dis Will Smith he has done some incredible commercial movies, but this one has merit like Enemy of The State, and I-Robot. sorry to say this but the critics are very misguided on this film and I only trust two critics before watching Movies, The NY times and Rolling Stone magazine especially Pete Travers. So ignore the majority of critics watch this film and be surprised at how good it is."
    },
    {
      "rating": "7",
      "text": "Although not perfect, i think critics are being way to harsh on this film. I enjoyed it quite a bit. I think the biggest problem is that this isn't the big action comedy as it's being presented in trailers... so expectations are a bit skewed. Although it has action and has comedy, this has a emotional/dark streak that is completely unexpected. It ends up being a lament on loneliness and relationships as much as anything else. The movie could have been brilliant, but it does stop a bit short of that. It does end up having a bit more depth then your average summer blockbuster though."
    },
    {
      "rating": "9",
      "text": "Your same old super hero movie until the eccentric plot twist in the middle."
    },
    {
      "rating": "3",
      "text": "A tedious movie that has some moments. Some of the foreshadowing was a bit raw since the characters should have picked up on such obvious ques."
    }
  ]
}