{"id": 1359, "title": "Hannah Montana: The Movie", "starring": ["Miley Cyrus", "Billy Ray Cyrus"], "runtime": 102, "genre": ["Comedy", "Drama", "Family", "Music", "Romance"], "description": "When Miley Stewart (aka pop-star Hannah Montana) gets too caught up in the superstar celebrity lifestyle, her dad decides it's time for a total change of scenery. But sweet niblets! Miley must trade in all the glitz and glamour of Hollywood for some ol' blue jeans on the family farm in Tennessee, and question if she can be both Miley Stewart and Hannah Montana.", "releaseYear": "2009", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/8pwbnmvshHj2yYPYlyJ8K8Yzecy.jpg", "categories": {"plot": 7.5, "acting": 7.285714285714286, "ending": 3.3333333333333335, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 7.571428571428571, "funny": 7.2, "action": 2.5}, "reviews": [{"rating": "5", "text": "Disappointing, to say the least. The beginning where she was fighting with Tyra made me laugh a little, but the story is kind of pathetic. I gave it a 5 because its an average. Surprisingly, the music isn't that bad (7) but the movie isn't good (3) If only they came up with something more similar to the TV series (which is so much better)."}, {"rating": "3", "text": "Let's be real.. it's Disney, and that' s why I wasn't expecting much -- nothing more than a long-lasting episode with some new people, if you know what I mean. I don't think anyone 9+ can find it very funny, but it's cute.. Miley Cyrus isn't as bad as I thought she'd be to be honest. And that blond guy, not bad.The songs at the beginning were pretty catchy but the climb, What the fuck!? also hated the last 20minutes of the movie AND that scene with Jackson getting devoured by an alligator...AEHM, even a 5 year old wouldn't buy it."}, {"rating": "6", "text": "definitely worth a try."}, {"rating": "2", "text": "Hannah Montana the Movie just ends up being a crappy episode of the show stretched into almost 2 hrs of a movie. And it features just awful performances especially from Miley Cyrus. I give this movie 23%."}, {"rating": "0", "text": "It sucked because of Miley Cyrus was in it btw its only 10 year old kids who like her, anyone over 10 and like her have a damaged brain."}, {"rating": "10", "text": "this is the best movie ever made, the cinematography is spectacular, it has excellent spectacle, the plot is easy to follow yet interesting, the characters are realistic and it it makes you feel magical inside your heart. the songs are amazing, nothing tops this movie!"}, {"rating": "1", "text": "Another example of melting. However, it was a great ADVERITISEMENT towards taylor Swift. My 5 year old daughter hated this movie and thats saying something. The best part about this movie is the fact that the whole Hannah montanna garbage will be FINISHED!!! O it was a relief when i saw the end credits roll as well"}, {"rating": "0", "text": "I loved how this movie was in color. Disney, you've done it again!"}, {"rating": "3", "text": "Suspend your disbelief as this limp movie would have you believe that an idyllic town set in some imaginary part of Tennessee in which everyone just seems to love everyone else in that strange, southern hospitality way could actually even exist. Yeah, y"}, {"rating": "0", "text": "Do we really need to watch this to find out that it's garbage, just like the whole of MIley Cyrus' career. I mean, come on, folks, do you think that there is even a remote possibility that it would be anything less than absolute horrible s*@t? This will appeal to anyone from ages 1 - 5, beyond that, if you like this, you have serious issues and should seek help."}, {"rating": "0", "text": "The Worst movie ever. Like everything else Disney it relies more on marketing then actually being good. This is just trash in a pretty package for kids to eat up."}, {"rating": "10", "text": "Amazing movie. I think Disney has really done it. It has a great balance of exciting, fun and sad moments. The situation of boys is close to many teens hearts. The songs are also very catchy. Good storyline. Definitely a movie worth watching."}, {"rating": "3", "text": "I will never understand the Hannah Montana craze. The problem is the lack of talent. It's just another way Disney can make a ton of money exploiting youth. Worn out story, riddled with cliche's and just too cute."}, {"rating": "10", "text": "Best Best Movie Ever Very Funny Very Cute and VERY Good I give it a 10 for the Best Movie In The Worlds. Also Very Romantic For Miley!!!!!!!"}, {"rating": "0", "text": "Three words: Absolutely, positively awful."}, {"rating": "10", "text": "This movie was really good. I just came back from watching it and I want to go back and see it again. Yes it may be cliche but its really good."}, {"rating": "10", "text": "It was a fantastic movie. It just satisfies kids. The adults may not like it, but Miley's fans would definitely love it!"}, {"rating": "0", "text": "One of the worst movies I've ever seen. Just a money grabbing capitalisim exploitation, and I watch a t least one movie a week."}, {"rating": "0", "text": "All that was missing from this movie was Disney"}, {"rating": "2", "text": "I didn't even waste 10 dollars on this movie. If it is anything like the series, the police should shut down the thertre because they are toutrering people. Of couse, little girls will love it because its hannah montana. Don't be fooled, don't waste 10 dollars on this!"}, {"rating": "8", "text": "Loved it. Touching, fun, exciting. I resent the other reviewer's opinion that I need to seek help for liking this movie. Everyone is entitled to options, but it's not necessary to attach others. The movie is refreshing, wholesome fun."}, {"rating": "0", "text": "I love love LOVE this movie! The part where Hannah is fighting with Oprah is the funniest!"}, {"rating": "10", "text": "I thought it was a great movie. I am 17 and i enjoyed every minute. The Climb was a song that lots of people can relate to. The cast was good. The boy was very cute..heart-throb!! I am not a avid hannah montana fan but i love watchin the series when it comes on. I know miley may not present a very good image in some places but i haven't really followed that. My mom went with me and we saw the movie when it came out in theaters and we both thought it was great. Cute and, though maybe not original, it was a nice spin on a classic story. So i apologize to all the \"real\" critics and the wanna be's that seem to think that this movie was not worth anything. I LOVED IT!!"}, {"rating": "4", "text": "I got this movie for my FOURTEENTH birthday. I was never really into Hannah Montana, 'cause the series and songs were considered as 'childish'. I wanted to give it a try, and watched the movie. Well, not even the whole movie. I had to stop halfway, because I was falling asleep, and there wasn't ANY motivation to watch the other half of this crap. Predictable, boring, boring, boring, predictable, very very fake, and basically the movie was the whole series-thing repeated, it didn't add anything special. Very sad to watch how Taylor Swift totally crushed Hannah Montana. Still give it a 4, because if you're Hannah Montana fan you'll probably like it."}, {"rating": "0", "text": "This could likely be the worst piece of cinema ever. It makes me wonder if everyone with any actual talent at Disney got fired after the Pirates of the Caribbean trilogy finished and replaced by screaming little girls."}, {"rating": "5", "text": "Anna rhymes with Hannah. This is a pertinent fact. Whereas our titular hero(Miley Cyrus) deems a mere farmhand worthy of being her beau; in Roger Michell's \"Notting Hill\", Anna Scott(Julia Roberts) likewise, falls for an ordinary bloke, a bookshop owner, played by Hugh Grant. In the film's funniest scene, William Thacker fakes his way through a press junket promoting Anna's latest film by posing as a writer for \"Horse and Hound\" magazine. Contrary to William's ignorance in equestrianism, Travis(Lucas Till) knows his way around horses. The point being: the presence of horses are duly noted in both films, establishing a connection. \"Hannah Montana: The Movie\" doesn't really have a funniest scene, but there's one purported-to-be-funny episode that works on a dramatic level, which the film seems wholly unaware of. Wanting to be here and there at the same time, the existentially befuddled pop star compartmentalizes to the hilt, in a scene where she flits back and forth between a formal luncheon with the mayor, and a date with Travis at a nearby diner. Although Cyrus lacks the movie star pizazz to pull off physical comedy, Miley's dogged reluctance to come clean gives her character depth, albeit this depth goes largely unexplored in a film more concerned with marketing than following through with its theme of celebritydom's pitfalls. Miley is flattered that Travis likes her for herself, not her stardom; she's afraid that her alter-ego would disappoint him. In \"Notting Hill\", Anna tells William, \"Rita Haywood used to say, 'They go to bed with Gilda, but they wake up with me.' \" The U.K. paparazzi that hounded Anna, hounds Hannah, as well."}, {"rating": "10", "text": "It's a lovely movie about bringing families together and being honest, finding a life you'll be happy living, and it's just so amazing positive. Nowadays, films are dark, depressing, and cast all these doubts into people's minds.. it's refreshing to see a positive, uplifting film that makes people believe in themselves. Life's what you make it.. so you might as well have fun and be courageous. Don't be so negative people! Be happy!"}, {"rating": "10", "text": "Loved it! Cannot wait to go back and see it again!"}, {"rating": "10", "text": "It was a hilarious movie."}, {"rating": "5", "text": "I didn't realized how bonded I was to the Hannah show until the movie came out. Then I realized that my affection the series had grown to big and fell hard when I saw the movie. If there's a time that I wanted a time machine to turn back time, it would be now. I would have walked straight up to Disney and tried to talk them from not making this film - I know, they wouldn't have listened. Or at least I would tried to convince them to make the movie better To be said, I enjoyed the flick, but yet I'm dissapointed. What dissapointed me most was the third act, who was much sappier than I thought it would be. In the last 20 minutes there are no highlights or comedic pauses to light the mood up. And please, how can people like the crappy \"The Climb\"? Otherwise, I enjoyed the movie until the highly dissapointing third part. There were lot of fun moments, good cinematography, catchy fun and great dialog. Still, after the movie came out, my affection for \"Hannah Montana\" hasn't been the same."}, {"rating": "6", "text": "At first when I heard about this movie, i thought it was going to be horrible and I never did see it in theaters, but like maybe about 3 months after it came out on dvd, i decided to give it a try.  I thought it was okay, it wasn't horrible, but wasn't that good.  I thought the songs were great, the humor was okay.  But something about the movie really irked me."}, {"rating": "4", "text": "Although HANNAH MONTANA: THE MOVIE is mostly awful, especially compared to the fairly decent \"Disney Channel Original Series\" of its basis, but it's sad to say that this is one of Miley Cyrus's best films yet."}, {"rating": "10", "text": "It brought so much tear for me.Love the movie,love their acting and how they grow up,this is a really good movie,great music.You can learn the importance of family .Love it"}, {"rating": "7", "text": "Let me be real Ima 16 year old guy and I took my little cousin William, friend Scott and my girlfriend came with her little sister Sarah and older sister Natasha we are in the range of 16, 16, 7, 9, 17 and 16 and to be honest we enjoyed it, while nothing special entertaining it was. The idea of superstar going back home to get back in touch with her roots (Something Lindsy Lohan should do) was refreshing and good. Hannah Montana oh good even I liked the finale two seasons of the show. and about 8 songs entirly. This is good Miley Cyrus can act, sing she has a weak voice and pitchy one. But come on I found nothing really bad to say with the movie a good family movie. This is coming from a guy, everyone even guys just watch it, you might actually like the movie (You might not enjoy ever song or even one but). Let's Get Crazy, Let's Do This, You'll Always, Game Over, What's Not to Like, Spotlight, Dream, Don't Walk Away were pretty decent songs to hear, not gonna be on my iPod but might keep a couple on my compute. The Climb."}, {"rating": "0", "text": "This movie is just fulled with cliche's the daddy/daughter bond, te teenage attitude. Apparently Cyrus is just unlike able, in the most annoying way as possible an order to make a \"girl movie\".  She cannot so .......why like this movie?"}, {"rating": "4", "text": "That's has a good story, but i think it's very exclusive.. It's more directed at women kids, and the channel is watched for all the geners! And i think this actress Miley Cyrus bad, she's like... no reaction.. soft.. She's really  better singing then acting!"}, {"rating": "10", "text": "I love this movie with all my heart, please stream sweetener by ariana grande on itunes, thank u"}, {"rating": "10", "text": "I love it, i love youu hannah montana me encanto la pelicula la amo muchoooooo"}, {"rating": "10", "text": "fidèle à la série tout en offrant une intrigue différente très bonne réalisation"}, {"rating": "10", "text": "Hannah Montana melhor filme da Disney pra mim!!! E a melhor série tbm, Miley arrasou na atuação"}, {"rating": "10", "text": "miley her şeyiyle mükemmel. mükemmel bir film. çok başarılı. inanılmaz bir albüm"}, {"rating": "10", "text": "This movie is amazing! The sound track is great, the characters mix so well, the drama is there, it deals with real life issues, and it is executed perfectly! It is an amazing choice for children, and will get adults to think a little about parenting. RECOMMEND TIMES 1,000!"}, {"rating": "10", "text": "The best alter ego. The best Disney movie. The best Disney Princess. The best Disney character. The best movie."}], "recommendations": ["the_game_plan", "the_croods_a_new_age", "alvin_and_the_chipmunks_the_squeakquel", "alvin_and_the_chipmunks_the_road_chip", "alvin_and_the_chipmunks_chipwrecked", "17_again", "minions_the_rise_of_gru", "sing_2", "the_smurfs", "alvin_and_the_chipmunks", "garfield_a_tail_of_two_kitties", "herbie_fully_loaded", "cloudy_with_a_chance_of_meatballs", "marmaduke", "love_hard", "we_bought_a_zoo", "ice_age_the_meltdown", "zookeeper", "chicken_little", "bridge_to_terabithia", "second_act", "just_go_with_it", "my_little_pony_equestria_girls_forgotten_friendship", "the_family_man", "confessions_of_a_shopaholic"]}