{"id": 2288, "title": "Happy Death Day 2U", "starring": ["Jessica Rothe", "Israel Broussard"], "runtime": 100, "genre": ["Comedy", "Horror", "Science Fiction"], "description": "Collegian Tree Gelbman wakes up in horror to learn that she's stuck in a parallel universe. Her boyfriend Carter is now with someone else, and her friends and fellow students seem to be completely different versions of themselves. When Tree discovers that Carter's roommate has been altering time, she finds herself once again the target of a masked killer. When the psychopath starts to go after her inner circle, Tree soon realizes that she must die over and over again to save everyone.", "releaseYear": "2019", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/4tdnePOkOOzwuGPEOAHp8UA4vqx.jpg", "categories": {"plot": 5.4186046511627906, "acting": 5.605263157894737, "ending": 5.785714285714286, "soundtrack": 7.0, "cinematography": 5.666666666666667, "familyFriendly": 6.0, "funny": 5.944444444444445, "action": 7.5}, "reviews": [{"rating": "5", "text": "I thought the first film had some fun moments, but mostly just further exhausted the 'Groundhog Day'/time loop premise, and I was pretty surprised to learn that it was getting a sequel so soon, what with the first only coming out a year or so ago. Nevertheless, this one surprised me in some ways. For one, it wasn't really a slasher like the first one was, rather it introduced sci-fi and multiverse elements to it, which I thought felt somewhat interesting, but also ridiculous at times. Some of the acting and dialogue from certain characters was also cringeworthy. However, I will say that the acting from lead actress Jessica Rothe was once again pretty solid, and there were a surprising amount of deep, meaningful, and emotional scenes with her character that helped keep the film investing at times. But overall, despite the handful of meaningful and decent moments, rather than building upon what the first film offered, it seemed to just jumble a bunch of genres together horror/slasher, sci-fi, comedy, etc.) with no clear aim if you ask me."}, {"rating": "3", "text": "The biggest mistake in this film. Making it an attempt to explain something that has never been asked 'why'. The first film works effectively with its ambiguity. No explanation needed. But if you want to explain, then do it really clearly. This second film has a scientific foundation to include all events, only that the foundation is built weakly so it raises many other questions. In the end the film told us to swallow the question completely. We are told to just follow, just believe, in the event that they are arranged as a storyline, there is no need to think of other alternatives. The irony is actually for a story about the multiverse and diverse human choices. Aside from all that, the film still retains the charm that made its first film liked and the aspects that made it exist; Jessica Rothe's sense of humor and appearance. So this film will work best if watched by a marathon immediately after the first film."}, {"rating": "5", "text": "When thinking about the comedy-horror genre, there are very few and far in-between films that come to mind. While it may be hard to conjure up a large number of films which remain memorable for quality and not for overall lewdness, gross out gags are born and raised in these types of films. While more often than not, many of the films born in this genre have made, for the most part, a mockery of the genre, thankfully there are a few gems to carry the cultish torch; gems like Sam Raimi’s Evil Dead, Mel Brooks’ Young Frankenstein, or Edgar Wright’s Shaun of The Dead and Scary Movie from the lively Keenen Ivory Wayans remain some of the few films that come to mind right away. All notable and truly brilliant contributions to the genre, these films possess the impressive ability to walk the proverbial tightrope between the equally difficult threshold of outlandish yet effective comedy and frightening and truly terrifying horror. The natural benefit of combining the two is that both commonly rely on similar mechanics for the pay off or climax of scenes. The pacing is similar; you find the same tension that gets built up for a laugh but could easily shift gears and become build up for a gasp, and for both respectable genres, it’s all about the revealing of what we the audience have been waiting for, the killer behind the shower curtain or the perfectly timed punchline.Happy Death Day 2U is directed by Christopher Landon, a filmmaker who jumped in on the train that was Paranormal Activity after the massive success of the first indie surprise hit. Yet, as devoted Landon is to the genre itself, directing and writing many entries in the comedy-horror subgenre, including 2015’s Scouts Guide to The Zombie Apocalypse, Death Day 2U is a fresh and invigorating take on genre but also on romance, mortality and even includes a dash of science fiction. The brilliant, even outstanding advantage Death Day 2U has over films before it of its kind is its show stopping leading lady who is larger than the film itself Jessica Rothe. Death Day 2U is a sequel and we see Jessica reprising her role as Tree Gelbman, the time looped slasher victim of all slasher victims from the first film. This time around she gets caught in the Groundhog Day/Halloween type scenario once again. Let me just say that Rothe plays the role like an ace; funny, down to earth, beautiful and well-timed as a comic, she also crowns herself a worthy scream-queen next some greats.  While the film uses the reviving or reincarnating premise to the fifth degree unabashedly, luckily for the audience, it never feels tiresome; the cinematic gimmick stays fresh. The main plot device is primarily governed by the films main comedic power Phi Vu playing the character of Ryan Lin, a friend of Tree’s who ends up getting stuck in the same “loop” or dimension that Tree was stuck in. With this new dilemma and multiple dimensions in the film, it never feels boring or cliché. One of the dimensions has Tree’s recently deceased mother alive and well, along with her boyfriend Carter Davis played by Israel Broussard dating Tree’s arch enemy from the original first dimension the film started in, these scenes provided surprising and truly moving emotional weight to the film, giving insight to relationships and life overall. I can honestly say that I was completely thrown off by the films ability to include so many different scenarios and ways for Tree to be murdered with some truly hilarious scenes. Yet all at the same time hold any kind of weight emotionally, the side plot involving her mother being alive is truly heartbreaking to see and did not feel melodramatic or forced. All of the side characters in the film held there weight and served there desired purpose and honestly the entire film is simply good fun. Popular culture references are present and the riffing on Inception and other dimension based works brought belly laughs out of the audience. The horror aspect of the film was designed with what I believe to be simplicity in mind, simple side plots including an affair between a young Nurse who is a friend of Tree’s and a doctor set stage for some awesome suspense sequences. The killer possess zero qualities other than mild athleticism and a brilliantly designed school mascot mask that he dons as he attempts to satisfy his blood thirst, paired with a Michael Myers style kitchen knife as his weapon of choice. The mask is perfect and Landon does a good job at offsetting the usual jump out and scare tactics to actually be effective and a hell of a fun ride. Happy Death Day 2U is a destined to fail concept, with so many genres and feelings thrown into one mix, it takes quite the perfect storm to turn said mix into a good Manhattan, and let me tell you, Christopher Landon was the perfect bartender for this party."}, {"rating": "5", "text": "This movie started so well, it was so promising and suddenly it turn from light slasher movie into comedy/teenage drama/slasher movie. This transition changed the movie's dynamic. First - something brave,original and funny turn into boring, confusing, multiverse time-travel movie. Why, oh why they ruined their own franchise. Out of all possible scenarios they chose to run with the time-machine plot line interjected with family/boyfriend drama which just dragged for far too long. This was so unnecessary, so forced onto the viewer. Movie itself was a collection of sometimes idiotic deaths and the feeling of dread and mystery totally evaporated from the movie. I was really hoping for the better, bigger, bolder sequel and I got light s-f comedy instead. I know that the first movie had this funny vibe but it was leaning more towards slasher than comedy and here the scales tipped more on the comedy side. I watched it all but am disappointed with wasted potential. Hey dude ! Turn the time machine back on, I will travel back in time and fix your movie for you !!!"}, {"rating": "7", "text": "Happy Death Day 2U is more straight-up slapstick sci-fi than horror. I felt more like I was watching a Hot Tub Time Machine sequel. Saying this, the movie knows what it is, and that is pure cheesy and enjoyable entertainment."}, {"rating": "5", "text": "While the addition of humour and sci-fi elements isn't enough to freshen this sequel, the film is entertaining from start to finish."}, {"rating": "6", "text": "A solid sequel to a good film that let's itself down with a boring sciencey time-loop subplot and a cheesy overly romantic ending that defies logic."}, {"rating": "4", "text": "Happy Death Day, the Groundhog Day meets horror movie which came out two years ago has for some reason gotten a sequel. For those of you who haven't seen the first Happy Death Day, college student Tree Gelbman (Jessica Rothe) must relive the same day over and over, getting murdered by someone in a baby face mask until she figures out who the murderer is. A movie so bad it's good and so good it made over twenty times its budget, not only have we gotten a sequel but there's a strong possibility of a third movie thus completing the trilogy. Happy Death Day 2U sees the return of Tree and if she thought dying over and over again was bad things just get a whole lot worse for poor Tree as she's faced with some rather surprising moral dilemmas with dangerous consequences.I really don't believe Happy Death Day needed a sequel, especially a sequel that honestly doesn't know what genre it wants to be anymore. I don't remember anyone asking for an explanation to the time loops but Happy Death Day 2U decides to give one anyway in the form of some really smart college students creating a molecular quantum glowy ball thing that isn't really doing what it's supposed to do but is definitely doing something freaky because why not? Why wouldn't the time loops be created like this, Happy Death Day 2U makes the decision to just hop into a whole other genre. The first one is very much rooted in horror but this was all over the place. I felt it was a mess, story wise it just wasn't working for me and it only got worse, by the end it felt like a soap it was that overly dramatic. Despite this and the truly awful script, it's got more than a few laugh out loud moments, possibly for all the wrong reasons but that doesn't really matter if it's still making you laugh. And I did laugh, numerous times at just how daft this film is. Particularly Jessica Rothe who honestly plays this part so well, alongside a whole group of mediocre actors her performance stands out even more for an hour and a half and considering so many horror/comedies fail at this I have to give it some kudos because I have seen much worse. It's a bad movie that will entertain you. The first one is a better film and I stand by my earlier comment, there was no need for a sequel but something's gotta pay the bills, recommended for fans of Happy Death Day."}, {"rating": "9", "text": "Great summer movie (but in winter) funny, light and doesn't take itself seriously. haven't seen a movie like this for a long time. it's like It's 90th again, in a good way. people like me from the 90th will really appreciate this movie, Shame that there are very limiter movies like this one out there."}, {"rating": "6", "text": "Happy Death Day 2U is such an interesting follow up to the original Happy Death Day. In some regards, it improves vastly on the premise of the original film. Shifting the genre from horror/comedy to sci-fi/comedy is such an incredibly strong writing choice that only elevates the movie. There are some excellent character developments and world expansions in the script, and the script itself is quite witty. There are thought provoking parallels to absurdism, and without giving too much away, even the title of this movie, Happy Death Day 2U is a cleverly disguised plot reveal.Jessica Rothe triumphantly returns to the character of Tree Gelbard, and she's only gotten better since the first movie. The whole rest of the cast also reprises their roles, and you can tell there was a lot of passion that went into making this sequel. For the most part, the passion pays off. Where Happy Death Day 2U falls short is in its technical execution and meandering second third of the movie.Very noticeably, it seems like the production quality of HDD2U has dropped considerably. The lighting isn't as good. The CGI is more noticeable, the fake CGI blood just looks bad and is somewhat over indulgent. The camera work is cookie-cutter and uninteresting. The score is just noise. As far as the storytelling, about halfway through the second act, and halfway through the third act, up until right before the climax, nothing happens. You can skip this entire 20 minutes of screen time and not miss anything. All in all, while not as good as the first film, this sequel provides enough fresh twists to at least be somewhat memorable."}, {"rating": "5", "text": "I never thought this film would cause a sequel but considering it was an unexpected success, it goes without saying that it was more than inevitable.The first one didn't seem so bad to me. I really believed that despite its lack of originality it turned out to be more entertaining than I expected. This sequel tries to emulate the same thing with certain slight changes that don't really help and therefore it feels smaller.It's like they say: you cannot make the same joke work twice."}, {"rating": "5", "text": "Happy Death Day 2U is an unnecessary sequel that never reaches the level of entertainment or creativity of the first film, and the ending drags on so long that it becomes silly."}, {"rating": "7", "text": "Divertida. Así deben ser las pelis q usan \"Multiversos\", con historia lógica q puede protagonizar una mujer rubia. No jaladas tipo marvel q tiene q inventar marcianos, mutantes y piedras mágicas."}, {"rating": "3", "text": "\"Happy Death Day 2U\" é mais ficção científica do que 'terror slasher'. Consegue entreter com uma protagonista carismática, mas não conta uma história coesa nem respeita o seu próprio universo.3/10"}, {"rating": "8", "text": "Good movie, but...I honestly prefer the original, this isn't bad, but I expected more."}, {"rating": "6", "text": "While not quite as good as the original, Happy Death 2U is a fun sequel though it can get very confusing at times."}, {"rating": "7", "text": "A fun sci-fi movie with a sharp comedic edge that knows what it is about a similar concept to the first. This was a damn close sequel to Happy Death Day in terms of quality, and the emotional moments REALLY hit hard."}, {"rating": "6", "text": "Welcome back to “Groundhog Day” the horror edition part two. The first film was a lot of fun with some good humorous moments and horror. We were left with the only question of what caused her to relive the same day over and over again. It wasn’t something that needed to be explained but sometimes to get an explanation. So with that comes the sequel. I was looking forward to this and had high hopes for it to be as refreshing and fun as the first. What we got was something like that but not quite as good. That’s not to say the film is disapointing because it’s not. It is still fun with plenty of funny moments that really gave me some good belly laughs. This is not so much a horror movie anymore. This is a sci-fi film with a time travel edge. I give the filmmakers serious props with how well they matched up scenes from the first film perfectily here and made everything feel seamless beginning to end. This time around, Carter’s roommate Ryan is given more to do. We find out he and friends have made a quantum reactor that is fact causing these time loops. THe beginning provides a bit of a shocker with Ryan being chased by another version of himself. This leads to him activating the device and with it, Tree wakes up back in the same day as the first film but something is different. Carter is now dating Danielle, Tree’s sorority sister, and her mother is alive. Jessica Rothe’s scenes with her mother, played by Missy Yager, are very emotional scenes. I actually felt emotion in this scene and in a movie like this, that’s not quite what you would expect but it’s a good thing. One of the biggest disapointments though is the trailer was very misleading. It made it sound like everyone was going to be a vicitim of the killer and that is not the case. Also, the film kind of igonores one of it’s rules only until he needs to use it again at the end. Tree needs to keep killing herself to get equations to help get her back home, but a problem in the first was her keep dying was affecting her body and it actually killing her. So, why does this not seem to be an issue here? Well, it is at the end when it finally starts affecting her but it feels like it’s only being now brought up to benefit the plot. Also, I feel like some plot holes exists that the ending should have addressed, especially with Ryan number two. Now don’t let my complaints fool you, this is still a fun sequel. It does a lot of things good too with some interesting plot twists with the alternate timeline and more characters that are great additions to the film. The first film is better, no question about it, but this is a worthy sequel that continues plot lines with some twists and intruging angle towards a third installment.Grade: C+"}, {"rating": "4", "text": "I wasn’t expecting to feel so negative about this film. The original was mildly entertaining, with a few laughs and a great lead performance, but largely uninspired. I was happy to see this film try something completely different by ditching the slasher genre almost completely. Sadly, by doing this, the film proves to be much less entertaining and even more formulaic and dull. The lead performance is still better than the movie deserves but it just isn’t very funny or creative in any way.\u2028 Grade: C-"}, {"rating": "8", "text": "Happy Death Day 2U surprises with more heart and humor as it tones down the horror. Clever twists and legitimately laugh-out-loud sequences (*cue Paramore's Hard Times* or"}, {"rating": "2", "text": "If you're wondering how the writers of Happy Death Day 2U made a sequel work, the answer is simple... They didn't. Instead of focusing on a new set of characters and possibly an even more intriguing death-defying situation that includes the Groundhog Day spin, they instead take the original cast and continually grasp at straws for each minute that passes over-explaining the story in an attempt to justify the film's existence, while at the same time doing whatever it takes to, as it seems throughout, fill-up the movie's runtime to an acceptable length.  This second entry once again sees the protagonist wake up on the dreaded day she's supposed to die, but this time she's stuck in a parallel universe due to a science experiment gone wrong. What unfolds from this is a story that's as lame as it sounds and it never even gives the viewer a reason to care at all who exactly \"the killer\" is because, after all, it's essentially a dream world she's stuck in. This time around, there's even more emphasis on getting things back to normal than discovering who's behind the mask. None of it makes sense. Every joke falls flat. The scares are pathetic and repetitive. The ending is sudden and off-putting. It's altogether more overrated garbage from Blumhouse Productions, their signature bad acting and cheap budget included."}, {"rating": "2", "text": "the first film was a cute, simple rip off of an episode of the x-files and groundhog day. this sequel now tries ripping off weird science or back to the future... while ripping off itself, by repeating much of the first movie here.  on friday night in los angeles, there were apprx 15 people in the theatre when it started and 11 people when it finally ended. this is more worthy of some sort of USA network junk than a feature. with that all said, the lead girl in both -- is adorable and talented."}, {"rating": "7", "text": "Not bad, good sequel to the first original. I love horror and this movie doesn’t disappointed me."}, {"rating": "8", "text": "Happy Death Day 2U was a surprise for me I thought it would not be as good as the original I thought it would be as good because it would back Into the loop I thought it would get old at first I was not liking when Tree first gets in the time loop but it got interesting every time she died and looped when she thinks it's her last time she has to tell her mom and Carter about what will change this movie has a story which I was surprised by the original did not really and the original was kinda boring at parts but had a better pace I feel like all the characters are good besides Danielle she is so annoying what was different from this movie the killer is different and Ryan made the machine which I was surprised by at first I was like wait there was a machine for this which there was it was a great addition to the movie the original killer does return but there is another killer so right when she kills the other killer the other one will come and get her and that's how she keeps dieing Gregory as the second killer made sense in his scenes he is acting suspicious also the story with Lori and him were weird and confusing because he is being weird but at the end it comes together so all round an great sequel to the original i think it is better with great cast of characters great kills also so I give Happy Death Day 2U an B+"}, {"rating": "1", "text": "I did not see the first movie that precedes it but I already knew the story and without surprise it's the same story as the first movie just 1 characters changes the movie was boring and heavy, very slow, without horror nor screamers , the actors overplayed throughout the short film, go your way"}, {"rating": "9", "text": "I was a big fan of the first Happy Death Day, a horror comedy that was basically a slasher meets Groundhog's Day. I was looking forward to this sequel, but I became a little apprehensive when I found out that this was going the Back to the Future 2 route and revisit the same day. The entire first film had been lead Tree Gelbman (played by the wonderful Jessica Rothe) reliving the same day over and over. I get that the movie was probably going to go at events from a different angle, but I was worried about them things and it seemed a little cheap getting Tree back into the exact same time loop after fighting so hard to free herself. But my worries were unnecessary, this wasn't a time loop movie, but a time loop that takes place in an alternate reality movie, which was different enough for me to work. In fact, this was a lot of fun and almost as good as the first one.Happy Death Day 2U shakes things up in three ways to keep things fresh. 1) It shifts the feel of the first movie from a horror comedy to more of a comedy-comedy. There are a lot less killer attacks. (There are a couple well shot scares for what there are.) The movie's soundtrack has noticeabley changed from horror to comedy. The whole thing's pretty amusing. They have more fun as deaths get even more ludicrous from the first. A funny joke you may have seen in the trailer turns out to be better in full.2) It finally explains what caused the time loop and gets all science-fictiony.3) The aforementioned alternate reality. After a rather interesting fifteen minute or so opener that I won't spoil, Tree winds up in a new timeline where events are mostly the same, so we don't need to waste time having with a lot of new exposition, but there are small but important differences scattered throughout. Tree finds herself going up against a new killer, and the film's strength is built upon twisting expectations.I liked that this managed to bring back all the main cast from the first. (Not to mention a lot of bit roles.) They're all likable. Still, the movie once againn rests on Tree's shoulders. Considering that the first film was all her reaching an emotional arc, you'd think they wouldn't have many more emotional places to take her, but it does. Tree has a big thing happen to her and she has to make a serious decision. Jessica Rothe makes this movie, whether being funny or sad. To be honest the basic plot is a little thin if you look back at the script intellectually. It is Rothe's charisma that guides the whole thing.Keep through the credits. There is a scene in the middle you shouldn't miss. They're plans for a third installment and if it manages to stay fresh like this then I'm all for it."}, {"rating": "6", "text": "A sequel that neither improves upon nor fails to live up to the original, Christopher Landon's \"Happy Death Day 2U\" aims to ultimately reduce the amount of horror in favor of a more sci-fi friendly approach. However, operating as someone who didn't particularly care for the horror elements in \"Happy Death Day,\" I suppose a little change of pace never hurt -- especially in a franchise where redundancy is quite literally built into its premise. No, none of the science actually makes sense, but what time travel/multi-verse film does really? Still, we have our characteristically out-of-place slapstick and Looney-Tunes-esque montages, neither of which I cared to see again. But, nevertheless, a watchable movie this remains."}, {"rating": "6", "text": "Spoiler Warning: I had to watch the first more than once to appreciate it. That might be the case for this sequel. Happy Death Day 2U starts out funner and scarier.    Then instead of really being a Groundhog Day/Slasher film. It becomes pretty much more of a science comedy, like Weird Science and Real Genius. With there being way more heart and comedy than thrills or kills.    The movie has some laughs and might still entertain you. However it was basically only made to tie up the loose ends that the first film had."}, {"rating": "10", "text": "Lejos mejor que sula predecesora, la base es la misma, pero está mejor ejecutada, es mas dinámica, rápida y divertida."}, {"rating": "7", "text": "First of all, Jessica Rothe did an amazing job in this film. In every scene that she’s in you can easily tell she’s having fun with the role and giving it her all. She could easily switch from being funny in one scene too serious the next. Everybody else in this movie was good just not great. Now the relationship in this movie is kind of unbelievable like Disney level unbelievable. I mean Tree and Carter had really only been dating for what two to eleven days. I’m sorry but like I said that only happens in Disney movies where the girl falls in love with the guy the moment she meets him and automatically wants to marry him. This film is a horror comedy and in the horror section it’s a tiny bit above average but in the comedy department, it was really funny. If you guys have seen the trailer you know that Tree has to kill herself in many different and creative ways and all of them were kinda funny to me at least. Even some of the scenes that others will probably find cringey I found kind of funny because they were cringy. But again I’m a teenager who reviews movies what do you expect. Now the horror element of the film comes and goes throughout the entire thing and is really put on hold for the comedy of the film. It felt kind of like a subplot that the writers forgot even existed until the very end. Even then it felt really weak when it could have been a “killer” move and plot twist if we focused on it a bit more and didn’t just glance over it. Also stay after the credits because there is a post-credit scene that gives off a possible sequel for this film. In the end, even if you haven’t seen the first movie like me it’s still a good and easy film to follow along with. I do wish it was longer though."}, {"rating": "5", "text": "It's a meh for me. I thought it was slightly better than the original and I thought the humor was pretty decent. I think they are trying to make this as more of a comedy than a horror movie which I think they did pretty well. However, it somehow turns into this sci-fi film which it could have been done well but it doesn't really make sense. I thought the acting and script were decent enough and it's just your average horror movie however it doesn't really scare me a lot of times.Otherwise, a decent sequel which carries out the problems that the original had but at least this movie was more enjoyable and slightly entertaining than the first."}, {"rating": "7", "text": "70/100This movie is a pretty good sequel. The beginning was a bit rushed but the second and third act are entertaining and they knew how to play with our emotions"}, {"rating": "10", "text": "Let's get it straight, this is a sci-fi thriller comedy. Don't go into this expecting horror.Despite the similar concept being done again, they add a really interesting and captivating element to the plot that ends up evoking emotion and showing more character development, much more than the first movie. It is a bit cynical at times, but there's never a dull or boring moment."}, {"rating": "6", "text": "Better than the first, it has good moments but gets tedious after a while. I really like that it has its heart in the right place even if the execution falters at times."}, {"rating": "6", "text": "Still bad, but somehow, better than the first movie. Still a waste of time and money."}, {"rating": "9", "text": "A follow-up that's even smarter than an already clever original. It has more characters that expands inventiveness of this what I hope will be a movie series but it's difficult to keep coming up with new iseas that they clearly managed to do in the follow-up.  I don't understand why C. Landon movies get so much negativity from reviewers but any one that watches his movies will always come away entertained, he definitely isn't a hack like Paul WS Anderson but even he gets more breaks that C. Landon. I highly rate this writer/director and I want to see more from him."}, {"rating": "0", "text": "Happy Death Day 2 simply recycles everything we have already seen in the first film. The only difference is that it really dives deep into the nonsensical lore that we really didn't need to be explored in the first place. It sucks. If you even remotely enjoyed the first one, Don't bother with this."}, {"rating": "5", "text": "Happy birthday to me!21 years old, I'm a meme now.Anywhere,What started off as a simple 'Groundhog Day' concept in the first movie, now has turned into a multiverse of madness.With it being a sequel, it goes bolder and more crazy than the first, which I had an absolute blast watching. Not a great movie by any means, but a guilty pleasure of mine. I'm actually interested in seeing the third if it gets made.Also, there's something about Jessica Rothe that I really like. I can't really explain it."}, {"rating": "6", "text": "This one I liked a bit less than first since some of it was just too silly, but I still enjoyed it and don't think its bad, just some things couldve been better."}, {"rating": "5", "text": "Found myself enjoying the first 'Happy Death Day' quite a bit, though it did have its flaws. It had a very interesting concept which it made the most of but could have done even more with it. This sequel when hearing of it intrigued me with what it would do with its concept and it looked pretty cool but part of me felt nervous, questioning its neccesity, how it would hold its own, whether it would do anything new or be too much more of the same.'Happy Death Day 2 U' to me was a watchable sequel that doesn't exactly disgrace the first film, while with room for quite a fair bit of improvement. It is not too more of the same and tries to build upon what we saw before, but also could have been fresher and not tried too hard in the story execution. It is not amateurish, is appealingly played and has enough amusement and atmosphere, at the same time it is not near as focused as the previous film.Will start with the good. The photography is stylish rather than slapdash, the editing has suitably unnerving moments and the lighting is atmospheric. Christopher Landon never lets it get too heavy while not diluting the fun or scares, and the at times haunting and at others times funky soundtrack adds a lot.There is a lot of humour, more so than scares actually, and again generally it's knowing and firmly tongue in cheek. There could have been more scares and suspense but when they were there there was some creepiness, or so to me. The acting is solid, but Jessica Rothe is great and one of the main reasons to see 'Happy Death Day 2 U'. The character chemistry is appealing and not forced.As aforementioned however, although seldom dull the story was much more focused before and slicker. The second half especially, thought the film started off great actually and held my attention, tries to do too much and can get over-complicated. The time dimensions stuff, focused on a little too heavily, could have had more clarity. Neither the comedy or horror feel as fresh. Some staleness in some of the gags and as said the scares and suspense are not enough.Despite the solid acting, the character writing is superficial. It was in the previous film too but before it felt more self-aware and acknowledgable of that, didn't get as much of that sense here. 'Happy Death Day 2 U' does get increasingly silly in the plotting on top of lack of sense and logic towards the killer reveal. Once again the killer reveal underwhelms, hugely underdeveloped, rushed and confusingly head-scratching.In conclusion, enjoyed the first but this sequel left me conflicted. 5/10"}, {"rating": "8", "text": "Сложно сказать, пошло ли это фильму на пользу или нет, но вернуться сюда - было интересным аттракционом!"}, {"rating": "4", "text": "Not really a good movie. Has the basic time travel time loop premise that has been done in a lot of movies before but just doesn't do it very well. Story just feels empty not much of a plot. I would give it a solid 4.5 from 10. Not very good."}, {"rating": "5", "text": "Entertaining but overstuffed. Could have benefited from better pacing and a more focused narrative. Jessica Rothe carries this film."}, {"rating": "5", "text": "Eu fiquei sem entender a necessidade desse segundo filme. Mas enfim... é isso ai"}, {"rating": "2", "text": "This was an incredibly dissapointing garbage which had  pretty decent chances to be an interesting and decent if they focused more on the asian trying to kill himself plot rather than just getting back the main actress from the first movie and some parallel ****"}, {"rating": "1", "text": "1/10 *   War enttäuscht. Der erste Teil war so viel besser und spannender. Der war lw. Ich hab mir viel mehr erhofft vom zweiten Teil aber das ging in die Hose."}, {"rating": "10", "text": "10/10 wedevr………………………………………………………………………………………………………………………………...…………......………………………..."}, {"rating": "3", "text": "I don't really know why I had this film so much it's just that like right in the first quarter of it I got a headache in the film got really stupid and I couldn't really enjoy it I probably have to re-watch it but how am I remembering it"}, {"rating": "8", "text": "Happy Death Day 2U was surprisingly entertaining. This film is perfect and is tons of fun and puts a fresh twist on the concept. The characters are likable and the humour is brilliant at times. It's just lots of fun and excitement. I would recommend it to everyone."}, {"rating": "6", "text": "A similar case to number one. Nothing masterful, but like it doesn't hurt. An enjoyable respite, although I had more fun here due to the fast pace and overall ending, which I liked. Again, not a horror film. Nothing scary. More of a comedy, but it passed the time pleasantly and I'm not complaining. I would probably only recommend this to those who liked the previous film."}], "recommendations": ["happy_death_day", "insidious_chapter_2", "dark_skies", "countdown", "ready_or_not", "final_destination", "insidious_the_last_key", "insidious_chapter_3", "summer_of_84", "devil", "chernobyl_diaries", "sinister_2", "malignant", "brightburn", "final_destination_2", "the_strangers_prey_at_night", "annabelle_comes_home", "the_invasion", "the_conjuring_the_devil_made_me_do_it", "scream_4", "shut_in", "bird_box", "insidious", "a_quiet_place_part_ii", "wish_upon"]}