{
  "id": 1269,
  "title": "Happy Feet",
  "starring": [
    "Elijah Wood",
    "Robin Williams"
  ],
  "runtime": 108,
  "genre": [
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "Into the world of the Emperor Penguins, who find their soul mates through song, a penguin is born who cannot sing. But he can tap dance something fierce!",
  "releaseYear": "2006",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zP4CK9O70P8GDilfTkPm4lrmaks.jpg",
  "categories": {
    "plot": 3.962962962962963,
    "acting": 3.0,
    "ending": 5.166666666666667,
    "soundtrack": 5.2,
    "cinematography": 5.0,
    "familyFriendly": 4.857142857142857,
    "funny": 3.5555555555555554,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Good graphics? Erm, this is like any other computer animated film - so that doesn't carry this overly-preachy and hardly-entertaining dud."
    },
    {
      "rating": "1",
      "text": "I tried to laugh, but the giggles never came. Then I started to frown, to much sensual comments of course."
    },
    {
      "rating": "2",
      "text": "Robin Williams provides some cheap laughs as a small, Latin penguin, but the rest of the movie is deplorable. I really couldn't care less about \"sexual overtones\" (give me a break, I saw 'Pretty Woman' when I was little. Kids have NO IDEA what those comments mean. Use your head) I was more concerned with the banner-waving environmentalist agenda that the movie has throughout. My fiance wanted to see a cute movie about penguins, and I accidentally took her to see \"An Inconvenient Truth (For Kids!)\". In addition to all of this, a number of the actors involved don't seem to quite understand the nuances required to do voice acting well. Elijah Wood in particular. The characters felt flat and uninspired because of the rather drab voices that were lent to them."
    },
    {
      "rating": "2",
      "text": "The CGI was astounding, but unless you like watching penguins dance and sing and dance and sing and dance and sing the movie was... well, maybe Mumble could dance this one out in Morse code: -... --- .-. .. -. --. (boring)."
    },
    {
      "rating": "2",
      "text": "A strangely hostile little film. Gloria's 'heart song' is downright depressing. Then the rejection of Gloria, by Mumble, with him running off with 'the boys' instead...yes, this is majorly a gay theme. Then we have the supportive mother, plus insensitive father. Hmmmm. Gloria follows Mumble over the ice to tell him she loves him and he tells her that's not for me!! Pulease. Girl hate to the max. There is nothing heart warming about this awful movie; the plot is dull and trite besides Cute little penguin, but that's it. No real humor or warmth. I'm not very religious, but I felt the anti-religious subtext was kind a ugly. Save your clams; don't spend any money on this loser."
    },
    {
      "rating": "1",
      "text": "I don't think this film is about whether one is liberal or not. I'm very liberal and I thought this movie was garbage just because everything about it was horrible. The little kids in the theater didn't laugh once!"
    },
    {
      "rating": "0",
      "text": "Worst movie ever, I did not like it. They rushed through it too much, he was a kid for like 10 minutes."
    },
    {
      "rating": "0",
      "text": "Broken up storyline, bad character development, music without any relevance, conformistic, and in the end boring beyond believe"
    },
    {
      "rating": "4",
      "text": "I try not to read too many reviews before watching a movie so it doesn't bias my viewing, but after watching the movie and reading all the glowing praise for this \"kid's movie\", I just don't get it. As an adult movie, it is really, horribly inconsistent with so many themes rolled up into one that not very many are done very well. At times, it felt like many superior movies stitched together into a considersably less entertaining whole. The pacing of the movie is jarring and the last third of the movie is more than a little weird. The singing penguins were bizarre in a Baz Luhrman way but in a much more uncomfortable way.... cuz it's supposed to be a kids' movie! Anyone who says \"oh, was it suposed to be a kids' movie?\" doesn't know hollywood very well or seen any of the myriad cross-promotions. I kid you not, the first line you hear the penguins sing is \"you don't have to be beautiful to turn me on, I just need your body baby from dusk til dawn.\" (from Prince's \"Kiss\") and you also get Penguins singing things like \"I'll make love to you\" (Boys II Men). Plus, the \"love story\" in the movie takes a much too complicated turn for little kids. Kids absorb EVERY word and lyric spoken in these movies. They know every song and word by heart. I don't mean to be a prude but I'm going to cringe more than a little if I see a little kid singing \"Kiss\". This movie had so much promise, great action sequences and animation, a noble effort to have a pro-environmental theme, but just in the end, too inconsistent, weird, and disturbing for me."
    },
    {
      "rating": "1",
      "text": "This movie was painful to sit though. If not for my young daughter I would have walked out. Horrible voice work, goofy premise and clumsy handling of the issues."
    },
    {
      "rating": "0",
      "text": "Boring, lame, inapropriate, crude, disturbing, tiring, not funny, and lame again."
    },
    {
      "rating": "1",
      "text": "Is it just me, or was anyone else a little uncomfortable with sexual inuendos in a kids movie? Do we really need penguins to explain sex to our youth (this is the second time, by the way)? I guess I could put up with these squirm-inducing moments if a decent story could be fasioned, but this doesn't happen. Another movie celebrating uniqueness, super. And there are no loveable characters that kids movies demand. Worst kids movie I've seen in a while, and we'll probably see a sequel, since the ever so wise Academy saw it necessary to grant it an Oscar."
    },
    {
      "rating": "1",
      "text": "I normally LOVE animated kids movies like this and, after the amazing reviews I heard for it, I expected this movie to rock. It didn't. It was awful. Maybe it's because I'm an adult and this movie is made for 1 year olds, but I just did NOT get why anyone would like this film! I only enjoyed this movie and laughed once, and that was when a small group of penguins meet Mumble for the first time and offer the ONLY interesting characters. I hated it, don't even rent it."
    },
    {
      "rating": "1",
      "text": "The only problem I had with this movie were the sexual innuendos that went way over the line. I watched this movie for the first time with my 9 year old daughter, who I would not have allowed to see this movie had I known earlier that it should have been rated pg-13. I think the people that rate these movies must have fallen asleep through these parts to have allowed them into the movie with that rating. Parents beware."
    },
    {
      "rating": "0",
      "text": "Happy Feet is the story of Mumble and how he never fits in. Well, it sucked. extremely blatant, it had good effects in all but it was stupid. The humor is weak (I never laughed once). The display of penguins is less fun, and more corky and serious. But this film is for the little kids. This is definitely not suitable. It has content that is innuendo-relaed, sexually-related, and absolutely innapropriate. It also was very disturbing for the younger viewers. And having the humans involved was just lame, at first it was about Mumble trying to prove something, then its all about humans giving penguins the freedom in survival. You can see why it had won the Oscar for best animated film of the year. Its subject is quite big, and it is entertaining, fun, and full of adventure. And they try to base it on the facts of March of the Penguins, but most of us don't care about that. From my opinion, this movie is serious, and not any fun. Overall, it could have been so much better. too make up for this, go see surf's Up, its a great family flick, a lovable and hilarious film. And that movie just makes this one look even worse."
    },
    {
      "rating": "0",
      "text": "This is without a doubt, the worst film I have ever seen. I have literally never hated anything as much as this abomination. I hated not just every second of this film, but every millisecond. This film was mind-blowingly horrible in every conceivable way, and had absolutely no redeeming qualities to speak of. If you want a good animated film about the environment, try the rather good Pixar film; Wall-E."
    },
    {
      "rating": "0",
      "text": "What was this. More of CSI than Happy dancing."
    },
    {
      "rating": "0",
      "text": "This movie is full of Racial propaganda. All the \"cool\" penguins had African/American and Latin overtones and accents while all the nasty penguins that gave them a hard time had Scottish (White) dialects. Then we wonder why our kinds form racial prejudices."
    },
    {
      "rating": "0",
      "text": "I have joined Glenn Beck in his fatwa against Happy Feet. I don't want to be bombarded wiht a political statement everytime I see a animated film. And the fact that this is making the UN seem like gods....I'm disgusted. The UN barely does anything right. Propaganda."
    },
    {
      "rating": "2",
      "text": "This film was a waste of money for anyone over the age of 8 or 9. My sister and I take our 11 year old girls to the movies every weekend. I usually enjoy animated films. This one put me right to sleep."
    },
    {
      "rating": "4",
      "text": "I get the message being told, but did it have to be so bland? Yes, it may have had a few decent songs, but all the characters looked creepy. If you want a better movie, try \"March of the Penguins,\" at least that looks less creepy and more appealing."
    },
    {
      "rating": "0",
      "text": "Uhh... turn off the TV! Horrible. Elijah Wood + Main Protagonist = Sever Displeasure. Honestly do yourslef a favour and DON'T SEE THIS MOVIE! If you want to be tortured don't choose this movie, it'll be worse than fire."
    },
    {
      "rating": "10",
      "text": "I am gonna give this a 10/10. I absolutely love this movie! It is my all time favorite animated feature and has been since I first saw it when it came out. However I do find some things that don't make a lot of sense. Like how did Gloria manage to find Mumble and the Amigos after Mumble was thrown out of Emperor Land? They are in Adelie land and during the seal chase Mumble went through water to find them so either there is a different route they took and she just followed their tracks or she was right behind them but if she was you would think they would have noticed they were being followed long before they did. I would not normally bother to nit pick things like this in such an awesome movie but details to clarify some things are important sometimes."
    },
    {
      "rating": "0",
      "text": "This has to be one of the most boring movie I have ever watched, there isn't a good thing that I can find about this movie, kids and adults of all ages will hate this movie."
    },
    {
      "rating": "6",
      "text": "The story of \"Happy Feet\" doesn't really appeal to the audience, but the cheerful songs do."
    },
    {
      "rating": "0",
      "text": "This is, hands down, the worst movie I've ever seen. Why? Ok, 1st, the storyline was trash. A penguin is born, and in this ridiculous world the producers threw together, penguins are supposed to sing.(what?) But mumble, the penguin, dances instead.(what?) So then he get thrown out of the village and he is somehow compelled to tell humans to stop stealing their fish.(what?) So to ensure the story made even less sense, they threw in characters like lovelace, who have nothing to do with the story at all. Oh, and he gets choked later(Wha-a-a-at?). But to ensure the film was even stupider, they bring you non-animated humans in an animated movie. Nice job, I bet you could get a nick jr. liscense with that! Oh yeah, and the humans dance at the end.(What the-!?) Did that make any sense to you? I bet it didn't. It attempted to be funny, but no. The only remotely funny, or entertaining part at that, were the Spanish penguins. And they lasted about 1/8 of the movie. Come on! So with that information, stay away from this movie, or prepare to have 2 hours (or less) of your life to get sucked out of you. I'll go lay down now."
    },
    {
      "rating": "3",
      "text": "I actually regretted taking my 5 and 4 year-olds to see this movie. There were several things I found rather disturbing about this movie. It had way too much sexual innuendos for a \"kids movie\". I was glad my kids were not old enough to fully understand what was going on. There is a scene where a guru-like penguin named \"Lovelace\" retires to his quarters with a harem of females to... uh, read (I hope). I was also disturbed by the racial stereotyping. I would like to give the benefit of doubt to the producers and think that they were trying to show different ethnic groups tolerating each other and getting along in harmony. But it just doesn't work in this movie. By having the shorter, less serious characters speak Spanish, this film actually does more injustice than good for the Hispanics. Many kids in that theater, including my own, were terrified when the sea lion and killer whales were chasing after Mumble in scenes reminiscent of Jaws. Sometimes being too realistic is not the best in a kids' movie, especially when the characters are trying to kill another. These could have been done in a much less horrifying manner (e.g. Shrek, Nemo). Seeing baby Mumble dance was cute for a while, but it gets tiring very quickly. Over half hour of singing and dancing scenes were a real challenge to sit through. The political statement they are trying to make is very poorly presented. World leaders agreeing to ban commercial fishing in Antarctica only after seeing the penguins dance?!? I still don't get the connection. Are they suggesting that only because of this neat trick the species can perform, they deserve to be conseved? Are they not worth saving otherwise? Do yourself a huge favor. Use the money to see another movie."
    },
    {
      "rating": "0",
      "text": "It really was stupid and inconsistent (and the tap dancing that centered around this movie even blew). I tried to shrug off my lack of enjoyment for this movie by saying \"oh, it's just for very little kids,\" but there are STRANGE sexual scenes throughout the movie, including lines like \"I'll make love you too\" or \"i need your body from dusk till dawn\" or even this uncomfortable scene when the main character dirty dances with another penguin, and another penguin retires for the evening for an implied orgy. WHAT WERE THEY THINKING!?!?!??! Don't even bring your kids to this one!"
    },
    {
      "rating": "1",
      "text": "This movie was terrible!! This was advertised to be a children's movie so we sat down with our 4 year old only to find out it's loaded with sexual over tones and dark themes. As others have said the only funny part of the movie was when Happy Feet met up with the little penguins. This movie was a huge disappointment."
    },
    {
      "rating": "5",
      "text": "While Happy Feet is visually impressive it has too many flaws, and ends up only average, in my opinion. First, it's too long for a kids movie. My 3 yr. old liked it but was antsey with about 30 minutes left. The story is just too convoluted, and keeps going when it should've ended. Brittany Murphy can't sing very well, so I question her being cast as the female penguin whose talent everyone oohs & aaahs over (maybe she wants to start a recording career, and WB cast her to promote her?). And I have to say that casting Robin Williams to voice 2 characters as obvious racial stereotypes was misguided at best, cynical and crass at worst. What, they couldn't find any black or hispanic actors that needed work? The movie does have some good to it, however. There are scenes with real emotional resonance (where Mumbles is kicked out of the graduation day celebration and watches & sways from afar; the scene in the zoo) but ultimately they are few and far between. A simpler \"be yourself\" message without the quest for world salvation would have been sufficient, but regardless 30 minutes could have easily been trimmed from this without much loss. OK but not great, and I agree with others that a couple of scenes are extremely scary for younger viewers."
    },
    {
      "rating": "3",
      "text": "Could have been better if they had skipped the enviornmental theme. It didn't make my feet dance because the good sequences were cut short."
    },
    {
      "rating": "1",
      "text": "Totally GAY. this movie really blew hard! I though i was in a gay penguin bar when I heard the soundtrack (did they play \"I will Survive\"?). I think Robbin Williams is trying to recruit children over to the gay side. with this one. yea yea they'll say the animation was impressive, but it isn't anything we havent seen in a 100 other movies over the last 4 years; a true waste of money and time. (unless you dream of hooking up with a gay penguin boy) the footage should be burned."
    },
    {
      "rating": "3",
      "text": "Visually spectacular, but Happy Feet seems to not know when to end its tedious, seemingly unending story, and thus makes itself the runt in the litter of movies that won Academy Award for Best Animated Feature."
    },
    {
      "rating": "3",
      "text": "Happy Feet is a repetitive, annoying kids movie with a diluted message and one of Robin Williams' career worst (second to Jumanji). And if you are an adult watching this movie, I feel your pain."
    },
    {
      "rating": "6",
      "text": "I rate it a 6, but only because of the graphics. Otherwise, it's typical Disney childrens' fare whose\"wackiness\" shouldn't be mistaken for originality."
    },
    {
      "rating": "10",
      "text": "Yes, this movie is an overtly pro-environment film. Some have even extracted from its message a secondary message that is treated with equal relevance: a request that we practice tolerance toward those who are different. If they are accused of \"extracting\" this message as an aside, then the charge is akin to a dentist spotting a broken molar and saying, \"It's no big deal. I'll get to it when I first rid your mouth of pollutants with a good cleaning.\" Miller makes this a major issue in the flim. As a clergyperson I acknowledge that the dynamics that operate within and define a faith-based community are portrayed as the birth-mother of intolerance. The scene in the movie portraying a destructive community that exercised no care for Sir Elton John's Circle of LIfe even employs the image of a church standing high above the remains of the apathetic community. Is it a fair critique? Herein lies the value of such films: it operates on the assumption that we are intelligent, thinking people who can take criticism and determine its truthfulness and validity. Along with the large number of people in faith-based communities who feel no threat from beliefs that challenge our own, I welcome the challenge. For all who believe the enviornment is the type of issue that addresses the ability of the children in the theater to survive; and, that tolerance for those who tell us \"I wish I could change but I cannot\" is also important for our survival as humans who intentionally nurture and value the spiritual resource of compassion. Miller refuses to let us bury our heads in the sand (or snow). Now, while I am wrestling with the political and faith-based assertions regarding human destiny, the film presented my 3 year old granddaughter with a simple, entertaining story that is, on her level, a new twist on the \"ugle ducking. Thank you George Miller for \"layering\" this movie for young and old, people of faith and those struggling with doubt, and people who embrace this opportunity to revisit their political views. And George, thank you for one heck of a soundtrack! I can understand (no, I can try to understand) why some will devalue this move for not going far enough, or for going too far in a chldren's movie, etc. However, throw down the gauntlet related to my beliefs, entertain my granddaughter, and fill my ears with a soundtrack fusing some of the best samplings of every genre of rock/pop/ dance and hiphop, (utilizing them in just the right places) and I'll give you a 10 because I really believe it is worth it! Maybe this Christmas we can learn to dance!"
    },
    {
      "rating": "6",
      "text": "This movie falls into the okay fare but wouldn't watch it again catergory. It's story is reasonable but with many flaws. Number one, the racial sterotyping. Doesn't work. Number two, it's too long for kids, and not funny, and rather scary. Number three and this is a the big one, the whole plot of ecological action is rushed. The movie skipped from the penguins saying how horrible it is that our fish is taken to lets stop fishing in about two seconds, the ending of this film seemed rushed and tacked on. I'm all for telling the story about how we butcher our planet as I'm a bleeding heart liberal myself, but this is the wrong place and the wrong people. You don't try and preach environmental notions to 7 year olds, they won't get it. Far better to pitch it in another movie designed for elder viewers. This movie should have been for kids, but it wasn't. Oh well."
    },
    {
      "rating": "10",
      "text": "Amazing!! The film was purely great and the people who didn't like it did not have a sense of humor. The movie was great and should get a ten."
    },
    {
      "rating": "9",
      "text": "Absolutely charming ... with breath-taking visuals /amazing CGI. Well worth the entry fee."
    },
    {
      "rating": "7",
      "text": "The concept of a dancing penguin was interesting and quite original to say the least. Happy Feet provided laughs and tears, which most animated films are unable to do for adults. Painfully let down towards the end."
    },
    {
      "rating": "7",
      "text": "Cool 3d animation musical about the life of penguins. Got Oscar, but in my opinion, Cars 3d animation was much better."
    },
    {
      "rating": "8",
      "text": "This movie is actually pretty great- the animation is beautiful, the music is catchy, the dancing looks very fluid, and although the story feels unevenly paced (all the zaniness happens at the end) and it reaches too far, it's an overall great film."
    },
    {
      "rating": "10",
      "text": "La mejor pelicula que habla la verdad en una forma un poco mas clara en una perspectiva muy distinta, ojala hagan mas de estas!! Nuestro Planeta lo estamos Destruyendo y nadie hace nada!!! Felicitaciones Warner Brothers hagan mas de estas!!!"
    },
    {
      "rating": "7",
      "text": "Not a children's movie, no one under 12 should see this movie due to adult themes that those under 4 may not understand. I enjoyed watching dancing penquins and the enviromental slant at the end didn't bother me or detract from the good story."
    },
    {
      "rating": "8",
      "text": "\"Happy Feet\" is a kids movie; it's also a surprisingly intellectual one. When the penguin elders blame dance for a dip in the fish supply, you'll hear unmistakable echoes of irrational claims made by religious zealots who explain some calamity as being the result of sin. \"Happy Feet\" also quotes \"Close Encounters of the Third Kind\" with clever subtlety. Music is used to communicate with the extra-terrestrials in the Spielberg film, but it's dance that is used here to \"talk\" with the \"aliens\". Mumble(Elijah Wood) is a prophet(dance is used here as the gospel, or perhaps, Esperanto expressed in a kinetic form) of sorts; rather than speak in tongues, he speaks with his feet to communicate with a higher being. Interestingly, the religion(or organized paganism) in this penguin society is secular music(although Queen's \"Somebody to Love\" has distinct gospel overtones). Popular song is the text that's followed by the flightless orthodox. These birds are godless Bacchanal heathens who bump and grind to salacious Prince songs. You know, maybe this isn't a kids' movie after all."
    },
    {
      "rating": "7",
      "text": "Happy Feet is a very weird and dark film, notably the scenes where Mumble is locked in a zoo, and looses his mind, then throws fish at wall, and where Mumbles father Nemphis goes: \"there hasn't been one day, not one day, that I haven't done right by you\" in a dark murky cave. but, surprisingly this movie teaches some sensible depth. The movie is highly hell-bent on teaching the enviromental message of food shortage: fish for penguins becoming lesser abd lesser each day, its nice to see that in a kids cartoon venture. Packed with hot musical numbers, and exceptional computer animation, Happy Feet will dazzle all kids and parents alike with its sensible depth and nice music songs and animation."
    },
    {
      "rating": "9",
      "text": "I personally loved this movie. It has amazing animation, top notch voice talent and well placed and enjoyable dance numbers But it also has some darker themes but these i think go very well with the movie. One of the best reviews that i read about this movie is that its a portayal of \"penguin hell\" basically. Sure we all know what conservation issues look to humans... because well we are humans. But this movie has an interesting perspective and has a conservation issue (in this case overfishing) from the point of view from the penguins. Throughout the movie you can see examples of this. For example, mumble's disbelief when he discoveres some trash floating in the ocean. \"the aliens must be here... i mean why would they leave all of this behind?\" Ive read a lot of reviews about this movie, and the main points of them not liking it are: *The main antagonist may have people thinking that this movie is attacking religion *There are at 2 kinda scary scenes that might not be suitable for little little kids, but then again this movie is rated PG for a reason *People think that just because this movie is trying to make people aware of conservation issues that it automatically sucks. It doesn't. *People are suprised at the somewhat darker themes that are portrayed in the movie, when they thought they were going to see a happy little movie about dancing penguins. I kinda agree that the movies was kinda incorrectly advertised, but i enjoyed it more this way. Overall, walk into this movie with an open mind, and try to enjoy it. If you cannot possibly like it then fine. But just know that this movie does have a 77 here on metacritic, a 75 on rotten tomatoes, and both translate to \"favorable reviews\". Give the movie a chance, thats all anyone can ask."
    },
    {
      "rating": "10",
      "text": "This movie was adorable! Although advertised for children, there are catchy lines that keep adults laughing, and children dancing in their seats. The song choice, at large catering to the adults, were hilarious selections, and it's plot appeals to all ages. I took my four year old to see the movie and he loved it, kids don't lie. As far as sexual comments, first of all, these comments were not very recognizable to most and certainly not children and second, what movie does not have sexual suggestions? Not many. And third, what kind of people really allow these comments to cloud the rest of the brilliant animation? Come on, are you nuns?"
    },
    {
      "rating": "8",
      "text": "Great movie. It's like a broadway musical animated into a movie by warner brothers. Like my brother said though, these penguins really are, \"Sex-demons\"."
    },
    {
      "rating": "10",
      "text": "You should see Happy Feet--not only because it's stupendous, but also because it features the best dancing you'll see on the screen this year."
    }
  ],
  "recommendations": [
    "cloudy_with_a_chance_of_meatballs",
    "the_smurfs",
    "the_angry_birds_movie_2",
    "coraline",
    "dora_and_the_lost_city_of_gold",
    "alvin_and_the_chipmunks_chipwrecked",
    "uglydolls",
    "where_the_wild_things_are",
    "my_little_pony_equestria_girls_forgotten_friendship",
    "the_angry_birds_movie",
    "alvin_and_the_chipmunks_the_road_chip",
    "free_birds",
    "cloudy_with_a_chance_of_meatballs_2",
    "chicken_little",
    "the_boss_baby_christmas_bonus",
    "the_lego_movie_2_the_second_part",
    "the_lego_movie",
    "we_can_be_heroes",
    "shark_tale",
    "the_boss_baby_family_business",
    "bridge_to_terabithia",
    "frozen_ii",
    "astro_boy",
    "paranorman",
    "the_croods_a_new_age"
  ]
}