{
  "id": 3871,
  "title": "Happiest Season",
  "starring": [
    "Kristen Stewart",
    "Mackenzie Davis"
  ],
  "runtime": 102,
  "genre": [
    "Romance",
    "Comedy"
  ],
  "description": "A young woman's plans to propose to her girlfriend while at her family's annual holiday party are upended when she discovers her partner hasn't yet come out to her conservative parents.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vzec9kkOSE93tygyfOktedkeOQ.jpg",
  "categories": {
    "plot": 5.315789473684211,
    "acting": 7.529411764705882,
    "ending": 4.0,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "It's a nice movie about learning to love your family and it's fun despite being too serious to be a classic"
    },
    {
      "rating": "10",
      "text": "Can't even begin to describe how relatable this movie was to me. The performances were absolutely delightful. I laughed, cried and this is the representation I've been looking for, for years! Thank you Clea Duvall and the whole team behind this wonderful movie."
    },
    {
      "rating": "10",
      "text": "that was really good, i really haven't watched anything this good since poalof, i legit think i might have a new favourite, the subtle, smallest little thing that the cast did, especially aubrey, was just outstanding, kristen's acting was just so realistic, and the storyline was great, definitely can see this happening in real life, and ill say this, i would've hate to be abby (kristen) in a relationship i really do, but if i ever wanna get into a serious relationship, chances are i will be abby, left out, third wheel, awkward, overall socially bad with everyone except my partner, with all of that being said, this movie is just fantastic"
    },
    {
      "rating": "0",
      "text": "Terrible rep for the queer community. Harper was unlikeable to point of being irredeemable. Boring to boot. Abby and Riley should've ended up together."
    },
    {
      "rating": "10",
      "text": "One of my favorite lesbian movies to rival \"Imagine Me & You.\" It manages to be hilarious, relatable, and genuine all at the same time. Kristen Stewart's performance is especially notable. It's a new Christmas favorite."
    },
    {
      "rating": "10",
      "text": "Harper was a straight up villain. Otherwise, this film, writing, and cast were fantastic."
    },
    {
      "rating": "9",
      "text": "Really sweet and fun movie. Daniel Levy is the MVP here. He's amazing in this and now I want to watch Schitt's Creek. Hope it gets a sequel."
    },
    {
      "rating": "8",
      "text": "Originally intended for theatrical release this charming LGBT Christmas movie explores the struggles many of us gay people face when it comes to our families and the holiday season. Starring Kristen Stewart as one half of a lesbian couple who is invited by her girlfriend played by Mackenzie Davis of Terminator Dark Fate to spend the holidays with her family. Along the way she tells her that the family doesn't know shes gay or that she's bringing her girlfriend. Funny scenarios as well as heart wrenching ones ensue. The movie is quite refined in the way it explores its subject matter and for that reason, that's what sets it apart. The brilliant Dan Levy of the phenomenal Schitts Creek stars as Stewart's gay bff. Mary Steenburgen (book club), Allison Brie (Glow), Victor Garber and an awesome Aubrey Plaza also star. The film is director confidently by one of my favorite actresses Clea Duvall. It's definitely a must see.****.25/5"
    },
    {
      "rating": "2",
      "text": "If I wanted to watch two hours of gaslighting I could've just watched a Trump rally. Harper is one of the most unlikable characters I have ever witnessed. I was expecting to relate to her more (for various reasons) but found myself yelling at the TV.The characters on the periphery were the most interesting, but not enough to carry the movie.LGBTQ+ rom coms don't have to center around coming out and secret keeping...Also, having the only two prominent POC characters being written into a lazy infidelity storyline was... odd."
    },
    {
      "rating": "0",
      "text": "Esta es una película que cree que cumpliendo una agenda política salvará su terrible guión y su terrible narrativa con personajes con los que es imposible tener empatía.This is a film that believes that fulfilling a political agenda will save its terrible script and its terrible narrative with characters with whom it is impossible to have empathy."
    },
    {
      "rating": "10",
      "text": "It's sooo good, it's gonna make you emotional and laugh, sometimes both at the same time but it's also very cute."
    },
    {
      "rating": "0",
      "text": "Me and my partner regret having wasted time watching this trash. I made an account solely to call it the garbage it is."
    },
    {
      "rating": "10",
      "text": "Very funny and emotional the same time ,realistic I think a lot of people will relate to many of the situation-amazing cast really they made it perfect even tho it's not perfect -loved it honestly just watch it"
    },
    {
      "rating": "10",
      "text": "It does what it sets out to do -- with intelligence and heart. It's not art, but it's a very satisfying story."
    },
    {
      "rating": "10",
      "text": "So humorous to watch, Simple,lovely  and loved itTotally The best entertainer"
    },
    {
      "rating": "10",
      "text": "Better than I expected, Kristen Stewart's best performance yet, not that that's saying much. In all actuality it's an 8/10, but first LGBTQ+ christmas movie so best mobie ebah."
    },
    {
      "rating": "10",
      "text": "Beautiful Christmas movie, fun and exciting at the same time, Kristen Stewart at her best, I really liked this movie."
    },
    {
      "rating": "10",
      "text": "Amazing fot the holidays! Super fun and touching movie. Great characters, is good to have no stereotypes."
    },
    {
      "rating": "10",
      "text": "I loved this movie it was funny and heartwarming. The characters were well written and they depicted coming out really well."
    },
    {
      "rating": "10",
      "text": "This movie is practically the gay hall of fame lmao, we need more relatable queer stories told around the holidays and this movie is a good example of that."
    },
    {
      "rating": "10",
      "text": "Happiest Season was phenomenal! It was funny, it was heartbreaking, it was hopeful, and it was jolly! Also, great representation. Kristen Stewart and MacKenzie Davis were so incredible and gave very realistic performances, especially in regards to coming out and familial expectations. Dan Levy was amazing. Aubrey Plaza was pleasant surprise (if not a total scene stealer). Also, the character Jane was perfect in every way. This movie is a must see for the holidays!"
    },
    {
      "rating": "9",
      "text": "The rom-com I've been waiting for my entire life, a feel-good Christmas movie with KStew, Mackenzie Davis, and Aubrey Plaza...what else would you ever need?"
    },
    {
      "rating": "7",
      "text": "If you're not exhausted by all of those romantic Hallmark Christmas movies that have populated almost every basic cable channel, then you should venture over to Hulu to check out its latest original movie, Happiest Season. Unlike your run-of-the-mill Hallmark fare, Happiest Season has actual movie stars and some semblance of a budget. The film attempts to infuse that romantic comedy vibe into what happens when your girlfriend invites you home for Christmas and along the way she tells you that her parents don't know she's a lesbian and you'll have to pretend to be just her platonic, orphan roommate for 5 days. We've all been there in some shape or form; nevertheless, hijinks ensue.Directed by Clea Duvall and co-written by Duvall and Mary Holland, Happiest Season tells the fish-out-of-water story crossed with the poignant theme of the struggle to hide your identity added in there. It is all wrapped in the cozy Christmas blanket of one of those ensemble family holiday tropes. Kristen Stewart stars as little orphan Abby, who doesn't like Christmas, but she's happy to be a part of the holiday family traditions with her girlfriend, Harper, played by Mackenzie Davis, until things are complicated by Harper still being in the closet to her conservative and hyper-competitive family. Abby is forced to endure both a holiday she doesn't enjoy and being set aside so her partner can pretend to be something she's not.The unfortunate part of Happiest Season is that Harper and her family come off as completely unlikeable, except for youngest sister Jane, played by co-writer, Mary Holland. Jane has some of the funniest moments as the most authentic person in the family. While the actors do a good job of playing their parts, the writing of the characters doesn't make a case for why Abby would want to be a part of the family. If this is a romantic comedy, then there is a failure to provide the romance, especially in the central characters. It never really makes sense why Abby and Mackenzie would be together and this trip would otherwise solidify that.The comedy bit is more successful. Daniel Levy pops up throughout as Abby's best friend, John. He has some good lines and is a welcome presence. Alison Brie also does her best as Harper's uptight sister. As I mentioned before, Jane cracked me up each time she was around. As these Christmas movies go, it ticks the boxes on being inoffensive, relatively fun and pleasant. The message about family at this time of year, in this year in particular, hits home.Although the central mission of Happiest Season doesn't quite work, overall the film is pleasant and a good addition to the Christmas film queue. There are some laughs and, if you like Christmas, you'll get Christmas. Because of Daniel Levy and Mary Holland, you can just turn on this movie with a bowl of popcorn and have some chuckles throughout the holiday season."
    },
    {
      "rating": "1",
      "text": "Why does Kristen Stewart look like she's managing a dull headache in every role? In this case it might've been because she was stuck in this lazy lesbian Christmas turkey that is so aggressively diverse it ALMOST distracts the viewer from the fact the film is a turgid slog into holiday film hell. - 1 star"
    },
    {
      "rating": "10",
      "text": "Just an enjoyable movie with an amazing cast!Funny,touching and the pace of the movie is very good as well.This movie is a treat for christmas and while its cheesy sometimes you can expect it from a christmas movie."
    },
    {
      "rating": "4",
      "text": "It's a fairly feel-good film, but it's so sweetened, that it ends up cloying the palate.Putting aside the positive element of its inclusive theme, the problems lie in the fact that its narrative resources of acceptance and pain are rooted in cliches of \"moments of revelation\", therefore the climax and the conflict are so predictable that you see them coming almost from the beginning, and that, no matter how hard it tries, the film never manages to shake it off.And it takes that issue until the end, because for that same romantic and Christmas theme, the film has no choice but to unify the entire plot in a happy ending, so naturally you know where everything is going at all times.So the whole functional capability of this film lies in how much you're willing to buy from it as a viewer.If you're looking for a story like this to have a good time, you will love it, but it will only take you that far, yet in the end, that's all this film is looking for."
    },
    {
      "rating": "10",
      "text": "Happiest Season is now one of my favorite Christmas movies and romcom's of all time, this is one of my favorite movies of 2020. The writing was outstanding, a beautiful and touching story with a nice amount of comedy in it. Kristen Stewart, Dan Levy, Mary Holland, Mary Steenburgen, Mackenzie Davis, and Alison Brie gave excellent performances, they gave really funny performances and Kristen, Mary Steenburgen, and Mackenzie's performances were also emotionally powerful. The costumes especially ones wore by Kristen Stewart, Dan Levy, Alison Brie, and Mary Steenburgen were terrific. The music was superb. This was an A+ movie, love to see the continuous LGBTQ+ representation in mainstream media."
    },
    {
      "rating": "10",
      "text": "Loved this movie! Great writing, story, acting, and memorable characters. Especially loved Abby (Kristen Stewart) and Riley (Aubrey Plaza) and would love a sequel centered around them."
    },
    {
      "rating": "2",
      "text": "Dan Levy's scenes are the only factor keeping this movie from negative stars. At one point one would think the movie is a Hallmark spoof, but no that is the real plot. Thewriting is terrible.If you can get cuts of Levy on you tube that is the way to go"
    },
    {
      "rating": "3",
      "text": "Horrible family treats visitor horribly and instead of leaving to escape the abuse she....stays. The end."
    },
    {
      "rating": "6",
      "text": "i actually laughed.... accidentaly bumped into it on netflix after we ran out of good english movies to watch, with no drugs and vulgar words. lesbian theme is usu not in our repertoire to watch. the twilight girl is actually quite funny because the director used her inability to act and mumbling very well.good lines and with support of a few veteran colleagues made this holiday rom comp palatable."
    }
  ]
}