{"id": 626, "title": "Happier Than Ever: A Love Letter to Los Angeles", "starring": ["Billie Eilish", "Gustavo Dudamel"], "runtime": 65, "genre": ["Music", "Documentary"], "description": "Fresh off the heels of her brand-new album, \"Happier Than Ever,\" this cinematic concert experience features an intimate performance of every song in the album's sequential order – for the first and only time – from the stage of the legendary Hollywood Bowl.", "releaseYear": "2021", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/xkwPau62JRSeRqOtAe6THSA0yz4.jpg", "categories": {"plot": 5.0, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "It is one of the best concerts I’ve ever seen, also I really like the album"}, {"rating": "10", "text": "Spectacular, tasteful, exquisite concert experience!!! Billie aced it all, same goes for all the featured performers. The movie was like a warm hug, and this album is a brilliant, timeless gem. I can't fathom how those newspaper critics who shaded it dare to rate it less than 100. Are they dumb, tone-deaf or just mean??? Who hires the people like that to write reviews??? Their articles are lifeless, boring and still they  project their flaws on Billie - easier to blame her than their lack of musical perception."}, {"rating": "10", "text": "the best experience musical whit billie love how she do the best concert of the year"}, {"rating": "10", "text": "Billie Eilish is amazing…and her “Love Letter to Los Angeles” was incredible. So talented…her and brother FINNEAS. I LOVE HEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEER!"}, {"rating": "8", "text": "Stunning visuals. The animated segments enhance Billie's discourse, and the musical numbers are beyond amazing. This concert film showcases Eilish's talent and an essential message about self-love and not giving a damn about what everyone else thinks about you."}, {"rating": "10", "text": "Fantástico! Neste belíssimo concerto acompanhando por uma incrível orquestra, Billie Eilish canta todas as faixas do seu aclamadíssimo segundo álbum de estúdio \"Happier Than Ever\". Através de uma versão animada (cartoon) criada da cantora, nós somos apresentados a LA - uma cidade encantadora.Em Happier Than Ever: A Love Letter To Los Angeles, Billie nos entrega uma diferente forma de escutar seu álbum e, talvez, ela tenha conseguido tornar a experiência ainda mais encantadora."}, {"rating": "10", "text": "O coral em Goldwing me surpreendeu tanto, passei a gostar ainda mais dessa música depois de assistir o concerto. E no final, quando a Billie canta o primeiro verso de Happier than Ever pra si mesma, me deixou bastante reflexivo. Seria HTE uma extensão de I don't wanna be you anymore? Enfim, Billie Bossa Nova me impressionou demais também principalmente porque a Billie mudou um pouco a interpretação da música. E alguns instrumentais adicionados deixou tudo mais interessante, como se quisessem explorar o potencial de cada faixa. Adoraria que colocassem esse concerto no Spotify."}, {"rating": "10", "text": "AAAAAAAHHH, Billie and her brother didn't disappoints us, AS ALWAYS. THIS IS SO GOOD."}], "recommendations": ["mary_poppins", "sweeney_todd_the_demon_barber_of_fleet_street", "cats", "walk_the_line", "respect", "burlesque", "letters_to_juliet", "the_nightmare_before_christmas", "mary_poppins_returns", "la_la_land", "almost_famous", "the_blues_brothers", "the_aristocats", "rocketman", "hairspray", "grease", "mamma_mia", "quo_vadis", "chicago", "moulin_rouge", "vivo", "sing", "the_muppets", "bohemian_rhapsody", "begin_again"]}