{"id": 2043, "title": "Happy Death Day", "starring": ["Jessica Rothe", "Israel Broussard"], "runtime": 97, "genre": ["Horror", "Mystery", "Comedy"], "description": "Caught in a bizarre and terrifying time warp, college student Tree finds herself repeatedly reliving the day of her murder, ultimately realizing that she must identify the killer and the reason for her death before her chances of survival run out.", "releaseYear": "2017", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/cTaEIUYTt52ooq9quVbAQ7NpGwo.jpg", "categories": {"plot": 7.2, "acting": 7.129032258064516, "ending": 7.195121951219512, "soundtrack": 6.0, "cinematography": 6.0, "familyFriendly": 6.0, "funny": 6.863636363636363, "action": 6.0}, "reviews": [{"rating": "4", "text": "This has been promoted as a combo of Groundhog Day and Scream, but I only saw one of those reflected in this average thriller. A college coed wakes up on her birthday only to be murdered by a baby-faced stalker. Each time she dies, she wakes up back in the same dorm room and the only way to stop the cycle is to identify the killer. It's adequately made, but the suspense sequences aren't especially original or even mildly frightening. The satirical self-aware comic insights (a la Scream) never materialize. It's slightly fun to watch her solve the puzzle, but there's little about this film that makes it special."}, {"rating": "5", "text": "In Happy Death Day, a college student relives the day of her murder with both its unexceptional details and terrifying end until she discovers her killer's identity. So, basically, Groundhog Day meets generic teen thriller, heavy on the generic teen thriller.Tree Gelbman* (Jessica Rothe), our lead heroine, is classic movie sorority girl. All she cares about is how she looks and how guys think she looks. The film follows Tree on her birthday and quickly establishes that she’s inconsiderate to everyone in her life that doesn’t fall into those categories. This includes her roommate, other students on campus, and even her own father. Tree’s birthday ends with her own murder at the hands of a masked killer. She then wakes up to find that she has started the day over and must continuing dying until unmasking and stopping her killer. Along the way she may just learn to… you guessed it… become a better person.*Yes, her name is Tree. No, it’s not explained.As Tree tries to solve her own murder, she is helped by a fellow student named Carter. It’s Carter’s bed that Tree wakes up in every morning, but they had only just met the night before. Carter is the awkward, nice guy that Tree would never usually go for. Can you see where this is headed? The usual popular girl/nerdy guy trope gets complicated here due to the fact that the defining feature of Carter that clearly and visibly wins Tree over is that he did not take advantage of her when she was drunk. This is her baseline for a nice guy. The revelation that Carter didn’t sleep with Tree is played for swoons. It comes off as problematic.Where Happy Death Day tries to put itself above other generic slashers before it is its sense of fun. When head sorority girl Danielle asks a sister, “What even is breakfast, Becky?” I was relieved to realize this wasn’t a film taking itself too seriously. When Danielle later explains to Tree that deja vu actually just means someone is thinking about you while masterbating, I realized I would much rather watch a movie about Danielle. Hell, I’d watch that every week on tv. Awful sorority girls saying awful things while people are being viciously slaughtered all around them? Sounds like a show Ryan Murphy would make. They could even call it “Scream Queens”. I’m sure it would be a huge success.Ultimately, Happy Death Day is a movie that works, if only in the slightest, in spite of its many flaws. It’s got a fairly generic plot told in a fairly safe way. The many deaths of Tree aren’t especially creative. She is stabbed under a bridge, she is stabbed in her room, she is stabbed in some guy’s room. It’s the comedic bits, as hit-or-miss as they are, that hold this film together. Is it a good movie? No. Is it an entertaining movie? Sometimes."}, {"rating": "6", "text": "Groundhog Day as a slasher flick is such a ripe premise that I'm surprised it took this long to make a film of it. We get to watch the main character get butchered a whole bunch of times in a bunch of different ways by a masked psycho all while trying to solve the mystery of whom is doing it. It's perfect really. The film definitely has its fun with this too, and has a game performance from the lead actress Jessica Rothe.Unfortunately it's a bit of a neutered affair, what with the PG-13 rating and fairly rote storytelling mechanics. Death scenes are less Final Destination levels of fun - where the surprise is how she will die while trying to avoid death - and more stalk and slash and quick cut away from any good gore. The plot has a twist, and it's not bad, but there were a lot of areas where the film could have become even twistier. It also could have laid off the moralizing about becoming a better woman stuff a bit - this is slasher Groundhog Day, not actually the real thing. We already have that."}, {"rating": "6", "text": "The \"Groundhog Day\"/\"Edge Of Tomorrow\" formula gets put to the test once again in \"Happy Death Day,\" a slasher comedy that plays out pretty much exactly as you'd expect (thanks in no small part to that formula mentioned above). And with a predictable-as-all-hell third act twist capstoning this one, you'd think I wouldn't enjoy it. And yet, I - for the most part - did. Sure, the charming lead performance helps, but I think the x-factor here is just the simple fact that this is yet another competently made horror movie that made its way past my eyes without making me want to void one of my orifices. Yep. Definitely helped."}, {"rating": "7", "text": "Happy Death Day is a surprisingly charming, adept attempt at making a horror/comedy. The film is adequately made. The story is fun. The acting is nothing special, except for the performance of  Jessica Rothe. She is fantastic in this movie. She's a very charismatic lead, and she carries the film on her shoulders. Her portrayal of Tree Gelbman easily elevates the film to a 7 for me. Other than that, there's not a whole lot here. I did appreciate how self aware the movie was, and it made the self awareness work in the humor department. It's not really scary at all, but it is an interesting concept."}, {"rating": "7", "text": "Happy death day is something special. Thriller, but there's more. Comic movie? yes, just a little bit. Genial horro-comic movie. Something new and interesting. Well done!"}, {"rating": "7", "text": "So this was a movie that I rented expecting to possibly laugh at the bad horror movie.  It ended up being a competent horror/comedy/mystery movie.  I would say that the movie had quite a bit of charm and character development for a movie I expected nothing out of.  It even goes out of its way to reference Groundhog Day, poking fun at itself.  It's not a masterpiece, but I really enjoyed it."}, {"rating": "6", "text": "\"Scary Movie\", \"Scream\" and Groundhog Day adopt a wicked baby maskOn this base idea is set up Blumhouse Productions' latest big hit, Jason Blum's production company has been crowned as the only studio to make a huge profit at the box office with low-budget medium-high quality films. Being its 13th flick with a respectable worldwide grossing, \"Happy Death Day\" must be considered, besides an extra proof of Blumhouse vigor and vitality, as a breath of fresh air for commercial slasher cinema, one to which, little to little, they bury it the stake further inside.The main disadvantage with the script doesn't lie in the combination of genres, otherwise, that's one of the most remarkable features of the film, the drawback is the way to tie up some loose ends, because, in fact, they are closed to so much pressure that coherence threads are abruptly detached. As a thriller, mystery whodunit, the interest of audience will be placed in the resolution of the homicide, consequently, if you want to carry the genre proudly, should manipulate the perceptions of each spectator in order to cast doubt before the more insignificant detail, here, although interesting bets are proposed in the course of the third act, the truth about who's behind the creepy mask is not a great thing at all. Fortunately, the film keeps enough vigor, dynamic and strength in montage sets, performances and narrative circumstances that make it more than energetic, fascinating and entertaining the rebirth of our protagonist anti-heroine.As writer sets on the one side of the triumphant Blumhouse balance equation, on the other side, the director acts as a counterbalance. Although Christopher Landon's name seems Lilliputian compared with film-savvies as James Wan or M. Night Shyamalan,  his most recent pic would be the first great milestone in his ascending career, even though he has a long, long way to enroll in the major leagues. Landon provides newness and daring for a film that could easily have fallen into muddy plots of aimless comedy, dysfunctional horror or soporific thriller; here, the filmmaker reveals his contemporary thinking by transmitting young-focused company MTV's \"Teen Mom\" on Tree's TV instead of any Hitchcock's or Coppola's classics; here, Landon places a female Bill Murray imprisoned in a college campus; drastic swaps that benefit the feel-good that radiates the ending of the film. Evaluating the work of the director through the final result, one could say that the man behind \"Scouts Guide to the Zombie Apocalypse\" has just gained a great improvement in terms of filmmaking and control is concerned, Every filmmaker who demonstrates a professional advancement deserves a heated ovation, however, taking into consideration Landon's labor, half of the continent must stand up and applaud him, congratulations, a future colleague.Uni and Blumhouse manage to deliver an entertaining contemporary story with honors, they can produce a five-star action thriller, abduction suspense one or murder-solving one, simply, shows off the aces up its sleeve and leap them, without clemency, on the face of the spectator. The particular montage, the nice pictures and the excellent score team up in a moderately phenomenal way, although, visually, they are restricted by the number of scenarios shown in the first twenty minutes, however, the lack of possibilities encourages productivity and originality that end up in magnificent films, in this case, it's testified through interesting camera movements, amazing angles, and very old-school approaches; the saying: creativity is the only weapon emerging from low-budget and narrative constraints is very true. The soundtrack deserves special mention, it seems to mock 80's horror flick, its stridency and apparent jocularity are mixed with the same functionality as the images, its melodies recall \"Scream\", and even, there are explicit scenes which lead to our memory, without any remedy, to Wes Craven's film; great job Bear McCreary, no doubt, the best aspect of the film.Christopher Landon's \"Happy Death Day\" positions itself on the throne of the horror and youthful-humored satire of the year, not merely because of its picturesque premise, but because of the appropriate levels of execution and narrative approach it presents. Although never taking itself too seriously, it serves as a fortifying incentive for the association between studios, verifying that they are on the right way, a path brimming with originality and magnetism that would not be defaced by low-budgets. Sadly, the film is left behind compared to its contenders, experimenting a sense of emptiness at the end of the showtime, shows that, at least narratively, has been a partially lost opportunity. Undoubtedly, Landon's film had the perfect tools to become huge, but with the result, it only got to be big. Let us blow out our candle of desires and we pray together for longevity and vitality of this alliance."}, {"rating": "4", "text": "A college student must relive the same day over and over. On the plus side it's her Birthday but on the not so plus side she keeps getting murdered by some guy in a baby face mask. It's ludicrous but if you want a little cinematic entertainment this weekend then here's your choice because it's definitely one of the better bad movies out right now. A light-hearted slasher movie just in time for Halloween. And if you still need more encouragement they've put Get Out, The Purge and The Visit on the poster for good measure.It ticks nearly all the boxes and delivers what it promises, unlike a certain other movie I saw this weekend. That's right I'm looking at you Geostorm. You've got the horror slasher movie aspect mixed with a fair amount of comedy. Unfortunately a lot of this movie has been spoiled by its own trailer which is disappointing. So if you've managed to avoid the trailer and intend on seeing Happy Death Day keep it that way. The acting isn't up to much and I don't think I recognised a single person in this. It also could have done without the whole \"well I'm reliving the same day over and over so I'm gonna re-evaluate my whole life and become a better person\" message. The biggest problem is it falls apart in the last act but what more can you expect really. A lot of horror movies suffer in the third act and Happy Death Day just descended into a mess. What started with a simplistic idea well executed changed and I found myself getting bored and wishing for the end credits to appear. Recommended popcorn movie if you’ve nothing better to do."}, {"rating": "9", "text": "I love it.It is supposed to be a horror movie.But Tree made me laugh.She fought criminals in order to make her birthday happy.It was very short film for only 96 minutes.I really enjoyed it."}, {"rating": "6", "text": "We already know the style, we know its foundations, its cliches and its tricks, Happy Death Day is a slasher teen film in every sense and in a genre so degraded, sometimes it's incredible to be functional, not to say innovative.Happy Death Day is not the exception at any time, especially because it is focused on entertaining simplistic audiences, I'm sorry but it's true, the film falls heavily on its narrative system and is evident because it becomes an exercise of repetition, it's true it changes the scenarios but everything is so mechanized that there is really no suspense or surprise, it is almost as if we are watching the protagonist in a video game unable to advance a level.Jessica Rothe, the protagonist is nice, that helps a lot, a more annoying character would have affected the overall performance of the film.She is expressive and emotive trying to discover her killer, the general point that becomes the best reason to finish this movie, after all as I said the sequences lack suspense so what becomes more important and interesting is to discover the mistery.Happy Death Day is in every sense a repetition with variations, it does not build anything new but it's sufficiently entertaining and functional to excel over many other failures of the genre and above all it will be very pleasing for its intended audience. The movie delivers good accounts but I wasn't really satisfied."}, {"rating": "8", "text": "I'm not surprised about the mixed reviews this movie got. Actually, I don't think this movie was THAT bad, i really like it. Of course it is not the scariest movie ever made, but still, it's enjoyable to watch it. The actors are good, especially Jessica Rothe who I found was pretty majestic in her role, she portrays fear so well. And the anticlimax was so unpredictable, as we like it to be. I'd watch it again of course."}, {"rating": "10", "text": "Great thriller, with good acting. It had elements of Halloween and other slashers while leaving out all the gore. My heart was pounding on more then one occasion. Classy in it's execution, and suitable to watch with my 13 years old."}, {"rating": "4", "text": "This is a a 4-5/10 movie.  Nothing special.  It's not Groundhog Day meets Scream, it's more like Groundhog Day meets Mean Girls with a killer.   Wait for amazon/Netflix or dvd/bluray."}, {"rating": "5", "text": "What do you get when during development of this movie, you thought of someone's birthday and combining it with traditional horror film equipment? You get Happy Death Day. Sure it's not worth seeing outside Halloween due to a failed attempt to make this film memorable when October is over, but it does rely itself on a few things it hardly offers when the film advances to the end."}, {"rating": "3", "text": "It's just too silly for my tastes. This is a TV movie that doesn't belong on the big screen. Even with a twist, 'HDD' doesn't do anything that hasn't been done before (I think it borrows a lot from 'Before I Fall'), and at times, a pain to watch. Surprisingly, I guessed who the killer is from the get go (pay attention to people's height). Lastly, I wish this type of movie would address the 'why'- like why a person can repeat the day over and over again; or what power is behind this?"}, {"rating": "6", "text": "One of the bummers of this movie is that the \"It's your birthday\" song from the trailer is not in the movie at all. The birthday ringtone from her father is some other stupid tune.  And the film is not nearly as tightly constructed as Groundhog Day.  I will say, however, that the lead actress is excellent.  She can carry the movie."}, {"rating": "10", "text": "Happy Death Day was definitely an entertaining film to watch. It’s like Groundhog Day mixed with Scream. Although Happy Death Day premiered on Friday October 13th, this movie was more humorous than a thriller. It had a lot of great moments and some of these one liners, knee slappers. The acting was pretty solid with a great lead actress as well as a cute romance that will make your heart flutter. While some may have considered this movie a “dud”, because it wasn’t “exactly like the movies it portrayed” or wasn’t “as good as the originals” I would have to disagree. Yes, this movie played a twist on other movies such as Scream and Groundhog Day, but it was a unique combination and did an excellent job of keeping me on the edge of my seat, waiting to see what would happen next, and that ending, AMAZING. I would definitely recommend it."}, {"rating": "8", "text": "Horror movie meets Groundhog's Day.  It works and it was fun.  I left wanting more.  Not in the sense of waking up to watch it over and over again, but I wanted more of this and I hope they make enough money to consider making a sequel or a similar story with other characters.  I do not care, the premise works for me.  Horror movies do not have to be so serious to be entertaining.  The Evil Dead franchise has proven that."}, {"rating": "7", "text": "A film that is hectic and fun with a very charming cast of excellent young actors. I saw Groundhog Day many years ago, and it seems to me this is quite a different film, so don’t think it is any kind of “remake,” but just an enjoyable movie that borrows a basic plot idea. Maybe it’s occasionally too preachy and Pollyanna-ish (unlike any Bill Murray film you’ll ever see), but it’s still enjoyable."}, {"rating": "3", "text": "This film was so cheesy and laughable, it's hard to believe it wasn't made for TV. It tells an utterly forgettable story that doesn't even bother to take itself seriously. The only part that did surprise me was the ending, though even that was confusing and easily dismiss-able. Its only redeeming quality is the fact that is sometimes made for a good comedy, which is odd for a movie that seemed present itself as a thriller."}, {"rating": "6", "text": "Surprisingly good. Even though it is a horror Groundhog Day like Groundhog Day it takes a lot of the crazy scenarios and make comedy out of it, and they actually make a reference to it too, which was great. The acting overall is really good and the movie is actually really enjoyable. Yes there are the horror trope cliches and that’s fine, but with so many bad horror films now this year has given it a fresh breath of air into the genre."}, {"rating": "9", "text": "For most people, your birthday is a happy event that is spent with friends and family. But what if you were stuck in a never ending loop, where you meet your end only to wake up and start the day again? That’s the premise of the recent Happy Death Day, which is similar to a dark version of Bill Murray’s Groundhog Day and delivers on many levels.The film begins with a very hungover Tree, played by Jessica Rothe (La La Land, Valley Girl) who wakes up in the dorm room of Carter, played by Israel Broussard (The Bling Ring, Extinction). After a short exchange, she sets off on her walk of shame, trying to piece together the events of the night before. After seeing how she treats some of the supporting characters, we see that Tree is not up for winning any humanitarian awards. She’s not only prone to waking up in strange guys’ beds, but she is rude, makes out with friend’s boyfriends, blows off potential suitors, partakes in an affair with one of her teachers, and treats her sorority sisters like garbage. That being said, the list of people who’d like to kill her would not fit on a sticky note and leaves the viewer guessing. I haven’t been this stumped by who the killer was since the original Scream.After setting off for a party, she comes face to face with our masked killer for the first time, who is dressed as a cherub in a dark hooded sweat shirt. He quickly ends her life prompting her to wake up at the beginning of the day all over again. The killer is not overly original, as a similar mask was used in the previously released Valentine movie. After a few failed attempts at circumventing her death, she becomes determined to find her killer and break this vicious cycle.The mystery of who the killer is and how the film goes about slowly leaving hints and misdirecting the viewer is where most of the fun is found, as this suffers from a lack of violence due to the PG-13 rating. While there are some creative kills that do change depending on how Tree decides to proceed with the day, most are done off-screen, leaving the gory details to the viewer’s imagination. Tree’s reactions are often comical and prevent the film from becoming stale, despite a number of the same scenes taking place over and over again with minor variances.While the killer’s identity is revealed before the credits roll, the reason Tree is stuck in the never ending loop is never explained, which leaves a large plot hole. Since this is a horror film and the suspension of disbelief is in full effect, this shouldn’t stop you from checking out what is sure to be a cult classic."}, {"rating": "5", "text": "First, I must state that I was shocked by the number of children that attended this movie. It made me feel like I was in the wrong theater.I found this movie to be very disappointing, especially the twist ending. How does 1 student kick another out of a window with no consequences? Completely unrealistic! I was also surprised with the comedic content in the movie. If you're going to this movie for just the horror aspect you're going to be disappointed as well"}, {"rating": "6", "text": "Slasher, Thriller, Suspense all this and more in the new movie \"Happy Death Day\" from the producer of \"Get out\" and \"The Purge\" we get this groundhog day movie with a twist of a slasher flick.  The movie follows Theresa \"Tree\" for short, a collage student in a **** fraternity, waking up after a night of partying she heads home and lives out her day like normal, ignoring people and acting like a rude stuck up rich kid. later that night she is tracked down and killed by a baby mask wearing, knife welding stranger. then wakes up and relives the day over and over, all ending with her dying. personally i like this concept, so many ways you can take it, supernatural twist. freak rift in space and time. however this movie takes no side and never reveals why our main character is in this loop.  However after some loops she decides to tell the guy she keeps waking up with. he suggests that she needs to find the killer and that will stop the loop. which leads to a funny montage of her going to find people on a \"suspect list\" then having her die is funny ways. this comedy kinda works, me and my partner were laughing at some of these scenes pretty much because they were so weirdly silly in a dark humour kind of way then having her wake up frustrated with how many times she dies. After figuring out the killer and stopping them, Tree finally celebrates her birthday with the good guy \"Carter\" finishing up with a happy ending.ACTINGreally good actually, i didn't know any of the people in this movie, so assumed they would not be that good, and i think i was wrong i really liked the main character \"Tree\" played by Jessica Rothe i think she carried this movie being funny sad and stupidly once she starts to go a little insane by being stuck in the loop. the male love interest and good guy in this movie is \"Carter\" played by Israel Broussard, seeing as he is outside the loop most of his lines in the first act are repeated, however after he starts to believe Tree he has some good acting, being the good guy that helps solve this murder. however nothing amazing here kind of just more then i expected.DIALOGAgain not amazing, never did they have interesting conversations, about the scenes, not to mention they didn't explore the killer at all, instead of asking, \"How does this person know were you will be no matter what?\" they just gloss over it and ppast it up for a **** cliche at the end. nothing memorable here, some funny lines that will get a laugh but nothing to progress the story.OVERALLI enjoyed this movie as a slasher but not overall, i enjoyed the premise and the slasher parts but not all of it, this movie had promise to be a very interesting movie about something supernatural, however chose to stick to a more slasher type film that asks the question \"if you were in a slasher movie what would you do?\" because Tree knows she will die at the end of the day she can formulate plans to stop it. making the movie aware of the slasher tropes right down to Tree being a blonde victim. which changes by the end."}, {"rating": "5", "text": "I was thoroughly entertained by this movie. I'm just a sucker for movies that play with the idea of time. If you like the movie Groundhog Day or Live, Die, Repeat with Tom Cruise, you'll definitely like this movie. The script was surprisingly strong; it was a shame the director didn't do more with it. The supporting actors were not very good, though. I'd check it out if you want a light movie and don't care about zoning out for a bit. Entertaining, but not a good movie."}, {"rating": "7", "text": "The book is better. On moments with it's typical funny scenes in the horror movies the film felt a little bit ridiculous. The weakest part was the dialogues - very flat, weird. The message behind the film was in the background and seemed to be blurred. And I saw an interesting idea with a message, that could be more emphasized, like in the end for example, no matter it's genre. The plot twists were also unexpected and it was interesting. Overall it was good and it's worth a watch. I recommend the book too."}, {"rating": "8", "text": "Happy Death day Is a movie I was not expecting I am not a big fan of loops like dream sequences But this movie I do enjoy what it was trying to do Tree as the main character is a good performance also the killer I was unsuspecting the ending to this movie was the best part in this movie The ending was so unexpected If it was not looping too much I would have liked it more I am not a big fan of that so I got annoying with the looping I thought all the character are solid besides Tree are really good and carter the mask looks unique to me usually it would be goofy I thought it was unique does look good alright the ending to this movie so Tree kills off the main killer in this movie Is Joseph Tombs but than we get a twist at the end which does work I thought the killer was boring nothing going for him no motive but the twist happens that Lori was the killer that she got mad at the tree over a guy Lori was helping the killer behind tree back Intresting twist her death was not good to me all round Happy Death day Is an movie i did not suspect in this movie this movie was entertaining So i give Happy Death Day an B-"}, {"rating": "9", "text": "Intriguing. Funny. Enjoyable. Happy Death Day took the movie Scream and the movie Groundhog, two well known films and combined it, turning it into its own movie. I really enjoyed the plot, the characters, the humor and the recurring “Death” aspect. A well written storyline with a nice twist on two great films and some seriously funny moments is all that I could’ve asked for."}, {"rating": "8", "text": "This is an unexpectedly amusing movie. It's not a sendup of slasher flicks like Scream, it plays it relatively straight, but that makes it better. Not so campy. The lead actress definitely makes the film, since she's on the screen so much, if she couldn't do a modest Bill Murray in Groundhog Day (of course there's a shout out) the movie wouldn't work. But it's not a copy, the movie takes its own direction. It was worth watching even for those who aren't murder movie fans."}, {"rating": "0", "text": "NO-NAME CAST with low-budget bad acting. Absolutely stupid and cheesy. Save your $$ and time folks. Go see IT for a second time if you're looking for scares and thrills. This is another DUD."}, {"rating": "3", "text": "predictable, filled with jump scares (or more accurately just sudden loud noises) and totally unrealisticthe main girl is really stupid but i guess thats just typical \"horror logic\". the first half of the movie is a total grind and by the second half i was wishing this movie would end already"}, {"rating": "8", "text": "Excellent movie, but I feel like the ending to the film should have ended a little different. [spoilers ahead] I think the ultimate cliffhanger ending would have been with her waking up next to her new boyfriend's dead body. Let's assume that she never ate the poisoned cupcake so she never made the connection to who the real killer was. Instead, the new boyfriend asked her if she was going to eat the cupcake. She tells him to feel free to eat it, and he dies in his sleep. At this point it's safe to say that she'd make the connection to who the killer is though, and so should the audience. It'd be nice if they didn't actually make it that clear though."}, {"rating": "0", "text": "Immediately this felt like a straight to tv movie. Poor direction with no charm whatsoever. What this movie lacks in style it also lacks in substance. I found this film disturbingly unwatchable. Simply a waste of time."}, {"rating": "8", "text": "Divertida, tiene el suspenso suficiente para convertirla en una película totalmente impredecible, sin embargo, no logré entender el por qué la protagonista despertaba una y otra vez, o sea, ni la persona quien estaba detrás de su repetitivo asesinato parecia entenderlo y saberlo."}, {"rating": "9", "text": "What about this movie that I didn't expect much but changed my initial opinion? He already encourages you with the joke that Universal did with his presentation before the movie starts in the theathers.The movie is titled as \"terror\", but I think it doesn't quite come to that. The suspense and mystery about the plot is really cool and makes us think who the killer is behind everything, trying to catch every sign of the movie during the scenes (As a matter of fact, this isn't a spoiler, it's in the synopsis of movie). It has very funny moments, which at the beginning makes you rethink whether it's really a \"horror\" movie or not. Each death scene of the main is interesting, since none is the same as before. Even if the plot twist is interesting, the motives that come to it are, in my opinion, a bit of a fart.The characters are funny, great and well placed in the plot. I would say that 98% of them were well used in every part. The main pass from spoiled to sweetheart by the end of the movie. The \"villain\" is interesting for his actions, and I can even tell by his persistence.I must agree 100% when they say that this movie is the perfect mix between Groundhog Day and Scream. My motto continues: Go to the movies (with friends is more funny) or wait for TV and draw your own conclusion."}, {"rating": "8", "text": "This film is really one of a kind. It does a terrific job of evoking fear, as well as making you laugh out loud. The film itself is satirical in nature. It truly is a film everyone should go see, and is enjoyable for all ages. The film builds up well, and continues to succeed up until the end. The ending is very outrageous in nature, and seems to be a forced plot twist filled with ridiculous exposition. The ending will either leave you amused, or just disappointed. This film is worth it though!"}, {"rating": "10", "text": "I came to Happy Death Day with very low expectations, and was absolutely blown away. If you came into the theatre expecting a movie masterpiece, I can't help you. Happy Death Day is an incredible run of fun. Happy Death Day is hilarious, action-packed, suspenseful, and beyond enjoyable. I've never seen a theatre so engaged with a film, and I've never been so engaged with a slasher flick. At some points it seems very ridiculous, but I feel that adds to the charm. Nothing needs to make sense, so long as you have as much fun as possible.I only made this review because I saw the seriousness of others, and think it unfair to treat a loose, light-hearted film seriously. Happy Death Day exceeded all expectations. It made me laugh, it made me sit on the edge of my seat, and I left the theatre feeling as though I'd gotten off a roller coaster. Incredible. Loosen up, sit back, and enjoy the ride."}, {"rating": "10", "text": "Although this is a clever, modern remake of \"Groundhog Day,\" this good-natured slasher has a lively spirit, charismatic characters, and some good life morals."}, {"rating": "9", "text": "Happy Death Day surprised me.  It really surprised me.  And given my rapidly growing cynicism towards all of Hollywood's contrived vomit, this movie was like taking a breath of fresh air after nearly drowning in filmmaking idiocy.Happy Death Day utilizes the 'Groundhog Day' formula; that is to say, the protagonist is trapped in a day that forever repeats.  This is one of the few movies that takes advantage of that formula, however, it appears to be a growing trend.  I happen to think this is something positive since the idea of a cyclical and never-ending day can be used in a multitude of creative ways (see 'Edge of Tomorrow').But Happy Death Day does not pretend it's something unique.  In fact, Happy Death Day even manages a nod towards Groundhog Day, both humbly acknowledging where its own inspiration derived from and complimenting a phenomenal classic that should be required viewing for anyone with a pulse.And that's a big part of what makes this movie so good: it's not pretentious.  It's not trying to be something it's not.  And best of all, it's not robotic and formulaic.  While the film plods the path of the typical three act Greek outline, it does so with emotion and realism.  The characters matter.  This is a big part of what makes Happy Death Day stand out: the characters aren't fabricated on an assembly line.  They aren't caricatures.  They act like we act.  They react like we react.The cynicism I complained of at the beginning of this review has largely been cultivated by bloated budgets and overpaid arrogant blowhards who think they can force feed the moviegoing public with their computer generated scripts and lazily earn a paycheck without lifting a finger.  But this movie is anything but.  The people involved in this film made an earnest effort and it shows.Happy Death Day's storytelling is also patient and thoughtful.  The story is unfolded at an even pace and plot points that are revealed from the start are neatly tied up by the end.  Speaking of the end, it's rare that I'm surprised and/or fulfilled by an ending but this movie managed to achieve both for me.As a sidenote, I have read disparaging reviews that attack the fact that Happy Death Day \"rips off\" Groundhog Day; this is akin to lambasting every story that's had aggressive aliens since War of the Worlds.  Why is it negative if someone is inspired by someone else?  If I created something unique and others used it for their own creations, why would I take that as anything other than praise?  Attacking a plot for its similarity to something else is, on its face, ridiculous.  Plots are used and reused all the time; it is what we do with them that matters.But I will digress.  overall, I highly recommend this movie.  Remove the Hollywood preconceptions in your mind, drop the need for flashy effects and other bells and whistles and simply let it all unfold.  Hopefully, like me, you'll be left feeling very satisfied.(P.S. I gave it an 9/10 as a bit of a curve score.  In other words, if movies were metaphorically a classroom full of students, Happy Death Day would be given a higher score given that all of its classmates are flunking out.  As a movie of its own right, perhaps I'd give it a 7 or 8.)"}, {"rating": "3", "text": "Very interesting plot, but it's only a movie for fun. Nothing special, and it's a little bit ridiculous."}, {"rating": "4", "text": "반전은 반전이라고 하기 애매하정도로 그냥 비웃음만 나온다... 스토리상 허점이 너무 많고 기억에 남는게 하나도 없다.. 무서운 장면이라도 잇어야 되는데 코믹한 장면들이 섞여 긴장감도 줄어드는.."}, {"rating": "2", "text": "I truly not recommend this movie to anyone. In the first ten minutes, it seems kinda cool, but after that the girl keeps dying, and waking up, and dying, and waking up, and dying, and waking up, and dying, and waking up, and dying, and waking up.. Also, it is pretty obvious who wants to kill her from the very beginning of the movie. It is so pointed out that she is being such a **** to her roommate, that you can guess that it is her who wants to harm her. More over, at some points, the movie tries to hard to be funny. The only part that i smiled (not laughed), it was when her boyfriend pranked her in the end. I found the other parts really lame. It was just a disaster."}, {"rating": "8", "text": "I really enjoyed this! The concept is not the most original but the interpretation is fantastic. The film is funny, charming and the story powers through never really getting boring. Sound design and filming are strong. The lead girl is charismatic and charming to watch even at the start when she isn't the nicest person. Some of the background acting isn't very good. There are some scary moments but no gore or anything lasting scary. It's more about the story, the twist and the charm."}, {"rating": "4", "text": "I dont know why this movie was promote like a terror movie,  only scare 2 times in the entire movie, the rest was only laught. The thirth part of the movie was really really bad."}, {"rating": "4", "text": "It was interesting to see a Groundhog's Day style plot in the horror genre and I really do like the cast but after a while, It just got way too repetitive. It stopped being fun and it started being more like \"OK, How much time do I have left?\". It's not bad but at the end of the day, It became too full of itself."}, {"rating": "7", "text": "Wow, what do ya know, an actually watchable low-budget thriller. Yes, it's mix of GHD, Scream this/that, etc so you'll be on the FF button a bit, but the ending isn't the formulaic pat ending it telegraphs, there's more and we thank it for that subtle twist."}, {"rating": "8", "text": "Just when you thought po-mo slasher movies couldn't possibly have anything interesting to offer anymore... This movie is a breath of fresh air, mainly because instead of spending large ponderous chunks of time setting up a feature-length story, it gets to home in one day and then have fun repeating it with a new twist each time. This makes it a breeze to sit through, and it feels as if everyone involved had a blast making it, which really rubs off on the viewer.Highly recommended by a hopelessly jaded horror fan."}, {"rating": "7", "text": "This was surprisingly awesome. One of the best slasher/horror movies I've seen in quite a long time. Not a masterpiece as it is so full of clichés and tropes, but it seems to self aware of that and has fun with it.Not too much else to say with out spoilers. Great idea of reusing an old idea in a new way. Nice story and it did keep me guessing until the end."}, {"rating": "6", "text": "A film that is kind of a mixed bag, but there's enough to appreciate here to recommend it. This type film has been done a few different times and you really don't get many new ideas, but they follow the formula well. B"}], "recommendations": ["happy_death_day_2u", "dark_skies", "the_strangers_prey_at_night", "countdown", "paranormal_activity_the_marked_ones", "devil", "would_you_rather", "brightburn", "unfriended", "chernobyl_diaries", "the_boy", "insidious_chapter_2", "final_destination_3", "wish_upon", "paranormal_activity_2", "escape_room", "mama", "disturbia", "ready_or_not", "case_39", "texas_chainsaw_3d", "vacancy", "summer_of_84", "unfriended_dark_web", "the_haunting_in_connecticut"]}