{
  "id": 2852,
  "title": "Hard Target",
  "starring": [
    "Jean-Claude Van Damme",
    "Arnold Vosloo"
  ],
  "runtime": 97,
  "genre": [
    "Action"
  ],
  "description": "When a woman's father goes missing, she enlists a local to aid in her search.  The pair soon discover that her father has died at the hands of a wealthy sportsman who hunts homeless men as a form of recreation.",
  "releaseYear": "1993",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kufvuQYWdl82sYzmhy2naBLyMui.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Hard Target is an action film more than anything but I guess adventure and thriller genres can also sum up the film but for me it's just pure action and mindless violence.... Made in 1993 by director John Woo (Broken Arrow, Face/Off) Hard Target's story is of a homeless man who goes missing, his daughter tries searching for him with the help of a guy named Chançe ( Jean Claude Van Damme) and Van Damme sticking his nose into business that doesn't concern him he becomes the attention and target of Lance Henriksen and his gang of hunters armed with machine guns and other weapons. Van Damme's Chance Boudreaux character becomes impossible for a group of men who outnumber him to kill and some of Hard Target is silly and unrealistic but it's good for laughs and only thing that saves it is the witty humour from Van Damme and the explosions, violence, shootouts and great action sequences. Not sure I got the plot/story accurate but to me it's close enough, the acting is pretty poor but the action sequences are great so all in all not the best film but a great action classic and good if you like loads of violence and bad language....Also stars Arnold Vosloo, Yancy Butler, Wilfred Brimley, Kasi Lemmons."
    },
    {
      "rating": "6",
      "text": "Clásica película de cacería humana, como bien dice film tiene ciertos parecidos al malvado Zaroff. Comienzo lento y una protagonista que no tiene encanto. Lo único es Van Dame, por favor a quien no le gusta ver como lanza todos esos combos con las piernas.Saben que es lo peor de todo, que esta película refleja lo que viven cotidianamente los veteranos de EEUU. Por mucho que te quieran vender que Estados Unidos es un paraíso, no hay nada más lejano que eso.La trama es básica, al principio no hay tanta acción y de golpe, en los últimos 30 minutos, vas a tener toda la acción que estabas buscando. Cargadores de balas que son casi ilimitados, granadas que tardan en explotar según lo necesite la trama, muchas explosiones sin sentido y armas de fuego que hacen más daño de lo que deberían. Todo eso y mucho más dan paso a esta película de acción, que de lejos gasto todo su presupuesto para la parte final.¿La joyitas? Minuto 55:54, 58:30 y 01:16:00."
    }
  ]
}