{"id": 3282, "title": "Hard to Kill", "starring": ["Steven Seagal", "Kelly LeBrock"], "runtime": 96, "genre": ["Action"], "description": "Mason Storm, a 'go it alone' cop, is gunned down at home. The intruders kill his wife, and think they've killed both Mason and his son too. Mason is secretly taken to a hospital where he spends several years in a coma. His son meanwhile is growing up thinking his father is dead. When Mason wakes up, everyone is in danger - himself, his son, his best friend, his nurse - but most of all those who arranged for his death", "releaseYear": "1990", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/nmtMNxslljllSTVtt7VIOXdxSZp.jpg", "categories": {"plot": 1.0, "acting": 1.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 1.0}, "reviews": [{"rating": "1", "text": "Hard to Kill is a film I grew up with as a kid. A 1990 action flick starring Steven Seagal. Steven's character in the film gets shot a dozen times at the beginning of the film then goes into a coma, wakes up years later and takes down the bad guys. This film is ridiculously over the top and unrealistic. The action scenes are very silly and it's very violent. Hard to Kill is a good example of why Steven Seagal has won so many worst actor awards. Hard to Kill is entertaining but Steven Seagal's acting is wooden and the action scenes are too violent and stupid and completely unbelievable and the villains are laughable. Crap film so avoid this rubbish!"}], "recommendations": ["12_rounds", "cobra", "a_good_day_to_die_hard", "transporter_2", "mechanic_resurrection", "sabotage", "the_expendables", "the_expendables_2", "broken_arrow", "live_free_or_die_hard", "jaws_the_revenge", "bullet_to_the_head", "rambo_iii", "die_hard_2", "bad_boys_ii", "transformers_age_of_extinction", "under_siege", "the_expendables_3", "6_underground", "the_last_stand", "olympus_has_fallen", "the_transporter_refueled", "the_marine", "anaconda", "salt"]}