{
  "id": 2284,
  "title": "Hardcore Henry",
  "starring": [
    "Sharlto Copley",
    "Andrey Dementyev"
  ],
  "runtime": 96,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "Henry, a newly resurrected cyborg who must save his wife/creator from the clutches of a psychotic tyrant with telekinetic powers, AKAN, and his army of mercenaries. Fighting alongside Henry is Jimmy, who is Henry's only hope to make it through the day. Hardcore Henry takes place over the course of one day, in Moscow, Russia.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ik1uZyiMSxF9HqrgRKUNfMCfr3z.jpg",
  "categories": {
    "plot": 6.314814814814815,
    "acting": 6.416666666666667,
    "ending": 7.0,
    "soundtrack": 10.0,
    "cinematography": 3.769230769230769,
    "familyFriendly": 3.0,
    "funny": 7.611111111111111,
    "action": 7.30379746835443
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Extrimly fu**ing awasome\rWhy you should definitely go to Hardcore Henry:\r1. This is the best action movie of the year, and probably in general. Remember the wonderful impressions of the scene in the church in the movie \"Kingsmen\"? So here are the impressions almost the entire movie.\r2. The director obviously loves Tarantino, fine jokes, blood abundance and diversity of murder. sometimes people in thecinema was just hysterical.\r3. Great soundtrack, which brought even a song by Queen.\r4. The plot, though not perfect, but it was much better than expected.\r5. Sharlto Copley rocks.\r6. Lots of interesting cameo, even Tim Roth.\r7. The film was made for just $ 2 000 000, and for any who doeth lawlessness udelyvaet \"Adrenaline\" and \"Raid\".\r8. The film was shot in Moscow. Very cool to watch the action taking place.\r9. The film contains a lot of dirty jokes, plenty of jokes is based on the obscene vocabulary.\r10. A number of references to (and not only) the gaming industry."
    },
    {
      "rating": "6",
      "text": "Enjoyable  POV all the way from start to end  , Some scene you'll feel like you're playing a game and just want to jump in or take control  , also it's a funny kind of action and movie for me its my first time watching a whole film with a pov cam with a lot well done effects cashing and action scenes everything was studied so well to make it as it is the only thing I was expecting a better story than running and killing but I guess the director and team wanted to prove something out of it , I guess  they did !"
    },
    {
      "rating": "10",
      "text": "Bad ass from beginning to end. A tip though, you'll enjoy this movie so much more if you just enjoy it as a mindless action flick. Don't try to apply logic. I really thought I wouldn't like this movie because of the camera style, but it was beyond my expectations."
    },
    {
      "rating": "6",
      "text": "Starring Sharlto Copley and a couple of other actors whose names I didn’t bother to look up. Many of the scenes seem like they came straight from a bad video game but who cares about that, you’re watching this movie for the action, and you will not be disappointed. This is complete madness shot entirely in first person, not done very often and yes there are some up close and personal action sequences that may make you feel sick, but it’s gloriously gory. A well-deserved 18 rating. Pure entertainment so definitely recommended."
    },
    {
      "rating": "7",
      "text": "Is extremely new and extremely innovative.Hardcore Henry is a new action film that is mixed by critics but loved by audiences but I can understand why.The action was well done and well choreographed with a team of filmmakers that has passion with the project.The action is also over-the-top but again well executed,The story however is simple but not good,it's really stupid and also with the dialogue it waslazily written but because again the FPS style was integrated in the action was extremely awesome and you can see the effort in the action scenes than the story.Characters are vague but some of them shines through.Villain was just any other villain,some of the characters are underused though.\r It's an over-the-top action film with great stunt work that will be loved by audiences and especially gamers but trashed by some critics due to it's same old story but everyone can Agree that the action was innovative and action films can still be awesome."
    },
    {
      "rating": "9",
      "text": "Hardcore Henry is simply a film you can NOT take serious, it's a stupid film that gives no **** and it knows it.\rThe films story focuses on Henry, who wakes up from an accident and is now both human/robot and a mute, you meet your wife then next thing you know she's being kidnapped and you have to save her, that's it..... it's a nonstop 90 minute action thrill ride that doesn't even feel like 90 minutes because it goes by so fast.\r The film is heavily inspired by video games and Neveldine and Taylor, who are 2 directors whose films you cannot take seriously or you're going to hate them. Same thing with Hardcore Henry, go into the film  with the expectations of little but simple story, nonstop action and violence and just have fun and enjoy it."
    },
    {
      "rating": "7",
      "text": "A must see for all action-movie buffs -- a demonstration of industry leading stunt choreography that deserved better character development than it was given. Fortunately, the films efforts were mainly focused on its strengths in the action experience, and didn't try to sell itself as being more than that.\r Note: Certainly the best shot cinema-verite first-person I've seen. e.g. better than Cloverfields lopsided handheld cinematography."
    },
    {
      "rating": "8",
      "text": "An ode to classic over-the-top action flicks that succeeds at being what it was meant to be. If you're looking for a deep, meaningful story that is meant to be taken seriously, skip this movie. If you're in it just for the thrill, Hardcore Henry is an exhilarating experience. Just remember to check your brains at the door and watch the madness unfold."
    },
    {
      "rating": "9",
      "text": "Hardcore Henry is not a film for everyone. I’m a gamer so I will give it a gamer review. Hardcore Henry is a FPS with a simple plot that focus in comedy and high octane action with plenty of gore. During the film I was in my head just thinking of the different games it could easily be at that moment. While I was keeping count and I saw some Hitman, CoD, Splinter cell, Metal Gear, there was a point while it could be Infamous or Prototype. As a movie it was a fun experience. As a story it was simple, funny, and with one hell of a satisfying finale.  As a final though I will recommend this movie to any gamer that enjoy any of the game mention, anyone looking for something different or just something fun to watch."
    },
    {
      "rating": "10",
      "text": "What do you want from an action film? I think you wants guns, blood, action, cool fights and you don't think about the story. Story is the last thing in this genre. Simple story makes you more focused on picture. There are a lot of references to popular game series, because director is among us. He loves 'old-school' thriller's, he loves computer games like Call of Duty/Just Cause...\r In a few words it's a show. This film was directed by fan to fans. Author wanted to make you excited. And he had reached this goal.\r Simple story, a lot of action, clear ending without any confusion are the best compositions of a stupid action film. 10/10"
    },
    {
      "rating": "8",
      "text": "Yes, it's a stunt film, but a highly successful one.  If you're not ready for some seriously carnage - the most graphic violence you ever contemplated might be in a movie - then avoid it like the plague.  But if you want a fast-moving, fun, and often funny kinetic adventure, you'll have a blast with this.  The writing and directing are spot-on, actually.  The sucker never slows down, yet you never feel like it gets mechanical or routine.  I wish we had a touch more back story on the dude behind this massive experiment, but that's really nitpicking. Solid flick.  I'm a little shocked that the Friday box office was sow meager."
    },
    {
      "rating": "8",
      "text": "Hardcore Henry is like no action movie I've ever seen before.  The nonstop action and the innovative first-person camera works to this movie's benefit, as it is simply a ridiculously enjoyable time.  Sure, the story is iffy and there's a lack of character development, but if you go in with the expectation of a balls-to-the wall action movie like no other, this is the movie for you."
    },
    {
      "rating": "4",
      "text": "A fairly dumb, one-note movie with occasionally fun moments and a few cool stunts, but mostly horrible acting, a plot straight from video-game cliches (\"fight off the bad guys as the good guy slowly lowers down the level, I mean 'set'\") and a villain straight out of a yaoi story."
    },
    {
      "rating": "4",
      "text": "\"Hardcore Henry\" can be best described as an experimental film. I was intrigued with the concept of a whole action film shot entirely in first person view and the trailers showed some promise for this concept. Unfortunately , the concept did not do any thing for me. The action is visually impressive with stunts that were actually performed by the cast. The par-cor was also pretty impressive and the camera work made the city of Moscow feel like a character itself. However the camerawork actually gave me a few bits of motion sickness. I had gotten a few headaches from viewing the film after the first hour. The first person camera could have immersed the viewer into a gripping story but unfortunately the story itself is merely nothing more than a connection of the action sequences. The action sequences are impressive  The characters themselves are merely there to play a specific role. The main love interest is only there to be a love interest and the main villain is only there to be a villain.  In fact one plot thread that didn't lead anywhere was how the main villain has magnetic like powers. I was hoping that it would be explained but instead it was frustratingly put in the film with no explanation. Henry himself is really nothing more than a blank slate for the viewer to put themselves in order to immerse the audience into the experience. It is a commendable effort but it failed to do this for me personally. In my opinion this kind of perspective works well in a video game since I am directly in control of the character but in a film though we are watching through the perspective of a character in a story that is non interactive. The one character who does stand out was the scientist named Jimmy. His motivation was what got me enrolled into the plot and his eccentric personality got some laughs out of me as well. This film will have a massive fan base since the concept is unique but I am personally baffled by the critics saying that it is the best action film since\" Mad Max Fury Road\" . What made \"Fury Road\" work was the fact the action was supported b a narrative with a simple surface with complex layers and it had characters who the audience could route for against an adversary who was intimidating. At the end of the day though, your enjoyment of the film will sole-fully depend on how much you are willing to tolerate the shaky cam and first person view. It lacks any kind o nuance but to the films credit though, it knows what it wanted to be and didn't try to overstep its bounds. It will please a lot of people but it just wasn't for me."
    },
    {
      "rating": "4",
      "text": "Two users got lucky on this one... they gave it a positive rating before the movie's even released. Typical Metacritic website designers bringing all the users in the box before the movie's even released. Hardcore Henry, sadly, does not deserve a positive. It deserves a mixed score like what we normally give movies. Good luck giving it a positive score, users, because Hardcore Henry's just another one-of-those-mixed-movies-that-should-have-been-great movies."
    },
    {
      "rating": "10",
      "text": "Enjoy video games? POV first-person shooters? Action movies? Unbelievable movie-going experiences?  Being a part of something completely different and revolutionary for the cinematic art medium? Having a good time? A really really good time? Then Hardcore Henry is undoubtedly a movie for you.\r Playing more as a virtual reality experience than anything else, Hardcore Henry is the first ever POV action film where the audience doesn’t miss a beat as Henry; a resurrected human turned robotic super human man who climbs walls, falls out of buildings, jumps, runs, kicks, shoots and his way to save the woman he loves, Estelle (Haley Bennett), from a telekinetic super baddie Akan (Danila Kozlovsky) who is out to release his own army of Henry wannabes and uses Estelle’s and Henry’s technology against themselves. That’s pretty well it for narrative, but Hardcore Henry is not about story, heck, it isn’t even about redemption. Hardcore Henry is unlike you have ever seen on the big screen and is mostly about tantalizing every single sense in your body. The film is a go, go, go adrenaline ride filled with shaky cam goodness that will redefine the way action movies are made and expectations of audiences, forever. For real though.\r Exploding its way through the sky with pure craziness and some of the best stunt-work ever filmed, Hardcore Henry is the feature film debut of music video director Ilya Naishuller. Naishuller, frontman of the Russian indie rock band Biting Elbows, who first introduced the first-person action filing in the music videos for their band in their infamous song “Bad **** Naishuller directs and launched the band to online fame. After almost 33 million views, with the help of online word-of-mouth,  the support of the Internet, Kickstarter and some studio execs, Naishuller was able to develop his action-packed filming style to the silver screen, this time, with with Henry front and centre.\r Henry, who is never really revealed in the film, was played by ten different stuntmen and cameramen, including its director, gives the literal vision of the film; provided the audience with his complete perspective, and all his kick-assery as well as some flashbacks memories, including a very repetitive one, where his father, played by Tim Roth, encourages Henry at a young age, after taking a beating from some bullies to “swallow the blood in his mouth, stand out, and go spill their’s”. Seems like some violent advice to tell a youngster, hence why Henry is so good at making everyone all bloody and bruised.\r Since its premiere at TIFF in the Midnight Madness programme in 2015, Hardcore Henry was being advertise as a movie going experience, unlike anything you have ever seen before. Thankfully, that pitch has been used with so many other films before this, yet, finally, for the first time in a long time, the tagline can live up to its reputation. Hardcore Henry is a gravity defining, atom bomb of excitement and energy on the silver screen. With a narrative pace that travels at the speed of light, the film never stops or ceases to disappoint fans of the hardcore action genre, it burns through its brisk and enjoyable runtime, and cements its place in your memory for life as one of the most exhilarating films you will ever see!\r Although much praise should be given to the super-sonic stuntmen and cameramen involved with this project, as well as all the dedicated cast and crew who were in love with the making of this film, including Sharlto Copley, who easily hailed the film as the most difficult project of his entire career, the results really speak for themselves. From the catchy use of Queen’s undeniably catchy song “Don’t Stop Me Now”, which I played on repeat while writing this review (hence why you can probably catch many references to the song within the writing), to the brave filming style Naishuller was faithful to throughout the film, to the tremendously sweaty and pulsating score of Darya Charusha, Hardcore Henry is not for the faint of heart, provided endless in-your-face moments.\r Oh, and when we say faint of heart, we mean it. Since the film was mostly shot using a GoPro Hero3 Black Edition camera, the film is for no one person who can’t handle shaky cam, (including my father, who had to leave mere minutes into End of Watch and continued the rest of the film in the restroom). Hardcore Henry is a phenomenal action film and amongst the most superior action films ever made, period. As an action fan, please do not miss this landmark film. By the time the credits roll, despite its lack of deep story and one out-of-nowhere twist, Henry can only be described by the most obvious statement possible: one bad-ass, hardcore mother*cker!"
    },
    {
      "rating": "10",
      "text": "This movie is a master piece which shows everyone that first person film's can be done right. At first I was nervous that this movie would suck because of shaky cam, but this movie shocked me on how well it was done. The CGI wasn't that bad, there was only one part were the CGI was bad."
    },
    {
      "rating": "7",
      "text": "This is a movie for fun, and it has it in spades.\rNot for the critics, not for the awards.\rA full-throttle spectacle for guys who like action movies.\rYeah, the plot is sci-fi nonsense but what major movie isn't these days?\rCatch it in the theater if you can for a one-of-a-kind experience."
    },
    {
      "rating": "10",
      "text": "This movie got both a 100 AND a 0 from the critics. What the hell.\r I liked this movie. Definitely reccomending it, and to the critic giving this a 0 - what the hell."
    },
    {
      "rating": "9",
      "text": "This was everything I was hoping for since the first teaser for the movie. I am very happy with my viewing experience. Hey I think I might even get the blueray!"
    },
    {
      "rating": "0",
      "text": "I walked out of this one. I would appreciate this film if it had a better told story worth caring about. Here, I was given nothing. This first-person view will just be a short lived gimmick that gave me motion sickness. This is the same as just watching someone play a video game. The positive user reviews must all come from video game junkies who found a much cheaper alternative. Or you can just watch games on Twitch or Youtube for free."
    },
    {
      "rating": "8",
      "text": "To put it simply, \"Hardcore Henry\" is unlike any other action movie you may ever see. To put it not so simply - if one were to take the game disc for \"Far Cry 3,\" use a \"Crank\" DVD case to grind it into a fine powder and then reform that dust into another DVD so someone can burn the entirety of the \"Robocop\" franchise onto it, you'd pretty much end up with \"Hardcore Henry\". . .and it's pretty unbelievable. Director Ilya Naishuller turns a seemingly gimmicky premise into a raw, addictive stylistic necessity, while co-star Sharlto Copley uses his supreme comedic abilities to elevate the movie into cinematic greatness. I loved \"Hardcore Henry\" and while It might not be for everybody, it's certainly a must-see."
    },
    {
      "rating": "10",
      "text": "Hardcore Henry is the best video-game movie, not based on any game; it is also the most unflinching, original, breathtakingly inventive and giddily exciting ride of the year, making full use of its great concept , superb technique , pushing it past its gimmicky roots and making one hell of an Indie Action Classic.\r The most impressive aspect of Hardcore is the pacing and how the actors, the director/screenwriter go about to deliver it swiftly, edited to perfection and performed brilliantly. Henry is immensely humanized, considering the fact that his face is obstructed throughout the whole film and is mute, yet through mannerisms and motions, writer/director Ilya Naishuller gives Henry a unique and often times funnily badass personality one that is sympathetic for the audience to root for and play as. Meanwhile Sharlto Copley, brilliantly jumps from various, engaging and weirdly fascinating characters, it’s definitely hard to pull of so many different characters and retain significance and constantly come up with witty performance tricks that get either get the audience’s blood pumping or get their interests peeking. Danila Kozlovsky plays an exceptional villain, one that is perverted, hyper-stylized, yet gets to pull one or two of his own great gags that evoke a feeling of fear and comedy. Whilst Haley Bennett is charming and convincing as the wife of Henry, wanting his safety and security, and hiding secrets under the façade of love and compassion. The story is great too, it is strange, exciting and un-logical in the best possible way, drawing inspirations from various video-games and providing them with a new perspective.\r However it’s the action in Hardcore Henry that is the most important, full of adrenaline, kinetic energy and meaty violence, Naishuller makes even the shakiest of images stable and clear using long takes of sweeping carnage and choreography that gives The Raid films a run for their money. In particular a wild, on-rails motorcycle chase with a minigun is not only awesome on its own, with passages through enemy vehicles and tearing of enemies with the high-caliber bullets that shred the forces of AKAN into pieces and thrill with unparalleled ferocity and drive. The Brothel shootout is mind-blowing too, full of utterly spectacular gun-fu action, that is punctuated by the picture’s bucket load of guts and blood, with a little of misogyny which is always pleasant to see in today’s Ultra-feminist society. The last 30 minutes of Hardcore are pure insanity and a barrage of almost gratuitous violence, head explosions, decapitations, savage beat downs and wall to wall action that had my heart pumping and sweat dropping at an almost alarming rate. Made even cooler and jaw-dropping by the fantastic score of the Director’s band “Biting Elbows”, being their long-time fan, it was sweetly energizing to hear some of their new tracks at just the right moments to give the action even more punch, and yes Queen’s “Don’t stop me now” is also here and yes that scene is the best part of the movie.\r Hardcore is as advertised a cinematic breakthrough and a terrific endeavor from the Russians, that created something truly new and exciting, it is a masterpiece of an action film, made impressively immersive by its POV style and engrossing by its story, plot, and characters, Kudos to Naishuller and his team for making this work.  It is worth every cent of every dollar and even my  5 dollar donation back in 2014.\r and yes I do feel proud of that :D"
    },
    {
      "rating": "10",
      "text": "One of the Best Movies, I´ve ever seen! If you loved Crank, you will bow down to Hardcore Henry! To the bad critics I only have to say, you don´t understand what 1st Person Action must be like cause Hardcore Henry is a milestone in this Genre!"
    },
    {
      "rating": "10",
      "text": "Finally something REALLY original and fresh! I loved this movie for the same reasons i loved Mad Max: Fury road...Non-stop fast action, tons of quotations, exaggerated characters!\rI'm really tired of the old boring ''Hollywood'' action movie where the protagonist is a ''common man'' that has to fight without ''breaking the rules'' of society: Hardcore Henry gives back the weapons needed to the good guy aka the Protagonist!\rCan't wait to see something similar done to great vg like Max Payne, would be a dream coming true.\rGo see it !"
    },
    {
      "rating": "10",
      "text": "Hardcore Henry is one of the most fun movies of the year. Every minute was action packed and every fight scene was violence for the sake of violence and ridiculous for the sake of being ridiculous. You only know as much as the main character knows ,so you get kind of a sense of how disoriented the main character is. The first person point of view was immersive and made you feel on edge the whole movie. This movie would be perfect If you watched it through a Virtual Reality(VR) headset like an Oculus Rift or HTC Vive. I think being a gamer a lot of the appreciation had for the movie was seeing it was like playing a First Person Shooter(FPS) and feeling as if that what I was doing. In the movie I didn't feel like Henry the main character was the bad-ass I thought I was the bad-ass the whole movie ,and this is a feeling that no movie has ever given me. If you are  a gamer or someone who wants a unique experience to feel like the protagonist in a movie then Hardcore Henry is the movie for you.\r 10/10 Best Movie I've Ever \"Played\""
    },
    {
      "rating": "5",
      "text": "With such a focus on originality today, many filmmakers feel pressured to go out and find the next big thing. Unfortunately, the POV first person camera may be the next big fad in Hollywood, and that’s not good. Hardcore Henry is very original, but has no real story, and contains a lot of nauseating camera work. The biggest problem, is us, we’ve encouraged things like this film to happen, and now we have it.\rToday’s critics seem to latch onto one critique more than any other, and that is the originality argument. Many people will tell you no film today is really original, but then a film like this comes along. Shot like a videogame this film is original in both look and narrative, however, the focus on creating this video game like look lead to a weak storyline. It seems sad that our generation just craves things that are original, so much so that when we get it, we don’t care about quality.\rThe greatest flaw of the film is the narrative, or serious lack thereof. Many, if not all, characters are grossly underdeveloped, especially the villain who is goofy and weak. The story is more of a incoherent assembly of scenes, that does little more than further the confusion. It seems that from the outset, Hardcore Henry was always about the POV feel and look. It is ironic, because the film is plotless, and the action doesn’t really look good either.\rThe gimmick of this film is for the audience to feel like they are in the shoes of the main character. The problem is the main character bobs and weaves so much the film is more on a nauseating set of fight scenes. On top of the terribly shaky action sequences, where very little is visible, the film is poorly edited, furthering the confusing story by jumping around randomly. On top of that, the way the characters and story are presented, time in the film is totally jumbled, and nothing seems to make sense until the end of the film, at which time it’s too late.\rIn conclusion Hardcore Henry, is an all-out attack on it’s viewers senses, as they are put through a non stop set of nauseating action sequences. The film has no real story, and throws characters in and out of the film, creating a confusing mess of a story. So yes the film is original, but that doesn’t make it good or worth watching, because there’s a gross lack of craft in this film. I suggest you don’t watch this film because the only selling point is the new POV shooting style, which alone is not enough to make a good movie."
    },
    {
      "rating": "1",
      "text": "I recommend you not to waste your time with this film. I simply had to quit the cinema several minutes before this film ended. I just couldn't keep watching this. It was vulgar, dead people falling around all the time. The camera was almost stained with blood. And the filming style makes it very hard and boring to watch. It was shot from the perspective of only one camera. Unfortunately I didn't get  my money back."
    },
    {
      "rating": "0",
      "text": "Hardcore Henry is by far the worst action flick of all time.With a stupid plot and undeniably worst written characters with dialogues which are just cringe worthy,performances that are just bland.It failed to be innovative with a FPS stupid shots with action set pieces which are just ugly."
    },
    {
      "rating": "2",
      "text": "I'm guessing the intrigue for some is the virtual reality effect due to the camera being placed on the character. This was the only reason I scored it 2 rather than 0.  The thrill of the story itself was no where to be found.  We walked out about 40 minutes in along with other disappointed patrons. If you  have trusted & agreed with my other reviews then I suggest ignoring this 8.5 rating and save your money."
    },
    {
      "rating": "0",
      "text": "Anything this divisive HAS to be good. To people who get it, its the finest wine. To people who don't get it, its like a dog trying to watch TV. It just doesn't register. Very split along generational lines, I'd assume. Gamers will get it. People who appreciate innovation, stunts, and camera/technical work will think its the second coming.Personally, I was blown away and must disagree with any critic who does not give this film a very strong review. Its either way ahead of its time, or everyone else has just utterly failed to deliver novel action, and video game-to-movie synchronicity. This shoestring budget, sophmore job by Ilya Naishuller will go down in history as the first movie that got so very much right for the first time. Its more than a gimmick, every action movie will have most of these elements, and soon. This is the way of the future, there's no doubt."
    },
    {
      "rating": "10",
      "text": "Hardcore Henry is a movie that like many others have said, should not be taken seriously. Rather it's a look into how movies could be in the future, a truly more immersive experience. The skeleton plot is over shadowed by the good humour and sheer violence the movie contains. Sure it does get a bit repetitive but this is only the first movie of it's type and nothing is perfect at first, especially on a small budget and limited perspective like that. Hopefully it'll pave the way for a whole new realm of entertainment if incorporated with 4D entertainment.  The film has heart and I won't fault it for that. I know it's not everyone's cup of tea but the showing I was in enjoyed it and I hope to see more in the future."
    },
    {
      "rating": "8",
      "text": "You know, if you forget about the plot and not worry about the flops this movie showed in some scenes, you'll be okay. The ACTION is badass and the stunts are 'Hardcore'. If you want fun, you'll get fun in front of your face because this movie keeps the action going and the adrenaline pumping. I actually got goosebumps watching this movie. Guys, if you're looking for a fun, action-packed, bloody good time. Don't forget to check out 'Hardcore Henry'."
    },
    {
      "rating": "10",
      "text": "This is one of the best action films I have ever seen. Filled with little details and jokes that just made the experience so much more enjoyable. If you find some of the action being repetitive (which I didn't, but I can understand why some people will), please stick all the way through it. It has the most pitch perfect ending that could have possibly been written."
    },
    {
      "rating": "8",
      "text": "Good. It is a B movie with inventive filming techniques. It has humor and action. The gore-blood in it is 4 comedy purpose only. After watching the movie you don't feel betrayed by the trailer..a rare attribute these days.\r Meglio di quanto mi aspettassi. Non è un Blockbuster ad alto budget, non sarà uno dei migliori film azione dell'anno ma non è neanche un film demenziale come i film-meme in stile Asylum. E' un B movie vero e proprio ma di quelli divertenti. Pieno di umorismo ed azione, girato in modo originale. Le riprese in soggettiva per i primi 15 minuti di proiezione possono risultare fastidiose..... ma dopo che ci si abitua il film scorre senza problemi ed è divertente assistere alle scene degli stuntman da questa prospettiva insolita. Spettacolare il combattimento finale. Il film è proprio come vi sembra dal trailer...se vi è piaciuto quello potete andare al cinema tranquilli"
    },
    {
      "rating": "10",
      "text": "10/10 Great Acting, Great Story, Great Action, Amazing Effects, and Overall just alot of Fun! Its a really good movie and what the new generation of Action Oriented Consumers want."
    },
    {
      "rating": "2",
      "text": "What a crapfest.  I was 15 minutes in and I was hoping it would just end.  I paid, and I do not like leaving early, but if there was ever a movie I wanted to walk out on it was this one.  This is simply a video game from the perspective of Hardcore Henry.  Yes, I knew what it was about.  I had seen plenty of sneak peaks over the last couple of months to peak my interest, but after a while you can only take so much of that kind of shaky camera perspective.  This movie makes the Blair Witch Project genre of reality perspective films look like still footage in comparison.  There are a lot of positive reviews of this movie, but I have to imagine it is from those people who love this type of video game massacre.  I do not mind violence in movies, but to kill at a rate of 10 people per minute of film scene is crazy.  Henry is mute and so the majority of the film he is just a killing spree being guided by the mysterious Jimmy.  I won't spoil the movie for you, but if you are not a video game junkie that blood lusts, then you might want to go watch a less violent movie like Friday the 13th.  At least your eyes will be able to focus on the murderous demon and his piles of death."
    },
    {
      "rating": "10",
      "text": "If you like fist person shooters and Tarantino style over blood you'll love that movie! The villain was cool, the dude from District 9 was great and the pace is frenetic!"
    },
    {
      "rating": "1",
      "text": "This movie gave me permanent vertigo... If you ever want to simulate the feeling of post tilt-a-whirl motion sickness, this is the movie for you. I really wanted this movie to be good what with the super cool FPS-movie gimmick it had going, but it's just garbage in pretty much every category. Obviously this movie wasn't trying to be some blockbuster high budget movie, but you can't even enjoy the FPS action because it is just so poorly filmed which was the whole point of the movie. Stablise. Your. Footage.\r Also the villain was written to seem creepy but he just ended up cringey. Like he graduated a C+ student from the Tommy Wiseau University of Cringe. A prestigious establishment no doubt."
    },
    {
      "rating": "4",
      "text": "Maybe with all of the advancement in VR tech, it's a good idea to make a film that satisfies one's deepest desires not achievable in AAA titles. Or...maybe not. \"Hardcore Henry\" is an action-packed (emphasis on the \"packed\") 90-minute 1st person thrill ride that puts audience members in a visceral and nauseating position. The endless barrage of action sequences stacked on Cloverfield-approved camerawork may have you regretting not picking up a couple of aspirins before the opening trailers.\r The early 2000s game plotline opens on a lab setting where synthetic goodies are being stitched to the protagonist/director/audience's body by an increasing gorgeous Estelle (Haley Bennett) who claims to be the wife of said character Henry. Just before our hero's voice can be activated, the lab is raided by heavy-armed men at the command of telekinetic albino antagonist Akan (Danila Kozlovsky) whose B-button weapon is the death of story originality. Next, there's the first of many struggles, complete with an impossible dive from the airship housing the lab and the inevitable kidnapping (inciting incident) of Henry's wife.\r A classic run'n'gun-inspired button tutorial follows as Henry makes his way through Moscow until he encounters an alley named Jimmy (Sharlto Copley) who feeds him mini-missions which ultimately lead him to the final boss who wants to take...over the world? Gripping.\r \"Henry\" is a free-for-all of the most epic moments in video game history adapted into live-action form. No matter how impossible, no matter how grotesque, it check off every gamer's to-do list without breaking a sweat or breathing for that matter. At times, it feels more like the creator's personal quest to produce the world's first action trope encyclopedia than a Friday night flick.\r The excessive stuffing of crude excitement eventually becomes the film's undoing as we are left with little personal involvement aside from Copley's comedic antics. If doused in paint thinner, it would be unfortunately reduced to a VFX YouTube playlist, modern stereotypes and a thinning plot.\r Still, newcomer Ilya Naishuller's technical direction reflects a struggle for true innovation in the action genre and whose efforts closely align with those undertaken decades ago by a young George Lucas with a breakthrough experiment called THX 1138. While innovation may be present, cinematic merit is awarded to quality, not quantity much of which is absent from the film's foundation.\r The muted superpowered hero and the creative annihilation of the interchangeable NPCs may speak to the Millennials whose ideas of entertainment are built around the freedom of Grand Theft Auto and the immersive nature of Battlefield, but ultimately the film's incapability of delivering user control, the most alluring feature of such an experiment, denies itself submission to the list of great modern action films.\r There has always been a thin line between gimmick and game-changer but taking a half-hearted step forward is only two steps back.\r --FilmReviewWeekly"
    },
    {
      "rating": "4",
      "text": "Two users got lucky on this one... they gave it a positive rating before the movie's even released. Typical Metacritic website designers bringing all the users in the box before the movie's even released. Hardcore Henry, sadly, does not deserve a positive. It deserves a mixed score like what we normally give movies. Good luck giving it a positive score, users, because Hardcore Henry's just another one-of-those-mixed-movies-that-should-have-been-great movies."
    },
    {
      "rating": "10",
      "text": "100% fast paced action, and still manages to have an interesting story.\r The main character (although mute), still has a few moments where a glimmer of deep personality shines through, in some well placed inventive and some times deep scenes."
    },
    {
      "rating": "7",
      "text": "High-octane, adrenaline-crazed, and completely over-the-top, this is truly one hell of an entertaining and undeniably bloody fun film! The first-person perspective was surprisingly effective for the majority of the film, although it admittedly became excessively shaky at times. As for the performances, the obvious standout here was Sharlto Copley, who completely nailed his role and owned every scene he appeared in with his zany performance! As for the rest of the film, despite what I considered to be a rather ridiculous third act, the first two thirds of the film had me completely enthralled and on the edge of my seat! Overall, this should prove unique and innovative enough to satisfy most action junkies and keep them entertained from start to finish!"
    },
    {
      "rating": "6",
      "text": "This is F war!\r Hardcore Henry to pierwszy film, na którym (dosłownie) zrobiło mi się niedobrze, a głowa bolała jeszcze długo po seansie. Nie spowodowała tego (bardzo) płytka historia, słabe dialogi albo przedziwna gra aktorska. Odruchy wymiotne powoduje szalejąca na wszystkie strony kamera. Film jest nakręcony z oczu gł. bohatera, co daje Henremu pewną oryginalność. Myślę, że warto zobaczyć. Rzadko jest okazja do obejrzenia tego typu filmu na srebrnym ekranie."
    },
    {
      "rating": "8",
      "text": "My son plays first-person shooter video games, mostly Call of Duty, all the time. He is not interested in Hardcore Henry. You may be familiar with the objection: He doesn't wish to watch a video game he cannot control. The funny thing is I've probably held a game controller for less than a half hour my whole life. Somehow this PoV experiment intrigued me.\r First-time director Ilya Naishuller explains that you get a believable immersion by strapping a GoPro on your surrogate at mouth or chin level. You don't want him to speak because it would break the believability. What else do you need to know? Strap in (as long as you're not the queasy type) because you are going for quite a ride. Hardcore Henry is truly an original cinema experience, and mostly it works terrific.\r Another funny thing is gratuitous gore is not really my thing. Don't let anyone tell you this movie holds back. You'd think there's a carnage Oscar category or they're getting paid by the body. I won't say it is tastefully done, but in the world of Henry, ultra violence works fine.\r The filmmakers are a little afraid of breaking the spell they have created by the pacing. They don't wish to provide too much relief. Personally I think this is a mistake. After all, Hardcore Henry is at heart a suspense thriller. The story would benefit from a few more misdirections and a bit more character development. But then I am asking a lot. As it is Henry is pretty busy staying alive and solving the case. Honestly it is enough that the producers, director, actors, and stunt people (and the glorious city of Moscow) invested so much heart into Hardcore Henry.\r I am going to see it again soon."
    },
    {
      "rating": "0",
      "text": "Too bad there is no score less that \"0\"\r~1.5 hours of nonstop violence being acted upon the camera or performed by the camera agains an ever growing army of bad guys.If your idea of entertainment is to watch someone else play a silly action video game, going from level 1-10 in 90 minutes, then you'll probably love this movie. Who was the moron who decided it was a good idea to make this movie? I would not put this movie on my resume if I had anything to do with it!"
    },
    {
      "rating": "10",
      "text": "This is one of the most wildly inventive and just plain wild action flix to come along in a while. It's viewed from the POV of one man (who was wearing a GoPro to make the movie). He's been transformed into a superhuman, who is thrust into a world crammed with people out to kill him. Like a character in a video game, Henry barrels through all kinds of obstacles and incredible stunts leaving an outrageous body count. The extreme violence is highly imaginative and flies so fast that's it's sometimes hard to follow. The reasoning behind the plot is murky (even though it includes some cool sci-fi elements), but it's all about the insane intensity of the carnage and breathtakingly ingenious filmmaking."
    },
    {
      "rating": "9",
      "text": "The best mindless, 1.5 hour long gore-fest I've ever seen. Somehow, this movie manages to make a great experience out of a script that involves pretty much zero coherent storytelling or compelling characters.\r I was expecting to leave the theater saying \"this is really the sort of thing that belongs on YouTube and is best kept to 15 minutes or less\". I couldn't have been more wrong. Those 90 minutes pass by incredibly fast, as there isn't a dull moment to be seen in this entire movie.\r There are plenty of intelligent think-pieces coming out this year. If you're looking for a good movie to shift your brain into neutral and just enjoy an endless onslaught of action and hilarious mayhem, this is the movie for you."
    },
    {
      "rating": "9",
      "text": "Ждал это кино уже 2 с половиной года и оно мне очень понравилось. Единственный минус, после столь офигенного экшена голова приболела, правда это ненадолго и все равно оно того стоило. Вы смотрите этот фильм как будто прохождение игрового шутера для VR на youtube. С youtube у фильма и появилась такая креативная идея когда молодой музыкант из группы Biting Elbows выложил клип на песню Bad **** тоже снятой на GoPro от 1-го лица.\r Сюжет начинается что вас приводит в сознание симпатичная докторша Эстель и почти сразу на лабораторию нападает злодей Акан. Вам приходится убегать, точнее как в Bioshock Infinite экстремально спускаться на капсуле к земле. Потому что вся лаборатория это дирижабль прямо над облаками. Вообще огромное количество культурных отсылок нашего времени к играм и фильмам тут предостаточно, потому как режиссер такой же геймер как и мы, то есть целевая аудитория. Вы уведите постер и Half-life, и даже новинки Superhot. А местом действия на этот раз послужила Москва и хоть я из РФ, но в этом городе все равно не был. Для иностранцев этот сеттинг воспринимается как для нас ваши Голливудские фильмы с местом действия Лос Анджелес или Нью Йорк. Конечно же главная звезда ленты это южно-африканский актер Шарлто Копли, почти весь юмор держится на нем. У него тут несколько альтер-эго и по мере сюжета их будут убивать ради комического эффекта. Но вот почему они все клоны в разной одежде, это вы узнаете в кино.\r Также тут экшен действительно ничем не хуже от шпионской франшизы про Джейсона Борна. Только при рейтинге R создатели позволили кучу мата (\"запиканного\" в прокатной версии), кровь и мясо с самыми изощренными убийствами и голые сиськи. По сюжету фильма длиною 1,5 часа все события проходят за один день. И конечно же я слукавлю если скажу что тут нет сюжетных дыр, конечно как и в любом фильме они тут есть. Только вот сам фильм интересно смотреть поэтому на них не обращаешь внимания, да и вообще это работа для Cinema Sins (классные ребята). Также присутствуют пара сюжетных поворотов, но это спойлеры так что тссс! А женщинам страдающим феминизмом фильм лучше не смотреть, хотя можете купить потом диск и все равно не смотреть, из-за своих тупых убеждений. В остальном же вы и так прекрасно по трейлеру могли судить стоит ли вам смотреть, к счастью в отличие от Дэдпула тут не слили весь фильм в рекламной кампании.\r Теперь к злодею Акану! Его играет российский актер Данила Козловский и к слову этот год для него как бенефис (уж столько фильмов с его участием). По характеру я бы сравнил его с Ваасом или с Пэйганом Мином из Far Cry, но до Джокера (Хит Леджер) естественно не дотягивает. Является главной головной болью Генри то бишь Вас. Только в самом фильме о нем практически ничего не известно, но для этого выпустили комиксы которые вы можете поискать в сети (конкретно в группе вконтакте посвященной фильму). В них вот кое-что интересное (не всё) рассказывается об этом злодее. А последняя локация фильма то бишь битва с боссом вообще напоминает конец игры Call of Duty: Modern Warfare 3. И там можно лицезреть самые плохенькие спецэффекты за весь фильм, но при столь малом бюджете это нормально.\r Под резюмируя хотелось бы поблагодарить режиссера дебютанта Илью Найшуллера, продюсера Тимура Бекмамбетова что поверил в такую креативную идею, а также тех кто выделил деньги на такое кино. А это в размере 2 000 000 $ что для рос. кино уже не совсем-то и деньги. Конкретно на этот фильм собирали при помощи краундфандинга IndiGogo, ну и Минестерство культуры РФ тоже выдало деньги. Вот только минкульт (Фонд кино) почему-то вырезал сцены где полицейские домогались до женщины, якобы это порочит честь полиции. И это после того как в \"Самом лучшем дне\" пьяный гаишник сношает пьяную певицу. \"Не-не-не, это нормально, это же караоке-комедия, тут и должно быть так чтобы было смешно!\"-- ответил тот кто распоряжается монтажом фильмов для цензуры. Еще в этой ленте представлено небольшое камэо youtube видеоблогера BadComedian, когда увидел его то заорал во весь голос.\r В общем для российского синематографа это кино просто \"10 из 10, о Господи, 10 из 10\"! В то время как на мировой арене я бы оценил на 7-8 баллов. Но поскольку это первый полнометражный опыт в экшене полностью от первого лица, то вам решать надо это или нет."
    },
    {
      "rating": "9",
      "text": "Amazing action movie, not for recommended for anyone who gets sick watching first person games. Non-stop action done in a very unique way, highly-recommended for anyone who loves non stop gore fests with minimal story."
    }
  ]
}