{
  "id": 121,
  "title": "Harry Potter and the Order of the Phoenix",
  "starring": [
    "Daniel Radcliffe",
    "Rupert Grint"
  ],
  "runtime": 138,
  "genre": [
    "Adventure",
    "Fantasy",
    "Mystery"
  ],
  "description": "Returning for his fifth year of study at Hogwarts, Harry is stunned to find that his warnings about the return of Lord Voldemort have been ignored. Left with no choice, Harry takes matters into his own hands, training a small group of students to defend themselves against the dark arts.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5aOyriWkPec0zUDxmHFP9qMmBaj.jpg",
  "categories": {
    "plot": 7.153846153846154,
    "acting": 6.208333333333333,
    "ending": 8.090909090909092,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Very enjoyable installment in the Potter franchise, like the fourth it becomes darker and the Wizarding World is starting to truly learn what they are up against. This movie also is a lot of fun despite its dark tone."
    },
    {
      "rating": "8",
      "text": "The dark days are coming closer, and this time, director David Yates is in charge to bring it in a very visual and chilling way, with 'Harry Potter and the Order of the Phoenix', the fifth installment in the \"Harry Potter\" franchise created by author J.K. Rowling.\r Harry (Daniel Radcliffe) is back with his cynical relatives, his cousin ends up being attacked by a dementor and Harry must use his magic to save him. This leads to him getting expelled from Hogwarts school as he performed magic in the presence of a muggle outside of the Wizard world. However, Madeye Moody (Brendan Gleeson) manages to help Harry escape his home and take him back to Hogwarts.\r Upon getting there, Harry finally meets up with his friends; Hermione (Emma Watson) and Ron (Rupert Grint), as well as seeing Sirius Black (Gary Oldman) who informs Harry that there might be a war brewing since Voldermort (Ralph Fiennes) has returned.\r The events of \"The Goblet of Fire\" (2005) still haunt Harry as he has recurring nightmares of the night Cedric Diggory (Robert Pattinson) was killed by Voldermort, yet nobody, other than Dumbledore (Michael Gambon) believes Harry. He manages to get out of trouble after Dumbledore defends Harry in a court case since he used magic outside of Hogwarts, but for some reason, Dumbledore seems distant from Harry, not even looking at him, and always walking past him whenever he tries to get his attention. Harry fails to understand this at the moment, but it soon becomes clear later on.\r It is also announced that a new professor named Dolores Umbridge (Imelda Staunton) is placed as the new teacher for the Defence Against the Dark Arts, and after Harry quarrels with her, she becomes very quick to judge Harry and punishes him for even thinking that there is a possibility that a former Hogwarts student was killed by the Dark Lord. Ron and Hermione hear about Harry's brutal and unfair punishment from Umbridge, and they urge Harry to tell Dumbledore about this, but for some reason, Harry refuses to even tell, as he assumes that maybe he deserves all of this, or maybe this is just some sign that he must be able to take any form of brutality if he were to go to war with Voldermort.\r Harry begins to receive more nightmares as it seems that Voldermort is getting into Harry's head, he does not understand why this is happening, but Professor Snape (Alan Rickman) tries to teach him to control his thoughts and discipline his mind. Things also get worse when Umbridge sets new rules for the school after Dumbledore's absence, which leads Harry, Ron and Hermione to set up their own little club where students can learn to defend themselves against the dark arts. Without Umbridge's knowledge.\r 'Harry Potter and the Order of the Phoenix' is a more steady paced movie, there are moments of dark tension and emotional complications. Director David Yates chooses cleverly how to handle the tone and pacing for this particular story and the cast, once again, manage to commit to their performances, especially Imelda Staunton, who plays the ever so unlikeable Dolores Umbridge.\r The battle scenes are small, but they are gripping and dark and at times, haunting. The effectiveness of the mental and inner conflict work well for the title character and what we are about to see in future installments. This is another good chapter of the franchise."
    },
    {
      "rating": "7",
      "text": "With newbie director David Yates in control of the Harry Potter franchise, the movie's 'order' has been severely complex, making the wonderful acting from the potter trio & the marvelous CGI kinda hard to follow."
    },
    {
      "rating": "8",
      "text": "It was a solid movie. There's not much to say about it. It is in the dead center of the Harry potter movies. The wickedness of Umbridge is probably the best part of it"
    },
    {
      "rating": "10",
      "text": "My personal favorite of the movies, the one I believe is most faithful to the books (while taking into consideration the changes made in the previous movies as well). The final battle between Voldemort and Dumbledore is one of my favorite moments fom the whole Harry Potter franchise."
    },
    {
      "rating": "9",
      "text": "With it being the longest book and shortest film they had a lot of work to make this not rushed and boy did they do fantastic. Strong performances, beautiful visuals, great action, thrills and some heartwarming moments.  I give this movie 92% of a good film."
    },
    {
      "rating": "5",
      "text": "Aside from the fantastic dementor attack at the beginning, this movie was pretty much not good.  WHAT happened at the end in the department of mysteries?  All of the shelves just start falling down and there was no cool wand battling in the different rooms like in the book.  That was the best part of the book and they left it out.  The fifth book has a lot of really good important stuff and moments that they either butchered or just left out."
    },
    {
      "rating": "3",
      "text": "This movie was a horrible addition to the series. We are not talking about minor adjustments to plot, which is, as I think all of us can agree, a neccessary evil for transforming a 900pg book into a 100-200pg script. I am by no means a die-hard fan, but felt that the director over-emphasized the smallest of scenes in an effort to make the more more appealing to the usual \"dumb movie-goer\" audience. Take the Harry/Cho kiss. This wasn't even talked about in the book, yet was by far the longest single shot of the movie. It was the the rush rush rush of the movie was suddenly slowed-down for this one really unimportant moment. I wouldn't complain if that was an addition to an already true-to-the-story film. Changing the plot, as well, for unnecessary reasons is just pompus. I felt that by-far the acting in this movie was the worst, and that falls entirely on the director, not the actors, as we know they have done better. The young actors said they liked this director the best, which means he was probably the most laid back, which is obviously shown on screen in their portrayal. Evanna Lynch's pausing in between phrases was something that could have easily been fixed by building confidence with the character and the lines, another job that lies solely on the director. I have been told that the movie was easy to follow for someone who did not read the books, but I'm not sure how it's possible as I just read the book a few days ago, so it is fresh in my mind, and I could barely follow it myself. A waste of time and money. Next!"
    },
    {
      "rating": "10",
      "text": "good game:)I love the ability of being able to walk all over school-grounds.nice way to cast spells:) I think it is attached to the storyline of the book.mute-button for Hermione?Score: 10.0"
    },
    {
      "rating": "0",
      "text": "There were to many thing missing. It went from discussing about the DA and then into getting into it. This harry potter movie was by far one of the worst because of all the crucial pieces of information that were missing. I sat through the whole confused even though i just read the book before the movie. It doesn't even tell how they found the room of requirement"
    },
    {
      "rating": "1",
      "text": "What a mess - surely the most apalling of all the Potter films, and that's saying something because they are all pretty awful. I hated every minute of this crappola."
    },
    {
      "rating": "10",
      "text": "This is my 6th favorite Harry Potter movie. Daniel Radcliffe, Emma Watson, Rupert Grint, Imelda Staunton, Michael Gambon, Evanna Lynch, Gary Oldman, Alan Rickman, Matthew Lewis, Maggie Smith, Helena Bonham Carter, Robbie Coltrane, Mark Williams, Julie Walters, and Jason Isaacs all gave stupendous performances. The visual effects were spectacular especially the thestrals, when the students were learning the Patronus spell, Hagrid's half brother Grawp, and the centaurs. The writing, story and screenplay were fantastically amazing. The sets and scenery were very nicely done. Also the film score was great."
    },
    {
      "rating": "8",
      "text": "(84/100)Great ending but felt a bit silly in the beginning. The tonal shift near the end was a bit out of place: going from light-harded to quite dark."
    },
    {
      "rating": "3",
      "text": "The film was good but it wasn't great. I've seen better and I was quite disappointed when I fist saw the movie. I though it would look great after the goblet of fire, but still the forth is the best Harry Potter movie although a lot of stuff had been left out. It's a shame that they left out Quidditch and Ron and Hermione becoming a prefects. When you see it several times it clearly shows that it isn't great. Good,maybe even average, but not great. The best thing in the film is battle between Voldermort and Dumbldor, and the character of Dolores Umbridge. If the half blood prince turns out as his predecessor I very much doubt it that I'll buy that dvd."
    },
    {
      "rating": "8",
      "text": "The fifth installment of the series continues the adventures of Harry Potter and his friends as little do they know that their new teacher Professor Umbridge forbids them to ever use magic. When Lord Voldemort is already having armies at his command, Harry, Ron, Hermoine, and gang battle against him as they encounter new enemies and old enemies before Harry learns that \"neither one can live while the other survives\". I've saw this in a theater in Fredericksburg, Virginia, enjoyed it and now time for my opinion to make this review a little bit short. The fantasy action was amazing, the acting was neat and entertaining, the characters were a little bit developed, the villian Lord Voldemort was intimidating, but a lot of fun thanks to Ralph Fiennes' amazing performance, and the storyline was well-paced. Harry Potter and the Order of the Phoenix is an entertaining entry of the fantastic series. Next two reviews are HP6 and HP7 Part 1. 8/10"
    },
    {
      "rating": "4",
      "text": "A disappointment.  The worst in the series by far, and as Daniel Radcliffe gets older his attempts at acting get more pathetic.  Julie Andrews clearly should have played Umbridge- they have all the money in the world, couldn't they have made that happen?  Butchers the best book in the series, unfotunately."
    },
    {
      "rating": "6",
      "text": "It still entertains, but this is the weakest Harry Potter movie of them all."
    },
    {
      "rating": "6",
      "text": "Potter isn't the same in the Order of the Phoenix. The fantastical bliss has turned to a dark sadness, but there is a determination about the film that keeps it worthy. The signature franchise visuals are also in full bloom."
    },
    {
      "rating": "3",
      "text": "I have not read the books, yet even I could see that there is a large amount missing. There is no progression at all only poorly connected scenes with very little build up to the climax, which, whilst impressive on the special effects, has no intensity. Overall the film is just too shot and does not cover the subject matter that it is clearly trying too."
    },
    {
      "rating": "0",
      "text": "A Grave disappointment to Harry Potter fans everywhere."
    },
    {
      "rating": "4",
      "text": "Harry Potter and the Order of the Phoenix fails on many levels. To put things simply, shoddy writing is the film's major flaw, but not the only one. Uninspired and ultimately weak (And often awkward) direction is not helped in the task of making up for a lackluster script (More interested in ripping basic ideas from the book than exploring them in any detail) by an uninspired performance by an increasingly useless lead. Radcliffe's performance is stiff and lifeless, particularly in emotional scenes, such as those where has a go at this friends. Meanwhile, Warner Brothers set design continues their desire to make the mundain extraordinary, by making the Ministry of Magic - a conceivably dull place (Being a Governmental building) perhaps more impressive that Hogwarts itself. A big no-no. The book's most important scene, one in which Dumbledore shows Harry the Prophecy and tells him \"everything\", is butchered in a couple of awkward and considerably less well-conceived scenes. One scene in this set is considerably awkward and difficult to watch, being as it is so clearly out of place. It seems that after the series' superb fourth chapter, things have slipped to previously unheard of lows for Harry Potter. Even strong appearances from new cast members Imelda Staunton and Evana Lynch cannot rescue this train wreck. Avoid this movie at all costs."
    },
    {
      "rating": "2",
      "text": "This movie was terrible.Other than the brilliant performances put down by Luna, Umbridge and Harry, there really wasn't anything good about it."
    },
    {
      "rating": "3",
      "text": "being a big fan of the books, I was very very disappointed that they did not stay true to the book. changed things around and went from one thing to the next jumping around so much and didn't connect it smoothly."
    },
    {
      "rating": "5",
      "text": "This film was about half the length needed to do the book justice. Rushed and disjointed, missing some of the best scenes from the book and drastically reworking what was left in. The most unrealized potential of any of the films... tragic."
    },
    {
      "rating": "4",
      "text": "This has to be the worst Harry Potter movie I've seen so far, the darker tone makes this unenjoyable, the story is good but nowhere near what the others were, and the humor that was in the other movies is completely absent making this unenjoyable."
    },
    {
      "rating": "8",
      "text": "Fun film, Yates took some steps away from Curon and Columbus- but overall a nice dark tale with excellent shots."
    },
    {
      "rating": "8",
      "text": "Wow! Talk about a backlash. Did nobody like this film? This film is OK, despite all the naysayers. Given it is based on the worst book of the lot, it works surprisingly well. Admittedly, it would not have mattered much if it had never been made, because the overall plot does not advance all that far. Basically Harry worries about Voldemort for a while, irritates everyone, and then has another interminable face-off with the bad flunkies. But as far as these things go, not bad. I have to admit I did get the feeling there were too many British character actors (wonderful as they are) racing around doing nothing terribly significant. Imelda Staunton deserves special credit for bringing the delightfully awful Dolores to life. The principals were good, the sets were good, the script was ...OK. Bring on the next one."
    },
    {
      "rating": "10",
      "text": "I don't know what your guys comments say, but this movie was great. I'm a huge fan of the series and i thought this was the best one."
    },
    {
      "rating": "10",
      "text": "Awesome movie, it really captures the essence of the film."
    },
    {
      "rating": "6",
      "text": "When are directors gonna stop improving and follow the story so as to not ruin future films and story lines?"
    },
    {
      "rating": "9",
      "text": "While it was a bit too fast paced, I think the filmmakers did an awesome job of taking a 900 page book and turning it in a tight, psychological thriller. The acting was top notch, especially from Imelda Staunton and Daniel Radcliffe, who gives a powerful, emotional performance. This is a film that leaves you wanting more, which is both criticism and praise. Bring on the Half Blood Prince, Mr Yates."
    },
    {
      "rating": "6",
      "text": "Books are not films, of course, and that's why films should always take liberties with the source material. I've never been one to deny it. One Flew Over the Cuckoo's Nest is an example of a film that acted as an interpretation and not a flat-out cut-and-paste to screen. The latter is lazy film making. This fifth Harry Potter was rife with choices, but most of them were poor choices. Characters are left underdeveloped, suspense is nowhere and--as opposed to, say, Prisoner of Azkaban--it lacks imagination and the visual verve that should define the series. One might gather that the film's largely expository parts act solely as necessary buildups to some climax and they never act on their own. A film should never, ever, be about the payoff: everything in-between matters just as much as the fireworks finish. And Rowling has a fundamental difficulty with her imagination that I cannot ignore and that I have long wanted to point out. She only plays at knowing her world, but when she hits a creative wall, she inserts some magnificent and magical plot device to move along the action and stir some tension. By that method, she leeches and manipulates us all into believing her world. She did it in Goblet of Fire with the triwizard tournament. Somehow a large maze appeared and there were other massive geographical elements that had heretofore been absent. To me, that's inept storytelling and, in fact, it cheats not only her readers, but her otherwise imaginative self. Now I can understand to an extent because people often rush her creative process along, but the effect is diminished by it and the story's credibility disintegrates evermore because of it. In Order of the Phoenix she added \"the Room of Requirement,\" which I'll refrain from explaining in the interest of people who have yet to see the film--just take my word for it. But most importantly, the characters needed some development to make the themes more potent. The book exceeded 800 pages and clearly that complicates matters. A solution would be to break the film into two parts and release them separately. Ironically, the fifth book was my favorite in the series thus far (the seventh to be completed soon), but the adaptation was my least favorite of all."
    },
    {
      "rating": "5",
      "text": "It had it's moments, but Goldenberg's screenplay was laughable. A confused mess. Very few of the children have improved as actors. I am not anticipating the next movie."
    },
    {
      "rating": "10",
      "text": "Harry Potter and the Order of the Phoenix is one of the best of the series so far, followed by Harry Potter and the Prisoner of Azkaban. The ending action/fantasy scene in the end was amazing and had spectacular visuals and graphics. This one's intense and powerful. The acting was dazzling throughout all the cast. There's nothing wrong about this Harry Potter episode."
    },
    {
      "rating": "9",
      "text": "Very well adapted... great special effects!"
    },
    {
      "rating": "10",
      "text": "This is the best Harry Potter film yet and should not be missed by the fans of the series or anyone who enjoys fantasy thrillers."
    },
    {
      "rating": "5",
      "text": "This film was a major disappointment to this die-hard fan of the Harry Potter book and movie series. Big booms, no chemistry. Daniel Radcliffe's acting was good. Everyone else's was uninspired, except the Luna Lovegood role which was played badly. The director fell down on the job. This cast can do and has done so much better in the past. There were major plot holes due to poor choices of what to keep and what to cut from the original story. Bellatrix LeStrange's costumer should beg for forgiveness."
    },
    {
      "rating": "9",
      "text": "Best movie so far! Anger!"
    },
    {
      "rating": "7",
      "text": "Falls into the middle of the Potter films. Better than Sorcerer's Stone and Chamber of Secrets, y et pales in comparison to Goblet of Fire and Prisoner of Azkaban (the best still). Definitely enjoyable to watch Harry and the rest of the cast age, but I still felt this movie lacked a certain coherence and felt rushed."
    },
    {
      "rating": "8",
      "text": "Best of the Harry Potter films. The acting (especially Umbridge and Snape) was great, and the new writer seemed to finally figure out how to compress the story in a way that was brisk but true to the source."
    },
    {
      "rating": "8",
      "text": "They left out the swamp. They left out a lot of things, but I was still pretty happy, because it's not going to be perfect no matter what."
    },
    {
      "rating": "10",
      "text": "This movie was the best so far, the director cut the right story lines and combined appropriate story lines to create a solid, condensed film that should leave most Harry Potter fans happy."
    },
    {
      "rating": "9",
      "text": "By far the best of the lot so far!! Caught a midnight showing last night and was pleasantly surprised. There were changes, so hardcore HP fans may be upset about that, but I thought they were good, added to the film and dare I say...may have even been an improvement over the book. Umbridge is also dynamic! You hate her and love her at the same time...she completely embodied the character. I can't believe the adventure will be over in less than two weeks when the book comes out."
    },
    {
      "rating": "9",
      "text": "I think this was a great movie. Though I didn't really care for the ending, the movie had great effects and kept you on the edge of your seat."
    },
    {
      "rating": "7",
      "text": "I basically agree with Stephanie Zacharek's review from Salon.com. If you haven't read the book, I'm not sure this film will work that well for you. But if you have read it, this is film is pretty good (at least I thought so). It's successful parts really made up for some of the bad screenwriting/editing (ugh, and some of the choices the screenwriter made were total crap) but I loved Umbridge, Luna and Bellatrix--perfectly cast. Even little Ginny was pretty prominent in certain scenes (hint hint). Harry's emotional \"growing\" is still the centerpiece as in the book. Plot-wise, unless you read the book, you'll have no idea what ground was made as they really don't go that far (or show it anyway) & ironically the \"Order of the Phoenix\" is largely cut out of the film. The end climax scene in the Ministry is done very well though. I still think PoA might be the better Potter film so far, but OotP is definitely vying for the top."
    },
    {
      "rating": "10",
      "text": "I think this was the best Harry Potter yet! Although I didn't read this book, but read the first four, I wasn't confused at all. It was very well made and extremely entertaining. The action was great in the end. It had a perfect balance of humor and seriousness. The acting was much better!!!! Finally, this was the first movie in the franchise to stray away from the juvenile parts of the other films. Excellent MOVIE!!!!!"
    },
    {
      "rating": "8",
      "text": "I left the movie theater satisfied with HP:OP. Overall the movie is unequal in terms of rhythm, but much more believable in terms of presentation. The story shows a more internal side of Harry, and the movie as more decent special effects. During all the movie you want to help Harry and his friends against the Ministry, and that's a good thing...that means the story holds up emotionally. The special effects, the music are there for the story. Not the other way around. However, I am unsure if young kids would appreciate this movie because it has a underlining political scheme to it. It might not be entirely understandable to them...A very good movie with a more mature tone to it."
    },
    {
      "rating": "8",
      "text": "A great adaptation. The true magic here is squeezing this massive story into just over two hours of fun. For true Rowling fans, a true delight. For the rest, a solid film, and visual treat."
    },
    {
      "rating": "4",
      "text": "The movie butchered the book and changed things ,not just left out, of the story. Someone who never has read the books will be fine watching this movie, but the rest of us will be highly disappointed."
    },
    {
      "rating": "10",
      "text": "This movie was easily the best of all the movies, there wasn't all that much filler compared to the book, they cut a lot of stuff out. But the action sequences are amazing, and this movie finally shows how harry potter isn't a children's book, goblet of fire started that but it still had some childish aspects. This movie between the opening scene to the final battle was dark, and very intense and in my opinion a very good movie."
    }
  ]
}