{
  "id": 88,
  "title": "Harry Potter and the Chamber of Secrets",
  "starring": [
    "Daniel Radcliffe",
    "Rupert Grint"
  ],
  "runtime": 161,
  "genre": [
    "Adventure",
    "Fantasy"
  ],
  "description": "Cars fly, trees fight back, and a mysterious house-elf comes to warn Harry Potter at the start of his second year at Hogwarts. Adventure and danger await when bloody writing on a wall announces: The Chamber Of Secrets Has Been Opened. To save Hogwarts will require all of Harry, Ron and Hermione’s magical abilities and courage.",
  "releaseYear": "2002",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sdEOH0992YZ0QSxgXNIGLq1ToUi.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 7.730769230769231,
    "ending": 7.625,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 7.166666666666667,
    "funny": 7.333333333333333,
    "action": 7.9
  },
  "reviews": [
    {
      "rating": "8",
      "text": "While it's not my favorite Harry Potter movie (that honor goes to \"Order of the Phoenix\"), seriously, what's with the low user score? It was just as good as the first one, and better then the third and sixth ones!"
    },
    {
      "rating": "8",
      "text": "As Harry attends his second year at Hogwarts, dark forces are at work. This dark intensity drives the entire movie, and Harry acknowledges that Voldemort and himself have a dark relationship. He knows that the Dark Lord wants to kill Harry. More secrets are unveiled as Harry tries to unlock the mystery of the chamber of secrets. The film matures slightly from the cute and frendlier 1st installment, and this deserves better ratings because there are more thrilling action sequences, which makes the film more intriguing. As I am watching, the film gets better and better with the final 40 minutes becoming the peak out of the entire movie. The ending has left me with a slight sadness, feeling sorry for Harry and what he has to go through, but I soon am thirsting for more. The character Gilderoy Lockhart I have a major issue with, mainly because it doesn't make the film as comforting as I would like it, but better directed and produced than the first."
    },
    {
      "rating": "7",
      "text": "This second installment is on the same level on the first one, also containing a few highlights of entertainment like Aragog and Kenneth Branagh as Gilderoy Lockhart"
    },
    {
      "rating": "7",
      "text": "It moves like the book it was based on, and with that comes both positive and negative results. Luckily they are mostly positive. The acting is surprisingly solid considering the actors are all kids, and the directing is capable enough."
    },
    {
      "rating": "6",
      "text": "The first hour (hour and a half max) of this film was amazing and it gave me high hopes but the moment the film got to the part where Harry finds out he is a parselmouth then it just got terrible and turned into a generic action film that completely ruined the first really enjoyable hour of the film."
    },
    {
      "rating": "7",
      "text": "The Chamber of Secrets is way too long, and after a while you just want it to end. Nevertheless, it starts out as a better movie than the Sorcerers Stone, as did the book, and is still exciting and fun; if not the most childish of the series."
    },
    {
      "rating": "6",
      "text": "I gave this a wasted potential because it lacks what the first one gave us. And its a little to long and slow at times."
    },
    {
      "rating": "10",
      "text": "Somehow, this sequel manages to be even more magical than its predecessor. It unleashes a string of brand new ideas and invents some marvelous new characters. The is a film no true movie lover is going to want to miss."
    },
    {
      "rating": "10",
      "text": "Well written, wonderfully cast, and flawlessly flowing, Harry Potter and the Chamber of Secrets offers suspenseful thrills, honest emotion, and an obvious respect for JK Rowling's masterpiece."
    },
    {
      "rating": "8",
      "text": "This second installment continues the adventures of Harry Potter as he and his friends discover that the hogwarts students are being attacked by a deadly snake known as the Basilisk and must solve the mystery that lies within a chamber known as the Chamber of Secrets. Little does Harry know that a shocking secret that will reveal the dark lord who killed his parents.\r I saw it twice in theaters perhaps at the exact same year it came out and I have no time to waste, so let's get on to my opinion.\r The CGI effects were pretty cool and the fantasy action was intense.\r The storyline followed the book as it should be and it succeeded.\r The actors have done well at their performances once again. Kenneth Branagh was entertaining as Professor Lockhart and was very funny, Daniel Radcliffe did well as Harry Potter once again, and the rest of the actors did very well at their performances, etc. etc. etc.\r There's nothing negative to say about it, so I'm all set.\r Harry Potter and the Chamber of Secrets is a successful sequel and its as good as the previous installment.\r 8/10"
    },
    {
      "rating": "7",
      "text": "Harry Potter and the Chamber of Secrets is the second out of the eight films, but this and the first would be the only ones that actually makes sense and do not feel jumpy. Someone who has read all the novels would have no problem decyphering the other Harry Potter movies, but this is one of the few that will be easy to follow even by non-Harry Potter fans. It may not be a completely enjoyable film, but this is because it is aimed a slightely younger and less age-ranged target audience. Still, it will keep you interested from beginning to end, and don't forget it has Dobby!"
    },
    {
      "rating": "6",
      "text": "The movie isn't what you expect if you waited for a another marvelous Harry Potter film. However, it still has impressive visuals and and well made CGI creature...DOBY!!!!"
    },
    {
      "rating": "0",
      "text": "Really boring, it may have some use for the series, but doesn't do anything special. Chris Columbus just doesn't get it. Could have been so much better."
    },
    {
      "rating": "8",
      "text": "With it being even longer, and lacks some adventure, the film has good performances, thrills and a strong story making it somewhat an improvement and somewhat not.  I give this film an 82% of a good movie."
    },
    {
      "rating": "7",
      "text": "To be honest, I loved the first hour or so of the film but once it started getting into the whole situation of the Chamber of Secrets being opened - The film took a turn for the worst and it went from a great film to another corny and childish and pretty generic \"hero saves the day\" film. The acting is still solid but can be a little lacking at times from the younger cast members, Once again they fail to use the experianced older cast members to their full potential.\r It was slightly better then the first film but not by much."
    },
    {
      "rating": "5",
      "text": "The only thing that this film improved on the first one was the Quidditch match. After that, this film was rather mediocre, especially near the end. This film just drags and drags and drags until you're begging for the predictable ending to happen. \"Chamber of Secrets\" is arguably my least favorite HP book, and it's arguably my least favorite film of the series as well. There just wasn't enough material there to keep one entertained for two hours."
    },
    {
      "rating": "9",
      "text": "Not a kids movie."
    },
    {
      "rating": "6",
      "text": "The first hour of the film was amazing but as soon as they got into the parts with the actual Chamber Of Secrets, The film just went all downhill from there. The cast was solid and I was disapointed by the lack of use of the older and experianced cast members. It was ok overall."
    },
    {
      "rating": "6",
      "text": "Same as the first only this time the acting dropped. I thought Tom Riddle and Daniel Radcliffe did a poor job, and special effects fell apart. Plus it tryed to add a darker tone but instead it felt lighter to me. However the movie was good for it's humorous car scenes and Ron's pathetic yet extremely amusing reaction to spiders."
    },
    {
      "rating": "5",
      "text": "Harry potter gets better and better, and for this installment was not too bad, yet not too good. If you like most of the Potter flicks this one won't glue you to your seat. Its still fun though\r Next Movie!"
    },
    {
      "rating": "0",
      "text": "Boring as hell. Painful to sit through this. My Lord, it is a good thing they changed directors even though they were just as horrible too. Read the books, not this poorly acted adaptation."
    },
    {
      "rating": "10",
      "text": "Actualmente casi no veo esta pelicula, pero en su momento y durante años la veia sin parar, simplemente me fascina y siempre paso un buen momento cada vez que la veo y el videojuego homónimo de PS1 me hace amarla aún mas."
    },
    {
      "rating": "8",
      "text": "(77/100)I watched the 174 minute edition and it was a bit of a drag to be honest. Story was good but could've been a little bit shorter."
    },
    {
      "rating": "8",
      "text": "Better than the novel."
    },
    {
      "rating": "7",
      "text": "A generally good film throughout, but unfortunately fell a little short of my expectations. Nonetheless, a good start to a promising series."
    },
    {
      "rating": "8",
      "text": "A great movie full of excitement and fun."
    },
    {
      "rating": "10",
      "text": "Again this movie has also been criticized for following the book too much. Personally, I think staying true to the book is the strongest point of the movie. Staying with the book imparts the same magic of the book which has created the Harry Potter phenomena. The story... well I don't have to say anything about that because the success of this franchise has already proved it. Acting... couldn't be better. The trio, Daniel, Rupert and Emma were born for these roles. All the adults are perfect for their roles and create the same attitude and personality as their characters have in the books. Direction... Warner bros did a very smart thing by giving it to Chris. A person like him knows how to make a family movie which not only entertains but remains in your memory forever. Even though many have criticized Chris for making such a kiddish movie but I think that as this is the first year you have to stay with the kiddish atmosphere as the children are only 12. Visuals... for a 2002 movie it's visuals are excellent. Even today they look fantastic! Overall I'd rate this movie an A because the book created the world and the characters but the movie has created the true images of the Harry Potter world."
    },
    {
      "rating": "7",
      "text": "The second film is not much better than the first film, it's still childish and not matching the book's environment, but it's still enjoyable as a film."
    },
    {
      "rating": "9",
      "text": "I've read the reviews, and plenty have said, \"It was boring\". I've read the book (how many times?) and saw the movie at the evening premiere, and it was NEVER boring compared to the first one, but that was all Richard Harris' fault since he had no exspression whatsoever in the first one, unlike this one where he's a much better actor. It's funny, but I thought the first book, in my opnion, was better than the second one, but I thought the first movie was worse than the second one. It felt lifeless and fake, whereas the second one had better acting, special effects, and even the Hogwarts setting felt better, while in the first one it felt cold, dirty, and some where you don't want to live. I was suprised at the lack of intelligiance the S.F. chronicle had when trying to \"support\" their opinion. Basically, all they were saying was, \"Harry Potter is supposed to be a SWEET, cute, little movie. There are some scenes that should have been deleated like the snake and spider scenes\". First of all the Harry Potter series (both book and movie) didn't intend to be sweet. It's actually quite dark, especially the 3rd book, Harry Potter isn't supposed to be a cute fairy tale. It's dark fantasy. And secondly, about the spider and snake scenes, well, if they didn't have those scenes then: 1. The movie would be EXTREMELY unfaithful to the book. 2. It wouldn't have a plot without those two scenes. That person either hasn't read the books, or hasn't even heard what they're about. Then again, the S.F. hates all the best movies (well, they did like Lord of the Rings, but that was the only time) and love all the ones people hate or don't even deserve to get the highest score (like \"The Ring\".) It was fun seeing this one too. I screamed (for the first time in a movie) at the part when ..... Not to mention I had a few energetic laughs as well. Kudos to you Columbus and co., for not screwing this one up like you did with the first one."
    },
    {
      "rating": "7",
      "text": "Columbus directed this? Really? A very good glimpse at the future of the series with the best visuals of it so far...would be great if it wasn't a half-hour too long. Some bits are put in just to please hardcore fans and they are really annoying and slow the pace down...but overall, solid, and in all aspects except editing, far superior to the first."
    },
    {
      "rating": "9",
      "text": "The is the best of the Harry Potter movies by far.  It follows the book extremely well, the setting and scenery feels really authentic and the story flows along and is exciting and a great adventure.  It really captured the mood, tone, and visualization of the book well. Plus the music was by John Williams which they are really lacking with the new Harry Potter movies."
    },
    {
      "rating": "6",
      "text": "Harry Potter and the Chamber of Secrets for better or worse will please book fans and fans of the predecessor. Columbus once again provides a mostly faithful story and continues a stellar casting adding new memorable characters and visually bringing Rowling’s world to life. Those who weren’t fans of the first one and/or are looking for anything new will be disappointed. The film not only recycles numerous plot points from the first film but once again suffers from overfaithfullness with scenes loosely strung together in an effort to maintain the source material resulting in a lengthy runtime in serious need of padding. Fans of the book won’t mine but others will depend."
    },
    {
      "rating": "8",
      "text": "While the Chamber of Secrets isn't as good as the first but it's still a great movie, and if your a fan of the first movie and like the books you should like this one."
    },
    {
      "rating": "8",
      "text": "Chamber of Secrets is an excellent second outing in the Harry Potter franchise.  Whilst still some distance away from Potter's best efforts (Goblet of Fire & Order of the Phoenix), this one improves upon the original and adds a whole bunch of memorable sequences. And you can't beat Kenneth Brannagh... He's just awesome!"
    },
    {
      "rating": "9",
      "text": "This is all nonsense. I enjoyed the film every time I watched it. It isn't the best film, but the best Harry Potter film to date. (Not including Deathly Hallows, haven't watched it yet)"
    },
    {
      "rating": "8",
      "text": "Although is my least favorite Harry Potter film, this doesn't mean it's a bad movie. The visuals are still stellar and the performances are well executed. My only problem is how some plot elements were left out, after all this is the longest film of the whole series. Aside from that, there is really nothing awful since the plot is really easy to follow. This is still an absolute delight in the Harry Potter film series."
    },
    {
      "rating": "7",
      "text": "Chris Columbus has pledged to make adjustments faithful to the books, and succeeded. Reading the book makes us see the movie the way it is. But adaptation of the second was very long, less than the first child, and to me that climate was not \"magic\" and the incredible first. It is very good, very faithful to the book, shows the beginning of the ripening of the series (even very lightly). When you take the second and sixth films, see how the saga changed the face. And he feels a twinge of nostalgia. However, is by far the weakest of the series. And the problem is the same as in Stone, the script, that's so true to the book it becomes extremely tedious as the movie. And what makes it weaker than the first is that the magic in this direction from Columbus disappears almost completely. The film continues with good performances and great junior adults. Again a beautiful soundtrack Williams, and the effects a little better over the first."
    },
    {
      "rating": "8",
      "text": "There is no doubt in my mind that Columbus does better with the second film. The story line for the second film just isn't as good and because of that at times a felt bored. Still an amazing film itself, it's just sad that it will have to forever be compared to the others."
    },
    {
      "rating": "8",
      "text": "This film is good in expanding the world of Hogwarts and introducing entertaining new characters as well as new settings. The sense of fun and magic is never lost but I must say that it does feel a tad overlong and like the first one doesn't always flow perfectly. However, the plot keeps us engaged as well as our 3 leads and the other actors portraying the teachers. Hogwarts is such a detailed, mysterious place that I didn't mind being stuck in it even if some scenes could have definitely been cut. Also the ending is a bit too much on the emotional side and with no real substance behind it. In the end though it is a very entertaining film."
    },
    {
      "rating": "8",
      "text": "Rather long, with questionable acting from the young cast and a somewhat overfaithful screenplay, this film is still enjoyable with a good climax, great effects, some dazzling performances, beautiful sets - and plenty of magic."
    },
    {
      "rating": "7",
      "text": "This was the second book/movie of the Harry Potter series, and even though some important backstories are delved into, it also comes across as one of the most forgettable.  However that by no means makes it a bad movie.  This was where Daniel Radcliffe, Rupert Grint, and Emma Watson started to become great actors, and the directing from Chris Columbus is among the best in the series.  The storyline is well-represented from the book (something only Columbus and Cuaron managed to do), and the special effects are extremely good for a movie released in 2002."
    },
    {
      "rating": "8",
      "text": "Even though it is one of my favorites within the series, I would cut 30 minutes out of it easily. Columbus tries too hard put every part of the book on the movie and ends up ruining what could be a thrilling film."
    },
    {
      "rating": "8",
      "text": "This one is more darker and complex than Sorcerer's Stone, thus the story and it's characters progress in a much more compelling and interesting way. The youngsters acting has improved since the first film. Some moments really advanced the plot of the story and gave helpful information, but they just felt a little too unconvincing and not really believable. For example: the talking spider Aragog. 3/4 stars."
    },
    {
      "rating": "10",
      "text": "This Harry Potter film lives up to the original with a darker story and more exciting action. This film helped character development for most of the series."
    },
    {
      "rating": "6",
      "text": "Equal to the first film, Potter 2 is fairly entertaining but very holey. Dumb fun."
    },
    {
      "rating": "7",
      "text": "Twice as spellbinding and twice as magical as the first, but a side-swipe story has left the Chamber of Secrets as one of the weaker entries in the massive franchise, this aside, Harry and his companions return in fine form for more secrets to unfold from the magical castle of Hogwarts.\rDaniel Radcliffe, Rupert Grint and Emma Watson all reprise their roles as Harry, Ron and Hermione respectively, and its remarkable how quickly these actors grow up, their tasks at Hogwarts also reflect their growth, they must deal with fame, lies and of course, magical happenings. When several students become petrified, as case of paralysis where the subject is frozen still without an immediate cure, Harry and his friends find themselves at the centre of it all again, more so for being in the wrong place at the wrong time.\rOf course there is still fun to be had, with Qudditch returning and looking better than ever, and of course the comedic tone remains on par, especially with addition of Kenneth Branagh as Professor Lockhart, a man who isn't everything he seems, we are also introduced to Dobby, a house elf who is out to help Harry in any way possible, but seemingly gets in the way at every turn.\rIts clear from the beginning that the tone has shifted slightly darker from the debut entry,  with equally as many thrills to be had and some spectacular set-pieces equate to quite the blockbuster film, but much of the cast feels underused, understandably its difficult to adapt a book into a two hour film but I feel some scenes could have been shortened to make way for the excellent cast, like the returning Maggie Smith, Richard Harris, in his last film as Albus Dumbledore after passing away, and of course the sublime Alan Rickman.\rWatching the film back, it does feel like a go-between, and while much more of the essence of the books is explored, it isn't one of the better entries in the films, it lacks the punch of fantasy that the others possess, and ultimately falls behind the rest.\rBut moaning aside, this is still a deserved entry in the series, it continues to amaze and carry the lives of our unlikely heroes, brimming with excitement, touches of horror and emotion, but turning into a darker path which suits the story it is telling. But the film is truly made again with the glorious cast who portray their characters with pride to the books but also to suit their own methods. Not the best, but certainly worth the watch."
    },
    {
      "rating": "10",
      "text": "This is a magnificent sequel to a magnificent start. This movie continues to follow the story of a young wizard and it matches the book point blank. UNDERRATTED!!"
    },
    {
      "rating": "7",
      "text": "This movie, like the first, was very well done. Also like the first one, there were some major and minor differences; however, not all of these seemed to work as well. Obviously it's impossible to include every aspect but there were some things that I think they could've/should've done differently. The most glaring example is how they butchered the ending of the movie. That didn't happen even remotely that way in the book. They made the Harry Potter character look kind of dumb with the way he reacted in the chamber whereas in the book, the things that happened weren't necessarily in his control and he had to react in certain ways in order to survive. Also, they cut out quite a bit of the process Harry, Ron, and Hermione took in discovering the secret. Still, they ultimately got the gist of the book and didn't really leave out anything too major. The acting of the students was drastically improved so the movie flowed smoother. I just thought they could've done a much better job with the book-to-movie adaptation of the ending."
    },
    {
      "rating": "7",
      "text": "My adventure into the world of Harry Potter continues with the Chamber of Secrets. While I enjoyed the film, I didn't think it was as good as the Sorcerer's Stone, as typical of most sequels. In the Chamber of Secrets, we see Harry return for his second year at the Hogwart's School of Wizardery. In year two, students are being attacked, and Dumbledorf knows why. The legendary Chamber of Secrets has been open and a mythological creatures has been released. Harry and his friends have to find out who opened it and why before they are able to do anything about it. This story wasn't as mysterious or edge of your seat as the last adventure was, and I found some parts of it to be downright childish. What I enjoyed about the first film was that for all it has for kids, it had an equal amount of content that adults would enjoy. In the Chamber of Secrets, that element has been replaced with things like giant talking spiders, flying cars, and worst of all Dobby the troll. The story was pretty good, but it wasn't as refreshing as the last film, the cast was once again terrific, but the Chamber of Secrets seemed to be much more like a kids movie to me and for that reason was kind of a disappointment."
    },
    {
      "rating": "9",
      "text": "Almost as much a triumph as the first adaptation, Chamber of Secrets suffers slightly from some awkwardly-placed dialogue. But this doesn't significantly detract from the viewing experience, and its climax is among the best seen in any Harry Potter film."
    }
  ],
  "recommendations": [
    "harry_potter_and_the_order_of_the_phoenix",
    "harry_potter_and_the_half_blood_prince",
    "harry_potter_and_the_goblet_of_fire",
    "harry_potter_and_the_prisoner_of_azkaban",
    "harry_potter_and_the_deathly_hallows_part_2",
    "the_hunger_games_catching_fire",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "inkheart",
    "inferno",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "percy_jackson_sea_of_monsters",
    "odd_thomas",
    "the_hobbit_an_unexpected_journey",
    "the_golden_compass",
    "the_hunger_games",
    "alice_in_wonderland",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "the_hunger_games_mockingjay_part_2",
    "doctor_sleep",
    "the_count_of_monte_cristo",
    "looper",
    "fantastic_beasts_and_where_to_find_them",
    "it_chapter_two",
    "alita_battle_angel",
    "the_karate_kid_part_iii"
  ]
}