{
  "id": 94,
  "title": "Harry Potter and the Prisoner of Azkaban",
  "starring": [
    "Daniel Radcliffe",
    "Rupert Grint"
  ],
  "runtime": 141,
  "genre": [
    "Adventure",
    "Fantasy"
  ],
  "description": "Year three at Hogwarts means new fun and challenges as Harry learns the delicate art of approaching a Hippogriff, transforming shape-shifting Boggarts into hilarity and even turning back time. But the term also brings danger: soul-sucking Dementors hover over the school, an ally of the accursed He-Who-Cannot-Be-Named lurks within the castle walls, and fearsome wizard Sirius Black escapes Azkaban. And Harry will confront them all.",
  "releaseYear": "2004",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aWxwnYoe8p2d2fcxOqtvAtJ72Rw.jpg",
  "categories": {
    "plot": 8.473684210526315,
    "acting": 8.137931034482758,
    "ending": 6.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 9.333333333333334,
    "familyFriendly": 8.0,
    "funny": 6.5,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Might be the best of the series. It's certainly the most impressive visually, as Hogwarts, which sometimes felt as thrilling as a funeral home during Columbus' films, comes vividly alive in the third film. Sirius Black is such an intoxicating and great character, he really ties the movie together greatly. This was arguably Rowling's peak in the series."
    },
    {
      "rating": "10",
      "text": "Its one of the best in the series because of great organization of the story."
    },
    {
      "rating": "10",
      "text": "In year three, our cast of unique and magical characthers have to deal with a new threat, an escaped prisoner, from Azkaban Prison, who seems to want to kill Harry Potter. Azkaban was a return to the magical formula that made Harry Potter legendary. The story here is suburb and unlike the Chamber of Secrets, it isn't dummied down or rushed for us. New elements are introduced such as the secret map and time travel, but perhaps most important of all we finally see Harry demonstrate some of this incredible power that has led to his fame at Hogwarts. The story was terrific, the action was great, the performances were off the chart, and the childish stuff was kept to a minimum, but was Azkaban perfect? Many critics will tell you that this is the best of the Potter films and it was terrific, but personally I was hoping to see more of the world outside of Hogwarts. I was looking forward to possibly seeing the inside of Azkaban prison and some of the people who are locked up there. While I appreciate the different views and new filming location, it was still centered at Hogwarts. Not a bad thing, but personally I'd have liked to have seen something else. Aside from that, new Director, Alfonso Cuaron, does use parts of the story that were excluded in the previous films, he also does give us a new location, and view of things. Overall, Cuaron really does do a tremendous job, making this film geared more toward young adults than children. Azkaban is much closer to being what J.K. Rowling intended than the Chamber of Secrets was. I absolutely loved this film, there are just some parts of this film that are truly amazing. If you're picky like I am, and are only going to give Harry Potter one shot, then I suggest the film you watch is The Prisoner of Azkaban."
    },
    {
      "rating": "10",
      "text": "The best Harry Potter movie in the series."
    },
    {
      "rating": "10",
      "text": "Absolutely fantastic!!"
    },
    {
      "rating": "9",
      "text": "Alfonso Cuaron is a very accomplished director. And this dark, almost noir version of the whimsical fantasy series. By far, the most accomplished adaptation of Harry Potter."
    },
    {
      "rating": "10",
      "text": "My quest of watching the entire series of the Harry Potter movies continued with the 3rd chapter: The Prisoner of Azkaban.With a plot that twists, some known actors but also new to the series and novel magic spells, the 3rd Harry Potter movie is no different than the others, continues the story, adds to it and it's decently good. The way the students resolve the final puzzle in the end is also pretty slick.Harry Potter and the Prisoner of Azkaban is another interesting story."
    },
    {
      "rating": "10",
      "text": "Masterful filmmaking, an excellent John Williams score, great performances from everyone, Sirius Black, this is the best one."
    },
    {
      "rating": "8",
      "text": "Finally, a harry potter movie that starts childlike and ends with maturity! Bravo Alfonso Cuaron!"
    },
    {
      "rating": "9",
      "text": "Man, this is like the last good movie and last good book in the Harry Potter series rolled into one. Mildly confusing if you didn't read the books though. It actually alludes to how lacking of logical emotion the series will become."
    },
    {
      "rating": "10",
      "text": "Prisoner of Azkaban's cinematography itself blows you away, and the world of Hogwarts leaps from the screen almost as well as Pandora (and without the help of 3D).  Several new great characters (and actors) enter at this point, stirring darker themes up for the first time.  The storyline is also my favorite of the series, and this movie sticks to the source material incredibly well.  Emotionally charged, incredible acted, and superbly directed, this is easily for me the best movie of the series."
    },
    {
      "rating": "9",
      "text": "With strong performances stand out Emma Watson, thrills, a great score, great emotional depth, and dazzling visuals make this one of the best of the potters.  I give this film 90% of a good movie."
    },
    {
      "rating": "10",
      "text": "This is a new, equally entrancing look at the world of Harry Potter, a darker, haunting film that sticks with you."
    },
    {
      "rating": "9",
      "text": "A surprising improvement on the first and second installments in acting, artistic elements and emotional involvement in the story. It was darker and with this darkness came a more real movie, plus a pretty cool climactic battle"
    },
    {
      "rating": "5",
      "text": "The third time around didn't charm me as well as the first two movies in the franchise. They changed the director, which had a big effect on the overall tone of the movie. It was dark and unrelenting to watch. The only thing that appealed to me was how it ended and the magical scenery around Hogwarts. The rest, I could forget about it. There never was a bright moment in the movie, and the only thing Harry has to hold onto is his two friends, Hermoine and Ron. Harry has enemies, he has friends. He still hasn't fully understood that he will in the end have an epic battle with Voldemort because he has an ultimate desire too. Lord Voldemort is very powerful, but his lurking presence around the halls of Hogwarts doesn't frighten him as much as it used to. The director gives us an uncomfortable viewing experience that I wan't happy with and wish this doesn't happen again in the next film."
    },
    {
      "rating": "3",
      "text": "This one just doesn't give me that feeling the first two gave me and it lacks the action of the 4th and 5th films. By far the worst so far."
    },
    {
      "rating": "4",
      "text": "It's not as magical as the first two films. The sounds were also very poor, it doesn't seem to compliment the mood of the scenes. The only thing I liked about the movie was the environments were more detailed. Over-all, it was a bit disappointing."
    },
    {
      "rating": "5",
      "text": "BRILLIANT!"
    },
    {
      "rating": "0",
      "text": "Seriously, it needs to be redone. Professional reviewers, most of whom have no idea what the book is about, give it a good review because of what? The special effects? The \"dark\"ness? Did they read the book? Did the !@^%$#!&! director even read the book!?!?! Or did someone just give him a 2 minute summary of it and he made the movie out of what he could remember from it? How did JKR agree to this? Did she even? I can only imagine her feelings of horror as she watched her book getting murdered. It seems these questions will go unanswered. Feels like scenes were mixed up and a lot of stuff has been horribly changed and a lot has been left out. Good thing the director didn't stick around for the fourth part. Good riddance."
    },
    {
      "rating": "5",
      "text": "I just finished watching the first 3 Harry Potter films on DVD, in preparation for seeing the fourth film in the theatres tomorrow. Watching the films in this way really emphaszies how different the third film is from its predecessors. If I had not seen the first two films I would probabyl have rated this film a bit higher, but what bothered me was that this director chose to change both the scenery and Hogwarth's structure/routines. I liked that the first two films played up Hogwarth's similarities to traditional English boarding schools, and I was especialyl disappointed to see that this new director chose to \"modernize\" so many things (including the street clothing the characters wear for much of this film). Most significant is the castign change for the role of Professor Dumbledore. Another reviewere noted here that Dumbledore is the centre of the novels, and it's important to really feel that he's trustworthy as a leader. The late Richard Harris was wonderful; the new actor plays Dumbledore as a bit of a joke, and this bothered me. Dumbledore is portrayed in this film as a doddering old man, which is absolutely contrary to the books themselves and to the prior 2 films. All in all, this film will probably be most appreciated by people who haven't read the books or seen either of the previous films."
    },
    {
      "rating": "2",
      "text": "By far the worst Harry Potter movie. The adaptation is horrible, and the story-telling is lousy. The director gives a lot of time to stupid details [the bus, the spider-book, the boggart class...] instead of telling important passages in the story. And, the worst of all: the ending. The ending SUCKS. Looks like they ran out of money. Fortunately this was the only movie directed by Cuaron."
    },
    {
      "rating": "5",
      "text": "Definitely not as good as the first to.  I feel like it lacked the craft, beauty, and authenticity of the first two films and was really immature, especially at the end.  I don't understand how you can end a movie, especially Harry Potter with that last scene/image.  It really felt cheesy when it should be majestic and beautiful.  It wasn't bad but really I didn't like it as much."
    },
    {
      "rating": "5",
      "text": "High on special effects and much more spooky, funny and mature than the two previous films, but the direction seems to be a lot more lazy than the other films. This has resulted in my least favourite in the whole series (this far)"
    },
    {
      "rating": "7",
      "text": "A decent adaptation, but felt there were kinda too many changes from the book. This used to be my least favorite Harry Potter movie, until the Half-Blood Prince movie came out and took that honor."
    },
    {
      "rating": "8",
      "text": "Harry Potter learns that someone is after him and that person is known as Sirius Black. As he and his friends start their third year at hogswarts, they encounter new dangers that lie just ahead of them as they try to prove whether Sirius is innocent of not killing his parents or not. This was the only Potter movie that I've missed in theaters. That was pretty sad. Now to my opinion. Like the first two movies, there's nothing negative to say about this one. The actors were very entertaining (again) and I can say nothing more about Daniel Radcliffe, Emma Watson, or anyone else. The only actor that I have to say to is Michael Gambon for his wonderful performance as Professor Dumbledore. The CGI was cool (again) and even the action was cool (again). The storytelling was amazing and the storyline was well-paced. Harry Potter and the Prisoner of Azkaban is a magnificent third entry of the Potter franchise with a lot of depth to the third book of the series. 8/10"
    },
    {
      "rating": "5",
      "text": "Overall it was another basic HP film that doesnt really do much for the series. While it does start to make use of the older cast members, The acting from the young cast members is probably some of the worst in the series (A lot of over acting from them).\r Also the film is rather corny through out and it doesnt even come close to the emotional feel that the book had."
    },
    {
      "rating": "5",
      "text": "Harry Potter has suffered it's first little hiccup. I didn't really enjoy the new kind of filmmaking. The story suffers from a disjointed feel which i believe which not play well with people who have read the book, like me."
    },
    {
      "rating": "7",
      "text": "After a little break the Harry Potter franchise is back on track. After the poor show that was Chamber of Secrets, Prisoner of Azkaban puts all right that was once wrong. Once again sticking true to the books and only using SFX where needed, not all the time."
    },
    {
      "rating": "8",
      "text": "This is were the Harry Potters get great. Gary Oldman surely impressed me with his amazing performance as Sirius Black not to mention David Thewlis excellant acting as Lupin. Plus instead of continuing the playful happy mood like first ones it added mind-blowing foreshadowing and visuality that the first could not come close to having. Not mention they finally learned how to make a scary yet awesome creature(The Werewolf). This film is the reason that the Harry Potter trilogy stayed strong."
    },
    {
      "rating": "6",
      "text": "One thing I don't get about this movie is all the overwhelming praise it gets. In my opinion this one of my least favorite of the Harry Potter movies.\r Granted the effects are top notch, as usual, acting is mostly OK but perhaps a bit over the top at times. The plot, while interesting, feels rushed and the movie on th e whole feels like th e cliff notes to a much bigger story (one could argue that all the movies are like this, but this one just feels like it more.)\r The darker atmosphere, while done well, really is brought on too quickly when compared to the lighter hearted predecessors. It felt too much like the new director was trying too hard to give it a look and feel of his own.\r Overall:\rHPatPoA is good movie, it just feels like it is missing something that left me thinking \"Is that it?\""
    },
    {
      "rating": "8",
      "text": "Finally the Potter film that kicks of this film adaption the right way. New director Alfonso is superior to Chris Columbus in almost all ways. Taking away the kid like fluff and inserting some darkness. The young stars finally get a chance to shine and own their roles. Harry 3 is good to go."
    },
    {
      "rating": "9",
      "text": "The third instalment in Harry Potter franchise might be everyone's favourite. Harry Potter 3 is a mix of dark and its original family fun tone. I love watching this movie. I watched it a thousand times and I will watch it again and again. Harry Potter and the Prisoner of Azkaban is awesome."
    },
    {
      "rating": "10",
      "text": "Новый режиссёр (Альфонсо Куарон) явно пошёл фильму на пользу (и это далеко не только моё мнение). Конечно, Коламбус был хорош, но, этот режиссёр работает в рамках детского (семейного) фильма, и ему, рано или поздно, пришлось бы остановиться (что он, по своему желанию, и сделал). Видение Куарона очень хорошо: он правильно сделал, сделав фильм мрачнее, жёстче, живее, что ли. Кадры стали насыщенными. Фильм не замедляется, из него прёт энергия. Камера не стоит на месте, она стала подвижней, нередко, при переходе на следующую сцену, кадр затемняется (кто видел, поймёт), что опять же доказывает талант режиссёра. В фильме даже есть доля самоиронии. Отличий от книги, правда, стало побольше, особенно, как мне показалось, в начале. Киноляп же, в самом начале, все знают. Актёрская игра очень хороша, как и всегда. Спецэффекты, в этот раз, действительно на высшем уровне. Однако, мне кажется фильм чересчур перехвалили. Нет, я ничего такого не говорю, фильм просто безупречный, но почему, многие говорят, что это их любимая экранизация Поттера, когда, как мне кажется, тот же \"Кубок\" был в разы лучше? Музыка - на очень высоком уровне (лучше, чем в первых 2х), Уильямс хорошо постарался, однако опять же, почему многие говорят, что это их любимый саундтрек, когда в тех же \"Дарах Смерти\" уровень музыки ничуть не хуже? Также, я прочёл, что некоторые критики заявляли, что \"Это первый фильм, правдиво передавший сущность романа\". Не могу сказать, про что точно они говорили, но если про то, что я думаю, они не совсем правы. Первые два фильма тоже хорошо передавали сущность романов, только по своему. А \"Узник\" передал по своему. Но, фильмы о Гарри Поттере и должны были меняться, что они и сделали. Они становились мрачней и серьёзней, что пошло им на пользу. Не могут же быть 8 фильмов, снятых в одинаковом стиле.. 93/100, 10/10, 5/5, 4/4."
    },
    {
      "rating": "7",
      "text": "Tristemente debo decir que esta es la entrega que menos me gusta de la franquicia a nivel pelicula/libro, pero refiriendome unicamente a la pelicula es excelente a nivel cinematografico, pues es obvio ya que Alfonso Cuarón es un verdadero genio."
    },
    {
      "rating": "6",
      "text": "La verdad que a mi gusto es la peor de las 8 pero eso no la hace mala   ..."
    },
    {
      "rating": "10",
      "text": "This is my 3rd favorite Harry Potter movie and one of my favorite movies of all time. The direction that this movie took the series into a darker tone was fantastic. The performances from Emma Watson, Daniel Radcliffe, David Thewlis, Gary Oldman, Rupert Grint, Emma Thompson, Tom Felton, Alan Rickman, and Maggie Smith stupendous. The visual effects were spectacular especially the Dementor's, the Whomping Willow, Buckbeak the hippogriff, the Knight Bus, and The Monster Book of Monsters. The writing, story and screenplay were amazing. The movies film score was great just like the others have been. The scenery and set continue to be very nice and cool. The costumes were great in the movie. A+."
    },
    {
      "rating": "5",
      "text": "Interesting but not surprising.This film is the adaptation of the third book in the Harry Potter's saga written by J.K. Rowling, and is the first in the franchise that isn't directed by Chris Columbus, who makes way for Alfonso Cuarón. The cast, however, remains the same, which allows to this film doesn't seems a totally different thing from the first two, although there are changes in the way the story is told and seen. One of the most obvious changes is the gradual abandonment of the use of black school robes, almost ubiquitous in the first two movies. For some fans, its a transition to another stage of the film franchise. Also notable is the arrival of Michael Gambon to the role of Albus Dumbledore, left vacant by the death of Richard Harris. Although loyalty and attachment to the original book and it's details is a feature that will come to gradually disappearing, this movie still follows closely the history of the book. For all these reasons, this movie entertains, delights but haven't nothing surprising."
    },
    {
      "rating": "9",
      "text": "(94/100)Arguably on of the best out of the Harry Potter franchise. I liked the shift of cinematography a lot: no simple camera angles but long takes and sophisticated shooting methods. The way time was integrated into this movie was done very well too."
    },
    {
      "rating": "9",
      "text": "Great, but not as good as the fab book! Emma Watson and that are other guy(Cedric Diggory) are absolute gorgous (not together). I don't think Ron and Hermione should get together, Hermione is way to good for Ron."
    },
    {
      "rating": "10",
      "text": "From what I've seen people either adore this film or loathe it.I personally adore it. I think the actors are great (spesh Dan Radcliffe!) even though Richard Whats-his-name was actually better than Michael Gambon. The special effects in the film are great as well and as I want to be an actress when I'm older I wish I could have acted in it. I can't wait for the 4th film to come out (Nov. 18) and I'm also waiting for the 7th book. As you can see I'm an avid Harry Potter fan. Apparently the 5th film is out in 2007."
    },
    {
      "rating": "10",
      "text": "The best movie(and the goblet of fire) i've ever known! i live HARRY POTTER!"
    },
    {
      "rating": "9",
      "text": "A great movie.Infact the best of the lot.This movie possesses a certain warmth and security that was absent in the earlier Harry Potter films.The visuals are spectacular, so is the casting and direction.Alfonso Cuaron deserves all the accolade he is getting for putting together a polpular yarn into the big screen without displeasing most fans and critics.I was rather amused to see this film as my expectations were very low after being treated to two dry affairs previously.I would have given the movie a rating of 10, if it had not been for the miscasting of Dumbledore and that screaming Sirius Black poster.Michael Gambon is a decent Dumbledore,but he doesn't meet the poignant expectations created by the late Sir Richard Harris.I still firmly believe that Sir Ian Mckellen would have made an excellent Dumbledore.  Overall a great movie recommended for any Harry Potter fan."
    },
    {
      "rating": "9",
      "text": "Fantastic, very close to the best in the series."
    },
    {
      "rating": "9",
      "text": "Now this movie has been praised for turning away from the book and creating something new and different. Personally, changing things is the weakest point of this movie. If you haven't read the book then you'll either find it very confusing or you'll love it, but if you've read the book then nothing will stop you from finding faults and flaws. The story... well If they just wouldn't have deleted some main plots, it would have been as good as its predecessors. Not including the plots from the book is understandable but introducing new things is unacceptable. Acting... the trio have matured very much and I'd still say they were born for these roles. All the adults are great as usual. The two new actors, David as Lupin was perfect but Michael Gambon as Dumbledore... oh boy! Erase what I said in the beginning about the alterations in the plot being its weakest point. No! Michael Gambon is the weakest point of the movie. He sucks big time!!! He has tarnished the Dumbledore portrayed by the versatile actor Richard Harris and the character created by the prolific writer J.K.Rowling. Michael Gambon - one of the major reasons why I disliked the movie, the other reason was the tiny whomping willow. Direction... I don't know why Warner bros removed Chris. It's not that Alfonso is not talented, but changing a director breaks a smooth flow which was found between movie 1 and 2. Sorceror's and chambers felt like it was from the same world but this movie feels like a whole new world, only the characters are same. Chris had improved upon chamber of secrets by making it dark and suspenseful and with prisoner he would have made a hell of a movie (mean it in a positive manner). Visuals... for a 2004 movie it's visuals are excellent. Even today they look fantastic! Overall I'd rate this movie a B+. I would have given it an A if the director hadn't changed the small details which makes it very different from the books and the predecessor movies."
    },
    {
      "rating": "9",
      "text": "I realy liked all the action in it, I recomend it to ages 9+"
    },
    {
      "rating": "8",
      "text": "Firstly if anyone else uses the phrase magical to decscribe the harry potter movies I will break their legs. It's so annoying. Also this has been the best film so far. The first two, Radcliffe couldn't act or make anything look at all natural. At least there was a slight increase in acting quality there. Also I thought the effects were well included and didn't look out of place. And also no need to keep comparing them to the books, as it is obviously very difficult to transpose an entire year into pictures and keep the pacing reasonable."
    },
    {
      "rating": "9",
      "text": "Really, not just an excellent Potter movie but a genuinely good movie on its own. I don't think it's as good as Order Of The Phoenix, but still, excellent job. Emma Watson was good in this movie, and it's a shame she hasn't delivered that same performance."
    },
    {
      "rating": "9",
      "text": "The most engaging and entertaining film of the series to date. This is Harry Potter, darker and more serious than before. Good adaptation from the book."
    },
    {
      "rating": "8",
      "text": "I am a huge fan of the harr potter series, i have only read the first 2 books but i have watched all the movies and i was more impressed with the 2nd film more than the rest of them, but im reviewing the 3rd one, i thought it was good, sometimes during the film i lost interest but the fact that harry wanted to avenge his parents when he finds out the guy responsible is on the loose and looking for him, he wants to kill him and i love it when harry is doing anything to find this man....the darkness of the film kept me interested and some didn't but overall this film was just Ok...i give it an 8 because im a fan of the harry potter series and although it didn't impress me as much as the 2nd film, it's still good."
    },
    {
      "rating": "8",
      "text": "Excellent film.as always the central trio undermine the fantastic story and characters with wooden performances and overall dislikability but theyre poor acting is not enough to overshadow awesome stints from Oldman,Rickman and Thewlis to name but a few. its hilarious to read the geeky fan-boys reviews stating how poorly the director adapted their beloved rowlings book to film when we all know theyre clearly in the wrong.cuaron did a masterful job with a difficult piece of childrens fiction and should have stayed on to direct the other films rather than allowing rank amateurs to toe the line as rowling had intended all along."
    }
  ]
}