{
  "id": 107,
  "title": "Harry Potter and the Half-Blood Prince",
  "starring": [
    "Daniel Radcliffe",
    "Rupert Grint"
  ],
  "runtime": 153,
  "genre": [
    "Adventure",
    "Fantasy"
  ],
  "description": "As Lord Voldemort tightens his grip on both the Muggle and wizarding worlds, Hogwarts is no longer a safe haven. Harry suspects perils may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle fast approaching. Together they work to find the key to unlock Voldemorts defenses and to this end, Dumbledore recruits his old friend and colleague Horace Slughorn, whom he believes holds crucial information. Even as the decisive showdown looms, romance blossoms for Harry, Ron, Hermione and their classmates. Love is in the air, but danger lies ahead and Hogwarts may never be the same again.",
  "releaseYear": "2009",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/z7uo9zmQdQwU5ZJHFpv2Upl30i1.jpg",
  "categories": {
    "plot": 5.75,
    "acting": 7.0,
    "ending": 6.647058823529412,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 8.0,
    "funny": 8.8,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The somewhat penultimate installment of the \"Harry Potter\" stories by J.K. Rowling leads us closer to the end than we ever anticipated, with 'Harry Potter and the Half-Blood Prince', we see our main heroes nearing adulthood and adapting to bigger changes. Plus, we get an insight to how the Dark Lord can be defeated.\r Our main hero, Harry (Daniel Radcliffe) returns with Dumbledore (Michael Gambon) in order to find a former Hogwarts professor named Horace Slughorn (Jim Broadbent) and bring him back to Hogwarts despite his reluctance. It seems that Horace knows about what the young Voldermort, known as \"Tom Riddle\" was asking for when he was teaching him back in his student days. Dumbledore needs Harry to try and get answers out of Horace, but that seems to be a difficult task on its own.\r Harry returns to Hogwarts with Ron (Rupert Grint), Hermione (Emma Watson) and Ginny (Bonnie Wright), and he notices that Draco (Tom Felton) is acting a little suspicious, he suspects that he might possess something mysterious linking to the Dark Lord. Meanwhile, at class, Harry discovers an old text-book that has writing all over it, written by \"The Half-Blood Prince\", and it seems that this book has all the answers and that Harry can possess great power thanks to this mysterious prince.\r Harry attempts everything he can to try and get some answers out of Horace, but still couldn't be able to get anything. Hermione seems to be getting emotionally devastated in regards to Ron falling in love with another Hogwarts student, it seems even more clear that Hermione is infatuated with Ron, but is unable to express her emotion, especially since Ron is unwilling to listen as he already has a girlfriend.\r Harry also suspects that Draco and Professor Snape (Alan Rickman) are planning something which relates to them serving the Dark Lord. He believes that they are out to kill. Harry is also still upset at the death of his godfather, Sirius Black (Gary Oldman), which was done in the hands of the menacing Bellatrix Lastrange (Helena Bonham-Carter), and he is still filled with violent revenge, especially knowing about some dark wizard powers that was written by the \"Half-Blood Prince\".\r 'Harry Potter and the Half-Blood Prince' is a much darker movie than the previous installments, the cinematography by Bruno Delbonnel is suitably de-saturated to fit the darker tone, especially the more slow-paced storytelling. There are some surprisingly quirky moments, involving Harry's character that add some much needed levity to the darker side of the franchise.\r This is a more character driven movie, and I did like it better than \"The Order of the Phoenix\" (2007), I liked the darker and duller tone, I liked the fact that the characters are more fleshed out than ever, and I liked the funnier and quirky moments. This is a very sharp movie, and brings us closer to the end that makes you more excited, it's definitely one for movie-goers who like their characters fleshed out and the action, more compact."
    },
    {
      "rating": "10",
      "text": "Very entertaining and very intriguing at some points too. This movie looks amazing, has an incredible score and great acting. Maybe not a flawless movie, but the flaws it had weren't bothering me."
    },
    {
      "rating": "9",
      "text": "Half Blood Prince is the darkest of all Harry Potter films - quite literally. The grading effect applied to almost every single shot give the film an almost sepia tone, making the film look like the sets were illuminated solely by candles. However, given that this sixth instalment of the franchise is the most emotionally painful to go through, it works.Characters who have previously hovered mainly in the background finally take centre-stage. Tom Felton shows us a side to Malfoy - and himself - we never thought existed, and some of the finest work in Alan Rickman's career can be seen in this film. Finally, with regards to Dumbledore, one wonders how Richard Harris would have approached the material had he survived to the sixth film. His take on the character in the first two instalments is decidedly different to Gambon's in subsequent films. Nonetheless, Gambon certainly owns the part in this one, and there can be no doubt that he truly is Dumbledore.Alongside the emotionally weighty scenes is the franchise's trademark charming humour - supplied predominantly by Grint, Lynch and newcomers Jim Broadbent and Jessie Cave. The action scenes are very well shot, and the dark scenes are truly terrifying. After the final scene, you will be dying to find out what happens next."
    },
    {
      "rating": "8",
      "text": "Once again another great pull-up by Warner Bros. as the franchise begins to have the end soon in their next film which comes out the year after this came out."
    },
    {
      "rating": "10",
      "text": "Conserving its witty style and glorious performances, Harry Potter and the Half-blood Prince keeps taking the saga even better every time. Harry Potter's fans will no be disappointed."
    },
    {
      "rating": "9",
      "text": "Mi película favorita de la saga después de la última, oscura, llamativa, graciosa, divertida, buenos efectos, increíble diseño de producción, sin duda lo tiene todo!"
    },
    {
      "rating": "9",
      "text": "Editing just the needly, preserves the spirit of the book. The climatic sequence is one of best of full saga and increase the craving and curiosity to see the final episode."
    },
    {
      "rating": "9",
      "text": "One of the darkest and most emotional of the series, Half Blood Prince is also a fun and thrilling ride the whole way through! Even if it could have stuck to the book a little better, it is still another strong entry!"
    },
    {
      "rating": "8",
      "text": "The saga thickens up.This film is the adaptation of the sixth book in the Harry Potter saga, written by JK Rowling and was directed by David Yates. Always betting on the continuity of its main cast, as well as in the ability of its studios when it comes to special effects and computerization, Yates manages to make a great movie. The script also becomes increasingly complex and dense. The loves and crossed romances will increasingly join the central plot, and that will help to thickens it and make the film more and more adult and mature, deeper and psychologically challenging. The actors will also gaining more and more experience and maturity and will raise their performance to ever higher levels.This film is one of the first where the audience gets to see the other side of some characters. So far, everything was very black and white, there were good guys and bad guys. Now it will no longer be so, with some of the characters to show gray sides of their personalities. The photograph will accompany all these changes, becoming increasingly cold and dark."
    },
    {
      "rating": "10",
      "text": "As someone who has read only the first 3 books, this is by far the most captivating installment in the series. Filled wth more laughs and more tears than any to HP movie to date, this masterpiece will not disappoint and -for the first time - is a breathtaking watch for fans of the books and movies alike."
    },
    {
      "rating": "7",
      "text": "An improvement from 'Order of Phoenix', 'Half-Blood Prince' draws a little more macabre intentionally to it's style, most likely imitating Alfonso Cuaron's 'Prisoner of Azkaban'. But now I think this was it for me for Harry Potter as I've already read Deathly Hallows, and even if I didn't, The ending is obvious and cliched. Harry Potter became annoying after this. I just waited four years to say it."
    },
    {
      "rating": "9",
      "text": "The movie isn't marvellous and isn't a disaster too. For me, It's like a previous for an incredible movie that we'll see in next november. Scenes were added, the attack on Weasley's house was espetaculary made. But, not necessary things were included and necessary facts weren't shown. Because of that scenes, I gave HP'n HBP 9. Very good movie!"
    },
    {
      "rating": "9",
      "text": "The best one yet. I saw it the day it came out and they made it 99% like the book. Awesome."
    },
    {
      "rating": "8",
      "text": "Not great, but pretty good. It's one of the weakest films in terms of interest in the story and fun, but the film definitely has emotional power, and Radcliffe is at his best by far here. Everything seems determined to gear up for the final entry in the series, which will likely make or break this reasonably successful film franchise. The momentum built up by this film is pretty substantial near the end."
    },
    {
      "rating": "8",
      "text": "My favorite film in the series and imo this is the film where the franchise is at its peek. Radcliffe is at his best in this film imo and it shows in this film. It also does a great job bring the book to life and does well to make an emotional connect with you as well."
    },
    {
      "rating": "10",
      "text": "Best HP movie yet! Makes up for \"The Order of the Pheniox\" which was extreamly dull. I lvoed how Snape (Alan Rickman) is seen so much in this movie compaired to the others."
    },
    {
      "rating": "8",
      "text": "Good transitional film. Builds tension for the next installment."
    },
    {
      "rating": "8",
      "text": "This movie is different than most other Harry Potter movies with the whole teen relationships thing and the introduction of horcruxes. Slughorn is a great character and the meetings with Harry and Dumbledore are very entertaining, making a perfect set up for the ending"
    },
    {
      "rating": "9",
      "text": "(94/100)Definitely in the top 3 of the Harry Potter movies. I liked it very much."
    },
    {
      "rating": "10",
      "text": "Dazzling visuals, some incredible performances stand out Emma Watson, and some emotional depth make this easily one of the best film's in the franchise. I give this film 95% of a good movie."
    },
    {
      "rating": "8",
      "text": "As Harry learns that Hogwarts is no longer safe, he and his friends do a lot of important things that lie just ahead of them while he finds out that his arch-nemesis, Draco Malfoy made an unbreakable vow that if he doens't kill Professor Dumbledore, Professor Snape will kill him himself. With him dead, Harry is given a note that he faked the deathcrux, the only key to Voldemort's immortality in which he and his friends will succeed in finding them. Saw it with my sister in theaters at the same year and now I will make my opinion just to make this review short. The acting.....amazing The fantasy action.....great The storyline.....well-paced The sad where Professor Dumbledore dies.....so sad it will make you cry your eyes out. The characters.....a little bit developed, but were amazing Harry Potter and the Half-Blood Prince is a dark, emotional, and funny entry in the series. 8/10"
    },
    {
      "rating": "8",
      "text": "Funny,Funny,Funny! This is something that was missing from the other films but this one is full of true, fine humour! Well done David Yates, well done!"
    },
    {
      "rating": "9",
      "text": "The best in the series. Script, directing, acting were all very well done. The character development is great. And to differ with some posting, I think the storyline is carried very well. There's a lack of closure which simply leaves you want to more. Highly recommend it."
    },
    {
      "rating": "10",
      "text": "I'd say HP6 is the best one of the series with a good balence of action and comedy. I say it delievers in a way never thought possible by any Harry Potter movie."
    },
    {
      "rating": "4",
      "text": "I never thought I'd see the day that a Harry Potter movies disappoints me. Unfortunately, that happened with Half-Blood Prince, the only Harry Potter movie I dislike. I understand that there will be changes from the book, but my God, it's like they completely changed the story!"
    },
    {
      "rating": "9",
      "text": "As the 6th one begins, not only Hogwarts is in danger, but the muggle world too. No longer Harry is a small child that was almost killed by the darkest and one of the most powerful wizards in history, but fans know that the end is near. Soon Voldemort will come out of hiding and meet Harry. Fans will find the secret to Voldemort's immortality and the wizarding world could never have been more dangerous. He still has Ron and Hermoine to look up to, but it is no more fun and games. The movie however, was. Impressive special effects and groundbreaking sequences events, turn this into one of the most intense films of the entire franchise. David Yates amazes me again, and audiences will be anticipating the end for the final 7th installment of one of the world's most successful franchises."
    },
    {
      "rating": "6",
      "text": "Half-Blood Prince had potential to be the best, most magical Potter film yet. Instead, the movie veers unspeakably off course, not at all staying true to the novel, and ends like a light being softly lowered, when the novel ended in chaos and bloodshed."
    },
    {
      "rating": "10",
      "text": "This is my 4th favorite Harry Potter movie. The darker tone of the movie was great. The emotional depth of the writing, story, and screenplay were fantastic and beautiful. The entire casts performances were stupendous especially Daniel Radcliffe, Michael Gambon, Emma Watson, Rupert Grint, Jim Boardbent, Bonnie Wright, Evanna Lynch, Tom Felton, Jessie Cave, Maggie Smith, Robbie Coltrane, and Helena Bonham Carter. I loved the spectacular visual effects especially the Inferi, the scenes at Fred and George's joke shop, and the scenes at the seaside cave. The costumes were very  great in this movie. The scenery and sets were amazing and some very beautiful. Also the film's score was very nice as well."
    },
    {
      "rating": "0",
      "text": "Gloomy tone, dreary atmosphere, unsatisfying directions, and underwhelming storytelling to accompany a plot overstuffed with filler. The jarring, overly narrowed, and unfocused narrative of Harry Potter and the Half-Blood Prince adds to the bloated runtime, snail pace, and over abundance of exposition."
    },
    {
      "rating": "6",
      "text": "David Yate's Harry Potter is not magical anymore. The movie spins confusing romance between the 3 main protagonists and also focuses more on the violence of the scary Voldemort. This is not a franchise I was hoping to watch...."
    },
    {
      "rating": "5",
      "text": "Although the movie did follow the book very well (the best since #2), the movie was incredibly slow and boring, and the since that they added made no sense at all, like the weasley's house fire scene (what was that?).  Also they barely mentioned the Half-blood Prince and really didn't go in depth or include enough on the memories of Tom Riddle which was very significant in the books.  The magic and effects also seemed very cartoonish instead of real and authentic.  (Bring in Peter Jackson Please!)"
    },
    {
      "rating": "3",
      "text": "A complete bore! The movie reached about half way and i couldnt wait for it to end. There was a massive lead up and then it just fell and boy did it fall hard. What happened to the whole battle at hogwarts at the end?? It was a corny romance. I was really disappointed with the amount of things they left out. This is by far my least favourite movie out of them all. It was a real disappointement."
    },
    {
      "rating": "0",
      "text": "The movie is totally unbearable. The acting is poor and unnatural (how old are the characters supposed to be???), the plot is awfully idiotic. Frankly speaking, I watched the second half in double-speed, because I didn't want to waste too much time on this crap (I could turn it off, of course, but I had Hope that the ending would be great; it wasn't). The book is great, though. I'm trying to forget this movie poison."
    },
    {
      "rating": "3",
      "text": "This is without a doubt the worst movie of the Harry Potter series.  It took a book that was extremely thin to begin with and chopped half of it cleanly away, ending up with a montage of broken scenes where months pass in a second and a single day takes an hour.  Sometimes it tries to be an action film, sometimes it tries to be a comedy, sometimes it tries to be a suspense thriller.  In the end, it's just a mismatched rehash of what David Yates saw as the most important scenes from the source material."
    },
    {
      "rating": "5",
      "text": "It was way too long. But I was entertained but then again, I was bored at some parts in this movie."
    },
    {
      "rating": "0",
      "text": "This movie is horrible."
    },
    {
      "rating": "1",
      "text": "WHAT???? That was the response by the audience after the movie. To be honest, it would be a good question to ask if David Yates has actually read the books. Yea, he got the jist of things in the movie, however, the suspense, the questions, the mystery, where was it all. In fact, he ruined parts of the next movie by one simple scene. For the people who have read the books and seen the movie,"
    },
    {
      "rating": "3",
      "text": "If i hadn't read the book, maybe i wouldn't have been so dissapointed with this movie. But then again, i wouldn't understand a thing when the 7th comes around. I dont understand what they were thinking cutting every good/important peice out of this movie. I could name atleast 15 things missing/wrong in this movie. I say they re-make it. Just awful, if certain parts werent funny, or they hadnt stuck that tiny little bit of action in there I would give it a 0."
    },
    {
      "rating": "2",
      "text": "Flat like a tire. Drab. Was there a sound track? Stark coloring. Eviscerated the book. By far the worst H.P. movie. Ridiculous dialogue. The sort of work an ADHD meth addict would do if he were spiraling into suicidal depression. Had all the emotion of a tax return. Luna Lovegood earned both points I gave this film. She's the only reason to see it. She was perfect."
    },
    {
      "rating": "3",
      "text": "Extremely poor directing. Plays out almost as a 'cliff notes' movie of a 'cliff notes' synopsis of the true story that the director just pulled parts from and then made up connecting points. There was about 20 minutes of film time that had NOTHING to do with the book, that could have been utilized to include the final fight scene and the memories of the Gaunt family episodes."
    },
    {
      "rating": "6",
      "text": "Tremendous start but in the middle lost its seriousness and sudden astonishing pleasing end without much misery. i give for action sequences and 3-d effect 6."
    },
    {
      "rating": "3",
      "text": "Very Boring. I don't read the books, but liked all the other movies. This one was very bad."
    },
    {
      "rating": "3",
      "text": "This was not so much a film as a series of practically unrelated scenes held together with little substance. I give it 3 merely for the presence of alan rickman and michael gambon, the latter of which they killed off so eh... good look making the next one. The leads are as wooden as a 2x4."
    },
    {
      "rating": "3",
      "text": "An hour too long, filled with padding about teenage boyfriend-girlfriend relationships, which are anything but magical. I did my best to stay awake."
    },
    {
      "rating": "3",
      "text": "I just couldn't follow it. Very disappointing."
    },
    {
      "rating": "3",
      "text": "Apparently there are two camps regarding Yates' interpretation of HBP: either engaging and satisfying or off-track and disappointing. The split is a remarkable comment on either devotion to Rowling's story development or the state of book adaptation in filmmaking today, a subject for debate elsewhere. A big fan of the written series and bigger fan of the Azkaban film I felt confused and a bit cheated when watching HBP. The trailers were edited to be much more engaging than the film turned out to be, the acting/dialog seemed off balance compared to previous stints turned in by all parties, and the unbelievable reconstruction of the action on the tower were mind-blowingly inconsistent and disappointing. I can only hope the DVD will be released with much more-true-to-the-book alternate scenes."
    },
    {
      "rating": "3",
      "text": "From the perspective of someone who has neither read any of the books nor watched completely any of the other movies: HBP was a horrible movie and I hated it save for a few moments of levity. Mainly provided by Luna Lovegood. Most of the acting seemed off, especially the age of the actors compared to the characters was incredibly offputting - Daniel Radcliff looks like she should have a mortgage and a kid or two but is playing a high school senior-aged kid. The CG was used in lame pastiches and at unnecessary moments and featured nothing particularly impressive or imaginative to look at. By the end I was cheering for the Deatheaters, especially the always delightfully eccentric Helena Bonham-Carter."
    },
    {
      "rating": "7",
      "text": "It is better than the Order of the Pheonix it's still not as good as the previous movies, it's better because they brought back the humor but it still kept the darker tone and brings tension for the next film."
    },
    {
      "rating": "6",
      "text": "Harry Potter seems to be gathering for the big battle but much too slowly. Someone like me  the wait is becoming long and this movie is prolonging it even more. Still well made but you can begin to see it is getting rough around the edges. Get to it already."
    },
    {
      "rating": "3",
      "text": "I found this film boring for almost all of it. I really just did not like this one for some reason. It was just never for me. But you guys might like it but I don't. Harry Potter and the Half-Blood Prince 3.9/10"
    }
  ]
}