{
  "id": 86,
  "title": "Harry Potter and the Goblet of Fire",
  "starring": [
    "Daniel Radcliffe",
    "Rupert Grint"
  ],
  "runtime": 157,
  "genre": [
    "Adventure",
    "Fantasy",
    "Family"
  ],
  "description": "When Harry Potter's name emerges from the Goblet of Fire, he becomes a competitor in a grueling battle for glory among three wizarding schools—the Triwizard Tournament. But since Harry never submitted his name for the Tournament, who did? Now Harry must confront a deadly dragon, fierce water demons and an enchanted maze only to find himself in the cruel grasp of He Who Must Not Be Named.",
  "releaseYear": "2005",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fECBtHlr0RB3foNHDiCBXeg9Bv9.jpg",
  "categories": {
    "plot": 5.0227272727272725,
    "acting": 6.111111111111111,
    "ending": 6.428571428571429,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 5.5,
    "funny": 6.5,
    "action": 7.3076923076923075
  },
  "reviews": [
    {
      "rating": "9",
      "text": "A near perfect adaptation of the book, and one of my top three Harry Potter movies so far. This movie really set a high point for the franchise back in 2005. And this will probably be the only time Robert Patterson is in a movie that wasn't terrible."
    },
    {
      "rating": "8",
      "text": "This is an incredibly entertaining movie. It has intense action sequences, solid performances all around and maybe the most interesting new characters in the whole series, such as Professor Moody."
    },
    {
      "rating": "8",
      "text": "An enjoyable, thrilling and alluring entry with better acting than the first three and some captivating debut performances. Itâ"
    },
    {
      "rating": "10",
      "text": "My personal favorite in the series and in my opinion the best in the series, it's funnier and has more action, and the story is the best yet, a must see and deserving of nothing less than a perfect 10 not because it's the best Harry Potter, but because it will suck you in, a must see for fans."
    },
    {
      "rating": "9",
      "text": "Thrilling with some great performances, and dazzling visuals and Potters most complex story yet, and definitely the most entertaining of all of the Potters. I give this movie 92% of a good film."
    },
    {
      "rating": "5",
      "text": "Though the book was tantamount for the series, this is most definitely the weakest of the Harry Potter movies. The biggest travesty is that the movie completely loses steam halfway through and ruins arguably the best climax of all seven books because of it. It's also frustrating to watch the movie straddle between being a \"grown-up\" vs. a \"kiddie\" movie, as if the producers struggled to plaster the movie with a PG rating while it was destined to be PG-13."
    },
    {
      "rating": "8",
      "text": "The movie's story is very linear. However, the Potter cast & crew makes the story very easy to follow. Overall a enjoyable summer blockbuster you can't miss."
    },
    {
      "rating": "9",
      "text": "This has to be the best Potter film in the series, aside 'Half Blood Prince'. It's not as dreadful as the first two movies, which kinda sucked, and it's not like the 'Prisoner of Azkaban' which is over forced. But you have to give props to the third one, cause it definitely gave the franchise a new spooky, interesting dimension which made the franchise more enjoyable by adding some depth to it. In 'Goblet of Fire' there are some scenes that could have been done better, but overall the movie is quite fun, enjoyable and action peaked. Besides, I'm looking forward to 'Deathly Hollows Part II'. I think it will be the best one to date."
    },
    {
      "rating": "10",
      "text": "Spectacular film. The kids are just as good of actors as the adults now. Oh, I love that trio so, so much! Goblet of Fire takes a more dangerous approach and has a very spectacular and interesting premise. Pure magic for the young & old."
    },
    {
      "rating": "9",
      "text": "Goblet of Fire is in my opinion the best written out of all the Harry Potters besides maybe the last one. The adrenaline and excitement race in this one. Not to mention the best ending to any of the first 4 Harry Potters. All in All if your looking for excitement this film gives it to you."
    },
    {
      "rating": "10",
      "text": "\"The Goblet of Fire\" is another strong \"Harry Potter\" movie after 'Harry Potter and the Prisoner of Azkaban' (2004), a movie that is the first to not be given the family-friendly 'PG' rating because this one is darker and more violent, if not, more consequential than the previous three installments.\r Harry (Daniel Radcliffe), Ron (Rupert Grint) and Hermione (Emma Watson) are back and they attend the Quidditch World Cup, after the big event, there is danger lurking ahead as it seems that a murderer is on the hunt for Harry. As they head back to Hogwarts, there is another huge event that takes place called the \"Tri-Wizard Cup\", where they are informed by a newcomer called Alistair \"Mad Eye\" Moody (Brendan Gleeson) that no student under the age of 17 should participate as the contest and all the games involved are extremely dangerous and not for the faint of heart.\r All the other schools also part-take, but it seems that there is a strange mix-up as when all the students over the age of 17 place their names in the Goblet of Fire to allow them to take part in the challenges, Harry, who is supposed to be 14, has his name on there, somehow. A confused Dumbledore (Michael Gambon) then proceeds to let Harry part-take in this tournament, which is risky, but they have no choice, nor do they have any knowledge of who placed Harry's name in that Goblet.\r A reluctant Harry then decides to take these tournaments, but one day, during a deadly challenge, he comes across his parents' murderer, Lord Voldermort (a very scary Ralph Fiennes) who tries to kill Harry in the process, but luckily Harry manages to escape, unfortunately, a fellow student, Cedric Diggory (Robert Pattinson) didn't make it out alive, making this the most intense of the series, the fact that a student died under the Hogwarts premises, does raise the stakes for all the students, especially Harry, at Hogwarts.\r This is a darker, more red-blooded, and violent chapter in the \"Harry Potter\" franchise, equally as enjoyable as its predecessor. The young cast start to grow even more in this world and in the Hogwarts world, the action and the \"Tri-Wizard\" tournaments have this style that keeps you watching. They have this sense of perfectly timed choreography and sure-handed direction (by Mike Newell).\r The best is yet to come, this is where the series has peaked."
    },
    {
      "rating": "10",
      "text": "This is my 2nd favorite Harry Potter movie and one of my favorite movies of all time. I love how well-developed the characters have become and how mature the characters are now. The writing, story, plot, and screenplay were fantastic. The acting performances from the cast were stupendous especially Daniel Radcliffe, Emma Watson, Rupert Grint, Brendan Gleeson, Michael Gambon, Maggie Smith, Miranda Richardson, Robert Pattinson, and Ralph Fiennes. The visual effects were spectacularly done especially the dragons, during the underwater scenes, during the maze scenes, and the fight between Harry and Voldemort. The scenery and sets were fantastic in this movie. The costumes were amazing in this movie especially during the Yule Ball. Also the music and film score in this movie was great. An A+ movie."
    },
    {
      "rating": "9",
      "text": "(89/100)A very good movie that sets the tone for how dangerous voldemort really is."
    },
    {
      "rating": "3",
      "text": "Watched it again on dvd the other day, and have to say it's pretty dreadful. It wasn't the special effects or how faithful it was or was not to the book, but the acting! Man, totally sucked. Newell obviously wanted to give his version some theatrical flair, and because of that everyone acts really over the top, turning every character into a caricature and no nuance whatsoever. There were nice scenes and all, but on the whole the bad acting destroys it."
    },
    {
      "rating": "3",
      "text": "What a jumbled mess. Special effects ae used to replace the story line. There is little or no character development and little motivation for the conduct of the characters. Only the avid reader will understand who the characters are and their relationships. It is way too violent and scary for pre-teens. As Robert Evans has said, if it's not on the page, it's not on the screen. Avoid this one and rent it if you must."
    },
    {
      "rating": "3",
      "text": "Let me start off by saying that the film in no way follows the book, and that to me this isn't really a bad thing because I hated the book as well. But, instead of adhering to the overhyped book's many followers, the director has managed to cut out half the book and fill it in with fast paced action. The atmosphere the film has has been pilfered straight out of the LotR trilogy, and the musical score was absolutely horrible. For someone who hasn't read the books it would seem confusing and shallow because there doesn't seem to be much of a story, unless a reader fills you in on all the gaps in the plot (of the book) that the film misses out."
    },
    {
      "rating": "5",
      "text": "I thought that the movie was enjoyable, definitely. However, I thought that Dumbledore was far too harsh - um, why would he push Harry? - and I preferred the original Dumbledore. I thought that Rupert Grint was excellent (easily the best of the trio), followed by Daniel Radcliffe. Emma Watson has issues with her acting. Seriously. Why would you continuously wiggle your eyebrows when trying to show an emotion? Why? WHY? Its useless - i'm so glad other people agree with me. I would have given up on her a long time ago too if i were her acting coach. Dear Lord. Also, the dress. You know the one - purple, floaty, various tiers...absolutely VILE. I don't think they could have possibly made a more disgusting dress. In the book it is periwinkle blue at least, not pink/purple (which, in itself, I don't have a problem with. Just as a dress...) And why the tiers? Couldn't they have made something elegant and chic? Why does she have to look like a meringue that was tie-dyed??? Otherwise, I thought it was excellent; very amusing. Daniel Radcliffe has certainly grown up, hasn't he? Very nice. Robert Pattinson, Clemence Poesy and (can't remember actor's name) Krum gave excellent performances, as did Miranda Richardson (fabulous fabulous fabulous). I though Katie Leung was pretty good too, though I wasn't at all expecting a Scottish accent (which, eventually, I got used to). Mad-Eye Moody was very funny, but lacked the mad bit, especially for those who wouldn't have read the book (not me - I am an avid Harry Potter fan, but I know they are out there). Ralph Fiennes was excellent also; rather creepy as opposed to downright terrifying, as he is in the books. Then again, I suppose thats the only way to portray a wizard like Voldemort, as the sheer dangerous elegance is impossible to act. Snape as always gave the best performance (he is my favourite character); Alan Rickman can really pull off the cruel, mean, but somewhat good character (is anyone else having issues about believing Snape's Death Eater-ship? I can't figure him out. Shame we don't know anything about his patronus or boggart). All in all, the most enjoyable Harry Potter film, but the fifth looks excellent."
    },
    {
      "rating": "3",
      "text": "The effects were really great. Outstanding but the structure of the story was somewhat lacking in substance. It all seemed rushed. This movie was based on a fantasy book but somehow it turned out into a drama story. I did not feel the magic at all. Furthermore, changing the personalities of characters is not a good way to make a movie. Too harry centered movie leaving out the supporting cast to be undeveloped."
    },
    {
      "rating": "0",
      "text": "Hail to the thief There is not a skant of originality to be found in this waifer thin super british film(why in films are the british so toffy nosed, and exageratedly propper? we are not really like this). The last Harry Snotter film was much better."
    },
    {
      "rating": "3",
      "text": "Come on! This movie left so much of the book out that it was just unbearable to watch. I have gotten 10 times more out of the books and audio tapes that watching these absolutely terrible screen adaptations. This movie in particular did the book no justice what-so-ever. The first movie was very very close where much of the dialogue was taken directly from the text or used in a way where you knew they were trying to consolidate the book, but not leave anything out. But this movie just cut HUGE parts of the book out and massacred the theme. This was nothing more than an action movie and was not even close to the book. Terrible. I gave it a 3 because the special effects were good. The next book is going to be much harder to make into a movie because there is almost no action until the end. This could be bad."
    },
    {
      "rating": "5",
      "text": "I could go on for hours about my problems with Goblet Of Fire, and 99% of them have nothing to do with being faithful to the book in the slightest. Complete void of the magic and fun of the first three movies, and makes a poor attempt at going adult. If you want to see the first truly magical and more adult Potter movie, go and see 'Order Of The Phoenix'."
    },
    {
      "rating": "8",
      "text": "As Harry Potter and his friends begin their fourth year at hogswarts as well as meeting new friends from their respective schools, a Tri-Wizard tournament has just been taken place and only three students have been chosen. Now the fourth student to overcome that event, little does Harry Potter know that the servants of the Dark Lord are planning to reborn their master as he encounters all three of these tasks. I was amazed and speechless (not to mention frightened) when I saw this dark and epic entry of the series and I was excited to see it taking the franchise into new heights. The actors did a lot of talent and charm of the now changed personalites of the characters, The action and CGI were pretty unique and very intense, The storyline from the fourth book stayed faithful and Ralph Fiennes deserved some credit (as well as the others) for his amazing performance as Lord Voldemort. Harry Potter and the Goblet of Fire is the most darkest entry of the series that took the franchise into new heights in fantasy history and one of the best movies from the past five years. 8/10"
    },
    {
      "rating": "8",
      "text": "It has a more childish tone when compared to the dark tone of \"The Prisoner of Azkaban\" but Mike Newell gave a solid adaptation of a very extensive and detailed book. I think this is the last time in the series when a non-reader can really understand the story."
    },
    {
      "rating": "6",
      "text": "This Harry Potter is pretty good especially the ending, which might have the best scene in Harry Potter to date. But i had one major problem with this film which was the dancing and the modern day kind of music mixed with the dancing . What was up with that?"
    },
    {
      "rating": "8",
      "text": "Solía ser mi favorita en su momento, actualmente la veo y la encuentro demasiado \"teen\" para una película de Harry Potter pero pese a ello no le quito mérito alguno, es buena."
    },
    {
      "rating": "4",
      "text": "I was really looking forward to this movie as I was home for Thanksgiving break from college. When I did see it, I thought it was great due to the action and the special effects. But then, about a week later, I thought to myself that it was exactly the same way I had thought about Revenge of the Sith. The bottom line is that there are many flaws in the movie. Supporters of HP movies say that naturally, the movie will add things in and leave some things out, as it never will follow the book perfectly. That is exactly true! Except in TGOF's case, the things that were left out (little as they seemed) had a tremendous negative impact on the portrayal of the story. There seemed to be almost no continuity to the film. [***SPOILERS***] Rather than have a central theme like #1 and #2 have, and that #3 sort of has, this movie didn't have any! Rather, it seemed like a showcase of Harry Potter scenes rather than a movie that is supposed to tell a story. The obvious problem with the movie was the rushed sequences. It seemed as if we saw the first 200 pages of the book displayed in less than 15 minutes! Some of this is okay, but it is sad for other parts because we miss some very important things and we don't understand some of it at all. The most obvious example was when they showed the Quiditch World Cup, but no game. I was like, \"Are these story writers serious?\" Then, they rush straight to the dark mark scene with the death eaters parading through the camp grounds. The scene just appears out of no where, and for the person who hasn't read the book, they wouldn't have a clue what goes on!!! All things seem to focus around the triwizard tournament, which is an okay thing to focus the majority of the movie on, but it dominated the movie and forced special effects to be the only redeeming quality of the movie. Not to mention that the dragon scene took about 5 to 10 minutes too long and that time could have easily been used to fill in the missing gaps in the story. One thing that made me mad was the portrayal of Mad-Eye Moody. The acting was great, but it made the audience, even the people who hadn't read to book, to suspect him of mischief the entire time. No where in the book does it make him seem like a paranoid freak of nature who drinks from his hip flask every minute of the day. Just as an example of a missing thing, why the heck would Neville be so terrified of Moody's Cruciatus curse and nobody else? The writers don't let us know anything about Neville's parents being subjected to this when he was a child. Another example is the random part when Snape get pissed at Harry for thinking he's been stealing his polyjuice potion. That scene was so out of context and just confused us more! One thing that was just WRONG was including Barty Crouch Jr. at the Riddle home scene with Voldemort and Wormtail. We were never supposed to even see Barty Crouch Jr. until Harry Potter sees him in Dumbledore's pensieve. That got me skeptical from the very beginning. All I've done is talk about what should have been done, but offer no solutions as to how the movie could have been like TSS, TCS, & TPOA. Well, I could name a hundred little scenes that could have been switched around, added in, or done better. The most important thing that was left out was the second plot of the story other than the triwizard tournament--Voldemort's phantom but understood presence throughout the entire story. The only time we see or think about him is at the very beginning and in the graveyard. I had to explain a dozen things to my little brother who hadn't read the book because of this. For example, what happened to Bertha Jorkins? What happened to the plot that was talked about in the Riddle House? What is the significance of the Dark Mark? What is Ludo Bagman's (who is never even mentioned) role in the book? What is the reasoning behind Barty Crouch, Jr.'s trial? Why is Barty Crouch, Sr. never mentioned to be murdered by his son? Why didn't the writers put in the confession by of Barty Crouch, Jr. into the story at the end? This last question was the most important because it would have explained everything that the book told us about Voldemort. The movie makes it seem as if everyone accepts the fact that Voldemort is back, when Fudge (who is never even seen) should be denying it. In fact, this and the story of Barty Crouch, Jr. set up the most important part of The Order of the Phoenix because it makes everyone doubt Harry, and in the case of the ministry, cause people to make sure they believe otherwise. Another interesting the book has that the movie didn't touch on, which would have made the teen hormonal urges get more intense, was the rivalry that Harry and Cedric had. This would have made Harry much angrier when learning that Cho is going with Cedric to the Yule Ball. Overall, the movie seemed to do a showcase of the events in the book, rather than trying to be the book itself, hence the title The Goblet of Fire. In addition to the plot being confusing and entirely unfinished, the acting of Michael Gambon playing Dumbledore was atrocious to say the best. Richard Harris definitely was the best actor on the face of the earth for Dumbledore, but since he passed away, the writers should have found a worthy actor to follow in Harris's footsteps. Gambon was the second biggest turnoff in the movie for me. He did not match Dumbledore's character at all. Instead of being a loving, confident sage, he was an angry, uncaring, and confused man. His should-be consoling scene with Harry at the end is completely unnecessary, and does nothing to strengthen their relationship is the book does. Also, he frequent yelling completely takes away from the Richard Harris-esq Dumbledore we all love. With all of that said, I still give the movie a 4 rather than a 2 or 3 because most of actors did a good job. Ralph Fiennes (although he could have had red eyes and had a slightly more intimidating presence) was a great Voldemort. While Mad-eye did not act that way in the book, the acting was great. The 3 main characters, particularly Emma Watson as Hermione, are really beginning to progress. Hagrid was always great as usual! All in all, if this is how the 4th book was portrayed, and because of the way the writers didn't include the information that was crucially needed to lead in The Order of the Phoenix, I'm afraid for when the next three movies come out, if they want to keep making them."
    },
    {
      "rating": "10",
      "text": "KP You need to get a life! are you normal, you should write a book. Harry Potter was great, yeh they left a lot out but how many children can keep up with jk rowlings twists and turns. Stop analyzing in depth and start enjoying whats on screen, trust me it help!"
    },
    {
      "rating": "7",
      "text": "Another long wait for a new Harry Potter movie and another long wait in line to see it. The first three films were overall faithful to the books, and had some of the best directing, casting, and art direction of the decade. The first had a wonderful joyous quality (my personal fav.), the 2nd had a great feeling of mystery, and 3rd (aesthetically the best) was awe-inspiringly beautiful and gloomy. They stood just as great as the books (although in my opinion nothing beats your imagination, so the books will always win by default). Now, with Goblet of Fire I found myself constanlty asking why. Why did they take that part out? Why did they add in the extra action? Why didn't they emphasize on that scene? I think the movie was victim to a poor script and a bland director, but still survives on the great visual set up that past directors have built and the wonderful cast. I know that with a book so big, cutting out scenes and characters was a necessary evil. But why did they make Dumbledore seem viscious at times? Why did they leave out some very lovable and interesting characters? Why didn't they take some time to make sense of what was going on and why? It came clear to me half way through the movie that for once the book and movie are very different. The movie on it's own feet is perhaps the most fun of all the movies and will hopefully be a bridge to 3 much more susperior films. If you read the book the whole thing feels like a slide show (trust me, your friends will be constanlty asking \"why did that happen....what was that part about?), but it's still a good time and fun to see things come to life on the big screen. Anyway, it has Jarvis Cocker and Johnny Greenwood, plus Emma Watson is a hottie. Worth your money and time."
    },
    {
      "rating": "10",
      "text": "This movie has it all, adventure, action, a little romance, comedy, just a complete movie. The 2.5 hours seem like 1.5 hours. All ages will enjoy this movie, there are many climax to the movie."
    },
    {
      "rating": "8",
      "text": "It was good movie but they left out some important parts and changed others. by the way did anyone else realize that the death eaters looked a lot like the kkk?"
    },
    {
      "rating": "4",
      "text": "I found the other Potter movies entertaining, but I thought this one was the least entertaining by far. I just didn't care about the plot. I felt throughout the movie that it wasn't getting anywhere, and lacked inspiration. Who cares who wins the contest? Not me."
    },
    {
      "rating": "6",
      "text": "HP4 suffers from heavy rhythm problems. You can tell from the directing that scenarists have struggled for months to fit the whole book into a 3-hour footage, yet at the end of the day so much is eluded and things stay at such a superficial level (dialogues never longer than 2 lines) that no pace can possibly install. Ironically for \"too short a movie\", you end up looking at your watch. Technically, it is good though (but who would rate a movie on its technical achievement? so easy nowadays), despite the age problem for the main actors, which can easily be abstracted. In a nutshell, not essential, less interesting than the previous one."
    },
    {
      "rating": "8",
      "text": "The best Harry Potter movie to date."
    },
    {
      "rating": "2",
      "text": "When I saw it for the first tme, I saw it with a friend who had never read any of the books. I spent half the time filling in the gaps in the plot that were left out. The other half I spent marveling at the large amount of cuts from the book. I gave it a 2 becasue if you have read the books like I have, there is no choice but to see them or there is a void left somewhere. All in all, a bad movie."
    },
    {
      "rating": "2",
      "text": "There were many things on the surface that would make the average movie goer rave about it. But being a Harry Potter reader, I just have to say that this movie disappointed me very much. It skipped many important details, as well as leaving out an entire \"theme\" of the story. The whole aura surrounding Voldemort is very confusing, and I want to laugh and cry from embarrassment for the directors when the Barty Crouch scene ended so quickly when leaving out pretty much everything that explained why the events happened as well as foreshadowing for the next book. I seemed to be reading sparknotes of Harry Potter as the scenes in the movie had almost no connecting transitions. Get a new director!"
    },
    {
      "rating": "6",
      "text": "Chris Columbus staged his \"Potter\" as a kind of droll pageant, like a \"Harry Potter's Greatest Hits\" that inexplicably insisted on remixing every song, draining away their grungy vitality and blissful wit by burying them under a pyre of studio redubs, children's choirs, and \"Home Alone\"-level John Williams. Alfonso Cuaron reconceived of the series as a canny mix of the eccentric, the frightening, and the beautiful. His film is the one J.K Rowling had embedded in her story all along. Mike Newell, with \"Goblet of Fire,\" comes to the preceding with a patience long-eroded by television, or \"Mona Lisa Smile,\" or the sugar he might have compulsively consumed to \"brainmeld\" with the world's kids. His movie simultaneously feels repellently unmagical and drunk on the idea of magic. [***SPOILERS***] When Harry says, \"I love magic,\" he's stepping far outside the confines of Rowlings verisimilitudinous world to be cute. And that's precisely where this film fails. Rowling crafts a world where magic is the order of the day, every day.At times, it's so familiar as to seem frustrating, or absurd. This movie loves magic and has the special effects to prove it in court, if need be. But where's the life behind it all? Not in Hogwarts' paintings, or in its musty halls: Newell has done the greatest disservice of all by imagining Hogwarts as a boarding school- Rowling's starting point- and then stopping. Instances of the novel or beautiful occur at precisely spaced intervals- namely, when the kids' patience might start to wear thin. Speaking of patience, Newell has none to speak of. He has conceived of \"Goblet of Fire\" as a three-act drama. Everything prior to and including the first challenge is Act One; suddenly, as if someone forgot to mention it, the Yule Ball and, shockingly immediately thereafter, the second challenge are upon us in Act Two; Act three has no structure to speak of but contains the good, Hammer-horror stuff from the book, slapped onto an unbelievably brief third trial. Are we to believe that after the dragon, that's all the tournament would have for Harry? Doesn't old Voldy (Ralph Fiennes, for Chrissake) need to slow down a little so that all those long awaited curses can be uttered? Doesn't Harry's adrenaline flow compensate for his youth by allowing him to experience the most climactic moment of his life thus far without feeling that it's all far too ephemeral? The whole affair seems ingloriously rushed, and Newell has so pounded our brains with vain special effects that when the really beautiful image of the wand-beams meeting comes about it feels like so much more of the same. Yes, Potter stories require the sum of effects present here. But no other Potter film has so shamelessly rubbed them in our faces. It felt like \"Revenge of the Sith\" all over again. Newell, to be fair, does much better with the humans in the film; this Potter, even more than Cuaron's, seems populated by breathing individuals. Apparently, directing Hugh Grant and Julia Roberts puts one at ease with the lesser celebrities of Potter's world, because Mike here has done an excellent job capturing the mannerisms, rough speech, and conflicted emotions of adolescence; he seems more at ease when relaxing with his cast than when sitting beside the editor or parsing through thousands of effects shots. The episodic nature must be due in part to Kloves, but I liked his work on the last one (and \"Wonder Boys\") so much I'm hesitant to blame him. To close, Rowling's \"Goblet\" was the least magical of the series so far; Newell's is on par with Columbus's for that title among the films. It doesn't fix any of the book's problems, but creates new ones; thankfully, it's all very well acted (kudos to Michael Gambon & Brendan Gleason). The film simultaneously is tiring and needs to be longer (to compensate for the rushed feel), and needs desperately for Rowling's whimsy to save it from its dour self."
    },
    {
      "rating": "0",
      "text": "This movie was like no other Harry potter! It sucked! It was crap! I hated it and I give it a 0"
    },
    {
      "rating": "5",
      "text": "[***SPOILERS***] 10 for special effects, zero for plot, which works out (rather charitably, I think) to a 5. Visually, this is a spectacular film. But visuals should always be in the service of a film's story line; not the other way around, and this film's plot was a shambles. The film had scenes and events that contributed absolutely nothing to the story., entire plot lines developed halfway and then rudely abandoned. Example: Harry's budding romance with some undistinguished girl that never either blossomed or died, but just sort of withered away of neglect, I guess, somewhere offscreen. Example: The death of ------, which was unnecessary and had absolutely zero significance for the story line. The worst violation of form comes in what was evidently intended to be the film's climactic moment: Harry's great encounter with the arch-villain Waldemort. This is a joke, with Harry and W. spraying streams of sparks at each other from their wands in some kind of an adolescent Wiz contest, then abruptly stopping so that Harry can exit stage left. Nothing ever comes of this scene; dramatically and plot-wise it is a big unresolved hole that the characters blithely ignore right up to the end of the film like the proverbial elephant in the room. Someone has *got* to be paying at least *some* of these reviewers for the inflated ratings that I see posted on this site. And the rest of you are, I don't know, some kind of J.K. Rowling sycophants. But, hey, the kids in the audience where I saw it absolutely loved it, so maybe I'm the one whose clock needs adjusting.. All I can say is, if you are willing to completely suspend all critical thinking and just immerse yourself in right-brain activity, you should definitely see this film; otherwise, stay far away."
    },
    {
      "rating": "10",
      "text": "Four down. Three more to go. Best one ever made..according to my list it goes: 1)Goblet of Fire 2)Prisoner of Azkaban 3)Philosopher's Stone 4)Chamber of Secrets"
    },
    {
      "rating": "9",
      "text": "It's a great way to escape for a couple of hours. Visually stimulating and fantastic with a few real-life aspects to keep it real."
    },
    {
      "rating": "10",
      "text": "Especially moving performance by the father of the boy who dies."
    },
    {
      "rating": "3",
      "text": "I went to this movie, expecting some sort of story line, but what I got was a jumbled collection of scenes with few connecting threads to a story (or logic). Sure, it looks pretty in parts, but those scenes are derivative of some prior movie. I suppose this excusable for a children's movie, but far too many adult film critics are raving about this one. What gives-- were they all paid off? Wait for this one on DVD."
    },
    {
      "rating": "4",
      "text": "This movie wasn't bad. Though I had expected more of a story here but they just jumped right into action and never let up on it. I felt for the first hour they were just setting so much up and than rushed to the end. I haven't read this book myself and still felt there was an underlining story missing. This could have had an extra hour easily to tell that story and I don't think any one would have noticed the extra length."
    },
    {
      "rating": "8",
      "text": "A charmingly darkened coming-of-age as seen through a fantasy world lens. Haltingly adapted from Rowling's slightly-less-than-most-popular of the series, Goblet of Fire delivers a valiant effort at ramping up all the crucial variables in the Potter anthology: Maturity, Romance, Humor, Adolescence, Magical Eyecandy and the impending sense of a looming conflict. Things that could've been more polished: Voldemort's nose. Where'd it go? Why? This provoked a few unsolicited laughs in the theater I saw it in. And as with the second and third films, Rickman's glorious Snape is woefully underused... While such huge chunks of the book having to be excised (understandably) that there's an almost stuttering feel to the flow of things. Well, it was either that, or have Goblet of Fire I and II... With the actors being in their 30's by the time the movies were done. Nevertheless, from Moaning Myrtle's bathtime advances on a suddenly-babe-magnet Harry to Ron's botched interactions with Hermione, we're seeing this group grow up - shifting away from children's fare. Like anyone's first teen years, these are treacherous waters for the Potter films and for such a transitional piece, Goblet does pretty well."
    },
    {
      "rating": "3",
      "text": "Terrible dialouge, abandoned most of the storyline in the book, (over half of it was cut out) and had more holes in the plot then swiss cheese. HUGE disappointment."
    },
    {
      "rating": "10",
      "text": "This is the cooles movie."
    },
    {
      "rating": "10",
      "text": "Now this is why we go to the movies! A thriller, adventure, and comedy wrapped into a skillful package. Surprisingly plays well with all ages. Flawless effects and well-rounded performances make this one the surprise must-see of the year."
    },
    {
      "rating": "9",
      "text": "Newel left out some scenes and Fred and George didnt tease Ron nearly as much as they did in the book.But over all it was Fairly good."
    },
    {
      "rating": "10",
      "text": "Spectacularly well adapted from the book ! The best one yet, far ahead ! I totally loved it ! The three main character's acting is excellent and the spirit of the book is well transcripted into the movie ! It's a must-see ! I hope you enjoyed it as I did !"
    },
    {
      "rating": "10",
      "text": "Loved it."
    }
  ]
}