{"id": 3802, "title": "Haunt", "starring": ["Katie Stevens", "Will Brittain"], "runtime": 92, "genre": ["Horror", "Thriller"], "description": "On Halloween, a group of friends encounter an \"extreme\" haunted house that promises to feed on their darkest fears. The night turns deadly as they come to the horrifying realization that some nightmares are real.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/haQSrjFlq30I60UVN1VsB6uRwKM.jpg", "categories": {"plot": 5.857142857142857, "acting": 5.333333333333333, "ending": 3.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "3", "text": "\"Haunt\" has its own style which makes it unique, despite, it is cliched, short on story, and overall short on scares, and when they often happen, they are not enough. The story is scattered everywhere, with unnecessary characters just to move on with the story. The twist at the end does not explain its self at all, it is just like the creators of \"Haunt\" wanted to make a unique ghost story by just adding a curvy ending to the film. The acting is forced, and isn't appealing, the ending shutters the mind of the viewer and is incomplete and not enough to conclude. \"Haunt\" really doesn't have anything to it, you can just pop your popcorn call your friends, on a friday night with the lights out. You will forget about it once you finish it, if you do finish it."}, {"rating": "1", "text": "My friend and I watched this film and we both thought it was bad. We were both just watching it like if it was some sort of documentary. Haunt had one time were i screamed and that was that."}, {"rating": "6", "text": "Haunt is a very simple ghost story with a bit of romance involved, and it's a very bleak story at that. It's more of a traditional horror movie in spirit of The Innocents or The Haunting in that it's not really a visceral roller-coaster of a movie. This is a slow-burner, taking its time until the shocking and dark ending. There are a couple of cheap jump scares to keep the modern audiences interested, but this film is all about the bleak atmosphere. The whole film has a tone of dread that is left lingering long after the movie is over. Harrison Gilbertson and Liana Liberato are fantastic in their rolls as two teenagers exploring love for the first time while being pursued by some pissed off ghosts, and I'd love to see them in more movies. While nothing in this movie is particularly new, Haunt is still a fun and slow haunted house movie while never being boring or pretentious"}, {"rating": "10", "text": "Beautifully Shot, but could have been scarier...I actually liked this story a lot. Loved the characters, the situation, the plot and definitely the cinematography. The two lead kids were very convincing and very likable. You rooted for them the whole time. My only complaint is that there could have been a lot more jump out of your seat scary tactics they should have used to add more horror. The setting was perfect as a cold old house somewhere in Canada most likely. Very isolated and creepy while also being very picturesque and beautiful. Everything that was done in the movie was done well, lots of good production value. Direction and acting was very convincing by all the characters. The scary old box they find looks really vintage and perfect for what it is supposed to be. I just wish the movie was scarier."}], "recommendations": ["the_woman_in_black", "scary_stories_to_tell_in_the_dark", "the_conjuring", "lights_out", "the_witch", "oculus", "annabelle_creation", "the_ritual", "the_lodge", "the_others", "it_follows", "winchester", "the_haunting", "the_mothman_prophecies", "the_boy", "the_woman_in_black_2_angel_of_death", "the_night_house", "the_ring", "insidious_chapter_3", "antlers", "the_descent", "the_haunting_in_connecticut", "a_cure_for_wellness", "the_unholy", "the_uninvited"]}