{"id": 2347, "title": "Haywire", "starring": ["Gina Carano", "Michael Fassbender"], "runtime": 93, "genre": ["Action", "Drama", "Thriller"], "description": "A black ops soldier seeks payback after she is betrayed and left for dead.", "releaseYear": "2011", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/iI3KOQOyTMJgxccs50zjxn3R7DF.jpg", "categories": {"plot": 5.723404255319149, "acting": 4.913043478260869, "ending": 5.333333333333333, "soundtrack": 6.2, "cinematography": 6.0, "familyFriendly": 4.777777777777778, "funny": 5.0, "action": 5.9875}, "reviews": [{"rating": "7", "text": "Pleasant movie. The fights were incredible yet totally grounded in reality. The story is somewhat predictable but decent and serviceable. The soundtrack is excellent and really carries the film forward."}, {"rating": "7", "text": "It's really true a director can make so much different in a movie. Steven Soderbergh lift Haywire from the near grip of B-movie to a decent spy flick. One of the appeals in this movie is Gina Carano, an MMA fighter who admittedly doesn't have much acting prowess but possesses the strength and speed, better than most stunt women. Haywire tells a story of a secret operative betrayed by her contacts which precede her going hulk on them. Think of it as Bourne movie starring female version of Van Damme in Ocean's Eleven style.It's painfully obvious that Gina, while being the main protagonist, looks uncomfortable and forced. When she tried to be dramatic or serious, it got unintentionally corny. I think she needs more experience before sharing screen with the big names, but Soderbergh cleverly disguised it with great screenplay and cinematography. He balanced the scenes so veteran actors can take the lead or played the cameras to mask her weakness. It has proven effective as with plethora of talented actor (Ewan McGregor, Michael Fassbender, Antonio Banderas and Michael Douglas) its narrative went more towards stylish rather than cheesy.The angle of cameras and jazzy jingle before next set piece reminded me heavily on Ocean's Eleven. He crafted it in clean and sleek fashion, without resorting of CG abuse or over-the-top action. Sequences play out in vivid motions, often with subtle yet captivating details. For example, in certain chase scene, the camera follows Gina as she ran across rooftops and streets with the enemies just behind her, continuously switching between them without losing focus. Background also serves as important parts, Soderbergh incorporated them in smooth style as it blended with the narrative and also engaged the audience.With MMA fighter as the main character, it gives a lot of edge in combat scene. Most of the fights occur in fast pace and seems tremendously hurtful. Usually Hollywood movies flicker in and out of combat, creating illusion of intense combat or just blatantly abuse CG. This is not so in Haywire, Gina can handle herself very well, her stunts are powerful and unforgiving. You can clearly see the impact of the punches, knees and kicks, she really goes all out in the hurt department. In the first five minutes, Channing Tatum slapped her with coffee mug, tossed her to the ground and began ground-and-pound. It's the purest stunt this side of Chocolate.While I like Soderbergh's style, I must admit that it relies on the audience piecing the story themselves. He switched from flashback to present, from one character to another, from once city to another as fast as Gina throws her punch, it can be quite convulted at some point. Cinematography is smart and polished, however sometimes it gets awkward when Gina isn't kicking some ass. She does look good though, her great physique is another point Soderbergh portrayed well. Ultimately it's a show case of great fights by a muscular woman with sophisticated B-movie cliche. 7.5/10"}, {"rating": "2", "text": "If you're a fan of boring conversation and terrible 70's detective movie music, look no further than Haywire.  This movie is mostly awkward conversation and terrible acting, with absolutely atrocious music playing throughout the whole thing.  The only time there is no music is during the 2 or 3 action scenes that break up the monotony of listening to bad dialogue.  How the director convinced so many A list actors to sign onto this disaster is amazing.  Did they look at the script?  Was there a script?  The positives to take away from this fim were the action scenes.  About as realistic as they get in a movie.  Gina Corano and her gigantic breasts also deserve some props.  She didn't look out of place and I would like to see what she can bring in future roles.  Since I only have about 4000 words of space left in this review, I won't bother listing the negatives to take away from this movie."}, {"rating": "1", "text": "I was looking forward to this movie, being a big Steven Soderbergh fan (though admitting he's not always on top of his game).  But this was close to the bottom of the SS barrel.  It's all over the place and almost completely incoherent.  And the fight scenes are only so-so.  A real turkey."}, {"rating": "8", "text": "This came as a bit of a surprise to me as you almost never find a movie as good as this in January. I realize that critics clearly enjoyed this more then people which should say something. That this movie was marketed as something completely different then it truly was. I realize this is the case with all of the director's work. The same thing happened with Contagion and Magic Mike which I both liked very much. So if you ever plan on seeing this movie, don't believe what the trailer tells you. This is a very odd film. Yes it's an action film but it's different than what you're use to, which is why so many people disliked it. I can't explain it but it's just different and I'll admit, it did bother me too. The music does not fit the movie at all. I'm not sure what the director was trying to do here but 90% of the music was this weird 70's jazz music that you would find in a spy movie from that period. Whatever the case, it was annoying and sometimes took me out of the movie. These were really the only things that bothered me. I mean the director choose to shoot the movie in a variety of ways, some shots work, others don't, but it didn't bother me much. It might be off-putting to some of you though and that's one example in which I said earlier that this movie is different. It's not shot in a way your typical action movie is. So despite those problems I enjoyed everything else. The action is fantastic, it's very well choreographed. There's no music accompanying the action scenes which make them seem more realistic and thus, another example of how this is different from your typical action film. The story is nothing new, this is after all a revenge flick, but the director adds enough of his visual flair and fresh ideas to make this movie stand above your typical revenge flick. The cast is solid and for a first time performance Gina Carano was not bad. Was it a terrific performance? No, but she has potential. She would make a good Wonder Woman but that's just me. I hope she gets more roles because watching her kick ass was definitely worth the price of admission. The other person worth noting is Channing Tatum. This has been a good year for him in both in terms of box office and career. Now, I haven't seen The Vow and I don't have any intentions of seeing it anytime soon, but he has definitely reversed my opinion of him. With this, 21 Jump Street, and Magic Mike, I can't believe I'm saying this but, he can act. I hope now he decides to pick smart scripts and make smart choices because he has finally proven(it's been like what 6 years?) that he's got the chops. Overall, a nice surprise since normally January is considered a dumping ground as a majority of the films are Hollywood rejects. This is another great movie from a great director who has been having a good year himself with this, Magic Mike, and last year's Contagion, he's slowly becoming one of my favorite directors. Sure this movie is very different, the music doesn't fit it at all, there's no music during the fight scenes, and some of the shots work better than others. However, the action is nice choreographed a nice-shot, no shaky-cam, the cast gives solid performances and how could you not find Gina Carano kicking ass not exciting or hot?"}, {"rating": "1", "text": "Gina Carano needs to stick to real fighting. Her acting was terrible and ruined an otherwise mediocre movie. Even the fake fighting in this movie was subpar. The whole movie was slow, cold and dead. Not only was I not sure what was happening for most of the movie, I did not care. I didn't care about any of the characters or the \"why\" of the attempt at a suspenseful story. Terrible movie all around, one of the year's worst."}, {"rating": "8", "text": "Hell has no fury like a woman scorned! Haywire is sweet eye-candy for MMA fighting fans. This female may be the next Bruce Lee for lady fans. She's in control and commands the screen when she battle's. If Gina Corano can turn men on with her sexy brawling style, then she may be around as long as Mila Jovovich and replace her. Women will love her defeating a man's world. Soderbergh direction copy Ocean 12 and Bourne"}, {"rating": "3", "text": "I was very interested to see this movie. A film with a real heroine, a\rwoman that can take care of herself, beat up the bad guys/gals and not\rjust exist as a model actress (though Gina is very beautiful) while all\rthe stunt women do the real work.\r However, what I got with this movie was horrible acting with wooden\rperformances, cheesy lounge music over everything, and exceptionally\rdull dialog. The main draw of a women mma fighter, \"the third best 145\rlb (66 kg) fighter in the world\", was that we'd get a real actress that\rhandles all the dialog, the acting and some great fighting, as she\ractually knows how to fight properly (muay thai no less). However the\rfight scenes were over-directed, over-edited, and too short. Very few\rmoments even felt like they were Gina, as the heavy editing could've\rallowed for a stunt double anyway. Gina seems to lack the charisma to\rhold a lead role as pretty much any of the supporting super-cast gave\rmore energy and life to the film than she was able to.\r To see how a movie can look with a real fighter/actor look no further\rthan JCVD. The film with John Claude Van Damme playing a version of\rhimself with realistic action scenes and tense drama. The opening 5\rminutes of that film alone better demonstrates what can be done with an actor\rthan knows how to fight than any moment in this film can possibly wish\rto achieve."}, {"rating": "1", "text": "After about 15 minutes, I turned to the friend who I was with and said \"what is this movie about?\"  There was tons of action and a great cast, but the story wasn't there.  The whole movie seemed more like a vehicle to showcase Gina Carano's fighting skills, but frankly, I would have rather watched 15 minutes of MMA than 1.5 hours of this awful movie.  Skip it, or maybe watch it on TV during a snowstorm after you've watched everything on your DVR."}, {"rating": "10", "text": "Gina Carino really holds her own as the only female character, delivering a solid performancehttp://pricerunner.co.uk/switched-on-tech/article/female-species-more-deadly-male"}, {"rating": "2", "text": "Based on the professional reviews I was horrified to think I spent $ renting this film. NO acting, even from the big name actors. Seemed like everyone was reading their lines...for the first time!  The story was hard to follow, maybe because their wasn't much of one? Full on blows to the face without a drop of blood made the fighting seem fake, despite the grunting.  Maybe fans of martial arts will enjoy it but it seemed monotonous after a while.  And what is with that murky yellow cast to everything in the beginning? Didn't help.   I am a fan of the MI-5 series on Netfilx and thought this would be like it.  I was sooo wrong."}, {"rating": "1", "text": "Lame attempt to be a Bourne movie, nothing more. Poor acting and most of the fight scenes are rubbish. In their rush to try and promote equal opportunities film makers often forget a simple fact, women can't trade blow for blow with a man. That isn't to say women can't be as good at fighting as men, of course they can. What it does mean is that simple facts about the physical differences can't be overlooked. Men are naturally stronger and have slightly thicker larger bones, and are able to take a bit more of a beating than a woman, that's not sexist, it's simple human physiology.\r For a woman to beat a man she can't stand there trading blows and expect to come out on top, it's just not going to end well for her. So when you have scenes in the movie where she's taking hit after hit, and not being phased by it, what little realism was in the fight scenes quickly goes out the window. Which just leaves you with a poorly acted, dull story with absurd action scenes -___-"}, {"rating": "8", "text": "This is a thoroughly decent movie. Yes Ms. Carano is a little wooden in rare moments, but there is a good supporting cast. The music gives it a retro/throwback vibe, cinematography in some shots is beautiful and the action has a real earthy feel to it. The fact that the lead is a kick ass woman also does not hurt."}, {"rating": "0", "text": "Nunca vir um filme tão podre como esse. Gina Carano está excelente é uma bela atriz nos dois sentidos kkkkkk,mas o filme é fraco,sem sentido,sem vida,sem coerência e sem empolgação. Michael Fassbender,Ewan Mcgregor E Michael Douglas também fazem um excelente trabalho mas o filme não funcionar"}, {"rating": "1", "text": "Is Gina Carano a MMA fighter? Yes, and that is evident in this film. Is she an actress? No, something also evident (painfully  so) in this film. But she could have been forgiven if it where not for the fact that this whole film is dreadful. The main storyline appears to be have been built around the fact that Carano can beat the crap outta people  lets have her do a lot of that!  and a lot of running. Lets have lots of running sequences. Everything else is of secondary value. There is a very thin plot, which basically makes no sense. Don't waste your time on this..."}, {"rating": "8", "text": "Soderbergh films always look great. The action sequences are so clean, it puts to shame many action movies of today. Carano isn't going to win an oscar for her performance but she kicks a lot of ass and did her own stunts, and that is what was required of her. Fassbender is great as always in a limited role."}, {"rating": "7", "text": "I enjoyed the film for what it is - a vehicle to show off Carano's ass-kicking abilities - just like many movies (see: Jeff Speakman is \"The Perfect Weapon\") have done before.  I take issue with Lisa Schwarzbaum's \"calling foul\" upon seeing Channing Tatum beat up on Carano at the outset of the film.  So it's OK for movies to show women beaten, belittled, raped, and tortured - so long as they don't fight back??  How is this movie \"depressing\" for a pro-woman audience?  I loved seeing Mallory Kane beat the living hell out of the guys with a force and kinetic energy that you rarely see presented on screen - even from men.  It's the difference between how an object reacts when it by a 38 caliber round and a 44 cal round.  The 44 doesn't just penetrate - it knocks you down.  So does a full-bodied Carano kick.  Is the acting uniformly top shelf? Is there character development   Hell no.  Did I have fun with this movie?  Of course."}, {"rating": "9", "text": "The four of us who went together to see Haywire thoroughly enjoyed it. It's an action movie with a common, simplistic plot, but it stands out from the usual fare with its different approach to filming and sound. Gina Carano is terrific. The fact that she did her own stunts lent realism to the film, unlike so many action films that are so outlandishly over the top. Admittedly, it was confusing at first, but it came together as the movie progressed. A very entertaining action film which seemed a bit more grounded in reality than most."}, {"rating": "8", "text": "Very boring movie but it is still a little bit interested. I love seeing Gina kick some ass in this movie. This movie was very disappointed. A very slow pace action movie. I did fall asleep on it. The fighting scenes with Gina did wake me up. The plot in the story was decent and good directing. I wouldnt suggest this movie to any one."}, {"rating": "3", "text": "Gina Carano's acting lowers the quality of the movie and other actors.  That grey sephia film they used throughout the movie made her acting worse.  The director used constant theme music In the background to make walking scenes seem more exciting.  Except for the first fight scene the movie's other action scenes were not up to par with today's movies. Check your brain at the door or save your movie. But I have to mention this old lady in the seat in front me was at the edge of her seat throughout the movie."}, {"rating": "8", "text": "I LOVE a good ass-kicking movie.  It can even be a fairly bad movie from the story perspective, as long as the action is tight! Itâ"}, {"rating": "2", "text": "Underwhelming to say the least. Seems like Soderbergh didn't even bother to put an effort to the action scenes and just told Carano to beat the guy up with her MMA skills. At least it was short."}, {"rating": "10", "text": "Yes, the story of a professional killer (ok, her mission was to rescue someone but deep down she's an assassin) who must get even with colleagues who have double crossed her/him is nothing new but this film just does this with brilliant flair. Gina Carano's performance, Steven Soderburgh's direction and David Holmes music all add up to a perfectly executed piece of entertainment. While completely different in so many ways, this film is equally ranked alongside 'The Artist' as my top films so far of 2012."}, {"rating": "9", "text": "Haywire is not just a great action film; its a great film as it acts as a callback to classic 60s spy thrillers while injecting a modern mentality thanks to some truly breath-taking fight scenes and car chases. Haywire is a strange amalgam of Tinker Tailor Soldier Spy and The Bourne Series as it portrays a woman who isnt afraid to throw down but can and will use her intelligence to get her out of a situation or solve a puzzle. The film follows Mallory, a freelance special ops agent as she is framed for something she didnt do and is forced to go on the run and figure out who set her up and why. The film opening scene sets the tone for the rest of the film with a tension and intelligence that is quite unique. The film revels in its brutality but it is never over the top with Haywire still feeling light on action in comparison to modern action films. Its the scenes where she is not engaging in fisticuffs that bring the film to life. Soderbergh manages to ratchet up the tension while maintaining the slick pace and feel of the film. There is a wonderful sense of paranoia running through the film that further emphasises the cold war mentality that Soderbergh is going for with everyone acting as a suspect in the overall conspiracy. The constant questioning of the men we are presented as they interact with Mallory provides for some really great scenes, especially the scenes she shares with Channing Tatum and Michael Fassbender. Carano brings not just physicality to the role (she did all her own stunts and is a trained mixed martial artist) but also sexuality as she toys with the people she meets. Her interaction (as mentioned above) with Tatum and Fassbender is particularly great as she has great chemistry with both of them and it provides a lightness to the scenes that was sorely needed. Gina Carano may not be an Oscar worthy actor but she is a dynamic lead and provides a great screen presence . The rest of the supporting cast work well too with Michael Douglas and Antonio Banderas providing some much needed gravitas. The only person who disappoints is Ewan Mcgregor who seems to rely a little too much on charm as he coasts through the movie. The chase scene in Dublin is some of the finest direction in an action film as it plays on not only Mallorys paranoia but also the viewers. The script isnt brilliant but if anything it does properly bring out Mallorys stoic nature while also showing off her intelligence and sexuality. Its a wonderful character to follow and its surprising (and welcome) to see such a character played by someone other than Angelina Jolie. Haywire is a wonderful film thanks to some ingenious direction by Steven Soderbergh, a great supporting cast and a multi-faceted lead in Gina Carano."}, {"rating": "0", "text": "This movie is so BAD that when it ended everyone in the room started complaining. The action is lame, the is no effect whatsoever and it looks like a 16 year old kid recorded it with a camcorder. This is the kind of movie that you want to hit yourself against the wall just because you wasted your time watching it. Just imagine the day when you were really really depressed, you still wouldn't want to watch this movie. There is a scene where the girl is inside the house and then she shows up with her face painted like Rambo - I was like are you kidding me, I have never done even a home video and I would never do that kind of mistake. There is no flow and the story is totally flawed -whoever comments positively about this movie seriously is short-minded or does not go to the theater much."}, {"rating": "0", "text": "This film is utterly unsatisfying.Not even slightly entertaining, some of the performances were utterly laughable, and the script was horrifyingly bad."}, {"rating": "1", "text": "The movie is SLOW, it made me struggle to stay awake only after a few minutes into. Scenes drag on for to long, and you ultimatly end up bored. Please note that my bad rating has nothing to do with the actors, I love all the actors, including Gina Carano. Im confused as how they managed to gather so much top a the line actors, for such a mediocre movie. There is alot of dialog, much of it is boring. What sucks the most is that its not Gina Carano's fault. Im hoping to see her in more movies. but Im staying away from European movies for a while. I only gave it the score I did, because it has because of the cast members. If not it would have been a 0."}, {"rating": "10", "text": "Finally a woman who actually knows how to throw a punch instead of crappy fighters like Jolie. Corano is hot and able to kick most guys asses. I would like to see her do more."}, {"rating": "10", "text": "A fantastic movie the acting is great. A great action thriller with an end that is very odd and opens up for a sequel the movie in my mind will be the most undeasted movie of the year but Gina Carrono for her first big role was great the best person in the entire movie. I say see it or you'll be missing out on one of the best movies that know one will see so see it ****"}, {"rating": "5", "text": "I mostly blame the marketing team of Haywire - they'd convinced me I was going to get something between Bourne and Nikita, and I didn't. I accept that's not what the film ever aimed to be, but because of the misleading trailers and publicity I can't help but feel a little duped. What Haywire actually is, is a pretty old-fashioned slow-burning spy movie with the occasional bone-crunching fight scene to savour. All due credit to Steven Soderbergh, the film is shot beautifully (particularly the Dublin sequence), has some nice stylistic touches, and the film as a whole isn't anywhere near as far up its own backside as some of his previous directorial efforts (Ocean's films I'm looking at you!). Gina Carano makes a decent, confident protagonist, and her mixed martial arts background makes the various scrapes that Mallory Kane gets into extremely creative, brutal and entertaining to watch. Michael Douglas also appears to relish his role as a high-ranking government agent, and his performance as an authority figure is very believable now that he's the spitting image of his dad. The rest of the cast I found a little underwhelming, with Ewan McGregor and Channing Tatum coasting, Antonio Banderas playing Antonio Banderas, and Michael Fassbender, though continuing to prove himself as a decent character actor, still slips back into his natural Irish lilt now and again. The actors' failings may have been overlooked had the script been decent, but Lem Dobbs' dialogue leaves a lot to be desired, and is probably the element that detracts most from the film as a whole. The pace of the film is extremely uneven too, and no matter how interesting Soderbergh makes his numerous long takes, you may find yourself pining for a few more all-out scraps. Maintaining a shot for the sake of tension only works up to a point, and after he pulled this trick for the third or fourth time I found my attention waning. I also found the conclusion to this story, which started so well, completely underwhelming. It may be good-looking, well-choreographed, and well-told up until the final act, but in the end, I found Haywire a little lifeless, and occasionally quite dull."}, {"rating": "2", "text": "Good filming for example in Dublin but the scenario and story is really not interesting. Not for the movie theater, better wait it is on TV. It seems obvious there will be a second to follow and get the answer of the first one."}, {"rating": "1", "text": "So bad. Great actors not acting so that what's her name wouldn't look incompetent. Total waste of money. Don't bother with it. It's not worth the time or the drive. It's not even worth watching for free at home."}, {"rating": "3", "text": "Wow! I just don't get how people are judging movies. \"Underworld Awakening\" got what? a 40 something grade and it was an awesome! action packed butt-kicking movie, and in contrast Haywire gets a score like 67. How do i start with the bad news? It was boring at times, with corny music and not very good action scenes. Gina Carano and Channing Tatums acting is pretty horrible, and was I the only 1 that thought this story is a bad copy-cat of like 3 other movies in recent years. I just don't get it, how this got a 67. I honestly would give this a 30 out of a 100 on meta-critic. And that's only because I'm such a big fan of Ewan Mcgregor."}, {"rating": "10", "text": "Basically everyone who gave this movie a bad review is brainwashed by Hollywood. Probably people who liked Mall Cop or something, and people who don't like seeing women kicking ass. If you want to leave the theatre satisfied and thinking \"Wow I just saw a really good movie\", go see it. It's a totally unconventional action movie, simply great. It feels 'realistic' in a human condition."}, {"rating": "3", "text": "Some major flaws with this film. One Gina Carrano has very little acting ability. She's gorgeous and can handle the fight scenes, but otherwise her one word remarks do nothing for the film. Then the plot. It is so confusing. You have no clue what's going on for most of the film. Add to that a horrible score. The action scenes were laden with this 1970's exploitation music. It became so bad, most people in the audience laughed at the beginning of each chase sequence. Put it this way, I've never walked out of  theater. I left after an hour of this film. I couldn't take it anymore."}, {"rating": "3", "text": "It's hard to see how this movie did so well with critics when Gina Carano and crew acted like they didn't care and had other things to really be doing. Soderbergh somehow finds it in himself to direct different camera shots of Carano running instead of develop her character a little more with less cheesy lines. The movie is in itself filmed like Ocean's Thirteen, which would be okay if it wasn't an action movie. Not exactly a great eye catcher for the beginning of 2012."}, {"rating": "5", "text": "You know there's something's wrong with an action-thriller when you don't really care who lives and who dies. This is not a bad film per se but a decent plot  might have helped."}, {"rating": "9", "text": "Brilliant. Regular action heads might be confused by Sonderburgh's arty approach. But there's always a hackneyed Van Damme B flick for them in the wings. Must admit I was a little confused by the plot twists and turns sometimes, but throughtly enjoyed it from beginning to its cool close. Talk about edge of the seat, tense action driven by a hip soundtrack. Super cast and had no problem with Gina Carano as a smart heroine rooting out corruption."}, {"rating": "5", "text": "Gina Carano, a famous MMA fighter, has thrown her hat into the action star ring. Under Steven Soderbergh's direction, she got stuck in a lackluster plot of international intrigue. He's surrounded her by a strong cast (Ewan McGregor, Michael Fassbender, Channing Tatum, Michael Douglas) to help boost her adequate acting. Unfortunately, much of the movie's time is spent with low-key dialogue and uneventful chases. The infrequent fight scenes are well-staged, but not especially original or impressive. Soderberg's detached style doesn't blend well with this genre. As a result, there's too much mediocre activity and not enough action."}, {"rating": "10", "text": "Saw the movie and wasn't expecting much due to the reviews on meta. But I have to say Gina Carano was great as the lead - the action was great, the stunts were as you would expect ---  really well done and realistic. She fit the role perfectly vs. an angela jolie type who looks breakable from one punch. It was a strong move to cast her in this role. All of us thought she has a big career infront of her. It's definitely a different type of action film, from look and feel, to plot structure vs.  traditional action films. The plot keeps you guessing for awhile as you try to put the pieces together. At the end you really have to start paying attention. A fun movie definitely better than a Mission Impossible to me and really refreshing to see some action like that."}, {"rating": "6", "text": "Although the film is flawed, I thought Gina Carano was terrific.  Unlike many female action stars she actually has a personality.  She smiles at times and comes across as human, instead of a killer machine.  The movie was WAY too complicated with that horrible technique of going back and forth to different time periods.  Ever since Pulp Fiction writers and directors can't seem to get enough of it, and it's getting annoying.  The only thing I liked about the film was Carano, and she made it just good enough to recommend."}, {"rating": "9", "text": "Before watching this I'd never heard of it nor the lead actress, so wasn't expecting much from it... and then I was totally blown away by the fight scene realism and a decent story to boot... One of the best female action movies I've seen in a very long time that didn't rely on stupid CGI and wires to pull off the choreography"}, {"rating": "5", "text": "To put it simply it's a B-movie. For the entire film the audience is unsure of particular motives and plot details until the end with the reveal from McGregor's character. It made the movie confusing, and the introduction of new characters cheesy. Like when another character makes a reference to a mysterious \"Paul,\" a character we haven't seen yet. I don't know, it just kind of comes off amateurish. Also the acting and writing were very average. Carano wasn't convincing and the others were just very average. And with the writing, what is with the sex? They mold this character into a sex symbol who kicks ass instead of creating a character much more original than that. The audience doesn't need sex, it needs interesting characters with justified motives. Overall like I said, it was just an average, b-movie, action movie."}, {"rating": "5", "text": "I liked Gina Carano in this film and she looked like she was actually kicking the crap out of everybody unlike other female action stars (Angelina Jolie). However, they tried to cram so much plot into a movie that lasted an hour and thirty minutes that it feels disjointed and messy. Also, the theatrical score was horrid and really distracted me throughout the film. It almost sounded like 1970's porn music."}, {"rating": "0", "text": "Podre pra kralho................................... Gina Carano é super simpática,talentosa e muito gostosa.... Mas que filme sem sentido sem vida é um prato cheio para suícidio"}, {"rating": "5", "text": "its gritty practical approach..HaywireHaywire is a plot driven action thriller about a spy who seeks revenge after a mission goes down and is hunted down by her fellow companions. The choreography of all the action sequences are jaw dropping that is lethally performed which leaves the audience in an awe of it. The crisp of the feature isn't kept alive through pummeling their way out of the track, but the thrilling ride it offers in that limited span. Chess like slick moves, characteristics of the characters and scoreboard mentality game is what keeps these characters not only intriguing and mysterious but pragmatic. As always, Soderbergh's pace is eerie, but he surely knows when to chew things and take it slowly and when to fasten and narrow it into one big punch. The background score can be daft at certain moments but is finely edited with decent cinematography and sharp sound effects. The chase sequences are smarter than we usually get and so are tricks and treats that is constantly imputed in each aspects of it, to keep the audience tangled in its cruel cold bubble. At a certain point somewhere in its middle act, there aren't any verbal content and is purely relied upon the detailed physical screenplay. As the script enfolds, it gets juicier than ever and with Soderbergh behind the camera, it is definitely not short on execution. Carano at the heart of it, may not be the anticipated actress, but surely delivers eye popping physical sequences that one has not yet encountered and the guest actors like Douglas, McGregor, Tatum, Banderas and Fassbender holds on to their part tightly. Neat and clean visuals, live locations and gut wrenching sturdy action sequences are the high points of the feature. Haywire is not a game changer but definitely redefines the genre by offering some real concrete material to the audience that is horrendous for its gritty practical approach."}, {"rating": "10", "text": "°》°》°》°》°》°》°》⊙》°》°》⊙》°》°》°》°》°》°》°》°》°》°》°@;@;@;@;@;;@;@;@;@;@!@;@;@;@!!@::@:@:@:@:@:@:@:@:@:@:@:@"}, {"rating": "5", "text": "Well she certainly can fight, and despite being beaten to a pulp, often, she only has a few bruises to show. Unfortunately she's stuck in a silly movie that panders to adolescent fans. Nothing wrong there had this been a B movie director not Soderbergh of Michael Clayton and Syriana fame. This time he gets some famous buddies to take on cameos so he can showcase the fighting chops of his MMA champion. The dialogue is dull, the holes in the plot are truck size and it's all just an energy bunnette flic without even humor to redeem it."}, {"rating": "4", "text": "Saw it a week ago and cared so little I'm just getting around to reviewing it. Tired formula that still works for guys action flicks... when its done well.   But, (and this is an \"big butt\") unless your a butch feminist who wishes Dirty Harry were a woman... your not the target audience. A few big name actors with passable performances but none of it was compelling or convincing. Wait for the small screen."}, {"rating": "7", "text": "Just got home from seeing this movie.  It's a slow time for movies, and there wasn't much else out there worth seeing.  This got good reviews, so I though I'd try it.  The cinematography was excellent, the music and sound effects were terrific as well.  Sure, it was an effort to follow the actual story, but that made me pay attention.  If I wanted mind numbing dumb action I would have seen Underworld.  But overall, a pretty good movie for those of us who still have attention spans in this day and age."}], "recommendations": ["miami_vice", "atomic_blonde", "kate", "jiu_jitsu", "gemini_man", "hanna", "drive", "triple_frontier", "the_mechanic", "the_equalizer_2", "wrath_of_man", "mile_22", "gunpowder_milkshake", "safe", "mission_impossible_ii", "bloodshot", "the_equalizer", "baby_driver", "red_sparrow", "rocknrolla", "the_marine", "desperado", "infinite", "furious_7", "run_all_night"]}