{"id": 3102, "title": "Heaven Is for Real", "starring": ["Greg Kinnear", "Kelly Reilly"], "runtime": 99, "genre": ["Drama"], "description": "The true story of the 4-year old son of a small-town pastor who, during emergency surgery, slips from consciousness and enters heaven. When he awakes, he recounts his experiences on the other side.", "releaseYear": "2014", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/bYJhBhe6CPIHTl62kPfKfqicTaX.jpg", "categories": {"plot": 5.909090909090909, "acting": 6.75, "ending": 6.5, "soundtrack": 8.0, "cinematography": 7.0, "familyFriendly": 3.923076923076923, "funny": 5.5, "action": 10.0}, "reviews": [{"rating": "7", "text": "I am generally not a fan of seeing movies in the theater, but I caught \"Heaven is for Real\" by accident after other plans were changed.  Additionally, I am not a religious person, so I was also a bit concerned that this movie would be a bit too \"preachy\" for my taste.  However, I decided to take a chance on this one (we did have others to choose from) and am, for the most part, glad I did.  My expectations were definitely surpassed.\r I think Greg Kinnear is a decent actor and did a solid job in this, but it is unfortunate that whenever I see him in a \"serious\" movie, I can't help but think of a certain silly cable TV show he hosted back in the day.  I was completely unimpressed with Kelly Reilly, the actress who played the wife.  The story is set in Nebraska, and it is blatantly obvious that Ms. Reilly is not an American actress.  She really did try to have an American accent, but failed miserably.  Lo & behold, she is British.  I wouldn't have a problem with this if she actually succeeded with her American accent!  For me, she was the weak link in the movie.  However, the main story really revolved around the father & son, so she had more of a supporting role, thank goodness!  The other supporting players were fine, but their roles (church-goers/church leaders) weren't entirely pivotal to the movie, in my opinion.  I must say, I think the best acting actually came from the child actor who played the son.  For a small child, he was actually fantastic!\r I personally did not find this movie to be heavy on the religion, which was quite a relief.  In fact, I felt the story was very touching.  The root of this movie is really about the love between a father & his son; the son has a phenomenal experience, the father struggles to believe him and subsequently questions his own beliefs because of it.  It's an enjoyable film, but one I probably could have waited for on DVD, as I normally do with all the rest!"}, {"rating": "0", "text": "The whole movie seems based  on a 5 minute video interview to the kid and parents. The rest of the movie were fillers. When the movie is over, I started wondering if the kid's story was even real, as he used language that was part of his life, being in a very religious family. I had high hopes, but was utterly disappointed. Greg Kinnear was great in it, though."}, {"rating": "1", "text": "Keep it to the religious, who believe in this god thing. And keep it away from those who aren't. My family is religion, so I was forced to watch this hunk of garbage."}, {"rating": "6", "text": "If I had not read the book I might have found myself with a different opinion of the film. Expectations for the movie weren't very high, as they aren't high for any book to movie transition. The acting was verging on B rated besides Greg Kinnear's performance witch was very well played. I came away from Heaven is for real disappointed and wishing more had come out of such a great live to tell story. The movie felt weak in structure and spotty with well thought out dialogue. I might add that I loved the book, but felt the movie fell short. Heaven Is for Real is an attempt at influencing people towards Christianity, that was rained on by distracting characters and a poor written script."}, {"rating": "8", "text": "Heaven is for Real doesn't try and apologize for what it is. It's a story that says: \"Whether you believe this or not, here it is\". As far as the structure of the movie itself went, it started off quite fast paced and seemed to rush quickly through a lot of the parts that were more drawn-out in the book. An example is when Colton goes to hospital - in the book, this was told in much more detail, and showed the gradual increase in Colton's sickness, right up to the point where Colton goes to hospital. In the movie however, the hospital scene seems to come out of no where and is rushed through extremely quickly, creating much less of an impact compared to if there was more of an emphasis here.\r I can say though, where the film lacked here, it made up for in the scenes with Colton's descriptions about Heaven. These scenes were some of the highlights of the film, and they just seemed to flow better in the way that they occurred compared to the book which felt more like a ton of questions and answers (To be fair though, they were very interesting questions and answers). One thing that I also liked more about the movie than the book, was that it really showed the families struggles going through hard times with the Church. Colton's sudden descriptions of Heaven really fitted well with this idea as well.\r Overall, the Christian themes and values in the movie were something that everyone, Christian or not, should be able to relate to, and the story is one that I hope people will feel encouraged by, Christian or not, and for that reason, I recommend this movie to everyone."}, {"rating": "6", "text": "I saw the movie opening night before a theater which was about 80% full.  The slowly developing story pulls on your heartstrings as a the cutest 4 YO little boy survives a near death experience in the operating room.  He then slowly starts to tell his father he was in heaven, had an out of body experience, and describes what he saw.  What is lacking is a detailed account of that experience as there was so much more that could have been presented.  It's certainly a feel good story that we all want to believe.  The true life hero is now a teenager and was recently interviewed by Bill O'Reilly.  Once again he spoke in a narrative summary without giving specific details as he was totally unconvincing.  Still a nice movie."}, {"rating": "0", "text": "Dumb. Boring. Pointless. Illogical. The only evidence we have to believe is what a little kid says. If we believe in what a kid has to say, then lets believe in some old book that was written a few hundred years ago. The movie is pure religious garbage."}, {"rating": "5", "text": "This is the type of bull that inspires conspiracy theorists to imagine their Illuminatis and Christians to become some self righteous a-holes.Anyway it's not that bad."}, {"rating": "10", "text": "I just came back home after watching this . this movie well is just    really not explainable to say about . this movie took me to another world . It was just powerful , exciting , depressing , and just  touching to the people in this world and above are world."}, {"rating": "3", "text": "Dumb. Boring. Pointless. Illogical. What do these words have in common? They describe religious propagand films like this, of course. It's not as bad as other films of the same kind I've seen but, its still pretty stupid. Are you really gonna believe what a dumb little kid says?"}, {"rating": "10", "text": "Very moving, touching and well-acted movie based on a true story.  Heaven is truly for real.  Heartfelt and emotionally charged  that will make you feel real hope and compassion.  A must see!"}, {"rating": "1", "text": "i can say it is a nice movie. but doesn't prove anything. it just make some peoples hopes up over fairy tails. kids are all nice. if your loved once die very young, don't worry he is not in hell, that is a relief. plus please don't kill your kids LOL.  some people can't handle things without heaven or god. but if you want to believe it's OK."}, {"rating": "10", "text": "This was the best movie I've ever seen in my entire life! This film really touched my heart. A must-see film for everyone!! I definitely plan on seeing this movie AGAIN!!!"}, {"rating": "10", "text": "Heaven IS for Real.  I have met members of the Burpo family - great family and truth is truth.  Movies are made to please mass audiences.  Read the book - it is truly life-changing.  It is an awesome reinforcement for Christians all over the world.  Praying for the non-believers."}, {"rating": "8", "text": "Having read and loving Todd Burpo’s best-selling true story HEAVEN IS FOR REAL, about his four-year-old son, Colton, and his near-death experience in which he was seemingly given a vivid glimpse of heaven, and then finding out later that the book was being adapted into a major motion picture, I had high hopes that perhaps Hollywood might get this one right. However, I couldn’t help but fear the worst that like almost all other well-intentioned, but under-financed faith-based films produced on low budgets, HEAVEN IS FOR REAL would ultimately end up being just another cinematic sham.  Imagine then my heightened optimism when A-list, Oscar-nominated actor Greg Kinnear (AS GOOD AS IT GETS) was snagged to play Burpo and that the film was being directed (and its story adapted to the big-screen) by Oscar-nominated screenwriter Barry Wallace (BRAVEHEART).\r Those that loved the best-selling book (over 8 million in paperbacks and eBooks sold) will be pleasantly surprised and greatly relieved to know that screenwriter Wallace has done a masterful job of bringing this touching and inspiring true story to the big screen. That is not to say that the 100-minute film has much (if any) chance of swaying skeptics into accepting the existence of heaven and Jesus Christ as the keeper of the keys. However, Wallace has confidently and faithfully truncated the source material into a movie that more than captures the spirit of the book. With a brilliant marketing move of an Easter weekend release, the film is already a huge hit with Christian filmgoers, and may even become a cross-over success with other film audience demographic categories as well. Despite mixed reviews from film critics (48/100 on Metacritic.com) Sony Pictures is reportedly thrilled with the surprise opening success of the film, with it already earning nearly $30 million, more than doubling its $12 million budget in just five days. Couple those figures with the strong word-of-mouth buzz from the opening weekend movie-goers, and it appears that HEAVEN IS FOR REAL may have much stronger legs than anyone had ever expected.\rKinnear’s performance in HEAVEN IS FOR REAL may very well be his very best to date, as Todd Burpo, a hard-working, vastly underpaid pastor having to find multiple jobs to support his family and serve his community as a volunteer fireman as well. Kinnear brings such sincerity, nobility, and gentle humor to his role that one can’t help but root for him to pull his family through the turmoil that these unsolicited revelations have caused.  It will be interesting to see if Hollywood will acknowledge Kinnear’s work here come award season. Although I feel that he is deserving (so far) for a Best Actor nomination, its still early in the year, and the competition will undoubtedly get tough as the fall releases begin to come out. It may also be too much for Hollywood to be able to give such obvious recognition to a low-budget, faith-based film, though it would not be breaking a precedent to do so. Anyone remember Sidney Poitier’s Oscar win for LILIES OF THE FIELD (1963) or Robert Duvall’s for TENDER MERCIES (1983)?\rKinnear’s excellent performance is also enhanced when sharing the screen with six-year-old newcomer, Connor Corum, as Colton. Wallace (putting on his director’s hat) picked young Corum out from a nationwide casting call and was specifically looking for a boy who could speak with “an absolutely honest and open heart.” Kinnear and Corum’s scenes together are so very natural and believable that I was taken back to the Oscar-nominated performances of Dustin Hoffman and (then) six-year-old Justin Henry in KRAMER VS. KRAMER (1979). Though Kelly Reilly as Connor’s mom and Todd’s wife is clearly the weak casting link in the film (her scenes, whether with Kinnear and/or Corum, or not, never really ring true) the film is blessed with strong supporting roles by Oscar-nominee Thomas Haden Church (SIDEWAYS) as Todd’s best friend, and Margo Martindale (AUGUST: OSAGE COUNTY) as a skeptical and concerned church board member. Both of these well-recognized actors add great credibility to the otherwise unknown and less experienced cast. The film’s cinematography, helmed by Oscar-winner, Dean Semler (DANCES WITH WOLVES) is gorgeous, and tasteful throughout, especially when depicting heavenly angels floating in bright sunlit, puffy clouded skies, and during the Rockwell-like farmland landscapes of Nebraska (actually shot in Ontario). However, besides Reilly’s unconvincing portrayal as Sonja, another weak point in the film is its original music score which is rather bland and formulaic, and is out-classed by the handful of contemporary worship songs sprinkled throughout the movie that are far more supportive. Grade = B+"}, {"rating": "3", "text": "It wasnt as insulting to those who do not believe in mythology literally as god is not dead was so it has that going for it. Not a great movie and not a bad one. If you like sugary sweet hallmark like movies with no basis in reality its good. If you think its a movie to affirm belief or sway non believers then its not so good."}, {"rating": "3", "text": "When I went to watch Heaven Is For Real in my nearest Cineplex, I saw more than 90% of the people were watching this movie. BIG LINE. After 2 hours of waiting, the movie started. 30 minutes into it, I didn't know if I had made a good choice watching this. It's all that rubbish demonic, soul movie and at that genre it's slow but effective. This movie was so depressing and badly acted that you will laugh. The story is mediocre, this movie is overall not worth 2 and a half hours. Save your money and watch Locke instead. At least the message was effective."}, {"rating": "7", "text": "En mi opinión, una de las razones por las que Heaven is for Real no gustó a la crítica es porque se inclina mucho al tema de lo religioso, y he notado que a la crítica no le gusta mucho eso, sin embargo, creo que el film es un buen drama y logra ser efectivamente bueno."}, {"rating": "5", "text": "Heaven is for Real does not fully deliver the spiritual uplift you should experience after watching this movie. But in my opinion, it is entertaining and surprisingly wondrous."}, {"rating": "10", "text": "The movie was great, and I would see it again.  How does anyone know this did not happen to this child, or anyone else for that matter.  The child is 4 years old.  If people believe in heaven, why can't they believe in him?"}, {"rating": "3", "text": "It's disappointing to see a movie with such a great story go to waste like this. The first 1/4 of the movie was completely irrelevant to the rest of the plot, the acting ranged from bearable to cringe inducing and everything in between, there were comedy elements thrown in there that were completely uncalled for, lots of plot holes, and worst of all, the writing was just awful. It's a shame that this movie was so sloppily thrown together, it had potential but don't even bother with this one."}, {"rating": "5", "text": "I guess you have to take this movie for what it is: a movie about a small-town church family dealing with a profound and uncommon event.\rTypical for these small towns, the father is the senior minister, mother is the choir/music leader, children obviously are very religious and righteous people because of this.\rWhat really pulls you in is how the father (the minister) reacts to his son being \"in heaven\". Really feel for the guy, as a person who does not have that experience (but sure would like it I bet). He's preaching this stuff, believing in it in some way, but his son lived and saw it with no intent of preaching it or validating.\rIn summary, worth a rent on a rainy day. If you like religious movies with a message, this one isn't as heavy-handed. You believe what you want to believe in the end really."}, {"rating": "7", "text": "Not perfect, but definitely a step in the right direction.  There are some scenes towards the beginning that come across as generic and poorly written, but it soon rides out of that bumpy terrain and finds its footing.  It eventually becomes very engaging, moving, and occasionally beautiful.  The acting, screenplay, and cinematography are all leaps and bounds ahead of most movies in it's genre.  I think it might even change some people's opinions on the afterlife.  Sure, some aspects could have been improved upon, but it's far better than similar fare."}, {"rating": "7", "text": "Película ideal para semana de Pascua, sin entrar mucho a la parte teológica, el mensaje es claro, la fe puede llegar a tocar cualquier corazón humano."}, {"rating": "6", "text": "Very thought provoking and interesting (enough to keep me watching) It's not about the entertainment, the reviews, the story or acting. Not the cast or the writing, not even the set. It's about faith. Maybe not a very well example, but still counts. What do you believe?"}, {"rating": "5", "text": "Heaven is for Real is too much of a religious movie for my tastes, and besides that it was so boring!! Some true stories aren't meant to be told, and this is one of them!!"}, {"rating": "8", "text": "the begining of the movie isn't good at all, they show us a lot of information, but the real message of the film is along the hole movie. the role than play the kid is very important and he does a good job showing us the spirit of the context, than is more important than other superficial things."}, {"rating": "4", "text": "The movie is okay the book was much better.  The movie missed the central point that the book made very clear.  The little boy Todd,  when he went to a funeral with his Dad,  wanted to know if the man who had died knew Jesus.  His father said I do not know, then Todd the little boy stated to his Dad,  he must know Jesus or he will not see heaven.  Holy Cow how was that missed in the movie.  The actors and acressess were very good in the movie and it was a movie that did not preach to you either, but to miss the central point of the book and not have it in the movie was disturbing."}, {"rating": "3", "text": "I was raised a Christian although I no longer believe in it. To me this film is just an elaborate science fiction film masquerading as real life Christianity. It's well acted and beautifully shot, but really, it kind of prays on the beliefs of the majority of the world’s faithful. It's just not for me."}, {"rating": "5", "text": "In this film, a near-death incident allows a child an unusual view of life beyond death, and is one of the so-called \"Christian movies\", made by US evangelical Christians to propagandize their religion. Throughout the plot, the existence of life after death is taken as a certainty, with scientific explanations being (purposely) unreliable, which makes it hardly suitable for those who don't believe in it. Despite the unfortunate evangelical propaganda, the film presents an interesting problem, valid to any religion or belief system: it confront adults with their own beliefs using a child, reinforcing the idea of ​​innocence, as if a child were unable to lie. Adults say they believe in some things but are always doubting and are unable to deal with any evidence, even if it support their beliefs. That denounces some hypocrisy underlying most religions, including the one who sponsored the film. This is interesting to see and take away some of the propagandistic load that permeates the film, full of feelings but avoiding being corny. I don't know anyone from the cast, but they did a decent job. However, this movie is not a dramatic show. Its worth for it's story and the problem it brings, even if it's spoiled by partiality and religious propaganda."}], "recommendations": ["overcomer", "i_can_only_imagine", "courageous", "pay_it_forward", "risen", "the_giver", "slumdog_millionaire", "soul_surfer", "miracles_from_heaven", "war_room", "the_butterfly_effect", "babel", "hereafter", "i_still_believe", "revolutionary_road", "collateral_beauty", "son_of_god", "the_book_thief", "hotel_rwanda", "bridge_to_terabithia", "facing_the_giants", "woodlawn", "the_adjustment_bureau", "the_pursuit_of_happyness", "machine_gun_preacher"]}