{
  "id": 4365,
  "title": "Hellraiser: Hellworld",
  "starring": [
    "Katheryn Winnick",
    "Christopher Jacot"
  ],
  "runtime": 91,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Gamers who participate in an online role-playing game called Hellworld are invited to a rave whose host plans to show them all the truth behind the Cenobite mythos.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nc2KcfOWhugGP4HeiqUyt0Swyl3.jpg",
  "categories": {
    "plot": 0.0,
    "acting": 0.6666666666666666,
    "ending": 0.0,
    "soundtrack": 5.0,
    "cinematography": 0.0,
    "familyFriendly": 3.0,
    "funny": 0.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "JUST END ALREADY!Though it’s sad to see Doug Bradley leave the classic role, This film still sucks."
    },
    {
      "rating": "0",
      "text": "a few things:1. this is way better than hellseeker. that film was pure stupidity.2. this is worse than deader. that at least had a cool idea and decent protagonist.i would say it's better than inferno because of the entertainment value, but it's dumber."
    },
    {
      "rating": "2",
      "text": "Hellraiser: Hellworld is the Halloween: Resurrection of Hellraiser: It's stupid, it involves online crap, and it has bad acting and decent characters."
    },
    {
      "rating": "6",
      "text": "I honestly didn't mind this one. I felt it was pretty needless to do the whole \"online\" phase, which every horror franchise seems to go through, but it didn't tank this movie. It was enjoyable enough for me to watch and not mind going back to."
    },
    {
      "rating": "0",
      "text": "No. It wasn’t supposed to be possible. It wasn’t supposed to be possible to make a worse movie than Hellraiser Hellseeker, but Hellraiser Hellworld somehow is. First, the things I liked. Lance Henriksen is good and I laughed at 3 of the jokes (I actually think Anna Tolputt is quite a funny actress, that’s presumably why they kept her out of most of the movie). I also liked the return of the Chatterer Cenobite, but it feels like just a cheap way to win over fans. Now, the negatives. I HATE THIS GODDAMN MOVIE. It’s directed by Rick Bota, you also directed Hellseeker and Deader, but the real big name is Carl Dupre, the mastermind behind Hellraiser Hellseeker, who writes this movie, and you can tell it was made by these two. The cinematography is bland, the acting god-awful, even Henry Cavill (Superman) is horrid. The characters are cliché cardboard cutouts, and whenever they have some character, they’re incredibly unlikeable. The special effects are either simple or laughably awful. This movie is also the first to not introduce any new Cenobites, even Hellseeker did that. But the most frustrating thing about this movie is the fake outs. There are so many hallucinations or dreams that it gets genuinely infuriating. The twist, and the ending as a whole, is also the worst thing ever to happen to humanity. And the final cherry on top is that Doug Bradley’s Pinhead has the least screen time out of all the movies thus far. Before the last scene, which is really short and doesn’t feature any protagonists, Pinhead has less than a minute of screen time. LESS THAN A MINUTE. YOU HIRE THE DOUG BRADLEY AND YOU PUT HIM ON SCREEN FOR LESS THAN A MINUTE AND ALL YOU HAVE HIM SAY ARE BAD ONE LINERS?!?!? I’m done. And there’s still two more. Jesus."
    }
  ],
  "recommendations": [
    "ghost_rider_spirit_of_vengeance",
    "suicide_squad",
    "the_day_the_earth_stood_still",
    "doctor_strange_in_the_multiverse_of_madness",
    "the_legend_of_hercules",
    "jason_x",
    "the_bye_bye_man",
    "transformers_revenge_of_the_fallen",
    "skyline",
    "slender_man",
    "wonder_woman_1984",
    "the_mummy_tomb_of_the_dragon_emperor",
    "mortal_kombat_annihilation",
    "legion",
    "teenage_mutant_ninja_turtles",
    "twilight",
    "transformers_age_of_extinction",
    "ghost_rider",
    "the_happening",
    "shadow_in_the_cloud",
    "volcano",
    "the_new_mutants",
    "the_eye",
    "the_final_destination",
    "knowing"
  ]
}