{
  "id": 4307,
  "title": "Hellraiser: Inferno",
  "starring": [
    "Craig Sheffer",
    "Nicholas Turturro"
  ],
  "runtime": 99,
  "genre": [
    "Horror",
    "Thriller",
    "Mystery"
  ],
  "description": "A shady police detective becomes embroiled in a strange world of murder, sadism and madness after being assigned a murder investigation against a madman known only as \"The Engineer\".",
  "releaseYear": "2000",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ayzU5tfrtrqaAdVOhLFXuNxcqHx.jpg",
  "categories": {
    "plot": 5.5,
    "acting": 4.0,
    "ending": 4.5,
    "soundtrack": 5.0,
    "cinematography": 9.0,
    "familyFriendly": 2.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Absolute crap. It has nothing to do with Hellraiser, has terrible characters, and has a sh*tty ending. F**K THE DTV SEQUELS"
    },
    {
      "rating": "4",
      "text": "SloppyHellraiser: Inferno is basically a completely bland and empty horror film."
    },
    {
      "rating": "2",
      "text": "I re-watched this movie, and I thought it really sucked. It's not fun watching a horrible main character, it isn't enjoyable watching a movie (that wasn't originally Hellraiser) throw in Pinhead for a minute, and the ending is stupid af. F*CK this movie."
    },
    {
      "rating": "4",
      "text": "The story is ok, As is the acting but there's a lot less focus on Pinhead and the cenobites and more focus on everything else. It doesn't really feel like a Hellraiser film IMO but it's not terrible."
    },
    {
      "rating": "8",
      "text": "The movie didnt´s seemed like a Hellraiser franchise movie, it didn´t used Cenobites very often and most of the time i was asking myself \"WTF?\". But the last few minutes brought a wonderful twist, which changed the whole movie and actually started to make sence. It´s a shame that this movie isn´t appreciated as it should, because it´s a good film. And much more complex than it seems."
    },
    {
      "rating": "9",
      "text": "This is maybe one of the most impactful psychological horror/thrillers you can watch.The noir-like cinematography and lighting combined with pure psychological terror (watching your parents die painfully before your eyes/ breaking the frozen hand of your own daughter) is a psychological horror you cannot really experience anywhere else.This movie will have a lasting impact on you. It's one of those movies where when you watch them, stays with you into the following days. Don't listen to the critics, trust me on this one."
    },
    {
      "rating": "7",
      "text": "Scott Derrickson had a huge task ahead of him when he took on the project of Hellraiser: Inferno. It had the lowest budget of the series since the original, Clive Barker was no longer involved, Ashley Laurence hadn’t had a major role since the second film, Doug Bradley didn’t want Pinhead to be the main villain anymore and there were no returning Cenobite actors. But Derrickson managed to make this into one of the best movies in the Hellraiser series. The grey characters, interesting story and suspense make this a great film to watch, diehard Hellraiser fan or not. The twist is also brilliantly executed, and will leave chills running down your spine. Doug Bradley’s Pinhead barely appears but when he does he is great. But the film is plagued with shoddy acting, and it doesn’t quite live up to the standard of creativity set by the earlier films. The special effects are lacking, they’re fine when they’re there, but they’re oftentimes not. These factors make Hellraiser: Inferno an entertaining horror film, but a somewhat subpar Hellraiser movie."
    }
  ]
}