{
  "id": 4544,
  "title": "Hell Fest",
  "starring": [
    "Amy Forsyth",
    "Reign Edwards"
  ],
  "runtime": 89,
  "genre": [
    "Horror"
  ],
  "description": "On Halloween night at a horror theme park, a costumed killer begins slaying innocent patrons who believe that it's all part of the festivities.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qgLlnlrUtTKXkdrgMBwUfkyAkya.jpg",
  "categories": {
    "plot": 7.142857142857143,
    "acting": 7.375,
    "ending": 7.0,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I was pleasantly surprised by Hellfest! It was filled with believable and actually quite good performances, genuine thrills, a few brutal kills, and great pacing. The setting was put to great use making for an overall well-done mix of fun, paranoia, and chaos.The killer himself was nothing to write home about but was pretty intimidating with his presence. Also, there was some iffy writing, and the ending was a bit on the \"whatever\" side. In the end, Hell Fest is by no means a masterpiece, but it did exactly what it needed to and did it consistently well throughout. I had a good time with it, and it made me feel the way I did as a kid watching the old \"Halloween\" slasher flicks."
    },
    {
      "rating": "8",
      "text": "I Watched Hell Fest and Liked It.Cinematography: 8.912/10 Hell Fest flows well though a few questions are left unanswered throughout. This is a horror film worth owning. Costume Design: 8.897/10 The costumes are on point and work so well with the film. Film Editing: 8.321/10 Solid.Make-up and Hair-styling: 8.897/10 Solid.Sound Editing: 8.621/10 Real good. Sound Editing is so important. So well done. So on point. Visual Effects: 8.576/10 Solid. Story: 8.763/10 Solid. Not a corny horror. Well-done. A good surprise. Acting: 8.219/10 Solid. I'm so glad about no screaming-raging person going off about killing the killer then getting killed. *throws arms in the air* All that screaming for what?Personal: Hell Fest is a good horror film and timely with Halloween nearing. It's creepy. It's not overwrought. The acting makes the film so much better. The obvious is not so obvious which makes the elements of the film much stronger. A bit of a questionable ending though. Hell Fest definitely stands out as a horror film and sets itself for sequels as well as a potential prequel. The film is full of why-what?!-huh? moments that may really draw an audience in. I'm not big on giving spoilers: this film is surprising and touches on interesting points concerning menaces in society. Heads up, this is not an over-the-top horror film: it's -  to me, a basic-good horror film.Overall: 8.651/10-K.D.If you're into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."
    },
    {
      "rating": "9",
      "text": "Hell Fest is a breakthrough slasher! The comedic elements work but boy do the horror elements work even more!"
    },
    {
      "rating": "10",
      "text": "Really took me back to the old slasher movies that I loved! Such a fun and exciting ride!"
    },
    {
      "rating": "3",
      "text": "I suppose that audiences has made the film studios believe that because Halloween is near, they will swallow any ineffective horror ideas that they produce."
    },
    {
      "rating": "6",
      "text": "I have a soft spot for slasher films, and I can’t say this is anything great, but it has some fun kills and there were plenty of people covering their eyes in scared glee. Take all that how you will."
    },
    {
      "rating": "7",
      "text": "Remember in the '80s when slasher flicks were a dime a dozen? How they all had little themes like summer camp or some random holiday? Well meet Hell Fest. A throwback to the stab-happy movies of that era that managed to find a setting largely untouched in the genre: haunted funhouses. Taking place in a seasonal Halloween amusement park a masked killer takes advantage of the fact that every employee is in costume and actively trying to scare guests to stalk and murder a group of college students undetected. A group who, while a bit annoying at first due to how unnecessarily vulgar they are, quickly begin to grow on you due to their love of all things horror.This definitely has some decent thrills. There are a couple of really good kills, one of which is very Fulci-esque, and a few genuinely tense moments near the end. The real star of the show though is the environment. The creative mazes and attractions the characters' visit make the traveling carnival look like something you'd actually want to visit were it not for the demented murderer lurking about. Plus, it's hard to not get excited by a cameo from the Candyman himself, Tony Todd.It drops the ball in a pretty big way with its villain however. Outside of a neat reveal in the final scene there's nothing interesting about him. His most defining attributes are that he slowly plods forward in a clear nod to the likes of Jason Voorhees and Michael Meyers, a tear in his right shoe, and that he hums Pop Goes the Weasel. None of which make him very memorable or scary. It's this kind of thing the hold this back from ever attaining true classic status or turning into its own franchise with sequels.Still, even relying on visuals and location alone like it is, Hell Fest is ripe for a cult following. It got off on a bit of a wrong foot with me at first as its cast of young actors and actresses seemed prime to grate on the nerves. Yet, their enthusiasm proved infectious and it wasn't long before I was having just as much fun as they seemed to be having onscreen. The entire setup makes it a perfect October watch and it even capitalizes on the premise in some clever, effective ways. All of which is enough for me to give it a pass and a recommendation.7.3/10"
    },
    {
      "rating": "6",
      "text": "Hell Fest is not a movie that delivers on a complex mind workout plot (nor should you expect it to)...it is, however, reminiscent of the old school 80s horror movie that delivers par to subpar acting, a semi-believable plot, and adds in practical effects death scenes. That's why you go to watch this movie and that's what they gave you. Though they definitely could have pushed more in the gruesome gore department, this movie is what it is and stays in its lane. The horror/scary movie genre is a tough one, especially in today's desensitized world, and most movies that come out in this genre rely almost exclusively on cheap jump scares. So if this type of movie is in your wheelhouse, this movie is worth a watch...just temper expectations."
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■"
    },
    {
      "rating": "8",
      "text": "It's nice to see a couple of new slashers this year. Yeah, I know horror can't be stagnant and has to change. However, it's fun just to sit back and enjoy the simplicity of people just trying fend off some guy who is trying to kill them.Hell Fest isn't the greatest slasher ever made. It doesn't reinvent anything and the story is rather basic. Still, it is very entertaining.The movie follows the characters as they flee the titular horror-themed amusement park, which is the true star of this film. You don't mind the scenes that don't have the killer or action in it, because the place is so much fun. I'm surprised at the amount of production that went into this. This isn't the case of a small area and the characters having to run through attractions introduced earlier in the film. Every location is new. Every employee costume is new. All the scares are new. Hell Fest, the park not the film, truly feels like a true amusement park one could step into. (Alright, the bathrooms are immaculate, but that's the only difference.)Director Gregory Plotkin was originally an editor and it shows in his eye for the audiovisuals. Cinematography and music are really strong here.The scares don't stand out too much. (Though there are a couple pretty good kills here.) But it is pretty thrilling. Although there isn't anything too original about the killer, a guy in a mask and a hoodie, the movie does a good job of portraying him as dangerous and cunning. Instead of having him just pop up, the film follows him and one can only watch with apprehension as he stalks the cast. (You do wonder why he never runs into staff when he sneaks backstage, but it is a minimal issue.) The fact that he can blend in so calmly is pretty unnerving.The story is bare bones. The main character's major problem is that she's been drifting away from her friend, which is only second to the dead relative cliche. The dialogue is basic. (The exhibition at the beginning is pretty weak.) But, once they're hanging around the amusement park, I didn't care. The actors were clearly having fun and one would like to hang with them. Overall, I really enjoyed myself.P.S. Blair Butler contributed to the script. Remember her? She used to appear on G4. She'd guest host sometimes on X-Play or Olivia Munn's Attack of the Show. Anyone? It's not just me right? Anyone? Anyone?"
    },
    {
      "rating": "5",
      "text": "It's a slasher movie, that's all. The acting was bad, the story was bad, at least the park was cool..."
    },
    {
      "rating": "7",
      "text": "Όπως οι περισσότερες exploitation ταινίες τρόμου, έτσι και αυτό το «Πάρκο του Τρόμου» στηρίζεται σε μία και μόνη ιδέα, πάνω στην οποία προσαρμόζονται όλες οι δοκιμασμένες συνταγές του είδους..."
    },
    {
      "rating": "5",
      "text": "A group of friends visit a horror-themed carnival where they witness one of the attendees being murdered by what is seemingly a member of staff and chalk it up as part of the attraction but are then hunted down by the masked killer until he goes home to his family at the end of the film."
    },
    {
      "rating": "8",
      "text": "¡•¡•¡•¡•¡•¡¡•¡•¡•¡¤¡¤•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡¡•¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡"
    },
    {
      "rating": "6",
      "text": "É legalzinho, não é nada incrível mas é eficiente como entretenimento descartável, as mortes são ok, os personagens são meio qualquer coisa (Tipo slasher mesmo), o assassino não tem nada de muito marcante e eu queria mais do Tony Todd. Mas eu adorei a ambientação do parque, a ideia é boa mas poderia ser ainda melhor. Mesmo assim eu me diverti."
    }
  ],
  "recommendations": [
    "the_collector",
    "terrifier",
    "p2",
    "house_of_1000_corpses",
    "wrong_turn",
    "texas_chainsaw_3d",
    "the_boy",
    "clown",
    "the_crazies",
    "the_strangers_prey_at_night",
    "vacancy",
    "house_of_wax",
    "annabelle_creation",
    "scream_2",
    "the_woman_in_black",
    "final_destination",
    "insidious",
    "sinister_2",
    "scream",
    "mirrors",
    "dark_skies",
    "dead_silence",
    "it_follows",
    "the_conjuring",
    "the_ring"
  ]
}