{
  "id": 3093,
  "title": "Hellraiser",
  "starring": [
    "Odessa A'zion",
    "Jamie Clayton"
  ],
  "runtime": 121,
  "genre": [
    "Horror",
    "Mystery"
  ],
  "description": "A young woman struggling with addiction comes into possession of an ancient puzzle box, unaware that its purpose is to summon the Cenobites, a group of sadistic supernatural beings from another dimension.",
  "releaseYear": "2022",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/f9ZAIUxTTk23vo1BC9Ur1Rx5c2E.jpg",
  "categories": {
    "plot": 8.142857142857142,
    "acting": 8.75,
    "ending": 7.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Hellraiser is a horror classic. The movie is original, creepy, visually brilliant and has many twists that you won't see coming. This is one of my favourite horror movies of all time and it is on the level of a nightmare on elm street and scream."
    },
    {
      "rating": "10",
      "text": "This is the best horror film ever made. It’s brilliant, scary and well written. Clive Barker’s direction gives this film so much more depth, there’s so much symbolism in the imagery and cinematography. The characters are extremely well-fleshed out, especially for an 80s horror film. The effects are also amazing, the stop-motion and makeup combined with the creature designs also make for a thoroughly enjoyable watch."
    },
    {
      "rating": "10",
      "text": "It's a horror classic and to this date remains one of the best looking horror films of all time. And Pinhead became a horror icon the moment he appeared onscreen."
    },
    {
      "rating": "10",
      "text": "The pinnacle of R-rated, practical effect horror and gore.This movie makes you fear as much as wish, that if hell and heaven would be real instead of fiction, you wouldGOTOHELL."
    },
    {
      "rating": "10",
      "text": "Awesome film, with nice effects, interesting characters, and a cool mystery.Btw whoever keeps dislike bombing the positive reviews, go f**k yourself"
    },
    {
      "rating": "10",
      "text": "Hellraiser made in 1987 is a horror classic... A man died upstairs inside a house after solving a puzzle box and his body is resurrected from beneath the floorboards when his brother spills blood on the floor and he needs fresh blood from humans to grow skin on his resurrected body. Doug Bradley is good as the leader cenobite who comes out of the box and the other demon cenobites and evil helpers also rock. This is by far the best Hellraiser in the series and it's very gory more than anything and pretty dark. Andrew Robinson is also great as Kirsty's (Ashley Laurence) dad but I kind of feel sorry for him near the end as he's butchered and that's when the cenobites catch up with Frank Cotton. Excellent horror film and one of it's best in it's genre."
    },
    {
      "rating": "9",
      "text": "Horror ClassicWith frightening scares and a classic villain, Hellraiser is one that you should watch."
    },
    {
      "rating": "9",
      "text": "Hellraiser is one of my favorite horror movies ever. Pinhead is a true master villain of horror! I also enjoy Hellraiser 2-4, but I despise 5-10. Especially Revelations."
    },
    {
      "rating": "10",
      "text": "Moral in the story:Enemy's enemy is \"not\" a friend, trust those who are trustworthy."
    },
    {
      "rating": "10",
      "text": "Clive Barker's Hellraiser made in 1987 delivers darkness beyond imagination as a puzzle box is solved by a character named Frank Cotton (Sean Chapman) and then his flesh is savagely ripped apart by chains which appear from the puzzle box then we see a few characters walking around who came out of the box too,  the main one being Pinhead (Doug Bradley) who's leader of the cenobites who are these demon figures. A new family move into a house where Frank died in upstairs but unknown to the family, then Larry (Andrew Robinson) who's the father spills his blood on the floor upstairs after an accident and it resurrects Frank's (Sean Chapman) corpse into a living being and he needs dead victims to grow skin on his bone and become whole again... Ashley Laurence and Doug Bradley give good performances in the original and best Hellraiser in the series. A great horror movie classic."
    },
    {
      "rating": "9",
      "text": "Not the best quality blu-ray I've seen by a long shot. Still it looks better than the DVD. The surround is occasionally excellent but mostly unnoticeable. Sound is solid but not outstanding. This is the most creative amazing Hell-related horror ever. Not as scary as The Exorcist (1973) but it is more fun. The concept is fantastic and the execution is brilliant. The follow-up takes the concept further but subsequent sequels basically go to hell. I love this film! It is a brilliant ride that is perfectly paced with lots of hellish moments. The bit in the hospital still haunts me today. Something far more terrible than life could imagine. I love the progression, the anticipation and the hell demons. This has to be the best movie from hell. It is creepy, scary and one hellish ride!"
    },
    {
      "rating": "5",
      "text": "Some good scenes and ideas, but at the end pretty boring and bad played by actors"
    },
    {
      "rating": "7",
      "text": "Edgar Allan Poe meets H.P. Lovecraft in this first installment to the classic horror franchise, writer/director Clive Barker not only gives us the spine-tingling practical makeup and gore effects, but he gives us what makes every horror movie much, much better -- moral intrigue! For real though, the best horror movies (Poltergeist, Psycho, Friday The 13th, The Exorcist etc.) all have some sort of moral element in play that's as disquieting to the audience as it is fascinating. \"Hellraiser\" does this very well. And despite some undeniably dopey elements here and there, this is a very solid flick."
    },
    {
      "rating": "6",
      "text": "I've just seen this movie and I think that everything happens so fast, cenobites don´t have time to explain what are they doing or what´s happening with their universe, but at least this is something nice from the movie, whole time is a paradox; I think that visuals and costumes are unique and iconic."
    },
    {
      "rating": "6",
      "text": "Beh dai, non è male.Certo, è un pochino lento per quello che vuole dire, ed alcune scelte di design erano risibili, però ci sono moltissime cose che posso tranquillamente apprezzare, come gli effetti visivi, la caratterizzazione dei personaggi e il **** completo che è il finale del film.Consigliato? Magari una volta..."
    },
    {
      "rating": "7",
      "text": "Thanks to it's creative visuals, amazing effects and surprisingly engaging characters, Hellraiser overcomes its flaws and becomes a highly enjoyable gore-fest."
    },
    {
      "rating": "6",
      "text": "As a gross out video nasty type film, this is ok. It has its fairly gross out moments, with excessive blood loss and peoples skin being stretched and ripped to an extraordinary extent and so on. The plot I felt was a bit too thin on the ground - I got the main gist of it but I can't say I was perhaps as scared as I maybe might have been, if I'd fully understood the context of everything but then again, its probably not the kind of film to be entirely overly analysed to (pardon the pun) death and back, as it were.The plot is perhaps a little slow to build up but then maybe it's more like riding a rollercoaster, as you know there's going to be something quite visually shocking about to appear around the proverbial corner but you don't know precisely when. I was a bit frustrated somewhat towards the end, when the daughter appeared to have somehow escaped the hospital she'd been confined in. If your really into these kind of films then I suppose you'd likely quite enjoy aspects of it. I've tended to avoid slasher/overly gory horror films but I saw this film was recommended by a film review group called Wittertainment, so I thought I'd give it a go out of curiosity more than anything, I suppose. I felt that if it had been a bit less fantasy based, it may have been more scary.For what it is, it's an ok film but for me it wasn't an entirely memorable film. I wouldn't particularly recommend it, no."
    },
    {
      "rating": "7",
      "text": "This is a great horror film, the practical effects and gore are amazing same with the villains. My biggest problem is that I feel this film isn't as complete as the first Nightmare on Elm Street or Childs Play. I feel those movies did a much better job at setting up the killers and the universe."
    },
    {
      "rating": "7",
      "text": "I had heard of this movie and pinhead/the cenobites for 2 decades. Given infinite decades I never would of guessed with the actual plot was of this movie. All time great practical effects, all time bad 80s acting by the main performers."
    },
    {
      "rating": "10",
      "text": "It's crazy how this holds up after so long, but what was likely the initial complaint is now one of this movie's greatest strengths: the lack of plotting.  The \"story\" in this movie is pretty thin and simple, but that is because everything is subservient to the spectacle of horror and evil.  And what a spectacle!  Seriously this movie will stick with you for a long time, so settle in for true horror."
    },
    {
      "rating": "10",
      "text": "One of the best 80's horror movies in that epic decade of horror.  Very slow going, and it works perfectly in this one.  Not sure how the critic score is only a 56.  The newest movie is more of a 56 than this ever could be."
    },
    {
      "rating": "9",
      "text": "For me it's a classic! A genre-defining film. Sensational, visual development of a great book."
    },
    {
      "rating": "7",
      "text": "Husband and wife move into his family's old house but are unaware that his brother's dead essence is still there and needs people sacrificed so he can regain his physical form and fortunately for him, the wife is still in love with him enough to seduce lonely, mostly bald business men into coming into the house to be murdered...oh and there's a box and demons and stuff."
    },
    {
      "rating": "8",
      "text": "A cult of its kind, this film introduces one of the scariest characters in cinema, but beyond that it doesn't scare much. In the end it is a good level splatter with a very particular texture."
    },
    {
      "rating": "10",
      "text": "A gem classic horror genre that started it all with a bang! Enjoyed the Hellraiser original from 1987, a cult classic gem that everyone is buying to the horror community."
    },
    {
      "rating": "10",
      "text": "Easily among my top movies of all time. Doug Bradley gives the performance of a lifetime as the lead cenobite! The acting, sets, cinematography, and practical effects were all breathtaking when I first watched it and they still hold up today. It's simply just a cult classic, I love it!"
    }
  ]
}