{
  "id": 2781,
  "title": "Hellboy II: The Golden Army",
  "starring": [
    "Ron Perlman",
    "Selma Blair"
  ],
  "runtime": 120,
  "genre": [
    "Fantasy",
    "Action"
  ],
  "description": "Hellboy, his pyrokinetic girlfriend, Liz, and aquatic empath, Abe Sapien, face their biggest battle when an underworld elven prince plans to reclaim Earth for his magical kindred. Tired of living in the shadow of humans, Prince Nuada tries to awaken an ancient force of killing machines, the all-powerful Golden Army, to clear the way for fantasy creatures to roam free. Only Hellboy can stop the dark prince and prevent humanity's annihilation.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fGQAO4RgUzspO7L4u5KXirIn34s.jpg",
  "categories": {
    "plot": 5.948717948717949,
    "acting": 5.916666666666667,
    "ending": 5.428571428571429,
    "soundtrack": 3.0,
    "cinematography": 4.666666666666667,
    "familyFriendly": 6.0,
    "funny": 5.8,
    "action": 7.228571428571429
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Hellboy II doesn't just better its predecessor, it buries it. Guillermo Del Toro proves why it's better for everyone if he's left to do his own thing. The first Hellboy was extremely competent, but far from inspiring. Fresh from completing his dark fantasy masterpiece Pan's Labyrinth, Del Toro manages to inject the big red ape's second outing with some much needed energy and imagination. You'll never see another superhero film like this. It's a superhero film filled with such well-developed weird and wonderful characters who actually have something to say about you and I. It's got plenty of big set pieces, but does not fall into the trap most summer blockbusters do - it never becomes dominated by action, it's always about character. It's well-acted (particularly Luke Goss playing a sympathetic and complex villain and Seth MacFarlane and Jeffrey Tambor providing the comic relief), visually stunning (with nods to Pan) and emotionally heartfelt. It's not about a big red guy beating up fairies and trolls. Like all of Del Toro's work, its about people (whether black, white, blue or red) and relationships. Like Hellboy himself, it may look a little strange on the outside, but at the core it's a complex beast with nothing but good intentions."
    },
    {
      "rating": "4",
      "text": "In the wake of his magnificent Pan's Labyrinth, critics have draped Del Toro with the cloak of a faultless auteur who we have to appreciate to be worthy of our intellectual vanities. Hellboy II is retread and blase, boring and all-too familiar. Del Toro is sloughing through a look which he has been rehashing for a number of years, cribbing from one film to the next. What is most fatal to Hellboy II is the lack of any seriousness. Del Toro has his characters wallowing in lazy repartee and throwaway interactions so that they wont interfere with his first love, which - surprise, surrpise, - is his CGI-rendered fantasy universe."
    },
    {
      "rating": "7",
      "text": "I belive the movie was a C-. It wasn't as bad as i thought it would be but i was grossed out quiet a bit. there where some key elements like action, romance, awesome effects and a exciting ending. Over all its a fairly good movie but i've seen better."
    },
    {
      "rating": "7",
      "text": "Pretty awesome sequel, better than first in many ways but ending is massive anticlimax."
    },
    {
      "rating": "7",
      "text": "What I liked about this film was that it looked a lot better then the first film, The CGI sequences blend perfectly with the film. The acting was solid but I did not like Luke Goss and Anna Walton as leads (they played the prince and princess). The plot was decent but a little too generic as well but del Toro adds a few personal moments for his characters and it makes the film that much better. Its an improved sequel better then the first film."
    },
    {
      "rating": "7",
      "text": "Think of Hellboy II as Star Wars mixed with Hell. Yet, in a good way. Guillermo Del Toroâ"
    },
    {
      "rating": "8",
      "text": "A thrilling and fantastical return to the Bureau of Paranoramal Research and Defense, Hellboy II: The Golden Army is far less gothic than its predecessor and, in focusing more on the fantasy element, is a great improvement on its already strong first entry. Far more in Guillermo del Toro's wheelhouse as more of a fantastical fairy tale with fairies, elves, and children reading those very same fairy tales, Hellboy II: The Golden Army starts off with informing the audience about the war between humans and elves. Born with a hole in their heart that is filled with earthly possessions, humanity sought to wipe out every other being on Earth. The only ones standing in their way were the elves who raised a golden army that was indestructible. Destroying the humans in numbers that disturbed the Elf King, a truce was reached for the elves to stay in the forest with two pieces of the golden crown that controls the Golden Army and the humans to stay in the cities with one piece of the crown. However, when elvish Prince Nuada (Luke Goss) returns and is determined to raise the Golden Army to wipe out humanity, it is on Hellboy and the gang to save the world once again.Central to this work is the role of Hellboy and his other supernatural friends in this world of humanity. However, it is largely through the guise of exploring those who are different. In his work, Del Toro is known for exploring creativity, fairy tales, those with their heads in the clouds, and those who are different from others for these reasons - namely Pan's Labyrinth and now again in The Shape of Water, as examples - and here, in Hellboy II, he firmly establishes this group as one of outsiders. Hellboy is equated to Frankenstein's monster as the people accuse him of harming a child even though they can plainly see he did not. Abe Sapien is equated to the Creature from the Black Lagoon. Liz (Selma Blair) feels \"looked at\" and scrutinized due to her fire-based abilities. The trio feel excluded and like outsiders to the world around them, yet they fight for this world all the same. Though they feel rejected and like outcasts, their wish to fit in is one that overwhelms them. Yet, at the core of it all, is their belief that there should be no boundaries. Abe falls in love with the Elf Princess. Hellboy and Liz are in love. There is inter-species romance in the air and this eclectic group of weirdos embrace these differences. Though rejected by the humans, they nonetheless fight for them because they love their differences, respect them, and wish to protect them and their culture when it is under attack.It is for this same reason that Hellboy struggles to kill a god of the forest and, later, the dangerous elf Prince. Waging war on the humans to maintain their own culture, the elves' cause is one that Hellboy sympathizes with entirely. The prince plays on this sympathy and continuously tries to win him over to his side, warning that the humans will never accept him and his differences. Yet, to Hellboy and the others, the humans are not the ones waging war. Though they may, that is not their concern in the present. Rather, no matter what pull they feel to defend the elves, they must defend those that they are entrusted to protect and those that have remained peaceful to other species in recent times. In the end, for this bad of misfits, the most important thing is acceptance, peace, and understanding. Those who wage war must go as their anti-cultural beliefs are ones that do not gel with them - see the Nazis in the first film - and though they wish to fight for all cultures to remain, there is a line to not cross that the elves have very flippantly disregarded.In this regard, the film perfectly uses the \"end of the world\" trope that has often maligned superhero films in recent years. Though the elvish prince does wish to unleash the Golden Army on humanity that would certainly wipe them out, the film has it all make sense. Rather than some nonsensical plot where it becomes clear that the villain has nothing but blood lust, the backstory and development of the elvish prince allows us to understand his plight perfectly. As a result, he is a strong villain as though reject his actions, his reasoning and cause are ones that are rather noble. Viewing his father's actions as ones that have eliminated the elves from the world, he wishes to restore his culture as one to be proud of and one that instills great respect wherever it travels. His violent ways are not the right path, but his cause makes sense and his method of rectifying these wrongs make sense as well. In essence, it often doubles as a symbol of nuclear warfare. With certain destruction of the enemy when using the Golden Army, one must exercise great caution in using the weapon. Yet, as with the Americans and Soviets, the elvish prince is fighting for a way of life and a culture. He is willing to press the red button and unleash the army to do so. As a result, he must be stopped even if his"
    },
    {
      "rating": "8",
      "text": "Despite a dismally doom-laden plot, Del Toro's utterly breathtaking visuals and charm send this sequel soaring into the right direction."
    },
    {
      "rating": "7",
      "text": "With the upcoming release of his next action film: Pacific Rim, I decided to take it upon myself and watch some his movies (Guillermo Del toro). I already watched a few of his work already and liked  them; Hellboy and Pans labyrinth, and finally I watched this one. I was surely satisfied with what I got and I can safely say it's better than the last one. Not like Batman begins to Dark knight, no, just that this one has some improvements. We have most of the main cast returning, Hellboy himself is sill likeable; giving that tough dude attitude with a gentle heart. The fish man who gives a C3PO performance is funny at times, and it's nice how they try to dive into both of their lives a bit. Hellboy is having some relationship problems, and the fish man is discovering love for the first time. By far my favorite part of the film was the introduction to the ectoplasm doctor. He's so ridiculous looking, but is conveyed as both a bad ass, and a stone cold leader. The story does sound a bit familiar from the last movie, in the fact that there's an ancient evil, but here it's an ancient evil requiring an ancient power. I guess the other problem; if you can call it that, was that the plot was explained real early. It was described in a story that was being told to the main character, but if I think about, it sounds like an in joke. The action is okay. I would say the best fight is with the plant god, the sheer size of it makes (the fight) makes things more epic. Although I do think that the fights can be a bit sloppy, mainly the one with hellboy and Winx, it's too slow. Overall, this is a certainly entertaining film, and I am glad I got it on Blu-ray."
    },
    {
      "rating": "7",
      "text": "Fueled with tons of imagination, creative costume designs and an emotion filled storyline, Golden Army is a sequel that works on many levels, whether it's the story or impressive designs."
    },
    {
      "rating": "7",
      "text": "A solid sequel to the already good picture. The Golden Army digs deeper into the characters backgrounds and enchants audiences in great action and a good storyline."
    },
    {
      "rating": "7",
      "text": "Directing a sequel to a modestly successful comic-book adaptation might seem like a perverse choice to follow up an Oscar-winning international triumph like Pan's Labyrinth. But for Guillermo del Toro, directing the Hellboy movies is the opposite of slumming: His affection for the comic's motley gang of misfits is palpable in every scene. Del Toro makes movies fanboys love in part because he's such a fanboy himself. With Hellboy II: The Golden Army, del Toro proves his geek credentials once again by collaborating with Hellboy creator Mike Mignola on the story, hiring Family Guy creator Seth MacFarlane to voice a fantastical creature that looks like Robby The Robot's off-brand cousin and talks like Colonel Klink, and including a conspicuous homage to John Landis.\r Ron Perlman returns as the film's loveable title character, a demon gone good who's tough on the outside but tender underneath, with a soft spot for kittens, candy, and babies. With his formidable physique, cigars, giant guns, and winning way with a one-liner, he's part McBain-style action-hero parody, part Frankenstein-like outcast. Hellboy is the key ass-kicking component of a secret government paranormal squad that includes fiery girlfriend Selma Blair, a bright, cerebral chap (Doug Jones) who bears an unfortunate resemblance to the Creature From The Black Lagoon, the aforementioned MacFarlane-voiced German monstrosity, and hapless human sidekick Jeffrey Tambor. They're like the Ghostbusters if the Ghostbusters were phantasms and beasties themselves. In his latest adventure, Hellboy and the gang take on an otherworldly prince out to take over the world with the eponymous golden army.\r Hellboy 2 breezes along on the strength of Perlman's brawling charisma, a likeable tone, and a deft combination of goofball humor, pathos, and big action setpieces. It reaches sublime heights in three virtuoso sequences: a hilariously boozy Barry Manilow sing-along between the lovesick Perlman and Jones, a lyrical sequence where a giant tree monster becomes a leafy green paradise, and an eye-popping trip to a troll bazaar that recalls the canteen sequence in Star Wars and highlights the film's phenomenal, extensive creature design. Hellboy II can't help but feel slight following Pan's Labyrinth, but that's part of its charm. Think of it as a pleasant diversion for del Toro and his fans before the epic task of mounting The Hobbit for producer (and fellow geek-god) Peter Jackson."
    },
    {
      "rating": "8",
      "text": "This movie is actually pretty good but we need to get Ron Pearlman another Hellboy movie. Seriously, I don't want to find him comatose on the floor covered in red paint clutching an oversized foam pistol in one hand and wielding a painted hulk fist in the other. I really don't want to find him complete with fake devil horns and a red rubber hose taped to his butt."
    },
    {
      "rating": "9",
      "text": "Excels the previous with a catalogue of monsters and fantastic beings own of his inventive. The sequences of humor and action are well balanced and the final act develops for a third episode..., that never was (sadly)."
    },
    {
      "rating": "9",
      "text": "Looking back at 2008's comic book films, people remember The Dark Knight for taking the genre to new dramatic heights, and they remember Iron Man for kicking off the Marvel Cinematic Universe in an exciting way. Both great films that deserve all of the praise they receive, no doubt. However, another great film unfortunately got lost in the shuffle: Hellboy II.By trimming the fat, Hellboy II is an improvement over the first entry, allowing viewers to get totally sucked into the magical world in which its colorful characters exist. With even more heart and better action, Hellboy II is a delight from start to finish. It's unfortunate we'll never see the conclusion of Guillermo del Toro's Hellboy trilogy, but the first two films are something special, and absolutely deserve to be seen by those who missed them."
    },
    {
      "rating": "10",
      "text": "A pretty good sequel to the first one and a decent childhood memory to me.Though something that I kept wondering about was where was the human duce from the first one? I can't remember if the movie explains it but he wasn't really all that important anyway so I suppose it doesn't really matter.P.S Abe is still bae (I didn't have much to say other than that)"
    },
    {
      "rating": "7",
      "text": "\"Hellboy 2: The Golden Army\" is a prominent improvement of \"Hellboy\". With the obviously beautiful visuals, director Del Toro proceeds to actually contribute deeper into the plot and characters, resulting in one exhilarating film. A reasonable must-watch."
    },
    {
      "rating": "8",
      "text": "Guillermo del Toro's sequel to his 2004 comic-book-success is humorous, exciting and majestic as it explores a whole different realm of the Dark-Horse-adaptation. Ron Perlman once again gives a smart and distinct performance with laughable dialogue and action all around."
    },
    {
      "rating": "7",
      "text": "When was the last time you enjoyed a song in a commercial film, you will leave the screen humming, in love.Hellboy: The Golden ArmyDel Toro is good. Simply good. The writer and director, Guillermo Del Toro, is back on the franchise and smartly, the last time. After compromising aplenty in the first installment, Del Toro is set loose and a beat of his own drum in this chapter. And going full \"nerd\", if I can, he has sprinkled so much of mythology in this comic book world that he might as well had started from the scratch. And comes with theses fantasies, is one particular scene to drool over. And in here, similar to George Lucas's Star Wars cantina scene, Del Toro is flexing his muscles and opening the box that, I think, came from his basement in his house.He cannot hide his love. In fact, it is more intimate than The Shape Of Water itself, since there is more room in this world to roam about, he is sticking out branches with wit and guest appearances every now and then. He ups the ante on the previous chapter's questioned action sequences, with fast forward techniques and brilliant editing. But, that is not all. The sword fight might as well be distraction.Walk through a huge battle scene that comes in the middle of the film. His action isn't particularly action. It is a decision. Del Toro deciding to live up to the size of the banner and commercial cinema as they call it, and not compromising the art behind the razzle dazzle. And so is Ron Pearlman, put with the same decision making issue, a pivotal scene in the film and for the arc of the character. He isn't punching his way out of that antic, there is shame, depression, politics and ethics involved in that scene. Eradicating a problem isn't the problem, the problem is dealing with the aftermath result that takes a toll on him, on Hellboy."
    },
    {
      "rating": "10",
      "text": "This epic action fantasy is stunning to behold. Del Toro has sneakily crafted the Star Wars of fantasy, filled to the brim with delightfully imaginative eye candy, cool creatures, and plenty of action and humor. I consider this film a work of artistic genius, superior even to the first Hellboy, which was an amazing work in its own right. Anyone who wants to know what heights movies are really capable of should see this immediately."
    },
    {
      "rating": "3",
      "text": "This film is the long-awaited sequel to \"Hellboy\", based on a comic and made in the wake of the fashion of comic-based films that has been a trend in the movies. The film continues the story of the son of Lucifer who came to live among us and defends humans from the dangers of the supernatural world. In this film, he is eager to feel recognized for his efforts, but his work and his very existence remain secret. However, he will have to prevent a war between humans and beings from the supernatural world, who want to control the legendary Golden Army.The script is the weakness of this film. To begin with, the story told is so imaginative that it becomes absurd and difficult to swallow. There are several notable holes in the plot, which can be easily shattered if you think about it. The usual clichés in adventure blockbuster are quite evident as well. But even if we are willing to accept the story told as it is, there is a void of content behind all the visual style of Del Toro and all the CGI that millions of Hollywood can afford.The cast is good, much of it was inherited from the first film and does its job without blemish. Perlman is the highlight thanks to his talent and his chameleonic ability to transform himself into whatever he wants, film after film. The problem is that he brings little new to his character here, limiting himself to recycling the work done in the first film. Selma Blair has gained more visibility than she previously had and has done a positive job, especially when she plays with Perlman. Anna Walton is good enough but she doesn't have the space to do much. Doug Jones is a good joker able to do almost anything competently. John Alexander did a good performance too. On the other hand, Luke Goss is a villain who neither scares nor intimidates and Jeffrey Tambor has little to add to the film's positive. Finally, John Hurt's interesting cameo of honor.Technically, the film is superb. In fact, Del Toro is a master at loading his films with a unique and striking visual style. Personally, I highlight a cinematography that uses contrast, light and shadow, intense colors and urban landscapes, and the very careful characterization of supernatural characters. In fact, the film was even nominated for the Oscar for Best Characterization, which is quite fair. The sets and costumes, as well as the choice of filming locations, are not far behind. The visual, special and sound effects are superb, and the soundtrack is discreet, but contains an excellent version of the song \"Can't Smile Without You\". It is really a pity that the script did not follow all this technical quality."
    },
    {
      "rating": "5",
      "text": "This is a very easy movie to watch. The story is basically non-existent so you could fall asleep and still be aware of what's happening. The cg is good enough for me to not be taken out of the experience. The action was enjoyable enough."
    },
    {
      "rating": "10",
      "text": "A masterpiece of creativity. It is an amazing world that Del Toro created in this movie. The characters are fitting and the villain is not only well done but you can also fell his tortured soul and corrupted noble intentions. The plot is also off from simple good vs evil or black vs white. Both sides are grey with good intentions and flaws. It is a must watch movie and far better than the first one."
    },
    {
      "rating": "0",
      "text": "Ugh, what a terrible turd. Great characters, wonderful idea for a story line, terrible direction and acting. Seriously, it's so bad that I wonder how on earth they got the first Hellboy together - which, for the record, I loved."
    },
    {
      "rating": "6",
      "text": "Hellboy 2 starts off strong with a great opening. It's filled with cool looking fantasy creatures and great fight scenes. It also has a great plot. The humor though is not funny and completely kills any chance of this movie being truly great."
    },
    {
      "rating": "10",
      "text": "The better movie out of the 2 Hellboy 2 the golden army feels so much more Hellboy then the first film, even though i'm not entirely sure how its plot is related to the comic books, I found Hellboy 2 to be another great film that just felt so amazing and beautiful with great characters, great humor and Amazing action 10/10"
    },
    {
      "rating": "0",
      "text": "I was so bored and the acting wasn't to my taste. I did not like the visuals all that much."
    },
    {
      "rating": "10",
      "text": "Hellboy II is solid entertainment, but it’s a shame such blemishes prevent it from"
    },
    {
      "rating": "3",
      "text": "Apart from the visuals which were quite impressive as we've come to expect from Guillermo's films, this movie was a real let-down. The CGI was, for the most part, impressive and the design, make-up,and props etc. were great. I found some of the sets a bit dull and uninspired though. The action was adequate, exciting in places, but nowhere near as fast paced or exhilarating as many other films of the genre. Now on to the really bad stuff. I found most of the performances by the actors in the film to be fairly flat, even Ron Pearlman's. The muffled, sometimes barely audible dialogue was so cheesy and juvenile it was almost unbearable (apart from a few mildly amusing one-liners). The heartfelt moments in the film felt so contrived, I felt no connection with the characters whatsoever and really found myself cringing with embarrassment throughout many scenes. The movie had no real structure but was really just a bunch of scenes strung together and badly at that. I thought many of the scenes were also quite pointless and had gaping plot holes. Also, considering the plot of the film, I found it lacking any real moments of drama, or any grand, awe-inspiring set-pieces. Overall, a visually engaging but two dimensional film that will probably fail to touch audiences on any real emotional level which is what a great, even good movie should hope to do."
    },
    {
      "rating": "0",
      "text": "the book is the best. if you seen the first episode you will like the second episode. You can read it :konyv-konyvek.hu/index.php?q=hellboy_2_ordogot_a_falra"
    },
    {
      "rating": "6",
      "text": "While the first Hellboy was a funny well acted action movie, this is a mediocre poorly acted with bad jokes movie, I was highly disappointed it was not as good as the first, an ok movie from beginning to end."
    },
    {
      "rating": "4",
      "text": "I have to say this movie was very undone, and I feel as if there was no effort. The pace of the movie doesn't build up at all, its just random event after random event. There is like no sense in this, love plots are crowbarred in, and the end it doesn't even matter, the ending didn't even seem like the ending and when it came I was surprised. The humor isn't that great and there happens to be a character in this named Dr. Krauss who Hellboy hates for like the first half of the movie but then suddenly become best pals when Hellboy needs a cure. which just happens to be in the same place that the main villain is. Convenience. However, the movie does have good visuals, and the scene where Hellboy and Abe get drunk was funny, but honestly this movie is really bad. I don't give it a red score mostly because of Visuals ."
    },
    {
      "rating": "10",
      "text": "+Top tier production quality+Excellent cast+Very impressive screenplay-No sequel to watch after this!H2T Golden Army features a notably larger scale world for the now much more fleshed out characters to inhabit. Having come fresh from the original, the improvements in the production cost are immediately present along with the noticeable advances in CGI rendering here. It's tough to fully encapsulate in a meta review just how effective an improvement it is as a sequel but I would firmly place H2TGA into Aliens/T2/SW Empire Strikes Back territory. It is a crime against Hollywood the Del Toro Hellboy train stopped at this juncture!!"
    },
    {
      "rating": "8",
      "text": "Good summer fun. Not as enjoyable as Iron Man for my money, but still, visually a treat and the story is respectable. If you liked the first Hellboy, I'd imagine you'd like this one too. A good theater movie."
    },
    {
      "rating": "9",
      "text": "If you enjoyed the first one, you'll like this. Lots of action, crazy creatures and one menacing elf prince."
    },
    {
      "rating": "10",
      "text": "It's like the best parts of Men In Black,Lord of the Rings,Farscape, a Hong Kong wire work actioner,and a Tim Burton movie all rolled into one."
    },
    {
      "rating": "0",
      "text": "i hated it. the visuals were nice, but the story lacked a lot, and the transitions from event to event were horrible at best. the jokes were bad, the puns were sickening, the wit was anything but clever. Hellboy II strives for that satisfactory \"epic quest\" feel, but misses by miles, and merely achieves the status of \"clusterf*ck.\" do yourself a favor and buy the comic book; you'll get more bang for your buck. and what the hell was up with that opening scene? GAH!"
    },
    {
      "rating": "8",
      "text": "Hellboy (Ron Perlman) distrusts authority, is notably short-tempered at times, on other occasions is unduly worried about what people think of him, and he loves cigars, candy, cats and cerveza. In other words, Hellboy is not only MY kind of superhero but my kind of guy, and in as historically crowded a slate of superhero movies as 2008 has provided (the cleverly topical Iron Man, the surprisingly smart Incredible Hulk, the initially amusing but ultimately muddled Hancock, and the undeniably inteklligent and well-made but--excuse me while I duck!--overblown, overbaked and overlong The Dark Knight) his movie is absolutely the best of the bunch. Much of the credit goes, of course, to ther unbridled visual imagination of Guillermo del Toro, who brought us the original Hellboy and the astounding Pan's Labyrinth; Hellboy II hits the groiund running by setting up its literal underground-rebellion story in the first few minutes with a remarkable wooden-puppet show, and it never lets up afterwards as del Toro's and his crew's incredible creature effects not only wonderfully blend the inevitable CGI with good old fashioned old school craftsmanship and hard work but leap over the arbitrary species/ genus/ phylum boundaries set in most special-effects movies; heroes, villains and in-betweens include plants and, in the instance of oner memorable character, gases (the individual fitting this classification certainly ACTS like a gaseous substance through most of the movie, too). None of this would matter all that much, of course, if we didn't love the characters (and actors): Perlman's son of Satan who's now fighting for our side (even if our side doesn't duly appreciate him) is appealingly tough-and-tender; he's Bogart with a crablike arm and lobsterlike complexion. His flame-prone girlfriend Liz is played by Selma Blair, a sardonic beauty whose charm is largely generated by the observation that SHE (wrongly) doesn't consider herself very attractive. Best of all is Doug Jones (the superb pantomimist who in Pan's Labyrinth brought a whole new meaning to the term \"hand-eye coordination\") as Hellboy's semiaquatic sidekick Abraham; in the first Hellboy, del Toro had David Hyde Pierce supply Jones' voice, and I don't know why--nothing against good old Niles Crane, but Jones demonstrates here that he's perfectly capable of speaking for himself. This movie really scores in areas where last year's Spider-Man 3 was only partially successful; it's both a terrific action movie AND romantic comedy-drama. Hellboy II is all about the wildly operatic (especially when liquor-fueled) feelings we have for those we're in love with, and the grand sacrifices we're willing to make. All this leads to the current leading contender for The Best Movie Scene of 2008, as classical buff Abraham and rock-loving Hellboy express their feelings for (and frustrations about) the women in their lives by downing a few brewskis and baying along to Barry Manilow's \"Can't Smile Without You\". (By the way, isn't it interesting that while nobody will admit to liking Manilow, scores of movies--e.g., Keeping the Faith, You Me & Dupree, Can't Hardly Wait, etc.--repeatedly play or reference his hits?) This endearing and extremely funny sequence encapsulates why Hellboy II, a popcorn movie that values characterization as much as action, is much of a keeper as it is; it may not be a film for all time, like Pan's Labyrinth, but it's certainly the perfect superhero movie for THIS time."
    },
    {
      "rating": "8",
      "text": "This movie doesn't try to be anything else! It's fun and visually intensive!"
    },
    {
      "rating": "3",
      "text": "I must say first I really enjoyed the first Hellboy Movie. It had a great story, was well written and acted and had a lot of facets to it not seen in any similar films. Hellboy 2 Golden Army is an unfocused diatribe of cheesy one liners and naive action sequences that are sparse, short and poorly executed. The so story is a watered down homage to Tolkein with no real reason or purpose. We are told that theres an ancient civilization who once in time fought man, was about to conquer mankind but didn't and then they cower beneath the Earth while mankind who lost the war reigns supreme? Its really just a visual spectacle boasting a mish mash of any amount of fairy tale creatures designers could come up with. And I am sorry to say the story in all its absurdity seemed to be just an after thought. I wish I could give this a better review as I really enjoyed the first Hellboy but I can't tell a lie...bring on T4."
    },
    {
      "rating": "2",
      "text": "This movie completely a total laugh i don't get why people like it as well as they do (no offence), why did i not like this movie, because 1. In the first Hellboy you are only really given a few monsters he has fought and then suddenly we find out that there are loads of trolls about and a whole, totally different side of the world is shown to us in this movie 2. Professor Krauss is at first all mean to hellboy, bet then after that they are like best friends because of a unemotional sad scene when his family died 3. The movie was meant to be about the golden army, but it was more about Prince Nuadu vs Hellboy, they are only in one scene for like five minutes 4. How the prophet in the cave magically heals hellboy like a day after being stabbed, it was totally unreal and unthoughtful 5. The princess could have stopped Nuadu like way before by stabbing herself, but saving the world, she only decides to do that righ at the end 6. How Abe Sapien has a love life and suddenly wants o marry her and spend his life with her after a few hours of knowing her 7. if Prince Nuadu could have used the Elemental to kill everybody, when he could have blackmailed hids father to giving him the crown and the location of the golden army 8. It is not a tiny bit supicious when Professor Klauss becomes Hellboy"
    },
    {
      "rating": "8",
      "text": "I tell you what I thought Iron Man was good Hellboy 2 is way better than Iron Man you need to see this; this is the 2nd best supier hereo movie of the year (2nd to Dark KNIGHT) you will love hellboys personality!!!"
    },
    {
      "rating": "6",
      "text": "I found H2 to be rather disappointing. I feel Del Toro went a bit overboard with the effects and creatures. As a result, the story is much less believable and engaging than H1. And the voicing of Abe by Doug Jones was a real mistake. Also, Salma Blair was really quite wooden. A shame."
    },
    {
      "rating": "9",
      "text": "Guillermo del Toro rules! he'll never top Pan's Labyrinth but I'd never expect him to (or anyone else for that matter). I love the original Hellboy,and love this one even more! I think Hellboy 3 will become a reality but it's going to be 5 years before del Toro gets to it... The Hobbit films will take up a minimum of 4 years to complete."
    },
    {
      "rating": "10",
      "text": "A very original take on the superhero genre. Del Toro once again raises the bar for this antihero with dark humour and very charismatic sidekicks. A must see for the summer, specially for the action flick lovers."
    },
    {
      "rating": "6",
      "text": "There's lots of things to like about the film , but it seemed a bit long and was less than I expected.It's a better sequel than the Indiana Jones , but is that enough?"
    },
    {
      "rating": "10",
      "text": "A beautiful movie."
    },
    {
      "rating": "8",
      "text": "I thought Hellboy 2 was a decent movie. The highlight of the movie is easily the character designs, but it had other decent aspects as well. The acting was okay, but where I think the movie is most weak is in the plot. At times the plot got a little random and it seemed like Del Toro wanted to end the movie, so it remained at a reasonable viewing time. The movie is no Pan's Labyrinth, so don't go into it expecting that, but overall it was a decent summer movie. Oh, and I can't wait for The Hobbit."
    },
    {
      "rating": "6",
      "text": "This had the potential to be a great movie, but they dumbed it down by making it a parody of \"Men in Black\" at the beginning. It just got worse. If I wanted to see some guy with a sword, I would have watched Jet Li. This movie needed a good monster for Hell Boy to fight, but they just got some lame Jar Jar binks thing for comedic relief."
    },
    {
      "rating": "8",
      "text": "\"Hellboy II: The Golden Army\" is one of the better comic book adap-..., but I digress. Is it just me, but doesn't Prince Nuada and Princess Nuada(Luke Goss and Anna Walton) remind you of Angelina Jolie and her brother? I thought to myself, the deal is cinched if the Prince gets really, really chummy with his sister, then bingo, in the blue man's library, Nuada caresses Nuala's cheek as if there was a history between them. But I digress. Liz(Selma Blair) calls the red guy Red(Ron Perlman) because Hellboy sounds uncomfortably like a racial slur coming from the lips of the bigoted humans that these creatures encounter during their city patrols. Since Liz rechristened him, Red bears no connotation to the red guy's red skin. Red is a proper English name(i.e. Red Buttons, Red Skelton, heck, Redd Foxx, extra consonant notwithstanding), so the evocation of the color should be construed as being either ironical, or incidental, because Liz sees Red as a man, a good man, unlike the people they protect, who just see red. When the city denizens call him out in the streets, they're transforming hell, the place Hellboy hails from, into an expletive, as in \"oh, hell!\". But I digress. \"Hellboy II: The Golden Army\", more so than the three \"X-Men\" movies, calls into question the nature of these so-called superheroes. When Prince Nuada uses the h-word(\"holocaust\"), without a shadow of a doubt, the filmmaker is suggesting that Hellboy and his cohorts are human collaborators. The real hero is the prince. He's fighting the good fight for his kind, against his kind's oppressors, us. One of Abraham's aliases is the Angel of Death(Josef Mengele, hello?), which makes him sound like a Nazi. So do you see what this film is getting at? But I digress. \"Hellboy II: The Golden Army\" is one of the better comic book adapations you're likely to see this, and the upcoming, summers. It's not just for fanboys."
    }
  ]
}