{
  "id": 2314,
  "title": "Hellboy",
  "starring": [
    "David Harbour",
    "Milla Jovovich"
  ],
  "runtime": 121,
  "genre": [
    "Fantasy",
    "Horror",
    "Action",
    "Adventure"
  ],
  "description": "Hellboy comes to England, where he must defeat Nimue, Merlin's consort and the Blood Queen. But their battle will bring about the end of the world, a fate he desperately tries to turn away.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bk8LyaMqUtaQ9hUShuvFznQYQKR.jpg",
  "categories": {
    "plot": 6.96875,
    "acting": 6.818181818181818,
    "ending": 6.444444444444445,
    "soundtrack": 7.0,
    "cinematography": 6.666666666666667,
    "familyFriendly": 3.0,
    "funny": 7.6,
    "action": 7.185185185185185
  },
  "reviews": [
    {
      "rating": "8",
      "text": "With an amiable lead performance from Ron Perlman and some truly phenomenal visuals, \"Hellboy\" proves to be an extremely engaging cinematic experience."
    },
    {
      "rating": "8",
      "text": "When discussing turn-of-the-century comic book movies, the likes of Spider-Man 2 and X-Men 2 are always mentioned among the best. But there's one movie that many seem to forget: Hellboy. Director Guillermo del Toro took all the lessons he had learned from his smaller Spanish-language films and his English-language crowd-pleasers, then smashed them together, and the results are magical.Part fairy tale fantasy and part traditional superhero movie, Hellboy delivers a menagerie of colorful characters portrayed by a wonderful cast. These characters live a strange and mystical world, brought to life brilliantly by del Toro's masterful eye. The set design is superb, and the imagery is simply stunning. Of course, there's some truly thrilling action as well. If Hellboy passed under your radar, I can't recommend checking it out enough."
    },
    {
      "rating": "1",
      "text": "Jesus this movie was so **** a lot of people pointed out that if you’re a fan of the comics you’ll like this movie, I guess that’s the only thing this movie has going for it because I’ve never read a comic and the movie was utter garbage. I was so excited to watch bellboy for the first time, up until now I’d heard nothing but good things but wow was that such a disappointment. The writing was corny, the plot was bland and cliche, the characters and their performances were forgettable, and oh god the acting. Especially the main girl of the movie, I don’t think I’ve ever seen an actor as bad as her. Would give it a zero if it wasn’t for the fact he looks badass smoking a cig when they first introduced him."
    },
    {
      "rating": "0",
      "text": "Utter pap! The acting was so wooden it was unbelievable!"
    },
    {
      "rating": "7",
      "text": "Almost as if it is Del Toro's origin tale, genuinely moving and freakishly stylish.HellboyDel Toro is having a fanboy moment. For two straight hours. The writer and director, Guillermo Del Toro makes sure he passes on his love with a hope that someone will be moved equally by these rich characters just as he did. What is it when someone else tries to make an origin story of an infamous action figure or a comic book hero, it collapses. But when Del Toro does it. It is simply spectacular. It is probably the arrangement of the figure that he puts in front of us. His passion is irreplaceable. And with the mythological knowledge that he has, he might as well be crafting a sin in front of you and you wouldn't know the difference.His film, looking at the formulaic structure of it, has a tendency to be a B grade average action film any day. But with command over the editing, visual, production, sound and his own department, he changes the course of the feature. It is incredibly difficult to say something about a film that is so textbook originated. The authenticity is its identity, there is very little room to devour ideas as a viewer. He doesn't let go off that nature versus nurture theme. If he could get a word in every scene of the film, he makes sure he gets the voice heard.He is quite persistent like that. Isn't afraid of repetition, if anything, he carves it out as an emotional response, claims it as a part of being a human. The film isn't a feat of great performance. Don't get me wrong, the cast has done an excellent work. But the film is of such a stature that it can only be seen with all the ingredients, in its entirety, in its true sense, it is a collaboration of number of artists working on Hellboy, he who is the key to unlock Del Toro's tantrum on those comic books."
    },
    {
      "rating": "0",
      "text": "Hellboy is as much a wreck as “The League of Extraordinary Gentlemen” or “The"
    },
    {
      "rating": "10",
      "text": "Hellboy: 10 out of 10: Hellboy is one of the three best comic book adaptations of the last ten years. Now considering the recent spate of mediocre comic book adaptations this is a bit like winning a beauty contest at a fat farm. Hellboy is simply head and shoulders above those.\r It is on par with the recent Spiderman movies (Hellboy sports a better hero and better CGI effects while Spiderman takes the nod in the love interest and villains categories) better than the X-men films and simply puts other comic book adaptations to shame (League of Extraordinary Gentleman should be particularly embarrassed)\r Hellboy starts with a rip-off of one of the last scenes in Raiders of the Lost Ark and introduces such horrible clichéd villains as Nazi babe and Rasputin. Yet the scene works. Director Guillermo del Toro nails a comic book style to the direction that keeps the action and humor going during the most implausible circumstances. Another kudos is in order for the special effects, both make-up (which is spot on) and CGI. Now I seem to hate most CGI effects.\r Many a big-budget Hollywood film has come out recently with horrible special effects that stick out despite 50 million plus budgets. Hellboy's effects are simply seamless where one forgets that entire characters and locations are digitally generated. The acting is also seamless with lead Ron Perlman giving a scene stealing cigar chomping performance that rivals Daniel Day Lewis's turn in Gangs of New York and Jeffrey Tambor turning a stock cliché (obstructionist bureaucrat who wants to shut everything down) into a humanistic sympathetic character. (This is also an example of very smart writing that makes even the clichéd characters into three-dimensional figures.)\r While all is not perfect (In addition to Nazi Chick and Rasputin we also have a Clock/Sand Nazi and a Space Cthulhu as an improbable villains) Hellboy is better than an action movie should be, much better than a comic book adaptation ought to be, and immeasurable better than a movie called Hellboy deserves to be."
    },
    {
      "rating": "8",
      "text": "Sci-fi/fantasy extravaganza is a labor of love for helmer Guillermo del Toro, and acknowledged comic buff. Based on Mike Mignola's cult-fave comic series, pic has more than enough across-the-board appeal to attract mainstream auds unfamiliar with source material.\r Inspired primarily by “Seed of Destruction,” Mignola’s first “Hellboy” story cycle, and “The Corpse,” a later tale recently reissued by Dark Horse, del Toro’s scenario occasionally echoes “Men in Black,” “X-Men,” del Toro’s own “Mimic” — and more than a few classic tales by horror writer H.P. Lovecraft.\r Effective blood-and-thunder prologue set during WWII introduces Trevor “Broom” Bruttenholm (initially played by Kevin Trainor) as a supernatural expert for Bureau of Paranormal Research and Defense, a super-secret U.S. organization dedicated to battling German efforts to wage war with black magic.\r On a dark, stormy night in Scotland, Broom and an Army commando unit interrupt curiously undead Grigori Rasputin (Karel Roden) as the infamous Russian mystic leads Nazi scientists and soldiers in an effort to use a “Hell-Hole Generator” to transport Ogdru Jahad (a.k.a., Seven Gods of Chaos) to Earth. A gun battle, the pic’s first spectacular set piece, ensues. After the battle, Rasputin disappears with two key associates — Kroenen (Ladislav Beran), masked and blade-wielding immortal, and Ilsa (Bridget Hodson), icy blond beauty. But Broom and commandos find the generator did manage to transport a surprise package: A bright red imp festooned with horns and a pointed tail. Broom names the foundling Hellboy.\r Sixty-plus years later, anailing, aging Broom (John Hurt) is still aligned with Bureau of Paranormal Research and Defense, and is still serving as surrogate father to Hellboy (Ron Perlman). Latter has grown into a massive and muscular figure with a misshapen right hand (credit Rick Baker for spot-on Hellboy makeup).\r Big guy smokes cigars, gobbles Baby Ruths and speaks in the terse, tough-guy argot of a film noir hero. But he keeps his horns filed downso the stubs resemble a pair of goggles pushed onto his forehead.\r Hellboy lives with Broom at BPRD headquarters in Newark, N.J., usually venturing out only to aid in investigation and destruction of paranormal threats. Occasionally, however, he takes unauthorized trips into the outside world, causing “Hellboy sightings” that must be explained away by government spokesperson — and, secretly, BPRD supervisor — Tom Manning (Jeffrey Tambor).\r Lately, Hellboy has repeatedly gone AWOL to reconnect with sad-eyed Liz Sherman (Selma Blair), who fled BPRD and committed herself to a mental hospital because she fears she can no longer control her fire-spreading, pyrokinetic powers. H.B. loves her, of course, but duty calls. Along with fellow BPRD regular Abe Sapien (played by Doug Jones, amusingly voiced by unbilled David Hyde Piece), a scaly and telepathic “gill man” who thrives underwater, H.B. joins Broom and other agents at a Manhattan museum where an immense monster is wreaking havoc. The monster, Sammael(Brian Steele), a well-nigh indestructible beast, resembles the love child of “Alien” and an octopus. Sammael and its spawn are controlled by the newly revived Rasputin.\r Pointedly disdaining the current craze for wire work and martial artistry in movie mayhem, del Toro provides an abundance of two-fisted, straight-shooting action throughout “Hellboy.” Title character’s dust-ups with Sammael and other icky creeps are at once rousingly exciting and explosively funny, often playing like oversized smackdowns between WWE superstars.\r However, del Toro isn’t always attentive to coherent transitions while warp-speeding through his storyline. Worse, he occasionally neglects to prepare uninitiated auds with context from the comic books.\r Well-cast thesps generate rooting interest in their individual characters, thereby propelling plot momentum through sheer force of their colorful personalities. Del Toro provides nifty quirks and eccentricities for characters: Edgy relationship between Hellboy and Manning (well played by Tambor) builds toward amusing pay-off. Ultimately, on-screen actors (and unseen Pierce) prove to be pic’s most important special effects.\r Perlman is terrifically boisterous and literally larger than life in title role, yet also elicits sympathy. In this, he is immeasurably aided by Hurt, who’s genuinely poignant in his relationship with Broom’s “son.”\r Blair offers a career-best performance as Liz, conveying a wealth of mixed emotions with each wanly melancholy smile. Newcomer Rupert Evans is engagingly game as John Myers, a young FBI agent. Production designers and f/x supervisors are fantastically impressive in their rendering of del Toro’s darkly imaginative take on “Hellboy” mythos."
    },
    {
      "rating": "6",
      "text": "Guillermo Del Toro's \"Hellboy\" isn't exactly a balanced movie; it kinda sides with the friendly side, which results in less action sequences than you think. Nevertheless, its still a visually great film to watch."
    },
    {
      "rating": "0",
      "text": "I found it so corny and generic. I am kind of sorry to write this but it is how I feel. I didn't like it though I can see how others would."
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■●$$$$$$$$$$$$$$$$$$$$$$$$$$$$%&%&%&%&%&%&%&%&%&%&%&%&%&%&"
    },
    {
      "rating": "6",
      "text": "\"Hellboy\", you must admit, is a unique movie that feels like a comic book movie, but it isn't based on it. This movie has energy and is dark and thrilling. The dialogue, however, in the film is pretty bad at times. Overall, after watching this film, I wasn't disappointed with it, but I wasn't very pleased with it either."
    },
    {
      "rating": "8",
      "text": "Based on the superhero by Mike Mignola for Dark Horse Comics, this movie brings the absolute reason why hell should be imposed to come out at any second from now."
    },
    {
      "rating": "6",
      "text": "Much like the Punisher, Hellboy was created for the older comic book fans. The character was designed to be an anti-hero, less refined than Batman or Superman, someone who would hate being labeled a superhero. While the comics weren't as popular as others, the film gave life to the franchise and created a cult following. The story is meant to introduce us to the character of Hellboy, a cat loving, cigar smoking, red guy, with a bad attitude, who secretly works for the government protecting The United States from paranormal threats. Everyone knows by now that I hate superheroes, so the idea of the anti-hero really appealed to me. I could have easily become one of the cult followers and fallen for Hellboy, the way all the comic-con kids did, if it wasn't for the uncertain direction of the film. Guillermo Del Toro struggled back and fourth with whether or not this film should be geared for kids or adults, and went the PG-13 route. It worked in terms of getting a larger audience, but it also took away from the original intent of the character. Throughout the film we keep hearing about how tough and dangerous Hellboy is, but he's really wasn't that much of a bad ass. If Hellboy is so unlike any hero, why is he working for government instead of breaking the law, and why is it that he doesn't utter a single curse word? The character was far too toned down for my liking, but the flip-side to that was how nasty and creepy some of the bad guys were. Broom is one of the best comic villains I've ever seen and given his Nazi background, he most certainly was not intended for kids. Overall, I enjoyed parts of the film, I loved Ron Perlman, and as with any film by Guillermo Del Toro, the special effects were amazing. However, the lack of direction makes the film somewhat unfulfilling and anti-climatic. Hopefully that will all change when I get up to Hellboy II."
    },
    {
      "rating": "0",
      "text": "I tagged along with two friends who wanted to see this. I apologized for laughing. Then they too started laughing. Then we walked out. The ticket guy asked how the movie was and i farted."
    },
    {
      "rating": "5",
      "text": "When at the end of world war II desperate Nazis succeed to pry open a portal to Hell in yet another attempt of many to stave off  total defeat they get interrupted by the American army. Before the door closes again 'something'  comes through though: the infant devil Hellboy . Even in Hell they have a reproduction.\r We fast forward to the 21st century where the suspension of disbelieve is stretched to snapping point when Ron Perlman, playing the now massive Hellboy  at the age of fifty is described to be roughly twenty years of age by his 'dad' Professor something, played by an aged John Hurt. Even all the heavy red makeup tossed upon Perlman can't hide that he doesn't.\r Hellboy is certainly fun whenever something is done the first time around. Like when Hellboy draws that gigantic handgun of his to fire massive bullets at a creature that comes straight out the Cthulhu mythos.  Ah well it is funny several times after that. Or  when he slams a car with his oversized right hand to make it spin overhead.\r We also have Selma Blair looking cute with her face drawn of color and wrinkles under her eyes, but otherwise her role is solely to be an object of desire.  We do get a scene where she actually wipes out  some creatures, but besides this token martial act she just walks around to give Perlman something to worry and moan about.\r Logic is the first to die in the movie. It doesn't really matter much apparently for the bad guys have no motive besides the desire to destroy the world by arranging access to Earth for the Ancient Ones.. eh make that Lords of Chaos as they are called in this tale. At some point sense is totally abandoned to the four winds as the deadly nazi assassin attempts to slice up Hellboy while the whole idea is to force Hellboy into opening the portal to whatever place them lords are hanging out by threatening to kill his love interest.. So why kill the one you need to open that door? Because it makes for a cool fighting scene.\r The movie keeps stuff to a certain entertainment level, but in the end it has shot its bolt. Hellboy is funny for a while and Perlman has a kind of charm that makes you thaw to him, but eventually the movie gets tedious and I am glad it is done . Hellyboy is like the Hulk or any other of those stereotypical hulking marvel comics dudes: as thin as paper.\r I heard there might be a third movie planned.  I think two is more than enough for me. Hellboy has outlasted it's entertainment value and has nothing else to bring to the table. Next!"
    },
    {
      "rating": "7",
      "text": "Sporting a great quantity of keen visuals and impressive costume designs, Del Toro's comic adaptation manages to astonish with its unique style and appealing characters."
    },
    {
      "rating": "6",
      "text": "Hellboy spits fire.\rA very unlikely hero from another dimension, amazingly ends up being a pretty solid overall film. A very humanizing tale on and otherwise other worldly creature, and a collection of good action sequences make this more than just your average super."
    },
    {
      "rating": "7",
      "text": "+Great production design+Fantastic cast deliver memorable performances+Excellent cinematography-Sluggish pacing in the edit-Focus on exposition makes screenplay feel slowDel Toro and the crew deliver a fantastic ride in 2004's Hellboy. For sheer cinematic beauty it looks great in 4k HDR. Some of the more outlandish CGI sequences show their age in 2019, but the practical effects look incredible. The world is just so interesting to experience with some haunting moments that feel almost as if to nudge genres from action adventure to horror/thriller... The talented cast deliver memorable performances here and every penny of ther production budget is on the screen and then some! Exposition heavy screenplay and strange editing choices make Hellboy seem more bloated and slow when directly compared to the  very impressive sequel."
    },
    {
      "rating": "7",
      "text": "Hellboy is an amazing thrill ride. Not only was it great to pick Ron Perlman, it was great to make this movie. The plot was fun, the effects and music were great, and the fish guy was awesome. My only tiff is sometimes the effects were cheesy. But if you can deal with that youll love this movie."
    },
    {
      "rating": "6",
      "text": "This movie has some cool action scenes and is surely especially fun to watch for comic book geeks (I had no prior knowledge of Hellboy, though). The story isn't bad, either, but the dialogue isn't the best and, in reality, it just isn't all that entertaining. I'm saying you should watch this film if you think it looks interesting but you shouldn't expect anything outstanding, just a decent action flick."
    },
    {
      "rating": "6",
      "text": "Nothing impressive to me. Was an interesting movie, but quite bland and felt like it could've been much better. Maybe because I watched it now only and it could've been better if watched just when came out."
    },
    {
      "rating": "7",
      "text": "Like superheroes from Spider-Man down to the Blue Beetle, Hellboy looks like he could have no other name. What else could you call a being with bright-red fireproof skin and a pointy tail? Only the horns are missing, and that's because—according to one character in Hellboy, the new adaptation of Mike Mignola's comic book—he files them off \"to fit in.\" Found 60 years ago by soldiers breaking up a mystic Nazi ritual, Hellboy now works alongside other well-intentioned freaks in the Bureau of Paranormal Research and Defense. He's a demon from another dimension, but he's all-American at heart.\r Hellboy is a great character, and he's brought to life with gruff tenderness by Ron Perlman, the go-to actor for finding the humanity in oversized creatures: The list of actors who could make high drama out of fighting a monster with one hand while holding a crate full of kittens in the other remains pretty short. But the film around Perlman never quite finds its footing. Writer-director Guillermo del Toro recently created a mood of sustained, meaningful dread in The Devil's Backbone and turned Blade II into an exercise in unrelenting action. He's versatile, but he can't seem to make up his mind about what kind of film he wants to make. Hellboy uneasily mixes Men In Black-style gags with straight-faced drama, which mostly revolves around Selma Blair as a woman with an unfortunate tendency to burst into flames.\r Hellboy feels more at ease when it errs on the side of comedy, throwing in gags about Perlman's love of pancakes and cats, letting him fill the floor with discarded love notes to Blair, and giving him a grumpy talking skeleton as a sidekick. It looks great, too—it loses Mignola's woodcut-inspired art, of course, but stays true to the world of the comic.\r Too bad the story and, more surprisingly, the action never come alive. The villains, even a reincarnated Rasputin, don't pack much menace, and the fight scenes mistake busy for thrilling. With its oddly charming setup and weirdly appealing characters, Hellboy is pretty much impossible not to like a little, but it's also hard to like a lot. There's a fantastic film to be made from this material, but now, the burden of making it falls to a sequel."
    },
    {
      "rating": "8",
      "text": "Awesome movie! Effects were awesome and Red was a badass! And the most important: no cgi stuff! What else can l say? I liked it a lot."
    },
    {
      "rating": "7",
      "text": "Lovely HellBoy , He loves cat. I really love his character. Good acting...."
    },
    {
      "rating": "7",
      "text": "Sigue siendo una pasada aún a día de hoy. Una de las mejores adaptaciones de cómic al cine de la historia. Divertida y grotesca."
    },
    {
      "rating": "9",
      "text": "I loved this movie. It was entertaining and well-paced. One thing that I liked about this movie was it didn't have unnecessary scenes or unnecessary stretching.Pearlman played the role of Hellboy very nicely. All of the other significant characters are equally well-presented by their respective actors.The movie moved well, didn't get stalled anywhere, and both the action and drama were moderated with smooth transitions between each.Overall, I would recommend this movie to everyone. You will surely love it."
    },
    {
      "rating": "9",
      "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°@;@;@;@;@;@;@;@;@;@;@;@;@;@;@::@@;@;@:@:@;@;:@;@;@;@;@;@;"
    },
    {
      "rating": "9",
      "text": "++++++++++++÷÷÷÷÷×××××××+++++++++++÷÷÷÷÷÷÷÷++++++÷÷÷÷+++■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "10",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡********************************************************"
    },
    {
      "rating": "9",
      "text": "Finally a superhero with an attitude, a narsistic habit and a few addictions. Got to love it...In my opinion a great and entertaining movie. The storyline is somewhat a lot for one movie (in the line of 'League of XO Gentleman' and 'Van Helsing'). But apart from that, this movie looks good: great special effects and eye for detail. Sets the right atmosphere: spooky, occult. And hits the spot with the right amount of (black) humor.I think it's the best superhero movie till this moment. Because the superhero is more human than all the others, despite his appearance (very big and very eh... red). This is a superhero with a hangover and he doesn't care."
    },
    {
      "rating": "9",
      "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"
    },
    {
      "rating": "8",
      "text": "An enjoyable adventure flick. Not perfect, but definitely the most entertaining theatre excursion so far this year."
    },
    {
      "rating": "9",
      "text": "Good adaptation of an awesome graphic novel."
    },
    {
      "rating": "9",
      "text": "To not be charmed or entertained by this film would require either a heart of stone or an utter lack of taste in entertainment. It does an excellent job of creating a comic book feel and look, and Ron Perlman's hellboy is more than likable enough to carry multiple films. So what if the plot can be a bit hard to follow at times. Since when did that matter much for a comic book film?"
    },
    {
      "rating": "8",
      "text": "As much as the acting and writing could have been improved, Del Toro still brought us the best looking monsters i've ever seen in a movie. And that's no mean feet."
    },
    {
      "rating": "7",
      "text": "Nazis open evil portal helped by evil monk, hellboy arrives, US troops shut portal, 60 years later, Hellboy works for Government, evil monk returns..Slightly better than average superhero picture with some decent effects & good action scenes let down by awkward story telling.Ron Perlman is pretty good in the lead despite the cliched dialogue & the 107 year old Nazi assassin is a right nasty piece of work."
    },
    {
      "rating": "9",
      "text": "A truly enjoyable movie, while it borrows some elements from Wolfenstien like Germans opening a portal to hell during WWII, and a top secret government paranormal defence agency, but the unique science fiction plot will have you hooked, a blast to watch with great action and humor, truly enjoyable."
    },
    {
      "rating": "5",
      "text": "Hellboy is a well designed, visually appealing comic book movie from Guillermo Del Toro. Unfortunately, thin plotting and the lack of any decent action sequences scupper any good intentions. Hellboy is ultimately forgettable super-hero fodder."
    },
    {
      "rating": "8",
      "text": "I had heard of Hellboy before, but had never read a single comic, but when that first magnificent trailer came out, I was looking forward to this one big time.  It just had a fantastic look to it and once I finally saw it, it also had a good story to go with that look.  Ron Perlman is Hellboy, fantastic casting in this situation.  Guillermo Del Toro has a very unique look to his films that are inventive and magnificent.  It was funny, engrossing, the cinematography was excellent (Hellboy against a snowy backdrop looks awesome!) and its pace was great.  Most like the sequel better, but while it was a great sequel, for me it didnâ"
    },
    {
      "rating": "7",
      "text": "This is a pretty darn cool movie with good acting, writing and design. Good fun."
    },
    {
      "rating": "6",
      "text": "I enjoyed the film to a certain point and when I asked myself (at the end) how I managed to sit through this rather stupid film. The entire plot (while interesting at first) was incredibly stupid, Even for comic book movie standards. The main cast was good for the most part. Ron Perlman was perfect for Hellboy and was an outstanding lead and the rest of the cast was good except for Karl Roden, He was a terrible villian and ruined the film with his horrible acting imo.\r The action was good and it did a good job blending the CGI/Animated sequences with the real life ones. Guillermo del Toro is a great director and Hellboy was a passion project for him but was it wise to make this movie? I cant say yes or no. It was a solid film and worth the watch if you can get through it."
    },
    {
      "rating": "7",
      "text": "Man, these superhero movies have always been the same, eh? Even in 2004, terrific director Guillermo del Toro turns out just another superhero movie that follows the hero's journey throughout and has a horrible boring white male sidekick. Fortunately, Del Toro is such an impressive director, his stylistic inclinations rise above the tame and boring superhero material he is given in this film. Gothic with great mythology behind it, Hellboy is a compelling film with great visual effects and remains constantly engaging and compelling thanks to Del Toro and a stellar lead performance by Ron Perlman as the Nazi-summoned demon good guy. Unfortunately, the film is still derided by its lame and predictable story.Opening in terrific fashion with Hellboy being summoned, his rescue, and then the introduction to the Paranormal Bureau headed by Trevor Broom (John Hurt), Del Toro manages to create great scope to the film. While it devolves into typical end of the world fare later on, the opening half hour with Hellboy fighting the hellhound in the museum and the introduction and usage of Abe Sapien is tremendous. If the entire film was just Hellboy and Abe Sapien kicking butt, I would have loved this film. But, instead, every comic book superhero movie must devolve into being a \"save the world\" hero's journey and end up with lame fight scenes between our hero and the big bad guy. This makes the film feel incredibly stale, even if if was one of the first of the wave of superhero movies we have gotten in the 21st century. It bears all the lame and tame marks that continue to deride the genre as it feels sterilized and overly restrained from going in more interesting directions with its story. Instead, Hellboy was merely one of the first films that showed superheroes could be compressed into the hero's journey, regardless of who they are, and the film will turn out pretty good. If this came out next year, it would be an unchanged film and fit into the current trend just fine.That said, Del Toro's gothic style and influence is all over this film with gorgeous shadowy locals and castles. This infuses the film with his visual style, which was always going to be a very, very good thing. The film greatly benefits from this, often rising above its superhero cliches. The gorgeous cinematography and awesome visual effects also play a role, especially when Liz Sherman (Selma Blair) is on fire. The shot of her and Hellboy kissing at the end with both enveloped in flame is terrific and a great lasting image from this film. Along with the poetic dialogue accompanying this final sequence, the finale - even in spite of the asinine fight scenes - is stellar and why I tune in no matter what Del Toro is attached to and directs. The film also suffers from Generic White Male Actor #7 and his large role in the film. He really adds nothing but bland dialogue, bland looks, bland stares, and bland communication. Compared to the lively and fully game Perlman and the always impeccable John Hurt, Rupert Evans is just so damn lame. I have no idea why del Toro added him in when the film was just fine without his addition. To paint him as a sort of \"knight\" and hero in his own right was borderline comical as well. If this were from a lesser director, having an audience surrogate this bad with bland action could be the final nail in the coffin. Fortunately, Del Toro elicits such good performances from the rest of the cast that the acting, on the whole, is quite good. Put together with great visuals, there is still a lot to like about Hellboy and that is likely why it has remained so popular.Given scope and purpose, Hellboy feels tremendous in the first half. Unfortunately, it gives way to the hero's journey trappings of its story, which makes it nothing more than yet another superhero movie. Fortunately, the acting is so good and Del Toro is so talented, Hellboy still manages to be a riveting and truly engaging superhero movie that shows off just what can happen when talented people make a superhero movie. That said, if talented people could steer clear of this crap material in the future, it would be much appreciated."
    },
    {
      "rating": "5",
      "text": "It's got some good qualities, but it's got some bad ones too. Hellboy is scattershot, but it delivers the visuals, and everyone who worked the make-up for this comic-book flick deserves a medal, or maybe an Oscar."
    },
    {
      "rating": "7",
      "text": "Came to review after Hellboy reboot 2019 version (oh boy that is rough one to review). Honestly, movie did not hold up as well as I hoped, after 15 years, but it does not mean I did not enjoy it. The pace was good, I remember as a kid I loved it, it was different kind of movie than I used to. If I reviewed this 15 years ago I would give 10/10 but let's be honest, it's 7/10 for me. My ratings go: 0-3 bad, 4-6 mediocre, 7-9 great and 10/10 mastapiece. So yes, this is great movie, some costumes and design choices are amazing even for today's standards. Villain of course, sucks though."
    },
    {
      "rating": "8",
      "text": "I wouldn't put it on a Best Movies Ever list but it's still a fun, enjoyable movie. At least it stays true to the source material (I think the casting was spot-on in this case)."
    },
    {
      "rating": "9",
      "text": "The early experience of Guillermo del Toro into the superhero universe mixes wisely, resourseful, the character created by Mike Mignola and the mytology of H. P. Lovecraft; all that includes witty doses of humor and action."
    },
    {
      "rating": "7",
      "text": "A supernatural superhero versus supernatural bad guys in modern day times. Didn't know what to expect with this one and kind of enjoyed it for it's oddness and weirdness."
    },
    {
      "rating": "5",
      "text": "This movie is the film adaptation of the comic with the same name, and tells the story of a creature from another dimension, with demonic appearance, which was found by US troops on a special mission in Scotland, designed to neutralize the efforts of German occultists to mobilize magical forces for World War II. With direction and script by Guillermo del Toro's, it has a cast headed by Ron Perlman, John Hurt, Selma Blair, Karel Roden and Doug Jones.I was never a fan of films made from comics as it's a kind of film full of graphics normally seen in this kind of literature. For me, film is film, and a comic is a comic. This movie positively surprised me as it moves away from the graphic look of the comic- books, bringing the story to a more realistic scenario. The theme of the story, hanging around the magical and occult, it's also interesting and appealing. An ancient philosopher, who I don't remember the name, said that hell was more appealing than the sky because it's more mysterious, and he had some reason. The script was well thought out, blending action, romance and adventure in perfect doses. The cast also fulfilled well it's role but it wasn't particularly surprising. The special, visual and sound effects are excellent and do a good job, as the scenarios. The soundtrack, despite the good performance, not surprised also. In fact, what is most lacking in this film is precisely the element of surprise. It's a constantly warm film, never robbing us that emotion or shock feeling. Maybe if the script had been thought differently... The highlight of the film, in the end, can be really touching, which is a positive, even though the best time of the entire film.This film is full of interesting and favorable points, and it's of the few comics-based films that can break free of the stylized look of these magazines. Unfortunately, it lacks a certain amount of surprise, excitement and intensity that just don't pour the film to lose because, even then, is a film that looks good and is entertaining enough for a family audience, although is never hot enough to scald the most demanding audience."
    }
  ]
}