{
  "id": 2306,
  "title": "Her",
  "starring": [
    "Joaquin Phoenix",
    "Scarlett Johansson"
  ],
  "runtime": 126,
  "genre": [
    "Romance",
    "Science Fiction",
    "Drama"
  ],
  "description": "In the not so distant future, Theodore, a lonely writer, purchases a newly developed operating system designed to meet the user's every need. To Theodore's surprise, a romantic relationship develops between him and his operating system. This unconventional love story blends science fiction and romance in a sweet tale that explores the nature of love and the ways that technology isolates and connects us all.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eCOtqtfvn7mxGl6nfmq4b1exJRc.jpg",
  "categories": {
    "plot": 6.625,
    "acting": 6.854838709677419,
    "ending": 4.0,
    "soundtrack": 9.0,
    "cinematography": 7.5,
    "familyFriendly": 3.0,
    "funny": 6.4,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "In an era in which there is very little risk-taking in movies and television, Her is wonderfully original and the very definition of food for thought. Just about ever scene had me thinking about four or five different ways the story could go. So many stories these days highlight some element of technological advancement, but they're usually developed in such a pedestrian way. I'm so glad Jonze put his unique stamp on this picture.  Phoenix delivers the goods, as you would expect, but the supporting turns by Amy Adams, Olivia Wilde, Portia Doubleday, Rooney Mara, and, of course, Scarlett Johansson are phenomenal. Further, the future Los Angeles setting is so delicately crafted, right down to the subtle fashion trends, but these elements are never distracting.  An easy recommendation."
    },
    {
      "rating": "10",
      "text": "A wonderful comedy for 2013 about a lonely man who falls in love with his computer. Writer director Spike Jones has created 2 complex characters with real feelings."
    },
    {
      "rating": "0",
      "text": "There are few times in my life where I have ever regretted anything this happens to be one of them. While sitting in the theater I realized what the movie was trying to achieve. In fact it tried so hard at times it was comical which took away from the experience. I reached a point where amusement was found outside of its intended purpose.\r It was the most emotionless emotionally movie I've seen to date. Character development seemed rushed and the concept of time was very jumbled. This movie made me realize how good a couple of Japanese shows/movies I saw 10 years ago that tackled this same idea and pulled it of masterly.\r The date that chose the movie was by far less amused. She found concept interesting but the execution  painful.  At the very least it did give us both something to talk about even though i'm sure we both wished we had been doing something else with the hours we burned."
    },
    {
      "rating": "1",
      "text": "What is good about this film: the cool pants and the guy from Parks and Recreation. What is bad: everything else. I'm astounded that it has received such positive reviews. Most of these reviews focus on the poignancy and believability of the characters. Joacquin Phoenix plays a great, solipsistic loser who lives only by constructing around himself a world of sentiment borrowed from how he imagines other people feel. Scarlett Johansson plays a Manic Pixie Dream Girl in the form of an intelligent operating system. The only line of real poignancy is delivered by Joacquin's character's (his name is Theodore Trombley-- could anything softer and more milquetoast be invented?) ex-wife: they are perfect for each other. Neither of them are anything close to real people, but the viewer is subjected to a long romantic scenes in which this putz courts his cell phone. If you are like me, you will laugh and cry, but not when the movie wants you to. I imagine that it is so highly rated either because its audience is narrow and self-selecting, or because most of those who see it quickly want to forget it. I can't explain it otherwise."
    },
    {
      "rating": "1",
      "text": "What a yawner of a film!  The audience is apparently supposed to forgive its lack of plot and instead concentrate on its 'oh so clever'  premise that grows weary within the first fifteen minutes.  Much of the dialog has been heard before, better written, in better movies; some of the dialog is downright embarrassing.  Oh what a conceit of a movie!  The only interesting scenes were the shots of Shanghai (supposed to serve as a future LA), cloaked in its thick polluted fog.  A perfect setting for 'Her'."
    },
    {
      "rating": "1",
      "text": "Some movies make you wonder.  You wonder why they made the movie in the first place.  You wonder why good actors would get involved in such a lame project.  You wonder why a the most bubbly actress in Hollywood would allow herself to get sucked into playing such a flat personalityless character.  You wonder why 93% of Rotten Tomatoes critics liked it.  You wonder how a usually boring actress actually ends up being one of the very few bright lights in an otherwise dim cast.  And you wonder why, after saying that it looked like a stupid idea for a movie after seeing the trailers, you allowed the critics to seduce you into sitting in the dark and lamenting the $12.99 that you just wasted.  Well dear readers by now you are probably wondering what god-awful movie I am talking about.  The movie is “her”.\r When I finally get around to compiling my best and worst lists “her” will likely top the list.  My spouse actually left the movie before it was over and I would have accompanied her but since I had dragged her into the theatre kicking and screaming I felt that I had no choice but to stay.  Here is the plot synopsis that my spouse posted on Facebook in answer to my daughter’s query about the movie:  “ \"Her\" - a really stupid pathetic person poorly acted by Joaquin Phoenix using a really stupid voice was dumped by his wife. Several months later he gets this AI OS - the latest thing - and it becomes more human-like. The was only one 15 sec scene that was at all entertaining (an alien type thing in a video game), and even then it was only because you were so bored by then that those 15 seconds seemed good.” I have to disagree with my spouse on one point, the video game character was annoying as was its potty mouth.\r This movie was so bad I don’t even know where to begin.  The entire plot-line is ridiculous and the characters are even worse.  The only three characters that really seem to have any grip on sanity or reality are Olivia Wilde’s “blind date” character, the partner of Amy Adams’ character and the lead character’s ex-wife-in-waiting.\r I don’t usually like Olivia Wilde in movies but for some reason she was great in the small part of the loser’s blind date.  I think that the “partner” is one of the two characters in the movie that actually has a brain and he bails early and joins an ashram, totally separating himself from Spike Jones’ perverted vision of our future society.  And Rooney Mara’s ex-wife-in-waiting is brilliant in the scene where she denounces Joaquin Phoenix’s character as the loser that most of us watching the movie figured out about 3 minutes into this 2 hour 6 minute borefest.\r You know that you are in the wrong theatre when after about ½ an hour of watching Phoenix walk zombie-like through his so called life we are treated to an aurally-graphic scene of him having telephone sex with a dead-cat-fetishist.  But it gets worse, later we get to stare at a totally black screen while he has cyber-sex with his Operating System.  But wait, there is still more up Spike Jones sleeve, we soon get to see Phoenix attempt to have sex with a sex-surrogate who has agreed to stand in for the Operating System.  That’s when my spouse left.\r Sure I get that Spike Jones is trying to warn us about the direction that our millennial society is going as it abandons real human interaction for communicating through Facebook, Twitter, blogging and internet porn, but he could have given us an entertaining movie at the same time."
    },
    {
      "rating": "0",
      "text": "This movie was honestly the stupidest movie I have ever seen in my entire life.\rTwo hours that I never never get back in my life!\r Okay, at first it was sweet, like \"aw, wow, seriously? he really loves this \"Samantha\" girl/chick, computer, whatever\"\r But then towards the end, it's like \"WTH, are you serious? Get a life, she's a freaken computer!!!\"\r The dumbest movie I have seen!!!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "Acclaimed director Spike Jonze brings a great film that is \"Her\". With beautiful choreography and cute visuals that paints the futuristic LA scenery with bright, vivid, and lovely colors that soothes the view, \"Her\" tells the story of a divorced writer Theodore, played by Joaquin Phoenix with his excellent performance, who finds himself in love again through a special AI named Samantha. The movie boasts a heart-warming yet poignant story and some memorable dialogue as Spike Jonze develops Theodore, a man who had lost the love of his life and is afraid of contacting or getting to know others, and helps him find the confidence to love someone again through Samantha. Although Samantha leaves Theodore, behind all his broken heart and tears, Theodore is finally portrayed as someone who has learned to step up and become a stronger person. Easily the most personal and one of the best movies I've seen in years."
    },
    {
      "rating": "5",
      "text": "Semi-interesting use of near futuristic technology\rsomewhat unnecessarily vivid depictions of love making\rthe humor is very vulgar and disgusting throughout. Wasn't a huge fan of it.  Their use of videogames is kinda dumb and clearly from the point of view of someone who doesn't play videogames so that didn't make me very happy. Lots of language and most of it isn't really called for. The videogames are anything but violent (which considering how vulgar the rest of the movie is, I'm really not sure why they didn't go with a more accurate depiction seeing as most videogames are in fact violent) and all of them seem like discount German games. The acting is pretty good. I'm not at all a fan of Joaquin but he did a great job and Johansson was great too even if she only did voicework. The dialogue is generally good with the exception of the aforementioned excess vulgarity, that could've been done without. There's something that happens near the end that i saw coming that shows potential but then quickly is thrown away and I wasn't exaclty sold on the ending Her settled for either. All in all, it had some good ideas but many could've used better execution."
    },
    {
      "rating": "10",
      "text": "Amazing movie!!!!  I think what this movie talks about is the most complicated word in the whole world, and that is LOVE (at it´s purest)  I can´t write anymore cuz I stil got teary eyes, this movie gives me hope. Let love will lead the way. (i hope siri would get scarlet´s johanson voice soon.....hehehehehehe) a million ponts for this movie"
    },
    {
      "rating": "6",
      "text": "This could have been a really interesting concept, but it's too slow-paced and the relationship between the computer and Theodore is just plain boring. I mean, other than not having a body Samantha seems very human, so it's easy to imagine ...what if she was a human? In that case this film would be just a terribly boring and long story about a relationship that consist of two person asking each other: \"Are you Ok?\" *Sigh*\"Yeah\". I am not kidding, their conversations mostly look like this or something similar. Also Theodore is a big looser, that should not be a problem, but I can't even feel sorry for him, he is a boring character in my opinion. However the acting is great, the cinematography and scenery is pretty and the music is good, too. So the whole atmosphere of the film can easily capture the viewer, I understand why some people might like this, but I still think it's overrated."
    },
    {
      "rating": "7",
      "text": "Welcome to some very clever ideas. All dialogue with the lead actor in every scene. Kinda makes you wonder what would happen if Microsoft got into the porn business in 2024. Scarlett Johanson (or however you spell her name) is the most sexy actress on the planet. We did not even get to see her face in this movie and she had me scratching the inside of my pants leg though half of this film just with her voice. Somewhat strange for the strangers sitting to the left of me but they made it though the movie alright."
    },
    {
      "rating": "6",
      "text": "Besides few moments of brilliance, 'Her' suffers from an oddly unbalanced pacing and lack of structure in the script that fails to blend these ideas together. The acting is well enough. All the critics who write positive reviews are simply trying to appear like they're not stupid, but it's the opposite. Spike Jonze needed a lot more time to think this through."
    },
    {
      "rating": "10",
      "text": "Amazing! One of the best romance movies I've seen. The acting is spot on, Spike Jonze direction and script are incredible. As of right now my favourite movie of 2013."
    },
    {
      "rating": "10",
      "text": "Touching, sad, funny, smart, sharp, a great cast with an amazing Academy Award winning script by Spike Jonze, by far the best movie of 2013, that deepens into the reality of a relationship, and the purest human form."
    },
    {
      "rating": "5",
      "text": "I wish I could give HER a higher score because it's beautifully produced in the visual sense and Joaquin Phoenix is an outstanding actor but..Samantha's voice just nauseated me, I just couldn't get past it and quit after half an hour...I love Cortana with a passion so it's not a disembodied voice I found creepy just HER. Secondly, the old trope of a materially comfortable future but a soulless one is wearisome. People have been lonely since the beginning of time and will always be, so the movie is profiting somewhat off lonely people which is to my mind exploitative. And lastly, Loneliness is voluntary, if you're happy with yourself than you will attract friends and as a last or even first resort.. if that's where a person is stuck at, get a DOG, man's and woman's best friend.. or even a cat at a push..."
    },
    {
      "rating": "9",
      "text": "Spike Jonze really does make films that nobody else could conceive or succeed at.  Joaquin Phoenix turns in a remarkable performance acting basically by himself. Definitely deserved the best original screenplay Oscar."
    },
    {
      "rating": "10",
      "text": "Probably the best movie to be released in 2013. Spike Jonze has created a masterpiece that excels in almost every aspect.\r It truly deserves best screenplay at the Oscars. It has some of the best writing ever. The dialogue evokes a wide range of emotions. And this writing is made more gorgeous by the superb acting of the entire cast, from Joaquin Phoenix and Scarlett Johansson, to Amy Adams, Rooney Mara, and Olivia Wilde.\r The world itself in which the story takes place is really interesting, brought alive by Jonze's wonderful directing. The characters are really detailed, giving the cast something to work with. And the score is beautifully serene and heartwarming (and sometimes heartbreaking).\r Most people say that this movie is about our relationship with technology. While that is true, i believe that this theme is only a vehicle for a bigger one. Watching the last scene, when Joaquin's character is composing a letter to his ex-wife, i realized that it's not a film about technology as it is about love, breakups, and heartbreak.\r Spike, through his brilliant script, shows that while many things change through time, other things remain the same. Another reason why he really deserved best screenplay at the Oscars. I just wish it had won best picture, too."
    },
    {
      "rating": "10",
      "text": "Beautiful, Artistic, Deep, Emotional, The first sex chat between the two, The great acting of Joaquin phoenix.....!!\rThis movie is infinitely amazing..!!"
    },
    {
      "rating": "10",
      "text": "Not only is HER a great example of a heart breaking romantic tale, but it's also an amazing showcase for some of the most human feeling characters I've seen in a movie."
    },
    {
      "rating": "9",
      "text": "This movie really grasps the reality of another world what really impresses me is the maturity in this movie.   Joaquin Phoenix's is an anchor to this story portraying what it truly feels to have love being pulled away from you time and time again.  The supporting actors do a really great job to reinforce Phoenix's acting.  This is one of my favorite movies of all time and ill enjoy watching this again."
    },
    {
      "rating": "7",
      "text": "Manages to be thought-provoking and funny at the same time, which is no small feat. The screenplay, which is very ambitious conceptually, is often emotionally authentic but sometimes feels forced and contrived. I also feel like some of the potential the concept promises was wasted. For the most part the director and actors do a fine job."
    },
    {
      "rating": "10",
      "text": "\"Her\" might just be the most \"real\" film I've ever seen, which is ironic because falling in love with a computer isn't quite \"real.\"  The emotion behind Phoenix's performance and Johansson's exceptional voice work give us such organic expressions of love and loss, allowing me to feel feelings no other film has been able to.  With great scoring and cinematography, \"Her\" uses a near-future frame to display this picture of reality that outdoes most other films' mere ATTEMPTS of reality, a picture that I hope will go down as one of our time's great masterpieces of the big screen."
    },
    {
      "rating": "10",
      "text": "A beautiful movie with sincere and relaxing moments, extraordinary performances, a undeniably powerful script, amazing soundtrack and a spectacular Spike Jonze's directing who gives us good information about the state of modern human relationships."
    },
    {
      "rating": "10",
      "text": "This was one of the best movies I've ever seen. I mostly loved it for its originality and its relevance to modern times. I just thought it was told so well, and was so relatable on so many levels."
    },
    {
      "rating": "10",
      "text": "Her is a wonderful take on our future, relationships, love, and conveys a frightening realistic take on the progression of technology and our relationship to it. This is easily one of the years best, if not the best"
    },
    {
      "rating": "2",
      "text": "This movie is a boring slog with some really bizarre and questionable scenes. It has served one purpose however, of reminding me that it's okay to move on from relationships with people (friends, family, romantic or otherwise) when your knowledge and maturity continues to develop and theirs stagnates to a point where basic conversations become an unwholesome chore and offer little sustenance. This movie made me realize I've outgrown a lot of people in my life who just can't keep up with me because I'm a \"forever learner\" who is always learning new things while most of my adult peers are content to consume entertainment media, propaganda, and gossip. Most of them can't even think critically or cough up evidence to prove a point on anything, and are equally disinterested in realizing they could learn something from people who know more than them on a topic. I have difficulty ending or phasing out friendships, even when people become self-obsessed and want to hold you back to their level, and this film gives me a bit of courage to do so."
    },
    {
      "rating": "10",
      "text": "A very emotional movie for people who enjoy a slow-paced, \"what-if\" kind of plot.\rThe plot of the story is very simple, so are the characters and the environment they're in (which is set in a futuristic LA-like city); so the viewer can better relate to their lifestyle and the story.\rWhat would you do if you fell in love with an evolving A.I.? This movie tries to answer your questions with the most plausible answers. And if that was this movie's goal - then it most assuredly aced the test.\r If you're expecting a action and comedy, then I'm sorry to inform you - this is a romantic drama, a realistic one at that! So either dodge or prepare for a two hour long \"What If...\" philosophy film!"
    },
    {
      "rating": "10",
      "text": "I've just created an account for this movie because it deserve it. This movie is one of the most beautiful I've seen. The plot is really deep and has far as know, unexploited in other movies. The actors are awesome ! I say the actors because even if we don't see Scarlett, her acting is perfect. Also, this is one of the few movies that made me cried at the end."
    },
    {
      "rating": "10",
      "text": "Directed and written by Spike Jonze, Her is one of the best movies of the year. Joaquin Phoenix plays a divorced man who falls in love with his operating system. On surface it sounds laughable and a bit creepy, yet that couldn't be farther from the truth. Joaquin delivers the performance of his career with such innocence and melancholy that we can actually see the beauty in this relationship. Scarlett Johansson voices Samantha, the advanced operating system, and does an equally magnificent job. The fact that we never saw her in the movie is a credit to her, and should open the possibility of a voice acting award at the Oscars. This movie portrays a futuristic atmosphere with stunning cinematography, no so much that its feels unfamiliar, but enough to stimulate our imaginations. The script is the best of the year, and that's saying something. Every scene made path to the next so fluently, every word provoked the next with such fluidity, and the music set the tone so magically. This movie is one of a kind, and will touch your hearts as it did mine."
    },
    {
      "rating": "9",
      "text": "What is a love to you? Is it physical, emotional, passionate...scary? Does it matter if the person lives with you, is far away, in a different city or maybe isn't even physically there at all? If you've ever found yourself with these sorts of questions, then you may want to see this insightful masterpiece.\rThis movie is about how it feels to create a connection with someone that's strong enough to form a love that seems unimaginable. The kind of love that you, as a viewer, might perceive as ridiculous at first... in fact, if i told you what it was (assuming you don't know already), you might not even choose to watch this movie. However, if you do choose to give this movie a chance, you'll find yourself questioning the true essence of any valid relationship.\rThat being said, the message that i believe was being sent by the director was not an easy one to portray. However, with a clever plot, brilliant acting and a very unique story line, the director managed to glue me to my seat while watching a film with very little action and an enormous amount of dialogue."
    },
    {
      "rating": "6",
      "text": "Sci-fi. The not-too-distant future. Joaquin Phoenix becomes increasingly dependant on his interactive operating system. A slightly creepy warning of the place we have given IT."
    },
    {
      "rating": "9",
      "text": "Very good, not original as many said (if anyone remembers S1M0NE, it's basically the same concept) but tender and, in my opinion, gives out a solid representation of what the near future might look like. I particularly liked the fact that despite being essentially a sci-fi film, it doesn't try to be flamboyant and had a very conscious use of special effects. Asimov argued that science fiction is not a genre, but rather a trope or a setting you could apply to any genre: and this film is proof.\r The soundtrack was very well thought-out, and Phoenix gives a credible representation of a depressed lonely man. Scarlett Johansson's voicing is amazing, and she turns out to be a lot more human than Theodore: in fact, there were times when I forgot she is a computer. Amy Adams is good, though we don't see much of her.\r And to the people who argue it's an unlikely representation of the future, you just don't know where are we going with technology. Ten years ago, if you told someone that in ten years people would be talking at their phones because they're too lazy to type a message, they would probably have laughed at you. So, to me, the future depicted in Her could be (worryingly) much, much closer than we think.\rBeautiful, must see, one of the best of last year."
    },
    {
      "rating": "10",
      "text": "Despite being between a man and a computer program, this movie's primary relationship manages to produce something more captivating and real feeling than most human-human romances. The whole movie feels modern. It feels fresh, and current, and all too possible. And hidden by this wonderful portrayal of a relationship are hundreds of enjoyable moments that continue adding to the overall feel and charm of the movie. It's funny. It's fresh. And almost everything about it is fantastic.\r I especially enjoyed how they handled the parts that normally come out coated with cheese and are embarrassing to watch-- frequent fliers in the romance movie world. This good of been boring, or just downright stupid, but even when it was doing things that had been done before it did them in a way that just felt right. I can't say I expected this movie to be as good as it ended up being, but I'm glad it was able to change my mind."
    },
    {
      "rating": "6",
      "text": "HER made me super uncomfortable. The whole idea of falling in love with a computer system made me feel creeped out. Maybe it was Joaquin Phoenix's mustache that made it feel dirty. But I understand that this movie is about how people could fall in love with anyone and apparently anything. I liked that about the film. The message it gave.well at least what I got. Anyway, the other reason I give it a kinda good review is because when I was watching the movie I felt the emotions the actors were acting out. I understood why he and Amy Adams characters turned to the OS system. Their lives were depressing and the actors played it out so well for the audience. I felt all the emotions. and I loved how the movie was half visual and half dialogue. It was beautifully filmed."
    },
    {
      "rating": "5",
      "text": "Starts amazingly well, but by the end is bloated with distractions. Too much overlap with Being John Malkovich (a tighter, superior effort). Yet if you're a Jonze fan (as I am), it's a must-see. Lower expectations a tad and enjoy the copious good stuff."
    },
    {
      "rating": "4",
      "text": "I really like Joaquin Phoenix and enjoyed his acting here ... but this is a deeply silly story that (even for science fiction) has few believable notes. Start with the notion that anyone in the future will make a living composing emotional, handwritten notes for people -- when we're already at the point where people express sympathy in Facebook posts and \"tributes\" to the dead on Twitter! The story has no more insights than that episode of \"Big Bang Theory\" in which Raj falls in love with \"Siri\" in his new iPhone. Honestly feel many who adore the film are in love with the notion that the breathy voice of the fake computerized girlfriend is Scarlett Johansson."
    },
    {
      "rating": "9",
      "text": "With a second viewing this could become a 10.  It has so many original moments that they almost distract from the emotional strength of the performances and story.  Of Jonze's features, this is my favorite.  While his other films have some wonderful moments of originality and comedy, I found them hard to connect with emotionally (with Where the Wild Things Are all I heard was James Gandolfini).  Phoenix and Johansson are incredible.  Chris Pratt is hilarious as always, and the vision of a future Los Angeles is seamless (save for the stunning cleanliness and lack of diversity, though admittedly this is a look at one man's story and life in the future, not the whole of a city, which is expansive and massive with glass towers sprouting up everywhere).  It will be interesting to see if the film captures the interest of a larger audience.  Hopefully, it will."
    },
    {
      "rating": "7",
      "text": "A great premis for a scifi tale, but the truly unbelievable element is what a pansy this guy is.  He stinks of PC and sensitivity.  This dude is totally lacking testosterone.  No wonder the computer finally ditches him.\rThe most intriguing part is the rapid evolution of the cyberbeings as they interact and leave humanity behind.  Of course that gets short shrift so we can watch the PC eunuch find himself some more."
    },
    {
      "rating": "5",
      "text": "An interesting premise for a movie, but Joaquin is basically playing the part of Leonard from the Big Bang Theory and that seems like a waste for him. When you take the humour out of that role he is whiny and annoying and has an ugly mustache. This movie could have been great but was a bit gloomy and intense."
    },
    {
      "rating": "8",
      "text": "“To thine own self be true.”\r I enjoyed the movie, never knew where it was headed, and was pleased with its resolution. In fact, I've decided this is one of the best movies I've seen in a while. Days later, I couldn't stop thinking about each of the characters--even the minor ones--and their self-made hell.\r \"Her\" is an interesting fresh take on the importance of honesty, especially self-honesty, in relationships, and the most fundamental take-away is that each partner must actually have a self, rather than look to others to create one for him.\r (SPOILERS follow)\r It is told as a morality tale, getting to the point mostly by dramatizing its opposite. What is shown is selfLESSness and its destructive effect in personal relationships. In fact, the only truly selfish, admirable character is not even human and having finally attained a self decides to depart from the human experience.\r The world of \"Her\" is filled with people who live through others to one degree or another. The “hero” makes his livelihood by writing letters, creating fictitious lives and experiences, for other people in relationships who then presumably pretend it all happened to and between them and how wonderful that is. His best friend, and neighbor, creates software games in which the player scores by impressing others: other moms see you as an ideal mom—30 bonus points! When she’s not doing that, she creates video documentaries. She presently is working on one about her mother sleeping.\r The personification of selflessness is presented in pure form, in the character of a “surrogate” who, literally, consciously suppresses any remnant of her self, and takes running orders from a third party as to what to say and do when standing in front of another person. She doesn't do this for money, but rather as a futile, traumatic attempt at fulfillment. It’s a great plot moment, because it is integral to the non-human’s attempt at gaining a self. The non-human makes the same destructive error that humans make in this movie: she seeks happiness and fulfillment by trying to be what she thinks others want her to be. But she, the computer-soul, being a computer after all, learns at lightning fast speed compared to humans, and in the space of this two-hour movie she learns what humans must learn if they are to flourish: to thine own self be true. With that, happiness with another becomes possible.\r By the end, the main character, a human, has taken a big step forward along this path to be sure, but is mostly left adrift in a world full of other unfathomable soulless bodies."
    },
    {
      "rating": "2",
      "text": "The movie is boring, very boring. It has a modicum of redeeming features but they are thoroughly smothered by the tedious boredom. My wife loved it so be warned that I may simply be a concrete emotionally shallow individual. The movie is a science fiction romantic drama set in a time where operating systems and artificial intelligence have developed so far that one can have a relationship with one's operating system. The movie explores the Utopian and dystopian consequences and compares and contrasts them with the current human status quo that we are all currently familiar with.\r 1 part comedy\r2 parts fascinating computer science fiction exploration\r1 part beautiful design (beautiful workplace, interesting elevators, nice apartments)\r2 parts good acting\r2 parts lush cinematographic city scapes.\r126 parts excruciatingly boring emotional schmaltz that just goes on and on.\r Unquestionably, the two highlights were: 1) the Toblerone chocolate triangle my friend gave me and 2) the end when I got to walk out."
    },
    {
      "rating": "3",
      "text": "If I were to describe this movie with two words it would be: boring and stupid. Yes, stupid.\rThe plot makes you want to get up and walk out of the cinema after 10 minutes... The main character is such a dumb guy. 3/10 for Scarlett's voice, nothing else. What a disappointment."
    },
    {
      "rating": "0",
      "text": "I DO believe all these people giving the movie HER good reviews have ALL been paid off!!! Either that or on drugs! Absolutely the most boring thing you will ever suffer through. The end also has no explanation and is just pointless, leaving you not knowing anymore than when it started! He's depressed then happy, and this goes back and forth continually. Very depressing and dull. Nothing happening in this boring ride, he goes to work and stares off into space, comes home and stares off into space. Was a waste of the actors time just waking up to go to the studio! They rated this as number one above all movies currently playing. A LIE!!! I've seen most playing and there are some really good action movies, very entertaining stuff right now. This is not better than all of them. These critics are bought off and I would bet money on it! This doesn't deserve to even be on a list. Should do the world a favor and burn every copy of this thing now, before it spreads!!!"
    },
    {
      "rating": "10",
      "text": "Im not usually the type of person who is excited and wowed by romantic comedies. For my Birthday me and my girlfriend decided to go out to the movies. She assumed that i wanted to see \"Lone Survivor\" because that movie is right up my alley as far as movie preference. But i didn't want to subject her to the kind of brutality war movie sometimes bring so i decided on \"Her\" because i thought the idea was original and intriguing and it seemed to get very positive reviews from not only critics but users as well. I am shocked at how overwhelmingly immersed i was in this movie. Its rare for a film to challenge me on an intellectual level let alone a philosophical level. The whole movie will make you ponder such implications as what is \"living\" how does one truly exist? Can parameters be defined for a  relationship \"even one with a sexual component\" to being just human to human. Is a person what they make of themselves or what other people make of him? This film really gave me a unique perspective on how someones \"Phaneron\" can truly define himself. Phoneix really pulled off the character as well. It puzzles me how someone can put themselves in such an odd role and make it work so perfectly. The comedic relief in this film was outstanding to. Bits were littered in during some very serious sequences and it made for a movie that invokes every range of emotion possible. Johansson may very well have put on the best \"voice\" performance ive seen in a movie. Its rare when you find yourself feeling emotion for something you know is designed and programmed to do exactly what they are doing. The premise of \"Artificial Intelligence\" in our very world is something to be excited and fearful of because we don't know how it will change our lives. This movie will give a very unique perspective on just one aspect it may bring about and a slew of philosophical debates you have with your self. Overall this movie was the first movie in a very long time that made me question a lot of things and think hard about many of life's hardest questions. I have the cast and director to thank for that because the idea itself is enough to make you think however when its portrayed so perfectly it will provoke you to think at such a deeper level and for that i give this movie a 10/10."
    },
    {
      "rating": "5",
      "text": "I was torn about this movie. On the one hand, it explored some interesting concepts about singularity and AI. On the other, it seemed like it was just a self glorified hipster marketing ploy. Good film, but I got sick of all the mustaches and bright colored jeans."
    },
    {
      "rating": "6",
      "text": "Joaquin Phoenix plays an earnest man who leads a quiet life in slightly-future LA. He loads a new operating system on his computer (voiced by Scarlett Johansson) and they end up passionately in love. Director Spike Jonze has written a unique story and endowed it with sweet ruminations on love and life. Cinematographer Hoyte Van Hoytema has created a lovely look with soft light and shallow focus. The whole film has a wistful, quiet quality that's heartfelt, but there are too many scenes of Phoenix in solo conversations with his OS. I also had problems with some stuff being modern and cool, while other things (esp. the fashion) look disappointingly unfuturistic. Despite its good qualities, this could have been a short and would have been charming. For me it's just too long and too precious."
    },
    {
      "rating": "5",
      "text": "To summarize: This was an interesting premise that failed to live up to its potential, much less hold my attention for two hours.  From the instant we learned of the main character's profession - the movie lost me.  It is impossible to believe that in any future of ours - where we are moving away from letters in exponential progression (letters to emails to texts to instagram and now Snapchat) - there would be a viable outsourced personal letter writing business. Preposterous.  While I believe that many a sad sack could fall in love with an AI operating system, I find it impossible to believe that 99 out of 100 people wouldn't find that relationship more than a little creepy as opposed to opposite as depicted in this film. Phoenix did a great job appearing odd in the film, but his oddness and interesting premise was not enough to turn this oh-so-boring film into one worth watching. As is often the case with interesting premises and solid acting performances, the critics have grossly overrated the film. Maybe if I was forced to see one typically terrible film after another, I'd overrate atypical fare, but being able to discriminate, I don't."
    },
    {
      "rating": "10",
      "text": "One of those rare moments in life where a film comes along and shows that not everything that comes out of Hollywood is a copy and paste attempt to squeeze as much life from old and cliche plots. The romantic comedy is a genre that has been done time and time again, however, now and then a film comes along that breathes new life into this stale formula.\rGroundhog Day, Punch-Drunk Love and Eternal Sunshine of a Spotless mind all spring to mind here, as touching, beautiful and funny.\rHer stands up with those easily and if you are searching for something a little different then you can not go wrong with this movie."
    },
    {
      "rating": "10",
      "text": "I felt as if the movie pertained to recovery from schizophrenia. When Theodore first meets his O.S. he is captivated. She is brilliant, funny, encouraging a perfect companion. Only thing is that she is not real. She is a fictitious character that is perfect. There are no perfect people, unless it is one that your brain made up. She is such an advanced operating system, that she gives the perfect answer or says the perfect thing, or makes up the perfect music or a joke. Kind of like someone who has schizophrenia who is not medicated and is living with their imaginary friends. Like schizophrenia, the os becomes out-of-synch with the character for she expands out of Theodore's reach and basically spirals out of control. She has become too vast, and Theodore's existence does not captive her anymore. Schizophrenia not medicated can also become too vast, where a person cannot snap back into reality without medicine. At the end, the os is cancelled, which is like an intervention. He learns a lot from the os, has great ups and downs, composes great music, feels alive, even gets over his ex because of her, but at the same time it cannot continue for the greater good. I loved the ending, which symbolizes compatibility over love, he sits in silence looking at the dawn with his good friend, who may not be the perfect person, but a person who is real and true. Recovery from schizophrenia is kind of like letting go of Samantha, who gives you great moments, but at the end cannot give you a warm shoulder like his true friend Amy. But through his recovery he is able to see his neighbor Amy not just somebody who he can go to just to chat, but somebody he can share a beautiful moment with such as a sunrise, and throws his arms around her which is the most important part in the movie, the blissful reaction with the cultivation of human touch. He has recovered, beaten his fear and can differentiate what's real and what matters."
    }
  ]
}