{"id": 3379, "title": "Herbie Fully Loaded", "starring": ["Lindsay Lohan", "Michael Keaton"], "runtime": 100, "genre": ["Comedy", "Family", "Adventure", "Fantasy", "Romance"], "description": "Maggie Peyton, the new owner of Number 53 - the free-wheelin' Volkswagen bug with a mind of its own - puts the car through its paces on the road to becoming a NASCAR competitor.", "releaseYear": "2005", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/7lTfTZ8CDfXw09eAv3OOvsbCVgs.jpg", "categories": {"plot": 4.8, "acting": 4.166666666666667, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "0", "text": "Wow u would have thought that lindsay lohan would have learn't by now that she can't act and should give up, shes nearly as bad as hilary duff (there both wannabe rock stars, it's neva gonna happen girls so let it go). They have totally ruined the rest of the herbie films for me as i just think of this one and how dissapointing it turned out to be."}, {"rating": "1", "text": "It's a dreadfully bad, bland, and boring sequel to the classic Love Bug series. Not only does it use one of the worst lines in cinema history (it's in my blood!), but Lindsay Lohan's character was whiny and dislikable, same with that Trip guy. I Kevin, her dad, and brother were decent, though, and Herbie was still immensley likeable, but I still truly despised this movie. The poor director tries to make it like one of those classic, inspirational sports movies (Coach Carter, Friday Night Lights ETC.) even when it knows it's a crappy, goofy movie for 6-year old girls and 8-year-old guys. Terrible, terrible movie, and it's probably the worst of the year."}, {"rating": "7", "text": "65% This is Herbie?! It was a nice idea to make it more modern day but it completely spoils the series. There were porr directing and scriptwriting and did not attempt to try and ge back its classic 'love bug' spirit."}, {"rating": "10", "text": "Excellent movie,one of the best that have come out yet.wish thier was more movies this good."}, {"rating": "10", "text": "Exalant!!"}, {"rating": "10", "text": "It was great my faimly loved it."}, {"rating": "6", "text": "It has the style, it has the score, and it has the charm, but the material is flacid and the moments are so cliché, that you can't help but not like this movie. Its a reall shame, because it could have been sweet."}, {"rating": "10", "text": "This movie is really loaded with some cool stuff. i'm just giving it a 10 because i want to get the rating up higher. but i would really give it an 8!"}, {"rating": "8", "text": "They gave this car a personality and somehow the movie turns out to be a really cool experience. Lindsay Lohan also does great here. The story is the only part that seems average."}, {"rating": "5", "text": "Good message, poor execution. This movie could've been so much better. It didn't live up to its full potential, and it had so much of it! But, what more do you expect out of Lohan except being in tabloids?"}, {"rating": "4", "text": "They worked very hard on bringing the magical presence of Herbie back after so long, the actors however weren't as magical. I didn't like it but I didn't hate it either."}, {"rating": "10", "text": "Casi no la eh visto pero si me gusto, no como las otras pero me gusto, buena actuación buena película"}, {"rating": "5", "text": "Just to explain, I've always been fond of the Herbies movies and also Disney movies in general, since I was a kid. Herbie Goes To Monty Carlo was my favourite of the Herbie movies and I like to indulge the kid in me once in a while so when I saw this modern Herbie movie was being shown on Freeview and I knew I hadn't seen it, I thought I might as well record it and watch it later.Well, first off I thought that this very modern addition to the Herbie film franchise really didn't have the same feel to it that the older movies had. I have a feeling that the Herbie movies really worked as well as they did as they were movies of their time and now, it doesn't quite work as well. There was something just a bit 'off' about it... for one, unlike the other movies (from what I recall anyway), its not really all about one big, main championship race around a city or country. I'm not particularly keen on Lindsay Lohan either and I can't say I felt that sorry for, or interested in, her character either. Matt Dillon does quite well playing the smug, egotistical  competitor Trip Murphy but of course, his character being what it is, your not keen on him either.Justin Long, as Maggies friend Kevin, plays his part well, I can't really fault his performance, though generally I am left feeling that the characterisation wasn't as good as it could have been. I know this is, first and foremost, a kids movie but all the same, I'm sure I have watched more movies that felt a bit stronger in this way/category. However, all of this doesn't necessarily mean that the movie is rubbish and that its not worth bothering with at all. Slightly weak characterisation and Lohan put to one side (I don't even want to go into the short skirt I seem to remember spotting her wearing in one scene,geez for a kids movie that seemed so tacky!) and particularly if your not someone with high expectations or otherwise a pre-existing Herbie fan, then you may get some enjoyment from this. Of course it is predominantly a kids movie and im sure some children will quite enjoy this, the CGI present allows for Herbie to perform some stunts that weren't possible in the past, pre CGI days, so that could be seen as an advantage. It is pretty predictable, story wise and all but I imagine myself as a 7 or 8 year old watching this, with Herbie driving itself and the special effects and I imagine I would be adequately entertained and probably would enjoy this a fair bit and even want to watch it again a few times (we all know how kids love to watch films many times, at least the ones that grab their imagination).The concept behind Herbie, which has also been used in slightly more adult shows such as Knight Rider (remember Kit, anyone?), is still quite imaginative and, probably more importantly, fun. Its a cute idea and im sure there are many adults that, if asked, would admit that they'd be pretty excited to get a hold of such a car.Basically I think that kids should be pretty well entertained and enjoy this movie but it is a bit of a disappointment for us older (or should that be, kids at heart?!) fans of the more traditional Herbie movies. I guess I shouldn't mark the movie down for having perhaps too high expectations and again I doubt the movie was made primarily with older fans of the original Herbie movies in mind but its my review, so I think its about right that I stick with a 3 star rating.If your looking for a movie to entertain the kids for an hour and a half or so, then yes, I suppose I would. I'm sure it would keep most kids attention, with CGI effects/special effects that aren't too bad (though I feel it does somewhat detract from the Herbie franchises original appeal but oh well, we can't live in the past, right?!) and that should appeal to them, its not an awful movie, just not as good as it possibly could have been. Its rather predictable and pretty cheesy but hey, its Disney and its for kids, so, in a way, what do you expect?I'm not keen on Lindsay Lohan, in general or in this role really, I have this irksome feeling that she was picked for the role as Disney wanted to promote equality and show that women can be race car drivers too, that kind of thing, rather than having picked her specifically for being the best actress for the part... maybe thats a little harsh but I do feel a bit that way. For the kids this is a decent enough movie to keep them entertained, for fans of the older Herbie movies, I'd say that its not worth paying for this modern remake or addition to the franchise, it might only disappoint and so it depends on who the movie is for, whether I'd recommend it or not but I guess the target audience is for kids, thus I'd recommend it on that basis."}, {"rating": "7", "text": "Recuerdo que desde niño conocia está película, y me encantaba, ahora soy adulto, y veo que no era la gran cosa. Pero no dudaría en qué el carro es divertido, los actores lo hacen naturalmente, aunque la trama sea parecida a el de muchas peliculas. No sé si disfruto más la película, o a la hermosa protagonista"}, {"rating": "5", "text": "----------------------------------5.0/10-----------------------------------"}, {"rating": "7", "text": "This was a fun and inoffensive feel-good flick. Herbie's antics were never boring or annoying, and Lindsay Lohan in 2005 was beautiful."}], "recommendations": ["alvin_and_the_chipmunks_the_squeakquel", "alvin_and_the_chipmunks", "spy_kids_all_the_time_in_the_world", "ice_age_dawn_of_the_dinosaurs", "the_smurfs", "yogi_bear", "chicken_little", "alvin_and_the_chipmunks_chipwrecked", "marmaduke", "the_croods_a_new_age", "garfield_a_tail_of_two_kitties", "the_karate_kid", "the_game_plan", "tmnt", "hannah_montana_the_movie", "diary_of_a_wimpy_kid_the_long_haul", "bedtime_stories", "the_duff", "night_at_the_museum_battle_of_the_smithsonian", "minions_the_rise_of_gru", "hotel_transylvania", "uglydolls", "minions", "diary_of_a_wimpy_kid_dog_days", "ice_age_the_meltdown"]}