{"id": 757, "title": "Hercules", "starring": ["Tate Donovan", "Josh Keaton"], "runtime": 93, "genre": ["Animation", "Family", "Fantasy", "Adventure", "Comedy", "Romance"], "description": "Bestowed with superhuman strength, a young mortal named Hercules sets out to prove himself a hero in the eyes of his father, the great god Zeus. Along with his friends Pegasus, a flying horse, and Phil, a personal trainer, Hercules is tricked by the hilarious, hotheaded villain Hades, who's plotting to take over Mount Olympus!", "releaseYear": "1997", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/dK9rNoC97tgX3xXg5zdxFisdfcp.jpg", "categories": {"plot": 5.872340425531915, "acting": 6.0, "ending": 6.25, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.578947368421052, "funny": 8.333333333333334, "action": 6.117647058823529}, "reviews": [{"rating": "3", "text": "The trailer is deceiving and looked way better than the actual film. The interesting parts from the trailer (Hercules fighting various mythical beasts) take up the first minute of the film. The rest is taken up by a horribly boring, predictable plot which doesn't even have any mythical elements to it.\r The dialogue is cliche and cheesy. The characters are all stereotypes who don't get much development through the film. The action is painfully average, and there's a lot of poorly-done CGI. Giving Hercules a team instead of making him a solo hero (or at least, limiting it to 1 companion) is also a strange choice that I thought made the movie a lot worse. So was making Hercules into some mercenary type anti-hero guy - that just doesn't work for a mythological hero like Hercules.\r Overall I'm highly disappointed. I didn't expect amazing writing, but at least I wanted to see some fun action with cool mythological references - maybe have a few Gods show up, mythical creatures, etc."}, {"rating": "3", "text": "Dwayne Johnson obviously prepared for this movie. He is fit for the role, even though still doing mediocre level of acting. But the trailer really looked awesome and successfully made me want to watch the whole film. But I think The Rock just involved in another bad movie. Most the stuff we all see in the trailer are actually the first bit of the whole movie (yep, those all fight scenes with giant lion or that creature in a lake). One to blame is Brett Ratner. The movie if full of bad dialogue and plot. Ratner also wasted several good actors there. Definitely not an epic mythological movie."}, {"rating": "6", "text": "This certainly isn't a faithful retelling of the myth, nor is it a clever new take on the character. It is cheesy, predictable, and the effects aren't terribly special. That being said, I actually enjoyed this 95 or so minutes of popcorn fluff, because that's all it ever pretends to be."}, {"rating": "6", "text": "Ancient Greece with the Rock...I thought he was tremendous in the Scorpion King and expected more of the same here. I wasn't expecting it match 300....which in my view is a classic..but it could have been a bit better than it was..then again it was clearly aimed at early teen audience who I'm sure loved it..but they are demanding with regards to CGI and that didn't always hit the mark..Two of the characters for me didn't work..The yappy nephew and the mute sidekick.....The damsel in distress princess wasn't that memorable either..Overall though it was good fun......"}, {"rating": "8", "text": "I'm not sure what it is about Dwayne Johnson, but he always gets roles in movies that for the most part are great movies.  The storyline may be a bit of a cookie cutter storyline but, it never fails to deliver and the psychological profiles of the cast offer several different types of the audience the opportunity to relate with at least one character in the movie and how they must overcome either their dark history or their impending future."}, {"rating": "7", "text": "Hercules starring The Rock delivers exactly what you expect; plenty of action, lame dialogue, expensive production sets and weak characters. But as a popcorn flick, it is immensely enjoyable."}, {"rating": "10", "text": "Wonderful action movie!  Great seeing many of the charecters and monsters from Greek and roman mythology come \"alive!\"  Lots of likable charecters, great storytelling of the tasks performed by Hercules, and an all around fun movie.  Much better than  the movie Lucy."}, {"rating": "1", "text": "I don't know why my parents were so interested in this film. Myself having heard what a bad director Brett Ratner is, wanted to go see Luc Beeson's Lucy movie with ScarJo, I don't know why it  didn't came as a second thought so I went to see it and was totally disgusted there was not even an entire plot and the final part was just plain ridiculous.\r this is just another pathetic homage to 300 like your typical aaron seltzer and jason friedberg parody, and worse than I Am Spartacus\r odd acting decision from the Rock Johnson"}, {"rating": "4", "text": "A lighthearted, kitschy re-imagining of Hercules, this movie borders on the \"it's so bad-it's good\" territory. Weird special effects, hammy performances, it's the best produced B-Movie I have ever seen."}, {"rating": "3", "text": "I walked in expecting an ancient classic but I was severely disappointed. The story line is weak and short sighted and the cast of characters was very poorly cast. Many people in the movie shouldn't have been there and the story line is very dull and extremely fast paced. You don't have time to enjoy any scene for the proper amount of time. There are no innovative action scenes that make you really enjoy the imagery. The attitudes of people in the movie in regards to legends is such a turnoff for a movie like this. You walk in to see mythical stories and mythical imagery and instead you get lingo that sounds like it's from 2014 and people who disregard the legend of Hercules. \"Literalists\" have ruined a great mythical story and one of my favorites; Hercules. This movie seemed to be entirely made to disregard the legend of Hercules instead of telling a beautiful modern adaptation of the story which many people enjoy. I gave it a 3/10 because The Rock was a childhood favorite wrestler of mine. But other than that, this movie failed in every sense."}, {"rating": "5", "text": "This movie is filled with moments where you think \"I have seen this done better in ____.\"\r The sword and sandal movies have started to rebirth after the popularity of shows like \"Spartacus\" and \"Game of Thrones\" and it's no surprise that screenwriters are turning to easy topics to turn into quick profit. Sadly \"Hercules\" falls into that category.\r By no means is this movie BAD but it isn't an excuse to call it Good simply because it could be worse. I am completely on board with the whole realistic take on Hercules and having his deeds be what becomes the spoken legend of the man, but the movie have trouble deciding if Hercules is actually a demi-god or simply a really tough man.\r We see him get hit by arrows, cut, stabbed, thrown, beaten, yet in the final confrontation, he has little to no signs of any physical pain. He hits his enemies over 20ft OFF their own horse and can kick a large wooden object a few yards at a high enough velocity to knock someone out.\r This movie would've been amazing if they focused on his Trials and kept the realistic (non demi-god) aspect to it rather than a Braveheart meet Spartacus ripoff with a (predictable) twist of them turning against him.\r I feel like they had an AMAZING cast choice with Dwayne Johnson, but if they would've stuck to a concept, and provided more of a story than Hercules overcoming a random army that he in turn trained, it could've been a memorable movie.\r Story - 3\rActing - 6\rCGI - 6\rAction - 7\rRewatchable - 3"}, {"rating": "0", "text": "This movie is not about myth. No epic action as mentioned in other reviews, bad CGI, nothing really interesting. This movie literally does nothing to entertain you."}, {"rating": "9", "text": "An epic, fun, summer movie. My whole family loved it. Reminds of the old Arnold Schwarzenegger movies of the 80's. If you loved the old Conan movies this should entertain you."}, {"rating": "5", "text": "This movie has so much confusing parts. I really walked into that movie thinking im gonna see some gods maybe Hades  maybe Cerberus NOPE!!!!! None of that at all its the  rock with 5 stupid characters fighting some town because the rocks kids and wife die and hes dreaming stupid ass **** this movie should be in the list of a anticipated 2014 movie that sucked right along with godzilla....YUP!"}, {"rating": "9", "text": "I'm simply not understanding how this movie is getting such bad reviews, I thought it was surprisingly awesome, Dwayne Johnson's best performance yet, and overall a nice more realistic spin on the story of Hercules with great action and decent story telling. By no means as bad as most are saying, a solid summer action flick.\r Easily the best Hercules movie, far better than any 300 movie, if this were the early 2000's or late 90's the critics would be raving, but now with such a jaded audience people hardly appreciate anything anymore, sad, def worth a viewing."}, {"rating": "4", "text": "Look, going into a film directed by Ratner and starring The Rock as Hercules shouldn't put expectations too high, yet I was still expecting more than this. The story is lacking, the special effects aren't that special and the characters range from underdeveloped to just plain boring (with the performances either bring hammy or awkward, especially a shrieking princess and her cockney-accent son). There's just much more brawn than brain here, and despite one fun action sequence, it was just too big a Herculean task for Jonnson to pull off [pats self on back]."}, {"rating": "8", "text": "The Rock plays a great action hero and does it again here.  This won't win an Oscar, but if your looking for Hercules to flex his muscles and clobber anyone who gets in his way, you will get what you want.  Two things would have made the movie better, more mythology and a strong villain, but I can't talk about that without spoiling the movie.  I would love to see the Rock do either a 2 movie run or a trilogy with the 12 labors broken up into the films.  Don't let the nay sayers dissuade you from going to this one."}, {"rating": "5", "text": "Whilst Hercules does impress on a technical level - its bland storyline, poor acting, disjointed plot and overlong action sequences only helps strengthen the sour taste from previous cinematic entries of the title character."}, {"rating": "8", "text": "Completely enjoyable film with dashes of humor, a lot of action and a story that doesn't get bogged down.  There are some \"Huh?\" moments, but they do not distract from the watching."}, {"rating": "6", "text": "When the self proclaimed Dwayne \"The Rock\" Johnson graces the silver screen. in Brett Ratner's adaption of the Steve Moore comic, showcasing the titular character that is Hercules. I almost believed every second. Perhaps if not for the overly dramatic battle sequences, cornballish one liners, and some CGI heavy effects that could use some work. That being said, if not for Johnson and Ratner, we probably would be looking at a far worse version of the Kellan Lutz driven vehicle that opened back in January.\r Johnson is the lion-sheep head wearing mercenary in full forced-a hired gun, but also a tabloid of the gods. The answer is that is he human? or god? He travels in style with the realm of a C.S Lewis novel at his side. (Yes, this was a reference to Narnia). Lured by riches, and seeking revenge for the unspecified death of his family.\r At the film's best it reminded me of Zack Snyder's 300, while of course THIS film is rated PG13, so the blood spewing will be put to a minimum and Johnson who has brought life to many franchises including; \"GI Joe\" and \"Fast and Furious\". Is right in the typical macho wheelhouse he is normally accustomed too. When the big ferocious muscle induced hero is fighting the bad guys it all feels right. Brett Ratner (Rush Hour films) knows how to shoot some inept stylized action sequences, which I was engulfed entirely. However after the second battle (Which clocks in at about ten minutes) I was feeling a little fatigued.\r Then, when the somewhat predictable finale the film follows--they expect the audience to be shocked as if we didn't see this coming. Most fans will bypass this flaw, I just kind of shrugged my shoulders and accepted it. The best scenes are the one's when Hercules has too ask himself who he is, and what he is there for. You probably saw this in the trailer \"I AM HERCULES!!!!!\" he shouts to the screen. Somehow during that scene my heart was beating pretty profusely. So, to some extent, the film had an effect on me.\r The latest adaptation of \"Hercules\" was much better then it probably could have been (this is not saying much). I can almost guarantee that it will wash the tireless taste out of the forsaken \"Legend Of Hercules\" out of your mouth. I did actually enjoy the film when it all boils down. Probably because there is just enough plot to inch the film along, and more than enough battle escapades to at least distract me from the much bigger picture, which is probably a horrible film.\r B-\r By: Nate Adams\r Directed By: Brett Ratner\rRated: PG13\rRuntime: 96 mins\rStudio: Paramount Pictures\rRelease Date: July 25th 2014\r Thanks For Stopping By ®"}, {"rating": "8", "text": "A fun movie that entertains. Ian McShane has a few good lines in it. The Rock does a good job in making Hercules heroic and fun.  Not a movie to be taken too seriously"}, {"rating": "10", "text": "If you enjoyed shows like Hercules and Xena, this movie is for you. Excellent battle sequences, great script, fantastic actors (Ingrid Berdal as Atalanta was brilliant)-- the epitome of a great comic book and adventure film. The movie follows the Thrace comics and strips down the Herc myth to make all the characters enjoyable and accessible. Saw it twice, and enjoyed it even more the second time."}, {"rating": "7", "text": "I was pleasantly surprised by this films. I must say though that the advertising was very misleading, it shows in the ads that the movie is mythical and full of CGI monsters, but aside from a few very short moments this isn't the case at all. This film shows a more realistic look at legends and how they are and were probably spread. This to me was a pleasant surprise and featured a very fun supporting cast and a nice original look at the legend of Hercules. Regardless from the ending which contradicted the more original plot of the movie i enjoyed this movie and would suggest it to anyone looking for a fun action flick."}, {"rating": "7", "text": "Overall, even though it starred one of the best entertainers and stars in the business right now, Hercules is definitely one of 2014’s surprises. Yeah, it was a Hercules driven story, but it my eyes it was a completely different take that was so (using that word again) refreshing to see. I thought the characters were so fun to watch as they all made their journey’s as mercenaries. Along their journey included some fights and battles, which like I said, were so entertaining from start to finish. A story, characters, and badass action that in my opinion shouldn’t be missed. I mean, who wouldn’t want to see The Rock as Hercules throw over a freaking horse?!\r Rating: 7.5/10"}, {"rating": "6", "text": "I just took my 13 year old nephew to see this film last night and as soon as I left the theater I was trying to figure out if I liked the movie or not. In this review and others to come, I will always say that the movie lives and dies with the villain. Sometimes the villain can carry a movie to greatness, and sometimes it can hinder the movies progress. This was one of the latter times. First off, when we left the theater, my nephew asked me if I liked it and I told him I was unsure because I loved the supporting cast and the Rock is always fun to see on screen, but I didn't like the villain all that much. His reply sealed it for me when he said...who was the villain.\r As I said, I thought the cast that supported the demigod was great. Rufus Sewell and Ian McShane added much of the needed comic relief, but Aksel Hennie's berserker was a little too much for me. Over all, the cast was the strongest part of this film aside from Dwayne himself.\r In movies like this when we don't get to see the growth of the villain, it does a great disservice to the audience. I get why we didn't with the \"saw that one coming\" twist mid way through, but still, it just didn't work in this film. And what made me the most upset was towards the end, I felt that I was being manipulated, almost forced into hating the villain as he was saying things that would make anyone wanna pop him one. I want to hate the villain on my own terms, I want to come to the end of the film and feel vindicated or saddened at the death of he or she...but here...I couldn't have cared less what happened to him.\r This one is worth a rent, but no need to rush to your local theater to catch it on the big screen. Thanks to the supporting cast and the performance of the Rock, this guy dead lifts an almost 7, but ends up with a 6.\r - James Von Doom"}, {"rating": "9", "text": "I'm a fan of Dwayne \"The Rock\" Johnson so I loved the movie. Pure spectacle, good special effects. You'll have a good time. Worth paying for the movie."}, {"rating": "2", "text": "One or 2 good battle scenes which I always like. Little else to say that's positive. Really didn't like this movie. Wasn't convinced by it at all. Story line is quite bad and doesn't make any historical or mythical sense. I really like the main actor Dwayne Johnson. Was hoping for much better! Wish I had read the reviews before hand. The film makes no cultural sense either. The characters and scenes are more like Xena Warrior Princess rather than approaching anything close to real. Very tacky and make believe!"}, {"rating": "10", "text": "It's a really wonderful action movie and really get into the legend of the character. I don't get what others they want: an epic mythological movie must be really epic action, great beasts and powerful gods. And Hercules is probably the best of this"}, {"rating": "5", "text": "Dwayne Johnson plays the mythical muscleman, but in this case he's just a mighty mortal with good PR. He heads a small band of mercenaries who are hired to quell a war in ancient Greece. This is basically a by-the-numbers action flick (Brett Ratner directed after all) with lots of passable combat…no magic and no Greek gods. There's nothing original or special about the script or the skirmishes, but it doesn't suck."}, {"rating": "9", "text": "I will admit, I went into this movie expecting something different, the trailers are a little deceiving. While it's different from the trailers, it's still an awesome movie. I saw it in IMax non 3D, this movie has lots of great action, and even has a little humor. If there was ever someone that was made to play Hercules it's Dwayne johnson, It made me really want to see more movies like this with him in it. His impressive build gives life to the character and you really believe his strength. Go see the movie, don't listen to all the people hating on it."}, {"rating": "10", "text": "This movie is pure epicness. It show the true power of ancient mythology and brought into cinema. For anyone who dreams of a gof of war movie, here it is. And Dwayne is a great entertainer"}, {"rating": "5", "text": "It all starts so promisingly with remembered stories of some of the famed labours of our eponymous hero. However, after a quick introduction to the man god's background and a whiplash bout of special effects this settles into a training exercise for two rather un excitingly staged battles. Further damage is inflicted by a script that insists on having both Rufus Sewell (who is rather bad actually) and Ian McShane spew forth a lot of unnecessarily sardonic humour. Things do liven up somewhat when the villains are unmasked and Hercules gets to perform his last labour. Overall though, aside from having superior visuals, this is not really any better than the year's earlier sword and sandals opus 'The Legend of Hercules'.\r At the end of this mercifully short epic Ian McShane proclaims ( In a sly dig?) 'The truth about Hercules, I prefer it to the Legend'. I say on this evidence we don't need either of them. Perhaps the film we are waiting for is the one that presents us with those 12 labours. Now that may be worth contemplating."}, {"rating": "10", "text": "Now this is what a comic book movie is suppose to look like: totally like the comics, with epic scenes, best CGI, action scenes that gives goosepumps, solid actors and extraordinary heroes. Hercules could solo the entire Avengers franchise."}, {"rating": "6", "text": "Surprisingly good. Dialog could use some work, but great action scenes and comedy. It knows what it's going for, and hits the spot. Taken as it is, not what you thought it would be, it's a past halfway decent movie."}, {"rating": "9", "text": "Fun, enjoyable, to the point and also among the more believable plots of the summer (seriously, it makes sense once you watch the whole thing). The special fx suffer towards the very end but visually it's solid otherwise. Dialogue is kept simple and the plot twist is again (surprisingly) believable. The supporting cast add to the fun and the rock embodies the conflicted hero/legend/mercenary character pretty well.\rWent for the action, wasn't dissappointed- would have liked to see the supporting cast fleshed out but that would extend the running time so maybe it was a marketing decision.\rHopefully international box office sales warrant a sequel. I fear too many people won't give this a chance because of the Brett Ratner tag in the United States.\r All in all it's a simple , fun and to the point movie without any needless abuse of sexuality or unbelievable plot holes (not glaring ones anyway). Go support the Rock if you're his fan too!"}, {"rating": "5", "text": "Lighthearted action popcorn movie made to appease the professional wrestling fans as they make a mockery of the legendary Greek God Hercules.  How The Rock manages to keep a straight face in this laughable lame script is beyond me.  A nice way for the teenage boys to spend a rainy afternoon.  The shame of it is The Rock is really not a bad actor and deserves a script better than what he is given to work with.  At least he got a paycheck."}, {"rating": "7", "text": "A solid action flick that succeeds thanks to just how likable it's star is, as well as some nice supporting characters and solid violence. Yes Johnson is very likable as the legendary Hercules. He and the humor help save what otherwise would have been too cheesy of a movie to recommend.\r There are still plenty of dumb parts, a couple of elements that were included to be cool instead come off as unintentional comedy, and the plot takes some predictable turns. However it is all still an entertaining ride that has some surprisingly bloody action as well as a unique take on the story. It might not succeed as a epic fantasy movie, but it still proves enjoyable enough to be worth a watch. My total score for the film is a 7.8/10."}, {"rating": "6", "text": "Definitely not a bad movie. But overall I really feel it was a big missed opportunity because of what people typically think of when we see \"Hercules\". I wished the plot would have been more focused on mythical creatures and superhuman strength and greek gods. That being said I do like Dwayne Johnson and thought he did a good job here with great action scenes... just a uninspired story. Overall was hoping the movie would be more epic."}, {"rating": "8", "text": "You know what I really enjoyed this film, I went in expecting to see the rock punching stuff and being awesome, and that is exactly what I got. Does the plot have holes? yes. Is it at times predictable? yes. Is it the most fun a blockbuster has been in a while? yes."}, {"rating": "8", "text": "I went to watch this on big screen with a thought \"this will be just another same old typical hercules movies\". Myth and Zeus are coming together, but it wasn't. In fact, it's the other way around. No Zeus and no demi god, hercules is a mercenary. Nevertheless, i still find this movie pretty good and has a nice storyline. Battle scenes are great too. It still worth my $$."}, {"rating": "10", "text": "i didnt understand the bad rating....really only 47....my god there a lot of films that have deserved a rate of 47 but they become a rate of 90!!!This film has´nt earned this rate. I find  this film great! Dwayne johnson played very well in this film! Good sound top animation.....I think the critics are not serious and you should not take them seriously...This movie has everything you could possibly imagine. Action voltage with a portion of humor .... just awesome!!!!"}, {"rating": "8", "text": "I think the movie is ok for guys just looking for some action and funny moments. Even the story is ok and entertaining. The movie tells the hercules story in a new way. I went into this movie in a 3D theater and the 3D-Effects where really good, the whole movie was in 3D, not just some scenes, like seen in some other 3D movies. This is a solid action Movie. Probably you will forget it rather fast, its not a movie you watch multiple times, but you will get entertained for once."}, {"rating": "10", "text": "Any movie with Dwayne Johnson will be good, even if the script does suck (which in this case it doesn't). The only thing I kinda didn't like was the part of him growing up, it all happened in a flash and we were thrown right into it. Nevertheless it's a action movie and it sure brings you a lot of action. The ending was not as expected so one might assume there will be a sequel."}, {"rating": "0", "text": "The message from the movie story was really good.\rPeople who likes it might really believe myth is not real.\rPeople who hates it might also still accept if myth is never real, like me.\rThe first thought in my head while I finally in the middle of the film was I'm trapped.\rI watched the movie for my good friend.\rI couldn't believe I watch this kind of movie on cinema."}, {"rating": "9", "text": "I really liked this movie. Characters are O.K, storyline is old-fashioned and everything else is placed good.\rCharacters are detailed in the way I like. Good acting (voice acting too). The Rock rocked this movie! Storyline is like the old one and a lot more. I enjoyed watching this 3D and relaxing."}, {"rating": "8", "text": "One of the best mythic films ever. It's strong, funny, intelligent (yes really) and beautiful in sets and costume.\rUnfortunately many critics wanted a simple epic romp so they were disappointed. But if you want a more thoughtful take on how myths are created, see this. A gorgeous hero, and very good secondaries."}, {"rating": "5", "text": "Painfully average in every way... The story, dialogues, acting, soundtrack, all of it is incredibly plain and boring. The cheesiness and stupidity of some scenes made me cringe several times during the projection. The movie has some of the most ridiculous and laughable battle scenes I´ve ever seen, 5 years old child could come up with better choreography and strategies. What I will say is that Dwayne is as Hercules believable but thats pretty much it. Dont waste your time and watch the trailer instead. All the good scenes are in it and it has better music and even story :D"}, {"rating": "4", "text": "I went to the movie with a little bit of hope that this movie would be good, but when the film ended, my first thought was: Why I payed to see this s***?. But i have to say that the director was very courageous to show a different Hercules and to make a huge movie set, but then when you watch the movie you see that the this like another adventure movie you already watched, because it is predictable and boring movie. And I almost forget do I have to mention the visual effects?"}, {"rating": "5", "text": "Has some very cool scenes and Johnson is good but let down by dodgy writing."}, {"rating": "5", "text": "Dwayne \"The Rock\" Johnson certainly has flair for on-screen presence, he embodies the character with amazing physique and intense commitment, but sadly the script material is drab and uninteresting, one that’s inferior to TV show, the likes of Spartacus or Rome. It attempts to humanize Hercules, presenting the man behind the legend, which is quite admirable compared to other grandiose renditions that share the same title or action movies in general that depict superhuman characters. Unfortunately, the plot is highly predictable and aside a few decent skirmishes, it doesn't offer anything notable.\r The story portrays Hercules as a mercenary, although his previous acts and original are usually shrouded by excessive storytelling, which serendipitously benefits him. Along the way it delves deeper on the titular personality, shedding bits of mythical tales to reveal the actual man. This concept is sound, although neither pacing nor screenplay manages to reach that level of accomplishment. In short, it's rather boring. There are far too many similar elements from other adventure movies, even from Johnson's own Scorpion King from last decade, and it's not presented in better fashion. Humor and banter rarely hit the mark, thus making the story build up from first acts stagnant.\r Johnson as the star is an imposing figure, often instilling larger than life persona. How he succeeds in pulling off the worthy Hercules look is half the movie already, and to his credit, Johnson has the heart aside from the brawn. The rest of the cast are fine addition, Hercules' ragtag band of mercenary fits the bill, while John Hurt and Ralph Fiennes round up as the kings. Unfortunately, there's little engaging interaction and what transpire is pretty straightforward. Scenes flow with barely any momentum, they are very slow and plagued by average stereotypical situation.\r Action does happen, even if some spark of brilliance is only sighted for few brief moments. Although scale isn't as big and choreography is average, the battles are still serviceable. Use of CG, and 3D for that matter, is a bit underwhelming. For the beasts are apparently artificial, and as far as debris go, throwing them into audience's eyes is far too outdated underhanded tactic. The movie does take advantage of the mature rating to deliver more visceral combat, it may not be complex, but it has impacts for most part.\r The intention of displaying more human side of Hercules is noble, however with such thin content, the movie is hardly equipped for such profound task. Dwayne Johnson could probably give more to the role, but he is definitely an appealing personality suited to be Hercules. Sadly, there's not much else to the movie."}], "recommendations": ["bloodshot", "the_last_witch_hunter", "the_three_musketeers", "shazam_fury_of_the_gods", "poseidon", "clash_of_the_titans", "guardians_of_the_galaxy", "avengers_age_of_ultron", "thor_the_dark_world", "aquaman", "jack_the_giant_slayer", "jumper", "gods_of_egypt", "the_a_team", "i_am_number_four", "transformers_dark_of_the_moon", "the_suicide_squad", "gemini_man", "underworld_evolution", "riddick", "the_losers", "hancock", "the_scorpion_king", "rampage", "skyscraper"]}