{
  "id": 1118,
  "title": "Hereditary",
  "starring": [
    "Toni Collette",
    "Alex Wolff"
  ],
  "runtime": 128,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "When Ellen, the matriarch of the Graham family, passes away, her daughter's family begins to unravel cryptic and increasingly terrifying secrets about their ancestry.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/u3EEVihxNbFIOvnUkBJIJK93Jcn.jpg",
  "categories": {
    "plot": 1.9772727272727273,
    "acting": 3.142857142857143,
    "ending": 2.5294117647058822,
    "soundtrack": 2.5,
    "cinematography": 0.0,
    "familyFriendly": 3.0,
    "funny": 2.0,
    "action": 1.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "I have no idea what the hype was about. The first 15 minutes were intruging enough but then it becomes slow & boring with a sudden jump scare everyone saw coming (any horror buff worth his/her salt, knows what's coming when a character sticks their head out of a moving car window). Then again it slows down to a snails pace with the most bizarre rushed laughable cliched ending I haven't seen since the 60's.  I expected a lot more especially with the calibre of the actors in the movie and seriously we could've done without the granny/grandad nudity, won't be able to unsee that! The movie reminded me of the highly rated Rosmary's Baby plot, but that's where the similarities end.  Very, Very, Very disappointing."
    },
    {
      "rating": "1",
      "text": "A popular YouTuber (Stuckmanized) when reviewing the second movie installment from this director (Midsommar) admitted when he went to see Hereditary that and I quote: \"On opening weekend I got together tonnes of people to come & see it with me because I wanted to share it with them and none of them liked it, hahahaha cough cough.\"  The reviewer was the only one who enjoyed the movie, (funny how he didn't mention this little tid bit on his Hereditary review video). Sums up what I think about so called professional critics and this movie, they don't seem to relate to the average person, I'm done listening to them."
    },
    {
      "rating": "2",
      "text": "This movie was less of the slow burn suspense thriller-horror that is was advertised as and more or a meandering waste of time just waiting for a MST3K episode. About a quarter of the theater left before the movie ended and everyone else at the end just before the credits rolled. I waited through some of the credits as I was sure I had been Shyamalan'd againThe story was lackluster with no characters being likable and only two being very sympathetic. Half of the movie I found myself hoping something awful would happen to most of the main cast just to get rid of them and move the plot along to something more interesting. There are several major plot holes and multiple instances of \"horror movie logic\". Several things that feel like they will be major plot points early in the film have no real relevance and are only there to set a creepy stage for the rest of the film. A few of the cast members have acting talent shine through during rare moments of this film but with the terrible writing it could not save this one.The music and sound effects in this movie are frequently done hamfistedly. The music will go from low suspenseful rumble, to climactic Jaws is about to appear, to overbearing, to questioning if this will cause long term hearing damage; all with little regard to what is happening on screen. The special effects are all over the place with some being done well and others missing the mark completely. One of the stand outs is a point late in the film that should look like an apparition crawling quickly along the wall and instead looks like a panicked bug in a bed sheet being drug through the background on a wire. When this is part of the final climactic build up for your slow burn horror thriller and several members of the audience can't help but audibly laugh you have failed somewhere along the way.The single redeeming part of this movie is the cinematography. This film has some amazing sweeps and pans that help to guide your focus through whatever the poor writing wants you to feel is important. It has wonderful use of depth of field. There are some beautiful and technically demanding shots including the opening longshot. This is not enough to suggest this movie in its entirety and but may mean shots from this could be used to study cinematography.In the end I can not comprehend the hype on this one. I spent more than an hour after seeing this movie thinking and talking with the person that saw the movie with me. We desperately tried to find some less evident metaphor or greater meaning. Despite our best efforts this is just a poor horror movie with an amazing marketing team."
    },
    {
      "rating": "1",
      "text": "Although I believe that the story had potential, the narrative was a total disaster. I honestly do not understand the critic's notes."
    },
    {
      "rating": "3",
      "text": "Creepy? Yes.  Scary? No. A great story at least? Also no. I did laugh at inappropriate times though."
    },
    {
      "rating": "0",
      "text": "Terrible horror movie. Doesn't really ever get to the point. You feel like you're waiting for the climax but it never happens. The acting is subpar at best and the story is terrible. You'll be more confused and disturbed than scared."
    },
    {
      "rating": "2",
      "text": "The performances were incredible. Film was dragged down by slow pacing with a lack of tension. It couldn't balance the family drama, psychological horror and supernatural horror well, which led to an unintentionally comedic finale. The highs are very high, but it only makes the more consistent lows stand out more"
    },
    {
      "rating": "2",
      "text": "I also joined this site just to be able to thumbs up people who reviewed this negatively. I'm too emotionally and financially drained (after just getting home from spending my one night out a week on this) to have anything coherent to add."
    },
    {
      "rating": "3",
      "text": "Hereditary comes briskly walking out the doors holding promise that we might get a good look into the different ways that people deal with grieving and a possible look at the effects that paranoid schizophrenia can have on those that suffer from it... and then the writer got drunk and accidentally wrote another script in the same file. See... I would be praising this film if I got what I'd been promised from the first act, but the film quickly devolves into becoming just another dumb horror film that lacks in any form of depth from the second act on. The only reason I gave this film a 3/10 was because the first act was good and most other aspects of the film were passable. But the more I think about this film, the more I seem to dislike it. Most other bad films in the supernatural horror genre are at least fun to watch, but there were so many moments that I wanted to walk out of Hereditary. Even if I hadn't gone to see it with somebody else, I still would have refused to leave because I held on to that hope that they might just save the film by bringing it back to what the first act had promised, which is something they never did. If you want to walk out of this film at any point, do it, the film doesn't get better, it only gets worse. If you want to watch this film, I'd wait until it's on one of the major streaming services because it's not at all worth the money it would cost to go to the theater."
    },
    {
      "rating": "1",
      "text": "There are a couple of veteran actors in this film. Their performance is not sub-par. At first glance, the story seems to be inexorably intriguing. Occasionally, a movie is created, and there is a stark absence of any redeeming qualities. \"Hereditary\" falls into this category. Some classic horror films contain some sort of message of hope or light, but not so with this one. It is a hostile, harrowing, disturbing black hole. I still feel ambivalent about even posting this review. There is trepidation that this may actually encourage someone to go out and see the film. I would urge you not to see it at all, because it is relentlessly dark. It is very emotionally draining to watch. There is no excitement. There is no hope in it. There is only blackness. In particular, if you are a believer, don't waste your time on this film. The pervasive feeling of evil crawls into your skin and refuses to leave. Hollywood has decent material that comes out of it from time to time, but \"Hereditary\" is purely and strictly obscene. If you have kids, it is not appropriate at all. Take your family to see \"Ferdinand\" instead. I am not condemning horror films in general. These observations apply specifically to \"Hereditary.\" Don't watch it."
    },
    {
      "rating": "1",
      "text": "Not scary. two hours felt like four. very slow paced. disappointing ending."
    },
    {
      "rating": "1",
      "text": "What. On. Earth. This film has been massively hyped up. The storyline was flat and there were plot holes all over the place. If you haven't seen, don't bother."
    },
    {
      "rating": "2",
      "text": "I created an account on Metacritic just to review this movie, so that should tell you something. It’s a massive disappointment and I’m not sure why it’s getting such rave reviews. Plenty of other movies have had similar plots and handled them in much more interesting ways. The movie takes absolutely forever to get going, and when it does finally start to move a bit, it’s okay at best, and mind-numbingly eyerolling at worst. If you’ve seen more than five horror movies in your life, you’ll decipher the plot within the first act. There are absolutely no interesting surprises here.If you’re looking for a good horror movie, go see either of the Conjuring movies. Much better than this giant heaping pile of disappointment."
    },
    {
      "rating": "0",
      "text": "I don't know how this got such rave reviews. This movie was awful. Probably the worst movie I've seen this year."
    },
    {
      "rating": "2",
      "text": "That was hot garbage. Unless you like pointless plots and needless gore. Terrible film."
    },
    {
      "rating": "2",
      "text": "Deeply silly, like watching a Monty Python film but with a lower budget and less class. I love Toni Collette but she had nothing to work with in this cack-handed mishmash of awfulness that reaches for the elegance of Babadook but collapses into a heap of gibberish. Collette's mom character has to fake anguish and depression (i.e. to herself) but she didn't quite manage to pull it off and just seemed fake, like she was putting in a \"for scale\" performance. The only redeeming factor was Milly Shapiro. Her performance was captivating and the film could have done with a lot more of her in it.The most disturbing thing about Hereditary is that so many people find it disturbing. I shall choose to see it as an allegory for the rise of Donald Trump, which is the only way it makes sense."
    },
    {
      "rating": "0",
      "text": "0 plain and simple. This movie is about as scary as a bowl of jello. The critics must be getting paid off to give this movie a good review. Just like the other stupid A24 movie the witch. Don’t worry about reading spoilers here this movie will spoil 2 hours of your day."
    },
    {
      "rating": "0",
      "text": "I also created a metacritic account just to give this movie a 0.  It's officially the worst movie that has been released during my lifetime so far.  Every negative review you see here is accurate.  Anyone who thought it was good should be ashamed of themself.  What a trashfest.  Words fail me, I am trembling with disappointment, a piece of me has died, all the positive reviews and comparisons to horror classics have obliterated my faith in humanity.  It has single-handedly ruined the horror genre."
    },
    {
      "rating": "0",
      "text": "Possibly the worse 'Horror' film I have ever seen. Extremely boring with only a few scenes with some decent content. What a complete waste of time, that I will never get back & a waste of money. Surely this rubbish isn't what we are now calling horror? If so I fear this was my last! I'm now definitely convinced the critics are paid to give good reviews because no one that understands a quality horror would give this a glowing review?! Do yourselves a favour ,instead of wasting 2 hours bored out of your mind watching this tripe, go & watch some Scooby Doo. Not only  will you be more likely to get more scares, you will probably enjoy it more...."
    },
    {
      "rating": "0",
      "text": "Terrifying movie. Truly frightening. That it got such high scores. Clearly something has possessed the critics/people who gave it a high score. That might even explain the ending. Sigh. Remember Rosemary's Baby (and even the Omen) where you didn't need crap-ass special effects to make something that was really unnerving, just talented writers/directors/actors? I pine for those days. The only way this could be considered clever is if, since it's set in Utah, it's a thinly veiled exploration of Mormonism. I did enjoy muttering, \"You're terrible Muriel,\" every time Toni Collette did something stupid."
    },
    {
      "rating": "3",
      "text": "One of the most disappointing movie experiences I've had in years. The reviews were so positive and the premise made this to appear to be top-knotch film. It started out promising, but the end was so rediculously cliche. The only reason I'm not leaving a 0 is the movie started out quite intriguing. If would have had to leave the movie 15 minutes early I'd probably have left a good review, but I didn't. Oh, well."
    },
    {
      "rating": "4",
      "text": "REALLY overrated. Slow as bloody molasses with a very unsatisfying payoff at the end. Biggest problem for me was not identifying with any of the family members. Toni Collette's a fine actress but playing a very unlikable character, I found it hard to care about her, and the same for her stoned loser son, who by all rights should have had the story told through his eyes--if they weren't so bloodshot. I found The Witch, A Quiet Place, and even Monster with Jennifer Lawrence far creepier than this."
    },
    {
      "rating": "2",
      "text": "Ridiculous and boring plot. Not even scary. Since Gabriel Byrne, Ann Dowd, and Tony Colette are great actors, of course the acting is good, but I can't understand the good reviews for this movie.This film was so hyped up, that it has been my biggest disappointment of the last few years."
    },
    {
      "rating": "5",
      "text": "Overrated. There are a few disturbing scenes but they take a LONG time coming with a whole lot of not much in between. It's a fairly long movie and could easily have been edited down 45 minutes without losing anything. I'm done listening to critics about scary movies, apparently they scare too easily."
    },
    {
      "rating": "2",
      "text": "Not good.  The only redeeming quality was the high quality actors in the movie.  The story and plot was inconsistent and ridiculous.  The film was highly disappointing."
    },
    {
      "rating": "2",
      "text": "Slow and ponderous in the beginning and then totally ridiculous at the end. There were a few genuine scares but I completely did not get the hype. Maybe I've seen too many better made movies in the same ilk."
    },
    {
      "rating": "0",
      "text": "My girlfriend picked this one and she now owes me big. This tired, old storyline was done before. Rosemarys Baby, The Exorcist, The Omen, Rob Zombies Lords of Salem and The Witch are all examples of similar storylines. Been there, done that. This was a boring, slow burn movie that needed narration at the end by a supporting character to explain to the audience what they just sat through two hours for. If you get a chance, miss it or rent it down the road. There were a few shocking scenes, but other than that I was watching a plane crash in slow motion. You know its going to, just not sure whos going to survive it. Thats the main reason I didn't walk out.Two positive things I can say are the acting is good and the cinematography was done well too. It's actually a very, professional well made movie. Just a very boring one with a hokey, trope filled and overused story."
    },
    {
      "rating": "0",
      "text": "I really like horror movies. I was very much looking forward to this when I saw the reviews and Metacritic score. I was ferociously disappointed. What a horrendously bad movie. Gabriel Bryne! Wake up!! Toni Collette settle down there's no more scenery for you to chew on. Story was ridiculous and the audience I was in was laughing at the parts that were supposed to be \"scary\". I've seen at least 10 horror movies in the last 5 years alone that were light years better than this. Oculus anyone?"
    },
    {
      "rating": "3",
      "text": "Can't believe the critics' high marks.  Dull, listless, glacially slow with only a few cheap \"BOO\" moments.  Tangled plot is impossible to follow.  The characters are either chewing the scenery or are impossible patient or detached.  Big disappointment.  Would have left but for the forlorn hope of a clarifying ending and chills that never materialized."
    },
    {
      "rating": "3",
      "text": "This is probably an unpopular opinion, but I honestly don't care: A24 doesn't know how to do horror! Most people seem to think 'The Witch' is absolutely terrifying and amazing whereas I not only found it to be one of THE WORST movies I've ever seen, but also zero percent scary and not even remotely creepy, and I also thought it was the worst unintentional comedy I'd ever seen since 2006s 'The Wicker Man' with Nic Cage! The year after, with 'It Comes at Night', I personally thought that had a much creepier atmosphere and more intriguing premise and was slightly better overall, but the final product left much to be desired. Well, with this latest (and waaayyy too overhyped) addition to A24's filmography, they've once again proven to me that they don't really know a good or truly scary horror movie when they see one, at least in my opinion they don't. Much like 'The Witch' and 'It Comes at Night', it was such a slow burn with little or no horror until the very end, and none of these films have any moments of horror whatsoever if you ask me. Furthermore, it certainly didn't help that not only did this remind me an awful lot of 'The Witch', but it had so many predictable moments and tropes that we've seen time and again in so many previous horror films. Silly-looking naked old people (yep 'The Witch' and 'It Follows' had that too), creepy smiling dead people (the Insidious films did this much better), possessed people climbing walls and hiding in ceiling corners (sounds like just about every possession movie out there), possessed people banging their heads on desks, walls, etc. (seen that a million times), a dog getting killed (A24's infamous for that at this point), a possessed person joining a ridiculous-looking witch-like coven or cult at the very end of the film after most or all of their family's been slaughtered (you guessed it, 'The Witch' did it too!) Overall, the only positive it had going for it was Toni Colette's fierce performance. Everyone else was pretty underwhelming to be honest. And like I said before, this movie just isn't scary and there's literally nothing new to see here that hasn't been done before, whether better or worse. And on one final note: A24, no more horror films please!!! You're just not good at it! I don't care what anyone else says!"
    },
    {
      "rating": "4",
      "text": "What a huge letdown. This movie is a dull, watered down Rosemary's Baby. It tells you exactly what it's about in the first 10 minutes, so it kills any surprise or mystery. The charters are flat, lifeless so never cared about anyone or what happens to them. I did like the little girl's click noise and the gross toys she made. I got a replica of one at my screening, so that was cool. By the end, everyone in my screening was laughing at how goofy the movie had become. Skip this, see a Quiet Place."
    },
    {
      "rating": "1",
      "text": "This was the worst movie I have seen in a long time.  Seriously, I do not know what the critics were watching, but it could not have been the same movie I saw.  I was ready to leave after 15 minutes, hoped it would get better but it got worse.  The actors were not cast well, and I could not have cared less about them.  What was with the odd girl, horrible casting job unless they were going for hideous and someone nobody would care about.  I would not see this again unless I was paid a ton of money.  Go only if you have a serious popcorn craving that you cannot fix at home."
    },
    {
      "rating": "10",
      "text": "An unholy, relentless, demented film that is emotionally torturous and visually deranged. It will make you feel almost defiled after you leave the theater.I have watched a lot of 'critically acclaimed' horror movies. The Witch, The Babadook, It Follows etc... I honestly didn't care for any of them. This movie lived up to the hype. I can't really explain why it's so horrifying, but it just feels so... wrong. The way the film captures absolute grief and despair made my emotions churn, and there are some moments in the final 20 minutes of the film that were absolutely horrifying. Of course, this film is nothing without Toni Collette, who gives a performance worthy of an Academy Award. She walks a very fine line between portraying an emotionally traumatized, psychologically damaged woman and not hamming it up to the point where it's funny. I'm actually not kidding, I think it's one of the best performances from an actress that I have ever seen. Alex Wolff also gives an absolutely wonderful performance. The movie is a slow burn, but it's never boring. It's never pretentious either, which I felt was the case with 'The Witch' and 'It Comes at Night'. I honestly think that it is equal to the Exorcist in its horrific imagery. It's really one of the best horror films I've seen in a very long time, and I highly recommend it."
    },
    {
      "rating": "5",
      "text": "I'm quite an horror movie fan. So I'm not used to over criticize the productions of a genre seldom really good, but often quite enjoyable.That's not the case. Good production, solid actors, but really a total nonsense. Is not scary at all, it's too long, too slow. Maybe there are ambitions of something more of \"just\" an horror movie but is a total failure to me. Movies like \"It Follows\" or \"The Babadook\" are, in quite the same mood, incomparably superior."
    },
    {
      "rating": "3",
      "text": "Look, I like a good thriller like the next guy, but this was a whole lot of nonsense bound by a thinly veiled story line.  I MADE myself watch this whole movie because I expected with all the \"good\" hype, it had to get better ... but it didn't.  Sadly, I can't figure out how to get these 127 minutes back ..."
    },
    {
      "rating": "1",
      "text": "Completely overrated. Felt like losing hours of my life. Toni Collete was the only one who actually delivered some great acting, the rest of the performances were terrible. There were no dencent thrills or good suspence moments (I know it is psychological horror, but there are far better movies like Get Out that actually delivered a far superior experience. This might have been an acceptable movie if it was at most 1 hour long, but they did not have enough material for 2 hours."
    },
    {
      "rating": "3",
      "text": "This is garbage. If you are into poltergeist, and spiritual mumbo jumbo, then this movie is for you. If you are looking for a somewhat coherent plot and a good pay off in the end, the like of Saw or A quiet place, you are going to be disappointed. It has a few good scares though."
    },
    {
      "rating": "1",
      "text": "Garbage convoluted third act (seriously a demon reincarnate? TERRIBLE), Nonsense story, poor characterization, plot holes here and there and lastly terrible pacing. Seriously overrated, critics are deluded. Infinity War destroys this movie for \"Movie of the Year\" award and it's not that good."
    },
    {
      "rating": "0",
      "text": "I despised this movie, it is very boring with no scares whatsoever. The entire movie is illogical and meaningless. Skip this piece of refuse."
    },
    {
      "rating": "1",
      "text": "I found this movie as tedious, boring and disturbing. There is no logic at all- I consider this as of pure waste of time. Just skip it."
    },
    {
      "rating": "1",
      "text": "This was hyped as a horror movie, unfortunately it's more of a physiological thriller with a couple of jump scares and an unintentional comedic ending.  Characters are poorly written and there is no narrative during most of the movie.  The sound effects were very irritating and overly used which is what gave it a sense of foreboding practically throughout, but without any pay off. It tried very hard to be different but ended just being another cliche horror movie in just the last few minutes.  Watch Rosemary's baby, it will show up this movie for what it really is."
    },
    {
      "rating": "3",
      "text": "Hereditary has some good acting and a decent story, but it does not break ground or do anything new for the genre, and with an exceptionally long run time and poor plot pacing and development, this \"horror\" flick falls flat on its face.There isn't much to say outside of my initial summary, this movie had some good acting, some intriguing plot points, and a decent mystery, but I struggle to see how this is being praised the way it is. Hereditary focuses on a family who loses their estranged matriarch, which leads to the grieving family experiencing strange occurrences and haunting scenarios which can only be explained by unravelling the mysterious dark history of their lost loved one. Sound original? Not really, nothing too special here.The plot is interesting at some points, and it is interesting to see how they were able to weave it all together in the final third, but the outlying problem is that it took way too long to get there. There were way too many irrelevant scenes that contributed little to nothing to the plot as a whole, and this caused the movie to drag on through the first two acts. I found myself itching to grab my phone and browse other movies I could watch multiple times because I was absolutely bored out of my mind. I can also barely classify this as a horror film until the last 10-15 minutes of the film when things start to actually pull together and the whole purpose of the movie is finally revealed. Unfortunately, to me, it was not worth the long wait, it started to become obvious and somewhat contrived going into the final act. I never got the feeling of being genuinely terrified or worried for any of the characters because the danger was never really present, on top of this the atmosphere was not really well built, which is absolutely imperative for a horror/thriller to impress. The soundtrack was acceptable, but nothing amazing to build immersion, kind of reminded me of The Shining a bit.Toni Collette did an a pretty good job of portraying her character, she was the most convincing actor in the entire film. Gabriel Byrne, on the other hand, was incredibly disappointing, somewhat because he wasn't involved all that much and his character was bland and underdeveloped... every other character was either acceptable or just \"there\" as they did not contribute much.This film could have been about an hour and twenty minutes and might have been a lot better if they were able to delve into the grandmother's mysterious past a lot sooner because those were the only parts that were able to keep my attention. Trying to put the pieces together before the movie does is most of the fun in a mystery film, when it keeps you guessing, you become entertained, but there was way too much subplot that was getting in the way and destroying the pace of the film. It ruined the entire experience for me.+ Toni Collette's acting+ Matriarch's mystery is intriguing, at first+ Final third is decent- Absolutely abysmal pacing- Not a horror film in my opinion- Way too much subplot- Unnecessary character development- Poor writing and plot climax- \"Disturbing scenes\" are lacklustre- All other actors are subpar, at best- Massively overrated, for what reason?Overall, this movie could have had something interesting on its hands, the initial premise was great, and the story setup from the beginning was good, but the awful pacing, subpar horror/mystery/thriller elements, lack of creepy atmosphere, wasted time, and forced unoriginal ending, make this movie a failure in the eyes of the horror genre. Unfortunately, again, I must mention that critics are really getting it wrong in the entertainment industry right now, 87 is way too high, the only reason I can think of them giving off this rating is simply because they have not seen many horror movies before to notice all unoriginal elements that are present in this film. This movie is a 25 for me."
    },
    {
      "rating": "1",
      "text": "This movie is trash. Please don’t waste 2 hours of your life watching this movie with non-sensical plot. The last 10 minutes of the movie could’ve happened without the preceding first 90 minutes of nonsense. Don’t do this to yourself. -With love,MovieCrocodile •<"
    },
    {
      "rating": "1",
      "text": "What an over hyped movie, the acting was disappointing, Gabriel Byrne's was non existent & Toni Collette was over the top.  Too much time spent on atmosphere rather than plot or story telling, an overly long movie that should have been shorten by 20 minutes at least.  It had a ridiculously rushed laughable ending that left me scratching my head.  Not a movie I'll want to watch again anytime soon and I'm dumbfounded this movie has such a high score."
    },
    {
      "rating": "0",
      "text": "This movie is the biggest pile of **** I've seen in a long while. marketed as a drama/horror movie it fails in every god damn department of being anything else than a steaming pile of f*ck. The ending is so bad I had to go throw up the popcorn I finished 5 minutes into this pile of f*ckWho ever gave this pile of sh*t over 1 should definitely go see a doctor and get their selves aborted, we don't need people like you in this planet."
    },
    {
      "rating": "0",
      "text": "I really can't say much other than, this is the worst movie i have ever seen. The story was so bad. I expected nothing and thats what i got..... nothing!"
    },
    {
      "rating": "5",
      "text": "This has to be one of the most pretentious films I have ever seen with the only thing special about it being that it is a horror film. everything feels like it is done for the sake of doing it and not to actually serve a purpose even though the acting is quite good. It should be no surprise that many pretentious critics would put this as one of their favorite movies of the year. if you're looking to be creeped out for no good damn reason this is the film for you. C-"
    },
    {
      "rating": "0",
      "text": "This is the most overrated film of the year. It's cliched, too long, too boring, and Toni Collette's acting was waaaaay over-the-top. There is literally nothing new to see here but an odd, boring film with really bizarre camera angles."
    },
    {
      "rating": "3",
      "text": "For all the hype this movie received pre-release, it failed to deliver upon so completely that I left the theater almost angry at the fact that I had been so incredibly duped. Hereditary is a slow, plodding, and ultimately boring affair that I couldn't wait to leave behind me. My biggest issue with Hereditary is that it breaks absolutely zero new ground. This movie has been made any number of ways; add to that it hones in only on those who have a fear of spiritual/religious matters. While there are many religious folks left out there to scare with ominous music and a few \"shock\" scenes, the rest of the horror community is totally left out of the gag. Another matter is character development. While aptly acted, I simply didn't care what happened to a single one of these people. They were 2 dimensional as if specifically designed to be horror movie characters. Gabriel Byrne could have been cut from the movie and I'm pretty certain no one would've noticed. Let's hope this is not a trendsetter for the latest wave of horror or we're in for a predictable, dull ride."
    },
    {
      "rating": "1",
      "text": "Awful movie, the only horror element is the possibility of losing 2 hours of your life by watching this movie. I hate jump scares, but even the worst jump scare movies have something happen. Nothing happens in this movie. It was so boring that I was thinking of sleeping or walking out. In our cinema the only reaction to the movie was laughter at how terrible it was. Worst movie I've have ever seen in a cinema. Wish I could get my money and time back."
    }
  ],
  "recommendations": [
    "the_happening",
    "shut_in",
    "the_devil_inside",
    "midsommar",
    "the_mist",
    "annabelle",
    "bird_box",
    "chernobyl_diaries",
    "malignant",
    "paranormal_activity_4",
    "the_strangers",
    "ouija",
    "insidious",
    "house_at_the_end_of_the_street",
    "dark_skies",
    "old",
    "countdown",
    "knowing",
    "summer_of_84",
    "slender_man",
    "devil",
    "the_grudge_2",
    "the_eye",
    "insidious_chapter_2",
    "the_host"
  ]
}