{"id": 4764, "title": "Hereafter", "starring": ["Matt Damon", "Cécile de France"], "runtime": 129, "genre": ["Drama", "Fantasy"], "description": "Three people — a blue-collar American, a French journalist and a London school boy — are touched by death in different ways.", "releaseYear": "2010", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/nOy0X8XSmSDOuwV8pqT70WoWHwT.jpg", "categories": {"plot": 6.333333333333333, "acting": 6.512195121951219, "ending": 5.384615384615385, "soundtrack": 7.25, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 3.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "The movie is definitely a well crafted one than its average. However, \"Hereafter\" doesn't give the strong impressions and profound air compared to Clint Eastwood's (the famous director who directed it) oscar winning movies."}, {"rating": "2", "text": "Take a pillow to the theatre if you want to waste your time and money on this ssslllllooooowwwww motion movie, and the pillow is for sleeping not sitting on.  About halfway through I asked my friend \"when do you think the movie is going to start\"?"}, {"rating": "2", "text": "This is really the first Clint Eastwood movie I have taken a strong, strong disliking for. It's got an interesting enough premise, dealing with what happens after you die, but the execution and acting just never came together ot make anything that was believable or thought provoking. None of the three storylines quite work, though Damon does try his hardest as a lovesick psychic, but he's still just phoning this performance in. Especially painful to watch are the women, Cecil de France and Bryce Dallas Howard, who just kind of obnoxious props in the overall storyline, and lack any depth. The ending is contrived, the special effects lackluster, and I really hope Eastwood gets a chance to redeem himself after this mess."}, {"rating": "1", "text": "I heard this was a tear jerker.  The only time I cried was when I paid $8 for nachos.  A 4&1/2 star rating is ridiculous.  I was boared for 2 hours and was very disappointed in Eastwood's direction.  So much more could have been done with this topic."}, {"rating": "3", "text": "It was highly recommended by a friend. I was, to put it mildly, deeply disappointed. It simply goes nowhere--very, very slowly. The ending's the biggest yawn of all. If you've liked Eastwood's work up to now, don't ruin those good feelings by seeing this one."}, {"rating": "2", "text": "No complaints about the acting or really directing... this movie fails b/c it's a bad story. If you're like me and thought this movie might shed some interesting perspective on life and death than you ignored the bad reviews and went anyway. I'm going to do you a solid and tell you that there is nothing interesting about this movie. It's two hours of depressing scenes and no pay off at the end. Most movies take you on a roller coaster.. happy, sad, happy, sad, finally happy. This movies is sad, sad, sad, sad, and kind of not sad at the end. It's just not an enjoyable experience."}, {"rating": "10", "text": "Good George Lonegan; he has a good will, integrity and compassion, someone who is probably too honest to be a psychic. In a field, or rather, a pseudo-profession, loaded with charlatans and quacks eager to bilk their clients with fallacious readings, George is the rare exception; he's for real, as his website advertises, this forklift operator, this weirdo with the gift, can genuinely speak to the dead: not in tongues, not as another person, and not with the usual theatrics and accouterments one would associate with readings. The most fascinating aspect about George, and \"Hereafter\", is that we're not necessarily dealing with a Christian, or the Judeo-Christian concept of heaven. Look all you want, high and low, in the foggy landscape of the souls that the near-dead(Marie Lelay, a French reporter who survives a tsunami, played by Cecile de France), and the instrument for the dead(our hero) have seen, or have access to, because God, \"our\" God, so to speak, the western model, is not necessarily in the diegetical details. The third protagonist, the emotionally dead(Marcus, a young English lad who is left behind with a drug-addled mother after his identical twin gets hit by a car, played by Frankie McLaren), in this filmmaker's beautifully executed triptych of incidental stories, attends a Christian funeral that is quickly replaced by a Hindu one, as a way to democratize the world religions, both east and west. George might be an agnostic, or perhaps, polytheistic. He makes no claim on knowing where all those souls he divines ultimately ascend towards. For spiritual nourishment, he turns to Charles Dickens, not the bible, or any other religious text. Enigmatic and stony, the moviegoer knows one thing for sure, the man is tired. While the hunting in the hereafter was good, George quit, when being a creep finally took its toll. Played by Matt Damon, who achieved stardom back in 1997 portraying the same sort of damaged person in hiding, the blue collar savant of Gus Van Sant's \"Good Will Hunting\"(the janitor at MIT with a prodigious knack for mathematics and getting angry), differs from the wicked smaht maintenance worker in this key respect; he attitudinizes among the riffraff as a way of being alone, rather than to be part of a community(working-class Boston), a tribe. Both characters have best friends(in George's case, an older brother), nagging consciences at their disposal, the people knowledgeable enough to be horrified, by what they perceive to be as their buddy/brother's gross underachieving at dead end jobs. In \"Good Will Hunting\", Chuckie(Affleck) tells Will, \"It'd be an insult if you're still here in twenty years,\" whereas Billy(Jay Mohr) reassures good George Lonegan that the chaos which surrounded their first go-around at the family business has been eliminated from the revamped organizational model. But math isn't a curse. George lives alone, eats alone, and sleeps alone, because unlike most psychics, the scam artists who tell people what they WANT to hear, the Victorian literature buff tells people what they NEED to hear. Against his better judgement, George relents and grants the woman he brings home from a non-credit course in Italian cuisine, Melanie(Bryce Dallas Howard), from Pittsburgh, a reading, and in the process, destroys, what he thinks, is his best and last chance for love. Partly out of anger, a momentary flare-up(shades of Will Hunting, perhaps), since Victoria prodded George to perform with such insistence, but mostly out of his inborn humaneness, the reluctant psychic transmits an apology from Melanie's father, who had apparently molested his daughter as a child. The fatalism of George's situation is unbearable; he's compelled to tell the truth, but the truth, as well all know, hurts, and as the words tumble out of his mouth, good George Lonegan knows the consequences from prior experiences in dealing with intimacy this potent. In all likelihood, she'll never talk to him again, but it's more important to him that the woman attains peace of mind...someday. And sure enough, Melanie is a no-show at the next class. Looking for answers, George ventures out on a literature-based pilgrimage to the U.K., where he visits a church of sorts, Charles Dickens' house, and with further extrapolation, a secularized miracle occurs, the reader of his audio-books, Derek Jacobi(read: priest), just happens to be making a public appearance at the London Book Fair. That's where the instrument for the dead converges with the near-dead and the emotionally dead, in which the trio of depressed strangers teach each other how to be alive again. It's not the holy ghost, but the ghost of Charles Dickens who looks over these sad, lonely people, and that's the subversive genius of \"Hereafter\". George Lonegan knows that life doesn't end after death, but he believes in \"Little Dorrit\" more than Jesus Christ."}, {"rating": "0", "text": "This movie is bad because of story not because of acting or directing. Kept looking at my clock wanting it to end it seemed really slow. Also with this story their was a lot more that could have been done but instead their where a lot of scenes that I considered not exactly important to the story."}, {"rating": "3", "text": "The film begins with some unimaginably bad special effects, and does not get much better from there. The plot is contrived and schmaltzy, but the actors do what they can with a script that was literally unfinished."}, {"rating": "10", "text": "To be fair, this is a lousy movie, but its more interesting as a subconscious message from Clint Eastwood stating that when you hit 80 years old, suddenly accepting things like psychics and spirits provide a psychological comfort. Sometimes watching the personal issues of a filmmaker translate onto the screen is an delightful experience that makes good art. This is just not one of those times.  Sorry Clint, this is a sour and ironic note to go out on if its you final film."}, {"rating": "9", "text": "This is a solid film. This is the type of film that is missing in Hollywood, where directors direct to tell a story with solid characters and strong themes. So great job Warner Bros and Clint Eastwood. This is also a great movie for people who like interlocking stories and kudos to the film for its bravery in using subtitles, and use of locations other than the United States. Matt Damon did a fine job and I don't think this would have been as strong or as intriguing of a movie without him. I hope to see more of these types of films come out of Hollywood."}, {"rating": "8", "text": "A solid and subtle movie about people and their beliefs. Very well crafted, with good acting, artfully done cinematics, a good script, and an emotionally driven story. I normally don't like Clint Eastwood films, because they lack subtlety and the acting is usually horrible, but this film along with Million Dollar baby are changing the way I feel about his films.  Would have given it a 10, but the way everything comes together at the end felt forced and unrealistic to me."}, {"rating": "4", "text": "The near death experience is what we the viewer suffer when we sit through this unthoughtful, boring, and needless film. This was not about the hereafter but I can't tell you what it was really trying to say. It follows the experiences of three people in a fashion that made you wish they were dead. You knew the ending after the first half hour but you just wished it was not going to end the way you thought. The backing sound track got worst as the movie reached a climax. This is a big time flop."}, {"rating": "10", "text": "Anyone wanting to find out or curious about the Hereafter; DON'T WASTE YOU TIME!\rWHY ABOUT 30% OF THE FILM WAS IN SUBTITLES IS BEYOND ME. ESPECIALLY WHEN THE FRENCH CHARACTER'S SPOKE ENGLISH. All this story is about is a 10 year old boy who's brother die's and a Frenchwriter.\rHMMM...MAYBE THERE'S A PART 2 COMING? NOT."}, {"rating": "10", "text": "Well thought out, with excellent character developement. It comes together beautifully and points out that we have purpose in life , that life's events happen for a reason, sans coincidence"}, {"rating": "3", "text": "I'm surprised this movie hasn't gotten more bad reviews. The only part of the story I liked was the little boy who lost his twin brother. Every other character felt completely random, unnecessary, or was just horribly performed. The movie kept trying to force everything to fit together. My friend and I had to laugh at the whole movie to get through the boring stupidity."}, {"rating": "7", "text": "A Film Review By: Sam Fragosoâ"}, {"rating": "0", "text": "I turned it off after 55 minutes...wait, or did I fall asleep ? The beginning was pretty good, but that lasted for only about 5 minutes. From then on, it slooooooooowwwwwedddddd down. I felt like somebody being put under hypnosis, my eyelids getting heavy...\rReally depressing movie, no insights or fresh thoughts whatsoever. Plus, Matt Damon is getting fat."}, {"rating": "10", "text": "â"}, {"rating": "7", "text": "As befitting his age Clint Eastwood is not concerned about rapid pacing in trying to tell a story. Obviously having pondered what greets us after death he employs Matt Damon as a reluctant psychic to delve into this mystery, while casting a French actress in one of the leading roles as a famous TV broadcaster who is thrust in to a world she had not dreamt of before. Excellent acting all around. But there's no huge drama to sink into, and a rather languid pace and a challenging subject for skeptics which probably results in turning a lot of people off and generating negative reviews. All in all another work of art from a great director."}, {"rating": "5", "text": "When you have 3 stories, none of which are particularly exciting on their own merit, it is hard to get them to become a great story especially since they are so loosely connected.  Clint seems to be out of his depth here, quite shallow spiritually and incapable of delivering a complex scenario convincingly.  Nevertheless, there are still masterful takes, like the opening tsunami scene."}, {"rating": "10", "text": "At 80, Eastwood has made perhaps his most internal and thoughtful film yet. The movie is a meditation on the questions and the mysteries about death and the afterlife. Introspection is not really something we're accustomed to doing much of anymore, as our culture tends to reward idiocy and silliness more than anything else, so it's understandable to me why some audiences would find this to be depressing or lousy, but really it's not. It's a very moving film for viewers who appreciate something a little more intelligent than usual. One of the year's best."}, {"rating": "7", "text": "The tsunami that launches this film is simply riveting. It promises a masterful film experience that slowly falls apart and ends in a confusing, disappointing ending. The plots revolve around two people who have close experience with death and a reluctant psychic (Matt Damon). Their intensely personal struggles are absorbingâ"}, {"rating": "7", "text": "Eastwood has established his film directing style solely on high tension, character progressing dramas that either brings up a question which involves the right of moral obligation or gives a conventional meaning that looks deeper into the human soul. In basically almost all of his films it continues on the exploration of human behavior which we can never fully answer, but can come closer to a better understanding of it. Eastwood hasnâ"}, {"rating": "10", "text": "I have seldom been so moved by a film. Eastwood efficiently takes the right amount of time to tell the story and fully explore the characters.What a marvelous ensemble cast! I will definitely see it again."}, {"rating": "10", "text": "As usual Clint Eastwood shows he is one of the few extraordinary directors of our times. He treats subject matters that not many people are educated or intelligent enough to understand. What he shows is truth, has been proven but not accepted by the medical world....that's why you should go, see this movie, get educated and open minded. Mr. Eastwood is a great American director, the best."}, {"rating": "9", "text": "Quick comment on the complaint \"30%\" of the film is subtitled --- it's hardly that much, and kudos to Clint Eastwood for having French people speak French in France where a portion of the story takes place."}, {"rating": "10", "text": "TOO SLOW for me, great cast, and a few interesting parts, but never finished anything.\rThe best contribution Clint Eastwood made was the music. I hope you wait for the DVD rental."}, {"rating": "8", "text": "I can't figure out why this movie is getting such mediocre reviews.I loved this movie and a lot of my friends have also.It was such an interesting and unique story. My only complaint was the kid was not  a good actor at all.I would recommend it."}, {"rating": "8", "text": "This movie may be a victim of bad marketing.  The trailers gave me the impression that this was a movie discussing about what happens after we leave earth with a lot of supernatural elements, which it is not.  Clint Eastwood is one of my favorite directors.  He has the gift to tell a great story with beauty and thoughtfulness and Hereafter is no exception.  The characters are well developed and interesting and enjoyed where they took me."}, {"rating": "3", "text": "What a snoozer, I didn't care for the story line one bit, found myself looking at my watch to see how much more I must endure.  I should have left after previews of coming attractions."}, {"rating": "10", "text": "I have to disagree with just about everyone. All the critics say that Eastwood doesn't take a position on the afterlife but everything in the movie was about the truth of an afterlife. I thought the movie was well acted, made complete sense and was very enjoyable. I'd give it a 90 out of a 100."}, {"rating": "0", "text": "I went to this movie on a whim. It lasted about 2.5 hours. I left not knowing what the point of the movie was at all. It felt as if there was no plot, no conflict, no nothing. I caught myself thinking of all the more interesting avenues the director/writers could have taken. I've seen a lot of movies, this is the new champion for being the least stimulating."}, {"rating": "1", "text": "The movie was very disappointing. I was expecting a really good paced drama, but it was boring. There were several people snoring in the theater, and the payoff never really does. Clint Eastwood wasn't really able to weave all the characters together in the end. The best part of the movie is the 1st 20 mintues."}, {"rating": "10", "text": "This is Clint Eastwood's best movie since his directorial debut with \"Play Misty for Me.\"  To be fair, I have loathed many of Eastwood's movies, from \"True Crime\" to \"Absolute Power\" to \"Gran Torino,\" but this one hits every jackpot, from great acting to great CGI effects to great and deeply moving drama to occasional offbeat humor.  It's Eastwood at his absolute peak."}, {"rating": "8", "text": "Clint Eastwood always does an amazing job telling stories. This film was great. It was very emotional and interesting. Matt Damon really shines in this movie, along with supporting actors George and Frankie McLaren. The special effects weren't amazing, especially when compared to other movies, yet I still felt the suspense. There were some things left unresolved in the end, but I think it was done purposely to make the audience think and create their own conclusions. Overall it was a beautifully directed film with strong themes and brilliant acting."}, {"rating": "4", "text": "A very disappointing Eastwood film. It's interesting enough on first viewing, but immediately fades from memory. The main problem is that the movie builds up it's huge moment of inevitable catharsis and then doesn't really deliver. The Eastwood penned soundtrack is also quite dire."}, {"rating": "10", "text": "This is a superb movie.  I didn't go see it because of the mediocre reviews, but I'm so glad I rented it as a DVD.  The different characters' stories are artfully inter-woven and all the actors--especially Matt Damon and the young boy who plays Marcus is excellent.  I couldn't have enjoyed it more.  Do not pass it by."}, {"rating": "8", "text": "I saw this move recently and... well... we all noticed that the music also the topic are ''Clint Eastwood''.... yes of course he has a great personality and very defined one to tell us that he was there. I love the way Eastwood makes us ''feel'' what every each and single character on the film feels in the moment it being felt... is nice how to 3 perfect strangers can help each other... how the big pains in life can be in a way solved... is like a little light in the darkness... when you think you'll never get your life back again (it happens to the 3 of them in fact), when you think all you do is worthless... when you're really REALLY dissapointed with life gave to you and you deny of that... there's someone like you... waiting to feel complete... and you remember you're not alone and then everything falls into place with just a little... handshake.Of course... almost forgot... the actors, amazing, thanks Clint for this lovely movie! No need to remind us the great director (and compositor!) you are!"}, {"rating": "10", "text": "This movie is a piece of cinematic perfection that will probably go un-appriciated by the mass audience and even the film adepts for many years. Then given time and well after Clint Eastwood has passed (20 years rings for me), people will look back and be stunned at the sheer mastery of cinematic presentation.\r For me this movie captured the essence of what cinema can capture and express as an art form. We often go to movies to be entertained and this is only what we want/expect from cinema. When something can fundementally effect us other than soley just entertaining our senses for a brief moment, this is when the medium changes from that which is something we just watch to something that connects us to something else. What that \"else\" is I leave to be experienced by those who are able to experience it, as it can be something almost indescribable. When it's the right time and when you are ready you'll see what I am talking about. Until then this will be just another film, forgoten and left to the past."}, {"rating": "4", "text": "Somewhere, deep within Peter Morgan's screenplay for Hereafter is a good story about three lonely souls connected only by death. The problem, when you have to resort to a premise of \"hey, what would it be like if there really was a genuine psychic out there?\" to bind it together, is that a promising, meaningful human drama is reduced to the level of whimsical fantasy, but (thanks to its admittedly well-executed documentary style) with none of the wonder and joy that might otherwise entail. It's a shame that it falls to such a capricious tale to depict real world events such as the Boxing Day tsunami and, to a lesser extent, the 7/7 London bombings for the first time in mainstream cinema. On the plus side, this is probably as good a film about a real-life honest-to-goodness psychic as it's possibly to make. One wonders who Eastwood was able to assemble so much talent (himself included) around such patent nonsense. You'd be better of re-watching Ghost. Its sugary sentimentality all the better to suspend your disbelief."}, {"rating": "2", "text": "I watched all of EC movies and i dont understand what happened here. Its so long and unnecessarily slow. Story is full of potential but dull performance and uninventive story progress is very disappointing..."}, {"rating": "6", "text": "To be honest, i find this movie rather boring yet interesting at the same time. The characters aren't interesting enough for you to actually be invested into them. All except the little boy who lost his twin (i can't even remember his name)It is interesting in a sense that you want to find out how these 3 characters meet in the end.Other than that, the stories about their lives aren't interesting enough. You don't really see what compels them, only the reasons stated on the surface. You can of course dig deeper and make assumptions, but the long and weirdly placed cuts distracts you before you do so."}, {"rating": "8", "text": "Clint Eastwood is thinking about mortality.  I don't assume it's because he is 80 years old, but he found a story by Peter Morgan (The Queen, Frost/Nixon) which he really felt a connection with and decided to make it into a film.  Hereafter includes two real life events, the 2004 Southeast Asian tsunami and the 2005 London underground bombings, and follows three different main characters and how they are affected by events which shape their thoughts on mortality and what may come afterwards.\r The three main characters are geographically separated.  One is a French newscaster who was personally caught up in the tsunami.  The second is a young British boy who does not know how to function or what to do after his twin brother is suddenly killed.  The third is Matt Damon, the American, who has the ability to make connections with people and interact with their loved ones who are in the hereafter.  He views it as a curse, not a gift.\r Each character encounters different reactions as they attempt to discuss what happened to them and there are some moments concerning different nationalities and how they may respond to the idea of a hereafter.  The French are very intellectual and in the film view the idea of a hereafter as a subject which serious people do not discuss and these visions of an afterlife are most likely the result of a concussion.  The British, on the other hand, are shown through a montage sequence of various charlatans and fake psychics as they extort money from people looking for answers.  The American, who actually has the ability, wants nothing to do with it and tries very hard to keep it hidden.\r I knew beforehand it was a Clint Eastwood film, but if I did not know that, I still would have attached his name to it.  The music which was so memorable from Gran Torino and Million Dollar Baby is back again and the long, contemplative shots of the characters trying to make sense of things are here as well.  The two young British actors who play the twins, Frankie and George McLaren, are outstanding in their first acting roles and contribute a big emotional weight.  The lighting, especially in Matt Damon's scenes in his apartment and in his hotel room, is way too dark.  It is side and back lit and much too harsh.\r Hereafter has some bad luck as its video release is the same week as the Japanese tsunami.  There is a very realistic tsunami wave in this movie; however, it is brief and early on.  To label it a 'tsunami movie' is very misleading and a discredit to what Eastwood is trying to discuss.  Eastwood's previous, recent films are better than Hereafter, but this movie is still far superior than the vast majority of its competitors."}, {"rating": "3", "text": "This had mixed review but because Robert Ebert of Chicago sun times gave it a 100 i had to check it out. After watching the movie i can now honestly say that i can no longer rely on Ebert s reviews. This movie had so so much potential. Matt Damon is a great actor and that can be seen in this movie. I don't know what when wrong. There are 3 stories where one of them should have been erased from the movie and then surely the movie could be edited enough to create a worthy story. If you want to know how a beautiful shot and great acted movie can be so bad , then watch it, if you want  a good movie, then  , with some regret, please give this a miss. Sorry Damon, but you need to choose your director and producer better and not rely on what, was possibly, a great script. And shame on you Egbert for being so so wrong."}, {"rating": "6", "text": "Clint Eastwood's movie doesn't suffer from bad acting or a poor score, even the idea of the story is interesting, but it is how it is presented that hinder this movie. For one, each character has somewhat interesting back stories, but overall just are not that interesting. I cared only slightly for one of the characters, that being the young kid. The movie constantly switches back and forth in a three way rotation cycle, that makes the movie seem very, very slow. It is somewhat interesting how they come together in the end though. The only thing that makes this movie worth a good viewing is the message that is portrayed, and truly left me thinking. I did feel that Eastwood's emotions were portrayed very well. But I can only give it a 6/10."}, {"rating": "0", "text": "The WORST movie I have seen in years. Too many subtitles, and English lack of personality. I actually wanted to shoot myself, instead of watching the rest of this movie.\rLove Clint Eastwood, Love Matt Damon, Love the English, hated this movie with a passion.\rIt should be taken off the shelf for false advertising. You think Clint Eastwood, you think Matt Damon, you think good movie. Not in this case, not even close."}, {"rating": "3", "text": "There was something indescribably off about this movie. I still can't put my finger on it. Music? Script ? Acting? I'm as curious about the subject as anyone else (Don't let anyone tell you that they aren't interested at all about what happens. They are just trying to be cool.) but in the end Clint comes very short of ever engaging and convincing you about this story. I knew I was Here as I watched this movie attempting to be a film, but I just couldn't wait until After!! I gave it a 3 because of the Tsunami scene (for effects, not carnage) and Cecile De France was real easy to look at."}, {"rating": "5", "text": "I felt very disappointed with this movie. I was expecting great things with the cast/director however the whole movie left a little flat and disjointed. I didn't warm towards any of the characters with the exception of the kid and the ending was ridiculous."}, {"rating": "9", "text": "This is an overlooked gem. If you do not expect something that pompously tries to offer to solutions that no one honestly can, you actually will find a humbler, charming meditation on loss and fear of loneliness. It has a spare but authentic look, features some wonderful scenes between very credulous characters, and offers a hopeful, instead of outright \"happy,\" ending.  As a plus, the scenes of Paris, London, and the amazing opening of a tsunami disaster are gorgeous. No doubt about it, it is a slowly evolving picture; we find out about the characters over time, not all at once, but I never was distracted or bored. The only off-key to me was the music near the end.... whose sudden easy jazz sound was nothing like the mood of the film."}], "recommendations": ["the_good_shepherd", "the_butterfly_effect", "no_country_for_old_men", "the_curious_case_of_benjamin_button", "revolutionary_road", "her", "unbroken", "the_machinist", "manchester_by_the_sea", "the_prestige", "the_social_network", "pay_it_forward", "the_american", "predestination", "there_will_be_blood", "collateral_beauty", "hugo", "the_gambler", "tinker_tailor_soldier_spy", "fight_club", "the_accountant", "the_adjustment_bureau", "the_book_thief", "the_giver", "split"]}