{
  "id": 1337,
  "title": "Hidden Figures",
  "starring": [
    "Taraji P. Henson",
    "Octavia Spencer"
  ],
  "runtime": 127,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "The untold story of Katherine G. Johnson, Dorothy Vaughan and Mary Jackson – brilliant African-American women working at NASA and serving as the brains behind one of the greatest operations in history – the launch of astronaut John Glenn into orbit. The visionary trio crossed all gender and race lines to inspire generations to dream big.",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9lfz2W2uGjyow3am00rsPJ8iOyq.jpg",
  "categories": {
    "plot": 7.543859649122807,
    "acting": 7.3,
    "ending": 7.166666666666667,
    "soundtrack": 9.0,
    "cinematography": 7.636363636363637,
    "familyFriendly": 7.444444444444445,
    "funny": 8.285714285714286,
    "action": 7.75
  },
  "reviews": [
    {
      "rating": "9",
      "text": "So, if you like a little bit of NASA history and if you are a computer software developer like me, 35 years, then this movie is a perfect historical backdrop. If you like well-made, enjoyable movies that a treat to the mind, the heart and the soul, then this is the movie. If you like good acting, good story-telling and a glimpse of the what racial segregation used to be like, than this is your movie. The only reason I didn't give this a movie a 10 and gave it a 9 instead is, because at times the movie tries to hard. It didn't need to, but it's definitely worth seeing. Enjoy."
    },
    {
      "rating": "6",
      "text": "Hidden Figures is a story that deserves to be told, and it is told perfectly well by a decent cast, although there´s nothing in this formulatic biopic to lift it above average status and make it truly stand out."
    },
    {
      "rating": "9",
      "text": "Real life drama that has a complacent taste but well compensated with remarkable roles, and a story of struggle against prejudice. Perchance a black horse of Academy Awards."
    },
    {
      "rating": "10",
      "text": "No words to describe how brilliant in every aspect of a movie ! This ought to be the biggest inspiration of a colored american dream to achieve."
    },
    {
      "rating": "1",
      "text": "Lord, let us give thanks for the miracle you have given us in your infinite wisdom, generosity, and mercy. Lord, thank you for blessing the world with Janelle Monae and her wide range of talents.Why Spencer nominated？"
    },
    {
      "rating": "4",
      "text": "Does this deserve a Best Picture nomination, Best Supporting Actress nomination? No. Did it get one by affirmative action? Undoubtedly yes. Yet it is a good true story and well made and is the same kind of popular entertainment that has a good message but was not a huge sensational blockbuster (those often get overlooked by the sheep at The Academy) like such past hit nominees that didn't deserve it \"The Help\", \"Seabiscuit\", \"The Cider House Rules\", \"Awakenings\", \"Dead Poets Society\" etc."
    },
    {
      "rating": "6",
      "text": "First thing's first, it's an uplifting and inspiring story, but nonetheless, it's also a very formulaic, by-the-numbers crowd pleaser as well. Taraji P. Henson, Octavia Spencer, and Janelle Monae all give fine performances as the titular characters, as do Kevin Costner, Kirsten Dunst, Mahershala Ali, Jim Parsons, etc in supporting roles, but they simply can't help the film feel like nothing more than a predictable narrative and formula we've seen too many times before. I also honestly found the overall film, the score/music choice in particular very corny. Overall, it's definitely a feel-good film with an inspiring true story with some dedicated performances from great actors and actresses, but don't go in expecting anything extraordinary in terms of the inspiring true story subgenre."
    },
    {
      "rating": "6",
      "text": "Does this deserve a Best Picture nomination?  No.  Did it get one by affirmative action?  Undoubtedly yes.  Yet it is a good true story and well made and is the same kind of popular entertainment that has a good message but was not a huge sensational blockbuster (those often get overlooked by the sheep at The Academy) like such past hit nominees that didn't deserve it \"The Help\", \"Seabiscuit\", \"The Cider House Rules\", \"Awakenings\", \"Dead Poets Society\" etc.  The Academy goes for either high brow pretension or sugar coated schmaltz with a good moral message.  And yes it does go for undeniably great benchmark films too.  This picture falls squarely into the second category.  All the players are good.  Costner seems perfect for his part.  It's a nice movie about race in America during the sixties and the space race that was of the same period.  It blends the two subjects perfectly."
    },
    {
      "rating": "0",
      "text": "Yet another \"based on true events\" (i.e. pretty much totally false) racial pandering Oscar bait flick. They are pretty much cranked out 2-3 per year by formula these days.FYI: my uncle used to do ballistic calculations similar to those done by Katherine Johnson for a major defense firm. He said it was the most boring, mind-numbing job he'd ever had, \"basically like being a mathematics janitor\". You're mostly just checking and double-checking math results that an early (hence somewhat unreliable) computer spit out.Frankly movies like this do blacks a grave disservice, just like that one about the African \"math genius\" who in reality is a mediocre club-level player who peaked at age 19 and only won awards through affirmative action. Revisionist history might sell, but it won't actually enlighten people who are interested about the true history of race in America."
    },
    {
      "rating": "6",
      "text": "It's innocent by-the-numbers stuff with charming performances from a stellar cast. If that's all you go in wanting, then you'll get everything you want. Anyone who wants something risky or new best look elsewhere."
    },
    {
      "rating": "10",
      "text": "Tremendous mythmaking of the highest order!  Having lived thru much of the actual history, I'm aware accuracy is of interest AND composing a Progressive myth, based on accurate history is high art.  The script has the good fortune of facts telling a story of the epic struggle of educated blacks to be accepted at NASA against the backdrop of more facts, the epic courage of the early American astronauts and NASA administrators.  The high point for me occurs when Kevin Costner takes a metal crowbar to the sign \"Colored's Bathroom\" with 15 colored women, the \"computers\" watching.  Wow.  Priceless mythmaking of the highest order, small personal acts of courage and justice demonstrating and highlighting more truly human values than the norms of mainstream culture.  The cast and direction is flawless in my humble opinion."
    },
    {
      "rating": "7",
      "text": "Hidden Figures tells a story that, in a world of gender and racial equality, would already be known worldwide. It is at times comedic, and fun, but never shy's away from demonstrating the harsh realities of society."
    },
    {
      "rating": "10",
      "text": "Such a great movie! It is such an incredible story that most of us had no idea about. It was inspirational, funny, and all around a must see movie for this year."
    },
    {
      "rating": "0",
      "text": "Boring. Spancer is very BAD. The actress never appears to fully connect with the character, delivering a series of doleful little-girl-lost poses — and, later, pantomimed iron-jawed determination."
    },
    {
      "rating": "10",
      "text": "Excellent film with stellar performances from Costner, Spencer and Monae. Taraji P. Henson, however, delivers her finest cinematic work yet! Best movie of the year by far!"
    },
    {
      "rating": "9",
      "text": "A flat-out winner and incredible crowd-pleaser that fires on virtually every cylinder. With the possible exception of the need for a better-developed back story, this inspiring, thoughtful and humorous historical drama hits all the right notes and does so without going over the top, becoming preachy or lapsing into heavy-duty schmaltz. The picture's incisive script and superb ensemble cast performances make this one to see."
    },
    {
      "rating": "7",
      "text": "This is just an enjoyable feel good film that does not deserve an Oscar nomination for Best Picture. It is enjoyable and you do learn something. However, the rough edges are scrubbed down and the film is sanitized. I wonder if this is done so that more white audiences will feel comfortable. The film is predictable and is a color by numbers effort. That said, I enjoyed it but never felt challenged or unsure of where it was taking me."
    },
    {
      "rating": "8",
      "text": "The other side story of the historic event!This film did not just represented the black people, but the women as well. Today we talk about discrimination against women, though this film is an example that it all had started way long ago, yet the struggle has not ended. Anyway, this is a biopic, a biopic of three women and their struggle not just being a black, but being women. When the nation was eager to send its first man to the space, there was some trouble within the team who are behind it to work together as one. Lots of inspiring events reveal how the history was made and the working culture was changed forever inside the NASA.The film was nominated for the Oscars in the three slots, but did not win any. That's fine, because I would prefer those real women to be recognised over what this film had achieved. All the three actresses were good. Their roles were unique from one another. Really a wonder film about three real persons in one film. Something rare in films to highlight their achievements equally. The personal life, as well as their professional was well briefed.The others like Kevin and Dunst in small part were also good. Directed by just a one film old filmmaker. He did good. The screenplay was adapted from the book of the same name. Deserved all the awards and praises it had received. After seeing how it had ended, a sequel could be possible. Mission Moon. I hope they would consider it! Seems a nice idea!8/10"
    },
    {
      "rating": "7",
      "text": "Not the biggest cinematic achievement of the year by any means but a way better film than usual when it comes to this genre of cute films full of good intentions that show as some type of history page to teach us a lesson. In this case it is absolutely entertaining from start to finish, funny, fun and poignant. It helps a lot that the vehicle used to tell the story is a scientific achievement. Not common in films unfortunately. It´s woth the mention that the incredibly talented musician Janelle Monae makes a great debut in film with this one. Also fantastic the other two actresses as always of course. Recommendable."
    },
    {
      "rating": "8",
      "text": "Narrating a timeless true story in a fashion that honours the women involved, Hidden Figures rises due to the strength of the cast and a feel good tone throughout."
    },
    {
      "rating": "9",
      "text": "Poignant, entertaining and well-acted. Hidden Figures brings the audience a surprisingly funny real story that becomes unforgettable thanks to its breathtaking interpretations."
    },
    {
      "rating": "10",
      "text": "This is a gorgeous movie, featuring an amazing cast.From the very first moment in the movie I was hooked. I really wanted to see how Theodore Melfi adapted Margot Lee Shetterly's book. But more importantly I wanted to see Katherine G. Johnson, Dorothy Vaughan and Mary Jackson's story. I was not disappointed. Taraji P. Henson, Octavia Spencer and Janelle Monáe were phenomenal. Not only was this a movie I'd happily watch at the cinema multiple times, but I will be rushing out to buy the Blu-ray the moment it comes out."
    },
    {
      "rating": "9",
      "text": "Hidden Figures tells the inspirational true story of some of the first black women who got to work for NASA. It has great direction, performances, writing, and in the end a great takeaway message."
    },
    {
      "rating": "7",
      "text": "Hidden Figures is a pretty by-the-numbers drama that I probably will forget existed in a few years, but it is worth a watch.Acting: Taraji P. Hensen was very good, but I'm not disappointed she didn't receive a best actress nomination. Janelle Monae was fine, but I still want her in more movies to see if she has a bit more range. I'm surprised Octavia Spencer was nominated for supporting actress, and she didn't even really do anything. She didn't have much of an Oscar scene and a very limited role in the entire film. I wouldn't say Monae deserves the nomination over her though, as Hensen was the main focus and had the largest role. Kevin Costner was a good pick for his role, and Jim Parsons was good. He basically acted like a calmer, less-funny, racist Sheldon from Big Bang Theory, but he was convincing enough. Plot: The movie is pretty by-the-numbers, not doing much to stand out. A movie like Jackie would definitely stay in my head longer than Hidden Figures. The cinematography is fine, the screenplay is fine; almost everything in this movie is simply \"fine.\" They didn't do anything wrong throughout, but nothing really new happened. I was afraid it would feel like a TV movie, as the trailers depicted it. At times it felt a bit reminiscent of a TV movie, but it definitely felt like a real, best-picture nomination deserving movie.Overall, Hidden Figures is a relatively simple movie that is worth your time, but don't expect it to be talked about or remembered too clearly in a few years."
    },
    {
      "rating": "10",
      "text": "I've enjoyed all the oscar nominated films - but this film stands out as the clear winner. A cracking story, with laugh out loud humour, it fills the heart & reminds us of those who have achieved so much with so little recognition. DON'T MISS IT!"
    },
    {
      "rating": "9",
      "text": "I love intelligence, resilient women, and astronauts. I also am a woman working for a tech company, so I knew going into this that I would enjoy it. I had to actively tell myself to not let me love for Taraji P Henson blur my opinion of this movie, but in the end, it was just a joy to watch. It was a classic, I laughed, I cried, I found myself fearing for John Glenn’s life even though I knew how that would work out (history, obviously). I worried the idea of Kevin Costner in ANOTHER “coach” type role would bore me, but it didn’t. I worried that Jim Parson’s only has one tone, and he does. But that was fine, because it all just worked, and was a true feel good film that felt perfectly relevant, even despite the time period. 9/10"
    },
    {
      "rating": "9",
      "text": "Everything felt too fast-tracked and the only one we really focused on was Catherine, the others being just cameo or short sections focusing on them. That is the reason why this didn't receive a complete 10 from me. Otherwise, this was an awesome movie, impressive!"
    },
    {
      "rating": "9",
      "text": "I have only raves about this movie. I have waited a few days to write a review since I watched it mostly because I knew I would write a book if I didn’t. This movie touched me in so many ways, and it made me feel like I could touch the moon. Being a woman in the business world, even today there are struggles we face, I couldn’t imagine having been an African American woman in the 60’s trying to get to the top. From the cast to the movie itself, everything was stellar, and probably the best movie I will see all year.The story centers around Katherine Johnson, Dorothy Vaughn, and Mary Jackson; three African American women working at NASA, all with dreams of their own. Katherine is an amazing mathematician, Dorothy has dreams of being a supervisor, and Mary wants to be an engineer. Individually, they face seemingly impossible stepping stones in order to get to where they want to be. One by one, they start to see their dreams unfold before their eyes, all while watching the world change around them.I found myself relating so much to Taraji P. Henson’s character so much. With my profound love for math, I know what it feels like to be a woman in a man’s world, the story touched me and made me have a different level of respect for this woman. Janelle Monae’s character Mary was a driven woman who would do whatever it took to reach her dream. She went before the court and had the most inspiring quote of the whole movie, which is the quote I used at the beginning of my review. We all know Octavia Simpson only plays characters who are as strong and beautiful as she is, her story touched me mostly because she never gave up, and she never let failure or a hard road dampen her dreams. These women are all someone I think we can aspire to be.The rest of the cast included Kevin Costner, Kirsten Dunst, Jim Parsons, Glen Powell, and so many more amazing actors. They all give stellar performances. The entire cast couldn’t have been chosen better. The film stuck to the original story and the facts very well, which I appreciated. It’s always good to enjoy a film, and learn a little bit about history as well. There’s just something about a movie that makes you feel good and knowing that it’s all true. It gives you hope that the world isn’t as bad as you think it is.I know I didn’t go too deep into the story with this one, but its all facts. You can read the book, you can look it up. Just know that this movie will make you laugh, it will make you cry, it will make you feel good, and it will give you hope. It’s a movie you can take the whole family to. I promise you won’t regret seeing this, and even if you have to pat $15, its worth it. If for nothing else, the acting is the best you’ll see in a film all year."
    },
    {
      "rating": "9",
      "text": "This movie was great in many ways. The actors were amazing, they felt like the real people! They also told a part of history not many people knew about, which is great for the story. Also, the movie was powerful and got it's message out. The only negative thing is that they dragged out the ending a little. I would say for sure watch as I think it was amazing and more people should know the story."
    },
    {
      "rating": "8",
      "text": "Conventional Oscar-baity storytelling? Yes.Borderline generic soundtrack? Yes.Jim Parsons in a movie above and beyond him? Yes.Then why the hell am I giving this movie 4 stars, you may ask... Well, for starters it is Oscar-baity but in a Forrest Gump way, not in a The Birth of a Nation way.Yes, Jim Parsons is in this, but he's the perfect typecast for intellectual **** This and all other casting choices were perfect. I didn't care too much for Mahershala Ali's storyline but it wasn't bad.Overall, an extremely compelling story driven by extraordinary performances makes this movie great.I was extremely skeptical about this movie, and it knocked me off my feet.PS: Kevin Costner lives to play 60s characters. The director rejected Spiderman to direct this, watch out for this guy. The cinematography was amateur, several shots were slightly unfocused for no apparent reason, if not for this, I would've given it 4.5 stars."
    },
    {
      "rating": "5",
      "text": "Hidden Figures shines light on an important story that needed to be document centuries ago (apparently).I have to say this film is wildly overrated and is only being nominated for the facts that it has Black women as the main characters and while thats \"groundbreaking\" and is a positive message that alone doesn't decide the grade of the film Hidden Figures like most race specific movies it tended to play on that.For the most part when I tried to keep awake the story was portrayed masterfully but the acting seemed shotty and typical for their roles some of scenes had pacing issues but in all the movie is completed well its just indistinguishable between historic movies."
    },
    {
      "rating": "8",
      "text": "This is a great movie… but… you do perceive you’re being manipulated by the biased, radical left agendas of the Hollywood elite – which you are.  It’s all too evident.  Many of the scenes have been embellished to promote those agendas, and do not reflect historical truth (see Wikipedia discussion), such as the “colored bathroom sign” scene, and the “control room scene,” in which they invite Katherine in to observe the launch.  While, the racial and gender biases portrayed, obviously did exist in the 50’s & 60’s in some parts of the country, some were natural extensions of the societies that existed at the time (e.g. state of natural families and the roles of the members (fathers and mothers) of those families, gender roles of the time, etc.).  However, if you can get past the manipulation… it is a great movie… and… it does tell a bit of history… which, previously appears to have been ignored."
    },
    {
      "rating": "9",
      "text": "This movie is great. I knew it would be good, but I was so happy after watching that I had to own it and the book. I loved the dynamic between the three women. They were really fun to watch on screen. Whenever I thought of doing that kind of math without modern calculators, I felt even for respect for Katherine. I'm glad that the romance didn't take over the plot. It was nice as a subplot. Anyone who is thinking about seeing this movie should. It is amazing."
    },
    {
      "rating": "9",
      "text": "This is a wonderful movie. It tells a fascinating story and tells it well. These three women rise above the racial and gender discrimination of the time to do a service to their country and its manned space program. The performances are uniformly excellent and make the characters seem like real people, not symbols.I am old enough to remember how the Shepard and Glenn Mercury flights ended, but I still felt a sense of tension around their depiction."
    },
    {
      "rating": "6",
      "text": "Lord, let us give thanks for the miracle you have given us in your infinite wisdom, generosity, and mercy. Lord, thank you for blessing the world with Janelle Monae and her wide range of talents. For convincing her to act and pursue a career in Hollywood, we are unworthy of your bounty Lord, for we are but simple sinners, doomed to be imperfect. Yet, you have graced us with the sole being of perfection among us and for that, we are eternally grateful. Amen.Aside from Monae though, Hidden Figures is a pretty simple story. Telling the real life story of the black women who helped to put a man in orbit and land on the moon, it is an inspirational feel good story that is by-the-numbers. Shoving the story of these women into the feel good biopic cliches, Hidden Figures loses some of its impact as a result. Fortunately, feel good movies are always going to leave you with a goofy smile on your face after watching it and Hidden Figures fits the bill there. That said, do not expect it to be different from any other inspirational biopic you have ever seen.Blending in some light comedy to brighten the racial tensions of the story, the film actually does a solid job showing the racism the girls face working for NASA. The film really defines the racism in looks with the girls being stared down upon entering any room. Co-workers assume they cannot handle the work, only to be shown that they can. Yet, first impressions often define treatment and the women of Hidden Figures are never treated perfectly by co-workers. That said, as a PG-rated move, there are n-bombs here, which leaves the film to resort to subtle racism. Honestly, this works better for a film of this type as, by 1961, the tides were turning enough to force people to not be so overt and brash with their racism in the workplace. Hidden Figures really captures this with things still labeled as being for \"coloreds\" or the girls being excluded even when they should be filled in on the information. The film takes the same approach to sexism with people expressing obvious sexist thoughts that they are taken aback to learn are sexist. Towards the end of the film, Vivian Mitchell (Kirsten Dunst) tells Dorothy Vaughan (Octavia Spencer) that she is not racist to which Dorothy tells her that she believes she thinks that is true about her, highlighting the subtly of the film with racism and sexist thoughts. The film clearly tries to bring them to the surface and does, but the racist and sexist actions of characters in the film are often done simply because it was the way things were and colored people or women doing these things was completely unprecedented.However, while the film largely handles the racism elements over it, it cannot help but burst into bombastic monologues about the ills of racism and the importance of overcoming it. These monologues are largely done by Katharine Johnson (Taraji P. Henson) and Al Harrison (Kevin Costner). The director of the Space Task Group, Harrison lets the racism occur until Katharine informs him about it, at which point he puts an end to it. Clearly seen as a white savior of sorts for Katharine in particular, Harrison repeatedly makes large displays of inclusion, yet still excludes Katharine and kicks her out at the request of his superiors, in spite of her talents. He makes the most attempts of anybody to include her, but clearly does so begrudgingly. This does not stop the film, however, from using his character as a white savior to lend a helping hand to the disenfranchised among us. Returning to the original purpose of this paragraph, the film may do a good job at crafting the air of racism and sexism around of every turn. However, it lacks the subtly in its dialogue given to its black characters to really pull it off. As a result, the film plays out with Katharine just telling people off left and right. While she is correct and free to express her thoughts, it feels to in your face and overt. Maybe she was like, I do not know, but as a film, there are ways to show her fight back and prove them wrong without having to jump up in their face to do so.Of course, these emotional monologues only further serve to make the film feel conventional. What good is a feel good and inspirational film without moving speeches by the oppressed? Regardless of whether the real women were like this, the characters in the film are pigeon holed into a palatable package that will not offend white people like slave dramas often do. Instead, these stock characters allow white audiences to largely look past their race and have a good time anyways, even if all the white characters are portrayed as the evildoers they potentially were to some degree. That said, the rise, the breakthrough, the challenge at the end, the fall, and then the final ascension to praise, are all tried and true inspirational feel good biopic cliches. Director Theodore Melfi ensures that this film hits each beat on the nose."
    },
    {
      "rating": "7",
      "text": "Fifty-six years ago, the first Black women came to work at NASA, a milestone during a time that in a way appears similar to our modern-day culture. Maybe there are no more Jim Crow segregation laws, but we still see Civil Rights protests by angry citizens flaunting picket signs, gender discrimination in the workforce, and consistent scientific breakthroughs from widely respected corporations. You might believe me when I say how very little has changed since then, as we are ultimately guilty of repeating the same mistakes, which the newest biopic, Hidden Figures, subtly proves to us.​It churns your stomach to remember the function of class relations in 1961: all colored people by law could only touch specially separated computers, bathrooms, and coffee stations labeled, “colored.” The police also had the privilege to escort a Negro out of the library for setting foot in the “White” section. Unbelievably, these rules to living were active not too long ago. Yet these circumstances allow the delivery of an uplifting true story about man’s historical progression and future potential.Three ladies of color are seen beside a nonfunctioning car in the Virginia countryside. So who else would come to ruin their day other than a stubborn police officer? It looks like a deep pit of doom until they suddenly get the car functioning again, and successfully convince the officer to escort them to their jobs at  NASA.One is sent to the other “colored” workers in a separate room from the rest of the campus, one is left to work in the testing facility where the other men bully her, and one gets the worst of it—she spends day and night working behind a desk, ruthlessly mistreated by everybody else. Her incredible knowledge in analytical geometry makes little difference; she still gets deliberately discriminated by her coworkers, and has no other options other than to race half a mile across campus to the nearest “colored” bathroom whenever she needs to relieve herself.The cast and crew’s hard work results in a loyal adaptation, both to the true story and to the Margot Lee Shetterly book it’s based on. Educational facilities everywhere will benefit from its survey of the cultural influence on NASA during its early efforts of launching man into space. If that’s not a landmark event in societal progression worth telling, then I don’t know what is.Although beside the meticulous recreation of the Civil Rights era’s segregation, the overall period setting offers nothing new to the cinematic experience. Director Theodore Melfi’s direction brims in the epitome of generic: creating too squeaky-clean of an atmosphere in order to be the sole “family-friendly” Oscar buzz movie. The bright colors and made-for-television sets do not recreate the sickening feel of the era it attempts to establish. Although the period does get needed justice by showing a series of news footage from the time, the slightly-off-focus cinematography fails to craft the feel of immersion.The shifts in tone and character may feel a bit too sudden to produce any further realism in the environment, the overwhelmingly masculine society triggers a series of intriguing tests onto the three women. At home, one of them must act as both mommy and daddy to her three daughters, adding to her already boiling pressure. The challenges on and off the job never seem to quit, and the remarkable chemistry between the three leading ladies: Taraji P. Henson, Octavia Spencer, and Janelle Monáe, halt any dull moments. Henson particularly deserves special recognition in her portrayal of an independent woman we want to succeed; her transparent discomfort comes across as all the White workers stop and stare at the color of her skin.While a picture about the Civil Rights era probably didn’t need to dwindle its content down to a profitable PG-rating, the job still triumphs based on the difficult subject the cast and crew had to handle. In light of recent memories we have succumbed to throughout 2016, all of us: man and woman, dark or light, millennial and baby boomer, ought to use a high quality feel-good drama to look toward a brighter 2017."
    },
    {
      "rating": "4",
      "text": "有時則是指在伦敦西区上演的戏剧。光業的役所浩二勝俣博山约百老汇剧院經常共同被看作光業的役所浩二勝俣博山是英语世界中最高水平的商业剧院代表。观赏伦敦西区的演出已经成为觀光業光業的役所浩二勝俣博山的役所浩二勝俣博山崎健藺生小林高水平的商业剧院代表。观赏伦敦西区光光業的役所浩二勝俣博山業的役所浩二勝俣博山。"
    },
    {
      "rating": "0",
      "text": "년 무어는, 알츠하이머 세계적으로 높은 흥행 수익을 세계적으로 높은 흥행 수익을 환자를 연기한 영화 《스틸 앨리스》로 그는 미국 아카데미상과, 《맵 투 더 스타》로 칸 국제영화제 여우주연상을 수상하였고, 전 세계적으로 높은 흥행 수익을 기록한 헝거 게임 시리즈에 합류하였다."
    },
    {
      "rating": "0",
      "text": "正直がっかりです。「ファウルの達人」が侍ジャパンに加わる。日本ハム中島卓也内野手（２６）が、３月に行われるワールド・ベースボール・クラシック（ＷＢＣ）代表入りが濃厚なことが１１日、分かった。際どいボールをカットして相手に数多く投げさせる打撃スタイルは、球数制限のある国際試合でこそ真価を発揮する。タイトルホルダーを中心に総合力の高い野手が多く選ばれている中で、独特の技術に白羽の矢が立った。("
    },
    {
      "rating": "8",
      "text": "In the early days of NASA, black women were employed as \"computers\" to help calculate the complicated math involved in space flight. This film tells the amazing story of 3 of these exceptional women (played by Octavia Spencer, Taraji P. Henson, Janelle Monáe). The spunky script peppers the continuous indignities and inequities that are heaped upon them with humor that adds warmth and humanity. Their performances are all winning. This film is fascinating in its exploration the early history of our space program, but it also delves into the discrimination against these women in an easy to swallow, entertaining package. A few snappy songs by Pherrell Williams adds even more verve."
    },
    {
      "rating": "7",
      "text": "Based on true events because that's always a real crowd pleaser these days and this is no exception. Starring Taraji P. Henson, Octavia Spencer, Janelle Monáe who are owning every scene. Also starring an agitated Kevin Costner who spends a good portion of the movie standing around chewing gum. But who cares about him, this movie is all about the women and the incredible work they did for NASA. The movie reels you in from the moment it starts, doesn't go over the top and keeps you invested in this extraordinary story. It's inspiring, it's funny and you'll definitely enjoy it. Recommended."
    },
    {
      "rating": "9",
      "text": "It's absolutely charming. A movie that shows how deeply dependent we are with our past, because it unfortunately still makes sense in the present and who knows... the future."
    },
    {
      "rating": "9",
      "text": "Awesome.  This is a fun, interesting and enjoyable movie to watch. Bring a friend, grab a bucket of popcorn and put your smile on. You will have fun and it is money well spent!"
    },
    {
      "rating": "9",
      "text": "Hidden Figures tells the real but unheralded story of three mathematicians, Katherine Goble Johnson (Taraji P. Henson), Dorothy Vaughan (Octavia Spencer) and Mary Jackson (Janelle Monae), whose work at the US Space Agency, NASA contributed significantly, to the success of America's space programme. The movie documents the struggles Johnson, Vaughan and Jackson had to go through in segregated America, compounded by discrimination against women, to get ahead in their chosen fields; Johnson, with a special mathematical talent, Vaughan with computing know-how and Jackson, a mathematician aspiring to be an Engineer. The story largely centres on Katherine Goble Johnson but Taraji P. Henson's portrayal does not quite drive the movie, only picking up at two points, when her character dramatically confronts Al Harrison (Kevin Costner) her boss at the NASA Division where she works, over segregation and a particularly symphonic scene where she engages in solving a complex mathematical problem on a chalk board. It is three members of the supporting cast that keep this movie humming along very nicely, for its duration; Costner who puts in an effortless performance as Al Harrison, director of the Space Task Group assigned the responsibility of putting a man into orbit, Janelle Monae who deserves applause for her virtuoso performance as Mary Jackson and Academy Award Winner, Octavia Spencer (The Help), present as a reassuring, steadying hand. This is a beautifully filmed movie with an engaging story."
    },
    {
      "rating": "9",
      "text": "a great film with big purposes. It may be slow at some places but the music makes up for it. The soundtrack is amazing. A story that needed to be told, great work."
    },
    {
      "rating": "8",
      "text": "A brilliant insight into a time of segregation and the those who fought to over come it while striving to pushing the boundaries of human exploration."
    },
    {
      "rating": "10",
      "text": "This is a story worth telling and worth knowing.  At a time when mean-spirited hatred and bigotry are in danger of being normalized again, I hope every person in the U.S. sees this movie as a reminder that government, \"the establishment,\" and conservative white males don't have all the answers.  Never have.  Never will.  Every person needs and deserves to be honored and included."
    },
    {
      "rating": "10",
      "text": "Saw Hidden Figures at the AMC Southdale.  Positive, fun, uplifting.  Glad I saw it once, and would enjoy seeing it a second time. I enjoy going to the theater and learning about history."
    },
    {
      "rating": "10",
      "text": "I loved this movie it was spot on with the rich history of 3 plus more brave women of color.  Just go see the movie I really don't come one metacritic to give reviews but I decided this movie should get more credit than it deserves it was really good and RIP to Glean Armstrong, I didn't know that he trusted these brave women of color to get him into space and land with their math calculations which helped in getting NASA into the next century. Please give this moive and Oscar and Golden Glob. It's a must see for everyone. I took notes during the movie. Also Ms. Johnson has a building named after her that's rare for a woman of color even her friends ran the IBM department and help develop the heat shield to protect the astronauts coming back from orbit.  10/10 for me"
    },
    {
      "rating": "7",
      "text": "When you watch a movie based on true events that you watched when it was happening and know the ending it takes a good director, Theodore Melfi, good screenwriters, Allison Schroeder and Theodore Melfi, to get you caught up in the events being  shown on the screen and \"Hidden Figures\" is such a movie.There is also another part to the film that has a tag line \"the untold true story\" and that is a story most people, Black and White, don't know about. The film takes place in months leading up to John Glenn (played by Glen Powell) who figures importantly in this film aside from being an astronaut and racism is still ingrained in the American consciousness. The latter is shown in small and large ways, each effective, whether it is a woman having to run a half a mile to go to the 'colored women's bathroom\" even though she is capable and does help NASA solve many problems to get men in orbit around the world and get them back safely.Taraji P. Henson is real life Katherine Goble Johnson, a mathematical genius, who knows 'her place' and is insulted not only by words but by actions. She is only one woman of two in an office of a dozen men and she is Black having to put up with some indignities to do a job she loves, wants to keep, but when she reaches a point that she has had enough she is not afraid to open her mouth.The other woman in the office, the group's executive assistant played by Kimberly is not welcoming and the head engineer, played by Jim Parsons, first has no respect for Katherine and then disdain only to question the knowledge she gives that is more accurate than his. The only one who doesn't care about her sex or color but her much needed knowledge is her boss Al Harrison, played believably by Kevin Costner.There are other people in Katherine's life aside from her 3 children whose husband/father is dead, her mother and, about half way through, a very romantic army officer Mahershala Ali but two others, her best friends, also faces racism because of being Black, though very smart accomplished women. Dorothy Vaughan, played by a strong Octavia Spencer, is in charge of the West Computing Group, as they are referred to, made up of Black women which segregates them from the White women in the East Computing Group. She does the work and puts in the time that a supervisor does but she isn't given the title and certainly not the pay. She delivers a put down with a smile that hides her pain but tells the truth.The third woman is Mary Jackson, played by a saucy, smart Janelle Monae, who wants to be an engineer but, due to Virginia laws, is not allowed to attend the classes she needs to get the degree. (Ah Virginia, the State that is also the basis for the movie \"Loving\" and tells  another true story about that State's laws.) She has a husband, played by Aldis Hodge, who hesitates in backing her but has a Polish-Jewish refugee, played by Olek Krupa, from the concentration camps, who is all for her going for her dream.Based on the nonfiction book by Margot Lee Shetterly one doesn't know how much of the script by Schroeder and Melfi was \"Hollywoodized\" but a lot of it rings true and the production designs by Wynn Thomas and the costumes designed by Renee Ehrlich Kalfus certainly reflect the era.The acting by all is first rate but Taraji P. Henson, Octavia Spencer and Janelle Monae give powerful performances showing how strong and accomplished Katherine, Dorothy and Mary were, the indignities they suffered and how just by being themselves they are role models for all of us.\"Hidden Figures\" has two story lines intertwined and as exciting as the race to the moon became the true story of what these three smart women had to go through because of their color was more interesting as the former was familiar to me while the latter was a learning experience about these women I knew nothing about and everyone should."
    }
  ]
}