{
  "id": 4885,
  "title": "High Life",
  "starring": [
    "Robert Pattinson",
    "Juliette Binoche"
  ],
  "runtime": 113,
  "genre": [
    "Science Fiction",
    "Drama",
    "Mystery"
  ],
  "description": "A father and his daughter struggle to survive in deep space where they live in isolation.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ftRRIYNzpTDYeTznrAxgT5v1vJY.jpg",
  "categories": {
    "plot": 4.743589743589744,
    "acting": 4.777777777777778,
    "ending": 4.916666666666667,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Esoteric and poetic, but very singular; certainly not for everyoneA science fiction film in name only, High Life has more in common with 2001: A Space Odyssey (1968) and Solyaris (1971) than with anything in the Star Trek or Star Wars franchises, and is about as multiplex-friendly as anything in writer/director Claire Denis's oeuvre (which is to say, not in the slightest). The presence of Robert Pattinson will probably draw in a lot of unsuspecting folks, who'll have no idea what to make of the slow-paced existential musings, resulting in a slew of \"worst film ever\" reviews. But although it's not Denis's best (that remains either Beau travail or Les salauds), it's a fascinatingly poetic film that literalises the premise that no amount of evolution, philosophy, or esotericism can change the fact that we're biological organisms controlled by sexual yearning and the impulse to procreate - desire will always trump the social contract.Like I say, very multiplex-friendly.On an unnamed ship, Monte (Pattinson) lives alone with his baby daughter Willow (Scarlett Lindsey). However, this wasn't always the case, and as the film begins, he is releasing the bodies of his deceased crewmates into space. How this situation came to pass is revealed via an achronological flashback narrative structure. A group of death row prisoners were offered a pardon if they undertook a mission to extract energy from the area close to a black hole. However, the groups' de facto leader, Dr. Dibs (Juliette Binoche), a criminal herself, is using the journey to harvest the men's semen and attempt to inseminate the women. Monte, however, refuses to comply, arguing that his chastity gives him strength, and so Dibs determines to get a sample by any means necessary.High Life, written in French by Denis and Jean-Pol Fargeau and translated into English by Geoff Cox, begins with Edenic shots of lush vegetation, before revealing this is a garden on a spaceship, surrounded by and subservient to technology. We then hear a baby crying. This opening, mixing vegetation, technology, and biology, demonstrates the economy of Denis's visual language, telling us much of what we need to know about the upcoming film.Aesthetically, the most interesting scene is one in which Dibs is shown masturbating. All sexual activity is prohibited on the ship, although the crew are free to use \"The Box\", a room designed to facilitate masturbation. One particular scene, showing Binoche committing herself entirely to Dibs's masturbatory excess is bathed in a glorious blue light that softens everything it touches, whilst director of photography Yorick Le Saux shoots Dibs entirely from behind, focusing on the muscles in her back, as if a figure from a Botticelli has wandered into a room designed by H.R. Giger. Furthermore, the scene is edited by Guy Lecorne with the use of fades rather than hard cuts, giving a sense of calm which contrasts with the energies of the character.Thematically, the film unexpectedly has a lot in common with First Reformed; both deal with the end of existence; both examine the possibility of finding hope amidst the cataclysm; both see the human race as not worth saving; both focus on a spiritual character facing a crisis of faith - in First Reformed, that crisis concerns Catholicism, whereas in High Life it's Monte's belief in the importance of self-discipline and chastity.Of course, on a more prosaic level, the film is obsessed with sexuality. Fluids are a recurring motif throughout, whether blood, sperm, oil, or water. Perhaps the most haunting image is a shot of one character lactating; producing nourishment for a baby she can't feed, as Dibs has taken it from her, the milk running down her body going to waste. Interestingly enough, at the film's première in Toronto, this scene sparked a number of walkouts, almost every one of which was male. Make of that what you will.In terms of problems, High Life will be far too abstruse for some. Denis obviously intended to make an esoteric film, but for some, it will cross the line from esotericism to impenetrability. In this sense, her litany of themes can come across as a little haphazard, as she jumps around fairly randomly between them, resulting in something of a thematic pile-up. This can feel like a bit of a dead-end, as she leaves several ideas frustratingly incomplete. Another issue is that the journey is never presented urgently, meaning there's rarely tension. And I have to admit, at times my attention wandered.Nevertheless, High Life is a fascinating film that fits right into Denis's oeuvre. Asking questions about our inability to recognise the oncoming extinction, it offers a savage and pessimistic corrective to the idealism of films such as Interstellar (2014) and The Martian (2015). Positing that mankind is a monster driven by its desires isn't going to earn Denis legions of new fans, but for those of us who were already on board, there's much to be relished here."
    },
    {
      "rating": "1",
      "text": "Impressive waste of time.  The concept and plot were interesting while the film was not at all; drawn out to agony, so miserably angsty all over."
    },
    {
      "rating": "9",
      "text": "So absorbing as a black hole, so is this space oddity that failed to doom. With context sexual and existential (that would love Kubrick), and assorted questions that remain with no answer. A small caliber sci-fi movie hard to forget."
    },
    {
      "rating": "7",
      "text": "High Life is a slow captivating movie. The story is one about sexuality and space, the voids it can creates. The notion of danger is omnipresent in a very silent and obscure way, like a black hole. Opposed to this is the relation of Monte and Willow. One of fatherhood, tenderness. But also a man who refused to be manipulated and goes against his emotions and surrounding. FX are limited here. And the action is mostly human in nature. I give it a 75%. You might not like the ending or the slow pace but this is a pretty decent scifi drama. Be warned that this movie is for adults."
    },
    {
      "rating": "1",
      "text": "Disappointing movie.   I love science fiction movies and books.  This one doesn’t make the cut.  The premise was lame and the movie dragged along. I couldn’t wait for it to finish.   ."
    },
    {
      "rating": "0",
      "text": "This movie is a lot like watching paint dry, but with a twist. The twist is feeling deranged and uneasy afterwards. I recommend the paint."
    },
    {
      "rating": "5",
      "text": "Stunning visuals and solid acting performances aren't enough to overcome the plodding, meandering, overly convoluted story of High Life. Claire Denis's direction leaves much to be desired. This was a very disappointing watch."
    },
    {
      "rating": "5",
      "text": "Another swing at the sub-genre of 'solitary' sci-fi that Tarkovsky and Kubrick still rule supreme.  On par with other misses like 'Moon' and 'Sunshine', High Life really left me feeling at time dull, irritable and lacking the curiosity to dive deeper into its forced metaphors.  While some will applaud the movie for this as a realistic portrayal of the psychological effects of prison, I still think there are more artful ways to achieve this without forcing the viewer into the same despair and boredom as its inmates.    Robert Pattinson puts in a good lead performance as does Juliette Binoche and Mia Goth in supporting roles (and the baby is great!), but the rest of the crew is fairly cookie cutter and forgettable which generally wouldn't be too much of an issue other than the immense importance of each character in such a claustrophobic plot.  Visually there is nothing new or noteworthy here, except for perhaps a interesting low budget look to many of the space craft and interiors, which makes sure to let you know that this is Indy, in case you forgot.  In a very particular rainy day mood maybe this movie strikes accord, but for me this one will be lost to time much the like the inhabitants of the number 7 vessel."
    },
    {
      "rating": "5",
      "text": "Claire Denis' 'High Life' is undoubtedly better on paper than it is on the screen.  One has to assume that the script includes certain details like what \"The Box\" is, or clarify the discrepancy between the fates of the astronaut's bodies early on versus what we're shown throughout the movie.Despite the film's limited dialogue, many of the lines feel bizarrely stilted, as if there was a problem in the French-to-English translation regarding the emotional meaning of what Denis was hoping to convey.As a result, Denis has ultimately made a film that is just interesting enough to keep the audience's attention the entire time, but lackluster enough for them to never really care.  Worse, the last twenty minutes are so packed with logical flaws that 'High Life' crashes into its final destination rather than ending on anything that resembles a high note, sadly wasting another superb performance by Robert Pattinson whose time and effort could have been better spent on something else."
    },
    {
      "rating": "4",
      "text": "This meandering, convoluted attempt at merging space sci-fi, edgy eroticism and the fallout of dystopian society never finds its legs, leaving viewers scratching their heads more often than not. Poor sound quality, cheap-looking sets and an inexplicably nonlinear script don't help matters as the characters and the story hopelessly seek to sort themselves out. The hype here is definitely ill-deserved, and Robert Pattinson definitely needs to pick better scripts."
    },
    {
      "rating": "6",
      "text": "The ironic title of this film has nothing to do with an elevated lifestyle. It refers to a group of death-row inmates who are sent on a mysterious mission into deep space. The film begins with a lone survivor (Robert Pattinson) and his baby daughter, but eventually rewinds to explore the mystery behind their operation, which involves a potentially evil scientist (Juliette Binoche). The story rambles in several directions, often with more confusion than illumination. With her first English language project, French director Claire Denis has fashioned a visually interesting and often compelling experience that's more about atmosphere and ambiguity than narrative clarity."
    },
    {
      "rating": "9",
      "text": "Entrancing and engrossing.  Superior cerebral science fiction.  Claire Denis is a genius.  Great performances, especially Robert Pattinson (and the baby)."
    },
    {
      "rating": "3",
      "text": "Very little happens in this movie, which is a misleading statement because several rather dramatic things happen.  However, none of those events have any bearing on each other, and as soon as an event happens, it is forgotten.  Taken as a whole, the film just seems to be writer/director Claire Denis throwing anything even mildly interesting up on the screen with the hope that something will stick and make the film relevant.  It ends up being a mishmash, and with so many competing ideas forbidding any of the others to be developed, the greater narrative becomes a non-entity.  Add to that an ensemble of wholly unlikeable characters and an ending that just sort of suddenly happens without any warning, and this film just leaves you wondering why it took a whole two hours to let this non-story unfold.One redeeming factor:  It contains one of the most realistic depictions or near-light-speed travel I've seen committed to film."
    },
    {
      "rating": "6",
      "text": "This movie has a great idea and a great directing to watch and follow it back, but at the ending it falls down and we can't understand what is happening for the characters."
    },
    {
      "rating": "3",
      "text": "Η ατμόσφαιρα προηγείται του –μάλλον προσχηματικού– δράματος, τα γκροτέσκα ξεσπάσματα είναι εντελώς αταίριαστα με το σιωπηλό, ονειρικό αφηγηματικό τέμπο και οι αναφορές στην εγγενή βία των ανθρώπινων σχέσεων προβλέψιμη ως τελικό συμπέρασμα."
    },
    {
      "rating": "2",
      "text": "I had quite high expectations on this one. Big disappointment. High life tries to tell a story about the human nature on a backdrop of an unforgiving universe but falls into a deep pit of pretentiousness and missed opportunities, a lot like a black hole. Why the overly lo-tech, low-budget setting? With stars like Pattinson and Binoche they should at lest have the money to shoot it in something better than a high-school boiler-room? I've seen it all before, and  done better. I can live with logic gaps or theater-like setting if the characters or story is compelling enough, but High Life just had... nothing. Want a movie about ennui in space? Se \"Solaris\" (the old one) or \"Dark Star\", they are so much better."
    },
    {
      "rating": "8",
      "text": "This is an anomaly:  an arthouse, dystopian future, sci-fi, mind bender.  I have appreciated many of Claire Denis' films.  This one, in English, is definitely different.  There are shots of great beauty, imbued with stunning composition.  Metaphors abound in many of the beautifully composed shots.  There are also many vulgar and disturbing images.  Though there are numerous sexually charged events, none of them are remotely erotic.  That tension, between vulgar sexuality and absent eroticism is certainly both one of the main subtexts and also something that will put many people off.  The film is not presented in a linear narrative, though there ends up being one when one pieces together the parts, which are constantly switching between times.  The acting is very good.  It is not for everyone.  For example, I would never bring my mother or my wife.  But I found it interesting, sometimes funny, and always engaging.  It will not be most people's cup of tea; but I found it interesting and moving."
    },
    {
      "rating": "8",
      "text": "I am a science fiction fan, and I thoroughly enjoyed this film because it was both true to the genre and also to more serious film making. I have seen Pattison often in more serious films since his breakthrough, and as always, he is excellent. It is not easy to keep an audience interested when things are not violent or blowing up, and Pattison is great in this kind of “serious” film (Claire Denis deserves credit, too, of course!). This is an interesting film full of interesting ideas and performances."
    },
    {
      "rating": "6",
      "text": "Denis has an agenda worth to be explored upon, but the assumed value of \"x\" in this formula, slams the bridge every time it attempts to connect or make sense.High LifeDenis is a filmmaker that celebrates little wins. Colorful fireworks blazing through the sky that almost covers the space, she, with bottled-up-champagne sprees with all heart and no shame. Take its erotically (or probably just a battery!) charged exotic scene staged to enfold the reserved character of Juliette Binoche, into a magnanimous witch like mythological creature claiming what is rightfully hers through open dark long hairs that gives you the chills which you won't be able to recover from. These tiny moments, is where Claire Denis's, the co-writer and director, heart lies, she expresses metaphors through personifying on the screen and with a get out clause that comes by deeming the film of sci-fi genre, she visually colors it all bright, at times eye-stretching, but at least clear.While the film distracts you with jaw dropping graphics, the characters are ignored, in fact, by the writers themselves. With no romance between the characters or any development as an individual one, Denis wants us to stay in this inescapable prison. Floating in a spatial bubble so blatantly, there are no bars held on projecting the envisioned theories, it comes with a price as it makes you cringe your body but also marks a vital note on the rule sheet.Which begs the question, is that exaggerated version necessary to strike fear upon our hearts or is it a manipulative strategy to create a jarring impact? I always thought that as a creator, you are to describe the stakes, maybe Denis should have lowered that bar beforehand. Robert Pattinson never fully cloaks his father figure persona, no hazmat suits or empathy could help him give a boost in this anti-gravity system that may not have the very existence of life and yet claims it High Life- a typical, learning to run before it can walk, case, admirable yet not excusable."
    },
    {
      "rating": "3",
      "text": "Although the performances were great, I found the story rather dull and I didn't care for the characters."
    },
    {
      "rating": "7",
      "text": "This was a somewhat interesting, albeit bizarre sci-fi indie flick. The plot's a bit of a weird one, so bear with me on this one. Robert Pattinson stars as a deathrow prisoner with his infant daughter aboard a spaceship full of fellow deathrow prisoners who have all been tricked into thinking that they'll be set free if they agree to embark on a trip towards a black hole for important resources, when in reality, they're being drugged and experimented on by the doctor on the ship (Juliette Binoche). Like I said, the film proved interesting at times and had some unique ideas and intriguing space visuals. However, the story felt random, disjointed, and aimless for the most part. The acting from all involved, however, particularly from Pattinson and Binoche was well-done. The visuals and a select few moments were interesting to watch as well. Overall, some good performances from the cast and some unique and ambitious visuals aren't quite enough to make up for a lacking story, and it does get pretty explicit at times, though that also meant that there were some pretty impactful scenes and images that will stick with me for a while, for better or worse."
    },
    {
      "rating": "10",
      "text": "Brilliant film from start to finish, highly recommend. Many negative reviews on this site actually disregard plot structure and information that was provided in the film, and to those people who cant interpret based on basic information, I feel sorry for you. Highly recommend this film."
    },
    {
      "rating": "10",
      "text": "Leaves the rest to the audience. Genuine sci-fi. Visionary miracle of filmmaking achievement."
    },
    {
      "rating": "4",
      "text": "Wait....What? Hold On, That's Starting To Make Sense-Oh No, It Doesn't You know those films that come out by someone you've never heard of before, and every.single.reviewer. does nothing but give it praise and high ratings...so you see it.And for the rest of the day you keep asking yourself 'WTF Did I Just Watch?'-well, this is one of those films. Walk in for the science fiction, leave on a gurney from the aneurysm you experienced trying to figure out what the hell is going on, what the hell does that mean. Some of the visuals are interesting, otherwise, I would watch this only after you have watched everything in the Criterion Collection(987)."
    },
    {
      "rating": "0",
      "text": "Absolutely idiotic. A bunch of criminals given a chance to NOT do time in jail so they volunteer to be shut inside what looks like a huge cargo container and sent into a black hole? With no apparent way for information to be sent back to anyone? None of this movie makes a shred of sense  and gives sci-fi a bad name the pursuit of some philosophical ( I think) point."
    },
    {
      "rating": "6",
      "text": "A group of death row co-eds volunteer for a scientific suicide mission in space led by an artificial insemination obsessed doctor (also an inmate) to collect energy from a black hole and are forbidden to have sex with one another. Unsurprisingly, the ship's specialized masturbation chamber can't keep them satisfied and the resulting sexual frustration mixed with the unethical experimentation taking place and the whole crew realizing that \"hey, this situation sucks, I hate everyone around me, and we're never going home\" leads to a breaking point full of murder, rape, and self-inflicted loss of life. What is surprising though is that the movie doesn't get interesting until all this stuff passes and we're left with the sole survivor taking care of an infant.The concept of a science-fiction movie about a man raising a child by himself in the total isolation of the final frontier with no hope of outside support is a compelling one and I wish that had been the focus of the movie rather than all the other stuff. Instead it's just used as a means of delivering a message about beauty blooming from tragic circumstances. Which kind of works, but a lot of its power is robbed by the story being told in a nonlinear manner. High Life literally opens with the protagonist already struggling to be a parent on his own and makes it very clear that everyone else has died beforehand. So when the narrative starts playing catch-up to show us how he arrived in this position, not only is there no tension in the proceedings because we know every character's ultimate fate, but worse it all feels rather pointless as we were informed what the big takeaway is supposed to be at the very beginning.These missteps mean that the plot isn't able to generate the level of interest it should, which leaves the film to rely on its visuals and imagery to try and captivate. There are certainly moments that will capture your attention and stick with you long after the credits have rolled due to how graphic they are. However, High Life has a problem here as well in that there simply aren't enough of them. The most memorable of the bunch, a grandiose display of self-pleasure, takes place relatively early on making the rest of the running-time a bit of a slog as most of what follows isn't nearly as shocking or disgusting as it thinks it is outside of the regular appearance of semen onscreen. You also have to consider that all of this is taking place to convey the horrible things humans are capable of when horny, frustrated, and have no release. Not exactly original territory. Where it succeeds the most is on the design of the ship itself. The drab, almost rundown looking corridors and bunking really reflect the hopelessness of these criminals venture, with the garden offering the only source of happiness or potential in the surroundings in the same way the baby does in the lead's life.I can see why this has received so much praise, and I definitely appreciate what is was attempting to do, but it fell short for me in a few key ways. The primary one being how it was told. Had things of played out in chronological order I wouldn't have been so disappointed. Given the feature's fixation on carnal desire, I think the best way to describe it would be to say it shoots its load too early. The climax occurs at the start rather than after a steady build-up of pleasure, preventing what little sentimentality there is at the conclusion from being able to satisfy."
    },
    {
      "rating": "3",
      "text": "Concepto interesante, pero mal desarrollado, los personajes parecen muertos en vida y lucen completamente inexpresivos. Robert Pattinson pareciera estar haciendo un esfuerzo sobrehumano por no perder la cordura por aburrimiento aunque si se ve bastante bueno físicamente.Juliette Binoche está como quiere, toda una milf, pero aquí parece una científica depravada abusadora sexual de niños de 5 años de edad y Mia Goth con una constante actitud de \"me vale verga la vida\". En fin, sabía que iba a ver un drama de ciencia ficción, pero esta película no me impresionó ni un poco, de hecho estoy escribiendo esto a 15 minutos de que termine, ningún momento emotivo ni de tensión, la carga emocional es mas plana que el culo de Madonna."
    },
    {
      "rating": "7",
      "text": "Moves like a slug but \"High Life\" is an extremely disturbing thriller.  Extremely similar to some Stanley Kubrick films in terms of style and presentation, High Life presents a mind bending, thought-provoking and claustrophobic film."
    },
    {
      "rating": "3",
      "text": "Tedious and slow.  I have no idea how this movie ends because I gave up about 2/3 of the way through.  It’s a series of drawn out moody scenes with equally moody and weird flashbacks to slowly piece through what’s actually happening.  Hint:  not much.  And the characters are very hard to relate to.  The dialog is uninteresting.  Overall I’d say just pass."
    },
    {
      "rating": "5",
      "text": "High Life isn't what it seems after watching the trailer. At first glance, it might seem like a Sci-Fi space thriller. But already at the 10 minute you understand that High Life is completely about something else. This is a philological film asking the viewer questions about the meaning of human existence, the meaning of life itself and what we leave behind. High Life is not aimed at the mass audience, it will be boring and uninteresting to most viewers, especially those who expect Sci-Fi from the film. After all, all this is not here. The plot is also presented non-linearly, the motivation of the heroes is not spelled out in any way by the script. High Life film in which no one explains anything, there are only references to the films of Kubrick and Tarkovsky. The only metaphor that is tracked in the film: people are animals, regardless of the cultural and intellectual development of society. It's boring and flat. By the end, the film finally falls apart from its unspoken. I don't even know who you can recommend High Life to, for me personally this is an empty film that just wants to seem like the Cosmic Odyssey of Kubrick or Solaris Tarkovsky."
    },
    {
      "rating": "7",
      "text": "The first English erotic sci fi horror of Claire Denis seems a good entry point for her work.  A crew of cast offs and volunteers heads to a black hole, doing experiments on the way.  They got an expert on black holes to advise.  i like how gravity is simulated by constant acceleration, kills 2 birds.  For all the content, it should be more interesting than it is."
    },
    {
      "rating": "7",
      "text": "Confusing, somber, vague, challenging. Adjectives that can dissuade many from watching this film. And the truth is that I don't think that many will find it really attractive but I personally believe that it's a risky proposal fighting so many passive blockbusters."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)\"Into this world we're thrown / Like a dog without a bone\" (The Doors, \"Riders on the Storm\", 1971). Being thrown into the black hole of existence: the most treated topic in history and emphasized by Claire Denis with a crass anthropocentrism, avoiding almost any trace of pietas and drawing on the maximum of rhetoric (rarefied rhythm, decadent atmospheres, deafening silences, a couple of brutal scenes, disjointed narration)."
    },
    {
      "rating": "3",
      "text": "Once again, a movie about space which is not about space but instead about some convoluted metaphor for whatever else. If you've seen Solaris, Interstellar or Sunshine you know the drill, except this one seems to be made with a budget of a few thousand bucks, the best acting comes from a little baby, the rhythm is non-existant, and the story makes no sense at all.If you like long, and I mean looong shots of people doing nothing in a place that's supposed to be in space but could as well be anywhere else, be my guest."
    },
    {
      "rating": "6",
      "text": "There was something missing from this movie for me. It was a little disappointing, and I didn't get exactly what I needed from this. I did enjoy the movie, and didn't really feel bored even though there wasn't much going on. But I feel like there was a lot of missed opportunities here. The cast was great, the visuals were great, but I feel like this movie had a great opportunity to be suspenseful, and completely threw that opportunity away. If this movie had had a little bit more of those mystery/suspense/horror elements I think it would have been a lot more impactful and would have stuck with me for awhile after."
    },
    {
      "rating": "5",
      "text": "Prisoners get sent out into space to do experiments but the one with a science background seems to have authority to conduct reproductive experiments after they have sex in a box."
    },
    {
      "rating": "3",
      "text": "High Life features a somewhat interesting premise and is ultimately bogged down by many indie film clichés that unfortunately all work out in the worst possible way.The most aggravating thing about the film by auteuresse Claire Denis is its sluggish pace, which shows in many different ways: Scenes continue for too long and are dragged out by drowsy, listless performances. Given, the sedation of the space ships inmates is a valid plot point that is addressed and in context makes some sense, but is it really worth it if that means that each scene feels like you are watching it in slow-motion? The pace is further disturbed and hindered by completely needless time-jumps, that add next to nothing to building tension or creating an intriguing narrative and instead make the film move even slower. One of the most painful scenes is happening about two thirds into the movie, when Juliette Binoche's wicked fertility doctor increases the sedative in the crew's water and the acting therefore becoming even more slurred and bored from there on.The sound mix does not help as it decides to make the often mumbled, whispered lines often inaudible, even though there is barely a score to hide them behind. It is a very regrettable choice for what interesting bits High Life has to offer, they are almost entirely delivered in the odd, meaningful, ominous line here and there and very rarely presented visually.Which introduces the next problem: The film is not a looker at all, which is a shame considering what other low-budget movies managed to get out of a sci-fi setting by actually using creativity and craftsmanship to counter the lack of grandiose CGI (e.g. Prospect) . But High Life features one of the least inspired and frankly ugliest set designs in the recent years, with a ship looking like a rusty Lego brick, suits that seem to have been fabricated by sewing rags together and sparse use of tech that looks like it was just ordered off Amazon for a few hundred bucks and thrown in the shot entirely without dressing up. Granted, the rag-tag ambience is a deliberate choice, but how unique and interesting are the gadgets that the inmates in the movie are clobbering together going to look, if everything else looks the same?Apart from shortcomings stemming from the limited budget and the poor artistic choices, what eventually undoes High Life in its entirety is the nonsensical plot, that deals with prisoners being shot into space to somehow retrieve information on alternative energy sources from a black hole. How? We don't really get to know. Why these specific people? We don't get to know that either. And in combination with a ludicrous plot about artificial insemination that is forced upon the inmates by yet another inmate the film just crumbles apart. The power structure within the ship's crew makes no sense and should fall apart from the get-go. For unexplained reasons everybody maintains the cruel and absurd goings-on until the logical meltdown is somehow played as a cathartic happening.The best thing about High Life are the performances by Binoche, whose disturbed and broken doctor persona keeps you interested as you never quite know how tight her power-grip is and how far she can and is willing to push her cruel experiments. Pattinson is solid, if a bit one-dimensional. The breakout performance is clearly delivered by Mia Goth who plays Boyse, a fretful but fierce wild-child who makes fickle alliances with different characters to benefit her goals that - besides her survival - are never fully formed.In the end, High Life is utterly unenjoyable and never manages to lift the interesting premise above what it is - instead showing shortcomings on almost all levels, from narration to direction."
    }
  ]
}