{"id": 4328, "title": "Highlander", "starring": ["Christopher Lambert", "Roxanne Hart"], "runtime": 116, "genre": ["Adventure", "Action", "Fantasy"], "description": "He fought his first battle on the Scottish Highlands in 1536. He will fight his greatest battle on the streets of New York City in 1986. His name is Connor MacLeod. He is immortal.", "releaseYear": "1986", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/8Z8dptJEypuLoOQro1WugD855YE.jpg", "categories": {"plot": 6.966666666666667, "acting": 6.904761904761905, "ending": 7.6, "soundtrack": 8.461538461538462, "cinematography": 4.25, "familyFriendly": 3.0, "funny": 3.0, "action": 7.55}, "reviews": [{"rating": "3", "text": "Bottom-line: I am baffled as to why this movie is so famous let alone why it started a franchise.\r We learn The Highlander's story from Sean Connery who plays, I kid you not, a 2000 year old Egyptian/Spaniard named Juan Sanchez Villa-Lobos Ramirez. That right there should give you an indication of the caliber The Highlander. Anyway, the story is that there exist “Immortals” who roam the Earth hunting each other. They can’t be killed unless they are beheaded. At some arbitrary time in history (which turns out to be 1984), they will be drawn to a far off country to partake in what’s called “The Gathering” where they will fight for “The Prize” which only one can have hence the famous line “There can only be one.”\r I found the bizarre transitions somewhat entertaining. That is, they are entertaining in the way a car crash is entertaining; it is more of a morbid curiosity than joy. A shot of the bottom of a lake in Scotland circa 1500, for example, wipes to the bottom of a fish tank. To signal a flashback to WWII the image on the screen shatters with the sound of cannon fire.\r In terms of acting, we have three main characters, The Highlander (Lambert), Sean Connery, and Victor Kruger (Brown). I've never been a big Christopher Lambert fan particularly because of his laugh. It makes me feel like kind of a bad person if I dislike the guy because of his laugh, but have you heard it?! It always sounds forced and what is more unfortunate is that he laughs at inappropriate times throughout the movie. It reminded me of Tommy Wassau's laughing in The Room.\r I included Sean Connery as a character instead of his ludicrous character name because he's just being Sean Connery in a fluffy red suit. I have a soft spot in my heart for Sean Connery so I'm down for his role as The Highlander's instructor. I never grew emotionally attached to his character, but I could say that about everything in this film.\r Victor Kruger is “the Ultimate Warrior,” according to Sean Connery. He is a Russian who has traveled across the world hunting Immortals. Clancy Brown's baritone voice fits the character of Kruger perfectly. I believe one of my favorite scenes in the movie is Kruger's modern day entrance. He is listening to the radio while driving in a 1975 Cadillac Coup DeVille. A reporter is commenting on a series of recent decapitations saying, “Police currently have no suspects.” “I know who it is,” Kruger bellows. He proceeds turn on a cassette of Queen's “Gimme the Prize.” If ever there was a scene in a movie that characterized the 80's. Now, even though he fits the role, there isn't much Brown can do to salvage the movie. His dialog, much like the rest of the dialog, is lacking.\r Now, I found Kruger and Connery entertaining but they aren't enough to save this movie. Cheesy special effects are all fine and dandy, in moderation, but there has to be something to balance it out; The Highlander's choreography is on par with some of Star Trek's fight scenes. The cinematography isn't very appealing either. Most of the odd camera angles seem unnecessary and, without any sort of justification, they are more distracting than anything.\r Overall, The Highlander is a very 80's fantasy action movie. Would I recommend it? No, not really. The cinematography is blah, as is the acting and dialog. When it comes down to your Friday night movie, there can only be one...so don't let it be The Highlander."}, {"rating": "10", "text": "I know there are many faults with \"Highlander\", but I can't see them.  To me the long tracking shots from off-putting angles are beautiful and the Queen soundtrack makes every scene legendary.  I give it an A, make a point to go see this movie."}, {"rating": "8", "text": "The special effects and actions scenes don't hold up in some places, but still a fun action story. I like to anually rewatch this over the years. The tale of a man walking alone through the ages. Seeing all he loved just die around him and fated to go on (a horrible existence). For me this should of been a one and done. This movie ends the Highlander story satisfyingly enough. Plus the sequels are trash anyway. Oh and that Queen soundtrack adds extra points for sure."}, {"rating": "10", "text": "The best movie soundtrack ever and although some aspects don't age well, others do. It's fun, exciting and addictive the action and story keep you entertained throughout. A good once a year watch film, excited for the Henry Cavill remake. production 2022."}, {"rating": "7", "text": "A farseeing conquest full of charm and peril, Highlander is a film that doesn't attempt to take itself too seriously - and for that reason works incredibly well as an homage to traditional fantasy / swashbuckler movies.The concept of a man who is immortal, and lives across the span of several time periods, is an interesting one. And I would've loved to have seen more of it, but much of the film takes place between 16th century Scotland and a contemporary New York setting. I especially enjoyed the scenes between Christopher Lambert and Sean Connery's characters. You can tell that both stars had a good connection with each other both on and off-stage. Much of the film's strong points can be found with scenes featuring these two.This film was not without flaws, and there's quite a few to mention. I personally found Christopher Lambert's attempt at a Scottish accent to be unconvincing, and the villain portrayed by Clancy Brown was almost cartoonish with no real incentive to commit bad deeds other than because he can. Despite these characters becoming spiritually old and wiser, their attitudes and personalities never seem to change all that much.Highlander also has a tendency to introduce certain characters and plot points only to never really focus on them all that much, presumably to pad out the runtime of this admittedly basic plotline. I'd reckon that this film would've been more successful if it was presented as a one-off miniseries as opposed to a full-feature film.Personally, I recommend this film to those who enjoy swashbuckler or adventure films. There's plenty here to enjoy, just don't lose your head!"}, {"rating": "6", "text": "Possessing both imaginative and cliched moments of narrative substance, poorly and finely edited sequences, brilliant and terrible uses of special effects, as well as both silly and exemplary displays of camerawork, \"Highlander\" is quite an odd movie to swallow. Though, after watching the film, one cannot deny these two things; #1 - sword-fighting is the most entertaining when conducted at night in the middle of downtown New York City; and #2 - this movie might just contain one of the best performances from ol' Captain Byron Hadley/Mr. Krabs himself -- Clancy Brown. Proceed with optimistic caution, for the cheese is strong in this one."}, {"rating": "10", "text": "This movie is a game changer.  It has the classic mythical sword fighting.  It has the sci fi immortal aspect.  The villain is iconic ( masterfully played by clancy brown).  It is a phenomenal movie and definitely worth a watch even to the skeptical.  You will not be disappointed.\r \"There can be only one\""}, {"rating": "9", "text": "this movie is a classic not the most stunning movie but for its time this is a great movie with a good story."}, {"rating": "10", "text": "This movie is a classic, and there are issues with the film but I like highlander the movie is vary well put together and as an 80s film it's vary rare, there are not many films where the main character has antagonistic qualities if you compare conner to most immortals he is a vary complex character and Lambert has an accent that makes you believe that he has learned many languages so he fits the character well I enjoyed Sean Connery as well both deliver solid performances and the sword fights are spectacular."}, {"rating": "8", "text": "Wow, it blows me away by how low the metascore is. This movie is a highly underrated cult classic that should be shown at film school. I love Russell Mulcahy’s camerawork and directing. It makes the movie unique in its own way. I think Christopher Lambert is an underrated actor. He doesn’t get much respect by critics. He does have a couple of cheesy lines in this film but I still love him as MacLeod. In my opinion, Sean Connery as Ramirez was perfect casting choice."}, {"rating": "10", "text": "''From the dawn of time we came; moving silently down through the centuries, living many secret lives, struggling to reach the time of the Gathering; when the few who remain will battle to the last. No one has ever known we were among you... until now.''Say, remember that I told you about that I hate box office failures? Well, here I am going to tell you about the cult classic Highlander. Now the sword fights really sure reminds me of the King Arthur stories. Christopher Lambert really does fit for the role although he's French. The movie was filmed at Scotland and New York City. I actually thought from Christopher Lambert's character's past was filmed at Cornwall but it's not, it's actually filmed in Scotland. The first fight scene where Macleod fights the immortal, that scene is awesome. I think the beheading scenes really does the sword fight scenes where the characters fight the enemies and then cut their heads after saying the only line ''There can be only one.'' The only best thing about the movie that really impressed me is Kurgan played by Mr Krabs. (Chuckles) Now don't let that bother you. I said Mr Krabs because Mr Krabs is played by Clancy Brown. I think he always plays bad guy roles like Uka Uka from the Crash Bandicoot series, Baron Praxis from Jak 2 and the others. But in Spongebob Squarepants, the only villian who is in it is got to be Plankton, so I'm just putting it out there. So Kurgan is got to be one of my favorite baddies if not the best villian. He really does get a line that I really like are ''There can be only one.'', ''Hello, pretty.'' ''Another time, Macleod!'' and the famous line ''I have something to say! It's better to burn out than to fade away!'' Now this is the line that I have to show my teacher Simon and my friends from Drama Club where I have to say the line by turning around. It is awesome! Sean Connery has a small role in it though cause his character dies because of Kruger the Kurgan after Ramirez helps Conner Macleod out with the sword skills so he can defeat the Kurgan. The songs are by Queen. Queen is one of the greatful music band that ever exist in music history. Their songs are Princes of the Universe, Who Wants To Live Forever and Kind Of Magic. I even heard Christopher Lambert saying the tagline. ''Hey, It's a kind of magic.'' This is a very good film despite the box office bomb but it spawn the sequals and TV series. I'm not sure if I wanted to check out the sequals because I heard pretty bad things about them so I'm gonna end it there. So anyways, if anyone's a fan of Queen I would definitely listen to the songs, the soundtrack from Highlander and watch the film. Go watch it! It is a very underrated and really awesome cult classic! But if you lose your head, it's over.''Patience, Highlander You have done well. But it'll take time. You are generations being born and dying. You are at one with all living things. Each man's thoughts and dreams are yours to know. You have power beyond imagination. Use it well, my friend.''"}, {"rating": "7", "text": "Highlander is a 1980s \"B-Movie\" cult classic with a little something for everyone. Highlander features fun melodramatic acting, a great Queen soundtrack, memorable characters and story, and action-packed swashbuckling fight scenes. Freddie Mercury's incredible voice definitely elevates almost every scene in the movie. Sean Connery, Christopher Lambert, Roxane Hart, and Clancy Brown all give career-defining performances. While the script does appear confusing, it's actually simpler than it is made out to be. The lore seems to be there to add flavor rather than to really flesh out the world, which is a flaw that trips up the movie occasionally. It reads a lot like a fantasy story that a little boy would tell. Overall, Highlander is a classic tale of good vs. evil with themes of immortality, love, and horror. The movie is very of the times. If I were to rename this movie, I would call it \"1980s Intensifies.\" This is the pinnacle of 1980s cult movies, and it is well worth a watch, especially with friends!"}, {"rating": "9", "text": "Possibly one of the best films of all time and i'm not even joking. Russell Mulcahy's 1986 action flick Highlander is a film with so much raw ambition it is definitely a film worth re watching. The Plot takes place in present day 1986 and Connor Macleod played by Christopher Lambert is one of the few immortals who remain, congregating together in an event known as the gathering to battle to the last for the ultimate prize. Co-staring Clancy Brown and Sean Connery in strong performances as The Kurgan and Ramirez respectfully, a plot that may have seemed absurd on paper just works so cleverly and with a amazing soundtrack by queen the film certainly doesn't disappoint. Where the film is no doubt at time goofy and silly the combination of both add to the films charm and memory, but don't waste your time on the sequels as there can only be one."}, {"rating": "10", "text": "The classic movie from the eighties. It is hated by many critiques, loved by fans and has an awesome soundtrack with some of the best songs from Queen. It is the story of Connor MacLeod an immortal who was born in the Scottish Highlands 400 years ago. He is in a never-ending battle with other immortals. The winner beheads the other and takes their power. At the end there will be only one and get a reward only know as the price. He is in a personal struggle against his nemesis Kurgan. Kurgan is the one you don't want to have the price because he is an amoral maniac. So far the premise of the movie. It is an interesting concept and unlike every other fantasy movie of its time (or the others are unknown). The movie shows the strengths of this concept as cutbacks to the past are here a powerful tool. You learn about his past life and the struggles of immortality while always being in a fight for survival. The visuals and costumes are excellent but the visuals are even better. The Scottish setting and landscapes are breathtaking and were used in many movies. There are even today guided tours for tourist to movie locations. Together with the memorable characters and fitting story the movie creates an enjoyable setting with great lore. It spawned a franchise with sadly many bad movies. Highlander 2 and Highlander The Source are frequently on the worst films of all time list. For the actors: All are good. Cant go wrong with Sean Connery. Christopher Lambert has his signature role. Clancy Brown is an enjoyable evil villain. Beatie Edney and Roxanne Hart are excellent choices. Then there is the Queen soundtrack. You have the phenomenal good tracks “Princes of the Universe”, “A Kind of Magic”, “Don't lose your Head” and of cause “Who wants to live forever”. I must admit that Queen and Freddie Mercury are in my favorite music list. Overall a really good movie but I must admit this is not for everyone. I could also write a pretty solid negative review instead of all the praise. Watch the movie for yourself to find out. Special Warning: Much of the Highlander franchise is really bad. As fan I can only recommend the TV-Series and The Search for Vengeance. Highlander 3 and Endgame are O.K. for me but no masterpieces."}, {"rating": "6", "text": "This film is all about town levels of bizarre... and yet there is something very watchable about it! Great cast, memorable soundtrack from queen. It plays like a 2 hour 80's coca cola advert with evil mr crabs as the lead villan. Christopher Lambert is mesmerizing as McLeod with a great supporting cast overacting their nuts off. It really is so crazy that you cant not enjoy at least some of what is happening. The lack of exposition explaining plot really helps this film!"}, {"rating": "5", "text": "Somewhat entertaining in a ridiculous sort of way but also utter baloney. Lambert isn't great."}, {"rating": "6", "text": "The story is interesting and gives the opportunity to show many world from different times. But on the other side, some of the visual effects were cheap. The duels were a bit to weak, although you can expect sword masters with experience of hundred years."}, {"rating": "0", "text": "Gros nanar des familles dans lequel s’est égaré -mais pas très longtemps- Sean Connery (qu’on ne voit d’ailleurs qu’au bout de trois quarts d’heure) et dans lequel végète Christophe Lambert dont le regard habituel nous rappelle sans cesse que l’homme de Cro-Magnon n’a pas encore disparu.Cette espèce d’histoire d’immortels à la mords-moi-le-noeud est aussi ridicule qu’elle sonne creux et fait très rapidement pschiiit (c’est le « drôle » de scénar qui s’évapore…) entre les allers-retours du présent au passé et inversement. Quand Connery est là, il cabotine plus que de raison et la star donne à peine le minimum syndical : il faut dire que ce téléfilm qui ne dit pas son nom ne mérite pas vraiment davantage…Quant à Lambert, c’est… Lambert, c’est-à-dire… euh… rien pour ainsi dire. Ou alors une pointe d’énervement quand même dans une mare d’indifférence. Même s’il n’énerve certes pas autant que bien d’autres cadors -français ou étrangers- de son espèce, à savoir les acteurs totalement incompétents, tellement nombreux !…Entre l’ennui et la totale incrédulité (et l’indifférence) que nous inflige (et nous afflige par la même occasion) ce « Highlander », l’avance rapide est notre planche de salut, puis l’arrêt et l’effacement pur et simple : c’est pas le tout d’enregistrer des merdes à la télé parce que l’air de rien, ça prend de la place (ces merdes) !"}, {"rating": "9", "text": "Shocking, yet another movie where the audience rates it positively and the critics score makes it the lowest rated movie and franchise ever. Sure, only the first one was good but still."}, {"rating": "5", "text": "Anyone who thinks this is some kind of under-rated masterpiece is not right in the mind. This is a barely average B movie."}, {"rating": "5", "text": "Biggest problem with the film was the editing and now time, I enjoyed it when the movie was in the past, i no have so much to say about it just that it has enough positive things about it so I can give it a bad score"}, {"rating": "5", "text": "This is one of the most iconic films of the eighties and has one of the most interesting original soundtracks of the decade (by Queen, with some of their biggest successes, such as \"Who wants to live forever\"). The main character is the Scottish Connor MacLeod, born in the sixteenth century and expelled from his own clan when it was found that he could not die. Later he met Ramirez, a Spanish courtier who suffered from the same condition and that helped him to understand his purpose in world: defeat other immortals, assimilate their energy until only one remains. Why does this happen? The film never gives an explanation, it seems that the immortals themselves don't know. But the ultimate prize is desirable.The film makes extensive use of flashbacks to show events in the past, and can not always avoid plot holes. But the quick rhythm of the action and the amount of action scenes help public not to think about it. None of the characters seems to have a sufficiently well- developed personality. Even the villain, the evil Kurgan, never fully shows who he is. The action scenes are based on duels, with large swords. Fencing movements would not be able to bring victory to any serious fencer, but are sufficiently good on screen to deceive the public. The film includes some romance, but it's so basic and uninteresting that ends up having no value for the plot.The cast is headed by Christopher Lambert (as Connor), Roxanne Hart (as Brenda), Clancy Brown (as Kurgan) and Sean Connery (as Ramirez). Undoubtedly, the cast does a pretty good job and fulfills its role without major errors, but without great brilliance as well. The exception is Sean Connery, who makes a very good performance and helps a lot to the quality of this movie. The scenarios are good, even the historical ones. The special effects, particularly at the end of the film, are quite impressive, considering the time when the film was made.This film is not at all one of the best I've seen in terms of quality. But it is a film that, despite its weaknesses, works well because its nice to see and entertains the audience very well."}, {"rating": "6", "text": "This is very much a cheesy and seedy film - very much a 1980s film. Its got cult status and I can see why. The first comparison that sprung to mind, within having seen the first 10 minutes or so, I suppose plot-wise, was Outlander but Outlander this is definitely not. I suppose it's like a mashup of a 1980s fantasy film and Outlander but I'm not sure if that would more confuse you or actually help to paint a picture of it?. The special effects are quite dated but that's to be expected given its age. There's a certain charm to it I suppose and the acting is less than constantly top-notch, I'd say but it's watchable (if only just). An amusingly silly fantasy/drama/thriller film not to be taken too seriously, this is worth a quick glance if it sounds of interest, otherwise perhaps not. Oh and I'd, more specifically, say it's worth watching to see Sean Connery in his role (wearing Scottish garb) if nothing else. I'm not quite sure it'd be entirely fair to classify this as a parody film or not but it's certainly entertaining regardless. I suppose if screaming or loud noises bothers you much then this is probably a film best avoided because it is a bit loud at times and there's a female character who does the typical damsel in distress, shouting and looking helpless type of act towards the end, which may frustrate or annoy some people possibly (in terms of the whole cliche as well as the loud audio element!).You could say it's (as Americans may say) 'trashy but fun' and also the fact that Queen do the soundtrack is a plus - can't beat a bit of Queen music in my book (or ears) but that may not appeal to everyone. It's not quite what I'd regard a particularly good film as such, in terms of being especially thoughtful or memorable but its a solid 'ok' from me."}], "recommendations": ["the_fifth_element", "indiana_jones_and_the_temple_of_doom", "thor", "django_unchained", "conan_the_barbarian", "the_scorpion_king", "troy", "the_terminator", "top_gun", "the_three_musketeers", "avengers_age_of_ultron", "cruella", "black_widow", "rocky", "the_karate_kid_part_iii", "top_gun_maverick", "oz_the_great_and_powerful", "pan", "hercules", "aquaman", "last_action_hero", "king_arthur_legend_of_the_sword", "ghostbusters", "creed_ii", "doctor_strange"]}