{"id": 2886, "title": "High School Musical 3: Senior Year", "starring": ["Zac Efron", "Vanessa Hudgens"], "runtime": 117, "genre": ["Comedy", "Romance", "Drama", "Family", "Music"], "description": "It's almost graduation day for high school seniors Troy, Gabriella, Sharpay, Chad, Ryan and Taylor — and the thought of heading off in separate directions after leaving East High has these Wildcats thinking they need to do something they'll remember forever. Together with the rest of the Wildcats, they stage a spring musical reflecting their hopes and fears about the future and their unforgettable experiences growing up together. Will their final show break them apart or bring them together for the greatest moment in Wildcat history?", "releaseYear": "2008", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/cKWIxQh2dMUgjsxJenrf7A81D95.jpg", "categories": {"plot": 4.230769230769231, "acting": 3.9375, "ending": 5.25, "soundtrack": 2.25, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 8.5, "action": 3.0}, "reviews": [{"rating": "3", "text": "Disney has always been out of touch with teen youth, and they seem to be drifting further away, with HSM 3 being a good example of that. The film is energetic, but the songs are unmemorable, the performances shallow and the story is silly. Lets just hope now that they are seniors the tortuous musicals will end."}, {"rating": "10", "text": "I love this movie. I enjoyed all of this movie!  I want to watch again. Troy  is so cool and  Gabriella is so cute. I want you to listen these songs. These songs made you happy."}, {"rating": "7", "text": "No entiendo las criticas negativas, tiene las mejores canciones, me gusta mucho."}, {"rating": "4", "text": "What a horrible movie and album. How does this sellout (movie) sell 200k (soundtrack) in the first week? The auto tune is actually distracting enough to the point where you can hear jumps in tone and note if you listen carefully enough. The movie is too bubblegum pop and not enough focus on music."}, {"rating": "10", "text": "HSM3 was i think the best musical for now... It can make every senior feel that it's really gonna be over for them, they're going separate places after graduation... And for me, as a high school student, it had touched me in different ways... The movie made me want to perform because it is so energetic, all the numbers make you have Last Song Syndrome (LSS), and even though I don't really enjoy love scenes, this movie kinda made me like it... If you compare this to other musicals, this would be the leading one, this is the best among musicals as for now."}, {"rating": "0", "text": "High School Musical 3 is a BIG WASTE OF MONEY! THEY RUINED DISNEY! This Live Action, Tween Star nonsense needs to STOP!!!!! Where are the CARTOONS?!? Where on earth is Mickey?!?!"}, {"rating": "10", "text": "It's a blast! A musical that isn't ashamed of being a musical, and now they have the bucks behind the to be as fab as tthey wanna be!"}, {"rating": "8", "text": "If you hate this movie, you're probably 15 years old trying to outgrow tween Disney culture, - ad good on ya for graduating to South Park, but honestly if you're not in the midst of adolescent rebellion, this movie is absolutely delightful. It's a full on, full bore musical that's unashamed of its exuberance, innocence or over-the-top-ness. The musical numbers are terrific, and after a few years of working together, these kids have real chemistry and theyve taken the dancing up several notches. It's easy to dismiss Effron as a disposable pretty boy idol, but he's really got the makings of an honest to goodess musical star. Looking for mindless, guilty pleasure fun - see this in on a big screen and try not to smile or feel uplifted - I dare ya."}, {"rating": "2", "text": "Not the worst film I've ever seen, but it comes pretty close. I wonder what Walt Disney (an anti-gay right wing conservative) would say if he saw what has his company has become. The music is fairly poor, the voices are fairly high and the whole thing is fairly crappy."}, {"rating": "9", "text": "I love this movie. (: its my favoritee... during the movie in the theater me and my friends were dancing and singing along. it was amazing. but of course since it was a musical, it was a little cheesy in like one song! haha."}, {"rating": "10", "text": "This Movie Is Excelent..!!!! Amazing..!!! and has the perfect ending that a movie ever done.! the songs r incredible the dance over the top.. and the acting are the best..! but the history is everything..! and Ashley Tisdale was so Fabulous.! HSM3 is the best musical EVER MADE IN HISTORY..! ''Once A Wildcat Always A Wildcat''!!!!"}, {"rating": "9", "text": "I was quietly hesitant or at least expecting a catnap while my kids enjoy the show but I was pleasantly surprised! The topics and emotions touched a nerve for me ( I remember the same concerns and even now wonder of life's direction) the musical numbers were either romantic, over the top with skills and fun. I laughed out loud a few times, got a bit teary eyed and just left the theatre feeling as pepped up as the kids. It was worth the money!"}, {"rating": "3", "text": "The late Miles Davis once said on \"The Arsenio Hall Show\" that he hears music at basketball games. The renowned trumpeter wasn't referring to the Top 40 ilk that pumps out of arena loudspeakers; the legendary musician, whose \"Bitches Brew\" signaled the genesis of fusion, was talking about the squeaks that a shoe produces on the hardwood floor. In \"High School Musical 3: Senior Year\", Troy Bolton(Zac Efron) \"can't stop the music;\" he breaks into song even while the big dog on campus leads his team to victory. Is there a better way to portray a closeted athlete? The basketball court, or the stage: What is Troy's \"Xanadu\"? \"A boy. An honest-to-God straight boy,\" that's how a counselor describes one of the music campers in Todd Graff's \"Camp\"; the boy who auditions with The Rolling Stones' \"Wild Horses\" on his guitar. Needless to say, it turns out that the seemingly straight boy is gay too, just like all the other male Stephen Soundheim worshippers. The position that \"Camp\" undertook, preserves the stereotype about the synonymy of Broadway music and gay men. Because \"High School Musical 3: Senior Year\" bears the Disney insignia, a chaste kiss is the only action that Troy gets out of Gabriella Montez(Vanessa Hudgens), but the absence of physical love doesn't account for the musical number(\"Scream\") where Troy goes on a rampage in the empty school. Just for the record: boys shout, girls scream. When Jonah Hill screams(as in scream like a little girl) after happening upon a corpse in Steve Pink's \"Accepted\", he asks the other guys to keep his feminine flare-up, a secret. Is it just a desire to sing and dance that's eating away at Troy? When he gets off the phone with Gabriella(who's away at an early-acceptance program at Stanford), look closely at how Troy positions himself on the bed in the vicinity of his teammate(when the cat's away, the mice will play). The scenario comes scarily close to what goes down in Todd Solondz's \"Storytelling\" between Scooby(Mark Webber) and his \"special\" friend. \"Falling Slowly\", the achingly gorgeous ballad that Glenn Hansard and Marketa Irglova perform in John Carney's \"Once\", makes you believe that these two strangers are falling in love, because the music is real. The songs aren't show tunes; they're written for real life(for digital video). \"Once\" has the distinction of being the first truly heterosexual musical. The little indie did something interesting to the musical genre. Since the folk-based music did such a superior job of conveying tenderness and devotion than its imitative brethren; the love ballad, steeped in the musical theater tradition, has the effect of compromising the validity of a couples' love, with Troy and Gabriella's performance of \"Can I Have This Dance?\" being just one example, because their sentiments are being transmitted through a musical vein that's largely believed to be appreciated largely by women and gay males."}, {"rating": "0", "text": "Dreck. And the people who have sent this film to the top of the charts are also going to vote. That is terrifying."}, {"rating": "0", "text": "Shame on Disney for not making any movies for teenagers. Disney needs to know that teenagers are deserved to watch movies about serious, realistic things such as pregnancy, drugs, gangs, etc. Disney needs to stop making any crappy movie like HSM!"}, {"rating": "0", "text": "This movie has as little entertainment as Paris Hilton has talent. And Matt C, the last critic says that if your gay or EIGHT years old it's good but for everyone/thing else its as welcome as the apocolypse."}, {"rating": "8", "text": "Best of the series yet! With a move to the big screen came a jump in their budget and boy did they take it and run! Great script, absolutely astounding musical numbers, and an amazing cast make for one of the best musicals in years. The dance numbers are right up their with the greats such as West Side Story, and this is especially evident in the best dance number in the movie, \"The Boys Are Back\". Some songs could have been left out, but overall this music is electrifying. It's as if someone is taking a syringe full of happy and injecting it right into your heart. If you don't like the music, you should like the choreography, if you don't like that, than you probably have a heart two sizes, too small. HSM3 is movie event that should be seen by every one of all ages!"}, {"rating": "1", "text": "I'm a teen, and i found this movie AWFUL! I'm 12, and i can tell you that this is the worst movie of the year. God, why do some many other kids love this movie, i mean the movie is just, well, stupid, there's no plot. And, why did they ever create the F---ing thing! By the way, High school is not revolved around Teens trying out for musicals, how about pregnancy, and um, peer pressure. I don't care if its a tween/teen film, for those who love it, you're messed up and it's not cause' i can't enjoy it because i tried. For those of you who agree with me, If you haven't seen Sweeney Todd, which is one of my favorites of all time, you should, if you hated this crap... Sweeney Todd is so much better than the freakish, little baby, retard-movie High School Musical..... go see sweeney instead. I loved it. I HATE HIGH SCHOOL MUSICAL."}, {"rating": "0", "text": "Simply atrocious."}, {"rating": "0", "text": "Terrible.. nothing more really needs to be said. Not sure how anyone could sit through it. It even seems too ridiculous for pre-teens."}, {"rating": "7", "text": "Plot was horrible. Songs were pretty good."}, {"rating": "1", "text": "It was one of the worst movies I've ever saw!!! The music was okay but the acting was terrible and the plot was awful. So I guess overall it was terrible."}, {"rating": "0", "text": "I don't mind having a cheesy storyline, I can deal with that, even as a 16 year old. I watched this film for the music. And the music DID NOT deliver like the past 2 films did. Unmemerable, and not particularly catchy. Just poor all around."}, {"rating": "0", "text": "Ted Mack would have kicked this movie off of his show as that is how awful it is. Don't spend your hard earned money on this trash."}, {"rating": "0", "text": "I cant sit here and deny the success and fanbase of this movie, or the ones before it. Its huge and the kids love it. But, from someone who knows movies, its a mess, a horrid mess. Since its aimed at kids, the diologue doesnt have to be great, or even decent at all, and its not."}, {"rating": "1", "text": "I guess this movie is only good for eight year-olds that share an interest in Hanna Montana and who don't know Micky Mouse. I actually saw the movie and I gravely regretted it. The singing and the music is terrible; there is no plot sypnosis; the romance it nothing but common high school life (I don't even know why kids are calling it \"so romantic\"); the acting was terrible as well; and it completely lacked humor. I'm not saying it's a bad movie because I'm not a kid, but it's still safe to say the High School Musical 3 is one of the worst movies of the year."}, {"rating": "10", "text": "There were a bit too many songs but gawdd the neding was incredible. cinema was full everybody was on their feet clappin and dancing along it's what high school musical is all about. bit upset that its over with the current cast but relly they left in style. incredible movie. soo much fun. sooo much excitement and anticipation for this global phenomenon culminating in an absolutely fantastic motion picture musical which will leave it's mark for years at the box office and in our hears even though some critics just don't have a clue and don't get it."}, {"rating": "10", "text": "It's painfully obvious that most movie critics are miserable b'stards with serious joy issues. The writing is bad? It's High School Musical not Waiting For Godot for goodness sake. It's about singing, dancing and kids having a good time. And that's exactly what my 8 year old daughters had. When the worlds most cynical man (Charlie Brooker) finds it difficult to hate the High School Musical movies you know it's time to leave cynicism and pretension at the door and have some good clean fun. Lighten up world. We've got enough to worry about other than slating a perfectly entertaining family movie with its heart in the right place."}, {"rating": "9", "text": "This movie BLEW MY MIND! The plot was just random enough to work, and the pseudo Thriller scenes, horror movie stylings, and crazy hot sexual tension just put this movie over the top. In a good way. Get a group of friends, pop a few Xanax, and get ready for the ride of a lifetime."}, {"rating": "0", "text": "Terrible excuse for a movie, don't know how anyone except for fans or little girls can even give this a 4."}, {"rating": "0", "text": "Good grief. This is one of the worst movies I have ever seen in my life. I'm not even going to go into detail. Becuase, well, it's too awful, abysmal and a word I can't use. You see, the first two HSMs made me nod my head in shame, dissapointed at what Disney have done. Then a third one came out, and I think Disney has destroyed ALL of my reputation from me. I remember when all that came out of Disney was good stuff. However, nowadays, Disney are still focusing on the younger audiences. ONLY the younger audiences. Come on, Disney! Make a violent movie! We grew up with you! Please, for all our sake, leave High School Musical alone!"}, {"rating": "0", "text": "I feel bad for those of you who actually had to go see this movie to know it would be horrible."}, {"rating": "0", "text": "People giving this film 10s and 8s because it is the best film in the series is like giving the flu a 10 because it is the least lethal disease i can think of. This film is part of the ruin that is modern disney. Disney's only hope lies in reinventing themselves and hoping that Pixar keeps up the quality and the rest of the company. For a Musical, the music in this and the other 2 films is horrible. In many modern musicals, there is a mix of music but in the HSM series it is just all pop and stuff that appeals to 8 year olds and under. The \"teen\" idea behind the film is horrible because these characters are impossible for any teen to empathise with. I mean how many teens do you know that have rich parents and are the popular kids of the school that always perform in the musicals and somehow manage to insult people while hanging out with their sibling? outside of the world of this kids' trash, there are no actual teens like these characters."}, {"rating": "0", "text": "oh good this is bad not again its not fair its just not fair!! Not fair ahhhhhhhhhh!we can stop this madness now kill zak please yes we willdont make me watch another oh no please.........]"}, {"rating": "0", "text": "A teenage musical film turned into an off-key performance. Their acting are just terrifying and this is not even a horror film! The story was too ordinary and predictable all the way from the first movie. I'm glad that this terrible High School Musical series is over.....for now......"}, {"rating": "5", "text": "Decent way to end the trilogy, finally seeing the famous Wildcats graduate at last. The movies have been a great success; however, how can tween viewers relate to the characters when they are moving off to college? Discussing about universities half of the time is meaningless to them, which may lose some interest. Furthermore, the rivalry between Gabriella and Sharpay was absent in this movie, which is quite a disappointing. Was expecting for something a bit more special. The songs are great, but it would be better if they were more 'classic' sounding than a modern 'rock' sound. Overall, it is a good movie, so HSM fanatics should check it out."}, {"rating": "6", "text": "The best of them all. With some good songs, okay performances and some touching  moments. It is a solid ending for a very shaky franchise. I give this movie 64%."}, {"rating": "9", "text": "At last, we have been given a decent typical teenage film, now they confront one of the worst fears that a teenager can feel. Enjoyable, funny and it is better than the others."}, {"rating": "4", "text": "The characters are just so shallow, you honestly don't care what they do. This would probably be a good time when you have nothing better to    do."}, {"rating": "0", "text": "que pelicula tan espantosa Disney se esta desviando a lo cursi y sobre absurdo un musical que tendria que tener un gran final de recuperacion despues de la 2 pesima una leccion sobre los musicales"}, {"rating": "7", "text": "\"High School Musical 3: Senior Year\" may not be a masterpiece in any way, shape, or form, but its catchy musical numbers and generally charming story line will certain entertain children and give adults a nice time. Although the film has themes that are very similar to its previous films, \"High School Musical 3: Senior Year\" uses bright and warm musical numbers to close into a considerably nice ending to the series."}, {"rating": "3", "text": "okay the high school 3 is okay  the fact there getting out of high school  finally no more high school  finally something to  forward to . ................................"}, {"rating": "4", "text": "Typical plastic movie of Disney Channel. Every time I see it on TV I'm like ''hell'' and I change the channel, because it's boring! The only nice thing are the songs. Although their voice are fake."}, {"rating": "4", "text": "This film is so much worse than the first two.Ok plot, +1Awfully placed songs, especially the basketball scene in the start of the movie, -1;The fact that the songs obscure the actual story, the story doesn't have time to show itself, -1;Awful and poor dialogue from the characters, -1.All in all, High School Musical 3 gets a 4/10 from me."}, {"rating": "5", "text": "After an average first and below average second comes the third and last part, which although not exceptional, is still slightly pleasing, because in my opinion it is the best part. Our main characters are already in their final year and it is a kind of last ride of singing and a kind of common farewell, which takes place most of the time again at school and in the final part it is quite nostalgic and a return to the first part. The songs again I can't say if they were worse or better. Again, don't look for anything of quality in the story, but as I said, I would consider it the best of the trilogy here. On top of that you could see the shift in the cinematography. So, for me, an average film that closes this musical and probably a treat for fans. Not much for the average viewer."}, {"rating": "4", "text": "Doesn’t live up to the previous 2, only good parts are the beginning, the “can I have this dance” song and the end concert. The rest was a boring attempt to recreate the heart of the others but left the heart out of it. It felt repetitive and forgettable. So much so that the good parts were the only parts the I remembered everything else felt like I am watching for the first time."}], "recommendations": ["grease", "sing_street", "vivo", "a_week_away", "sing_2", "trolls", "hairspray", "rock_dog_2_rock_around_the_park", "cats", "my_little_pony_equestria_girls_rainbow_rocks", "sing", "the_greatest_showman", "trolls_world_tour", "mamma_mia", "step_up_2_the_streets", "jingle_jangle_a_christmas_journey", "strange_magic", "burlesque", "mamma_mia_here_we_go_again", "hannah_montana_the_movie", "happy_feet", "alvin_and_the_chipmunks_the_squeakquel", "alvin_and_the_chipmunks_chipwrecked", "uglydolls", "into_the_woods"]}