{"id": 1775, "title": "His House", "starring": ["Sope Dirisu", "Wunmi Mosaku"], "runtime": 93, "genre": ["Horror", "Thriller"], "description": "After making a harrowing escape from war-torn South Sudan, a young refugee couple struggle to adjust to their new life in a small English town that has an unspeakable evil lurking beneath the surface.", "releaseYear": "2020", "mpaaRating": "NR", "imageUrl": "https://image.tmdb.org/t/p/w500/idh2QAy5NwBRN94ScmtWrukvOgJ.jpg", "categories": {"plot": 7.533333333333333, "acting": 8.666666666666666, "ending": 7.75, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "Two refugees from South Sudan end up in an English townhome, but ghosts from their past have travelled with them. In addition to the traditional tropes of these movies (jump scares, creepy specters, unexplained hallucinations) the only thing that sets this thriller apart is a cursory nod to their issues as exiles and the flawed immigration system. Even if you’re into message movies, that’s not sufficient to make the trite frights worth a watch."}, {"rating": "3", "text": "The true litmus test of a horror film is whether or not it's scary, and this one fails miserably on that front. In addition to its lack of good scares, this debut feature from director Remi Weekes is often more muddle than riddle, taking seemingly forever to establish the nature of the story and then taking even longer to explain the reasoning behind it. And, through it all, the film is loaded with an array of allegedly frightening (and often-disconnected) moments that shed little light on what's transpiring but that have apparently been left in primarily for their visual impact (which isn't all that great, either). Admittedly, the picture manages to garner some worthwhile attention as it nears its conclusion, but, by that point, it's unlikely viewers are going to care much. Also, the film attempts to work in some allegorical sociopolitical commentary, which, if handled better, might have made this a much better picture. Unfortunately, there's not enough of what the film does well and far too little of what it needs to do better, leaving audiences with a plodding, dull, disappointing effort unworthy of the three BAFTA Award nominations it received (and that truly should have gone to more deserving offerings)."}, {"rating": "0", "text": "Cheap horror movie from Netflix.It has nothing interesting to offer for viewers."}, {"rating": "9", "text": "Excellent horror movie with a great duo cast as the refugees.  This one reminded me of CM Punk's house of horror movie which I forget the name of sadly. This one was better, and was very creepy.  Cool story here too, and there's a twist at the end with the daughter and her so called \"parents\"."}, {"rating": "10", "text": "Beautiful and thought provoking film with great scares. Highly recommend. Great new direction for British horror"}, {"rating": "10", "text": "A must watch! Scary but with a deep and somehow beautiful story in the background. The 2 lead actors are amazing."}, {"rating": "7", "text": "'His House' follows films like 'Get Out' by referencing the true horror of many social problems, in this case, forced migration. The nightmare of a couple escaping from a hellish life transforms into the everyday struggle of trying to adapt to a new one. Likewise, director Remi Weekes incorporates guilt as an all-powerful ghost that emerges as the true evil of this story."}, {"rating": "8", "text": "A power-house debut from Remi Weekes, deftly balancing social commentary with old school horror (and for once, without zombies). The movie pulls you inside the life of a Sudanese refugee couple assigned to an apartment in London after a harrowing escape via boat from their home country. In addition to the nightmare of their experience, they’ve got a potential poltergeist. Movies often face-plant while struggle to convey what is real, a dream, a backstory, or something else? \"His House\" weaves these shifts expertly. And  you will not see the twist coming in the last act. Here's hoping Remi Weekes joins Ari Aster and Robbert Eggers, bringing horror to a new level of intellectual freakiness."}, {"rating": "8", "text": "They say there is no home like home, right? The folklore and myths of Africa, and the problems of migrants, serve well as the basis for the already well-known story of the haunted house. I admit it gave me mixed feelings; yes it is good although not for one to scream or jump out of the seat. The intention was good and that's enough."}, {"rating": "8", "text": "His House was a pleasant and unexpected surprise from Netflix.A horror story that puts us within a narrative where the characters have already faced horrors much more real than a scare in the dark and where fortunately, both main characters are far from being stupid victims.There's something stalking them in that house, but apparently this entity does not live there, but they're carry it with themselves.And there's a tragedy at the heart of it, you have to watch, to find out what I'm talking about. Remi Weekes' His House has undoubtedly become one of the best debuts I have seen this year and the premise is both stark and haunting: The daily life experience of a couple of immigrant refugees as a horror story.And we must be honest, the director could have easily been lost by minimizing the experience in exchange for looking for cheap horror, but fortunately he doesn't choose that path and his film is quite a rewarding experience, especially speaking withing the horror genre. Widely recommended."}, {"rating": "7", "text": "A little confusing in some parts but I can appreciate it's rather organic feel, good acting, and the fact that it has a decent and rather traumatic story to give the overall plot a stronger back bone."}, {"rating": "10", "text": "In His House, a couple succeeds in escaping the nightmare of being a refugee only to be greeted by a new kind of terror—the past. This film attempts and in my opinion succeeds, in telling a horror story that is much more than about monsters but about our own demons and how they haunt us."}, {"rating": "8", "text": "Refugee couple from Sudan come to the UK and get a house but are getting haunted by a night witch because their daughter seemingly drowned in the Med but really, the dad had just abducted the kid so that they would be allowed to escape."}, {"rating": "10", "text": "An allegory! Breathtaking movie about refugees who leave a war zone on any cost, and try to settle in a new life. But how easy is to get rid of the wounds one carries and the deads one leaves behind. Wonderful acting."}, {"rating": "7", "text": "One of the better horror movies out there, with a deep story that will leave an impression and even move you. The actual horror/supernatural elements are a little bit B-grade, so those going in purely for the horror will not be highly impressed - but those that don't mind a film focused more on world themes than trying to scare you will appreciate it."}, {"rating": "5", "text": "The first half was quite nice, atmospheric and sometimes caused goosebumps. The second half was then but a classic trauma story strand in the horror genre. It was likely at the beginning that it would happen like that, but the staging overall was still quite refreshing and well resolved, especially due to the premise with which the film starts. The film was even sad in places and had a great soundscape, but it's not really convincing on its meta level of the refugee issue.2.5/5 5/10 ghosts overall."}, {"rating": "6", "text": "Narra una buena historia y es terrorífica, la recomiendo si te quieres asustar."}, {"rating": "3", "text": "I have a feeling that this movie receives praise because of its attempt to humanise \"the refugees\", rather than it's a good movie. Take that away and it is a mediocre attempt at horror."}, {"rating": "5", "text": "Meh. Didn't really grab me or scare me. Film's major thrust seemed to be the difficulties of assimilation, it gets the point across, but not sure it was the best way to tell that story."}, {"rating": "7", "text": "A well-thought-out movie that had a perfect concept with some mistakes with the jumpscares: the most horrific aspect of the movie is the scenes without creatures or monsters, but with real-life paranoia, while those with the said \"creatures\" are pretty amateur. A good debut from a promising director."}, {"rating": "8", "text": "Dear all horror writers and directors: this is what a good horror film looks like. Thought-provoking, scary, harrowing even, this film does so much storytelling in such a small space. You'll be kept guessing as to what it at all means up to the very end, but not without going through some incredibly touching moments. I can count on one hand the number of horror films that have made me think about their themes after I'd finished watching, and this is one of them. So if you like horror and films that have something to say then don't miss this one."}, {"rating": "8", "text": "I had never seen a movie who make me close my eyes and turn on the lights, until I watched this."}], "recommendations": ["lights_out", "the_conjuring", "the_conjuring_2", "scary_stories_to_tell_in_the_dark", "before_i_wake", "oculus", "the_autopsy_of_jane_doe", "winchester", "ouija_origin_of_evil", "the_witch", "annabelle_creation", "the_ritual", "the_night_house", "annabelle_comes_home", "the_lodge", "the_prodigy", "the_woman_in_black", "it_follows", "the_haunting_in_connecticut", "us", "insidious_chapter_3", "you_should_have_left", "the_boy", "the_forest", "a_cure_for_wellness"]}