{
  "id": 3081,
  "title": "Hitch",
  "starring": [
    "Will Smith",
    "Eva Mendes"
  ],
  "runtime": 118,
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "description": "Dating coach Alex 'Hitch' Hitchens mentors a bumbling client, Albert, who hopes to win the heart of the glamorous Allegra Cole. While Albert makes progress, Hitch faces his own romantic setbacks when proven techniques fail to work on Sara Melas, a tabloid reporter digging for dirt on Allegra Cole's love life. When Sara discovers Hitch's connection to Albert – now Allegra's boyfriend – it threatens to destroy both relationships.",
  "releaseYear": "2005",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/x3W9H3nhGQbWSlyI8Amp2F6Z6cz.jpg",
  "categories": {
    "plot": 7.5,
    "acting": 7.2,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.5625,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "With any other lead Hitch would be just a slightly above average romantic comedy, but because of Will Smith's smooth and clever acting, Hitch is elevated from just another rom-com to a much more memorable and funny movie."
    },
    {
      "rating": "9",
      "text": "Is this the ultimate date movie?? That's what most people I've talked to are saying. And that's exactly where this film delivers! There are no special effects, no crazy actions scenes, and no over-the-top romantic moments. It's a very real, relationship film with witty dialogue and captivating performances from Smith and the gang. It's perfect for a 2nd or 3rd date or anything after. Do not see it on a 1st date!! It'll make the end of the night way too awkward. If you want to have fun at the movies with a significant other, this is the movie to see. It could also substitue for Dating 101. And make sure you don't miss a hysterical cameo by Maulik Pancholy of 'Diwali' fame as Will Smith's doorman, Raoul. [Ed: Diwali...By all means!  Great flick...]"
    },
    {
      "rating": "7",
      "text": "Hitch is an amiable if rote romantic comedy that maximizes the charms of its quartet of leads. Unfortunately, the film mines most of its narrative ore from the tiresome notion that modern-day males are complete idiots, as mystified by the female gender as a coyote is by the moon. Will Smith did a marvelous job as the"
    },
    {
      "rating": "10",
      "text": "First of all, I'll just say that, except for the truly awful \"Wild, Wild West,\" I have absolutely loved everything Will Smith has been in. \"Hitch\" was no exception. This was a refreshing, funny and sweet film. Will was perfectly cast as the \"Date Doctor.\" Watching Kevin James totally screw everything up with Allegra was absolutely gut-bustingly funny. Eva Mendes is delightful as the woman who finally tames Hitch. Altogether a terrific movie."
    },
    {
      "rating": "1",
      "text": "Great little dancing scene in there thats hard not to like....but other than that I feel like i could have had kevin james do funnier things just off the top of my head,,,,but still they captured him dancing nicely and that might be the only funny scene in the movie...I don't think food allergies are funny....ellis island being sad for someone isn't funny....I feel like i'm missing a funny scene in the third act but idk..."
    },
    {
      "rating": "5",
      "text": "I think the concept was excellent, but the screenplay is horrible. Kudos to Will Smith for doing the best he could with the weak script and co-star he had to work with. Eva is one of the worst actresses I've ever seen. She has zero depth and personality. It seemed unrealistic that Hitch would be even remotely interested in her, and that's where the story goes wrong for me. There's absolutely no chemistry between these two at all. I'm still trying to figure out what/how/why they fall in love... or was it just Hitch who falls in love ('cause we got no sense that the feeling was mutual for Sara, Eva's character). What really irked me was how the writers tried to give us some insight into why Sara was such a tight-a$$ in the relationship arena... something about her sister almost dying! Not because she'd been hurt in relatuonships before... Not because someone she loved actually died, but because he sister ALMOST died when they were kids! Can you believe that??? Then there's the boss in the beginning who's insisting that she needs to take a break because works too much one minute, but demanding that she get some crappy gossip article written ASAP the next. But, even that I could deal with more than Hitch's plea for forgiveness at the end and Sara's resistance. It should have been the other way around completely! I did not want to see these two together, which makes it a horrible romantic comedy. Albert and Allergra's love affair saved the movie."
    },
    {
      "rating": "5",
      "text": "This movie tries so hard to be entertaining to a mainstream audience and ends up being cheesy and pandering rather than genuine or original. Hitch is mostly predictable and lacks much originality, relying on cheep laughs and one line crack jokes. Fans of Will Smith are suckers."
    },
    {
      "rating": "7",
      "text": "I keep going back to it--even after all this time. There's something about it that shines uncontrollably. I'm not sure if it's the performances or the story or a combination, but it certainly does work."
    },
    {
      "rating": "7",
      "text": "Hitch was a film I expected to not like, but at the end of the day, I really had a lot of fun with this one. A funny and charming buddy comedy, Hitch features a great comedic duo in Will Smith and Kevin James that really carry this one. Smith's charisma was a perfect match for James' awkwardness. The film was also really well written for a comedy and the jokes were, largely, smart instead of low brow, which I greatly appreciated. The main sin committed by this one is the classic love story element here where an unexpected guy manages to land the gorgeous girl that is way out of his league. In addition, much of the conflict arises from easily explainable situations that just get blown out of proportion. Without these, the film would be better, but also likely wouldn't exist, so I cannot complain too much. Overall, Hitch is a fun film that is light entertainment."
    },
    {
      "rating": "7",
      "text": "Hitch is a nice \"romance\" movie. Will Smith is the perfect matchmaker, doing amazing acting the whole time. Allegra, the hooked-upped women didn't really seem too \"good\" for her boyfriend (her boyfriend is being aided by Smith). Smith's girlfriend turns out to be totally unlikable in the end. Why did Smith ever try to get her back? She ruined his career and didn't even care. The plot was overall pretty solid. How can the Ellis Island scene get any more awkward? Good movie, but it wasn't very funny and I was expecting it to be. 7/10"
    },
    {
      "rating": "8",
      "text": "It's as slick and smooth as a mainstream film comes nowadays. Very enjoyable yet ultimately predictable. Will smith delivers the charm and humor in a surprisingly original fashion while Mendez and James offer up solid supporting performances. What separates itself from many other feel good romcoms  is that it stays true to its theme and also makes you think. If you like will smith or feel good movies that will entertain you and rattle your emotions throughout, then you'll enjoy this one."
    },
    {
      "rating": "7",
      "text": "Hitch is a romantic comedy that can kind of appeal to both sexes. Will Smith is obviously a big box office draw and males generally enjoy his work and Kevin James is known for King of Queens and other really funny projects. Both are heartwarming performers that you can get behind despite any flaws that they could have. It may be laced with cliché but its still an entertaining. It would have been nice to see Smith and James working together in a comedy film late on their career and sadly 10 years later there is still nothing, but I'll wait."
    },
    {
      "rating": "9",
      "text": "one of my favourite movies of all time with amazing cast, unique detective-like story and yes cheesy hollywood ending"
    },
    {
      "rating": "8",
      "text": "Kinda cheesy, but still good, maybe just because of Will Smith and Kevin James."
    },
    {
      "rating": "7",
      "text": "La trama es simple y predecible; pero esto se compensa con las buenas actuaciones de Will Smith y Kevin James."
    },
    {
      "rating": "10",
      "text": "One of my favorite movies of all time again. Love this movie! I love movies that have a storyline that's not common in a lot of movies. Thus is also really hilarious."
    }
  ],
  "recommendations": [
    "sleeping_with_other_people",
    "friends_with_benefits",
    "50_first_dates",
    "central_intelligence",
    "the_dilemma",
    "that_awkward_moment",
    "the_break_up",
    "role_models",
    "the_five_year_engagement",
    "the_nice_guys",
    "leap_year",
    "forgetting_sarah_marshall",
    "10_things_i_hate_about_you",
    "bachelorette",
    "horrible_bosses",
    "blockers",
    "meet_the_parents",
    "how_to_lose_a_guy_in_10_days",
    "no_strings_attached",
    "last_vegas",
    "clueless",
    "zack_and_miri_make_a_porno",
    "silver_linings_playbook",
    "the_wedding_ringer",
    "the_proposal"
  ]
}