{
  "id": 2146,
  "title": "Hitman",
  "starring": [
    "Timothy Olyphant",
    "Dougray Scott"
  ],
  "runtime": 89,
  "genre": [
    "Action",
    "Thriller",
    "Drama"
  ],
  "description": "A genetically engineered assassin with deadly aim, known only as \"Agent 47\" eliminates strategic targets for a top-secret organization. But when he's double-crossed, the hunter becomes the prey as 47 finds himself in a life-or-death game of international intrigue.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/h69UJOOKlrHcvhl5H2LY74N61DQ.jpg",
  "categories": {
    "plot": 6.121212121212121,
    "acting": 6.241379310344827,
    "ending": 6.0,
    "soundtrack": 6.0,
    "cinematography": 3.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.075
  },
  "reviews": [
    {
      "rating": "2",
      "text": "The worst movie I've seen this year, dont waste your money. Comes off like an extremely cheap borne idendity knock off."
    },
    {
      "rating": "9",
      "text": "Best action movie i have seen in a while."
    },
    {
      "rating": "8",
      "text": "I'm also not sure why people are slamming this so badly... it seems like people are quick to judge it because it's based on a video game. It felt very much like a French Action movie to me... which is a good thing. I enjoyed it overall but, there were a few things I would have changed"
    },
    {
      "rating": "3",
      "text": "Not good at all. Firstly it is nothing like the video games (well I had to mention this, because after all it is supposed to be a Hitman movie), it just using the name to generate more sales. Secondly this film is just a generic action movie, with no character depth or development. After the first 20 minutes you have seen it all, the director will just repeat the same things until the last frames. Not even the action scenes are anything good. Mr. Timothy Olyphant is not a bad actor, but this role did not really suit him. Not recommended."
    },
    {
      "rating": "2",
      "text": "Flopman..\r Hitman tries to give a suspenseful narrative style but bored the hell out of me. Few action sequences were enjoyable but just at par but apart from that it falls flat. Performances were poor to average and the bad script and dialogues made this movie based on video game(never heard about it until I saw the movie) even worse. The story of a assassin who looked like computer programmed robot(that’s how he was supposed to be though..ugh) drawn into political conspiracy did not generate much interest either. Overall Hitman may please a few people who like such game-based action flicks but in general it’s unlikely this movie will impress someone at random with high chances it may frustrate more often.\rPersonally I hated this movie badly but I won’t say everyone will hate this.\rHitman was a flop for me."
    },
    {
      "rating": "5",
      "text": "\"Hitman\", despite its frantic pace with monotonous dialogue added in, is a great counterexample of \"game-based movies suck\". Its a film that you will enjoy."
    },
    {
      "rating": "3",
      "text": "I have played every Hitman game and loved every one, and I must admit: This movie has the shell. The agent's name is 47, he's brought up in a facility and he's a hitman. The problem is, that it doesn't vaguely capture the spirit, or the core, of the Hitman games. What seems the most misplaced is the pseudo-romantic little-boyish interaction between 47 and the Russian girl. In some ways the movie could have been rated as a passable action movie, but truth be told, IO-Interactive's directors and designers did a far better job on the story-telling and entertainment value. This is not good when comparing a movie to a game. So, basically the movie is an empty shell, which in no way has earned its title."
    },
    {
      "rating": "6",
      "text": "One stupid sword fight away from being rated much higher. That particular fight was a re-shoot, too - the director originally had something else planned for that scene, but somebody felt an additional action sequence was needed, so - dumb fight. For the rest, it's a fast-moving film with some smash-mouth action. And the final denouement demonstrates Agent 47's cleverness at avoiding a trap (or setting one? you'll have to find out). Olyphant and Kurylenko are an interesting pair when they're given dialogue together (not as often as it could have been). Robert Knepper is great as always. While the soundtrack is loud, Zanelli put together a good one.\r A fun action movie, and a strong 6 out of 10."
    },
    {
      "rating": "10",
      "text": "i own hte movie and i think it is the best!! Timothy Olyphant did a great job portraying Agent 47. i even fing Timothy Olyphant very sexy with a gun....im a girl and i have my opinions!"
    },
    {
      "rating": "0",
      "text": "sh*ts on the games. literally ruined american cinema as we know it today. my life will never be the same. asdfghjklkjhgfdsasdfghjklkjhgfdsaSDFGHJKLKJHGFDSASDFGHJKLKJH"
    },
    {
      "rating": "4",
      "text": "It has a few eye-catching set pieces, but this video game adaptation takes more pleasure in cliche than actually crafting a worthwhile story."
    },
    {
      "rating": "6",
      "text": "Not a bad movie but I wouldn't consider it good either. It's kind of mixed bag. I did enjoy it but it was pretty dumb and some scenes were laughable. That being said I liked the actors in it. The problem was the script. The main lead was good as Hitman. I think with a better script this could have been a great movie."
    },
    {
      "rating": "10",
      "text": "This movie was great! Ignore all the people that gave a bad rating for this. This movie has great action and a good story. More different than the video game but still awesome!!"
    },
    {
      "rating": "0",
      "text": "Not well advertised, I saw some of the posters, but they never gave much of this movie's detail and story in depth. Just a guy with a gun, it supposedly is a good action movie, I enjoyed it. But once i considered these reviews, 34/100!!! I started to agree in a way, but the story was good, action was good, but I think the main critical saying is that the acting sucked. Like you have to agree, they write a good script, direct it on stage, film it with a camera and get it over with. But the acting truly sucked, the genre was good, but this movie is a letdown, the acting affected the power of the script and direction, the good screenplay is wasted. Overall a low budget crap show."
    },
    {
      "rating": "4",
      "text": "Not the worst video game movie I've ever seen, but still a pretty horrible one. I've never played a game in the Hitman series so I can't compare it to them. The action is mildly entertaining, but the gore is to fake to be believable and just seems to be in it for the sake of having it. The script is a series of predictable moments that you've seen happen a million times in other movies. The acting and characters are awful, and timothy olyphant makes for one of the worst main characters of all time, but that may just be do to the writing, he has no personality and constantly has the stupidest look on his face at all times. This movie sucks, it's almost bad as the Uwe Boll video game movies. Don't watch this crappy movie."
    },
    {
      "rating": "10",
      "text": "This movie is awesome and has great action. Great acting by Timothy Olyphant and he's great in Justified too. The critics always get negative on movie that were based on video games anyway so screw the critics."
    },
    {
      "rating": "7",
      "text": "Easily one of the most underrated game adaptations.  The action sequences are solid (accept the cheesy 4 man hitman fight that was added later by another director â"
    },
    {
      "rating": "8",
      "text": "Bloody, action packed but never stupid. An exiting plot that doesn't have to hide from a Bourne story, Timothy Olyphant and Dougray Scott as hero and antihero or the other way round, you feel with both. Not for the faint-hearted, but especially for fans of the video game a full indulgence."
    },
    {
      "rating": "7",
      "text": "I was never a big fan of the games, and I'm not telling the game fans about what opinion to hold. All I know is that I enjoyed the movie myself. The action, plot and characterization worked well. The movie is not long enough to become boring. If anything, I wanted it to be longer."
    },
    {
      "rating": "8",
      "text": "I liked this movie. I don't understand why so many people hate it, probably because we are looking on the internet. Anyway, if you haven't seen it and your a Hitman fan definitely check this out. I would put this up near the Bond films as my favorite \"spy\" films. When I picked this up from my local FYE I thought it was gonna be a bad movie where Hollywood would make a quick buck. It actually stayed close to it's game based roots as far as gadgets and stealth tactics go. Although it was a little weird seeing 47 \"fall in love\", the movie still was able to portray him as a cold blooded killer. It was interesting that Hitman: Absolution showed 47 had a softer side in the game. I wished they had released the game first, if that happened then the movie would make sense. Seeing that Agent 47 isn't just a \"Robotic Killer\" as seen in the older games. Don't let the negativity fool you into missing out on this movie. If you collect game items or game related items, or just a Hitman fan, buy this from your local FYE. It's not as bad as people say."
    },
    {
      "rating": "6",
      "text": "Hitman is not a terrible film in fact patches of it are quite fun having some really good action sequences and cinematography along with a damn good performance from Timothy Olyphant as Agent 47 but unfortunately the characterisation is very poor with a multitude of characters that are bland and the plot of the film really seems to get lost in the midst of all of the action a lot of the action sequences do not move the plot forward at all it is used as a distraction really.\rGrade:C"
    },
    {
      "rating": "4",
      "text": "There's lovely moments to say... \"No, this isn't the worst film of 2007 because I already figured that one out.\" ... and why does Hitman even need a movie anyways? I thought it was fine with the video games."
    },
    {
      "rating": "8",
      "text": "8/10 *  >>> Hat mir gefallen. Hätte man aber noch besser machen können.:-)"
    },
    {
      "rating": "9",
      "text": "The sheer intensity exuded by Olyphant and the emotional performance by the lovely Olga make this movie what it is. It was the interaction between the two: the way Agent 47 cared for her wellbeing and yet brutally disposed of the corrupt characters in such a cold, calm, and flawless manner. The two sides of his character were wonderfully played. It gives a glimpse into the life of 47... \"How does a good man decide when to kill?\" I've played all the games but I prefer the movie depiction of 47. The story could use some work, but it didn't ruin the movie for me. I'm buying the DVD!"
    },
    {
      "rating": "7",
      "text": "He's bald. He's celibate. He buys a magazine for the luggage advertisements. \"Hitman\" satiates a hunger that cinephiles didn't know they possessed; a clamoring to see Sinead O'Connor mow down Russians in exotic locales like a post-cancer Jennifer Garner after radiation treatment. Timothy Olyphant is not your obvious choice to helm a shoot-em-up actioneer, but that's what they said about Bruce Willis when \"Die Hard\" came a callin'. Agent 47 is such a serene killer, you suspect that he's a closeted Buddhist who makes covert pilgrimages to the Bodhi tree in India for spiritual enlightenment and guidance(the Buddha instructed him to always keep two guns handy in any hotel ice machine). He's confident. That's for sure. He levels the playing field by mostly foregoing the utilization of any headwear; his shiny scalp making it easier for his enemies to pick him out in a crowded area. But \"Hitman is not a miss, man; it's less ridiculous than most action films adapted from video games. Agent 47's relationship with Nika(Olga Kurylenko) provides \"Hitman\" with that crucial element which often goes missing in most action films; a palpable chemistry, or in this case, sexual tension, between its primary male and female star. Bullets fly, yes, but sparks fly, too."
    },
    {
      "rating": "8",
      "text": "Fast-paced and action filled, just what more can a gamer ask for. very entertaining and it did not disappoint."
    },
    {
      "rating": "7",
      "text": "I am a big fan of the Hitman video game franchise because its not all about bullets and explosions, the aim of the game is to eliminate your target with a more stealthy and clean approach (such as poisoning targets and using disguises), I felt that the movie did not follow this unique style and just stuck with a few exiting but typical gun fights which is why the film will not do well with Hitman fans. In the game you also travel around and explore beautiful environments which you see none of in the film. While I enjoyed Timothy Olyphants performance as Agent 47 I didn't feel he accurately portrayed the usually emotionless and completely ruthless assassin in the award winning game. As a fan of the game I was a little disappointed, but as a film I thought the story was intense and had a few good twists and turns, at times the acting and diolauge was a little cheezy some good shooting scenes but nothing we haven't seen before. Simply, Hitman was good but nothing special."
    },
    {
      "rating": "10",
      "text": "These critics are wrong, this is one of the best films this year and a great impersonation of the game. The film is made towards fans of the game, and is great if you have played the games or are into games. The director did a great job!"
    },
    {
      "rating": "8",
      "text": "This is by no means a bad film and in my opinion a 30-40 average score is really not warranted. For fans of the Hitman games especially this is a hugely entertaining and well crafted movie and I think Olyphant plays the role excellently, sporting the red tie of 47. The story is a little basic and hard to believe at times and I just wish some of the assassinations had been a bit cleverer (involving some more intelligent preparation etc.), so I've marked it down to an 8, otherwise I enjoyed it immensely!"
    },
    {
      "rating": "7",
      "text": "Though I said seven, the movie actually warrants a 7.5, maybe even a 7.75. As far as just a movie goes, I found it to have a good story line, nicely played out action scenes, and characters that acted how they would in a game. I have played Hitman: Blood Money, and the awesomeness was what made me want to see the movie. I really think it takes a beyond spectacular movie to deserve a \"10\", so Hitman did admirably considering the limited scope of the games' worlds. I found some reviews to be harsh solely because the author disliked that it was based on a game, and one review I read in a newspaper completely misunderstood the plot. I feel some reviewers don't fully understand the kind of world 47 operates in as an assassin, and that lack of comprehension was because they hadn't played any of the games."
    },
    {
      "rating": "8",
      "text": "The first time seeing it, I was disappointed. I found myself a little confused about who did what but for the most part it was pretty linear. I saw it again and I enjoyed it much more. The action is above average. The main complaint is that this movie isn't like the games. It goes for full blown action and gunplay, but it ignores the stealth and strategy of the games. Also, Timothy Olyphant didn't fit the character too well. But I enjoyed it very much."
    },
    {
      "rating": "4",
      "text": "Empty action movie, no substance with shallow underdeveloped characters. It does have some good photography but the film just isn't involving. A lighter approach might have worked."
    },
    {
      "rating": "6",
      "text": "I don't think I've ever laughed so hard at a movie that isn't a comedy. Granted, I enjoyed Michael Bay's remake of The Bourne Ultimatum, er, I mean Hitman, but that doesn't make it any less terrible. Olyphant is miscast as the famed Agent 47, and he doesn't really add much to the ridiculously overused role. I mean, I can actually give a shit if John McClaine gets killed, but I'd just give a shrug if it happened to Agent 47. If anything, I'd be surprised, because he doesn't seem to get injured whatsoever. If Hitman's worth anything more than a few fun action scenes, some gore, unintentional laughs, and staring at attractive, nude women, then it's a good, nostalgic present for you Dad if he grew up on ridiculous action movies."
    },
    {
      "rating": "8",
      "text": "Clearly non of the \"professional\" critics have ever played the games. I think that's why so many comic book and video game movies get such poor reviews. They have no frame of reference. The story was a tad bland but the movie was full of small touches from the games (lots of scenes from behind 47's head, the way 47 walks, the red tie, the weapons). Olyphant definitely did his homework for this role and so did the director. Too bad none of the critics did the same..."
    },
    {
      "rating": "6",
      "text": "Its a good action movie but it had some scenes where it didn't stick to the game and the plot was ok.Plenty of gore from start to finish.One scene I didn't like was Hitman fighting with swords which is nothing like the game.Timothy Olphant is probably the best at being Hitman.I know Timothy doesn't seem as intimidating as Hitman in the game but who could possibly pull that off.I don't know what actor even comes close to looking like Hitman.Hitman did use the same weapons and clothes as in the video game and there are a couple of times he's incognito just like the the game.He walks just like the Hitman in the game."
    },
    {
      "rating": "6",
      "text": "i dont know what was up the critics asses on this one. Hitman was niether good or bad it was decent. It should have gotten better ratings then it recieved. It had a decent plot, the action was good, and Agent 47 was unstoppable. Hoping for a sequel."
    },
    {
      "rating": "2",
      "text": "This is a joke for the fans of the game, the main story is pathetic and if you played any of the games you will not see nothing like that. Many scenes are dumb, like the fight scenes. Timothy Olyphant doesn't fit the character of hitman, and not even close because hitman is a cold character. I think this movie is very bad executed, the writers have to play the game a little to understand the concept of the character and the things he do. I think the best of the movie is Olga Kurylenko and her beauty but thats all. Its really a shame."
    },
    {
      "rating": "7",
      "text": "It was ok, I would have rather seen Jason Stathom as Agent 47 It also side tracked from the game quite a bit Would have rather just seen the story straight from Blood Money turned into a movie Still, it's not terrible."
    },
    {
      "rating": "8",
      "text": "Much better than all the critics claim. I went into it not expecting much and was very pleasantly surprised. Can get a little confusing in places but a pretty decent plot overall. Let's home there's a second movie."
    },
    {
      "rating": "10",
      "text": "Iits thrilling and nicely made, i never played the game but i want to now."
    },
    {
      "rating": "3",
      "text": "Bad actors, worse scenario and not enough good-looking action-scenes. I would better rewatch The Bourne Identity once more."
    },
    {
      "rating": "9",
      "text": "I never saw the video game but thoroughly enjoyed the stylized action and understated acting of Olyphant. My son said the critics who write about movies don't actually enjoy being entertained. That must be the case with this one because it was extremely engaging."
    },
    {
      "rating": "10",
      "text": "I am a huge fan of the Hitman game series and have anticipated this movie for quite some time. I was very impressed. Olyphant portrayed Agent 47 true to his nature in the games. He is a Hitman, but he has some conscience. I can see how some people may see this as a Bourne Identity knock off, but given that that is what action movies have to live up to these days I think Hitman did a good job at living up to its competition, but kept its unique touch as well. The only complaint I have is the score. It seemed far too repetitive. I feel that Jesper Kyd (the artist that wrote the score for the games) should have done the score to the film."
    },
    {
      "rating": "9",
      "text": "What the hell was up the critics asses??? I give this movie an 8 because I feel like it could have expanded on his upbringing a little more, just for the sake of story telling if nothing else. Otherwise it was extremely well made and very artistic. Just go into the movie and enjoy it for what its worth, an action movie based on a simple premise."
    },
    {
      "rating": "3",
      "text": "I knew the movie was bad before I saw it so I went in not expecting much. But i really wasn't prepared for the cheesy borefest that I was subjected to. The scene where bar-code baldy faces four assasins is really is really a case in point, irt was so bad that it was no longer funny, \"Let me die in dignity\" ha ha ha!!!"
    },
    {
      "rating": "9",
      "text": "Before I watched this movie, I saw the bad, if not horrible, reviews written by the critics. But this didn't stop me from watching because I was a huge Hitman game fan. And honestly, it wasn't so bad! It was actually good."
    },
    {
      "rating": "4",
      "text": "Off the wagon and onto the road."
    },
    {
      "rating": "10",
      "text": "I have to say that, having experienced several video-to-movie travesties in the past, I was expecting very little from this movie, but went to watch it anyway more out of curiosity. I was very pleasantly surprised, and found it to be one of the most interesting and enjoyable films Ive seen recently. Whilst the Bourne Ultimatum may be a more well crafted film, I find that movies of its type are all too ubiquitous and run-of-the-mill these days. It was very refreshing to see a film who's main protagonist was a cold, calculating killing machine. I honestly think it played out truthfully, and the reactions to his persona were believable and fascinating. I think I will remember this movie for a long time, not because it more well crafted than other movies in its genre or anything like that, but because it tells the story of a different and more refreshing character than the usual old Bourne / Bond / Die Hard / etc... types who are all identical in every way. This is NOT a formula movie, and I think it is worth seeing. Think of it as a Terminator-Eye-View meets Equilibrium but with an actor who can do the role justice."
    },
    {
      "rating": "9",
      "text": "I don't know about the rest of you, but I thought this movie was excellent. What more do you want? This movie isn't suppose to be a drama or a well-thought out mystery. This movie deserves so much more than some of you are giving right now!"
    },
    {
      "rating": "10",
      "text": "One of the best movies of the year. Timothy Olymphant truly is hitman. If you loved the game see this movie, if you don't then go see it. This movie has gone in a different direction then other Game-movie adaptations. It has still maintained the kicks that hitman game lovers want but has plenty of good action and storyline to keep you in the action."
    }
  ]
}