{
  "id": 2590,
  "title": "Holidate",
  "starring": [
    "Emma Roberts",
    "Luke Bracey"
  ],
  "runtime": 104,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Fed up with being single on holidays, two strangers agree to be each other's platonic plus-ones all year long, only to catch real feelings along the way.",
  "releaseYear": "2020",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/oXCLSlCRWWHsSSwLJSVIC0DDWsE.jpg",
  "categories": {
    "plot": 5.5,
    "acting": 5.666666666666667,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 2.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This movie was cute and I enjoyed it! Something our family needed with all the crazy sh*t that's going on these days! #thanksNetflix"
    },
    {
      "rating": "5",
      "text": "Emma Roberts plays a popular new type: a woman who can’t commit.  She meets cute with Luke Bracey and they decide to be each other’s dates for all the upcoming holidays…no strings attached. The inevitable happens, but not before they spend every major celebration trying to dismiss their mutual attraction. This film is so predictable that it needs clever dialogue or entertaining characters to make it rise above. In this case, there’s a TOUCH of both, esp. Kristin Chenoweth in her fun role. The leads are both adequate but never special. Anyone who’s mildly cynical will find the film full of relatively tiresome tropes, but there’s hope for the shamelessly romantic."
    },
    {
      "rating": "6",
      "text": "Ainda em dúvidas sobre a atuação da Emma Roberts. No mais, nada de novo. Razoável."
    },
    {
      "rating": "3",
      "text": "Forced jokes, forced script, if you need more time to set up the script just make a mini-series. Everything seemed like they took bad jokes, bad script and scrambled it up hoping it will make an ok movie. AS USUAL ON NETFLIX or more like NOFIXNET? crappy quality and abusing the name brand to justify low quality movies.. in my opinion Netflix is the worst movie streaming platform to ever exist"
    },
    {
      "rating": "1",
      "text": "unfunny, unlikable characters, vulgar jokes. Emma Roberts should have been in a good holiday movie... this isn't it. I couldn't imagine watching this with any family members. This is a mess."
    },
    {
      "rating": "4",
      "text": "It's way too **** early to deal with these **** christmas rom-coms. Just take a look at the director's credits, so you know what to expect."
    },
    {
      "rating": "0",
      "text": "This is easily one of the worst movies I’ve ever seen.  I watched it in disbelief.  Disbelief that Emma Roberts would agree to star in it.  Disbelief that people actually would give this a positive review.  Disbelief that an entire movie can go without one genuine realistic (or funny) moment.  Disbelief that they would spoon-feed toilet humour to Emma Roberts's fan base.  If any movie deserved a negative rating, it's this embarrassing mess."
    },
    {
      "rating": "0",
      "text": "This is pure garbage and not even funny. And firework injuries are NOT funny at all. Why was this even made."
    },
    {
      "rating": "6",
      "text": "Es entretenida y divertida, es buena para distraerse un rato, la recomiendo."
    },
    {
      "rating": "3",
      "text": "Predecible, mal actuada, para ver una vez y nunca más.. te tiene que tomar desprevenido (como me pasó a mí) para verla."
    },
    {
      "rating": "6",
      "text": "Holidate doesn't add much in the rom-com realm, and if you add nasty jokes to it, it's not a good recommendation for Christmas."
    },
    {
      "rating": "6",
      "text": "I'm not much a fan of romantic comedies but this movie was a pleasant surprise for me. Throughout the movie our two characters 'date' over holidays and gradually develop feelings for one another though not properly conveying this or having a serious conversation about it. Overall I feel the performances given were sincere and sweet and I enjoyed this movie more than others of the genre I've seen. It's a goofy movie and definitely worth a watch."
    },
    {
      "rating": "0",
      "text": "The movie was based on old concept of love. New and refreshing content could have helped the movie."
    },
    {
      "rating": "8",
      "text": "Funnier than you might expect!This movie was very enjoyable and sweet while you keep in mind that this is a Netflix romcom and not expecting more from it.I'll recommend it for people who are looking for something light for an hour and a half and for romcomes fans. Collapse"
    }
  ]
}