{
  "id": 3084,
  "title": "Hollow Man",
  "starring": [
    "Kevin Bacon",
    "Elisabeth Shue"
  ],
  "runtime": 112,
  "genre": [
    "Action",
    "Science Fiction",
    "Thriller"
  ],
  "description": "Cocky researcher Sebastian Caine is working on a project to make living creatures invisible. Determined to achieve the ultimate breakthrough, Caine pushes his team to move to the next phase — using himself as the subject. The test is a success, but when the process can't be reversed and Caine seems doomed to future without flesh, he starts to turn increasingly dangerous.",
  "releaseYear": "2000",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nAasMJGaytKKsMGbrXJr0g8OufK.jpg",
  "categories": {
    "plot": 3.7333333333333334,
    "acting": 3.888888888888889,
    "ending": 6.166666666666667,
    "soundtrack": 5.0,
    "cinematography": 3.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 3.5
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Bad script but decent casting and plot could have and should have been better."
    },
    {
      "rating": "4",
      "text": "Not as bad as the critics might  have you think, but it's still not so good. This movie comes across to me like a wasted opportunity. The special effects and the premise are intriguing, but there are so many interesting and thought-provoking ways this movie could have gone that are left unexplored, and it instead ends up being a cliche and mediocre thriller. The last 20 minutes or so are actually entertaining, but it's all so illogical and ridiculous. Why can't you see food that Kevin Bacon eats if he's invisible? How did he survive being electrocuted and randomly appear in the elevator shaft? How did that other guy survive getting a gaping hole in his abdomen and yet 10 minutes later he was running around and climbing elevators? How did they not get hit by the rubble falling all over them? Lazy, lazy writing!"
    },
    {
      "rating": "4",
      "text": "Throughout his career, Paul Verhoeven has been criticized for his film's rampant misogyny, violence against women (rape is a constant), and strong violence. Hollow Man, unarguably his worst film, embodies all of these. Yet, as always, it is through a unique lens. While Verhoeven himself claims that anybody could have directed Hollow Man - and he is right - few could have pulled off the antagonist of Hollow Man (Kevin Bacon) in the fashion that Verhoeven did. Turning this heinous man into a compelling antagonist to protagonist Linda (Elisabeth Shue), Verhoeven makes this film one that is squarely about the dangers faced by women in a world dominated by men, their ambitions, and their potentially nefarious intentions with women. It is unfortunate, then, that the rest of the film is so bland.This thematic consideration is introduced quite early. Sebastian Caine (Bacon), is a brilliant scientist who discovers how to not just make animals invisible, but how to make them re-appear again. Confident that his experiment will work on humans, he uses himself as the test subject. Unfortunately for him, things go wrong and he stays invisible. Unfortunately for everyone else, Sebastian is a truly wicked man and a perfect portrait of toxic masculinity. Wishing to own Linda, Sebastian is immediately incensed when he sees another man in her bed when giving her the news about his initial breakthrough. Yet, he never gives up the chase and continuously makes advances on her to try and make her \"his\" once more. When he learns that she is dating co-worker Matt (Josh Brolin), his rage only becomes more pronounced. Thus, it is no surprise to see Verhoeven set the film up as being Sebastian versus Linda. In dream sequences, Linda imagines being raped by the invisible Sebastian and that is exactly the plight she must face. Verhoeven, like many male directors, is often obsessed with putting women in dangerous situations out of a fear that women in the world are in danger. Linda is put in this position in the film via her connection to Sebastian before his invisibility. Now, with him invisible, it is only natural that he will continue to act on his belief that Linda belongs to him and nobody else.Yet, Sebastian, as with many men who possess this dangerous toxic masculinity, believes that he is owed any woman's body. Leering at a woman undressing in the apartment across from his in a disturbing act of voyeurism - in sequences that feel like a Verhoeven-led interpretation of Alfred Hitchcock's Rear Window - Sebastian continuously is disheartened when she closes the blinds before revealing her nude body. Not taking no for an answer, he quickly takes advantage of his invisibility and opts to rape her. Driven out of a desire to demystify the woman and assert his ownership of his body, Sebastian's act of violence is driven by a need to see her nude and is an urge he cannot put away. It is primal, violent, and thoroughly disturbing. At work, he sexually assaults veterinarian Sarah (Kim Dickens). The sequence is similarly alarming and brilliantly approached by Verhoeven. On the surface, however, if Sebastian were the protagonist, this would be troubling. Instead, by making him the antagonist, Verhoeven turns it into a terrifying display of rape culture in the world with Sebastian Caine being the embodiment of any man who believes that women owe him sex or to simply see them nude. By doing this, Verhoeven turns Hollow Man into an unexpected, but chilling, realization of the classic \"male fantasy\". Ask some young men what they would if they were invisible and you will get the answer that they would spy on women in the locker room or through the window. It is a classic \"boys will be boys\" answer that will likely elicit laughter from the right crowd, but is a chilling confirmation of one thing: some average men would sexually harass, sexually assault, or even rape, women if there were no consequences. Sebastian is one of these men. Before raping the girl across the way, he tries to talk himself out of it before realizing that nobody will ever know. He lives out work fantasies of seeing Sarah naked who he views as \"feisty\" due to her constant fights with him. By making Sarah be the one he assaults at work, it is a smart tactic to show how Sebastian craves power. She emasculates him by challenging him and his decisions, thus he must ensure he can reclaim power over her and make her subordinate to his manly strength. After watching Sebastian's terrifying reign of terror on the women of the city, it is hardly a surprise that he is reluctant to give away his \"power\". It is the only thing that makes him feel like a \"complete\" man with the way in which he gets the sex he wants with who he wants, even if they do not want the same. It may even be able to restore Linda's body to him if he can sneak past Matt. It is a chilling depiction of the dangerous and possessive toxic masculinity that lurks in the background of many average people."
    },
    {
      "rating": "4",
      "text": "Hollow Man is surprisingly a very weak film. It has an interesting plot, but then the plot becomes linear and predictable. The characters are not spelled out at all, they have no motivation. Dialogues are primitive. Very weak régessure. Is it possible to distinguish only visual effects, here they look normal, and the empty shape of the head looks fresh."
    },
    {
      "rating": "0",
      "text": "Total Recall and Robocop are classic action movies. This movie doesn't even come close to the quality of these two movies. If you want to see a great thriller with Kevin Bacon watch Stir Of Echoes. Hollow Man has nothing unique or inventive. One of the weakest movies of 2000 and of the director's career, avoid if you have never seen it or heard of it."
    },
    {
      "rating": "10",
      "text": "Great action, too many talking scens! but in the end i love the movie! i especally like the guy who plays carter!"
    },
    {
      "rating": "7",
      "text": "Paul Verhoevan's Hollow Man is a take on HG Wells's Invisible Man but with much gore, nudity and evil. Hehe, that's the Dutch filmmaker for you- All of Verhoevan's films have been gory and courted controversy and Hollow Man is similar in every way. Kevin Bacon plays the titular character- a rogue but a charming one and Bacon is probably the finest actors to walk the line between good and rotten evil. Elizabeth Shue, Josh Brolin and a few others play the good conscientious guys, but it isn't long before you start siding with Bacon's character. The special effects are very good, and the invisible scenes were an absolute highlight. There is a scene with a gorilla which is spooky and exhilarating and will probably stay with you long after the film is over. If you are one of those who doesn’t care if the main lead is an antihero, who doesn’t follow the usual tropes of cinema than Paul Verhoevan's Hollow Man would be an interesting film to watch.(Verhoevan's take on The Invisible Man)."
    },
    {
      "rating": "6",
      "text": "An effective thriller at times with good special effects for its time. I've seen most of the criticism being aimed towards the film's rampant misogyny and while that is a very valid criticism, it's still an effective and largely contained thriller when it gets down to it.  The cast is good, Kevin Bacon is effective as the arrogant and very misogynistic Sebastian Cain and it offers up decent scares and intense moments. Its mostly okay"
    },
    {
      "rating": "8",
      "text": "I really am surprised at the negative reviews because this is one of my favourites growing up and still is. Kevin Bacon leads a very solid cast with a great twist on the invisible man story. I loved it."
    },
    {
      "rating": "6",
      "text": "A scientist volunteers himself to turn invisible for his research. He can't turn back and he loses his mind attacking his colleagues later in the film. The concept is brilliant but it is underused the results are very underwhelming. The movie would've been great but it turns into your run of the mill, cliched slasher thriller. Kevin should have played the protagonist not the antagonist, that would have worked. Someone else should have been the invisible one. Bacon is lousy as a villain and many scenes also add nothing to the movie as when he attacks the lady in the apartment across from his. That scene is very gratuitous and pointless."
    },
    {
      "rating": "3",
      "text": "Apart from its confessedly impressive visual effects, \"Hollow Man\" is just a typical horror film that offers a weak script and reprehensible dialogue."
    },
    {
      "rating": "6",
      "text": "ojihigufydhgjguyinkhojojohihjgydtsrwrwtiommbtdtdrstfugihohojojomouttsrseadffjhon"
    },
    {
      "rating": "3",
      "text": "I confess I expected a bit more from this movie. The script was promising, with a good initial premise: an experiment in humans that works well, but ends up failing because of the ego and arrogance of the person used to do all the tests, the same scientist who had coordinated animal experiments previously and who had shown, at that time, few scruples and little concern for the ethical and deontological issues of his profession. Add to that a high dose of misogyny and you will make the main character a potential villain, to whom superhuman power is given: invisibility.The problem with all this is that everything ended up being terribly underdeveloped. Aside from what I said, there is no script or story, all summing up with a hunt for the invisible man. Another problem is that most of the characters are empty and there is a good deal of clichés and predictability throughout the film. The romantic sub-plots outlined in the film are perhaps the worst part, as far as plot is concerned. Paul Verhoeven is a satisfatory director, who missed the opportunity to make a good movie. Kevin Bacon impressed me positively, especially considering that I have never particularly enjoyed the work done by the actor. He was able to become really bad at this character, something the character demanded of him. Elisabeth Shue tried to do a good job, but she did not have the material for it.Visually, the film is good ... it has good cinematography and a good CGI (considering the time when the film was made, of course), good special effects and sound, good action scenes and suspense. The soundtrack, discreet but effective, is a good addition. But all this, while positive, is not enough to compensate for the lack of a better, more developed script, with more material for supporting characters to do something more than to talk."
    },
    {
      "rating": "10",
      "text": "Great actings and ambiance.Kevin Bacon's performance is brilliant for me.My childhood movie.Love this!"
    },
    {
      "rating": "8",
      "text": "Quand Paul Verhoeven s'attaque au mythe de l'homme invisible, un sujet ressassé depuis des lustres dans bien des livres, films ou séries, c'est pour mieux le revisiter de l'intérieur et lui donner une densité inattendue faite de noirceur, de voyeurisme et de dérapages plus ou moins brutaux... et incontrôlés...  et incontrôlables !C'est l'occasion de mettre à jour de très vilains et mauvais penchants, surtout lorsque le cobaye déjà mégalomane est prédisposé à quelque tendance psychopathique... Très bien incarné (ou désincarné) par un Kevin Bacon étonnamment à l'aise dans cet odieux personnage, on suit l'évolution ou plutôt l'involution de l'humain qui se découvre un pouvoir inédit qui va tout bouleverser... Volontiers violent mais aussi fripon, le réalisateur se laisse aller à quelques situations vicelardes pour ne pas dire sensiblement lubriques, sacré Paul, on te reconnaît bien là !En contrepoint et en ex-compagne, on a la très belle Elisabeth Shue qui se révèle la femme forte et intelligente du groupe face à l'adversité inattendue... Josh Brolin reste en retrait, costaud mais trop cave pour réellement briller, comme le reste de l'équipe, une bande de geeks aux blagues faciles, simple et pure chair à canon à dire vrai !Très bien consruit, le film ne souffre d'aucun temps mort et bénéficie d'effets spéciaux excellents ; et comme toujours avec Verhoeven, la mise en scène n'est jamais prise en défaut : c'est du beau boulot, propre, net et sans bavure. Cela étant dit, dans sa partie finale lorsque tout commence à partir en vrille (forcément), le film s'égare dans le grand guignol hollywwodien de base, sacrifiant toute sa crédibilité au profit du pur spectacle...Une fin pas très sérieuse donc mais globalement le film demeure solide, gentiment pervers et diablement efficace. Avec le recul et le poids des ans (quand même) il n'a d'ailleurs pas vieilli d'un iota : il reste incisif, bien ficelé... et avec ce petit côté sardonique, la fameuse Verhoeven touch !"
    },
    {
      "rating": "2",
      "text": "Only interesting if you are a student of Hollywood special effects. Otherwise it's quite boring and a little perverse in its themes and over-the-top gore."
    },
    {
      "rating": "1",
      "text": "Disturbing.Someone read The Invisible Man by H.G. Wells and thought they should make the main character a sexually abusive boss. This character then turns into an invisible terminator and starts killing off his employees.What could have been a critique of \"look the other way\" Hollywood slips into a cheap action flic."
    },
    {
      "rating": "7",
      "text": "I am not quite sure why I liked this film so much and so few others did. I found it to be a very tense and exciting sci-fi thriller.It is wonderfully imaginative, has good performances, especially Kevin Bacon, one of his best roles. The special effects are excellent. The plot is a great one, I never lost interest. Great film."
    },
    {
      "rating": "4",
      "text": "I've seen better and worse films with Mr Bacon. This film is simply another cliched foray into the sci/fi/horror type flick. Truly ordinary in the way it ends with the lacklustre defeat of the (by that stage) poorly computer generated Bacon. (in fact he looks like he might actually have been made out of bacon)."
    },
    {
      "rating": "2",
      "text": "This movie has all the bad elements of a B rated horror flick. However it's not snakes on a plane bad, more like snakes in a pit of boringness. It doesn't even have the guilty sense of bad movie watching pleasure. Neophytes who like bad movies would really have to dig deep to enjoy this one."
    },
    {
      "rating": "7",
      "text": "This movie got a seven from me for what is and what it means to me as a science geek. This is not a great movie, don't get me wrong; but is a exceptionally well executed one at that. Hollow man follows the story of Dr. Sebastian Cane, an egotistical and arrogant scientist working on a way to make living matter invisible. He has already succeeded on animal trials and is ready to go to the next step, human testing, Cane volunteers to be the first human subject. The experiment seems like a major success, until something goes terrible goes wrong. Now Sebastian is becoming increasingly paranoid and out of control, doomed to be without flesh for all his life. Now his team wants to shut the project down and bring in the government to catch Sebastian, But Sebastian traps them in the lab with him. With time running out can the team really out smart a maniac invisible man? Hollow man is not a great movie in the sense of what it is, it is a great achievement in visual effects and putting a whole new story to the invisible man tale. It also makes you wonder if that feeling you get when your alone is really just a feeling, or if it's just your imagination playing tricks on you."
    },
    {
      "rating": "7",
      "text": "NO way does this movie deserve a sub 30's rating. Again NO way! I reserve a rating that low for things that are unwatchable. Not that this movie was all that great. It was mediocre pretty much all across the board, but done well enough. I'd normally give it a 5 out of 10, but the ratings are so skewed towards the low end, I bumped mine up in a small effort to balance things out. Definitely a watchable flick."
    },
    {
      "rating": "10",
      "text": "The funniest comedy of the year, if not the decade. Everything including the story, acting, and sheer genius by the director just makes me want to pee my pants. Obviously this movie was not meant to be serious, and most of the critics did not realize this. There is no way that anyone could be stupid enough to make a movie like this and have it actually be a suspenseful thriller. That's just crazy. Keep up the good work Paul Verhoeven, I look forward to other comedies coming out directed by you."
    },
    {
      "rating": "8",
      "text": "Loved this movie. I never seen a concept for a movie like this. I wouldn't hate being invisible at all. I can also see how it would be frustrating to not be able to become normal again too."
    }
  ],
  "recommendations": [
    "the_invisible_man",
    "the_rite",
    "savages",
    "cold_pursuit",
    "unhinged",
    "total_recall",
    "revenge",
    "falling_down",
    "the_machinist",
    "i_spit_on_your_grave_iii_vengeance_is_mine",
    "taken",
    "those_who_wish_me_dead",
    "knock_at_the_cabin",
    "twister",
    "ant_man_and_the_wasp_quantumania",
    "a_history_of_violence",
    "constantine",
    "wonder_woman",
    "the_king",
    "eden_lake",
    "iron_man",
    "split",
    "man_on_fire",
    "the_equalizer",
    "elle"
  ]
}