{
  "id": 1846,
  "title": "Home Sweet Home Alone",
  "starring": [
    "Ellie Kemper",
    "Rob Delaney"
  ],
  "runtime": 93,
  "genre": [
    "Comedy",
    "Crime",
    "Family"
  ],
  "description": "After being left at home by himself for the holidays, 10-year-old Max Mercer must work to defend his home from a married couple who tries to steal back a valuable heirloom.",
  "releaseYear": "2021",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fP3VvqUjEBjawxZHL4sYCq2ZdJD.jpg",
  "categories": {
    "plot": 3.0,
    "acting": 1.4,
    "ending": 1.3333333333333333,
    "soundtrack": 0.0,
    "cinematography": 5.0,
    "familyFriendly": 1.4210526315789473,
    "funny": 1.2222222222222223,
    "action": 0.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "They just need to stop doing this, please, it doesn't matter if it's a disney movie now, with a better production, set, and people, it's impossible, 4 movie repeating the same thing from the original, what could makes it good again?, the original Home Alone is perfect because it's not only the story is original but because they have Macaulay Culkin, Joe Pesci, Daniel Stern and all of the original cast, and so do Home Alone 2, once you change it, that's it, Home Sweet Home Alone is just the same like Home Alone 3, 4, and 5, all of them was terrible, it's awful, it's sucks, the only things that make me give a point to the film was the Home Alone theme, a scene with one of the original cast, and a few laughs, but still overall, Home Sweet Home Alone is a predicted disappointment."
    },
    {
      "rating": "0",
      "text": "A huge disappointment!  The movie was a huge waste of time. No redeemable quality. Everything seemed rushed. Nothing about felt like Christmas. I don't like the fact they used music from the original, yet they found fault with the original. John Williams should not have approved his music being used in this rubbish. The plot was lame.  Don't waste your time on this poor excuse so-called movie."
    },
    {
      "rating": "0",
      "text": "There  is a scene where the female robber diverts the police officer's  attention by implying that she will have intercourse with him.I am not kidding..."
    },
    {
      "rating": "0",
      "text": "I mean who ask for this uninspired carbon copy of 90's home alone one but done worst: bad acting, bad casting, just everything is simply awful. this is Disney milking whatever 20th century fox had from their library and milking it until theirs nothing left."
    },
    {
      "rating": "0",
      "text": "Абсолютно убогая и в целом ублюдская пародия на оригинал. Какой бездарности пришло в голову пилить ремейк на устаревшую во всех смыслах комедию, кто бы знал, но его нужно гнать ссаными тряпками."
    },
    {
      "rating": "3",
      "text": "Any viewer can completely with utmost ease make the argument that Macaulay Culkin's film, is already a pretty old flick.Come on, it just celebrated its thirtieth anniversary. But that film like many classics will always have that charm, especially a Christmas classic.So this ''update'' will perhaps have as its greatest merit to get some new generations to come to see the original film and that's fine by me.The kid has a lot of heart, but that's not enough to make this dreck work."
    },
    {
      "rating": "2",
      "text": "The stupidest thing I've seen this year, without a doubt cheap humor and mediocre performances that embarrass others, abound here..."
    },
    {
      "rating": "0",
      "text": "That was the worst waste of time in my life. Everything in this film is stupid or cringy, or insulting, or all together. Don't you ever watch it, especially if you saw original first two movies"
    },
    {
      "rating": "1",
      "text": "they took a holiday classic loved all around the world and turned it into a trashy hallmark movie, this has 'ace ventura jr' written all over it and it only took me watching the trailer alone to get that familiar shiver up my spine. no part of this movie has any of the feel of the previous movies, in fact it feels like a family project done from home. i wouldn't even say it's good for kids because even that feels patronising. just watch the originals, they're written way better"
    },
    {
      "rating": "0",
      "text": "It sucked miserably, not once did I laugh, the antics are over the top and just bad ideas for kids to try this crap at home!"
    },
    {
      "rating": "1",
      "text": "It was mildly entertaining but the kid in this movie is really not a very nice person and the couple is just trying to get back something he stole from them. You actually feel worse for them than you do for the kid."
    },
    {
      "rating": "1",
      "text": "the movie tries to recreate the first but very badly, so that the movie if or if it must have references to the first or if not the movie will go to waste,In the first film the child was brave towards risky things to protect himself from thieves, while in this garbage the child has it very easy to hit spouses grabbing things that no Aryan child,and the technological references uff shows that they are there to fit in with the altual society (there is even a decade that is very cringe), the film is bad that the film realizes (at least in the dubbing into Latin Spanish)the child cheats that eric carman from south park would do, it is not recommended to see it is better to see a day of bad memes than this"
    },
    {
      "rating": "0",
      "text": "This movie is insulted to the original Home Alone. The Lion King, RoboCop, Beauty and the Beast, A Nightmare on Elm Street, Child's Play, Rollerball and now this movie. Who the heck that Hollywood is going to making more unnecessary remakes/reboots everywhere?"
    },
    {
      "rating": "0",
      "text": "Another soulless product from the sequel/reboot/remake Disney factory. Disney is pure corporate and nothing else."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "0",
      "text": "Without respect we reject. This is an assault on the franchise which jumped the shark hard after Home Alone 2, which was decent, but Home Alone exists in a perfect pocket universe and needs to be respected. They could have done so many things (and even included an adult Macaulay Culkin) and respected the first movie and done so many creative things, but instead, they followed Home Alone 3,4,5 and now 6, all complete and total utter garbage. Hollyraype, PedoWood, Hollyweird is a disgraceful low-brow dirty abusive evil vile culture of woke trash these days and all they do is debase and degrade all modern western mythologies. Im sick of it and neither myself nor my large family will be giving any money to these vile scum in PedoWood - torrents only to see what I'm \"missing\" - not much. This movie has such a scumbag unlikeable kid in the center of it all and this is meant to drag a certain race and culture through the dirt."
    },
    {
      "rating": "0",
      "text": "The worst acting I've seen in a loooong time. The child actor should never star in a movie again."
    },
    {
      "rating": "6",
      "text": "You know what, It's not bad? Not as good as 1 and 2, nothing beats those 2 but it's mediocre at best. There are some cringe \"Modern\" terms but there are kinda few and far between. Many callbacks to the first movies with the house being protected by McCallister Home Protection and a police officer supposed to be Kevin McCallisters older brother as mentioned by the dialogue. Good to watch if you're bored of the older better Home Alone movies but its very mediocre movie overall."
    },
    {
      "rating": "10",
      "text": "People mostly complain about this 2021 Home Sweet being the weakest in the entire 1990-? Home Alone Franchise while in reality these movies as a whole ain't add nothin new whatsoever."
    },
    {
      "rating": "7",
      "text": "Not too shabby, definitely better than the last three. I think some of the callbacks were pretty forced though."
    },
    {
      "rating": "7",
      "text": "A fun Holiday movie that knows what it is and leans hard into it!Yes, they rehashed the same basic plot, but they added a few story twists that gave this move a bit more heart. To me, you watch this movie while gearing up to watch classic Holiday movies like the Santa Clause, The Grinch & Elf. It'll get you into the Holiday spirit. It is well cast and well done.Is it going to win awards, NO, is it an amazing movie, that is going to change the landscape of cinema, NO. But if that is what you are wanting, you're probably not watching a \"Home Alone\" movie. Take it for what it is and enjoy the ride it takes you on!"
    },
    {
      "rating": "1",
      "text": "God, why did they rape the classics? This movie just doesn't make sense. This is a cruel, illogical and low-grade film."
    },
    {
      "rating": "6",
      "text": "Ok film, definitely not classic quality like Home Alone and Home Alone Lost in New York.The kid is rather annoying, and apparently you can use your outdoor water in winter (I assume this was filmed on a set???) but I did enjoy the revamped classic \"mafia film\" from the first two films, and the overall motivations and friendship with the (ex-)criminals was great.I don't think I would re-watch this film again though, as it is not timeless like the first two."
    },
    {
      "rating": "4",
      "text": "The final 20 mins were good apart from that it was a worst experiecence, The Most jokes were fart ones it's worst, The Intenstional Irony dailogue of \"Remaking classics are worst\" justifies yet again , The premise with misunderstanding invasion was bad and the whole home traps were painfull it felt bad for the Couple since they were innocent, its a dumb movie, because of the runtime its watchable."
    },
    {
      "rating": "0",
      "text": "Worst ever I've ever watch! The kid is the real villain! Deserves a big fat ZERO!"
    },
    {
      "rating": "0",
      "text": "Couldnt get past 20 minutes. i tried but this movie is awful, garbage , **** , worst comedy movie"
    },
    {
      "rating": "0",
      "text": "If you want to learn how to create a remake while leaving out every single thing that made the original worth it, watch this. No interesting characters, no decent jokes and a bunch of bad guys that you need sympathy for because they are actually good guys. Why? They managed to make every single character in this movie extremely dull, while every \"joke\" just screams \"look at this, this is funny!\". It's not, none of the forced jokes are funny. This entire thing is an embarassment to the movie industry. Half of the final battle the burglars are fighting ramdom things like a wall and a swimming pool. No boobytraps involved. Then, the end is as anticlimactic as it can be."
    },
    {
      "rating": "3",
      "text": "You can see the effort that 'Home Sweet, Home Alone' tries to have and the great role of Archie Yates, But what seems like a sweet home, is an impossible place to live there"
    },
    {
      "rating": "5",
      "text": "Home sweet home aloneDefinitely doesn't hit home like the first two original movies with Macaulay Culkin, but the violence is sheer delightful even though we wish it wasn't happening to the conceived villains, because it's all purely a coincidence.Almost like they knew it wasn't going to be great, because a character clearly said in the movie that people shouldn't remake classics. I guess they thought they'd get extra points for the self-dig. The dialogue delivery sometimes felt like they were reading off a teleprompter. It's not unwatchable, but, If you do decide to see it, you'll definitely miss the original."
    },
    {
      "rating": "3",
      "text": "Surprisingly entertaining! Wasn’t expecting much but ended up having fun with the kids laughing throughout. Go in expecting cringe and you will be surprised."
    },
    {
      "rating": "2",
      "text": "I'm sorry but have Dan Mazer and crew seen the original Home Alone?? This film completely loses sight of what made that movie so special, replacing it all with stupid slapstick humour and a hollow core. One of the worst directed films I've seen in a while with an abysmal script and really poor performances. Cheaply made and factory produced, there was next to no effort made into making this. Easily the worst movie of the year thus far."
    },
    {
      "rating": "0",
      "text": "This movie is legitimately awful. I have no clue as to why they keep trying to make new Home Alone movies even though nobody wants them and everybody agrees that 1 and 2 are the best and the other ones are all terrible.The main kid in this movie is also just not likable at all, and the \"villains\" of this movie are the ones who have it bad. Instead of being comically evil villains, they're just a couple who are down on their luck and are trying to recover something stolen from them that they need to feed their family. It's not fun to watch them get sent on fire and stabbed by thumbtacks because they've done nothing wrong. They don't even want to do the robbery but they have to in order to feed their family. No idea what they were trying to do here. Instead of having the main kid be funny and likable and the villains be comically evil with hilarious things happening to them, you instead just get some **** rich kid beating the hell out of some down on their luck couple."
    },
    {
      "rating": "1",
      "text": "The biggest problem with the movie is the way it tries to take the trend of humanizing villains but doesn't realize that humanizing the robbers in a movie like this hurts the overall experience. Fact of the matter is the movie is about two people who are trying to steal their own property back after they think a kid stole it. The kid is trying to defend his house when he is left home alone. The problem is, when you have the two people begging for their lives at one point while the kid rains holy hell on them, you lose the ability to enjoy the slapstick comedy. For slapstick to work, the person has to be able to get back up from whatever level of pain being inflicted on them."
    }
  ]
}