{
  "id": 1153,
  "title": "Homefront",
  "starring": [
    "Jason Statham",
    "James Franco"
  ],
  "runtime": 100,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "Phil Broker is a former DEA agent who has gone through a crisis after his action against a biker gang went horribly wrong and it cost the life of his boss' son. He is recently widowed and is left with a 9-years-old daughter, Maddy. He decides to quit the turbulent and demanding life of thrill for Maddy's sake and retires to a small town. His daughter fights off a boy who was bullying her at school and this sets in motion a round of events that end in his direct confrontation with the local Meth drug lord. His past history with the biker gang also enters the arena, making matters more complex. But he has a mission in his mind to protect his daughter and he is ready to pay any cost that it demands.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/v55tfjL3QGeabkXAMXPb4olwjL0.jpg",
  "categories": {
    "plot": 6.411764705882353,
    "acting": 6.933333333333334,
    "ending": 7.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 6.086956521739131
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Jason Statham plays a DEA agent who leaves his job for a quiet country life with his daughter. It doesn't take long for an assortment of bullies (including James Franco) to menace him constantly. Sylvester Stallone adopted a novel and his simplistic style is all over the script: relentless threats for the upstanding good guy met with steely calm and hard knocks for the arrogant bad guys. Unfortunately, much of the action is cut too fast and blurry to tell what's happening, but Statham gets in a few good moves. Although it's competently made, nothing about the story or the direction is special."
    },
    {
      "rating": "6",
      "text": "There's really not much to say on this one. It's your standard Jason Statham action flick that's unsurprisingly no different from anything else he's done in the past. James Franco gives what is probably the most notable performance in the entire film. However, the supporting ladies Winona Ryder and Kate Bosworth both give weak and half-hearted performances. The story is rather predictable as well. Overall, from what I saw, it really makes me question if this would've been better had Sylvester Stallone not abandoned this back in the day. The only good thing I can really say was that it was somewhat entertaining while it lasted, but that's about it."
    },
    {
      "rating": "3",
      "text": "I suppose it's not surprising that Sylvester Stallone wrote the screenplay, since the plot is so ancient it might have been etches as hieroglyph on Rambo's machine gun. There's an appeal to simple action movie, but it's nowhere to be found on the uninspiring Homefront, and even the capable cast can't save it from mediocrity. Either it's from the poor casting or lackluster predictable content, audience will most likely have little to none enjoyment watching Jason Statham bludgeoning random thugs, again.\r Jason Statham plays Phil Broker, a former undercover cop who retires into the countryside after his testimony incarcerated a drug lord. Little did he know that his past, and untidy file saving, will haunt him and his daughter. The concept is to portray the antagonist as a man involuntarily dragged into fights as he defends a frail looking little girl. Statham has done this concept in last year movie Safe, and to approximately the same undistinguished effect. The movie doesn't offer anything novel; in fact Arnold Schwarzenegger's Commando back in '80s has more flair and arguably more personality.\r There are several big names here, but they are underutilized or badly cast. James Franco brings plenty credibility, and originally I thought he'd offer more challenge in acting department for Statham, however his role as Gator just doesn't work. He doesn't convey the menacing threat to Statham, and if the movie opted for more cerebral contest, it could've been better, but instead his actions just seem random and unorganized. It is far from clever scheme the backwater hoodlum runs, it more resembles panicked redneck rampage with money as incentive.\r Winona Ryder is looking messy and not in intentionally thought provoking or sympathetic way. Honestly, I didn't even recognize her at first, she's too hectic to give more impression than just Gator's confused lackey. Kate Bosworth goes full hillbilly crackhead, profanity firing in all cylinders. Another thing that's wrong with the movie; it spews curses constantly. There are many ways to make profanity works, peppering it as ham-fisted way to lure any reaction from audience is not one of them.\r Screenplay builds up inconsistently as it gives the illusion that something dramatic might happen soon, although it unfortunately turns into average brawl yet again. Music and sound effect try too hard to sell the dynamic, in which there's barely any, they function more as loud distractions if any. Perhaps the nicest thing in the movie is how the action is done. These scenes are pretty well done; they have rough impact and believably pain-inducing, although there is only modest amount of it.\r Homefront doesn't bring anything new. The cast is talented and action is passable, but for extremely abysmal plot which audience can find at cheap bargain or rerun at Cinemax, it’s hardly worth anyone's time."
    },
    {
      "rating": "2",
      "text": "Even the preview is not worth watching. James franco is overated as an actor. Action movies were better in the 90's. Newer ones are usually boring and predictable."
    },
    {
      "rating": "6",
      "text": "If you like seeing Jason Statham perform many feats of asskickery than this film is for you. The story isn't much and James Franco provides a rather menacing performance as the main antagonist."
    },
    {
      "rating": "8",
      "text": "A great cast all headed up by the always enjoyable Jason Statham in this action-thriller. I enjoyed the backwoods setting and the crazy redneck characters. They really give the film a darker, dirtier feel. The action is entertaining, and while the plot may feel old to some is still works. It can be slow at some parts for a while, but Statham and Franco managed to keep me invested while the tension built up. I found it to be a great action film, and one I recommend to any Statham fan. I give it an 8.6/10=Great."
    },
    {
      "rating": "6",
      "text": "This movie will probably be a forgettable entry in Statham's film legacy, but it gets the job done in terms of action and eye candy on screen. As for James Franco as a villain, it is hard to take him seriously."
    },
    {
      "rating": "4",
      "text": "Scripted by Sylvester Stallone and starring quite a nice trio of supporting performers, Kate Bosworth, James Franco and Wynona Ryder, Jason Statham's latest film HOMEFRONT has all the makings of a perfect B movie... swampy small town, secret meth cookers, local hostilities and brutality, all that fun stuff. But the film is so poorly directed by Gary Fleder that in every action scene you literally have no idea what is going on. The nicely choreographed fight scenes, which is the point of a Statham film, particularly suffer.\r As usual it makes no sense to have this cockney lad in the small town south but I could buy that since Statham has such charisma on screen and he's great with kids. He has a small daughter in this film, the wife is dead of course, and his scenes with the girl very sweet. But the rest is a big old mess.\r Sadly, the 3 supporting stars aren't given much to do and none of them takes the opp to chew the scenery and go for it. So what's left... not much and unlike most Statham films, the man never takes his shirt off or hops out of bed in his underwear. So what is the point?"
    },
    {
      "rating": "8",
      "text": "This is an underappreciated typical movie, because I found it to have an unusual amount of grounded emotions.  I just saw Lethal Weapon and that movie is terrible compared to this, but receives a much higher rating.  I'm not a big action movie person, but even here there is Statham taking down multiple people has some big explosions with chase scenes, but it's not Transporter 2, and some people don't like that.  James Franco particularly made an effortlessly deep character that makes a normal guy a great villain.  The acting wasn't bad for anyone, really--This is just a solid movie."
    },
    {
      "rating": "9",
      "text": "An awesome movie with a bit of good acting in parts (mostly from Statham), and some great action sequences. The plot carries a real sense of justice. Several actors didn't perform too well though, I'm afraid (cough cough James Franco)."
    },
    {
      "rating": "7",
      "text": "When you combine Action with Drama, you had better have a damn good story to go along with the tremendous fight scenes and wild chases, or else you get a film that falls flat. We all know that at this point, Jason Statham is the best Action star you could have, but the jury was out on how effect he could be in a more dramatic role. In Home Front, Statham plays a retired undercover D.E.A. agent, who has recently become a single father. He and his daughter have moved from the big city to the small town, which his late wife called home, in the hopes of building a better life. Everything was going as planned until his daughter, stood up to a bully at school, and embarrassed the son of one the towns most influential families. The simple misunderstanding between children quickly escalates into an all out war, which will force Statham to use everything he learned in the D.E.A. to protect his daughter and his new home. Once again, Jason Statham was terrific in this film. It is mind boggling and seems to be impossible, but every film this man does is better than the one before it. He is on a winning streak, the likes of which I have never seen. Statham was terrific, but oddly, he's paired with an actor who doesn't have much experience playing the bad guy and it showed. James Franco plays Gator Bodine, a small time hood and drug trafficker, who goes after Statham with everything he's got, the only problem is, Bodine really isn't that bad a guy. In fact, when Franco starts cursing and playing all tough, it's almost laughable, not to mention the fact that he doesn't have a tenth of the fighting skills that Statham has. Being that this was a big budget film, Written by Sylvester Stallone (Rocky),  Directed by Gary Fleder (Kiss The Girls, Runaway Jury), and starting the best action star in the game (Jason Statham), it's very peculiar that they would choose a bad guy, who is best known as a comedic actor. While the story was great, Franco simply can not match up with Statham at all. Homefront has almost everything you could want in a Thriller, but the lack of a strong, believable opponent, really calls into question just how believable the film is and makes it somewhat predictable."
    },
    {
      "rating": "7",
      "text": "I admire Jason Stathan. He is not made for the Oscars, Golden Globes or any awards but still he's unstoppable. He is the only kinda surviving and serving in cinema successfully. When it comes to the commercial cinemas anyone can easily pick this mans movies to watch any given day. It is guaranteed entertainment. I always wanted to praise him for his contribution to the commercial cinemas who made stabilize over the recent fast growing graphic-cum-commercials.\r The Story of this movie was not freshly squeezed. You can find similarities with other movies. Not the whole movie, part by part from different movies. After seeing the opening scene I thought it is better to call it a sequel to 'A History of Violence'. But the story started to take turns for every 20 minutes. It is a nicely arranged pieces and kept very simple as possible.\r I am glad that Sylvester Stallone Invested to make this movie with Jason Statham and James Franco. Looks like Statham and Stallone sharing a good friendship after working together for 'The Expedibles' movies. I still unable to recognise James Franco as a tough man, for me he's a chocolate hero. Undoubtedly he was awesome in this film, but I love to see him in a beautiful romantic movie near future.\r It was a decent movie, but the stunts were not good enough as we expect from Statham movie. According to the story, it was well achieved. More dramatised crime-thriller than an action. That can draw attention to a family audience, but drug scenes in the movie are what repels them away. Everything is not that strong, still it is rated R. Whatever they say it's a treat to watch if you are a Statham fan."
    },
    {
      "rating": "8",
      "text": "jason statham rock as always..film is above average..watchable action thriller..! story is bit old style....but film's postive is the star cast,stylish performances,and i like tat cute girl too..over all i give  8 out of 10"
    },
    {
      "rating": "8",
      "text": "Sylvester Stallone's screenplay of a Chuck Logan  film  adaptation is rising at it's own bad ass level. We know that Jason Statham likes to be on the \"action genre,\" he wouldn't even care  if the script is a mediocre or  it sucks! he wouldn't care he just loves the action. In \"Homefront\" a former agent moves to this town with his daughter, he doesn't know  what he is getting himself into! then he tangles with a meth dealer (James Franco), if there is one we love is how  director Gary Fleder makes Statham looks wild and crazy on the camera, with the camera. The film can be entertaining ah the daughter is annoying and there can be times when characters are just to dumb. Grade B"
    },
    {
      "rating": "8",
      "text": "The acting is pretty good and the action sequences are intense.Unfortunately for the movie he is predictable and there is not a lot of action.Plus,they try to make us think that there will be a big final fight between Jason and James but he just punch him a couple of times and it's over."
    },
    {
      "rating": "7",
      "text": "Jason Statham has managed to star in a slew of solid action films over the years. This is just as great as any. I like that this film gives off a family vibe which add a little bit more emotion to his character rather than making him an emotionless robot. I liked the thought of James Franco as the villain but he could've done better. Homefront is very much still worth watching."
    },
    {
      "rating": "7",
      "text": "As a thumb rule presence of Jason Statham immediately is indicative of a nice time, and this movie is no exception.\r The girl acted well too. Pretty descent movie, though somehow the showdown near the end underwhelmed a bit."
    },
    {
      "rating": "10",
      "text": "Amazing just like if  James Bond and Indiana Jones met like actually amazing"
    }
  ]
}