{"id": 1546, "title": "Home on the Range", "starring": ["Roseanne Barr", "Judi Dench"], "runtime": 76, "genre": ["Animation", "Family"], "description": "When a greedy outlaw schemes to take possession of the \"Patch Of Heaven\" dairy farm, three determined cows, a karate-kicking stallion and a colorful corral of critters join forces to save their home. The stakes are sky-high as this unlikely animal alliance risk their hides and match wits with a mysterious band of bad guys.", "releaseYear": "2004", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/9xIIo4FMquy5SRqn8hppyr2QadR.jpg", "categories": {"plot": 6.56, "acting": 6.0, "ending": 8.0, "soundtrack": 5.5, "cinematography": 5.0, "familyFriendly": 6.833333333333333, "funny": 4.5, "action": 7.333333333333333}, "reviews": [{"rating": "8", "text": "Very nice movie. Great music and animation. Lovely Songs but only the story is a little bit simple."}, {"rating": "8", "text": "Home on the Range is better than the critics say it is. It has a wacky story and climax but the animation and characters are full of life. There is a little bit of something special here."}, {"rating": "7", "text": "Home on the Range is a charming, innocent Disney movie with a zany feel to it and lots of fun. It may not be the best story, but it makes up for it in charisma."}, {"rating": "10", "text": "The best movie that Disney has ever made the most wholesome and fun movie anyone can enjoy kids or adults or teenagers I’m 19 and I just watched this movie and I loved it. It’s better than infinity war better than The Godfather better than iron man or avengers or the matrix this is in my top 5 movies of all time!"}, {"rating": "5", "text": "If I remembered \"Home on the Range\" correctly, the characters were funny but crazy has hell."}, {"rating": "3", "text": "It isn't very funny or entertaining or well animated. And it definitely in unoriginal. There really is no fun to this film at all. You may as well just walk out because it brings no message for kids. I give this film a 34% of a good movie."}, {"rating": "4", "text": "Home on the Range is not a bad movie. Little kids will watch it and enjoy it just fine but this film has nothing to offer anyone else outside of maybe or two decent laughs. The story is one that has been done a million times and the characters are not that interesting. I would be a bit less harsh if it wasn’t for the fact that this is a theatrical release and that it was made by Disney who put out some great films in the 90s and thankfully has gotten their groove back recently with such films as Frozen. This does not feel like a Disney movie it feels like a dumb kids movie released on DVD. I wouldn’t recommend watching this movie. Not because it is garbage but because this film has nothing to offer outside of giving 5 year olds something to watch."}, {"rating": "0", "text": "I think I was around 12 when this movie came and I was thinking that this looks rediculous and stupid. I was thankful that I didn't have to see it in theaters. But of course, my lil sis wanted to see it & wanted it for her 9th b-day. I was forced to watch this movie, after Iï»¿ saw it...I was right, I thought it was a terrible movie and my most hated film from the Disney animated films. I saw it once, and never saw it again. Everything in this movie was forgettable, and I'm happy about that b/c I don't want to remember watching this at all. Like I said, out of all of the Disney animated movies that has came and failed, this one was probably the worst out of all of them. The characters, songs, plot, animation, almost everything in the movie was forgettable. If you guys like it, that's fine. But trust me, there are many Disney animated movies that are so much better, you would forget that this movie existed."}, {"rating": "3", "text": "The quality produced in total from \"Home on the Range\" is probably Disney's worst in a while, as it does lack from originality and its simple, not any deep storyline. With its predictable parts it does lack much than anything, but its music and animation is nice so it doesn't deserve a zero or one. Well, at least Disney shaped up after \"Chicken Little.\""}, {"rating": "4", "text": "No es tan mala como la quieren hacer ver, la animación no tiene nada del otro mundo y por ese aspecto no pareciera que se trata de una película de muy alto presupuesto, en fin, pésima no es, pero si es mediocre y olvidable."}, {"rating": "4", "text": "Movies like these are not what Disney's known to do. Even though it's decently a movie for you to pass away the time, it's only safe to say that Home on the Range is going wild about the user score."}, {"rating": "5", "text": "Even with his script weak and with countless loose ends, the characters transmit their spirit and become the strong point of the film. And let's face it, there's no worse name than \"Alameda Slim.\" 5.8/10"}, {"rating": "5", "text": "the jokes weren't that funny and the plot wasn't good, but the animation was beautiful and the acting wasn't so bad. its not a terrible movie, but its just wasn't that good."}, {"rating": "9", "text": "Home on the Range knows what it wants to do and does it the best way imaginable. It's not a film from which you'd expect groundbreaking ideas or complicated plot twists. The film, intentionally wants to be a generic comedy retro classic animation set in wild west. And it does what it intends to do. It's fun, it has a good pace, it's classic, predictable and generic, and most importantly, its full of life! So if you're expecting something full of ideas like Wall-E, or something deep like Lilo & Stitch, you won't find it here. But if you're prepared to embrace the fun, silly, classic, wild west, you'll love this one!"}, {"rating": "5", "text": "\"Home on Range\" is another classic Disney just that from the drawings, but regular so boring plot, script and everything else , but at times gave us laughter, do not rule out anything that I have said of the Review."}, {"rating": "9", "text": "Uno de los mejores recuerdos de mi infancia, no entiendo la puntuación tan baja, a mi me encanto."}, {"rating": "10", "text": "Home on the Range,\" Disney's new animated feature, has the genial friendliness of a 1940s singing cowboy movie, and the plot could have been borrowed from Hopalong Cassidy or Roy Rogers, apart from the slight detail that they aren't cows. The new songs by Alan Mencken (\"The Little Mermaid,\" \"Beauty and the Beast\") are in the tradition of Western swing; I can easily imagine Gene Autry performing any of them, including the yodeling number, and wasn't too surprised to find out that the Sons of the Pioneers starred in a 1946 movie with the same name."}, {"rating": "7", "text": "Whatever the narrative shortcomings, these characters have the warmth of antique painted storybooks, unlike the eerie plastic simulation of Pixar characters."}, {"rating": "7", "text": "Whatever the narrative shortcomings, these characters have the warmth of antique painted storybooks, unlike the eerie plastic simulation of Pixar characters."}, {"rating": "7", "text": "Whatever the narrative shortcomings, these characters have the warmth of antique painted storybooks, unlike the eerie plastic simulation of Pixar characters."}, {"rating": "7", "text": "Whatever the narrative shortcomings, these characters have the warmth of antique painted storybooks, unlike the eerie plastic simulation of Pixar characters."}, {"rating": "7", "text": "Whatever the narrative shortcomings, these characters have the warmth of antique painted storybooks, unlike the eerie plastic simulation of Pixar characters."}, {"rating": "7", "text": "Whatever the narrative shortcomings, these characters have the warmth of antique painted storybooks, unlike the eerie plastic simulation of Pixar characters."}, {"rating": "0", "text": "Normally, a Disney movie is liked by most people and is watched and loved for generations. It is also remembered. However, this is by far the worst Disney movie. I never even knew this movie existed because it was so bad! Steer clear and bust a moove and watch a good Disney movies like Big Hero 6 and Inside Out."}, {"rating": "5", "text": "MehThis film isn’t bad, But it’s not very good due to it's very bland script."}, {"rating": "6", "text": "\"Home on the Range\" is not as bad a movie as much of the public says. But it is not unfair to consider it as one of the least relevant works ever done by Walt Disney Animation Studios, unlike what happens with \"The Emperor's New Groove\" and \"Treasure Planet\", which are considered underestimated."}, {"rating": "2", "text": "Easily one of Disney's worst movies. Annoying, dumb, and just not very engaging."}, {"rating": "7", "text": "Not the best Disney Movie, but it's pretty good! The OST varies a lot (which is a good thing), and Buck the horse is a nice comic relief throughout the story. Recommended!"}, {"rating": "3", "text": "Rushed with little to no character or story development with a boring soundtrack."}], "recommendations": ["meet_the_robinsons", "atlantis_the_lost_empire", "my_little_pony_the_movie", "zootopia", "rio_2", "rio", "rango", "wonder_park", "smurfs_the_lost_village", "the_lego_movie", "bolt", "ice_age_the_meltdown", "strange_magic", "ferdinand", "the_croods", "frozen_ii", "hotel_transylvania", "trolls", "free_birds", "sing_2", "shaun_the_sheep_movie", "uglydolls", "tmnt", "the_tale_of_despereaux", "the_call_of_the_wild"]}