{"id": 3514, "title": "Home Again", "starring": ["Reese Witherspoon", "Pico Alexander"], "runtime": 97, "genre": ["Comedy", "Drama", "Romance"], "description": "Life for a single mom in Los Angeles takes an unexpected turn when she allows three young guys to move in with her.", "releaseYear": "2017", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/pE4VHzhDZgvbx2QOllaXXPADiW1.jpg", "categories": {"plot": 6.875, "acting": 6.7272727272727275, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.0, "action": 5.0}, "reviews": [{"rating": "7", "text": "Welcome to the alternate dimension where everything is much the same as here, but life resembles something straight outta women's glamour magazines, or maybe Vapiano commercial.This is the wonderland where:* everybody and everything is basically nice and good-looking, and conflicts just go way or soon resolve in the nicest way possible;* recently separated jobless mother of two who has just reached middle-age and moved to the other side of the country can live in a really nice comfortable house which she doesn’t have to pay for;* she meets true love in the form of a guy 13 years her junior, who’s tall, strikingly good-looking, socially adept, creative, confident, kind, ambitious, loves her children, and also has two best friends who can be described much the same way;* people can and will trust each other, and create strong bonds instantly* everybody’s just so damn understanding all the time, even children are not bordering on awful like in real-life* and so on.All this goodness is based on the debuting writer-director Hallie Meyers-Shyer, and (more importantly) produced by her mother Nancy Meyers who’s also responsible for her fair share of chick crack, including „What Women Want“, „Something’s Gotta Give“, and „It’s Complicated“.The result will be near-insufferable to many, including the critics – Metacritic gives it 41/100, Rotten Tomatoes 33/100, both offer users' scores in lower 50s.But me, I quite enjoyed it – always had a soft spot for this kind of thing. The authors have created exactly what they were aiming for, and everything is put together very well.What's more important, the actors are enjoyable and feel surprisingly sincere considering the high cheesiness factor of the whole thing.The events and dialogue are not original in any way, of course, but the cast really makes it work, be it the screen veteran club (Reese Witherspoon, Candice Bergen, Michael Sheen, Lake Bell) or the trio of young and fresh hunksters (Nat Wolff, Pico Alexander, Jon Rudnitsky) that even Zoolander would envy for their impossibly good-looking-ness.Together they create an ultimate feel-good atmosphere – a cinematic comfort food that is probably meant for 50+ midder- and upper-class American ladies, but works for little girls of every age and sex, including myself.All the others, who will not „get it“, probably have a horrible time of living through all 97 minutes of this. Just remember: let yourself be transported to magic neverland where life really is like in magazines, and all will be fine.„Home Again“ is the movie equivalent of something canned milk: one craves it for irresistible one-two punch of sweetness which is always the same and way too sweet for many, but if you stomach this type of thing, it’s gonna be delicious.Reese Witherspoon probably realized that it’s cool to be serious and versatile actress and all, but despite the good looks she’s not actually getting any younger.So she found some time to make another chick flick, a mental successor for her \"Legally Blonde\" series, and grab younger demographic tightly by the **** until she can.I mean, what else is there for her in her forties and also coming decades – a string of boring old-lady roles? Bah. She wants to have some fun til she can, and you should too!"}, {"rating": "10", "text": "Home Again is nice, and entertaining, and funny! I can't wait for it to be new and cool. The movie is nice. Entertaining. Can't wait to watch it!!!!!!"}, {"rating": "7", "text": "This is a very sweet movie and the ladies I was with all emjoyed it.  Reese Witherspoon, Alice, is turning 40 and newly separated.  At a birthday celebration, she meets a much younger guy who falls for her.  (That can happen in real life, can't it?).  The next morning, everyone, including her mother, very nicely played by Candice Bergen, ends up at her house.  Mom is a famous actress and Alice's father is a famous director.  The younger guy is part of a trio of young men looking for a big break in Hollywood to get their movie made.  Before Alice knows what is happening, her mother has in ited the guys to move into Alice's casita.  Alice has concerns for her young daughters.  But they take to the guys instantly.  Alice tries on her relationship with the younger man, and everone gets along swimmingly for a while.  What I enjoyed about this movie is that it did not go over the top in any way.  The situation does not seem at all preposterous.  The two girls are sweet and not typical obnoxious movie kids.  Everything is tastefully done. There is no detour down Raunchy Road.  It is a lovely, sweet, fun and funny movie.  Definitely worth seeing."}, {"rating": "3", "text": "Home Again's tagline... ironically titled \"Starting over is not for beginners\" out of everything that could have been possible... suggests that it must take a huge miracle to begin starting over. The problem here is that if it would ever be possible, I sure wish everyone that worked on this film that also worked on previous films; this means you too, Reese Witherspoon; gets a head start to starting over their career from their roots. We could easily pretend this film wouldn't exist otherwise in the canonical plot."}, {"rating": "7", "text": "I'm sure she hates seeing this, but the apple doesn't fall far: Writer/director Hailey Meyers-Shyer is the daughter of Nancy Meyers (The Intern, What Women Want, It's Complicated) and their rom-com styles are similar. As usual, it's female centric with Reese Witherspoon turning on the charm, as a newly-separated mother of 2, who ends up with 3 twenty-something men living in her guest house (and 1 ending up in her bed). The inevitable complications arise when the husband (Michael Sheen) crashes this unique family arrangement. While it's infused with the expected sincere emotions and lighthearted interactions, the actual comedy is sparse. It's more about the characters and the entire cast creates likeable individuals. I’m sure Meyers-Shyer made her mamma proud, but this amiable movie is not taking the genre in any new directions."}, {"rating": "3", "text": "Meyers-Shyer makes a failed attempt at the romantic comedies features of Meyers (The Holiday, The Intern). Her film lacks from an intriguing plot, the definition of good characters or an interesting thread to keep the viewer throughout its duration. Witherspoon is the only actress who seems to have fun in the movie and to be honest leads this fiasco to something purely mediocre."}, {"rating": "10", "text": "Home Again is probably one of most funniest movies I've ever seen. Home Again is the modern day rom-com with a role switch (younger guy dating a 40 year old woman). If you love Reese Witherspoon's mmovies this has to be one of Reese's best performances yet."}, {"rating": "3", "text": "Boring throughout the runtime and forgettable when it ends, \"Home Again\" delivers only the most basic requirements of a rom-com."}, {"rating": "4", "text": "Even if someday we lose Nancy Meyers, we will have her daughter following all her guidelines.If that's good or bad, well, that's an entirely different thing."}, {"rating": "7", "text": "Midlife crisis, and to begin life afresh!We the viewers ask for something different, and here's the one. This was slightly different than the usual films. Only on the characters, but the story was pretty much the same like about jealousness. The story of a middle aged woman and to begin the life again. Alice a daughter of a famous filmmaker, is not all happy in her life after the marriage is at in the risk of collapse. Then suddenly all changes when three youngsters she meets at the club. What follows after is to enlighten her life, but not everything's going to be fine. It could be more trouble than the solution she's hoping for, especially for a long term in mind. So what are those issues and how it resolved were told in the remaining parts.From a new director. She wrote it as well. I've seen many women director's films in this year than any other. They are making revolution here. This is actually a decent film, but surely not a bad one as you have heard. Reese Witherspoon was awesome. She always good at such roles. So basically this film is for her to watch. But the three young actors too was not bad. The story was better, especially how it all ended. This is for the gown ups, above 25-30 years old people. Because of how everything revolved, only they can understand it better. And also for the open minded people, because it's about the modern moral thing like traditional sentiments in a relationship were removed to narrate this tale. So definitely a decent film to watch once in my opinion!7/10"}, {"rating": "7", "text": "My wife loves this movie. It's basically a good movie, but I have one critique. The second sentence below has a Flesch-Kincaid grade level score of 18.7, which is remarkable for a 5th grade student.1. What began as a day like any other ended as anything but.2. There must have been something pretty extraordinary in the air that day, even though, as always, it was 72 degrees and sunny in my new hometown, the weirdly wonderful city of Los Angeles, which, as it turns out, isn't much of a city at all.Two additional observations point to production errors near the end of the movie. First, Harry sits down at the play next to Teddy. A short while later someone else (Harry's stand-in?) is sitting there. Secondly, after Isabel's play, Austen calls Rosie a theater detective, but before the word detective is said, she is already beginning to hold up a pretend spy glass. Rosie's \"error\" was insignificant, especially for very young child actress, but the scene should have been shot again."}, {"rating": "8", "text": "It struck me while reading the negative comments to this movie that movie critics don't treat films the same way book critics treat books. For instance, a beach book is never critiqued the same way you would a Nobel-Prize winning's latest work. Why doesn't the same apply to movies? Why do most stuck-up, arrogant critics have to compare everything to the pantheon of Criterion Films and AFC classics? Isn't that counterintuitive? In a single night I watched both this film and the Florian Zeller film The Father (2020) starring Anthony Hopkins. These are two different kinds of films. I enjoyed them both for different reasons. And let me say this, after watching a tragic, lovely but difficult film about a person slipping away into senility, Home Again is a nice remedy, a counterweight to the more difficult film and at the same time, to the current crap in this world. Home Again is a love letter to the 'idea' and idealized version of Hollywood (the reality is far more sinister, I am sure) and a story about a newly-separated woman who happens to be the daughter of a deceased auteur filmmaker and nice-twist, allows three aspiring young filmmakers to occupy her L.A. guesthouse has a good vibe to it. Yes, these actors have appeared in other stellar roles in other blah blah blah award-winning fare but, as the old Shel Silverstein song goes, after you've been having steak for a long time, beans, beans taste fine. This movie is cinematic jelly beans, and there is a time and place for candy. Don't tell the critics that, they would rather we spend our time watching depressing, pessimistic drivel with politically correct messages. They don't live in the real world. And this movie, made my daughter of Nancy Meyers (The Holiday, It's Complicated, Something's Gotta Give, What Women Want) delivers a nice little tale. You go to the beach with a beach book, right? Most people don't read Dostoevsky while sipping margaritas (those kinds of people would be cool to meet, come to think of it...) And here, hey, you want a pizza night movie, this works. I'd rather watch something like this and smile at the end, as opposed to a rave review film that would have me reaching for Prozac. The characters in Home Again are easy going, fun, kind (most of them) and there are a few lessons learned along the way - Alice (Witherspoon) gets her priorities sorted, the filmmaker trio mature as friends. What's the problem here? My only criticism is that the story could have tied in the importance/presence of the filmmaker father more. We are introduced to him in the beginning and there are a few nods to him along the way, but it would have been more interesting to learn how his influence shaped his daughter's life, the decisions she made. That sort of thing. My only critique here, but that doesn't stop me from enjoying this movie."}, {"rating": "5", "text": "This movie gave me more questions than answering............................"}], "recommendations": ["13_going_on_30", "endless_love", "young_adult", "eat_pray_love", "something_borrowed", "the_perks_of_being_a_wallflower", "the_intern", "monte_carlo", "the_age_of_adaline", "afternoon_delight", "moonrise_kingdom", "flipped", "captain_fantastic", "me_before_you", "the_spectacular_now", "about_time", "don_jon", "the_princess_diaries", "lady_bird", "paper_towns", "about_a_boy", "wonder", "book_club", "crazy_rich_asians", "we_bought_a_zoo"]}