{
  "id": 137,
  "title": "Honest Thief",
  "starring": [
    "Liam Neeson",
    "Kate Walsh"
  ],
  "runtime": 99,
  "genre": [
    "Thriller",
    "Action",
    "Crime",
    "Drama"
  ],
  "description": "A bank robber tries to turn himself in because he's falling in love and wants to live an honest life...but when he realizes the Feds are more corrupt than him, he must fight back to clear his name.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zeD4PabP6099gpE0STWJrJrCBCs.jpg",
  "categories": {
    "plot": 4.533333333333333,
    "acting": 3.7,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.166666666666667,
    "funny": 5.0,
    "action": 5.105263157894737
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Liam Neeson continues his spate of action heroes, but this one is much more subdued. He plays a man who’s robbed 12 banks and decides to come clean when he strikes up chemistry with a special woman (Kate Walsh). His deal with the FBI turns sours pretty quickly, as he faces the inevitable scramble to clear his name. Even though it tries to display some warm emotions, the plot points are pretty standard and the dialogue is pedestrian and repetitive. Even so, it unfolds with a modicum of mild action and is never boring."
    },
    {
      "rating": "6",
      "text": "A little slower and sloppier than other late-career Neeson vehicles.  His charisma goes a long way to healing the hiccups.  Worth the ticket."
    },
    {
      "rating": "7",
      "text": "Didn't really want to see this film. Got a sense from critics and the low score on this site that it was not so good. However, when we learned that the government was closing movie theaters in our state again, we went to this movie just to see SOMETHING in the theater before they closed. Was pleasantly surprised. Every character (even the bad ones) were likable and relatable. Good FBI agent was very cool. Was stressful in the fun sense of riding an amusement park ride - you know everything is going to be ok, but you enjoy the built-in thrills. Decent love story written in. Overall enjoyable!"
    },
    {
      "rating": "6",
      "text": "It was ok. I just felt the action didn't have much to it and the plot was kind of very predictable, that's why I am rating it at 6 not higher."
    },
    {
      "rating": "7",
      "text": "Liam Neeson does it again! Another solid action movie with a good plot and characters. The story starts a bit rough at the beginning, but the movie delivers in the end. Definitely give it a go!"
    },
    {
      "rating": "4",
      "text": "Honestly, I am a sucker for Liam Neeson action flicks. Yeah, they are dumb or over the top but at least it is entertaining with its ridiculous action set pieces. Honest Thief is the next in the list of Liam Neeson's action movie résumé. The premise is \"Hoping to cut a deal, a professional bank robber agrees to return all the money he stole in exchange for a reduced sentence. But when two FBI agents set him up for murder, he must now go on the run to clear his name and bring them to justice\". Does this movie hit the mark or did it steal my time that I won't get back?Firstly, Liam Neeson is still great to watch with his gravelly voice and the fact that despite his age he is still throwing convincing punches. Tom Dolan (Liam Neeson) is the centre of this movie and for the most part, is a decent character to watch. Annie Wilkins (Kate Walsh) who is Tom's love interest and the girl that makes him give up robbing banks is okay as well. The moments between the two are quite sweet to watch and there is some chemistry there that we the audience can invest in. The premise is also mildly interesting despite being kind of cliche. It's another action movie where someone is framed for something they didn't do and they have to prove themselves. Ironically, Liam Neeson has done movies like this already such as \"Non-stop\" and \"The Commuter\". However, there are some bits and pieces in there that could make the movie interesting such as him being framed by corrupt cops and that he Tom isn't a badass murderer. The first half of the movie is also pretty enjoyable because it spends time on its characters. It develops the backstory of the characters, their relationships and individual quirks. The movie doesn't just develop the main leads but also the veteran cops and the corrupt cops as well. It is quite refreshing to see. There is also this running gag with wisecracking veteran agent Meyers (Jeffrey Donovan) and the adorable scruffy dog he inherited from his recent divorce. It's a shame the second half decides to abandon all of the interest in the characters. The movie becomes a more generic action movie with boring car chases, not spectacular fistfights and some mediocre shoot outs. What could have been complicated characters, become just generic and one-note characters. An example is one of the corrupt cops Nivens (Jai Courtney) who makes a good point about taking the money that the audience might agree with but then becomes generic evil greedy dude.  The movie is just incredibly predictable and all the suspenseful moments such as the shady dealings aren't as impactful as it should be. I would have probably liked the movie more if the action scenes were at least visually pleasing to watch but it isn't. Additionally, there some are weird choices made by characters that are just really silly and can take you out of the movie. For example, a character has been shot repeatedly which the main character Tom saw. Instead of checking if he is still okay or calling a hospital he instead decides to do a phone call first right next to a dying or dead person. It's a weird director decision and it just makes the character seem weird. Overall, the movie is just very mediocre. There is something interesting buried within this movie with characters dealing with guilt and personal responsibility but they are unfortunately not explored. Furthermore, the action scenes are boring and not that exciting. This is what makes the movie disappointing as the pieces for a stronger movie are there but not utilised. If you like Liam Neeson then there is worth watching it for him alone but you want a fun action movie then this isn't it."
    },
    {
      "rating": "6",
      "text": "Neeson ownes the screen like usual, but every other aspect just seems like old hat at this point."
    },
    {
      "rating": "10",
      "text": "Don’t pay the critics any mind.  Just walked out of theater ten minutes ago.  This was a very good film.  I thoroughly enjoyed it.  Had a little bit of everything.  Good guys, bad guys, action scenes, pretty girl..."
    },
    {
      "rating": "5",
      "text": "Perfectly harmless, which is part of the problem. You’ve seen something like this done before, and done better. If you want a great Neeson cat-and-mouse thriller, check out RUN ALL NIGHT"
    },
    {
      "rating": "5",
      "text": "In this action flick, Liam Neeson stars as a seasoned bank robber, who, after meeting and falling in love with a woman, decides to turn himself in and surrender the millions of dollars he's stolen over the years, with the hopes of receiving a reduced prison sentence so that he can be released earlier and happily spend the rest of his days with her. However, things unfortunately don't go so smoothly, as he's set up and framed for murder by two corrupt and greedy FBI agents hoping to keep the money for themselves, and he finds himself on the run as he sets out to prove his innocence. At this point, most of us know by now that Neeson's no stranger to these types of action flicks ever since 'Taken' redefined him as an action star over a decade ago. And while you could make the argument that most of his films are pretty formulaic and predictable (which, spoiler alert, this film is no exception to), there's no denying that there's something so satisfying and fun about seeing him take names and kick ass. That being said however, it really does appear as though the usual formula of his films may truly be wearing thin, and I have to straight up say that this is one of his weakest films yet for various reasons. For starters, the whole thing is just so predictable. Plot points and even certain lines and moments I could see coming from a mile away. A lot of the dialogue I found to be ridiculous and laughable as well. Furthermore, the film's action surprisingly takes a while to kick in, with quite a bit of dragging with the setup in the first act. Unfortunately, the dragging continues throughout much of the film, with only a few truly memorable action moments, but even those are relatively short. To cap it all off, the film's end feels overly sappy and is seemingly tied up in a nice and satisfying little bow, which just didn't quite sit right with me. Overall, Neeson's still plenty entertaining to watch, but I fear as though his action star days are starting to overstay their welcome at this point."
    },
    {
      "rating": "10",
      "text": "ggggggggggggggggggggggggggggooooooooooooooooooooooooooooddddddddddddddfffffff"
    },
    {
      "rating": "2",
      "text": "Neeson has become a conveyer belt that pushes out this \"All American\" garbage. He's literally the same character in all of these films This was fine 10 years ago in Taken but has run it's course in staleness by now. Speaking of Taken, literally half of the dialogue here has been directly copied and pasted to this film including fan favorites like \"I'm coming for you\". The worst offender might just be Neeson's acting chops, or lack thereof. He's never been a strong actor but with a good enough script, can be passed along in some good films. This isn't that film.  A fast food blink and you'll miss it backstory don't offer much motivation and a plot with more holes than Swiss cheese doesn't help matters.  Theatres are simply way to expensive to waste moviegoers time with films this awful."
    },
    {
      "rating": "2",
      "text": "A tired rehash of this theme, an Honest Thief is so predictable as to lose it entertainment value. While the movie relies on its stars to fill roles in a way familiar to all from their other past roles, there is little creativity in the way the stars are used. Honest Thief not the worst of its genre, And might be okay as a value proposition for a streaming platform inclusion. But I was disappointed in Honest Thief as an experience for my return to a theater experience. But at least the popcorn was good."
    },
    {
      "rating": "0",
      "text": "Utter nonsense. The plot has more holes than Swiss cheese. Nothing is believable. Improbable motives aside, no one's actions make any sense. The dialogue is cringeworthy most of the time and despite star turns by Neeson and Walsh, who are a few decades apart in age, they are not convincing in their great love for each other. 98 minutes that I won't get back. I'd avoid this at all cost."
    },
    {
      "rating": "7",
      "text": "Maybe some folks didn't like this picture but I thought it was a helluva lot better than some of the other train wrecks that the motion picture industry has been throwing at us over these past couple of years or so! It fell a little flat in a couple of spots and it's not the greatest film ever made, but I rather enjoyed it nonetheless - it kept me interested for the most part."
    },
    {
      "rating": "3",
      "text": "This Movie Was a disaster for Liam Neeson,Predictable Script,Weak Romance and.........."
    },
    {
      "rating": "4",
      "text": "قصة الفلم تدور عن سارق بنوك يقرر أن يسلم نفسه لمكتب التحقيق الفدرالي مقابل شروطه الشخصية ولكن أثنين من عملاء المكتب الفدرالي يستغلون هذا الشي لمصلحتهم الشخصية ومن هذي النقطة تبتدئ أحداث الفلم. سبب قيام السارق لتسليم نفسه هو بحد ذاته رسالة جدا مهمة للمشاهد تستوضح لك أهمية بعض الأمور بالحياة ومنها الحب على أهمية المال. الممثل الرئيسي (Laim Neeson) كان تمثيله كالعادة في محلة وأتقن دوره ولكن الفلم كان يفتقر لشي أساسي الا وهي القصة بالإضافة إلى أمور اخرى تميزه عن الأفلام الثانية والمشابهة له نوعا ما. أغلب الأدوار الأخرى كانت بلا معنى والممثلين كانوا يفتقرون للحياة والعواطف وللكثير من الأمور وكأنهم مبرمجين على قراءة نصوصهم. كلب العميل بحد ذاته علامة استفهام!Visit My Instagram @Vanished_Critic"
    },
    {
      "rating": "6",
      "text": "Honest Thief is a Liam Neeson movie that probably wouldn't go anywhere if he wasn't starring in it. His lead makes it worthwhile. With that said, you'll like it if you go into it bored and are looking to be entertained."
    }
  ]
}