{"id": 2059, "title": "Hook", "starring": ["Dustin Hoffman", "Robin Williams"], "runtime": 142, "genre": ["Adventure", "Fantasy", "Comedy", "Family"], "description": "The boy who wasn't supposed grow up—Peter Pan—does just that, becoming a soulless corporate lawyer whose workaholism could cost him his wife and kids. During his trip to see Granny Wendy in London, the vengeful Capt. Hook kidnaps Peter's kids and forces Peter to return to Neverland.", "releaseYear": "1991", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/a6rB1lGXoGms7gWxRfJneQmAjNV.jpg", "categories": {"plot": 5.705882352941177, "acting": 5.5, "ending": 6.5, "soundtrack": 7.0, "cinematography": 6.0, "familyFriendly": 7.777777777777778, "funny": 6.0, "action": 7.5}, "reviews": [{"rating": "9", "text": "Great film, just watched it again today for the hundredth time it seems.\rRobin Williams great as Peter Pan regaining his form after he \"grows up\".\rMessage from the film still applicable today: Be there for your young ones, at all times, especially when they are young. Someday we all grow up, although all to fast it seems. This movie allows you to think like a kid again, when things were simple.\rMusic is better than I remember, very upbeat and great accompaniment to action and mood.\rIn summary, great for kids and young-at-heart. I still watch this movie every year at least once. Buy it on DVD or Blu-Ray to continue the happy thoughts."}, {"rating": "7", "text": "Looking back on Robin Williams career it sure isn't his best film. It's a film that's made for little kids and as an 18 year old one you could say well the entire film is childish, but looking the film like you are 8 years old again gives you the feeling like what happened to me when i was still playing outside. The acting isn't perfect the entire set isn't perfect and it has certain musical feeling to it, although the music is fantastic by John Williams \"as always\". It gives you this warm feeling of being a little child again and makes you want to believe all the fantasy stories again. Certainly it could have been better, but it could also have been worse. I enjoyed it when i was a little kid and i enjoy even now as a more grown up person and knowing that Robin Williams isn't with us anymore, this sure is a film that will give us great memories about him."}, {"rating": "6", "text": "This is probably Spielberg's weakest big-budget film since Empire of the Sun.  However I thought it was a lot of fun.  It features Robin Williams in top-form and the production design is great."}, {"rating": "4", "text": "I'm a big fan of Robin Williams so I purchased this without hesitation.\r This follows on from JM Barries book, and shows us what Peter would be like if he had grown up.\r Williams is the star of the show, as are Dustin Hoffman (cast perfectly as Hook), and Bob Hoskins (again perfect casting).\r Would recommend this to any Peter Pan, great family film too."}, {"rating": "9", "text": "I may be one of the rare few here but i believe this movie was beautiful when i was a kid and when i grew up. even watching it now it still represents the child in us all and relates to us. The movie shows how making your job more important than family can cause a great deal of resentment in your family, during the movie you see the transition from robins being a hard tense father who prioritises his work life over family,to him slowly understanding how much he has neglected his children and slowly but surely tries bonding with them and tries showing that in his effort to try rescue them and prove he can be a great father.this appeals to the Peter Pan fans as well and in my personal opinion apart from the Peter Pan by disney this is by far the most best on there is as it shows what happens when Peter finally decides to stop growing up and how things would have been if he decided to become a adult. Movie filled with beauty and wonder, i honestly hope people watch this movie and really try understanding the magic behind it."}, {"rating": "10", "text": "This is a beautiful piece of escapism with incredible elaborate sets. It's magical and imaginative it just completely transports you. Sex offender Hoffman is great as Captain Hook and big kid Robin Williams is so perfectly cast it hurts. One of my favourite kids films of all time and it has an incredibly powerful message behind it. Stop being such a shallow, money grabbing ba!tard and spend some time with your kids before it's too late. When my dad watched it he threw his phone out of the window and took me to fly a kite. Just kidding, he was too busy playing golf to watch a film with me"}, {"rating": "6", "text": "Hook is intriguing. There is something off about this story, which I don’t know. Maybe its seeing Robin Williams as Pan. Maybe the story is a little too cheesy and cutsey. Regardless this is a film that gets more right then wrong. There is an interesting albeit mixed message about the value of youth and not being afraid to grow up. Even when that fails to hold through the film is a pleasure to look at from stunning backgrounds to great cinematography to fun fight scenes. I can understand why critics may have disliked it as it is strange but I can also see how this film has a cult following. I’m in the middle on this film; but I like it more than I dislike it. This feels a bit more like fanficiton than an actual Peter Pan story but at least its engaging."}, {"rating": "6", "text": "Certainly one of Spielberg's lesser efforts, Hook still has good acting and some interesting visuals."}, {"rating": "7", "text": "It's got its problems, such as it's fairly cheesy, has some massive tonal shifts, Julia Roberts' Tink is wasted and has a really pointless arc, the effects and some of the sets haven't aged well, and some parts don't make sense( such as the Wizard of Oz-ish ending with a Smee duplicate in England and the stuffed Croc killing Hook). But for the most part the good outweighs the bad making it a fun and emotional ride. Robin Williams and Dustin Hoffman are fantastic, most of the story is very intriguing, and you can tell a lot of thought went into it. Hook is Spielberg simultaneously at his best and worst."}, {"rating": "3", "text": "This is not good. Granted I like it as kid, but as an adult it doesn't age well. It's stupid and annoying. This could have best Peter Pan film, but atlas, it's pretty weak."}, {"rating": "6", "text": "The movie has some strong and beautiful scenes, but also there are some simple and stupid scenes. The story is also interesting, but nothing exceptional.Dustin Hoffman as Hook shows a very good performance."}, {"rating": "6", "text": "I am divided. Part of me sees this as 10/10 and another part says it is not that good and I have been tricked into believing this. Strangely both parts seem to be accurate. The strengths are of cause the great cast with an amazing Robin Williams and great Dustin Hoffman atop on a general good performance, the creativity, sets and costumes. On the negative side the story is a bit cliche and foreseeable but it is well hidden behind the surface. Even legendary director Steven Spielberg said in an interview he had not that much confidence in the script and tried to hide his doubt and insecurities. If you look carefully you can see this a bit. I don't think with a title “Hook” you need to avoid spoilers as nearly anyone will know this can only be about Peter Pan. This movie however takes some risks. It is not retelling the story but continues the story with a Peter Pan that became an adult and even forgot he was Peter Pan. He is surprised when his two children were kidnapped by an unfamiliar man named captain Hook who challenges him. This is the start of the adventure. While it is a great popcorn movie and works fine for me I have problems with a Peter Pan that became an adult. However the actors deliver such an interesting and good performance that I forget this for the most part. Also the ending is as bittersweet as heartwarming. Because of all of this I am still unsure how to rate this movie. Sometimes as underappreciated masterpiece and at other times as average. The actors do a great job. Robin Williams is amazing as Peter Pan aka Peter Banning. He fully convinces me and is so fun to watch. Then there is the equal good Dustin Hoffman as captain Hook. Those two are so good that their performance alone is worth to watch the movie. The rest of the cast is also good. I truly enjoyed Bob Hoskins as Smee, Julia Roberts as Tinkerbell, Dante Basco as Rufio and all the other lost boys. In this regard I consider this a great movie with an awesome cast / performance. The visuals and effects are another strength of the movie. The world building is always immersive and never feels out of place. If I remember correctly there was even a toy line for this. Overall it is like I said at the beginning. I can justify a 5-10/10 to myself. In my youth I would have given an easy 10/10 but now I go with a 6/10 but say it is a truly good movie with some flaws that can be minor or mayor depending on preferences. Hope this makes sense for you."}, {"rating": "5", "text": "People still watch this movie on television? Maybe it's time to stop doing so because Hook is by far another overrated movie for television that fell right to the same sinkhole the Goonies fell to."}, {"rating": "7", "text": "Once Robin Williams' Peter Pan arrives in Neverland, we don't see anything that we haven't seen before in countless other family films and Saturday morning cartoons. That's not to say that Spielberg mishandles the adventure. If you can look past the movie Spielberg didn't make, you'll find that what he has done is pretty entertaining."}, {"rating": "9", "text": "Really UnderratedHook is a very good Peter Pan story with great performances from Robin Williams and Dustin Hoffman."}, {"rating": "3", "text": "Disappointment Flying Across The Screen.HookSpielberg's eye on the Disney's beloved character fails to live up to the hype on any whatsoever level. Personally, this magical aviated world has always been physically distant with me, due to its various stages it leaps on. From one tone to another, the tale never seem to have a balance or command over its own language, no matter how much synced the theme may be, there is too little to work on such big hokum. Overstuffed from stereotypical characters to cliched subplots, Spielberg's marathon euphoria wears off too quick to reach the first rest station.And it is not that Spielberg is not in his A game, in fact if anything that convinces you to stay tuned to this blunder other than Williams, is his tactics to glorify tiny aspects of the film. Like, making the production easier, by projecting Roberts's character to be in a doll house in order to make things easier and process faster. Such efficient and impressive tactics are what the entire musical acts are brimmed with, if not contains that anticipated masterful choreography. Aforementioned, Williams's hopeful eyes behind the glasses, pursues you to watch his non-animated Peter Pan take, that is adorable as far as he is playing it.On the opposite side, Hoffman as the antagonist, is on mark but there is very little to offer on terms of originality, fixated on cheesy humor and lazy sidekicks, it is a big chunk of disappointment. Roberts, Smith and Goodall in their supporting role are too unfortunately a plastered face written for a distraction and manipulating emotions out from the audience. Williams feels vulnerable and hand tied since he is not given any usual gags of his to charm his way out of the dull plot. Hook is the only thing that is to be hooked in this questionable project of Spielberg."}, {"rating": "6", "text": "Everyone knows the story of Peter Pan, the boy who never wanted to grow up and lived in Neverland, with the Lost Boys, fighting a pirate. In this Steven Spielberg movie, Pan moved to our world, grew up and forgot life in Neverland. However, when Captain Hook returns and kidnaps his children, Pan is forced to confront his past. Written in this way, the script summary seems even more appealing than the movie lets it show. The film is much warm and slower than I expected, and the simple fact that Pan has changed so much may displease those who expected a story closer to the original. Despite this, Robin Williams is convincing in the role of Pan and makes the character an element of humor, with his initial inability to remember the past and adapt to Neverland. However, he is much more restrained than in other more famous films. Julia Roberts plays Tinkerbell on a regular basis, but I did not feel much interest in the character, perhaps because of the way it was developed. Dustin Hoffmann shone on the role of the pirate villain, I loved seeing the way he played the character. Let it be said that the costume not only stayed exactly as I had imagined it but it was even more interesting, with all the exquisite details recalling the baroque aristocrats. Always around him, Bob Hoskins in the role of Smee, Hook's doormat, in an absolutely hilarious performance from an actor that I do not remember seeing much in comic characters. What I hated most about this film was the way the Lost Boys ended up portrayed, as if they were nothing more than bullies. A word still for the film's extraordinary settings, particularly for the pirate ship, which is literally the copy of what we can see in the animated film \"Peter Pan\" of the fifties, if I remember right."}, {"rating": "9", "text": "Simply put, it’s the best live action of Peter Pan. It takes risks and is creative. Only draw back is the dorky scenes or clunky editing"}, {"rating": "7", "text": "F the bad things the critic say about the movie. This is 100% one of the better Peter Pan films. In the Top 10 of best Robin Williams films of all time. This movie makes you wish that Neverland was real."}, {"rating": "10", "text": "Fabulous movie! A wonderful reimagining of the classic tale. Peter has grown up and his children are kidnapped and taken to Neverland. There he must reunite with the lost bots amd Tinkerbell but... He doesn't remember who they are!Also, RU-FI-OH!!"}, {"rating": "10", "text": "There will never be a better Peter Pan movie ever. This movie is so old but every time I watch it, I love it."}, {"rating": "5", "text": "Beautiful from original script to acting and that perfect john williams score"}, {"rating": "8", "text": "Yes, Spielberg's Hook isn't perfect, even i was not a big fan of the beginning of the film, but when Peter goes to the Neverland, everything is getting better, better, and better, added with John Williams amazing score and Robin Williams great performance, Hook isn't perfect but it's very enjoyable."}, {"rating": "8", "text": "I was pleasantly taken aback by this film. It becomes this balancing act between being dramatic and serious to being fantastical, silly, and even funny. It demonstrates the harshness of adult responsibilities, but also the innocent imagination that exists in the young. Both Robin Williams and Dustin Hoffman delightfully play the hero and villain respectfully with hammy joy. Some will take issue with the third act's plotholes and that is understandable, but I'd argue that they serve to strengthen the fairy tale aspects of the film because in the end, it IS a fairy tale where both perfection and reality are disposed of."}, {"rating": "7", "text": "----------------------------------7.0/10-----------------------------------"}], "recommendations": ["christopher_robin", "good_will_hunting", "true_grit", "eddie_the_eagle", "the_flintstones", "ghostbusters", "paddington_2", "catch_me_if_you_can", "the_terminal", "spider_man_homecoming", "cinderella_man", "the_kid_who_would_be_king", "man_of_steel", "a_beautiful_day_in_the_neighborhood", "peter_pan", "the_amazing_spider_man", "the_king_of_staten_island", "cruella", "edward_scissorhands", "thor", "rush", "oz_the_great_and_powerful", "legend", "the_royal_tenenbaums", "pan"]}