{"id": 1854, "title": "Horrible Bosses 2", "starring": ["Jason Bateman", "Jason Sudeikis"], "runtime": 108, "genre": ["Comedy"], "description": "Dale, Kurt and Nick decide to start their own business but things don't go as planned because of a slick investor, prompting the trio to pull off a harebrained and misguided kidnapping scheme.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/boBOkwIqgrs8noxBUSDkkicKa4K.jpg", "categories": {"plot": 6.128205128205129, "acting": 6.107142857142857, "ending": 5.333333333333333, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.575757575757576, "action": 7.0}, "reviews": [{"rating": "8", "text": "Day, Sudekis, and Bateman are still a great team. While it takes on a more absurd and crazier tone with the comedy the attention to detail in the actual plot is admirable. The crime (which are characters expectedly goof up at every turn) is written believably and smartly. It makes it look like our characters could pull it off smoothly should they stop tripping over themselves. However if they did that then this wouldn't be a comedy.\r It's a hilarious sequel that manages to avoid the traps many comedies series fall into. If you liked the first then you should check this one out. It's great to see the characters back again with more hilarious material.\r I give \"Horrible Bosses 2\" and 8.5/10."}, {"rating": "8", "text": "A much improved and underrated sequel. The cast works perfectly together, Plenty of hilarious jokes through out as well, and overall it's a surprisingly well done comedy sequel. And that's a rare very thing to see now-a-days."}, {"rating": "9", "text": "What is wrong with me? The critics say this movie sucks, yet I laughed out loud more than any movie I've seen in a very long time.\r Not only are the three main stars great, but when Jennifer Aniston, Jamie Foxx, or Kevin Spacey show up on the screen you know it's just going to get funnier.\r If you listen to the critics you won't see this movie. Fun, funny and entertaining is a very bad combination."}, {"rating": "8", "text": "Horrible Bosses 2 was a good sequel. It was about as good as the first. The previews did not spoil the movie. The pacing was good for a two hour long movie. The addition of Chris Pine and Christopher Waltz was good too. If you liked the first one, you should see this one."}, {"rating": "6", "text": "It is about as respectful and rational as a hooker on amphetamines, but \"Horrible Bosses 2\" is also absurdly entertaining and ashamedly hilarious to boot."}, {"rating": "3", "text": "Tired, lazy, overbearing are the words I use to describe this one. The schtick given by the stars gets tiresome after an hour. Jennifer Aniston raises or lowers the bar on her over the top character and it is the most entertaining of this film. She seems shoehorned into the plot though as she has nothing to really do with the story. The first Horrible Bosses was a clever refreshing stiff drink of a film and this one is warm soda."}, {"rating": "6", "text": "It definitely had its moments and much of the charm that the first film created, but unfortunately, this one exhausted itself long before the film was over due to the weaker gags and lack of an original or funny story this time around in comparison to the first. In fact, there were too many noticeable instances where jokes and gags from the first film were poorly recycled into this one. While the new story and writing was an overall disappointment, Jason Bateman, Charlie Day, and Jason Sudeikis, like in the first film, are able to make the most out of it and they themselves managed to make the film slightly worthwhile. It was good to see Jennifer Aniston, Kevin Spacey, and Jamie Foxx reprise their roles, but they didn't have enough screentime in my opinion. Christoph Waltz was ok. I also wish he had a little more screentime. Chris Pine does a pretty decent job as Waltz's crazed son. So while the story was a bit weak and lacking this time around, the actors all managed to make it a fun film for the most part. Overall, it isn't terrible, but it certainly doesn't hold a candle to the original."}, {"rating": "8", "text": "\"Horrible Bosses 2\" 10 Scale Rating: 7.5 (Very Good) ...\r The Good: The film picks up where the last one left off and doesn't skip a beat. Bateman, Day, and Sudeikis exhibit the same comedic timing that made the first film so good. The supporting cast was also up to the task as Aniston, Foxx, Spacey, and newcomers Pine and Waltz all seemed to genuinely have fun making the film. While the premise and story is all kinds of silly, it works. Not quite as hilarious (or as good) as the first film, but extremely funny in it's own right and chock full of laugh-out-loud moments.\r The Bad: At times, the obvious ad lib moments didn't work as well and caused a few scenes to stretch longer than they needed to ... with unfunny results. On a couple of occasions, the usually funny Charlie Day rambled a little long and it didn't work. That only happened a time or two, but did take away from the film somewhat. Lastly, I would have liked to have seen more of Sudeikis who seemed to rarely have any moments of his own."}, {"rating": "7", "text": "Charlie Day, Jason Bateman and Jason Sudeikis are back to launch their own business. When they get screwed (by Christoph Waltz), they hatch a plan to kidnap his son (Chris Pine). The leading trio still has great comic chemistry and their non-stop banter provides most of the laughs. Jennifer Aniston provides some outrageous moments and Jamie Foxx gets in a few, but the plot and supporting roles take a back seat to the quick-witted leads. It feels like an opportunity for them to go on an extended improvisation, but the brisk pacing keeps it from ever feeling self-indulgent."}, {"rating": "6", "text": "My boyfriend and I had watched all other movies available and this was the only one left that held promise which we hadn't seem yet. At least it would provide a laugh or two. It certainly has it's moments. Wish it had more. It was good enough and was so close to being better."}, {"rating": "8", "text": "I really don't get people being so hard on this movie for really no reason I watched it and absolutly loved it laughed out loud the entire movie good story terrific adventure I highly recomend it to almost anyone"}, {"rating": "9", "text": "Really great movie. I would even say funnier than the first. Day and Sudeikis' characters do act overly stupid together more often than the first movie in an annoying way a couple of times (they weren't annoying at all in the first movie) but I guess Pine's character being added keeps the group's dynamic entertaining. Most importantly, the movie made me laugh a lot. I felt all the bosses and Fox were used well enough also. I guess Waltz could have had more screentime. You can hardly expect them all to get enormous roles though.."}, {"rating": "3", "text": "Meh, good for mild, mind-numbing entertainment.\rI'm sure in a few years, these movies will be on FX or USA on repeat for all to enjoy.\rIn summary I'd skip the theater and wait for the rental to see it, if at all."}, {"rating": "4", "text": "Such a stupid movie. Not downright horrible like some other comedy sequels, but it's exactly the same thing as the first one, and the initial premise isn't nearly interesting enough to expand into a sequel."}, {"rating": "4", "text": "Horrible Bosses 2 has some smart humor that is not always funny, likable characters that are sometimes annoying and unrealistic, past characters that are just unnecessary. Overall, it is a bit of entertaining, but it dishonors its predecessor."}, {"rating": "1", "text": "A sequel to a film that really didn't deserve one this has our four leads trying to plan a kidnapping when a ruthless businessman tries to steal their new business idea. To say the film is annoying is a massive understatement, it is positively grating. Devoid of laughs, with a cast who look like they wish they were somewhere else, this displays everything that is wrong with the studio machine. A film made for the sole reason to try and take money from a gullible public without putting in any effort. Dismal and shameful."}, {"rating": "7", "text": "Very entertaining comedy which is perhaps just a tad overlong. The screenplay may not be the most sophisticated one out there, but it does provide loads of laughs. In fact the dialogue is so fast and furious that some jokes get sacrificed along the way if you so much as look at your pop corn. A lot of the humour is very crude but the playing of the cast is so lively, enthusiastic and good natured that offense is never taken.\rJason Bateman makes for an impressive 'straight' foil to the comic goonery provided by Charlie Day and Jason Sudeikis,, and both Chris Pine and Jennifer Anniston enter into the spirit of the movie with their tongues very firmly in their cheeks. Only Christoph Waltz is a bit tiresome. The two time Oscar winner's 'wolf in sheep's clothing' grin is beginning to pall a bit in its repetitiveness. He really does need to try and stretch himself in future projects before he becomes to firmly entrenched in the realms of self parody.\rOverall though, this is a better than average comedy that is consistently good fun."}, {"rating": "4", "text": "De esas veces que el título no tiene nada que ver con la trama, lo único en que se parece a su antecesora es que es el mismo reparto, misma falta de química y misma dirección a ningún lado."}, {"rating": "7", "text": "Horrible Bosses 2 was OK, nothing great and nothing terrible. Even though it has its flaws it's still funny and what make the movie work is the great chemistry the 3 leads have. Another thing i found great was that they didn't do the same thing all over again! (The Hangover 2) They actually went in a different direction with the plot. The involvement of Chris Pine was great, he was definitely a stand out and i kind of feel like they dropped the ball at the end because i would have liked to see him become a 4th member to the crew! BUT they fell into cliched movie twists and ruined that great possibility. Christoph Waltz honestly felt so wasted! His character could have been played by anyone else really. The return of the previous supporting characters worked, except for Kevin Spacey's who we'll talk about in a sec. **** Jones was great! and he was more involved in the plot than the previous film which i enjoyed! Julia's character was back because of boners lol but seriously she was good! They made her character get involved with Jason Batemans which i don't even think they encountered in first! Anyways both were great, now to Spacey! His cameo was more of a just because \"One liner jokes\" kind of thing. He added NOTHING to the film. I Mean i like Kevin and his character but it was pointless. Another thing that i didn't like was that they dumbed down the characters! Mostly Charlie Day's and Jason Sudeikis. The purposely made them MORE STUPID! Because having stupid people makes for more funny situations, i just felt that it was a step back for the characters! Overall yes there's some laughs and the story was different. It works, but the film could have been SO MUCH BETTER! I hope that the 3rd involves Kevin Spacey's character getting released from prison and trying to get revenge! idk but if they're planning on a 3rd just have a good PLOT! and don't make the characters even more stupid! I'm giving Horrible Bosses 2 a 7/10."}, {"rating": "7", "text": "Its truly a miracle that I even watched Horrible Bosses 2 because I can't say I was a big fan of the original film. The trailer made the movie look like it was going to be a dud but they saved all the good jokes for people who watch it. I like the extension of the cast with the additions of Chris Pine, Christoph Waltz and Jonathan Banks. Jason Sudeikis and Charlie Day were both really funny, Jason Bateman was just alright, he could have been funnier, but as a whole the main characters fit together really well. You can tell that they are very comfortable with each other. You don't have to enjoy the first movie in order to enjoy the sequel, but I do recommend watching the first movie because you see it."}, {"rating": "3", "text": "If you did not like the first one, than it will almost be a miracle if you like this second installment that doesent even deserve to be stuck on the big screen."}, {"rating": "5", "text": "A passable-at-best follow up to an actually really good first movie. HB2 plays out pretty much the same way the first movie did, only this time it tries to incorporate jokes that would have been okay-ish in The Hangover 3 and more recent It's Always Sunny In Philadelphia seasons, as well as a gratuitous use of the F-bomb courtesy of Jason Bateman. Pine and Waltz do add a good layer of fun, but that's not enough to elevate this movie."}, {"rating": "6", "text": "Horrible Bosses 2 is a carbon-copy sequel of its highly successful predecessor. What made the original film so enjoyable from its charismatically funny characters to its hilarious plot have found themselves back with slight tweaks and new characters. The film finds itself lacking in innovation and creativity, relying on the trio of Nick, Kurt and Dale to raise the film above its subpar story.\r Even within the trio the comedy becomes a bit stale as Kurt and Dale's naivety starts to get dry and repetitive as the film progresses. I'm mostly disappointed in the awful use of the cast in this film who are clearly phenomenal actors. Horrible Bosses 2 doesn't have Bosses to fight back against unless they refer to Waltz' brief character, the trio themselves or perhaps even the writers of this unimaginative narrative. Regardless it is a decent film for fans of the original and therefore a film to consider if comedy choices are slim."}, {"rating": "10", "text": "Horrible Bosses 2 deserves to be in the category \"Sequels that are better than it's predecessor\". Really, Really FUNNY!!!!  Just a really funny sequel. FUNNY!!!!!!"}, {"rating": "10", "text": "O filme é hilário! Vi este filme despretensiosamente, sem conhecer nada sobre ele e gargalhei como há muito não gargalhava. Uma história cheia de reviravoltas, momentos cômicos à todo momento e apesar de frustrante, graças aos personagens apaixonantemente imbecis, rir e se divertir é o que você mais fará ao longo dos 90 minutos que você dedicar ao filme. Indico fortemente pra qualquer pessoa que estiver a fim de assistir um ótimo filme de comédia. Além do que, o elenco é fora de sério com grandes nomes do cinema mundial. Fiquei feliz por ter conhecido o filme!"}, {"rating": "3", "text": "What an absolute waste of talent. The usually-brilliant Jason Bateman should never have signed up for this. The screenplay is so off-the-charts bad that it's a wonder the producers managed to get such talent on board. Jokes are limp, storyline is even worse and the predictability of the bizarre scenario makes this a movie you can afford to miss."}, {"rating": "0", "text": "Just awful. this movie feels like it was a product that was produced on a conveyer belt. The first one (Horrible Boss's)was low brow the sequal is... no brow. Which is sad, as i genuinely enjoy Jason Bateman, Jason Sudeikis and Charlie Day type of comedy.  I laughed at 4 different parts in the movie. To say \"laugh\" is an overstatement.  Would not recommend this contrived pile of garbage to my worst enemy."}, {"rating": "7", "text": "I don't understand why this movie received such unfavorable reviews from some critics. I enjoyed it and laughed quite a few times. I will admit that, being a female, I could do without some of the scatological humor that marks both Horrible Bosses #1 and #2 (er, no pun intended), such as that toothbrush scene, but the parts that turned me off are outweighed by the parts that I did enjoy, such as the many little offhand throwaway remarks that sounded like they could have been improvised. (Example: Talking about the villain Chris Pine, Jason Sudeikis tosses out a line like \"Look how BLUE his eyes get when he's crying!\") I love that kind of stuff.\r Jason Sudeikis, Jason Bateman, and Charlie Day are all very funny fellows and adorable to boot. I would go see just about anything they are in."}, {"rating": "6", "text": "When an unscrupulous businessman rips them off the trio, having obviously learned nothing from their exploits in the first movie, decide to try and get their revenge. Things quickly go wrong of course and the film doesn't exactly do anything all that original but the excellent cast, in particular the chemistry between Day, Sudeikis and Bateman, ensures that Horrible Bosses 2 still provides some laughs."}, {"rating": "4", "text": "Okay, I understand that people love sequels and it's usually a guaranteed win at the box office, but did we really need another Horrible Bosses movie? In this unnecessary sequel, the boys have gone into business for themselves, and in common fashion have signed away their invention to an investor for a fraction of what it's worth. Realizing they've been taken, they plan on kidnapping the billionaires son and the ridiculousness begins again. The old bosses and old accomplishes join new face for another adventure that's even more absurd than the first one was. I watched this film because I love Jason Sudeikis, he is one of my favorite comedic actors, however Charlie Day is not. I really don't know how anyone can stand watching It's Always Sunny In Philadelphia, with this little guy running around, with his high pitched rabbit voice, always excited like he just did an eight ball before every single scene he shoots. It's honestly one of the most annoying things I can think of. This film was kind of lame and leaned toward the stupid side to begin with, but when you add this little squirrel on crack to the mix, it really becomes nearly unwatchable. The bottom line, sequels make money. Some people want to learn the fate of characters they've seen and gotten to know. Then there are people like me, who went to see the first one and even though they weren't crazy about it, figured I might as well go see the next one. I can only hope at this point they don't decide to make it into a trilogy."}, {"rating": "5", "text": "I saw Horrible Bosses and was pleasantly surprised by the film. I went into Horrible Bosses 2 with slightly lower expectations. These lower expectations were thoroughly met. The film is just eh. It wasn't horrible, but I found myself just wading through the film. There wasn't a joke done in this movie that wasn't done better in the first. Rent the movie if you are looking for a time killer, but go in knowing it is just an amusing 1.5 hours."}, {"rating": "4", "text": "An inferior film in almost every aspect from its predecessor. The rambling is overbearing, painfully unfunny lots of times, way too long and a comedy that seem to try and force the humor in an unnatural way. A few scenes saved the movie from a total disaster."}, {"rating": "6", "text": "Sequels are usually worse and this one is no exception. It is still pretty funny though. It is nastier and raunchier than the first, but at the same time less entertaining."}, {"rating": "2", "text": "If you absolutely loved the first one you might like this one.  I thought the first one was okay, but everything good about that is gone.  It is just the three main characters being idiots and talking over each other as much as possible.  The whole story is painful to watch and the jokes, if there were any fell irritatingly flat for me.  The only funny performances were from Jennifer Aniston and Kevin Spacey who have a total time in the movie of about 4 minutes."}, {"rating": "7", "text": "It's simply hilarious. The plot is quiet dumb and the things going on in the movie are as well, but it does what ti's suppose to do. Entertain and make me laugh. For most comedies, that's all I need...laughs. Though the movie could have been better, especially for the amount of actors in the movie...but it was still funny as hell. Though there were moments that weren't funny and long pauses of non existing laughter, it was still funny. Like I said, it did what I wanted it to do. Overall it's satisfying, if you turn your brain off. 7.3"}, {"rating": "5", "text": "Just like almost every other successful movie that throws together a follow on sequel(s).  They're are some funny parts and you can always count on the chemistry with this cast, but its not nearly as funny as the original.. But, hey for 2 bucks at redbox, it was worth it!!"}, {"rating": "5", "text": "Horrible Bosses 2 isn't necessary! when  are studios gonna learn! that when Jason Bateman's character at the end defeats Kevin Spacey's character ....that's it no sequel, but no Warner Bros decides to reopen the empty headed franchise with moron characters, no one can get away with this especially academy award winner  Christoph Waltz.. The sequel has terrible acting but good humor. Grade C+"}, {"rating": "8", "text": "It was a more than decent sequel actually.The acting was good,the movie was funny and it was sure as hell entertaining.The movie was unbelievable at times and it's not as good as the first but, it was still a good movie."}, {"rating": "6", "text": "'Horrible Bosses 2' reunites the cast of the first film with very similar humor and jokes but still gives you a few good laughs.\rIt feels like more of the same for most of the film compared to the first film, Still not much of a real story but in a film like this it's about the jokes. The humor is very raunchy/Adult and some scenes with give you a good laugh but others feel juvenile and awkward.\rThe main characters fit their rolls perfectly and have great chemistry together, There chemistry maybe the best part of the film.\rIf you looking for a late night comedy or something to watch with friends this maybe worth your time."}, {"rating": "4", "text": "2/5★\rSequels are tricky, and boy did this one miss a trick. The cast is great but the film turns them into annoying, stupid and unlikable people that I didn't feel like rooting for. The only one who really made me laugh was Kevin Spacey's David Harken who, incidentally, was the bad guy from Horrible Bosses 1 and that should have raise some red flags. The trend of comedies with men stuck in arrested development has hopefully peaked with this pointless sequel.\rVerdict: Ok if there's nothing else to watch."}, {"rating": "4", "text": "Despite its high profile cast (3 of them have won a total of 5 Oscars...go figure), this is a miserable failure. It does have a few funny moments that made me chuckle (I do like Jason Sudeikis...he always makes me smile). If you can make it through the whole thing, there are some fairly funny moments during the end credits."}, {"rating": "5", "text": "This was a terrible follow up to the first. (which I liked) I almost walked out of the theatre and could hear the people seated behind us considering leaving. I am a huge Jennifer A fan but thought this one was over the top. A couple funny spots but over all I found it annoying especially the rambling conversations where they talk over each other."}, {"rating": "9", "text": "A fun, enjoyable movie to watch with your friends. It has heaps of humor in addition to a bit of adventure and romance. You must watch this. Overall an amazing movie!"}, {"rating": "6", "text": "It felt rushed. But it did have some hilarious moments that kept you watching more and more. But it went downhill quick than it came back up and than down. It was just OK."}, {"rating": "8", "text": "For the most part a real funny movie, i think people that can't find humor in this movie have no sense of humor or just takes comedies way to seriously. There are some real crap ones out there and this isnt one of them, its one of the funniest i've seen since 22 jump street if you enjoyed the first horrible bosses you should like it i liked it more than the first."}, {"rating": "9", "text": "Horrible Bosses 2 is just the funny comedy that is tied with its predecessor. There is no difference! Both of the made me laugh my head off and the three boys are a great team. Jennifer Aniston is amazing in this film and please make a third one. (A-)"}, {"rating": "6", "text": "I thought this was decent enough. Good cast, yeah some silly moments but also some hilarious moments. Great popcorn movie but not much more."}, {"rating": "6", "text": "This review contains spoilers. Horrible Bosses 2 is a carbon-copy sequel of its highly successful predecessor. What made the original film so enjoyable from its charismatically funny characters to its hilarious plot have found themselves back with slight tweaks and new characters. The film finds itself lacking in innovation and creativity, relying on the trio of Nick, Kurt and Dale to raise the film above its subpar story.Even within the trio the comedy becomes a bit stale as Kurt and Dale's naivety starts to get dry and repetitive as the film progresses. I'm mostly disappointed in the awful use of the cast in this film who are clearly phenomenal actors. Horrible Bosses 2 doesn't have Bosses to fight back against unless they refer to Waltz' brief character, the trio themselves or perhaps even the writers of this unimaginative narrative. Regardless it is a decent film for fans of the original and therefore a film to consider if comedy choices are slim."}, {"rating": "8", "text": "Funny as hell. But i also love Charlie day. Had a very sunny feel. Good stuff!!\r Watch it online for free: https://www.primewire.ag/watch-2755278-Horrible-Bosses-2-online-free"}, {"rating": "4", "text": "Oh no! Even more horrible bosses I would never work with! That means it even worse... more... more... and more sequels to this horrible franchise. These horrible bosses should just put themselves to an end."}], "recommendations": ["ride_along", "zoolander_2", "little_fockers", "identity_thief", "30_minutes_or_less", "the_wedding_ringer", "central_intelligence", "tower_heist", "the_longest_yard", "hubie_halloween", "spy", "ted_2", "thunder_force", "pitch_perfect_2", "zoolander", "ride_along_2", "jumanji_the_next_level", "cop_out", "baywatch", "dinner_for_schmucks", "horrible_bosses", "dodgeball_a_true_underdog_story", "the_watch", "the_green_hornet", "couples_retreat"]}