{
  "id": 1816,
  "title": "Horrible Bosses",
  "starring": [
    "Jason Bateman",
    "Charlie Day"
  ],
  "runtime": 98,
  "genre": [
    "Comedy",
    "Crime"
  ],
  "description": "For Nick, Kurt and Dale, the only thing that would make the daily grind more tolerable would be to grind their intolerable bosses into dust. Quitting is not an option, so, with the benefit of a few-too-many drinks and some dubious advice from a hustling ex-con, the three friends devise a convoluted and seemingly foolproof plan to rid themselves of their respective employers... permanently.",
  "releaseYear": "2011",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uQkUwgyFHAm0jGQERPG6Z9o9Zbj.jpg",
  "categories": {
    "plot": 8.40625,
    "acting": 7.942857142857143,
    "ending": 7.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.052631578947368,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Very solid film.  The comedy wasn't gross out and stupid, it was somewhat articulate.  I didn't feel like I was a little kid getting read a story like I have with the past few comedies I have seen.  Jason Sudekis, Charlie Day and Jason Bateman are very funny together.  You have the Player (Sudekis), the Mature One (Bateman) and the Crazy (Day) much like the Hangover.  Very watchable and very funny. 8 out of 10"
    },
    {
      "rating": "8",
      "text": "Three hard-working guys (Charlie Day, Jason Bateman, Jason Sudeikis) are tormented by their bosses (Jennifer Aniston, Kevin Spacey, Colin Farrell), so they decide to do them in. Instead of relying of gross-out gags and over-the-top outrageousness, this film features genuinely funny characters and situations. The leading trio have great comic chemistry and their non-stop banter provides most of the laughs. The bad guys are obviously having lots of fun, too. This film won't break any new ground (although it may launch Charlie Day's big screen stardom), but it's energy will certainly keep you amused."
    },
    {
      "rating": "7",
      "text": "Horrible Bosses is a sort of modern day remake of 9 to 5 by way of Superbad.  I honor this film for the several laughs that it got out of me, but by the end, I found myself ready to move on to something with more lofty comedic goals.  Easily worth your matinee admission price, but be a bit cautious if you are considering paying full evening admission price on this movie.  This is the kind of movie that Saturday night cable premieres were made for, in my opinion."
    },
    {
      "rating": "7",
      "text": "With an extremely good cast, \"Horrible Bosses\" is a surprisingly good comedy! With a reasonably interesting and silly plot, it manages to keep the audience entertained, while not being overly diluted and stupid, like many comedies nowadays are. There are never really dull moments in the film, and the action is ever-present, which provides for good entertainment. What I really enjoyed are the supporting performances, actually. I thought they were amazing - much better than the leads. That being said, Charlie Day is the cutest thing around and I could watch him for hours. But Jennifer Aniston, Kevin Spacey and Colin Farrell all do amazing jobs. Aniston is perfect as the kinky, sexy, sex-crazed maniac boss, and should definitely experiment some more with characters like these. Farrell reminds me of Tom Cruise in \"Tropic Thunder\" - same look, same crazy, same good performance. Overall, the performances are the really fun, surprising factor here, making the film truly fun and entertaining! Definitely fun to watch!"
    },
    {
      "rating": "9",
      "text": "This movie had me laughing from beginning to end! I even saw it twice to make sure it was that funny and i still laughed my butt off!Loved all the characters everyone is hilarious especially Charlie Day.Overall this is the funniest movie i have seen all summer(and i watch a lot of movies) and one of the top films of the year!!!"
    },
    {
      "rating": "8",
      "text": "I really enjoyed this movie. Best comedy I've seen this year. I don't know why everyone is comparing it to the Hangover, because there are 3 guys as the main characters?? I guess if u were disappointed with Hangover 2 like i was you should appreciate this movie. Solid film, Great actors. Charlie Day is amazing. When you go see this movie, enjoy it for what it is, a hilarious comedy. Don't go in there expecting it to be like something else, do the comparing after u watch the movie. Just sit and enjoy."
    },
    {
      "rating": "10",
      "text": "the movie is very good, because it has a great story and of course a great cast, this film is also an excellent and entertaining comedy that makes atentatos everyone is thrilled with the film"
    },
    {
      "rating": "9",
      "text": "It wasn't what I expected, but it WAS funny. The plot was pretty solid, and the acting in it was pretty great. Some parts were better than others, but overall, it was a pretty good movie. I'd defiantly go and see it again."
    },
    {
      "rating": "8",
      "text": "One of the best comedies of 2011, miles better than The Hangover II, but not on par with Bridesmaids. An ensemble cast that coukdnt have been cast better with all characters taking on their roles brilliantly. But two actors that stand out against the rest of the cast is Charlie Day and Jennifer Aniston, they have excellent chemistry together, and As soon as both appear on screen together you know sparks will fly. Jennifer Aniston is outstanding in a role no one would have expected, with her dirty talk and sexual ways, she is different and excellent at it. Her role could either be a one off or the start of a brilliant new acting route for her. But above all is Charlie Day, every scene he is in is hilarious, and you would seriously believe this is what Charlies real life persona is like. Its hard to describe how execellent and hilarious he is in the film without watching it for yourself. The only bad points of this film is it is not consistently funny, nor a plot that is by the end very intruging or memorable. But overall a truly fantastic comedy film that pretty much everyone could enjoy, just dont watch with your parents or grandparents!"
    },
    {
      "rating": "10",
      "text": "This movie is original, entertaining and has a very good argument. HIGHLY RECOMMENDED."
    },
    {
      "rating": "7",
      "text": "I was prepared for something much more low brow and raunchy - but no, it's appropriately raunchy, and I laughed very hard with it.  It's just not substantial enough to be considered a classic that can sit along side your Old Schools, Hangovers, or Wedding Crashers.  But it's much better than Hall Pass! Charlie Day seems to be making every movie he's in better. Makes me fired up for another season of It's Always Sunny. And Jennifer Aniston? I love that she goes all the way and really commits to these roles.  I know she had a brief period in her career when some other celeb broke up with her?  Who was that, Brad Pitt?  Pffft!  The days of our needing to feel sorry for her are long over.  She's destroying it. Look forward to her next film."
    },
    {
      "rating": "9",
      "text": "The movie was a solid 8, with a fun story line, great casting, plenty of laughs all the way through, and the additional scenes I've never seen in a movie, until this one, in the out-takes during the credits, make this a 9.  It is vulgar, sexual and gross, but a good film for those who are not prudes."
    },
    {
      "rating": "7",
      "text": "The fashion in the movie industry when it comes to comedy is adult humour. It is delicate to handle as it can easily be misconstrued as crude/crass in the wrong hands.  Luckily this film has a number of gifted comedians whose talent helps us forget the inadequacies of the film giving us a number of funny moments."
    },
    {
      "rating": "7",
      "text": "One of the funniest movies that came out this year. I will start off by saying how evil and psycho is Kevin Spacey's character (Dave Harken), which he played really well. He's so psycho that he scares you. Hopefully nobody will have that type of monster has a boss. But the movie had a lot of focus on this character (and stand out the most from all the horrible bosses). I would of liked to see a little bit more situations involving Dr. Julia Harris, D.D.S. (Jennifer Aniston) and Bobby Pellitt (Colin Farrell). Especially Jennifer Aniston, she was hot. In fact, I would like to had her has a boss. Anyway, the filmmakers did a great job creating theses characters. Has for our heroes, they were hilarious. It was fun to watch these normal people trying to kill there bosses, and failing at it. It's an enjoyable movie, I was waiting to see this for a long time and it didn't disappointed me."
    },
    {
      "rating": "9",
      "text": "Absolutely hilarious and one of the best comedy's I've seen in a long time. Excellent writing and acting. It will have you rolling. Highly recommended."
    },
    {
      "rating": "7",
      "text": "Ultimately a good comedy especially with Miss Spotlight Stealer, Jennifer Aniston.  HB is your typical comedy, but Hollywood and its brethren has its way by keeping you tuned with sexy twists and turns."
    },
    {
      "rating": "10",
      "text": "As long as you see this  before hype kills it, its worth every dime....every character has a good part, and its nice to see J. Aniston with a dirty mouth.  She kills it.  Really, everyone did well considering the story is fairly see-through."
    },
    {
      "rating": "10",
      "text": "The best comedy movie i watch in months, maybe years. My god, i LOL-ed many times throughout the movie. Great acting from the 3 guys. Astounding. A must watch. 4.5 stars"
    },
    {
      "rating": "8",
      "text": "Proof that Hollywood can still make original, clever movies. Kevin Spacey particularly steals every scene as the twisted boss Harken. This is \"Office Space\" played to a wider demographic with just as many laughs."
    },
    {
      "rating": "9",
      "text": "This film is like marmite. You either love it or hate it. I personally loved the movie and I think, wait I KNOW that this movie was funnier than Hangover. I think the reason why people hate it is because the themes of the movie such as sex, vulgar etc are too specific towards a certain target audience but I lie said this film was kick-ass really funny, the characters were interesting and easy to relate to. I think that people that enjoyed Hangover will like this film too."
    },
    {
      "rating": "8",
      "text": "The best R rated comedy since the hangover. The story is well told as well as well written. The comedy is smart and well thought out unlike many comedies in this day of age. If your looking for a movie that's funny and has a good story I suggest you watch horrible bosses.  If your looking for a bad movie with dumb comedy I suggest you watch zookeeper"
    },
    {
      "rating": "8",
      "text": "A funny movie that provides constant laughs along the way. No, not gut wrenching laughter, but good, solid laughs. A good date night movie experience!"
    },
    {
      "rating": "9",
      "text": "One of the best comedy movies ever since \"the hangover\" with a great performances of jennifer aniston,colin farrell and charlie day.A great movie to see with your friends"
    },
    {
      "rating": "9",
      "text": "Much funnier than Hangover, in my opinion, but I also think Hangover was WAY overrated.\r Pretty much the entire movie is funny.\r Don't agree with the person who said the movie was too short; it was just the right length.\r Our movie theater was filled, and everyone seemed to enjoy the movie."
    },
    {
      "rating": "10",
      "text": "This is one of the funniest, not to mention bizarre, films I've seen in a very long time.  The whole audience was belly-laughing.  The acting was incredible.  We couldn't stop talking about it after it was over.  A MUST SEE!!!"
    },
    {
      "rating": "7",
      "text": "The movie was solid, but with a cast filled with comedy stars like Jason Bateman (Arrested development) , Jennifer Aniston (friends)  and Colin Farrell (In Bruges). I was glad it wasn't an all out gross film and the trio of charlie day, Bateman and Jason Sudeikis worked quite well together especially during the break in scene into Bobby's house. The movie delivers non stop laughs with good supporting actors like Kevin Spacey and Jamie Foxx. It wont break any new ground but it is a good start for Charlie Day on the big screen. 7/10"
    },
    {
      "rating": "8",
      "text": "I liked this movie overall. Sudekis, Day, and Bateman are very funny especially together and leads me to ponder why they are not in more films. Spacey is fantastic as usual and Aniston and Farrell fight against type casting and are rewarded thoroughly for it. Not the funniest movie this year, but it does a good job."
    },
    {
      "rating": "8",
      "text": "Horrible Bosses is totally funny and enjoyable movie. New kind of black comedy with a solid story . All the characters in this film was different and awesome & it was done amazingly . Jason Bateman,Charlie Day,Jason Sudeikis,Kevin Spacey,Jennifer Aniston,Colin Farrell & Jamie Foxx did really did .Markowitz's story was really good also Seth Gordon's directing.Its different then any other comedy film and totally worth watching ."
    },
    {
      "rating": "7",
      "text": "Nick, Kurt and Dale are all cursed with a horrible boss. Dave Harken is extremely controlling with psycho traits, keeping a tight leash around Nick, while a cocaine addict ,Bobby Pellit, inherits his fatherâ"
    },
    {
      "rating": "8",
      "text": "This is totally the best comedy film of this year\rWay better than bad teacher or bridesmaids\rMust watch 4 all hangover fans\rAlmost as gud too and quite similar 2 it n sum ways...great actin by everybdy"
    },
    {
      "rating": "10",
      "text": "A hilarious comedy. Metascore is totally off on this one. It is a great comedy film, and well, yeah, bit of an action and plot things and whatnot. Yeaaaah, pretty f---ing good movie."
    },
    {
      "rating": "7",
      "text": "If you're looking for a movie that brings on the laughs, look no further than \"Horrible Bosses.\" It's a comedy where the energy of the cast never fails to bring on the fun. Everyone sells their roles perfectly here, particularly Charlie Day and Jennifer Aniston. The script isn't bad either. There's a number of memorable quotes and fun situations to keep this movie going. The one big weak point is the concept itself, and that causes the laughs to diminish a bit, but just as the movie starts to sink, there's an inspired performance to bring it back up. See \"Horrible Bosses\" if you want some R-rated summer fun."
    },
    {
      "rating": "7",
      "text": "From Arrested Development creator, Brett Ratner, and the star of Freaks  Geeks, John Francis Daly, comes Horrible Bosses. What made this film stand out from other raunchy comedies, was that there wasn't just one super funny guy that the other played off of. Every character had their moment and was funny in their own way. The story was fairly original too. Three miserable guys decide all their problems would end if they kill each other's boss and they go on a hilarious mission to get the job done. While I love the idea and thought the movie was genuinely funny, what it lacks is character development. Other than the abuses they face at work, you don't really know too much about these guys and where they are coming from. I feel like that weakened the film, but what more than makes up for it is a ton of hilarious cameos. I love cameos and there are some great ones from Jennifer Aniston, Jamie Foxx, Donald Sutherland, Bob Newhart, and Collin  Farrell. Horrible Bosses while lacking substance is defiantly good for a few laughs, which is pretty much all that I expect from these types of movies."
    },
    {
      "rating": "7",
      "text": "So hilarious. The chemistry between everyone was just on point, it was a cast full of veterans making a great dirty rated R movie. I loved it, one of the better comedies of 2011."
    },
    {
      "rating": "8",
      "text": "I went into this movie with pretty low expectations and came out pleasantly surprised. It is one of few movies that I can watch over and over and still find myself laughing throughout the entire movie. The casting was spot on across the board. While the humor can be a bit raunchy at times, it is very relatable, particularly to the younger generation. The main trio have a great chemistry that is present throughout the entire film. Overall, Horrible Bosses remains one of my favorite go-to comedies."
    },
    {
      "rating": "7",
      "text": "Funny and raunchy. The movie didn't hold anything back, and pushed actors to their limits. It wasn't cliche as so many other comedies are. It was nice to see Jennifer actually play a different character over her dull self."
    },
    {
      "rating": "8",
      "text": "Funny movie the cast was great Charlie Day was hilarious! So if your a fan of It's Always Sunny in Philadelphia this is a must see movie. Jason Bateman and Jason Sudeikis were great too. If your looking for a good laugh then Horrible Bosses is for you."
    },
    {
      "rating": "8",
      "text": "One of the best comedies of 2011, miles better than The Hangover II, but not on par with Bridesmaids. An ensemble cast that couldnt have been cast better with all characters taking on their roles brilliantly. But two actors that stand out against the rest of the cast is Charlie Day and Jennifer Aniston, they have excellent chemistry together, and As soon as both appear on screen together you know sparks will fly. Jennifer Aniston is outstanding in a role no one would have expected, with her dirty talk and sexual ways, she is different and excellent at it. Her role could either be a one off or the start of a brilliant new acting route for her. But above all is Charlie Day, every scene he is in is hilarious, and you would seriously believe this is what Charlies real life persona is like. Its hard to describe how exeellent and hilarious he is in the film without watching it for yourself. The only bad points of this film is it is not consistently funny, nor a plot that is by the end very intruiging or memorable. But overall a truly fantastic comedy film that pretty much everyone could enjoy, just dont watch with your parents or grandparents!"
    },
    {
      "rating": "8",
      "text": "Impossibly irreverent and almost mercilessly hilarious, \"Horrible Bosses\" amounts up to a great comedy for adults."
    },
    {
      "rating": "10",
      "text": "This is one of the funniest movies ever! each and every one of the charecters is amazing in their own right: the three bosses are HILARIOUS, and each of the boys has their own comical charecteristic."
    },
    {
      "rating": "10",
      "text": "This movie was far better than I expected. Charlie Days part in this movie was awesome. It is funny, disturbing and sometimes just cool. The story is innovative and also breathtaking.\rThe best scenes are those with Charlie in it. When you like Always Sunny in Philadelphia you will love this movie."
    },
    {
      "rating": "7",
      "text": "Great comedy, with great actors and some action and suspense. The trio of the clients were superb. Jennifer anniston was a breakthrough character.Liked it a lot"
    },
    {
      "rating": "8",
      "text": "Often very funny, Horrible Bosses has a star studded cast and plays out like four separate stories coming together for one big movie that is sure to entertain, or disgust. It depends on how you view it."
    },
    {
      "rating": "3",
      "text": "3 because the bosses who actually play their roles in the best way possible, the movie couldn't go further or better because lag of imagination in the situations, the general idea is just great but nothing else, poor comedy with stupid ideas, sometimes its feel like the scrip was written by a child. This movie is just another proof that good actors not always mean good movies."
    },
    {
      "rating": "2",
      "text": "WHAT I LIKED: It's overall a well plotted sit com with a great group of male actors and protagonists\rWHAT I DIDN'T LIKE: It's not actually that clever in its humour, and is a very typical and cheesy American comedy with some ridiculous bits of humour. Plus the character's problems don't feel real enough for the 'comic relief' effect\rVERDICT: Really this just boils down to what you find funny. Like stupid and random situations taken to the extreme with a bunch of slap stick moments? This is for you"
    },
    {
      "rating": "10",
      "text": "Better than the Hangover in the way that it's going to be far more re-watchable, and I doubt it will have an almost identical sequel which has a third of the funny parts and really should have been called a remake.   Jason Bateman and Charlie Day rule while Spacey and Aniston(surprisingly Aniston honestly)really bring it home.  The guy from SNL wasn't bad but really reminded me of Ed Helms only Day has the more frantic parts.  Both Bateman and Spacey are so brilliant with how deadpan they are... which makes Day's frantic, hilarious character that's quite similar to Charlie on It's Always Sunny but a tad smarter and not the raging drunk that that character is.  He had the funniest running joke about being a registered sex offender..."
    },
    {
      "rating": "10",
      "text": "Wow, this movie was great, it deserves every positive review it receives, a 57 is way too low for this film. It is highly underrated by critics. This is what i was looking for in the hangover part 2, a laugh. I laughed countless times throughout this movie. It was fregen hilarious, the acting was great, the comedy was outstanding and the casting for this film was perfect. Jason Bateman, Charlie Day, and Jason sudekis were hilarious and perfectly casted for this film. I believe they stole the summer, this was the hangover of 2011. The comedy was nonstop. Everybody should go see this film, whether for a laugh, for a cheering up, or just to go see a good movie, you must see this. You wont be disappointed, 10/10 definitely!"
    },
    {
      "rating": "9",
      "text": "This movie was SUPER funny. The only reason it did not get a 10 is because it could have been a tad bit longer. It was very entertaining and could have been stretched out a little bit more. Other than that movie was Awesome and well cast. Every actor was perfect for their role, especially Charlie Day. Jennifer Aniston was WOW! and has never looked so good. Although Jaime Foxx's parts were short they were hilarious. Jason Bateman is a great actor and I hope to see more of him in future roles. Jason Sudeikis was funnier than I thought he would be. Also Kevin Spacey is bad ass as a bad guy and Collin Ferrel play a good crack head."
    },
    {
      "rating": "9",
      "text": "Be cautious of reviews that seem overly critical, this movie is Hilarious! My wife and I as well as most of the audience laughed out load throughout this movie. I have not laughed this much  since the Hangover and I really enjoyed this movie more. The boss's are all Horrible although most men would wish their boss was Jennifer Aniston, she was great.  The three main characters were great and their chemistry worked very, great supporting actors like Jamie Foxx (he was a riot) as the \"hitman\", Kevin Spacey as the worst boss ever were terrific also. If not for a few brief jokes that did not work I would give this movie a 10. Unlike some of the reviews that I read I would rate this movie higher than Wedding Crashers and on par with the Hangover. If your main reason to go see a comedy is to hae an good time and to laugh  ALOT then you wil love this movie. Most of  the scenes with Jennifer Aniston were gut busters! A fun time for sure, I may have to see it again!"
    },
    {
      "rating": "7",
      "text": "A good enough popcorn flick, with Jen Aniston and Kevin Spacey stealing the show. The former plays against type, and the latter playing himself to the extreme. Basically a slacker bromance caper film with some neat homage to predecessors"
    }
  ]
}