{
  "id": 3055,
  "title": "Hostiles",
  "starring": [
    "Christian Bale",
    "Rosamund Pike"
  ],
  "runtime": 134,
  "genre": [
    "Western",
    "Drama",
    "History"
  ],
  "description": "A legendary Native American-hating Army captain nearing retirement in 1892 is given one last assignment: to escort a Cheyenne chief and his family through dangerous territory back to his Montana reservation.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rqoezyB51GfhiloOB5ZErg5HXas.jpg",
  "categories": {
    "plot": 7.880952380952381,
    "acting": 6.983050847457627,
    "ending": 5.0,
    "soundtrack": 8.75,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The film’s title is a conundrum. Who are the true hostiles, the Native Americans or the American settlers? A seasoned army captain is asked to escort an aging and sick Cheyenne chief (Wes Studi) and his family back to their homeland in Montana, after having endured seven years of prison for war crimes. Captain Joseph Blocker, played by Christian Bale, balks to the point where he is threatened with court-martial, prison, and a loss of his pension if he does not obey the orders that come directly from U.S. President Benjamin Harrison in the year 1892.But things have changed since the Battle of Wounded Knee, in which Blocker had fought. Back East, influential citizens have begun what would evolve into the long and slow process of the United States government paying reparations and making official apologies to indigenous peoples. The popular advocacy on behalf of Native Americans was in its infant stages. The Indians were wronged by the white settlers; they were dispossessed; their lands were stolen from them; they suffered indignity and they died in droves from white man’s diseases. Laws were passed prohibiting their spiritual practices. It was just a handful of voices, but President Harrison was being harassed by prominent citizens. Under political pressure, the President ordered Chief Yellow Hawk and his family to be released from prison and escorted home.Blocker had seen slaughters conducted by Indians in his long career as a U.S. soldier. He mistrusts Yellow Hawk, but the military commander is forced to accept orders, and the journey of a thousand miles begins. Against all odds, Yellow Hawk becomes an unexpected source of wisdom and support. Early on the travelers meet a victim of the Comanche Indians, a young widow, Rosalee Quaid (Rosalind Pike), out of her mind with grief because her cabin in the middle of an empty plain had been burnt down, her husband and three children murdered as she miraculously escaped. The trek on horseback to Chief Yellow Hawk’s sacred homeland, where he is eventually buried, is disturbed by Comanche attacks, deserters, and abduction. When the group finally arrives in Montana, we receive a brief tutorial on the history of gun violence in the United States. There is a shootout on the sacred Indian land which is privately owned by a crazy, gun-toting, white senior who threatens to kill the entire party if they don’t get off his land. (Americans are suffering the legacy of this mentality to this day in Texas, where ambiguous legislation allows gun owners to take the law into their own hands.)The movie has all the elements for greatness in the genre of Westerns and nearly achieves it. Christian Bale is a force of nature; Rosalind Pike is a pillar of feminist strength. With their wordless romance, fate decrees that Rosalee is compensated for her losses. But there are historical inaccuracies and questions to deal with. Conflicts with Comanches ended in the 1870’s when the last Comanche bands surrendered to the U.S. Army. The character of Rosalee is educated and no stranger to fashion; it’s not clear why she and her husband built a log cabin exposed in the middle of isolated and dangerous territory. And there were trains and stagecoaches they could have taken for their journey to Montana; civilization was right around the corner in 1892. The fictional plot is a bit of an anachronism. Nevertheless the broader story of racism, misappropriated land, and the destruction of Native American culture is historically accurate, and these issues still have implications in the present."
    },
    {
      "rating": "9",
      "text": "Ein amerikanischer Western durch und durch. Entspannend und spannend zugleich. Aber größtenteils entspannend. Tolle Aufnahmen und eine schöne Geschichte über Feindschaft, Freundschaft und Güte kommen hier zusammen. Interessant besetzt und sehr gut gespielt. Ein Film in den man abtaucht und erst merkt, dass man woanders ist, wenn er zu Ende ist. Hat mir sehr gut gefallen und werde ich bestimmt noch mehrmals sehen. Die Abmischung war exzellent und die Bildqualität hervorragend. Danke Scott Cooper!"
    },
    {
      "rating": "9",
      "text": "This movie is a slow paced emotion roller coaster with a really strong message which apparently was not clear enough for most people because this movie is too under rated. It really had that feel of the raw wild west and was not exaggerated to better fit the silver screen. The events of the plot are kept simple but brutally realistic and  filled with raw emotion and consequences. The acting was really amazing, especially with Christian Bale's solid but soft under performance of Joe. The writing was simple enough but still held value and emotions. The music helped the immersion, and was really not exaggerated on the over the top action scenes. But the scenes where still \"heavy\". The directing style was great amazingly executed as well, with on point cinematography. There is to much humanity in this movie to ignore the artistic value hidden in this movie and the deep message of life and solidarity/empathy. The visuals and the sights where this movie was shot was a real jaw drop for most of the audience, with pixel perfect practical effects. The pacing was a little slow at the end, but it can be argued that that is due to the immersion creating and tension full scenes if we have the patience with the unfolding of the plot. Overall it's an amazing movie which in my humble opinion deserved a lot more from the critics, because they oversaw the real/raw artistic value in this movie. But I did this from general audience. Still..."
    },
    {
      "rating": "10",
      "text": "Just ordered this one after seeing it on Netflix. Hell of a film in my opinion. I enjoyed the overall balance and tone of the film.It’s gritty, and violent, but not to insane extremes or excessively so IMO. It avoids the American patriots vs. the savages of old Westerns, and also avoids the Americans are evil and the Natives are just peaceful hippies who are kind to everyone like in that inane borefest Dances with Wolves. This film shows that there were hard and violent men capable of great and terrible things on both sides. This not only makes the story authentic and historically accurate, but it also makes it more of a film about humanity and I think it has an appeal that transcends the Western genre. The lanscapes and cinemetography were beautiful and I think people who don’t usually watch Westerns could enjoy this film. One of the best Westerns ever IMO and one of the top movies of 2017 along with Dunkirk and BR 2049."
    },
    {
      "rating": "7",
      "text": "I found this quite good. It really makes you think about the climate of post-civil-war United States and the relationship between so many groups under one banner. And that doesn't just go for Natives & Whites. There was French, Irish, African, etc all with their own part to play in this strange but somehow captivating journey. Bale was magnificent, there were some really raw and emotional moments also. Glad I made the choice to watch this."
    },
    {
      "rating": "9",
      "text": "Loved this.  Cried in three separate places.  Christian Bale is really good and believable in this.  But we’ll done to the whole cast."
    },
    {
      "rating": "10",
      "text": "If you enjoy how movies were made with character and developing a plot and not just mindless action, this is a movie for you."
    },
    {
      "rating": "10",
      "text": "One of the best westerns I've ever had the pleasure of watching. CB knocks it out of the park yet again. The music by Max Richter is amazing!"
    },
    {
      "rating": "6",
      "text": "Christian Bale is (as always) fantastic. Yet even he can't overcome the lackluster plot, which seems to be the same 20 minute story repeated for more than 2 hours."
    },
    {
      "rating": "6",
      "text": "Pretty subpar western if you ask me. Felt mostly formulaic and predictable to me throughout and had little to no character development. Christian Bale was reliable as always, but really his performance was the only really good thing it had going for it in my opinion. The film's imagery and cinematography was also a plus, as that was highly captivating often times, but overall, that along with Bale's performance wasn't really enough to make it too worthwhile in my opinion."
    },
    {
      "rating": "10",
      "text": "I found this to be a very good movie.Very thought provoking and some very deep and touching moments. The struggle of life and death and the way we treat each other. Good acting and directing and a good story about humanity. I highly recommend. Made me look at native Americans in a whole new light."
    },
    {
      "rating": "9",
      "text": "Very well done western about forgiveness and redemption. It gives a realistic look at how the west was rough and unforgiving. Excellent!"
    },
    {
      "rating": "2",
      "text": "I haven’t seen a ‘western’ in at last 20 years and I can do without seeing one again after “Hostiles”. ‘They’ certainly don’t make them like they use and John Wayne would be embarrassed, let alone not know how to act, doing Christian Bale’s role!The only westerns I have liked are “Shane”, the campy “Duel In The Sun” and “Johnny Guitar” and though Bale is excellent I couldn’t/wouldn’t watch this 2 hour and 13-minute film again even if you gave me all the carrot cake I can eat!In spite of the fantastic scenery, whether it is in mountains or forests or streams or desert to open plains, there isn’t much new in “Hostiles”. Let’s go over the checklist: Indians raiding and killing all the white settler family except the mother—check, a white man getting scalped—check, women being raped—check—the black soldier getting shot—check—a very wise Indian chief—check—people dying and being buried—check—people dying and being left to rot—check—an Indian being hung from a tree—check. Should I go on?By the way, the above aren’t spoilers as you have seen these scenes in almost every western!There are two things that are new in this movie and that is basically understanding Bale’s character though you are told very little about him and, in spite of the fact that I love a ‘happily ever after’ ending this has one of the most ludicrous ones I have ever seen. This also isn’t a ‘spoiler’ because it is so unbelievable!Christian Bale is excellent and though there was talk of his getting an Oscar nomination he didn’t which is as senseless as Denzel Washington getting one for his role in “Roman J. Israel, Esquire”. Rosamund Pike does what she can with the ‘damsel in distress’ role while no one leaves an impression in any of the other roles.“Hostiles” is in the same category as “Phantom Thread” in that except for the leading actor neither are worth seeing."
    },
    {
      "rating": "9",
      "text": "Hostiles is definitely one of the best films I have seen this year. Christian Bale and Rosamund Pike were both wonderful, and they had a excellent supporting cast. I am not quite sure how you would market this very fine film since it is basically a traditional Western without any special plot twists. I guess what I mean is that it is not very original. It simply has a solid cast and direction – and a certain very sad and “lyrical” quality. No big shoot-outs, no clichés, but a great atmosphere that kept me and the rest of the audience spellbound, quiet, and motionless for over two hours."
    },
    {
      "rating": "8",
      "text": "Hostiles is a movie that certainly lives up to its title. Directed by Scott Cooper, starring Christian Bale and Rosamund Pike. Set in 1892, an army captain (Bale) must escort a Cheyenne chief (Wes Studi) and his family through dangerous territory and back to their home.We don't get many Westerns these days so I try not to miss the chance to see one and if you enjoy Westerns at all then under no circumstance should you miss this. Bleak and devastating, Hostiles doesn't hold back, doesn't ease the constant sense of impending doom. The vast landscape and the character's emotional torment is emphasised in the mesmerizing film score. Although the pacing can be a little slow at times the story captured me from the opening scene. What movie fan doesn't love a good Western and Hostiles is everything you'd expect. The story moves in a way you'd anticipate, yet what makes it memorable is Rosamund Pike and Christian Bale. Their performances allows you to feel every ounce of pain their characters are going through. Emotional, very atmospheric and highly recommended."
    },
    {
      "rating": "7",
      "text": "As I watched these actors slowly plodding through their perilous journey on horseback, I pondered the tedium of travelling at that pace. Ironically, it became an analogy for the movie, which moves very slowly, with generous pauses and lovely scenery. Christian Bale plays a rugged, closed-down Army Captain in the Wild West of the late 1800s. He's assigned to escort a Cheyenne chief to his family home. Along the way, he encounters a woman, who's alone after her family was slaughtered by Comanches. Their trek not only presents numerous challenges, but engenders discussion from several angles about race and humankind's cruelty. The performances are earnest, esp. Bale's stolid soldier. There are compelling moments of emotional impact and philosophical contemplation, but it requires patience to appreciate the film's complex moral arguments and quiet revelations."
    },
    {
      "rating": "4",
      "text": "Hostiles is one of those movies where the movie sounds better on paper than it is actually executed in the final project. Scott Cooper directing, a cast featuring Christian Bale, Timothee Chalamet, Rosamund Pike, and Jesse Plemons among others, a killer script. What went wrong? The finished movie feels like a direct-to-tv feature that is completely rushed. There's a lot of hammy over acting that distracts from the story, such as Christian Bale screaming at his gun as he \"contemplates\" suicide, Rosamund Pike burying her children, and Timothee Chalamet grunting \"BITUH\" when he gets shot in the shoulder. It's a weird, meandering movie that feels way too long. I can only recommend this if you are bored on Netflix and have nothing else to watch."
    },
    {
      "rating": "7",
      "text": "An incredibly deep performance by Christian Bale that I now see he was ignored in this awards season because this performance is one of the best of his career, but I guess this is due to the low noise this film made and especially to its general quality, with that I'm not saying it's bad at all, it's just that it's Bale's performance that puts it above the average, especially being a western.It's worth checking it out and also I fully recommend the great music score by Max Richter, who I believe is one the most underrated and underused composers of today."
    },
    {
      "rating": "9",
      "text": "Incredible. Bale and Pike are at the top of their game and everyone else is great in the time they get on screen. If you have patience this movie will reward you once the credits roll."
    },
    {
      "rating": "8",
      "text": "Great movie, acting, themes, camera work excellent. Saw. It on a big screen and it is best because of the scope of it. That said it’s in some ways a tough watch. Very realistic and at times a bit brutal. For adults, not just a western. Also I found a bit long. These are minor qualms , the movie is terrific"
    },
    {
      "rating": "5",
      "text": "if i did not have faith..HostilesEach and every frame of this feature is buried under a pile of trouble and sorrow that luckily for the feature is portrayed stunningly in the performance but unfortunately is not appreciated by the material (the script is a bit loose). The screen writer and director, Scott Cooper might be doing some of his best work but is trapped in a tale that barely has enough concrete material to demand attention from the audience let along entertain them. As mentioned earlier, if there is anything plausible in this feature its the performance by Christian Bale; at the heart of it does his best but isn't provided enough range to flaunt it, and Rosamund Pike. Hostiles breeds power over authority, minority and humanity which isn't expressed to its best on paper which then results into a hollow and unsatisfying experience on screen."
    },
    {
      "rating": "8",
      "text": "Hostiles is not one of those movies that you walk into expecting a happy, fun time. It was very clear from the trailers that this was going to be a hardcore Western, and it is just that. It is about a Union solider (who specializes in killing Indians) transporting an Indian Chief back to his home, after all. The tone is set in the very first scene and it stays for the entirety of the runtime. It's a film about brutality and the cost of it. It gives a realistic portrayal of how hard and unpredictable a journey could be back in the western days. It also shows how even the most dedicated adversaries can become trusting companions under the right circumstances. This is a long film, and I could feel how long it was due to the slower pace, but that's not entirely surprising considering it's a Western. Plus, I think that the slower pace worked for this film. It helped make me feel like I was actually on a long journey with the characters, and the extended amount of time with them made me truly care for them by the end. I also have to give major props to Christian Bale for his performance in this film. I truly think it's worthy of an Oscar nomination, but he didn't get one. The rest of the cast was great as well.In the end, I think that Hostiles is a fantastic Western. Unfortunately, the longer run time and the brutal story makes it hard for it to appeal to a huge audience, but there's no doubt in my mind that Western fans will find that this film will satisfy their need for a solid, new Western."
    },
    {
      "rating": "10",
      "text": "My boyfriend wanted to see this movie and told me it starred Josh Brolin. I don't like westerns or civil war films (except for \"Gone With The Wind\"), and the trailer didn't make this film appealing to me. I like films that entertain. However, I gave in and quickly realized it was Christian Bale (I don't know why my boyfriend confuses Bale with Brolin), who was very unlikable at first. After a slow beginning, the story becomes very compelling and it doesn't matter that it's a western or whatever this movie is. The story is about human dignity and what it takes to get along with people who don't look like you, or think like you. As the story progresses, both sides gain respect for the other as they endure the same horrible situations. Wish more people were really like that during trying times and still able to show empathy and caring. The end of the film was a bit of a tease on what was going to happen next, and we're glad the film ended the way it did. On top of a compelling story (at least the story was compelling for us), it has great acting, and wonderful scenery. I wish I knew where they filmed. The cinematography was gorgeous!"
    },
    {
      "rating": "1",
      "text": "This should have been titled: BORINGS instead of hostiles. The only thing hostile at this movie, was the audience. What an absolute long, boring flick. It reminded me of \"heaven's gate\" where every scene was too long and pointless. I can't tell you how much people were perturbed. SNOOZE FEST. DON'T WASTE YOUR TIME"
    },
    {
      "rating": "9",
      "text": "What an incredible film. Definitely worth watching. The atmosphere is solid from start to finish, with a nice soundtrack and superb acting from a well picked cast."
    },
    {
      "rating": "1",
      "text": "I paid good money to be depressed. Personal performances were good but the story was depressing. Please please please, someone make a real western movie."
    },
    {
      "rating": "9",
      "text": "Violent.  Absorbing. Realistic. Bleak. Redemption. Humane. Message of anti violence. Slow moving in parts. Take your pick. Its all of the above. An interesting and well scripted plot, the acting and cinematography are very good. Bale is well cast and excellent. Rosamund Pike is well cast and very good. Its part Dancing With Wolves  and part Revenant . I think its better than both. Its not a feel good movie but is probably a more accurate portrayal of the West and how it was won. I wouldn't have lasted long in the wild west. Terrific film for some but not all movie goers"
    },
    {
      "rating": "2",
      "text": "The acting by Bale and Pike was really good, however I hated this film.  The opening scene was fantastic and really drew you in, but it went on an increasingly downhill path from there.  Too many reaches and supposedly missed scenes to connect the characters together.  No flashbacks for Bale to show the horrors he went through. The landscape views were alright, but just not consistently as good as they should have been. There were so many pauses between lines I felt myself actually counting until someone spoke. I enjoyed all the actors but the script was lacking."
    },
    {
      "rating": "6",
      "text": "Elegantly made seemingly authentic western with a strong performance by Christian Bale is a simple classic kind of tale.  The only real problem is it's nothing new with the expected genre tropes delivering predictably in grand settings, so if it wasn't coming after over a 100 years of westerns and personally a lifetime of seeing them it would rate higher here (which brings up the question, do you account for that as a critic or just go with how it affects you?... I rate based on the impression on me only)."
    },
    {
      "rating": "9",
      "text": "Reminiscient of one of my all time favorites \"Dances with Wolves\"!! The performances by Christian Bale, Rosamund Pike, and Wes Studi are way over the top as well as others! The cinematography is great, but not quite as good as it was with the previous mentioned \"Dances wtih Wolves\", but still some breath taking scenes! The story is riveting and as myself had the whole audience glued to the screen, even at some of the quieter moments you could hear a pin drop. The stories dialouge at the onset was hard to follow at times, but once Captain Joseph Blocker had his orders to deliver his hated enemy Chief Yellow Hawk to his home the story quickened and never let you go on thier perilous journey across country. I found the relationships with the Captain's other fellow officers to be deep and well thought out, along with the deep seated history that they had experienced in the past with the so called hostiles. I can't give alway too much as I don't want to be a spoiler, but the story that unfolded following years of prejudice and hatred was one to remember as they all had to look deep into their souls! There are so many moments in the movie that will make you want to reflect on perhaps some of your own experiences. Kudo's to director Scott Cooper, the script, and actors for weaving this into a real gem. Wanted to give it a 10, but in the end I gave it a 9 due to some slow dialouge in the beginning, and a few slow spots that could have been edited or left behind. Still a very captivating and emotional movie certainly one not to miss on the big screen!!  One I want to experience again."
    },
    {
      "rating": "7",
      "text": "“Hostiles” stars Christian Bale and Rosamund Pike and was written and directed by Scott  Cooper. The film attempts to capture the reality of life in the late 19th Century west as did “Unforgiven” but, unlike the latter film, it fails to keep the interest of the viewer as this small group of soldiers, some native American prisoners and a settler/survivor make their way from New Mexico to Montana facing the never ending obstacles of weather, terrain, hostiles and outliers. The film is too long and lacks the substance needed to overcome what basically are scenes of campfires and trails with actors mostly mumbling insignificant dialogue. I give the film a 7.0 rating based mostly on the magnificent photographic work of cinema photographer Masanobu Takayanagi and the perhaps too understated but nevertheless fine acting of Mr. Bale."
    },
    {
      "rating": "7",
      "text": "Enjoyable film with better than average acting. Can't dispute the general overall rating. Don't understand the negative ratings but I seldom do. Not a blockbuster by any means but Christian Bale did a great portrayal of his character"
    },
    {
      "rating": "7",
      "text": "Hostiles is a very well made film. The screen time for each of the main characters was quite lengthy but I think intended for the audience to really feel the emotion of the characters and the situation. It was interesting all the way though, if not a little bit slow at some points."
    },
    {
      "rating": "8",
      "text": "A finely crafted Western which doesn't finch from portraying the horrors inflicted during that violent era and which boasts an astounding performance from Christian Bale"
    },
    {
      "rating": "7",
      "text": "In 1892, a legendary Army captain reluctantly agrees to escort a Cheyenne chief and his family through dangerous territory.HOSTILES full movie HD play.useehd.us"
    },
    {
      "rating": "6",
      "text": "Just saw this on Netflix. It's really ironic that Christian Bale played Batman, because as I was watching Hostiles, I kept thinking of a line from Deadpool 2, when Deadpool tells Cable during their fight: \"So dark...are you sure you're not from the DC universe?\"To say that film is a study in human misery would be an understatement, although I do think it it has some very good moments and a satisfying ending."
    },
    {
      "rating": "9",
      "text": "I think this movie offers some great insight into true hatred on both sides of a conflict. But it is about understanding out hatred so we can move on and reconcile in the future. I like how neither Christian Bale's character or the Native characters are good or evil. They are simply people, one just doing his job and the other who is caught in a horrific conflict. Great performances also by almost everyone and the cinematography is gorgeous. This movie makes me think and I believe it does a tremendous job."
    },
    {
      "rating": "0",
      "text": "Movie can be described in one word. Disappointing. Largely uneventful outside of a few small skirmishes. It has a strange twist as a western that dabbles in a social justice/ post modernist theory. It doesn’t work. Would not pay to watch."
    },
    {
      "rating": "2",
      "text": "christian bale is not Clint Eastwood, boring movie, most of the movie shot in dark,acted like trying to keep the audience from seeing good and bloody scenes.  I rate this best scene was opening, movie went down from there"
    },
    {
      "rating": "7",
      "text": "Liked the film.  Opening scene not very realistic.  Anybody living in a cabin, with walls as thick as trees and with six riders coming slowly at you in a broad open clearing, knows to stay in the cabin and pick them off one by one as they approach.  The scene was not well written, and likely left all audience members wondering just exactly how someone could survive long enough to build a cabin and have three children and behave as stupidly as this man did."
    },
    {
      "rating": "7",
      "text": "The acting was very good especially Christian Bale and the scenery was spectacular!  The attempt to show how horrific the Whites were toward the natives was noble but never could erase the opening horror scenes that Rosomond Pike's character had to experience.  The ending was a bit too contrived for my liking but overall a good movie."
    },
    {
      "rating": "1",
      "text": "I dont even know why I sat through this movie. I guess I hoped for more.Well, I dont want to make this too long, so here is the painful truth:Its just another PC infested movie, having to do nothing with reality or historical authenticity. The PC propaganda is so bad that at the end I felt like I just watched an old Wochenschau.Disgusting. And honestly I am really getting afraid of this trend. What the hell is going on with humanity right now? Its like were going backwards in history. Nobody learned from it."
    },
    {
      "rating": "6",
      "text": "Without saying the words Hostiles asks some pretty heavy questions about human behaviour during times of war and the subsequent trauma that comes from surviving such violent events. The idea of branding someone an enemy dehumanizing them as a justification of the violence you then inflict. This well produced film, much like its subject matter seems to thoughtfully question the intent of its characters. Despite this however something doesn't seem to gel in the films pacing and script. As a result we're left with an interesting yet pretty dreary and serious movie."
    },
    {
      "rating": "1",
      "text": "Un film traître et d’autant plus traître qu’il se présente sous des atours intelligents et relativement neutres : ni John Wayne, ni auto-flagellation ininterrompue avec la propagande anti-colonialiste bien connue qui plaît tant aux gauchistes de tous horizons…Mais ça, c’est au début et même durant un bon quart… non pas un quart d’heure mais un quart entier du film qui fait quasiment ses deux heure et quart en tout ! car passé ce quart, on a juste droit et ce jusqu’à la fin, à de la grosse propagande anti-colonialiste bien connue qui plaît tant aux gauchistes de tous horizons… ainsi qu’à de l’auto-flagellation ininterrompue : « nous les Américains, avons massacré les Amérindiens » etc, etc…Non pas que ce soit faux bien sûr mais il y eut des massacres dans les deux camps… comme le montre d’ailleurs le début du film. Un western bourré d’incohérences, tout cela pour se fondre dans le moule formaté du vivre_ensemble et du bisounoursisme neuneu : ainsi, ce capitaine particulièrement haineux et raciste qui a tué tant de « peaux rouges »… devient comme par magie un gentil bisounours prêt à tuer de bons Américains pour défendre les gentils Amérindiens ! une fausse « rédemption » pour un boucher pourtant connu et reconnu…Idem ou presque pour le rôle de Rosamund Pike, une cocotte traumatisée (par des Comanches pas gentils) mais qui devient selon le dogme SJW woke moderne une adepte du « vous n’aurez pas ma haine »… Hostiles est donc en définitive comme cet autre film ridicule, le fameux American History X, à savoir complètement aberrant, angéliste et wokiste à fond.Et pourtant la forme est réussie (bien que trop contemplative), la musique est planante (un peu soporifique quand même) et la photographie est superbe. Mais quelle lenteur par ailleurs… et tout ça pour nous noyer sous une litanie SJW !"
    },
    {
      "rating": "7",
      "text": "Gruesome, brutal and shocking. A strong stomach is required as this movie will test how much missery you can take from watching a movie.In 1892, a Union captain with a track record of killing many indians and having a serious hate towards them, is tasked with bringing a dying chief to his sacred burial land. Even though the captain objects fiercely, he will bring the chief and his family to the Valley of the Bears in Montana. On the way there the group will suffer many obstacles and brutality, eventually culminating into a redemption arc for the captain.The story of the movie is interesting, and while being very gruesome it will keep you entertained. Watching the movie i got quite confused who was the biggest culprit of violence: The indians, or the colonists? The movie itself seems to lean towards the colonists. As for negatives, the slow pacing of the movie will test your patience. For some reason the movie is incredibely muted, forcing me to turn up the volume of my tv 3 fold.The acting is convincing, and so are the overgrown moustaches. Although the movie doesn't have a good ending, the redemption arc itself brings joy as you watch the movie. I give this movie a 7/10."
    },
    {
      "rating": "7",
      "text": "Excellent true as it was of the time depicting Native Americans not as the scourge, rather those having imprisoned their way of life thus producing the downfall of the West before it even had a chance."
    },
    {
      "rating": "6",
      "text": "This movie feels a bit empty(?), I don't know, there isn't that much going on, but not in a slow-burn or a \"chill-and-enjoy-the-ride\" kind of way, it feels more like a drag, even if the actors play their roles incredibly well. It's a good drama/western still, I just wished that there would've been less dragging out of screen-time."
    },
    {
      "rating": "8",
      "text": "I just watched Hostiles I really like this movie Christian Bale Is the best in this movie also Rosamund Pike is also good in this movie I like this movie the cons in this movie the plot is not the best Ben foster character betrays them only problems there also I do like movies based on Real Story Those are my cup of tea When this movie has emotional moments it does hit there is not a lot to say all the characters I like this movie is Violent All round Hostiles Is based on a real story with all the characters u will like All round I give Hostiles B"
    },
    {
      "rating": "7",
      "text": "The scenery/visuals on my TV were spectacular...think Dances with Wolves.  C. Bale was great as usual.  Overall the story was OK and the movie gets a 7 from me because it is worth the watch but not a must-see."
    },
    {
      "rating": "5",
      "text": "Bit of a snore with beautiful cinematography but bland characters and a rote story."
    }
  ],
  "recommendations": [
    "the_eagle",
    "13_hours_the_secret_soldiers_of_benghazi",
    "the_last_duel",
    "allied",
    "wind_river",
    "the_deer_hunter",
    "patriots_day",
    "valkyrie",
    "blood_diamond",
    "lone_survivor",
    "hotel_rwanda",
    "12_strong",
    "free_state_of_jones",
    "master_and_commander_the_far_side_of_the_world",
    "the_good_shepherd",
    "beirut",
    "unbroken",
    "the_lost_city_of_z",
    "only_the_brave",
    "12_years_a_slave",
    "everest",
    "zero_dark_thirty",
    "sin_nombre",
    "deepwater_horizon",
    "no_country_for_old_men"
  ]
}