{
  "id": 135,
  "title": "Host",
  "starring": [
    "Haley Bishop",
    "Jemma Moore"
  ],
  "runtime": 57,
  "genre": [
    "Horror",
    "Thriller",
    "Mystery"
  ],
  "description": "Six friends hire a medium to hold a séance via Zoom during lockdown — but they get far more than they bargained for as things quickly go wrong. When an evil spirit starts invading their homes, they begin to realize they might not survive the night.",
  "releaseYear": "2020",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/h7dZpJDORYs5c56dydbrLFkEXpE.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 4.0,
    "ending": 2.0,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 4.0,
    "funny": 2.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Host is an enjoyable horror flick that seems cliched, and it definitely is, but with some novelties. The Zoom meeting part is attractive plus topical, and makes the whole viewing more delightful if you can relate with it. It's the usual story where a group of unsuspecting friends get together on an online call to hold seance and things go wrong. Just about an hour long (in line with Zoom's 40-minute free call version) and worth the watch. It won't disappoint. TN."
    },
    {
      "rating": "5",
      "text": "Nada del otro mundo, lo único bueno es que dura 56 minutos, tiene el estilo visual de Eliminar Amigo y Searching, pero no aporta nada en particular al género."
    },
    {
      "rating": "8",
      "text": "More relevant than the South Park Pandemic Special, this live-stream horror flick via Zoom is original and crafty, and an easy watch clocking in just under 60 minutes."
    },
    {
      "rating": "2",
      "text": "Well then, I guess the glitch didn't just typed.So 'Host' is a horror \"movie\" that was filmed entirely using Zoom during the COVID-19 lockdown. Some spooky stuff happens with a demotic demon and one by one everybody is killed off. It's like 'Unfriended’ but Zoom. There's also 2018 'Searching' starring John Cho, even though that isn't a horror movie. Basically, this concept of the whole movie taking place on a laptop or any online chat site isn't anything new. 'Host' doesn't add anything new to this concept and instead plays on predicable scares with no imagination behind it.This feels like one of those \"we need to get a movie out that's relevant with references to the outside world like masks, Covid, Zoom, etc.\" Zero artistic integrity, just boring and poorly put together. Just because its topical doesn't mean it's good.I thought it was poorly acted, as I didn't fully believe them as the characters. They don't talk or act like real people. It was just so awkward and unnatural, especially at the beginning which was so painful to sit through.The movie felt like a waste of time, despite the movie being 57 minutes long. I mean this is barely a movie. What's more insulting is that they added a seven-minute actual Zoom call with the cast and crew doing a seance, because I guess they wanted to pad out the runtime so it's feature length. Man **** this movie. The more I write and let things sink in, the angrier I'm getting.There was literally a scene when a demon throws a beer bottle at someone's head and it was so unintentionally hilarious that it came off as slapstick. I also noticed one of the actor’s broke character at one point when one of sneeze during a serious and scary moment; I could see them holding back laughter before going back into scared and upset mood. It was so bad.The only positive thing I can say about this piece of **** is that at least it's short, even if it does end on a final jump scare, because we all know that great horror movies end like that.I wish my Zoom calls were as eventful as this."
    },
    {
      "rating": "6",
      "text": "Top marks to the director for technical ability. Apparently all this was done remotely with the actors directing the camera and stunts. Story, depth, scare factor ...etc doesn’t leave a strong impression"
    },
    {
      "rating": "3",
      "text": "Se você espera algo criativo, que aprecie sua inteligencia, ou até mesmo uma nova abordagem do terror padrão cinema pipoca, passe longe daqui.A obra começa bem, incluindo elementos que aumentam a verossimilhança com o universo pandêmico que eles também vivem, fora algumas referencias que foram bem vindas. O maior problema começa com a abordagem do perigo. Como eu disse acima, se espera algo a mais que um terror pipoca, vai se decepcionar. Este longa pega conceitos super estabelecidos e os põe numa abordagem digital. Bem, isso já foi feito antes em alguns filmes, como unfriended, e aqui não há nada de novo.Há quem se divirta com demônios assustando - sem motivo aparente - adultos com a idade mental de 5 anos, mas alguém tem de esperar algo desses filmes. Não há um desenvolvimento sobre o enredo, é apenas um certo tipo de ritual que deu errado, jump scares e jovens morrendo. Apesar de haver uma tensão, por conta do cenário escuro e uso excessivo de jump scare's, o suspense não é real pois não há atmosfera nem um desenvolvimento que leve a isso.  Depois de um tempo deixamos de levar a serio e fica por isso mesmo. A previsibilidade ajuda muito a apreensão é por água abaixo. Há diversos clichês e nenhum deles vai te pegar de surpresa for real."
    },
    {
      "rating": "0",
      "text": "If you watched Unfriended 1 & 2,maybe you don't need this one... I don't know if the director wanted another Unfriended movie by himself,or just was inspired... ALLAAH KNOWS BEST AND MAY HE FORGIVE ME FOR CRITICISING...."
    },
    {
      "rating": "9",
      "text": "Fantastic horror movie that kept me jumping and my nerves wracked. Highly recommend."
    },
    {
      "rating": "3",
      "text": "Overrated. REALLY overrated. Zoom-based horror for 13 year olds girls. Not sure why this recieved any praise. Can you say \"wack\"?"
    },
    {
      "rating": "8",
      "text": "An extremely fun and entertaining horror movie which shows the potential of desktop movies."
    },
    {
      "rating": "7",
      "text": "Group of Brits have a lockdown Zoom séance where they all get killed by something because the Chinese girl wasn't taking it seriously in the first place."
    },
    {
      "rating": "8",
      "text": "Innovative horror not that scary but still fun to watch one of the best of 2020"
    },
    {
      "rating": "4",
      "text": "The high praise this film has received is really the perfect reflection on what an awful year 2020 was for the movie industry. Literally a regurgitation of Unfriended and other films of that kind (social media call based). Just because it mentions covid and it's relevant to our current situation doesn't make it a good film. Minimal scares and when they do occur in its extremely short run time of 56 minutes  they are very predictable jump scares. Not for me, no discredit to the people who worked on this film, I just believe its current reviews have ballooned expectations"
    },
    {
      "rating": "7",
      "text": "It may be nothing new in Host, but it's presented in such an effective and entertaining way that this film has its own charm."
    }
  ],
  "recommendations": [
    "unfriended",
    "chernobyl_diaries",
    "insidious",
    "paranormal_activity_the_marked_ones",
    "the_blair_witch_project",
    "paranormal_activity",
    "the_pyramid",
    "paranormal_activity_4",
    "paranormal_activity_2",
    "malignant",
    "the_host",
    "the_medium",
    "paranormal_activity_3",
    "the_curse_of_la_llorona",
    "countdown",
    "midsommar",
    "the_devil_inside",
    "unfriended_dark_web",
    "bird_box",
    "the_possession",
    "hereditary",
    "dark_skies",
    "blair_witch",
    "cloverfield",
    "the_haunting_in_connecticut"
  ]
}