{
  "id": 4888,
  "title": "Hostage",
  "starring": [
    "Bruce Willis",
    "Ben Foster"
  ],
  "runtime": 113,
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "description": "When a mafia accountant is taken hostage on his beat, a police officer – wracked by guilt from a prior stint as a negotiator – must negotiate the standoff, even as his own family is held captive by the mob.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vjhLmtjO2pMQXRgkxcwZoq2Ma8n.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 7.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.25
  },
  "reviews": [
    {
      "rating": "5",
      "text": "I was looking forward to viewing this movie because it was based on a novel by Robert Crais who I admire as a mystery writer. Needless to say, it was too much over the top with special effects and way too long."
    },
    {
      "rating": "7",
      "text": "This is such a great action packed movie with a great deal of suspense, good acting, and an overall decent plot. Pay no attention to the horrible review that the good for nothing critics gave this movie."
    },
    {
      "rating": "7",
      "text": "The acting was not that bad, the visuals were okay and overall the movie was entertaining.If you are looking for a big movie with a lot of action you will probably be disappointed but it stays a good movie."
    },
    {
      "rating": "6",
      "text": "'Hostage' isn't a great movie, but whenever it gets nasty and brutal, it doesn't hold back, especially the opening scene.When Bruce Willis cares, he can actually deliver a great performance."
    },
    {
      "rating": "10",
      "text": "This movie is very interesting. It starts a simple hostage situation and it gets more complex and more thrilling than most movies. It has suspense all the way and keeps wanting to see how everything will end. Its a great experience and thats all that matters!."
    },
    {
      "rating": "5",
      "text": "This film is really difficult to judge. The film itself is a good old fashioned Bruce Willis action movie. But and it's a big BUT the novel it is based on by Robert Crais is one of the best crime thriller books ever written and the movie decided to pick parts of the story to follow and not always the best parts i.e. the discovery in MARS home which is not in the film."
    },
    {
      "rating": "6",
      "text": "Quand un petit Français s'en va filmer à Hollywood, on peut souvent s'attendre au pire mais si Florent Siri  délivre un thriller qui satisfait ici les préceptes très stricts du genre outre-atlantique, il parvient à garder sa touche personnelle, notamment sa mise en scène très soignée et agréable et ce, malgré ou en dépit de Bruce Willis...Ce bon vieux Bruce très crispant d'habitude et qui s'avère néanmoins tout-à-fait supportable dans le cas qui nous occupe. Il reste bien sûr énervant par son sur-jeu omniprésent mais sur-joue un peu moins que de coutume et ne balance aucune \"joke\" : sérieux, le Bruce.Le scénario est assez malin avec son double enlèvement et laisse augurer quelque chose d'intéressant... pour mieux nous décevoir ensuite avec sa ribambelle d'invraisemblances et de rebondissements à  la noix. Hélas, le thriller américain est coutumier du fait, usant et abusant de grosses ficelles et de ses clichés vus et revus dans toute prise d'otages, et à cet égard le réalisateur français ne peut rien y faire. Malgré toutes ses énormités, le film reste bien mené et distrayant... à condition encore une fois de mettre de côté tout espoir de crédibilité."
    },
    {
      "rating": "8",
      "text": "⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡¡☆¡☆¡☆¡☆¡☆¡☆¡☆¡☆¡☆¡☆¡☆¡☆¡◇¡◇¡◇¡◇¡◇¡◇¡¡◇¡◇¡◇¡"
    }
  ],
  "recommendations": [
    "shooter",
    "street_kings",
    "the_equalizer",
    "sherlock_holmes_a_game_of_shadows",
    "den_of_thieves",
    "orphan_first_kill",
    "the_bank_job",
    "contraband",
    "a_walk_among_the_tombstones",
    "the_italian_job",
    "the_mechanic",
    "gangster_squad",
    "inside_man",
    "wrath_of_man",
    "copshop",
    "the_suicide_squad",
    "triple_frontier",
    "blood_father",
    "16_blocks",
    "the_losers",
    "escape_plan",
    "kingsman_the_secret_service",
    "first_blood",
    "sherlock_holmes",
    "jack_reacher"
  ]
}