{
  "id": 1814,
  "title": "Hostel",
  "starring": [
    "Jay Hernandez",
    "Barbara Nedeljakova"
  ],
  "runtime": 94,
  "genre": [
    "Horror"
  ],
  "description": "Three backpackers head to a Slovakian city that promises to meet their hedonistic expectations, with no idea of the hell that awaits them.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dDrtuWUKhgUGp12kgUWuP0NpTdF.jpg",
  "categories": {
    "plot": 3.5357142857142856,
    "acting": 4.5,
    "ending": 5.8,
    "soundtrack": 4.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 6.5,
    "action": 6.2
  },
  "reviews": [
    {
      "rating": "0",
      "text": "One of the the worst movies I have ever seen. I think i was watching a stupid teenage trip movie that went wrong and had added gore for fun. It is the standard gory movie with the stupidest characters who set themselves up to be killed with one person making it out alive."
    },
    {
      "rating": "3",
      "text": "this moive is not scary at all it just freakin nasty it is very boring it has no suspense.You already know whats going to happen before it happens now can u tell me how lame it that?"
    },
    {
      "rating": "6",
      "text": "This movie Hostel scare me enough when I was at the hostel for a trip. zzzzzzzzz"
    },
    {
      "rating": "0",
      "text": "This movie... doesn't exist. It is probably the least creative movie I've ever seen. It's really mentally grathing and slow, and it may not be the worst movie I've ever seen, but it's pretty close. I know it's not about shock and more about gross out scares, but you can't really be grossed out too much if you're not immersed in the movie (maybe the infamouse \"eyegasm\", but nothing else), and this movie does nothing interesting to help itself. What little story there is the most cliched I've ever heard. I'd like to dig more deeply into it, but there is nothing there to dig into. All you have to know is that people get tortured while the audience wonders what's so great about it. This may not be a part of a genre I like, but a truely good movie could suck you in regardless of the genre. Not to get off track or anything, but a good example is, Pulp Fiction. It is listed under \"crime\", \"drama\", \"suspence\", and \"comedy\" all at once, but you don't think \"hey, I'm watching a crime/drama/suspence/comedy\", you just think \"hey, I'm watching a movie\". Hostel is so cliched that it seems like a genre template and nothing else. I read the user reviews of people who liked it in case I missed something, but the argument of \"saterizing the audiences lust for pain\" could be said for any movie in the genre. Bottom line: you can't have a gross-out movie without the \"movie\" part. I was grossed out when i stepped in dog poop, but that doesn't make it the apitamy of cinema."
    },
    {
      "rating": "2",
      "text": "Let me say to start that I am NOT the target audience for this movie. This moive is more for the gore for the sake of gore crowd, anyone else watching this movie has chosen to punish themselves. This movie has no higher purpose, no greater wisdom, no real story. Hack and slash, hack and slash."
    },
    {
      "rating": "6",
      "text": "Solid acting and incredibly gory. What I love most about this movie is that it proves that Americans can still make gruesome horror movies. Eli Roth is on his way to become the next great horror film director."
    },
    {
      "rating": "7",
      "text": "In Hostel, two American college students go traveling across Europe. On the train they hear about a hostel in Slovakia that attracts lots of girls, so naturally they head there. Unbeknownst to them, the hostel is run by a group who mercenaries who kidnap tourists and sell them to rich people to torture for kicks. While the situation is a nightmare, the story really isn't that scary. It's bloody and very gory, but it's not going to keep you up at night. It was a good movie, I like blood and guts, but that's not how it was advertised! This was advertised as being one of the scariest movies ever and it just wasn't. If you're a horror fan, it's defiantly worth seeing, but be warned, it's more about shock and awe than it is scary."
    },
    {
      "rating": "7",
      "text": "While the first 45 minutes of \"Hostel\" are overly boring and slow, the story (and blood) really pick up quickly, and it becomes very dark and entertaining. If you can get past the first half of the movie, I'd recommend it."
    },
    {
      "rating": "6",
      "text": "This film actually has the power to impress when it comes to gore, but lacks the movie story to be complete, I still do not know what the true meaning of the tattoo used in the film. And I still do not know anyone who founded the empire of murder. I just to know who the leader is behind all this, but not the purpose. As already mentioned, the film is good in the gore category, but just as impressive film images, but as a good movie needs a good story I'm going to grade 6 for the lack of story that could make this film much more interesting"
    },
    {
      "rating": "8",
      "text": "The first in a three-part trilogy that I really enjoy despite it being rather messed up! It's a torture film so some of it is rather hard to stomach, but you're on Paxton  Josh's side and you hope they can escape! There is a nice blend of gore as well as some good thrills in there with some great acting from the leads. I probably enjoyed the next two installments a little better, but this was the start of a great series. Overall a great Horror that won't be easy for all to stomach!"
    },
    {
      "rating": "9",
      "text": "Hostel is the first torture porn horror that scared me and disturbed me, it is funny and entertaining, but with a build up that people will criticize on, I think that such movies should have such executions, because if the climax starts from the beginning, you will be bored half through the movie. Albeit that the story needs more explanation, it terrifies indeed. The acting is good as far as a horror movie go, it is better than other horror movies. The action sequences are will done, they are intense, and the plot is interesting, it is a really great horror movies, that will scare and terrify, almost anyone."
    },
    {
      "rating": "8",
      "text": "This movie will keep American tourists from ever visiting Slovakia.\r It has a slow, dull start in Amsterdam (where the inhabitants speak German instead of Dutch) and it's only once our American friends start their train trip to Slovakia that things get interesting.\r The whole setting in the hostel is very nice, the sexy girls are there to seduce horny boys and lead them to hell. The receptionist is a creepy nerd who keeps saying things like \"Americans? Cool! Party yes? Why not!\"\r The way that Eli Roth portrays a village in Eastern Europe can be seen as slightly racist, but in the end it creates a very nice modern, spooky fairy tale feeling. They boys are far from home, and in here there are other rules at stake than they are used to."
    },
    {
      "rating": "7",
      "text": "For a horror/slasher film I found the movie overall enjoyable. I think there was a sufficient balance of action/gore as there was plot development. I always like having the experience of being able to route for the main character. I think it's important however that the main character remains to have plausible actions that don't have the reality of the film becoming out of reach or \"too unrealistic\". Overall pleasantly surprised with the quality of Hostel and am definitely going to check out Hostel II."
    },
    {
      "rating": "4",
      "text": "I don't know why Hostel movie is well praised by the audience. I watched the movie after hearing and reading audience reviews but I think audience was wrong this time.The atmosphere of movie is frightening but the idea of being drugged, kidnapped, tortured, and killed by people who are paying to do it wasn't executed properly. In starting, movie looks like tour comedy like Hangover. Then movie turns into psychological torture movie and then into survival movie. The director wasn't able to blend all these qualities properly. The movie jumped from one thing to another so badly that you can't feel any emotions.The music was terrible. Movie like this needs a good background music that helps to create spooky environment but sound team did nothing good to contribute in the movie. The acting was bad, you can't connect with any of the character.Overall, would ask you to not watch this movie unless you think it looks cool to tell others that you have watched Hostel movie."
    },
    {
      "rating": "7",
      "text": "There's a subgenre of horror known as \"torture porn.\" Popularized by the likes of the Saw series, these kinds of scary flicks are known for their emphasis on gore and extreme violence. The whole idea is for the audience to either be horrified or excited by graphic displays of gruesome deaths. Hostel is one of the more well-known torture porn horror films, and a result has a sort of stigmata attached to it. For the life of me though I can't quite tell why. For the majority of it's running time it's more a raunchy sex-comedy than a horror film. Despite having Eli Roth in both the director's and writer's chair, the movie is more tame than one might expect what with Roth's reputation and all.Two obnoxious college students and one weird drifter set off backpacking around foreign countries in search of sex. Their quest for orgasms leads them to a small town where the word on the street is that the women are hot, horny, and love men from other countries. The movie starts off just following these guys around as they party, screw, and act like dumb sex-obsessed men. Expect plenty of nudity and f-bombs, as well as those weird moments I've noticed a lot of in Eli Roth movies that don't really make any sense until they become surprisingly important to the plot later on. From there it's a weird, confusing slog through the middle until things finally ramp up again.What's most surprising about the movie is that it's not actually very gory. At least not in the way you would think. In fact most of the nasty and violent takes place off-screen. Roth pulls his punches in ways you really wouldn't expect. I'm not sure if it's because of a lack of budget or just that he didn't have the stomach when it finally came down to it, but there's only one really nasty moment in the film. Whether or not that's a good thing just comes to down to your tastes. The actual torture is brief and muted. The majority of the action comes down to a game of cat-and-mouse as we watch Jay Hernandez try to escape with his life. There's blood along the way, but this is a surprisingly tame torture porn flick.There are some clever moments in Hostel and one heck of a satisfying ending. It's pretty fun to watch the douchebags get punished for being douchebags, and there is some surprising violence along the way. The movie also isn't shy on throwing some gorgeous bare bodies onscreen as well. You're going to have to put up with some frat boy humor and a dull mid-section, but by far the most disappointing aspect of the film is that Eli Roth never takes us back to those 70's era exploitation film levels of gratuity that he's so well-known for. It may make things more watchable than they otherwise would have been, but despite easier on the eyes and stomach, there's no denying it's the one thing holding Hostel back from being something truly noteworthy. At least it's still entertaining."
    },
    {
      "rating": "10",
      "text": "Hostel: 10 out of 10: Half Eurotrip style sex comedy (with a seventies level of nudity) and half the doctor scene from Bloodsucking Freaks, yeah I might as well stop my review right there it's a 10.\r Director Eli Roth (Cabin Fever) has scored a bull's eye simply by going back to what makes exploitation films great. Thus he produces a film that could have been lensed in the freewheeling year of 1975 rather than PG-13 stuffy year of 2005.\r The film starts with two American college students and an Icelandic hanger on enjoying some debauchery in Amsterdam. They hear about a nirvana for sex and drugs in Slovakia and they pursue it as if they were traversing the Himalayas to find Shangri-La.\r What they find is,,,, well I won't spoil it for you but they should have stuck with the marijuana brownies and overpriced Dutch hookers.\r The movie actually makes torture scenes enjoyable again. (I generally have hated the whole torture motif in modern film for example Rest Stop.) Roth unlike his contemporaries shows the gore without those annoying zooming camera tricks. The leads are unlikable in a fun rather than irritating way (not easy to do) and the film has both a wonderful energy and plentiful surprises.\r Oh and there is copious amounts of extremely well done gratuitous nudity and sadistic gore. One of the best films of 2005."
    },
    {
      "rating": "10",
      "text": "An ironic well-made gory film, has what you wanted, gore, jokes and is sexy, the performances are OK I think they should have improved more, you can notice the effects and the make up sometimes, but anyway is a good movie."
    },
    {
      "rating": "4",
      "text": "The film is effective at giving you creeps with its gory scenes, but the film took quite a long time to get going. Ultimately, the film is a disappointment. If you're interested in this type of genre, I would recommend you to check out the first three movies in the \"Saw\" series."
    },
    {
      "rating": "6",
      "text": "It's no Cabin Fever, but it's gross as hell, and it takes exploitation horror about as far as it can possibly go."
    },
    {
      "rating": "5",
      "text": "For its first hour, 'Hostel' plays out as some sort of soft core porno, before turning into a mildly exciting (albeit grisly) thriller for its last half."
    },
    {
      "rating": "7",
      "text": "A estas alturas es un clásico de culto, los personajes son bastante imbéciles, pero todo el gore en pantalla es genial."
    },
    {
      "rating": "1",
      "text": "I'm in no way the target audience for this movie, yet I watched it anyway, and I didn't have to see a girl get her eye cut off, but I did anyway. I get to make a lot of jokes about the movie being ridiculously bad now after watching it so that at least gets it a 1."
    },
    {
      "rating": "2",
      "text": "I saw this movie a few years ago but it's one of those movies that you can hardly forget. I love horror movies, but I'm more afraid of what is cleverly suggested than with what I see explicitly. So this movie is not the kind of movie I prefer. The action revolves around a group of three North American travelers who are making the traditional backpacking trip to Europe that immense teenagers or pre-university students do. The recipe is the usual: drink, testosterone, little brain and huge desire for sex and light drugs. They go to Slovakia, where they are looking for a hostel, advertised as the ideal place to find all this, but they end up wrapping themselves in a criminal and dangerous web where they are the flies. From here, the film is basically a torture session capable of making the Spanish inquisitors want to take notes in a notepad.We can then understand that the most serious problem of this film is the absence of a credible and well-constructed story behind the horror scenes. The script is built on gore, graphic violence is an end in itself. Another problem, a direct consequence of this, is the poor construction of the characters, who are just stupid teenagers who deserve to die in the film because the public does not care about them. Never mind the names of the actors. There are no sounding names, they would not risk their career in such a movie. They are meat to the slaughter. Eli Roth, the director / screenwriter, must have a distorted conception of what horror movies are but, in any case, the film has a specific audience and Roth was entirely capable of meeting their expectations. Special and visual effects are a fundamental part of the most soulless scenes and were done with great attention to detail.This is a movie inappropriate for popcorn, as I say, for joke. It is sadistic and shocking, arresting public attention for explicit violence. It is not a movie that is suitable for most people. They would think it is too visual, too disgusting to bear. But fans of gore and pure and tough violence will love it."
    },
    {
      "rating": "5",
      "text": "Hostel starts subtly with a bunch of friends who wanted to have fun with pretty girls and so they go to Slovakia. That's where all the stuff starts happening. Of course, we wait quite a bit before those things start happening. Slower pace. Once things start happening later on, like I wouldn't say it's worth the wait, but it was definitely satisfying. There were some more delicious scenes, so at least there was that. The plot itself is pretty much nothing, and overall, for me, it's a mediocre movie that I don't recommend."
    },
    {
      "rating": "0",
      "text": "Beyond disappointing. Made this account just to say so. If you're looking for gratuitous, yet underwhelming, violence against women and some of the most tame \"torture\" scenes, then this is for you. Otherwise, do yourself a favor and rewatch Saw."
    },
    {
      "rating": "3",
      "text": "Was not scary at all!!"
    },
    {
      "rating": "4",
      "text": "Not scary enough. Not as gory as some say. I saw unraTED VERSION btw. Just flinched twice in the whole movie. One during the removing a finger from the legs of a woman and during cutting of an eyeball scene if you know what I mean. Roth needs to seriously do something different or else his Hostel series will become just another Saw series except the fact thatS aw 1 is intelligent while Hostel which had a good premise is not!"
    },
    {
      "rating": "9",
      "text": "Pretty solid movie, could've used more Charlize Theron though. One sex scene is never enough for me. The kids were priceless."
    },
    {
      "rating": "1",
      "text": "It's a pretty pathetic plot line with little or no back story. The movie is not all deep, with only scenes that will shock the audience. The first half is a glorified porno, while the last 45 minutes are made as groteskly as possible. If you like movies with no plot and horrible lines this Hostel was made for you."
    },
    {
      "rating": "10",
      "text": "Some may call hostel a gratuitous and overall difficult to watch movie. They"
    },
    {
      "rating": "0",
      "text": "Very disturbing and degrating movie towards women. Definitely not a date movie. The gore aspect was just too much they showed peoples faces being burned with blow torches. It sucked."
    },
    {
      "rating": "0",
      "text": "A movie made for juvenile teenagers [Ed: uhhh..]. With the garbage currently playing it should do well at the box office. But the truth is it is pretty bad. Move over Mr. Jackson, Mr. Q has joined you as a one-trick pony. Avoid."
    },
    {
      "rating": "8",
      "text": "This movie was not scary, but fun to watch, if you enjoy gore, blood, severed limbs, and that type of stuff. The first part of the movie had me laughing like crazy, I thought it was a comedy; then it just took a turn down the gore road. Excellent for people with a dark sense of humor...go see it if you want some nasty fun at the movies."
    },
    {
      "rating": "8",
      "text": "I thought it was a thoroughly entertaining movie. It's not for the squeemish, I'm glad I left my wife at home! I never would've heard the end of it! This movie is only going to appeal to a certain group of people. It doesn't surprise me that it's been getting mixed reviews. I loved the movie, it made me squirm in my seat and yell explitives at the screen! I know I wasn't alone, the rest of the theater was right there with me. Definitely adding this one to my already pretty twisted dvd collection!"
    },
    {
      "rating": "2",
      "text": "I was disappointed in Quentin Tarantino for turning out this film. The overall theme of the moview was sex, drugs, and gore. The plot played out in a manner where there were no surprises. I didn't like it. We were waiting outside the theater as the first show let out and most of the people were commenting that it was just stupid and disappointing. We should have listened to them an had chosen a different movie to watch."
    },
    {
      "rating": "9",
      "text": "Eli Roth is a brilliant director with a lot of potential, I would not mind seeing a full length rotten fruit feature. Hostel provides the gore, the women, the drugs, and boatloads of endless laughter. The kids in this movie are priceless."
    },
    {
      "rating": "2",
      "text": "The first hour was Eurotrip, of which I'm not a fan. The second hour, for about 5 minutes, gave the impression that it might do okay. But no, somehow Roth managed to take one of the best original plots of the year and completely screw it up. The score was absolutely terrible, the movie seemed like a joke. I was so disappointed, you willl be too. Avoid this."
    },
    {
      "rating": "10",
      "text": "Good"
    },
    {
      "rating": "8",
      "text": "I find it funny that people saw the trailer, expected more than just \"another horror film\", got exactly that, and then complain. People are very amusing. Eli Roth did what he did with Cabin Fever, in that he took a very common horror tale and developed it in a unique manner. Even hints of social commentary (terrorists torture tapes have been rather hot lately, rich people \"doing what they will\" with people less fortunate, and people being taken advantage of by their naive desires, etc.) And to those ragging on Quentin...rag on Eli, he made the movie. Quentin put up the money. Of course they're using Quentin's name in bold letters to get more people to see it, it worked didn't it?"
    },
    {
      "rating": "10",
      "text": "It was my wife's birthday and the only thing she wanted to do was see Hostel. We went and had a nice romantic evening. Awesome date movie! Made us crave Chicken McNuggets, which we got afterwards."
    },
    {
      "rating": "0",
      "text": "It's early in 2006, but I can't see anything topping this piece of garbage for the \"worst movie of the year\" award. You know how in some horror movies they introduce some mindless inane characters at the beginning and kill them off quickly to give you a taste of whats to come, and then introduce you to the real main characters? In Hostel, the mindless inane characters are the main characters... total disappointment. I was almost happy to watch them get killed off. Everything about this movie is awful. Watching this movie was way more torture than any of the characters experienced. Don't waste a penny of your hard-earned cash on this piece of crap."
    },
    {
      "rating": "1",
      "text": "So this is supposedly one of the most vicious and goriest films ever if you believe the front cover. Well don't because this is neither, the film doesnt know what to be, is it a spoof, is it horror? no its basically utter garbage and doesnt work on any level. The characters to begin with are so annoying and one dimensional that as the viewer you couldnt care less what happened to them and this is the big problem here, the tension never gets going, the gore becomes laughable, basically this sucks big time ! Please Eli Roth go back to your day job!"
    },
    {
      "rating": "2",
      "text": "It is surprising that \"Hostel\" was advertised as a particularly shocking horror film; it turns out to be standard horror fare: it is boring, fairly gory, and has no plot whatsoever. And, of course, it is not scary. Its only merit is that, although it is sharply degrading (especially toward women and children), it is not as offensive as its preposterous sequel."
    },
    {
      "rating": "0",
      "text": "If you're going to put all your eggs in one basket, it should be a pretty gory basket... gorier than a few chopped-off fingers and a cheesy hanging eyeball. I would've given this a 1 if the obnoxious main character had been tortured and killed."
    },
    {
      "rating": "8",
      "text": "Hostel is a neat little revenge flick, and it's obviously not for the squeamish. If you can stand the graphic torture scenes, you might find yourself cheering for both the survivor and yourself--as if you, too, had survived a truly sickening ordeal. Roth does, however, make the movie a little easier to sit through by adding memorable bits of humor and gratuitous sex and nudity. Hostel delivers exactly what the trailer promises--an interesting premise, lots o' blood, and plenty of screams--and it has some fun doing it. I give it an 8."
    },
    {
      "rating": "9",
      "text": "Wow, an 80's teenage T&A movie that turns into a gore-fest in the middle! Shame on all of you who gave this low scores! I haven't seen something this quirky since From Dusk Till Dawn."
    },
    {
      "rating": "1",
      "text": "One of the worst movies I've ever seen. There's over the top, and then there's Hostel. It starts out as a badly scripted (and acted) teenage Eurotrip-style movie: gratuitous sex and nudity, copious amounts of pot-smoking, and the word \"dude\" said every 2 lines. Then it becomes an assault on the senses with absolutely brutal and depraved torture scenes. You do NOT go to this movie if you want a nice night out - this is not entertainment. And any Slovakians out there will most likely be appalled at how their country (and Europe in general) is portrayed. I don't know what to call this movie: a psychological thriller perhaps? It's not a traditional horror movie, as it doesn't \"scare\" you, it just makes you want to leave the theatre. Absolutely brutal in every sense of the word."
    },
    {
      "rating": "10",
      "text": "For everyone who didn"
    },
    {
      "rating": "10",
      "text": "This movie is well made and directed. It is graphic, so be forewarned. It has a plot, though, and despite no-name actors, the acting is pretty good. I had no complaints. It's not a date movie, unless you both like 'Reservoir Dogs' or something. I gave it a ten because it was done on a low budget with well-made gory effects courtesy of Tarantino and the other Director."
    },
    {
      "rating": "0",
      "text": "A very poorly made teeny-bopper shocker film. Misleading in that Trantino is just a producer of the film (it's obviously been hinted that he is more than that) and that it's somehow shocking when it's just another \"hack-em up try and gross out the audience\" film among many that seem to be coming out of the woodwork lately. Nothing new, surprising or otherwise interesing in this film. Acting is terrible and the story is ho hum. Don't bother spening your 10 bucks on this one."
    }
  ]
}