{"id": 1354, "title": "Hostel: Part II", "starring": ["Lauren German", "Heather Matarazzo"], "runtime": 93, "genre": ["Horror"], "description": "Three American college students studying abroad are lured to a Slovakian hostel, and discover the grim reality behind it.", "releaseYear": "2007", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/qB20aiY8Ah3pQikkBxm3j7jQVc8.jpg", "categories": {"plot": 4.2272727272727275, "acting": 4.3125, "ending": 4.176470588235294, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.555555555555555, "action": 7.5}, "reviews": [{"rating": "3", "text": "Its story is almost irrelevant, its caracters are empty and repelling and its attempt to live up to the original is an utter failure"}, {"rating": "8", "text": "I thought it was pretty great and am mystified by the negative reviews (how on earth are the Saw films better in any single way!!!) Definitely not as gory or as relentless as the first, which I found refreshing. It has a well crafted script that takes a more objective look at the \"elite hunting\" club. I feel like many people made their minds up before watching and/or have some weird hate towards Eli Roth. It's probably not my favorite of his films, but it's probably his best written script and possibly his best directed."}, {"rating": "1", "text": "Hostel II is a horror movie that bases itself on blood, gore and nudity and it fails on every level. It's a depressing mess and this film is a torture to watch and a horrible viewing experience. It fails as a horror and even with all the gore it still fails. A crap, horrible, dull, rubbish, depressing and boring movie."}, {"rating": "0", "text": "\"Hostel: Part II\" is truly a horror film; that Eli Roth could manage to make filthier garbage than the first \"Hostel\" is genuinely frightening. Where the first film adhered to at least a few (not many) concepts of logic and structure, the sequel devolves into a putrid frenzy of child murder, flesh-eating animals, and endless dismemberment. Adding to the ludicrous nonsense is the fact that the film depicts children as monstrous maniacs who apparently enjoy murder and severed heads. \"Hostel: Part II\" is easily one of the worst films ever created."}, {"rating": "0", "text": "This movie was point less. I cant believe anyone would want to to and watch people slowy get cut with drills,and other wepons while they are screaming ???? The movie had bad acting,writting,and directing....(Roth) thanks for making me want to puke. The movie had no tension, suspense,or anything.. wait it had lots of blood.....sounds good....NOT!!"}, {"rating": "3", "text": "I enjoyed the first movie but this movie was miserable. It was hyped up as being more sadistic, violent, and gory than the previous film and I don't think it was. I'm not sure if it was the hype that killed this movie or what. But it seemed like they threw a batch of new characters on the screen and let them just float through a movie which was horribly acted, un-suspenseful or scary. It was mostly laughable and the effect/make-up once again were not anything special. As for \"the greatest ending ever\" I felt like it was a thrown together ending because Roth couldn't figure out any one other way to get himself out of the mess he was in and he thought it'd be funny, which it wasn't. But I will say the ending was very Eli Roth."}, {"rating": "0", "text": "I only went in to see this movie because I had to kill some time while my car was getting worked on. The only other movies were kids movies. I sat there thinking \"first of all, what type of person actually WANTS to see nude women tortured and murdered, and then, what type of sick twist WANTS to actually MAKE a movie where nude women get tortured and murdered?\". Worst of all, Eli Roth the \"director\" actually creates a scene where a man shoots a small boy in the head. NOT because ihe makes us want to hate the killer, [Roth seems to admire him] but because he simply wants the movie goer to watch a small boy get shot in the head. Roth is Pathetic and a hack of a director."}, {"rating": "0", "text": "The first was not better and Cabin Fever was not better. All three films are equally horrible. Eli Roth is a true hack just like his mentor Tarantino. He is a third-rate Takashi Miike rip off who smokes way too much weed and will find a way to take Stephen King's novel Cell and turn it into a blood bath with chopped up dialogue from the third Porky's sequel."}, {"rating": "1", "text": "What is with all of the Eli Roth hype? gimme a break. when did torure become scary? this movie was very boring for the first half, and then gory for the second half. bloody? sure. scary? not even close. The problem is that we have seen all of this before, not only in the first hostel film, but in many many films before this. Eli is so unoriginal and his characters are so poorly developed that you dont care for a split second when they are murdered. Is this going to go on and on and on? Hollywood listen up...MAKE A SCARY MOVIE!! we got it already with saw, hills have eyes and wolf creek all examples of people torturing each other. clip,snip,cut, stab...boring! give us some movies with suspense and where we jump out of our seats and scream. How many more movies like this are we going to have to suffer through? Hostel part II : been there, done that YAWN"}, {"rating": "4", "text": "This was pretty disappointing. Now....I have not seen the first Hostel, but they do a great job of catching you up on the events in the first one at the start of this. Keeping in mind that I haven't seen the first Hostel, I didn't really expect anything going into this, but was disappointed anyway. The pacing for this movie seems to be all over the map. Director Eli Roth spends what seems like forever before we get to the first death. The movie is pretty interesting at first but after a while, it starts to get tedious and boring. When we finally get to the first capture and death...eventually people start getting captured, but it's just not worth the wait, and basically, that first death is the only one until nearly the end of the movie. I feel pretty dirty saying it, but there's a reason people go to these movies; to see graphic deaths and gore. Hostel Part II does not deliver. Any of the 3 Saw movies has more gore and suspense than this movie. Most of the deaths take place off screen. Which, again, makes me wonder what Eli Roth thought people were going to see this movie for; the scenery? This is my first Eli Roth film, and I'm a little disappointed to see that he just doesn't seem to be able to set a mood. There's no suspense whatsoever. Women are tortured but for whatever reason, there's no tension. You see a movie like Wolf Creek (where women are similarly victims to a sick person torturing them,) and there's an intensity to the scenes in that movie that Hostel Part II lacks. Roth also has a habit of winking at his audience way too often. There's so much sly humor thrown in to the movie that at times, it felt like a parody of itself. This is most evident during the scene right before the credits roll. This movie seems to make no effort to scare us or to take itself seriously. Eli Roth's direction also seems pretty bland, with none of the energetic style of the Saw films. The plot also lost me at times. It felt like there were scenes missing from the movie. Characters seem to do things with no motive or explanation. An important character is suddenly seen being eaten. This scene is never explained to the audience. A character whose acting nice suddenly seems to \"snap\" for no apparent reason, and a kid is killed; why? I don't know. Unfortunately, despite a pretty good start, Hostel II fails to deliver what was promised. There's lots of deaths taking place off screen, the movie takes forever to get to the point, and there's just not much to enjoy when it finally does get there. The \"shocking ending\" turns out NOT to be a plot twist, but a very graphic scene involving [spoiler deleted]...which may have felt more shocking if I hadn't already seen [spoiler deleted]. I've got to admit, I'm not the biggest \"splatter film\" fan, but when I do go to a splatter film, I expect there to be lots of...splatter. There just wasn't. And the plot wasn't interesting, the pacing was slow, the movie doesn't seem to take itself seriously...so why should we take it seriously? Not recommended."}, {"rating": "0", "text": "So bad, I can't even bothered wasting my time to slag this movie off. Metacrtic really needs to introduce minus scoring to accommodate nonsense like this."}, {"rating": "0", "text": "This is an absolutely sick movie. Dont watch it unless you are forced to do so. I think it shouldn't be shown in the first place because the film glorifies violence. I agree with what JoeBlow wrote about it. How can anyone produce such a crap movie and how on earth can the director film the things like that?"}, {"rating": "2", "text": "What a piece of garbage no suspense no nothing. The killings were boring. The first was definitely better."}, {"rating": "0", "text": "Beyond terrible. Tarantino and Roth can go to Hades. If you gave this film more than a 2, then you should not reproduce or interact in society in anyway."}, {"rating": "2", "text": "As I always do, I saw this sequel (two) after the first film to follow the story without me forget any detail. I conclude that indeed Hostel is a failure in terms of history, after the failure of the first in the explanations he hoped that in the second were given some explanations about how things work / happen. But however and much to the dismay of all who saw the first explanations were not given any more. At the end of the two there is only a supposed sequel to a third movie, which leaves us waiting for more, but unfortunately I know in advance that there won't be a third movie, which makes both Hostel and Hostel 2 a big flop film."}, {"rating": "5", "text": "The first Hostel was scary yet very interesting, Something we dont see often with films like it. However Hostel 2 fails to live up to it. A lot fewer scary moments in this film, The acting is average, and its pretty much exactly the same as the first film. We see it time and time again, The sequel never lives up to the first film and this proves it. Hostel 2 is just an average horror film imo."}, {"rating": "0", "text": "If I had to describe this movie in one word, it would be \"trashy\". Part 2 is almost exactly the same as the first movie, except the three guys are replaced with three women (one is hot off the set of the Princess Diaries), and the gore is so much more gratuitous. There is absolutely no tension or suspense in the movie, mostly because we've seen it all before in the first one. I guess what we're supposed to be scared of is a woman taking a bath in blood and a man getting his penis ripped off. The \"protagonists\" are so boring that I seriously thought that there were only two girls and not four, and the acting is absolutely horrendous. Where the first one had legitimate suspense and a sort of Wes Craven type vibe to it, this one is just... trashy. \"Hostel: Part II\" is possibly one of the worst movies I have ever seen."}, {"rating": "4", "text": "Another disapointing horror film sequel and I expected a lot better then this trash from Eli Roth."}, {"rating": "7", "text": "I don't know, I just found it rather entertaining. I think people need to take the same sort of tongue-in-cheek attitude of Grindhouse to kind of get what Roth is doing. I think it was helped by the fact that I caught it on cable for 4 dollars, rather than paying 10 dollars and making a night out of it. Either way, I liked it."}, {"rating": "0", "text": "A worthless and totally uninteresting sequel to a film that shouldn't exist in the first place.  Lumbering, tension-free, insomnia-curing monkey poop from start to end.  Eli Roth is completely without a shred of talent, skill or decency."}, {"rating": "10", "text": "A much sharper critique of American wealth at work in the wider world than most critics give Roth credit for."}, {"rating": "9", "text": "Excellent film although not as good as the original, torture scenes were not long enough. This could have been one of his best but it seemed rushed and the ending was a bit of a let down."}, {"rating": "4", "text": "I'm not sure if it was the all the hype the movie got, but the audience attending this movie wanted to see torture. Roth didn't show us more than one seen of torture, and the one he did show wasn't good. This movie didn't show nearly as much gore as the first one did, and it was much different than what i was expecting. Roth needs to go back to the style of the original if he makes a third. He needs to add more scares, intensity, and adrenaline throughout the movie. How ever it was a mediocre sequel with a few laughs, which is the only reason why I give it a 4."}, {"rating": "9", "text": "Loved it, total gore fest. Eli Roth is one of the few who understand the modern day horror and humor, he uses real people doing very sick things to each other as the scare tactic. Lets face it, that is more realistic than a video that puts a death curse on you when you watch it."}, {"rating": "2", "text": "Joke, stupid, amateurish... Too bad Jay Hernandez was written out of the \"series\". He and \"the girl\" could have made a decent mystery, thriller in an upcoming sequel. If a movie is going to be billed as \"torture / porn\", then have some torture and porn, not the funny music, insipid plot and dialogue..."}, {"rating": "7", "text": "Winston P. Fuck off and die Eli, and Tarantino are not hacks if you even think about bitching about any of their work I will chop off your dick. Good movie by the way."}, {"rating": "10", "text": "This movie was hilarious and awesome.The torture scenes crossed the line and never came back!!!!! Awesome!!"}, {"rating": "10", "text": "It wasn't that violent. Wasn't scary at all. It's totally ok to take a 14 year old boy too. But better than the original."}, {"rating": "5", "text": "Why a five? Because it delivers exactly what it promises. Not in great quantities, or over great spans of time, but some scenes are pure gold to a horror/gore/\"torture porn\" fans."}, {"rating": "4", "text": "Although I hate to align myself with the mentally inert who won't accept the role of violence in art, I cannot give the thumbs up to Hostel Part 2. Hostel Part 1 has an element of comedy that doesn't really stick around for the sequel. It's seriousness certainly tortures your suspension of belief and never really manages to make much of statement. The look into the bad man running the hostel only serves to kill the tension further until you're left with a shortcut ending disguised as a twist and a bad feeling in the pit of your stomach. Bonus points to Heather Matarazzo and Roger Bart, who ground the movie in some semblance of emotional truth. I'm a huge Eli Roth fan and always will be, Hostel Part 2 was just never meant to be."}, {"rating": "7", "text": "Better than the original. It does has its moments of sloppy filmmaking, but on a whole, it's surprisingly well developed and features a few truly nasty shots without having the gore become the focus of the film."}, {"rating": "4", "text": "I know this is supposed to be a horror movie, but Why isn't it scary? The part leading up to the inevitable scenes at the factory where they murder people are pretty boring. Although, I must admit there's a decent (I'm being generous) plot twist towards the end. I also want to go on record and say the ending isn't NEARLY as cool as Eli Roth thinks it is."}, {"rating": "5", "text": "Urrggghhh!!! This movie was more like hokey Cabin Fever than the original. While it has the best torture scene of the two films, it really isn't a torture movie at all (very little happens in the way of torture???). I mean what if you went to see a cannibal movie and there is barely any cannibalism? I thought that was the hope Eli Roth offered with the first Hostel: a return to horror movie form. This was more like a revenge movie with bit of gore thrown in here and there. I wasn't bored by this movie, but I wasn't thrilled when I left the theatre either. Too bad."}, {"rating": "8", "text": "The critics need to learn how to have fun. This film is not a guilty pleasure for me but just one of my plain ol faves. The film is so greatly meshed with different genres that it keeps me interested each time i watch it. It is sinister, fun, stylish, and gory. I love it."}, {"rating": "7", "text": "Sequel to the entertaining & wince-inducing Hostel.Three women backpackers this time instead of three men & are taken to Slovakia enticed by the wonderful spas & tranquility.After enjoying the first one, I expected this to be not so great. However, the side story with the two business men is very well done, albeit slightly predictable.Some excellent gore as expected, especially the part with Ruggero Deodato having his \"dinner\".Maybe not as shocking as the first but still entertaining in it's own way."}, {"rating": "2", "text": "Another disapointing horror film sequel and I expected a lot better then this trash from Eli Roth. The acting was below average at best and the effects ,will good, were no where near as graphic as the first film."}, {"rating": "7", "text": "Roth's revisiting of the Hostel concept follows largely the same outline as the original. However, Part II has more going for it than just a gender swap with the protagonists. Roth took the time focus more on the elements that worked in the first film, and less on the ones that didn't. He also ups the gore and violence while simultaneously giving us more insight as to how exactly the whole Hostel situation works. The scale is larger and things are a little more brutal this time around, but there's no hiding the fact that it's not as original and loses the mystery in favor of more visual horror. Think of it as more like a remake where some improvements were made.The fact that we know what's going on this time around should have robbed the movie of some of what made it successful the first time around. However, it's Roth's ability to the ante that keeps things solid. With more of torture taking place onscreen the movie goes for a more sleazy route in entertainment. The blood is gratuitous, the deaths are twisted, and the grimier visual style and environments is very reminiscent of the Saw series. Essentially Part II really embraces the \"torture porn\" angle. There is something kind of sick about that, but Roth keeps things from being too morally revolting by including some dark humor that helps keep things lighter and more playful. Because of that it never crosses into that realm of almost being a straight snuff film.I appreciated how this time around the humor was kept more around the gallows as opposed to the gutter. There's still nudity and some sex, but this is far from the raunchy sex comedy it's predecessor was. The girls are still up for a party, but their far less obnoxious that the frat bros we previously hung out with. It makes them more likable, even if the main is that perfect pretty girl who everything works out for no matter what the situation apparently. Leaner and meaner, Hostel proves worth revisiting in Part II. Roth trimmed the fat from the first movie and loves letting this sequel flex it's new muscles with some more violent scenes and a little more insight as to how the whole setup works. It's still a little bare bones in the actual plot department and some scenes are still a little slow, but at the end of the day this is still one of those rare movie sequels that's an actual improvement on the original. Something made possible because of how much more gruesome and to the point it is. Roth cut the crap and focused on the action. Now if only he could make something a little more substantial. The basic thrills are still worth something though.7.5/10"}, {"rating": "6", "text": "God this is a really bad movie, it is very excessive, bad acted, stupid and annoying, the movie has no sense, maybe the beginning can be mysterious and creepy, but then it turns stupid, but it still has some sexy scenes."}, {"rating": "8", "text": "nowhere near as good as the first, but nonetheless, it is still an insanely violent, horrifying, kinetic thrill ride, with a decent script and director behind it - samarathenymph xoxo (happy freakin' new year)"}, {"rating": "10", "text": "epic"}, {"rating": "10", "text": "superultramegaepicawesomecrazyviolentsexychaoticentertainingintelligentuniquetastefulfunnystrangebrutalimmoralpleasing... in short, yes, yes i really like it... :P"}, {"rating": "9", "text": "Better than the first as this time 'round we start to learn more about this sick and twisted company. The characters are also just that little bit more likable and you're definitely rooting for those that make it to the end. It's rather gruesome so its not for those with a weak stomach, but Horror fans will be all the more used to it and should enjoy it. It's rare for a sequel to surpass the original so I'm glad it did, and any fans of the first should be pleased with where this one goes."}, {"rating": "10", "text": "More like 'Hostel: Part BRILLIANT'.    I love all of Eli Roth's films and this was no exception. Two thumbs up. The script was as sharp as the knives featured in the film's notorious knife cutting scene (the scene where the people get cut with the knives). I laughed and cried and screamed because it was also scary as well as funny and sad. And Who can forget the scene with the bit where they rent out a room in the titular hostel. When I remember this scene I still get shivers, I was like, 'Don't rent that room in that hostel!' but then they rent the room in the hostel and its like, 'here we go again!' I regard Hostel 2 as Roth's best (controversial) but then again, I regard all his films as the best (gotcha!). A must see.\r p.s  F*ck trees."}, {"rating": "8", "text": "Three American college students studying abroad are lured to a Slovakian hostel by a beautiful European girl, where they are being sold to the highest bidder who will torture and kill them any way he likes.\r So it's the same as the first Hostel, but this time around with girls instead of boys? Not really, in this second instalment there is more explaining about how the organisation works.\r This time we also follow two American business men, who look like just normal guys but who decide to join the elite hunting club and get some killing done. This makes for an interesting insight in the other side of the story.\r Hostel II has some beautiful girls of course, there is the wonderful Vera Jordanova from Finland and the feisty Lauren German. She actually succeeds in escaping the hell hole in Slovakia.\r There is blood and gore a plenty in this movie, but there's also humor just like in the first movie which makes it a lot more bearable. And the story and acting are not bad at all.\r I like the first Hostel a little better because of its originality and spooky atmosphere, although it had a very slow start and the bit in Amsterdam was not very well made. There is also another sequel made, Hostel III, but I don't recommend that one at all.\r I rate Hostel: Part II 8 out of 10."}, {"rating": "6", "text": "Hostel: Part II leaves off at almost the exact point the first one ends and has an awesome opening scene. Last time it was the boys, this time the girls go on vacation. Once again I loved the gore and the scary story, however this ends quite differently from the first one, and too be honest I really didn't like what they did. If this is indeed just a continuation of the story of the hostel, then they could have done a lot better job closing it out. The rushed, lazy ending really left me with a bad taste in mouth. For the most part thou, Hostel: Part II is every bit as scary and disgusting as the first. If you liked the first one, you'll like this one too."}, {"rating": "4", "text": "There were some genuinely good horror scenes here but for the most part, It's exactly like the first film but with a female cast this time. It's watchable but not as original as the first film."}, {"rating": "2", "text": "In short, a repetition of the first film. All I can say is, those who enjoyed the first film, or those who are hardcore horror fans, will probably find the film alright. I, on the other hand, did not."}, {"rating": "6", "text": "epic"}, {"rating": "3", "text": "A marginal improvement over the first, but still not saying much.  The characters are slightly less annoying than the ones in the first film, and they give you more insight this time around with the group that is behind the killings.  Some of the scenes of violence with torture felt less disturbing than the first one.  They certainly toned down the goriness, sometimes opting to do the violence off camera.  They also toned down the sex and nudity.  There was very little suspense or buildup.  The ending involved some instant character transformations that made zero sense, and I thought some scenes had been cut from the movie.  Very jarring, and confusing.  It felt like they were trying too hard to have a Saw like twist at the end, but it was just poorly done.  Seemed very rushed.  Very little to no character development, and a pretty forgettable gore flick."}, {"rating": "8", "text": "This one had more gore, overall better acting and the characters were more likeable. Hostel part I was good but this one was a little bit more entertaining."}], "recommendations": ["the_hills_have_eyes", "hostel", "the_green_inferno", "malignant", "the_last_house_on_the_left", "cabin_fever", "the_collection", "annabelle", "the_possession", "final_destination_2", "the_texas_chainsaw_massacre_the_beginning", "house_of_1000_corpses", "texas_chainsaw_3d", "the_strangers", "terrifier", "the_grudge", "saw_iii", "the_grudge_2", "dead_silence", "devil", "insidious", "polar", "chernobyl_diaries", "insidious_chapter_2", "saw"]}