{
  "id": 3787,
  "title": "Hot Shots! Part Deux",
  "starring": [
    "Charlie Sheen",
    "Lloyd Bridges"
  ],
  "runtime": 86,
  "genre": [
    "Action",
    "Comedy",
    "War"
  ],
  "description": "Topper Harley is found to be working as an odd-job-man in a monastery. The CIA want him to lead a rescue mission into Iraq, to rescue the last rescue team, who went in to rescue the last rescue team—who went in to rescue hostages left behind after Desert Storm.",
  "releaseYear": "1993",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zh9EGK970GHo10ETclWBOjZVUOK.jpg",
  "categories": {
    "plot": 9.0,
    "acting": 9.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.75,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "You need to like such humour full of hints to other movies and shows. I had a lot of fun again, just like with the 1st part."
    },
    {
      "rating": "5",
      "text": "Apart from a couple funny moments there is very little to see here... meh..."
    },
    {
      "rating": "9",
      "text": "I am in the minority that liked it better than the prequel. The movie has more silly, over the top and hilarious humor but the good kind. I freely admit that this can also be what other viewers can hate or dislike with passion and strangely I can understand that. It is again a comedy or better said parody / spoof movie. While the first is a parody of Top Gun this one is a parody of Rambo. Story: During the second Iraq war a rescue mission is started to free captured soldiers. However things do not go as planned and the people in charge try to get Topper Harley back into action who has retired to a small village in Thailand. This is a start to a hilarious funny and entertaining adventure. The story is a good vehicle for the humor and it delivers well. Humor: This is why I like the sequel better. It is so fun to watch, full of crazy ideas and it takes itself not serious if it can make a great joke. The main parody of the movie is Rambo but there are countless other sources for parody like for example Apocalypse Now, Basic Instinct, Lady and the Tramp, American Gladiators, Terminator 2, commercials, Disney and even a side blow to violent movies in general. It has a good mixture of humor and the characters / actors enhance this experience. In comparison to the prequel they went up to eleven. I will repeat that this can also be a point of criticism as many jokes are not deep and often the complaint is heard that it has too much silliness. Cast: Charlie Sheen returns as Topper Harley and nails his role. Again he has the Leslie Nielsen power of being totally serious in the most hilarious situations. Lloyd Bridges is also back and now President of the USA. He has a bigger role and is so enjoyable to watch. Valeria Golino resumes her role as Ramada Hayman and has a history with new character Michelle Huddleston played by Brenda Bakke. A hidden star is Jerry Haleva as Saddam Hussein (Yes, that one). His performance is just too entertaining to not be praised. There is a small cameo of Martin Sheen and Rowan Atkinson has some scenes but I say he is wasted. I say we got a great performance by genre standards. Other than that the movie looks really good. You can clearly identify the sources or movies they want to spoof / make fun of. This added a lot for me as all fells familiar. There are a few negatives: It reaches not the levels of the best parodies but is still really good. Other might find it too silly and it is a lesser experience if you don't know the sources that the parody elements aim at (Not valid for most of us as many are timeless classics or well known). Overall I see it as a classic comedy of its time. Maybe does not hold up good enough anymore but it is entertaining enough for me to rewatch once in a while. Would chose this any day over the more modern spoof movies which is actually not much of a praise but still needed to be mentioned."
    }
  ],
  "recommendations": [
    "hot_shots",
    "austin_powers_international_man_of_mystery",
    "johnny_english_strikes_again",
    "johnny_english_reborn",
    "austin_powers_in_goldmember",
    "ace_ventura_when_nature_calls",
    "austin_powers_the_spy_who_shagged_me",
    "paul",
    "scary_movie_3",
    "johnny_english",
    "bean",
    "role_models",
    "dodgeball_a_true_underdog_story",
    "scary_movie_4",
    "zoolander",
    "mortdecai",
    "spy",
    "superhero_movie",
    "think_like_a_man_too",
    "the_longest_yard",
    "madagascar_escape_2_africa",
    "deadpool_2",
    "the_wedding_ringer",
    "jumanji_welcome_to_the_jungle",
    "chips"
  ]
}