{
  "id": 3094,
  "title": "Hot Fuzz",
  "starring": [
    "Simon Pegg",
    "Nick Frost"
  ],
  "runtime": 121,
  "genre": [
    "Crime",
    "Action",
    "Comedy"
  ],
  "description": "As a former London constable, Nicholas Angel finds it difficult to adapt to his new assignment in the sleepy British village of Sandford. Not only does he miss the excitement of the big city, but he also has a well-meaning oaf for a partner. However, when a series of grisly accidents rocks Sandford, Angel smells something rotten in the idyllic village.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zPib4ukTSdXvHP9pxGkFCe34f3y.jpg",
  "categories": {
    "plot": 8.133333333333333,
    "acting": 7.333333333333333,
    "ending": 6.75,
    "soundtrack": 5.0,
    "cinematography": 5.5,
    "familyFriendly": 3.0,
    "funny": 8.122448979591837,
    "action": 8.68421052631579
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Very funny and full of silly and fun action and an impressive storyline makes me want to watch it over and over again."
    },
    {
      "rating": "10",
      "text": "Hot Fuzz will ruin the buddy-cop genre for you, and you'll love it for it. While it's not an amazing action film or an outstanding comedy of its own right, the way it blends the two into both an homage and a satire is brilliant. Its characters, plot, setting, and style (especially its use of absurdly fast cuts, a la The Bourne series) all say \"Isn't this awesome?\" and \"Isn't this stupid?\" at once, and it's right about both."
    },
    {
      "rating": "10",
      "text": "This movie was so good and ridiculously funny."
    },
    {
      "rating": "9",
      "text": "This is a great movie that I thoroughly enjoyed. While being made by the same people as Shaun of the Dead, it is not the same kind of humor and really shouldn't be compared with. This is an english spoof of cop movies, while the other is a spoof of zombie movies. Not exactly comparable. Anyway, see this movie and Shaun of the Dead, then the next movie they make, which I believe has something to do with a spoof of space invaders or something."
    },
    {
      "rating": "10",
      "text": "Incredible action comedy which manages to both lavish, lampoon, and love the genre while also managing to distinguish itself from it's counterparts."
    },
    {
      "rating": "10",
      "text": "Not as good as Shaun, but near perfection anyway."
    },
    {
      "rating": "10",
      "text": "Awesome Movie!!! So funny and violent!"
    },
    {
      "rating": "9",
      "text": "This movie is hilarious. Plot was top-notch. Great overall movie, and not to mention all the awesome deaths they filmed."
    },
    {
      "rating": "8",
      "text": "Loved it! Pegg really comes of age after a breakthrough performance in 'Shawn of the Dead. The director uses a combination of diegetic music, short sharp camera shots as well as the recurring motif such as 'The Greater good' to dish up an absolute feast of a police flick.\rWorth a look if you're a fan of slapstick comedy and old English charm. Tim Dalton particularly excels as the voraciously charming supermarket attendant. The blistering car chases and action scenes are certainly nothing to scoff at either. Quality flick!"
    },
    {
      "rating": "10",
      "text": "I don't give out 10s lightly, but this film deserved. I literally could not stop laughing. I completely forgot about the popcorn I bought, and nearly busted a rib laughing. However, the 8 of us who went were pretty much the only ones making any noise, but we made a lot of it. I intend to watch this movie at least two more times in theatres, and will buy the DVD in an instant."
    },
    {
      "rating": "9",
      "text": "Freakin' HILARIOUS! It pokes fun at how brainless and idiotic American action movies are without being brainless and idiotic itself. It's smart, it's quick (editing, not running time) and best of all funny as hell. I noticed that the only \"bad\" review it got was from \"The Hollywood Reporter\", which said \"All the action is staged with energy, but it gets relentless without anything really funny going on.\" Nothing funny going on? Either this person did not even see this movie or he fell asleep. Or, and this is my guess, he is such stupid and numbed by what passes for a good movie by American standards, he didn't get that they were being spoofed. This movie is a great time. See it NOW!"
    },
    {
      "rating": "9",
      "text": "As the movie progresses, it gets better and better (and crazier)."
    },
    {
      "rating": "10",
      "text": "I was smiling the entire time."
    },
    {
      "rating": "10",
      "text": "Love how they combined intense action with dry uproarious humor 2 thumbs up."
    },
    {
      "rating": "10",
      "text": "This is (In my opinion) the BEST movie since Shaun of the Dead. Not only is it very funny throughout the movie, it also reminds you of what made shaun of the dead such a good movie, A GOOD STORY LINE. Very funny while having very serious scenes of action, and this movie was actually scary at times! Some may say that this is bold, but not only is this the best movie in 3 years, It may be the best movie I have ever seen!"
    },
    {
      "rating": "10",
      "text": "First of all, give this view at least a second viewing. Once you do that you can much better appreciate how great this movie is. I can easily see why some reviews have Hot Fuzz in the mediocre range. That's because this is a completely different sort of film than we are accustomed to in the US. Comedies are formulaic and you \"feel\" when they try to make you laugh, even when the jokes or gags don't hit. This gives the average person the impression that the movie is funnier than what they actually laugh at. Most of the humor in Hot Fuzz is done subtly. There are laughs to be had every minute of this movie when you understand why it is funny. Much of this subtly is hidden in the main storyline itself. Yes, the plot is believable as is the action. Many will say \"that's impossible\" several times. However, the plot walks a very delicate line between being a far fetched action plot and using considerable satire. It's the way that it mixes little satirical bits and other jokes you have to think about with slapstick and mindless comedy that makes it so funny. It's not just about the comedy, though. The action is always entertaining, especially the incredible last half hour. Entertaining and funny all the way through, the film still manages to craft genuine characters that you actually care about. The end also left me inspired more than the typical cliche Hollywood formula. If you take the time to find all the hidden comedic gems Hot Fuzz has to offer, it just may the best movie you have seen, as it is mine. There is more than enough, though, for those expecting a dumb action comedy to have fun. But either way, we need more movies like this. We need more movies made by people who have a true passion for the art. More movies that are this multidimensional and that get all of them right. We need more movies like Hot Fuzz."
    },
    {
      "rating": "10",
      "text": "One of the best movies i have ever watched. Definitely in my top 20. After a few years, it will probably lead its place to my top 10. Edgar's best movie, in my opinion."
    },
    {
      "rating": "10",
      "text": "This is a very funny movie. I have to say it is a killer movie. It will give you reason to suggestion what it takes to be a cop in a small village called Sanford.  This movie will give you the time of your life!"
    },
    {
      "rating": "10",
      "text": "Actually one of the best action movies of all time whilst being one of the best Comedies of all time. Absolutely makes everything you see for a short while after seem boring. You'll watch it over and over again for its one-liners, great action sequences (especially at the end) and it's characters which include some of the best british talent ever seen in film."
    },
    {
      "rating": "10",
      "text": "One of the best British films for quite some time. The second of the Blood And Ice Cream (Edgar Wright and Simon Pegg), first being Shaun of the Dead, Hot Fuzz is the perfect parody of the buddy cop genre. Carefully paced story, brilliantly edited, solid acting and chemistry from Pegg and Frost and furthermore the jokes are everywhere and will keep you on your toes just to see what the joke was but you just subconsciously laugh at it without knowing. I could watch this again and again. It's too good."
    },
    {
      "rating": "10",
      "text": "One of the best comedy ever. A landmark for Simon Pegg and Nick Frost. This movie definitely defined them. Hope they make more of this sort.\rThe cast is good. The acting is almost there. And over all Hilarious."
    },
    {
      "rating": "10",
      "text": "Brilliant film, but it's not as good or funny as Shaun of the Dead. Hopefully the final one in the 'trilogy' will be the best. I'm struggling to get 150 chars here XD"
    },
    {
      "rating": "10",
      "text": "One of the best British film ever made! That's it. Spread the word! The script is brilliant, every word count, the acting is brilliant, every character is relevant. But.... just stop right here and watch this masterpiece right now. The story may seem slow within the first half hour, but the entire plot became soon extremely satisfying."
    },
    {
      "rating": "7",
      "text": "It was funny, interesting, and gave a well deserved nod to action films. I just dont hold it in high regards like others do. I enjoyed it but I dont think it was great."
    },
    {
      "rating": "9",
      "text": "Hilarious, intelligent, and filled with action-packed fun, Hot Fuzz is one of the most memorable movies I have ever seen. Every time I come back to it, I find new things to laugh at. Its rare when you find a comedy that is this layered!"
    },
    {
      "rating": "10",
      "text": "Don't look up what it's about, it'll be even funnier. A total different kind of comedy than those dime a dozen comedies full of boring and vulgar jokes."
    },
    {
      "rating": "9",
      "text": "In its own genre is a must see.The best of the so called \"Cornetto Trilogy\" (comprehending Shaun of the dead and The World's end). Is a fun film directed by Edgar Wright (The man behind Baby Driver and Scott Pilgrim as well) that is one of my favorite directors. The way he transition from one shot to another is just perfection. Every gag is both in what happens in the scene and it how it is presented to the audience and Wright knows that very well.Also the cast is incredibly funny. Simon Pegg and Nick Frost are a fantastic duo that will make you laugh a lot. If you like comedies you should see it."
    },
    {
      "rating": "10",
      "text": "This comedic homage to slasher movies and American action films is the greatest of the Cornetto trilogy, and that's saying something - all three films are absolutely brilliant. Absolutely hammers you with laughs from beginning to end."
    },
    {
      "rating": "10",
      "text": "Absolutely brilliant.  The best comedy ever made.  Simon Pegg, Nick Frost, and Edgar Wright strike again!"
    },
    {
      "rating": "8",
      "text": "\"Hot Fuzz\" blows off the movie core with mind-less action, agreeable humor (that has no penis jokes), and bad ass performances by Simon Pegg and Nick Frost. Every minute is a blast, every second is worth the watch.! NOTE-I GAVE THE WRONG SCORE FOR THE FIRST ONE!"
    },
    {
      "rating": "10",
      "text": "This movie is cleverly written with great comedy and a unique plotline. Like no other movie out there. I've watched it several times and it gets better and better..."
    },
    {
      "rating": "10",
      "text": "This movie is brilliant, when my buds and I came out of it we all agreed it evoked the same feeling as Shawn of the dead. I would say this movie is perfect and henceforth deserves the rating 10 out of 10."
    },
    {
      "rating": "3",
      "text": "What a toad of a movie. Not really that awful, but I just got so tired of feeling obligated to find this funny because it's made by British people with above average I.Q.s I had to walk. There's certainly no real acting (even though they got lots of successful Brit character actors to drop by for a goof), there's no compelling characters and...oh, yeah... IT'S NOT FUNNY."
    },
    {
      "rating": "5",
      "text": "Started out hilariously, in that dry English way, but deteriorated into a highly graphic and violent shoot-'em-up which--even though a satire--left our Virginia audience (1 week after Virginia Tech) stunned."
    },
    {
      "rating": "2",
      "text": "It was not funny at any time during the movie. This should be classified as a manual boring body ache."
    },
    {
      "rating": "3",
      "text": "Did I see the same movie as everyone else? This movie was not funny. It's nothing like Shaun of the Dead, and is really a very boring movie until the last 30 minutes. When I got out of the theater I had the worst head-ache from watching this movie. I've never gotten a head-ache from watching a movie, reason being they change the camera angle every..3 seconds? maybe 2? If you're expecting Shaun of the Dead don't go. If you have very high expectations like I did. Don't go."
    },
    {
      "rating": "5",
      "text": "You have to be able to appreciate English (i.e. sick Monty Python) humor to enjoy this movie."
    },
    {
      "rating": "3",
      "text": "Loud and over-rated."
    },
    {
      "rating": "2",
      "text": "I am big fan of Shaun of the Dead and Simon Peg in general, but this lacked hugely for me. Ended up leaving before the end and simply couldnt understand why this film is so critically acclaimed - a massive dissapointment."
    },
    {
      "rating": "9",
      "text": "While not as good as Shaun of the Dead, of course what is, this was a blast although a bit slow at first."
    },
    {
      "rating": "5",
      "text": "Went in with high expectations because I really enjoyed Shaun of the Dead. Came out quite disappointed. It wasn't funny, wasn't witty, and the action sequence to end the movie was absurd."
    },
    {
      "rating": "4",
      "text": "This is humor? What is funny about visual scenes of a man impaled through the mouth, or of a half dozen young people killed and their bodies hidden in a castle crypt? This would rank with showing the beheading of David Pearl as a comedy."
    },
    {
      "rating": "8",
      "text": "This movie was a big disappointment. I loved Shaun of the Dead and this film was no where as good. I wish I didn't see the trailer for this film, because then a lot of the jokes would of been fresh. When I saw SOTD, I didn't know anything about it except that my friends loved it. I'm sure if I saw the trailer for SOTD, it would of spoiled half that movie for me as well. Overall, this movie was humorous, but I thought it spent way too much time trying to make fun of Michael Bay and other action junky directors like him. It should of just made a good action film with loads of laughs. That's where SOTD succeeded and Hot Fuzz failed. SOTD made a regular zombie movie that was \"laugh out loud\" funny. Also, the supporting cast of this film was annoying and no where close to being funny. The only funny moments came from the two main characters, Simon Pegg and Nick Frost. SOTD's supporting cast helped make a more interesting and entertaining film."
    },
    {
      "rating": "5",
      "text": "Overrated. I tried SOOOOOOO hard to like this, but it just fell short in my opinion. Not half as funny as Sean of the Dead. Actually, yes. It was half as funny as Sean of the Dead. Exactly half."
    },
    {
      "rating": "3",
      "text": "See and can't believe how high critic have appreciate the movie. Here and there it's funny but rating 81 is too high for the very boring movie."
    },
    {
      "rating": "1",
      "text": "Awful grotesque dark humor action with plot that makes no sense. A perfect police officer must identify the killer(s) in a small, clean good-looking English town with zero crime rate where deadly accidents happen to occur one after another."
    },
    {
      "rating": "2",
      "text": "The only reason I didn't walk out during the first 30 minutes was because I was with friends. If you like intelligent--or even quality--comedy, go elsewhere. I have no idea how this movie got such a high rating, but it suggests the reviewer(s) are not as discerning as I'd assume."
    },
    {
      "rating": "0",
      "text": "One of the worst films I've ever seen. The slam-bang editing was used to cover up the fact that nothing interesting, talented or funny was going on. It has an overbearing sound mix from hell. A total assault on my senses and sensibilities. Now original wit or creativity at all. Don't wast your time. Major disappointment on all levels."
    },
    {
      "rating": "5",
      "text": "I was hoping for something a lot better. The last twenty minutes, to me, really shone, but the majority of the film was dull exposition with a laugh maybe cropping up once every five minutes. A let down, really."
    },
    {
      "rating": "10",
      "text": "Hey those of you that gave it low ratings. Go watch the George Lopez show for your canned laughs. The movie was phenomenal. Of course the kitsch and the plot are all tongue in cheek as Point Break was a node of inspiration for some scenes. There hasn't been a movie this funny in awhile and if you've already seen the mediocre Blades of Glory, go see something a little smarter."
    }
  ],
  "recommendations": [
    "22_jump_street",
    "30_minutes_or_less",
    "scary_movie_4",
    "the_dictator",
    "johnny_english_reborn",
    "scary_movie_2",
    "this_is_the_end",
    "scary_movie_3",
    "the_watch",
    "zombieland",
    "pineapple_express",
    "jackass_presents_bad_grandpa",
    "the_other_guys",
    "identity_thief",
    "deadpool_2",
    "anchorman_2_the_legend_continues",
    "hot_tub_time_machine",
    "rush_hour_3",
    "one_year_one_night",
    "the_three_stooges",
    "a_haunted_house",
    "ted_2",
    "nacho_libre",
    "zombieland_double_tap",
    "the_hangover"
  ]
}