{"id": 3759, "title": "Hot Tub Time Machine", "starring": ["John Cusack", "Craig Robinson"], "runtime": 101, "genre": ["Science Fiction", "Comedy", "Adventure"], "description": "Four pals are stuck in a rut in adulthood: Adam has just been dumped, Lou is a hopeless party animal, Craig is a henpecked husband, and Jacob does nothing but play video games in his basement. But they get a chance to brighten their future by changing their past after a night of heavy drinking in a ski-resort hot tub results in their waking up in 1986.", "releaseYear": "2010", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/wjzbVXAes1acbh6k4OO5xVfy5.jpg", "categories": {"plot": 7.0, "acting": 7.25, "ending": 4.0, "soundtrack": 7.75, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.857142857142857, "action": 5.0}, "reviews": [{"rating": "7", "text": "The movie is sorta similar to \"The Hangover\" with its chronologically misplaced plot. But its surprisingly fun."}, {"rating": "0", "text": "Walked out. Loved The Hangover, but this was absolutely worthless."}, {"rating": "8", "text": "Much better movie than i expected initially. Hilarious movie. Good jokes, funny actors, absolutely random but funny plot. A very interesting and funny comedy."}, {"rating": "9", "text": "this film has all the makings of a timeless classic. A great cast, superb dialouge, great plot and an original atmosphere. It gets funnier every time you watch it. I had no idea it would become one of my favourite comedies when I first watched it, but it's really grown on me. So damn funny."}, {"rating": "10", "text": "One of my favorite movies of the year. Had a lot of hilarious moments and the characters were awesome, especially Lou. Made me want to go to a ski resort."}, {"rating": "10", "text": "Hilarious. By the end you will be \"Is that what were going with? Awesome!\" At first I thought this would be serious about the issues with time traveling and then it so funny you don't care."}, {"rating": "8", "text": "It's like The Godfather, Bonnie and Clyde, Star Wars, Pulp Fiction, Back to the Future and Jaws all in one movie. I'm kidding. It's a solid B. A lot funnier and crude than I thought it would be and I'm all the more happier for it. Yes, there are some cliches, but the fun and humor definitely outweight it. Like an incomprehensible Chevy Chase and a cooky Crispen Glover in supporting roles."}, {"rating": "5", "text": "I laughed a few times, but there really wasn't any memorable moments. I think it was at least worth seeing for me, but never really wowed me like The Hangover did."}, {"rating": "2", "text": "The 80's references were cute and one or two jokes were kind of funny, but overall this thing was just awful. (spoiler ahead) And I am usually just offended by a final message saying \"just be rich and things will work out great\"."}, {"rating": "3", "text": "Not that funny. I laughed maybe once or twice the whole time. I had a friend tell me this was funnier then The Hangover. I no longer accept movie recommendations from this friend"}, {"rating": "3", "text": "Just a generally poor movie.  I didn't think the movie executed much of what it set out to do.  The plot was weak.  This of course was no surprise it is a movie about a Hot Tub Time Machine after all, but that set them up with a lot of potential and yet the movie still fell flat on its face.  The movie pretty much just tries to live off of the 1980s nostalgia for teen movies.  The sad thing is that its a worse picture than many of the 1980s teen comedies and that's saying something.  Its raunchy, which can be ok, but this movies humor just generally fails.  It certainly doesn't find the perfect match between raunchiness and laughs like a movie such as The Hangover or Superbad does.  Overall unless your really in the right mind set for this movie it isn't worth your time."}, {"rating": "5", "text": "Watchable, when you're bored off your ass, otherwise forget it.I need 150 chars... here we go 12345678901234567890234567890234567890234567890234567890234567890234567890234567890234567890234567890234567890234567890"}, {"rating": "0", "text": "So, I was looking at different time travel films to watch, and I was appalled that this film has a 6.6 metascore. What the hell is wrong with society? This is just some raunchy, lazy, worthless piece of crap excuse for horny males. I mean, how many boobs, F* bombs and sex jokes does Hollywood need to make? This genre should be banned, its not art. Its CRAP."}, {"rating": "10", "text": "This movie was hilarious. I laughed from start to finish."}, {"rating": "8", "text": "It was a very funny movie, many funny moments as with all of these kinds of movies, but I feel like they leave a lot of gaps in the story line and plot, such as you never find out what the \"Great White Buffalo\" is. But for a good, funny film to see with your friends, I recommend it."}, {"rating": "1", "text": "Bad movie."}, {"rating": "2", "text": "I saw this movie 2-3 weeks ago at a screening, I was so excited for this movie and would talk about how funny and great it looked. I was incredibly disappointed. Even though the story isn't meant to make sense, you can't help yourself but cringe at how bad the story is. I get the fact it's supposed to be dumb, but It could have been dumb and great at the same time. You'll be cringing all the way through it based on how bad the story is put together, It just moves from one dick joke to another, then the movie is over. I'm 18, I love movies like that too, but this movie was shit. I laughed 2 or 3 times, but they were cheap laughs that were thrown at the audience to keep them interested, like unfair shock laughs. You wont be quoting this movie to friends, and you won't remember this movie a year from now. It's just a total waste of what talent the movie had to offer. Thank Christ I saw this movie for free, or else I'd be even more pissed off."}, {"rating": "8", "text": "Saw a late night screening last night, very funny. What crack me up even more are the actual"}, {"rating": "8", "text": "Guys-only stupid movie comedies come in two flavors: stupid-stupid and smart-stupid. Stupid-stupid comedies are stupid movies made by stupid guys. Smart-stupid comedies are made by smart guys who get together and say, \"HEY! Let's make a really stupid gross-out movie that's makes us laugh.\" Think \"Beerfest\" vs. \"The Hangover.\" \"Hot Tub TIme Machine\" is the latter. It makes guys laugh so hard we gag and wheeze, makes us feel vaguely ashamed at having such a good time and let's us ease our guilty consciences by saying, \"It was just a stupid little gross-out laugh in the boys' room in between Marlboroughs.\" What's wrong with that?"}, {"rating": "7", "text": "Relies heavily on cheap laughs, but does contain a few genuine lol moments. For mature audiences definitely, no 12 years old please."}, {"rating": "7", "text": "Did black people really listen to Rick Springfield? Sure, they did. Unaware of the ostensible incongruity of his race and song selection, Nick(Craig Robinson) belts out \"Jessie's Girl\" before a ski resort audience, and probably means every word of that chart-topping power-pop classic. Set ten years prior to the Telecommunications Act of 1996, \"Hot Tub Time Machine\" recalls an era in which niche marketing had less of a stranglehold on the music industry. By deregulating the airwaves, rock parted ways with soul, creating a musical segregation that, to this day, keeps all the genres in isolation from each other. But Nick lived through the eighties, so in spite of his Kid & Play hairdo, Nick's eighteen-year-old self was probably an anglophile, as well, which is hinted at by the straightaway older man's universal inquiry, \"Where can I find a woman like that?\" Such music cosmopolitanism can also be glimpsed in Dito Montiel's \"A Guide to Recognizing Your Saints\", where Robert Downey Jr.(as Montiel, reflecting back on his formative days spent in Astoria, New York circa 1986) marvels that Puerto Ricans had once listened to Journey. \"Yo, Steve Perry is the s***!\" proclaims one of the Latino youths. That's debatable. In my mind, Dave Wakeling of The English Beat was the s***. The inclusion of \"Save it For Later\" on the soundtrack was probably John Cusack's idea. (General Public's \"Tenderness\" is my favorite eighties song.) Although \"Hot Tub Time Machine\" disappointingly fails to detect \"The Heart of Rock and Roll\" in spite of its numerous \"Back to the Future\" references, the amiable enough film perfectly nails down the decade's tacky surfaces. If you want a love letter to Generation X: see Greg Mottola's \"Adventureland\" instead."}, {"rating": "10", "text": "This made me laugh a hell of a lot more than The Hangover did. It was a screwy plot and it left a lot unanswered, but in this kind of movie you really just don't care. It's a feel good romp, one that left me thoroughly entertained."}, {"rating": "8", "text": "You'll get the most out of this movie by going in expecting exactly what the title offers. The comedy seems a little dated because of the success of The Hangover, but it offers a lot of laughs and brilliant cameos by Chase and Glover."}, {"rating": "10", "text": "If you are between the ages of 33 and 55 and grew up in the United States, you must go see HOT TUB TIME MACHINE. I laughed the entire 1 hr and 45 min. Brilliant, brilliant, brilliant."}, {"rating": "0", "text": "God damn awful. Like a bad version of the Hangover. It's like none of the jokes made the final cut. Half the time it was like the actors didn't even want to be there. CRAP."}, {"rating": "0", "text": "Walked out. Insult to the genre and complete waste of time. It's biggest crime...not funny...at...all. I am completely baffled by the \"professional\" critics on this one."}, {"rating": "6", "text": "Better than I expected for a comedy of this caliber... but not too much better."}, {"rating": "9", "text": "Vulgar but utterly hilarious. The trailers really don't give it any justice. Don't miss this movie."}, {"rating": "9", "text": "I worked at a ski resort for 7 years in the 80's. This movie was made for and is about me. Ah...the mammeries...erm, memories! Best comedic movie since The Hangover."}, {"rating": "8", "text": "going into it ii though it would suck much to my surprise it pretty funny now how am i gonna survive raw after wrestlemania......."}, {"rating": "8", "text": "Way better than I initially thought. There's some gruesome humor, but it's nothing you're not used to! I'd say a must-see."}, {"rating": "7", "text": "Overall, a decently funny movie. However, there are a few select scenes which will make your gut hurt, making the movie a must-see. The plot was weak, but it was meant to be a silly comedy, so it should be treated as such."}, {"rating": "7", "text": "Roger Ebert says that John Cusack has never made a bad movie. Has he ever seen 2012? If it's not merely \"bad\", then it's certainly \"awful\"."}, {"rating": "4", "text": "Wow...this movie sucked. Not funny all and super disjointed. It was disappointing because I love the cast. Not even close to being as funny as the Hangover or Superbad or something like that."}, {"rating": "6", "text": "It's just not that funny."}, {"rating": "6", "text": "If you have a Pen15 or know someone who does, there is a good chance that you will get a decent number of laughs from this movie. Jerk-of-a-friend jokes are the name of the game here... the only disappointing part was that Chevy Chase had such a small role :( Anyway a run-through comedy which makes use of its time."}, {"rating": "5", "text": "Sorry but this movie just wasn't that great. It did have a few real funny scenes but compared to a movie like dumb and dumber it sucked."}, {"rating": "6", "text": "You will laugh often enough to justify the price of admission but you"}, {"rating": "8", "text": "It does what is intended. To Boom Sizzle, Superbad was an absolutely terrible movie..so this had no trouble living up to that."}, {"rating": "8", "text": "Has potential to be a classic. It's a simple premise, a simple idea, a simple move, and I wouldn't have it any other way. Very well made, very well cast, very funny. I work at a theater, and sit in this movie all time."}, {"rating": "0", "text": "I liked The Hangover, but this movie was just a gross, totally unfunny waste. I just cannot understand the 'critics' great reviews. That NY Times critic who gave this movie a 100 rating should be fired for total incompetence."}, {"rating": "10", "text": "Wow very good, it had the sam feeling as hangover and the plot was great, the was funny too , so i am saying that u have to watch it, especialy if u can relate to how things have changed in the last 20 years."}, {"rating": "9", "text": "Enjoyed it immensely. Far more than I thought I would. Originally wanted to see it simply because I love John Cusack, and some of Pinks past movies(such as High Fidelity/Grosse Point Blank) and because of the insane title. But I was pleasantly surprised. Laughed ALOT. As did most of the cinema I was in, twas a preview showing, as its not out till Friday in the UK. I was surprised so many people were in there actually, I expected it almost completely empty. I'm not usually one for comedies with alot of gross-out stuff, but it was funny, cringeworthy in places, but funny enough to counter the cringe aspects of it lol Also, loved seeing Lizzy Caplan, as I always remember her fondly from Cloverfield :), and I knew that was the daughter from How I Met Your Mother!! Knew it! Actor-spotting is always fun."}, {"rating": "10", "text": "Leave the DeLorean in the garage, get in the tub! GREAT MUSIC, INTERESTING CASTING, FUNNY & NEAT ENDING....left me HOPING for a sequel!!!!! Movie was a GREAT escape, lots of 80's inside jokes, I can't wait to get the soundtrack and I'm really hoping there's a sequel to really catch us up what happened when they altered the future."}, {"rating": "10", "text": "Awesome, if your under 25 you might not understand some jokes but its awesome! SEE IT"}, {"rating": "10", "text": "I thought it was a ten, not saying ten as in \"art\" but it entertains. There was so much funny stuff that I was pressed to remember it all afer the show :D"}, {"rating": "9", "text": "Hilarious. Rob Corddry makes this movie. Crispin Glover was great too."}, {"rating": "9", "text": "Hot Tub Time Machine was much, MUCH funnier than I anticipated. I expected a mediocre movie in which I would force myself to laugh so that I didn't have to accept the fact that such a great concept had been ruined. Instead, I was treated to a laugh-a-minute, genuinely funny film where it seemed that the actors and writers were having just as much fun as they wanted the audience to. It greatly exceeded my expectations, and is one of the funniest movies I've seen in a long time. 9/10"}, {"rating": "10", "text": "I'm sorry, but anyone who says that this movie is anything less than greatness either has no sense of humor or really wasn't paying attention. If you're interested in story and character development go watch Precious or something, because that's not what this movie is for. It's a tongue-in-cheek masterpiece that kept the audience in stitches the whole way through."}, {"rating": "8", "text": "This was real funny, but the pacing is off when it comes to the humor because the beginning of the movie before they enter the time machine is so funny and then the rest of it is good but not as good. Every scene with Lou is funny, and I'm glad the writers didn't spend too much time as far as the love interest subplot with Adam went. I'd say you should see it because I don't think it would be as funny watching this as home than in the theater with friends."}], "recommendations": ["the_hangover", "a_haunted_house", "the_dictator", "one_year_one_night", "dumb_and_dumber_to", "30_minutes_or_less", "jackass_presents_bad_grandpa", "the_watch", "grown_ups", "this_is_the_end", "dinner_for_schmucks", "ted_2", "the_three_stooges", "nacho_libre", "ted", "miss_march", "dumb_and_dumber", "deuce_bigalow_european_gigolo", "knocked_up", "anchorman_2_the_legend_continues", "jexi", "couples_retreat", "the_other_guys", "movie_43", "scary_movie_2"]}