{
  "id": 74,
  "title": "Hotel Transylvania: Transformania",
  "starring": [
    "Selena Gomez",
    "Andy Samberg"
  ],
  "runtime": 87,
  "genre": [
    "Animation",
    "Comedy",
    "Family",
    "Fantasy",
    "Adventure"
  ],
  "description": "When Van Helsing's mysterious invention, the \"Monsterfication Ray,\" goes haywire, Drac and his monster pals are all transformed into humans, and Johnny becomes a monster. In their new mismatched bodies, Drac and Johnny must team up and race across the globe to find a cure before it's too late, and before they drive each other crazy.",
  "releaseYear": "2022",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/teCy1egGQa0y8ULJvlrDHQKnxBL.jpg",
  "categories": {
    "plot": 4.6,
    "acting": 6.0,
    "ending": 5.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 4.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "This animated franchise reminds me of Ice Age because of how quietly they managed to conjure up a fourth installment.Especially since they had no competition in their first episode, and more importantly, no expectations from the public.But like that other saga, the quality of Hotel Transylvania has steadily declined with each new chapter, and this fourth adventure is perhaps the most disappointing one yet.I admit that for their target audience they will still be an amusing experience, but I think this is the point at which they're must be told that their good run is over."
    },
    {
      "rating": "10",
      "text": "GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD good good good good good good good good good good good good good good good good good good good good good good good good"
    },
    {
      "rating": "0",
      "text": "This is the worst movie from the franchise and it's seriously one of the worst I ever saw in my life. Don't waste your time on it."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "10",
      "text": "goodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgoodgo"
    },
    {
      "rating": "8",
      "text": "Happy New Year, Streamers! We’ve left 2021 behind, but the show must go on. Last weekend, a favorite animated franchise came out with its 4th installment, Hotel Transylvania: Transformania. This sequel follows Drac and Johnny as they get entangled in one of Van Helsing’s mysterious inventions gone wrong. Each is transformed and must find a way to transform back before it’s too late! Of course, they have the help of Mavis and the other monsters of Transylvania as well. Let’s see if this installment keeps up the previous bar.No point in hiding it – this movie was just as good as the others. Definitely, not better but just as enjoyable. Realistically, if you and your family members like Hotel Transylvanias 1 through 3, then you’re in store for the same laughs. The gang is all here and the same ridiculous antics that were there before are here now. Now for some, that might be a negative but for the rest, that’s what they came to see. Either way, I chuckled it up from Van Helsing to Drac and Blobby to Johnny – everyone caught their shine at some point in time. The only thing different about this movie, which in a way isn’t that different, is the moral kids can learn from it. Here, the movie is telling us that doing things just to fit in isn’t the best thing to do because who you are is great and the others just have to see it. Also, see the best in people and not just what’s on the outside like a burnt marshmallow. Any way you hear the messages, it’s a much-needed lesson for our kids to learn in a society full of peer pressure. The movie went a bit hard on this topic, but they did a good job pulling it together.This is a clear case of a streaming big box of popcorn. This animated series hasn’t had a flop yet and Hotel Transylvania: Transformania is no different. Do I think they need to make more of these? Absolutely not, but this 4th installment is great fun for the family with good laughs and a great lesson to learn and re-learn. Families definitely should flip over to Prime Video and check out this movie."
    },
    {
      "rating": "4",
      "text": "Only watched for my man Brian Hull"
    },
    {
      "rating": "2",
      "text": "I actually liked the first three installments of this series, so going into it I wanted to like this one too. Unfortunately, this is by far the worst of the four movies. It failed to hold my attention for its already short 87 minute runtime, and I didn't laugh once at the humour(mostly slapstick). The animation is decent and the main story about Drac, Johnny, and Mavis is kinda cute with solid messages for the kids about honesty and acceptance, but this is not quite enough to redeem this movie. I get that its intended audience is kids/families, and maybe it would work for them, but for me it was uninteresting and unentertaining until the climax(which was easily the best part of the movie)."
    },
    {
      "rating": "0",
      "text": "Holy f*ck is this movie bad the comedy seems forced it’s very unfunny the plot is horribly scripted and the entire movie in general is a shipwreck"
    },
    {
      "rating": "6",
      "text": "Well, after three mediocre films, they made another one and fulfills what it is, but I'm gonna say that Hotel Transylvania: Transformania is the best in the franchise. It's an entertaining adventure of the characters and that's all, it has a good message at the end but they doesn't development it at all and it seems that the development that Dracula has had in the previous films disappears.Animation quality comes and goes, at times it takes a step forward and at others it takes a step back."
    },
    {
      "rating": "9",
      "text": "This movie was such a delightful surprise. Incredible animation, silly jokes, dash of emotion. Significantly better than it has to be. It doesn't take itself too seriously and that's what makes it great. Sit back and smile."
    },
    {
      "rating": "8",
      "text": "Really cool movie, maybe not the best but really not bad. There is a really great humor too!"
    },
    {
      "rating": "5",
      "text": "I didn't like this movie. It was pointless and the third one was a good place to stop the series. But no, this is Sony Animations, the people who give us sequels, even though we didn't ask for them. And I love this franchise. But this movie ruined a lot of things. The story is alright but it could have been done better. And nothing new happens in this movie. Except at the end when the hotel gets destroyed and they rebuild it. And when the end credits came up and I seen the small credits animation of the new hotel, I was sad. They had completely changed the hotel into.... well what Johnny would like it to look like. We went from an epic first film. To a slightly childish sequel. Then we had a good threequel and we could have left it like that. But then we have got the pointless and bad forth movie. I think the reason why I'm giving this 5 out of 10 was there was a line in the movie that made me agree. About halfway into the movie Johnny says \"if you always look for the bad in things, you will never find the best part\". I think it was something like that but I guess he was right. When I was watching this movie I was trying to look for the bad in things. Too bad there wasn't enough good things in this pointless movie to say it's good. I don't think this movie is terrible. But it is really pointless. ALSO I MISS ADAM SANDLER!"
    },
    {
      "rating": "0",
      "text": "COMEDY IS THE WORST THING DIDNT LAUGH ONCE THIS MOVIE IS HORRIBLE PLOT IS BAD AND COMEDY IS FORCEd"
    },
    {
      "rating": "10",
      "text": ""
    },
    {
      "rating": "6",
      "text": "I liked the movie. What can I say, I like this series. However; I’m getting real tired of us trying to make “Dracula liking Johnny” happen. The fact of the matter is that he’s a complete cluck up and he’s really not worth the emotional effort of someone who literally built a hotel to ensure the safety of monsters like him. It’s tired. The whole Johnny-messes-up-but-it’s-quirky-because-he-loves-Mavis-and-she-loves-him is TIRED. Can’t the boy ever mature? You’re telling me I gotta sit through 3 movies that make the vampire dad that’s literally been doing the best for everyone around him since day one look immature?"
    },
    {
      "rating": "5",
      "text": "I have to give Johnny some credit, I’ve never seen a regular guy be more of a spaz than your average cartoony character."
    },
    {
      "rating": "0",
      "text": "Pésima voz nada de carisma el doblaje esta muy mal actuado además de muy mala la  película aburre tanto su doblaje como la película"
    },
    {
      "rating": "0",
      "text": "it is bad omg selena gomez ruined it as always zzzzzzzzzzzzzzzzzzzzz,,,,,,,,,"
    },
    {
      "rating": "10",
      "text": "Selena's voice so colorfull for this animation. She's great all the time. Bir de kendi dilimde yazmak istiyorum. Hotel Transilvanya'yı Selena için izledim. O gerçekten inanılmaz bir insan."
    },
    {
      "rating": "10",
      "text": "Amazing movie, Loved it so so much, A fun movie to watch. Loved everyone in it and the storyline"
    },
    {
      "rating": "10",
      "text": "This is the world bast animation movie series of Sony pictures animation. I am very thankful of Genndy tartakovsky for made this movie series. And after watch this movie series I want to be a animetar like Genndy tartakovsky. And we all are waiting for Hotel Transylvania 5."
    }
  ],
  "recommendations": [
    "the_spongebob_movie_sponge_on_the_run",
    "bad_boys_for_life",
    "lost_in_space",
    "paw_patrol_the_movie",
    "barnyard",
    "night_at_the_museum_battle_of_the_smithsonian",
    "the_game_plan",
    "i_am_number_four",
    "ghostbusters_ii",
    "venom_let_there_be_carnage",
    "hannah_montana_the_movie",
    "national_treasure_book_of_secrets",
    "the_mummy_tomb_of_the_dragon_emperor",
    "garfield_a_tail_of_two_kitties",
    "diary_of_a_wimpy_kid_dog_days",
    "the_twilight_saga_new_moon",
    "hocus_pocus",
    "the_babysitter_killer_queen",
    "yogi_bear",
    "the_croods_a_new_age",
    "diary_of_a_wimpy_kid_the_long_haul",
    "goosebumps_2_haunted_halloween",
    "sonic_the_hedgehog",
    "alvin_and_the_chipmunks_the_squeakquel",
    "night_at_the_museum_secret_of_the_tomb"
  ]
}