{"id": 525, "title": "Hotel Transylvania 2", "starring": ["Adam Sandler", "Andy Samberg"], "runtime": 89, "genre": ["Animation", "Comedy", "Family", "Fantasy"], "description": "When the old-old-old-fashioned vampire Vlad arrives at the hotel for an impromptu family get-together, Hotel Transylvania is in for a collision of supernatural old-school and modern day cool.", "releaseYear": "2015", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/kKFgwQnR5q08UFsAvtoYyTIiHyj.jpg", "categories": {"plot": 6.580645161290323, "acting": 6.5625, "ending": 7.818181818181818, "soundtrack": 7.0, "cinematography": 5.0, "familyFriendly": 7.111111111111111, "funny": 7.205128205128205, "action": 8.0}, "reviews": [{"rating": "5", "text": "Hotel Transylvania 2 is like a hotel after Mavis baby proofs it. It’s fine for the kids and somewhat charming but the adults like Dracula will miss the edge and teeth. The heartfelt story of growing up, letting go is fine but nothing we haven’t seen before or done better. The humor and cutaway gags are appreciated but a tad distracting. If anything the film reveals that Gendy is far better suited for handdrawn animation. His efforts to bring his techniques from 2-d to 3-d are appreciated but some things are better kept in their own medium. Tartakovsky presents a film that is fine for casual viewing but nothing to sink your fangs into. Thankfully, Gendy is back in the realm of hand drawn animation where he belongs returning to form with a more gritty Samurai Jack."}, {"rating": "8", "text": "If you enjoyed the first Hotel Transylvania, the you'l enjoy the second one also. It's an excellent family movie that all ages will like, but uses the movie as a commercial for promoting Sony products and lots of technology jokes and recycled material from the first movie. But the movie is all-around cute, funny, and enjoyable."}, {"rating": "7", "text": "Fair children comedy for Halloween time. Even parents won't be completely bored if they don't mind childish humour. Graphic style is ok, but nothing special - most of the cartoons for children nowadays look more or less the same. Music also, however there were nothing special to remember."}, {"rating": "7", "text": "Consistently funny and has a great message of acceptance for kids; especially when there is so much homophobia and racism in the world. The bat that ends up being the main villain is the equivalent to Kim Davis, a villain in the real world. Adam Sandler's best work in years; a welcome surprise."}, {"rating": "8", "text": "(Mild Spoiler included)This movie is a very good movie with lots of humor for both adults and kids, that being said it's still not as good as the original. All the characters are in it pretty frequently and no one character gets more spotlight then the others. The ending could be considered kind of a cop out but is overall a satisfying ending to an overall great movie."}, {"rating": "8", "text": "First things First, I gotta say I was pleasantly surprised with the amount of humor in this film. Honestly, I was expecting something worse, but I was surprised at the end. Yes it has its flaws, but this film is still the fun, pleasant family film everyone came here to see. Though I personally thought the original was still better, I would still recommend this film. It just got off to a strong start, and then it started to drag. But in the middle of all this, Adam Sandler managed to pun some family jokes into the film, and like the summer movie, Minions, many children were laughing in the audience. Overall, it wasn't a needed sequel, but I still enjoyed it though I felt like I was basically just watching a longer version of the original."}, {"rating": "7", "text": "Although it left me a little disapointed this was a great sequel, maintaining the fast paced animation and great plot of acceptance between different people, going a little deeper and shallower at the same time compared to the original. Drac's second adventur is a lot of fun, but a little more directed to the children this around, having some more cliche moments and messages, though it never gets boring, with things always coming up and fast reaction following them, i would say this movie is a certain good for you and anyone you take with you"}, {"rating": "10", "text": "It improve's on the original in every way. The new characters( like Denis) are very beneficial. Denis is awesome, and Blobby is funny. The plot makes sense and everything is better then ever before."}, {"rating": "9", "text": "I loved the original, and this improved it a lot. Again, the Halloween feel is great, and has more monsters than the first. The story is improved because now, they have a half monster, half human baby! You are in for a laugh!"}, {"rating": "7", "text": "This Sony film was made by Sony, and so...ny Sony's Sony advert is sony Sony it's basically Sony."}, {"rating": "10", "text": "This is a heart-warming sequel that shows great character development. The humor hits all the right chords and the moral tale is one that you will be proud to share with your entire family. Take your kids, take your parents! We LOVED this movie!"}, {"rating": "7", "text": "I don't have to see this movie twice so I can give it a good rating. If you people do that to me, it'll affect the score to the movie you wanted me to see."}, {"rating": "7", "text": "I watched the first film, which I thought was so-so but had potential, and liked it enough to give the sequel a shot. Thankfully, It's much improved and quiet enjoyable. The cast does a very good job, The story avoids being overly cliched despite it being a bit predictable, and it's short run time makes it a pretty easy movie to sit through. Overall, I would happily sit through a third film. They do enough justice with the sequel to give me hope for the future of the franchise."}, {"rating": "8", "text": "A return to Hotel Transylvania is a great one, while lacking some of the charm of the previous movie and focusing more on the expanding Dracula family, it's still a fun, good movie to enjoy.\r The humor of aging monsters are still there, with an underlying story of acceptance. I find it unfortunate that Dracula's Father plays such a short and minor role, since he really steals the show at the end. But they managed to roll it up into a nice, neat little ball.\r It will be interesting to see if they choose to follow up with a third movie as the son grows up around monsters and learns the ropes of vampires."}, {"rating": "7", "text": "Favorable entertainment. It is a warm loving heart felt adventure that has good animation to go with it. Babies are always cute and this one is no exception."}, {"rating": "9", "text": "A hilarious, family-friendly movie that surpasses it's predecessor in quality. Messages like loving people for who they are and not being judgmental of people who are different are included among all of the laughs. The theme of familial love leads to some heartwarming moments.\r The animation game is top-notch. Everything looks gorgeous and moves with a fluidity even some of the best looking of animated movies would have trouble pulling off. Everyone involved does fantastic voice work and really bring their characters to life.\r The return to this unique and goofy monster filled world is one worth watching. There's enough humor here to please any member of the family no matter what their age is. Kids are going to eat it up and parents are going to find plenty of laughs to share with them along the way. It's a hit that's fun for the whole family. What more could you ask for?"}, {"rating": "8", "text": "More monster characters, more amusing moments and more exciting parties have upgraded an additional star rating for the hotel this Halloween season. The animation starts off immediately from where it ended previously, progresses in a moderate pacing, filled with numerous hilarious moments though with the usual ridiculous Adam Sandler type of humors, it's not overly used and creates just sufficient amount of laughter. The message about to change and to adapt in order to fit oneself into a new environment is well simplified to cater children's understanding while the eye popping, colorful visual effects together with pop styles emerging into the story are well crafted to make young adults feel like kids. Overall, the sequel is an energetic animation compared to its predecessor, heart-warming and certainly a satisfying family goers movie to enjoy."}, {"rating": "4", "text": "Without doing any spoilers. This is a average movie for teens and adults and a great animation for kids! Overall i wouldn't watch it again, but i still enjoyed it."}, {"rating": "4", "text": "While better than the first film, Hotel Transylvania 2 has a messy plot, mostly unfunny jokes, lots of cliches  and some unnecessary characters. I suppose Mel Brooks did a good job in the movie, but that can't cover up the fact that I only laughed twice, and I forgot nearly all the jokes afterwords. I suppose if you liked the first movie, you should see this, but otherwise it would be better to spend your money somewhere else (or just see another movie)."}, {"rating": "10", "text": "I enjoyed the first part, but with this second installment, it is more enjoyable and fun.\r Watch this movie online http://www.watchfree.to/watch-2a4033-Hotel-Transylvania-2-movie-online-free-putlocker.html"}, {"rating": "8", "text": "Оценки у него лучше чем у первого(почему-то),он неплохой нооо...сюжет хуже,юмор повторяется,но все же мне он нравится,фильм по прежнему смешной,интересный,красивый и круто анимированный."}, {"rating": "8", "text": "The sequel to the hit animated comedy proves it worth the loved it gets and showcases raw emotion, fun and pop culture all wrap into one, Overall, Hotel Transylvania 2 will delight fans and may covert many non fans."}, {"rating": "0", "text": "This is one of the worst movie sequel's i have ever seen, the story is predictable and act's like a cheap cartoon, not even a good one, character's that are useless, barely even have a personality and unlikeable, plus the pointless animation that would look better in 2D than computer animated, not to mention they're movement's that seem that all of the character's drank 900 000 red bull's, this is a movie that i only recommend for children from 4 to possibly 10 year's old  with an IQ 5 and under..."}, {"rating": "1", "text": "SEIROUSLY? Why do People seem to like this? The Humor was unfunny, Story was just ehh with not the best ending, sure the animation was fine, but the characters besides Drac, Dennis, and Mavis have nothing to do with the plot. I don't get why people seem to like this. I found it Uninteresting an I only chuckled 3 times....."}, {"rating": "6", "text": "This sequel picks up as the titular hotel has been open for business to all types of monsters, as well as humans. Drac's daughter marries a mortal and they have a son. Of course, grandpa (Adam Sandler) wants the kid to be a vampire, but will he? The energy never lags and the dialogue zips by. Unfortunately, most of it isn't especially clever or funny. The movie is crammed with wacky characters (played by a big cast of comic actors) and some of them are entertaining. The design is bright and fun. Less discerning children will likely be entertained, but there's nothing special going on."}, {"rating": "1", "text": "The worst animated film in ages. Adam Sandler is annoying as always. The gags don't work, the plot is a mess, the film is annoying to such an extent that it made my eyes bleed."}, {"rating": "10", "text": "Hotel Transylvania 2 Is Funny Sequel Every See Of My Life It's Very Very Very Funny Sequel Animation Is Awesome Actor Is Awesome Characters Is Awesome Everything Is Awesome"}, {"rating": "5", "text": "This series is not witty enough to be good. It is mostly decent animation with haphazard writing."}, {"rating": "8", "text": "It's vampa time!\r Frankly, I was not thinking of writing a review for this. You know, some animated movies come and go unnoticed, so I believed it would be one of those. In fact, I did not like the first film much, that is the reason to watch it so delayedly and with a minimum expectation. Better late than never, well, I regret for viewing it so late. One of the best animation of 2015, maybe in the top 10 or 15.\r Well, it was a one liner, like, the daughter wants to move to the human social world thinking that might do good for her son's future. But her father plan to stop her getting away from him and the hotel. So those attempts are the rest of the movie. I liked the movie very much because it was very funny, especially the lines were and its accent, Adam Sandler nailed it.\r I have said millions of times that I don't know why Americans and critics hate Adam Sandler that much, I don't know about the rest of the world but I kind of like his films. The last few films like 'The Cobbler', 'Pixel', 'Men, Women & Children' and this one were so much better. It did not bring the old Sandler, but brought us a different and new Sandler on screen. He was definitely the main reason for this film's success.\r Don't just a book by its cover, well, here the cover is the previous installment. The first part was not a must see IMPO, but this is especially for the animated movie fans. PG rated movie, but still it might scare mildly for below 8 kids, only because of the theme. I had a great time with it and expecting it to do the same impact on you as well. And I can't predict the third will be as lucky as this one, lets wait and see.\r 8/10"}, {"rating": "7", "text": "It isn't as hilarious or as polished (for an kids movie) as the first one, but this is still a solid, crisply animated family flick. It has an annoyingly contradictory message, however it is relatively overshadowed by it's running gags and adult humour."}, {"rating": "7", "text": "I liked both the first movie and its sequel.  I wouldn't say that is was a masterpiece or anything hugely new to the family comedy genre, but I really liked it.  Definitely one I will put in my collection when it comes out on dvd."}, {"rating": "7", "text": "My 6 year old daughter loved the movie, and I enjoyed it enough to give it a 7. Not gonna lie, a lot of jokes felt were forced and tired. But that was balanced out by the good heartfelt shenanigans of likable characters."}, {"rating": "6", "text": "Hotel Transylvania 2 kind of falls into the same template as the first movie but it pushes all the right buttons. I'm sure that many young kids get a real kid out of it which makes sense why it took in so much money over its theatrical run. All the important voices come back and for the most part they do a great job and their also some new characters with great voices behind them as well. I had a few good chuckles with it and its just an enjoyable film and the animation is pretty decent."}, {"rating": "8", "text": "A solid sequel and I can make the standard statement „Not as good as the prequel but still worth watching“. It continues seven years after the prequel. The world is aware and not afraid of the existence of monsters as they are more treated like celebrities. Mavis and Johnny are happily married and have a son named Dennis. Dennis has not shown yet any signs of his vampire heritage and his parents think about raising him in human company instead because it is dangerous for him with the monsters (Not by ill will or malice more by accidents or oversight). For Dracula this is disturbing and he wants Dennis to use or learn to activate his vampiric abilities as his next birthday in a few days is a crucial one. If he cant channel his abilities until then it will not be possible to archive them later by any normal means. This is a set up for the movie. The story impresses me. While it feels not as refreshing they tried something new atop of the established old. They could have played it safe but chose to add something. A good mixture of old and new. Again they archive good humor with more serious themes while avoiding both harming the other. They deal with some serious stuff here and succeed for most parts. I will admit however that it works less well than in the previous movie and is in a few scenes borderline for me. However the final act and conclusion are excellent and improved my rating. The great cast of voice actors return for their roles with Adam Sandler who works well here, Fran Drescher, Selena Gomez, Kevin James, Andy Samberg and David Spade. All resume the roles and fully deliver a great performance. For the Newcomers we have Asher Blinkhol as Dennis and the legend himself Mel Brooks as someone I will not spoil. Also we meet Johnny's family who fits in nicely but made some mistakes (The one that are born out of best intentions but mixed with misconception). The Animations have improved as to be expected. I repeat that the style is excellent and is more fitting than a more realistic approach would be. The animations mix perfect with the voice acting and you never doubt the characters. The director Genndy Tartakovsky delivers again and cements the statement that he is the real asset of Sony animations. Overall this is a good animated movie. We enjoyed it and wanted more movies in the franchise. It delivers while being weaker than the prequel which is normal. I recommend the entire trilogy so far (Maybe quadrilogy as part 4 is announced but I have no details yet)."}, {"rating": "5", "text": "Hotel Transylvania 2 is a fun, yet equally silly movie, that amounts to an inconsequential movie directed solely at kids. If you have kids, this is a good movie to take them to, because it's funny and beautifully animated. However, if you hope you'll enjoy the film also, you may be disappointed. The voice cast is good, and some of the characters are well developed, but the film is very silly. The movie lacks a feeling of relevance, because there are no real consequences, and thus lacks any emotional depth. The silly tone makes the film good for little children, and if you liked the first film, you'll likely enjoy this one as well, but those looking for anything other than kids fluff, will be disappointed. In conclusion Hotel Transylvania is funny, sleek, and perfect for small children, but falls flat when it comes to delivering any real emotional depth, and ends up shallow."}, {"rating": "7", "text": "Hotel Transylvania 2 takes a turn for the better in the series. Yeah it still has issues but it still is a good film. It's more lighthearted and funny than the first film that's for sure. Again the only thing dragging the film down his Drac's and Mavis's toxic relationship. You'd think that he would just let his daughter live her life at this point. I digress, this flik was funny and heartwarming and doesn't deserve it's critical wrath."}, {"rating": "9", "text": "Hotel Transylvania 2 is a fantastic movie directed by the amazing Genndy Tartakovsky and also written by Adam Sandler and Robert Smigel. I truly enjoyed this movie and I couldn't stop laughing many many times throughout. The critics have been very harsh to this movie just because Adam Sandler is in it but that's stupid because this movie is spectacular in my opinion. The ending feels a bit different and weird but everything else is simply funny and overall has a great message about family."}, {"rating": "6", "text": "Hotel Transylvania 2, is a story where the Dracula gang has taken up straightness in the story, more and more fun and interesting, the characters are increasingly interesting, but much remains to be corrected from the first film."}, {"rating": "7", "text": "Quite a few clichés but definitely an improvement over the first movie. The jokes were noticeably funnier (sometimes corny but funny nonetheless)  and the pop culture gags were more toned down and less over the top. I thought the first two acts were mostly enjoyable but the third act is where it really picks up. Why is that, you ask? Two words: Mel Brooks. He steals every scene he's in and most of the funniest jokes in the movie come from him. He's such a talented comedian. It did have problems though: much like in the first movie, the villain is rather forced and some of the lines were too cheesy (example: \"You've let humans into your hotel but not into your heart\"). Still, it's pretty enjoyable and is more likely to entertain adults than the first one. 7/10."}, {"rating": "4", "text": "just watched this and i think its not a good movie i found it too stupid, hotel transylvania didnt need a sequel. sorry but no it was sooo heavy and annoying. 4 for me."}, {"rating": "4", "text": "Let's sink some teeth into this sequel. Hotel Transylvania 2 is enjoyable yes, but can be a bit lacking compare to the first movie. its jokes can be a half laugh and the story seems to center on some thing that i find myself going why? it can be a bit of a mess but at the end they seem to pull off this mummy movie with just bandages leaving it together."}, {"rating": "6", "text": "It was not as good as the first one. It recycled humor, to kidish, and characters are not as good as they were in the first one. Plus while the plot isnt supost to be good, it just sucks."}, {"rating": "7", "text": "Hotel Transylvania 1 was great, it had fast paced movement which added to the style and had great heart which we all like in these pictures. Where as the second one suffers from the same problem as Pixel where they throw old culture references in so get the older audience to give a smile or laugh and throw in tones of slap stick for the younger group. Now on paper this would seem fine but unfortunately like we saw with Pixel this isn't really the case. With all that being said Hotel Transylvania 2 isn't a bad movie you will be some what entertained, and get a few laughs in."}, {"rating": "7", "text": "Adam Sandler brings now a more-human story, with boring story-telling, nor funny enough to put the audience in shock and unremarkable story for try to win some money and continue the original film. But it may be better than the first one talking critically."}, {"rating": "7", "text": "Buena película, con un lindo mensaje y entretenida hasta el final, mejor que la media."}, {"rating": "4", "text": "Not a big fan of Sony Animation. This is a margin better than the original, but that's not saying much. It may not be awful, but it's still far from great."}, {"rating": "9", "text": "Now that Dracula (Adam Sandler) has opened the Hotel Transylvania's doors to humans, things are changing for the better; however, Drac is secretly worried that his half-human grandson, Dennis, isn't showing his vampire side. So, while Mavis and Johnny are away, Drac enlists his friends to help him put the boy through a \"monster-in-training\" boot camp. But things really get batty when Drac's cantankerous, old-school dad (Mel Brooks) pays an unexpected visit. Hotel Transylvania 2 is marginally better than the original, which may or may not be enough of a recommendation to watch 89 minutes of corny, colorfully animated gags from Adam Sandler and company. I'll give Hotel Transylvania 2 an A-."}, {"rating": "7", "text": "This film is the sequel to \"Hotel Transylvania\", an expected sequel given the success of the first film, which helped Sony Pictures Animation to assert itself as one of the great animation studios. Although not as good as the first film, it is not far behind and manages to entertain the audience very well.In this film, we start by watching the expected wedding of Mavis, Count Dracula's daughter, with the human Jonathan. After a short time, they both have a son, and the Count will turn out to be an affectionate and loving grandfather. It happens that he wants his grandson to be a vampire too. Thus, as the child approaches the age of five, the time at which the vampire's canine teeth should appear, the Count reveals himself to be increasingly obsessed with that idea, forcing Mavis to take action.The film is quite good but the story told is not as effective as that of the first film. The characters are the same, with the addition of several humans from Jonathan's family, but to whom little relevance is given. The jokes appear punctually and work well, being usually played by the Count and the main monsters, who are no longer able to scare, behaving in a less monstrous way. The dialogues also work wonderfully. The ending was the most downright negative point of the film, as it completely clashes with what happened before and has almost no connection with the main plot. It is as if it has been glued to spit to give the film an extra half hour in length.Genndy Tartakovsky again assures the direction and does it well, keeping the bulk of the team and the cast of the previous film. Adam Sandler continues to give voice to Dracula and prove to be very good at it. Equally good were the contributions of Kevin James, Steve Buscemi, Megan Mullally, Mel Brooks and David Spade. Selena Gomes and Andy Samberg also did a good job, but their characters have been relegated to a frankly secondary role and have been quite underdeveloped, with Mavis permanently irritated and Jonathan even more stupid and immature than in the first film.Technically, the film is based on computer animation and good quality CGI. I believe that the visual quality is even better than that of the first film. Good colors, brightness and sharpness are very evident characteristics here. The choice of songs and the soundtrack worked much better than in the first film. I especially liked the song \"I'm In Love With a Monster\", it is in your ear and has rhythm."}, {"rating": "5", "text": "Hotel Transylvania 2 has its moments, but a good portion of its gags are unsuccessful in making me laugh and some of the parts in it are just simply unrealistic (even for a monster movie). The story isn’t as good as the first, but still manages to retain some of the original’s charm. This was an okay attempt for a sequel, but it wasn’t quite as original or funny enough as I would have liked."}, {"rating": "10", "text": "Hotel Transylvania 2 is once again directed by Genndy Tartakovsky, written by Robert Smigel and Adam Sandler, and starring Adam Sandler, Selena Gomez and Andy Samberg.The story is close to the first one, it's about Dracula and his friends try to bring out the monster in his half human, half vampire grandson in order to keep Mavis from leaving the hotel.For me, Hotel Transylvania 2 is better than the first one in everything, especially the humor... Let's get into everything in deep!Alright, HT2 is presenting a very simple message, with the same hidden message of the first one (racism), but this time is deeper than it was in the first one. But believe me, you won't predict the ending of this movie this time, and it's kinda bad, 'cause sometimes the predictable ending is better than the unexpected ending, cebause -as Dennis said- this ending ruined the message for kids, but for me as a teenager it didn't effect me, or made me hate or underrate the movie.The voices still ear-comforting and fitting, and still Selena Gomez is the best and the light-taker of the whole movie.Now with the CG-animation that it's totally improved, like in every way. Now it's totally eye-comforting. Like I said, almost everything is way better than the first one, so let's get moving to the best thing of this movie.. humor!This movie was totally better than the first one at this, it has more funny scenes, more rude humor and unexpected. This movie was hilarious, every joke worked with me, sometimes you don't even expect a joke, but you find lots. They actually made some simple stuff laughable!Hotel Transylvania 2 is better and funnier than the first one, and if you liked the first one, you will like one as well. I'm gonna give HT2 an A+.Okay, guys, thank you as always for reading my review, let me know if you like my reviews or not, and I welcome all the comments."}], "recommendations": ["despicable_me_2", "ice_age_the_meltdown", "hotel_transylvania", "minions", "peter_rabbit", "hotel_transylvania_3_summer_vacation", "storks", "captain_underpants_the_first_epic_movie", "the_lego_movie", "ice_age_continental_drift", "megamind", "goosebumps", "incredibles_2", "spies_in_disguise", "shazam", "the_croods", "the_lego_movie_2_the_second_part", "puss_in_boots_the_last_wish", "turbo", "penguins_of_madagascar", "ice_age_dawn_of_the_dinosaurs", "cloudy_with_a_chance_of_meatballs", "cloudy_with_a_chance_of_meatballs_2", "night_at_the_museum_battle_of_the_smithsonian", "the_angry_birds_movie"]}