{
  "id": 171,
  "title": "Hotel Rwanda",
  "starring": [
    "Don Cheadle",
    "Sophie Okonedo"
  ],
  "runtime": 121,
  "genre": [
    "Drama",
    "History",
    "War"
  ],
  "description": "Inspired by true events, this film takes place in Rwanda in the 1990s when more than a million Tutsis were killed in a genocide that went mostly unnoticed by the rest of the world. Hotel owner Paul Rusesabagina houses over a thousand refuges in his hotel in attempt to save their lives.",
  "releaseYear": "2004",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/p3pHw85UMZPegfMZBA6dZ06yarm.jpg",
  "categories": {
    "plot": 8.736842105263158,
    "acting": 8.916666666666666,
    "ending": 9.0,
    "soundtrack": 4.0,
    "cinematography": 4.0,
    "familyFriendly": 0.0,
    "funny": 9.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "there's always room..Hotel RwandaTicking for around 2 hours, the material offered to the audience is concrete and interesting enough to invest and this is where it excels as it demands attention from the first frame hitting hard and fast. The screenplay writer and director, Terry George might be the weakest link in this feature for it needed a better execution. And on performance side, Don Cheadle has got it covered and doesn't even require any support for he is capable and does carry it all on his shoulder. Hotel Rwanda; if excels on explicit writing and stellar performance, the objective somehow seems a bit distracted as it fails on captivating the audience and create the anticipated drama on screen."
    },
    {
      "rating": "0",
      "text": "Dora, bootsCome on, DoraDo-do-do-do-DoraDo-do-do-do-DoraDo-do-do-do-DoraDo-do-do-do-Dora, let's goDora, Dora, Dora the explorer(Dora)Boots and super cool as Dora, DoraNeed your helpGrab your backpack, let's goJump in, vamonosYou can lead the wayHey! Hey!Do-do-DoraDo-d-DoraDo-do-doraDo-d-DoraSwiper no swipingSwiper no swiping(Oh man)Dora the explorer"
    },
    {
      "rating": "10",
      "text": "Hotel Rwanda was one of those films I initially put off seeing for reasons I don't really know, but after seeing it that decision is one of those decisions that I've regretted as it turned out to be one of the better films I've seen in a while now. Hotel Rwanda is beautifully shot and the scenery is striking while still being authentic without being too clean. The story is always compelling and powerful, with plenty of gut-wrenching and poignant moments while never feeling preachy. The film is excellently directed and scripted too, while Sophie Okonedo, Joaquin Pheonix and particularly Don Cheadle give superb acting performances. Overall, a truly fantastic film. 10/10 Bethany Cox"
    },
    {
      "rating": "0",
      "text": "well you see this movie is not that touching. because there all actors. Dora is way better. plus BobTheBuilder is way more fun to watch and exciting. thank you"
    },
    {
      "rating": "8",
      "text": "----------------------------------7.9/10-----------------------------------"
    },
    {
      "rating": "7",
      "text": "A good movie presenting a story that needed to be told. While emotionally and morally self-evident, it was strangely lacking in lasting cerebral understanding. A film done well within the limits imposed on itself."
    },
    {
      "rating": "10",
      "text": "One of the greatest movies of all times. Connects with the viewer on a political, moral, romantic, personal, and work ethical level."
    },
    {
      "rating": "10",
      "text": "There is no doubt in my mind that the miracles that were depicted in this movie were from God. It was a very moving and powerful movie."
    },
    {
      "rating": "8",
      "text": "So good."
    },
    {
      "rating": "9",
      "text": "A truly emotional movie that highlights the disgraceful neglect of atrocities that occur in Africa. For the family featured it was a happy ending unlike for millions of others."
    },
    {
      "rating": "10",
      "text": "just a great movie. it caputures the reality and is justs an awesome file."
    },
    {
      "rating": "10",
      "text": "A wonderfully acted, meticulously observed political drama."
    },
    {
      "rating": "9",
      "text": "This was a very good movie. I'm only 14 and I thoroughly enjoyed it. The acting by Cheadle was terrific, and most of the plot was done spectacularly. I wasn't too bloody, but was very, very sad. It really is hard to believe that something like this could have happened only 15 years ago."
    },
    {
      "rating": "10",
      "text": "ONe of the most inspiraional movies I have seen in a long time. It shows that no matter what and in the time of reckoning that one person can come out and change it for a country. Don Cheadle was brilliant and showed courage and teanacity to overcome the Hutu militia."
    },
    {
      "rating": "10",
      "text": "This movie was insane. I am 14!!! and this movie touched me greatly. It made me think this only happened 14 or 25 years ago. If you put you self in side one of those people who watched there children,mom,dad,brother or sister get chopped up with a knife or beaten to death. What do you think? This movie deserves 10/10!!!"
    },
    {
      "rating": "10",
      "text": "Whether what others say, this is certainly one of the best dramas out there. My intention to watch this film was really for suspense, but I got more than what I expected. And this film goes to my list as the most moving film I have ever seen.Can't help but cry."
    },
    {
      "rating": "10",
      "text": "I was 11 when I watched this heartbreaking movie! I can say it made my tear up watching people being killed. I handled it well though because the point in my class was to see what is actually happening in the world of ours. It touched my heart so much! Wouldn't you think I am too young to watch a rated R movie?"
    },
    {
      "rating": "9",
      "text": "Let not the following make same mistake... remember what the history taught us in Hotel Rwanda."
    },
    {
      "rating": "10",
      "text": "Brilliant film!"
    },
    {
      "rating": "10",
      "text": "Our generation's parallel to the Holoacaust. This film will stay with you always."
    },
    {
      "rating": "10",
      "text": "A truly powerful film, with SUPERB acting. Why was this film looked over for a Best Picture nomination?"
    },
    {
      "rating": "8",
      "text": "Great film on an important topic. I was also greatful that the movie tried hard not to potray the extent of the violence."
    },
    {
      "rating": "10",
      "text": "This is one of the best films of the new millennium. Don Cheadle and Sophie Okonedo deserved to win the Oscars that they were nominated for! Their acting was breathtaking, and their chemistry was magical."
    },
    {
      "rating": "10",
      "text": "A deeply moving film with great performances all around. Don Cheadle and Sophie Okonedo were outstanding."
    },
    {
      "rating": "10",
      "text": "One of the best films of the 21st century. I could not believe Hotel Rwanda was not nominated for Best Picture, it absolutely deserved it. Don Cheadle was great as usual, but Sophie Okonedo's performance really shocked me. This woman is amazing!"
    },
    {
      "rating": "10",
      "text": "5 stars. Finaly a good story without a typical black character (drug dealer, assassin, and other stuff).Many people could say that is awfull but they only say that because they never experienced a situation like that.I have 2 say that even if the movie was the crap that are saying, i would give the same 5 stars to the director for having the courage to expose this horrible matter."
    },
    {
      "rating": "10",
      "text": "Unfortunatley Mr. Hall does not know that the truth of that horrific event was exactly how it happened. 1 million people died in that tragic event. If those people were able to govern themselves do you honestly think that this horrible event would have been taking place. People like this are exactly what this movie referred to. Unfortunately, these people will never see the truth for what it is. Amazing movie, amazing acting, amazing voice to the million people who lost their lives. Thank you."
    },
    {
      "rating": "10",
      "text": "Great film. Don was spectacular in his role. many emotions."
    },
    {
      "rating": "9",
      "text": "Beautifully acted, and portrayed. What people and critics must understand is that Rusesabagina was not a saint and that the Hutu population were not all evil and corrupt. Imagine having to choose, as a Hutu, whether to kill your neighbors and their children, or have yourself and your children be killed. That is what many of the nay-saying critics below do not understand. In that genocide there were three types of people; the Hutu extremists, the Tuitsi victims and the moderate Hutus. The extremists killed the other to groups bcause both were a threat to their goal: To wipe out the entire Tutsi population. At the end of thd movie, when the Tutsi \"rebels\" are shooting at the Hutus who are evacuating the country, it is also important to understand two more things; One, the group of Hutus running away is made up of mostly innocent Hutus but the Tutsi \"Rebel\" Army neither knows this or have the time to figure it out. Two, most of the \"rebels\" have lost family and friends to these people and therefore are pursuing reckless revenge, hence the \"not caring\" part. Truefully, this movie did not show ENOUGH bloodshed so it came off a little weak and civilized as to what it was: A barbaric GENOCIDE."
    },
    {
      "rating": "10",
      "text": "Wow! This movie was outstanding. How did Don Cheadle not win the Oscar for his performance. A deeply moving film with an inspirational performance. You MUST watch this movie."
    },
    {
      "rating": "10",
      "text": "An oustanding film that deserved it's acclaim."
    },
    {
      "rating": "10",
      "text": "Stunnning and compassionate film!"
    },
    {
      "rating": "10",
      "text": "what a moving inspiring movie."
    },
    {
      "rating": "10",
      "text": "Hotel Rwanda benefits greatly from being based on true events - it prevents the audience from ever being able to deny what they have seen. You'll want to pretend what you've seen was never real because the movie saves up its violence. Despite being set during a genocide, it is very sparing with the horrors it shows, giving each incident a much greater emotional impact. Don Cheadle's amazing performance as the movie's highly sympathetic and interesting main character serves as the backbone of the plot. The events that bombard him are infinitely watchable and morbidly engrossing, and take your mind off the movie's few flaws. Hotel Rwanda does very little to explain the conflict between the Hutus and the Tutsis, and the genocidal antagonists are nearly all one-dimensional - plot points that are casualties to what this movie is about. It isn't about the Rwandan holocaust, but the events in that man's life as Rwanda fell apart. Its messages are bitter, of shame to the foreigners who didn't care or didn't do anything to intervene, of native cowardice, and of the terror of irrational hatred and chaotic violence. Yet it is not a hopeless movie, nor even a pessimistic movie. It's simply honest, and more emotionally balanced than you could expect it to be. And again, anything unrealistic is saved, because it really happened. By far one of the best \"based on a true story\" movies to date."
    },
    {
      "rating": "10",
      "text": "A truly outstanding and moving film. I challenge anyone with a decent IQ and a bit of humanity in them not to be moved by it. The performances of the two leads are outstanding and the film conveys the full horror of the atrocities that occured. A film I am not ashamed to say moved me to tears but also left me feeling uncomfortable with my own apathy to the horrors that took place in the mid 90's. This film ranks as one of my favourite of all time not quite as good as the similar themed Schindlers List but equally as heart breaking."
    },
    {
      "rating": "10",
      "text": "Film threat- africa is experiencing the various messes it has because of the exact traits that some african leaders have that you say this film negatively depicts. for god sake man, how could an atrocity like this happen where sensibility and intelligence reigned? look no further than robert mugabe to see that the faults pointed out in some african leaderships, in this film are very accurately depicted."
    },
    {
      "rating": "8",
      "text": "Cheadle's performance is amazing but the movie just didn't connect on all the levels that a Schindler's list did. The opening song just didn't fell right to me and really messed with the tone the movie would try to set later. There were some rather intense scenes and some scenes that made you shake your head with disgust, but the emotional attachment and the tears that should follow an uplifting story just weren't there. It might have been that the movie was a bit short (I know 2 hours isn't short but with a movie that is so character driven it never hurts to be a bit longer) and you never really got attached to the victims as we did with Schindler's List. I am in no way implying that Hotel Rwanda isn't good as it is a very good movie and one that all people should watch to educate themselves about what is really happening in Africa today, but only that it could have been a home-run but felt more like a triple!"
    },
    {
      "rating": "8",
      "text": "Really good! Certainly a film that won't be easily forgotten! If dealing with a real history is very shocking and, unfortunately, still present, because many countries still suffer similar rebellions, as we see in the news about what happened recently in Egypt, and Libya is booming! \"Why are people so cruel?\" I would like to know too. But there are also people willing to help! I think this campaign is that the world needs, people have to react! Do what they can! I think the actors although aren't well known (apart from Nick Nolte) surprise! I was glad to see that Americans don't get to save everybody, as in several war movies! Very true what the reporter talks about the people watching the news and say \"Oh, my God, how awful\" and continue to dine with their families! Is what we do! But I think it might be different if anything awaken within us to show that we can indeed act. A film about violence, but also about hope, which I think everyone should see!"
    },
    {
      "rating": "10",
      "text": "Amazing film. If I told myself Catch A Fire was a movie Iâ"
    },
    {
      "rating": "7",
      "text": "A fairly moving film with good performances and music. Cheadle is very good."
    },
    {
      "rating": "10",
      "text": "Hotel Rwanda is a 2004 film directed by Terry George. The story is about the massacre occurred in 1994 in Rwanda, where Hutus massacred almost all Tutsi and of how Paul Rusesabagina found refuge and saved 1200 Hutu and Tutsi. A story that does a lot and think that speaks of the courage of Paul who saved so many lives and the world feigned ignorance. Excellent directed by George and the cast."
    },
    {
      "rating": "9",
      "text": "Incredibly impactful and powerful, Hotel Rwanda is a brilliantly crafted film that really hits the viewer quite hard thanks to great writing, storytelling, and a phenomenal performance from Don Cheadle. Without Cheadle's performance, the film would still be very good, but his performance elevates it into the stratosphere of \"great\" films. The film, at every turn, leaves you on the brink of tears with its power as it pulls the back the cover on the Rwandan genocide. At no point did Rwanda receive the level of help they needed from the Western world, which is truly tragic and is touched on repeatedly throughout the film. An absolute indictment of the West and those who let this atrocity happen, Hotel Rwanda is just the Rwandan Schindler's List. It is far more than that and, honestly, may be just as good or better than that film. Cheadle is phenomenal and he truly commands the screen in Terry George's breathtaking and important film."
    },
    {
      "rating": "8",
      "text": "Pathos and hope comprise the main building blocks of Terry George's \"Hotel Rwanda,\" a film that attains greatness - not just for its effortless storytelling ability, but also because of the significance that that story happens to possess."
    },
    {
      "rating": "9",
      "text": "The setting is perfect, I dont know any other good movies about the Hutu - Tutsi conflict. In addition the story is very good, it is always tense, and it shows the genocide without much censor. Just sometimes the scenes were not realistic or bad made. Some of the actors didnt convince me always. But on the other hand it is remarkable, that most of the story is true. Anyway there should be more movies about that topic."
    },
    {
      "rating": "10",
      "text": "Es la lista de Schindler pero version africana que relata como un administrador de un hotel salva la vida de   unos 1200 hutus y tutsis durante la guerra civil entre estas dos etnias, increiblemente rodada, grandes interpretaciones, esos momentos de gran tension, una pelicula que muestra la deshumanizacion de las personas, una de las mejores peliculas que he visto en mi vida."
    },
    {
      "rating": "8",
      "text": "A riveting story, that's slightly dampened by the sometimes oblique messages it gives about the harshness and horrors of the Rwandan genocide, but redeems itself with a hefty performance of Don Cheadle. It is toned down, both in language and violence, which destroys a historical film rather than make it more suitable to younger people. But I can see why it is acclaimed, but it is rather \"safe\"."
    },
    {
      "rating": "10",
      "text": "Great thought-provoking drama to be engaged in. The movie felt so natural and raw, like downing a straight shot of whiskey. Don Cheadle gives the performance of his career in this great film about the struggles during a very tense rebellion in Rwanda between the Hutu militia and the Tutsis. This film will stock with you for the rest of your life."
    },
    {
      "rating": "7",
      "text": "With an interesting subject, a great story and great acting, Hotel Rwanda has everything to succeed.If it wasn't for it's overlong running time, it might easily have been an instant classic."
    },
    {
      "rating": "8",
      "text": "Hotel Rwanda is great. It tells it's story so well, that you cannot help but be compelled to watch more; you are spellbound, despite the horrific images and the sadness that comes with each scene. The movie is incredibly good and touching."
    },
    {
      "rating": "7",
      "text": "I really like this movie, and the fact that was based on a true story makes it amazing. But....! I thing that need a little bit more action. Yes.... even more!"
    }
  ]
}