{
  "id": 3828,
  "title": "Hotel Artemis",
  "starring": [
    "Jodie Foster",
    "Sterling K. Brown"
  ],
  "runtime": 94,
  "genre": [
    "Thriller",
    "Science Fiction",
    "Action"
  ],
  "description": "Los Angeles, June 21st, 2028. While the streets are being torn apart by riots, the Nurse, who runs a clandestine hospital for criminals in the penthouse of the Artemis, a closed old hotel, has a rough night dealing with troublemaker clients: thieves, assassins, someone from the past and the one who owns the place and the whole city.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vaZMpZOhhkKOYz0MHCx4vDABwgP.jpg",
  "categories": {
    "plot": 5.5777777777777775,
    "acting": 5.538461538461538,
    "ending": 5.6,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.4
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Basically, a disappointment. I really wanted to like this show. The premise seemed interesting, and who can resist performances by Jodie and Jeff? But alas, the cool idea was wasted on throw-away characters like the arms salesman and French contract killer. The attractive set design couldn't save a weak script. Gratuitous violence just made it worse."
    },
    {
      "rating": "3",
      "text": "I did not really enjoy this movie, none of the setup pays off in the end, there are a few ideas and things tossed around, but the movie creates more questions then it answers, if they showed more details of the characters back stories to the present then maybe the movie would have more depth, I did like some of the elements in the movie, and I have watched worse films so thats why I give it a 3 out of 10."
    },
    {
      "rating": "0",
      "text": "This movie is a waste of time. Clearly someone thought that they could capitalize on the John Wick series and pretend to make it their own. I want to punch myself in the face for watching this garbage. Don't bother spending a penny on this."
    },
    {
      "rating": "7",
      "text": "Jodie Foster plays the doctor/nurse at a secret hospital for criminals in future LA. This film is dark: the style, the subject and the outlook. Foster plays crusty and troubled, while working with a strong cast that includes Sterling K. Brown, Dave Bautista and Jeff Goldblum. The story is primarily about her interactions with this group of mostly unlikable and often unpleasant crooks until the climax adds a violent element. Bleak and mostly mean, this drama is also original in its concept and unusual in its approach."
    },
    {
      "rating": "8",
      "text": "This was fun.I really liked the setup of this. Hotel Artemis takes place in the near future where corporations run the show in a secret underworld hospital with a minimal staff during a riot. It's an interesting setup, with dangers both in and outside the hotel/hospital. The best part of the film is how it is visually realized: the semi-futuristic technology, riot-torn LA and the run-down but extravagant Hotel Artemis look great. The excellent cast, including Dave Bautista, Jodie Foster, and Sterling K. Brown, all really elevate the material.The plot and action move along smoothly, but there are no big surprises. The setup is more inventive than the execution. It's a Quentin Tarantion-esque many players-on-the-field-type criminal thriller. However, unlike Tarantino films there are no big surprises in this. Still, a fun ride, though."
    },
    {
      "rating": "7",
      "text": "Look I know everyone is waiting for Mission Impossible: Fallout but that doesn't mean you have to starve yourself of your latest action movie fix. So why not check out Hotel Artemis and I promise you won't be disappointed. Hotel Artemis is the predictable and entertaining action movie we need right now.Set in a near future Los Angeles during an extreme mass riot, Sterling K. Brown and his brother, Brian Tyree Henry run into some trouble and get themselves checked into the mythical Hotel Artemis. Sure it basically takes the hotel idea from John Wick, only this time it's a secret hospital for criminals. Members only of course and complete with its own set of rules. No killing the other patients etc. Meet Jodi Foster as the nurse, throw in Dave Bautista and Jeff Goldblum for good measure and you're good to go. It wastes no time getting started, builds on the increasing atmosphere and the impending feeling that everything is spiraling out of control. You don't have to do a whole lot of thinking for this one. It's short, to the point and skips the excessive plotsplaining. Everything an action movie should be, over the top fun with just the right amount of dark humour. Highly entertaining and highly recommended."
    },
    {
      "rating": "6",
      "text": "Hotel Artemis is a sleekly produced film that contains many memorable performances and a unique premise. The desire of wanting to see and know more looms throughout most of the runtime along side with shaky character writing. It has the potential, but isn't quite what it could be. 60/100"
    },
    {
      "rating": "4",
      "text": "A film that perhaps sounded pretty good on paper but ends up being a rather boring mix that pretty much goes nowhere and has narrative that casually builds all its conflicts as the minutes progress.Considering the cast, especially with Jodie Foster and Jeff Goldblum the failure of this film is is even more resonant because it's rookie director couln't get something more solid from the work of these actors, and also of the rest of the cast, therefore the ridiculous plot feels absurd and forgettable.A really big disappointment."
    },
    {
      "rating": "8",
      "text": "I really enjoyed this movie. It's harder & harder to find films that aren't sequels & I thought this was original and kept me interested throughout. Interesting characters, interesting plot. Definitely worth your $$. I recommend it!"
    },
    {
      "rating": "8",
      "text": "Los Angeles of 2028 is a riot laden area where Martial Law is the norm and brutality is a way of life. Amidst this setting, the Hotel Artemis is open for business.. The Artemis is not your typical hotel as it provides emergency medical services to members who engage in criminal activities.The Nurse (Jodie Foster) runs the facility and with the help of her massive Orderly Everest (Dave Bautista), they ensure that only members get admitted and follow the rules as well as receive state of the art care while in the facility. Guests at the facility are giving names based on the suite in which they are assigned which involve geographical locales and there are a very strict set of rules they must follow such as no guns, bombs, killing other guests, and so on.The Hotel Artemis is not a simple stitch and bandage facility as they offer advanced medical services such as Nanites, replacement organ printing, robotic A.I. medical treatment and other services which in 2018 seem like Science Fiction.Enter Waikiki (Sterling K. Brown), who has tried to leave his criminal past behind him yet was savvy enough to keep paying his membership fees at the Artemis all the while. He and his brother have been injured in a heist and with the city under a deadly riot, they make their way to the Artemis to get treatment and hide out from the chaos outside.Thanks to their services, the hotel is rarely empty and an Arms Dealer named Acapulco (Charlie Day), and an assassin named Nice (Sofia Boutella), are also in residence. The fact that Nice and Waikiki have a past association makes things a bit interesting as guests are always mindful of those around them even though the strict rules of membership exist to ward off any threats or danger to the guests or staff.Complications arise when the near capacity hotel is informed that the Wolf King of L.A. (Jeff Goldblum) is en- route. The Nurse opts to follow the rules of first come first served and in doing so enrages his son (Zachary Quinto), who decided to barricade the Hotel to make sure nobody gets in before his father, who incidentally owns the facility.As if this was not enough of a complication, a police officer from troubled past of The Nurse arrives begging for help which sets a very dangerous chain of events into motion.The film is a very fresh and entertaining story filled with interesting characters, strong performances, and just enough action to keep the film moving along but yet keeping the focus as a character based drama.First time Director Drew Pearce gets the most of his cast and has used his script to create a very entertaining and unique film that is well worth a watch. It is so nice to see Jodie Foster showing us once again that she is one of the most gifted actresses of our time as the two-time Oscar winner goes all in to portray a very damaged and troubled character who for what she lacks in glamour; more than makes up for with a determined strength.I hope this film is a success as I would love to see more stories from the Hotel as I really enjoyed the film from start to finish.4 stars out of 5"
    },
    {
      "rating": "5",
      "text": "I swear I thought I was watching Michael J Fox as the hotel's doctor but it turns out to be look-alike Jodi Foster (nurse)! So funny how their aged faces look so similar. And there's Sofia Boutella who kicked major a$$ in the Kingsman franchise, and yes, she's a killer assassin here, too, so that's great. Jeff Goldblum though didn't measure up to the character he was portraying so that was a big miscast. Dave Bautista was basically a standin for The Rock who was probably filming another action movie. I'm spending so much effort discussing the cast because that's what you focus on with this film since the plot drags and then gets predictable. It was decent but could've been so much better. It gets a tepid \"5\"."
    },
    {
      "rating": "8",
      "text": "+Interesting Cyber punk influenced world+Exceptional cast+Great cinematography-Not exactly original 'crime noire story'A neat cinematic gem with a great visual style whose cast imbue its characters with great comic-book-like energy. I almost felt as if I was watching something of a cross between 1991's Delicatessen and 1990's cyber city oedo 808! Foster is fantastically watchable as the Nurse... If you are into anything cyber punk-ean I highly recommend this movie."
    },
    {
      "rating": "5",
      "text": "Hotel Artemis was an original film that met my expectations. It did it's job of laying the groundwork for potential sequel(s). Although, this film was somewhat lacking with it's storytelling. I don't know anymore about the hotel or its guests coming out of the theater than I did going in. I do look forward to any sequels or spinoffs to Hotel Artemis because the potential is there. *P.S. - don't go into this film thinking that your going to see \"John Wick\" style action and/or plot. You WILL be disappointed.*"
    },
    {
      "rating": "7",
      "text": "Hotel Artemis is an enjoyable crime thriller that's set in the future and takes place entirely in a hotel that acts as a hospital for criminals. There are a few rules that The Nurse (Jodie Foster) requires everyone to follow, and a person has to have a membership to get fixed up, but otherwise she doesn't care what the person does for a living or how bad they are, she'll still fix them up. The story follows her as she embarks on what should be a typical night at the Artemis, but it slowly starts to spin out of control as the night drags on. There is a B-Story that deals with a corporation charging money for access to water, which has caused riots to break out around L.A., but I found it to be severely underdeveloped. It served its purpose, but that's it. There definitely could have been a little bit more exploration into it. The main story isn't incredible, but I was entertained the entire time...although it did leave me wanting a little bit more. As for the action....when it happens, it's great. But I wouldn't go into this film expecting a lot of action because there isn't a ton of it. Most of it revolves around The Nurse fixing up patients and dealing with dilemmas. I will say that I did enjoy how subtle the futuristic technology she uses to work on patients is. All of it actually seems somewhat realistic and similar to what we may very well have access to in the future. Given the short runtime (just a hair over 90 minutes), it's hard for the entire cast to get enough screen time to properly develop. I found myself very invested in Jodie Foster's character, but I didn't really care about any of the others, especially when the end came. Also, I figured Jeff Goldblum would have a much, much bigger role in this film, but he's in it for maybe five minutes or so, which was a disappointment. Overall, I had a good time watching Hotel Artemis. It entertained me, despite the flaws it may have."
    },
    {
      "rating": "6",
      "text": "Simplicity doesn't always help. With a screenplay without much to show, the film is affected by the whole. With a difficult task, \"Hotel Artemis \" became what we expected, good storyline, but without a good articulation of events. His conclusion is the pinnacle of the film, out of incredible performances by Jodie Foster, Sterling K. Brown, Dave Bautista and among others. Another point that does not attract, is the fact that the film is stuck in a fixed setting that is the hotel, rare are scenes that depict Las Vegas in ruins, self limiting. 6.3/10"
    },
    {
      "rating": "6",
      "text": "Esta interesante, tiene la premisa del hotel de j. wick, pero son muy bobos los malos, y luego lso madrazos los pega solo la vieja. Y el hecho q su hijo lo mato la mosca, no pasa a mas."
    },
    {
      "rating": "9",
      "text": "This was even better than I had anticipated. All the main characters locked you in, and Everett became my absolute favorite. You will definitely enjoy this film & identify with at least one of the characters."
    },
    {
      "rating": "4",
      "text": "It's an action film needlessly set in a futuristic setting that focuses more on character building and numerous subplots than delivering on the action. The talented cast is put to waste with so-so material that doesn't deliver despite the strong premise."
    },
    {
      "rating": "8",
      "text": "I have to go with Mick Lasalle of the SF Chronicle and the Ebert site reviewer on this one. This film is quite a hoot, and watching it really improved my day. The critics who think this film is a loser are too old and need to retire. Especially Rex Reed."
    },
    {
      "rating": "6",
      "text": "In a fashion similar to 2018's \"Bad Times At The El Royale,\" \"Hotel Artemis\" features a writer-turned-director spinning a yarn set in an intriguingly realized world, populated by larger-than-life characters, and throttled forward with both mysteries and duplicities galore. Unfortunately, this movie also takes after \"El Royale\" in the more tragic ways, featuring an abundance of self-congratulatory dialogue passages and a noted number of elements that don't entirely cohere with the rest of the story at hand. That's not to say these problems hamper the movie into the realms of unwatchability. Quite the contrary. In fact, how could a movie with this cast be anything but \"watchable\" at the very least? That's certainly a question one could pose. The bigger question for me, though, is how the hell did a movie with this cast manage to disappoint on some level in almost every facet?"
    },
    {
      "rating": "7",
      "text": "Hotel Artemis is dark (both physically and thematically) and claustrophobic. The cast is completely believable, and the film allows Jodie Foster to show what a great actress she still is, even though “The Nurse” is the opposite in age and attitude of Clarice Starling. If you are a movie buff, this film is worth your time, even though I certainly would not call it a great success – just interesting."
    },
    {
      "rating": "6",
      "text": "Set in riot-torn, near-future Los Angeles, Hotel Artemis follows the Nurse (Jodie Foster), who runs a secret, members-only hospital for criminals. Definitely not what I expected in terms of plot and screenplay but the cast is really good, I love Sofia Boutella and Jodie Foster was easily the best ive seen her in a while.  It's well shot and produced but faults from a narrative perspective. Its still a solid film"
    },
    {
      "rating": "6",
      "text": "Started quite well, interesting cast, thought the story might be interesting also the whole setting and everything. But then the excitement kinda faded and basically the second half was not as good as expected."
    },
    {
      "rating": "6",
      "text": "\"Hotel Artemis\" was a film where the performances and atmosphere of the film worked, but that the story and the narrative were very confusing and boring and that affected quite a good project, since the distributor Global Road, no longer gave after teerible previous projects, in addition to bad decisions in the movie, it was slightly disappointing."
    },
    {
      "rating": "5",
      "text": "Unfulfilled potential. The setup was promising: a water-starved populace demands access to water, and riots break out while a bank heist is going down. One of the thieves gets shot, and his brother takes them to an underground (figuratively) hospital that only services criminals.Once they get to the hospital, the plot thickens, but it never gels. Unfortunately, everything is barely hinted at rather than being given the time to flesh out. The critical plot piece revolves around the nurse's son, but all we ever learn is what happened to him -- there is no emotional connection, hence little reason to care.The movie progresses like a series of snapshots with almost no context and threads left untied. We learn that there is history, but we know nothing about it, so we aren't invested.It's a missed opportunity that mainly gets points for style and casting and is only worth watching if you can view for free."
    },
    {
      "rating": "6",
      "text": "This movie felt like an amazing concept with great actors that did not deliver sufficient entertainment and immersion. The acting was good though, really great emotional moments and reactions, but it wasn't award winning movie carrying performance though. The directing was average, nothing out of the ordinary. The best part though was that the characters interacted in a unique way, like it was a free for all, and that added a nice enjoyment to it. The writing was to simple, and not to overactive, like it really felt with these characters that the writing and twists and turns could have been so much better and with more depth. Overall it was an above average action movie, with great melee combat scenes, but nothing extra other than that. Sadly it could have been a lot better."
    },
    {
      "rating": "5",
      "text": "Aesthetically pleasing, but the narrative is predictable and clichédHotel Artemis is a film which doesn't do a great deal wrong. However, it is also a film which doesn't do a great deal right. It just kind of hangs in mid-air, with clichéd characters acting in clichéd ways and having clichéd conversations. And then it ends. It's not actually about anything. It's also predictable, with precious little substance. It looks pretty though.In 2028, riots are tearing Los Angeles apart. The film takes place primarily in the eponymous Hotel Artemis, a secret hospital for criminals in the heart of the city. The motley crew of characters, many of whom are known only by the name of the room in which they're staying, include Waikiki (Sterling K. Brown) and his brother Honolulu (Brian Tyree Henry), bank robbers who have been involved in a shootout with police; Nice (Sofia Boutella), an assassin who \"only kills important people\", and just so happens to be Waikiki's ex-girlfriend; and Acapulco (a spectacularly miscast Charlie Day), a weapons dealer and all round weasel. Also present are The Wolf King (Jeff Goldblum), Los Angeles's most feared gangster, who also finances the hospital, his incompetent son, Crosby (an underutilised Zachery Quinto), and Morgan (Jenny Slate), a cop injured in the riots. The hospital is run by \"Nurse\" (Jodie Foster), an agoraphobic alcoholic haunted by visions of her past, with porter duties handled by Everest (Dave Bautista). The hospital functions because all guests must adhere to a rigid set of rules (the first of which is \"don't kill the other patients\") and a strict no weapons policy.Sounds pretty interesting doesn't it? It's not. The dialogue is awful, the narrative beats can be seen coming a mile away, and the characters are all archetypes, with only Nurse really fleshed out. There's the loud-mouth snivelling weapons dealer, the gorgeous but oh-so-deadly assassin, the criminal kingpin and his screw-up son who just wants to be like dad, the skilled bank robber who spends most of his time trying to get himself out of the trouble caused by his unreliable brother, and the tough-as-old-boots medical professional who just wants to help people when in actual fact, she's beyond help herself. The premise may be reasonably interesting, but, in his debut feature, writer/director Drew Pearce undermines it by populating the milieu with cardboard cut-outs instead of characters. True, most of the actors give it their all (Bautista in particular gives a performance far superior to the material with which he has to work), but there's just no substance here, no depth. There are simply too many clichés at every level to be able to overlook them.Yes, it's an original(ish) idea made with a small(ish) budget, which is exactly what we need more of these days, when every second film is a CGI-infested remake, comic book adaptation, or sequel (or a CGI-infested remake of a sequel to a comic book adaptation). However, an original idea is all very well and good, but it can only take you so far; the execution has to be there as well, and this is where Hotel Artemis falls down. It's simply not an especially well-made film. Pearce does a reasonably good job with the directorial side of things, as aesthetically, the hotel is really intriguing, with a nice use of primary colours and a well-conceived juxtaposition of modern technology and 3D printers with retro décor and secret passages. In terms of plot, however, there's just nothing to latch onto or get your teeth into. None of the characters really do or say anything very interesting, and a half-hour into the film, as it became increasingly apparent that none of them were going to be developed to any great degree, I just stopped caring."
    },
    {
      "rating": "5",
      "text": "There were a lot of ideas that made it into this movie and very little of them contributed anything interesting to the overall project. The movie is set in future Los Angeles in the middle of a riot over clean water. This is shoved in our face numerous times throughout the movie. This isn't a bad idea except it is overdone with helicopters exploding and purge like street fights. It is a riot not world war Z. This can be overlooked as it is not the focus. My biggest complaint however is the lack of significance which is rife in this film. A large amount of characters are just so unnecessary. The injured cop, gets treated  against the rules, nobody cares she broke the rules, gets treated and leaves. A character on life support dies due to a power outage, everybody seems to have gotten over this in the next 5 minutes. A pen is stolen and made out to be a big deal, but instead was just used as a distraction at the end. Other character details are dropped in that also similarly are insignificant, we find people are drug addicts, some characters love each other (who cares), a son who was thought to have overdosed but was in fact murdered by a patient just so he could be murdered by some other character with little consequence as it had little effect on the end result. Two characters were given what was supposed to be a big final stand, but we don't know what happens to them as instead someone thought it was better to focus on a character refusing to get into a car for a reason not well explored. I could go on, but the overall impression is just lack lustre. I don't care as much as the script writers didn't care. The directing choices were questionable at times. The short quick steps taken by the nurse was meant to make her seem more endearing and busy but just was unnatural. Having scenes just for the sole purpose of showing how badass they are supposed to be, just comes of as pathetic. It is frustrating to me as I do believe somewhere in this there is a good plot. John Wick managed to create a criminal underworld with inside membership privileges very successfully, but instead hotel artemis decided to clutter a good plot, disfiguring it with unnecessary details and poor choices."
    },
    {
      "rating": "1",
      "text": "(Mauro Lanari)If you remember well the claustrophobically violence set in \"Four Rooms\" (1995) and the stylized one of the graphic novel \"Sin City\" (2005), then you have no need to see them again in this debut of Drew Pearce, late epigone not only of Tarantino but also of Besson and Carpenter."
    },
    {
      "rating": "0",
      "text": "What’s the point of this movie bad storyline bad acting just another crap movie produced for no reason. When is someone going to make a movie worth watching in 2020"
    }
  ]
}