{
  "id": 355,
  "title": "Hotel Transylvania",
  "starring": [
    "Adam Sandler",
    "Andy Samberg"
  ],
  "runtime": 91,
  "genre": [
    "Animation",
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "description": "Welcome to Hotel Transylvania, Dracula's lavish five-stake resort, where monsters and their families can live it up and no humans are allowed. One special weekend, Dracula has invited all his best friends to celebrate his beloved daughter Mavis's 118th birthday. For Dracula catering to all of these legendary monsters is no problem but the party really starts when one ordinary guy stumbles into the hotel and changes everything!",
  "releaseYear": "2012",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eJGvzGrsfe2sqTUPv5IwLWXjVuR.jpg",
  "categories": {
    "plot": 6.7272727272727275,
    "acting": 7.0,
    "ending": 7.5,
    "soundtrack": 5.333333333333333,
    "cinematography": 5.0,
    "familyFriendly": 7.666666666666667,
    "funny": 6.575757575757576,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I liked the movie, despite what most may say. Good voice acting, plenty of laughs and action, and a great family movie. Adam Sandler did a great job for this role."
    },
    {
      "rating": "10",
      "text": "This is an animated movie from Adam Sandler. Reviewing it is really simple: if you think you will like it, you will. It is goofy, funny, kinda dumb and really fun. Don't expect anything more, but if that appeals to you, you'll really enjoy this movie a lot. Our family sure did."
    },
    {
      "rating": "9",
      "text": "I can honestly say this movie was pretty good. The story was good, the comedy was more than adequate. I think if people do not like this movie its because they lack a strong morale high ground required to grasp the overall story behind it. Without providing any spoilers its something that a lot of parents do and it drives their children insane, typically. This movie is worth the price of admission, and then some."
    },
    {
      "rating": "6",
      "text": "Overall a fun movie with a good story. But alittle too goofy for my taste. good animations, good voice acting. and decent 3D effects. Worth watching on blu ray."
    },
    {
      "rating": "6",
      "text": "So overall I feel that this is good fun. The main characters consist of Dracula, his daughter Mavis, and Jonathan, a human who managed to discover Hotel Transylvania. The film does a good job of developing these characters, but sadly most of the others don't have much of their personalities shown. The film starts off slow, but soon it is a speedy sugarfilled ride. So there are some noticable flaws, but I feel that this will be pretty enjoyable overall."
    },
    {
      "rating": "10",
      "text": "Very funny movie. It's almost unreasonable why negative critics would say it's bad. Not every movie has to be about the end of the world or getting revenge. Instead, the message this movie gets across is that not all people are bad; and when you keep an open mind while meeting strangers or exploring new sights, you might actually be surprised, which is more than I can say for the critics."
    },
    {
      "rating": "7",
      "text": "Although plagued by pop-culture references and poor jokes, it's animation and solid plot-line still makes it a fun no-brainer for kids and adults alike."
    },
    {
      "rating": "10",
      "text": "I saw this movie and I really enjoyed it.  I told myself, when this comes out on Blu-ray buy it.  I did.  As I watched it at home I said to myself, this is better than I remembered, glad I bought it.  I don't understand those who didn't care for it.  It has a good plot, the characters are excellent, and it was enjoyable.  I think some Adam Sandler hate may be influencing people."
    },
    {
      "rating": "6",
      "text": "\"HUMAN POT PIEE!!\" Oh the lines you get stuck in your head while watching animated films with your children. For me I thought it was okay. A little fast paced. Maybe I'm just getting old,  I was waiting for the film to slow down. A lot going on. But the animation is pretty sweet and it makes my daughter dance. If it grabs the attention of my little film critic then I'm sure its not a stinker. She's picky!"
    },
    {
      "rating": "8",
      "text": "This film is one of the best that Sony Pictures Animation has made, finally putting it at the level of Disney, Pixar or Dreamworks. These four giants of animated films have been fighting for a long time. Sony has so far been the most discreet and least successful competitor, however, with this film and the ensuing franchise, the studio has finally managed to show its worth.The script is simple: after losing his wife in a confrontation with violent humans, the secular Count Dracula hides, with his daughter Mavis, in an isolated castle, protected from the humans eyes. To make it profitable, it turns it into a large hotel specially designed to welcome other monsters and creatures that want distance from people. But, as the centuries go by, Mavis has grown up and wants to finally see the world beyond the immense dark forest that surrounds the castle. And that is what Dracula is most afraid of, as he regards human beings as highly dangerous.The film was perfectly capable of humanizing and giving a funny touch to the monsters that we get used to seeing in horror films. Dracula, the Mummy, the Werewolf, Quasimodo, the Invisible Man, Frankenstein's monster, Bigfoot... they're all here, and all of them much more human and lovable than they could be in another kind of film. The plot rests on the father-daughter relationship, on the way a father tries to protect his daughter until eventually she feels suffocated and revolts against it. The most comical scenes are reserved for the Count, especially when he plays with Jonathan, the human teenager who, against all odds, finds the castle and decides to explore it. The dialogues are excellent and the humour is everywhere.The direction is ensured by Genndy Tartakovsky, who previously collaborated with Cartoon Network Chanel, where he was responsible for some of their most iconic animated shows. It is, therefore, an interesting bet that worked very well. The voice actors cast is large and very good, with the veteran Adam Sandler and Selena Gomez at the head. Everyone did their job very well and fit the characters perfectly. I found Sandler's effort to make his voice more Romanian especially interesting, although it might not be necessary.Technically, the film is based on computer animation and CGI, whose quality seemed somewhat irregular but generally good. Unlike the films from other studios, music and songs are far from being the strong point here... in fact, it was one of the weakest bets in this film, with forgettable songs that seem to be there only because they have to be there, without being able to add quality and joy to the film. The ending, where music plays a predominant role, ends up a little blurred because of that."
    },
    {
      "rating": "10",
      "text": "Loved it. Took my 6 year old and we both laughed a lot. Being a fan of Tartakovsky from his Dexter's Laboratory days (and others), I thought the animation was incredible, yet warm unlike other recent computer animated films. The director actually uses the method to its fullest. Plus, I LOVED that they didn't throw in pop culture jokes for the adults, instead they found humor within the art style and situations. Yes, the story's kind of just ok. And, yes, there's a few gaps in the character development. The voice acting is great, even Sandler who is NOT over the top as some critics have pointed out. Got kids? Go see it, get the stick out of your butt and just have fun! (Not everything has to be Pixar, you know...)"
    },
    {
      "rating": "7",
      "text": "Definitely better than the 48 meta score given here.  My seven year old liked it more than ParaNorman.  I thought it was cute, and nearly as good as ParaNorman.  The all-star talent is mostly wasted.  Stars like David Spade barely use their most effective comic techniques here.  The laughs are driven by the script and animation, and any voices would have been sufficient.  Maybe that's one reason the critics were disappointed."
    },
    {
      "rating": "4",
      "text": "I usually like animated movies but Hotel Transylvania wasn't anything too exciting. I had hopes that it would be pretty funny but i can count the amount of times i laughed on one hand, it was just kinda boring most of the time. Nothing i would see again. 4/10"
    },
    {
      "rating": "9",
      "text": "Seriously, this film is better than you think. I could not stop laughing. Sure, there"
    },
    {
      "rating": "10",
      "text": "A love storm mixed up with monsters. Count Dracula must come to turns with a modern world and a growing daughter. Some fun humor and some scary moments, it's a must see movie for anyone of any age. The 3D version is great. Makes me wish there was an animated series or another movie planned."
    },
    {
      "rating": "0",
      "text": "This is probably the worst animated film i've ever seen. The animation itself is extremely plastic and generic looking,  The writing is unclever and stupid. Some jokes hit, but most just the target completely.  The sequel does not look any better."
    },
    {
      "rating": "8",
      "text": "Хороший,красивый,круто анимированный мультфильм с хорошей историей,отличными шутками,хорошим актерским составом,иногда даже появляется чувство о том что ты хочешь его пересмотреть,а это ещё один плюс."
    },
    {
      "rating": "4",
      "text": "Despite featuring Adam Sandler, this movie is not quite awful enough to turn it around to warrant a high score like Sandler's live-action classics. Truly bafflingly unfunny, the real humour is in how random and crazy the attemps at humour are. Worth a watch anyway. Maybe."
    },
    {
      "rating": "0",
      "text": "Unfunny and unimaginative, and this from Tartakovsky(Powderpuff Girls, Dexters Labrotory) and Smigel(SNL's TV Funhouse, and Triumph the insult dog). After 3 days had gone by since watching this, I asked my kids what they thought. \"Ok\" was the best it got. We all agreed the human character played by Adam Samberg was annoying to the extreme.  In fact, the entire audience was rather quiet throughout.  If you want a Halloween-themed animation to watch, seek out ParaNorman, thats the reel deal!"
    },
    {
      "rating": "9",
      "text": "A mostly entertaining cautionary tale for possessive helicopter parents. You've undoubtedly seen this type of story before but this animated implementation is pretty decent having required a kleenex or two towards the end so that's a worthy indicator."
    },
    {
      "rating": "3",
      "text": "The best thing about this movie is seeing certain characters as bats (which happens rarely) and probably Sandler's voice performance. The beginning starts off somewhat interesting, but then you get to the luke warm middle, wondering when it will pick up, but it never does. The only thing that saves the ending is the fact that you see a bat for a good few minutes. (They look cute)"
    },
    {
      "rating": "0",
      "text": "Movie had potential, but had way too many corny jokes, and the soundtrack was awful. Plus, the \"adult and their misunderstood teen\" storyline has been done to death. Honestly probably one of the worst movies I have ever seen."
    },
    {
      "rating": "1",
      "text": "In the words of my daughter after seeing this film, \"Dad, I'm 8 not stupid.\" Maybe someday Hollywood will realize that not all cartoons are cute or funny. Just because you animate something doesn't make it good. We left half way through the movie and went for a bike ride."
    },
    {
      "rating": "4",
      "text": "No puedo creer que muchos hayan esperado esta m....a, en serio es m....a, la trama es predecible, la animación es horrenda y ridícula y los personajes pueden ser comicos, clicheados o irritantes. La única razón por la que todos la aman es por el director Gendy Tartakovsky, quien trajo \"Dexter's Laboratory\", pero eso no significa que siempre va a estar buena. Ni siquiera esta para Halloween, prefiero ParaNorman o Frankenweenie honestamente. Admito que me dio risa la película."
    },
    {
      "rating": "10",
      "text": "This movie was totally cute and entertaining. I can't believe it isn't rated higher. The animation is fun, the voices are cast well. It is a sweet and goofy story for all ages. It is what it is meant to be."
    },
    {
      "rating": "4",
      "text": "Hotel Transylvania got my attention when I knew that there was a bunch of creepy animated movies that would be release at cinemas. Like Frankenweenie or ParaNorman; both films surprised me not only because of the technique of animation and the esthetic, but also because of the message that these pictures gives, which clearly demonstrate that they were not the typical movie for children. Hotel Transylvania was the exception. It could not reach a least half the level than the films mentioned before. Despites that the idea of a hotel for monsters in vacations is original, everything else does not: the overprotective father, the rebel teenage daughter, the cool young guy and love at first sight; because of this the movie is absolutely predictable. In between it has some interesting topics, like the anger of Dracula cause by the images that the humans have of him (the scene of the plane is spectacular); and the stereotypes that the monsters have about the humans. Above all, this picture is very erratic, makes you laugh? Yes, but is empty."
    },
    {
      "rating": "4",
      "text": "It's harmless, I guess, but if you want to see a Halloween themed kids movie I have some better suggestions: The Nightmare Before Christmas, ParaNorman, Frankenweenie. It's one of of Adam Sandler better movies, but that's not saying much. The best word to describe it is \"forgettable.\" There's no major conflict or villain. It's a whole lot of nothing. While it's not harmful, it's not interesting."
    },
    {
      "rating": "5",
      "text": "Really bad movie. Seems like the producers tried to create a universal story to match with every age group, but they failed miserably. For adult people the movie is boring and dull, while younger children might be spoiled by the language* or scared. The story is just bad. One more thing, the movie is really short, it was first family film I've watched in ages, so one and a half hour might be a normal movie duration in that category, but i find it much too short. Also, 3D effects are nearly imperceptible."
    },
    {
      "rating": "6",
      "text": "A fast, funny and wildly inventive animated tale with enough laughs and heart to appeal to audiences of all ages. http://www.facebook.com/pages/Carrie-2013-has-hemorrhoids-/154149308058300"
    },
    {
      "rating": "7",
      "text": "Una película excepcionalmente animada y muy entretenida. La trama es muy previsible desde el inicio, pero tiene personajes entrañables y graciosos que la harán bastante disfrutable. No hacer caso a las críticas profesionales, es una cinta perfecta para los más pequeños y los más mayores también la disfrutarán (especialmente con la versión en castellano que, aunque extraña, tiene ciertos gags, chistes y estereotipos de la cultura española bastante graciosos). Recomendada."
    },
    {
      "rating": "2",
      "text": "Hotel Transylvania at its core is a animated movie who thinks its a cartoon and tries so hard to be a cartoon that it falls flat on its face. I didn't find this film funny at all. The animation tries so hard to be cartoony that it almost feels hard to look at, the characters are all one-dimensional with no traits to make them interesting. The best thing I can say about it its that SONY PICTURES ANIMATION Made worst films but then you can make anything look good compared to these atrocities: Norm of the north, The Emoji Movie, Cars 2, Foodfight, ect."
    },
    {
      "rating": "6",
      "text": "So overall I enjoyed the film. I will admit that the writing is pretty lazy and the film is kind of babiesh but this is not a bad kid’s film. It is bright and colorful, has likeable characters, and some great humor. The film has some clichés but there is nothing terrible in here. If I had kids I would not mind showing this film at all. Enough of the humor works in this movie and is not dumb humor so adults will get through it ok. In short if you have kids and you want something bright, colorful, and funny to show them show them this. Hotel Transylvania is definitely the most upbeat of the three Halloween movies of 2012 but it is also the weakest because it is mainly for kids whereas the others were darker and had some more adult moments. However as kid’s films go its ok. If you are a little kid you’ll probably enjoy this one but if you are going into this movie expecting something at the same level as Dexter’s Laboratory or Samurai Jack you’ll probably be disappointed because this film is not even close to being on the same level it’s just a little kids films with enough laughs to make it watchable."
    },
    {
      "rating": "7",
      "text": "A great family movie that you can watch with kids of any age. It's charming, sweet, and funny. It boasts great animation and stellar voice acting creating one great family movie. Its plot about an overprotective father who's trying to keep his daughter from the outside world isn't original and feels too familiar sometimes despite the gothic, halloween-esque style. In the end however it's still a funny movie that parents wont mind watching with their kids."
    },
    {
      "rating": "5",
      "text": "A very mediocre animation with a few laughs but otherwise is not remotely intelligent."
    },
    {
      "rating": "7",
      "text": "Written by a fabulous team of acclaimed writers, this move had lots of laughs for kids and adults. My only concern was once the boy was introduced, the monsters became much less of the focal point of the movie. Still lots of of fun!"
    },
    {
      "rating": "9",
      "text": "An absolutely joy to watch. I don't think I've ever seen an animated movie this wonderfully kinetic and brilliantly stylized; it's rare that you can be completely entertained by just how the characters act and react to each other alone. Yeah, the story's kind of trite and it stops dead in its tracks to hit the obligated emotional beats, but everything else is just absolutely fantastic. If you like animation, you will love this movie."
    },
    {
      "rating": "8",
      "text": "Entertaining and very funny."
    },
    {
      "rating": "8",
      "text": "This film deserved a much higher score than the critics gave it. It was entertaining, creative, funny, with a cute story and good character development. There were many aspects of this film that I thought surpassed ParaNorman, which opened just a few weeks ago and was also a cute flick."
    },
    {
      "rating": "8",
      "text": "So many critics put this movie down, because according to them it is not for adults.  Why is it that someone that has a job writing movie reviews doesn't have the commonsense to know that animated movies are not aiming for the adults to be moved.  We went with 3 boys ages 5 and 6.  They thought it was great and funny.  I think it was just what was expected.  Our son is still say \"Blah, Blah, Blah - I don't really say that.\"  Parents your kids will enjoy this.  Critics be ashamed that you give this movie a bad score just because they left out the adult crude humor."
    },
    {
      "rating": "5",
      "text": "Checking into this hotel will give you a thrill and get you in the mood for Halloween ,A fast, funny and wildly inventive animated tale with enough laughs and heart to appeal to audiences of all ages."
    },
    {
      "rating": "10",
      "text": "Hotel Transylvania will set a high point Sony Pictures. Funny for kids and adults. The jokes are hilarious. If you haven't seen this movie then you need to"
    },
    {
      "rating": "10",
      "text": "\"Hotel Transylvania\" is one of the best films I've seen this year. It was very funny, interesting, and cute. The cast was great, along with the animation. I loved how it explored the idea of a hotel....for monsters! It was very cool and exciting. I'm hoping to see a sequel/tv series in the future! :D"
    },
    {
      "rating": "7",
      "text": "If you just look at Adam Sandler playing a Dracula it looks bad, but if you give this movie a chance it`s actually pretty good. It`s nothing amazing, but was worth watching."
    },
    {
      "rating": "8",
      "text": "A very good movie and perhaps one of the better animated movies I have seen in a while. Animation is pretty, but does feel a little too cartoony at times. Characters are all pretty well thought out and you really do end up liking them all. Overall: Hotel Transylvania is a really good kids movie, and fun for adults too. It has some really good laughs and will have you smiling at the end."
    },
    {
      "rating": "8",
      "text": "good movie to watch, nice funny bits and family friendly. I watched it in 3D and it was good.I really liked the cartoons and my favorite character was the dad."
    },
    {
      "rating": "8",
      "text": "It drifts into the realm of cliché love story, but Hotel Transylvania is still remarkably animated in a fast and well formed fashion, surprisingly hilarious and inventive in so many different ways."
    },
    {
      "rating": "7",
      "text": "Every once in a while i'm in the mood for some animated fun. You don't have to expect a lot from most animation movies but a lot of 'em are solid fun. So is Hotel Transylvania. Kids like monsters. Especially overactive ones. That's exactly what this movie is. An overactive stay in a hotel for monsters. No humans allowed! The story is simple and predictable. Also the all-star cast isn't necessary. Mostly because the strength isn't the voice acting. It's the animations, the fun and kinda dumb characters and the tempo which makes the movie fun to watch. You won't get bored nor surprised by this movie. But whether you're 51 or 8, you'll definitely have a good laugh."
    },
    {
      "rating": "5",
      "text": "As expected by most, \"Hotel Transylvania\" isn't that impressive, and manages to pull off some humor, but not does not take any risks. It feels average, and despite the times it tries to act emotional, a few minutes later, it's just comedy again. The comedy has several cheap jokes that sometimes work, but most of the times annoy. But despite it's several flaws, it's not that bad and at points, you may get a chuckle or two."
    },
    {
      "rating": "4",
      "text": "So full of heart my bowels cramp. Every part of the script is nailed with idiotic and childish jokes, which mimic every other Sandler movie I've seen, with the exception being 'Punch-Drunk Love'. Animation is dead, except for Disney and Pixar."
    },
    {
      "rating": "9",
      "text": "what a good movie . it is not funny it just cool ........................................................................................................"
    }
  ]
}