{
  "id": 3539,
  "title": "Hotel Mumbai",
  "starring": [
    "Dev Patel",
    "Armie Hammer"
  ],
  "runtime": 123,
  "genre": [
    "Thriller",
    "History",
    "Drama",
    "Action"
  ],
  "description": "Mumbai, India, November 26, 2008. While several terrorists spread hatred and death through the city, others attack the Taj Mahal Palace Hotel. Both hotel staff and guests risk their lives, making unthinkable sacrifices to protect themselves and keep everyone safe while help arrives.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/v32SC4HFZtlDRWXMaR2V2dWqAXJ.jpg",
  "categories": {
    "plot": 6.857142857142857,
    "acting": 7.333333333333333,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.428571428571429
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I thought this film was suspenseful and very well acted, except perhaps for the terrorists who were rather one-dimensional. I have scored it as a film and not as a docudrama. I have not seen any of the TV programs about this tragic incident, and perhaps those went into more depth than the film. But this film did do a first-rate job of making me feel what it is like to be a hostage and to live through such an incident. Although I admired “Seven Days in Entebbe,” I found this film more emotional, perhaps because it spent most of its time concentrating on the victims and the chaos of the incident while the Entebbe film also dramatized the terrorists and their motives and the Israeli special forces in more depth than the equivalent forces in this film."
    },
    {
      "rating": "10",
      "text": "Extremely suspenseful and well acted movie. Did a great job showing the extremes of life in India.  Showed the bravery of the hotel staff where many maintained their duty to protect their guests. The terrorists were depicted as methodical killers controlled by their leader who communicated to them via radio a mixture of tactics and propaganda. So well done!"
    },
    {
      "rating": "6",
      "text": "Even Dev Patel can't save 'Hotel Mumbai,' which relies too heavily on coincidental timing to amp up the drama while bogging down the story with numerous errors in logic and continuity."
    },
    {
      "rating": "10",
      "text": "Hotel Mumbai is deep and you will care of all characters, i advice you to watch it!"
    },
    {
      "rating": "6",
      "text": "In November 2008 Mumbai, India, was under attack by 10 terrorists and \"Hotel Mumbai\" concentrates on the one that took place at the Taj Mahal Palace hotel. There is no getting away from the violence that took place and which takes up most of the film in graphic showings.This is Anthony Maras's directional debut and goes mainly by the numbers. Though he, and his co-screenwriter, John Collee, try to look into the stories of some of the humans involved there really is/was too much in what is/was happening.We do meet the 10 terrorists at the beginning of the film arriving at the Mumbai shore in a raft and watch as they go off to their assigned deeds constantly in touch with the leader of their Islamic terrorist organization who is called Brother Bull.  He promises them money and Paradise in the name of Allah which gives him complete control of the gullible, vulnerable boys, young men.Dev Patel, who I saw in a much better, stronger role this week in \"The Wedding Guest\", plays a waiter at the hotel, married with 1 child and another on the way, who really needs the job but that's all we really get to know about him. There is his boss, Anupam Kher, who I really l like in the TV series, \"New Amsterdam\", playing the head chef and boss of the restaurant who we really don't find out much about except he believes the 'Guest is god' and won't accept less from his staff.There is Armie Hammer, with his young Indian bride, Nazanin Boniadi, their young baby and his nanny, Tilda Cobham-Hervey not to forget the mysterious Russian guy Jason Isaacs, who you wish the terriorist would 'take out'. Yes, true story or not, there will be those you don't want to die!In spite of the high body count, and the violence, the movie moves fast, has some suspenseful moments and, if you didn't know anything about those attacks, I didn't, it's a lesson on what is going on in other parts of the world that will wake you up to the fact that we are not alone.About the attackshttps://en.wikipedia.org/wiki/2008_Mumbai_attacks"
    },
    {
      "rating": "6",
      "text": "Despite a noble intent to celebrate the unsung heroes of a major terrorist tragedy, this overlong recounting of the 2008 Taj Mahal Hotel attack places disproportionate attention on the violence and not enough emphasis on the courageous efforts of the staff to protect and save the facility's innocent guests. While the film holds nothing back in accurately depicting the relentless brutality of the insurgents, it places more attention on telling that side of the story than what the film is said to actually be about. Though competently made, regrettably the picture focuses more on the body count than its larger-than-life heroics, veering into territory that becomes a little too needlessly graphic and gratuitous. This is a difficult film to watch, so sensitive viewers should definitely pass on this one. And, for those made of heartier stuff, be aware that the film could have been a far better offering with a change in focus."
    },
    {
      "rating": "9",
      "text": "Amazing, left me feeling a whole host of emotions, It has stuck with me for a long time after. I noticed that there are a lot of \"critic\" reviews saying its bad, it's not. These critics are no longer that, they are regressive liberals who watch a film like this while tweeting #NotAllMuslims. They are offended that this movie was made, they hated it before they even started the film.Lastly congratulations to the people who made this film, it's a very sensitive subject with the way the west has decided to hide the truth in case it offends the twitter brigade. You are brave people and we thank you for that! It has given us a world class movie."
    },
    {
      "rating": "7",
      "text": "\"Hotel Mumbai” is an Australian film directed by Anthony Maras who co-wrote the film with John Collee. The film tells the story of  the invasion and near destruction of the famous Taj Hotel in Mumbai, India by Jihad Terrorists.  Starring Armie Hammer, Dev Patel and Jason Isaacs. the characters  portraythose caught in the midst of this terrorist attack and the efforts of staff and guests to survive.Were it not for the fact that this is a true story of an incident that actually occurred about 11 years ago in the city of Mumbai, India, it could easily be dismissed as simply another action filmmade to suit the whims and tastes of a modern audience. However, knowing that all of what is depicted in the film did, in fact, take place, coupled with the excellent editing and interjecting of actual voices and newsreel film, it causes the audience to be riveted in their seats as the 2 hour film speeds by with action, drama and suspense.I give the film a 7.5 rating for it gives insight into not only the victims but the perpetrators as well and makes for a powerful theatrical experience."
    },
    {
      "rating": "8",
      "text": "In 2008, Mumbia was the scene of numerous coordinated terrorists attacks. The highest profile was the titular luxury hotel. This film vividly recounts this assault with plenty of merciless murders, countered by a group of hotel guests and the brave staff that helped protect them (most notably a waiter played by Dev Patel). The gunmen's strikes are played out with heartless violence, although they have made a slight effort to humanize them. Meanwhile, the plight of the guests revolves around one American (Armie Hammer) and his family. Even though this harrowing incident is captured with a constant level of tension and dread, the film falls short of a powerful emotional punch."
    },
    {
      "rating": "5",
      "text": "Fairly well-directed but overlong by 1/2 hour and full of underdeveloped characters."
    },
    {
      "rating": "7",
      "text": "Suspenseful, intense, and well-acted, \"Hotel Mumbai\" is an insightful biopic of the 2008 Mumbai attacks and the acts of bravery by the guests and hotel staff during those heinous attacks."
    },
    {
      "rating": "7",
      "text": "Trying to recreate a horrific event of a terrorist attack with multiple actors is no easy task. This filmmaker & director was able to pull it off. The drama was not in the story but in the tension & fear portrayed by the players. I give it a 7.8 overall"
    },
    {
      "rating": "9",
      "text": "Crazy that this movie is made based on real events. Watching it feels a bit scary thinking how crazy it can actually happen and thinking what you would do in each place if that happened. Crazy scary to think about it. Good acting and intense movie."
    },
    {
      "rating": "7",
      "text": "True tragic story movie of Mumbai attacks at 2008, the movie focus on Taj Mahal Palace hotel attack, the 5 stars and luxury hotel that damaged due to the attack and around 31 people died there, the value of this hotel was represented by its staff who preferred to stay in the hotel to protect the guest instead of run away, I would like to thank the creators of \"Mumbai Hotel'' who remind us of tragic forgotten story and gave us an image that copied in our mind we couldn't forget it.You can read about the attack in 10 minutes in any website, but you will never know how bad it was until you watch this movie."
    },
    {
      "rating": "10",
      "text": "I really enjoyed this movie and learned a lot of facts of The 2008 Mumbai attack.I respect the heroes at the hotel.Great movie!"
    },
    {
      "rating": "8",
      "text": "Panic in Mumbai! The real life drama of how the heroic efforts of staff and guests of a five star hotel helped to stay alive from a brutal terrorist attack. Nail biting till last minute."
    },
    {
      "rating": "0",
      "text": "I divorced a crazy wife, she married an Egyptian Arab guy, it's hard for me to watch movies from this region."
    },
    {
      "rating": "6",
      "text": "Hotel Mumbai is not a bad film but it's the kind of film that will hardly manage to create a remarkable impression in oneself as a viewer.What I mean by that is that its structure never manages to find a correct voice on how they want to narrate the terrible real events with which the story deals.The problem is that this film goes from being a drama, to an action thriller and everything becomes a mixture that comes out a bit more graceful because of its cast rather than the script. Which also because of the obvious tragedy that is narrating, it cannot avoid to fall into emotional manipulation .It wasn't bad. Irrelevant at most but certainly not bad.Hotel Mumbai is not a bad film but it's the kind of film that will hardly manage to create a remarkable impression in oneself as a viewer.What I mean by that is that its structure never manages to find a correct voice on how they want to narrate the terrible real events with which the story deals.The problem is that this film goes from being a drama, to an action thriller and everything becomes a mixture that comes out a bit more graceful because of its cast rather than the script. Which also because of the obvious tragedy that is narrating, it cannot avoid to fall into emotional manipulation .It wasn't bad. Irrelevant at most but certainly not bad."
    },
    {
      "rating": "9",
      "text": "Great film with excellent director's work. Whe I wanted it I empathized almost all people who was event in this.Film is very realistic and scary, because it was happened in reality and I was abroad many times.If you put yourself in the position of the hotel staff, there are many dills to choose the right action"
    },
    {
      "rating": "7",
      "text": "Muy entretenida, mantiene la tensión, sangrienta, la historia es buena, aveces suena ilógico pq no hacen más, pero funciona."
    },
    {
      "rating": "7",
      "text": "A couple of recent films “based on true events” have not compared favorably to their documentary competitors.  With “RBG”/”On the Basis of Sex” and “Apollo 11/First Man,” for example, one wonders why the fictionalized versions of events were even made.  “Hotel Mumbai” is a powerful exception.Based on the 2009 documentary “Surviving Mumbai,” this film is relentless in its tension, angst and anguish.  It chronicles the terror attacks in Mumbai in November, 2008, carried out by a group of Pakistani boys who were promised that their families would receive cash payments because of their ultimate sacrifice.  These boys were trained and sent to their deaths by an unseen “Brother Bull” (a person never identified or caught) who orchestrates their every move through constant cell phone communications.  During their rampage, twelve different sites in Mumbai were attacked, with the culminating event the occupation of the landmark Taj Mahal Hotel.Director Anthony Maras, in his feature film debut, gives the viewer only the sketchiest of backgrounds about the terrorists and only limited insight into the backgrounds of those who became the object of their violence.  Clearly, Maras, who also served as co-writer, wants this film to focus almost exclusively on the action taking place in the present.  This intentional lack of character development also serves to even more effectively highlight the rare moments of humanity.  As Arjun, a devoted hotel staffer, Dev Patel (2009’s “Slumdog Millionaire,” Oscar nominee for 2017s “Lion”) is particularly memorable.  In one scene, he patiently explains the cultural significance of his pagri (Sikh turban) to an unnerved guest who thinks, because of his appearance, that he may be a terrorist, too.A few scenes develop the thesis that this insane violence was not grounded in religious differences, but may be better understood in terms of class warfare.  “Brother Bull” reminds his minions that the wealthy have left them behind.  The hotel’s head chef (an excellent Anupam Kher) admonishes his staff regularly that “the guest is god.”  In a particularly poignant moment, the boys/terrorists, mid-rampage, pause to marvel at a flush toilet.While there is interesting subtext to ponder, the central focus is on the actions of the terrorists – all offered in consistently unflinching detail.  Some have criticized the film for its excessive violence and for the insensitivity of releasing the film just after the mass shooting in New Zealand.  However, for a film that effectively dramatizes the senselessness of indiscriminate violence, the timing seems just right."
    },
    {
      "rating": "6",
      "text": "以恐怖袭击为题材却叙事平淡，波澜不惊，选点怪异，观看下来总有一股不伦不类的违和感 ，这么处理倒不如拍成纪录片。"
    },
    {
      "rating": "1",
      "text": "(Mauro Lanari)Ten young jihadists massacre the wealthy guests of the prestigious Taj Mahal Palace Hotel, among the survivors a mother who rejoins the child entrusted to the carer. The rookie Maras succeeds in the hard feat of making the victims and hostages more unpleasant than the executioners."
    },
    {
      "rating": "9",
      "text": "Customer support service +1 866 94O OOO5  . Call themit will help for sure ;;"
    },
    {
      "rating": "8",
      "text": "This is a pretty decent action thriller film. I remember seeing the live news footage when this particular attack happened - it was a scary time. The film fetaures a decent cast and lots of tension. I was somewhat pleased to see one or two turn of events (a small element of humanity seemed to exist, where perhaps it may not have done). I'm not sure there's too much I can say about it but its a well made film, which I'd hope depicts the story well and indeed there's the usual thing of text and photos/library footage shown at the end of the film, before the final credits roll, to finish the story and put a bit of context to things. Not a bad film at all...it didn't feel/seem disrespectful to what was surely a tragic and very scary time to live through. Recommended."
    },
    {
      "rating": "10",
      "text": "Amazing! Best film I've watched in a long time , definitely recommend. Had me glued the entire time"
    },
    {
      "rating": "10",
      "text": "It's worth Watching this movie, Those emotions can't just be expressed through words"
    },
    {
      "rating": "7",
      "text": "Hotel Mumbai is deep and you will care of all characters, i advice you to watch it!"
    }
  ],
  "recommendations": [
    "detroit",
    "13_hours_the_secret_soldiers_of_benghazi",
    "munich",
    "patriots_day",
    "dark_waters",
    "the_33",
    "lone_survivor",
    "the_way_back",
    "zero_dark_thirty",
    "incendies",
    "the_first_purge",
    "the_rhythm_section",
    "anthropoid",
    "7_days_in_entebbe",
    "just_mercy",
    "sin_nombre",
    "hostiles",
    "greenland",
    "the_guilty",
    "the_mauritanian",
    "closed_circuit",
    "miss_bala",
    "allied",
    "snowden",
    "high_life"
  ]
}