{
  "id": 276,
  "title": "Hotel Transylvania 3: Summer Vacation",
  "starring": [
    "Adam Sandler",
    "Andy Samberg"
  ],
  "runtime": 97,
  "genre": [
    "Animation",
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "description": "Dracula, Mavis, Johnny and the rest of the Drac Pack take a vacation on a luxury Monster Cruise Ship, where Dracula falls in love with the ship’s captain, Ericka, who’s secretly a descendant of Abraham Van Helsing, the notorious monster slayer.",
  "releaseYear": "2018",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gjAFM4xhA5vyLxxKMz38ujlUfDL.jpg",
  "categories": {
    "plot": 6.46,
    "acting": 6.787878787878788,
    "ending": 6.6923076923076925,
    "soundtrack": 7.5,
    "cinematography": 7.0,
    "familyFriendly": 6.142857142857143,
    "funny": 6.622641509433962,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "loved it!!! selenas voice work is amazing as usual her reprise in the franchise has helped it significantly"
    },
    {
      "rating": "8",
      "text": "Though the film lacks the emotional backbone and steadier plot of the first one, I found this to be genuinely fun makes up for the lackluster and slightly mean-spirited second film.The main plot in this is a little predictable. Not bad, just obvious. But, this film is more about the journey than the destination. The installment is more segmented, following the many, many monsters in their own storylines. This is actually to HT3's  benefit. The main emphasis here is humor and they mine the heck out of it. Think of HT3 as more of a series of Saturday morning cartoon/Looney Tunes-style skits.Director and animation veteran Gendy Tartakovsky, ups his game with his unique style of distinctive animation and fluidity of movement. (Again a very old-school cartoon-style.) The new character Ericka, the captain of the ship,  is especially impressive in the sheer amount of detail given to her various facial expressions and body motions. The characters remain distinctive-looking and colorful. The cruise ship setting really pays off with the different attractions the characters visit are visually arresting.The movie also solves the previous villain problems of the last two films. Rather than have a shoehorned in villain who appears briefly and feels more like an afterthought, we finally have villains who appear throughout and are actually vital to the plot.There are two little weak spots to the film for me. First, there's Ericka's chin. It's just a little too pointy and oddly angled for its own good. Second, the movie gives children the misguided message that love exists immediately at first sight.  Again, this may not be a Pixar/Disney level movie but is entertaining in its own little way."
    },
    {
      "rating": "7",
      "text": "La mejor de la trilogia muy entretenida aun que tiene sus toques raros la hija de dracula muy muy joven para tener un hijo..Los protas reales de la primera y segunda han quedado en un segundo lugar Pero aun asi bastante buena."
    },
    {
      "rating": "5",
      "text": "With few innovations, it resembles the second part of the animation, even though it is limited to only one main scenario. At least it's a noticeable increase in maturity. A weak script, without much to save, and a notable devaluation of the characters compared to the other films in the trilogy. 5.0/10"
    },
    {
      "rating": "7",
      "text": "Sony's back at it again with their wavy and loose animation style, which after Emoji Movie is a very welcome addition. Sony's also back trying to make us think that this movie isn't completely unnecessary. There was definitely an attempt to make a movie here, and it kinda works. It's a Hotel Transylvania Movie, that's for sure."
    },
    {
      "rating": "9",
      "text": "Hotel Transylvania 3: Summer Vacation is a funny yet exciting adventure that both lives up to the first two while creating something never-before-seen in the franchise. This movie was 97 minutes of pure laughter. The only ding against it is that the story is a little predictable. Other than that, Summer Vacation was a super fun film and I really enjoyed it."
    },
    {
      "rating": "4",
      "text": "It's clear that modern animations are starting to run out of ideas. So decent, predictable and blank with very few scenes i liked. I still recommend it to children through."
    },
    {
      "rating": "2",
      "text": "The first one I liked a lot, it seemed original and that the animation and the way the characters moved contributed to the comedy; the second one waS good; but the third ... it is very obvious that they made it to win easy money, the story is loose, the characters are many and none has its moment, there are many subplots at once, it is a joke blender (not even 1 minute passes without there being no) and how the characters move is tiring to watch. The animation good. Bad movie but the little ones will love it because it is for that public, it is only for kids, nobody else."
    },
    {
      "rating": "5",
      "text": "I like the franchise, but this latest installment is less hotel Transylvania and more loony toons. I dint like that."
    },
    {
      "rating": "3",
      "text": "This film might be good enough for the kids, but definitely not a good choice for adults that aren’t going with kids.  The humor isn’’t clever like some animated films, and I found it a rather boring film and a waste of time."
    },
    {
      "rating": "9",
      "text": "Splendid sequel. Best of the 3 In our opinion.  Superior animation.  Tons of good jokes and pokes at other mediums.  Bit of Dr Seuss in some characters. Kids and their parents loved it at the theater we were at.  Alot of laughter and applause at end.  Well done."
    },
    {
      "rating": "2",
      "text": "I really enjoyed the first 2 installments of the Hotel Transylvania franchise. However, this third movie was boring and unappealing. I don't believe that myself or any of my children laughed throughout the entire movie. It just seemed that the movie was trying to hard. I feel asleep about 29 minutes into the movie. I'm hoping that this will be the last movie of the franchise."
    },
    {
      "rating": "2",
      "text": "Weakest of the franchise so far.  Found nothing funny or particularly entertaining.Might work for kids who aren't picky."
    },
    {
      "rating": "4",
      "text": "Was hoping much more from this. Instead, it's a PC-safe, kid-safe, \"let Hollywood tell the world that tolerance matters\". So preachy it qualifies as an \"after-school special\". Apparently, EDM is \"bad\" and pop standards are \"good\", too. And did anyone find it ironic and lazy that the ultimate weapon against the monsters was itself a monster?! Makes no sense and will likely be just the latest reason this franchise ends right here. The animation and voicing was top-notch, too bad the screenplay was so lame. Genndy Tartakovsky, director/writer, is not typically saccharine like this. He's done much better work with TV's \"Samurai Jack\" and \"Star Wars: Clone Wars\". Expected better..."
    },
    {
      "rating": "5",
      "text": "While the movie was fun to watch, it was not all that memorable and felt like a run of the mill story. It had it's funny moments and it also had it's moments of less than stellar writing. A good kids movie, but not really much outside of that."
    },
    {
      "rating": "5",
      "text": "Hotel Transylvania 3: Summer Vacation is the biggest movie cliche we've seen in a while. Am I surprised? Nope. Am I disappointed that they threw the character development out the window? 100% for sure yes. Now the movie isn't bad per say. It's just painfully average compared to the spunk and creativity of the last two films. Now this time Mavis takes on the obsessive daughter trait. But I'm not saying that Drac doesn't deserve it for meddling in her life for the past 2 movies either. Overall this film isn't bad but if you give us another one please don't make it about some sort of dumb trope we've seen a thousand times before."
    },
    {
      "rating": "8",
      "text": "its good i like the comedy the animation was good at some parts not the best animation but if you like the first one you would probably think the first one was a little better and this one was ok"
    },
    {
      "rating": "3",
      "text": "the joke for adult but the story is too bad for adult. fun visual but I cant say about the story."
    },
    {
      "rating": "6",
      "text": "Simple and cute, and childish. Nice visual but not much to say about the story though."
    },
    {
      "rating": "9",
      "text": "In Sony Pictures Animation’s Hotel Transylvania 3: Summer Vacation, join our favorite monster family as they embark on a vacation on a luxury monster cruise ship so Drac can take a summer vacation from providing everyone else's vacation at the hotel. It’s smooth sailing for Drac’s Pack as the monsters indulge in all of the shipboard fun the cruise has to offer, from monster volleyball to exotic excursions, and catching up on their moon tans. But the dream vacation turns into a nightmare when Mavis realizes Drac has fallen for the mysterious captain of the ship, Ericka, who hides a dangerous secret that could destroy all of monsterkind. Hotel Transylvania 3: Summer Vacation delivers exactly what fans will expect - which means another 97 agreeably lightweight minutes of fast-paced gags and colorful animation. This is hand's down, the best movie of the trilogy. I'm gonna give Hotel Transylvania 3: Summer Vacation an A. Don't miss this one, it is super funny."
    },
    {
      "rating": "5",
      "text": "chalky around the edges and adventurous at heart..Hotel Transylvania 3 : Summer Vacation2 And A Half Out Of 5Hotel Transylvania 3 : Summer Vacation is a plot driven animation feature that sticks by its motto which is to serve a fun and breezy family time to the audience. There is a lot of heart and genuine emotions that flows as chemistry among the characters which does communicate with the audience that helps fuel this flawed and at times ridiculous comic feature. As often such animation feature does, it is rich on technical aspects like its visual effects, up beating songs and sharp sound effects although the editing and background score could have been a lot better. The relations depicted from the scratch stands alone among all the other bits and pieces, since its sweet and even though corny, journey is something that touches the viewers. The writing is; as mentioned earlier, cheesy and corny with pretentious and foricbly installed humor that works only half the time. The screenplay by McCullers and Tartakovsky is blunt and shallow but is adaptive and gripping with typical sketchy comic sequences pitched in to lure the audience and suffice its commercial aspects. Gendy Tartakovsky; the co-writer and director, has done a decent work on executing the scattered script and blends it nicely that may be easily forgetful but is entertaining in its own terms. The returned voice cast (Adam Sandler, Selena Gomez and Andy Samberg) holds on to their parts convincingly with additional cast Kathryn Hahn and Jim Gaffigan supporting them nicely. The build-up of the relationship of Sandler and Hahn, eerie yet impactful climax and, the characteristics of the characters are the high points of the feature that draws in most of the laughs. Hotel Transylvania 3 : Summer Vacation is chalky around the edges and adventurous at heart which may not be the game changer in the franchise but has certainly maintained the quality with the franchise."
    },
    {
      "rating": "8",
      "text": "Hotel Transylvania 3: Summer Vacation is once again directed by Genndy Tartakovsky, written by Michael McCullers and Genndy Tartakovsky, and voices by Adam Sandler, Selena Gomez and Andy Samberg.The monster family embark on a vacation on a luxury monster cruise ship so Drac can take a summer vacation from providing everyone else's vacation at the hotel. It's smooth sailing for Drac's Pack as the monsters indulge in all of the shipboard fun the cruise has to offer, from monster volleyball to exotic excursions, and catching up on their moon tans. But the dream vacation turns into a nightmare when Mavis realizes Drac has fallen for the mysterious captain of the ship, Ericka, who hides a dangerous secret that could destroy all of monsterkind.HT3:SV isn't the best of the trilogy, but still fun and colorful as the previous two. They improved lots of stuff, mostly the animation, it was completely amazing in this one. The rude humor is totally increased in this one too, but the humor in total wasn't that effective like HT2, it's like the first one, but with more rude humor.HT3 is a complete animation fun movie, but still not that perfect like the second one, yeah, it's not perfect, I found some issues with it. Let's talk about them, shall we?The movie was so fast, I think and expected to see my favorite monster family's vacation more than that. Because of that, some funny scenes went super-fast that you didn't have the time to laugh at. I mean the length could've been longer than that.I loved Johnny in the previous two, but in this one I didn't see him that much, he showed so little time! I wanted more of him, but sadly, I didn't find that.The dancing-finale was childish, and I'm not used to see a totally childish scene in this franchise. These are my issues with this movie.As I said, the animation is totally amazing, the rude humor is high, the voices still as talented as they were and the story is richer than the previous two.Hotel Transylvania 3: Summer Vacation is totally fun, but not the creators' best, I wanted more, they could've made morr, but still Hotel Transylvania 3: Summer Vacation is an entertaining movie, and I'm gonna give an A-.Okay, guys, thank you as always for reading my review, let me know if you like my reviews or not, and I welcome all the comments."
    },
    {
      "rating": "0",
      "text": "its so dumb´ the whole movie, i even closed my eyes for a lil´time, i cant belive this happen in 2018. not convence me for all."
    },
    {
      "rating": "6",
      "text": "Feels kind of like a straight-to-DVD release. The bottom of the barrel premise of monsters on a cruise serves as an excuse to set Dracula up with a love interest. Aside from a new message about being able to find true love twice, this is largely a retread of themes from the first movie. Albeit with a role reversal as Mavis is the one trying to distract from a newly budding romance.The main characters don't get the attention they deserve as the story keeps getting sidetracked with the antics of its supporting cast. With the movie's attention being pulled in so many directions the whole thing feels unfocused as it jumps between a plethora of gags and set-pieces.It's comedy and pacing are as energetic as you would expect. The jokes are just more hit-or-miss this time around. Not a big deal as far as the youthful target audience is concerned, but parents, older siblings, and even kids at heart are probably going to be a little bored. It's certainly the most imaginative Hotel Transylvania though. From the Bermuda Triangle to Atlantis, the visuals are bright, colorful, and unique. A nice change of pace from the cartoon gothic imagery of the previous films. The monster designs are also very creative.The thing the movie does best though is music. Whether it was Dracula strutting on deck to Bruno Mars' 24K Magic or the epic dubstep Kraken battle, most of my favorite scenes were directly tied to the fantastic soundtrack.An underdeveloped story and overall weaker sense of humor keep Summer Vacation from being as good as it's predecessors. Kids will still love it. Older audiences on the other hand might find that it has a hard time keeping their attention, cute as it may be."
    },
    {
      "rating": "8",
      "text": "This movie is great. The voice acting fits each character well. The animation was excellent, I didn’t see any big flaw in it. The story was fun to watch. The beginning was a little slow but only for the first 10 minutes or so. The middle was very funny in my opinion. Each joke landed well and made many people laugh. The ending had a lot more action but was still funny. The movie was better than the original but not as good as the second Hotel Transylvania movie, at least that’s my opinion. I recommends this movie."
    },
    {
      "rating": "7",
      "text": "Definitely the best of the three, great animation and enjoyable for both children and adults."
    },
    {
      "rating": "6",
      "text": "Well made family friendly comedy. Good balance of humor for kids and parents. Animation is good. And although this is another sequel, the studio is continuing to put quite a bit of effort into these films."
    },
    {
      "rating": "8",
      "text": "I think the reviews are being a bit too harsh on this movie: it's a fun sequel that while it has its usual serious moments they're not so serious to be campy or unfitting. I sincerely had a good time in it, despite my expectations being ultra low, and even if the humor can be cheesy and very childish at times I felt it was trying to be \"that\", to be silly and funny. I definitely had a better time watching this than the previous movie, mostly because they tried so hard to focus on Davis and well they didn't make a good job, resulting in him being boring. Even the first movie was better because Jonathan was a much more likable character and he was the one who gave Dracula the reason to like humans, while in the second it was Jonathan and Mavis relationship part of the struggle and Davis was just the McGuffin but barely really a character, making him just a prop rather than a real character - even in this movie he's barely got a spot,  heck even Jonathan gets more highlight than both Mavis and Davis!If anything the only thing I disliked was the forced villain...I mean it's likable and at the end they make peace, but I think they could've avoided that entirely and make it just all about dracula finding a new companion...afterall Dracula is the main character of all three movies no doubt, he's the reason why you want to watch these movies: he's still as funny as ever, he's just a tons of fun and overall I just crackled up whenever he was on screen.Is it childish? Sure, but at least it's harmless and it knows that it's a silly, SILLY story that just wants to be funny. Does it always succeed? Nah, but those times it did it was legitimately funny and I definitely look forward to the dvd release.Give it a shot: it's not Oscar worthy but it's just a fun, harmless flick that anyone can watch. Did I expect more? Sure, but after the second movie, I found this much more enjoyable, while the second was a drag to me."
    },
    {
      "rating": "5",
      "text": "By far the weakest film of the trilogy. Was really looking forward, as I really enjoyed the first two, but felt very disappointed throughout the movie. The movie imho is ruined by a very forced feeling and hard to bear EDM/dubstep scene towards the ending. All in all too predictable and simply less funny than the last two movies."
    },
    {
      "rating": "6",
      "text": "I really liked the first movie and the second was decent. This one suffers as I find Drac is better in small doses. It is still an enjoyable, and family friendly, movie. The visuals are also very impressive. In some ways there are just too many characters. It would have been better if some of the background characters stayed in the background and had less screen time. So it is overall an okay, but just okay movie."
    },
    {
      "rating": "5",
      "text": "If this is the result of Sony begging for money so bad, I got to admit it that this is a way better attempt at begging for money than The Emoji Movie back in 2017. Nonetheless, Hotel Transylvania 3: Summer Vacation is another one of those sequels that is just unnecessary to the people who would expect more from this franchise. What Hotel Transylvania 3: Summer Vacation features is all your favorite characters but this time outside the recurring location in the entire franchise because they're going to have a summer vacation. I would have at least expected more than just that simple plot. As if that plot wasn't enough, the gags are nice and clean for children to laugh at but wears out so fast that adults will have trouble time laughing at them. Don't expect a lot more from here."
    },
    {
      "rating": "6",
      "text": "Fast-paced jokes, interruptive comic scenes, slapstick humor, brightly colored animation, and the distinctive direction style that feels that it fits 2D animation more than 3D animation. They are all here to make HT 3 the most \"Genndy Tartakovsky\" movie of all the three Hotel Transylvania movies.Sadly, most of the gags fall flat. Simply, because almost all of them are recycled jokes from the first and the second movie, which also borrowed the original's jokes, and therefore the jokes were less effective, hence the movie was less funnier. Let alone borrowing the same old jokes once more time! But there are also a lot of repetitive jokes from this very movie. I mean how many times should we laugh about Frank's body-part liberation?! And are failed assassination attempts are that funny ?! Seriously, I thought I was watching an unfunny version of Ton & Jerry! Also, there are tons of adult jokes that are just lame!What disappointed me the most is that it's the first time that I found the interjected humorous scenes that distinguish this franchise very annoying, and completely useless. They are also used so much and became so boring. This time they really feel like string of gags that has nothing to do with the story.Dennis elevated the humor a little in the first sequel. This time it was Dennis' cute monster-sized puppy, Tinkles, or should I say Bob, that did this job, kinda! At least it had the only repetitive joke that actually worked very well. Also, some of the visual gags worked for me.Speaking of visuals, this second sequel is just visually dazzling! While the lack of improvement in terms of the animation quality was one of the issues I had with the second installment, this movie suffers from anything but. As I mentioned above, Genndy Tartakovsky is in top form this time. He brought all his unique trademarks which some of them are familiar to the series fans. But he also garnished this threequel with some of his most idiosyncratic visual techniques that fans of his other works like Samurai Jack or Dexter Laboratory will definitely relate to. The quality of the animation itself also improved a great deal. The result is a 3D animated movie that is nothing short of a feast for the eyes!The movie, nevertheless, doesn't look good just for the sake of it. But the visuals are full of imagination and inventiveness. From the look of the setting to the new characters', everything looks fresh. Just not necessarily funny.There is some depth that was given to the characters of Dracula and Mavis, and their father-daughter relationship that also served the plot. There is also a smart improvement in the movie's vampire world that was crucial to the main plot. In fact, there are some subtle nuances here and there that could be enough to make the fans of the franchise eager to see another sequel.Johnny was unbearably stupid for the most part, except for one scene which I consider one of the funniest scenes in the movie. The thing that made this scene, besides some other scenes most of them at the final act, so special is the mix between music and action. I haven't seen anything like these scenes before except in Samurai Jack. They are long scenes that look as epic as silly!The story is so familiar, and the plot itself is so generic. Also, we have seen billions of animated films that deliver the same message. But the creative slick visuals were more than enough to made up for that. Besides, the message, despite being pretty much on the nose, is utilized cleverly by mixing it with the villain's motives. It is a very easy way to construct the villain, but it is also a very smart one that saved some time, and made a run-of-the-mill, yet somewhat convincing villain.While the movie's generic plot wasn't a big problem, the movie spent most of its first two acts offering tired jokes till it really kicked up at its final act. Almost the entire first and second acts are consist of a sketch comedy after another.I don't have much to say about the vocal performances. All the cast reprised their roles as our beloved characters, and they were amazing as always.Colorfully vivid, and madly fast-paced, Summer Vacation is the most visually pleasing and creative installment in the franchise. It's also way less funny than its two predecessors which, for me, means the weakest one.(6.5/10)"
    },
    {
      "rating": "9",
      "text": "Visit this site to get entertain & fun. this is the best movie in animated style. want more fum and enjoyment then come into this website...https://goo.gl/f9ZTrd"
    },
    {
      "rating": "1",
      "text": "Is it possible to Xerox a film, right down to the bones of the plot and the jokes?  Little kids who like the franchise will probably find something to like here but Sandler and Smigel are the only adults laughing, counting the money all the way to the bank."
    },
    {
      "rating": "7",
      "text": "you keep this box together. are you hope together i hope. you want to give me. i know to say to me. i can use say this words. i hope theres is a 1999 vhs. i know that there is something i dont ask i know you want."
    },
    {
      "rating": "5",
      "text": "Mildly entertaining but utterly stupid from beginning to end. Visuals are excellent."
    },
    {
      "rating": "10",
      "text": "A rare case where the third movie in a franchise is really good. It is the more of the same approach with expanding of the lore, new characters atop on everything that makes the prequels good. I could end here with the statement “If you like the previous movies you will like this one too”.  I will instead go into details. The movie starts with a flashback long ago were the monster gang is on the run from Professor Abraham van Helsing who wants to kill them. Dracula however could always outsmart him and he stopped his attempts long ago. Jump to the present and Dracula is a bit unsatisfying with his life. Everything is running by routine smoothly and it is unsatisfying. Would describe it as burn out or bore out if not even the equivalent of a midlife crisis (If there is a vampire equivalent for a midlife crisis). Atop of this he is still suffering from the dead of his wife even if this happen long ago (he hides this). His family wants to lighten his mood with a family holiday so his daughter Mavis books a cruise and the whole cast joins him. He is not happy about this until he meets the female captain of the ship named Ericka. Meanwhile there is more to this than meets the eye. I stop with this introduction. The story itself fully delivers what you expect in an entertaining way. The story is interesting, the humor works well, old and new characters are enjoyable and the climax is just amazing. I freely admit that it is not the most creative animated movie nor in the realm of the best of the best. However it does not need to be there. It is humorous and entertaining with a cast I care for. This is a good description for a movie that works well. Again we have the whole team of great voice actors with Adam Sandler (works here far better than in his later movies), Selena Gomez, Kevin James, Andy Samberg, David Spade, Frank Drescher and Mel Brooks to just name a few. They again fully deliver and the cast is as enjoyable as humorous. For the new characters we got Kathryn Hahn as Ericka who I enjoyed already in Crossing Jordan (Recommend the show), Jim Gaffigan as excellent Professor van Helsing and Joe Jonas in a role I wont spoil. Like in the prequel the new characters are a good addition to the cast and franchise. The animations are again excellent and I repeat myself that the art style is one of my favorites. It blends in so well with the voice actors. For the first time for this franchise I also praise the soundtrack as they made an amazing use of its potential (I am vague on purpose here but you will know what I mean). Overall this was surprisingly well done. The third movie is in many cases a catastrophe like Alien 3 and Godfather 3 or the weakest so far like Terminator 3. Here they gave us something that succeeds in being the same we enjoyed but still fresh enough to work. The humor in conjunction with the awesome final gets a bonus point for my rating. I recommend all movies in the franchise so far and hope that the next movie will come out soon."
    },
    {
      "rating": "6",
      "text": "Hotel Transylvania 3: Summer Vacations, is a movie where a different facet of the trilogy is shown, but comparing the two previous movies, they showed us few than the little he showed of the gang, a good development for some of the characters because in others they are not taking effect, and a fun but very simple story."
    },
    {
      "rating": "7",
      "text": "This is the third “Hotel Transylvania” film, an animation franchise that has been doing very well to Sony Pictures Animation. It lived up to expectations and stood out in quality with the previous two films. It is a noisy fast paced film that leaves the audience little time to think about what they are watching.In this film, the monsters leave their isolated hotel and go on a cruise, so that old Count Dracula can finally take a vacation and forget about managing his hotel. At the same time, the vampire seeks a new girlfriend, despite not being able to admit it to Mavis, and is delighted with the ship's commander, Ericka. However, she hides a secret: she is the great-granddaughter of the Count's greatest enemy, the vampire hunter Abraham Van Helsing.Its not a perfect film but it fits into the franchise and maintains the logical sequence of the previous films. For that, I am sure, it helped a lot the fact of maintaining the same voice actors and director, who also ensures the script writing here. Like the first and second films, love - the \"Zing\" - is the main theme, and that not only seems coherent but its perfectly suited to a family film. Dialogues are good and the jokes are naive but very clever. They won't make you laugh out loud, but they guarantee a good mood.Although the story told is generally good, it is very predictable and obvious, and this can alienate or displease adults. The ending is even worse, as it is excessively sugary, that kind of happy ending where everything goes well, everyone is happy and love is in the air. Another problem is the lack of development of the characters due to the enormous amount of characters in a constantly overpopulated film. We literally go with the crowd. A lot of characters, such as the Invisible Man or the Mummy, was there only for the jokes and comic moments. Others are dismissed, disappear. This is the case of the werewolves, who are literally put to sleep for most of the film.The work of the voice actors remains excellent, and something else could not be expected after two films with the cast core intact. Personally, I would like to highlight the good work of Adam Sandler, an actor who is not easy for me to like but who has an excellent voice and knows perfectly how to use it. After a second film where things did not went well, Selena Gomez and Andy Samberg returned to their good shape, which is due to better use of their characters. Kathryn Hahn was up to the challenge with a cheerful voice that fits her character, Jim Gaffigan was a good choice for the villain and I loved Chris Parnell's voice as Fish. In addition to these highlights, the film has, as usual, the good work of Steve Buscemi (although his character had little relevance), David Spade, Kevin James and Fran Drescher.Technically, it is a high quality computer animated film. The overall design and quality of the animation is more detailed than in the previous film, but good CGI is something we get used to in modern animations and which has become the standard and a feature demanded by the audience. It has good light, good colours and contrast. There is no effort of exaggerated realism. The soundtrack was a strong bet in this film and we finally have a good selection of songs, most of which are already well known. Techno and trance music were signed by renowned DJ Tiësto, one of the strongest names in European electronic music."
    },
    {
      "rating": "10",
      "text": "I needed a laugh big time and I felt entertained. This is easily a solid 8 in my book, but since others gave it really low scores(!?) I thought I should bump up the unfair score a bit :)"
    },
    {
      "rating": "6",
      "text": "The third movie was not that bad with humor and great scenes. I really like this one even though it was not the best of the trilogy"
    },
    {
      "rating": "9",
      "text": "This is an absolutely fun movie. I loved it from beginning to end. It's definitely the best one in the franchise!"
    },
    {
      "rating": "6",
      "text": "Its a funny decent movie. I really didn't like the ending but the rest of the movie is good."
    },
    {
      "rating": "0",
      "text": "grande bosta selma não é artista não sabe cantar não sabe dançar não vende não faz nada, only ex do the weeknd escorada nos outros"
    },
    {
      "rating": "0",
      "text": "nice trailer, a perfect time to add a nice twist in our summer but, it ain't necessary to add PART 3 I watched it and the movie was super slow like overall 5 funny scenes but unlike the past Transylvania 1 and Transylvania 2, funny scenes and fast-paced storyline. I must say this movie isn't engaging enough."
    },
    {
      "rating": "3",
      "text": "While being a fan of the first film, the second disappointed a lot until this entry to the Monster saga came out.I couldn't watch all of it, not one thing I found funny (unsurprisingly it is for kids). The addition to the cast of Kathryn Hahn and Jim Gaffigan were both awful the former being a voice I cannot stand. This particular film lacked what the original had, unfunny moments to make a kid fall asleep and I hope the monsters go back on that boat and sail away, sail away, sail away....   forever."
    },
    {
      "rating": "10",
      "text": "The part where the AI Says Drac wants belony instead of telling about a Date with someone is hilarious"
    },
    {
      "rating": "10",
      "text": "This is the world bast animation movie series of Sony pictures animation. I am very thankful of Genndy tartakovsky for made this movie series. And after watch this movie series I want to be a animetar like Genndy tartakovsky."
    }
  ]
}