{
  "id": 1803,
  "title": "House of Wax",
  "starring": [
    "Elisha Cuthbert",
    "Chad Michael Murray"
  ],
  "runtime": 113,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A group of unwitting teens are stranded near a strange wax museum and soon must fight to survive and keep from becoming the next exhibit.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/r0v8qg78Ol9NIsRGe3DME27ORpd.jpg",
  "categories": {
    "plot": 5.363636363636363,
    "acting": 5.260869565217392,
    "ending": 5.5,
    "soundtrack": 5.0,
    "cinematography": 5.333333333333333,
    "familyFriendly": 3.0,
    "funny": 6.666666666666667,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": ".......................................................................74 Idiotas.......................................................... que não.......................... sabem o que é filme de terror............................... ainda mais ................................recheado de cenas de ação"
    },
    {
      "rating": "7",
      "text": "Jayne Collette Serra's underrated reimagining of House of Wax is a stylish, innovative nightmare. Although essentially just a very creative slasher film the movie benefits from some great ideas and a wonderful setup. Plus the performances are strong all around from sexy bad boy Chad Michael Murray, bad ass final twin Elisha Cuthbert, handsome Jated Padalecki, hunky maniac Brian Vsn Holt and surprisingly Paris Hilton. Her attack scene is the film's most intense and brutal ten minutes. Although ultimately it falls into cliched horror tropes the movie surrounding it is innovative and inspired.3.5/5"
    },
    {
      "rating": "8",
      "text": "this is one of the freakiest of the freakiest movies of the horror colllection yet. Some how this is not creeper then Jaume Collet- Serra's film ' The Orphan ' suddenly it isn't better then orphan. this movie has a lot of teen humor with sex and rage which horror movies deal with but these teenagers are idiots well some ot some are dumb like Paris Hilton and the guy from scary movie 1. Grade A-"
    },
    {
      "rating": "8",
      "text": "========================================================,,,,,,,,,,,,,,,,,,,,,,,,,,"
    },
    {
      "rating": "8",
      "text": "````````````````````````````````````````````````````````,,,,,,,,,,,,,,,>>>>>>>>>>>>>>>>>"
    },
    {
      "rating": "8",
      "text": "The film originally opened with a character named Jennifer (Emma Lung) stuck on an empty road with car troubles and is attacked and killed by either Bo or Vincent (this alternate opening is included as a special feature on the DVD and Blu-ray). Though this scene was scrapped, Jennifer's presence still lingers in the film. She is the female sculpture that Vincent is working on and is later displayed with a pink dress and bouquet of flowers outside the movie theater."
    },
    {
      "rating": "8",
      "text": "Miscellaneous Errors When Bo is strapping Carly into the chair, he starts with her right wrist and you can see her trying to push him away with her left hand, but once he straps her right wrist, both of her wrists are suddenly strapped down."
    },
    {
      "rating": "10",
      "text": "●■●■●■●■●■●■●■●■●■●■●■●■●■●■●■●■●■●⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙•••••••••••••"
    },
    {
      "rating": "10",
      "text": "A pair of psychotic twins - born conjoined, but separated by their discredited surgeon father - kill anyone who should happen upon their abandoned town, and turn them into wax statues. When six friends on their way to a football game become stranded, they discover the town's awful secret and must escape before they too become exhibits.Love"
    },
    {
      "rating": "7",
      "text": "I liked \"House of Wax\" for what it was, the plot is predictable and goofy at times but for here it works. The cast was filled with many young up-and-coming teen heart throbs like Chad Michael Murray, Paris Hilton and Elisha Cuthbert and some of the horror and gore aspects work. Again, not a perfect film by any means but its good. Also props to it being the film that introduced me to \"Helena\" by My Chemical Romance"
    },
    {
      "rating": "8",
      "text": "House of Wax is a great horror ..\r I honestly think this amazing film, a screenplay correct, that holds you from beginning to end, with frightening scenes, not denying that the strengths of the film are: Art Direction Soundtrack and makeup, I think it really is a film that deserves to be seen and revised  and I'm very happy that Warner has made ​​the continuation of this movie, because it would not work."
    },
    {
      "rating": "8",
      "text": "Plot holes Vincent's wax mask has nothing holding it up; there are no clips and no strings of any description keeping the smooth wax mask on his face. It would not be possible for a mask like that to remain securely in place without something securing it."
    },
    {
      "rating": "7",
      "text": "In spite of its negligible plot - a group of youths are thrown in the path of a deranged wax sculptor - this film has a lot going for it. The script may be less than brilliant, but it has a fairly tight story, impressive special effects and a great sense of tension and atmosphere as opposed to simple gore tactics. It's just a shame that the film-makers still felt compelled to throw in Paris Hilton, who is there for no reason other than some gratuitous T&A scenes."
    },
    {
      "rating": "1",
      "text": "One of the worst films of all time. Bottom line for the poor performance of Paris Hilton. Does she really think that's an actress? Note 1. Because dying to see Paris Hilton always worthwhile."
    },
    {
      "rating": "10",
      "text": "Um dos melhores filmes de terror de todos os tempos!!!.\rTotalmente subestimado e desvalorizado pelos críticos insensíveis,pessimistas e idiotas.\rElisha Cuthbert é fenomenal dando uma super performance gata,Chad Michael Murray também é ótimo,Jared Padalecki é incrível E Brian Van Holt é excelente como Serial Killer.\rRoteiro excelente de Carey Hayes e Chad Hayes.\rJaume Collet Serra arrasa como diretor desse puta filme.\rUm filme de terror perfeito com muitos sustos e cenas incríveis de ação."
    },
    {
      "rating": "3",
      "text": "The wax statues were well-done as well as the ghost town. And I must admit that I had some chills but, even them weren't enough to compensate the bad acting (except for Cuthbert) and poor storyline."
    },
    {
      "rating": "10",
      "text": "Não sei o porque, as esse filme foi tão marcante para mim, uma história de dar medo, efeitos especiais que condizem com a realidade, enfim, é o meu filme de terror preferido da atualidade, mesmo sabendo que tem melhores."
    },
    {
      "rating": "3",
      "text": "Not scary and dull. I kept pausing it and walking away."
    },
    {
      "rating": "3",
      "text": "I expected this movie to follow in the footsteps of the orignal classic House Of Wax. Totally disappointed with screenplay and artwork."
    },
    {
      "rating": "1",
      "text": "HORRIBLE MOVIE! I never seen the original but this movie is bad, just the main point in travel, they left to go to the super bowl which they didn't even have tickets to and if they scalpt tickets they would be REALLY expensive. but they make it far enough to a town they never heard of before(well two of them do) and the others go on even farther to the super bowl and then deside to turn around and go back after being stuck in trafic on a highway which there is no turn around while people in the back seat are sayin \"TURN AROUND, LETS GO BACK!\" STUPID!!! so they do turn back, retarded. and the other part i remember is when those 2 first go into the wax house and then she see's something outside in the window looking in and gets freaked out, and he goes outside to see what/who it was, it's a free country, people can be outside, and besides that whoever it was, they were just looking in the window, no actually walking into the place and touchin and metting a little wax. and she stays INSIDE the wax house while he goes outside to see what it was outside, f-ing stupid."
    },
    {
      "rating": "7",
      "text": "The plot is admittedly predictable at parts, and the cast a bit generic, but this movie gives it to you in a way few others have. Tense and gory scenes interlocked with a consistent pace that picks up plot pieces and sets them down for later with brilliant efficiency make this a solid, enjoyable horror film."
    },
    {
      "rating": "9",
      "text": "A movie very unpredictable and full of gore and scenes that will leave you open-mouthed."
    },
    {
      "rating": "4",
      "text": "The only take-away is seeing Paris Hilton getting a spear impaled through her head.\r The movie on its own is incredibly dull, and the characters are extremely unlikeable, case in point with Paris Hilton, who at-least gets killed off in a hilarious way. The horror is really dull too. You'd think a film relying on a town full of \"wax figures\" would be able to employ some great horror feeling, but all it pulls off is lackluster fluff."
    },
    {
      "rating": "9",
      "text": ".......................................................................................................................................................................................................74 Imbecis que não curte o melhor do terror ação..."
    },
    {
      "rating": "7",
      "text": "I did like it...I watched it first when it was released and now, again (2012). I still  like it! In the beginning it is a bit slow- which was okey, because it builds-up) and there was some unnecessary sub-plots that did not add anything to the movie (e.g. Paris' Hilton's characters'pregnancy)...but overall it was good. Although I am not that fun of gore, I have to say this was smartly used, and even though the movie was quite visual and there was indeed gruesome stuff, it was there when it was needed..Some may argue that there are some parts in the movie that are unbelievabIe... well, if we give real attention to the movie we will realise that these part are not that illogical really and make sense; any case, the movie is a horror movie,and horror movies are not meant to be always 'realistic'-although we would prefer if they were. Of course this is not a 'superior' movie, but it is fun and keeps you in suspense. As for Paris Hilton's performance (everybody seems to have a said about it), I am not fond of her, but I think she did all right. The movies is not about her, so go and watch the movies seeing her just a one more actress and not as a 'socialite' performing in a movie, because if you do, then your own bias would give you a hard time and you would be unfair to her or/and to the other actors involved.  In general, the performances were decent, no more, not less.Paris' role was little, not particularly important but since there were only two girls of the movie, her role was complementary to Alysha's. Period."
    },
    {
      "rating": "5",
      "text": "Seriously, I donâ"
    },
    {
      "rating": "10",
      "text": ",,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,---------------------"
    },
    {
      "rating": "5",
      "text": "The film makers do a really good job of creating characters whom you wish would shut up and die so when the time comes for their horrific deaths you are relieved. Its also not a good thing that Paris Hilton is the movie's most convincing actress either. The set and props of the House of Wax scenes were pretty good but mostly misused. Just another lamed out horror movie."
    },
    {
      "rating": "8",
      "text": "Very efficient, scary at some parts, love the special effects of certain shots. I recommend this movie for those who love to be seated on the edge of their seats. Don't drink and watch, you will spill your drink in a matter of time!!"
    },
    {
      "rating": "10",
      "text": "[***SPOILERS***] This is probably one of the best movies of 05. just because....a)elisha cuthbert lives, she's a babe b)paris hilton gets absolutely owned in the middle of the movie c)tons of guts and gore and d)the plot was very effective because it practically had me on the edge of my seat, wondering what was going to happen. if any of those reasons were not sufficient in this movie, i would've pulled out my hair at it. this for once, was actually a pretty scary movie."
    },
    {
      "rating": "6",
      "text": "The remakes just keep getting worst, and here it achieves the unnatural gift of beeing stupid and dreadfull, the teens have no skill, and even though the art direction is excellent, everything else is trash."
    },
    {
      "rating": "6",
      "text": "It was a pretty solid movie suprisingly. Not much in terms of suspense though but it was interesting enough to keep you watching. I enjoyed it and saw no real problem with it."
    },
    {
      "rating": "2",
      "text": "A disgrace to the 1953 film that makes you wonder why it still exist up to this day and for on and on. House of Wax is nowhere near that horrifying from the original that is way better (but not scary as well) than this film."
    },
    {
      "rating": "10",
      "text": "É um filme perfeito, com ótimas atuações principalmente da Elisha Cuthbert, que dá ao filme uma forte dose de entusiasmo com o seu desempenho semelhante ao de Jamie Lee Curtis"
    },
    {
      "rating": "2",
      "text": "The main problem is that the supporting characters are unlikable, and the overall plot structure and setup are very weak."
    },
    {
      "rating": "4",
      "text": "This film is a remake of a horror film from the Fifties which, despite its age and not being so visually striking, is more interesting from the point of view of the story it tells us. Despite this, this film gives us more or less what it intends to give us and there are a series of moments in which the film, if it is not capable of frightening, at least impresses and makes some pleasant tension.The film begins as an ordinary teen film, with young people traveling to watch a sport match. They camp at night in the middle of a clearing but soon realize that there are people nearby. In the morning, a problem in one of the cars leads the group to ask for help in a nearby village, where a large wax museum visually stands out, totally made of wax, floor to roof, passing through all its interior. From here, we have a slasher film quite similar to so many others, where the characters trying to escape from a murderer who goes on killing them, one after another.One thing that stands out is the number of clichés. Starting with the characters (we have the couple who only think about sex, the good-hearted hooligan, the nice girl who saves the day, the stupid boyfriend thought to be cut to pieces by the villain etc.) to the villains, one of them being a sort of clone from Jason Vorhees. The climax is somewhat predictable, however it makes good use of the fire of the 1950s film.I think the cast did the best they could with the material they received. It is not brilliant and there are no great actors here who can provide us with inspired interpretations. On the contrary, it is a cast of strangers. Even so, I would highlight the good performance of Chad Michael Murray and Elisha Cuthbert, both very convincing and skilled in the task of giving their characters a charisma and sympathy that holds the audience's attention. Paris Hilton, famous for the worst and most uninteresting reasons, appears here as an actress, which she is not and will never be. The proof is this film, where she does nothing but sex, appear half-naked and die. In fact, most of the cast is there to be slaughtered, as usual. Brian Van Holt is the face of evil in this film and was able to truly make chills with his cynical and brutal performance.Technically, it is a regular film, where the sets stands out for its excellent quality, in particular the wax museum, as is evident, but also the church and the villain's house, rich in details. Cinematography is good, but not surprising, and the lighting was very well done and well used to amplify tension and create the necessary suspense environment to make the film work. The deaths are very graphic and this can please fans of the gore. The characterization and make-up, in particular Vincent's, was very well done and is another element taken advantage of in the film of the 1950s. Less noticeable is the soundtrack, quite bland."
    },
    {
      "rating": "10",
      "text": "Muito bom eu adoro esse filme mesmo sabendo que ele pode ser um pouco genérico mas eu recomendo e é muito legal não é um filme com um puta roteiro ou um puta história mas é legal divertido"
    },
    {
      "rating": "1",
      "text": "A boring in name only remake This Thriller is not worth watching but I’m glad that Jaume Collet-Serra has moved onto better things and I’m glad his directorial flare is still there"
    },
    {
      "rating": "10",
      "text": "●●●●●●●●●●●●●●●●○○○○○○○○○○○○○○○○○○○÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,÷.÷.÷.÷.÷.÷.÷.÷.÷.=.=.=.=.=.=.=.=.=.="
    },
    {
      "rating": "6",
      "text": "Considering Paris Hilton was in it I was actually dreading this House of Wax. Some may wonder whether it bears any resemblance to the classic Vincent Price of the same name, other than the name it doesn't at all. I'd rather call it a re-imagining(and an inferior one at that) in alternative to a remake. And actually, despite it not being perfect and also my fears House of Wax was not that bad. It has its flaws, Paris Hilton not helped by her shallow character was awful, a few of the characters are less likable and developed well as others, the screenplay is rather cheesy at times and while Chad Michael Murray is handsome and does appeal to you I am not entirely sure whether he convinced me as the bad boy of the group. However, the rest of the acting is not bad at all, Elisha Cuthbert is actually very good and Brian Van Holt is downright scary as the antagonist. The characters are in a way stereotypical but they are written in a way that makes them generally somewhat likable. House of Wax is not bad to look at either, the camera technique used I am not a fan of but actually it is used effectively and there have been far worse cases of it, but the sets and lighting are wonderfully eerie. The story is on the formulaic side, but not dull or intelligence insulting. Other than Holt, what was impressive about House of Wax was the tense atmosphere, the imaginative and very gory deaths and also the fact that I did find myself amused or frightened throughout. Considering what House of Wax could have been, that is an achievement. All in all, not that bad, not perfect by any stretch but much worse things have happened. 6/10 Bethany Cox"
    },
    {
      "rating": "3",
      "text": "Group of friends intending to attend a football game, camp out, have their car vandalised, go to an abandoned town for parts but all the people have been turned into wax models by two formerly-conjoined twins whose mother used to make wax models."
    },
    {
      "rating": "10",
      "text": "very sexy movie ngl good af. prequel pls. i love the sinclair brothers alot"
    },
    {
      "rating": "10",
      "text": "$.$.$.$,$.$,$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》"
    }
  ]
}