{"id": 1629, "title": "House of Gucci", "starring": ["Lady Gaga", "Adam Driver"], "runtime": 158, "genre": ["Drama", "Crime", "History"], "description": "When Patrizia Reggiani, an outsider from humble beginnings, marries into the Gucci family, her unbridled ambition begins to unravel the family legacy and triggers a reckless spiral of betrayal, decadence, revenge, and ultimately… murder.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/oJCQjD2byiVF1EG408F9dBn9ndU.jpg", "categories": {"plot": 7.5, "acting": 8.5, "ending": 10.0, "soundtrack": 8.0, "cinematography": 8.0, "familyFriendly": 3.0, "funny": 8.666666666666666, "action": 10.0}, "reviews": [{"rating": "9", "text": "It was a fun film, if only a bit too long. Gaga was great actually, she commands the movie and when she is gone the energy of the movie drops. If I have to rank the performances, I would rank them like this: Pacino > Gaga > Irons > Driver > Leto."}, {"rating": "10", "text": "I loved this movie so much. Gaga is amazing. She probally will be nominee on 2022's Oscars"}, {"rating": "10", "text": "I cannot describe how perfect this film is... From the amazing cast to the legendary director, and of course, the incredible story. Lady Gaga and Leto Jared are absolutely extraordinary."}, {"rating": "10", "text": "Spectacular performances, deliciously entertaining. A must watch! Lady Gaga chews every scene she’s in and Adam Driver is subdued but great. The ensemble cast is easily the best of this year."}, {"rating": "10", "text": "Absolutely amazing!! Breathtaking . Gaga is an extraordinary actress. This movie makes us feel speechless."}, {"rating": "10", "text": "Best movie I've ever seen. Lady Gaga killed it! Literally"}, {"rating": "10", "text": "Gaga’s acting is so great and movie is so good. I think Gaga will take awards for this role"}, {"rating": "0", "text": "Boring, too long, excessive, irritating, farcical film that relies more on the performances of some actors who seem to come out of a New Jersey restaurant than on a really approaching story about what was one of the most important dynasties of the fashion world."}, {"rating": "4", "text": "With almost offensive accents and some terrible story boarding, House of Gucci is a cringe worthy 2.5 hours."}, {"rating": "0", "text": "Atuação porca, mediocre e horrorosa da lady pinoquio, esta fora do oscar por não saber atuar, merecia o framboesa de ouro"}, {"rating": "4", "text": "É quase inacreditável que um filme de 2h 38m de duração escolhe o pior de seu enredo para se aprofundar, enquanto deixa de escanteio uma das histórias mais chocantes do mundo da moda.\"House of Gucci\" apenas desperdiça uma história fascinante e o talento de Al Pacino e Jeremy Irons, que devem ter saído do set de filmagens traumatizados ao atuar ao lado de Jared Leto.É difícil entender como Jodie Comer e sua atuação em \"The Last Duel\", também lançado no último ano com direção de Ridley Scott, está sendo esnobada nas premiações, enquanto vemos Lady Gaga na lista de todas elas.Espero esquecer esse filme o quanto antes."}, {"rating": "10", "text": "lady gaga literalmente comio el pappel de patrizia, es una pelicula comica y divertida la historia es muy interesante. dios salve a lady gaga"}, {"rating": "0", "text": "La actuación de la interprete de bad romance la moda del 2008.Es muy forzada y hace qué pierda la escencia de toda la película"}, {"rating": "6", "text": "Fictional biography that barely scratches the surface of the history of the Gucci family."}, {"rating": "10", "text": "The movie the trailer is selling is actually a little more dishy and wild than the real House of Gucci, which would be a pointless and somewhat perfunctory dud if it weren’t for the brilliance, or madness, of the performances. Screenwriters Becky Johnston and Roberto Bentivegna crafted the tale of the murder of Maurizio Gucci (Driver), based on the book by Sara Gay Forden, into a kind of rags-to-riches story crossed with some serious Machiavelli vibes, but the psychological reality never quite lands. Ridley Scott, who seems to have slid joyfully into his “I’m 83, why wouldn’t I make this movie” phase, settled into the director’s chair and proceeded to direct the daylights out of his cast"}, {"rating": "10", "text": "The Best movie I have ever seen. Lady Gaga is phenomenal. Her acting skills...oooomg"}, {"rating": "10", "text": "Surprisingly enjoyable movie. Didn't see A Star Is Born but wow, Lady Gaga can act. It could have shaved about 20 minutes off the third act but it doesn't ruin the movie"}, {"rating": "5", "text": "A haphazard of a film. It's all over the place, and it seems the actors decided to go all ham."}, {"rating": "4", "text": "What was supposed to be an entertaining film, turns into a film that doesn't quite know what story it is telling. The amount of eye rolls I made throughout cannot be overstated."}, {"rating": "4", "text": "Filme longo e cansativo, casa gucci não muita coisa pra se aproveitar, a não ser pelo elenco estrelado"}, {"rating": "6", "text": "Good looking movie. Great cast. HORRIBLE PEOPLE. As much as I enjoyed watching House of Gucci, and that it's based on a true crime story---I think a lot of it was really amped up for the audience. I just wanted someone to cheer for."}, {"rating": "10", "text": "Gaga's acting is incredible. Worth the price of admission. She truly embodies the role."}, {"rating": "10", "text": "It's a amazing and beautiful movie, i think that you should go  to the cinema to watch it."}, {"rating": "10", "text": "Surprisingly enjoyable movie. Didn't see A Star Is Born but wow, Lady Gaga can act. It could have shaved about 20 minutes off the third act but it doesn't ruin the movie."}, {"rating": "10", "text": "House of Gucci vacillates between inspired camp and dour drama too often to pull off a confident runway strut, but Lady Gaga's note-perfect performance has a timeless style all its own."}, {"rating": "10", "text": "La película es definitivamente de lo mejor del 2021. Un clásico instantáneo y un drama bien estructurado que narra lo necesario y esencial. La crítica simplemente. ha sido demasiado dura. Las actuaciones son excelentes en especial las de Adam Driver, Al Pacino y Lady Gaga. Un 10/10."}, {"rating": "10", "text": "The cast is perfect You’ll have a lot of fun at the theater. I look forward to seeing gaga, al pacino, adam a"}, {"rating": "10", "text": "This movie is Fantastic and is my Oscar favorite ! Lady Gaga is phenomenal when she's on screen and that makes the movie exciting. This movie is great!"}, {"rating": "6", "text": "The movie is long, gets kind of boring and repetitive. The actors' accents are poor sometimes. The movie confuses: is it a comedy or a serious telling of a dramatic story? It was alright I guess"}, {"rating": "10", "text": "house of gucci is timeless! the movie is a must-see for those who like an unpretentious and average drama. the critics demand a lot of perfection for this movie, but I saw perfection. Ridley scott may sin a few times here, but nothing like the powerful lady gaga as patrizia reggiani to make this movie beyond expectations. the cast is wonderful, it's worth watching this drama that is already a classic."}, {"rating": "10", "text": "I thought this movie is a show of Lady Gaga changing her clothes, but this movie tells a good story. Reward nominations belong to Lady Gaga."}, {"rating": "8", "text": "I saw House of Gucci and I can say that the film is supported entirely by Gaga and Al Pacino, each in his character, Jared Leto plays a good role, but sometimes he manages to look exaggerated especially in his accent.  Everyone had a debate about Gaga's accent, but Adam's is almost non-existent and bad in the whole movie, very questionable, in short, the others in the cast do it well. Ridley Scott is, perhaps, my second favorite direct, although the direction fulfills its objective, it is not the genre of film that is very good.  Bentivegna has a very good script and not at all complicated.  Dariusz Wolski your cinematography is so good, man, but Claire, your editing and editing kills how great House of Gucci could be, although I don't give you all the credit;  the story is very long, it would have been a better option to make it a miniseries of 5 chapters, 1 hour each, but hey, there is no going back. The soundtrack is not surprising, it is just a handful of songs through the 3 decades that the film spans. I do not think it is the best movie in which Gaga appears, but it is in House of Gucci her true debut, where she breaks free from the character of a singer and immerses herself in one where they have no resemblance.  I think that what I had the least faith in turned out to be the best."}, {"rating": "10", "text": "This film is everything I wanted. Brilliant actors like LADY GAGA is the highlight of the movie"}, {"rating": "10", "text": "The movie was phenomenal!! One of the best I've seen this year! All the actors gave fantastic performances."}, {"rating": "10", "text": "What Can I say, Lady G is a TALENT, she showcases this complex role of Partizia Reggiani with such ease you forget you're watching gaga, One of the best Performance by any actor I've ever seen. Highly recommend this movie, The critics have nothing but Positive response for Gaga and my god they are right."}, {"rating": "10", "text": "This movie is insane, shows the kind of drama that I like, fashion and of course Gaga she always show her best when it comes to art and this is literally art Congrats"}, {"rating": "10", "text": "House of Gucci was so good. Lady Gaga definitely Embodied the film. Her Accent is Campy & She has Screen Presence. The Choice of Music is on point. The Charisma from both Gaga and Adam that was Expected and Well Delivered. House of Gucci is an Award Worthy Movie!"}, {"rating": "0", "text": "It's a Bad movie and the actress...Lady Gaga??? Seriously??? She is a perfect singer but in a movie is so Bad"}, {"rating": "10", "text": "eu amei e n achei o 3 ato confuso como falam, rir bastante ao longo do filme e n é nada entediante de assistir."}, {"rating": "10", "text": "This is a story about a messy family that ends up in a murder, but it doesn't need to be all sad and drama. The movie has many funny moments."}, {"rating": "10", "text": "The best film of the year by a long mile.Lady Gaga will win Best Actress Oscar."}, {"rating": "10", "text": "Best movie of the year and that's why people are frantically going to theaters to see it. HOUSE OF GUCCI NOW PLAYING AT YOUR NEAREST THEATER, GO WATCH IT!"}, {"rating": "10", "text": "i have just watched this movie and it was way beyond my expectations. I had huge expectations from Rid Scott, Al Pacino, Lady Gaga and Adam. Every actor was spot on, accents were spot on, the script was great and funny at times.Lady Gaga is truly a gifted actress."}, {"rating": "10", "text": "Actuaciones increíbles ! Muy buena, el personaje de patrizia y Paolo son increíbles"}, {"rating": "10", "text": "J'ai vu le film hier et franchement j'ai été assez satisfait (surtout par la fait que je n'ai plus été au ciné depuis un long moment, ça m'avait tellement fait plaisir) et voir un film avec un cast constitué de légendes... rire à dire !"}, {"rating": "10", "text": "Gaga definitely worked hard to deliver a even greater performance than she did in A star is born. Bravo! The movie itself is very entertaining, there is nothing like watching humans pay for their greed."}, {"rating": "10", "text": "Gaga's acting is top notch. Worth the price of admission. She truly embodies the role. I think she hold the movie on her back, jared leto did a fantastic job, such a good experience. salma hayek fascinated me with her role, I've enjoyed her scenes with Gaga."}, {"rating": "10", "text": "Its a good movie, althoght its screenplay is a little complicated and it changes too fast, the inicial part is too good"}, {"rating": "10", "text": "Lady Gaga está sem seu auge de atuação, esbanja sentimentos de forma verdadeira e convincente, carrega o filme que está perdido em seu roteiro."}, {"rating": "10", "text": "Best movie I've watched this year, just amazing the connection between Lady Gaga and Adam Driver, she deserves the Oscar!!"}], "recommendations": ["the_aviator", "american_hustle", "cinderella_man", "hustlers", "no_reservations", "the_parent_trap", "changeling", "hairspray", "true_grit", "goodfellas", "walk_the_line", "crazy_heart", "the_irishman", "begin_again", "legend", "mystic_river", "we_are_your_friends", "the_boy_next_door", "lawless", "ghostbusters", "black_mass", "trouble_with_the_curve", "million_dollar_baby", "the_disaster_artist", "the_shawshank_redemption"]}