{
  "id": 3830,
  "title": "House of 1000 Corpses",
  "starring": [
    "Sid Haig",
    "Bill Moseley"
  ],
  "runtime": 89,
  "genre": [
    "Horror",
    "Crime"
  ],
  "description": "Two teenage couples traveling across the backwoods of Texas searching for urban legends of serial killers end up as prisoners of a bizarre and sadistic backwater family of serial killers.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/afISpRBO81uaLy5hrMHqyof6C1J.jpg",
  "categories": {
    "plot": 5.157894736842105,
    "acting": 5.3076923076923075,
    "ending": 3.8,
    "soundtrack": 4.5,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.5,
    "action": 5.666666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "It's scary, suspensful, funny, and features a ton of great characters that will haunt your dreams. Rob Zombie has created something special with this movie. I loved it."
    },
    {
      "rating": "2",
      "text": "I have one word to describe this movie AWFUL! It doesn't even compare to it's sequel, The Devil's Rejects. This is just a weird, drugged out, gore fest, that makes absolutely no sense. It's not even funny, It's a complete waste of time. Even Rob Zombie's sister was said to have walked out of the screening in disgust, saying, \"what the F is wrong with you!?\""
    },
    {
      "rating": "3",
      "text": "Sounds like Rob Zombie's film is past dead- which is dull-dead and dreary."
    },
    {
      "rating": "8",
      "text": "Rob Zombie's throwback to '70s era video nasties is essentially just a more deranged version of The Texas Chain Saw Massacre. Some moments like the dinner scene even feel directly lifted from Tobe Hooper's southern horror classic. Yet, while it never deviates far from how you would expect a film about a group of college students getting butchered by a family of insane rednecks to play out outside of it's urban gothic, satanic imagery laden final act, there is still value to be found here due to the Hellbilly rocker's one of a kind flair. His stylistic flourishes and twisted vision ensure that there is always something cool to look at, even if things like the random vignettes of people going on psychotic rants don't always make sense.Shockingly enough, this might not be the best choice for gorehounds. You will see grotesque sights and quite a few acts of grindhouse style violence, but most of the drive-in thrills come from the profanity and deranged behavior of the antagonists. Zombie came up with some memorable psychopaths whose antics are equal parts vulgar, amusing, and disturbing. The standout easily being the late Sid Haig as Captain Spaulding who is a good enough creation that he could of carried a standalone film all by himself.If you enjoy a good exploitation flick Zombie hit all of the right nostalgic notes here right down to the grainy visual aesthetic. It's even a better Texas Chain Saw movie than any of the actual sequels or remakes in that franchise. It's not classy, deep, or thoughtful in any way, but since when has horror ever necessarily needed to be? It's not like the genre hasn't been able to squeak by on blood, grime, and coarseness many times before. Plus, when the action is this entertaining it's hard to fault it too much. Especially when the creator clearly knew what audience he was pandering to."
    },
    {
      "rating": "7",
      "text": "Say what you will about this film, but it accomplishes its primary goal--it entertains.\r The influence of important horror movies such as \"The Texas Chainsaw Massacre\" and the low-budget B movies of the 1950s-onward is evident throughout almost the entire film, but that's part of what works for it. The style is too low-brow to look as clean and polished as a typical Hollywood-funded horror flick today, and so the inside (and exterior) of the Firefly house appears dirty and cluttered, as if several truckloads of garbage were spilled out of the floor and a gang of children were handed crayons and told to go nuts on the walls. But it immediately gives you a sense of how bizarre this family truly is (which the protagonists either don't seem to or don't care until it's too late)--which brings me to my second point, the characters.\r Like so many horror movies--big Hollywood budgets or not--the lead characters, teenagers traveling cross-country to write a novel on offbeat roadside attractions, are completely and utterly forgettable, as well as stereotypical in their group roles--moron Jerry, frustrated leader Bill (interestingly enough, these two were played by a pre-fame Chris Hardwick and Rainn Wilson), fussy Mary, and Denise, who is so \"final girl\" designed that she might as well have it tattooed on her forehead. It doesn't take long for you to guess which of the characters are the ones to bite the dust first (except for one that actually surprised me the first time I watched this movie), and it shouldn't; they're not the ones that matter, but rather the various depraved and twisted individuals making up the Firefly family. Zombie's dislike for these kids and preference for his antagonists is evident the second the opening credits begin, before the former group have even been introduced, as the names of the actors playing the main Firefly members are displayed first.\r These would be Otis B. Driftwood, played by \"Chainsaw Massacre 2\" actor Bill Moseley and easily the family's most completely psychopathic member reminiscent of Charles Manson (who is referenced early on in the film), Baby, the youngest of the family and one of its two female members played by Zombie's future wife Sheri Moon, and Mother Firefly, the the deceptively normal-seeming (relatively speaking) matriarch of the family played by Academy Award nominee and another cult-horror icon, Karen Black. Another character who is by far the most interesting one in the film and who may or may not be related to the Fireflys (no spoilers) is Captain Spaulding, the foul-mouthed owner of the Museum of Monsters and Madmen played by Sid Haig who also makes his own homemade fried chicken, who is seen early on in the film taking the law into his own hands and dispensing vigilante justice onto a couple of robbers who attempt to knock over his store (but not before humiliating them due to their supposed inexperience first). Spaulding is, in a sense, a physical representation of the movie itself--funny in some parts, scary in others, but always entertaining.\r The story is nothing special, and in fact seems contrived from the most basic of horror elements--rainstorm, hitchhiker picked up, flat tire obtained through pre-set trap, teenagers forced to take refuge with killer family to await their car being fixed/the end of the storm,  entire killer family set off by the idiotic actions of one person--but this also seems purposefully done, because the story is hardly the point of this movie; the point is the characters doing what they do, and Zombie showing off his skill as a visual stylist with constant switches between photo negatives and the picture in its original form. There are a few sup-plots that are resolved shortly after they begin, as well as a number of oddball scenes that seem stuffed into random places in order to provide something resembling comic relief and self-recorded videos of Otis and Baby intended to once again recall the Manson family, but there is so much else going on in this film that the plot is forgotten moments after it begins.\r In conclusion, not the best horror movie ever created, but certainly not the worst. The cast, intentionally or not, nail their assigned roles to a T, and fans of Zombie's unique visual style should appreciate the film as it is. The two major complaints I can think of are the story, which as I said is take-it-or-leave-it, and a severe lack of Captain Spaulding in any and all scenes he doesn't appear in. All in all, though, this is a solid, entertaining movie that serves as a strong film debut for writer-director Rob Zombie and should satisfy fans of the horror genre and its horror-comedy subcategory. Heed my warning before you run out and watch it, though...This movie is not for everyone, and certainly not for the faint of heart. 7/10"
    },
    {
      "rating": "10",
      "text": "This is a good movie for those who like the sick & twisted. Anyone who gave it a really bad vote are the type of people who dislike twisted movies and are most likely very close minded people. I give it a 10 because it's unique and a refreshing view from the mainstream slew of run of the mill movies."
    },
    {
      "rating": "8",
      "text": "This movie was quite entertaining and I saw it twice. First, the in-between scenes were great filler and bring an interesting light to the plot. Second, there was no point in this movie that I was bored or offended at the homage paid to previous horror movies. The people who complain that they can not see the plot or understand the motivation of this movie are just stupid. Any horror movie fan worth his salt will see this film and be satisfied. By no means is this a ground breaking film, but for the hardcore horror film lovers, this will be a great movie."
    },
    {
      "rating": "8",
      "text": "This movie was quite entertaining and I saw it twice. First, the in-between scenes were great filler and bring an interesting light to the plot. Second, there was no point in this movie that I was bored or offended at the homage paid to previous horror movies. The people who complain that they can not see the plot or understand the motivation of this movie are just stupid. Any horror movie fan worth his salt will see this film and be satisfied. By no means is this a ground breaking film, but for the hardcore horror film lovers, this will be a great movie."
    },
    {
      "rating": "2",
      "text": "Surprised to see only 0's and 10's for the most part this movie is much closer to a 0. This movie was not scary and I found myself very bored watching it. I kept waiting for the gore, but there were only a few scenes of active violence - most of the offensive material were slow shots of already dead, mutilated bodies. There was really nothing original about any of the murders/deaths. For example, upon opening a trunk, a dead body is found with the words \"treat or trick\" (or something close) etched into the leg of a slightly overweight girl. I can think of a 1000 ways to make that discovery more horrifying. I did like Capt. Spaulding's character and the baby character (agreeing with a former reviewer) and give this a 2 as a result. I kept waiting for some good B movie thrills, instead I got spliced footage of old 50's topless C-level \"models\" Bottomline: no scares, no good T&A, no good gore."
    },
    {
      "rating": "10",
      "text": "In the way of TCM:2 (the original). Extreme violence mixed with extreme dark humor. A great debut for senior Zombie!"
    },
    {
      "rating": "0",
      "text": "Some people say that this is a good movie in the \"horror trash\" style. I have to disagree. I'm a fan of all kind of movies including trash movies and this one its not a good one. It's surprisingly boring, it's the kind of movie that is just a waste of time."
    },
    {
      "rating": "10",
      "text": "Rob Zombie takes you on a road trip into hell and I loved it."
    },
    {
      "rating": "10",
      "text": "This film rocks, and anyone who doesn't think so, is wrong!"
    },
    {
      "rating": "0",
      "text": "I am not being extreme, I honestly believe this film deserves a zero. My friends stopped watching after half and hour, one by one they found something better to do. I watched for as long as I could, a full 30 minutes longer than the others, but eventually I did something I've never done with a rental film before... I hit fast-forward and watched the film fly past, just so I could get to the end and put this behind me. I must have stopped and watched 20 times before reaching the end, but it was the same old sh*t. I'm sure there are fans of this flick out there, someone on Rob Zombie's wavelength, and that's great. I hope you enjoyed it. You're on your own in a very small, special group of people."
    },
    {
      "rating": "1",
      "text": "I give it one because it was a nice try....the other nice try extra points went away when I started feeling like I was watching a boring extended version of the \"I feel so numb\" music video.... now seriously, after this film I got so angry that, though I am a big fan of the music from Rob Zombie, I didn't even want to hear a single song from him. though if you are really into bizarre experiences, not wanting to watch a horror nor a terror film but some surreal comedy with horror parodies go ahead, you might enjoy it. Then again I seriously doubt it. Still I think he evolved from this shitty standard with his next movies, and though everybody hates it, I think Zombie does the exact opposite with Halloween delivering a great new angle for a movie (switching -in my opinion- the genre of it from a slow paced suspense thrill to a very well done violent horror pic)."
    },
    {
      "rating": "5",
      "text": "Rob Zombie's take on 1970's B-Movies.Full of weird and wonderful characters especially Sid Haig as the almost iconic Captain Spaulding.The acting is pretty bad throughout (I assume this was to get the B-Movie feel in parts) & it gets a bit silly at the end.A mention for the great use of Slim Whitman's \"I remember you\" in quite a morose scene as well.Not as good as Robert Rodriguez's Planet Terror which is in the same genre & done a lot better."
    },
    {
      "rating": "7",
      "text": "This Movie Was Pretty Good it was Bloody Insane Strange And Chilling it has all the good element of a Decent Horror Film It is alot better then Ridculas Horror Films Like Final Destination House of The Dead and So On"
    },
    {
      "rating": "10",
      "text": "Rob Zombie gives us a cult classic horror film that we all have been craving for quite some times. I remember first seeing this film and being terrified by the Firefly family. I would highly recommend."
    },
    {
      "rating": "1",
      "text": "I went through the annoying process of registering with metacritic just to discourage you from watching this movie.\r Pros: the captain clown character, the first scene, general weirdness\rCons: bad, bad soundtrack, annoying cut scenes"
    },
    {
      "rating": "7",
      "text": "Rob Zombie's debut film has stylized graphics and bizarre sadism that you just can't look away from. Very reminiscent of the original 'The Texas Chainsaw Massacre', and has basically the same old plot. The movie stars Zombie's friends and wife (a future trend) as a psychopathic evil family that kills whoever they want for fun. A group of nitwit teens come across a side-of-the-road tourist trap, and fall prey to stupidity after trying to investigate some sketchy story told by a killer clown. Rob Zombie's film is fun and gory. A must see for any slasher film lovers."
    },
    {
      "rating": "10",
      "text": "The message here is quite simple: You either get this film or you don't.\r If you read the reviews with low scores, it becomes very apparent who is leaving them."
    },
    {
      "rating": "1",
      "text": "(going to watch again)\r ---------------------------------------------------------------------------------------------------------------------------------"
    },
    {
      "rating": "8",
      "text": "welcome to house of 1000 corpses! this is my favorite horror movie its a cross between texas chainsaw massacre and i want to say pink floyd the wall. this film is full of personality its scary and it has the most memorable killers in slasher movies i have ever seen! the firefly family is what makes it special. you see it has a story similar to texas chainsaw massacre but has the psychedelic properties of pink floyd the wall. and its hardcore in a heavy metal sort of way. this hour long movie will make you go insane as it drags you into a hellish nightmare and it would not be quite as good if it was longer but its good for what it is. i mean i clearly remember sitting on the couch with my freind watching it for the first time saying holy crap the movie i always wanted to see is here in the way i always dreamed of! its not only a rad movie in its own right but it manages to be a funny parody of other old corny movies its sort of based on. rob zombie completely new his fans when making the movie and thats good... however that means a smaller fan base this movie is not for everyone its completely twisted and most people innocently viewing this will find it dumb and generic so make sure you like this stuff before you watch. and i wanted to give it a 9 but the acting besides the killers is very bad its like they were half asleep or something making the first 25 minuets kind of dull. and how come no one can tell when this movie takes place is it the 70s the 80s or is it just modern day stuff i cant tell! and before the crazy stuff later that actually creeps you out you get some lame jump scares that are annoying they just come across lazy and sense the rest of the movie is good i dont know why he did this. and its going to make people just walk away before it gets any good. but the music the atmosphere and the innovation to horror movies that we have here is very impressive! just watch at your own risk house of 1000 corpses gets an 8 out of ten."
    },
    {
      "rating": "8",
      "text": "I like Rob Zombie music and i like some of his movies. This one i liked alot, now listen to me if you do not like extreme gory violence, alot of nasty language and satanic stuff. Then stay away from this movie its not for you. But if you do you will probably be pleased. I enjoyed the movie"
    },
    {
      "rating": "7",
      "text": "I remember watching this years ago when it first came out, and nearly 20 years later it is STILL just as delightfully disturbing! I recently revisited this movie on Netflix and I think it still holds up today. To me, House Of 1000 Corpses always seemed like a non-stop gothic and gory haunted house ride. I know this film received some bad reviews from critics when it first came out, but I think it's pretty good for a directorial debut!"
    },
    {
      "rating": "2",
      "text": "One word that sums up this movie perfectly is disorienting. The numerous \"flashback\" sequences, which invariably have random negative filters and tv static applied to them, create a cool effect and contribute to the atmosphere of the film,which is one of the few things this film does right. However, the short asides generally serve more as a source of confusion than answers.The plot of this film is convoluted, nonsensical, and lacking any sort of direction. The serial-killer family conducts a lengthy ritual towards the end of the movie, burning hundreds of crosses while the major antagonist of the film wears corpsepaint and chants. While a cool scene that builds up plenty of tension, it is symptomatic of the major problems I have with the movie as a whole. Events in this movie are tangential and sparsely related, barely maintaining any semblance of a cohesive narrative.Rob Zombie was clearly trying to do something different with his psychotic family of hillbilly murderers, and the underground corpse dungeon that serves as the location of the climax shows off some impressive special effects, but its all so disjointed and hard to follow that the few good points of the film were lost in the chaos. Technically impressive, but lacking focus, cohesion and any semblance of character motivation."
    },
    {
      "rating": "0",
      "text": "Fick you Rob Zombie. The only character to be tortured and murdered should have been you, but before even thinking about making this movie. A process that clearly didn't take long according to the total lack of any plot whatsoever. Or maybe the goal of the film was to push the audience to commit violence against the director. Possible. As an example of how truly awful this movie is it took me a whole 1 hour and 30 minutes of self loathing before I decided to turn this crap off and skip the very predictable sick **** ending. Anyway you suck"
    }
  ]
}