{
  "id": 4568,
  "title": "House at the End of the Street",
  "starring": [
    "Jennifer Lawrence",
    "Elisabeth Shue"
  ],
  "runtime": 101,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A mother and daughter move to a new town and find themselves living next door to a house where a young girl murdered her parents. When the daughter befriends the surviving son, she learns the story is far from over.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bgHeZ5g7YyxKcwWw1tgyAMy0czy.jpg",
  "categories": {
    "plot": 5.121212121212121,
    "acting": 4.4411764705882355,
    "ending": 5.769230769230769,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.857142857142857,
    "funny": 6.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "I very surprised at how good this movie was since it mainly got negative reviews from critics. I didn't find one thing wrong with this movie. It was suspenseful, unpredictable, entertaining, and wildly original."
    },
    {
      "rating": "7",
      "text": "i don't think that this film should have so many bad reviews. It is interesting and it has a great plot. Jennifer Lawrence and Max Theriot are not something spectacular but the result of the film is. It is an enjoyable horror film with a final scene that will chill you. It has action and suspense and it is a great entertainment for an evening. Maybe one of the best horror movies of this year (which didn't have any good). However, The house at the end of the street will entertain you."
    },
    {
      "rating": "7",
      "text": "I know that the story isn't that good, but I liked it. It's good, and that's all. It doesn't will afraid you forever or something like that. It's just like a hobby and that's exactly why I liked it. I'm done with that bloody-massacre-horror movies."
    },
    {
      "rating": "8",
      "text": "Marcada por reviravoltas inesperadas dos personagens e elementos de suspense que são muito bem utilizados em cada cena proposta, o filme em nenhum momento deixa a desejar, as atuações de Jennifer Lawrence & Max Thieriot são extremamente convincentes (ao ponto de você, brevemente, esquecer que é tudo fictício)"
    },
    {
      "rating": "4",
      "text": "Dumb plot, dumb scares and unsure of what it wants to be. I still love you Jennifer, good on you for not promoting this piece of crap. http://www.facebook.com/ElvisPresleySonElvisAaronPresleyJr"
    },
    {
      "rating": "4",
      "text": "There are really no scares in this movie.\rNot at any second. Jennifer Lawrence did her job great but because of its terrible story the movie is damn bad!"
    },
    {
      "rating": "7",
      "text": "The House at the End of the Street, the new Jennifer Lawrence's movie, and I wanna say that I like it, the movie is very intereseting, but the development have some mistakes, the performances are good -the better is Lawrence- and the funny can be interesting for much people."
    },
    {
      "rating": "10",
      "text": "The house at the end of the street is the most emotional, powerful, moving cinematic piece. This film needs a nomination for Best Picture and may I go to say Best Film Of The Decade, my grandma even said that it deserves a Best Picture Ever sticker, I mean its that good. Go and see it NOW.....please"
    },
    {
      "rating": "3",
      "text": "This is one of those cheapie horror flicks that was so **** it sat on the shelf for about two years before it was released."
    },
    {
      "rating": "2",
      "text": "I'm sorry but this movie can be summed up in 2 words: predictable crap. This movie sucks, its not scary thats for sure but i was expecting all of this going into it. If a \"horror\" movie is rated pg-13 then that means 2 thing, you're going to have the worst crowd in your theater with a bunch of little annoying teenagers, and it means the movie will 99% of the time suck, and it did. There was literally nothing good with this movie. It was all predictable and annoying. I dont know what else to say other than don't waste your time with this crap. Its not worth your valuable brain cells. Ill give it a 2/10 out of sympathy.."
    },
    {
      "rating": "10",
      "text": "Why on earth everyone is saying this movie sucks? The movie starts the Hunger Games' amazing Jennifer Lawrence, the movie really surprised me by being a very good movie, I really truly deeply enjoyed it, it is more Romance-Thriller than being Thriller-Horror, very good, well done! Although there is some problems about it, but still great!"
    },
    {
      "rating": "2",
      "text": "House at the End of the Street was not what I thought it was going to be.  I really thought it was going to be a horror.  Thank God for the actress Jennifer Lawerence because she made the movie better than it was if someone else would have played her character.  I would not recommend any of my friends to waste their money to see this movie."
    },
    {
      "rating": "6",
      "text": "It was an ok film, decent story which keeps you in a little bit of suspense till near the end.\rits worth watching if your into this kind of film but don't expect too much"
    },
    {
      "rating": "4",
      "text": "I'm not sure why this is considered a horror movie, I'm someone who's extremely easily scared and I wasn't at all. All the attempts at horror are just jump scares that you can see coming from miles away. It's boring and the acting is poor. It seems like it started out as a drama, as it has a lot of the elements of one, but then the developers saw how boring and bland it all was, and the poor acting performances, and just said \"Hey let's make it a horror\". House at the End of the Street falls flat, it isn't scary, entertaining, or worth your time."
    },
    {
      "rating": "0",
      "text": "I was expecting a bad movie but JESUS!!! This was AWFUL!! The enitre time I spent watching this dreck I prayed to God for him to KILLL ME!! AND I'M AN ATHEIST!! Hideous writing, hideous acting, hideous lighing, hideous, hideous, hideous!! Worst film of the CENTUARY!!"
    },
    {
      "rating": "3",
      "text": "\"House at the End of the Street\" 10 Scale Rating: 3.0 (Awful) ...\r The Good: The two young leads (Jennifer Lawrence and Max Theriot) try their best to make this work and I have no complaints about either of them. The first twenty minutes are solid and set up the movie well ...\r The Bad: ... but then it falls flat. This is quite possibly the most boring \"thriller\" that I have ever seen. Next to nothing happens for the bulk of it and by the time something finally does, you no longer care. The pay off is a let down and what is really happening isn't all that imaginative or plausible."
    },
    {
      "rating": "1",
      "text": "It sounded good, but I was lured into a very intelligent trap. The movie was horrid. You'd never think an Oscar winner (Jennifer Lawrence) could be so bad in a movie."
    },
    {
      "rating": "3",
      "text": "\"tyler stop,, this scene sucks\".....what did he just inject not into her vein?....i hope it wasn't this movie or she wont feel it it for a while.......Lol!!  he brakes that guys leg feels wicked good to see but i hope that later he does more of that kinda stuff....men who fight men deserve the leg treatment....women are the overpopulaters"
    },
    {
      "rating": "5",
      "text": "What the critics don't tell you is that this movie makes you think. Its characters are all well developed and the performances are good. A pretty darn underrated movie."
    },
    {
      "rating": "5",
      "text": "As far as thriller/horror films go, House at the End of the Street wasn't all that bad. Jennifer Lawrence is amazing as usual. Her stunning and unique look combined with her incredible range as an actress means she provides a solid lead, regardless of the plot. Speaking of which, this one actually had a halfway decent premise with some real potential. I think the movie ultimately fell apart for the lazy writing that led to a poor execution of the plot and the mediocre supporting cast. Elisabeth Shue leads a lot to be desired as the worrisome mother and Max Thieriot just doesn't deliver. A major part of the lazy writing I referenced earlier is the cliched \"person gets themselves into trouble by being stupid\" element that plagues so many of these movies. Lawrence's character might be among the nosiest I've ever seen in a movie. I leave it at that but I will say, it's tough for a movie to be suspenseful when you spend more time aggravated at the characters than you do worried for their safety."
    },
    {
      "rating": "5",
      "text": "House at The End of The Street is another ambitious, low budget, Horror film, that tries to make a name for itself by using star power, but how much was I really expecting from a PG-13 Horror film? The story begins when Elissa and her mother move to a new house in the country, a house that is across the street from the scene of a grizzly double murder four years earlier. The house and story is surrounded by rumors and still occupied by the son of the victims, who Elissa quickly befriends. Once again we have a common theme that has been done to death, but the producers of this film were hoping that by spending big bucks on Jennifer Lawrence (Hunger Games) and Max Thieriot (Bates Motel) that they could get people to watch their film and it worked, but I suspect most people were sadly disappointing like I was. The acting was terrific and everything you would expect from these actors, but the story was so simple and predictable that it really wasn't worth watching. Being a PG-13 film didn't help either as there wasn't really anything too horrific or creepy to really catch your attention. If that wasn't bad enough, the first hour of the film was so slow, that I almost turned it off. The only thing that kind of gave me a laugh was that there was a lot of scenes with Jennifer Lawrence in the woods and I couldn't help but think that Katniss wished she had her bow. House at The End of The Street is a film that has the star power, but not much else, as it's a slow, tame, predictable film, that's been done and it leaves far too many unanswered questions. If you're a die hard Jennifer Lawrence fan, check it out, otherwise, I wouldn't waste my time on this one."
    },
    {
      "rating": "1",
      "text": "The performances from Jennifer Lawrence and Elisabeth Shue are fine, but HATES has nothing to offer with its unlikable characters and uninteresting setup. It's not scary or interesting and it's not original. This is a movie for people who have never watched a horror movie in their entire life. I wonder how many people who gave this movie a good review are horror movie fans. Somehow I doubt it. That's not to say that you're an idiot for liking it, but there are other movies that have done this kind of story before and they've done it better.\r As for the \"twist ending,\" the opening scene kind of gave it away. I'm not a horror movie junkie, but even I kind of knew something was up. Also, if you think that twist is \"omg so original,\" there's a 1980s slasher movie called Sleepaway Camp. Exact same twist done much better.\r And if you still want to see this because Jennifer Lawrence is in it, I think you should come up with a better reason than that. There are other better Jennifer Lawrence movies to see like Winter's Bone, Silver Lining Playbook (haven't seen it but I hear it's good), and, oh yeah, The Hunger Games. If you like Jennifer Lawrence, watch those movies."
    },
    {
      "rating": "4",
      "text": "Jennifer Lawrence puts up a decent performance but it can't save the film from what it is; boring, predictable, and terribly scripted.  Hopefully this film won't tarnish the career of one of hollywood's most promising actresses."
    },
    {
      "rating": "6",
      "text": "Jennifer Lawrence has this incredible pull that attracts us to the screen almost instantly, regardless of what mess is brewing. No, this film is not perfection--but we're thrilled nonetheless."
    },
    {
      "rating": "2",
      "text": "This isn't a good horror film, matter of fact it isn't a good film period. The conversations were meaningless, characters seem irrelevant and everything seemed extremely awkward. The first 1 hour is mind numbing and then the last 30 minutes tries to jam everything together that in the end the movie is nearly a failure."
    },
    {
      "rating": "5",
      "text": "For all its problems, the movie isn't half bad in the end. Although it had a bizarre twist, it was a twist nonetheless and that kept my attention. This certainly isn't  going to be the highlight of Jennifer's career, but the movie was interesting."
    },
    {
      "rating": "6",
      "text": "Elissa becomes enamored with the neighbor next door despite his family's bloody history, but Ryan has several secrets of his own that he plans to keep hidden in the HOUSE AT THE END OF THE STREET. Mark Tonderai's new thriller loses itself in tired old cliches that have long since lost their appeal. The film is terribly miscast, forcing Elisabeth Shue and Jennifer Lawrence into an awkward mother/daughter relationship that feels very unnatural on screen. Max Thieriot's mousy performance is rather unconvincing as well, and lacks the impact needed in order to leave a lasting impression. The supposed twists offer few surprises, especially for audiences that have already seen the same story played out in a hundred different ways. This drains the film of any suspense, while the lapses in logic and poor decision making by the characters are sure to infuriate viewers. It would be better to just lock HOUSE AT THE END OF THE STREET away in the cellar with the countless other PSYCHO-spawns than to have anyone else suffer through another uninspired copy."
    },
    {
      "rating": "6",
      "text": "A half-decent thriller/teenage horror movie. The story is okay, the acting is okay, not many \"screamers\" - thanks for that. Won't watch it if not Jennifer Lawrence."
    },
    {
      "rating": "5",
      "text": "The film is hard to see ... Wing time is predictable but unpredictable. The film is to see it once and forget about it."
    },
    {
      "rating": "1",
      "text": "Dont waste your money! Not a horror, and Jennifer Lawerence does not look good as a blonde. Overall, it was a very boring movie; had troubles tying to keep my eyes open through it."
    },
    {
      "rating": "4",
      "text": "House at the End of the Street is a classic thriller movie. It is indeed not in the correct genre of its placing in horror. The movie is about a young teenage girl that just moved to a new place with her mother next to a  teenage boy that survived his sister"
    },
    {
      "rating": "4",
      "text": "Considering the movie stars the talented actress Jennifer Lawrence, I was definitely expecting better of this movie. It starts off generally promising, even if a bit generic, giving us time to get to know our main characters. Lawrence's character seemed to be level-headed and able to look out for herself. This character trait seems to diminish in the second half of the film, with her character instead being written as a typical horror chick, making pratfalls and idiotic decisions. The movie overall has a rushed feel to it, which can't be saved by it's adequate cast or relatively good set-pieces. It all just feels like it's trying to distract the audience from the awful writing. In places it feels like this movie is an experiment rather than a box office entry, which makes it even more obvious this film was made by a (relative) newcomer. In conclusion, I don't think the cast had the opportunity to put all of their effort into the roles due to the poorly written script, and although the visuals are good, the plot overall is extremely run-of-the-mill and unoriginal. It had the potential to be good, a piteous disappointment."
    },
    {
      "rating": "3",
      "text": "It has it's moments, but all in all a very disappointing film. As soon as I left the Cinema I felt as though I had wasted my money. Jennifer Lawrence definitely made this film watchable, but she was probably the only entertaining thing about the film."
    },
    {
      "rating": "4",
      "text": "The only quality in this movie is the acting, but House at the End of the Street has nothing to do with horror, it is more of a Romantic Thriller, as a movie, it isn't bad it is mediocre, is HATES unwatchable? No, but you better spent your time on something else, good idea."
    },
    {
      "rating": "5",
      "text": "Obviously this film has been on the shelf looking for an audience for a couple of months, maybe years, from its release date, because Jennifer would never take work like this post-Silver Linings.\r The movie is clichéd, poorly acted, and predictable. Also, it's silly, nonsensical and dry. But, I give it 5 stars for Ms. Lawrence's solid performance, making all the other actors look like amateurs."
    },
    {
      "rating": "4",
      "text": "It's a good movie with a nice background talking about production, and I consider Jennifer Lawrence's performance is great. However, it is \"supposed\" to be a horror movie and the film is principally focused on a teenager's relationship instead of scary and suspense aspects, fact that lowers movie's rating notably and creates a film unsure about its general genre."
    },
    {
      "rating": "10",
      "text": "Esta es película sin dudas merece mejores valoraciones, si yo fuera un crítico le daría 100 puntos, la actuación de Jennifer Lawrence es excelente, y esto no es una película de terror, es una película de horror, así que no se confundan, esas dos palabras tienen un significado diferente."
    },
    {
      "rating": "9",
      "text": "This movie is sooooooooo nice!!! i mean... its one of those deligfhtful movies for a bored night at home. Great plot and really nice surprises. I love it!!"
    },
    {
      "rating": "8",
      "text": "\"House at the End of the Street\" is highly underrated in my opinion, and is far better than people give it credit for. When I started watching it it was, admittedly, somewhat slow-going. Jennifer Lawrence, notorious for the \"Hunger Games\", seemed initially out of place in what was starting to look like a dull teen horror flick. But the movie had an amazing twist (and I'm someone who absolutely adores films that toy with your mind). Many people have noted this film as \"predictable\" and said that they \"saw it coming\". I disagree. The twist was definitely unexpected, and  I spent the entire final twenty minutes or so in astonishment.\rThe film only suffers in the story. It was good, don't get me wrong, but lacked something ... I'm not sure what. If you're a fan of Robert De Niro masterpiece \"Hide and Seek\", you'll love this. Just give it time."
    },
    {
      "rating": "10",
      "text": "This is not a horror movie, but a sensational psychological thriller. I watched this movie not knowing anything about it, and holy cow am I glad that I did. I can't believe this movie is rated so poorly in comparison to a film like 'It Follows' which I watched a few nights ago and thought was terribly wretched (It Follows was rated somewhere around 95% on this very site).\r I am now overwhelmingly convinced that these movie websites' only real function is to act simply as a list of movies for people who don't know where to actually look, if they want to be pointed in the direction of an enjoyable film.\r The House at the End of the Street was simply awesome. I'm not going to say much more than that, but if you haven't seen any previews or know anything about the story in this film; do yourself a favour and watch this immediately. The characters have depth, the acting is on point and the writers and producers of this movie deserve a huge pat on the back."
    },
    {
      "rating": "5",
      "text": "After a, apparently, tough divorce mother and daughter move to another city for restart and forget problems that were present in their regular lives before. The movie into a neighborhood that have one macabre event, a girl killed her parents with a hammer and have never being seen again until that very momment, a boy that, as they said, wich is the brother of the girl, he lived away in another city with his aunt, go back to that city and start living in the same house as the parents got killed, wich make a lot of people in the town despise and avoid him. Directed by Mark Tonderai. Written by David Loucka and Jonathan Mostow.The biggest problem with the story of this movie and the movie overall, is that it seems that it doesn't always know what it wants to be, it feels like the movie was meant to be an horror in his cern, but some times it just become a romance scholar movie, it does let you forget what you were watching before, sometimes it is a family relation thing, it simply keeps changing the style of the movie, for me this was a big flaw, it isn't a problem when the movie try to apply different subjects to have more themes approached, the problem is when it change completely the ambience and style of the movie to the point that it seems that it is another movie. Removing this points, the story is actually pretty interesting, i got engaged in what was happening and even curious about somethings that we had going on in that little town, it does have some plot twists, some you can see it coming, some you don't, it does offered you a bunch of points of view of the same story, and only by the end you got to know the true one, with a twist that i really didn't saw it coming. The movie have some events that felt so unrealistic in a way that bothered me for real, like, if there is someone that have been through a trauma, i don't see why almost everybody of a town would despise this person in such a extreme way, for me it was just ridiculous and completely out of the old and good verisimilitude. It also had some other situations that didn't felt right, like someone reaching a place running almost at the same time of someone in a car. When the movie jumps into a true horror, together with the revelations and stuff, it does got considerable better, i can't say that it didn't knew how to create an ambience of horror, it did and worked for me, i could get tense in some moments and it was pretty good, nothing original or innovative, but definely good. In some moments the charactres make a few choices that i considered really dumb or a bit to much, that also got me a little off the movie. The movie contains a bunch of jumpscares, and i gotta say that the first one may works, but all after that one, don't really. Some times the movie got to repetitive, and could be boring.In this movie we have Jennifer Lawrence, she did a good job, could pass some emotions pretty well mainly when it was about romatic moments, i could believe that she liked the boy, in surprise and horror moments i think she was just ok, she could have work a little better in her expressions. Max Thieriot was good, i think he had a a good performance here, he first convinced me a bit of something and then again of the other thing, wich i can't talk much about it because it is a full spoiler, i think it was good to make he didn't change much in voice or behavior, because that is pretty much how that is. Elisabeth Shue was good, she could make me believe that she was really concnerned in every moments, even that her characters pissed me off some times, she did a good job.The camera moviment in horror movies normally it is very important, it makes you not knowing what is happening around the place, or even makes you know something that not even the character does, and it helps in give you axiety during the scene, in this movie it does contain this aspect, but just a little bit, the cameras work here, they aren't excpetional, but definely functional. The cinematography overall, for me worked, even that the movie didn't explored it very much, the thing that having  a forest that you can't see much beyond it, it is already a bit scared, having a camera in there watching the character also worked, sometimes it uses some positioning that for me were very sucessfull into the goal. There is one specific moment in a party, that the camera do a very strange and no sense thing, that comes back to that thing that i said about the movie not knowing what it wants to be."
    },
    {
      "rating": "8",
      "text": "House at the End of the Street Movie Review: 7.5/10I really liked this movie. Didn't expect the ending to be that unexpected and deep. It goes beyond the bad, killer, crazy guy. The suspense it's managed very well and although the story can seem a little bit cliché at the beginning it gets very creative. Great horror movie!"
    },
    {
      "rating": "4",
      "text": "Guy's mentally-disturbed sister didn't really kill their parents, as we're led to believe, because he did it, she died and now he's kidnapping other girls to be his \"sister\" in his basement."
    },
    {
      "rating": "2",
      "text": "Jennifer Lawrence was of course, as she prefers herself to be, a gorgeous young woman in this movie, the problems being her acting along with the others and the fact they made this more a predictable suspense thriller instead of a horror. They substituted jump scares for psychological complexity and although I prefer this anyway, the audience were bound to criticise. The audience usually inculcate which is what happened where they believe the person is innocent, either that be Jennifer’s spoilt character or Max, then their left dissatisfied. That’s not really a twist, like I mentioned it was obvious which only reduces the ratings. There are moments of things being sturdy enough and watchable but they failed to deliver. In terms of the performances, it’s the same as every film, a bunch of hormonally driven spoilt teens. The constant licking lips and gulping air pouting for the leads didn’t wash with me as all they were doing was drawing attention to themselves ready for a kiss. Think about what I just said and rewatch it I mean it’s very poor acting and a poor performance from the cast. Flat, generic and not at all going to score highly it failed miserably as the makers concentrated too much on the wrong stuff which detached its audience. A laughable moment the woman locked away actually wakes up with her hair and make up done. I mean come on. Jennifer is too busy trying to achieve maximum attention on screen with strange make up she demonstrates her bad habits on the camera. All in all a very poor movie."
    }
  ],
  "recommendations": [
    "shut_in",
    "disturbia",
    "marrowbone",
    "dead_silence",
    "would_you_rather",
    "old",
    "awake",
    "dark_skies",
    "hereditary",
    "chernobyl_diaries",
    "the_happening",
    "the_bye_bye_man",
    "devil",
    "the_loft",
    "the_eye",
    "insidious_chapter_2",
    "you_should_have_left",
    "mama",
    "better_watch_out",
    "a_perfect_getaway",
    "next",
    "countdown",
    "the_possession",
    "brightburn",
    "slender_man"
  ]
}