{"id": 3588, "title": "How It Ends", "starring": ["Theo James", "Forest Whitaker"], "runtime": 113, "genre": ["Science Fiction", "Thriller", "Mystery", "Action", "Adventure"], "description": "A desperate father tries to return home to his pregnant wife after a mysterious apocalyptic event turns everything to chaos.", "releaseYear": "2018", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/prdFM08mGvVDA6uQxKJh8n8Vek1.jpg", "categories": {"plot": 3.88, "acting": 2.8823529411764706, "ending": 5.3125, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.2, "funny": 1.0, "action": 2.75}, "reviews": [{"rating": "2", "text": "Decent premise, reasonably capable actors - what could possibly go wrong? Well, let's start with preposterous out-of-character plot-twists suggested by characters to keep the thin plot from collapsing after 30 minutes. I like a good dystopian flick, but this one relies on lazy tropes to get to the finish line."}, {"rating": "8", "text": "Not bad at all, the pacing maynot be for everyone but overall it was a decent disaster movie focused more on people than CGI. Refreshing to have a film not end on a high not all is saved or a low note all is lost. Characters are flawed but so are real people, so all's well that ends well."}, {"rating": "2", "text": "While not the worst NETFLIX has to offer, it's definitely not their best.  This just falls under the so bad it's good category, but barely (hence the 2 rating).  While my wife and I were entertained during certain scenes it was typically for things that weren't supposed to be entertaining.  The acting was atrocious, with Forrest Whitaker looking as though someone off screen is poking him with a stick trying to force him to act.  The dialog along with its complete lack of logic being laughably bad coupled with a lack of comprehension of basic physics.  Unfortunately we were more bored than entertained by the flaws of this disaster of a movie and really can't recommend it to anyone."}, {"rating": "1", "text": "I ve seen my share of movies. This one was the worst i ve seen in years. This is 2020, how the hell did someone makes money releasing this ****"}, {"rating": "1", "text": "This film is honestly in the running for the worst I've ever seen. It's filled with random apocalyptic events that are never explained and the protagonists doing stupid things. The ending is nearly devoid of any sense of closure at all. Do not waste 113 min of your life viewing this nonsense."}, {"rating": "2", "text": "Taking the anticlimax to new heights, How It Ends tells you everything except how it ends. Do yourself a favour and watch any other movie..."}, {"rating": "2", "text": "Not a fake review: Netflix must think very little of it's audience if it keeps producing these glossy films posing as blockbusters. The dialogue and plot are thin on the ground to start with and the movie is, for the most part a road movie with zero fun along the way. If only the 'skip' feature on the Netlfix app was faster, I would've skipped through the last two thirds of the film. Unfortunately it is not. Sad for the actors mostly (Whom I normally enjoy watching), but they aren't given much of anything to deliver, apart from all the cursing which I'm sure the directory insisted they use to somehow make it feel more dramatic, but only cheapened an already worthless movie. My Advice = don't bother and instead enjoy a re-viewing of \"The Edge of Tomorrow\" ;) - 2/10 Points for animation and effects"}, {"rating": "1", "text": "This movie is bad.  If you like bad movies that aren't any good, this is the one you want.  The treatment of female characters is a crash course on how to make a sexist movie thirty years ago.  Apparently, the best course of action in the event of an apocalypse event is to become a backwards refugee and migrate toward the nuclear explosions (or whatever the hell the movie was about, you still don't know at the end)."}, {"rating": "1", "text": "A better title would be WHEN Does it End.  A boring, cliche-ridden mess that tries to convince you that within 2 days of a grid failure, Americans turn into monsters who kill for gas and have no sense of humanity left. Boring doesn't begin to describe this film...ponderous, slow, badly acted and totally unbelievable. There is not one redeeming thing about this movie."}, {"rating": "1", "text": "Not good enough for Hollywood, but good enough for Netflix.Film doesn't make sense and doesn't explain much, 2 hours of my life that i'll never get back."}, {"rating": "1", "text": "When you watch a apocalyptic thriller called \"How It Ends\" and when the movie actually ends, you laugh hysterically and say \"That's how it ends!?!\" Don't waste a moment of your precious life on this thing."}, {"rating": "2", "text": "What a disaster of a movie, Jesus Christ, what a bunch of money out the window producing this. Just a dumb pretext to show U.S. civilians waving and shooting guns at eachother like it's \"normal\" to be a civilian and have a gun, like it makes you more of a man. Throw in a mediocre script that seems made for a run of the mill story-driven console game, sprinkle in some earthquakes and dust/ash clouds signalling a disaster that is never explained, and done: you've got yourself a 90-minute time-waster.Best-case, they could've condensed what little worthwhile story points there are in this into like 20-30 minutes and made a \"people talking in a room\" type movie that might've been decent."}, {"rating": "3", "text": "Cliched paranoid male power fantasies wrapped around tropes, that comes to an abrupt end when the director ran out of money.  In a setting crying out for inquisitiveness, they play it safe by not trying to expain anything to avoid being shown as mystery box peddlers.  Standard Netflix fare just crossed from mediocreland to the wasteland."}, {"rating": "7", "text": "How it ends has a great aesthetic to it and you might well enjoy it if you don't go into it expecting a hollywood style disaster movie. It's a long movie with a slow pace, for me it was just the break I needed from the noisy mess most disaster movies turn out to be.The moments between the protagonist and his would be father in law are well acted and there is a sense of tangibility to the events that unfold throughout the movie. As a viewer you have no idea what is going on, the characters themselves are just as ill informed. Many reviewers seem to see this as a negative however it's refreshing to have a movie where the main character isn't a Scientist/Adviser who is suddenly called up and handed all the facts. It's a story about normal people in extraordinary circumstances trying to reach their loved ones."}, {"rating": "4", "text": "Definitely a \"dumped on Netflix\" movie. The premise is simple and the plot is predicable. The lack of resolution and details sinks this film into the low scores its getting. Read reviews before watching Netflix Original (dumped) movies."}, {"rating": "4", "text": "I was hooked watching this movie. It was getting irritating as the journey continued though. I like the characters, there was decent acting, but something was missing. The missing something was called and ending. They drive away with a flaming explosion behind them that they seem to outrun. Closing credits. Huh? It was like watching a cook make your favorite meal. The cook lets you take a bite here and there making you excited for the meal to be ready. They put the meal in front of you and your mouth waters. You try to take a bite, you get punched in the face and someone steals your food and throws it out. Basically...it ended abruptly. I shook my head, tossed the remote on the sofa, and turned off the TV. I was left with...WHY? and What happened next?! Sigh."}, {"rating": "0", "text": "So far this is the worse movie I have seen of 2018.  Nothing really happens in the movie and a character dies from a wound they received from a crash that looked like a car hitting a shopping cart.  No body in this movie wears seat belts at all.  I'm not sure if this movie is just a pro-seatbelt ad, but that would make more sense than telling you its a movie.  None of the performances are good and the writing is terrible.  The most annoying character just walks off in the night and out of the movie because they are upset.  It was a very lazy way of getting rid of a character that didn't need to be in the movie.  Seriously don't watch this movie.  Learn from my mistake and save yourself time."}, {"rating": "9", "text": "This was a refreshing disaster movie, which got that the essence of disaster movies is NOT about which type of disaster is actually happening (izzit aliens, zombies, da govunmunt or what) but how the people react to the tragedy. It doesn't explain the disaster at all, which therefor remains a mystery. In that, it is like The Road. This is perhaps therefor not a movie for the average empty headed viewers around the multiplex, who like their stories tied up with a neat little bow. But more for intelligent people who aren't threatened by the insecurity the movie's open end leaves you with. Yes, there's no explanation. Deal with it.The acting in the movie is superb from Forest Withaker, decent from Thomas, and very interesting from Grace Dove as Ricky. The whole father-in-law vs son in law conflict was a bit exaggerated and stale, but that's a minor thing. 9 from 10.The Melancholic Alcoholic."}, {"rating": "3", "text": "Thickening the ever growing Netflix catalog with more poor quality; How It Ends is a sci-fi thriller, confusing, convoluted and bad.The argument is mediocre as well as the performances.Too frustrating, not advisable."}, {"rating": "2", "text": "Well, I rarely dislike movies without proper explanation or put my personal tastes aside in order to give a more objective view. But man, I feel somewhat scammed for my time.First, the movie starts pretty good, albeit a bit too American-stereotypical. Then \"something\" happens and the regular apocalypse setup starts. But after a few minutes, it gets super dull - and that is being repeated several times from then...I sum up the whole middle part: Driving, driving, driving. For some reason the protagonist stop their car for every random person on the side of the now deserted road. Protagonist then get ambushed by said Hillbillies, thy fight for gasoline. Rinse and repeat. I kid you not. Me and my family could nothing but sigh about the fourth time they stop and getting held at gunpoint just for that stupidity of the driver.Then, in the end, all out of all the peope of Seattle, the main protagonists pregnant girlfriend survived, while all the people seem to be dead. Of such a metropolis??And suddenly, the movie endsSounds a bit short? It is. I feel cheated for my and my families' time..."}, {"rating": "0", "text": "Badly acted, nothing I say explained, is it a  terrorist attack, is it aliens, is it something to do with the earth. Nothing explained. It's like it's missing an hour of movie. Extremely disappointed..."}, {"rating": "0", "text": "It had plot holes you could see from space knitted losely into a fabric using only clichè. It was a fractal of fail.  It's like they got a focus group to mention every film they might have liked, then stole badly from every one of them. I half suspect it's a new paradigm in film making, because I can't imagine how anyone could make a film that bad by accident."}, {"rating": "10", "text": "I love the movie. It think it was great. I can't wait for it to come out DV or Bluray. I want to own on Bluray.  I enjoyed the movie. It was a diaster movie about a man trying to find his wife and trying to save her.  I enjoyed the movie.  Thank You."}, {"rating": "8", "text": "This was a disaster movie that, unlike almost all other movies in this genre, actually managed to pull of a convincing narrative about love and family amidst an apocalypse. The fact that it does not actually tell the story of the apocalypse might put off some disaster-movie fans, but for me it created a far more compelling and immersive experience.An enjoyable and intelligent movie."}, {"rating": "3", "text": "Netflix movie, e.g. Made for American patsies. Script. Cinematography. Acting. All rehashed from better original fare. .Nough said."}, {"rating": "0", "text": "J'espère que ce n'est pas l'avenir du cinéma. ce film est une intrigue sans aucune moindre réponse."}, {"rating": "10", "text": "Easily the best Netflix original film I have seen. Cinematography is fantastic and Forest Whitaker was phenomenal."}, {"rating": "4", "text": "Well it certainly lives up to its name. The whole movie is mostly one long action sequence and it just abruptly ends without really explaining much at all. I get that sometimes you don't need a detailed explanation of the disaster to make an interesting movie, but when the only real point of interest in your movie is that disaster, it leaves the whole thing feeling very hollow. I recommend watching Extinction instead. That is a muuuuch better movie that follows roughly the same pattern."}, {"rating": "6", "text": "The cast does a great job especially Forest Whitaker and the direction is surprisingly solid but its the stories lack of resolution and even depth drags down the movie. Nevertheless, if you're trying to kill time, it's not a bad watch but its just not anything to write home about."}, {"rating": "1", "text": "Hoplophobic regurgitated sadness! The boyfriend is angry the GFs father has a weapon to protect himself in an apocalyptic situation. Laughable that people are afraid of tools. Unwatchable, because it is the same story with different people."}, {"rating": "0", "text": "This movie is too lousy. Boring from start to end. Waste of time. Can't identify what genre. If movie have lullaby, this will surely be it! LOL"}, {"rating": "4", "text": "Basically just another disaster flick full of the usual cliches that you've seen in dozens of other disaster flicks -- and we are never really told what caused the disaster, though the auroras are likely a clue.Forest Whitaker is good.  The action is lame.  The story might've been something if it had gone anywhere."}, {"rating": "5", "text": "This movie blends in well with other Netflix movies which are all themed more alternative in termes of narrative, plot and style. It almost seems that Netflix doesn‘t even try to produce an average from the shelves cinema movie. Instead this one keeps spinning the story around itself following two guys on a roadtrip like car ride, leading the apocalypse like scenario after questions not being answered and an open, confusing end - not really being an end - bringing up even more questions and - at the same time with nice, kind of premium looking cinematics. I agree that after watching this movie you feel kind of left alone with the ending and not being satisfied, but I wouldn‘t call it a bad movie. Coming closer to the end of the movie, some scenes can‘t be distinguished wether they have a deeper meaning or just filling up space."}, {"rating": "5", "text": "How it Ends is best described as a disaster among disaster movies. In typical Netflix fashion this is another failed attempt at making a good Sci-Fi movie.From the start interaction between characters feels very awkward. Though the two lead characters were written that way, it is still an overall problem between all the characters. Will, the bloke that took daddy's little girl, is a **** that looks stressed out all the time. Tom, the military daddy, is a very dominant direct guy that clearly is struggling with the fact that Will is such a big **** And that's their entire relationship in a nutshell.When a videocall suddenly ends with the girlfriend not understanding a sound, all contact with the west coast is lost. For some reason GPS and phones don't work either, which implies that all the satellites around the Earth are no longer working... Which is practically impossible... But sure, let's believe that for a moment. Daddy and **** decide to go to Seattle to save the Girlfriend, and along the way they run into more problems than a turkey at a Thanksgiving dinner.Then, half way through the movie the writing suddenly improves a lot. The main characters have a more real touching chemistry, and scenes get more interesting compared to before. This doesn't last long though. It lapses back into shallowness and stupidity straight after that.Turns out that Girlfriend is still alive, and she's staying with a conspiracy theorist who for some reason gets **** boyfriend to act like a real douche. Suddenly it becomes important who believes what instead of the fact that people have died. It's ridiculous.The movie ends with **** boyfriend killing the conspiracy theorist, and then driving away with girlfriend to outrun a volcanic eruption. And then it just ends... Wtf. No questions about what is going on are answered, and the end doesn't feel satisfying.It's a mediocre movie with some enjoyment in the middle, but a lackluster start and finish. I give this movie a 5/10."}, {"rating": "2", "text": "I disliked this movie since the start as they acted lik nothing really disrupting happend. It has no real substance, the dialogues are kind of pathetic, characters are lacking personality. I don't find anything good about this movie."}, {"rating": "0", "text": "Dreadful. Lousy script and acting. Zero emotional engagement. No ending. Watch anything else."}, {"rating": "0", "text": "Terrible. Why did I watch this? Nothing made sense, no one  was relatable. An utter waste of….."}], "recommendations": ["the_purge", "wonder_woman_1984", "bird_box", "shadow_in_the_cloud", "knowing", "vantage_point", "2012", "unfriended_dark_web", "escape_room", "sanctum", "the_hunger_games_mockingjay_part_1", "contagion", "the_tomorrow_war", "shut_in", "frozen", "the_new_mutants", "the_titan", "28_weeks_later", "the_purge_anarchy", "eo", "jurassic_world_fallen_kingdom", "stowaway", "awake", "the_strangers", "i_care_a_lot"]}