{
  "id": 1064,
  "title": "How to Train Your Dragon 2",
  "starring": [
    "Jay Baruchel",
    "Cate Blanchett"
  ],
  "runtime": 102,
  "genre": [
    "Fantasy",
    "Action",
    "Adventure",
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "Five years have passed since Hiccup and Toothless united the dragons and Vikings of Berk. Now, they spend their time charting unmapped territories. During one of their adventures, the pair discover a secret cave that houses hundreds of wild dragons -- and a mysterious dragon rider who turns out to be Hiccup's mother, Valka. Hiccup and Toothless then find themselves at the center of a battle to protect Berk from a power-hungry warrior named Drago.",
  "releaseYear": "2014",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/d13Uj86LdbDLrfDoHR5aDOFYyJC.jpg",
  "categories": {
    "plot": 8.657534246575343,
    "acting": 8.754098360655737,
    "ending": 8.571428571428571,
    "soundtrack": 10.0,
    "cinematography": 8.0,
    "familyFriendly": 8.0,
    "funny": 8.083333333333334,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Not only is this movie an excellent follow-up that's almost as good as the first, it's gorgeous to look at and one of the studios most emotional."
    },
    {
      "rating": "10",
      "text": "\"How To Train Your Dragon 2\" Is a very emotional movie, and captures the importance of trust and friendship very well. The plot was organized and easy to follow, and the story line was creatively created. It was a great continuation from the first film, and Toothless and Hiccup's friendship grew. It was a wonderful movie, and I am excited for the third one!"
    },
    {
      "rating": "8",
      "text": "It doesn't have the bit of charm from the first movie, but it's still worth it to say that it's still a decent sequel to the charming original that made the book look like a success."
    },
    {
      "rating": "10",
      "text": "DreamWorks, thank you. THANK YOU! Thank you for making a sequel to one of my favorite animated films and not screwing it up! And, on that note, thank you for making a sequel to an amazing animated film and building on the previous film like a sequel should! \"How to Train Your Dragon 2\" is a fantastic animated adventure that's brilliantly animated, well-acted, excellently written, action-packed, and emotionally resonant. When all is said and done, this might go down as one of the greatest animated sequels ever made, and it is an absolute must-watch! If you haven't gotten the chance to see the film yet, do yourself a favor!"
    },
    {
      "rating": "9",
      "text": "Hiccup, the main character of the movie, lives in a small viking town called Berk. Thanks to his studies and constant analysis of dragons, people of Berk now a lot more about dragons and understand them better. They are living peacefully with tamed dragons until a group of dragon hunters arrive from a neighboring place. From then the story gets twisted and we unpredicted events unfold.\r Hiccup constantly pushes to solve the problems with conversation and dialog unlike most vikings in his town who are ready to fight and use violence. He relentlessly engages with the “enemies” and keeps a discourse with them. He constantly studies them and tries to understand them.\r There are two strong themes in the movie that made me love it. The first theme is the relation between humans and animals which symbolically represents the relation between any two group of adversaries: two races, two ethnicities, followers of two religions, or even two nations. Through the movie, when a group studies and understands the other group, animosities subside, mutual respect flourishes, and the common cores of both groups bind them together. In the call for understanding other groups, this movie implicitly asks us to throw away all the preconceptions and dogma and look at them, judge them, and treat them fairly and justly.\r The second strong theme in the movie is Hiccup's constant search for his identity. He is confused about who he really is and why he is different from all other vikings. But he also ceaselessly searches and seek what he wants to do with his life. He is fearless when he faces challenges and new experiences.\r How to train your dragon 2, is a phenomenal movie, the kind that you have wait years for to come and the kind that will fill you with joy whenever you remember. It is extremely fun to watch with an amazing story and unbelievable cinematography. It is a kids movie for adults. After watching this movie, all you want to do is flying and pondering on the questions that it touches."
    },
    {
      "rating": "9",
      "text": "How To Train Your Dragon 2 is one of the rare cases in which an animation can entertain kids and adults equally.  Boasting beautiful animation, strong character development, and surprising emotional impact, How To Train Your Dragon 2 succeeds in becoming one of the best animated films ever made.\r 9.4/10"
    },
    {
      "rating": "10",
      "text": "Quite possibly the best animated sequel of all time, How To Train Your Dragon 2 expands its boundaries while retaining the heart-warming spirit of the original. The animation quality is superb; the plot is as mature as any Lord of the Rings movie; the soundtrack is mind-blowing; and the characters are relatable human characters, complete with flaws and realistic character development. It far surpassed my expectations, and was worth the 6 month long wait. Honestly deserves the wins for Best Animated Feature, Best Original Score, and Best Original Song at the 2015 Oscars."
    },
    {
      "rating": "10",
      "text": "\"At the first sight you may find the film boring, but if you continue watching, you'll see it worth it.\rprobably DreamWorks's  best animation along with the original \"How to Train your Dragon\", the meaning it contained was somehow political which made it even more enjoyable to watch. \"Good dragons under the control of bad dragons will do bad things\"\rmany things just cropped up during the movie, in a gripping and beautiful way\""
    },
    {
      "rating": "9",
      "text": "I don't know how they did it, but DreamWorks managed to top the original. How to Train Your Dragon 2 takes every aspect of the original and makes it better, from the character development to the action to the visuals to the humor to the drama to the subject matter. This is easily the best animated movie of 2014."
    },
    {
      "rating": "10",
      "text": "Quiet possibly one of the best animated movies of all time.How To Train Your Dragon 2 reminded us what is like to watch an animated movie that speaks to kids and adults alike.Everybody will love and get amazed by this movie.It's constantly fast paced full of action and the characters are as great as they ever was.The voice acting is also perfect and the Director really knows where to take inspiration,which in this case just happens to be The Empire Strikes Back.And this movie totally reminded us of the greatness of that movie."
    },
    {
      "rating": "10",
      "text": "Life there is amazing! How to Train Your Dragon is always my favorite movie!"
    },
    {
      "rating": "8",
      "text": "This is a very good film, but for me it lost the charm of the original. Typically, sequels to an animated movie end up being trash, but this film doesn't follow that trend. As a sequel, it has more dragons that are very interesting and cool looking. The action, graphics and overall story in the film are great as well! I'm very happy with the progress of the main characters, and it really sets up the 3rd film well. Where I was turned off, was the constant need to force Toothless into doing cute actions. In the first film, Toothless had a genuine cuteness to him, but in the sequel it was overdone and quite frankly became distracting. For example, there would be some important dialogue between characters, and then Toothless would be doing something in the background... I guess they put this is for the kiddies who could care less about what's going on in the story, but as an adult, I care about the characters and the challenges they're trying to overcome... but I couldn't focus on what they were saying with how distracting Toothless became during those scenes. Also, I really liked the rag-tag bunch of Hiccups friends in the first film. They were a ton of fun, but in the sequel, they didn't have the same impact. Astrid as Hiccups girlfriend is boring, and Snotlout, Fishlegs, Tuffnut were not really funny. Ruffnut was definitely the best of the group, but her \"joke\" quickly ran its course, when they used it over and over again. Other than the many distractions from Toothless and the lack of fun from Hiccup's group of friends, this movie was a fantastic sequel. I will recommend it to all families and feel like it's a great challenger to Lego Movie for best animated film of the year."
    },
    {
      "rating": "10",
      "text": "For starters, “How to Train Your Dragon 2” has a very mature and rich story that is filled with emotional and dramatic depth. It grows our characters from the first film and really feels like a continuation of the series and not just some cash grab. We see how Berk has changed and how the lives of everyone on the island has become better, I really love how the film tackles darker subject matter like remorse, forgiveness, and redemption, while at the same time touching on themes of love and loss. The screenplay is filled with moments of pure heart and we really see the bond between Hiccup and Toothless expanded upon. Not only is this a great screenplay, but also Dreamworks’ best since the original “Shrek.”\r The characters and voice actors are perfect. I love how the characters have grown and their personalities have been enhanced. Hiccup takes a more proactive role in this film and we really see that he’s matured a lot from the first film. His and Toothless’ relationship is expanded on and it really is still the core emotional center of the film. The side characters like Astrid and Snotlout get more screen time this time around and they actually do more with the film. They aid with the comic relief to keep the movie a little lighter than the extremely dark tone that it’s going for. There are a few new characters introduced into the universe like Valka, Eret, and Drago Bludvist. Valka is a great character and she’s another great female addition to the roster. She has a great emotional ark and not only that, she is a strong character and a better dragon master than Hiccup that really holds her own. Eret is a nice addition to the cast as he is also comic relief, but also a interest side villain character. Drago is a fantastic villain and is really a cold hearted murderer. His method of mastering dragons really differs from Hiccups and its a great contrast that shows the different types of people that are in this world. I love how they build him up before actually revealing him.\r The animation and visuals are probably amongst the best I’ve seen from any CGI film to date. It is just breathtakingly gorgeous. The character’s movements are so fluid and each character has their own way of moving. What I found really impressive is the facial animation. There are so many intimate moments in this film that require no dialogue and we can sense exactly what the characters are thinking from their expressions. There is always something happening in the foreground as well as the background and it’s unlike anything that I’ve seen before in the medium. Characters could be taking in front of the camera, but in the background there could be an epic battle taking place. There is a lot to take in, but the director, Dean DeBlois, knows how to balance the visuals with well paced story. The layout and environment are also quite impressive. Every blade of grass, powder of snow, and water particles are just amazing to look at.\r The score from John Powell impresses again and really enhances the already great score of the series. It’s bombastic, epic, touching, and moving. There is something about the score that really makes the film so much better than it already is. I was literally left in tears because of the score and how beautiful it is.\r I’m gonna come out and say it. “How to Train Your Dragon 2” is a MASTERPIECE amongst modern films and a revolution in animation. It is a film that is going to push animation further and allow the medium to be taken more seriously. For a major studio production, it goes to places that the medium has only thought of, but couldn’t really pull it off because of limitations set by studios and audiences alike. It is almost a near perfect film and I award it the highest 5/5 that I can."
    },
    {
      "rating": "10",
      "text": "Just finished watching HTTYD2. Yes, Yes, Yes, Yes, Best animated i have seen so far\r ___\r-Visual, Best visual for a Animation I had seen so far, Every dragon has a really interesting art design, they detailed every bits of the dragon and make it look realistic. I think even better than any Pixar movie visuals yet, i think...\r -Story plot, though the concept felt abit same as the first one, but its still really great that every seconds count and you never want to even leave your seats for a toilet break, kids will learn alot of life lessons out of it and not only kids, but everyone too will defiantly enjoy it.\r -Voice, also quite a really good job, but i think there's still room for improvement\r -Soundtrack, Yes Yes Yes Yes, Really holy Amazing, i love every bit of it. each track works really well in their part and The ending song by Jonsi is my favorite among them all.\r -Character, Is good as always, showing every character background really well and made them really interesting to the audience.\r Overall, Best Animated yet i have seen so far, from anyone young to old, movie lovers, or everyone, its a movie that you wouldn't want to miss\r(oh the 3D is something you wouldn't want to miss )\r Score: 5/5"
    },
    {
      "rating": "10",
      "text": "How to train your dragon 2 is the best film ever made!! i could well can and have watched it like everyday! no where near boring i love the film, the first one was brilliant also!!! i hope for a third"
    },
    {
      "rating": "5",
      "text": "This sequel takes place 5 years later, when brave Hiccup and his dragon have united their species in harmony. Then comes a villain who wants to enslave them all. The plot and dialogue are pretty mundane, the characters lack any spark or originality, but the animation is lovely. There's too much dialogue for young audiences, but enough action sprinkled throughout to entertain. Overall, an uninspired and unspecial followup. (I don't understand why several of the Vikings in this village have Scottish accents.)"
    },
    {
      "rating": "9",
      "text": "Story:\rFive years after the Viking village of Berk has made peace with the dragons, dragons now live amongst the villagers as working animals and companions. But when someone wants to control all the dragons, it's up to Hiccup and the gang to stop him. The film has been getting a TON of praise from critics, so much that I decided to finally begin reviewing animated films (Will eventually go to other genres). Whereas the 1st film's story revolved around Hiccup as he tries to earn the respect of his father and fellow villagers, along with developing a relationship with Toothless, the 2nd film focuses on Hiccup's family and the dangers that Drago Bludvist has on the dragons. To me, I don't see what the critics are talking about when it comes to the story being refreshing and original since it does have some problems. The story here is by-the-books: (To avoid as much spoilers as possible, I won't reveal anything important) Hiccup learns about Drago, Drago does evil things, Hiccup meets Drago and tries to solve the problem without violence, Drago does more evil things, Hiccup has to stop Drago in the end leading into a final action scene. The story here is nothing new and amazing as critics seem to say, and since this is one of those animated films that centers around its story and characters (as in their contributions to the plot) while also having a serious tone, having a cliched story actually hurts the film more than it would in something like Madagascar or Rio. In fact, the story in the 1st film to me felt better than here mostly because of Hiccup's great chemistry with some of the characters. Overall, the story is receiving more praise than it deserves. 6/10\r Animation:\rThis is the film's biggest strength as the animation here is spectacular. The backgrounds look stunning, the textures are great, the character designs are well made, the environments vary from snowy mountains, to lush flora, to ice-y terrain, and Berk. Another impressive thing was the variety of dragons. There were at least 30 different kinds of dragons seen, and each one looks like they have their own unique feature that makes them special. You can easily make an encyclopedia on all the dragons here. But the most incredible thing about the animation were the action scenes, especially with some \"Alpha\" dragons fighting in the background. Definitely watch this movie in 3D or IMAX if you can. 10/10\r Characters and Comedy:\rAs said, to me the 1st film made better use of the characters than here. I'll say that Hiccup's relationship with his father Stoick and his mother Valka make for some of the more heartwarming moments in the film. Dreamworks did add in some emotional scenes here as things happen to Hiccup, and it's great to see him change throughout the film because of those actions. His bond with Toothless also serves as another highlight to the film. His scenes with his family and Toothless are some of the best moments in the film. As for all the returning characters, they don't serve much of a purpose in the film outside of mere comic relief. I'm even disappointed that Dreamworks didn't expand Astrid and Hiccup's relationship seeing as how they're a couple now. Astrid just follows what all the side characters do now. As for the villain, Drago is your standard-dark dressing, eye-slashed, gritty-voiced villain who doesn't have an interesting backstory or goal. He wants to control all the dragons. So original. As for comedy, the returning side characters are mostly comic relief, so with them and Toothless, you'll find some nice comedy sprinkled here and there amidst all the action and conflicts. It's clear that Dreamworks focused more on Hiccup, his family, and Toothless more than their returning characters and villain. 7/10\r Sound:\rJohn Powell does an incredible job with this score incorporating a more \"epic\" fantasy feel to the film. The score ends up immersing you into this fictional world that Dreamworks created. They even added a song to the mix. It features Hiccup's mom and dad singing a song they hold dear to them, and it's a nice addition to an already incredible score. Oh, and the sound effects here are fine, especially in the action scenes. 10/10\r Acting and Casting:\rAll the performances here are great but if there's one thing I have to complain about, it would be Jay Baruchel's voice for Hiccup. Watch the movie and find out why. I also feel they didn't use Jonah Hill and Christopher Mintz-Plasse to their full potential. But the acting is still great and the casting is fine. 8/10\r Verdict:\rThis film although great, is sort of overrated when it comes to praise. This is mostly because of the flaws in the story and some of the characters. But the animation and score are what makes this film soar over Frozen and The Lego Movie. This is my pick for best animated feature of the year.....for now.\r Extra:\r+1 for being a sequel I enjoyed.\r Rating: 9/10"
    },
    {
      "rating": "9",
      "text": "I was pleasantly surprised by how great this film was! In fact, this sequel performed the rare stunt of being equally as good, if not, better than its predecessor! While it does return to some of the familiar concepts from the first, it even offers a lot of new things as well. There's more action, excitement, emotion, you name it! I was definitely entertained from start to finish! Overall, this was a very worthy and groundbreaking sequel to an already great first movie! If you loved the first, then don't hesitate to see this one!"
    },
    {
      "rating": "10",
      "text": "I didn't think that a sequel to a movie could be better than the original. I'm glad to say that I was wrong. Everything about this film works to improve on the first. The graphic design seems much more colorful this time around. The level of detail is astounding. The voice actors are just as spectacular, especially Cate Blanchet as Valka. Most importantly, the mood and emotion has become much more adult, resulting in the movie appealing to more ages.  I have seen this movie twice already. I may even see it again, because it is just that good."
    },
    {
      "rating": "4",
      "text": "As soon as the movie started I could tell something was off. The only character that expressed any real emotion was Toothless, everyone else seemed so lifeless. During most of the dialogue the characters mouths moved and words came out, but they were so inexpressive it didn't feel like they were actually living characters with something to say. The entire film lacked in humor and had less charm than a single frame of a Disney or Pixar film. This was disappointing because I quite enjoyed the first one."
    },
    {
      "rating": "9",
      "text": "Much, much better then the original one. That's it. YOU SHOULD KNOW WHAT THIS MOVIE IS!!!! GO SEE IT NOWWWWWW!!!!!! DON'T WASTE MY TIME, GO WATCH IT!!"
    },
    {
      "rating": "8",
      "text": "The overall fell is darker and much more mature, which is a good thing, especially with the 5 years gap. The animation, is unsurprisingly gorgeous, so is the production design. The action, by cinematography standpoint, is majestic and epic. But one has to expect, with all of those nice additions, you will get something less, especially the story and character developments. Other thing to regret, how under-mixed the beautiful score by John Powell is in the movie, makes the scene anti-climax. Overall, a nice sequel, but just that, not more"
    },
    {
      "rating": "10",
      "text": "How to train your dragon 2 is amazing, one of the best animation movies I have ever seen, It will surprise you in all the ways! The movie is funny and exciting at the same time. I think I never seen a sequence of a animation movie as good as that."
    },
    {
      "rating": "10",
      "text": "absolutely amazing! i can't believe how much i loved \"How To Train Your Dragon 2\"! cause i did went into this movie excited, but i was also worried if it was gonna screw up like usual sequels do. i was so wrong! \"How To Train Your Dragon 2\" is everything a good sequel should be. first of all, it's absolutely gorgeous! and the best part: it takes the incredible animation of the first movie, makes it even better and takes it to the next level. the flying scenes in this movie are incredibly stunning! like they're flying around and the camera's following them, it was so beautiful and it felt like i was up there with them. and i saw it in 3D, so my mind was literally blown away. and the CGI in this movie's definitely top notch! like there's this shot of a piece of land and a ship. it's a far away shot that looked so great, i was like \"It looks like live action. This looks like a live action movie\". but aside from the incredible animation, deep down this movie's something even more. it takes the characters we all loved in the first one to the next level, just like a good sequel should do. ya know in the first movie, Hiccup was the boy, the boy who found a dragon. in HTTYD 2, he has to become the man, the chief of Berk. this reminded of \"The Lion King\" or \"The Empire Strikes Back\". i walked outta the movie like \"This is probably \"The Lion King\" or \"The Empire Strikes Back\" of this generation\". the action's exciting, the comedy's hilarious and it has fantastic emotions. i actually cried like 3 times in \"How To Train Your Dragon 2\". this movie's not just for kids, it's also for adults. i mean, adults are gonna love this movie, cause there are themes that really hit them, and kids are gonna love the movie cause it's a fun and exciting action/fantasy movie with incredible animation and awesome dragons. and when they grow up, they'll start to understand the darker themes and emotional aspects the movie was going for, and they'll appreciate it even more. that's what i call a good sequel! another one of the great highlights in the movie, it's the relationship between Hiccup and Toothless. to Hiccup, Toothless's a lot more than just a pet dragon. he's Hiccup's best friend and they really show how complex the emotional bond between a person and an animal can really be. it was perfect in that sense. the only small gripe i got with the movie, it's that Drago could've been a little better as the villain. don't get me wrong, he's still a great new character and the movie does make him better as it goes. it's just that, when he first showed up, i was like \"This guy feels kinda weak\". that's just a small gripe, it's not enough to bring the movie down. honestly, i can't think of anything bad in \"How To Train Your Dragon 2\". it's the best animated sequel from DreamWorks we have, since \"Kung Fu Panda 2\". Dean DeBlois, i really hope you win the Oscar for this movie. you definitely deserve it! you gave us one of the best sequels in a really long time. i'm telling ya, Dean DeBlois knows what he's doing in every movie he makes. he gave us \"How To Train Your Dragon 1\" which was amazing. now, he gives us \"How To Train Your Dragon 2\" which is even better. i'm really excited for \"How To Train Your Dragon 3\", but i don't know how they're gonna top this one. this is the BEST animated movie of the year, and probably one of the best animated movies in a really long time. so, if you haven't seen it yet, go watch it. i swear to you, you're gonna love it.\r 10/10"
    },
    {
      "rating": "10",
      "text": "Fantastic\rThe animation is incredible, as is the soundtrack and voice acting. Unlike most animated sequels that tick all these boxes, this movie has a palpable soul. It delivers a very strong message about friendship, loyalty and commitment.\r You can tell that they didn't make this movie simply as a money grab. There are new ideas, new morals and new dragons!\r Brilliant, and achieves everything that one could hope for in a kid's movie about dragons."
    },
    {
      "rating": "7",
      "text": "While it lacks the 'wow factor' as it's predecessor, How To Train Your Dragon 2 retains the emotion, fun and brains of it to spur another Dreamworks hit."
    },
    {
      "rating": "7",
      "text": "How to Train Your Dragon 2 is a great sequel to the sublime original. It nails most aspects and easily displays whey the Dragon series is probably the best animated franchise out there. Roll on number 3!"
    },
    {
      "rating": "9",
      "text": "A mature, richly developed story serves the beautiful animation well.  Any fan of family themed animated movies will find this to be one of the best in recent years."
    },
    {
      "rating": "10",
      "text": "I loved part 2. Instead of a bland copy of the first story, this sequel continued and advanced the plot. It had complex character development and a true \"coming of age\" story for the main characters. It is one of the few cartoon sequels that actually AT LEAST lives up to the original!"
    },
    {
      "rating": "10",
      "text": "This is one of the best achievements in animation in a long time better than The Lego Movie, Frozen, and Wreck it Ralph.  Every second of this film blew me away from its sweet more humorous moments, to some of the more darker elements you will ever see in a children's film.  Plus how can your heart not melt every time you see Toothless on screen.  A"
    },
    {
      "rating": "7",
      "text": "While it isn't as groundbreaking as it's predecessor, How To Train Your Dragon 2 retains the emotion, fun and brains of it to spur another Dreamworks hit."
    },
    {
      "rating": "9",
      "text": "Very good film,  takes a different approach from the original but continues the story of Hiccup and Toothless.  I just want to say this movie is FULL of FEELS.  Tense and dramatic moments that will make you saddened of obstacles that come between relationships,  you may shed a tear or more,  I know I did.  Around the beginning the movie builds up,  but ends with dramatic and large-scaled events that affect everyone, not just the main characters.  I give this movie a 9/10 .  Flawless animation that are fluid and charming."
    },
    {
      "rating": "10",
      "text": "For those parents growing more and more weary each day of yet another screening of FROZEN this movie is for you! This movie will be one you won't mind seeing over and over again in the theatre or at home. We are late in the game and just saw the 1st movie and loved it but 2 was thrilling, funny, pulled at your heart, the whole package. Defintely more mature story line but had just enough comic relief. I have a 3 yr old boy and 5 yr old girl and both were hanging off the edge of their seats and eyes were glued on the screen the entire time (which is a feat for them both). As a parent, one of the best kids movies I have seen in a long time. This is one you want too see on the big screen!!!!"
    },
    {
      "rating": "10",
      "text": "I love the movie\rIt's so funny, so meaningful...\rAnd I love all the actor / actress casted voice for the character.\rEspecially Jay Baruchel. Love him, too."
    },
    {
      "rating": "10",
      "text": "Quite simply one the better movies I have seen in a long time. Saw How to Train Your Dragon 1 and couldn't wait for the 2nd to come out, it delivered and more.\r You know a movie is good when you root for the heroes, boo the villains, and react strongly to emotional parts of the plot. A+"
    },
    {
      "rating": "10",
      "text": "How To Train Your Dragon 2 is a sequel that actually lives up to it's predecessor. It was what I was hoping for and more. The movies starts out with a Dragon competition with all the dragon riders. Astrid, Snotlout, Ruffnut, Tuffnut, and Fishlegs. At first you have no idea where Hiccup is. Once the competition is over we are now soaring through the sky with Toothless and Hiccup. Greeted with one of the best songs in the film. People talk about this movie not having heart, but it's just as big maybe even bigger than the first film. It will make you laugh and maybe even cry.  It had it's joyful moments and some sad moments too, but throughout it always was perfectly balanced. It was darker than than the first movie, but that's okay. I love that it tread on the dark side sometimes. Life has it's darker moments and that made this movie feel so real, even with dragons flying around. Toothless always brought a smile to your face, even during his vicious times. Without a cute dragon like Toothless the film might be too dark for younger kids, but since he is there he helps keep the film balanced perfectly. I say go see it as soon as you can if you even remotely like animated films. Bring your kids if you have any because they certainly won't be bored, and I don't think you will be either."
    },
    {
      "rating": "8",
      "text": "Deeper, darker and emotionally power, this does what a sequel should do which is improve upon the first and make way for future installments. The dragons are awesome and the characters are no exceptions, this is a great animation for the whole family."
    },
    {
      "rating": "10",
      "text": "Com o sucesso do primeiro filme, que foi muito bom, era de se esperar uma sequência e que mante-se o nível. Incrível como conseguem divergir totalmente do livro, e mesmo assim criar uma excelente história. O segundo filme ficou melhor ainda que o primeiro, mais maduro, com uma trama menos \"infantil\", e com uma batalha épica que fez a batalha dos 5 exércitos do Hobbit passar vergonha!! Manteve um nível de excelência para a franquia, e com certeza veremos um \"How to Train Your Dragon 3\". Que a DreamWorks mantenha o nível dessa franquia!!"
    },
    {
      "rating": "6",
      "text": "How to Train Your Dragon 2 is a mixed bag for me, on the one hand, its disjointed, annoying and preachy, but on the other its gorgeous, thought provoking and deep. It has many amazing shots and touching pieces of dialog, but it has just as many polar opposite moments. If I had to sum up my thoughts on this movie in one word, it would be disjointed. There are many amazing scenes in this movie, when Hiccups father is reunited with his wife it is truly touching and extremely emotional. But the surprisingly plentiful scenes of the girl twin swooning over arin son arit son of arene son of Arathorn, is strait up stupid, its totally disconnected from the tone of the rest of the movie and was clearly thrown in there because every family movie needs to have comic relief characters. Ugh, actually the friends in general, aside from Astrid, are painfully stupid to watch. They don’t add to the story and they do not need to exist, why are they even such main characters in this movie? You could have had just Hiccup, Astrid, Stoic, and hiccups mom be the main characters, it’s really baffling. And while you’re at it, add Gobber to the list. He is probably the worst offender aside from the twin girl. When he interrupts the scene where Stoic and Hiccups mom are singing to each other just pulls me out of the scene every time. He completely breaks up the scene and it feels completely separate from what we are experiencing. In the first movie he was the kids mentor and he taught them and the audience about dragons, but here… he’s just pointless! Except for creating laughs for the kiddies to giggle at, and that’s not a character. I don’t care about Gobber when him and Stoic are going after Hiccup, I care about STOIC! Gobber is one dimensional and not funny… to me anyways. *sighs* and all of these points can be put towards the twin girl and the rest of the friends as well. Its funny they actually have a resolution for the two guys trying to impress the twin girl, like what the heck? Why should I care about that? Short answer, I don’t. Its jarring compared to what’s actually happening and it just pulls me out of the movie and leaves me wishing they were just eradicated from the whole movie. And if they did that, then it woulda been like 20 minutes shorter!\rBut other than that, I really do like this movie. While I do have more negative reactions inside when I here this movies name, I do like quite a lot in this movie. Like the animation, its stunning. Anything to do with water, ice, or hair looks photo realistic. Its insane. The character models have gotten a MUCH needed upgrade. Hiccup ACTUALLY looks like a freaking human! But I do think that because they used motion capture, the people do seem a little jerky… particularly in the first act. But its not really a problem, just an observation.\rThe relationship between Stoic and the mom is really heart wrenching. I do feel like these two are in love I believe their story, and it really is heart breaking when Stoic dies, while I don’t think Hiccups reaction is handled very well at all, I do feel for him and when they send him to… val hallah? Right? Right. The relationship between Hiccup and Toothless is really the anchor for the whole thing. You really get the idea that these two have been best friends for a while and they have gotten really good at working together. However I do have a problem with toothless, and the portrayal of dragons in general.\rI think they went a little over board with the intelligence of dragons and they make them borderline human. In the first movie, Toothless was intelligent, he had coherent thoughts and a distinct personality. But he was still an animal, it never felt like he was just as smart as his human companion. In Dragon 2, he is borderline human. And it is really disjointed from the first movie. Now, the designs of the new dragons are far, FAR better than the first one. They look truly awesome. One\rlast thing about the dragons, is anyone else perplexed at why night furies would evolve to have their back spikes be split in two, without them knowing? Like toothless almost lost hiccup twice because he couldn’t fly alone, but he had this hidden feature that his species hid from themselves? What’s the evolutionary advantage? Why would toothless not know about this super useful ability that is a part of his physiology? It makes zero sense, but that’s really just a nitpick and doesn’t affect the overall story.\rOverall, How to Train Your Dragon is a mixture of downright amazing, and painfully silly. It’s deep and emotional, and stupid and silly. I have quite a few problems with it, but all in all it is a great time.\rHtTYD2 gets a 6/10, stunningly beautiful, yet painfully silly."
    },
    {
      "rating": "10",
      "text": "It's One of those DreamWorks Animation movies yet again another green range since the first, First and second Shrek, megamind and puss in boots. These Dragons and people are even funnier. Even when some other girl falls in love with a villain. Another Masterpiece by Fox and DreamWorks.! Great Job who ever director! Be sure to look out for an Special Trailer for the new DreamWorks Movie: Penguins of Madagascar! Coming Soon in 3D!"
    },
    {
      "rating": "10",
      "text": "The first installment should have won the Oscar for best animated picture.  This one should win for sure.  The 3D is excellent, the animation is excellent.  It's also well written and funny.  The detail is amazing.  An all around entertaining film."
    },
    {
      "rating": "10",
      "text": "Easily the Best Animated Feature of the year and Best Summer Film. Dreamworks usually takes the backseat and strides behind Pixar but with How to Train Your Dragon 2 they might have a winning formula to overcome the hurdles. What is really great about HWTYD2 are the script and characters. The script is moving and digs deep about life, death and overcoming all odds. The cinematography, score and graphics are gorgeous and helps evoke the emotions of the film."
    },
    {
      "rating": "7",
      "text": "Gorgeously done and exhilarating in parts. A worthy sequel. Not in my mind as magical as the first, and I thought the film was needlessly dark in a couple areas."
    },
    {
      "rating": "4",
      "text": "The storytelling in this movie is really bad, the emotional elements like loss, sacrifice etc are just dealt with on a very superficial, bad tv style level, there are a lot of plotholes. The dragons are cute, though, but I feel this is one of the animated movies that drags the genre down instead of lifting it up."
    },
    {
      "rating": "8",
      "text": "I really enjoyed the movie. It was fun to see these characters again and I liked the direction the story went. Great visuals as well as good voice acting and score. The How To Train Your Dragon movies are easily Dreamworks' best work."
    },
    {
      "rating": "10",
      "text": "\"How to Train Your Dragon 2\" has just become one of my favorite movies of all time.  This film takes everything that was great from \"How to Train Your Dragon,\" and improves upon it immensely.  Seriously, this movie is amazing!  The visuals are amazing, the sound is amazing, the score is amazing, and the characters are amazing!\rEverything about this movie is outstanding.  It's hilariously funny, gut-wrenchingly sad, and extraordinarily uplifting at different points throughout the movie.\rI'd also recommend that you see it in IMAX 3D, as the visuals are definitely made for this format.  Without a doubt, this was hands down, THE best IMAX 3D movie we've seen all summer, and we've seen every movie that's played in IMAX 3D thus far.\rSeriously, if there's one movie that you see this summer, this should definitely be it."
    },
    {
      "rating": "5",
      "text": "Pretty steep step down from the original which I thoroughly loved.  It's significantly darker than its predecessor and less funny.  The characters, story, dialogue, and writing have all gotten worse.  I took my daughter, who really liked Astrid in the original.  Though a girl, she was driven in a way no other character was and outperformed all the boys with her determination.  In the second book, she's abandoned all that ambition and spends most of the movie doting on Hiccup.  She identifies now seemingly as nothing more than his future wife and has hardly any lines.  That was disappointing.  They did introduce another major female character, but she was nowhere near the inspiration that Astrid had been.  Similarly, the lessons from the first movie, to see past our prejudices, are nowhere to be found.  The story is muddled, and the jokes don't work nearly as well.  I'm sure kids will like the action, but adults will be mostly bored.  I certainly was."
    },
    {
      "rating": "10",
      "text": "How to Train Your Dragon 2 is an excellent sequel. It does what sequel should do. It takes its roots, expands them and doesn't rehash the previous film. Twists and surprises make this movie more of an adult experience than a kiddie one. Beautiful, emotional and dazzling, How to Train Your Dragon 2 is the best animated film in years and puts some animated sequels to shame."
    },
    {
      "rating": "4",
      "text": "Beautifully animated and astoundingly designed, this is never- the- less let down by a so so story line that is unwieldy, over indulgent and finally quite boring. It's a shame because the first film was such a surprise. Alas, there in lies the key. The first film was quite fresh. This sequel may not necessarily be re-hashing events, but the spark of originality has gone. Aside from the afore mentioned pluses only the score adds any further distinction."
    },
    {
      "rating": "10",
      "text": "This movie is worthy of going up against a Pixar movie. yes i said it. It may even be better than a Pixar movie because while it kept to a more mature form and also still a childish sense of humor laughable at all ages.\r10/10"
    }
  ]
}