{
  "id": 4534,
  "title": "How to Lose a Guy in 10 Days",
  "starring": [
    "Kate Hudson",
    "Matthew McConaughey"
  ],
  "runtime": 116,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "It’s the battle of wills, as Andie (Kate Hudson) needs to prove she can dump a guy in 10 days, whereas Ben (Matthew McConaughey) needs to prove he can win a girl in 10 days. Now, the clock is ticking - and the wildly entertaining comedy smash is off and running in this irresistible tale of sex, lies and outrageous romantic fireworks!",
  "releaseYear": "2003",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cCJA1nfLZEs13xKD3syWb86ysgx.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 7.0,
    "ending": 7.0,
    "soundtrack": 7.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 7.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The definitive Matthew McConaughey romantic-comedy. How to Lose a Guy in 10 Days knows exactly what it is and manages to excite regardless. Kate Hudson isn't half bad either."
    },
    {
      "rating": "7",
      "text": "It has to be one of the most predictable movies I have ever seen( like every other romantic comedy).Matthew McConaughey was actually pretty good and the movie was still entertaining even if we saw coming the ending."
    },
    {
      "rating": "7",
      "text": "Cinema is full of little foolish romantic comedies, some of them without any relevant fun. But unlike many people, I liked this movie a lot. It is not a comedy for laughing out loud, but I have to admit that it does what it promises: gives us a few minutes of good entertainment, a nice humor we can see in family without feeling that we waste our time.The script is not particularly brilliant, but works decently: Andie, a promising young journalist, eager to do something better in her career, has to write an article about the mistakes women make in dating and relationships, and for that is challenged to start dating and put these mistakes into practice, so that, after ten days, end up single. At the same time, Benjamin, a macho advertiser with a fame as a womanizer, makes a bet with his boss: if he gets a woman truly falling in love with him in ten days, he will get a very good advertising contract with a huge diamond company. And fate (if we can call fate to another woman, a Benjamin's competitor eager to win the contract for herself) put them both together: he has to make her fall in love, and she has to be the girlfriend that came from Hell.The movie is really funny and has truly intelligent moments, jokes and puns. For me, it is above the vulgar romantic comedy, and I think much of the success is due to the excellent performance of the \"couple\" of main actors. Kate Hudson was at the height of a career increasingly promising, she had just won a Golden Globe with \"Almost Famous\" and seemed well-packed to become an increasingly popular and requested actress. She really did a very good job in this movie, which is perhaps her best movie so far. On the other hand, Mathew McConaughey also did an excellent job, articulating himself very well with her and giving his character an aura of charm and sympathy that matched Hudson's beauty and humor. The film also features good participation by Bebe Neuworth, Adam Goldberg and Kathryn Hahn.Technically, the movie is not brilliant, but that's not what is expected of it either. It has good cinematography and good sets, the costumes are within what we expected to see, and the edition was performed satisfactorily. The film has a pleasant pace and the soundtrack does their work discreetly, leaving the actors (and especially Hudson) the stage needed to make humor."
    },
    {
      "rating": "10",
      "text": "Very clever thought out movie. So funny I can't help but like this movie. One is trying to make her fall in love in days, and the other one is trying to make him break up with her in 10 days."
    }
  ],
  "recommendations": [
    "leap_year",
    "friends_with_benefits",
    "last_vegas",
    "hitch",
    "sleeping_with_other_people",
    "the_break_up",
    "50_first_dates",
    "just_like_heaven",
    "sisters",
    "the_proposal",
    "no_strings_attached",
    "10_things_i_hate_about_you",
    "that_awkward_moment",
    "morning_glory",
    "the_dilemma",
    "the_wedding_ringer",
    "just_go_with_it",
    "the_boss",
    "tammy",
    "a_bad_moms_christmas",
    "17_again",
    "wanderlust",
    "forgetting_sarah_marshall",
    "the_five_year_engagement",
    "meet_the_parents"
  ]
}