{
  "id": 1882,
  "title": "How to Be Single",
  "starring": [
    "Dakota Johnson",
    "Rebel Wilson"
  ],
  "runtime": 110,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "New York City is full of lonely hearts seeking the right match, and what Alice, Robin, Lucy, Meg, Tom and David all have in common is the need to learn how to be single in a world filled with ever-evolving definitions of love.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/a4Ce3qHqIyHM3QfGsiVTAu3YADJ.jpg",
  "categories": {
    "plot": 6.444444444444445,
    "acting": 5.5,
    "ending": 6.8,
    "soundtrack": 9.5,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.833333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "I think we have a big problem with the critique of movies. According to the critics, the most prominent ones are either a load of trash or so generic that we shouldn't give much thought to them. The ones worth praise are low budget and or thematically rich. But this isn't the truth. Every movie has something to give. Most are so good that millions flock to see them. We have a apparent disconnect between those who are paid to review movies and the everyday people who see them. So I think that we shouldn't let the reviewers have the last say as to how well a movie is. I bring this up here because How to be Single is a great example of this. I enjoyed it a good deal. And it should be noted that I have been waiting for this movie ever since they were filming it many months ago. Alison Brie is a awesome actress. And Dakota's also quite cute. And that's all I wanted from this movie.  :)"
    },
    {
      "rating": "7",
      "text": "I had very low expectations walking into How To Be Single, but I was very surprised. The film is not only hilarious, it is so cute, sad, and just a fun movie."
    },
    {
      "rating": "10",
      "text": "The concept of the film is very good, the place where it develops and the plot unfolds very well, the soundtrack I loved, the good touch of \"Welcome To New York\" by Tay Tay and \"Peacock\" by Katy make the environment of the scenes, in particular, the film is good and the performance of Rebel Wilson is incredible, like that of Dakota, Lesslie and Alisson."
    },
    {
      "rating": "6",
      "text": "Those expecting a raunchy comedy revolving around Rebel Wilson may be disappointed to find out that she’s not the central character. She has plenty of opportunity to be outrageous and funny, but there are several other people who fill up the plot. If explores the attempts at hookups and relationship of several people in a somewhat confusing mishmash of romantic lessons. Sure, there are laughs (primarily Wilson), but there are also winning performances and sweet romantic encounters with confused women, sincere (!) guys and one adorable baby. Yes, a total chick flick, but one that’s liable to hit home with its audience."
    },
    {
      "rating": "6",
      "text": "A charming but unmemorable film with a few nice subversions of expectations to help iron out the predictability. Wilson carries the comedy moments, and it's a good take on the buddy movie genre. There's little complexity, as one might expect, and it was fast paced enough to remain interesting, with some attempt at social commentary that was handled competently. A good plane movie. 6.02/10"
    },
    {
      "rating": "3",
      "text": "What a stupid movie, saw it because our choices were limited. I only gave it a 3 because of the few times I laughed (smiled actually). But other than that, it's one hell of a silly movie, silly script, and way too long. No Reccomendo"
    },
    {
      "rating": "5",
      "text": "How to Be Single tries to impress me, but it couldn't anyways. I love the attempt... it's just one problem wrong with it. I don't want to know how to be single. Mediocre movie for the best for moviegoers anyways. I highly doubt there would be people watching this by the way."
    },
    {
      "rating": "9",
      "text": "Amazing. The music is amazing too. Dakota Johnson and Rebel Wilson are great. Alison Bree is unnecessary in this film."
    },
    {
      "rating": "3",
      "text": "Like many other female-driven comedies today, HOW TO BE SINGLE aims to be something greater than a simple comedy. It falls flat repeatedly in its attempt to grow deeper than it is. Rebel Wilson's hilarious performance steals the show - that's where they should've focus their efforts. More screen time for Rebel."
    },
    {
      "rating": "3",
      "text": "How to be Single is a sluggish disaster that seems to never end. The film does nothing for at least 30 minutes while the audience has the endure a disgusting person named Rebel Wilson. This is just another shameful romantic comedy."
    },
    {
      "rating": "7",
      "text": "The young women's attempts to get the life they wanted.\r Another novel based film from the director of 'Love, Rosie'. About the four young women that tells how to enjoy the life by balancing the men and the parties. Very interesting cast, hot ones like Dakota Johnson, Alison Brie and even she's in her 40s Leslie Mann looked so fantastic. The narration had layers to focus on these different people and their different attempt to get the life they wanted. In that, I kind of like Leslie's, maybe the age fact and to be touched by her love tale with decency. But Dakota and Alison led it with their glamorous way and theirs each tale as well not bad, particularly depicting the present world's youngster's culture.\r From the all, the biggest surprise was the Rebel Wilson, who I never liked much as I did for in this, definitely she was at her best. The story was good, seems it was squashed with the too many contents, but awesomely managed to bring them all in one direction by linking them to the main characters. So that makes the stories of everyone take place within the circle and delivered a good entertainment, Lots of fun, even though it is a pure commercial film, there are many things from it that makes us to think seriously. Particularly thinking them from the youngster's perspective about the current world status in the entertainment segment.\r I don't know those who are complaining about it had they watched the same film, Because it is a fine entertainment, even though it is chick film, anybody, particularly adults can have a great time. In a thin margin, there was about men as well, how they're caught between the women they are in love and those women what they believe in. I'm being a man, I really enjoyed it despite target audience is women. I know this is not a masterpiece, but definitely not the worst film of the year or decade. In the film, everyone wanted to be in the relationship, so I did not get it, but the end clarifies decently about the title. Surely worth a watch, if you want a good entertainment.\r 7/10"
    },
    {
      "rating": "5",
      "text": "This film is just okay but had potential to be better than that.  The films ideas are compelling but the execution is poor.  You just don't care much for the characters.  In the end I've seen worse, but I really wanted to like the film more.  C+"
    },
    {
      "rating": "8",
      "text": "I really enjoyed this movie. Of course trailer lies a bit - there aren't that many comedic parts and it still is more or less a romantic comedy, meaning if you want more of Rebel Wilson's shenanigans, she isn't doing that much here - even though her moments are the funniest. But I liked the story and liked the idea behind the movie - that it didn't end with main character falling in love with somebody in the end or something but she ended up being single and with a reason behind it - that she wants to do everything she won't have time to do in the future when she won't be single. Not the usual idea that's why I liked it, something fresh"
    },
    {
      "rating": "5",
      "text": "Okay at sometimes. Rebel Wilson plays the same character as Pitch Perfect. Dakota Johnson is fine which i like her as an actor. But it becomes kinda of a cliche story and underwhelming at the end. Watch when it's on tv"
    },
    {
      "rating": "7",
      "text": "This movie is a surprisingly elegant story about broken and lonely people trying to deal with how inadequate they feel. It's a horrible comedy, but a great drama."
    },
    {
      "rating": "1",
      "text": "Does anyone really thinks Rebel Wilson is funny? She plays the same character every time."
    },
    {
      "rating": "6",
      "text": "Its funny to watch. But the movie ends going not where it makes us think its going. So, said this..for moments it makes feel the viewer lost and difficults to attack us."
    },
    {
      "rating": "10",
      "text": "one of my favourite movies omg i love it so much i watch it almost every night it’s just TOO GOOD"
    }
  ]
}