{
  "id": 1048,
  "title": "How to Train Your Dragon: The Hidden World",
  "starring": [
    "Jay Baruchel",
    "America Ferrera"
  ],
  "runtime": 104,
  "genre": [
    "Animation",
    "Family",
    "Adventure"
  ],
  "description": "As Hiccup fulfills his dream of creating a peaceful dragon utopia, Toothless’ discovery of an untamed, elusive mate draws the Night Fury away. When danger mounts at home and Hiccup’s reign as village chief is tested, both dragon and rider must make impossible decisions to save their kind.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xvx4Yhf0DVH8G4LzNISpMfFBDy2.jpg",
  "categories": {
    "plot": 6.708333333333333,
    "acting": 7.269230769230769,
    "ending": 7.0,
    "soundtrack": 6.0,
    "cinematography": 10.0,
    "familyFriendly": 6.5,
    "funny": 8.727272727272727,
    "action": 8.8125
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is one of the most satisfying franchise finales I have ever seen. The way it wraps up the story of Hiccup and Toothless and Berk as a whole was masterfully done and leaves you satisfied instead of pondering ways that future installments can be made. I really, really, really hope this wins the next animated feature oscar! Sure, Toy Story 4 is brilliant, but I like this better!"
    },
    {
      "rating": "10",
      "text": "When I left the cinema I didn’t like the movie very much, but when I came home and played it in my head, I realized that it was the best one that such a beautiful trilogy could have had."
    },
    {
      "rating": "10",
      "text": "I'm a big fan of the How to Train Your Dragon series and had sky-high expectations for this movie. Thankfully, they were met with a finale that's the perfect way to end this series on a satisfying note."
    },
    {
      "rating": "10",
      "text": "Gorgeous graphics, well-written characters, funny jokes and satisfying emotional beats make for a beautiful finale."
    },
    {
      "rating": "0",
      "text": "As a HTTYD fan since 2017, and someone who loves the series, I can say that I believe in all honesty that The Hidden World is not just the worst of the trilogy, but probably the worst Animated Movie in the last few years. The plot is borderline incomprehensible at points, the characters don't feel alive but more like puppets of the plot, and the dragon flirting scenes drag on for too long (pun intended), the villain is a total idiot who only succeeds based on luck and the main character's being stupider than they ever were in the previous two, and a forced \"Humans don't deserve Dragons, Humans are bad and you should feel bad cause your bad just for being Human. Bye bye Dragons\" message at the end.Hiccup has gone from someone who always does the right thing, who doesn't give up easily (or at all) to someone who would rather run from their problems and give up on trying to make peace with Dragons work (even though it was already working for SIX YEARS up to that point). Toothless has gone from a fiercely loyal, lovable in the \"he's just as much a dork as Hiccup\" and also that factor of \"I want respect\" and been turned into less of a dragon and more of a dog which wants to f##k and nothing else. As someone who's favorite character is HTTYD1 and 2 Toothless, seeing this version of 'Toothless' made me wonder when they'd actually bring THW out and stop showing us this fake. Also, suddenly this Toothless is now the King of All Dragons just so Dean can say it was responsibility that tore them apart, not Toothless wanting to f##k.Grimmel's plans only work because of stupid f##k-ups which characters previously wouldn't have made or pure dumb luck. The Light Fury was just sitting in the forest unchained, if she had woken up earlier and flown off, Grimmel's plan to \"lure Toothless away\" would've been dead in the water. If Toothless and the Light Fury had gone to the Hidden World (which isn't very hidden, being a gigantic **** hole in the ocean) and not come back then Grimmel's plan would've been derailed. If Ruffnut had looked back at all on the flight to New Berk or Ruffnut had not been left behind in the first place, Grimmel would've taken much longer if not never have been able to find the Berkians.And now let's talk about the Light Fury. I hate her, she is a plank of wood sprayed with a white variant of Flint Lockwood's Spray On Shoes. She has zero personality to speak of, and the only reason she exists is to tear Hiccup and Toothless apart so Dean doesn't have to make a fourth movie, also so Dean can push his message of \"Humans bad agghh\"The Riders act like bumbling idiots in this movie, now somehow unable to work without their dragons even though the last act of HTTYD2 literally had them working together, WITHOUT DRAGONS, to distract the Alpha. Valka has zero to no relevance to the story or Hiccup's character besides one scene. If you were hoping to get more of Valka and how she and Hiccup interact, you'll be majorly disappointed.Berk in this movie has been transformed into a seizure inducing sensory overload hell, I would rather drink boiling water than look at this movie's Berk for more than a few hours. New Berk is the most geographically impossible location I've ever seen, and the actual Hidden World is literally a underground cage just dressed up to look like some fantastical world, when it reality it isn't.Also the forced separation at the end is only so Dean doesn't have to make sequels. Dragons aren't safe? They literally just DECIMATED the Hunter Fleet with little to no difficulty, and compared to Drago, they didn't even loose anyone or suffer any injuries. Dragons don't belong with Humans? What about the last 6 years where the Dragons were PERFECTLY FINE on Berk?I could go on and on but I see no point to do so. To cut it short, I'd rather watch paint dry than watch this movie, it'd be more entertaining and less painful. Don't watch The Hidden World.0/10, would rather slam a rock on my foot than watch again."
    },
    {
      "rating": "10",
      "text": "First of all, this is just something I wanted to talk about and that’s Toothless and how he’s just so cute and innocent. Every scene that he’s in he just steals it. If they made a solo Toothless film, which please don’t, I would see it. Since the very first film that came out in 2010 the animation in this film series has just constantly been getting better and better from each entry and in my opinion this one probably had the best animation. Whenever you saw water it looked like real water, all the buildings had the look and texture of real ones. Even the people looked somewhat like real people. All the colour in this film is vibrant and bright that it helps bring you into this world. Also, the lighting in this film helped with what you should feel in that scene. If it was more bright and colourful you knew that it was a happy scene compared to a dark and grim look that would represent a sad moment in it. The characters in this film felt real because they had flaws and made mistakes. Since the first movie to now you see all of these characters grow up over these films and it’s great to see them all mature into these grown adults by the end of this film. All of the action scenes in this film were just breathtaking and were probably better than some of the live action fight scenes you see. The camera angles that showed the action no matter and knew where to focus at what point and time was just amazing. Of course, the music in this film, which was done by John Powell, was intense and easy listening to. I can easily see myself listening to it. The message in this film is great and everybody should follow it. I was going to complain about the subplot between Toothless and the Light Fury but then I realized that it had to happen to help with the main plot and so it really wasn’t a subplot. The humour in this film is subtle and doesn’t over power the film. When there is humour it’s placed in an appropriate place. This isn’t a spoiler because it’s in the trailer but one of the funniest scenes is when Toothless is trying to flirt with the Light Fury. I think really my only problem with this film is the villain Grimmel. He just wasn’t a fully developed villain and this could be because they wanted to keep him a mystery but after the last movies great, one they needed to step it up in this film. I highly recommend seeing this film in 3D due to the breathtaking visual effects. In the end, this film was great and is a great wrap up on one of the best trilogies to date. Also, the ending to this film made me actually cry."
    },
    {
      "rating": "8",
      "text": "I loved the first two films, so I was excited to check this one out, but also especially eager and interested once I found out it'd be the final film in the series. And I'm more than happy to say that it did not disappoint! The magic and fantastical elements that made the first two so enjoyable are all here, along with a touching and bittersweet but also fitting ending to go with it. Storywise, I will say it felt a bit rushed in order to get to the great big emotional ending sooner, but the payoff of the ending was worth it and made up for this for the most part. Overall, this was a great send off to a really solid animated trilogy of films that l've come  to consider to be among DreamWorks animation's best works over the years and will likely remain that way for quite some time to come!"
    },
    {
      "rating": "10",
      "text": "An epic and wonderful conclusion to a beloved movie trilogy. A touching story for both adults and children, filled with thrills, laughs, awesome action, and heart tugging moments. A must see conclusion for all fans who've been there since the very first movie and have waited almost a century for a satisfying end, and boy do they indeed get a worthy end!"
    },
    {
      "rating": "6",
      "text": "Though this film lacks the emotional punch of the first two installments of this trilogy, The Hidden World still puts a nice little bow onto the film franchise that the kids will enjoy. You will still find some laughs but ultimately this film is the weakest of three with less character development and less depth than it’s predecessors."
    },
    {
      "rating": "10",
      "text": "The perfect end, to a near perfect trilogy. It made me laugh, it made me cry, and it made me glad that i fell in love with these characters back during the first  Movie. Every character has a solid Arc, every character shines in their own way, and every character makes you care about them IMHO. (your mileage may vary of course.) But even if you have not seen the first two movies you can still come into this and enjoy the ride as is... you will miss some subplots, but you can still enjoy it. The dragons are every bit as real characters as the people. One of my favorite parts is the way Ruffnut... how shall i put this. Confounds the villain. (you'll understand when you see it.)  and you need to see it."
    },
    {
      "rating": "5",
      "text": "Wish I could say more, but this movie just wasn't good. I've read the books, watched the first movie around 42 times, the second around 6, and have seen both tv series. I'm a huge fan of the HtTYD series, and that's why this hurts me so much.The movie is visually stunning, and John Powell's soundtrack work salvaged it for me.The plot is incredibly forced, and emotionally draining with how unsatisfactory this movie is.I'd never expect something so generic and predictable from Dreamworks, but here we are."
    },
    {
      "rating": "8",
      "text": "DreamWorks Animation is usually the home of mediocrity with a few smash hits on its side such as the previous How to Train Your Dragon installments and the first two Shrek movies. When it comes to How to Train Your Dragon: The Hidden World, I wasn't expecting a bit much from it because DreamWorks usually never cares about their stories when it comes to their movies but I was honestly blown to bits when I see this near-Pixar level movie in the hands of a mediocrity animation studio that never cares about its stories. Of course since it's the end of the entire franchise, we might as well never see anything like this from DreamWorks Animation unless they manage to step up their game from this point on."
    },
    {
      "rating": "8",
      "text": "Beautiful end to the trilogy. The kids absolutely loved it and truth be told I thought it was very well done as well. Visually and emotionally a very nice movie, even if there are times when it just feels too long-winded. Everthing just seems to work well enough, all the way to the excellent ending."
    },
    {
      "rating": "8",
      "text": "This movie wraps up the storyline for the series and it's a pleasant send off at that. The movie does have some nice twists and turns to it. The animation is quite fluid and the 3D models have drastically increased in quality from the last film. The action scenes are much more impactful then the last movie along with the love and comedy scenes too. The only real downside to the movie is that it's quite predictable for an experienced movie goer."
    },
    {
      "rating": "10",
      "text": "This is one of the rare occurrences where a trilogy is wrapped absolutely beautifully. The movie provided a great ending to this wonderful coming of age story. The villain probably didn't need to be in the movie, but the feels the movie brought out were real. Great movie. I would give this a 9.5, but I will round up."
    },
    {
      "rating": "8",
      "text": "With a beautiful farewell, the trilogy fires in an exciting way, bringing more original conflicts, and finally deepening in the history of the Night Furies. Despite being less electrifying, with less intense battle scenes compared to previous films, the film manages to replenish the lack of intensity in conflicts with the addition of Light Fury. His characters remain naive, even after years in the timeline of the film. We missed a great villain, but it wasn't disappointing. Overall, it is beautiful to see a beautiful conclusion at this level. 8.9/10"
    },
    {
      "rating": "10",
      "text": "It´s beatiful!!!!A fantastic closure, with well-planned characters and incredible turns, a gift for your inner childthe animation is perfect and in the end it brings out the tears of joy"
    },
    {
      "rating": "10",
      "text": "First, I would like to note that even though this movie is intended for children, it also appeals to the older audiences as well. I have been a fan from the very first movie and fell in love with the relationship between Hiccup and Toothless. It made me reflect on my own relationship with my pet dog. Usually when the first movie is really good and the director decides there needs to be a second, or a third, they sequels are not as good as the first. Unlike most movie series, How to Train Your Dragon 1, 2 and the Hidden World all complement each other equally. From the first movie to the third, you can see a progression of the main character Hiccup as he grows up and learns the ropes of becoming the new chief of Berk but also can see the progression in the other main characters as well. In the Hidden World, the beauty of the world around them just shines through and is honestly jaw dropping. For anyone, the ending of the movie is very touching and heart breaking but for those who have taken the progression from the first to the third movie, like I have, the emotions hit you more. I was impressed with the detail it all went through to create the movie because the writers and animators could have easier made it much more simple yet they jam packed it with mini details."
    },
    {
      "rating": "6",
      "text": "Good graphics and passable laughs but the narrative is lacking and the pace is too slow, sometime adding cheesy moments that drag on for too long"
    },
    {
      "rating": "5",
      "text": "Moving to a new place can feel like your own house got set on fire. Meeting someone who speaks another language can feel like you are talking to a wall. Deciding to shower in the morning instead of the evening can shift your entire sleep routine. Embracing change puts a toll on anyone, myself included. DreamWorks’ attentive conclusion to their popular trilogy presents these challenges and more in an approach that guarantees any child at heart watching How to Train Your Dragon: The Hidden World will confront transformation greater as a result.The screenplay to this otherwise watchable feature remains too safe by keeping the side characters to one-note comic devices, as was the problem with previous installments to the franchise. While Toothless learning how to court a white female dragon of his own species becomes a sweet scene without dialogue, the naïve bonding still may distance most others who would see this as too little-kiddish. Adults may enjoy the relatively huge clouds that progress into a powerful storm, yet the sudden splendor ultimately remains pretty hollow in its true meaning. Some older viewers may see it all as nothing but a weak tool for empty spectacle to prioritize its claims to help sincere problems. Not all kids would be totally into the experience either, as some could possibly find some of the dragons too scary, especially a couple of sabretooth venom-spitters who go on a rage in their own flames. Stuff like that could make children skip over the message.Speaking of the message, a bland flashback copies The Lion King with an overused theme, “humans shouldn’t exercise authority over the environment,” with little added on to it that other family films have done better in the past. Its catalyst for delivering that theme centers around an unnecessary lazy old villain trope who kills Night Furies when the focus should have stayed on a true, healthy friendship. There’s the strong friendship between Hiccup and his dragon alright, but what about Fishlegs, Snotlout, Ruffnutt, Tuffnutt, and even Astrid? Nothing exploits the clear changes in each of the friends since their first appearances to display their growth… not even Fishlegs’ new braided moustache. It’s the same problem movies numbers one and two have: the gang is not fully invested to help Hiccup decide what’s best for Berk.Now with the negative aspects out of the way, DreamWorks’ franchise still remains a wonderful investment. Considering our culture wants to build up borders, what a breath of fresh air that the big screen unites nationalities through something unanimously tangible. The Hidden World does so in a way that must be seen only in IMAX as more dragons fly than ever within neon glows, even to the extent of caressing a silent storytelling language! At a smaller scale, the white Night Fury’s slumber within radiant backlights looks pure inside her misty forest. Then she moves catlike before turning invisible: prim, independent, and well mannered.Everyone can understand animals (that includes dragons), a truth exploited to its full potential when some green auroras grace a sky dance to contrast against other larger, uglier, beast designs. The immense range of scale guides Berk’s soft sunrise stretched from one of Earth’s corners to another that looks much stronger after the foggy rescue mission prologue gives a cold aura. To tie it all together into a cohesive unit, the franchise’s usual director adds dramatic flames beneath the magic hour moments to symbolize Hiccup’s fear of being a nobody without his pet.To make things better, the vocal cast puts their best feet forward without any more of those fake-sounding accents! Jay Baruchel improved quite a lot after struggling a little throughout the first two installments; he carries our familiar hero to take on those new responsibilities of being chief to great success.The wonderful continuation off past movies helps our sympathetic capacity, both in the story arcs and the quality of the animation; Toothless’ sand drawing turns out better now because the sand texture moves so realistically thanks to technological wizardry! These filmmakers clearly matured as they present a series finale that sweetens the senses, as if you too grew over the last decade.We all must take on those risky challenges, as do I, being always caught in personal thoughts. So, I recently joined my church’s Spain mission trip as a way to enforce needed growth. In that same way, Hiccup’s sky-riding has done wonders to inspire fans the past nine years—you can do the same, whether raising a son or daughter, a dog, a cat, employees, or a workspace. Then, proper etiquette can be taught and learned to eventually help others expose the hidden."
    },
    {
      "rating": "1",
      "text": "So very poor. With repetative and nonsensical storylines. Rampant dragonphilia. Toothless gets another upgrade pulled out of thin air. They continued with that alpha, dragon-king nonsense, despite toothless not having hypnotic powers. They add to its ridiculousness with some magic mind-control venom.They find a hidden undergorund world where magically there's sunligh. And lots of dragons. And apparently they feed on nothing at all. Of course toothless instantly becomes king and the other dragons bow... Even the Alpha from the second movie. Of course all dragons need to hide there, for some reason...Such a steep downhill from the first movie to the third. It was painful to watch. It has no sense or palatable story. Only cheaply constructed sentimentalism (dragons good, humans bad), beast love, and equally cheap human romance.At the end they apparently stayed at a remote unfamiliar island, instead of going home for no reason...Toothless apparently learnt to fix its mechanical tail on its own BTW.Good graphics though."
    },
    {
      "rating": "6",
      "text": "Decent third film with strong animation and music though very poor writing."
    },
    {
      "rating": "5",
      "text": "Loved the first two movies. This one is kinda \"meh\". It's a slower version of the same story we saw years ago, with nothing really interesting or emotionally moving happening. Nothing really happens until the last 10 movies and i was too bored out to care anymore. Too bad it ended like that. Avoid."
    },
    {
      "rating": "6",
      "text": "The emotions and animation are better than the antecessors, but we have a really weak script.This is not a bad movie, however it's worse than the other two."
    },
    {
      "rating": "1",
      "text": "only reason i had to watch it was love between toothless and light fury and only things i like about this episode is hiccup's wedding with astrid i was waiting for it since 2010 and some scenes were like first episode and also soundtracks from 2010 were amazing but at end i hate it and never watch again what kind of end was that end \"we should separate friends because there is enemy and it isn't important we can defeat that enemy\" it's not sane at all ):"
    },
    {
      "rating": "5",
      "text": "This is the 3rd installment in this series about a young man and his friendly dragon. It starts with his community rescuing a bunch of captured dragons, but their plight from a diabolical villain is played out thru the rest of the plot. There are plenty of bizarrely funky dragons, lots of frenzied action and some mildly charming supporting characters. This final chapter will appeal to fans who are invested in the series, but there's nothing particularly original or special here. The ending is sweet."
    },
    {
      "rating": "0",
      "text": "Откровенно очень плохое продолжение, я не понимаю почему у этого мультика такой рейтинг?( Ведь ты весь сюжет узнаёшь в трейлере, и это очень плохо я никому не рекомендую этот мультик"
    },
    {
      "rating": "10",
      "text": "we loved it and got to see it in 3D ! The trailers ruined all the supersizes but it was still great . I just wish that 3D wasen't so hard to find . No 3D NO SELL !    ."
    },
    {
      "rating": "8",
      "text": "Surprisingly full of human moments, expressions of humanity and human values.  A technical marvel.  Probably has more MOVEMENT than any other AAA animation feature ever.  90% of scenes are flying, fighting etc.  Roger Deakins no doubt a wise asset here.  Compare to Pixar's feature UP.  Compare how limited movement is in UP compared to this."
    },
    {
      "rating": "4",
      "text": "A silly plot without so much inspiration, good visuals but a mess of narrative. Only can be saved by its finale, very sensitive and energetic to put an end to the trilogy."
    },
    {
      "rating": "7",
      "text": "I see this as an improvement for the second, but yet far for the first one, you have a really similar story from the second, but this time i felt it was presented a little better, but the villain in this one was so... Meh, nothing important, it could have been almost the same movie without the bad guy. The franchise deserved a better sequels but at the end this two where what we got"
    },
    {
      "rating": "5",
      "text": "they waited years to release this poorly executed film, that falls way below the mark of the other two previous films. just awful"
    },
    {
      "rating": "9",
      "text": "i did not expect to like this as much as i did. i did not like the first 2 as much as this one. it is very beautiful cinema and the story moves seamlessly. the ending does not pause to make you wait to see if the bad guy looses, it just moves right into it. because the professional critics liked it so much i thought i would not. i was very wrong. excellent film."
    },
    {
      "rating": "7",
      "text": "Thanks,Universal. You already spoiled me the important bits in the Teaser (the only trailer I’ve seen for this movie). Aren't you PROUD? Also,I hate the new DreamWorks logo. That music feels like a perfect 80s VHS intro,aside the interesting animation.Onto the review.Ok,so...Now that DreamWorks is owned by Universal,I know what you're thinking. I'll talk worm squat about this movie,then telling you not to go see it. Right?Not this time,dear! (or,at least for 50 or 70% of it?)How To Train Your Dragon 3 is a great movie,and it's chock-full of stuff everyone will enjoy,but it's also a tiring point for DreamWorks’ style of making sequels.But let's get the positives out of the way.I love how the story writes Hiccup. Sure,now he's the “alpha” of Berk,but how is he going to handle everything going on and try to make Berk a safe place? The villain is also great. While they steer to the Ethical Villain route (where he thinks he's making good choices,but really,he isn't),they try to make him just as likable as Drago (who is still the better villain of these movies). Hell,with a shot of Grimmel killing a dragon like nothing,you're starting to cook things up nicely. It's visually spectacular,yeah,but also very busy. So many things are going on,and sometimes,it's so chaotic,right from when we see a Busy,Busy Berk.And the score by John Powell is nothing special and really good at the same time. The beginning set the music up for some greatness,but then,it had a balance with Good and Great,aside from the 3rd Act filled to the brim with fantastic choral work. It’s right up there with Lisa Gerrard’s choral work on Gladiator (2000)The relationship between Toothless and the new Light Fury was...Interesting...although it's mostly used for Dragons Schtick.That’s where I say “Too bad this franchise caper feels like DreamWorks getting tired of their traditional Sequel formula” (‘Who really am I?’ and ‘Gee,I wonder where my parents are…’).It’s not DreamWorks’ fault,though,as they make clear in the Screenplay that “Sometimes,you’ll need to let go of your beloved one”,polite and good enough for an animated franchise. Believe me,I’m struggling to find other good stuff about this movie.The Screenplay,aside from that gold nugget,feels like Dean DeBlois getting tired of the franchise and writing this as the epic finale,since he understands the franchise finished its gas (something studios like Universal doesn’t want to understand). Hey,at least someone understood this car ran out of fuel.Unlike the first two movies,they try to shoehorn in the secondary characters too. While Gobber,Astrid and Eret (the Jon Snow character) are still hilarious,the kids,on the other hand...Get ready for what are they going to do with it.There’s a romance B-Plot in here that it’s so weird,it’ll make the kissing scene from Venom look like the Church sequence from Kingsman 1.And,once in a while,they just stop the movie to make you look at the visual prettiness,and it’s something I’m kinda starting to despise. I get it,your movie is gorgeous.I don’t know,man,maybe it’s my head telling me “IT’S A UNIVERSAL MOVIE. GIVE IT A NEGATIVE RATING”,but at the same time,I’m battling with the traditional movie critic head against the Universal Virus. That sure as hell felt better than the actual movie.This could’ve been one of the greatest animated trilogies of all-time,but sadly,I can’t say it for how this conclusion turned out to be. But hey,it’s still one of the best trilogies of a book-to-movie adaptation,so a cup of cheers for that ;-D"
    },
    {
      "rating": "6",
      "text": "I think it's enough of these \"Train Your Dragon\" movies, all good things have to end."
    },
    {
      "rating": "6",
      "text": "Above average film.Its a fine conclusion to the trilogy but i like much more the 2nd"
    },
    {
      "rating": "6",
      "text": "\"You're supposed to be the generation who lead us into the future.\".( 65/100 ).No hay mucha diferencia entre ésta y varias otras películas infantiles. How To Train Your Dragon jamás fue mi mayor afición y ver la conclusión de esta saga no me fue conmovedor. Sin embargo debo de admitir que hay un par de momentos de gran valor narrativo y emotivo que la salvan de ser totalmente invisible.En esta aventura, Toothless y Hiccup, interpretado por Jay Baruchel, rescatan dragones y los integran a un estilo de vida más seguro. Sin embargo, el espacio en donde habitan ya es muy pequeño para todos los integrantes y también es muy vulnerable de los agresores, por lo tanto, el plan es mudar a la sociedad de dragones y humanos al mundo escondido en donde podrán vivir sin confrontaciones.La única parte de ingenio que vale la pena rescatar en la narrativa es la forma en la que el amor no se puede sostener sin la amistad. Me hubiera gustado una resolución en la que el sacrificio y el abandono no se hubiera dado, pero también entiendo que es parte de una intención que hará que sobreviva tanto la emoción por la saga como el respeto por la mitología en la que se basa. Visualmente, sí es un festín. Hay una aglomeración de elementos y detalles que hace que el recorrido asombre con colores, formas, especies, lugares y una que otra secuencia visual que hará que el cariño de la gente por la saga no desaparezca pronto. Hiccups le enseña al público el valor del ser incondicional y la forma en la que eso crea amistades y relaciones tan fuertes, humildes y transparentes que la distancia, cuando es la solución, no es un obstáculo. The Hidden World es una película carismática que no aspira a nada más que a mostrar un mundo visualmente hermoso y una narrativa fácil de digerir cuyas pequeñas vueltas dramáticas engancharán a grandes y pequeños.-There's not much difference between this and many other kids movies. How To Train Your Dragon never was my biggest fondness and seen the conclusion of this saga was not really moving for me. Nevertheless, I will admit that there are a couple of moments with great narrative and emotive value that save it from being completely invisible.In this adventure, Toothless y Hiccup, voiced by Jay Baruchel, rescue and integrate dragons to a much safer life stile. The problem is that the space where they live is too small for all of the members and too vulnerable to attackers, therefore, the plan is to move the human-dragon society to a hidden place in which they will be able to live with no confrontations.The only clever part that is worth saving in the narrative is the way in which love is unsustainable without friendship. I would’ve liked a resolution in which sacrifice and abandonment would not have happened, but I also understand that is all part of the intention to survive both the emotion for the saga and the respect for the mythology in which is based. Visually, it is a feast. There's a jam of elements and details that makes the travel to surprise with colors, forms, species, places and some few visual sequences that will hold the affection of the people to the saga for some long time. Hiccups teaches about the value of being unconditional and the form in which that creates strong, humble and honest enough friendships and relationships that distance, when it is a solution, it's not an obstacle. The Hidden World is a charismatic movie that doesn't aspire to more than a visually beautiful world and an easy to consume narrative with little dramatic turns that will engage kids and grown ups."
    },
    {
      "rating": "10",
      "text": "eeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeezaebis normas Vova pidoras"
    },
    {
      "rating": "6",
      "text": "Was bored , the worst of this saga , unfunny , the only good part is toothles and  his girldfriend"
    },
    {
      "rating": "9",
      "text": "Hidden World closes off one of the best animated movie trilogies of all time in strong fashion. It's beautifully animated with lively main characters that have been developed well through the past two films, backed from a top-tier voice cast. The story is also entertaining with the action and flying sequences being as stunning as ever. The only thing hampering this film from being as great as its acclaimed counterparts is the weak, cliche villain, which has seemed to be a problem with all the How to Train Your Dragon movies. In the end, Hidden World closes off Dreamworks' best trilogy yet, even with new parent company Comcast/NBCU at the helm for this one."
    },
    {
      "rating": "10",
      "text": "This movie is a great finale to one of the greatest animated sagas of all time. It gave this series the ending it deserved and executed it flawlessly."
    },
    {
      "rating": "7",
      "text": "The third instalment of the franchise has amazing visuals and great animation, the plot however is very much a rehash of the previous films. Not much happens but regardless, there are some touching moments."
    },
    {
      "rating": "9",
      "text": "\"How to Train Your Dragon: The Hidden World\" caps off an almost perfect trilogy in a last instalment that is emotionally satisfying and enjoyable throughout."
    },
    {
      "rating": "10",
      "text": "Love this series. This movie was absolutely fantastic. I don't want to spoil anything so I'll leave out certain details and just say that this was probably my favorite of the movies. The first one is great, and the tv show was great, too, but this really kinda capped everything off at the end with a really nice ending. Having been a huge \"Hiccstrid\" fan throughout, it was enjoyable to watch their relationship conclude in the way it did. Hollywood doesn't have enough of these types of feel good movies these days."
    },
    {
      "rating": "7",
      "text": "Como treinares o teu dragão para mim é o tipo de filme em que a sequência ficou muito boa e este 3 filme culmina na mó de cima o final de uma excelente trilogia."
    },
    {
      "rating": "8",
      "text": "”How To Train Your Dragon: The Hidden World” should be the equivalent of how every other animated or live-action trilogy should add up to when it reaches the end of their run. It takes the gorgeous 3D animation, the interchangeable characters, the stellar action set pieces, the breathtaking cinematography, the captivating musical scores, the emotional but heart-tugging messages, everything that made its predecessors so adorable, so lovable, so relatable, so reeling in awesomeness, it all carries over here. The only major downside is the fact that despite how good this movie is, despite the fact that it’s one of those rare gems in a trilogy where the third film doesn’t suck, it is still effectively the weakest out of the three. It separates away from the darker and more mature tone that its predecessor set, the two main story arcs that come together seamlessly wrap up to the benefit of one arc as opposed to the other and there was no need for an antagonist here. In a movie this simple but so complex in its execution, you either give its villain the Drago treatment or you don’t wanna include him here PERIOD. Here, it should’ve been the latter.As far as I know though, these stories aren’t exactly very original as far as these movies go but it isn’t so much on what the story is that matters more than it is how it’s executed. It’s how these stories are presented plus the relationships they build plus the journey they take to get to the destination that matters the most and the presentation for how all three of these movies executed it is the very reason why we’ve been able to have so much fun with it for this long. But all things considered, it manages to end this series on a high note, the way it deserves. All good things come to an end......and there’s no denying we’re gonna miss you, Toothless."
    },
    {
      "rating": "9",
      "text": "I dont know what is wrong  with mixed reviews, this is very worthy ending for trilogy. Nice touching moments, funny parts too. Just good overall movie. What not to like?"
    },
    {
      "rating": "9",
      "text": "The final quest of Berk dragonaut fulfills the expectatives same as previous chapters, with same efficient mixture of action and humor that identified the trilogy, and a final act that will break a few hearts. Whole family will appreciate."
    },
    {
      "rating": "6",
      "text": "Dragon 3 is a good film starring two kings Dragons to liberate an oppressed people for their power and ways of living in the midst of the Vikings. Vikings who suddenly become enemies of the crown. Most scenes have no downtime, no breaks. The result is a work of staging particularly well worked. The combat choreographies are nice, but not exceptional. This dragon 3 leaves us less an area of solitude as are predecessor, but on this episode the environments are completed by copy / pasted and it sees that. Beyond that, there remains a nice film powered by his catchy music.Dragon 3 est un bon film mettant en scène deux Dragons rois devant libérer un peuple opprimé pour leur puissance et leurs manières de vivre au milieu des Vikings. Des Vikings qui du coup deviennent ennemis de la couronne. La plupart des scènes n'ont aucun temps d'arrêt, aucune coupure. Il en résulte un travail de la mise en scène particulièrement bien travaillé. Les chorégraphies de combat sont sympathiques, mais pas exceptionnelles. Ce dragon 3 nous laisse moins un aire de solitude comme sont prédécesseur, mais sur cet épisode les environnements sont complétés par copier/collé et ça ce voit. Au-delà de ça il en reste un film sympa propulsé par sa musique entrainante."
    },
    {
      "rating": "1",
      "text": "Such a crushing dissapointment. I love the idea of this movie, that sometimes to protect what we love means letting it go, but as the final chapter to the HTTYD it falls flat. It betrays the well established themes of standing up for our beliefs and striving to create a better world which had been present since the first film."
    }
  ],
  "recommendations": [
    "the_good_dinosaur",
    "how_to_train_your_dragon_2",
    "raya_and_the_last_dragon",
    "fantastic_beasts_and_where_to_find_them",
    "bumblebee",
    "kubo_and_the_two_strings",
    "avengers_infinity_war",
    "the_13th_warrior",
    "mortal_engines",
    "next_gen",
    "maze_runner_the_death_cure",
    "super_8",
    "the_matrix_reloaded",
    "the_matrix_revolutions",
    "the_iron_giant",
    "hellboy_ii_the_golden_army",
    "the_last_naruto_the_movie",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "pacific_rim",
    "big_hero_6",
    "the_witcher_nightmare_of_the_wolf",
    "interstellar",
    "the_hobbit_the_battle_of_the_five_armies",
    "300_rise_of_an_empire",
    "the_hobbit_an_unexpected_journey"
  ]
}