{
  "id": 348,
  "title": "How the Grinch Stole Christmas",
  "starring": [
    "Jim Carrey",
    "Taylor Momsen"
  ],
  "runtime": 104,
  "genre": [
    "Family",
    "Comedy",
    "Fantasy"
  ],
  "description": "The Grinch decides to rob Whoville of Christmas - but a dash of kindness from little Cindy Lou Who and her family may be enough to melt his heart...",
  "releaseYear": "2000",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1WZbbPApEivA421gCOluuzMMKCk.jpg",
  "categories": {
    "plot": 4.733333333333333,
    "acting": 6.434782608695652,
    "ending": 7.0,
    "soundtrack": 3.0,
    "cinematography": 9.0,
    "familyFriendly": 5.75,
    "funny": 6.375,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "this movie relies on Jim Carrey's performance as the title character and its storytelling at the same time when it sticks to the source material. How the Grinch Stole Christmas is an entertaining holiday movie from ten years."
    },
    {
      "rating": "8",
      "text": "They could not have picked anybody better than Jim Carrey to be the Grinch (unless it was Johnny Depp). Anyways, this was very fun entertainment for the holidays."
    },
    {
      "rating": "8",
      "text": "How the Grinch Christmas is a extremely funny movie with a wonderful holiday feel to it. Jim Carrey brought the Grinch to life real good and truly gave a memorbale performance."
    },
    {
      "rating": "8",
      "text": "Its a very memorable film that will definetly be watched over and over even by people who hate it, The Grinch suceeds in many ways, not to mention Carrey's stunning performance as this creeper in make-up."
    },
    {
      "rating": "8",
      "text": "Jim carrey carreys every scene he's in. But not only that, the costume design and the make up is brilliant. Great atmosphere! But having a love interest and having an actual backstory is wrong. If Tim Burton directed it, I would give it a perfect 10. So, I give it an 8, bravo Jim bravo!"
    },
    {
      "rating": "9",
      "text": "The Grinch is a gloriously wacky, mad and funny film made by Jim Carrey’s perfect performance of the menacing Grinch himself. He is helped by a great script with an eye for comedy, perfect sets and the fittingly odd cinematography in what is a brilliant film with a heart, that people of all ages can enjoy at Christmas time.\r 91/100."
    },
    {
      "rating": "7",
      "text": "Maybe it's just a guilty pleasure of mine, or maybe it's just that I'm overly nostalgic, but \"How the Grinch Stole Christmas\" was considerably entertaining, if only for Jim Carrey's performance as the Grinch. Beyond Carrey, though, I just find it to be a pretty well-designed movie that's good to watch every now and then. The TV cartoon is miles better, but this live-action film is worth a watch."
    },
    {
      "rating": "7",
      "text": "Jim Carrey es de esos actores que después de años te acordas más de su personaje que de la película en si."
    },
    {
      "rating": "10",
      "text": "I'm surprised by the low ratings here.  I thought this was a lot of fun!  A loony Christmas romp with cool sets and one of Jim Carrey's wackiest performances (in a career of wacky performances.)  After several viewings thou, I think that the real main attraction is not Carrey's Grinch but the kooky Whos and their goofy little town.I'm surprised by the low ratings here.  I thought this was a lot of fun!  A loony Christmas romp with cool sets and one of Jim Carrey's wackiest performances (in a career of wacky performances.)  After several viewings thou, I think that the real main attraction is not Carrey's Grinch but the kooky Whos and their goofy little town."
    },
    {
      "rating": "7",
      "text": "A pretty good classic. I thought the live action characters were weird looking, but they still look ok. The acting was good, and the actors were actually funny. It is a Christmas classic, and worth a watch."
    },
    {
      "rating": "0",
      "text": "i hate this ugly crap. jim carrey is unfunny, the sets and look are really disgusting, the characters are so unlikable, and this stupid, unfunny, inappropriate joke generating, product is so goddamn long and uninteresting"
    },
    {
      "rating": "7",
      "text": "I'm not a huge Jim Carrey fan, as a matter of a fact I really can't stand 98% of his movies, but this is a good one, granted it's not as good as the original animated movie, but it's still enjoyable, my only complaints are that it doesn't follow the original story that well, but this is a good movie from beginning to end."
    },
    {
      "rating": "2",
      "text": "This movie was a massecre of the origional cartoon. never in my wildest dreames have i thought that i would see a good movie be slapdashed in such a way!!!!"
    },
    {
      "rating": "3",
      "text": "Very depressing. With one of the worst soundtracks of all time."
    },
    {
      "rating": "8",
      "text": "It if full of such enchantment and holiday spirit. A wonderfully executed tale that has heart and a lot of laughs. It is a great Christmas movie to see year and year out."
    },
    {
      "rating": "3",
      "text": "Compared to the original, this version is a huge joke that isn't as charming, touching, or even watchable that the original cartoon had. Jim Carrey is alright as the grinch, but to me, he's just jim Carrey in a terrible grinch coustume."
    },
    {
      "rating": "7",
      "text": "Not really much to present, but nevertheless its still a entertaining Christmas film."
    },
    {
      "rating": "10",
      "text": "Watched this film at least 6 times now every time I get a little more entertainment, its very quotable and works for all ages Carreys performance is outstanding, its hilarious."
    },
    {
      "rating": "4",
      "text": "Okay in itself, but the Grinch seems pedophilic... the Whos are obsessed, and the mayor is just wierd... It strays off the whole POINT of the book, and Cindy Lou is an annoying little stalker."
    },
    {
      "rating": "10",
      "text": "I can't believe all of the negative reviews on this film. I saw it in theaters years ago, and to this day I still will gladly consider it the best Christmas movie of all time. Jim Carrey, is without question the best grinch anybody could have asked for. Amazing and very well done."
    },
    {
      "rating": "5",
      "text": "\"How the Grinch Stole Christmas\" is a noisy and strange-looking film that ultimately does not entertain. To be honest, I got really annoyed and irritated after watching 30 minutes of this. The story was so completely random and strange. My recommendation would be to check something else out for Christmas."
    },
    {
      "rating": "0",
      "text": "A butchering of Seuss' story. The Whos are turned into people that care about nothing except presents and who has the best house, Whoville is bleak, the adults are all idiots who can be out debated by a child, the Grinch is more violent and destructive, there's needless padding and romance, there's toilet humour, and the entire message is lost.\r Sadly it seems that Hollywood can't turn a short story into a movie without completely wrecking it. Sadder still is that there are people who believe that longer, stupider, better graphics, or has a celebrity automatically mean better."
    },
    {
      "rating": "5",
      "text": "How The Grinch Stole Christmas features a hilarious performance from Jim Carrey, but that isn't quite enough to cover for a predictable plot, uninteresting characters and cheesy dialogue. Though the scenes with The Grinch are usually somewhat entertaining, the rest of the movie is sickly sweet and bloated (this concept just wasn't meant for feature length). Overall, though not without its moments, How The Grinch Stole Christmas betrays Jim Carrey with Christmas movie clichés and an overstretched plot."
    },
    {
      "rating": "1",
      "text": "WHAT I LIKED: Jim Carrey somehow plays this character with conviction, which certainly deserves credit\rWHAT I DIDN'T LIKE: Unfortunately, it's a pretty cheesy, very ridiculous and far-fetched project that's dragged out beyond it's max half hour plot length. You'll sit there bored, uninterested and occasionally cringing at the so-called 'morality,' and that's the worst place to be as a movie\rVERDICT: If a great performance can't save it, you know it's bad. Christmas films can get away with being cheesy, but they can't get away with this."
    },
    {
      "rating": "7",
      "text": "It would be incredibly easy to dismiss this movie outright as inferior to the 1966 animated short, and you would get no arguments from me—it really, truly is, but is still worth at least one viewing due to the supreme effort put by Jim Carrey into the role he was born to play.The story can be summed up in one line from the book: “Every Who down in Whoville liked Christmas a lot, but the Grinch, who lived just north of Whoville, did not.” Why does he hate Christmas so much? No explanation is given in the original, but here the blame falls upon a childhood incident from which a humiliation was suffered while trying to impress his crush (ah, the power of hormones). In the present, the big green curmudgeon (Carrey) lives atop Mount Crumpit while the Whos celebrate Christmas in increasing extravagance every year, much to his annoyance. Yet one Who, Cindy Lou (Taylor Momsen, who, believe it or not, later went on to form the rock band Pretty Reckless), no longer no more than two but rather about six or seven, recognizes that with the increased focus on the gifts and festivities that people have lost sight of the real point of the holiday, and after learning of the tragic origins of the Grinch decides to seek him out in order to gift him some much-needed Christmas spirit. Through the meddling of the Mayor of Whoville (Jeffrey Tambor), Big G’s old childhood rival, this plan backfires immensely, and after about an hour of the film’s runtime has expired already inspires him to “steal Christmas”. From there, all that’s needed to figure out what happens is a knowledge of the TV cartoon.I must confess, I was a little surprised to learn that this was a Ron Howard-directed project when I first watched this movie, as everything about its atmosphere and imagery reminded me of Tim Burton (nothing like having your Christmas movie narrated by the one and only Hannibal Lecter, am I right?). From the live-action adaptation of Dr. Seuss’s Christmas classic, I expected something much jollier-looking overall, and while there is a certain goofiness about the dank, grimy images it’s not something that I feel is exactly appropriate for children in terms of tone until the classic story that they remember starts to kick in. Carrey as well, despite giving a terrific performance through his total commitment to the role, has an intensity about him as a result that is slightly off-putting, especially for the young’uns, and prone to be scary in some bits (his voice, made to sound like a mixture of Sean Connery and Walter Matthau with a touch of menacing growl for some reason, is largely to blame for this). The movie therefore comes dangerously close to being a children’s book adaptation meant for teens or adults, which doesn’t make for a fun situation for anyone. At some point, however, the film manages to rescue itself through alternatingly dedicated and passable performances (the former mainly from Carrey, the latter from most of the supporting cast), an abundance of heart (Old Grinchy probably had some to spare, considering the freakish mutation of his), and comedy that is surprisingly witty for what could have easily been a charmless adaptation of an acclaimed classic. The star that shines the brightest here is, as stated previously, the one and only Jim Carrey, whose role is so perfectly suited to his brand of comedy that you honestly believe that he might have actually been the Grinch in another life. Nearly unrecognizable under what I imagine is pounds and pounds of makeup and prosthetic fur (which won an Academy Award for Best Makeup), Carrey transforms the old grouch from a bitter and miserly recluse into a comic villain resembling a slightly more effective Dr. Evil (who in himself was an Ernst Stavro Blofeld parody), which ultimately makes him more accessible and sympathetic than his previous incarnation in the animated version. An electric screen presence, any scenes that he doesn’t appear in suffer severely from his absence (to borrow a pun from Entertainment Weekly’s Owen Gleiberman, he really does “Carrey the movie”), and the amount of time spent with him never feels like enough upon reaching the end of the movie, even in spite of its primary focus on his character, and this is when you know that something truly special has been created through an actor’s devotion. It’s what makes the first half of the movie fly by (despite having little to do with the original story), and what makes the Grinch’s change of heart ultimately all the sweeter.While not on the same level as the 1966 television special by any stretch, the modern rendition of the Grinch’s tale will be entertaining enough to warrant an occasional viewing. As a warning to those who don’t like Jim Carrey, though, you’ll probably want to steer clear: this film is basically one extended, Christmas-ized version of one of his routines. 7/10"
    },
    {
      "rating": "10",
      "text": "esta es una buena pelicula, sosa a veces, pero solo por Jim carrey vale la pena verla, el desarrollo del personaje esta muy bien hecho, es todo un clasico"
    },
    {
      "rating": "3",
      "text": "To me this film is an ugly, moldy Christmas sweater that terrifies you every time you look at it."
    },
    {
      "rating": "7",
      "text": "Dr. Seuss ..Do I need to say more ?Oh .. and, Jim Carrey is the main character ...Do I really need to say anything ????"
    },
    {
      "rating": "10",
      "text": "My 3rd favorite Christmas movie (behind Love Actually and Harvey)! Ron Howard brings the grinch to life! One of Jim Carrey's best performances ever!"
    },
    {
      "rating": "0",
      "text": "Awful."
    },
    {
      "rating": "8",
      "text": "I think it was good.BUT........why make a movie about someone STEALING CHRISTMAS!!!!!!Bad subject,ok movie.By the way..........the grinch has a heart and just needs to let it out."
    },
    {
      "rating": "10",
      "text": "From reading other critics' reviews, I can only assume that they were expecting something along the lines of Shakespeare. This is a Jim Carrey film. So, obviously, that's not gonna happen. My advice is to just take the movie for what it is: a light, breezy, and very funny adaptation of one of Dr. Seuss' best works. This has something the animated version didn't have. This one actually explains what made the Grinch such a jerk. Trust me, if I had been picked on as much as he was, I'd have anger issues too. I loved the way this movie dared to explore his attitude from that angle. This film was directed with an enormous amount of energy by Ron Howard. The casting was probably the most brilliant thing about this film. Besides Carrey, the best casting decision was a little girl named Taylor Momsen, who is absolutely wonderful as Cindy Lou, the heroine of the story. I also enjoyed Jeffrey Tambor as the Mayor of Whoville. All I can say is, some critics just need to lighten up and enjoy movies for what they are instead of what they could be."
    },
    {
      "rating": "10",
      "text": "This is a phenomenal movie, I can't believe the bad reviews! I watch this every christmas, easily the best christmas movie. Those who don't like the film must seriously lack humour."
    },
    {
      "rating": "3",
      "text": "This is total garbage, granted I like it as a kid, but as an adult this is ugly. They could have done it as a animated movie. There some things works better in animation than in live-action."
    },
    {
      "rating": "1",
      "text": "Horrible, stupid and practically unwatchable, this is a true Dr. Seuss massacre. I don't know why these directors even bothered with this. And the funny thing is, they're trying to make it look like it's better than the original! I can't tell you much that pisses me of. This garbage is something that should never witnessed by human eyes again."
    },
    {
      "rating": "4",
      "text": "An extremely misguided attempt at bringing the classic children's tale to watch.  Jim Carrey is so over the top, he's almost unwatchable, and the first hour is almost completely unnecessary.  It's like  those horror movies that show you way too much of the monster, such that all the mystery is gone and you're just left starting at an abomination for way too long.  The only saving grace are those scenes that depict a charmingly-rendered Whoville brought to life."
    },
    {
      "rating": "5",
      "text": "Kinda stuffs it, Carrey provides a few laughs but the tone is all over the place."
    },
    {
      "rating": "6",
      "text": "Gives Christmas spirit."
    },
    {
      "rating": "6",
      "text": "Without Jim Carey, this would've been a decent Christmas movie... The story is nothing special but i bet you'll have fun! Not gonna' spoil anything. Recommended"
    },
    {
      "rating": "6",
      "text": "Ron Howard may have struck gold with us, but some of his other films don't live up to that expectation. This movie is quirky, weird, and unsettling. While it works in some places, most of it is not up to par. But, Jim Carrey plays the Grinch damn well."
    },
    {
      "rating": "6",
      "text": "A wonderful holiday tale that will mesmerize all ages.\rWith impeccable acting from Jim Carey and with the artful direction of Ron Howard, How The Grinch Stole Christmas is victorious."
    },
    {
      "rating": "5",
      "text": "My enjoyment of this movie depends what mood I'm in at the time. If I'm in a good mood, then I'll enjoy the movie. Otherwise, I'll be instantly bored, balancing it out to a 5/10."
    },
    {
      "rating": "5",
      "text": "The old Christmas story to film, it's crazy , but the Grinch, hardly surprised , as funny but very little of other emotions, and do not know who hates Christmas ?, and I became like Scrooge."
    },
    {
      "rating": "5",
      "text": "Jim Carrey does his all as the Grinch, the dog Max is cute, and this movie has a backstory to nearly why the Grinch hated Christmas so much. Unfortunately, they're not enough to save this movie."
    },
    {
      "rating": "4",
      "text": "An undeniably flawed, difficultly funny and some kind of overrated work that can only be enjoyable thanks to Carrey's talented performance as the Grinch."
    },
    {
      "rating": "7",
      "text": "How the Grinch Stole Christmas is a pretty good Christmas movie. Good casting choices for the most part and a cool aesthetic to the movie that matches Dr. Seuss' style."
    },
    {
      "rating": "5",
      "text": "A Mixed BagJim Carrey is brilliant as The Grinch, But the story’s heart isn’t as big."
    },
    {
      "rating": "8",
      "text": "How the Grinch Stole Christmas. Mister Grinch you are terrible. A funny comedy starring the inimitable Jim Carrey. It is to him and this subtle jokes that all attention is drawn. What else is good about this movie? Max is there!"
    },
    {
      "rating": "4",
      "text": "it's because i'm green isn't it..How The Grinch Stole ChristmasAfter walking out of this feature the only thing one remembers and discusses about is Jim Carrey and his excellent performance in it since beyond that it doesn't have anything to offer. How The Grinch Stole Christmas is a reasonable childish feature that fulfills and checks off each and every fantasy of a five year old kid but forgets to offer anything more than that in order to satisfy it and hence restraints itself to go bold. Ron Howard is disappointingly not in its A game resulting into some poor execution, amateur editing and loosely placed sequences. As mentioned earlier, its a Jim Carrey's show and he has a lot to offer in here, with amazing skill and perfect comic timing he demands attention from the viewers. How The Grinch Stole Christmas has some one liners, cliched comic sequences and petty writing that miraculously comes alive and helps survive it by stellar performance."
    },
    {
      "rating": "5",
      "text": "The Grinch is a pretty unfaithful addaptation but by no means does that make it bad. A rather confused plot and often weird and gritty visuals will. Carrey is not what youd expect the Grinch to be; but as a big hairy green guy allowed to go as Jim Carrey as he likes he can get a few laughs out, even if they're not too smart (excluding the \"It's because im green isn't it\" joke, thats a clever riot of a joke)The Grinch is enjoyable all year round as a comedy and as long as you arent too fused about changes in adaptations the movie is mostly harmless"
    }
  ],
  "recommendations": [
    "the_grinch",
    "paddington",
    "beetlejuice",
    "christmas_with_the_kranks",
    "the_flintstones",
    "101_dalmatians",
    "charlie_and_the_chocolate_factory",
    "elf",
    "austin_powers_the_spy_who_shagged_me",
    "hotel_transylvania_2",
    "a_cinderella_story",
    "peter_rabbit",
    "over_the_hedge",
    "despicable_me_2",
    "night_at_the_museum",
    "ace_ventura_pet_detective",
    "the_santa_clause_3_the_escape_clause",
    "ghostbusters_ii",
    "night_at_the_museum_secret_of_the_tomb",
    "a_bad_moms_christmas",
    "arthur_christmas",
    "captain_underpants_the_first_epic_movie",
    "deck_the_halls",
    "austin_powers_in_goldmember",
    "dark_shadows"
  ]
}