{"id": 4050, "title": "Hubie Halloween", "starring": ["Adam Sandler", "Kevin James"], "runtime": 103, "genre": ["Comedy", "Mystery", "Horror"], "description": "Hubie Dubois, despite his devotion to his hometown of Salem, Massachusetts (and its legendary Halloween celebration), is a figure of mockery for kids and adults alike. But this year, something really is going bump in the night, and it’s up to Hubie to save Halloween.", "releaseYear": "2020", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/dbhC6qRydXyRmpUdcl9bL9rARya.jpg", "categories": {"plot": 3.727272727272727, "acting": 3.9, "ending": 8.25, "soundtrack": 3.0, "cinematography": 3.0, "familyFriendly": 6.0, "funny": 5.92, "action": 5.0}, "reviews": [{"rating": "8", "text": "Movie is nice and dumb, just the way I like it. You can feel how much fun the cast and crew had when you watch this movie and it's great. Is it Citizen Kane? Of course not. But it's a fun movie to watch with the kids, with quite a few jokes for the adults peppered in."}, {"rating": "8", "text": "I liked it. Its more reminiscent of old school sandler movies like happy gilmore. Some laugh out loud moments and cool to see sandler with his happy gilmore love interest. Great Hal L cameo. That was a great way to start the movie."}, {"rating": "10", "text": "Adam Sandler has done it again this movie is **** awesome funny as hell the only negative is the critics that expect Adam sandlers movies to suck and even when he makes a **** awesome movie they are to up there own asses to see that this movie is the balls"}, {"rating": "9", "text": "Adam Sandler plays a mentally impaired deli worker in this fun-filled, star-studded Halloween romp. You don't want to miss it! Surprises abound, the laughs and scares never stop. You will not be disappointed!"}, {"rating": "7", "text": "This almost feels like a love letter to the Sandler films of old. There are a ton of references made to some of his most notable works and we see him step back into a role similar to the ones he played in movies like The Waterboy and Little Nicky by adopting the persona of a loser with a speech impediment. It's good fun, but while the former SNL star's Netflix outings have gradually been improving in quality Hubie Halloween doesn't quite live up to its inspirations.Some jokes just fall flat on their face and the biggest laughs often come from the supporting cast, which means the Sandman himself regularly has his thunder stolen by his co-stars despite being the one who's onscreen the most. Part of this is due to just how bizarre his character actually is. Happy Madison comedies are always filled with weirdos and oddballs, but Hubie is too cartoonish for his own good with his kitted-out thermos and penchant for freaking out at the slightest fright. There is a likable quality to him however as he really is a good, goofy dude that doesn't deserve all the cruelty he is subjected to. This leads to a nice anti-bullying message that's good for children. In fact, outside of a character played by Maya Rudolph who makes it very clear she's sexually unsatisfied in her relationship and one or two more suggestive jokes this is actually a decent choice for an October family movie night.Overall, this is a solid little holiday caper. Happy Madison's comedy is still proving to be a bit hit or miss these days, but this is easily their most consistently amusing release in some time. It's throwback nature does allow it recapture the magic of Sandler classics like Billy Madison and Happy Gilmore at times as well. However, this is still probably only going to strike a chord with the comedian's most ardent fans.7.4/10"}, {"rating": "2", "text": "One of the worst Sandler films out there. I just feel sorry for the likes of Julie Bowen who were dragged into this wretched mess."}, {"rating": "4", "text": "This movie is okay but Adam Sandler and his character are a big disappointment. It feels like Adam doesn't even try anymore. Even for a kids movie this movie is boring. Yes it has AAA cast but again, main protagonist is just non charismatic. I think Sandler should either try harder as he did in his recent movie Uncut Gems with as brilliant or if he is tired he should just stop shooting movies. 4/10"}, {"rating": "10", "text": "I did not expect much from this movie but me and the kids are Adam Sandler fans. I think its one of his better films!!! Very fun movie we will watch again."}, {"rating": "9", "text": "I was laughing throughout the whole film and the actors and cast were incredible"}, {"rating": "6", "text": "I’m very hit-and-miss with Adam Sandler, but I thought this was one of his funnier Netflix efforts. It’s got some fun cameos, and if you’re a Halloween fan like me then this is an enjoyable 90 minutes."}, {"rating": "0", "text": "I feel bad for the legendary NBA player Shaquile to be casted in a **** like this. It's like watching a \"funny Tik Tok Compilation.\" People who laughs at the jokes are half-witted idiots. I'm just mad that I could've spent better time doing something else."}, {"rating": "10", "text": "This movie is so stupid and bad, its hilarious and I love it. Adam Sandler plays a complete weirdo, and it's so bad it's good."}, {"rating": "0", "text": "I thought Uncut Gems was the most strange and awkward movie i've ever seen until i saw this movie. I truly do not understand how Adam Sandler is still being cast in movies. He is truly the most awkward actor on screen that does the same exact facial expressions and jokes from 15 years ago"}, {"rating": "0", "text": "Awful stupid Sandler with his annoying voice, god I'm so angry with this movie because it really made me mad with how bad it was. Arghfh"}, {"rating": "10", "text": "Great movie one of Sandler’s funny comedy’s you will get a kick out of..."}, {"rating": "0", "text": "Ridículo, irrelevante, mala, aburrida y totalmente insensata, eso es Adam Sandler y todas sus estúpidas películas."}, {"rating": "5", "text": "Easy to watch and had its laughs. Still wish Adam Sandler would stop with the idiotic simpleton vibes. Oh and take 15 minutes off for credits. No bonus scene, just 15 minutes of credits."}, {"rating": "0", "text": "Sandler is phoning in his ten (?) picture deal with Netflix using the same gags where everyone is either stupid or mean. Why does he keep giving himself the same moronic slurred accent and three brain cells? Why are older people in his movies always written so dumb? Why are kids made to be either mean or pure of heart? Easy: he has no ideas. He's tired of making movies. Writing a good script is hard but even if it isn't good he still gets paid. The sets may change but his movies are populated by the same people going through the same motions, living out the same plot formulas."}, {"rating": "4", "text": "\"Never go full retard\" sums up the main character. Why is this even rated PG-13? Felt like the cast was there to just grab a quick buck. The Halloween aspect of the movie and the sets were great though, and the only reason I give it a 4."}, {"rating": "4", "text": "Adam Sandler issued a warning / threat after the Academy snub him.And he fulfilled it.I've seen much worse from him, but that is by no means a consolation, but hey, he's a man of his word."}, {"rating": "3", "text": "This was a massive disappointment for me. I didn’t think the trailer was good at all but I held out up but alas, it was no good. This was so disappointing to me because this is the film that comes out right after his amazing performance in Uncut Gems. The film’s biggest issue is its script and characters. This script is so poorly written that it’s embarrassing. None of the dialogue feels natural. Instead, it feels like an incredibly rough first draft. None of these characters are relatable at all because everyone is so rude and heartless. No normal town would treat one person this way. I know it’s supposed to be a little unrealistic but it was too irritating not to mention. The performances here really aren’t that good. Some of them were fine and harmless like Steve Buscemi but Adam Sandler and Kevin James were pretty terrible. Their performances felt so unnatural and Sandler’s accent was just very obnoxious. The plot itself made no sense at all and felt very loosely put together. It felt as if they structured the story around the jokes which is something you really shouldn’t do. Most of the jokes weren’t that funny anyway. That’s not to say all of them were bad because I did chuckle a few times but not enough to make me think this film was clever. The cinematography and music were fine. The film didn’t look visually bad at all but it didn’t do a whole lot that was interesting. If you’re a fan of Sandler’s style of comedy, then you might get something out of this. If not, definitely pass on it."}, {"rating": "0", "text": "The directors, writers, and producers of this movie are 15 year olds with every mental disability in the entire world. When looking for a good movie I only judge them by this: a good story, it is meaningful, it is enjoyable, and not really offensive. It just fails at every filmmaking aspect. I just found myself teasing the characters and the cast."}, {"rating": "0", "text": "Filme horrível, sem graça com uma piada pior que a outra. 20 anos de atraso."}, {"rating": "5", "text": "Nada dms mesmo modelo de filme que ele sempre fez, única parte que chamou atenção foi a menção ao ator falecido..."}, {"rating": "0", "text": "One of the worst movies i've ever seen! A totally waste of time.. the jokes are ridiculous even for kids and the story is obvious. With such a cast can be considered the biggest disappointment in history!"}, {"rating": "8", "text": "Badly needed Halloween comedy, if you are tired of watching scary films...its pretty much a silly Adam Sandler comedy..mixed with a spooky Halloween plot, that makes you want to keep watching.  Surprisingly, the plot held its own, adding suspense and lots of interesting sub-plots, and if you happen to like Adam Sandler movies, you will likely like this film."}, {"rating": "7", "text": "I liked it. I expected it to be dumb and silly so with those expectations and knowing what you are going into, then I think it was actually pretty funny. I mean by now you should know what to expect from Sandler's \"not so serious\" comedies - you even can see in trailer that he will be talkin in silly voice etc so like this is obvious if you have his previous comedies, then this isn't for you (even though in my opinion this was better than theme). I mean it was silly and dumb on purpose, the movie doesnt take itself seriously and shouldnt you but I felt it was enjoyable"}, {"rating": "2", "text": "I never was fond of Adam Sandler so I knew taking a chance in watching this film would be a gamble and quite possibly a loss of 1 hr and 30 mins of my life that I'll never get back and..... I was right. Another shoddy, mediocre picture with Sandler struggling to be funny, and as always, he missed the mark! I don't know how that man still gets work."}, {"rating": "3", "text": "Putain, c était plein de promesses mais au final on s’est bien embêté...."}, {"rating": "10", "text": "Awesome movie!! I don't understand what anybody dislikes... way festive and hilarious"}, {"rating": "0", "text": "I think this is the worst movie i have ever seen.  Hubie Halloween was a mess. Let's say, you have a blender and three ingredients, those ingredients include the following. \"Boomer Humor\", \"Bad Writing\" and \"Comedy so bad that it's good\", don't forget the touch of Adam Sandler. This was one of, if not the most unfunny movie I have seen on my time on planet earth. Had it not been a pandemic, I can assure you the only people that would be watching this are 65 year olds and 3-8 year olds. The jokes seem to be written by a 11 year old after he googled the word \"sex\". Jesus **** Christ. What was this."}, {"rating": "6", "text": "I love Halloween themed movies, so I was really looking forward to seeing this. But it was just so boring at some parts of the movie, and the story kinda sucked. But it becomes watchable if you turn your brain off"}, {"rating": "6", "text": "Una buena comedia para pasar un rato agradable, la recomiendo si te quieres reír."}, {"rating": "10", "text": "It's funny enough to pass the time and doesn't take itself too serious. Adam Sandler is great as always and the twist is actually a twist lol"}, {"rating": "10", "text": "buena la pelicula, vastante gracio el final medio raro pero bueno, muy buenas la pelicula la recomiendo al 100"}, {"rating": "10", "text": "Es una película divertida donde se te va rapidísima y donde te deja en suspenso por mucho rato"}, {"rating": "5", "text": "Sandler is pretty wasted in this mediocre horror comedy that has some peaks but also several tired moments. All the cast is perfect, though!"}, {"rating": "7", "text": "Es una buena película para verla con amigos o familia por sus bromas que a todo público le puede llegar a dar risa,no es de lo mejor pero está bien"}, {"rating": "6", "text": "Surprisingly good. It’s a funny movie with lots of twist. Not typically an Adam Sandler fan but this is good."}, {"rating": "3", "text": "Adam Sandler continues to prove that he's only really good in more serious films."}], "recommendations": ["grown_ups", "little_fockers", "sandy_wexler", "the_watch", "dumb_and_dumber_to", "the_longest_yard", "this_is_the_end", "the_ridiculous_6", "zoolander_2", "zack_and_miri_make_a_porno", "horrible_bosses_2", "thunder_force", "tropic_thunder", "blended", "couples_retreat", "hot_tub_time_machine", "norbit", "30_minutes_or_less", "alvin_and_the_chipmunks_the_squeakquel", "trainwreck", "dinner_for_schmucks", "just_go_with_it", "pixels", "the_wedding_ringer", "bedtime_stories"]}