{"id": 2601, "title": "Hulk", "starring": ["Eric Bana", "Jennifer Connelly"], "runtime": 138, "genre": ["Science Fiction", "Action"], "description": "Bruce Banner, a genetics researcher with a tragic past, suffers massive radiation exposure in his laboratory that causes him to transform into a raging green monster when he gets angry.", "releaseYear": "2003", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/qnngKqAcqfH2pBxDoKu5lxzSbTo.jpg", "categories": {"plot": 6.6923076923076925, "acting": 5.885714285714286, "ending": 5.6, "soundtrack": 7.75, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.0, "action": 6.294117647058823}, "reviews": [{"rating": "10", "text": "Wonderful. One of my favorite movies of all time. It takes my favorite comic book character and makes him relatable, vulnerable and human. The score is one of the all time best. The action scenes are pretty great as well. It's a must."}, {"rating": "9", "text": "This movie was great. It had a good storyline, good action, good drama, good everything. The dog fight scene could have been a liitle better but overall it was Great!"}, {"rating": "10", "text": "I implore anyone reading this to rewatch and rereview \"HULK\". Im amazed at the negative reviews, both professional and user. It seemed people wanted more mindless \"HULK SMASH\" then a real story with real character. People referenced spiderman, seeming they were hoping for that. But years later, how many of your remember spiderman as a work of art? HULK is more \"The Dark Knight\" then it was \"Spiderman\". And it was ahead of its time as far as comic book flicks go. Years later, I remember the artistry of hulk flying through the canyons, creating an image of two surreal trippy worlds colliding. I remember the scene between Banner and his father to be the equivalent to the scene between Batman and Joker in Dark Knight. And while the fight scene after seemed long it parts, it illustrated the feeling you got from the movie days afterwards. That this was a fight between a mans humanity, and the primal god within, fighting to be released."}, {"rating": "8", "text": "If you aren't familiar with the franchise started by Stan Lee's comic book series \"The Incredible Hulk\", think of this as an intense, fun mashup between DR. JEKYLL & MR. HYDE and SHREK. I know that sounds a bit disturbing, but really, that's what THE HULK is: a regular man whose anger level raises and therefore transforms into a big, green, feared monster. Besides that bizarre factor, THE HULK has astounding, mind-blowing cinematography--some of which actually makes it seem like you're watching an onscreen, live-action comic book. And even though this one moves quite slowly at times, it's a well-acted sci-fi adventure that, unlike many other Marvel adaptations (nods to SPIDER-MAN), is rarely superficial."}, {"rating": "10", "text": "Not quite the same Hulk as comic book fans will remember but a strong story that provides good explanations and backstory of the Hulk as he was meant to be."}, {"rating": "8", "text": "7.4 /10 though rating 8 for massive underrating. Hulk 2003 gets way too much hate and is actually a good film despite the changing of the comic book origins. Obviously the weakest adaptation but in no way \"disastrous\" like some extremists say. It has fantastic visuals and some great action sequences though Nolte villain is horrible. Another Elfman gem of a soundtrack as well."}, {"rating": "8", "text": "Hulk is one of the first superhero movies I have really enjoyed in a long time. I loved the epic story of Bruce Banner's troubled and violent past, and the acting was superb for most of the characters. Eric Bana gave a terrific performance; me as the viewer found myself sympathising with Bruce, and you even worried about what was going to happen to him. The special effects were good, as the Hulk himself ambles across the screen in perfect CGI fashion; also, the dog fight was thrilling and exciting. Hulk was a really enjoyable movie to watch, and I hope that Eric Bana reprised his role for the sequel."}, {"rating": "10", "text": "+Hero powers true to original Hulk design+Fantastic cast+Memorable soundtrack-Dense story details demand repeat views to fully appreciateDoesn't seem fair how this film got panned critically. If you are a hulk fan you should definitely watch this Ang Lee version!"}, {"rating": "8", "text": "This Hulk adaptation is probably one of my favourite comic book adaptation ever.Great acting performances and great effects Hulk is really good sci-fi/action movie.Amazing landscape and memorable action scenes,hulk has everything."}, {"rating": "7", "text": "An overall good experience for comic-book-literate and general audiences, but a few minor plot holes that leave audiences questioning the motives of several characters prevent the film from being an overall INCREDIBLE experience."}, {"rating": "10", "text": "Ang Lee's hidden emerald is much better than most people remember because there have been many films that have been secretly inspired by it. It lacks on action, which is a great pro and focused much more on the Freudian psychological drama."}, {"rating": "6", "text": "Not the best MARVEL movie. Half the people I was watching it with were asleep by the end of the film. The plot wasn’t terrible, with unexpected twists and turns. On the other hand, the Hulk didn’t appear enough in the picture to be “green-worthy”. What’s more, the special affects were by MARVEL standards, awful. Still, Hulk was entertaining, even though it didn’t blow me away. Not a must-see, but not absolutely terrible either."}, {"rating": "8", "text": "The most underrated superhero film and comic book film of all time. I never understood the hate for this film. I understood it perfectly fine even when I was a 6 or 7-year-old kid. The hate for this film is ridiculous, overblown, and exaggerated beyond human comprehension. This is one of my favorite movies ever. I personally adore this movie. It’s what got me into the Hulk. Ang Lee is a brilliant film director and he did a great job directing this film. Eric Bana was amazing in this movie as Bruce Banner. Jennifer Connolly was great as Betty Ross. Sam Elliot was brilliant as General Thunderbolt Ross. Nick Nolte was fabulous as David Banner. The acting was great in this movie, especially from Eric Bana, Sam Elliot, and Nick Nolte. Eric Bana should’ve won an Oscar for Best Actor for his performance in this film and Nick Nolte should’ve won an Oscar for Best Supporting Actor in this film. The plot of Hulk is easily one of the best plots in Marvel movies. David Banner was a great antagonist in this movie and his motives were very clear and completely understandable. He is one of the best villains in Marvel movies and is better than almost every single MCU villain. Hulk has a lot of emotion, depth, and substance in it unlike most of the Marvel movies these days which are sugarcoated and aimed at kids. The character development in this movie is amazing. I always felt that the character development was lacking in the 2008 reboot The Incredible Hulk. The action scenes in Hulk are pretty good. The soundtrack in this film is fantastic and is one of the greatest soundtracks ever in Marvel movies."}, {"rating": "7", "text": "Ang Lee's version of \"Hulk\" is different from those dreamy western versions. It has a prominent morale that is appropriate for its name with splendid acting. Don't criticize, but realize."}, {"rating": "10", "text": "Ang Lee's take on the Hulk story is clearly the superior cinematic film adaptation over it's remake The Incredible Hulk. This picture takes groundbreaking CGI, a very odd and rather refreshing comic-book-esc editing style, and a very well written script and characters in order to create a top notch action film. It really does the colossal badass Hulk a huge justice by showing Banner in his own, more human story and then taking the Hulk himself and putting him into some kick ass action sequences. It's a must see for any fan of superhero and/or action films, or just anyone looking to have a grand old time with a few friends."}, {"rating": "7", "text": "One of the most underrated super-hero films of all time.\r Fitting for a movie about a man at war with his powerful and contradictory impulses, Ang Lee's The Hulk simultaneously embraces its pulp roots and apologizes for them, sweating out a balance between theme and spectacle, large-scale destruction and intimate self-examination. Not since M. Night Shyamalan's Unbreakable has the superhero been so solemnly deconstructed, with heady references to King Kong and Frankenstein further loaded down by dense bits of philosophy and pointed antiwar sentiment. Lee and screenwriter James Schamus—who recently graduated from their more austere collaborations, such as The Ice Storm and Eat Drink Man Woman, to the rousing martial-arts epic Crouching Tiger, Hidden Dragon—may not have been the safest choice to wrangle a beast of this scale. At times, their overarching ambition seems harder to contain than the Hulk himself, especially when they ruminate endlessly on a backstory riddled with repressed memories, Oedipal conflicts, and other touchy-feely psychology. Yet out of this thick primordial soup, Lee finds a strong foundation for his fluid and innovative comic-book style, which brilliantly imitates the panel-by-panel form with splashy zooms, wipes, split-screens, and paintbox effects. Unknown outside Australia save for his galvanizing turn in the 2000 psychodrama Chopper, Eric Bana brings brooding intensity and a compact frame to the Jekyll/Hyde hero. The gifted son of a rogue government scientist (Nick Nolte), Bana fulfills an awful destiny when his experiments with gamma radiation ignite a genetic mutation passed along by his monomaniacal father in the mid-'60s. His roiling temper triggers his transformation into the less-than-jolly green giant, unleashing a destructive rampage that only Jennifer Connelly, his lab partner and erstwhile lover, can quell. When the military catches wind of the situation, Connelly's high-ranking father (and Nolte's former superior) Sam Elliott tries to stop him, but an opportunistic arms corporation seeks to harness his powers for nefarious ends. Lee and Schamus labor mightily to give their characters dimension and dramatic weight, but The Hulk doesn't come to life until the action sequences, which spark the wit and visual dynamism that lays dormant for long stretches. Beneath the creature's petulant rage, the film smuggles a potent response to the ongoing war on terrorism: The more U.S. firepower is thrown in its direction, the bigger and angrier the threat becomes. Infinitely more ambitious and purposeful than the average summer movie, though not as ruthlessly streamlined, The Hulk takes the form of a wounded behemoth, battling to negotiate a compromise between a strong artistic vision and franchise expectations. It doesn't fully succeed on either count, but its integrity and substance stand out like an oasis in a field of cotton candy."}, {"rating": "9", "text": "An incredibly underrated and truly inspired comic book movie, Hulk is just as effective as serious drama, and as far removed from ordinary comic book blandness as The Dark Knight.  Yes the action scenes are spectacular, but Hulk contains true psychological and emotional depth.  Lee's direction is amazing, and I'm truly glad that he decided to give the film an engaging story instead of rushing headlong into the clichés and poor characterization usually associated with the genre.  The fact that it was criticized by many for not having enough action shows how juvenile their tastes truly are.  It's a great accomplishment.  Leaps and bounds ahead of the reboot with Edward Norton."}, {"rating": "2", "text": "This is far the worst superhero movie ever yet. Dear Ang lee, please i forbid to stop making those American superhero comic strip or else you continued to ruin them. Here the mistakes. You turned this Superhero movie into a more of a drama. Plus the action scenes wasn't that great eiter. Kid might like those. But for older people it is boring.Way Way Way too much talking man. you don't know any action that well and so does you partner name James sclamcus. do you know any actions that well? Guess not! You should study more action appealing to American Audiences. OR even better, they should hired John woo, another Chinese Director who know more action better. He directed Face off. the story and the action in Faceoff is beautifully crafted."}, {"rating": "10", "text": "I loved this movie about Hulk. Because I was concerned as the director has explored the relationship between Bruce Banner and the Hulk and the story of Bruce himself.I also adored the actors that have proved equal to the task."}, {"rating": "4", "text": "Ang Lee's Hulk doesn't work. It tries to be more than it is, and fails. What it is, is loud, disjointed action sequences separated by boring stretches that try to provoke thoughts and don't."}, {"rating": "7", "text": "Hulk is an strange movie, and it got a weird story, but in the end it's watchable.\r This film got much action, and I really enjoy the opening scene, even thought it might be a bit to excessive at the start, and the tempo is a little to slow. I also think that it's to much talking in this movie, which made it boring at several occasions. The actors are okay (but not more), and I think the soundtrack is great. The story is good, but it's not the best, because it's weird. The ending is very good and I really enjoy it!\rHulk is a film that got many unique and awesome things, but the tempo, the story and the poor acting made it odd.\r Hulk gets a 7/10"}, {"rating": "10", "text": "Eric Bana was the best Hulk, this was the best Hulk movie and I really think in time, appreciation for this beautiful movie will grow.  Also, Jennifer Connelly is in peak form here."}, {"rating": "2", "text": "Normally I would be able to appreciate a comic book movie for what it is trying to do with the story, trying to go deeper with the character, but not with a movie like Hulk, where every other aspect of the film doesn't work at all. The slow moving plot, underwhelming and boring action sequences, and the unconvincing performances from some talented actors makes Hulk the most disappointing movie Marvel has made along with Daredevil and Fantastic 4."}, {"rating": "5", "text": "Ang Lee's version of the Hulk is very long and fuelled with over the top action. Eric Bana stars as Bruce Banner and the Hulk. First of all, this is the most average superhero movies that I have ever seen. It's corny and long with some good action scenes. The atmosphere is tense and great but the story and dialogue also the acting is corny and bad. Ang Lee makes Hulk take great leaps and awesome helicopter takedowns but the acting, direction and story is very dumb. Lee makes a very well action sequenced but corny film that should only be watched by hardcore Hulk or action, blowing, Eric Bana, more blowing up and even more blowing up fans."}, {"rating": "5", "text": "Holk realmente no se muestra como es hasta el increíble Hulk en 2008 creo, sin embargo no es una descepcion..........................................."}, {"rating": "3", "text": "Hulk doesn't show how did Bruce Banner becomes Hulk. It just continue what comics says about his story, with great visual-effects, but more talk and science than real action. Hulk doesn't deserve to be with the other Marvel film, which are truly a action-packed and more interesting than this terrible and practically illogical film with no action or violence."}, {"rating": "4", "text": "Um yea i dont know why anyone would give this a 10 cause its not that good. the movie was wayyyyyyyyyyy too long. if any movie makes me have to go pee twice and i do leave the movie both times it is not a good movie. he was basically super man he might as well have been called green super man. it wasnt a terrible movie but it wasnt all that good either. the characters were all well developed and the hulk made me think that was an actual hulk. the story just dragged on forever. my advice is to wait for it to come on dvd and watch it at home cause then u can pause and use the toliet."}, {"rating": "10", "text": "The Hulk was simply an amazing experience. Ang perfectly depicted the true essence of the Hulk story, namely the pathos of the misunderstood monster and the wounded, fractured pysche of the man. I think most people who enter this movie with the expectation of watching a typical super hereo action movie will be disappointed. And those who know of the hulk only as a one-dimensional strong-man will likewise be disappointed. But for those who either know of the Hulk story and it's similarities to Mary Shelley's Frankenstein or have an open mindset will be impressed with this movie. Ang Lee crafted he Hulk with the patient hand of a true artist."}, {"rating": "4", "text": "The Hulk is entertaining when it actually focuses on the Hulk especially in the last third. If the film was condensed and made the last third the focus it could’ve been a decent film. Ang Lee instead chooses to focus on uninteresting characters and keep the Hulk out of the film for the majority of the story. While Ang Lee may be good at making stylish action movies the comic book genre is not his place. Thankfully five years from this film’s release a better Hulk movie would come out that would spotlight the last third of the film."}, {"rating": "5", "text": "Visually, the movie looks like a well done Hulk adaptation. The plot, however, was completely laughable, abandoning many aspects of the Hulk comic books, and just plain forgettable. Thank God for the much, much better \"Incredible Hulk\" movie in 2008."}, {"rating": "5", "text": "Ang Lee has always had a knack for visual creativity. That is very easily seen here. The goal of the movie was to show a deeper side of the Marvel character. Perhaps capturing some of the melancholy of the 1978 show. This is partly successful. The Hulk himself has some truly good moments that portray him as a tragic character. Unfortunately these only apply to Hulk and not his human counterpart Bruce Banner, who gets almost all of the screen-time. Don't expect to see much of the big, green smashing machine. The problem here is that none of what's happening is terribly interesting at all. The actors are trying, but there's no emotional resonance. Their performances feel sterile. Some of the stuff they have Eric Bana say and do made me laugh. I just couldn't help it when he was growling or imitating the Hulk's huge heartbeat. Nick Nolte is the only person onscreen of any note and even he doesn't compare to Hulk's remarkably suggestive facial expressions.I give the movie credit for trying to deliver on what really made the character popular over the years, as opposed to just focusing on mindless action. People love Hulk because he's easy to sympathize with. You really aren't able to see that here though, as he's in this movie only a small portion of the time. When he is onscreen, despite a few moments that really do show there's a heart and a brain to the monster, we mostly just get to watch him destroy. Somehow Ang Lee managed to make that dull as well. The majority of the movie is dedicated to Banner and his struggles with his past and the conspiracies of his father. Quite frankly, all of that stuff is just boring. A nice effort. A respectable one at that. Unfortunately, the final product shows that most of what's going on here just doesn't work in the way it was intended to."}, {"rating": "5", "text": "Ang Lee's Hulk is messy, disjointed and very odd. An original take on a superhero movie is always welcome but this movie misses the mark. The plot makes little sense and is poorly executed. The action scenes never fully satisfy as watching the Hulk destroy things isn't as fun as it should be. Some visual effects are pretty cool and the movie should be commended for placing an emphasis on character over relentless action."}, {"rating": "4", "text": "I really love Ang Lee's performance in \"Crouching Tiger, Hidden Dragon,\" but what he did just turned Hulk into a block of green glob all over. In my personal point of view, the 2003 version of Hulk was a catastrophe. Dusted into thin air, why would I want to see this Marvel movie if it was a good movie? I mean, I'm a huge fan of The Incredible Hulk since I was growing up reading every single cliffhangers on what would happen next. Hulk (2003), on the other hand, is beyond disappointing. The acting is bad, the story is ridiculous, and somehow I love the action sequences a little bit, but it wasted for like 2 1/2 hours. Fans really hated this movie. So bad you might even need a barf bag or throw it in the bargain bin just like terrible Marvel sociallites like Daredevil and The Punisher. But finally, my wish for a reboot came true because the 2008 version is slightly the best reboot (before Amazing Spider-Man) better than any superhero movie ever. Because I would hope if they've learned something right from making bad choices from the Ang Lee version."}, {"rating": "4", "text": "I could hardly believe myself when I told a colleague of mine that the movie about a brilliant scientist who is transformed into a gamma ray-powered green monster that fights the military who intend to destroy him was the dullest experience of the year. But it was. Hulk is a clunky drama that moves at a glacial pace, which is never a desirable trait in a movie about a giant green monster."}, {"rating": "2", "text": "In 2003, the world wasnâ"}, {"rating": "4", "text": "The only good in this film is the poster. Is atractive. But the film that is the most important is a biggest disaster, the performance of Eric Bana like Hulk is terrible, and this poor intent to do that Hulk looks like a bad and violent guy, really? because is like a Barney's friend."}, {"rating": "3", "text": "This is one of the worst superhero movies i have seen. Me and my brother watched this movie mistakenly thinking this was one of those avenger movies. The movie has a very slow pace and there is not enough action. Action sequences are generally in the dark and i couldn't see what was happening. I did not care enough about Bruce to keep watching this movie after watching half of this we turned it off. I'm giving this movie a 3 just because i did not watch this whole the way through and maybe it's better towards the end but a 3 is the max i can give it really you're better of watching the Avengers which has a better Hulk"}, {"rating": "3", "text": "This movie is the worst MARVEL movie ever.the Hulk is terrible,visuals are confusing,there are so many errors.the Betty character is confusing most of all.The only good thing about this movie is the action,but overall I hate it."}, {"rating": "2", "text": "Really, really bad film. Not only did i not really like the Hulk before seeing this film, usually when i walk in to see a marvel movie i like to be amazed and introduced to a new character and do some research, this film put a really bad taste in my mouth, it bored me to tears, the acting was terribly average and the plot tried to take itself way to seriously. Bad movie dont watch.\r 2/10"}, {"rating": "5", "text": "Though it contains decent Hulk smashing action in it, it's overlong with too much dialogue choked up into it that by the time the action comes around you feel too deprived of quality entertainment."}, {"rating": "5", "text": "Every director has one bad movie out of many great ones, and this is Ang Lee's example of this. The Hulk is not at all what one would expect from Lee; it is superficial, over-exaggerated, and cliché-heavy. If you want a good Hulk movie, try \"The Incredible Hulk\". It is much better than this average fare."}, {"rating": "4", "text": "A surprisingly boring film despite the amount of effects and action sequences. The characters lack chemistry and the comic book panelling between sequences is amateurish at its best."}, {"rating": "4", "text": "Magnificently directed and well acted, but dramatically inert and partly dull, \"Hulk\" is, along with Daredevil and Ghost Rider movies, one of the weakest entries in the super-hero genre and in Marvel's track record."}, {"rating": "3", "text": "Hulk,il film del 2003,è stato per me uno dei peggiori film di sempre basati sui supereroi ed una trama orribile,dei personaggi con un carisma inesistente.Non guardatelo."}, {"rating": "2", "text": "nothing about this film works! it is otter garbage! event when i was younger i hated it and always thought there was so much wrong with this movie. thank god no sequels followed"}, {"rating": "4", "text": "Nothing but the poorest Hulk film you could ever get before the Incredible Hulk came out. We could watch it for days and days! Weeks and weeks! Months and months! Years and years! Even better.... seconds and seconds!"}, {"rating": "4", "text": "Hulk smash this hunk of garbage. Hulk angry, hulk destroy.\r You said it hulk. You got a long, boring, terrible effects, storytelling movie of the hulk that we have been waiting to get."}, {"rating": "0", "text": "This movie is absolutely terrible in every way and it's painful to watch.  It's about as bad as Indiana Jones and the Crystal Skull, which says a lot right there."}, {"rating": "2", "text": "Has aspirations that far exceed its grasp. Wants to be taken seriously despite having far too many inherently absurd elements and instead it just becomes fundamentally boring. Ang Lee gives us a few cool shots, but neat presentation isn't enough to save this film from being awful."}, {"rating": "2", "text": "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"}], "recommendations": ["the_incredible_hulk", "thor", "thor_the_dark_world", "the_terminator", "avengers_age_of_ultron", "terminator_3_rise_of_the_machines", "hercules", "terminator_2_judgment_day", "superman_returns", "aquaman", "justice_league", "the_suicide_squad", "fantastic_four", "rise_of_the_planet_of_the_apes", "elektra", "fantastic_four_rise_of_the_silver_surfer", "hellboy", "sherlock_holmes_a_game_of_shadows", "man_of_steel", "transformers_dark_of_the_moon", "indiana_jones_and_the_temple_of_doom", "bloodshot", "iron_man_2", "transformers", "last_action_hero"]}