{
  "id": 1510,
  "title": "Hunter Killer",
  "starring": [
    "Gerard Butler",
    "Gary Oldman"
  ],
  "runtime": 121,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "Captain Glass of the USS Arkansas discovers that a coup d'état is taking place in Russia, so he and his crew join an elite group working on the ground to prevent a war.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/a0j18XNVhP4RcW3wXwsqT0kVoQm.jpg",
  "categories": {
    "plot": 6.166666666666667,
    "acting": 5.9,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.25
  },
  "reviews": [
    {
      "rating": "7",
      "text": "On dirait une histoire à la Tom Clancy... sauf qu'il ne s'agit pas du gars Tom à l'imagination patriotico-délirante ! toujours est-il que son ombre plane décidément toujours sur Hollywood qui exploite encore (et toujours) le filon du thriller géopolitique au cours duquel les Etats-Unis -sauveurs du monde libre- sauvent le monde au bord de la Troisième Guerre Mondiale...Ici, c'est donc Gérard, ce bon vieux Gégé (pas le nôtre, le leur...) qui nous fait voir sa gueule de guerrier, toutes dents dehors et...  pardonnez-moi, je pensais encore à Léonidas. Gérard est très sobre ici en capitaine de sous-marin qui va s'occuper du bordel en Russie. Car comme de coutume, les Amerloques doivent nettoyer les conneries des Ruskofs... un général a fondu un plomb là-bas, vous comprenez !C'est donc idiot, intrinsèquement idiot et pas crédible pour un dollar ; \"invraisemblable\" est le mot d'ordre du script qu'on suit à la lettre, du début à la fin... Si vous ne pouvez pas vous y faire, vous ne tiendrez pas le coup !Mais en débranchant les fiches adéquates dans le cerveau, on apprécie à sa juste mesure ce délire plein et entier, très distrayant et spectaculaire. Sur ses deux heures, le film ne faiblit jamais, nous proposant une action ininterrompue et le minimum de bavardages : on lui en sait gré, d'autant que la réalisation est.. étonnamment à la hauteur par les temps qui courent !Bien monté, bien éclairé, bien cadré : tout y est ; très belle lisibilité, confort de visionnage assuré. Ce n'est pas du Kubrick et on ne demande rien de tel mais avec tous ces films filmés comme de la merde qui se reproduisent comme des cafards, il y a de quoi s'inquiéter. Alors, il faut saluer le bon filmage ! en outre, les effets spéciaux sont très présentables, ma foi.Bonne surprise donc... signalons un Gary Oldman qui excelle en Amiral parano et l'excellent Suédois Michael Nyqvist en capitaine russe. Récemment disparu, l'acteur nous manquera pour son aisance et son charisme naturel."
    },
    {
      "rating": "9",
      "text": "Very exciting. This was a fun movie from beginning to end. The plot isn't as amazing as the Hunt for Red October, but it's reasonable and compelling. And it's designed so that there are thrills almost from the beginning until the very end of the movie.  Lots of action and adventure. If you are looking for an action movie, this is a great one to go with."
    },
    {
      "rating": "6",
      "text": "Es buena la acción, la historia es interesante, pero esta hecha con 3 pesos. Oldman sale 5 min."
    },
    {
      "rating": "1",
      "text": "This movie was so boring. There is very little reason to watch this. Stopped half-way and started watching something else. The characters were that bad normally I like these kind of movies like patriots day 13 soldiers of benghazi and the 15:17 to Paris. But this one I could have fell asleep to."
    },
    {
      "rating": "6",
      "text": "Gerard Butler stars as a submarine captain who has to navigate a lot more than the perilous Russian waters. He's the center of an elaborate (and somewhat improbable) plot to thwart a government coup. An unusual alliance results in some tense underwater threats and a bit of action, but never plumbs the depths of dramatic tension that would have made it a thriller. Despite the unlikely plot developments, it's relatively entertaining and mildly engrossing."
    },
    {
      "rating": "6",
      "text": "This movie was ok. It could have been better but overall director and the believable cast managed to make a good movie with 60 million budget. If movie had more money to burn it could have been much much better. The special ops soldiers looked believable and Mr Butler was ok captain, thats the problem everything was just ok, there was nothing there to elevate this movie to the classic status like Hunting the red october/ air force one etc.When they showed fleet movement they must have used some old footage from documentary or something as you could see sailors dressed in ceremonial uniforms on one of the ships and it totally ruined immersion for me. Destroyer and some subs had CGI feel to them so not sure how was it possible to make subs more believable in Hunting the Red October than movie made many years after this classic."
    },
    {
      "rating": "6",
      "text": "I really wanted to love this movie... I just didn't... me giving it a 6 is probably being generous..."
    },
    {
      "rating": "7",
      "text": "It gives your the typical american action movie vibe, but actors play their roles extremely good which helps you in achieving the ultimate action satisfaction. I have ranked it 7 because the ending can be predictable, but it has few unexpected turnouts which makes it good and fun to watch."
    },
    {
      "rating": "8",
      "text": "The current user score is ridiculously low. The movie is what it was intended to be. A well photographed & acted action film. Sure it resembles other screenplays but it has enough sub-plot changes to keep you interested & give it an identity of it's own. Not an Oscar nominee but a good old entertaining action film."
    },
    {
      "rating": "6",
      "text": "It has some pacing issues and horrible, straight-to-DVD level CGI, but there’s an amusing 1990s B-movie charm to it. There’s some fun to be had with this movie..."
    },
    {
      "rating": "7",
      "text": "Well, this ain't no Red October or Crimson Tide.  But, it's a pretty good naval combat drama which could have been much better.  Good effects, talent, reasonable script, decent story -- but it somehow doesn't carry any real voltage except in a few scenes.  The subtle flaw here is the editing!  The editing is constantly episodic -- one set scene, then another, but few of the little connecting scenes that a director and editor are supposed to fill in to create a smooth, immersive story narrative. Example: the officers climb up into the hatchway to the mini-sub.  Then -- boom -- cut to the officers sitting at the controls 3 min. later.  Jarring \"jump cut\" just skips over a whole segment of time!  We're like, \"huh?\"  Normally a director will fill in a few 1-second, 2-second transitional scenes quickly showing the guys scrambling up out of the hatch -- urgently running to the controls -- strapping in -- flipping switches.  This creates a series of shots pulling us along through an urgent and suspenseful part of the story where time is of the essence.  Instead, we just cut to the guys sitting kind of relaxed at the controls.  No tension!  No voltage!  It's \"limp\", and destroys the suspense.This sort of thing happens over and over again throughout the film.  It's as if they used the spec script as the shooting script -- as if they shot the whole film as a series of storyboards, with no interpolation or connecting material.  It damages the film badly, but it's also very educational -- a shining example of what \"episodic\" really means, and why it's avoided by professionals.Despite this, it's still an entertaining film, and I felt like I got my money's worth.  The scene where the sub is getting kicked around by all those mortar depth charges is epic!  Excellent punchy sound and visual effects, reasonably well cut, thasss what I wanted to see, oh yeah.If they'd had more of that, and the director/editor had worked harder at transitional details (rather than just leaving them all out), it could have been a really tight and memorable war drama.  Maybe they were trying to cut out scenes to shorten the run time?  If so -- penny wise pound foolish.  DON'T cut the 1-second transition scenes, that won't save any real time, but it'll hurt your film bad Mr. Director!"
    },
    {
      "rating": "8",
      "text": "The fun of this film is the military operations, specifically those of the two navies. Elements of the plot are a bit much but it's a decent premise. However, in the final act of the movie when the weapons systems do their thing, it's almost as good as what you see in another great navy movie - Battleship. There are some pretty tense moments, too, when submarine Captain Glass demonstrates unorthodox tactics when it seems all hope is lost. You may find yourself holding your breath a few times during this military thriller."
    },
    {
      "rating": "5",
      "text": "Hunter Killer was reasonably suspenseful. It is not on the same level with one of my favorite films (The Hunt for Red October), and a quick comparison will show what Hunter Killer lacked. The Hunt for Red October had a stronger cast, a more interesting premise and script, a sense of humor, and tighter editing. But overall Hunter Killer held my interest, although the best I can say about it is that it is not terrible."
    },
    {
      "rating": "8",
      "text": "I love sub movies so this was a real treat!It's a really entertaining movie with some solid lead roles and the special effects are great.Some of the twists are ridiculous but if you wanna have a cold war sub-showdown you can't really have a 100% serious script."
    },
    {
      "rating": "8",
      "text": "Overall a good film,certainly not an acurate documentary on submarines.If you enjoyed red October then you may enjoy watching this film and we enjoyed the story.."
    },
    {
      "rating": "9",
      "text": "This is a very exciting and entertaining sub movie.  Gerard Butler does an excellent job playing a submarine commander, taking his boat and crew into extreme danger and staying cool and collected throughout.  Toss in some SEALs and a rescue mission on a Russian naval base, and you're in for a good ride.  The cast does a great job overall and while the technical aspects aren't based in reality, only a veteran will likely know the difference.  This is a fun movie to watch and I highly recommend it!"
    },
    {
      "rating": "10",
      "text": "My son and I went to see this.  We really enjoyed it.  Was the plot line or acting extraordinary?  No.  But I was entertained, and that’s why I go to action movies.  10 out of 10, and I rarely give a movie a 10. My taste?I also gave A Star is Born a 10 and Crazy Rich Asians a 9."
    },
    {
      "rating": "5",
      "text": "As one critic said, this movie has been done before and a lot better. How many stories have been done about a rogue general trying to start WWIII? I can't count how many but suffice it to say that most are better than this dreck. And there are so many illogical and inconsistencies I lost count but here a few:1. Apparently people can be shot and immersed in freezing cold water and are then \"patched up\". After being \"patched up\", they can fight as good or better than highly trained and healthy soldiers.2. Again, people can dive in to freezing cold water that would cause hypothermia in about 30 seconds but are just fine after several minutes.3. Russian submarine commanders wear dress uniforms during normal tours and they wear medals from the USAF (including the good conduct medal and the AF commendation medal).4. While looking for a hidden transmitter, highly trained soldiers shoot up into a tower and then discontinue looking for no apparent reason.5. And why Russia - the current Russian president is likely to start WWIII on his own!And Gerard Butler cannot seem to find a good movie since \"300\". I like him but Gerard you have got to find something better. Only recommended for a rainy day with nothing better to do."
    },
    {
      "rating": "7",
      "text": "Finally! It's been a while since we've had a notable USA - Russia action movie. And if you overlook some of the \"could have been better\" CGI explosions, this was actually really fun to watch. Gerard Butler pulls of a more than decent sub marine commander, as well as his \"Russian\" colleague Michael Nyqvist. The only casting problem for me was Michael Gor, who looked like a spoiled little boy for the duration of the movie, instead of an admiral gone rogue. All in all, a very entertaining movie, which proves that there is still more to gain in the submarine genre."
    },
    {
      "rating": "9",
      "text": "Great plot. Gerard Butler did amazing as the submarine captain. Go into the theater knowing that this movie is supposed to be a slightly unrealistic action film not based on any historic or plausible scenarios and you'll love it."
    },
    {
      "rating": "4",
      "text": "Predictable, lacking sobriety and unfortunately populated with blurred and forgettable characters played by actors who seems were only interested in collecting their checks and forgetting about it, the minute they finished the shooting."
    },
    {
      "rating": "8",
      "text": "If you need something to escape with, this is AAA script, acting, directing, VFX. A tale of COOPERATION between US and Russia personnel.  Best submarine movie since Das Boot?  I think better than the sub movie made by Jon Mostow, Terminator 3 director, which is almost as good. Here everything hangs together with enuf surprises to keep us engaged with the plot and characters.  I think by 2018 the audience for sub dramas had mostly died off.  Again, I feel pro critic attacks on the director and star are unwarranted."
    },
    {
      "rating": "10",
      "text": "Una de las mejores peliculas,comparable a Armagedon y a Battleship. Es una pelicula, siempre tiene que haber algo de ficcion, no se porque se quejan de que no sea real."
    },
    {
      "rating": "10",
      "text": "The movie is well made, fresh and entertaining story. All aspects are very well looked after. I enjoyed every second from start to finish."
    },
    {
      "rating": "6",
      "text": "This is a decent action-thriller with some pretty cool action scenes and passable acting."
    },
    {
      "rating": "6",
      "text": "Reasonably watchable movie, a bit cheap and quite unrealistic, but that's not all that surprising given the relatively low budget. Still not a bad action movie. Quite a few bigger budget movies aren't half as good as this one. Butler is doing a good job as a sub captain, but he can't perform miracles."
    },
    {
      "rating": "5",
      "text": "Curiously I enjoyed this movie even though it could have been improved with some better writing. It would have been much better to focus on the conflict between the new submarine commander and his XO which would then reach boiling point as the tension rises. This would have required to flesh both men out more and this time could have been found by removing much of the scenes in the US. There is also too much time given to the special ops team. It would have been much better if the team actually was a navy seal team that operated from the submarine. In that way the focus would have been on the sub all the time and there would have been less time needed to introduce people and the leader of the seals could be another guy with a stake in the conflict between the captain and his xo.I find the movie also weak because it paints the Russians in a negative light. For while the US commander never fires first, never on his own men  and never on the Russians even when he would need to save his own ship, the Russians have no issue to shoot, execute and blow up their own men. It turns them in cardboard bad guys.I also think that it would also have been better if they had focused the conflict between the Russian destroyer and the US submarine. I recall the haunting scene in Das Boot. It could have been introduced as the latest in anti-submarine warfare at the start of the movie and be the reason why the Russian president was there. In that way you have a build up and a pay off. Now it just appears suddenly.The most problematic story element is however the motivation of the Russian bad-guy. There is no effort to give him a good reason, give him a good background and make him so we can understand him as a person.  It would have been easy to do, by having the Russian president be responsible for cut it the defense budget for instance. Stating that the Russian destroyer would be the last of its kind and all the other builds cancelled. The bad-guy then could have been given a personal stake in this. Maybe he fears that his country would become weak. Or maybe he has issue with the US submarine commander, or maybe he is an old buddy.  Just something that makes him into a person instead of a puppet.The biggest issues in this movie is that it doesn't concentrate on the central story and it fails to give us characters we can connect with. All in all what you get is a mediocre thriller. If you are really into submarines then I am sure you are better off watching Das Boot or The Hunt for Red October."
    },
    {
      "rating": "6",
      "text": "This movie starts out a bit broken and it try's like crazy to put something together for its audience.  And, it does!  About a quarter the way in, it develops into a fun-filled movie with lots of cool special effects and action!"
    },
    {
      "rating": "8",
      "text": "hasn’t been a great sub movie in a decade or more. this one was surprisingly entertaining and nail biting"
    },
    {
      "rating": "6",
      "text": "It was ok movie with good action even though a bit silly plot in general which seems too unrealistic. Especially how it pan out at the end.Maybe also action seemed like nothing special at times , nothing impressive. But it was ok movie"
    },
    {
      "rating": "4",
      "text": "This is a pretty bog standard action thriller film (which was sadly lacking in enough action scenes) set on a sub. I liked seing Linda Cardellini, who plays Jayne Norquist. She seemed to spend a fair bit of time on screen and yet I note that when I went to IMDB to check the cast list, her name didn't appear in the abridged/condensed cast list, which somehow disappointed me. I thought she was good in the film anyway.Another random observation/thought - Gerard Butler sounded remarkably like Keifer Sutherland. I kept wondering where Jack Bauer was hiding, as it sounded like him so much!. The film itself, plot wise, is a little slow and perhaps a bit meandering. There is a bit of a sense of tension but it wasn't a film that kept me constantly glued to the set. Its somewhat watchable and features some ok performances, its just not particularly memorable and certainly not engrossing, or so I felt. I suppose if I had to compare it to any other similar type of film, I'd maybe think of Under Siege, only this film is certainly slower. I wouldn't go out of your way to watch this film, so no, I wouldn't recommend it. It's also a bit cheesy."
    },
    {
      "rating": "7",
      "text": "A decent submarine themed movie. It's not great but not dreadful either. A reasonable script, although it's somewhat stretched. Performances from most actors are good. It's an enjoyable movie, but not an essential one to see."
    },
    {
      "rating": "8",
      "text": "Surprising! Had low expectations but thought the story was very good and that they did a good job with the screenplay and directing. Lead did a great job and less well known actors did well also. Nice part for Gary Oldman!"
    },
    {
      "rating": "9",
      "text": "Great movie! Amazing cast. Initially thought it would be some sort of cheap knockoff to Hunt for Red October, but had some good twists and was a very intense movie. Probably bombed at the box office due to the political narratives being jammed down our throats daily by the Legacy Media and I'm guessing most critics hated it because most of them are beholden to their money masters."
    }
  ]
}