{
  "id": 3579,
  "title": "Hunter x Hunter: The Last Mission",
  "starring": [
    "Megumi Han",
    "Ichiro Nagai"
  ],
  "runtime": 97,
  "genre": [
    "Adventure",
    "Animation",
    "Action",
    "Fantasy"
  ],
  "description": "Isaac Netero is the chairman of the Hunter Association. Decades ago he sealed away Jed, a Hunter who had mastered the use of On, the dark \"shadow\" of Nen. Now On users have reappeared at the Heaven's Arena \"Battle Olympia\" tournament. For Netero, this is the last mission: to protect the Association and the world from a threat driven by hatred and the thirst for revenge. And he's going to need all the help he can get in order to succeed.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qfjGtlrMynBlkcLgNeziDTmm1M4.jpg",
  "categories": {
    "plot": 4.5,
    "acting": 4.5,
    "ending": 0.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 0.5,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "(Mauro Lanari)The Hobbesian metaphor runs out almost immediately, the director abandons the anthropological cue as well as plausibility to commit himself with irrepressible dedication to the butchery."
    },
    {
      "rating": "0",
      "text": "Characters who do not seem to think. Indeed, not declaring to have found corpses to the police, to leave your child with a rather strange stranger, etc is beyond comprehension. This film tries to make us ask ourselves questions by bringing out many elements but in the end, by not answering anything, we end up with an indigestible mixture. A total waste of time in the end."
    },
    {
      "rating": "1",
      "text": "Concept of the movie is fine, however the writing of it is complete trash. I usually make fun of movies for having characters that do the dumbest of things and this movie took it like 3 steps further. Wouldn't recommend watching this unless you want to keep asking yourself why are they doing that, why are they doing this? Poor writting..."
    },
    {
      "rating": "8",
      "text": "From great atmospheric building, to amazing background score, with consistent and developing character traits, and twists and turns, this movie came out of nowhere and blew me away. Writer-Director, Shawn Lendin definitely deserves praise, and Camille Sullivan steals the show."
    }
  ]
}