{
  "id": 785,
  "title": "I Am All Girls",
  "starring": [
    "Erica Wessels",
    "Deon Lotz"
  ],
  "runtime": 107,
  "genre": [
    "Crime",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "description": "A special crimes investigator forms an unlikely bond with a serial killer to bring down a global child sex trafficking syndicate.",
  "releaseYear": "2021",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/voQLcqp0ehF3md93hMpELCRxTDv.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 5.0,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "4",
      "text": "A detective trying to crack a South African child-trafficking ring discovers that a vigilante killer is targeting the perpetrators. The subject matter certainly deserves serious treatment, but this effort’s underplayed pacing and sometimes confusing plot hinder the film’s impact. There are some expected tragic moments, but even those consist mainly of the victims looking pitiful. The secondary revenge aspect defies logic and adds little to the tension. A missed opportunity to make an impactful statement about the subject."
    },
    {
      "rating": "4",
      "text": "The only way to approach a topic like this without making it feel exploitative would be through a documentary, and it could still feel manipulative.I Am All Girls commits the sin of talking about the subject, but totally obscuring it to become an action film that prefers to use such an important issue as a background and motive for its protagonist, but only that.Idealism and corruption are tiresome because they are approached with a lightness that feels empty because most of the time they're exposed in the same way and will unfortunately bother its viewers for a while, but they will forget it in a few hours.Therefore, even the dedication to the victims at the end of the film feels crude and manipulative, because they're using their suffering as a method of entertainment."
    }
  ]
}