{"id": 3807, "title": "I Am Mother", "starring": ["Clara Rugaard", "Rose Byrne"], "runtime": 114, "genre": ["Science Fiction", "Thriller"], "description": "A teenage girl is raised underground by a robot \"Mother\", designed to repopulate the earth following an extinction event. But their unique bond is threatened when an inexplicable stranger arrives with alarming news.", "releaseYear": "2019", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/b3jWxwWRFqvNDJTvBcmKJVHnzKK.jpg", "categories": {"plot": 6.366666666666666, "acting": 6.966666666666667, "ending": 7.3076923076923075, "soundtrack": 7.0, "cinematography": 6.0, "familyFriendly": 6.0, "funny": 7.5, "action": 5.0}, "reviews": [{"rating": "3", "text": "The concept is interesting, the story is intriguing but the execution is beyond terrible. The main lead makes very questionable decisions given her lack of knowledge or understanding of the world around her and not taking into consideration her current position, history and upbringing, wasn't able to keep calm creating unnecessary suspense which put me utter disbelief, she gave too much away and too easily...... though this is probably attributed to poor writing/directorship than her acting ability. It's been hit or miss with Netflix Originals and this is just another film to add to the growing list of trashware on the platform."}, {"rating": "4", "text": "Definitely interesting, but ultimately a forgettable movie at best.  Swank's talents were almost completely wasted.  Meh."}, {"rating": "9", "text": "For those that rated it so low for its “focus on the technology” missed the point of the intelligent use of moral and ethical philosophy. This movie makes you question the limits of reason and logic as it’s applied to various consequentialist based moral theories. From Utilitarianism to touches of well placed Ethical egoism (not particularly of the Rand-ist variety) this movie asks very real questions of the humans alive today and potentially those of the future. As unlikely as it would be for this almost terminator environment to happen this movie still offers real, applicable, and significant questions to all who watch; these questions are indeed worthy of reflection. Well done to the cast, crew, and writers."}, {"rating": "4", "text": "I had high hopes that this might have been a Netflix original actually worth seeing for once but sadly the early promise turned to disappointment. It starts off well enough but soon required a suspension of disbelief that I for one couldn't manage."}, {"rating": "2", "text": "A long, plodding slog of derivative ideas presented better by a hundred other more interesting movies."}, {"rating": "5", "text": "I really wanted to like this but it just didn't carry my attention; my main problem with it being that it relies way too heavily on plot twists to propel the narrative coupled with a 'cool' idea but the film itself doesn't have much else going on. The characters are fairly one dimensional and it's too long in my opinion. If you have patience and like cool sci-fi ideas but aren't too fussy about execution give it a try but if you want something entertaining and gripping I would say skip it."}, {"rating": "6", "text": "This was interesting. Not the best, not the worst. Missing some plot line. Kind of unsure what the point of the droids were."}, {"rating": "7", "text": "Great scifi movie that manages tense moments, intermixed with a good mystery and heartwarming moments.Curiously, we have a practical effects robot that is a better character than several mainstream actors in certain high-budget movies. That is because the machine is superbly animated with great practical effects mixed with CGI and voiced by a great VA. GLaDOS would better watch out if this was a series.Both actresses were superbly cast and acted superbly, which was augmented by an excellent soundtrack and atmosphere, both within the facility and outside.The story follows the expected point of the genre, but manages to subvert them creatively while I felt the movie played satisfactorily with my expectations.If one small thing could be added, is that I thought that Mother's internal motivations and wishes could afford to be explored deeper. As evidenced by the machine wanting to touch the baby one last time by the end, it did have a form of what we call feelings. I would've liked to see, in some way, in what way did the second child fail and how did Mother express that to the child, as the movie has indicated that Mother saw  Daughter's performance as a form o evaluation of her own ability to teach and rear a child.In conclusion, it's the kind of movie that makes me happy I have a Netflix subscription.One final thing: I don't entirely understand what was Mother's plan with Daughter going out of the bunker with Woman or even what was Daughter supposed to learn from that. Most importantly, I'm not sure why Mother determined that Daughter was ready or why she couldn't keep helping. That part of the conflict felt contrived. The whole ending seemed a bit rushed or nonsensical to me."}, {"rating": "6", "text": "Plot/Story: 5/10 very little happening, with very little pay off at the end. Acting: 6/10 main lead did an alright job, with the supporting role doing okay as well. However nothing interesting or extraordinary.Cinematography/FX: 7/10 okay but nothing great. A few decent scenes, and interesting set design as well as graphics design for the set. Not much in terms of broad composition though.Overall, an okay movie that left me wanting more. Don't think they fully explored the secondary character enough to make sense of what happend. Didn't really have a pay off at the end that made sense. Fairly shallow at times, and long winded in terms of direction. 6/10"}, {"rating": "6", "text": "Its own environment and narrative end up playing against it when the twist of the story is revealed and the good tension and suspense that the film was building from the point in which Hilary Swank's character appears dissipates because the answers are not as satisfactory or rewarding as you would expect.It's nothing special but at least it's a more satisfying bet than many of the Sci-fi films that Netflix had been releasing recently.I mean, personally I think it deserves the opportunity."}, {"rating": "5", "text": "Θα ξεκινήσω το review μου λέγοντας, ότι η ταινία δεν με συγκλόνισε, δεν θα γίνει η αγαπημένη μου, ωστόσο βρήκα ενδιαφέρουσα την υπόθεση κι εκτιμώ ότι περνάει αρκετά μηνύματα, συνεπώς θα την πρότεινα."}, {"rating": "9", "text": "I do hope the ending is the opening to a second! Wonderful movie and recommend. It's a syfy thriller and leaves you on the edge of your seat."}, {"rating": "9", "text": "A great sci-fi story with a satisfying ending. Good acting and effects all round. Worth your time."}, {"rating": "5", "text": "An average sci-fi movie with a couple of good twists. Unfortunately the main character \"daughter\" is thoroughly unlikeable."}, {"rating": "4", "text": "(Mauro Lanari)Too long and with too many twists, the screenplay for \"I Am Mother\" was on the 2016 Black List and constantly alludes to Kubrick, Cameron, Scott senior but as an Alex Garland or a Duncan Jones, ie it is that low-budget sci-fi thematically and dramatically rich only if AI and cloning are not considered shallow issues, because otherwise, if one looks for the \"science fiction of the highest systems\" on mankind in comparison to a more or less nefarious cosmic destiny, better let it go."}, {"rating": "5", "text": "The movie has deeper religious connotations with clear anti-science and anti-abortion stance that I disagree with. Apart from that, it's an average sci fi thriller."}, {"rating": "7", "text": "Good Original Story-Telling. Good acting... I guess. Nothing to be crazy about. As good a Netflix Movie as you'll find in the sci-fi genre."}, {"rating": "10", "text": "An absolute unique, atmospheric, and chilling sci-fi robot film like no other. This movie takes a unique take on the tropes of the post-apocalypse and robots and makes it something genuinely special. The performances are excellent and Rose Byrne's performance as Mother is absolutely chilling and hauntingly beautiful. A great sci-fi movie with atmosphere, thrills, chills, and twists, and of course, robots!"}, {"rating": "8", "text": "Good movie. The story is nothing new but you get a couple of twist that make it interesting. The acting is excellent. The pace of the movie is slow but it's not a dull movie. The tension is well balanced. The FX are great. The ending is not entirely an happy one. I give it a 77%. This movie is smart with a good level of quality."}, {"rating": "8", "text": "Good acting, interesting twists, ending was interesting and not clear cut. Definitly worth watching."}, {"rating": "9", "text": "The film had a great plot & great acting. However, it seemed like they condensed the ending"}, {"rating": "9", "text": "Excellent dial up of technology, A.I, and human emotions. One of the best Netflix Sci-fi films this year!Visually and aesthetically gorgeous. Story of Droid and human co existence that keeps you interested for the entire duration."}, {"rating": "9", "text": "Another excellent Netflix sci-fi original movie. This low-budget Australian, sci-fi thriller has Alien, The Terminator and Space Odyssey: 2001 plus a few more movies all wrapped up in a study of human-machine relationships. The end of the movies leaves one with more questions than answers. Go watch it."}, {"rating": "4", "text": "A bit slow in areas, looks like it’s going somewhere ultimately goes nowhere"}, {"rating": "8", "text": "If you can overlook a few things that don't quite seem to make sense in the overall plot and logic, this is a gorgeous, eerie, well-acted sci-fi drama. The movie is well put together and Mother (which is human actor in a practical effect suit, not CGI) is incredibly believable throughout. There's enough twists and turns to keep the viewer engaged, although it does struggle a bit at times to explain things well enough to the point where some things just doesn't seem to fit. But it is by no means something that ruins the overall plot."}, {"rating": "8", "text": "An enjoyable and thought-provoking suspense film, with execellent performances from its small cast. Its superior production quality and design impressively overcome its indy-level budget."}, {"rating": "8", "text": "If you enjoy SyFy films then give this a go.  The best non spoiler review I read before watching this was to just make sure you pay attention as the answers you will seek are on display during the journey.  The film looks great and the acting is good.  You will be entertained."}, {"rating": "8", "text": "Surprisingly well done story about one possible future relationship between humans and AI. Full of nuance, and the plot holds together well, which are rare among science fiction films. Three cheers for Netflix!"}, {"rating": "10", "text": "I just love this movie. The acting and the visuals are amazing, and the fact it don't have man leads, specially on a sci-fi is a nice touch."}, {"rating": "9", "text": "It was enthralling. A great paean to what it means to be human. It keeps one guessing all the way to the end. I loved it."}, {"rating": "9", "text": "Not your usual cliche AI story. One of the many things that make the movie interesting is that there is no clear-drawn line between good and evil, protagonist and antagonist. Instead of robots trying to destroy humanity, Mother is trying to preserve it ... through questionable methods. The relationship is developed very well and you're torn between the two sides throughout, only to realize there were no such sides."}, {"rating": "8", "text": "I Am Mother is of the post-apocalyptic genre.  In this film, various philosophical issues and ethical dilemmas are presented.  If you discussed \"three men in a lifeboat\" in your freshman dorm room - you will probably like this story.Hilary Swank provides a very good performance.Clara Rugaard is well cast as Daughter.  She was 21 years old when she provided her performance - which I thought was too old - but, she comes off as a teenager and it worked very well.  Rugaard's acting provided a good balance a nativity and intelligence which made the role interesting.The film is well written.  I would very much recommend this film for individuals who enjoy science fiction films.An observation... in the first 8 minutes of the film, various statistics are printed on the screen to provide viewers with background information which assists in understanding the plot.  It has been suggested that the last 2 statistics perhaps give a little too much information - which in my estimation could perhaps not be the case."}, {"rating": "7", "text": "its fairly dark, creepy and slowpaced. The cast is doing a good job, especially \"Daughter\" who like me is form Denmark, and relatively unknown even in Denmark.The space vault reminds me off the ones in Fallout games.It might not be a classic, but still worth seeing."}, {"rating": "6", "text": "They whiffed the ending because like so many sci-fi films on Netflix, this story deserved a 6-8 hr mini-series treatment, the material was wasted in this one and done film. There are WAY too many unanswered backstory questions left dangling so this turns out to be a very unsatisfying story. However - as others have said similarly - there was so much potential that was just squandered at the end. It really started going off the rails when Hillary Swank's un-named character entered. None of that from that point on was neither well-motivated nor made cohesive sense. This really, really needs to be a mini-series, it's a wasted effort in this treatment. (originally posted on IMDB 10/13/19)"}, {"rating": "7", "text": "I liked it, didn’t love it. Story had holes. I love sci-fi and this grabbed my attention. I expected more acting from Hillary Swank. The holes in the plot threw me off . They could have done way more with this movie, someone needs to redo and re write this movie"}, {"rating": "10", "text": "This was excellent. Grant Sputore did a really impressive job directing this movie.  The robots moved really well, the photography was perfect.  Acting was flawless and the script was excellent.  I am constantly amazed how movies of this caliber are produced by people with no experience.  The photographer has a new Lovecraft movie coming with Nicolas Cage called Color Out of Space that looks good too."}, {"rating": "6", "text": "The premise was great but the final 15 mins or so it tried so hard to set up for a sequel so it didn't really finish with an uppercut. Swank's character was underdeveloped and the idea that the little girl could have any concept of reality or human interaction is just not consistent with human nature."}, {"rating": "6", "text": "I am mother has potential! It's just never utilized! It could be a spiritual successor to Terminator, but thankfully it isn't.From the start, the idea of a robot raising a human being can be debunked by the fact that every organism learns trough imitation. Humans learn to express emotions and non-verbal communication by watching their parents and people around them. Without that influence, a person will always severely lack behind in social skills.As for the plot of the movie, clearly they had a basic concept and never decided to enrich it. Questions that appear from the start (for example the fact that the girl is barely 18, yet the bunker has been online for 13.857 days = 37,8 years) could be answered within 20 minutes, but the writer decided to stretch them out over the entire movie. The result is that the movie feels empty of much substance and meaning, and is too slow to be sufficiently entertaining.The two actresses both don't offer much in the way of a memorable appearance. Hilary Swank mostly looks like she's tormented by the smell of faeces, and the girl has barely any personality. Either through a dominant parent robot or just being a **** the girl makes questionable decisions and creates more problems than neccessary.Then there's the moment that answers are revealed. To be honest, i saw it coming after just 15 minutes into the movie. It's so predictable, and even dissapointing when it's finally revealed.It's another average movie that is just okay enough to watch, yet too boring and uninspired to be memorable. I give it a 6/10."}, {"rating": "9", "text": "Kesinlikle izlenmesi gereken filmler arasında sonunu biraz daha iyi yapabilirlermiş"}, {"rating": "7", "text": "It is a good science fiction thriller. This movie keeps the viewer wondering what will happen next. It is a film about trust and with a lot of heart. Hillary Swank did a good job.7. 5"}, {"rating": "5", "text": "This is a slightly chilly feeling sci-fi film, a 'what if?' AI related/perhaps somewhat dystopian type watch, although I'm not sure I'd say everything is clearly especially bad at first but what with the looming sounding music/muzack in the background present from the start, there's an unshakable sense of tension provided. The ethics of the future having more emphasis on AI devices and technology in general to, at the very least, help bring up the younger generation, is certainly an interesting subject, one that has been covered by numerous other films. I suppose the core subjects/themes about how much we should trust AI is a little cliched but I still found it an intriguing watch and I wouldn't specifically class myself as a 'full blown' sci-fi fan, mainly as I prefer to watch films with a human element. For the most part, the only sci-fi films I particularly like are those that feature human characters (characters that are humans, not just beings acted by humans) and this film has quite a strong human element to it, which did appeal.I thought Hilary Swank gave a good performance, seeming really quite convincing as her character (only known as 'woman'), with quite pained facial expressions showing her emotions (concern/sadness etc.) very clearly. The rest of the cast do well in their roles too and I can't deny that I felt it was a bit chilling how Mothers voice (supplied by Rose Byrne) was so seemingly un-human, fake and yet the isolated human learns to bond with it.I can't say much more for fear of providing spoilers but I felt it was a reasonably spooky/chilly watch - not a horror film but a fairly thought provoking, decent sci-fi drama type film. It is pretty slow paced but I found it a fairly  engrossing watch regardless and I'd recommend it to others."}, {"rating": "9", "text": "This movie was awesome! This is a Netflix Original sci-fi film. It is in the “two or three people in an isolated environment with a robot and insidious stuff going on” subgenre of sci-fi. Other films in this subgenre include Ex Machina and Moon. I loved those movies, and I loved this too! In the future, some kind of apocalyptic disaster has taken place and one robot named Mother is tasked with growing and raising humans to repopulate the planet. The film follows Mother’s only child, Daughter, and her desire to know what lies beyond the walls of the facility she was born and raised in. It kind of sounds like a The Little Mermaid or Hotel Transylvania setup, but it gets really crazy from there. This film is very moody and atmospheric. It’s cold, claustrophobic and tense, but also cozy, warm and inviting. It makes you feel so many different things. The story is very engaging. The performances are all great except for Daughter’s child actor at the very beginning, and the effects are excellent! The CGI and sets look great, but the best part of this movie is Mother. She is not CGI. She is an animatronic suit. She’s awesome! She looks better than any of the robots out of the recent Star Wars movies! I’d say this movie is worth seeing for her alone, but the rest of the movie around her is so good that I think that would be doing the film a disservice. Honestly, there’s not much I can say about this movie without giving things away so I think I’ll just leave things there. If you want a solid and easily accessible sci-fi movie to watch, this is a good choice! Check it out!"}, {"rating": "10", "text": "Best SiFi film I've seen this century. Maybe we might have The AI but not the droids for the extinction event;0"}, {"rating": "8", "text": "La mayoría de las peliculas originales de Netflix suelen ser muy malas, pero esta fue una gran excepción; tiene una muy buena trama y excelentes actuaciones; una joya en el catálogo de Netflix."}, {"rating": "8", "text": "I am a sucker for these atmospheric, claustrophobic sci-fi movies and Sputore delivers in this fine debut."}, {"rating": "8", "text": "a very good film for such a low budget. wish there was more info about what happened before the world or maybe I forgot."}], "recommendations": ["what_happened_to_monday", "coherence", "captive_state", "arrival", "ex_machina", "signs", "cube", "annihilation", "the_fly", "chaos_walking", "valerian_and_the_city_of_a_thousand_planets", "sunshine", "midnight_special", "interstellar", "anon", "fantastic_beasts_the_crimes_of_grindelwald", "color_out_of_space", "colossal", "moon", "elysium", "oblivion", "nerve", "9", "lucy", "tenet"]}