{
  "id": 3276,
  "title": "I Am Sam",
  "starring": [
    "Sean Penn",
    "Michelle Pfeiffer"
  ],
  "runtime": 132,
  "genre": [
    "Drama"
  ],
  "description": "Sam, a neurodivergent man, has a daughter with a homeless woman who abandons them when they leave the hospital, leaving Sam to raise Lucy on his own. But as Lucy grows up, Sam's limitations as a parent start to become a problem and the authorities take her away. Sam convinces high-priced lawyer Rita to take his case pro bono and in turn teaches her the value of love and family.",
  "releaseYear": "2001",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wSgAn3zhgwuTOhhvvqcdxVqTLts.jpg",
  "categories": {
    "plot": 6.142857142857143,
    "acting": 7.214285714285714,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 1.3333333333333333,
    "familyFriendly": 6.0,
    "funny": 9.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "The relationship of daughter and father is greatly described.. Movie's plot is great And Sean's acting is also great.. Really enjoyed the movie... I don't know why critics don't like this movie.. Some also don't like Sean's acting.. I mean really??"
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\",\".\",\",\",\",\",\",\",\".\",\",\",\",\",\".\"."
    },
    {
      "rating": "8",
      "text": "It may be overly sweet, but it's still an engaging film with one of Sean Penn's greatest performances sealed within it."
    },
    {
      "rating": "4",
      "text": "I agree the movie was pretty cheesy and tacky for its taste but seriously, \"I am Sam\" doesn't deserve this much hate."
    },
    {
      "rating": "10",
      "text": "I truly loved it. what a great performance from penn as well as fanning's. A beautiful and lovely story with a great sense on values and the meaning of perseverance. Highly recommended. Metascore 28 doesn't give it credit"
    },
    {
      "rating": "10",
      "text": "Truly an amazing Masterpiece, a very deep yet touching movie, i don't always watch a Drama, but this one is Different, i highly recommend it ( it's a must ! )"
    },
    {
      "rating": "10",
      "text": "Why don't the critics like this? It was so realistic and wonderful. The critics are being bad at their job. >:l Yes watchers, pretty much all love this. This is EPICCCC"
    },
    {
      "rating": "7",
      "text": "Aw, now that was sweet. Fuc* you to all the stupid critics out there. Seriously? 28 metascore? Well, I doubt the metascore-judgment for all the movies out there. This film was full of emotions. “Sad, but true” like Metallica said. My eyes watered and heart was crushed, but that’s a part of the effects that great movies give you."
    },
    {
      "rating": "10",
      "text": "This is the best movie ever!"
    },
    {
      "rating": "9",
      "text": "A metascore of 28, must be a joke. i never thought my opinion would be so contrary to the critics. it was a beautiful movie and great casting. It is true what Chicago Sun-times wrote that every device of the movie is designed is to convince us Lucy must stay with Sam even though common sense makes it impossible to go the distance with the premise, but this doesn't make it a bad movie. I would recommend it to anybody who looks for a touching movie, which also makes you laugh sometimes."
    },
    {
      "rating": "0",
      "text": "\"You went full retard, man. Never go full retard. You don't buy that? Ask Sean Penn, 2001, \"I Am Sam.\" Remember? Went full retard, went home empty handed...\"\r Kirk Lazarus"
    },
    {
      "rating": "9",
      "text": "I don't understand why this movie received such terrible reviews from the critics, because it is one of the best film I have seen ever. Period. A film involving a true ethical dilemma. It hard not to get emotionally involved with the film. Sean Penn is amazing in the lead role, which if it had have been released a different it likely would have won him an Oscar (Penn lost the 2002 to Denzel Washington for his role in Training Day, which is hard to object). Michelle Pfeiffer was also great in her role as she develops more and more throughout the film. Sam is a character that is as lovable as any character could ever be. His meetings with his friends are great scenes to watch, they are very cute."
    },
    {
      "rating": "0",
      "text": "Erin Cochran ... directs this mess like a substitute teacher soldiering through a day's work for a day's pay. The camera shakes uncontrollably. [I am Sam] is ludicrous, manipulative and shamelessly over-sentimental."
    },
    {
      "rating": "5",
      "text": "I Am Sam was a movie with a touching and relaxing rythym, with good performances and story, although is slow and affects strongly the movie in the final moments of the movie, but it still entertraining."
    },
    {
      "rating": "0",
      "text": "Easily the funniest movie ever made. The trailer alone is priceless........."
    },
    {
      "rating": "2",
      "text": "claiming the title of being an actor..I Am SamI Am Sam is a plot driven family drama about a mentally handicapped father whose daughter is considered to be taken into a foster home. Armed with such potential and considerably explored by the filmmakers in many ways, it offers expectations with such huge cast. As much as honest and pathos its ideology is, the methods that it adapts to draw in the emotions out from the viewers is pure manipulation. The plot track wanders in without any whatsoever connection or logic and visits pointless places for more than two hours. As it ages on screen, there is neither sincerity, mannerism and maturity in script to breed any aspects of the feature appropriately. The screenplay is so naive and inedible that viewers cringe on seat as the makers attempt to attain a closure of their self-created destructive bubble. The primary reason why it doesn't work is its futile constant knack for drawing out a chuckle and its shallow script that it surfs through the entire feature. Penn's riveting performance is genuinely moving, to a point where it carries off the entire tale on merit and makes it worth surviving for the viewers. As much as brilliant Penn is, Pfeiffer couldn't be more distracted whilst Fanning shows some promising skills. The background score is pointless with immature camera work and daft and questionable cinematography. The screenwriter and director Nelson not only possess sloppy writing skills with incoherent forcibly imputed sequences but also lacks execution skills which is demoted by its confused camera work. Penn is the only high point of the feature as it elevates the momentum as much as he can. I Am Sam is Penn claiming the title of being an actor, and it aches to encounter such a talent go waste by on something so fatuous."
    },
    {
      "rating": "9",
      "text": "This is a sad, poignant and thought provoking watch. Seann Penn gives a great performance as the titular character. I imagine a film such as this will have brought a lot of controversy at the time it came out, due to the actor not having a related mental/emotional disability as portrayed in the film but I did feel the sensitive subject areas covered were treated with respect. I thought this was quite a memorable film, although it is a bit hard to watch at times, again due to the films themes. It also features a nice soundtrack, with most of the songs performed having been written by John Lennon and Paul McCartney and are sung by Sarah McLachlan, Sheryl Crow etc. This film is well worth a watch for the depiction of how vulnerable people are treated in modern American society and highlights compassion at times (which isn't to say everything goes perfectly, certainly not), if nothing else, so I would definitely recommend it, even though having some tissues to hand may be an idea if your prone to crying when watching emotional films!."
    },
    {
      "rating": "9",
      "text": "Sean Penn's portrayal in this movie is priceless... It moves you to the bone, although it can be uninteresting to see if you lack empathy. Nevertheless, Sean Penn's performance deserves to be seen."
    }
  ],
  "recommendations": [
    "a_beautiful_mind",
    "magnolia",
    "the_upside",
    "my_name_is_khan",
    "american_hustle",
    "the_professor_and_the_madman",
    "the_devil_all_the_time",
    "mystic_river",
    "scent_of_a_woman",
    "eternal_sunshine_of_the_spotless_mind",
    "revolutionary_road",
    "manchester_by_the_sea",
    "whiplash",
    "breakthrough",
    "blood_diamond",
    "marriage_story",
    "youth",
    "closer",
    "the_master",
    "vicky_cristina_barcelona",
    "changeling",
    "cinderella_man",
    "joy",
    "the_social_network",
    "the_shawshank_redemption"
  ]
}