{
  "id": 1112,
  "title": "I Am Legend",
  "starring": [
    "Will Smith",
    "Alice Braga"
  ],
  "runtime": 101,
  "genre": [
    "Drama",
    "Science Fiction",
    "Thriller"
  ],
  "description": "Robert Neville is a scientist who was unable to stop the spread of the terrible virus that was incurable and man-made. Immune, Neville is now the last human survivor in what is left of New York City and perhaps the world. For three years, Neville has faithfully sent out daily radio messages, desperate to find any other survivors who might be out there. But he is not alone.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iPDkaSdKk2jRLTM65UOEoKtsIZ8.jpg",
  "categories": {
    "plot": 5.8,
    "acting": 6.580645161290323,
    "ending": 6.636363636363637,
    "soundtrack": 4.5,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 6.222222222222222
  },
  "reviews": [
    {
      "rating": "9",
      "text": "This is a masterpiece, no matter what anyone else says. It's great to see that good horror/suspense/sci-fi movies do exist, considering the garbage most contemporary horror films dish out every few weeks. The movie wasn't quite clear on how (possible spoiler) the infected humans had super-strength and agility, but they couldn't be exposed to sunlight either, so I guess it balances (end spoiler). The only reason I'm giving it a 9 is because of the ending, which came way too quickly and made the whole movie seem too short. Having said that, a must see for everyone who loves Smith."
    },
    {
      "rating": "0",
      "text": "Terrible rip-off of 28 days later with 10 times the budget, but none of the atmosphere. The script is clunking, Will Smith has none of his usual charm and the CGI ruins it completely. There are some nonsensical bits of talking to shop dummies, which were unintentionally comical, but mostly this is just a dull re-hash of very tired post-world- destruction themes done without flare or imagination."
    },
    {
      "rating": "9",
      "text": "I Am Legend is what you get when you take the Zombie apocalypse but replace the Zombies with vampires, Will Smith makes a great performance in this movie, I wasn't sure what to expect with this movie but it turned out to be a emotionally moving, pulse quickening experience, and one of the best movie i've ever seen."
    },
    {
      "rating": "10",
      "text": "A very enjoyable film featuring a very stellar performance by Will Smith.  The story is very captivating even if a little too short for my liking.  As a fan of sci-fi titles, this one stands among some of the better, more refined.  I can easily recommend this movie to anyone, even those who do not care to much for the horror."
    },
    {
      "rating": "8",
      "text": "One of my favorite all time Will Smiths movies. I Am Legend just takes a lot of attention. Will get you hooked in in seconds. The sick are creepy and great. Will Smith just kills the role. Makes it look too realistic"
    },
    {
      "rating": "8",
      "text": "Good!scary at some moments usually jump scares and screenplay was nice acting was great music choice was awesome!ending felt little less conviencing to me i was expecting something else yet a good movie!"
    },
    {
      "rating": "6",
      "text": "Lotsa zombos try and eat the dude and then he has a dog that (spoiler) and the endalso Shrek is in it"
    },
    {
      "rating": "10",
      "text": "An interesting updating of the original novel. Will Smith shows that he can actually act. Sometimes when I make that statement people give a quizickle look, but, remember that most of the film is Smith acting on his own with a dog, and he holds the audiences interest. One of the few films that brings a tear to my eye during one certain scene. However, what the hell is up with the new ending? It sucks,and also makes the film title itself nonsensical."
    },
    {
      "rating": "7",
      "text": "I thought it was good for the most part. The biggest flaw of the movie was that it too far too long to get into. It was solid overall though, The acting was ok and Will Smith's performance did help carry the film during it's boring parts."
    },
    {
      "rating": "5",
      "text": "\"I Am Legend\", a horror movie starring Will Smith, could have become a better movie with the idea it pertains. However, all I saw was a monotonous movie where Will Smith was running away from infected zombie-like creatures with a unexplained horrific ending."
    },
    {
      "rating": "9",
      "text": "AWESOME FILM,LOVED IT-Smith turns in a terrific performance, TOUCHING ACTING, STUNNING visuals\rA GOOD ENTERTAINING FILM BY WILL SMITH!!!Just a great movie -it is my opinion - i really enjoyed it- and add to my favorite film gallery ."
    },
    {
      "rating": "5",
      "text": "There were good moments, strong scenes, but overall very incomplete and unfinished. Also boooooooooooring."
    },
    {
      "rating": "1",
      "text": "Will Smith is an especially popular actor who makes particularly bad movies. He is usually serviceable in his performance, but never any good. This film is a remake of the far more enigmatic and entertaining B-movie from the 1970s, Will Smith walks around abandoned Manhattan and tries to survive against heavily CGI vampires. There is no villain. There are no great action sequences. There aren't any great lines. It's actually boring. The only part of the movie that was somewhere good was the opening sequence where the US Military has to shoot down the Brooklyn Bridge to quarantine Manhattan because the plague is starting. But that part had nothing to do with the rest of the movie."
    },
    {
      "rating": "1",
      "text": "Worst movie I've seen this year. The quality of Smith's and Sandy's acting was made redundant in my opinion; there are so many holes in the plot it beggars belief. The zombies' depiction is mostly to blame for this because- [***SPOILER***] 1) They haven't the brains to appreciate Smith is trying to cure them, BUT they are able to capture him in an elaborate mannequin hoax/rope loop operation. 2) They are most enthusiastic in their efforts to devour Smith, but are miraculously overpowered by a small South American woman and her son when Will finally loses it and goes Kamikaze. 3) Despite having an insatiable appetite, they regularly overlook the option of eating each other. To be fair, as many friends have pointed out, most of the movies that would appear to have inspired I Am Legend adopt a similar policy of anti-cannibalism amongst zombie societies (28 Days Later, Omega Man), but I personally still view it as an inexplicable flaw. The movie progresses from predictably dull, usually unnecessary confrontations with the locals to nauseating dogmatic metaphor, which includes a cringe-inducing 'argument' between Smith and Anna, in which our hero rejects all hope and reiterates his own personal belief that God is in fact Bob Marley. This confuses Anna enormously since, as she's already tried to explain, she doesn't actually know who Bob Marley is. She goes on to wonder if he's any relation of Damian, thus destroying her own credibility, and any presumed didacticism intended by the movie. Positive points? Hard to find any. The setting was well thought out, New York did look fairly eerie, all overgrown and deserted like it was. The soundtrack was ok, I guess. And the actual concept itself is genius, in my opinion. Sure, its been done before, but I genuinely jumped everytime a zombie showed up; despite its predictability, it will get the heart rate up. They're loud, ugly and notoriously light-footed (when they want to be) and, as such, the debate over the quality of the special effects can be overlooked if necessary. The mediocrity of the movie however, can not. Horrible dialogue, awful plot and sickeningly sanctimonious. Give this one a miss."
    },
    {
      "rating": "2",
      "text": "This movie failed to keep my attention. Not only that the movie became very unrealistic. I watched this movie as it was rated as a vampire movie but it clearly was not."
    },
    {
      "rating": "3",
      "text": "A tremendous production design is just about its only virtue...surprisingly boring in spots."
    },
    {
      "rating": "0",
      "text": "Do yourself a favor and don't go see it. I wasted 100 minutes of my life watching Will Smith walking through his house, dating dummies, and driving his van around the city."
    },
    {
      "rating": "5",
      "text": "Not quite as intense as I thought it'd be. The storyline was pretty interesting, not quite as innovative, but not a snooze-fest either. Will Smith was actually really good, especially in a film that has only two other real characters, he demonstrated quite a lot of acting ability. On the other hand, the other 'supporting cast' aka the zombies, were quite disappointing. The visual effects were rather bad, and they looked too fake - digitised, however you want to call it. Just not quite as good as it could have been. Plus, overall, the film does not offer us anything new that any other zombie film before. Not the best of zombie films, but at least it will keep you entertained and watching. More than that one cannot expect, unfortunately."
    },
    {
      "rating": "5",
      "text": "well done and interpreted, a little bit pathetic, not that kind of movie you'd like to watch again (again and again neither). not that thrilling, not that romantic, not that reflexive as the makers probably meant it"
    },
    {
      "rating": "4",
      "text": "An awful film that seemed to confide in it's own pointlessness. Will Smith shows considerable acting talent, there is no mistaking that, it is the plot and setting that cause discomfort. The film, with all of it's suspense and horror, seems to work up to a specific climax, but this climax proves wholeheartedly unconvincing and unsatisfying. In other words: the movie is long-stretched, at some points boring, even, and bland."
    },
    {
      "rating": "5",
      "text": "A decent rework of the novel. The atmosphere was very sad and the creatures were generally pretty creepy. However, the supposedly intentional fright moments are plagued with jump scares, a technique I feel is lazy and over used, especially in modern horror films. Smith is okay. He's not bad, but he's okay. All in all, an adequate flick."
    },
    {
      "rating": "9",
      "text": "This is a riviting sci-fi apocalyptic that really gets your heart rate beating. There's just something about Will Smith's performance that really puts you on the edge of your seat. Even though he's \"technicaly\" the only one in this new world, he keeps you entertained with the fear of the so-called zombies. It has its dramatic scenes also which were just outstanding. By the way, Sam's death was to tragic. I mean seriously, who didn't cry when Robert had to put down his dog? I never thought a movie like this could not only amaze me with its suspense, but also tug on my heart strings at the same time. The only real problem is that this movie is kinda short. I really wish this movie was much longer. But other than that, it's an amazing apocolyptic thriller done better than any other apocolyptic movie."
    },
    {
      "rating": "2",
      "text": "I got to admit that the first part of the movie is pretty good, I like Smith´s performance and the script is well adapted, especially considering that it’s just ONE character during half the movie. But after Anna (Alice Braga) appears it all goes downhill from there, specifically the ending. It absolutely sucks, plus the ending (of the novel) is what makes the history so amazing. It ruins everything for me… I didn’t like the movie at all."
    },
    {
      "rating": "9",
      "text": "Virtually any movie Will Smith is starring in, the movie and his own performances is of A standard and this is not excluding I Am Legend. Robert Neville the main protagonist played by Will, is a scientist globally recognised, but not even he could contain the petrifying virus at has appeared to be unstoppable. The mystery behind his immunity is unidentified but what is clear is he's \"The last man on earth\". After a Cancer cure gone wrong it has transformed those injected with the so called vaccine into infected man eaters who have hunted down almost every human remaining. By the time the sun rises its safe due to the infected unable to appear under the sun for unknown reasons but once the sun begins to falls the \"zombies\" of more intelligences seen before hunt for any life form to eat. In the end it is up to Robert Neville to find the cure in an attempt to save the remaining world. A true classic and must watch for all Zombie fans."
    },
    {
      "rating": "3",
      "text": "I was not impressed with \"I Am Legend\". It is sad and a little boring. My family loves this movie, but Will Smith's role fell flat. Emotional people should not watch this."
    },
    {
      "rating": "9",
      "text": "If there was ever a reason for Will Smith to deserve an Oscar for his acting then \"I AM Legend\" is one of them. The film is, in my opinion a true tour-de-force for Smith who carries the movie in one of the best performances I've ever seen from him. The film is an interesting adaption to the book and does a good job keeping the audience interested and involved. My only gripe is that the later part of the movie could have been done better."
    },
    {
      "rating": "10",
      "text": "Brilliant flick! Will Smith's best performance to date. And love the dog!"
    },
    {
      "rating": "10",
      "text": "This is the third time the book I Am Legend has been adapted into a movie (the first being the Last Man on Earth starring Vincent Price and the second being the omega man starring charlton heston) and this one is probaly the best although not the truest to the book. However the ending still works, the scenes featuring empty streets and avenues of new york are breathtaking, superb acting from Will Smith and the dog - excellent portrayal of solitude and despair - and the CGI is pretty awesome. All these things make one awesome epic movie and another great adaption of the book. And to everyone who criticised this movie with untrue low scores, what could of made it better? It is an excellent movie but still, everyone should read the book. The book beats all adaptions, and I hate books and prefer movie adaptions. All in all a pretty tense, thrilling and ultimately excellent movie."
    },
    {
      "rating": "7",
      "text": "Despite the huge holes in the plot, moderate reliance on CGI, and the annoying detail of how the Ford vehicles are always washed and waxed in this post-apocolyptic world, this film is entertaining and a fun way to pass a couple hours. It's a zombie movie, with a mediocre study on loneliness. Don't expect much more than that and you'll have a great time."
    },
    {
      "rating": "8",
      "text": "The only CGI screw up that I saw was the out-of-place scene with the lions. The female lion appeared real, but the male lion looked extremely fake. So, with that settled, the movie was actually pretty well made. The loneliness and lack-of-human-contact psychosis exhibited by the main character was perhaps the most compelling part of this whole movie. It was unbearable to watch him lose his only living contact, the German shepherd. Like many reviewers have been saying, the ending of the movie was a bit rushed. They had a real masterpiece, then ventured off into mediocrity. I wonder if it is a function of the pressure to churn movies out as quickly as possible by the studios. It seems like no one wants to put time into making the next Titanic. One last gripe about this movie. Why did the woman at the end have to be so attractive? It's so formulaic. A good movie with a good premise doesn't need a Brazilian cutie to finish it off. Thank God they spared us from a superfluous make-out session with the main character. I thought that it was coming though."
    },
    {
      "rating": "1",
      "text": "Don't waste your time... In what could have been the greatest movie of this generation... Hollywood and it's money hungry studios ruined it! The absolute, by far, worst CG in a movie since Jumangi. there is nothing more fake than those rabid dogs! This movie was a joke! Will Smith's performance was laughable and deplorable. Although, Sam the dog should win an oscar. That was the greastest dog performance since Lassie."
    },
    {
      "rating": "10",
      "text": "I don't know what you all were smoking, its as if you have to have everything spelled out for you. To the guy who asked about electricity, did you not see the generator? I loved this movie, contender for 2007 film of the year."
    },
    {
      "rating": "10",
      "text": "Was a fantastic film with great acting. yes the monsters could have been alot better with the use of actual humans, but i thought they did an excellent job"
    },
    {
      "rating": "6",
      "text": "I Am Legend is a decent movie. Will Smith gives an excellent performance as Robert Neville in keeping with the theme of the original novel. The final scene in the video store where he begs the manequin to speak to him is brilliant. The story differs quite significantly from Matheson's novel, but this is acceptable due to the fact that much of the original story takes place within the feelings of the central character and wouldn't have translated well to a movie. The regime of excersize, hunting and isolation in the over-grown NYC is very nice indeed - probably the nicest treatment of this subject matter produced to date - even better than 28 days later. Unfortunately, that's where the praise for the film ends, as it comes with two significant problems. The first is \"The Infected\". In Matheson's novel, even though the vampires (as they are in the original book) are monsters, motivated by killing the uninfected, they can still reason and eventually develop into a society. In the film, they're nothing more than emaciated humans, similar to the creature from \"The Mummy\", which neatly dove-tails into the second, and biggest thing going against this movie - the CGI. This is supposed to be a very creepy, unnerving story about a man surrounded by enemies with no way to escape. Blood thirsty monsters who show the ability to reason and to solve problems. Due to the \"Mummy-esque\" CG, this illusion is totally shattered. The monsters look like something from a second-rate video game and aren't scary, ever. This is a waste of potential on every level - every time the monsters turned their heads around and did their completely inhuman, unbelievable \"roar\", my heart sunk. CG can be much better than this, Golem from LOTR being a prime example. If only they'd spent the money they should on making the effects work within the movie, this would have been a 9/10. Note should have been taken from Robert Carlyle's stunning performance in 28 weeks later to show how these monsters should have acted (and they *are* different stories using similar worlds, so comparisons would have been fine here) instead of the low budget, hammy, unscary puppets that were used instead. The central enemy (perhaps a tribute to Ben Cortman from the novel) was particularly bad, attempting to create personality from something which was just laughable. A dreadful shame considering how good the rest of the film was - even the performance of Samantha the dog was outstanding."
    },
    {
      "rating": "10",
      "text": "Well done from start to finish. Not really sure what people were looking for in the ending. I left the theatre thinking, \"that was a solid ending,\" yet people are ripping it apart. Confused about that, but overall it was one of the best films of the year for me. It had it's chance to be a typical, feel good story, but it deviated from that and I found the writing to be outstanding. I'm convinced that some people are just haters and had their negative views written down before the movie began. Oh well, if you like movies, go see this."
    },
    {
      "rating": "4",
      "text": "Deeply flawed after the first hour. Really a shame because the movie had enormous potential. Once gets a sense the folks making the movie had no idea what kind of story to tell. The CGI animations are surprisingly bad -- what the heck happened there?"
    },
    {
      "rating": "10",
      "text": "Easily one of the best movies of 2007. The special effects are great, the story is great, the acting by Will Smith is some of the best he's ever delivered and this movie is just generally a thrill ride from start to finish. I also thought the ending was very suitable and cant imagine why it was prone to such criticism when it suited the story so well."
    },
    {
      "rating": "1",
      "text": "Wow, I wasn't expecting too much and it was even worse than I thought. Every 10 minutes something happens in the script that just baffles me. Pure Hollywood trash and Will Smith is just playing himself again. barf."
    },
    {
      "rating": "4",
      "text": "Fairly entertaining...but very reminiscent of 28 DAYS LATER. Kind of scary with all the zombies hiding in the dark, but the film has quite a few loose ends. HOW did the infection start? The movie starts out with the announcement that there is a cure for cancer, and then suddenly most of the world is dead? How and why is the protagonist immune to the virus? What happened to his wife and kid? And WHY are there lions and deer running wild around New York City? And why aren't they infected? Shouldn't they be ZOMBIE lions? Weird movie. Kind of pointless, in my opinion."
    },
    {
      "rating": "4",
      "text": "Ok, the movie is exciting in parts and the scenes of desolation do more than Will smith could in ten movies to evoke a world emptied. But the book has been butchered folks. This is NOT how the book is! I know screenwriters need to take liberties and \"adapt\" books to screenplays, but they have really gone to town on this. Other parts that really bring the movie down are developed scenes that go nowhere. The nightstalkers are meant to be dumb ravenous animals at a bestial level, or are they... After watching the movie i still don't know, i know what happened in the book. And it wasn't a farcical game of \"chase the black man whilst roaring, then set up elaborate traps in their spare time\" Overall I'm really disappointed that they didn't incorporate the main twist that was in the book. Read the book , avoid the movie."
    },
    {
      "rating": "8",
      "text": "This film is really good but when compared to the book (which is a masterpiece) you notice the changes a lot. In the book he's alone most of the time as he doesn't even have a dog. The vamps are a lot more human in book. Also if you call this a rip-off of other films it's more or less impossible because it's based on a book. (It's by richard matheson - GET IT!)."
    },
    {
      "rating": "6",
      "text": "Most people rate movies before they come out for fun, I have seen 10's, 9's, and whatever else, and all they say is \"I loved it, the best movie of the year!\" Those kinds of people judge the movie on its trailer, and to settle the reviews. Well I'm telling you one thing, those people better start getting on track because I'm not rating the movie just because, I'm rating it because I saw it. I Am legend, a legendary great movie to end off the year, with its other side by track films: national Treasure: book of secrets, The Golden Compass. I have to say this movie is good, a lot better than most horror movies, it is action-packed, really fun, visually stunning, but I caught up with so many bruises on in this movie quality. It has a complex plot, it winds up with an intense beginning, and leaps into the future with - not dull - but difficult follow through, it rushed itself so that the audience wouldn't be bored with loud and noisy fun. I sure wasn't embarrassed during the show, no on else was, I was quite entertained. Although I was lost at most times, and the aliens were bizarre and torn together to settle the plot down and confuse you with a whole new race existence that mixes your brain through pointless development that made the movie slightly disappointing. But truly it was all right, nothing spectacular, your only in their for about 95 minutes, and I saw it in the IMAX so, this movie isn't that bad of a holiday fulfillment, but it will never be forgettable how wonderful this experience sure was."
    },
    {
      "rating": "7",
      "text": "I am Legend is an exciting movie. Its glimpse on the future is amazing. Although it is horror/suspense they manage to create humor. Excellent for people who like all sorts of movies, especially scary movies."
    },
    {
      "rating": "9",
      "text": "I thought the movie was very well done. Will gave a wonderful performance as Robert Neville."
    },
    {
      "rating": "9",
      "text": "Not really like the book, but good in its own right. Will Smith was pretty believable and the action was heart pounding."
    },
    {
      "rating": "7",
      "text": "Smith is a really great actor.The first hour of the movie was very attractive.But middle part was not so good.Ending was really powerful.So i think 7 is the best score."
    },
    {
      "rating": "7",
      "text": "Will Smith saves the world (again) and saves this movie with a surprisingly strong performance. Based on the same short story as Charlton Heston's \"The Omega Man\", Will plays a scientist trying to find a vaccine to cure a virus that turns humans into mindless zombies. He does a great job with a weak script, and despite his acting and some terrific special effects, the movie falls apart eventually. An above average 7 out of 10."
    },
    {
      "rating": "7",
      "text": "Gee, \"OMEGA MAN\" re-visited 36 years later. Much more competent lead actor, CGI that was not available in 1971, and much more imiginative make-up than was available then as well! Worth a matinee ticket."
    },
    {
      "rating": "6",
      "text": "I enjoyed about two-thirds of this movie, right up until the piss-poor CG started ruining the show. That was a job for actors in makeup, with a conservative application of top-quality CG to add highlights. The ending also made me want to stab whoever wrote the screenplay in both eyes - they don't deserve to see any movie ever again! It was handled so poorly, it reminded me of _BAD_ B-movie endings - bad as in \"I'm going to record Geraldo over this tape\". Good things about the movie: it's gorgeous (except for the CG). It has moments of amazingly high tension in its minimalism. Will Smith is still Will Smith, but he fits the role surprisingly well, his lack of emotion actually works in this scenario. The pace was good, the few long droning moments seemed purposeful in adding to the teeth-grinding tension and gloom. The storyline itself held much potential but it could have been better explored with a few more minutes of screen time. This movie wasn't bad at all, but I can't help feeling it could have been so much better!"
    },
    {
      "rating": "10",
      "text": "It's one of the best short story movies I've ever saw. I recommend it to everyone who's big fan of short stories."
    }
  ]
}