{"id": 2293, "title": "I Can Only Imagine", "starring": ["J. Michael Finley", "Dennis Quaid"], "runtime": 110, "genre": ["Music", "Drama"], "description": "10-year-old Bart Millard lives with his mother and abusive father Arthur in Texas. One day his mother drops him off at a Christian camp where he meets Shannon. Upon his return from camp, Bart finds his mother has left and movers are removing her belongings. He angrily confronts his father, who denies that his abusiveness was the reason she left. Years later, in high school, Bart and Shannon are dating. Bart plays football to please his father but is injured, breaking both ankles and ending his career. The only elective with openings is music class, so he reluctantly signs up.", "releaseYear": "2018", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/veZszwMZu8d3WMU6TJX9sV5w1Y4.jpg", "categories": {"plot": 9.166666666666666, "acting": 9.181818181818182, "ending": 8.6, "soundtrack": 8.5, "cinematography": 10.0, "familyFriendly": 8.0, "funny": 7.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "This a well done move that is enjoyable with fine acting.  It deserves a much better rating than the professional critics gave it.  It is a step forward in the genre coming from Christian movie companies."}, {"rating": "10", "text": "Great Christian movie with some truly stellar performances. Dennis Quaid really clinches it with a phenomenal performance in an emotional role."}, {"rating": "10", "text": "A wonderful movie with a wonderful message of hope, perseverance, and redemption.  Smug, anti-Christian (sorry,  just a fact) Hollywood critics HATE the film, thus you know it's a delight.  From start to finish, the acting, storyline, and cinematography are excellent.  This is what filmmaking should strive to be."}, {"rating": "10", "text": "Emotionally stunning and competent visually, this film is 10/10 material, and a breath of fresh air in a market saturated with terrible Christian films....I'm not going to discuss my religious beliefs, or nitpick how true to life the film was, because it makes absolutely no difference: you should see this film regardless. I can only Imagine is a recounting of the origin of the song by the same name. The story tackles an abusive father destroying his family with honesty and integrity. At no point is the audience told they should think a certain way about the situation; the film presents things as they are, and lets the viewer decide. I don't think I'm spoiling anything, (since the previews spoiled it,) but we obviously know the son will ultimately forgive his father going in. However, when and how that will occur is expertly handled, and keeps you on the edge of your seat the entire time. When the moment does come, it is an emotional climax of a film full of heavy emotions. (Less stoic viewers would be wise to bring a box of tissues.)...The Christian value of forgiveness is at the heart of the film. Without referencing ANY scripture, the film is like modern retelling of the Joseph story from Genesis, who was of course sold into slavery by his own brothers. At no point does the writer make light of how evil a thing his brothers had done, but when they reunite, Joseph realizes his brothers had changed for the better, and ultimately forgives them because \"What you meant for evil, God used for good.\" In the same way, this film makes no excuses for the father's abusive behavior, and it's up to the viewer to decide if they can forgive him. We also see the consequences of choosing to forgive, that forgiveness in this case helped the victim as much as the abuser. It's a great message regardless of what you believe....Maybe you didn't notice this parallel at first, but I'll bet your brain did, and that's why this film is brilliant. Even though it could easily have \"preached to the choir\", quoting scripture ad nauseam, instead it shows why those stories are still relevant with a modern example. I could go on, but you get it by now, the story is great....The film is beautifully acted and shot. Dennis Quaid and J. Michael Finley do a stellar job at selling you completely on this world. The film has a lot of scenes shot as if the lighting were coming from heaven itself. The implication is clear, but again, the audience is never told what it should believe. Finally, the film is quite family friendly. There are distressing scenes depicting mild abuse, but the heavier things are either revealed through exposition or are implied rather than shown, (for example, the sound of the father beating his wife coming into the son's room.) I absolutely recommend you see this film if you are at all interested in Christian films."}, {"rating": "10", "text": "This is an inspirational movie! It is kind of disjointed in the telling but it is wonderful and true to Bart's life."}, {"rating": "8", "text": "Solid acting, good story. Holds your attention. Minor levels of violence, could easily have been rated 'R' if the producers showed all, but they consciously avoided that rating.  Funny at times, tear-jerking at others.  A bit choppy at times; it is hard to cram 20 years of life into a less-than two hour long film. Not overbearing in faith elements, but this is a true story about the real life journey of two men towards reconciliation and redemption.  It will touch anyone who has been through similar circumstances.  I highly recommend seeing it."}, {"rating": "10", "text": "I thought the movie was fantastic.  It is a perfect movie of hope for everyone.  I loved the writing, acting and cinematography.  I read Bart Millard's book and the movie does a great job getting all his life events into a 2 hour movie.  I am telling all my friends to see the movie."}, {"rating": "10", "text": "Excellent movie. Entertaining and good story. Ignore the \"critics\" on this one. Many people agree that this movie rocks. Great date night movie. 10 stars."}, {"rating": "9", "text": "A solid film, not merely a \"faith film\" that does not get preachy, and shows a surprise or two without going too much into the \"Christian Movie\" formula, a fact that works greatly in its favor.  A crossover musical hit that is now getting it's own equally deserving crossover film.  There is a reason why it surprised people opening weekend."}, {"rating": "8", "text": "Based on the life story of Bart Millard, the lead singer/songwriter of the Christian band MercyMe, this film is an inspiring journey of redemption, hope, and forgiveness. Unlike many Christian films, this is not overly preachy and the acting is good.Bart's traumatic and abusive childhood, the story of how MercyMe started, and what led him to write the hit song 'I Can Only Imagine' will touch your heart, move you to tears and have you singing out loud. Take your family to see this movie, it's not Oscar worthy but it's a good one, In My Humble Opinion!"}, {"rating": "9", "text": "I really enjoyed this movie...it was one of the better movies I have seen lately!  I am a Christian, and a proud Christian!  This movie is definitely worth seeing:)  It was so nice going to a movie that did not have to use bad language and sex to sell it.   Ignore the \"bad\" reviews...look and see what movies they endorse and realize that this movie is for those who have Christ in their life or are seeking to have Christ in their life, and those who need hope in their life."}, {"rating": "10", "text": "I didn't know anything about this film when I went with my friend.  What a nice surprise.  I really enjoyed the film. I thought Dennis Quaid did a fantastic job.  He should be nominated for Best Supporting Actor!"}, {"rating": "10", "text": "Why are non believer always so rude and obnoxious? If you didn't go see the movie then why post....because you're a hater. GO away and stop hating. Maybe one day you will see the Light!"}, {"rating": "10", "text": "This movie is touching and inspiring. All should see and see how God saves. Must see."}, {"rating": "7", "text": "\"I Can Only Imagine\" was the soundtrack to my brother and me becoming best friends.  One of my close friends passed away when I was 16.  Four years later, when my brother was 16, his very best friend passed away.  I invited him to my college dorm room.  We labored over a tribute video to his best friend—the song: \"I Can Only Imagine.\"I may be too emotionally tied-up into this record to be objective.  The film?  It was well-acted and touching.  I was a crying mess for the duration.Was it an objectively good film?  That's, oddly, subjective.But, to me, it meant the world."}, {"rating": "10", "text": "Great film. Best faith-based film since the Passion of Christ.  I felt all emotions during the film.  In the end it gave a message of hope."}, {"rating": "9", "text": "This is a perfect example why I don't pay attention to critic's reviews. If anyone has suffered childhood abuse this movie will be enormously emotional & gut-wrenching. Came very close to scoring a 10 but I'm a tough scorer. Once again ignore the negative reviews dragging down the average score. Some people just can't be fair to a movie of spiritual content. Excellent is my description comparable to Mr. Holland's Opus"}, {"rating": "10", "text": "Christian movies sadly are usually a disappointment but this one is not!  Not a film full of action, etc, etc, etc - just a true story about a family & of God's grace.The story is based upon the life of Bart Millard of the band Mercy Me, and his '90's #1 breakout song, 'I Can Only Imagine.' Bart was raised by an abusive father and fell into singing originally because of a football injury.  As soon as he could, to get away from his father, he hit the road, joined a band and through various experiences wrote the most amazing song.  There was always an uncompleted piece of his life and forgiveness & healing were an integral part of Barts story.  Dennis Quaid is great playing Barts father, he is a man you sure can dislike!  Troy Akins plays the band manager, also good in his role.  Learned a special classy thing about Amy Grant through this journey, very cool.Started a little slowly but one it clicked, it clicked - emotional for sure!  Some great scenery, music and sharing of a life story.Have heard a few interviews in the past with Bart both about this film & about life/music in general - great guy!  Go to youtube & check out:  'Even If' or 'Dear Younger Me' - what a great lyricist!"}, {"rating": "8", "text": "A lovely film that brings home the healing powers of faith. Please do not fall for the atheist diatribes against anything that remotely approaches Christianity - this is a solidly well acted movie that all but the close minded will enjoy."}, {"rating": "7", "text": "About as safe and inoffensive as you can get. A little humor and a lot of heart. Even the religious nature of the film isn't all that in your face. The references to God and spirituality take a back seat to the uplifting tale of facing past traumas and mending broken relationships. It even marks another step up in terms of production quality for faith-based films.It's biggest issue is simply the familiarity of the premise. It doesn't stray too far from what one would expect from these kind of heartwarming biographical dramas. It's depictions of things like the main character's suffering and eventual healing are all very formulaic. It's sweet, but maybe just a little manipulative.J. Michael Finley really impresses in his first starring role. He's got great comedic timing and is very charismatic. His voice is that of a slightly southern Chris Pratt. An all around likable presence and a key reason for the movie's genuine goodness.7.5/10"}, {"rating": "9", "text": "Loved it. At no moment did I cringe or was bored. Great film making, acting and story!"}, {"rating": "1", "text": "Lets say you just painted your bedroom and have a choice of what to do next. You can go see this movie or stay home and watch the paint dry. Staying home will be the more entertaining option."}, {"rating": "0", "text": "Another by the numbers, horrible Christian ego film that serves one purpose: To confirm to christians in their mind that they have the right religion"}, {"rating": "6", "text": "Innocent and drained at some points, but the excitement and the beautiful story make some atheists convince themselves at the end of this story. Tears are torn, but even so, your mistakes are remarkable. 6.8/10"}, {"rating": "10", "text": "An absolutely amazing film that everyone needs to see. It's well acted, beautifully filmed, and tells a meaningful story, which is something few modern films can lay claim to."}, {"rating": "7", "text": "I Can Only Imagine (75/100)Worship Score(25/25) There was a lady down front with her hands up during the finale! I don’t blame her!Song Score(20/20) This lyric certainly taps into a core truth.Field of Dreams/The Rookie/Lost–>Found Dad Score(10/10) Dennis Quaid finds himself on both ends of this doesn’t he?Forgiveness Score(10/10)Teenage Actor Score(0/5) Why is a 30-something actor playing a high school student?Abuse Score(10/30) This is a key element in the plot but you’ve got to devote more than 2 paragraphs of recollection and some off-screen implications to establish the breach between Bart and his dad. Quaid does a great job of playing a monster(and of struggling to ask for forgiveness) but the script writer(s) need to help him out more."}, {"rating": "8", "text": "When the Hollywood critics rip a faith-based film, I consider that a plus.Does this movie deliver a real life message with reasonably believable acting and characters. The answer is a resounding yes. For whatever reason, if a movie doesn't follow some pre-conceived Hollywood notion of how it's done, it fails. Not so as I Can Only Imagine tells the story well enough. If you feel emotionless during this, I feel sorry for you."}, {"rating": "10", "text": "I cried through the whole movie. If you want to watch a real movie with a real-life story this is it. Great family movie."}, {"rating": "10", "text": "They Can Give A Bad Review All They Want. Because This Story Was A Very Emotional, And Bonding Father & Son."}, {"rating": "10", "text": "This movie conveys a deep storyline which is well dramatised and well produced. The fact that it’s based on a true story adds to its impact. Best to have some tissues with you when watching this but well worth the watch as it has a particularly great ending that is feel good."}, {"rating": "10", "text": "A faith-based production that nails the beauty of the genre through its wonderful story and message that live up to its name."}, {"rating": "7", "text": "Una historia real que es conmovedora; tiene buenas interpretaciones y buena música."}], "recommendations": ["heaven_is_for_real", "breakthrough", "i_still_believe", "me_before_you", "manchester_by_the_sea", "collateral_beauty", "overcomer", "miracles_from_heaven", "hotel_rwanda", "brokeback_mountain", "risen", "revolutionary_road", "my_name_is_khan", "the_fault_in_our_stars", "captain_fantastic", "her", "courageous", "3_idiots", "hereafter", "the_giver", "the_book_of_henry", "blue_valentine", "the_book_thief", "the_blind_side", "all_the_bright_places"]}