{
  "id": 1157,
  "title": "I Care a Lot",
  "starring": [
    "Rosamund Pike",
    "Peter Dinklage"
  ],
  "runtime": 119,
  "genre": [
    "Comedy",
    "Crime",
    "Thriller",
    "Drama"
  ],
  "description": "A court-appointed legal guardian defrauds her older clients and traps them under her care. But her latest mark comes with some unexpected baggage.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gKnhEsjNefpKnUdAkn7INzIFLSu.jpg",
  "categories": {
    "plot": 0.5882352941176471,
    "acting": 1.0833333333333333,
    "ending": 0.5,
    "soundtrack": 0.0,
    "cinematography": 5.0,
    "familyFriendly": 0.0,
    "funny": 5.0,
    "action": 1.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "I Care a Lot...for Dianne Wiest freedom. There's not a single likable character in this whole movie for me to latch onto. So, at the end I didn't care...hehe. I also found the message of the movie confusing, because it has that empowering feel to it, like a \"girl boss moment!\", even though they are either doing awful things and how none of it was earned, which rubbed me the wrong way. It sends out the wrong message that doing terrible things or destroying other people’s lives (not just the bad guys) is OK, I guess.It also doesn't help this was written by a dude named J Blakeson, a dreadful screenwriter who's previous writing credit was the unnecessary sequel to 'The Descent'. So yeah, this wasn't in good hands at the start.This is honestly the most annoying movie experience I've had in a while. So shallow and empty.Just watch 'Promising Young Woman' instead."
    },
    {
      "rating": "2",
      "text": "More Dianne Wiest please. Her character and acting was the highlight in this otherwise Hollywood cliche trash. Does Hollywood really believe we, the audience, cheers for predatory and exploitative characters who “have a dream?”Back to Dianne - one of the best, most underrated actor of our times."
    },
    {
      "rating": "0",
      "text": "All I have to say is wow. Why are pieces of **** who scam old people, **** ass Karen’s.. being portrayed as **** Scarface? I literally wasted 2 hours of my **** life on this bull****. The director, actors, everyone involved in the creation of this piece of **** need to retire. This movie only appeals to white Karen’s lol"
    },
    {
      "rating": "0",
      "text": "The Karen movie. If you're a mid age woman who likes to talk with managers go ahead and watch this.If not, please don't waste your time, go watch Sophia Loren's movie."
    },
    {
      "rating": "0",
      "text": "Plotholes galore in this craptastic movie.  Judge is an idiot (OK, maybe this is accurate) - mob is incompetent - men are badsy people (and stupid and weak, by the way) - and heavily armed guards at old folks homes are all the rage - WTH?????The entire \"girl power\" vibe this movie was giving off really makes you feel sorry for - well - women.  How weak do you hvae to be that somebody had to craft a piece of garbage such as this to \"empower\" them.And the whole lesbian thing has just so been done.  Get over yourselves already - no one gives a crap."
    },
    {
      "rating": "0",
      "text": "I promise I'm not review-bombing this. I watched it because my spouse wanted to watch it. It's just dumb. It ultimately turns into a \"which sh*tbag can outsmart the other\" with little thought to why I should even care. I don't mind entertainment with dislikeable characters, like Breaking Bad, when motivations, actions, and sequences are believable. This is not. Pike and Dinklage can both act, but I don't know how they delivered half of their lines without laughing. Suspension of all belief is a must in almost every scene.I can watch many things that suspend reality, but if the core premise of your movie falls apart at scrutiny, most sequences become impotent. It's like a horror movie where they can easily escape the monster, but choose not to leave. Okay, I can get on board with that if there is at least a semi-good reason (Jaws) but this film is only filmed with reasons to not watch it.Oh, and while they may have been trying to empower women, it just kind of makes women (and lesbians) look like terrible people. Kind of like Hollywood's history of typecasting villains with gay undertones (look it up). Personally I think we're in a \"streaming gold rush\" right now and they're all competing for content. We now have exhaustive lists, but the quality has been sharply dropping. This garbage is a perfect example."
    },
    {
      "rating": "0",
      "text": "Theres little to say that hasn't been said already by 238 reviewers. However hard the director tried, it's pretty difficult to root for elderly abuse."
    },
    {
      "rating": "0",
      "text": "I actually felt bad after watching the movie. I had a distaste. I'm not sure what the moral is. I mean, was this film produced to \"empower\" women or what? Because I see no other point in the film. It had a good start, but I regret watching it. The ending was really cheap."
    },
    {
      "rating": "0",
      "text": "Such an terrible movie, the premise that i should applaud a sociopath that take advantage of elderly people is totally awful, though the movie i was hoping that these... Ladies... Will get what they diserved. Such a disappointment..."
    },
    {
      "rating": "0",
      "text": "I have watched the first half of the movie and I was thrilled to finish it awaiting justice for the victims and retaliation. Unfortunately since the very moment both girls were caught and miraculously survived their executions, writing was extremely disappointing. Last 30-40 minutes of the movie is a joke, writers are mocking the audience and even the street execution of the protagonist at the very end changes nothing. Huge disappointement."
    },
    {
      "rating": "0",
      "text": "The script is a huge \"wtf\", extremely illogical and disappointing, and it's a netflix production, seriously???I'm so mad, fortunately I didn't waste a movie ticket on it"
    },
    {
      "rating": "0",
      "text": "Péssimo, sem nexo e com roteiro beirando o absurdo. É como se o unico objetivo do filme fosse uma militância feminina sem propósito."
    },
    {
      "rating": "0",
      "text": "Best thing is that the \"baddie\" gets shot in the end... The way there is just horrible and full of plot holes."
    },
    {
      "rating": "0",
      "text": "One of the worst uninspired and pretentious movie i have seen. Such bad screenwriting. Awful music and awful plot."
    },
    {
      "rating": "0",
      "text": "Compõe a lista dos piores filmes que já assisti na vida. Acredito que quem escreveu deve ter se esforçado para fazer algo muito ruim e conseguiu."
    },
    {
      "rating": "0",
      "text": "RubbishNasty, praising criminalsKill herThe producers should be in prison"
    },
    {
      "rating": "0",
      "text": "Worst movie i’ve ever seen don’t waste your time. They try to justify an awful character being an awful human-being by her being lesbian... I bet people sympathize with her somehow too. First time I rooted for the Russian mob to kill the main character. Terrible terrible movie"
    },
    {
      "rating": "0",
      "text": "**** show. Boring pretentious script. ****ty music. Stunted acting. Dislikable characters. You just want pike's character to die faster. You learn not to care about 'i care a lot'. ****ty amateurish title top."
    },
    {
      "rating": "0",
      "text": "please watch music by sia instead of this crap, music its the best movie of this century"
    },
    {
      "rating": "0",
      "text": "Such a disappointing movie. I real time waster. In the middle you get so sick and tired of that nonsense happening that you just lose interest completely. Total disaster."
    },
    {
      "rating": "0",
      "text": "This movie makes you so angry that is not worth to watch, unrealistic situations, only if you are lesbian or sympathise with satanic people like them, very unfair end as well. Horrible movie stay away."
    },
    {
      "rating": "0",
      "text": "I went into this movie excited for an outstanding plot with two world class actors. I got a completely garbage movie. The mafia would have cut her and her girlfriend into little pieces, slowly, after she rejected the bribe.  It fails on every level to sustain any suspension of disbelief."
    },
    {
      "rating": "0",
      "text": "What starts out as an interesting idea quickly turns into a movie so bad... It made me create an account at meta critic just to let it pay for the time I wasted watching it..."
    },
    {
      "rating": "0",
      "text": "-there is no **** revenge story-no build up whatsoever-the actions of the characters seem aimless-the movie is needlessly stretched out-waste of time-the conclusion of the movie is utter brain dead ****-only watch if you hate yourself-the death of the protagonist at the end doesn't even feel satisfying"
    },
    {
      "rating": "0",
      "text": "I have never reviewed ANY movie here but I signed in just to say this movie is just a pile of garbage... trust me you don’t want to loose your time here... if any good review makes you curious trust me they are lies! I wish I could turn back time so I could spend those two hours knocking my head into the wall instead watching this trash!"
    },
    {
      "rating": "0",
      "text": "Rubbish, hated this woman, was hoping she would die through the whole movie, disgraceful to glamorise this character who treats the elderly like commodities, horrible movie,"
    },
    {
      "rating": "0",
      "text": "Stop trying to make rosamond pike a thing. Not sure why we follow a villain through the movie. Written like a 12 year old’s fever dream."
    },
    {
      "rating": "0",
      "text": "Also never reviewed on meta critic but I need to save someone else from this **** Absolute trash. Don’t waste your time."
    },
    {
      "rating": "0",
      "text": "if I could give less than 0 I would! I registered an account just to leave a review for this movie.Worst movie I have ever watched in my life! It glorifies the bad in people, and it’s disgusting!!"
    },
    {
      "rating": "0",
      "text": "my wife and i watched this, and we were rooting to get the protagonists killed. i was literally angry when she got out of the water alive. it glorifies bad behaveiour for two hours, and the ending where she gets shot, isnt satisfying enough to make it worthy. absolute **** movie, waste of time"
    },
    {
      "rating": "0",
      "text": "What a waste of time! Feels like someone took parts of movies stuck them together and though, \"people will like this, they liked it before\"."
    },
    {
      "rating": "0",
      "text": "The worst movie I’ve seen in a long time. I was waiting 2 hours to feel something and came away with nothing. That should never happen when watching a movie. The movie is so ungrounded, boring, cringeworthy and stupid. No likable characters, the storyline falls apart after the 20 minute mark, nothing charming or entertaining. I was absolutely robbed of my time."
    },
    {
      "rating": "0",
      "text": "A true disrespect to Peter Dinklage as an actor. This movie has a lot of unrealistic scenarios."
    },
    {
      "rating": "0",
      "text": "For me personally a waste of time.When I saw the cast I thought it was going to be a great movie, even the trailer was interesting. The aesthetic is a fancy, pretty people, nice clothe but the characters are not well refined.  Seems like a cheap product of fast consumption, the main topic of guardians abusing elders is like an excuse to the story. The main idea is to show a woman who can go against  organized crime lead by her ambition that makes her cold? I just don't know. Is like a milk carton  with a lost child picture on it."
    },
    {
      "rating": "0",
      "text": "I have turned off two films in my life. The first was \"Irreversible\", a film with the dubious accolade of having the longest rape scene in any film. The other was this. At least with Irreversible, 'that' scene was a) crucial to the plot, and b) not celebrated with high-tempo electronic background music. Unlike \"I Care a Lot\" where our protagonists are seen riffling through their latest victims beautiful home, finding things to sell, like some montage from a Tony Scott film. If the scene's intention was some sort of clever juxtaposition, then it failed. Felt more like lazy/tone-deaf production/direction.There is nothing to celebrate in this film, and why Ros Pike would put her name to it i do not know. It is not clever social commentary, its a celebration of the abuse of the vulnerable. If you're the sort of person that likes to use \"Gammon\" or \"Karen\" as a perjorative, then you'll probably love it. For everyone else, dont waste your time.To Rosamund Pike, you're better than this."
    },
    {
      "rating": "0",
      "text": "Worst movie I've ever seen, only watchable for peter dinklage and an absolute waste of his talent. Anyone on Earth could make a better movie. You can tell where they saved money, all over. (Overly)Cheap thugs, storyline doesn't make sense, seems disorganized, music is unpleasant and obviously\"indie\" but not the cool indie, it was just a pain to watch,, I really appreciate metacritic having a 0, this is the first movie I've ever reviewed here, but I can't say it enough, just don't watch it, nothing good happens, nothing worth watching, it is like going and sitting down at walmart for 2 hours and just watching the people walking in and out at the Mcd's in the front of it, but without any food or drink, completely unpleasant, unrefined, not flowing well, and just a big waste of time.the only people who will like it are fat people who are aggressively lesbian and are tired of losing at everything, it is just a weird weird movie, and that seems to have been the goal."
    },
    {
      "rating": "0",
      "text": "One of the stupidest movie I ever saw. It is so bad, that I would give people who liked it human score 2 out of 10. What is wrong with you!?"
    },
    {
      "rating": "0",
      "text": "Wafer thin characters. Two characters you do not care for trying to destroy each other. I couldn't wait for them to finish it. Also a beard does not make you Russian."
    },
    {
      "rating": "0",
      "text": "No good at all, no entertainment in any state, kept the audience in an uncomfortable stage till the end waiting for the justice scenario but only to be disappointed."
    },
    {
      "rating": "0",
      "text": "Wow what a colossal waste of time. This movie just glorifies selfish people who take advantage of others. Like we need this story right now in society..."
    },
    {
      "rating": "0",
      "text": "I hated the movie so much, that I even created a Metacritic account to tell everyone about it"
    },
    {
      "rating": "1",
      "text": "Movie is extremely unrealistic, Unrealistic character and action sequences, while movie tries to be realistic it's illogical at best and the thing is some people are giving the movie a higher score just because of lesbian couples which makes no sense at all."
    },
    {
      "rating": "1",
      "text": "I’ve never been so compelled to write a review of a movie in my life... I’ve seen plenty of bad ones and good ones without feeling this way because it almost seems the criticism is unanimous. But this film, the amount of “certified reviews” that praise this film for being “brave” and “bold”.... just because the lead role is an intelligent, conniving, homosexual female empowering women with a take-home message; there still has to be a real story to tell. I have no problem with said character, in fact I applaud it. However, this film does the opposite. Yes, the premise portrayed does exist and begs questions for its ideas. I love that. But the realism of the film quickly goes out the door like that of an early 80’s action flick."
    },
    {
      "rating": "0",
      "text": "Well made movie but absolutely nihilistic with a complete garbage ending that ruins everything."
    },
    {
      "rating": "0",
      "text": "I seems that this movie was produce by the GOT team, so EXTREMELY bad! Rotten to his core, omg is so bad I really won’t spent time or too much words on this. A sadistic, egomaniac woman goes against the mob and win, over over and over, just so she can continue praying on old and defenseless people and becoming a successful billionaire on doing so. WTF? Really? All the disgusting humans in this movie are women and the ones trying to save their elderly relatives or making things right, showing signs or humanity are guys? What? It the whole Cersei ordeal again? Literally the worse waste of over an hour after the last episode of GOT. So in summary the worst movie ever!"
    },
    {
      "rating": "0",
      "text": "I made the account only to downvote this movie. It starts really good and becomes one of the worst movies I've ever seen."
    },
    {
      "rating": "0",
      "text": "This movie is a praise of selfishness and greed at all costs. The script makes no sense and is very poorly executed. I feel like these days it's almost impossible to watch a movie without having to swallow a lot of woke **** The movie tries to make us accept its protagonist and it's actions simply because she is a lesbian. I don't think I'm the only one who thinks this way by reading the other users' comments. Don't rely on the criticism of journalists who don't seem to be objective at all and don't waste your time with this garbage."
    },
    {
      "rating": "0",
      "text": "I would rather be dropped back in the Middle East than ever watch this again. If you don’t value your time and want to mentally harm yourself... this movie is for you. Boring white woman is mean to old people. That’s the spoiler. Now you know what this movie is about. Literally do anything else with you life. Fran should have been the lead at least she was hot. Okay that’s my take."
    },
    {
      "rating": "0",
      "text": "Worst movie ever, don't waste your time like I did. If you value screenwriting, run away."
    },
    {
      "rating": "0",
      "text": "Worst 2 hours of my life.The movie is has so many unrealistic plot holes that it aggravating. Watching this movie is just like adding fluff words to an essay, it’s adds to length but is a waste of time."
    }
  ]
}