{
  "id": 2835,
  "title": "I Feel Pretty",
  "starring": [
    "Amy Schumer",
    "Michelle Williams"
  ],
  "runtime": 111,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "A head injury causes a woman to develop an extraordinary amount of confidence and believe she's drop dead gorgeous.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rmP8b6vxbpK1sPinnUqXHKq0VkT.jpg",
  "categories": {
    "plot": 5.722222222222222,
    "acting": 4.882352941176471,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.323529411764706,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "A weakly directed stroke of geniusIntentions are not enough. Those of writer-directors Abby Kohn and Marc Silverstein and American stand-up comedian Amy Schumer could be potable, also very strategic, but their newest mainstream comedy \"I Feel Pretty\" moves through so many common places and ways of the genre by addressing its teaching purposes that it ends up revolving in circles, getting stuck and losing any minimal apex of transforming effect or connection with the audience.Schumer imbues Renee with the malice, affability and magnetism necessary to weave a solid link between the story, the character and the audience, leading to this mini-universe get a light code of congruence, that is, the characters and their actions aren't foreign or inserted thanks to, besides the ever-correct comedy queen, the \"different\" background of male leading role portrayed by actor Rory Scovel, as well as the supporting cast that provides almost acceptable performances, especially Michelle Williams, What are you doing there? The big problem doesn't lie in the actors, resides in a much more perverse place: the script. The starting point for the film is more than suggestive, even a little advantageous considering the heated gender panorama today in the industry, though, without an excessively deep analysis, it's concluded that this was the reason that motivated mostly STX Entertainment and the two production companies to set up, as quickly as possible, a film of such caliber with a lady of broad social influence on the front page, since her beginnings as an actress, she's been a fervent defender for women's rights, reflecting her thoughts in most of the roles she creates, where the girl must find who she's and what makes her special. The screenplay, written by the same directors who can show off an almost-laudable experience in the romantic-comedy genre, is satisfied to present the points required to run a surprisingly overlong typical rom-com, however, it's appreciable that the story does its best  to not get stuck in the midst of such a genre, because of, from the opening scene, its main motive is to clarify the dilemma and, therefore, the confusing message on acceptance that bombards valuable criticism to \"beauty\" companies. Trying to deal with the unstoppable clichés cascade, the film throws away big opportunities, used as unexciting expositions while eventually, approximately in the endless third act, the situation worsens as it's perceptible how the screenwriters strive to give a clear, accurate and supposedly bold resolution to the leitmotif, speeches and motivational talks with too many women in the crowd are no longer enough for a real impact. There's a weak pathos and, bluntly, the essence of the film is so distorted and stretched that the powerful debate that could have provoked vanishes into the hot and fun matinee air. It becomes excessively long and narratively slow because the writers choose to wrap up any minimal poorly developed sub-plot — Yes, we speak to you Emily Ratajkowski and Michelle Williams, — a harmful and unsubstantiated decision. It'd not be an Amy Schumer film without her characteristic visual gags, which, by the way, have a hilarious scope, however, the true comicalness is in the premise itself, the thruster of the story is so inherently comical that thousands of better-exploited situations would have reacted if the \"love interest\" had been extracted from the formula, but even so, at the expense of the undeniable power of the offering, every moment gets a pre-established air of jocularity, unconcern, and wisecrack; the first hour is an intermittent laugh-out-loud enjoyment that beyond becoming the greatest feminine movie teaching (feat) of 2018, managing to be an enjoyable film, which bases its strengths in a glamorous comedian again. \"I Feel Pretty\" by Abby Kohn and Marc Silverstein mislays its raison d'être halfway through and confuses its crucial purposes, but in reward, proposes a feel-good pastime mainly by the undeniable charisma of the leading lady and the absurdly hilarious core story. This is neither her new \"Trainwreck\" nor the feature film that will redirect the high rate of men and women who have low self-esteem because of an increasingly facile and indolent society, as it squanders the powerful messages that could have produced. Leastwise, we're not in front of a flashy cinematographic hodgepodge, this is a disoriented film that never looked itself in the mirror to know what its main strengths were, it understands how to use just a few, others are practically nonexistent."
    },
    {
      "rating": "4",
      "text": "\"I Feel Pretty\" is a film where the only good points of the film were the performance of Amy Schumer, also her comedy style was very different than before and the message that the film transmits to us about it does not matter how people see us, but how we really are, and that is the key point of the movie. The downside is that the film is very slow, boring and slightly tired, and falls more to a quiet drama than to comedy. and as for the other characters were influential in the life of the protagonist but we could not explore them to the fullest."
    },
    {
      "rating": "3",
      "text": "Don't let this latest Amy Schumer flick fool you. \"I Feel Pretty\" is neither funny, nor earnest in what it's trying to say. In fact, lemme' ask the question - what the hell is this movie even trying to say anuway? \"It's okay to look however you want?\" Well, the fat jokes and gluttony humor seem to squelch that theory, don't they? Okay, well, what about - \"it's okay to be insecure?\" Well, the movie seems to think so, but only if you're \"ugly.\" In fact, if you're \"attractive\" and are insecure, your insecurity isn't legitimate, you aesthetically privileged **** This movie is disingenuous, soulless, and thematically confused to an almost abhorrent fault. Also it's just not funny. It's a boring, overlong mish-mash of better movies. \"Big,\" \"What Women Want,\" \"Shallow Hal,\" even \"13 Going 30\" has more of an honest sense of theme than this. Just don't watch. Don't do it."
    },
    {
      "rating": "0",
      "text": "This movie was terrible- Amy Schumer is a talentless hack and none of her jokes were funny. Hated the preaching, hated the jokes, wish I'd never watched the move; Go watch Infinity War instead."
    },
    {
      "rating": "0",
      "text": "Im at a loss why this lame female version of Adam Sandler is consistently given movie projects, her stand up is the same ole same ole tired filth and her movies are boring and stupid. I find no humor in this version of \"look how fat I am and I love it\" writing. I'm happy shes proud of how she looks but Im not interested in paying $17 to see a movie about it...."
    },
    {
      "rating": "9",
      "text": "Loved this movie!  A positive message for women of all ages!  The movie was also very funny."
    },
    {
      "rating": "7",
      "text": "Schumer has produced a heart warming comedy for all ages with this positive and uplifting film, though it must be noted that the razor sharp and tawdry humour she is known for is very muted in this film. The performances are solid, and Williams is surprisingly funny, with a storyline that is compelling if predictable. This is a film which does what it says on the tin, and delivers a funny and entertaining experience that is perhaps more suited to home viewing, but still with your time. 7.02/10"
    },
    {
      "rating": "10",
      "text": "I am shocked that this movie go such bad reviews.  I laughed out loud at so many scenes-it is a comedy and I thought it was very funny.  A little preachy at the end but the funny parts outweighed the preachiness. Reminds me of Lucille Ball, Amy will do whatever it takes to get a laugh. Really liked it."
    },
    {
      "rating": "8",
      "text": "This is a good movie!  It is NOT typical of Amy Schumer.  The plot is fun and there is no raunch factor!  My friends and I loved it!  There is a great message in this film and it is presented in the plot/story in a really cute way.  It is definitely more of a chick flick, although I guess guys could enjoy it too.  But, the message of loving yourself and who you are brings confidence is one the vast majoriy of women will understand.  Amy is adorable as Renee, a woman who undergoes a transformation under unusual circumstances, and plays the part very sweetly.  Loved her “boyfriend” played by Rory Scovel.  Michelle Williams is almost unrecognizable as Avery, a cosmetics tycoon with a teeny, tiny voice,  She believes in Renee and they each give the other the confidence they need."
    },
    {
      "rating": "9",
      "text": "My wife and I see about one movie a week, generally Friday night date night.  I never write reviews.  However, when I saw some of the bad reviews people were leaving for this film, it really surprised me.  I thought it was a fantastic film, and I was really happy we saw it.  I see so many movies that are truly awful, and I regret even spending the time or money seeing, but this movie had me rolling with laughter the whole way through; it has a great message, and we walked out of the theater all laughs as we retold each other our favorite one liners.  I don’t know what people expect anymore, but I suspect those that left a poor review were expecting a raunchy buddy comedy, which this isn’t.  This is a funny and sweet rom-com, that avoids all of the cheesy trappings of typical rom-coms.  It was my wife’s turn to pick the movie, so it wasn't really my choice, but I was really happy I went.  I laughed a lot, especially the first 20 minutes.  I really liked some of the choices made for this movie as well.  For example, when Schumer turns \"pretty\", we all see her looking into the mirror, and to the audience nothing changes, but for her she has completely transformed.  So unlike Shallow Hal, we never see a different image for Schumer, she is the only one that sees the \"pretty\" version of herself.  I also liked the fact that she never cheats on her boyfriend, which for me makes a character less sympathetic. In the end it is a really sweet movie, with a great message - that you should love yourself no matter how attractive/unattractive you are on the outside, but that personality and character are much more attractive than physical beauty.  A big plus for me is that I can tell everyone to go see it, my parents, my wife’s parents, people at work, people at church.  I thought it was appropriate for everyone."
    },
    {
      "rating": "7",
      "text": "The movie is not nearly as bad as its User Score suggests, which leads me to believe a whole lot of misogynists came on here without even seeing the movie. Schumer is charming as always. As the super-confident Renee Bennett she's playing a character we've seen her do before -- but when she's the insecure Renee Bennett, she shows a vulnerable side we haven't seen often."
    },
    {
      "rating": "9",
      "text": "Maybe it's just because I feel pretty (spiritually), and happy myself, but I found this movie touching, genuine, moving, utterly hilarious, and almost a crash course in spiritual awakening / being your authentic self. Thank you."
    },
    {
      "rating": "8",
      "text": "Trolls, who didn't even watch the movie, are out in force here. Ignore them. The movie has some true funny moments. The overall vibe is fairly a fairly sweet rom com."
    },
    {
      "rating": "5",
      "text": "The latest from Amy Schumer doesn't feel like her style, which is probably because she didn't write it. The guys who did (Abby Kohn & Marc Silverstein who also directed) usually write sentimental romantic message movies and that's what this is. It lacks the raunchy approach and outlandish style that Schumer's known for. She plays a woman who's extremely insecure about her body image until she hits her head and believes she's turned slim, hot and gorgeous. Although her spunky performance is endearing, this is more about disparaging the people who are so body conscious. With the exception of Michelle Williams, there aren't any wacky supporting characters to add a layer of fun. The millennials in the cinema seemed to be enjoying it, but I didn't laff once. More sweet than sassy, which is not what we expect from Schumer."
    },
    {
      "rating": "2",
      "text": "This movie has been poorly written and creates a movie about nothing, the idea of a comedy about a fat person finding happiness within them self is completely possible to pull of but when the protagonist is played by one of the worse comedians of all time, somebody who had a Netflix series that only 5% of people liked it shocks me that she can still get a job considering that it is a near guarantee that your movie will fail with her. The reason for the 2 is because there is a tiny few moments of good writing and story making, and there are a few moments that are not ruined by Amy Schumer's awful acting ability."
    },
    {
      "rating": "8",
      "text": "Don't be fooled, this isn't just another pretty face.  Schumer brings the laughs and a welcome, body-positive message makes this surprisingly smart comedy a solid hit."
    },
    {
      "rating": "8",
      "text": "This is not a perfect movie. Why do I like it so much? It ostensibly skewers the women's fashion/beauty industry, in Devil Wears Prada mode. HOWEVER, IFP has a broader intent/critique aimed more generally at Western (urban) culture. It's NOT aiming at being perfect itself. That's like an implicit message. IFP is comedy w/ a serious edge. That tension and 'contradiction'--and of course hot mess Schumer-- make it work, kind of accidently/brilliantly. Seriously good and funny."
    },
    {
      "rating": "6",
      "text": "This was an average comedy. If the story is simple, it has some interesting notions with beauty versus confidence. However the film become a bit dull and flat from the middle section and lose a lot of comedic steam. Which makes the end very generic. I did love the actors, maybe more the actors around Amy in fact. And I think the movie started well and could have evolved better somehow. I give it a 58%."
    },
    {
      "rating": "4",
      "text": "It definitely tried but it's wasn't enough. This is only the second lead performance by Amy Schumer since her breakthrough in Trainwreck but I've gotta say that with the results she was a one hit wonder.And it doesn't work as empowerment and acceptance when you're actually building your comedy with fat jokes."
    },
    {
      "rating": "3",
      "text": "Humor is awkward, cliched, and often cringe inducing. I would suggest avoiding this painful slog."
    },
    {
      "rating": "10",
      "text": "This movie is hilarious! It’s funny and the story is great because it’s authentic, crazy, sad and mirrors our superficial society where being beautiful is more important than everything else. I give it a 10 to balance out the low ratings."
    },
    {
      "rating": "6",
      "text": "I Feel Pretty is not going to be remembered as one of the great comedy classics, but its message is nice and unique, the leads are likeable, and gets a few chuckles out of me."
    },
    {
      "rating": "1",
      "text": "The idea that Amy Schumer, a white, blonde, straight-size actress would have to hit her head in order to feel confident in her body is hard to swallow.  Should have made this about a Black Trans female.  Amy did not sell this character on any level.  Very disappointed in this film."
    },
    {
      "rating": "10",
      "text": "Hell yasss! Gone through every single one of the  struggles she brings up in this movie! You can’t help but laugh at your own situation! Seeing it on screen was 1000% better! Schumer’s movies are very similar to that of Tina Fays! Brilliant comedian who reminds me that my arms are fat yes but eh, that’s amore!!!!!!!"
    }
  ]
}