{
  "id": 4067,
  "title": "I Give It a Year",
  "starring": [
    "Rafe Spall",
    "Rose Byrne"
  ],
  "runtime": 97,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "After a quick courtship, two lovers hastily decide to tie the knot. As their first year of marriage unfolds, temptation and incompatibility put their relationship in jeopardy.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hCSqxrM5Sw6AhDIRfxQ4BenPd9y.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 3.75,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "This unrelentingly cynical film reflects a sociopathic sensibility. Mazur, the writer, appears to view people as objects and to lack any sense of empathy. There are some positives, notably the cast. I love Rose Byrne no matter what she's in. But overall, let's just say people I watched this movie with audibly revolted at the ending, so contrary was it to their idea of what was credible. The audience wasn't having it and neither was I."
    },
    {
      "rating": "6",
      "text": "This is as awkward as it gets. I love watching Rose Byrne, but this storyline was just too cheesy. The acting was less impressive than expected. It wasn't very funny, sad, or anything, really. The way I see it, it's just a silly movie to watch on a lazy Sunday morning and to forget about by dinner time."
    },
    {
      "rating": "4",
      "text": "Ghastly. If this is the 'comedy of embarrassment', the only people embarrassed must have been the players. Only Simon Baker emerges with any credit. Lame plot, lame jokes, poor characterisation, desperately contrived scenes.\r I'm not even sure why I've scored it as high as 4 out of 10!"
    },
    {
      "rating": "4",
      "text": "I Give It a Year is trite and awkwardly bland. Sure, likable actors and characters are present--but they aren't given much to do. Oh, yeah, and where's the emotion?"
    },
    {
      "rating": "1",
      "text": "My girlfriend and I suffered through this film, regularly considering turning it off.  We persevered, thinking the average writing and awkward directing and acting might yield an upturn or surprise, but it really didn't.\r My favorite elements were the off kilter marriage counsellor (played by Olivia Colman).\r Stephen Merchant is funny as a person in most things I see him in, but in this it just didn't work.  If the entire film around Stephen Merchant was built around the same style of inappropriateness, it would have been funnier, really.  But considering a more earnest tone throughout, his scenes just put me on edge.\r There was no chemistry between any of the sets of couple, and the script just didn't have any sense of essentialness.  It felt like a movie that didn't need to be made, for any reason.\r I came to Metacritic afterwards, expecting the score to be even lower than the current 50, and decided to sign up, to make sure that those thinking this might be worth watching as a no-brainer romantic comedy had a better chance of dodging this bullet.  Seriously, watch something else instead."
    },
    {
      "rating": "10",
      "text": "Yeah, all the love and romance cliches are here yet slightly twisted and somewhat turned upside down, but i haven't laughed this much since Hey Ladies came out....Stewart is a walking jokes slot machine and Minnie Driver is so talented as a comedian too.....and finally, that lovely Brit humor....enjoy !"
    }
  ],
  "recommendations": [
    "the_five_year_engagement",
    "that_awkward_moment",
    "pitch_perfect_2",
    "the_dilemma",
    "a_bad_moms_christmas",
    "the_wedding_ringer",
    "friends_with_benefits",
    "blockers",
    "the_break_up",
    "i_feel_pretty",
    "forgetting_sarah_marshall",
    "trainwreck",
    "tammy",
    "the_cobbler",
    "delivery_man",
    "bachelorette",
    "mortdecai",
    "couples_retreat",
    "palm_springs",
    "rough_night",
    "no_strings_attached",
    "life_of_the_party",
    "the_spy_who_dumped_me",
    "this_is_the_end",
    "thor_love_and_thunder"
  ]
}