{"id": 3519, "title": "I Kill Giants", "starring": ["Madison Wolfe", "Imogen Poots"], "runtime": 106, "genre": ["Fantasy", "Drama"], "description": "Sophia, a new high school student, tries to make friends with Barbara, who tells her that “she kills giants,” protecting this way her hometown and its inhabitants, who do not understand her strange behavior.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/cvit6HDbXHE6W5kGPd47jd0wthQ.jpg", "categories": {"plot": 6.555555555555555, "acting": 6.7894736842105265, "ending": 6.777777777777778, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.0, "action": 4.0}, "reviews": [{"rating": "4", "text": "Solid, in places exciting and entertaining, although the twist quickly becomes clear. Most of the stylistic missing is the over-subscription of the comic. As a result, the answer that the film gives to the fantasy of a child seems reactionary."}, {"rating": "6", "text": "I Kill Giants is a young adult drama with some fantasy elements that follows a girl, named Barbara, who believes that she hunts and kills giants. This film isn't quite as fantasy centric as I expected after seeing the poster for it. The main focus of this film is to show how Barbara deals with her fears and the problems she is currently facing. She's often bullied and referred to as the \"weird girl\" when she is at school, but when she is outside of school she seems rather outgoing and brave in her quest to \"save the city\" from the giants that she believes are coming to destroy everything. However, there are not really any giants. The giants are from her imagination and they represent something that has been looming over her for some time–a fact, which is revealed later in the film, that she does not want to accept. It is with that revelation that I came to sympathize with Barbara, because up until that point she really hadn't earned it. She is clearly smart, and I hate seeing anyone get bullied, but there were plenty of times outside of when she is getting bullied where she basically shoots herself in the foot. She creates problems for herself that could have been avoided. So while I was rooting for her all the way through, I couldn't help but get a bit frustrated with her as well. I do think that the final act of the film wrapped up well, though, and I was on board with the message this film is trying to get across. However, I do think that the fantasy and real world elements could have been more properly balanced and well blended. There are plenty of plot holes and some elements of the story just don't tie in well together. I also believe that this film would have benefited from the character of Barbara coming off as more likable through the first half of the film. Furthermore, this is a young adult drama but I think it would have a tough time holding the attention of a young adult audience. It's slow at times, and if the audience went in expecting lots of fantasy elements, or lots of action, they'd be quite disappointed. Overall, this is a young adult drama that might be more fit for an older audience, but the problem is that an older audience is going to see the problems with the story and characters much easier. That puts this film in a tough spot, and I think that's why it has gotten such a mixed reaction from people who have watched it. However, I will say that if this ever makes its way to a streaming service it might be worth a shot for you to try it out if you're into young adult films."}, {"rating": "6", "text": "It has a resemblance both in tone and thematic with When a Monster Calls but manages to distance itself and mark its own path.The interesting resonates because the character is feminine and exposes her fierceness, anguish, anger, fear and pain and those are elements that are rarely explored in films like this and if they do they end up being reduced or minimized.This is a coming of age drama that balances itself between real life problems and fantasy but it never loses sight of what it's trying to say, yet its proposal never dares to be more obscure and frontal and that wouldn't have been bad at all.This film is nothing remarkable but it's sufficiently productive and functional, it's well done and well acted, especially remarking the work its young protagonist and I really believe it deserves more attention than what it will ended up receiving."}, {"rating": "7", "text": "This is a wonderful movie. It is based on a HQ.The movie tell the story of Barbara, showing how much struggle she got in her life, being in school with bullies or with the trouble in home. Having that message that you need to take time with your loved ones while they are with us, because one day they gonna go, that is a very important message to tell.Fantasy is a haven, this is the premise of the film, and i have to say that they did it in a way that literally broked my heart, for me it was so sincere and realistic. This one is important because it shows for the world how kids can get with situations that they don't understand or don't know how to react to it. Sometimes children they shelter for some situation, they create a illusion to make things easy, while all that is needed is for someone to talk to them, and make they realise and accept what is going on, is important because someone could need them.Presenting a very good story, it does have a nice characters apresentation, you really got to know Barbara and everyone in her life, you feel her struggle and her pain. It have things that at the begining doesn't make much sense and get you thinking about it, and about the end it get back to that and explain. The emotion in the third act that leaves the viewer shocked and felt by Barbara's story, can bring you to tears.The acting worked completely, Madison Wolfe did a great job interpretating a kid with a lot going on, you could feel her struggle, she did pass in the way of speaking, in the eyes all of that, that her character was going through. Zoe Saldana also did a great job, she did very well the worry person, you could feel, and not just feel, but be worried with her and wanted to try to help Barbara, so Zoe character kind of did what we wanted, and in a terryfic way. Everyone did gave emotions, and touching moments, the cast worked one hundred percent.The cgi is bad, they try to camouflage in the dark, between the trees, but it is really terrible, by the end it's just terrible, but it is all understandable with the context of the movie, you will understand and will not bother you at the end. The movie is predictable, before the half you could tell what was going to happen in the movie, wich is bad, but even with that the magic did worked out.The film establishes well the fantasy world with Barbara narrating everything and givin us an idea of what is about, even if that isn't much explored as it could be, it does make sense, just at the beginning they showed that she like books and play rpg, so it did have a past to explain that. One thing that could have been better is that they didn't explore the fantasy out of the narrating aspects, they did show to little, it was ok, but you didn't really felt yourself inside of that fantasy world. Conveys a strong and meaningful message, isn't original, but is necessary to remind us of it, it is something like The Lion King message.Living between reality and fantasy with the escapism, trying to get out of the real life stuff. The best thing on the movie, beyond the message, is the conflict of Barbara trying to accept or escape of what is actually going on in her life. A inspiring story."}, {"rating": "7", "text": "Very strong and important messages, if they were conveyed somewhat directly.A compelling and very sophisticated protagonist brought to life by a great performance from Madison Wolfe, if Barbara Thorson was so nervy and rude that make me have less sympathy for her than I should have had.A good balancing between the reality and the magical world, if not very good at the climax.Very overwhelming and emotional ending that will definitely make you shed a tear, if the ending was faster than needed.Gorgeous special effects for a low-budget film or maybe for any film.Wonderful performance Zoe Saldana, Sydney Wade and Imogen Poots (especially from Imogen Poots)The character of Taylor, the bully, is very very corny and stereotyped, and Rory Jackson made the character even worse with her over-the-top performance.(7/10)"}, {"rating": "10", "text": "It's hard to say what the best part is... the dialogue, the photography, the CGI, Wolfe's performance or the twist ending.  Giants is a story we've heard before but never so well told or fascinating to watch."}, {"rating": "7", "text": "Beautiful movie about a girl struggling with the hardships in life. Bullied in school troubled at home. Keeps you emotionally involved and brings its message well. The ending was a bit too abrupt though. Nothing too fancy or spectacular, just a decent movie."}, {"rating": "7", "text": "Madison Wolfe is a future star. Her performance is truly amazing. I watched this film with my daugther (12 years)and it is a perfect movie for her age. And it served as a great reference afterwards, when we talked about how kids treat each other and how to cope with loss."}, {"rating": "4", "text": "Juste moyen, et encore je suis sympa.Le film aurait pu être bien si c'était pas une fille de 12ans qui sauve la ville, seule, contre des géants dont personne ne soupçonne l'existence, comme c'est pratique"}], "recommendations": ["a_monster_calls", "the_road", "the_hunt", "wonder", "the_florida_project", "into_the_wild", "machine_gun_preacher", "five_feet_apart", "all_the_bright_places", "me_before_you", "her", "leave_no_trace", "the_boy_who_harnessed_the_wind", "captain_fantastic", "the_age_of_adaline", "the_perks_of_being_a_wallflower", "the_book_of_henry", "20th_century_women", "blue_valentine", "the_book_thief", "i_still_believe", "closer", "come_play", "freedom_writers", "donnie_darko"]}