{
  "id": 2087,
  "title": "I Know What You Did Last Summer",
  "starring": [
    "Jennifer Love Hewitt",
    "Sarah Michelle Gellar"
  ],
  "runtime": 101,
  "genre": [
    "Horror",
    "Thriller",
    "Mystery"
  ],
  "description": "After four high school friends are involved in a hit-and-run road accident, they dispose of the body and vow to keep the incident a secret. A year later, they each start receiving anonymous letters bearing the warning \"I Know What You Did Last Summer.\"",
  "releaseYear": "1997",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cpaV1Ddvaf8jZWNAMJMMZPJkm0U.jpg",
  "categories": {
    "plot": 6.0588235294117645,
    "acting": 6.5625,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 6.25
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Weak on performances, weak on thrills, weak on dialogue and it isn't even unintentionally funny. Wow this movie has the right to be made fun of. I give this awful movie 18% of a good movie."
    },
    {
      "rating": "6",
      "text": "Its not a bad thriller if you're basing it on late 90s, post scream thrillers. Its got a good cast and solid thrills but it does nothing groundbreaking"
    },
    {
      "rating": "3",
      "text": "Four embolted and attractive teenagers celebrate the national holiday and drive around freely. A malheur turns on a man. Through their desperation, by the murder of the foreign man, the group unceremoniously sinks the corpse into the nearby lake. Exactly a year later, a mysterious man emerges, with a hook on his hand targeting the group.This is the starting point of this teenage mangod. You can already tell here that the screenwriter Kevin Williamson had the pen in the game. A masked killer, attractive teenager and nervous jolle because you can't trust anyone. The film is uninspired and doesn't lend anything new to the story. The film goes under the genre of horror. But more than a thriller, it really isn't.Most beautiful here, of course, is Jennifer Love Hewitt and Sarah Michelle Gellar. The two have been given a starting gun for this in their careers: Love Hewitt can suddenly see ghosts through the attacks of the mask killers, and Gellar becomes a vampire killer after the psychos ' attacks. Ryan Phillippe, though, can score the most on this film: With his playing as a macho before a nervous breakdown, he plays best here.Verdict: Ordinary teen Klamauk, who is nothing special. The film tries on the classic SCREAM! He fails to achieve that."
    },
    {
      "rating": "9",
      "text": "I do not know why people hate this movie. It was a great movie! It creeps me out. Well anyways while this one is good I CANT say the same for the other 2 movies."
    },
    {
      "rating": "4",
      "text": "Empty, predictable and even humorous.In this film, a group of teenagers commit a crime and decides to keep that secret forever but someone knows what they did and decides to punish them. From the same writer of \"Scream\" (Kevin Williamson), this film is directed by Jim Gillespie and features Jennifer Love Hewitt as a protagonist.Teen movies usually go up in college or the end of high school, and show plots with stereotyped groups of adolescents (sexual perverts, idiots, nerds, dumb blonde's and others). This film starts from that and introduces notes of suspense: a crime, a secret, several murders throughout the plot and a busty girl playing the damsel in distress. This would make an excellent comedy (who doesn't like to see stupid teenagers to die horribly in movies?) and there are several moments that are deeply hilarious and predictable. The creation of suspense fails repeatedly for that reason.Jennifer Love Hewitt is a satisfactory actress, but fails to convince the audience. The problem may not be the actress but the plot, the script and the way her character was planned. The actress tries at various times to reach a higher level of psychological tension but ruins everything with theatrical moments and hysterical screams. The rest of the cast doesn't matter, are there to die or kill. The best of the film is to discover the killer's identity but, unfortunately, if we just want that, any CSI series or similar can give that even better."
    },
    {
      "rating": "3",
      "text": "Jeniffer Love Hewitt,a Moreninha Gostosa e super Peituda,dar uma excelente performance mais filmes de terror sempre decepciona e esse foi de lascar péssimo"
    },
    {
      "rating": "6",
      "text": "Okay horror film that was obviously trying to gain success after Scream, but sports a good cast and humor, but not much else. Not even really good scares."
    },
    {
      "rating": "7",
      "text": "There isn't a whole lot to say about this movie. It's not original, not very scary, very cliché with bad characters and bad scripting, but still enjoyable to watch. Doesn't try to score cheap with ''jump scenes'' but puts more emphasis on suspense. Nice to watch when you're drunk and don't have the attention span for a more complicated horror movie."
    },
    {
      "rating": "7",
      "text": "Group of friends run over a guy, dump him in the sea and then are hunted down by him once he's managed to find a raincoat and a fish hook."
    },
    {
      "rating": "6",
      "text": "Why this movie is one of the most well known slasher to come out of the 90's I have no idea. The acting was not very good (especially Prinze Jr), the movie didn't create much tension and the ending was a little bit too far fetched. While it isn't the worst teen slasher movie of the 90's, you can still find better."
    },
    {
      "rating": "8",
      "text": "To be honest, I like I Know What You Did Last Summer. It is quite interesting and scary. However, it is a bit confusing and can sometimes be stupid."
    },
    {
      "rating": "3",
      "text": "Jennifer Love Hewitt além de gostosa e muito peituda É uma excelente atriz e dar um fenomenal desempenho no filme,mas o filme sim o filme é um fiasco,um dos piores filmes de terror uma excelente história mas o filme resultou num lixo..."
    },
    {
      "rating": "5",
      "text": "A decent popcorn movie--nothing more. It's a shame that when thousands of very good scriptwriters are struggling to make ends meet, this kind of drivel is being peddled out of America. The country should both be ashamed, and, as in the original Frankenstein, be chasing everyone involved with lit torches and demand answers. A national travesty and indecency."
    },
    {
      "rating": "7",
      "text": "If you thought Scream was scary then this summer 7 little words will give you the biggest scare of your life.\rThe film starts by looking at a group of four friends who are celebrating the fact that Helen (Sarah Gellar) has won a beauty pageant. The party is going great until the four friends decide to take a drive and accidentally run over a man. Not wanting to report the crime the four friends decide to throw the man in the river. But just before they throw him in the river the man wakes up but luckily for the group of friends after he wakes up he falls in the river and disappears into the murky depths. After this the friends seem tohave gotten away with it until a year later one of them, Julie, (Jennifer Love Hewitt) recieves a letter which reads \"I know what you did last summer.\" From this moment on the four friends find themselves in a revenge story where the killer is taunting them at first and then horrifically killing them one by one.\rEven though the film is a bit slow at the start there are some very scary parts in it like when one of the Julie is driving and she hears a scratching sound coming from her boot. So she opens the boot and inside is her friend's dead body covered in crabs. This scared me because at first I thought it was going to be a false-scare but then I saw the dead body and almost jumped out of my seat.\rMy favourite scene in the film is when Julie is trapped on a boat and is getting chased by the killer. This is a good chase scene because not only does the killer nearly catch her on more than one occasion but also you get the feeling that the killer will catch her eventually because the boat is the middle of the water so you get the feeling that she can't run from the killer forever.\rI would recommend this film to anyone who likes horror/action films with a bit of gore. And I would rate this film 7/10."
    },
    {
      "rating": "7",
      "text": "A good horror movie and very original in its time."
    },
    {
      "rating": "7",
      "text": "It wasn't quite as good as Scream but it had just about as much originality as Scream did. The acting was good except for Freddy Prince Junior's. It was really creepy and scary at certain parts. Way scarier than Scream but not as smart with how the story goes. The only problem is that every character that should have escaped got killed because the killer appeared out no where as if he was a ghost which he is not. He's like a 60 year old man and he walks when he chases people when their running as fast as they can but he still manages to kill them somehow. Sarah Michelle Gellar should have survived."
    },
    {
      "rating": "5",
      "text": "Creating the kind of horror movie genre satire that the Scream movies did so well, \"Summer\" does it so much weaker and with less fun. The movie is very blasé, and I found myself bored while watching it. Jennifer Love Hewitt does nothing to the character, and all the other performances are banal as well."
    },
    {
      "rating": "6",
      "text": "Falta de originalidade é um fator que agrava a situação desse filme, mas ele entretém e eu seria injusto se dissesse que o acho divertido."
    },
    {
      "rating": "2",
      "text": "No.... I.... know what you did last summer. Come up with this movie and make it official and set the release date to October 17th, 1997 and then go back to being lazy all day and never come out to make another movie like this again."
    },
    {
      "rating": "9",
      "text": "I have to say, I liked I Know What You Did Last Summer even better than Scream. It was one of those \"at the edge of your seat\" thrillers with plenty of jumps, scares, and surprises. Sarah Michelle Gellar makes you like the movie maybe more than you should, but that's fine by me."
    },
    {
      "rating": "8",
      "text": "For A Horror Movie It's Very Well Writen And The Acting Is Fine..\rSarah Michelle Gellar Does A Amazing Job!"
    },
    {
      "rating": "8",
      "text": "A classic thriller with some of the best chase scenes, the script is good, the performances are good, if you're a fan of suspense,'ve probably watched this movie."
    },
    {
      "rating": "9",
      "text": "A classic thriller with some of the best chase scenes, the script is good, the performances are good, if you're a fan of suspense,'ve probably watched this movie."
    },
    {
      "rating": "4",
      "text": "classic of the 90s, but with nothing brings anything very innovative. A cliché slasher."
    },
    {
      "rating": "8",
      "text": "Wonderful film with an interesting message and suspense towards the end. One of my favorite Hollywood film. All the cast performed well especially Jennifer was amazing."
    },
    {
      "rating": "6",
      "text": "Sin Scream, no habría esta película, buena en su época, aunque no ha envejecido para nada bien mientras Scream sigue siendo genial."
    },
    {
      "rating": "9",
      "text": "While it is clear this is one of the movies that perhaps was trying to cash in on the success of Scream, I Know What You Did Last Summer is still in my opinion a solid and enjoyable film. The plot isn't necessarily original and that's not where this movies shines. Where this movie shines is in the performances of Sarah Michelle Gellar and Ryan Phillippe. Gellar and Phillippe give stellar performances and Gellar's performance is a foreshadowing of her spot in Hollywood as a scream queen. Jennifer Love-Hewitt and Freddie Prinze Jr., being the leads, give relatively weak performances in my opinion. I think if you go into this movie not taking everything so seriously you will enjoy it for what it is: a simple, yet enjoyable 90s slasher."
    },
    {
      "rating": "9",
      "text": "Awesome horror film one of the true masterpieces of the late 90's an epic flick with one of the best plots ever."
    },
    {
      "rating": "6",
      "text": "Clique? yes, done a million times? definitely. But that's why we go too the movies, we go to seen cheesy plots and stories & gorgeous women. But this movie side steps a few of those problems that almost all movies have. I know what you did last summer has a very intricate and well thought out story and plot, but to a very avid thinker this movie's plot will feel like it was shot full of holes, this films story is derived from the book of the same name. As we all know the movie is never like the book, but this film comes pretty close. Also allot of people and critics look at four main details about a movie. plot, acting, direction and story. These four details make up a film and this movie has three of these four details and that's good enough for me. I know what you did last summer stars Ryan Phillips, Jennifer Love Hewitt, Freddy Prinze Jr. & Sarah Michelle Gellar as four teenagers who while celebrating the fourth of July go for a drive and accidentally hit a man with there car the four panic and dump his body in the ocean and swear never to talk about it again. Four years pass and the incident has took it's toll on Julie( Jennifer Love Hewitt) she has become reclusive and quiet ever since, the others have gone on with there lives. But what they did four years ago has come back to haunt them, a man with a hook has come back for revenge and it's possible that he's the man they hit four years ago, now with time running out they have to figure out if it's him or somebody else come to avenge his death. I know what you did last summer is a roller coaster ride of thrills and chills that won't let up till the very end. I highly recommended this movie."
    },
    {
      "rating": "5",
      "text": "Below average thrills despite the attractive cast of 20 somethings being slain for our viewing pleasure. The screenplay is weak with some terrible lines thrown in for maximum cheese factor. Add to this the usual teleporting bad guy shenanigans and it falls below the average meter with predictable jump scares and a lack of logical character decisions. Entertaining but sloppy."
    },
    {
      "rating": "8",
      "text": "I liked this movie. I wish there was more action and killing but overall pretty good. Has a good cast in it too."
    },
    {
      "rating": "10",
      "text": "The first 20 mins were good and the last 20 mins were good, the rest was kinda confusing, convoluted and just filler lol. 10/10!"
    },
    {
      "rating": "8",
      "text": "A movie with a great location, that is entertaining,  and has a great killer."
    }
  ]
}