{
  "id": 4566,
  "title": "I Origins",
  "starring": [
    "Michael Pitt",
    "Brit Marling"
  ],
  "runtime": 106,
  "genre": [
    "Science Fiction",
    "Drama"
  ],
  "description": "A molecular biologist's study of the human eye has far-reaching implications about humanity's scientific and spiritual beliefs.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2P31jhd1dWUAPD8dmnSrwkQ8CNN.jpg",
  "categories": {
    "plot": 7.571428571428571,
    "acting": 8.5,
    "ending": 7.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Michael Pitt plays a biologist who's researching the eye with lab assistant Brit Marling. His fascination with the subject and love for a woman ultimately lead him to questioning his strictly scientific beliefs. Although there are some philosophical discussions, the script is intelligent (as opposed to intellectual). It's mysteries slowly unfold with smart plotting and potent performances. Director Mike Cahill (\"Another Earth\") tells an enthralling story with intriguing visual style. More than science fiction, this film is intriguingly spiritual, while being completely compelling as a film experience."
    },
    {
      "rating": "6",
      "text": "An intriguing look at science, spirit, interpersonal relationships and the ties that bind them, all wrapped up in a captivating story. It's unfortunate,however, that some pacing problems, lame attempts at humor and tech-speak dialogue bog down the flow of this otherwise-engaging release."
    },
    {
      "rating": "8",
      "text": "A very interesting storyline which fuses science and spiritualism in a very nuanced emotional and intellectual capacity, giving the audience a captivating, suspenseful and thought-provoking film."
    },
    {
      "rating": "9",
      "text": "“What would you do if something spiritual disproved your scientific beliefs?”\r Science and spirituality is at the forefront of Mike Cahill’s second directorial feature. If that doesn’t already excite you, perhaps you have never had those intense, elongated conversations about either or both of the subjects. Two of the most divisive subjects in human history are the real stars of Cahill’s second film; a promising feature centered on bold claims, knowledge and questioning.\r In 2011, Mike Cahill premiered his feature length debut Another Earth at the Sundance Film Festival to mixed reviews. In 2012, I was able to finally enjoy Another Earth and became acquainted with one of the most promising American indie film directors working today. Three years after his life-altering debut feature, I Origins proves to be a personal cinematic study of bravado that questions whether science or spirituality is the true way to prove the existence of human beings.\r I Origins doesn’t quite reach the level of Another Earth, but it does get to within reach in bold and dramatic fashion.\r Cahill is faithful to a cast that has served him well in previous endeavors. He recasts indie darling Brit Marling as Karen, a sophisticated scientist who works faithfully next to Ian Gray (the always impressive Michael Pitt). Together, using iris scanning and sophisticated technological advancements of scientific study, the two become lab rats obsessed with the intent of disproving the existence of a spiritual being greater than the human race.\r It becomes clear that Ian has a skeptical view of spirituality. Cahill, who never labels his protagonists and steers away from religion whenever possible, offers up well thought out arguments for both beliefs and Ian’s distrust in anything pertaining to the soulfulness of humanity. Ian’s life is anything but black and white, especially once he gazes upon a billboard and into the eyes of a beautiful woman by the name of Sofi (Astrid Bergès-Frisbey). Ian looks for Sofi, and upon first gaze, the two fall in love. For some, I Origins may be mistaken as an eternal love-story based on the first act. But through a surprising sequence of unexpected tragedy, the film takes an unexpected turn into the deep observation of chance and possibility. What begins for Ian is a new phase in his life where, like Dr. Frankenstein, he plays God using science, together with his lab partner and own personal Igor, Karen, dictates and questions his very beliefs to his core. Through this, I Origins becomes an endless fable of answer seeking for Ian. The answers, however, are never revealed to the audience.\r Over the next few years, Ian becomes a seemingly ordinary family man. Under the surface, he evolves into a pioneer in his research and studies. The film offers many unanswered questions as well as an abundance of coincidences that take away any authenticity of the screenplay’s flow. This aside, Cahill retains his audience’s curiosity when Ian finds a match of his beloved Sofi’s unique eyes in India with a little home-less Indian girl Salomina (Kashish). What begins for Ian is the key to unlocking the connection between the past lives of people living, dead and the memories that they believe are retained through iris patterns. The film is given momentum and brought to new life in the third and exhilarating final act.\r Since its premiere at Sundance this year, I Origins has been my most anticipated indie of 2014, and I could happily say that I did not disappoint. Kept together with an ensemble effort by its cast, lead by the poignant Pitt, Marling and Steven Yuen of AMC’s The Walking Dead for good measure, the film becomes one of the loudest commentaries of the year for spirituality and science without ever answering too much and leaving one to make their own decisions.\r Originality is the basis of Cahill’s film and the mantra of his filmmaking technique. Eyeing the greater picture of narrative and inciting cinephiles, intellects and storytellers, I Origins is a bold voice of the future of magnificent independent feature films. Much like Ian itself, there is always a grey area of doubt, and perhaps, the film may hit an emotional and personal chord with people who have strong faiths or strong beliefs in the use of data and proof. Thankfully, I Origins does nothing to prove either subject as a favourite or underdog. Instead, the film offers a platform for intense conversation and analysis well after the final credits roll.\r Art is one of the largest catalysts towards asking the unanswerable and questioning the unbelievable. Cahill’s film style could be best described as a cinematic lens into the reality of grand human perception. Ambitious and wholly entertaining, I Origins may very well be one of the longest talked about films of the year and surely the most talked about indie film of the summer."
    },
    {
      "rating": "10",
      "text": "A must-see movie. Beautiful, deeply moving, spiritual film about the the soul. Brit Marling is excellent as the lab assistant adding grounding to this haunting love story about the unknown. Read the trivia section on IMDb to fully appreciate the significance of the 11's."
    },
    {
      "rating": "4",
      "text": "The plot is okay but this movie is way too predictable to be any good. Perhaps some better editing and a shorter length would have helped. What could have been a good film was executed very poorly. Even the ending was blatantly obvious. The movie might as well have had director commentary giving away plot points.\r The (unnecessary) science jargon/aspects has some poetic license too, searching individual organisms - really? We can map a genome but we can't search through more than one at a time?"
    },
    {
      "rating": "9",
      "text": "Incredible idea of a hypothetical link between that which is not seen through the sensory perception & that which is physically seen.\r The environment in which all is woven into contains the duality of Spirituality&Science, Yang&Yin, Metaphysical&Physical, etc... (with the 3rd force not being directly observed).\r 9 not 10, because the Soul-Spiritual aspects of the ' I ' evolve from one to another incarnation and it's reflection(s) in the physical body would thus differ with each subsequent incarnation."
    },
    {
      "rating": "10",
      "text": "I found that point in this movie is not that souls travelling, but it's about how something that we believe in very hard can be demanded and that we always must have a space for other option: What if...?"
    },
    {
      "rating": "9",
      "text": "Great film that implores you to keep an open mind to possibilities and the un-explainable. It's a fun ride that'll grab your interest even if it doesn't change your perspective.\r Definitely worth a rent."
    },
    {
      "rating": "0",
      "text": "Je ne sais pas trop ce que c'est que ce truc, à part le fait que ça doit venir de chez Conforama ou Ikea... on a en effet rarement autant meublé pendant même pas deux plombes... qui en durent ou qui semblent en durer le triple. Ou le quadruple.De toute façon, ça raconte de la merde et quand ça raconte pas, ça se con-tente de meubler comme un con de film de crevards de pseudo-intellos qui se regardent le nombril...et fument carrément trop la moquette de la salle de bain super trop élimée, tu vois ?Donc aucun intérêt aucun, allez plutôt faire un tour à Confo, ce sera toujours infiniment plus utile que tenter de visionner ce salmigondis lamentable."
    },
    {
      "rating": "5",
      "text": "I Origins succeeds in presenting a complex and deep subject, but is lost in its own argument by not taking it to a safe port. It has its faults, but I personally enjoy it.This movie will not please those who like everything explained and easy, but if you are interested in cinema with more brain here is a good example."
    }
  ],
  "recommendations": [
    "silence",
    "snowden",
    "in_the_shadow_of_the_moon",
    "benedetta",
    "dark_waters",
    "personal_shopper",
    "the_pianist",
    "nine_days",
    "high_life",
    "agora",
    "donnie_darko",
    "a_hidden_life",
    "ex_machina",
    "mainstream",
    "the_imitation_game",
    "the_33",
    "eyes_wide_shut",
    "flashback",
    "gattaca",
    "nomadland",
    "the_guilty",
    "colette",
    "the_fountain",
    "dark_city",
    "arrival"
  ]
}