{"id": 1132, "title": "I See You", "starring": ["Helen Hunt", "Jon Tenney"], "runtime": 98, "genre": ["Thriller", "Mystery", "Horror", "Crime"], "description": "When a 12-year-old boy goes missing, lead investigator Greg Harper struggles to balance the pressure of the investigation and troubles with his wife, Jackie. Facing a recent affair, great strain is put on the family that slowly gnaws away at Jackie's grip on reality. But after a malicious presence manifests itself in their home and puts their son, Connor, in mortal danger, the cold, hard truth about evil in the Harper household is finally uncovered.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/2LwamrHAmxqEHsT9JViFJxT08Ek.jpg", "categories": {"plot": 7.173913043478261, "acting": 5.928571428571429, "ending": 8.0, "soundtrack": 1.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 8.0}, "reviews": [{"rating": "1", "text": "(Mauro Lanari)The serial killer is murdered while trying to explain the reasons for his behavior (a childhood trauma?). Maybe the debutant director doesn't give a about making us understand the first half of the film, in which he shows a family drama. Thus Helen Hunt and the other characters lose sense and dimensionality, ultimately functional just to a stupid whodunit built like a little \"Memento\". And when the story is reduced to a single McGuffin, then you are no longer watching a horror movie but a horrendous movie."}, {"rating": "1", "text": "This movie uses lazy excuses for its shallow and plainly dumb characters and stiff performances, every \"plot twist\" becomes obvious by the beginning of the second half. The entirety of this movie is boring, the first half because it is shot like a scary movie while nothing happens, the second half because it relies entirely on the crippled plottwists to keep you engaged while anyone with half a brain-cell can guess what they are going to be. Still, until the very last second the movie exhausts this, acting like you don't know even after being specifically told.The soundtrack is mediocre and forgettable, the sounddesign builds up jumpscares that turn out not to be jumpscares too often. The only point is for the picture, which was a bit unfitting but looked alright."}, {"rating": "10", "text": "Y aquí tenemos a uno de los thrillers mas espeluznantes y escabrosos de los últimos años. Altamente recomendable."}, {"rating": "8", "text": "This story starts when a 12-year-old boy goes missing, but the focus is also on the lead detective (Jon Tenney) and issues with his wife (Helen Hunt). As the case unfolds, a supernatural element seems to complicating matters at home. Then…the whole thing heads in a different direction…two times. While it starts slowly, there’s enough about the situations and performances to keep it interesting. Once the revelations begin, the tension mounts and the whole story becomes very intriguing (and unexpected). It requires some patience to get to the good stuff (and the ability to ignore the heavy-handed music), but it’s worth watching the intricate pieces come into focus."}, {"rating": "9", "text": "For a Helen Hunt vehicle she really isn't in the movie that much, but regardless I See You is a very clever and creepy film that begs the question, why don't they make more 'Whodunnit' horror films?"}, {"rating": "8", "text": "I See You is a gripping tale that brings together a family of three, the law enforcement, and some strange beings that first gives you a feeling of horror but then later takes a virulent turn to shock and impress you as you stay invested in the plot till the very end, only supported by the arresting background score. Best watched in a home theatre. Also, I learned about a new concept here."}, {"rating": "8", "text": "A lot of things are going on in this excellent thriller which is, amongst other things, a powerful social commentary on youth homelessness AND the lifelong effects of child abuse. This makes it effectively equal parts drama and thriller, all the while it manages to trick us in its first half that we're watching the Nth supernatural chiller of 2019.The pic boasts such a thematic abundance that three of its major characters alone would deserve a dedicated movie of their own. Without trying to spoil things: I'm talking a.) the longtime depressed psychologist mom who seems to want out of her seemingly tranquil upper middle class family life, b.) her pill-popping police officer hubby with lifelong issues of his own, c.) a problematic young male character introduced almost casually about halfway of the movie.For once, the running time could be a good 20 min longer, fleshing out said characters more so that the punchline packs an even heavier blow.The first time writer of this one is the amazing (and still very young) Devon Graye, and he's one to watch from now on."}, {"rating": "9", "text": "this is a very creepy thriller/horror with an extremely clever plot. innovative and vastly underrated. absolutely loved it."}, {"rating": "8", "text": "I really enjoyed watching this movie. It started out very creepy and slowly kept ramping things up. The tone was just perfect for all of the “happenings” to be very unsettling. I don’t want to give anything away, but there is a filming/tonal change just about halfway through the movie around the second act. This makes the movie unsettling for other reasons. While this change slows the movie down dramatically, it really starts to pick up again in the third act. Thankfully it is very well cast and just as well acted - because if it hadn't been the change might have let you see some cracks in where the plot was steering and all the twists would be easy to spot from a mile away. If you are looking for an entertaining thriller this a solid choice."}, {"rating": "5", "text": "The suspense was interesting, that's a plus point, but the story is an incoherent mishmash that uses a lot of plot twists to keep you interested and that pretty much weakens everything because it doesn't have a strong foundation to keep things grounded, and in my case, well I lost interest."}, {"rating": "10", "text": "An unexpected experience. Exciting because of a well-constructed story with surprising plot twists from different perspectives. This movie was a pleasant surprise!"}, {"rating": "7", "text": "I’m gonna be honest with you guys. For the first half hour or so of this movie, I was not enjoying it at all. It was kinda boring and derivative (just a basic murder mystery/home invasion horror plot) and I was really close to just shutting it off. However, after that first 30 minutes or so, something happens that completely changes the whole movie that I don’t dare spoil. It made me so glad that I stuck with it. I still feel like I’ve seen stuff like it before, there are elements of Don’t Breathe, Summer of 84, The Perfection and even The Simpsons, but I still enjoyed it in the end. That’s all I can say without spoiling anything. Check it out if you’re a horror fan."}, {"rating": "8", "text": "If you want a movie that offers some good suspense and one that does a pretty good job with misdirection along with some WTF head scratching moments then you can't go wrong with this film.i recommend"}, {"rating": "8", "text": "Another week, and hopefully one step closer to a cure but until that day... STREAM TO BIG SCREEN will have to do. Thanks for coming back to get your daily or weekly dose of movie reviews. This week, we are reviewing a psychological crime thriller, I See You. This movie stars the acting veterans Helen Hunt and Jon Tenney as some strange occurrences are popping up in their lives personally, professionally, and physically. We get a look into their lives during an intense few days. So let's get to what there is to watch about I See You.Definitely going into this movie with zero expectations created streaming gold. Now, my wife and I love a good psychological thriller or horror movie, and this only slightly disappointed. By slightly, I mean, this movie takes a little too long to get going and also somehow takes too long to end, even though it's only about 90 minutes. It was a strange fit. I felt myself saying hurry up and get to it; and, then once we were in the meat of it, I found myself saying hurry up and resolve this thing. One could take that as a positive sign. There was a constant state of anxiety in this movie. If that's what Adam Randall was going for, then he succeeded. If this wasn't intentional, then you lucked out, buddy!It was luck in the sense that the storyline is very similar to a lot of movies or even Law & Order: SVU episodes. However, the movie has a pretty good twist that I wish I could say I saw coming but in reality I didn't. I think I must have been distracted by wanting the movie to getting going, and then being engrossed in the thick of the movie, and then, finally, wanting the movie to resolve. In fact, that's the sign of a very good movie. You think you know what's coming and BLAM-O the movie crosses you up like A.I. did Jordan (watch The Last Dance documentary, if you all get a chance).The only unfortunate part of this movie is the forgettable acting. Helen Hunt doesn't shine, and here, she can be quite annoying. \"Fitz\", or Jon Tenney, is just normal - literally nothing to write home about. The only standout performances were probably from Libe Barer and Owen Teague, but, they were also too minimally in the movie and/or a bit annoying during their scenes. Libe was too whiny and cautious for the actions she takes in the movie and Owen, while appropriate in hindsight, seemed too weird for the characters mindset.Nevertheless, I See You is solid addition to the Prime streaming service. The movie provides needed entertainment even with forgettable performances from the cast. The movie presents a familiar storyline with an intense and unique concept twist that keeps the viewer on their toes and full of anxiety. The thriller/suspense fans out there will be pleasantly surprised with this streaming feature. Grab that big box of popcorn and enjoy."}, {"rating": "2", "text": "WTF?Oh and the lead actress looks like she was moulded out of plastic.Avoid"}, {"rating": "7", "text": "Es una película decente; la trama está bien y las actuaciones de Jon Tenney y Helen Hunt son buenas; es de lo mejor en Netflix."}, {"rating": "6", "text": "If they left out all of the poorly written dialogue and the mediocre acting and just cut out the entire first half of this movie, it would have been a lot better. Once it started to move a little faster and there was less talking it started to actually get pretty good, but it was very predictable."}, {"rating": "7", "text": "Phroggers (it's a thing apparently) stay in a police detective's house but it turns out that he's really a serial killer, one of them knew that but stayed in the house anyway."}, {"rating": "10", "text": "Wow. This is one seriously effed up movie, but so scary good. Everything was awesome... cast, music, sound effects, multiple back stories and crazy plot twists. You'll never see it coming."}, {"rating": "8", "text": "An interesting movie. A twisted plot around traumas. Maybe a chapter 2 featuring their poor kid ? ^^ Helen Hunt seems a bit off being 20+y older than the role requirement but maybe i missed something playing my phone during the movie. She dates her patients ? Easy marks, transferrence all that. Anyway, a good surprise"}], "recommendations": ["a_perfect_getaway", "run", "marrowbone", "awake", "man_on_a_ledge", "the_rental", "the_call", "the_loft", "house_at_the_end_of_the_street", "summer_of_84", "the_uninvited", "gone_girl", "shut_in", "the_next_three_days", "the_good_liar", "split", "freaks", "identity", "dark_skies", "the_boy", "old", "disturbia", "ready_or_not", "would_you_rather", "the_invisible_man"]}