{
  "id": 1136,
  "title": "I Spit on Your Grave",
  "starring": [
    "Sarah Butler",
    "Jeff Branson"
  ],
  "runtime": 108,
  "genre": [
    "Thriller",
    "Crime",
    "Horror"
  ],
  "description": "Jennifer is a writer working on a new novel and, needing to get out of the city to finish it, hires a riverside apartment in upstate New York to finish her book—attracting the attention of a number of rowdy male locals.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4VZ9eqel8Fsp54KMnesr3xIc67N.jpg",
  "categories": {
    "plot": 5.086956521739131,
    "acting": 5.64,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 3.5
  },
  "reviews": [
    {
      "rating": "5",
      "text": "ok ok movie....nothing great about it....the only good part was the way the actress kills the bad guys .... the actress is beautiful but needs to learn some acting ...."
    },
    {
      "rating": "3",
      "text": "There is a lot to talk about here, so many things to discuss, so many mistakes, and lots of plot holes.\r To start with, I got that Jennifer Hills (age is not mentioned) is somehow in her early twenties and is WRITER! Did she even finish college? I wasn't really convinced, I guess that an older actress would be better, and I am not relating to the remake because I didn't watch it, I am judging this as a movie with no connections. There is a scene where she spills Whisky on her LEGS, why would she start washing her cloths the scene after This doesn't make any sense. Why would she kiss a stranger? Full of Dumb Actions, and that makes us care less for these characters due to their stupid actions/decisions. The characters are flat, just to carry the plot on, just veins, no digging the past at all, or anything else to make us care more for the character, and if the remade film is like this, they should have development.\r The whole movie is dull, although the raping scene is cruel shocking and disturbing, it is still dull and uninteresting, due to the flat characters that don't share feelings with the audience at all! Why? I don't want to spoil more, but there is some unexplainable things somewhere near the end (don't make any sense).\rBut I admit the third act is awesome, everything after the rape is pretty interesting, predictable but entertaining and shocking, it has that old school buzz to it, but it doesn't save it from getting negative response! The acting got better by the time. But on my own standards I won't recommend this to anyone, it is pretty sick, gross, disturbing and really shocking. No one wants to see anyone getting tortured especially seeing an almost innocent girl (she smokes weed) but still."
    },
    {
      "rating": "10",
      "text": "A little tedious in the setting up and most of the characters are unbelievable, but by the time the rape scenario is in full swing you get bucket loads of moralistic angst and a true emotional 'trip'. The plot falls flat in the second half of the film and is blatantly in-credible. This is worth a watch just for the gut-wrenching rape scene which is so charged with diabolical evil that it will have you wanting to turn it off."
    },
    {
      "rating": "10",
      "text": "One of the best horrors of 2010. Brilliant movie will have to at edge of your seats. Only thing the rape scene was way too long. Other than that awesome movie."
    },
    {
      "rating": "9",
      "text": "For people like me who like their movies as brutal, shameless, sadistic, and as shocking as possible, this is certainly worth a watch, but it unfortunately pulls its punches in places you really wish it wouldn't. The rape scene is lamentably censored, with very little nudity or violence. I give it props for at least offering a new type of sadism between the rapists, each with their own perversions, and the whole \"horse show\" thing was entertaining. But when Matthew is forced to rape Jennifer, the camera shows us almost nothing, basically only implying that it's happening. The scene is desperate for some good acting between Jennifer's terror and confusion along with Matthew's own, but we don't get that. We don't get a good shot of their faces as this is all happening, which is kind of central to the whole point. It's better than most rape scenes are constructed in film, but it's definitely pulling its punches, and it couldn't be more obvious and detrimental to the piece. The sheriff is a nice addition to the mix, and becomes the central character in the entire ordeal. His violent rape of Jennifer is particularly special (and her creative revenge is appropriate). The movie is paced pretty well; I didn't think the rape lasted too long, as others have been saying. I mean, it's mostly in real-time, and in the real world, some people like her are kept for days at a time being sadistically raped and abused, so thirty minutes isn't a big deal. The revenge sequences are creative and appropriately messy, and to my delight, were deliberately constructed for each rapist as for how they acted during the rape. Jennifer gets quite creative in her relentless hunt to take down each of them as painfully as possible. Unfortunately, while the murders themselves are good, she isn't a very good murderer. She lacks any kind of less-than-sane berserker rage that would naturally fuel her. She doesn't seem normal, or terrifying. Her acts are somewhat mechanical, done without much emotion, which is a shame, because her revenge fantasies are fueled by her lust for vengeance. She just looks too normal, too clean, to be what she is in this film. One of her choices is questionable involving the sheriff's family near the end. In all fairness, she had every right to murder them. She probably should have for their own sakes, with the knowledge that the sheriff is a sadistic rapist. What are they supposed to do afterward in a town like that? Either way, they're not getting a happy ending. Anyway, while some of the violence and rape is tragically censored for all the shock-value fans out there, and the realism gets a few points off for Jennifer's character not acting like a truly vengeful killer, it's nice to see someone try something like this and make it look pretty good. The scene when the rape is over and Jennifer is walking nude in a dissociated malaise is, thankfully, how a real rape victim would commonly act from the nightmarish shock, confusion, and pain of being gang-raped. That scene in particular is pretty killer. Worth a watch, for sure."
    },
    {
      "rating": "8",
      "text": "A gruesome adventure all together, but a great one that is. I'm not a fan of blood and gore but this is a must watch as it introduces vintage to the new generation of horror."
    },
    {
      "rating": "6",
      "text": "the brutality of the rape scene in the original version left me sick to my stomach. in this version it its been extremely toned down and extended, losing  its effectiveness. when the heroine comes back and starts killing her attackers its not nearly as satisfying. this movie reminds me of the \"last house on the left\" remake which also toned downed it raw brutality and replaced it with gory special effects."
    },
    {
      "rating": "7",
      "text": "**** me sideways, this is some nasty **** Its not a horror but mad and horrifying triller with nice but predictable twist. Only one thing is important, DO NOT watch it during the mean, it could get nasty!!!!"
    },
    {
      "rating": "6",
      "text": "It's hard to I like a remake more than the original one, but this convinced me, beyond that the cast is better and conciliated well with the new character which placed, in case, the sheriff. The deaths were way better, but I found that the villains still suffered little, if I were the scriptwriter their souls would run off of their bodies. The humiliation through which she passes on this one is much bigger than the original. I loved the way she kills with refinements of cruelty more than the original, the new character is persuasive and the athletic leanness of the protagonist conciliates with what she needs to do. She may be defenceless like at the moment of rape, or she can be aloof and strong as in time of the escape and revenge. And do you wanna know something? I'd do more for less."
    },
    {
      "rating": "9",
      "text": "The movie is good. I have not seen yet, but I saw the trailer, it will be good. A cool suspense, the actors are great, this movie has suspense from beginning to end."
    },
    {
      "rating": "8",
      "text": "When the original I Spit On Your Grave came out in 1978, it was so graphic and violent that it was banned from theaters and television. 32 years later and the remake is ten times as horrific and much more interesting. They'd planned to release this one in theaters but due to its NC-17 rating, they decided to go with the unrated direct-to-video method. This brutal and horrific story is about a writer who goes to a cabin in the woods to write her next book, when she becomes the victim of a horrible crime. She survives, but decided it's not justice she wants, it's revenge. I loved this film, because it's something that could actually happen, and when it's a realistic film, no matter how graphic, I find it to be that much more terrifying. If you have a weak stomach, avoid this one, because when I say it's graphic, it is ridiculously so! There is no way they ever would have been able to trim this down to an R rating for theaters, it's that brutal. Personally, I love films like this, the more graphic and realistic, the better, however many others don't agree and most critics claim the film made them physically ill. My suggestion, check it out and decide for yourself!"
    },
    {
      "rating": "1",
      "text": "I hardly agreed with Roger Ebert, but He was right on this one! A bloody disgusting garbage! Pure sadisctic trash for the mentally ill, sadistic people. If you enjoy watching the suffering of other beings you are sick!!!"
    },
    {
      "rating": "8",
      "text": "If you like revenge slash horror movies, then this is for you.   the plot begins when a female gets raped by 4 thugs and then seeks revenge..I guess the director decided to have a long rape seen so the audience wil feel more sorry for the girl."
    },
    {
      "rating": "7",
      "text": "It was a good film, not much horror so as a thriller. I think that women (this is coming from a guy) are sometimes better action stars and killers then men. Ex. Resident Evil, Nikita, Psycho, Columbiana, and Pretty Little Liars. They just bring more then films like Takers, Drive, Lost Deventions. But back to the film, it like this watch is by yourself even in the day time. and you will find yourself looking around for this women in your house."
    },
    {
      "rating": "5",
      "text": "have you ever seen a snuff film? well if you wach this you pretty much can say you did. its not a bad movie . the premise is intresting and very simple . a girl goes up to a cabin to write a novel a group of guys rape her she gets revenge . simple enough right. the problem is the pacing with the rape scean . it just drags on waaaaay to long . i think it was around 30 min or so. i mean i get it we are suppose to feel horrable for this poor girl and can get behind her for what she is about to do but i felt 30 min of waching her get raped was just over doing it . i think spending 5 min on it would have been plenty. this is a very hard film to recommend and only saw it cause it was 99 cents on vodu . if you are easily disturbed i say avoid it ."
    },
    {
      "rating": "0",
      "text": "\"I Spit on Your Grave\" (2010) A MoviesForever Review.\r Director Steven R. Monroe remade the 1978 Gruesome hit \"I Spit on Your Grave\". While, yes, shocked millions of people with its bold and brash plot and sequences of disturbing events, still is not an enjoyable experience in any means. And now, it has been updated (Remade).\r \"I Spit on Your Grave\" (2010), is not in any way possible an enjoyable movie. But an extremely shocking experience, with its frankness and naive simplicity. This movie is a dull, hollow experience, so flawed and tired. It is overall very violent and frightening to watch at times, it is absolutely a hard and tough watch. The violent moral of this disappointing movie is distasteful and offending. It is the ultimate brutality against women, and anyone who enjoys watching sexual assault performed at women is absolutely a sick person with no sense of feelings.\r The only one positive thing I can say is that the third act of the film is intense at a point. Although served with ridden of cliches and second-rate overused ideas. We get nothing.\r A MoviesForever Review"
    },
    {
      "rating": "7",
      "text": "Well, the first one was quite bad in my opinion. The \"disturbing\" scenes are not convincing at all. rape scenes was pathetic, acting and the atmosphere was terrible. It was just slipshod and amateur movie. The only good thing about this movie is Camille Keaton's beauty. She's quite pretty. This version was much better than the old version, just admit it. Not a great movie but i'm pleasant."
    },
    {
      "rating": "8",
      "text": "Let's start with the good points.The acting was okay, the locations were beautiful and the deaths were gory. And now the bad points. The traps and the torture scenes were pretty much unbelievable because they were really elaborated and there was some plot holes here and there and the way the movie is, it makes you more  sad for the bad guys than the girl.Finally. The movie is pretty good but don't think too much while watching it because most of the time, it won't make sense."
    },
    {
      "rating": "0",
      "text": "Seriously .. I think it is the worst film ever seen. At first I resisted until I see those scenes with that girl. I do not know, this film really did not like at all, absolutely not. I know it is a remake film \"Day of the Woman\" .. but honestly. These types of movies are not my taste."
    },
    {
      "rating": "5",
      "text": "Definitely one of the most disturbing movies I've seen in quite a while. It's pretty dull throughout the first half of the movie, and there's not much of a story, but man was the revenge brutal.... I think the new Last House on the Left did the rape and revenge thing a lot better (it's one of my favorite remakes), but I Spit on Your Grave is still okay if you like these sorts of movies and don't really care about a plot. If you're looking for a visceral, intense, and memorable revenge flick though, I advice you to look somewhere else."
    },
    {
      "rating": "0",
      "text": "Sometimes my curiosity is my biggest enemy.\r Remake of the dreadful 1978 Day of the Woman: A writer is raped and brutalized at her cabin retreat and left for dead - but she lives and seeks revenge against the men who attacked her.\r The two things that I deeply hate in movies has to be Mindless blood and gore and Rape, and this movie is the full bag of those two. The reason why I watched this because...well I never heard of this film before. I heard a lot of people talk about it and what I heard wasn't very positive. When I watched the film I couldn't help to ask the one question, who enjoys this? seriously who in hell enjoys this graphic, torture porn of mess.\r I Spit on Your Grave made me feel dirty inside, like I'm covered in muddy dirt that's everywhere around me.\r When the main character dose get her revenge on them who cause such pain to her. I didn't really give a fuss about her character wining towards the end. It just felt so rushed and if you showed her recover after what happened to her and show about days going by as she trying to deal of what just happened to her then I can see her turning into torture murder herself. But in this her character start's of sweet and harmless, and then out of no where she turns into a killer who looks like she killed most of her life. That's just bad writing.\r The movie has some good shots of the open view of the lakes where the girl is staying and the wide shots in the movie, but the rest sucks. Bad directing, horrible writing and dreadful acting. Oh and by the way I'm not seeing the second one. Why you my ask? because I'm sick and tried of seeing these horror films with mindless torture porn and rape in it, who the hell enjoys that.\r Overall I Spit on Your Grave has to be the worst remake I've seen since well the other bad horror remakes in the past. This movie should be buried and forgotten."
    },
    {
      "rating": "6",
      "text": "This film is the remake of an older film from the Seventies, which fell into relative forgetfulness due to it's brutality, very graphic and raw. The new film is very faithful to it's predecessor and tells, in essence, the same story.In the film, young writer Jennifer leaves the city and goes to the countryside, where her beauty stands out and attracts the unwanted attention of a group of men who come together to arrest and sexually abuse her. Repeatedly raped, humiliated, beaten and wounded in her body and in her self-love, she is left to die by the group, which also belongs to the local sheriff, one of the most brutal rapists. Attempts to cover up the crime are evident, but nothing works: she survives and comes back to avenge herself, killing them all in a revenge that only a wounded woman would be able to do.The film is quite tough and violent, but the degree of rawness and brutality is much lower than it's predecessor of the Seventies. The older film was much more difficult to see, has a greater and more shocking degree of violence and its cast spends a considerable part of the film undressed, which is why I considered this film highly inadvisable for adults who are more impressionable (of course, it's an unthinkable film for young people or children). More than rape, what shocks and disturbs us in this film is the way men who are perfectly inserted in that social environment and even has some prestigious positions - the sheriff's example - manage to be capable of those atrocities and have such awareness of their own impunity. Another thing that strikes us is the way she kills them, with refinements of cynicism and some pleasure, as we see in horror slasher films. The cast consists of a series of illustrious strangers. Still, I liked the work of Sarah Butler and Andrew Howard, both of whom are very committed to their characters.Technically, it is a film that does not stand out nor has much to present. Not having a high budget, it used what it had. There is a lot of blood, and the makeup work has been done quite well. The film uses a reduced and discreet soundtrack, which lets the plot itself to shine. Cinematography does not stand out, either the sets and costumes."
    },
    {
      "rating": "8",
      "text": "OK so if you choose to watch this movie, you can only really rate it on how good the acting and violence is. With that in mind this film does exactly what it says on the tin. Acting good, violence really good. Some of the kills are extremely gory which is just what I wanted to see. I can never understand people watching a film knowing before they choose to watch it that it's not their cup of tea. Guaranteed low score and poor review, if you know you are not going to enjoy something why would you choose to do it?. Quite frankly these people are idiots. Forget any kind of feminist message this film is simply a nasty revenge flick and is one of the better ones of its type that I've seen."
    },
    {
      "rating": "7",
      "text": "This movie is not able to cross the original \"I Spit on Your Grave\". This movie had longer running time but it was not used properly. The original was raw, brutal, and ugly; and it was also saying something about victims and their attackers. One thing was better than original, the revenge scenes. They were way brutal. It's setup was better than the original.Overall, while \"I Spit on Your Grave\" is a better-made movie, I didn't get that same level of intensity from it that I got from the original \"I Spit on Your Grave.\" Because it abides more by contemporary horror standards, it lessens the overall impact. It is still, however, a good remake."
    },
    {
      "rating": "6",
      "text": "I Spit on Your Grave s pretty cool horror.  The main character gets involved with a couple of guys, and that's the whole movie.  The scenes are really delicious and it's great to watch.  There is one part that is predictable and the story is not masterful and overall it is such an above-average film for me.  If you like rougher scenes, you should enjoy the film as much as I do, but if you prefer a real story, then I don't think this film is for you."
    },
    {
      "rating": "5",
      "text": "A silly film, made to disturb, because different from the original, the main actress is very bad and ALL the actors, except for a rapist policeman who appears in the film, BUT, ALL THE ACTORS ARE HORRIBLE, despite the plot being equally disturbing and striking that of the first film, there was a lack of good performances."
    },
    {
      "rating": "5",
      "text": "The movie lives from being a shocker, but once you got shocked, there is not much left. The story is eh, the atmosphere is okay."
    }
  ],
  "recommendations": [
    "i_spit_on_your_grave_2",
    "hostel_part_ii",
    "knock_at_the_cabin",
    "the_green_inferno",
    "the_last_house_on_the_left",
    "the_hills_have_eyes",
    "hostel",
    "case_39",
    "would_you_rather",
    "the_strangers",
    "the_collector",
    "revenge",
    "leatherface",
    "saw_iii",
    "brightburn",
    "mama",
    "eden_lake",
    "the_forest",
    "the_purge",
    "the_strangers_prey_at_night",
    "splice",
    "terrifier",
    "final_destination_2",
    "red_sparrow",
    "colombiana"
  ]
}