{
  "id": 1798,
  "title": "I Spit on Your Grave III: Vengeance is Mine",
  "starring": [
    "Sarah Butler",
    "Jennifer Landon"
  ],
  "runtime": 91,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Jennifer Hills is still tormented by the brutal sexual assault she endured years ago. She’s changed identities and cities, reluctantly joining a support group where she begins to piece together a new life. But when her new friend’s murderer goes free and the tales of serial rapists haunt her, Jennifer will hunt down the men responsible and do what the system won’t – make them pay for their crimes in the most horrific ways imaginable. Only this time, no jury may be able to save her.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jG5GDIcqiqHXkvINZSjyzBUO2vH.jpg",
  "categories": {
    "plot": 6.4,
    "acting": 5.666666666666667,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Unlike previous films, it strives for originality and difference.This is the second sequel to the 2010 film “I Spit On Your Grave”, and it was for me the best of the three films so far. Directed by R.D. Braunstein, the film has managed to capture my attention like none so far. Without excessive nudity, without sexual appeals, it is a film that makes us accompany Jennifer on a journey of revenge against men in general.The story takes place a few years after the dramatic events experienced by Jennifer Hills. She has adopted a new name and lives in a new city, but she is still very upset by what happened to her, to the point of having moments when she wants to hurt other people. Permanently defensive, she is advised by her therapist to attend a help group for victims of rape where she meets Marla. With it, he will become a kind of avenger. However, Marla's death leads her to start acting alone and to attack and kill the men who have harmed other women she meets in the group.Finally, the series met a film that stands out for the difference and is not limited to copying what has already been done! Here, basically, the victim becomes the aggressor. As she says at the end of the film, \"predators and prey\" ... it is how she sees the world, and she is not willing to be arrested again by anyone. The strength of the film is based on the good construction of the characters and the way they capture our sympathy or contempt. The film also has a lot of good dialogues, and material that makes us think about how women are treated, how justice and the police work in cases like this, how doing justice by hand can be the right attitude when the legal mechanisms fail ... in that respect, this is the most intellectual, dramatic and reflective film in the series, and that is really good. The film also has several intense scenes and some very graphic deaths that will please those who liked what was done in previous films, as well as a single attempt at violation, the only part of the film where there is some nudity as well. The end of the film is the hardest part to swallow because it gives the feeling that the protagonist has gone crazy.The cast is again led by Sarah Butler, who now has the time, space and material to show us her true value as an actress. She is a young actress, but what she showed us here is enough to convince us that she has potential and can improve with time and experience. Jennifer Landon gave life to a character with a strong character and was happy in her work, as can Doug McKeon, who gave life to the father of a rape victim, the most tragic character in the film. Gabriel Hogan, Harley Jane Kozak, Michelle Hurd, Megan Raich and Christopher Hoffman also did a satisfying job on supporting characters.Technically, it is a medium quality film that, despite everything, does what it promises and is happy in its effort. He makes regular use of cinematography, sets and costumes. The action is there and it works. There are intense scenes made with visual effects good enough to be credible. The editing work was well done and the pace of the film is quite regular and pleasant. The soundtrack, although not brilliant, fulfills its role."
    },
    {
      "rating": "9",
      "text": "Well, except for the last part, the rest of it was really a pleasant surprise. Part 1 & 2 were about the same kind of rape first then revenge approach. Thus, I wasn't really looking forward to Part 3, thinking that its gonna be more of the same. Thus, I was really pleased with the change in storyline. Now, its about the girls taking it to the boys; not the usual way around. Both lead ladies displayed their tenacity when taking revenge. Story was refreshingly different. In Part 3, the usual nudity has been replaced by the creative use of violence against men. Overall, I was entertained throughout."
    },
    {
      "rating": "1",
      "text": "The Dudes make three films remaking a story, and in the three films, all the performances apart from that of the first policeman are bad, however, the other two films are average films, but this one takes the story of the first one, which works the most after the original and destroys bringing horrible actors, and a dull plot. Weak directions and even more performances, if you want to see blood and disturbance I recommend martyrs (2008), a film with a much better direction, much better actors and equally or even more disturbing because this film here is worth it, and neither violence nor the deaths are legal, he took the franchise and threw it in the trash."
    },
    {
      "rating": "7",
      "text": "As a follow up to the first part, Sarah Butlers character kind of loses her mind even further. I was glad to see that it was not just another rape revenge like part 2 but explored the character more."
    }
  ],
  "recommendations": [
    "elle",
    "white_boy_rick",
    "a_history_of_violence",
    "beirut",
    "the_last_duel",
    "the_experiment",
    "sicario_day_of_the_soldado",
    "thoroughbreds",
    "child_44",
    "nocturnal_animals",
    "donnie_brasco",
    "the_witches_of_eastwick",
    "arbitrage",
    "secretary",
    "21_grams",
    "prisoners",
    "the_beguiled",
    "hollow_man",
    "widows",
    "trainspotting",
    "cold_pursuit",
    "a_most_violent_year",
    "the_girl_with_the_dragon_tattoo",
    "the_equalizer_2",
    "stoker"
  ]
}