{
  "id": 1604,
  "title": "I Spit on Your Grave 2",
  "starring": [
    "Jemma Dallender",
    "Joe Absolom"
  ],
  "runtime": 106,
  "genre": [
    "Thriller",
    "Horror",
    "Crime"
  ],
  "description": "Naturally beautiful, Katie has just settled into New York where she, like many other young women, is trying to make it as a model. But what starts out as an innocent and simple photo shoot soon turns into something disturbingly unthinkable! Raped, tortured and kidnapped to a foreign country, Jessica is buried alive and left to die. Against all odds, she manages to escape. Severely injured, she will have to tap into the darkest places of the human psyche to not only survive, but to exact her revenge…",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cy3zp7PA4JFq8bT0WwSi8uDlrbD.jpg",
  "categories": {
    "plot": 4.416666666666667,
    "acting": 3.8333333333333335,
    "ending": 4.166666666666667,
    "soundtrack": 2.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Revenge is best served cold, not rushed.\r I know what a lot of people are thinking right now, \"Matt, why in the hell would you even watch this movie? and you hated the first movie, so why bother watching it and reviewing it?\". That's a good question, because I don't know myself. I just watch a lot of things that are either good or bad, but with \"I Spit on Your Grave 2\" I knew off the bat that I was going to hate it, but for reasons of what brought myself into watching it sadly can't be answered, or maybe I'm just a fool for watching movies like this.\r Okay, all that aside now. So what did I honestly think of this movie, well I can start off by saying that I didn't like this movie at all, not because of it's absurd rape scenes or it's cartoonist torture scenes, but because it was really boring. Are main character goes out for revenge for those who kidnapped her, violently raped her and left her for dead, but the problem is that when she does get her revenge, I never felt satisfied and it was kinda rushed. I also found it kind of strange that she knows where they all are at the right time. The movie tries to be shocking and it fails at doing that.\r Overall I Spit on Your Grave 2 is freaking terrible and very dull to watch. It's basically a rehash of the first movie when you compare the two. The acting wasn't convincing, it isn't original, it's execution was poor and when Katie (Jemma Dallender), tries to act hard and scary when she goes on her revenge spree, it was very laughable at times."
    },
    {
      "rating": "2",
      "text": "This film is the sequel to the film “I Spit On Your Grave”, released a few years earlier as a remake of a much earlier film from the Seventies. Again, it turns out that the sequels, as usual, are significantly inferior to the initial film. In fact, this is a repetition of what we saw in the previous film, changing only the context, the cast and crew: it's the same thing, albeit in a new packaging.In this film, we follow the young aspiring model Katie Carter. In her desire to make a career in fashion, she will need to make a better portfolio with a good photographer, but she will choose the worst possible option: kidnapped by three brothers, she is humiliated, beaten, tortured and, finally, repeatedly raped. The film is quite vile and I don't even recommend it to more sensitive adults. Children or young people are out of the question! In any case, Katie manages to survive the ordeal, revenging herself and cruelly killing the men who abused her.For those who have never seen the film of the Seventies or the 2010 film, this will certainly be impressive for its harshness and sadism. However, for those who have seen both films, as I have seen, it's very restrained. Personally, I think that the level of crudeness and perversity reached in the Seventies remains unbeaten and this film does not bring anything that we could not see in the previous films. The rape scene is very contained, there is a lot of nudity but nothing that shocked me (the Seventies film was much more abusive at that point). The deaths are quite conventional, with the exception of the final climax, which is really violent. The director, Steven R. Monroe, did a relatively blunt job, betting everything on brutal and shocking scenes, having been unable to create a good story to build some empathy between the characters and the audience. The dialogues are truly amateur and I'm still here wondering why the hell a priest appears in the film!The cast is made up of third-rate names or even newbies looking for an opportunity: this is the case with Jemma Dallender, the protagonist, Yavor Baharov and Aleksandar Aleksiev. There are some experienced actors like Joe Absolom, George Zlatarev, Mary Stockley and Valentine Pelka in supporting characters. The overall performance of the cast is decent enough but there are no great positive notes to highlight: on the contrary, Dallender proved to be a relatively dim and uninteresting protagonist, with whom we do not care at all.Technically, its a film that does not stand out or have anything to present. Following on the trail of the first film, it bet everything on violent scenes, although not necessarily graphic, with good visual effects and enough fake blood to please gore fans. Not having a high budget, it used what it had. The makeup and costume work was well done but it's within what we were expecting to see. The soundtrack is virtually erased and the cinematography is amateur."
    },
    {
      "rating": "7",
      "text": "Since I like movies that push the envelope as hard as they can (and I've never been able to see a movie as anything but actors on a screen, so I never get scared or even grossed out--it's always just props and stages to me), movies like these are up my alley. Not bad, but not particularly good, either. Almost identical to the 2010 remake, but with a change of setting and new antagonists. Katie (wasn't the first girl called Katie, too?) is a carbon copy of the previous anti-hero, even to the point where, during the revenge part of things, she acts practically the same way, feeding back lines to her captors and such. I was disappointed when she emerged in the Church, began reading the Bible, but then that was the end of the significance of that. I was sort of hoping for a different theme to the killings, even a sort-of medieval, religious-history-based one. Nothing of the sort happens, sadly. Sometimes what Katie says doesn't really make sense, like when she says, \"They used to treat mental illness with shock therapy...\" They still do, you moron, just not quite the same way you were doing it (read up on ECT if you feel like being smarter than everyone else about that nightmarishly-portrayed treatment that isn't anything like how it's ever been portrayed in film, and genuinely works and is painless). Then there's the thing with the cop dude, whatever his name was. What was the point of his character? All he does is follow her into the sewers, then does things that are astonishingly unrealistic (why the hell did he shoot the totally-unarmed and bound guy when her head is right next to his? The heck was that about? What was even the point of it, if only for the audience's sake?), and the priest's role is apparently just to mention that hey, someone might be seeking vengeance because she left that part open while she was reading the Bible. Literally, that's it, but it was just thrown in without any follow-up. Kinda lame. The other characters had virtually nothing to them, either. What was with that guy with the shocker? He just does his thing and we wait for him to get it served back to him. I mean, can we at least find some reason to feel something for the bad guys? Can they at least have a reason, or anything? Otherwise it just feels like a puppet show with props and a lot of fake blood. I like connecting my characters to the violence on-screen, which is what good horror/shocker films do. Even \"A Serbian Film\" had that much done with its characters. I will admit, though, I laughed at the guy's testicles literally popping open like cracked eggs onto the floor. Sometimes inadvertently funny, never shocking, never surpasses the original in any meaningful way. There's no reason to watch it twice; it's not like you missed anything important. Still, what a waste with the Church scene she was briefly a part of. They did literally nothing with it, and I was hoping for some sort of creativity in the revenge kills, but nope. Standard stuff, and even the same style and characters. Surprise me once, or something."
    },
    {
      "rating": "8",
      "text": "If you liked the first one, chances are you gonna like this one as well.\rthe cons for me were that it acts out pretty much almost exactly like the first even to the point of her saying back to the attackers what they had previously said to her.\ras far as gore goes, this beats all other movies imo, even the recent Evil dead Remake.\rnot a film for the faint of heart, but then again, neither was the first."
    },
    {
      "rating": "4",
      "text": "The sequel to 2010's remake of I Spit On Your Grave, features a very similar storyline, however it takes torture and gore to whole other level. Unlike many Horror fans, I love blood and gore, but there has to be a line, and this film crossed it early and often. I've seen thousands of movies and a good portion of my collection is Horror, so I thought I'd seen it all, then comes this film. Using blood, puss, feces, and extreme genital mutilation, I Spit On Your Grave 2 is so extreme, that even I was wincing and turning away from the screen. The story is almost identical to the first, as a young woman is abducted, raped, tortured, and left for dead, but she survives and plans her brutal revenge. The first film took place in a cabin in the woods, while this one features a girl abducted by human traffickers and brought to Belarus. Other than the location and the extreme depravity, these films are nearly identical, yet the sequel gets two stars less than it's predecessor because it is much too long and it really is vile. I understand that Horror is a very hard genre to develop original ideas in, and I also understand that in order to stand out, one director is always trying to out do the other, but this movie is so beyond disgusting that it makes the Saw movies look like a Disney production. As for the cast, it is almost completely comprised of newcomers, and unlike the first there really isn't a whole lot of dialogue. Jemma Dallender stars, and while I appreciate that even pretending to have some of those things done to you must be rough, she really shows no personality. She's a victim from the second the film starts and transforms into a psychopath who simply repeats her captures lines to them as she tortures them back. The 2010 remake had a good story, was well thought out, and while it was pretty violent, it was within reason. I Spit On Your Grave 2 is nothing more than a snuff film, with scenes of things that people should never see. The first film was a must see movie, but as is often the case, you can really skip the sequel."
    },
    {
      "rating": "4",
      "text": "I really never expected a sequel to this original movie. Actually, it\rwas not a follow-up, but the story that happen is a similar fashion to\rthe earlier movie. You know a young woman will be brutally raped by\rsome gang men and the woman rises from the ground to take revenge. Yes\rthe same story theme, but in different location and people.\r I was impressed with this second part's modification, very simple yet\rmaintained the originality. My concern was the female lead, she was\rgood looking and pretty, but in all the important scenes she was kind\rof annoyed with overdone everything. Except that it was an acceptable\rmovie which stands as the title say."
    },
    {
      "rating": "8",
      "text": "Great movie. Hardcore rape and revenge. Sad to watch at first but ends well with a crazy twist of revenge."
    },
    {
      "rating": "5",
      "text": "This film is as mixed as the first containing a mixed note like everything, because here the same mistake happens when it comes to calling a protagonist to act, you don't even want to see her background, and some people come to tell me that I don't like violence but, violence for me doesn’t matter but, the actors are very bad as in the first film, however, if the quality didn’t decline here, the THIRD FILM will arrive, THAT ONLY I WAS CRAZY ENOUGH TO SEE THIS **** but in the second it is assistable."
    },
    {
      "rating": "6",
      "text": "If you've been unfortunate enough and watched the first \"I Spit on Your Grave\" you'll know what to expect. This movie has the same concept as the first one, revenge. I Spit on Your Grave 2 represents more of an interesting character, strong and beautiful. This sequel is ten times more Twisted, Shocking and Disturbed than the first one. Although there are improvements enough to gain a higher rating than the first, there is still lack of explanation. Flat characters are present, but more bearable than the first (not as bad). It is more new, creative and pretty much more interesting than its predecessor. There are some visuals and color contrasting, although it wasn't their aim to have cool visuals but it worked for me. Katie is more secure than Jennifer, but still makes the same mistake as Jennifer, she trusts strangers. If I dig into its mistakes, first of all, I would spoil a lot, and secondly I would make you avoid it, I don't want you to avoid it as much as the first one, because this sequel (straight to Video) is way better than the first (theatrically released). Finally, I will not recommend it for everyone, but it is somehow worth a look. Skip the first and watch this one, they are not related in any means."
    },
    {
      "rating": "4",
      "text": "\"I Spit on Your Grave 2\" (2013) A MoviesForever Review.\r While being more disturbed, twisted and a lot more shocking than the first one. It is not being an ultimate offend to women; Katie is more secure than Jennifer (from the first movie) and thinks three times more than Jennifer does before making any actions. This sequel still has a naive simplicity but is self secure and assuring to stay limited and not cross the line into being an ultimate rubbish.\r In this sequel, the heroine is portrayed as a thinker and planner, not just straight to the point revenge seeking female. Jennifer (from the first movie) isn't a dumb person, but the person who does stupid actions, and say things that might be life threatening, like your house location to a stranger. At the beginning Katie is presented as a trap making person (smart and tricky) but likable although you don't overall care because feelings are not shared between the audience and Katie, which was a lack of a hundred in \"I Spit on your Grave\".\r The tension is more solid, the acting is still mediocre. There are lots of lacking scenes and shots, there are unreasonable plot holes, that are really annoying and affecting the movie, negatively speaking. This sequel is a big improvement on the first, but still lacking, gruesome and at parts offending to women. Isn't overall a must but deserves your look and attention.\r A MoviesForever Review."
    },
    {
      "rating": "7",
      "text": "Follows the same beats as its predecessor, but the new environment and the highly capable leading woman make this an ultimately satisfying stand-alone revenge flick and a rarity among horror: a good sequel."
    },
    {
      "rating": "1",
      "text": "Cette suite qui n’en est pas une remet le couvert avec quelques variantes mais surtout beaucoup d’incohérences… tellement d’incohérences qu’on ne les compte plus et forcément, on décroche bien vite : ce film reste un gros navet qui n’apporte rien au genre volontiers sadique (de part et d’autre) du viol et de la vengeance…Tout le monde joue très mal là-dedans (la violée ainsi que les violeurs) et la cruauté putassière s’avère à la fois plus caricaturale et ridicule qu’autre chose… Néanmoins, on pourra se rincer l’oeil (bien que très furtivement) sur la petite bonnasse qui en prend pour son grade… et d’un autre côté, les féministes apprécieront sans doute les châtiments prodigués lors de la vengeance vengeresse par la cocotte très remontée (elle casse les coulles pour de vrai… dans un étau !).On en rirait presque tellement c’est grotesque si le sujet n’était pas à la base aussi scabreux (évidemment)… mais là aussi, même au second ou au troisième degré (involontaire) ça ne fonctionne toujours pas ! ça reste de la daube, quoi qu’il arrive…Non, on recommandera plutôt un autre film infiniment plus efficace, cynique (et drôle… et intelligemment féministe !) sorti en 2018, à savoir l’excellent Revenge, toujours inégalé (dans le genre) à ce jour."
    },
    {
      "rating": "6",
      "text": "A slight improvement compared to the first part, but overall nothing more than average. Its basically the same concept as the first one, but a bit better."
    },
    {
      "rating": "0",
      "text": "I'm not sure which is more disturbing. The fact that this movie exists or the fact that there are sick twisted individuals who would try to defend it in any way. Especially to laughably suggest it is somehow empowering toward women. None of these movies (including the original, or the first remake, or the various Lash House on the Left remakes) are ACTUALLY empowering. Bu this one is probably the worst. I clearly exists SOLELY for the director to get his jollies repeatedly showing the brutal rape and beating of a young woman. Because unlike the other movies of this genre, that lasts for over half the movie. And I truly wonder if those giving it good reviews even bothered to watch the rest, since clearly they came for the nudity, and brutality against women, and watched that multiple times.And I haven't even gotten into other \"normal\" critiques. Like how the lead is simply not likeable. My guess is, that was a conscious choice by the director to justify the brutal rape and torture of her. Like when she escapes and is being interviewed by the Russian cop. They will surely claim she was so awful to him because of her emotional trauma. But really, it was just so they could justify the additional rape and torture she would receive in the next scene.Oh, and finally, the absurdity of the plot. Yeah...you can definitely smuggle a woman from NY to Bulgaria in a suitcase! Yep. Nothing to see here, Mr. TSA agent. Yes, I check the box saying my review contains spoilers. As if that matters. No one watches this for the plot. As for any sort of \"twist\"? I wonder what people who think there is a twist at the end were expecting? Because it is like jumping out of an airplane and being surprised by the fall and impact with the ground."
    }
  ],
  "recommendations": [
    "i_spit_on_your_grave",
    "hostel_part_ii",
    "the_last_house_on_the_left",
    "the_green_inferno",
    "leatherface",
    "would_you_rather",
    "brightburn",
    "exorcist_the_beginning",
    "the_unborn",
    "texas_chainsaw_3d",
    "priest",
    "splice",
    "saw_iii",
    "hostel",
    "case_39",
    "knock_at_the_cabin",
    "the_strangers",
    "final_destination_2",
    "the_purge_election_year",
    "house_of_1000_corpses",
    "the_purge",
    "the_hills_have_eyes",
    "repo_men",
    "the_curse_of_la_llorona",
    "the_strangers_prey_at_night"
  ]
}