{
  "id": 2615,
  "title": "I Still Know What You Did Last Summer",
  "starring": [
    "Jennifer Love Hewitt",
    "Freddie Prinze Jr."
  ],
  "runtime": 100,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "Ever since killing the Fisherman one year ago, Julie James is still haunted by images of him after her. When her best friend Karla wins free tickets to the Bahamas, Julie finds this a perfect opportunity to finally relax. But someone is waiting for her. Someone who she thought was dead. Someone who is out again for revenge.",
  "releaseYear": "1998",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/motBJIO921LFZkoGKCSbmSCVHBc.jpg",
  "categories": {
    "plot": 6.3,
    "acting": 5.0,
    "ending": 6.285714285714286,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.5
  },
  "reviews": [
    {
      "rating": "5",
      "text": "The movie is not bad, but is much lower than the first, but is still a good thriller. In this sequel have already begun to notice that the script starts to get confusing and meaningless."
    },
    {
      "rating": "6",
      "text": "Bad sequel but still nice to hang out."
    },
    {
      "rating": "5",
      "text": "Not good as the first original movie. Had some intermittent suspense filled moments here and there. But this is not a great sequel. And the motive for the killings is not so well established."
    },
    {
      "rating": "1",
      "text": "A poor script generates a poor movieThis is the sequel of film \"I Know What You Did Last Summer\" and is based on its story. The action takes place a year later and is based on the re-emergence of psychopathic killer, willing to punish those adolescents, in particular, Julie.If the first film was weak, this film is worse, having notable flaws in the plot which ends up losing credibility, especially when in connection with the first film. The protagonist, Jennifer Love Hewitt, is a pleasant surprise, improving her performance and showing to be more able to convincingly play a dramatic character. She could, however, have cried less and copied less unfortunate figures from the first film.This film, like the film what caused it, would have paid a great horror film/sequel. The idea was good. What killed both movies was a poor writer together with two weak directors."
    },
    {
      "rating": "4",
      "text": "Minus the great one liners and Jen Love...they just add the body count, gore and unnecessary screams."
    },
    {
      "rating": "6",
      "text": "This film has some nice characters and kills, but the twist and final scene were stupid, and I'm just not a big fan of this series."
    },
    {
      "rating": "3",
      "text": "Wait so the original gets a 2.2 but the awful sequel gets a 5.0? That makes no sense. The sequel has an awful story and horrible acting. I wouldn't recommend this horrible sequel."
    },
    {
      "rating": "1",
      "text": "This book was horrible."
    },
    {
      "rating": "8",
      "text": "To Be 100% Honest This Was Almost 99% As Good As The 1st One!\rBrandy Does A Shockingly Good Job!"
    },
    {
      "rating": "1",
      "text": "The only good thing I can say about this movie, and the reason I'm giving it a one instead of a zero, is that the hurricane aspect of the movie made for slightly more intense scenes, even though the script and acting was dismal."
    },
    {
      "rating": "7",
      "text": "While usually sequels aren't as good as their predecessor, I Still Know What You Did Last Summer is definitely a better movie. Granted, the original is no masterpiece, but it's still a classic slasher of the 90's. This movie had slightly better acting, was more entertaining and the characters were a little bit more likeable. While the movie isn't without it's flaws, for example the twist in the end is very stupid and nonsensical and the very last scene was only there in the hopes of doing a sequel, it's still a rather pleasant and entertaining slasher flick."
    },
    {
      "rating": "3",
      "text": "Son of the fish hook guy invites the main girl from the last one to the Bahamas so that his father can try and kill her and her new friends with possibly the same fish hook."
    },
    {
      "rating": "10",
      "text": "I enjoyed this sequel. First off, Brandy was in it and I like her, but that's beside the point. Though we obviously know who the killer is, the movie makes up for that with the intriguing plot twists and action scenes. My favorite scene is when a certain somebody jumps over the balcony onto a glass-roofed greenhouse, missing the swinging hook by an inch. Karla was my fav new character and Tyrell added much comic relief and he ribbed Will constantly about being so geeky, and Will shines in the end also. Unlike the first which took place in some rainy, dinky crab-smelling port area(which was GREAT for the original, don't get me wrong), I actually felt at home with these four teens at the Bahamas Hotel. The movie set was secluded and simple with it's lack of excessive characters, not only giving the viewer the opportunity to focus only on the main four and a few small others but also giving Ben Willis more chance to hide and keep his cover, run around, and murder at ease without intrusion, save for a rescue team, but he'll take care of that. People, if you are expecting this to be like Scream which killer's costume allows room for multiple murderers and sequels, don't watch this. This is just good ol' Ben Willis again, but with a new setting, major plot twists that are quite original and don't suck off of the original, and with such interesting main characters, who needs supporting. And the murders...oooh, don't get me started. They beat part one by a mile. The first murder REALLY SUCKS and I mean that in a good way...and a literal one. You totally have to see it."
    },
    {
      "rating": "8",
      "text": "It was very good. It starteled me alot it had a good plot and it was enjoyable to watch after the first part its 2005 and I'am still waiting for part 3.I'll never forget what you did last summer.this movie launched freddies and jeneefier's careers."
    },
    {
      "rating": "6",
      "text": "Not scary and at times very stupid, if you were a fan of the first movie or just like teen slasher flicks you might get some enjoyment out of this, others will find this very mediocre, I still got some enjoyment out of this, but it's far from horror excellence."
    },
    {
      "rating": "7",
      "text": "This sequel is every bit as good as the original if not better. The story is more creative and more entertaining. Plus it is much more unpredictable than the original ever was and it's even a little scarier. The only problem is that the ending was too much of a downer for there not to be a third one. I'll Always Know What You Did Last Summer didn't really count as a continuation of the first two because it had nothing to do with them. To bad they sold the property rights to some direct to dvd studio. What a bummer."
    },
    {
      "rating": "6",
      "text": "I wasn't the biggest fan of the original, but I did find it at least somewhat entertaining, not that I'd want to revisit it, however the sequel, well I'm not sure, sometimes when I look at it I think it's slightly worse, other times, I think it beats the original like nothing else, let me explain, the film's still full of the madcap entertaining but not entirely clear action scenes that were in the original, and the plot's a lot better, but it's premise and scare factor isn't there, when you look at the premise, it's someone trying to get more revenge for something that happened to them two summers ago, not to mention some of the attacks taking place off-screen, you get a very empty feeling, & what's with this whole whodunnit  element that we get, we know who it is, it's Ben Willis, the one they run-over, threw in a river then severed his hand, yeah sure, Julie knows, but they give the audience a big who could it be approach, why, very entertaining but not entirely clear!"
    },
    {
      "rating": "7",
      "text": "I wasn't a big fan of this when first seeing it. I relished the first film and just thought it was kind of lackluster and dumb. But over the years I've developed a fondness for the films absurdity and ridiculous plotting. I actually enjoy the film a lot now on it's own merits. The chase scenes are fantastically executed and the film is a huge guilty pleasure. This time around Julie and her roommate win a trip to the bahamas and find themselves being hunted by the infamous fisherman. Sexy Freddie Prinze Jr., Mekhi Pfeiffer, Jennifer Esposito and a truly awful Jack Black also star.Budget: $24mBox Office: $84m7.5/10"
    },
    {
      "rating": "8",
      "text": "Just as good as the first in my opinion. Might be slightly better because this one has a lot more killings then the 1st."
    },
    {
      "rating": "10",
      "text": "I actually found this one more entertaining than the first, more action. The post wasn't there and overall it felt a little empty but not bad if you're looking for some fun slasher to watch. 10/10!"
    }
  ]
}