{
  "id": 2548,
  "title": "I Still Believe",
  "starring": [
    "K.J. Apa",
    "Britt Robertson"
  ],
  "runtime": 115,
  "genre": [
    "Music",
    "Drama",
    "Romance"
  ],
  "description": "The true-life story of Christian music star Jeremy Camp and his journey of love and loss that looks to prove there is always hope.",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dqA2FCzz4OMmXLitKopzf476RVB.jpg",
  "categories": {
    "plot": 7.8,
    "acting": 10.0,
    "ending": 7.5,
    "soundtrack": 6.0,
    "cinematography": 10.0,
    "familyFriendly": 8.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Typical low scores given by anti christian message. Its a well made soft drama coming of age career journey tale, of a very successful gifted boy with a calling. A hell of a better idea than losing yourself to drugs. A nice change, for a change."
    },
    {
      "rating": "0",
      "text": "Horrendous propaganda for the christian agenda. That's all you need to know."
    },
    {
      "rating": "10",
      "text": "Atheist trolls who’ve never experience happiness in their life will hate it, anybody else will love it. That’s all you need to know."
    },
    {
      "rating": "10",
      "text": "Fantastic love story. Truly memorable. Great leads. Great cinematography. Great directing. You won’t want to miss it."
    },
    {
      "rating": "6",
      "text": "I was surprised to find out that what Jeremy Camp went through wasn't the significant aspect of this movie. He did experience a tragedy that's impossible to not sympathise with, but he still ended up with a one in a million music career and later remarried to start a beautiful family. Yeah, I bet he does still believe. The fact of the matter is that things aren't likely to turn out that nicely for you after hardship so what the heck are we supposed to take away from that?No, the real story here is Melissa Camp's. The one everything didn't work out for. Her faith and ability to find meaning during her time of pain and struggle is powerful. It has the ability to give people at least some modicum of hope that their suffering serves a greater purpose.As far as the actual movie itself goes, it's one of the more competent works of Christian filmmaking. Yet, it plays out in a very cliché, predictable manner that ensures there are never any surprises. Which is probably why it feels so much longer than it actually is. I Still Believe drags its feet, taking forever to get to the point. It also has a weird issue with dictating the passage of time. Common sense tells me the whole thing played about over a period of years, but the film oddly enough makes it feel like only a few days.The target audience will still eat this up though. The unconverted will obviously struggle to find the same value in it due to all the references to God and Jesus, but even they might enjoy the meet-cute romance and tear-jerking moments in spite of that. Plus, while I may not have enjoyed the movie overall, as a believer who faces no small challenge when coming to terms with with the fact that supposedly everything no matter how awful is a part of the Lord's will, I was definitely given a lot to think about. However, the biggest question I was left to ponder after watching this is given its nature as a film that could very well make you cry, has there been a secret genre out there this whole time that could accurately be classified as sadness porn?"
    },
    {
      "rating": "3",
      "text": "A story that can certainly appeal to many viewers' empathy and liking, but the religious overload rather than seeming to resemble a motivational asset is a tiresome and extremely manipulative resource.I was totally bored."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)It gave me the cue for a particular reflection. The thaumaturgical phenomena (more precise and rigorous term of prodigy or miracle) systematically elicit a fideistic reaction or a fideism of diametrically opposite sign, I mean of equally unshakable unbelief. In this case, however, the far more frequent course of these phenomena is shown: taboritic, temporary, ephemeral and transitory events, at the end of which it rushes from the Mount of Transfiguration to find oneself \"in hac lacrimarum valle\" like and worse than before. Nobody knows why, but above all I don't know anyone who asks himself such a question."
    },
    {
      "rating": "10",
      "text": "at first I didn't know if I was going to love this movie or hate it but I watched it and in the end loved it. the two actors chemistry was on point. I felt as if I was watching some ones real life story unfold. im not into a lot of christian movies because I find they try to throw god down your throat but this one did not it was full focused on the love these people had for each other and god. I would definitely recommend this movie"
    },
    {
      "rating": "10",
      "text": "I Still Believe is yet another grand achievement from the makers of I Can Only Imagine, but the cinematography and scenery are even better. The acting is once again very impressive and the film tells the story of Jeremy Camp's life of love and loss, which is a real tearjerker and touching movie that is very gorgeously shot and the romance which was the central highlight gave a very powerful message. I highly recommend this thematically rich must see movie."
    },
    {
      "rating": "10",
      "text": "This movie was heartwarming on so many levels. It makes you experience the movie as if you're the one who witnessed everything happening. The movie sends out so many messages but all well understood. The title alone is a message, I STILL BELIEVE gives all of us a powerful reminder that life is hard but we all get through it. This movie is a must. Thank you to the directors and actors for such hard work and effort. I bet you all cried on set hahaha. Thank you for a heartfelt, romantic movie."
    }
  ],
  "recommendations": [
    "overcomer",
    "machine_gun_preacher",
    "i_can_only_imagine",
    "heaven_is_for_real",
    "her",
    "courageous",
    "war_room",
    "risen",
    "me_before_you",
    "collateral_beauty",
    "the_tree_of_life",
    "babel",
    "brokeback_mountain",
    "the_book_of_henry",
    "the_shack",
    "the_butterfly_effect",
    "all_the_bright_places",
    "pay_it_forward",
    "the_hunt",
    "crash",
    "lost_in_translation",
    "the_case_for_christ",
    "son_of_god",
    "miracles_from_heaven",
    "hereafter"
  ]
}