{"id": 338, "title": "Ice Age", "starring": ["Ray Romano", "John Leguizamo"], "runtime": 81, "genre": ["Animation", "Comedy", "Family", "Adventure"], "description": "With the impending ice age almost upon them, a mismatched trio of prehistoric critters – Manny the woolly mammoth, Diego the saber-toothed tiger and Sid the giant sloth – find an orphaned infant and decide to return it to its human parents. Along the way, the unlikely allies become friends but, when enemies attack, their quest takes on far nobler aims.", "releaseYear": "2002", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/gLhHHZUzeseRXShoDyC4VqLgsNv.jpg", "categories": {"plot": 6.972972972972973, "acting": 7.137931034482759, "ending": 8.0, "soundtrack": 4.0, "cinematography": 8.0, "familyFriendly": 6.285714285714286, "funny": 6.870967741935484, "action": 5.0}, "reviews": [{"rating": "10", "text": "Ice age is probably one of the best animated films of all time. Hilarious, great story line, great side-stories, great characters (they have really thought this one out, eh). Aside from the voices of the main characters, I think that the other voice actors like Ray Romano, Jack Black and Goran Visnjic have done a terrific job, capturing the magic of the side characters. Well done guys!"}, {"rating": "7", "text": "This was a decent animated film, they should've left the Ice Age series alone after the first movie, it's successors make it look better than it originally was when I watched it."}, {"rating": "8", "text": "You'll probably get a good laugh out of it no matter what age you are."}, {"rating": "10", "text": "This movie is awesome, and I'll never forget it. I don't care what anyone else says, it's one of my favorite movies of all time. EVER. :D It has a lot of charm, emotion, humor, it's perfect!\r 10/10\r Pros: Everything is unforgettable and it's a very nice looking film.\r Cons: None! :D"}, {"rating": "10", "text": "Ice Age is a great animated film to anyone (adults or children) may be lost."}, {"rating": "10", "text": "This is one of my childhood hits, i should give it the maximum possible score, because it has a special place in my heart and it's a true masterpiece without no doubt"}, {"rating": "10", "text": "A great movie I watched as a toddler and after 8 years I can still come back and watch it without getting bored of it. A great movie in my perspective to watch with your family."}, {"rating": "8", "text": "Dissimilar to the title, \"Ice Age\" is a warm-spirited tale of a group of animals so opposite of each other it leads to a burst of slapstick hilarity. Animated beautifully, and voiced right, it's a compassionate film for both children and adults."}, {"rating": "9", "text": "Ice Age is one of the undervalued animated movies. A prehistoric road-trip story starring 3 misfit mammals trying to return a human baby to his tribe, it is a perfect balance between mature and funny. An emotional journey that may very well leave you teary-eyed at the end."}, {"rating": "8", "text": "Um bom filme para ver. Mas acho que o segundo filme mais fraco de toda a franquia. Não que ele seja ruim, é que ele não me atrai tanto. Mas é um bom filme."}, {"rating": "10", "text": "esta pelicula esta demasiado buena como para que le den criticas mixtas mientras que  a peliculas aburridas les dan positivo esto es candidato a postivo"}, {"rating": "8", "text": "It's kind of like a biological cartoon piece, similar to Land Before Time, but with a more mature cast and script, and time era of course. The adventure is a little too limited in flavor but by no means does it mean it's a bad film. It has a nice mixture of serious and quite humorous scenes."}, {"rating": "8", "text": "The animation isn't exactly top notch but the movie makes up for that with witty one-liners and great characters. The jokes just keep on coming and while kids can enjoy the slaptick-filled antics of Scrat the squirrel-thingy, adults can enjoy the in-jokes and other gags that small kids might not get. It's not quite Blue Sky's best (that honour goes to \"Robots\") but it's the best in its franchise. Fun for all ages!"}, {"rating": "10", "text": "A funny and heartwarming film, with lovable characters, heartwarming and dramatic moments, decent animation, great voice acting, and a powerful score by Danny Newman"}, {"rating": "8", "text": "I have watched this movie last year and boy was I wrong about animated movies. This is a great story that embodied terrific characters and hired great actors to do a great job. The only thing I think could have been better is the animation."}, {"rating": "7", "text": "Okay, but not the greatest. Yes it was funny with a capital F for both children and adults alike. It was a bit predictable and many of the lines were corny. But it's worth-seeing."}, {"rating": "8", "text": "La era de hielo es una gran película, con muchos historia y grandes personajes muy entrañables. Es una pena lo mucho que se explotó la saga."}, {"rating": "10", "text": "This digitally animated movie, filled with a cast of charming, funny critters from long ago, is family entertainment at its most bright-eyed and bushy-tailed."}, {"rating": "10", "text": "This digitally animated movie, filled with a cast of charming, funny critters from long ago, is family entertainment at its most bright-eyed and bushy-tailed."}, {"rating": "6", "text": "I has seen this movie for a long time,but it wasn't impress me to remember the main plot of it."}, {"rating": "6", "text": "It is a fun and charming animated movie that has it's moments."}, {"rating": "8", "text": "\"Ice Age\", unlike its frigid name, has a warm spirit of love and power that equals to those of Pixar's. A outstanding movie to watch."}, {"rating": "10", "text": "like Toy Story, this movie is excellent"}, {"rating": "7", "text": "A pretty entertaining movie. Kids will undoubtedly enjoy it because it's silly and funny. The animation is excellent and the ultimate problem with this film is the script."}, {"rating": "5", "text": "Although it's a kind of funny movie it tries to pass itself off as good via the thin novelty of computer animation - which it does an OK job of. oOverall I don't regret seeing it but it could have been much better, especially if the actors were encouraged to act rather than just read the scripts."}, {"rating": "3", "text": "[**Includes Potential Spoilers**] This movie was pathetically TRYING to do show you some of their so-called \"excellent\" efforts. First, the characters. They were TRYING to make the sloth, Sid, a wise-cracking, chatter-box, but didn't wasn't that the Donkey from \"Shrek\" who offered us that character who we'll probably remember for the rest of our life as he was one of the best characters in an animated film ever? Or how about the wolly mamoth, Manner (or Manny, or Manfred, or whatever your supposed to call him)? Didn't his personality and attitude remind you of Shrek of \"Shrek\"? And to top it all off, the \"tear-jerker\" of the movie. The movie was TRYING to be as heartwarming, and tear-jerking as \"Monsters, Inc.\" but you just couldn't get that feeling when M (I wasn't sure what to call the mamoth so I settled for \"M\") remembers how his parents died, or when it looks as though Diego has died, or when M and co. bring the baby back to his dad. Please God, don't let 20th Century Fox ever make a computer-animated move again."}, {"rating": "8", "text": "\"Ice Age\" is an excellent movie, but I think \"Ice Age 2: The Meltdown\" is even better!"}, {"rating": "6", "text": "The Squirrel ends up being more funny than the boring three but it is heartwarming just fantastically animated and sometimes charming. I give this movie 63%."}, {"rating": "1", "text": "Very uninteresting story line. Isn't the goal of a children's move to make a child laugh instead of put them to sleep? Clearly, the screenwriter missed the memo."}, {"rating": "6", "text": "Ice age freezes its viewers.\rA collection of likeable prehistoric characters captures charming moments but doesn't quite come alive, a good effort and a well made film overall."}, {"rating": "4", "text": "This film is set in the Ice Age and tells how a mammoth, a sloth, and a sabertooth tiger join forces to return a human child to his father. Directed by Chris Wedge and Carlos Saldanha, has voice actors like Ray Romano, John Leguizamo and Denis Leary. It was nominated for the Oscar for Best Animated Film.This is not a film I consider remarkable, but it's funny enough to not consider for lost the time I spent watching it. Although not easy to understand for young children, the film is appealing enough. Playing with the animals existing at the time, the script creates a situation, implausible but funny, involving a human child and a group of animals, predators and preys, united in a joint effort.The characters are not the most interesting but Diego, a tiger torn between loyalty to his brothers and friendship with fellow travelers, and Manfred, a mammoth mourning his dead family, deserve some positive highlight, giving the film a touch of maturity. The more negative note goes to Sid, an unpleasantly greenish sloth, which associates a grotesque aspect to an endless collection of stupid moments. Unfortunately, this creature is the largest attempt to make this movie something funny. The intelligent humor of other characters works better, making more digestible a film that, without it, it would be quite silly. The squirrel can also be very funny.The work of animators is regular and fulfills its role. The voice actors did a good job, particularly Leguizamo, who gave voice to Sid. The soundtrack hardly exists or stands out in the film."}, {"rating": "9", "text": "Even though it was predictable, it was different. It had incredible warmth, and the lack of a better plot goes unnoticed with impeccable humour and wit in its place. Unforgettable."}, {"rating": "10", "text": "A animated classic. Brilliant."}, {"rating": "10", "text": "This movie is fantastic.  It's funny, exciting, and most of all has a great story.  The end is extremely emotional and well-done and I actually cared about the characters in the movie."}, {"rating": "6", "text": "The film is nowhere near as well written as something from Pixar or Dreamworks but it is still entertaining. The film has some nice humor and heart. The characters have some charm to them. The film also has some nice moments. Kids will love this movie immediately and I won’t deny that the film is definitely geared towards them. Everyone else will get through it ok as the humor is decent and the film does have some heart and quiet moments as opposed to bombarding you with obnoxiousness. That being said there are a lot better animated films out there so I’m not going to out of my to recommend it. Check it out if you are interested you will like it ok. I enjoy it although that might be due to having grown up on the film. Even so this is a first film for Blue Sky Studios and as a first film its not bad."}, {"rating": "9", "text": "I was very impressed with this movie, the characters are charming and the story is fantastic, this is a movie that will find its way into your heart and stay there."}, {"rating": "8", "text": "I love the heartwarming moments of the movie. The graphics and appearance of the movie are great. The characters are great, I can really connect to them. Overall, a great movie."}, {"rating": "6", "text": "The animation could be somewhat better but the charming characters and kind storytelling are what makes it worthwhile. Its only a little bit funny though."}, {"rating": "7", "text": "Very enjoyable animation with good characters, setting and reasonably strong humour."}, {"rating": "10", "text": "One of the best animated films that I have seen imo. You cant help but love this film. Fantastic voice acting by the cast as well. A must see family film imo."}, {"rating": "10", "text": "Hehe this was really funny. Throughout the movie I was either chuckling or laughing. I think guys did a very good job on this one, and even though the characters were nont quite original, their adventures paid for it. This movie is definitely a must, but i dun think it'll be as successful as Shrek though."}, {"rating": "10", "text": "Masterpiece! For me it's almost the best CGI movie ever! I've seen Ice Age more than 20 times and am still laughing. It is so much fun for every age. The plot is brilliant as well and the characters are genius. I really dont know what to say anymore. Just watch it if you still havent seen this 10/10 film."}, {"rating": "9", "text": "I loved this movie. I found it humorous, interesting and overall a job well done. Now one of my all-time favorites, I find myself watching this movie over and over and it still manages to extract a few chuckles, even after all this time. I highly recommend anyone to watch it, it's such a good family movie."}, {"rating": "10", "text": "I find this movie hilarious.I can watch it over and over, and still laugh at Sloth.Ice Age has so many one memorable one liners.If you like animated movies you should not miss this."}, {"rating": "4", "text": "Really? This movie can't have humour at all. Basically what you are supposed to watch is 80 minutes of no entertainment and terrible jokes throughout. The only good things are the voicing which is only 4 points. It is for me about 53%"}, {"rating": "8", "text": "An original premise with some cliche characters. Despite this, it delivers some solid laughs and the backgrounds are surely appealing to the eye. Although it clocks in at just a pultry 81 minutes, it feels a little slow in some parts and the animation is a bit simplistic compared to Pixar and DreamWorks. Nevertheless, Ice Age succeeds in delivering the funny and will surely delight people of all ages."}, {"rating": "8", "text": "Story:\r3 prehistoric animals from the Ice Age-Manny, a mammoth, Diego, a saber-tooth tiger, and Sid, a sloth-find a human baby away from its tribe. They decide to bring the baby back to the tribe as they're being led by Diego who might have something up his sleeve. The story here is pretty basic and predictable, and there's no surprises here. There's also a subplot with a saber-tooth squirrel named \"Scrat\", and in it we follow his misadventures as he tries to get an acorn. Besides that, the plot here is nowhere near the creativity of Pixar. 5/10\r Animation:\rUnfortunately, the animation didn't really age well. Over 12 years after its release, it's animation is severely outdated with the colors and textures looking below average by today's standards. Even the character models look outdated. Good thing Blue Sky updated them in the sequel. Overall, it's animation may have been good back in 2002, but unfortunately, it didn't age well. 4/10\r Characters and Comedy:\rThis is where things get better. When it comes to our 3 heroes, all 3 of them are likeable. And it's all thanks to that baby they have. That baby is the centerstone that this film needed as it's responsible for all the character development and heartwarming moments that this film has. Manny starts off as a grouchy mammoth, but as the film progresses, it becomes clear that he has a dark past that he tries to hide and that it's explained why he dislikes the baby at first. Diego was sent on an objective, but after spending time with the crew and the baby, he slowly opens up to them. Finally, Sid is the comic relief character who isn't too annoying and is generally funny. Manny and Diego eventually grow to like him as he tries to form a \"herd\" with them. There's also Scrat who is hilarious as his style of comedy resembles the Looney Tunes style of humor. He's silent, but with all the attempts he makes to get that acorn, he quickly becomes a big highlight of the film, and eventually Blue Sky\"s mascot.  So the characters are likeable and have a bit of depth, and the comedy is great here. 8/10\r Sound:\rThe score is fine, but nothing memorable or amazing. 6/10\r Acting and Casting:\rAll the voices here do a great job, even if John Leguizamo can become occasionally too much to bear. I also like Scrat's voice, so props to Chris Wedge for his voice. 9/10\r Verdict:\rIce Age was a great start for Blue Sky Studios because of its great style of humor and great performances all around. Even though it's now a bit dated, this is an animated film that can still be enjoyed by everyone.\r Rating: 8/10"}, {"rating": "7", "text": "This one is a fun comedy flick!\r The movie holds it self quite well with good use of slap-stick comedy that I am sure many can enjoy, the simplicity of the story is good enough to keep the goal of the main characters direct and be easy to fallow for the younger audience; the animation is very fast and energetic, it helps the slap-stick of the movie but the writing needed some work, specially when it comes to dialog and continuity.\r I also felt that some of the textures were very ugly and every times the movie tried to be taken serious it failed to be, I just scratched my head at all those scenes... but for the rest I found it to be a very fun and enjoyable movie overall."}, {"rating": "3", "text": "I do not understand all the positive reviews and why most people like it, i found it really boring and dull. I found the plot to very poor and predictable, the jokes and story were infantile, not interesting enough to interest older audiences. The characters were also very charmless, boring and forgettable. I'm glad I brough the film cheap as I won't be watching it again."}, {"rating": "5", "text": "\"Ice Age\" is generally original, and while it is able to entertain, its story is generally packed with so many plots that it can get carried away. Characters are interesting, but not outstandingly executed, and some can give solid laughs to audiences. It treads similarity to \"Shrek\" and \"Monsters Inc.\", but doesn't exceed their qualities, yet is able to pull off an enjoyable film to kids, more than to adults."}], "recommendations": ["bolt", "the_croods", "puss_in_boots_the_last_wish", "ice_age_the_meltdown", "hotel_transylvania", "robots", "over_the_hedge", "despicable_me", "shaun_the_sheep_movie", "madagascar", "storks", "rise_of_the_guardians", "paddington", "peter_rabbit", "hotel_transylvania_2", "rio", "ferdinand", "megamind", "captain_underpants_the_first_epic_movie", "spies_in_disguise", "meet_the_robinsons", "despicable_me_2", "rango", "madagascar_escape_2_africa", "zootopia"]}