{
  "id": 536,
  "title": "Ice Age: Dawn of the Dinosaurs",
  "starring": [
    "Ray Romano",
    "John Leguizamo"
  ],
  "runtime": 94,
  "genre": [
    "Animation",
    "Comedy",
    "Family",
    "Adventure"
  ],
  "description": "Times are changing for Manny the moody mammoth, Sid the motor mouthed sloth and Diego the crafty saber-toothed tiger. Life heats up for our heroes when they meet some new and none-too-friendly neighbors – the mighty dinosaurs.",
  "releaseYear": "2009",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cXOLaxcNjNAYmEx1trZxOTKhK3Q.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 6.214285714285714,
    "ending": 2.0,
    "soundtrack": 5.0,
    "cinematography": 3.0,
    "familyFriendly": 7.5,
    "funny": 6.2727272727272725,
    "action": 5.333333333333333
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Ice Age sequels should have been left alone. This film, as well as it's predecessor, were full of tripe."
    },
    {
      "rating": "6",
      "text": "This film has its share of entertaining moments, but we've seen it all before. It's harmless entertainment but it shouldn't be compared to higher ranking movies. Then the movie would suck all the time because how can a recent animated movie be compared to Citizen Kane. You just can't because they're both entirely different. As long as nobody does that the movie will be fine, but just not great.\r However Scrat will always be the star of the series. He's like Wile E. Coyote except with an acorn and without a \"genius\" mind."
    },
    {
      "rating": "1",
      "text": "This movie sucks as my ass does. I would have scored it a 3, but the characters just...ticked me off."
    },
    {
      "rating": "5",
      "text": "Ice Age 3 was okay, but not the best. I liked the first two a lot better, because I thought they had better storylines than this. I'm just not a dinosaur person. That is my opinion and I'm intitled to it. I'll get it on DVD, but I won't watch it all the time."
    },
    {
      "rating": "10",
      "text": "The first 20 minutes or so are boring as hell, and will have you wanting to leave the theatre. However, once the gang goes underground into the dinosaur world it starts to get really interesting and funny. 3 new characters are added them being Buck (a weasel who lives in the underground dinosaur world trying to kill the biggest, baddest dinosaur Rudy) Peaches (Manny and Ellie's daughter) and the nameless squirel rat thing who plays the love of Scrat. In fact, the one thing I hated about this movie was that Scrat became incredibly boring. Oh well, it was a pretty awesome movie and I definetely recommend it to any fan of the series, kids, or even adults! Oh and by the way, you don't need to see it in 3D for it to be good. AND, I personally think it's the best of the trilogy."
    },
    {
      "rating": "2",
      "text": "Basic plot line and heavily lacking originality, even for a children's movie. Then again some humor around scrat and sid which was enjoyable. All in all, not worth your money unless you or your kids are hardcore ice age fans."
    },
    {
      "rating": "0",
      "text": "Am i the only one thinking that it shouldn't be ice age - dawn of the dinosaurs? Dinos were before the ice age. This movie is just ridiculous."
    },
    {
      "rating": "6",
      "text": "[***SELF-CONTAINED SPOILER ALERT***] Sloths matter too. The sloth is so important to the wooly mammoth, he brings his pregnant wife along on a rescue mission to find Sid(John Leguizamo), the sloth with a gender-identity disorder, who was last seen in the clutches of a mama T. rex. As it turns out, Buck(Simon Pegg), the Captain Ahab-like weasel, of all \"people\", makes the salient point that Manny(Ray Romano), the expectant father-to-be, is risking it all for a sloth, and an emotionally unstable one at that. After all, he's a dinosaur-napper. In response to the wooly mammoths' marital bliss, and looming inception of a calf, Sid turns to his maternal side(despite being a dude) and steals three eggs from an unguarded nest in an ice cave(which makes him the Pleistocene era equivalent of a felon), just like a barren woman at her most desperate. Women who snatch children out of baby carriages employ their own skewered cognizance of the situation in order to justify the exploit, which frees them from owning up to the crime. This seems to be the case with Sid. The sloth is no Anna Paquin(in Carroll Ballard's \"Fly Away Home\"); he sees what he wants to see. If Sid had a more paternalistic side, procreation via f***ing a fairer sloth would be his main concern, not raising somebody else's children(he'd also eat the eggs). During his existential crisis, the sloth talks about looking for a new herd, without any mention of finding a mate. Interestingly enough, the sloth gives an unsuspecting ram a hand job(inspired by Peter and Bobby Farrelly's \"Kingpin\"), which Sid claims was a case of mistaken identity, as he was merely trying to satiate his kids' thirst for fresh milk. \"Ice Age: Dawn of the Dinosaurs\", albeit heavily bent towards action over story, does contain the inspiring message that sloths matter, even better, that ambiguous sloths matter too. But unfortunately, the film is hopelessly patriarchial. Although Sid took the T. rex's children, she forgives him, much too easily, and even made to suffer the sloth's own parental advice on what her babies should eat."
    },
    {
      "rating": "10",
      "text": "Oh yeah! This plot is pure genius!!!! I'm 18 and I loved it. T his was well worth it it just sucks that i got kicked out five minutes into the movie because they realized I was the guy who was banned for throwing popcorn at the scree and dancing in front of it while i was watching ORphan."
    },
    {
      "rating": "3",
      "text": "Cliche, predictable, stolen... err, borrowed humor, childish writing, and frankly too much camera time on the not so likable possoms make this one difficult to watch for adults and fans of the earlier films. The 3D is good but unless this is your first experience with a 3D movie ever its difficult to recommend this. Children will probably like it, but I can't imagine anyone liking the very very slow humorless, actionless beginning. Case in point on the writing: \"Yaba-daba-doo!\" \"Don't you yaba-daba-do that again!\" and other groaners."
    },
    {
      "rating": "8",
      "text": "Probably the best in the series by far; incredible visuals and probably some of the best jokes in the series such as \"I thought you were a female\""
    },
    {
      "rating": "9",
      "text": "Don't believe what the critics say, This is a very enjoyable movie with totally memorable characters. The 3-D is exceptional and truly brings the story to life."
    },
    {
      "rating": "8",
      "text": "Nice movie, it makes you laugh a lot... And I'm not a fan of animated films...Pretty Enjoyable for everyone."
    },
    {
      "rating": "9",
      "text": "See This Movie! Its not as memorable as the first film granted, but it is just as close as it can get for a threequel. Hilarious the entire way through, this is a great movie to watch alone or even better with friends."
    },
    {
      "rating": "10",
      "text": "A great family movie, for anyone, don't believe the critics!"
    },
    {
      "rating": "6",
      "text": "Not as good as the first and second, but still enjoyable."
    },
    {
      "rating": "10",
      "text": "The first 2 films were great, but this one is just awesome, me and my friends (15-16 years old) were laughing all the way through the entire film. It's got a nice mixture of things the younger audience will like and those that like plenty of ruder jokes to keep the dirtier minded happy. Should please the members of the audience with an actual sense of humour. 10/10 easily for pure hilarity and great action."
    },
    {
      "rating": "5",
      "text": "It just didn't feel like a fully-fledged sequel to me. More like some kind of inane side story. Like two back-to-back episodes of a TV series. Occasionally it felt strained but it had its moments. The plot itself requires heavy suspension of disbelief and the screenplay doesn't do an amazing job of easing you into it."
    },
    {
      "rating": "7",
      "text": "Well animated and it has an excellent pace, it"
    },
    {
      "rating": "5",
      "text": "Very average and boring. The humor is lacking and will ONLY appeal to little kids."
    },
    {
      "rating": "8",
      "text": "Still great. Not as good as the first but better than the second in my opinion. The story was definately improved from the second. The animation was great and even better when seen in 3D especially the moment they enter the dinosaur world. The detail is phenomenal. The humour is still there in most of it's glory but it's wearing off a bit. Scrat just doesn't seem as funny any more. But other than that I think the movie is really good and the new character, Buck,a weasel voiced by Simon Pegg is hilarious."
    },
    {
      "rating": "7",
      "text": "Not a bad flick. I don't remember liking the first one, skipped the second one and the only reason I went to see this one was because it was a \"sneak preview\" that started right after the movie I had gone to see and it was in 3D. I recommend seeing this one in 3D as it was worth the extra couple dollars. I was very surprised at how much I enjoyed it. The story was really stupid and didn't make any sense (dinosaurs living under the ice???), but it kept me interested the entire movie, partly because of the hilarious side story with the acorn loving animal and an excellent job by Simon Pegg as Buck the weasel(I just got done watching his TV show \"Spaced\" so maybe I am a little partial), who I had no idea was going to be in the movie. This movie also did a wonderful job of keeping everyone in the audience interested. The theater was packed and the only things you heard besides the movie was popcorn chomping and laughter, lots of laughter. Definitely worth seeing at the theater if you were considering it."
    },
    {
      "rating": "8",
      "text": "I am not a really big fan of Ice age,but I thought out of all three movies this one was the best if I had to pick my favorite charactor from this movie it would be Sid."
    },
    {
      "rating": "5",
      "text": "It looks like they removed 95% of the \"Ice Age\" humor. I just laughed a little bit on this 3rd movie. Scrat is now boring since he found a female squirrel. I didn't like that movie. The 2nd one is still the best."
    },
    {
      "rating": "2",
      "text": "Ice Age has worn out its welcome. The humor is dry, boring and if you're an adult sitting through this - you'll be thoroughly bored unless you still find humor from the 70's, 80's and 90's Saturday cartoon funny. The characters, especially the opossums and the new rodent (can't remember what he was... and honestly don't care) are mind numbingly annoying and even the Saber Tooth played by Leary doesn't even seem into his character anymore. There were kids in the theater who seemed even bored by it - running around playing tag about halfway through. The 3D is the gimmick kind, IE: people pointing at the screen, etc. Pixar has definitely mastered 3D in subtle ways with their recent release of Up, Ice Age 3D - however - seems to fall in the same category as Shrek the Third or the utterly horrendous Monsters Vs. Aliens. After seeing this - I'm ready for a meteor to end this series. Final Note: The plot and how they eventually get to this dino world is absolutely ridiculous. Dumb even for a childrens film."
    },
    {
      "rating": "9",
      "text": "I went into the AMC expecting a shitflick (I have bad experience with sequels), but it turned out to be a high quality movie with an appreciable plot and lots of humor. The only thing that spoiled it was the hordes of little kids in the audience that refused to shut up."
    },
    {
      "rating": "7",
      "text": "Pretty much what you'd expect it to be. The novelty has long worn off, but Sid and Scrat still manage to get a few laughs and the movie is fast paced enough to hold one's attention (even if the story is rather weak). The Australian (??) weasel is the main new character and not much to write home about... there are a few dinosaurs so that added a little spice."
    },
    {
      "rating": "5",
      "text": "Ice Age Dawn of the Dinosaurs is actually a so so family film. That's because their are some dirty jokes for kids. But other then that it was alright. Unlike the first two this was a movie that would be better of renting."
    },
    {
      "rating": "9",
      "text": "The film is one of the greatest animated films made, with the new character Buck and lots of adult jokes in it, it really is obvious that Blue Sky put some effort on it."
    },
    {
      "rating": "9",
      "text": "It is one of the best 3D movies I've ever seen, but yet I have to admit that it has its problems. But those problems aren't enough to ruin you experience. So don't mind the critics, they're all wrong, go watch this movie first and then try to judge it. Biased reviewers all over the world helped to the overall score of this movie (50), let's show them that we know the truth."
    },
    {
      "rating": "8",
      "text": "Went to go see this with the kids and enjoyed it. Like most people are saying, don't mind the jaded critics who watch movies all day. Nothing deep, but it was fun, I was never insulted or bored as many other (including \"grown up movies\") make me.."
    },
    {
      "rating": "7",
      "text": "Really good movie. and its really funny. I don't agree with the critics."
    },
    {
      "rating": "10",
      "text": "Ice age 3 is the best of the three, the technology was amazing, BUCK RULE!"
    },
    {
      "rating": "10",
      "text": "Ice age 3 is the best of the three, the technology was amazing, BUCK RULE!"
    },
    {
      "rating": "8",
      "text": "Don't usually go for cartoons, but really enjoyed this one. Definitely the best out of the three and the visuals and 3D were great. If you are a parent your kids will love it. Critics need to chill out and take this animation for what it is! Great way to pass your Saturday afternoon."
    },
    {
      "rating": "4",
      "text": "This film disappointed me. I'm a fan of animated films, but this provided few thrills and the storyline was very slow and pointless. Perhaps it was the little kids in the cinema who were constantly saying \"That wasn't funny\" and shutting down every single joke that made me realise that this film doesn't even work for young children and the humour was predictable and only rarely put a smile on my face. It had its moments, but overall I thought this was a bore."
    },
    {
      "rating": "7",
      "text": "another sequel? wow. 20th Century must be very good at making sequels. so, our lovable heroes from the first two movies come face to face with Dinosaurs. thats quite impressive. whats my opinion of it? well, its... (gasp) HOLY CRAP!! it made so much money? dang. people must like this movie. where was I? oh, yes. well, the storyline was monotonous, but the animation was quite amusing and the characters were perfect. its a fast-paced sequel that kids will love.\r Rating: 7/10"
    },
    {
      "rating": "7",
      "text": "After the second movie let me down I wasn't looking forward to this, but it's humor aand the fact that the characters are once again enjoyable made this an enjoyable movie for me, the story also isn't half bad, while you shouldn't expect it to be as good as the first it is still a good movie."
    },
    {
      "rating": "6",
      "text": "The movie was ok. Humour wasn't good but at least it was watchable."
    },
    {
      "rating": "4",
      "text": "The graphics are great, especially in 3-D. The plot is okay but boring. The characters and the voice acting is terrible. Ice Age 3 was generally a descent film, but its predecessors are way better........."
    },
    {
      "rating": "7",
      "text": "although the jokes aren't really funny, the characters ultimately work and i especially liked the ending. in the end, ice age 3  was fun."
    },
    {
      "rating": "6",
      "text": "I didn't expect this. The story of Ice Age is more outrageous than ever. There is a bit more action in this one as it introduces dinosaur characters."
    },
    {
      "rating": "6",
      "text": "A step down for franchise with less humour though visuals and addition of Buck are good."
    },
    {
      "rating": "5",
      "text": "I enjoyed it more than the first two, but as a piece of storytelling it is bad. But boy is the squirrel hilarious not enough to have a spin- off but to almost make this movie work. I give this movie 49%."
    },
    {
      "rating": "7",
      "text": "Better then Ice Age 2 but still flawed. Buck, the newest character in the Ice Age series, is very likeable and funny. The plot is a little generic but easy to look past because it's mature like the first film's plot (The first film was taking care of a baby, The third is about growing up). It's funny, like all Ice Age films. The only problems I had with it was that it was a little anti-climactic and at times rather predictable. Besides that, It's definently a step up from the second film."
    },
    {
      "rating": "10",
      "text": "The first 20 minutes or so are boring as hell, and will have you wanting to leave the theatre. However, once the gang goes underground into the dinosaur world it starts to get really interesting and funny. 3 new characters are added them being Buck (a weasel who lives in the underground dinosaur world trying to kill the biggest, baddest dinosaur Rudy) Peaches (Manny and Ellie's daughter) and the nameless squirel rat thing who plays the love of Scrat. In fact, the one thing I hated about this movie was that Scrat became incredibly boring. Oh well, it was a pretty awesome movie and I definetely recommend it to any fan of the series, kids, or even adults! Oh and by the way, you don't need to see it in 3D for it to be good. AND, I personally think it's the best of the trilogy."
    },
    {
      "rating": "6",
      "text": "The use of 3-D in this film is fantastic. The ultimate disappointment in this movie is that the jokes seem all recycled and too cliché. It's still intelligent in several places, mind you, and is recommended for kids who enjoyed the first two."
    },
    {
      "rating": "2",
      "text": "Ridiculously predictable, corny and extremely childish, Ice Age 3 can only be enjoyed by children or the childish. This movie truly sucks in as many aspects I can think of."
    },
    {
      "rating": "6",
      "text": "It's probably the worst Ice Age movie I've seen so far, but that doesn't mean I think it's BAD. But comparing the first one with this one, it has NOTHING on the first movie. But still, it's good, but the franchise is focusing on humor more and more and less and less on charm and emotion.\r 6/10\rPros: Action, humor, intimidating dinosaurs, a INSANELY hilarious character\rCons: Lacks most of the charm and emotion the first one has"
    },
    {
      "rating": "7",
      "text": "The movie is good, but it is the worst of the series, but spend some time seeing it."
    }
  ]
}