{
  "id": 776,
  "title": "Ice Age: The Meltdown",
  "starring": [
    "Ray Romano",
    "John Leguizamo"
  ],
  "runtime": 91,
  "genre": [
    "Animation",
    "Family",
    "Comedy",
    "Adventure"
  ],
  "description": "Diego, Manny and Sid return in this sequel to the hit animated movie Ice Age. This time around, the deep freeze is over, and the ice-covered earth is starting to melt, which will destroy the trio's cherished valley. The impending disaster prompts them to reunite and warn all the other beasts about the desperate situation.",
  "releaseYear": "2006",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vdluBXie4qDvh0dFX2Fpq8v16it.jpg",
  "categories": {
    "plot": 7.37037037037037,
    "acting": 7.071428571428571,
    "ending": 4.0,
    "soundtrack": 4.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 7.0588235294117645,
    "action": 8.333333333333334
  },
  "reviews": [
    {
      "rating": "9",
      "text": "The foggy balance scene alone gives this movie 7 points, but when you add a steadily collapsing ice dam that adds great stakes and comedy that's mostly pretty strong throughout and some of John Powell's best score ever, you get a really solid movie."
    },
    {
      "rating": "3",
      "text": "I loved the first Ice Age movie, but this is not good. There is one thing they forgot that ruined the whole movie: A MOVIE WITHOUT A PLOT IS USUALLY NOT ANY GOOD."
    },
    {
      "rating": "4",
      "text": "Why does this exist and if it had to why couldn’t just be direct to DVD? Ice Age The Meltdown is like does Land Before Time sequels pointless and little purpose to existing. Most of the jokes aren’t that funny, the story is drawn out, most of the new characters aren’t interesting, and its dull and eye rolling most of the time. The frustrating part is that the animation is really good and this was a studio project. Also, its Blue Sky’s first sequel and this was their chance to show they put effort into their sequels by giving us something on par with Shrek 2. Unfortunately this is one of those forgettable, skippable sequels. Unless you are a child who loved Ice Age this is one film you can afford to miss."
    },
    {
      "rating": "10",
      "text": "There have been many CGI animated films and a huge wave of them started to flood Hollywood starting in 2006. The reason? When Shrek 2 made $910 million worldwide everyone got interested in it... but what about this movie? Why am I giving it a 10/10? The movie isn't flawless as I feel it won't appeal to a lot of people, but this is a groundbreaking CGI animated film. This is the first animated movie that created actual expressive characters, it wasn't just a collection of billions of polygons but characters felt ALIVE. The film's plot is a magical retelling of Noah's Ark biblical story and will please animated movie fans and young kids."
    },
    {
      "rating": "4",
      "text": "As much as I loved the first one I was extremely excitied for this movie, but let me down in every way, the new characters aren't enjoyable, and the story is nowhere as good as the first one was, it was a huge disappointment."
    },
    {
      "rating": "4",
      "text": "This film is set in the end of the Ice Age and is a sequel to \"Ice Age\". In this film, the animals will have to survive and head out of the glacier, which is melting quickly. Directed by Carlos Saldanha, has voice actors like Ray Romano, John Leguizamo, Queen Latifah and Denis Leary.This film is not recommended for people who did not like much of the original film, it is basically more of the same, with the aggravating circumstance of the story is not so interesting, although it is easier to understand for young children. The central characters are the same who carried out the original film, and the criticism did still apply: Diego and Manfred are the most mature and interesting, while Sid continues spoiling the film with uninteresting jokes and stupid scenes. Scrat is still funny, but it cannot hold the film alone (well, he didn't even hold his nut for long...). To this set now comes a female mammoth Ellie, and a couple of pretty funny possums, capable of good moments of humor.The work of animators is regular and fulfills its role. The voice actors did a good job, particularly Queen Latifah, that gave Ellie a very sonorous voice, feminine and pleasant to hear. The soundtrack does not stand out in the film."
    },
    {
      "rating": "4",
      "text": "Errr...\"Ice Age: The Meltdown\" is a obvious-patterned sequel for Dream Work's \"Ice Age\". Nothing really changed and the tone is consistent which, in the end, lowers the bar for audiences who crave for a new tone or insight."
    },
    {
      "rating": "4",
      "text": "This movie missed the charm that the first film had."
    },
    {
      "rating": "10",
      "text": "This was a great movie i'm am just a kid and i thought it was great."
    },
    {
      "rating": "9",
      "text": "the first one was an experiment, the second one is in process to be an excelent movie!. Third will be the best?"
    },
    {
      "rating": "9",
      "text": "Great entertainment, better than I expected based on the reviews. Funny and cute, very similar to the first film with more footage of Scrat and the acorn!"
    },
    {
      "rating": "10",
      "text": "Funny, original, crazy!, dont follow disney's cliches, an animated movie for all ages, dont lose it."
    },
    {
      "rating": "8",
      "text": "Excelente película, la mejor producción venezolana de los últimos tiempos en cuanto a calidad de producción. La trama refleja una de las crudas realidades de Venezuela, la cual son los secuestros; y que tiene muy recientes ejemplos con el caso Sindoni y el caso de los hermanos Faddoul. Los actores son buenos, pero no excelentes, y a veces caen en la exageración del palabrerio, pero cumplen la función principal, que es la de demostrar roles de la sociedad venezolana, que son impalpables para quienes viven fuera de los barrios más peligrosos de Caracas. La historia no me sorprende, de hecho es muy predecible, aburrida y poco imaginativa; porque los secuestrados caen una y otra vez en momentos de angustía y desesperación, que solo una persona maldita con la mala suerte puede conseguir. La historia pudo haber sido mucho mejor."
    },
    {
      "rating": "9",
      "text": "Someone told me that this movie was good but not better than the first, but they were wrong. It's just about the same as the first: a great, family comedy that's worth watching."
    },
    {
      "rating": "9",
      "text": "I thought it was better than the first film. Very funny. I saw a screening with a group in our mid-20s and we all loved it. Queen Latifah is hilarious."
    },
    {
      "rating": "10",
      "text": "Loved it. Better than any movie Dreamworks has made to date."
    },
    {
      "rating": "10",
      "text": "Dont listen critics cause movies are made to forget regrets and pain, let yourself to raise to a cloud of good entertainment and lauhgs. An excelent movie."
    },
    {
      "rating": "7",
      "text": "Not as good as the original. The two main problems are lack of story and Diego who used to be the straight forward sharp comic of the group has no moments leaving only silly Sid and company visual gags. But then again its Ice Age, still awesome, when's 3 coming out?"
    },
    {
      "rating": "10",
      "text": "Poor Minds of those critics, some lose the ability of enjoy a innocent Story... is sad because they give good rates to war movies ( or related to sex ). This is magic. 10"
    },
    {
      "rating": "10",
      "text": "Good movie, good recommendation. Dont miss it."
    },
    {
      "rating": "10",
      "text": "My whole famaly and I really enjoyed this fantastic and funny animation!, its great."
    },
    {
      "rating": "9",
      "text": "Who listens to critics. I loved it from the moment it started. Sid is great, Diego is tops, Manny is inspiring, but Skritch is the Best! Queen Latifah was cute, worked for me, loved it all."
    },
    {
      "rating": "10",
      "text": "Wow, what a movie."
    },
    {
      "rating": "8",
      "text": "I thought the first one was better. But this sequel is not a bad one to spend your money on. They should give the possums their own movie."
    },
    {
      "rating": "9",
      "text": "What a great sequel -- Fun way to spend a Saturday with plenty of laughs. Forget the critics, they take themselves too seriously."
    },
    {
      "rating": "9",
      "text": "It was pretty cool. I really liked it."
    },
    {
      "rating": "10",
      "text": "Has everything to be a blockbuster and fight for best animated pic next oscars, only Cars can be superior... but maybe it wont."
    },
    {
      "rating": "9",
      "text": "Yes!!, they dont forget any character, you can see their evolutions, a very movie to enjoy again and again."
    },
    {
      "rating": "10",
      "text": "I already want my dvd of this amazing movie!. Good story."
    },
    {
      "rating": "8",
      "text": "Superb animation, great characters, and just darn funny! If you loved the original you will love this. And to those who have moaned about the story and plot, come on! This isn't 'The Godfather Part II'. It's a movie for kids and the kid in all of us. Just forget your problems for 90 minutes and let yourself laugh like a kid again."
    },
    {
      "rating": "9",
      "text": "The whole family went, the whole family (6 to 58) were cracking up laughing for virtually the entire movie. Critics take themselves far too seriously and actually believe that people are influenced by their drivel."
    },
    {
      "rating": "7",
      "text": "It would be easy just to summarize this enjoyable sequel to Blue Sky's CGI-animated blockbuster as the ultimate \"if you liked Numero Uno, ditto with Numero Dos\" movie, but some special congratulations are in order. After Blue Sky scored with the original, they made the disastrous mistake of trying to top themselves in all the wrong ways, and as a result we got Robots, a visually outlandish but criminally underwritten (and thoroughly unattractive and unappealing) farrago crammed with witless, desperate pop-culture one-liners and gratuitous but completely indistinctive celebrity voice casting. Praise the heavens that the writers, animators, designers (and let's be honest about it, the bean counters too) at Blue Sky at least temporarily renounced the errors of their ways and returned to what served them so well in the original Ice Age: restrained but effective visuals, solid scripting, plotting and gagwriting, distinctive and appealing characterizations, and vocal choices made with almost laser- (or Pixar-) like precision. Many adults (and pretty much ALL kids) know the drill by now: irascible saber-toother tiger Diego, morose mammoth Manny, and friendly but irritating sloth Sid make a trek from Point A to Point B, fighting the elements, various other creatures, and sometimes each other, along the way; it's simple, but it works. Denis Leary is a tad underused this time as Diego, but John Leguizamo's natural a-little-bit-of-him-goes-a-long-way qualities are perfect for Sid, and Ray Romano makes the widowed Manny wonderfully Eeyore-like. An added romantic element is effortlessly inserted as Manny attempts to kindle an on-again, off-again romance with lady mammoth Ellie (a typically witty and charismatic Queen Latifah) that's constantly roadblocked by his memories of the past and her utter conviction that she's a possum. (For the second time in a row in an Ice Age movie, we get some Traumatic Mammoth Flashback Footage that provides backstory, but if your little one couldn't take Dumbo's heartbreaking seperation from his mom, best take him or her out for an obligatory bathroom break.) It's a real compliment to Romano, Latifah and their writers that this subplot manages to contain more urgency and rooting interest than is evident in 90% of the live-action romcoms released in the last 5 years. All this, and a delicious back-comic musical sequence performed by vultures, too! And no, I haven't forgotten Scrat, the scruffy little squirrel-rat whose perpetually twitchy demeanor suggests that of a 70-year-old man who's lived right next to the airport for most of his life. There's a lot more of him and his agonizing, Sisyphean struggle to get and keep his beloved acorn this time around, here reaching epic and even theological proportions. If the noticeably increased Scrat sequences are the result of market research inquiries indicating that audiences wanted to see more of him, then here's a rare case of pollsters actually IMPROVING a movie rather than the reverse. Many comparisons have been made between Scrat and Wile E. Coyote, but while Wile E. pretty much just wants to eat the Road Runner, Scrat is even more acutely sympathetic because in the few, frustratingly fleeting moments when he gets to hold on to the acorn (which is almost a seperate character in and of itself), his facial expression, body language and sounds demonstrate more genuine love and tenderness toward the object of his devotion than I've seen some mothers show toward their babies! Some years ago the General Mills cereal company asked the TV-viewing public to vote on whether the similarly thwarted Trix Rabbit should finally be allowed to eat a bowl of his favorite sugary breakfast treat; the vote was \"yes\" by an overwhelming majority. If Blue Sky ever decides to conduct a similar survey involving Scrat and his acorn, mark me down in advance as the first yea vote. Lord knows, the poor little guy has certainly earned it!"
    },
    {
      "rating": "7",
      "text": "It was o.k. Funny in parts. Geared more for kids, but I liked it. It wouldn't be the worst movie you've ever seen. Worthwhile."
    },
    {
      "rating": "10",
      "text": "I was a child again with this second-good part."
    },
    {
      "rating": "10",
      "text": "Better than chicken little, robots and madagascar. A movie done by Ingenius and creativity."
    },
    {
      "rating": "7",
      "text": "Way better than Chicken Little, But for me it's just another Pixar Wannabe Movie, you'll probably laugh in some parts, and the Visuals are excellent, Great for Kids and adults too."
    },
    {
      "rating": "7",
      "text": "Fine movie for kids, but it's the same stuff you've seen before."
    },
    {
      "rating": "10",
      "text": "This movie was plain out hilarious! Scrat and the sloth were the best. Had a great story and was a sit and relax movie. If I got to see it again I would definitely go!"
    },
    {
      "rating": "7",
      "text": "Colin A. What are you smoking? \"Better than any movie Dreamworks has made to date?\" Come on. \"Wallace and Gromit\" and \"Chicken Run\" were two of the greatest animations of all time. Ice Age 2 is a retread, but funny, but definitely not Dreamworks"
    },
    {
      "rating": "8",
      "text": "Very entertaining. It's not breaking any new ground but we really enjoyed it."
    },
    {
      "rating": "10",
      "text": "Estaba esceptico, no creia que fuern a superar a la primera y lo hicieron y en grande, muy buena secuela, con mas apariciones de Scrat, estan todos locos en esta cinta, por eso te hace reir tanto, por ocurrentes. mejor que las ulimas 4 movies de Dreamworks. THIS REALLY WORKS."
    },
    {
      "rating": "10",
      "text": "Good!, let this page and go see it...an excelent animated tale, I want a third part."
    },
    {
      "rating": "6",
      "text": "The voices of the main characters are very good, especially Ray Romano's. The plot line is okay but this movie is way too long; too many added scenes with them being too long..not necessarily for kids but they enjoy it."
    },
    {
      "rating": "7",
      "text": "Good plot, funny characters, no sick inside jokes that kids wont pick up on. Although the queen latifah character gets kind of annoying, besides that it was a great movie."
    },
    {
      "rating": "5",
      "text": "\"Ice Age the Meltdown\" looks like an uninspired CGI animation with a poor storyline and an accent in physical comedy rather than story itself. The trouble is that slapstick is much puerile and childish than its creators want. An adult doesn't laugh with this, and all originality disappears for a standard child-animated film."
    },
    {
      "rating": "8",
      "text": "i think i'm dreaming. Ice Age 2 is one of those rarities. you know the ones that i'm talking about. the sequels that are almost, if not just as good as the original. yes, believe it or not, Ice Age 2 was almost as good as its predecessor. the humor balanced between child-friendly and keeping the older age groups entertained quite nicely, and thankfully there weren't too many re-used jokes, as seems to be the recent trend with comedy sequels these days. the two alligator-things that appeared periodically throughout the movie were kinda pointless, and really just felt like filler to keep the action moving. perhaps the best part about the movie were the scrat sequences. simply hilarious. Ellie, Crash, and Eddie were nice additions to the cast, but sometimes became a little annoying. overall, 8.5 out of 10."
    },
    {
      "rating": "9",
      "text": "i must say i watched this film on the plane to cyprus and before it started had no hope for it i thought what hope have i got for this, but i was so wrong, the plot was brilliant, still hilarious and still ahd the sad-happy storyline and of course finished off with another brilliant ending, i was very pleased to see that the new characters fitted into the movie well and were not boring but equally as interesting, good movie overall."
    },
    {
      "rating": "10",
      "text": "Funny movie. my older kids loved it too."
    },
    {
      "rating": "10",
      "text": "I can recommend this movie for all ages and kind of public."
    },
    {
      "rating": "10",
      "text": "first of all, i would like to start with that i aggree with Bubble M. it is as good as the first one. Amurabi M. was wrong. my dad loved the movie, and just laughed! Ice Age the meltdown is a great movie. all the characters are back, Sid is still my favorite, and the plot was just great. i thought the movie was very suspenseful, because i was scared to death that somebody would die. it's a movie that you can just lol at, and just cry all the time at, because it's very emotional. this movie was said to be for kids, but i say it's more for big kids and adults. little kids don't understand the jokes, the humor, and don't understand how much danger the characters are in, except that they know that something bad is happening. but this is just one of the best movies of all time. it's one of those sequels that doesn't fail. the only negative thing that i found, was that a could of the characters had 10% of something that made them different. but they still look great. i guess it's something that the characters get a new look, and they look better. anyways, don't doubt until you see the movie. i only know that some people hated it, because of the stuff that was in it, that wasn't necessary. doesn't matter. it was Great!"
    }
  ]
}