{
  "id": 850,
  "title": "Ice Age: Continental Drift",
  "starring": [
    "Ray Romano",
    "John Leguizamo"
  ],
  "runtime": 88,
  "genre": [
    "Animation",
    "Comedy",
    "Adventure",
    "Family"
  ],
  "description": "Manny, Diego, and Sid embark upon another adventure after their continent is set adrift. Using an iceberg as a ship, they encounter sea creatures and battle pirates as they explore a new world.",
  "releaseYear": "2012",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dfp1BZF7FxbBUyzHvMOI9t8NWDD.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.633333333333334,
    "ending": 5.25,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 5.666666666666667,
    "funny": 6.523809523809524,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "7",
      "text": "I enjoyed the movie more than I expected. This new addition to the series was a bit better than Ice Age 3, though not quite as good as the original Ice Age, and worth watching. On the bright side, Continental Drift had parts that had me laughing, but there was a song sung by the characters during the movie that was horribly corny. The part of the teenage mammoth \"Peaches\" was also pretty boring and childish. But, in spite of the bad points, as a kid, I liked this movie"
    },
    {
      "rating": "8",
      "text": "Ice Age is one of those franchises that even if it already has 4 movies, they are still a lot of fun to have with these characters. Each story on each movie is quite unique, and it always introduces new characters and ideas but also makes sure other characters from previous movies do no be forgotten. Where as Shrek, the third  and fourth movie was lacking ideas,  the Ice age franchise does varies things quite a bit, and does not forgets his characters and how they have always been."
    },
    {
      "rating": "9",
      "text": "While it retreads familiar ground, this film is different from others that do the same thing. You cannot expect films like these to be directed just towards kids, because why should they subconsciously make the decision that it's childish and assume there's only a certain few that means you don't get labelled as childish if you see it? This film is almost perfectly developed for both young kids and older people - most of the characters are lovable in their own way and who seriously doesn't love Scrat? Regardless of any demographic, anybody who loves this film will have nothing against this little fella. Just when everything is going right, what's not to stop something small creating such a big disaster? I love the dialogue especially against the characters - I did like the pirates, although many of them just got on my nerves (guess that's what pirates do). And every character has their own personality that suits everyone - what's not to like?"
    },
    {
      "rating": "0",
      "text": "Ice Age 3 was horrible... This is abysmal. This 'film' has truly shown the definition of staying past your welcome, generic plots and tired dialogue."
    },
    {
      "rating": "6",
      "text": "This movie is 50/50 for me,this is a big impovement on the third one who was very bad,but continental drift is in any other respect  a very big mess that blue sky made to be a box office hit."
    },
    {
      "rating": "3",
      "text": "The animation is good and scrap's bits are still chaotic fun, but the actual story is filled with cliches and ultimately dull and uninspired. Pure cashgrab."
    },
    {
      "rating": "0",
      "text": "Ice age wow, ice age 2 great, ice age 3 ok, ice age 4 screw this. When i first saw the trailer at cinema i said yes. But when i watched it, i was really disappointed. Our year is 2012. Where is the realistic animation? I think the animators have lost their talent.\rPOSITIVES:\rSid\rNegatives:\rThe film"
    },
    {
      "rating": "3",
      "text": "Even with decent actors, this movie was terrible. The plot was bad as well as the idea of the addition of the pirate crew. At least Scrat stuck around to give us a few more laughs."
    },
    {
      "rating": "3",
      "text": "\"Ice Age: Continental Drift\" shows how not to do a sequel in most ways  it's dull, the humor is so-so (even though it tries so hard), and the story line is flat out dumb."
    },
    {
      "rating": "3",
      "text": "The last, hopefully, of a disintegrating franchise. Stupid, over-written, too childish, and a complete, underwhelming and predictable bore. If they make the next sequel, you won't see me in those theaters. In fact, I'll make a habit of changing the channel the next time Ice Age appears on a commercial. Ever."
    },
    {
      "rating": "2",
      "text": "There's just nothing new to offer with these Ice Age films, it's just the same thing over, and over again, and doesn't do anything new. Still the visuals are nice, but the story and characters are just bland and boring."
    },
    {
      "rating": "0",
      "text": "Terrible terrible terrible. My daughters dragged me into the theatre for this, so I hesitantly allowed them so see it. Needless to say I went in with very low expectations... and still I was disappointed! Without giving anything away, could someone please explain to me how the bad guys managed to capture Manny's family??? That made NO sense to me at all. Could they have stereotyped the teenagers any worse? A family dumping their elder onto the family outcast, really? Captain Gutt said, \"Sacrificing yourself for your daughter. How touching. And predictable.\" Too bad the writers didn't see the irony of that statement. I will never get those 90 minutes back. Should have napped."
    },
    {
      "rating": "7",
      "text": "After being dissapointed with Dawn of the Dinosaurs, I was a little un-easy when I saw this one but my opinions changed when the movie was over. Casting was extra superb  and the plot was pretty good for a stero-typical over protective dad vs teenage daughter storyline. it's nice to see actual antagonists like the first one and not mother nature (Though it did play some part in the story) like the previous two films did. This film is great if you small kids while older kids and adults will get some kick out of it. That being said it's typical Ice Age humour that you've grown to love in previous installments but don't be expecting the charm the first one brought."
    },
    {
      "rating": "6",
      "text": "Ok, the movie is better than the third part, have some great moments. The animation is cool. But the big problem in this movie is the trama, is good, but the development is boring in some moments, and in some parts I feel that I watch a Michael Bay's movie. Is better than the third part, but is owrst than the second and the first, and yeah, is worst than Madagascar 3."
    },
    {
      "rating": "7",
      "text": "Ice Age Continental Drift is a terrific animation film for children. It offers laughs, a few scares, plenty of intelligent cheesy jokes and a great 3D experience. It is unfortunate that there are so many messages about global climate change and the extinction of animals mixed in but having young people feel a sense of responsibility for the planet and all of its life cannot be a bad thing if reasonably employed. Watch Ice Age Continental Drift with the whole family folks, it is great midsummer fun.  screenspotlight"
    },
    {
      "rating": "2",
      "text": "This is not a comedy. It's more like an adventure. It is really disgusting and it makes me sick. I think it wasn't necessary to make a fourth film. Im really disappointed."
    },
    {
      "rating": "5",
      "text": "Ice Age doesn´t improve on anything. This is a series of movies that have locked themselves to be merely good enough within each release, never really trying to push boundaries, and with Continental Drift this is more evident than ever. I knew completely what to expect from the beginning and by the end I got exactly that. Some few laughs with the squirrel and a whole lot of nonsense and that is it. I got to admit that I had  little more faith going into this one given that more characters were going to be introduced, a whole group of pirate animals to be exact. This could have opened this Ice Age into fresher territory with more character development, but the truth is that no pirate really develops. One opportunity for example relies on the fact that the two saber tigers, Diego and the girl, were falling in love, but any tease of what the animals may be feeling is left just like that, a tease. They end up together but is hard to tell in what disposition because there relationship is developed in a matter of roughly 5 minutes. So what does Continental Drift means? It means more of the same. A new entry that once again relies on the like-able trio of Mammoth, tiger, and sloth, and off course the lonely squirrel. At is most, it is entertaining and in some parts undeniably funny, but overall this one is pretty forgettable."
    },
    {
      "rating": "9",
      "text": "The movie is great. Funny and refreshing just like the previous parts. Watched it with my 3 year old daughter and she loved it. The new characters introduced in the movie like Sid's grandmother are just hilarious."
    },
    {
      "rating": "5",
      "text": "Having seen the Ice Age series thus far I knew what to expect. The film is obviously aimed at children and families. For this audience it is family friendly (of course the little 'life lessons'), fun and entertaining. Like the past films I moderately enjoyed it, but will forget it quickly. As an adult viewer it doesn't offer me anything more than a few laughs and a positive feeling by the end."
    },
    {
      "rating": "6",
      "text": "Another year, another ICE AGE film. There is really nothing new here, and the success of this franchise baffles me. Kids find it funny, the animation is nice, but the series never has the charm of say, Kung Fu Panda and Madagascar."
    },
    {
      "rating": "3",
      "text": "I have horrible friends. How horrible? Well, when given a choice between The Dark Knight Rises, Moonrise Kingdom, and Ice Age 4, my friend chose the last on the list. Granted DKR was somewhat disappointing, but you can't honestly tell me that IA4 is the better choice!\r I saw the first Ice Age movie as a kid and I liked it. The second one was stupid. The third one I haven't seen. Then there's this one.\r Is it the worst kids movie ever? No. But it's still terrible. It's cliched and predictable. The subplot with Manny's daughter was the hardest part to sit through.\r However, there were two things that kept me going. First, Scrat. Scrat is just as enjoyable as he's always been. There's this great scene between him and a siren which I won't spoil because it made me laugh so hard. Second, Peter Dinklage. Yep, Tyrion Lannister is in this movie. He plays the bad guy (stupid character btw). I couldn't tell who it was until the credits came up and I was close to doing a spit take when I saw his name.\r That being said, this movie was dumb and boring. However, if your child forces you to watch this movie, there are some saving graces."
    },
    {
      "rating": "8",
      "text": "Hamma geiler FIlm !!! :DDD"
    },
    {
      "rating": "4",
      "text": "from the first scene i could guess all the story!characters are so stereotype and nothing in all those happenings make sense at all.bad characterization and i event think some of them were extra and also useless.most of them exist in the story line just physically(most of them Ellie).humors mostly not very funny and a lot events in the movie didn't help the advance the story.but with all these i still have to say the animation itself was good(the graphic and sounds)."
    },
    {
      "rating": "0",
      "text": "tasdfghjklkjghfdsadjkl;jhgfdsadfgjhdddddddddaaaaaaaaasssssssccccccccc5455ergdfhdfjhdfjfgjkfgjkgjdfhnjhudkl;jhgfdsadfghj this move was so bad i got autism"
    },
    {
      "rating": "10",
      "text": "This is the best Ice Age movie I've ever seen. Not to mention, one of  the greatest films ever in my opinion. And that's saying a lot seeing that I've seen a lot of awesome movies. No wonder this was a box office success...\r 10/10\rPros: Everything\rCons: Doesn't have a number 4 on the title"
    },
    {
      "rating": "4",
      "text": "Actually I do not have any complaints about this movie but somehow it's six year old kids movie. It has charm and eye-candy animation but it suffer confused script. Sorry Scrat, this time for Granny, she rocks!"
    },
    {
      "rating": "4",
      "text": "I don't know why a fourth Ice Age movie was made. I loved the first three movies, but this one fell short of my expectations. I laughed a couple of times, but I could have gone without seeing this movie."
    },
    {
      "rating": "4",
      "text": "Would the world come to an end if I didn"
    },
    {
      "rating": "8",
      "text": "Half amazing movie. Granny was amazing but in some parts the movie turn a little bit boring. But was a different thing  that used to do this and the pirates and the separation of the continents was a good touch."
    },
    {
      "rating": "5",
      "text": "I do not hate Ice Age 5. It has good morals, the four main likeable characters, and some good laughs. However, this is weakest Ice Age film. There are way too many characters forcing the writers to come up with things for every else to do while Manny, Sid, and Diego battle the pirates out at sea. There are potential plot lines for the movie such as Sid dealing with his family or Manny dealing with his daughter Peaches and her having to fit in. However, these plot lines are either ignored or poorly written providing a lot of stuff that has been done before. There are new characters but none of them are likeable or interesting. Plus, the film tries to be hip with teenage mammoths who have crazy hairstyles and has a bad musical number. All of these elements come together to form a meh film that is the worst of the franchise. Unless you are a little kid or a fan of the films, then this is a definite skip."
    },
    {
      "rating": "6",
      "text": "As is the fashion these days with these films there is a lot of moralising going on and a lot about the importance of family. I don’t usually have a problem with this, but in this film it was so ‘in your face’ that I felt it got in the way of the story. I didn’t enjoy this one as much as the other ‘Ice Age’ films, probably because it has lost all the charm the characters had in the earlier films. On the plus side, Peter Dinklage did make for a very intimidating and threatening advocacy. I guess it wasn’t until about the last 20 minutes that I began to warm to any of the characters, but by then it was far too late. Time to put the franchise to rest guys. I’ve probably been a tad to generous with my score, it’s because Sid does make me laugh!\r SteelMonster’s verdict: RECOMMENDED (Just)\r My score: 5.7/10"
    },
    {
      "rating": "7",
      "text": "It's Ice Age, you either love the series or you don't. Ice Age has always been aimed at the family, it's meant to entertain the kids and hopefully not be too boring for the parents. In Continental Drifts case kids will as always love it, but adults might have some trouble being as enthusiastic as their kids are for this one. It tells a familiar story with familiar life lessons that have been tossed into tons of other kids movies. It manages to bring some laughs but, just like the other sequels, never manages to capture the magic that the first Ice Age had. The kind of magic that charmed adults and kids alike. In the end it's a decent and enjoyable family movie, but it's going to be one that the kids love but adults only tolerate."
    },
    {
      "rating": "9",
      "text": "A funny and humour filled film. This was the best ice age movie in my books. From start to finish it was an incredible journey and one I thoroughly enjoyed. This was a visual journey along with the epic story"
    },
    {
      "rating": "8",
      "text": "The new Ice Age: Continental Drift movie is a great movie, although not the best in the series. After watching Ice Age: Dawn of the Dinosaurs (which is a decent movie), I was asking the same question: Can Ice Age bring a 4th movie or not? It's just like Alvin & the Chipmunks and critics doesn't want anyone to see it. But I was wrong because I usually don't trust them. Anyway, great film, I hope all 3 movies of the family movie season this summer (Madagascar 3, Brave, and Ice Age 3) should be no big deal. I can't wait for Paranorman coming out before my birthday."
    },
    {
      "rating": "5",
      "text": "Ice Age 4 may be the funniest film of the entire series and the animation is the best yet, but it has a story that has become very predictable just within the first half hour. Also, the film has become too crowded with characters and lacks development for many of them. Even so, some moviegoers may still like the adventures here. Just know that there is not much to keep this installment feeling new."
    },
    {
      "rating": "6",
      "text": "Saved from mediocrity by it's strong characters, decent humour and okay villain."
    },
    {
      "rating": "5",
      "text": "It was a solid adventure and Peter Dinklage was a great villain and Jennifer Lopez was suprisingly rather solid as Shira and I really liked Wanda Sykes as Granny but I absolutely hated Drake, Nicki Minaj, and KeKe Palmer in this movie. They were simply an awful fit. Also, I love how there are mammoth children but only 2 adults, Sort of a fail on their end. Honestly, I think the Herd's side of the story was good but the story with Peaches and the rest of the group was just weak and brought down the movie."
    },
    {
      "rating": "6",
      "text": "the ice age series has in my opinion, always been a good series of movies, and this movie does not fail to keep its reputation up. however, it just didnt get me hooked on the story, so im giving it a 6"
    },
    {
      "rating": "5",
      "text": "If you have watched the previous three you might as well watch Continental Drift, though you will know exactly what to expect. Producing a third sequel is an indicator of how successful the franchise has been but also underlines how dependent studios can be to roll-out another sequel, devoid of too much development, for a guaranteed return. Anyway that's not Continental Drift's fault.\r As with Dawn of the Dinosaurs there are additional characters this time around, a whole heap of them in fact. Sid's Grandma arrives, Diego has a love interest, Manny's daughter's gang, the film's villain and his posse of pirates to name a few. The producers clearly made a decision to make Continental Drift more teeny than the previous films, perhaps to match the age of the audience that has grown up with the franchise and the casting of the likes of Nicki Minaj, Drake and Jennifer Lopez underlines this, while the writing for Minaj's and Drake's characters does not so much underline it as write in capital letters, LOOK AT US COOL WRITERS, THIS IS WHAT TEENAGERS SOUND LIKE. Anyway, it's a kids film, who can get mad.\r Thankfully the troublesome teens are kept on the side of the plot which serves just to occupy the half of the cast which aren't cut adrift and captured by Captain Gutt, brilliantly voiced by Peter Dinklage (Tyrion from GoT). Nick Frost voices Flynn, an effeminate seal in Gutt's employ, and his lines were the stand-out moments for me. Scrat's acorn hunt is still going and is always an enjoyable distraction from the central storyline.\r As ever the film looks great, kids will enjoy the action and fun but for the rest of us the franchise feels tired, in the sense of characters and plots. However, with Continental Drift making over $800M it may be that Sid and co. are not on the verge of extinction just yet."
    },
    {
      "rating": "4",
      "text": "Sure, there's some cool visuals, but that does not hide the dull and clichéd story. This fourth movie in the series just seems like it's forced and repeated. It's also not as funny too. In the end, it's a disappointment."
    },
    {
      "rating": "8",
      "text": "One of the best Ice Age movie sequelz ever seen !!! What a  mindblowing  graphics and itz 3d effects. The best part is i loved the part where the daughter mammoth feelz for the missing of father mammoth due to the so called \"continental Drift\". However the music was also scored perfectly well. As usual as in all the other parts there was this guy tat small squirell running around the globe searching for the island of chestnutz."
    },
    {
      "rating": "8",
      "text": "Got this for the kids without having seen the other Ice Age movies. The story was good, with some singing and off plot diversions which the kids enjoyed every time they appeared in the movie. Even the part where the characters sang were enjoyed. There were some references that could peak your caution for the kids. But few and far between. The animation is very good an believable for the kids."
    },
    {
      "rating": "6",
      "text": "This movie was definitely intended for the youngest of viewers with the attention span necessary to enjoy it. In Ice Age's fourth outing, Manny, Diego and Sid find themselves separated from Ellie and Peaches after the continents begin to drift. Unlike Toy Story 3, a paragon of a movie for kids and adults, the story is just a vehicle to sell the 3D effects. The humor is few and far between, the new characters are window dressing and the old characters are good. Just good. Do not go see this movie without a five or six year old. Laughing with them is probably the only way you'll be able to laugh at all."
    },
    {
      "rating": "9",
      "text": "Let me take you back to the early 2000s. The Dreamworks film Shrek was all the rage when it came out in 2001, and Pixar had its first serious competitor. With two titans of computer animation battling it out in a huge colosseum of moviegoers, it seemed like computer generated imagery (CGI) was the way of the future. As with most innovations in the history of film (like the transition from black & white to color), studios have always taken the \"Innovate or duplicate?\" stance. Throughout the rest of the decade, there were so many computer animated films that it was like an infestation.\r But enough about history. Let's talk about a film that has... history.\r The first Ice Age film from 2002 is known by pretty much everyone. It was a beautifully animated tale about prehistoric animals bringing a human infant back to his colony. What made this film work so well is that it had something for everyone. Adults could enjoy the familiar voice actors and timeless story while kids delightfully laugh at all the silly moments.\r Flash forward 10 years later and we have Ice Age 4. The animation is some of the best I have ever seen. The characters have such a great charm to them that even the villains look absolutely adorable. All your favorites are back: Sid, Manny, Diego, the possums, and of course the lovably mute Scrat. The jokes are still funny, the silly moments are still silly, and the touching moments are still touching. The only thing this film lacks is an original story. It's your basic \"family gets separated and has to find each other\" story, and please don't ask me to sing Somewhere Out There.\r The film's biggest strength, however, is the characters. They have such distinct personalities that it makes for a lot of humorous moments. Simply watching these characters argue is like watching an animated sitcom. The way they propose different solutions to their problems makes for some very creative scenes. When all of it adds up, you have a fantastic adventure filled with adorable characters and delightfully silly moments."
    },
    {
      "rating": "7",
      "text": "Ice Age: Continental Drift was good; but wasn't my type of movie. I think it's good for young children, since it does have it's funny spots. The introduction of new characters gives fresh air to the somewhat dry and dying series. Overall, if you're taking your family or child(ren) to see this movie; you'll have a good time. Don't go to this movie with your friends (teenagers or adults) it's not recommended."
    },
    {
      "rating": "6",
      "text": "This Ice Age hasn't really improved on the last, but it is still clever and funny in parts, just like the three previous films. However, it does feel like the writers are running out of ideas and are now aiming at children rather than a range of ages."
    },
    {
      "rating": "10",
      "text": "The best in the series."
    },
    {
      "rating": "8",
      "text": "I found it way better than the previous one. It`s full of fun funny lines.I was surprised that they still had a decent story, cause I went into this thinking the series had nothing left to give."
    },
    {
      "rating": "8",
      "text": "Ice Age: Continental Drift was an enjoyable movie because there was lots of action and humor. The grandma was absolutely hilarious, and I was very surprised when I learned \"Precious\" was real. The pirates were the main baddies throughout the movie, and the evil monkey was a great antagonist. There were character changes such as the female Saber turning good. I didn't think her punishment from the monkey was harsh enough. The little chipmunks with their gliders made me laugh so much, but I don't think the producers kept with only Sid being able to talk with the chipmunks. Peaches was annoying and too soft, and the mole should have never become friends with her again after she said she wasn't his friend. The squirrel always makes me laugh, so I wasn't surprised that it did while watching this film. I'm not sure why it has such a low rating, because it really is a great film for anyone to watch."
    },
    {
      "rating": "6",
      "text": "Ice age is my favorite animation franchise. But this one really was a kick in the face for the fans! They ruined the best thing of the movie  the ICE AGE! Why the hell are the mammoths dancing to dub-step?!! \"Peaches\" character is just аwful for the sequel! My expectations were big and i was disappointed. BUT STILL i can't give a bad score to \"Ice age\", because no matter what it's the biggest animation franchise for the 21th century."
    }
  ]
}