{"id": 870, "title": "Ice Age: Collision Course", "starring": ["Ray Romano", "John Leguizamo"], "runtime": 95, "genre": ["Adventure", "Animation", "Family", "Comedy", "Science Fiction"], "description": "Set after the events of Continental Drift, Scrat's epic pursuit of his elusive acorn catapults him outside of Earth, where he accidentally sets off a series of cosmic events that transform and threaten the planet. To save themselves from peril, Manny, Sid, Diego, and the rest of the herd leave their home and embark on a quest full of thrills and spills, highs and lows, laughter and adventure while traveling to exotic new lands and locations.", "releaseYear": "2016", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/tFzUkdhPOForVrEfvxydXfPLrZR.jpg", "categories": {"plot": 3.6545454545454548, "acting": 3.76, "ending": 2.9, "soundtrack": 5.0, "cinematography": 4.0, "familyFriendly": 4.647058823529412, "funny": 4.575, "action": 3.0}, "reviews": [{"rating": "4", "text": "This franchise is still going? I can guarantee that in any circumstances, it just can't get anymore better. While the whole Manny/Diego/Sid thing gets worse and worse, Scrat's montage of everything just keeps getting better and better. Sad to say while Scrat steals the show on this one, he isn't enough to stop the Ice Age franchise from going straight to a collision crash."}, {"rating": "4", "text": "I love Ice Age, but this movie shows it's about time to put a plug on the series for good. The first movie was incredible and is without a doubt the best in the series. The second one was decent. Not as good as the first one, but I still like it. The third one in my opinion was actually the most memorable. It's actually pretty good. Its not the best, but it's my personal favorite. The fourth one was kind of cringeworthy, and was very mediocre. And this one is just bad... the only praise i can give it is that Scrat is better than ever in this one. Everything else, well... it sucks. Big time. If Fox won't kill the series, then they should at least reboot it."}, {"rating": "4", "text": "YES, kids will enjoy it because you know - colors and stuff. But the parents who'll be forced at gunpoint to watch it with the kids will want to take the gun and shoot themselves in the face upon witnessing the overly ridiculous antics of the characters and the tired, cliched and overdone plot points."}, {"rating": "3", "text": "Why? Just...why? You know what happened to the Ice age franchise? It melted! The first one was a masterpiece, the second was also very good, the third one was acceptable, the forth one was horrible but this....this was the last drop of milk they milked from this franchise! Horrible, just horrible! Too much comedy, its like they're making fun of what was actually meant to be interesting back then! So here's what i want to say about all the Ice age movies! Only the first two ones have actually something to do with the franchise! Bringing the Dinosaurs back from the dead?Well... strange but was fun. Jungle pirates and mamoths dancing to dubstep? Wtf?! And now... a **** squirrel who travels to space and sends asteroids to Earth?!...Okay, enough."}, {"rating": "1", "text": "Animated kids films have generally been hit or miss in 2016. Kung Fu Panda 3, Zootopia, and Finding Dory have been hits while Norm of the North, Ratchet and Clank, Angry Birds, and Space Dogs: Adventure to the Moon (seriously, who thought of distributing that into theaters) have been utter misses. Now, enter Ice Age 5, three ice ages too many, that does nothing to break the trend of dismal kids films.\rThe only thing I can compliment is the animation, which is continuously good. It's not Pixar's platinum standard, but still good. Everything else is an utter trainwreck.\rWith a shoddy plotline and story, forced moments, stereotypical characters, and an annoying, seemingly last-minute script, the movie is not only 90 minutes of dead-weight, but a textbook example of sequelitis that will receive a seal of disavowal."}, {"rating": "4", "text": "Though still entertaining for younger viewers, Collision Course goes to show how long overdone the Ice Age franchise is, and is filled with an overstuffed plot, unnecessary characters, and a lack of humor and charm."}, {"rating": "4", "text": "I think the film was ok-bad, maybe you have a bit of fun if you watch it the first time. A few jokes are funny but the rest is just boring and the story is lame.\rBut if you watch it the second time, you'll get fast tired. The jokes aren't funny and the story was lame and the second time you can nearly sleep!..."}, {"rating": "0", "text": "This installment of the franchise was one that proved that Ice Age should have ended at the third movie. The story is so predictable, you can guess how it ends just watching the trailer alone. They focus way too much on the humor, and I mean WAY TOO MUCH TIME. I'm not joking, there are about 10 characters attempting to be the comic relief. And the funny thing is, none of them are funny. Maybe a small chuckle came out because of Buck, but everyone else relies on their idiocy, moving around like they're in a Sony Pictures Animation movie, or just making bad puns. However, even if it is Blue Sky's worst film, it doesn't mean it can't offer anything good. To its credit, the end song is really good, the animation is stunning, especially in Geotopia, and I'll admit it, Scrat is kind of funny. Just not as much as the previous films. But they can't make the film anywhere near passable. And word on the street is they're thinking about making a SIXTH ICE AGE MOVIE! Why can't they make more films like The Peanuts Movie, or even Horton Hears a Who?"}, {"rating": "3", "text": "Creo que el problema principal de esta película es que tiene muchos personajes, ahora para desarrollarlos y para que la gente los recuerde es cosa que un estudio esta desesperado de dinero.Además, los deus ex machima's que ocurren en la historia son absurdos como la propia película.Al menos sale Neil Craig Grayson. Y German Garmienda aqui esta....ñeh..."}, {"rating": "1", "text": "This movie, simply said, is just plain awful. Stick to the original. The Ice Age movies get progressively worse, but this one is abysmal."}, {"rating": "3", "text": "Oh god...this film shows how much this franchise has only gone downhill since the first movie. Well before I start my review I must say that I have watched every other Ice Age movie, the first one was good, the second was okay but forgettable, the third one was okay but more memorable than the second one maybe because of the dinos and the fourth one was terrible and extremely forgettable, I mean really I just can't remember anything from the fourth movie. Without wasting anymore time, lets start the review.\rLets start off with the story. While Scrat was doing its usual protect the acorn it ends up finding an UFO which he activates and after an accident creates a giant meteor that is going to fall on earth, and because of that, manny and his friends must go to a certain place in order to change the course from the meteor.\rWell...the main theme of the whole franchise is its own name, the ice age, but this fifth installment just doesn't feel like a movie about an ice age anymore with all those space ships and bizarre \"crystals that make you young\" worlds, it feels more like a mess of a world with some snowy sceneries to try justifing the name of the film. The older movies used to follow the ice age theme pretty well, with the first and second movies as biggest examples, and they were also quite realistic with this theme as well, with the animals fighting to find a place to live after a flood, but collision course just doesn't do that to the point of being completly silly. Speaking on silliness.\rIf there is one thing that this movie went way overboard is the humor, while this is a very important element in a kids movie, I guess it filled the script with so much unnecessary humor to the point that it lacks drama. The older films used to add a bit of drama to the story in order to make it more balanced such as in the second one with Manny's wife back story for example, but in this movie I just can't find a single at least touching moment. As for the humor, while there are some good jokes here and there, a few of them aren't all that funny to be honest.\rBy the way, this film doesn't have a villain...wait, there actually is a villain, three of them actually, and they are a family of some dino birds who want the meteor to fall on earth in order to kill everyone and make them the only survivors, I know, it is a stupid idea (dinosaurs weren't really known for being smart). These are without a doubt the worst villains in the series, they only do one somewhat significant thing in the story and that is about it, the rest of the film they spent their time literally goofing around just to befriend the heroes at the end (by watching the film it becomes very obvious they are going to become good so it isn't that bad of a spoiler).\rAnother huge issue this movie has are the characters. There are many of them...too many. The characters in this film not only get little to no character development but are very forgettable and some of them felt just unnecessary to the plot (looking at you Sid's Grandma, I mean really, there was any reason to include her in hte story despite to bring even more humor to the story). This movie lacks focus, I didn't felt interested on any of these characters and even some of my favorites such as Diego and Sid did almost nothing in the story.\rWell I guess it is time to say some good parts about this mess of a movie. I am not really good at rating animation but I guess it felt good with some smooth movements and with the characters being very expressive, and the characters designs are also pretty good and there truly are some funny moments on this movie.\rThis pathetic excuse for a sequel shows it is time to finally put a nail in the coffin of this once good franchise. It might provide some fun for children, as for adults not so much, but just like the fourth movie, this one in bound to be forgotten. This franchise shall die to a meteor now."}, {"rating": "3", "text": "They've already jumped the shark, AND KILLED IT!!!\r Ice Age: Collision Course is the definitive example of how low can a franchise get in terms of quality, with an overstuffed story filled with pointless subplots and incoherent stuffs, characters with no purpose, development, or even life, and some nice yet old animation."}, {"rating": "3", "text": "Hear me out, I love me some Ice Age, but whenever you put another sequel, then something is wrong with your ego. That's what happens to Collision Course. The only better sequel the franchise had were The Meltdown and the underrated Dawn of the Dinosaurs. As a fan perpective, I just don't care about the Ice Age movies anymore. Same cast (even though it's not their fault), corny script, and most of all, the franchise just nearly passed their prime. If you don't give me a great story, then it's over. I'm not going to Fandango and spend $15.00 to watch this snoozefest unless you freshen up with a reboot. It's another example of bad movie sequels failed big time to match their predecesors (Zoolander 2, Alice Through The Looking Glass, TMNT 2, etc.) I guess I'd just save my money for Suicide Squard (or I'd like to call them \"The DC Villain Expendables\"). Can't wait."}, {"rating": "1", "text": "this whole film collapsed in the first 2 minutes and it only got worse. there are way too many characters and many of them serve no purpose whatsoever and the writing is atrocious since the material has been stretched so thin that it has absolutely  nowhere to go. the whole thing is loud, obnoxious and really not funny. the only positive is the animation and even then it still feels underwhelming. please let this be the last one cause there is nowhere else for this tired old franchise that barely resembles itself anymore to go and feels like these sequels only exist to give each of the characters a love interest."}, {"rating": "2", "text": "Can we PLEASE kill off this franchise already?\rIce Age: Collision Course is the 5th movie in the Ice Age series; why this series has 5 movies, we'll never know.  Now i'll admit, the first 2 Ice Age films were actually pretty good.  They had likable characters, an interesting story, top-notch animation, etc.  Ice Age 3 was where I started to question whether or not the series was going anywhere, and Ice Age 4 was complete crap.  So where do you go after complete crap?  Complete garbage.  This is easily one of the worst films of the year so far.  The characters that the movie try to introduce are uninteresting, the plot is nothing but a re-telling of the 4th movie, and there was hardly anything that made me laugh, minus one or two scenes with Scrat.  Ice Age 5 also tries to throw in many subplots, and give you little reason to care about them.  The charm and magic that made the first 2 good is nowhere to be found; it's as if the creators never watched the first two films.  Granted, the animation was decent, and kids may find some enjoyment out of it, but that's about it.  Ice Age 5 is nothing but a bland, uninteresting, and boring sequel that does nothing to add to the franchise.  Again, kids may get some enjoyment out of it, but otherwise, don't waste your money on this unneeded waste of time.  Go see Star Trek Beyond, it's so much better.\r Ice Age: Collision Course gets a 2/10."}, {"rating": "0", "text": "this is so bad that i really couldn't finish..is getting a point that all is about  the money.. even if the profit is low. Is really disgusting  to see how poor writing became , just fired everyone plz"}, {"rating": "1", "text": "Illogical; clumsy and choppy, Ice Age: Collison Course has a great ability to entertain young viewers, but its efforts of being a nice film for the whole adience are damaged thanks to its thin plot and unfunny moments."}, {"rating": "2", "text": "Time to end this franchise.Humorless, wrongly scripted, no connection with the \"Ice age Universe\". Only Scrat tries to save this film. If you're a fan of the franchise,it´s something to avoid ( has it was Ice age 3 and 4 )."}, {"rating": "3", "text": "Ice age!!! What happend to you?! You were cool before with your three last movies!! but now look what have you done you finished this franchise in the worst way, Guys!! as it says Robbie Rotten \"Don't let your kids watch it\""}, {"rating": "3", "text": "I was shock to see how stupid this sequel is. And yeah,Unfortunately, the franchise of the Ice Age started well but ended badly. The animation is good and has few jokes that are good, but the script is terribly wrong, the characters are annoying and the story doesn't connect to what is supposed to be \" the Ice Age\". Not even Scrat and his cosmic stupidity save this film. If you're a fan of the franchise, see it, but this sequel leave me too many scars, and i think adults will be bored, and if you don't want to see more Ice Age films, DO NOT WATCH IT."}, {"rating": "3", "text": "Ice Age: Collision Course was a huge failure. Characters were all uninteresting (Even Scrat lost his humor in this), Story was OKAY, the \"villains\" are SUPER forgettable, Most jokes are unfunny or just plain bad, it's even worse than Ice Age: Continental Drift. Don't even bother to watch this movie, it was a disaster.\r The only good thing was the animation. Nothing else."}, {"rating": "1", "text": "Terrible. Very, very boring. Series that started so great finishes so badly. And apparently there are plans to make yet another movie! No, thank you. Don't waste your time and money. There is nothing good I have to say about this movie. Stay away!"}, {"rating": "0", "text": "Ice Age 5 is worst movie of 2016 worst worst worst worst worst worst worst worst worst worst worst worst worst worst worst worst worst worst movie of 2016"}, {"rating": "1", "text": "Bad movie.I hate this movie so much so bad and so unforgettable.But the ending was good.But this movie still suck.This movie by far is the worst movie in 2016.I give this movie a 1.8/10."}, {"rating": "4", "text": "The Ice Age series has finally jumped the shark. I mean, it's not like any of the sequels lived up to the first anyway, but this is the first one that feels like it's run slam out of ideas for laughs. The plot is the most absurd yet.The biggest issue is that it's just not that funny. Rather than real jokes all we get is a bunch of dumb physical humor, silly antics that are more obnoxious than amusing, and butts. You know, because butts are funny. Why? Because they're butts. Or at least that's what Collision Course keeps trying to sell us on. I have a hard time believing that even the youngest among us will find this all that funny.Like I said, the plot is absurd. And despite it's \"end of the world\" stakes it's noticeably boring as well. Long running subplot of Scrat's quest for the illusive acorn takes him to space. It's so dumb and over the top it's hard to imagine this all was somehow born out of the first movies more-grounded roots.So at this point it should be very obvious that Collision Course isn't a good movie. Yet, even with all of it's faults this still isn't the worst Ice Age. That would still be The Meltdown with it's all too depressing plot and unlikable new characters. No, Collision Course just goes too over-the-top and stupid. It's very clear that the writers were just out of ideas but still wanted to cash in on the Ice Age name. Unfortunately for them this may be the what kills their cash cow. Because even the biggest Ice Age fan is likely to be disappointed with this latest outing, regardless of their age. As for the parents? Well, the prospects of taking their kids to see the next one has likely gotten a whole lot worse. 4.9/10"}, {"rating": "0", "text": "It's easy to here what exactly the developers at Dreamworks discussed while trying to keep this series alive. \"We're running out of ideas, WE'RE IN F**KING SPACE!!!\""}, {"rating": "6", "text": "This time the trouble comes finding them.\r It was handed over to the two new directors and the result is not so good. This is a most simplest film in the 'Ice Age' series. For the first time, the franchise is in real trouble. Though it managed well at the box office, which is a below par compared to the previous installments. It looks like a short film or it should have been a short film. From the adventures to the locations, everything shrunk in this sequel. Except Scrat, who goes for a lifetime journey into the outer space.\r As usual the story continued, but this time Manny and his family and friends do not go anywhere, the trouble comes to them. So they have to find a solution to escape from it. At the right rime, Buck returns from the underground and teams up with his old friends to tackle the situation. Besides, Peaches getting married and all the fun adventures from the earth, as well as from the space in the solar system aims at one direction.\r Nowadays the space adventure is a big thing in films, and this franchise always extents its boundary for its new sequels, so this time it was something bigger than ever. I think it won't get bigger than this in a concept wise. Particularly Scrat who has been the backbone for this series donned with a spacesuit. Like Minions and Penguins, I too want Scrat's stand alone film. But I think that would not happen, not anytime soon, since those two films did not deliver the expected result.\r If you are an 'Ice Age' series fan or not, it does not matter, you will be slightly get disappointed for sure. Now it has overtaken the 'Shrek' franchise with this fifth film and they are already thinking about the sixth. This is not that bad, just a watchable average film and you need to be updated if you want to continue the series in the future. So that's the reason I suggest to watch this. Other than that, it is totally ignorable one.\r 5.5/10"}, {"rating": "5", "text": "As a movie on it's own I think it was decent, but if you have seen all the previous ones, it gets quite stale and does not bring anything new here really, so I tend to agree with others that they should shut it down and focus on other movies instead of making new parts for it."}, {"rating": "7", "text": "\"Collision Course\" Exceeds The Low Expectations\r The prehistoric animals most successful in the animation films return to the movie theaters for fifth time, now, the end of the world is their great concern.\r \"Collision Course\" is titled the last adventure of the franchise most  recalcitrant in the animated world - with reference to revenue at the box office -. What started as a emotional and poignant incident more than one decade ago, has evolved admirably, but not always with satisfactory results. The fifth installment opens with a shameful but entertaining prologue focused on the endless mishaps that suffer our saber-toothed squirrel, Scrat (Chris Wedge), mishaps that leading him to outer space, seemingly, a safe place, however, Scrat continues his battle causing a chaotic clash of worlds, projecting millions of purple meteors to planet Earth, endangering the life of all animals.\r Indisputably, Scrat is Blue Sky's emblem, what is Buzz Lightyear or Nemo for Pixar. Regardless of the frequency of his appearances,  he always maintains his crazy and stimulating essence in each act, and without him, it would not be possible more films in the saga. Screenwriters and writers have discovered the rough gem that was hidden since 2002, a small and irritating animal, focusing on each plot twist as a consequence of the facts carried out by the squirrel, one point in favor. \"Ice Age\" still has future and even with Pixar (\"Finding Dory\") and Illumination (\"The Secret Life of Pets\") on the look-out, Many, Diego and Sid have high possibilities to continue with the winning streak at the box office, at least, that seems.\r The fate of prehistoric mammals has been relatively good, and it seems that everyone (with exceptions) live in pairs. Manny (Ray Romano) and Ellie (Queen Latifah) face the rapid maturity of their daughter Peaches (Keke Palmer), who is in a kind of relationship with Julian (Adam Devine). A sub-plot anything original and very predictable, since Julian did not get along with Manny, but yes he got along with others, unleashing the envy and jealous of the mammoth, and if there is someone so naive, it has a happy ending. Nothing new!. Diego (Denis Leary) and Shira (Jennifer Lopez), the saber-tooth tigers, get supporting roles and their characteristics fades for a moment, besides, the screenwriters give clues of a possible litter between these two tigers in one scene, something that continues leading it astray. They should perhaps rethink the spin-offs about a character in specific, for not to damage to generational characters. Sid (John Leguizamo) is still in an emotional imbalance, something by what we love him, much of the comedy is centered in this cute animal that will continue producing loud laughs for the rest of our lives. The opossums, Crash (Seann William Scott) and Eddie (Josh Peck) remain comical objects used for the humor of the film. Buck (Simon Pegg), the star of \"Ice Age: Dawn of the Dinosaurs\" is infuriating, cumbersome and rough, his jokes and eccentricities did not entertain children nor adults, a character who has to be eliminated immediately. Despite this, he's who predicts the catastrophe, and he's who attracts new, humiliating and poor villains, more filler unnecessary to the story.\r With the seriousness of a cataclysm and so witty characters, Mike Thurmeier and Galen T. Chu recreate a balance between comedy and drama, unbalancing briefly because of Buck. It still is space for moments unique and even memorable, but in a epoch in where is difficult find interesting proposals, \"Collision Course\" comes off  well rid, despite its reused plot. The teachings are also present, the acceptance of a father to the maturity of his daughter, a young's independence, over-protection errors and family work are some of the lessons that the movie wants to assert.\r Soundscapes doesn't reach the visual spectacle that has been regenerated with the passing years, however, it achieves the ambitions proposed. Purple's tonality of the shooting stars , the textures of reptiles and mammals, effects in the sky, the brightness of Geotopia and more details open a privileged place to position itself as a nice addition to the animated world. New characters are insufficient and none manages to deliver what they promised, so it leaves on a slope to the likely next sequel. We want to continue to seeing what it is capable of providing that ice age that once shook us, those mammals, who still do not deserve to die out."}, {"rating": "7", "text": "Ice Age: Collision Course is an animated comedy adventure film directed by Mike Thurmeier. Stars the voices of Ray Romano, John Leguizamo, Denis Leary, Queen Latifah, Keke Palmer, Jennifer Lopez, Simon Pegg and Chris Wedge, returning, and the new voices of Jesse Tyler Ferguson, Adam DeVine, Nick Offerman, Max Greenfield, Stephanie Beatriz, Melissa Rauch, Michael Strahan, Jessie J and Neil deGrasse Tyson.\rThe movie follows the old crew of Manny and his family Ellie and Peaches, Sid, Diego and his wife Shira plus some friendly faces come back, such as Buck who was first presented in the third movie. After many adventures together, now the crew has to escape an asteroid that is headed towards them.\rThis is a fun family friendly adventure that is definitely more on the focus of kids but adults can have some laughs here and there too. I get why a lot of people hated on this film, it is the 5th one in the franchise and the formula has become too obvious at this point. It's easy to just hate this film and be comfortable saying I HATED IT, it sucks there is nothing good about it, they should just stop making these, BUT the matter of the fact is that this is a better film than the last one, and just okay overall.\rThe animation is really good actually, and most of the characters are likable, especially Buck voiced by Simon Pegg. He's funny and moves the story forward in a very fast pace. Also the messages and lessons that this movie has are very much for families, and that is great. There is pretty much nothing offensively bad about this film. and while some jokes do not hit and the story is pretty generic, still it is mostly meant for kids and in that regard it works."}, {"rating": "6", "text": "I have no clue why the newest Ice Age has such a low rating. First of all let's make things clear. This is a animation mainly for kids... There are in fact some situation which also will be funny for adults but remember - It's for kids! I have to agree that the first releases were more entertaining and simply more fun to watch, but this one is definitely NOT BAD. I also agree that there might be too many characters and not all of them are making you laugh or smile, but still - watching (and hearing!:D) Sid and our favorite squirrel makes us feeling good again. If you have some spare time and other movies seem not so interesting for you you could give this one a chance, especially if you have kids."}, {"rating": "10", "text": "The series is already off the track but it's still a great movie.Ice Age : Collision Course is a great animation movie that would make the series come back-to-life, though the story of the movie is quite predictable."}, {"rating": "5", "text": "Impressive visuals? Yes. Cartoony and stupid? Also yes. I like Ice Age movies, but Collision Course really wasn't that great. At least it was better than The Secret Life of Pets."}, {"rating": "6", "text": "I have no clue why the newest Ice Age has such a low rating. First of all let's make things clear. This is a animation mainly for kids... There are in fact some situation which also will be funny for adults but remember - It's for kids!  I have to agree that the first releases were more entertaining and simply more fun to watch, but this one is definitely NOT BAD. I also agree that there might be too many characters and not all of them are making you laugh or smile, but still - watching (and hearing!:D) Sid and our favorite squirrel makes us feeling good again. If you have some spare time and other movies seem not so interesting for you you could give this one a chance, especially if you have kids."}, {"rating": "7", "text": "animation sequel. This is the asteroid episode of the cute, sometimes funny and generally entertaining franchise. It's a bit more surreal, which I liked and very pink and purple, which I didn't. Nothing new here, but the old stuff's good so I didn't mind. A sequel that doesn't put you off the idea of yet another in a few year's time."}, {"rating": "3", "text": "From the studios that brought us \"The Peanuts Movie\" and \"Rio\", the biggest bang from the blockbuster franchise \"Ice Age\" just got a sequel in its fifth installment \"Ice Age: Collision Course\". It follows the acorn-addicted squirrel Scrat in his epic pursuit that launches himself to the universe, setting a series of unfortunate cosmic events, leading to threaten the mammals of the Ice Age world.To serve as the earth's last hope, our mammal squad must embark on an adventure that leads them in discovering scientific theories and introduction to a bunch of way too many characters, all of whom are either under-written, half-baked, useless or even quite annoying for some parts. There are a lot of physical humor, conventional yet colorful animation and themes of love for the family, that kids would at least probably enjoy.As a science-fiction flick, \"Collision Course\" ultimately suffers from its unbelievably hyperactive and exaggerated premise. Also, the third act seems to be rushed and forced with a twist that feels out of place.VERDICT: What we totally get from Ice Age: Collision Course is included in its tagline: One Giant Mess."}, {"rating": "5", "text": "Worst in series with humour lacking and story very lame but characters remain somewhat entertaining."}, {"rating": "3", "text": "La era de hielo ya estaba bien al final de la 2, pero la explotaron y explotaron. Esta entrega es mala, y peor aún tener que escuchar a HolaSoyGermán."}, {"rating": "1", "text": "Let me make this concise:- Extremely unfunny and unoriginal.- Uncomfortably odd and forced humor with strange, inappropriate suggestive jokes and moments for kids. (Worse than some Disney movies).- Too much focus on a main topic that shouldn't even be brought to kids' attention at that age. (Couples, breakups, marriage, and all the inaccurate, cliché drama that follows).- Unrealistic plot. (Obviously)- Bizzarre, hard to follow, and completely non immersive storytelling- Only main amusement was Scrat. (Even in an odd deep space setting.) Hence my 1/10."}, {"rating": "1", "text": "HorribleWOW this was awful, Ice Age: Collision Course may have beautiful animation (Most likely the only positive about this film) but has awful and immature humor (Not even Scrat is funny anymore), Ruined multiple characters (Especially Buck, Crash, and Eddie), The writing is atrocious and dumb, The new characters are blander than an empty piece of bread, and a really stupid subplot about Sid falling in love (It worked for Manny and Diego in the previous films because it didn’t feel forced and Ellie and Shira were fun characters). Overall STAY AWAY from this franchise killing disaster."}, {"rating": "3", "text": "Ice Age: Collision Course was a huge failure. Characters were all uninteresting (Even Scrat lost his humor in this), Story was OKAY, the \"villains\" are SUPER forgettable, Most jokes are unfunny or just plain bad. I'd rather stick with the first four films. And I cannot believe I watched this movie back on August 2016. I can't even believe this. Don't ever think about watching this movie, it was a complete disaster. Just don't, at all. It's worse than Frozen! I mean it! Grade: 3.4/10, D-."}, {"rating": "2", "text": "Honestly, the public has lost interest in this franchise since Fox has announced a fourth film. Without surprise, the film becomes the worst of the franchise. Innovate would be the key to the situation of today's animations. 2.6/10"}, {"rating": "1", "text": "Unfortunately, the Ice age franchise started going downhill after the second movie. There's a limit for absurdity, silliness and cheap humor, even in animations with talking animals, and when the plot starts surpassing that limit, the movie becomes unenjoyable for the majority of people, except for the kids and those that only care about the animation, one of the few reasons that I don't give a 0 to this horrible movie because the animation really is gorgeous. It's clearly visible that the Ice age movies are no longer made for \"everyone\", but only for those \"under 10\". Let's pray for a decent sixth movie that redeems this franchise with so much potential."}, {"rating": "4", "text": "Es momento de que se cierre con la franquicia de una vez por todas. Decaída notable con cada película que sacan. Situaciones super forzadas, historia super básica y un humor absurdo muy reutilizado. Nada que decir, no es una sorpresa porque esta película es muy mala."}, {"rating": "1", "text": "This is the bottom of the barrel for the Ice Age franchise. This once-loved animated franchise has lost all my respect with this movie. The first one is one of my favorite animated movies of all time and one of my favorite non-Disney or Pixar movies, the second one was okay, the third was mediocre at best, the fourth one was awful and this...I don't have words to describe.They turned Ice Age into an Illumination kind of movie. The plot, the dialogue, the characters, everything is now dumbed down to appeal to stupid kids. You might say that that's the point (it's made for kids)but just like with Minions, Cars 2, Ralph Breaks the Internet, and all the Illumination movies, that's no excuse to make a movie that has zero artistic value and that treats kids like if they're stupid. Great animated movies for kids are those that both kids and adults can enjoy and get something from and this is not the case, this is a movie that was made for no other reason that to give BlueSky some money because Ice Age and Rio are their only profitable franchises, so, they need to keep making these movies even if it doesn't make any sense, right?I don't give it a 0/10 because Scrat is in it and his scenes are the only ones that made me laugh."}, {"rating": "10", "text": "La película tuvo un aire fresco con la llegada de nuevos personajes. Película muy buena y divertida."}, {"rating": "10", "text": "Goodjob BSS very Great and Good Movie, but kind of disappointed me because Shira and Diego did'nt talk to much and shira did'nt speak much and that's how it gets boring but I liked it so much and nice movie.Respect and Support for Blue Sky Studios."}, {"rating": "8", "text": "Another hilarious Ice Age. These are definitely my favorite animation series. I normally hate animation movies. With the exception of Beavis & Butthead."}, {"rating": "5", "text": "Ice Age: Collision Course ... cmon. For the fifth episode, I went to the cinema with all my doubts. Four, although it was a good film, it just occurred to me that the authors are already cooking a little out of the water and they don't know much about the series and beyond, and unfortunately this film signed it, totally. I don't like to say it or rather I write in this case. The film, which had such a great plot in the first part and the epic event in the third, doesn't offer us much here. The story for me is pretty much nothing. Not much plot. I honestly don't even know what this film was about anymore. Absolutely forgettable. Excuse me, hate. I apologize to the fans of the series, but for me it's simply nothing more than an average film that I wouldn't recommend to fans of the series. In the end, despite all the hate, I praise the animation, which is beautiful and for a lot of scenes, I just said WOW. Unfortunately, the beautiful spectacle is here almost everything in my opinion, what you can see here."}, {"rating": "1", "text": "this movie is the worst movie from 2016 along with sausage party and norm of the north! the first 3 ice age movies are way much better than this!"}], "recommendations": ["ice_age_continental_drift", "ice_age_dawn_of_the_dinosaurs", "escape_from_planet_earth", "the_smurfs", "alvin_and_the_chipmunks_chipwrecked", "penguins_of_madagascar", "planet_51", "free_birds", "ice_age_the_meltdown", "minions", "diary_of_a_wimpy_kid_the_long_haul", "incredibles_2", "spy_kids_all_the_time_in_the_world", "scooby_doo", "the_boss_baby_family_business", "despicable_me_3", "teenage_mutant_ninja_turtles", "chicken_little", "night_at_the_museum_battle_of_the_smithsonian", "the_angry_birds_movie", "hotel_transylvania_2", "teen_titans_go_to_the_movies", "cloudy_with_a_chance_of_meatballs_2", "zookeeper", "yogi_bear"]}