{
  "id": 1862,
  "title": "Identity Thief",
  "starring": [
    "Jason Bateman",
    "Melissa McCarthy"
  ],
  "runtime": 111,
  "genre": [
    "Comedy",
    "Crime"
  ],
  "description": "When a mild-mannered businessman learns his identity has been stolen, he hits the road in an attempt to foil the thief -- a trip that puts him in the path of a deceptively harmless-looking woman.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lIliJCGoWT6tEVaDivLpXEf038w.jpg",
  "categories": {
    "plot": 4.655172413793103,
    "acting": 4.6923076923076925,
    "ending": 4.8,
    "soundtrack": 5.0,
    "cinematography": 1.0,
    "familyFriendly": 3.0,
    "funny": 4.7368421052631575,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Director Seth Gordon's previous feature, \"Horrible Bosses\" (2012), wasn't anything special as a comedy despite its potential, but it contained a few clever moments to make it worthwhile. \"Identity Thief\" makes a fatal mistake when Gordon attempts to incorporate a dramatic element to the story line. By going in this direction, it is no longer possible to view \"Identity Thief\" as a compilation of marginal fat jokes, sex gags, and slapstick humor. Instead, we are forced to absorb a \"serious\" aspect that is so poorly rendered it's unbearable to watch. There are bad movies, and then there's \"Identity Thief.\"\r \"Identity Thief\" starts out as a comedy about a nice, clean-cut guy named Sandy Patterson (Jason Bateman), who travels from the Colorado home he shares with his wife, Trish (Amanda Peet), and two daughters, to Florida. His goal: track down the woman who stole his identity, trashed his credit rating, and cost him his job. She's Diana (Melissa McCarthy), a fat, foul-mouthed dipstick who is freely spending as she adds to Sandy's debt. What transpires is a series of completely implausible situations that transforms \"Identity Thief\" into a mismatched buddy film. And that's when the wheel's come off completely. The film suffers from the classic complaint that the funniest moments were in the trailer, and even then it’s nothing special. A strong contender for the Razzies, and for those unfamiliar, they acknowledge and award the worst movie of the year. Proceed with caution…….you’ve been warned."
    },
    {
      "rating": "1",
      "text": "Ahhhhh!!!! Identity thief is torture!!!! I just hated this film. Other than some of the jokes  that work  the film was just crap.... Seth Gordon forgot the rules of a great laugh  out loud comedy movie. The comic story just didn't work, 1/10. The 1 is for Jason batemen aka the only good actor in the film. Avoid this movie while you still can and look forward to Mellisa Mcarthy's new upcoming film, The Heat........"
    },
    {
      "rating": "1",
      "text": "Disappointing movie, dead humor, weak plot, two dimensional characters. It is a buddy film like \"Due Date\" but has no laughs. skip this movie completely."
    },
    {
      "rating": "2",
      "text": "Such a lazy movie. Melissa Macarthy's shtick is getting infuriatingly repetitive. Jason Bateman, who is usually steller managed to bore me this time around. The director of this film is on a total downward spiral as well. He made Pineapple Express which was good, then the abysmal Sitter and now this. 2013 has been a rough year for comedy. Sigh."
    },
    {
      "rating": "0",
      "text": "You know that funny diner scene in the trailer? Well, that's the only part in the movie that's funny. This is not a comedy. It's an annoying movie which will leave you feeling like time has been stolen from you. Good cast, absolutely horrible script."
    },
    {
      "rating": "0",
      "text": "Just an awful, unrealistic miss that has the same anti-comedic depressing concept of an Everybody Loves Raymond. The glorification of a villain as a comedic character is just not funny. You find yourself wanting to punch Melissa McCarthy in the face rather than laugh at her. That's never good for comedy."
    },
    {
      "rating": "3",
      "text": "A poorly done comedy. With few comedic moments that haven't already been seen in the previews. I counted that I laughed a total of 3 times the entire movie. The crowd in the theater was responsive but I'm not sure how they found it funny. I honestly was checking my watch and waiting for the film to end. If you like cliche comedy movies then this is the film for you. I will say that there was nothing wrong with the acting or the filming but the writing was just bad. It just wasn't very funny."
    },
    {
      "rating": "5",
      "text": "Very disappointed with this one.\rI was hoping to laugh a lot, but I laugh more watching the previews than watching the movie.\rIt was an OK story about stolen identity."
    },
    {
      "rating": "6",
      "text": "No, this is certainly not a polished comedy that can stand proudly next to Bridesmaids and the rest of the canon. But with appropriately moderated expectations, you can enjoy it.  There's some genuinely funny physical comedy and the movie has a heart.  Bateman is terrific, and McCarthy is solid  though this is not her best role and/or she's not directed with as much vigor as she has been.  I seemed to have conflated this movie with the upcoming Sandra Bullock  McCarthy vehicle Heat.  That film goes further with the gross-out violence and in-your-face comedy.  Identity Thief feels a little constrained."
    },
    {
      "rating": "1",
      "text": "The  two redeeming features in the movie “Identity Thief” are Jason Bateman and Melissa McCarthy trying to make a stupid movie funny out of every cliche ever heard/seen before in a supposed ‘comedy’. Aside from Paul Rudd Bateman is the best ‘straight’ man in movies today and, in addition, is clean shaven which is quite different for an actor in the films today.\r What is there to say about Melissa McCarthy except that it looks like she is being typecast as the raunchy plus size woman in movies when she, obviously, has so much more to offer as an actress.\r This is an ‘odd couple’ road trip movie with a screenplay by Craig Mazin who hasn’t met a line in any road trip movie that he doesn’t use. He has the two stars beating up each other, running from killers, getting into car races, and crashes, walking away as if nothing had happened. He puts a man and woman in the trunk of a car and nothing does happen. Add to this a director, Seth Gordon, who seems to have attention deficient disorder and is afraid to have the camera on a scene more than a minute or two. What could and should be a funny sex scene has to be the dumbest and lest comic scenic ever put on film not to mention very insulting to overweight people.\r The subject of identity theft is a serious one but can still offer humourous moments and “Identity Thief” has talented actors who could handle both sides of the problem but aren’t given anything to work with.\r Amanda Peet, John Cho and Morris Chestnut offer good supporting performances while Eric Stonestreet forgot to leave Cameron from “Modern Family” off the set and doesn’t do himself any good here.\r Jason Bateman, Melissa McCarthy and the movie audience deserve a lot better than this."
    },
    {
      "rating": "6",
      "text": "Make no excuses, \"Identity Thief\" fails to bring anything new to the comedy genre. With that said, there are comedic moments that are sure to have you laughing for moments on end."
    },
    {
      "rating": "3",
      "text": "Identity Thief is a lazy, idiotic film that insults your intelligence on almost every level. The film is so poorly done that it doesn't even complete a scene before moving onto the next.  Half the time your wondering what is happening and if the true comedy is the actual making of the film itself."
    },
    {
      "rating": "4",
      "text": "What a waste of Bateman and McCarthy's talents. The script and plot are just all over the place, not which one of those places is funny. When the writer of your movie write Scary Movie 4 and Hangover 2, a red flag should instantly be waving."
    },
    {
      "rating": "1",
      "text": "I might buy several editions of Rosetta Stone software just to learn how to say \"not good\" in other languages. Here is my first try, \"Ayyyyeee mommy. La pelicula no es bueno!\" Stupid movies can be very entertaining and allow us to divert from the seriousness of everyday life. Unfortunately this movie simply made me sad. I know writing comedy can be hard, but if you are going to spend millions making a movie shouldn't the studio at least try to find someone good at it."
    },
    {
      "rating": "10",
      "text": "The movie was very good. It was funny and the comedic delivery was spot on. I recommend seeing this movie. It is full of laughter and has a good plot behind it."
    },
    {
      "rating": "8",
      "text": "I laughed out loud though out this movie.  This movie had great humour, timing and delivery.  Anyone looking for fun entertainment should see it.  Melissa has quickly moved to my number one favourite comedy actor.  Movie is good for both sexes and most ages.  If you enjoyed Bridesmaids, The Hangover, or Plaines Trains and Automobiles than this is right up you alley.  Sit back and Enjoy."
    },
    {
      "rating": "9",
      "text": "To be certain, Identity Thief will win no major awards. What it will do is entertain you for about 90 minutes with great laughs and wonderful physical gags. Melissa McCarthy and Jason Bateman have great chemistry. The premise of the movie is quite timely, a guy has his identity stolen and must go after the girl who stole it. I was in a packed house for this movie, and there were plenty of laughs, some quite loud, throughout the movie. If you are on the fence and relying on scores as to whether or not to see this movie, I'd say give it a try. You should be well pleased by the end of it."
    },
    {
      "rating": "8",
      "text": "No, this movie will not win any accolades for the script, BUT, Melissa McCarthy and Jason Bateman outshine the writing. YOU WILL LAUGH! Get your popcorn, pop and candy and ENJOY IT! Don't mind what the \"critics\" say."
    },
    {
      "rating": "8",
      "text": "When I walked out of Legally Blonde years ago I said Reese Witherspoon deserves an Oscar for that performance. Almost the same could be said of McCarthy here. The degree of difficulty in pulling off some of this comedic acting is very very high. The movie as a whole may not be a gem....but a half dozen scenes are so perfect and so difficult that the movie deserves a viewing. There are some brilliant comedy stretches in this movie. It is not to be missed for that reason. Watch McCarthy in the diner and elsewhere as she is totally hilarious and totally believable simultaneously."
    },
    {
      "rating": "4",
      "text": "The best of this movie is in the one-minute trailers.  Bouncing from unethical to moralism, back and forth, ad nauseum.  Funny in places, poorly cast, poorly written, poorly acted.  Yawn."
    },
    {
      "rating": "8",
      "text": "It made me laugh a bunch and I think McCarthy did her best comedy performance I've seen.  Only problem was the super white supremacist nature of the film, although I must say that I am a very sensitive person. OK!"
    },
    {
      "rating": "5",
      "text": "\"While Identity Thief has some memorable and surprising laughs, the first half of the film is quite funny and promises well, but the second half was lacking in many areas. Batemen and McCarthy do there best, Overall this film is worth seeing at least once\"  B-"
    },
    {
      "rating": "5",
      "text": "Jason Bateman's character has his identity stolen and sets out to bring the culprit (Melissa McCarthy) to justice. Their antagonistic road trip involves broad physical gags, continuous embarrassments and risky situations. Bateman plays his usual hapless character: mild-mannered, exasperated but always amusing. McCarthy spends most of the time in manic mode, which is sometimes amusing, other times tiresome. Most of the situations aren't that funny, but a random stream of one-liners peppers the proceedings with laughs. Still, it's trying too hard to be outrageous and hilarious, never succeeding at either. Mildly entertaining."
    },
    {
      "rating": "8",
      "text": "I'm gonna give \"Identity Thief\" an 8 because I know the reviews are hard, but for one jackass Rex Reed, I think he should be ashamed for himself talking about Melissa McCarthey's weight and called her \"tractor-sized\" and \"female hippo.\" I'm on McCarthey's side, she down to Earth, one of most underrated actresses since her Oscar-nominated role in Bridesmaids. The reason that fans are so upset about Reed's ill-advised comment is because every movie critic has it's own opinion, but I don't trust movie critics. They're all villains here. And it's time for this bastard to give it up because Identity Thief\" didn't eventually SOLD the tickets, it's what the audience want to see, a good-old-fashioned comedy. I agree with Paul Feig tweeted \"Go f**k yourself\" and as you know, I'm gonna see this movie whether Reed likes it or not."
    },
    {
      "rating": "4",
      "text": "Very disappointing. All the funny parts have already been seen on TV commercials. The comedy fell short of what everyone expects from what they see on TV. It wasn't terrible, and I'm sure some people will find it hilarious, but most won't.  An OK movie at best."
    },
    {
      "rating": "7",
      "text": "Really don't understand the disappointment and discontent with this film. Of course a 90-min film isn't going to be a non-stop riot as a 2 and a half minute trailer would have you to believe. If you thought that, I've got a beach house on Craig's List you would be interested in. This has humor and heart and doesn't hold up to director Seth Gordon's \"Horrible Bosses\", but it's still an entertaining road movie you want remember 2 weeks after seeing it. Certainly worth the Red Box fee."
    },
    {
      "rating": "2",
      "text": "What a disappointing movie this was. Was Melissa McCarthy funny? Sure she was. But the movie was filled with nothing but annoying scenes and plot holes. If you can make it to the ending at least that part is decent but that's a really big IF because of how absurd and borderline unwatchable this film is."
    },
    {
      "rating": "5",
      "text": "Wasn't that bad of a movie, Certainly got more then a few laughs from my family and I. The biggest flaw I'd have to say is the pointless sub plot involving the mob-like boss who wants McCarthy's character dead. Has literally no relevance plot wise and would have easily cut a good 10-20 mins off the 2 hour (which is far too long for any comedy) run time. I think they would have been better off if they focused on the bounty hunter subplot instead because that character was rather enjoyable to watch.\r I hated how it got so pointlessly sappy through out as well. It's a comedy, I don't want to feel depressed while watching it and they really should have cut down on that aspect of the film. Also, It took quite a while to really get into the movie. It's not until Bateman and McCarthy's characters meet when the film actually starts to get funny and that happens like 30 mins+ into the movie.\r Honestly, It wasn't that bad. The parts of the film that were actual comedy were pretty funny and enjoyable. It's just the long run time and pointless subplots that ruined it for me."
    },
    {
      "rating": "6",
      "text": "Identity Thief is not as good as you might think at first. The premise isn’t something you haven’t watched before, it gives you that Oh, I knew this would happen feeling at most of the times. But I must admit that it has been handled in a little fresh way, the writer Craig Mazin has put a lot of effort to make it look good and unique, outcome of which is both good and bad, supported by Seth Gordon’s average directional contribution. Jason Bateman and Melissa McCarthy are good actors especially Bateman, I’m his fan since Arrested Development. The only thing good about this movie is their performances which may be helpful to get them even better films in future. Final verdict: A good pastime. Don’t expect much from it."
    },
    {
      "rating": "6",
      "text": "It's kind of predictable but I still liked it.  The actors were good and the jokes were decent. Not the best comedy I've seen but definitely not the worst."
    },
    {
      "rating": "4",
      "text": "There were a couple problems I had with this disappointingly droll comedy. First of all, anyone excited to see this movie by the hilarious previews is doomed to be disappointed. All the funniest jokes in the movie lose all there laughs seeing them the second or third or fourth time. The only other problem was it was confusing what kind of audience this film has targeted. Despite all the lewd jokes and other inappropriate parts this movie seems to want to be family movie emphasizing Jason Bateman's character Sandy Patterson loving relationship with his family and those attracted by the jokes will be bored by the film's message."
    },
    {
      "rating": "3",
      "text": "a great trailer and a poor movie.very disappointed,i expected more,it had two or three funny scenes and that is it...i wouldn`t recommend you to watch this."
    },
    {
      "rating": "5",
      "text": "The previews were funny and I generally love Jason Bateman movies (and he was fantastic in this) but I found the movie rather generic and predictable.  It was not a let down by any means, it just wasn't a \"great\" movie.  Most of the really funny stuff can be seen from the previews."
    },
    {
      "rating": "4",
      "text": "I felt that this movie had decent acting that was hurt by an awful screenplay. If you don't know the premise, just read the summaryor watch the trailer. Anyway, Melissa McCarty and Jason Bateman both played very wellas Sandy Bigelow Patterson, and any fan of the two will be quite happy with this film. I wasn't. The screenplay is awful. Craig Mazin's script include's odd cursing at random times and one-liners which weren't too amusing. There were some major plot holes, which confused me (the bounty hunter?, and too many mood changes, Usually, a film has one major climax, a turning point. But in this movie, there were around 3 or 4. The movie seemed much different from the trailer, with more emphasis on action than there was in the trailer. Also, the story  seems more and more unrealistic as this film goes on.There were some clever jokes, though not many, and that is why I am going high enough to gie this movie a 4."
    },
    {
      "rating": "7",
      "text": "Nice movie rather rushed thru but I did like it. There were a lot of questionable things that are not really reality. I  found  the actors were good actors"
    },
    {
      "rating": "5",
      "text": "A mixed bag there are some funny scenes, but not enough for a recommendation.  Jason Bateman and Melissa McCarthy give solid performances, but the script and some of the minor characters are not strong enough."
    },
    {
      "rating": "5",
      "text": "This movie wants SO BADLY to be this generations' Midnight Run, it hurts. The road trip, one lead character bringing the other to \"justice\", the bounty hunter, the killers, the scamming of expense money, of course they learn to like each other by the end...it's like a checklist of the DeNiro/Grodin classic. And that movie was by no means original, itself. Take Bateman's low key, put-upon character and McCarthy's brash, vulger character, put them in situations....there's the movie. There's a few laughs, but not as many as you would think. And for a wacky comedy, McCarthy cries, what, about seven times during this? I guess they wanted that Planes, Trains and Automobiles feel to it. Nope. Just a shadow of those better films."
    },
    {
      "rating": "7",
      "text": "Yes It's True This Movie Won't Win Any Awards But It's Funny As Hell!"
    },
    {
      "rating": "9",
      "text": "This movie is so funny! I laughed really hard, but it also has a great story. Of course, the main story is really predictable, we know just by reading the plot that the guy will not really give her to the police, but there's lot of unpredictable moments in this movie which makes you entertained anyway. There's also really touching scenes with Melissa McCarty, who is really really funny! So, an excellent movie, funny, entertaining and full of suspense!"
    },
    {
      "rating": "4",
      "text": "A poor comedy. The film has funny moments however there are algo more boring moments. Jason Bateman is a clowns and acts like it. Melissa McCarthy is a comedy queen even though this is not her best role."
    },
    {
      "rating": "4",
      "text": "This movie is funny but not as good as I expected, it had its parts, but overall, not recommended, but still McCarthy rocks! It has \"all seen before\" scenes, raunchy laughs, but McCarthy saves the day this time."
    },
    {
      "rating": "5",
      "text": "I really recommend to skip this movie, after I watched I was very disappointed and I left the cinema with the feeling that I really should have been doing something more important"
    },
    {
      "rating": "7",
      "text": "Wow, don't know where are the horrible reviews have come from!  Was this the most hilarious, well-written movie ever?  No, but it was entertaining, funny, and I love the lead actors."
    },
    {
      "rating": "6",
      "text": "Jason Bateman and Melissa McCarthy do everything they can to spark this movie as a comedy. There are definite moments in the movie that are sure to leave you laughing while other moments are sure to leave you board. The movie starts off slow and has slow moments in both the middle and the end. I had high hopes for this movie and was expecting it to be nothing but hilarious due to the previews which actually showed all the funny moments in the movie leaving no suspense once watched. However, this movie did leave me laughing throughout at certain moments and I will never forget the end when McCarthys character learns her real name... Priceless moment to say the least."
    },
    {
      "rating": "0",
      "text": "Of every movie I have seen this was if not the most disappointing and terrible movie I have endured not being a childs movie.\r The plot is so full of holes and the lack of any existence of common sense makes you feel like a middle schooler won the award to be director for a day.\r This movie had such great potential to not only to be one of the best comedies of the year, but show identity theft to the culture, but made a big joke out of it, in the end saying to forgive criminals for anything they have done bad to you or anyone else and bring them into your family.\r Identity thief rarely had a knowledge that provided a laugh for anyone over the mental age of 16.\r I have never found myself so outraged at a movie before."
    },
    {
      "rating": "7",
      "text": "Jason Bateman and Melissa McCarthy might not make the best comedic-duo, but their movie still brings the laughs. It's vulgar, crude, and rude relying on gross out gags and slap-stick physical comedy to bring some truly hilarious moments. It will make you laugh quite regularly throughout, and I don't know about you but I watch comedies to laugh. The movie does hit some dull parts when it focuses on emotional moments or serious moments involving violence from people chasing the main characters, but in the end the comedy keeps this movie up. So while it's not the most focused comedy it packs enough laugh out loud moments for me to recommend a watch."
    },
    {
      "rating": "3",
      "text": "Bridesmaids made Melissa McCarthy a household name and for good reason but it seems to me that no one really knows how to take advantage of her many talents. Identity Thief maroons her in a sea of bad comedy and irritatingly familiar Jason Bateman moments we have all seen a thousand times. The film follows Sandy Bigelow Patterson (Bateman) as he travels from his family to track down a women who has stolen his identity and is slowly but surely ruining his life, one dollar at a time. Ultimately its a film made for McCarthy and a film that has literally no idea what it is doing. It relies heavily on fart and genital humour (Much like Bateman's Horrible Bosses) and never even attempts to be intelligent as the film flips from bizarre raunch comedy to zany road movie to unemotional family film. It doesn't have a clue where its going, what its doing or why its two main stars are acting like they've taken a fistful of tranquillizers. McCarthy wakes up when Eric Stonestreet shows up for a hilarious 10 minute sequence that successfully fooled me into thinking the film was getting better. While funny it doesn't save a film that can't tell its beginning from its end, its just bad."
    },
    {
      "rating": "6",
      "text": "Melissa McCarthy is one of the funniest females in Hollywood. After wasting her talent for 7 seasons on Gilmore Girls, she finally got her big break and hasn't slowed down since. One of her latest films is Identity Thief, which is also Seth Gordon's follow up to the hit comedy, Horrible Bosses. Much like his last film, Identity Thief has a whole bunch of funny scenes and outrageous characters, but fails to deliver a solid story to go with it. Sandy Bigelow Patterson (Jason Bateman) is a man with a girls name, making him the prime target for a female (Melissa McCarthy) who makes a living stealing from everyone else. The laws surrounding identity theft make prosecutions very difficult and it can sometimes take years before everything is straightened out. Patterson, with his new job and home on the line, can't wait for that and decides to confront his assailant. As I said earlier there are some real funny moments in this film, but the story is sadly extremely predictable. Identity Theft is something that has never really been done in comedy before. With the right story behind it, this really could have been the next Hangover, but sadly, the Hangover it is not. As usual Bateman and McCarthy are both terrific and to my surprise, had some pretty good chemistry together. Identity Thief is not a movie that sticks with you long after it's over. It is a good way to kill a few hours and good for a few laughs, but not much else."
    },
    {
      "rating": "6",
      "text": "Identity Thief rests on the shoulders of Melissa McCarthy. The premise is more than clever; it simply gets lost in the shuffle now and then. Still, the film is amusing and benefits from a talented cast."
    },
    {
      "rating": "2",
      "text": "I couldn't get through the entire movie. Its not funny, its not original, McCarthy is not funny nor is Bateman. I think I let out a chuckle at one point, but 2 hours of this-no chance. Don't waste your time. 'Nough said"
    }
  ],
  "recommendations": [
    "30_minutes_or_less",
    "the_wedding_ringer",
    "dinner_for_schmucks",
    "this_is_the_end",
    "ted_2",
    "rough_night",
    "anchorman_2_the_legend_continues",
    "tammy",
    "the_hangover",
    "neighbors",
    "the_other_guys",
    "little_fockers",
    "tower_heist",
    "the_watch",
    "a_million_ways_to_die_in_the_west",
    "horrible_bosses_2",
    "baywatch",
    "zoolander",
    "ride_along",
    "forgetting_sarah_marshall",
    "the_hangover_part_ii",
    "jackass_presents_bad_grandpa",
    "this_means_war",
    "date_night",
    "trainwreck"
  ]
}