{"id": 4805, "title": "Identity", "starring": ["John Cusack", "Ray Liotta"], "runtime": 90, "genre": ["Mystery", "Thriller"], "description": "Complete strangers stranded at a remote desert motel during a raging storm soon find themselves the target of a deranged murderer. As their numbers thin out, the travelers begin to turn on each other, as each tries to figure out who the killer is.", "releaseYear": "2003", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/bnidwEvWNAVJ3Uco9wWtuzWAfrx.jpg", "categories": {"plot": 6.866666666666666, "acting": 6.473684210526316, "ending": 7.6, "soundtrack": 10.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 8.0, "action": 7.333333333333333}, "reviews": [{"rating": "10", "text": "One of the best films I never planned to watch, but when I did, I was (positively) shocked and amazed!\rFilm is interesting enough to get you hooked up to the story, but real thing comes with the end."}, {"rating": "9", "text": "Two, seemingly unconnected, plotlines run throughout Identity. In one ten travellers are forced to seek shelter in a remote motel following a sudden torrential downpour. It soon turns out that there may be killer among them as one by one the guests start to go missing. Meanwhile in an office elsewhere a late appeal is being heard to decide the fate of serial killer Malcolm Rivers.\r Featuring an excellent cast Identity does an excellent job of keeping the audience guessing throughout, almost everyone seemingly becoming the number one suspect at some point. When the reality eventually unfolds it is a truly unexpected twist that importantly holds up on second viewing. A tense, clever thriller Identity is certainly one to watch."}, {"rating": "10", "text": "The killer can be seen at Caroline Suzanne's motel room window through a muslin drape in a reflection while she is standing at the mirror"}, {"rating": "10", "text": "Identity is a remarkable film. No doubt. I will call it a masterpiece and rate it with a 10, although in my opinion something very important is not included in the film.. And I will only say, that it's related to the real killings, you will see. But I think the film is genius and we should not crunch. Try to arrange the whole movie from the beginning of the protagonist's life to the day of his supposed ending. It's not that simple. You may have some idea about the end of the movie, but you will be surprised, when you begin to look into the details and find out more. But, for sure, you will be satisfied with this movie.~~    Now.. SPOILER ALERT!!!!!!!!!(Only for those, who want to see a different point of view about the whole film after watching it)~    Malcolm Rivers is a killer, who suffers from Dissociative identity disorder, a.k.a multiple personality disorder (he has 11 personalities). His mother was a prostitute, and his father left the family when he was two. Probably then he got his illness. It is not known when he was ill. What is certain, however, is that he committed six killings after he became ill. Michael was captured and arrested for his murders, then sentenced to execution. Michael has worked with his psychiatrist who has established his illness, which had never been known to anyone, and tried to justify it, because there are part of him - different personalities who are not guilty (not committed those 6 killings). So his doctor decided to make a new form of healing, gathering all the personalities in one place and the killer personality being killed by other personalities. What we see in the most part of the film is all 11 personalities trying to survive, because they knew, that the aim is killer personality to die. And here is the misleading part. NOT ONLY ONE personality is a killer, but MORE (Larry, the prostitute, the serial killer and probably Ed, the 'fake policeman' have killed for sure in the real life). Like I said all the personalities want to live. But there is one personality, that wants to kill the others and stay alone - the kid personality (he count them with the motel's keys from 10 like the 10 other personalities). It is accidental, that at the end the doctor dies, as Michael is in a \"trance\", imagining he kills the last personality in his head, but actually kills the doctor in reality.  The most important thing in this film is that not only one personality was a killer, committing murders in real life, like the doctor thought, but most of them were."}, {"rating": "10", "text": "When Ed (John Cusack) shoots Rhodes (Ray Liotta) at the end of the movie, you can see Rhodes mouth the words \"I didn't do this\" and Ed replies \"I know\". Neither of these lines are audible. They were muted because the director felt that would make it obvious that Rhodes was not the killer, thus making the true climax (finding that Timmy is the killer) less surprising."}, {"rating": "10", "text": "¤•••••••••••••••••••••••••••••••••••¤¤¤¤¤¤¤•¤¤¤¤¤¤¤¤¤¤¤¤♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧"}, {"rating": "9", "text": "For me \"Identity\" will remain as one of the best thrillers ever made. The acting, the story, the directing... everything was perfect. This is one of the movies you would like to rewatch again and again!"}, {"rating": "10", "text": "Malcolm uses \"¿Cuál es la punta de vivir?\" as the Spanish translation of \"What is the point of living?\" However, \"punta\" only means \"point\" in Spanish in the sense of physical \"peak\" or \"protuberance\". The correct Spanish translation of \"point\" in the meaning of \"sense\" or \"meaning\" would be \"sentido\" -- \"¿Cuál es el sentido de vivir?\" This stock phrase is most commonly rendered in Spanish as \"¿Cuál es el sentido de la vida?\" (\"What is the meaning of life?\")."}, {"rating": "10", "text": "Identity is an incomparable experience. The movie is very psychological as it unravels and everything becomes clear. The scares rock, the acting rocks, the freeze frames rock, the eerie music rocks & the ending will stun you."}, {"rating": "10", "text": "jmnvgfgtrwqsszdfhjmlkooiutfhvfrwsswdfyjiijkkouiiiouhijgreyttiopkmnkkhgfyyfddyjiotehhiiii"}, {"rating": "10", "text": "hibjhihjgugyftdtsrdhgjhigihigihigugywweyfffyugguguguguguigighiuftestdyuiihjoojftrssrfuo"}, {"rating": "10", "text": "The odds of all ten characters having the same birthday are approximately 1 in 115,694,315,636,972,669,502,854 (that's about 1 in 115 sextillion)."}, {"rating": "10", "text": "********************************************************☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆"}, {"rating": "9", "text": "Identity is a vivid example of a well-staged thriller in which suspense is injected consistently and correctly. Here is a rather simple plot, but the presence of a hidden second ending in the film changes everything. Yes, a good cast gathered here and there are a couple of competently placed twists. But the main thing in the film is that it is essentially chamber. Namely, chamber makes the thriller especially exciting. Even knowing the ending of the film and reviewing it after 5-7 years, you can understand that there are not many films like Identity. There are many good chamber films, even more high-quality thrillers, but there are not so many good chamber thrillers."}, {"rating": "9", "text": "Caught in a savage rainstorm, ten travelers are forced to seek refuge at a strange desert motel. They soon realize they've found anything but shelter. There is a killer among them and, one by one, they are murdered."}, {"rating": "9", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"}, {"rating": "9", "text": "*:*:*:*:*;*;**;*;*:*:*\"**\"\"**\"*¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"}, {"rating": "9", "text": "¡¤¡¤¡¤¡¤¡¤¡¤¡•¡¡¤•¡•¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡••¡¤¡•¡•¡¤¡•¡•¡•¡•¡¤¡¤¡¤¡¤¡¤¡¤¡•¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡"}, {"rating": "9", "text": "○○○○○○○○○○○○○○○○○●■●■●■●■●■●■●■●■¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡****************************"}, {"rating": "10", "text": "One of the most unique movies ive seen and very well done."}, {"rating": "9", "text": "A real shocker..Wow. Boy, I was not expecting that ending. But before I talk about the ending, the plot is another wow. Its confusing, and wonderful all at the same time. Its creepy and thrilling and keeps you jumping all through the movie. My kinda movie.Holy crap. I'll say it again: I was not expecting that ending. Some parts leading to the ending were confusing, but later made sense, example: Ray Liotta's shirt. Why was there a hole and a huge blood stain on the back of his shirt? I bet that was what everyone was wondering when he took off his coat. In the end it all made sense, and man what a great reason. A stroke of pure genius who ever thought of this plot. You actually think it is him the whole time, but is it? NO! A 6 year old! I didn't see that coming. Leaving the keys behind was genius too, counting down..10...9...8...7...6... Too creepy..The plot was pure genius, the actors were fabulous and not one out of place, the ending was amazing, and it will really get inside your head..I Like movies where people are getting picked off one by one? And there is a reason? See this movie..."}, {"rating": "9", "text": "$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪¡▪▪¡"}, {"rating": "10", "text": "Great movie with many twists and very interesting and complex setting. I take some time to understand, whats is going on. This is how many movies should be"}, {"rating": "9", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"}, {"rating": "9", "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●•°=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"}, {"rating": "10", "text": "********************************************************》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》"}, {"rating": "8", "text": "Plays like a classic game of Clue, but don't get me wrong. This baby is exhilarating and fresh. You'll like everything it gives you."}, {"rating": "9", "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》》》¡》¡》¡》¡》¡》¡》¡》》》》》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡"}, {"rating": "8", "text": "Identity is a thriller about 10 people who are stucked due to a rainstorm in a hotel. Though it has great suspense the ''twist'' is not something really good. All these theories about the people who have psychological and they create many personalities was a little bit weird and confusing. However the whole atmosphere and all that dark climate were extraordinary. The idea was something new and i was impressed after I learnt who the killer was. It is a really good thriller with a great cinematography and it was really dark which is a good thing for a thriller like Identity"}, {"rating": "8", "text": "Like something out of the twilight zone, James Mangold brilliantly helms this creepy and clever thriller. John Cusack is incredible here"}, {"rating": "8", "text": "Entirely unique, Identity is a film that rides on its twists and turns, which will leave you on the edge of your seat throughout. A perfect example of psychological horror, this one will bend your brain as you try to put the pieces together, and then actually let you snap them together before finally punching you in the brain at the end. The direction from James Mangold is very good, as he managed to help this film not get lost with its complex and unique premise, which is impressive to say the least. I also really liked the cinematography here, really captured everything beautifully. The acting from John Cusack, Ray Liotta, Amanda Peet, and John Hawkes, is really good, though the whole cast is pretty strong as a unit. Overall, Identity is one that will have you questioning what is going on throughout and while it is not one that will eat you up inside for a few days afterwards with questions, it is one that will stay with you thanks to the impeccable last half hour and, hell, strong first hour preceding that. This is one that sets you up very well and then pulls the chair out from underneath you."}, {"rating": "8", "text": "I'm usually good at figuring out movies. This one had me totally stumped.  I was very surprised at the ending but really enjoyed the movie.  Highly recommend seeing this one."}, {"rating": "7", "text": "\"Identity\" is both a refreshing and engaging thriller, following the horrific and mysterious events that take place after a group of strangers end up stuck at a run-down motel in the middle of a rainstorm. The performances by all the actors are very good, especially from John Cusack and Amanda Peet, and the third act is actually pretty fantastic. The first twist was quite predictable, but to my entertainment, it didn't stop there, and succeeded in closing on a truly unforeseen final reveal that is an honestly wonderful sleight-of-hand. The depths to which this movie takes you into the killer's mind is truly surreal and creative, and surprisingly enough makes you sympathize with the guy and understand just how lost his mind really is. It's a great little find and well worth a watch."}, {"rating": "8", "text": "Group of people get stranded at a motel are revealed to be the inner mental workings of a sentenced killer with multiple personalities."}, {"rating": "7", "text": "Let me star off by saying that with this movie you don't get what you expect. You buy this movie expecting a good slasher mystery thriller, that's not what you get here. Identity stars John Cusack, Ray Liotta & Amanda Peet as three of the ten strangers trapped in a run down motel during a savage thunder storm. The film starts off by introducing the characters, and then showing how they all got to the motel. The York's had a a family crisis, the limo driver was in an accident, the actress on her way to Hollywood for a small TV gig, the newly married couple with martial trouble, and the cop transporting a convict. These ten people have nothing in common, nothing except all there names are of places & they all have the same birthday. But now all ten of them are trapped in a motel with nowhere to go. Soon enough one of them turns up dead and they realize that there's a killer among them, now the nine have to find out who is trying to kill them before there's none of them left. Identity is a fast-paced extremely entertaining movie with a great idea and a bad story."}, {"rating": "5", "text": "Fairly well-made and acted but stumbles between predictable and unbelievable."}, {"rating": "5", "text": "Solid acting by the cast with Cusack easily being the star of the film. The plot twist added some much needed interest into the film, which was lacking through out, and actually made it some-what worth watching. I just didn't care for it that much, It wasn't as good as I hoped it would be."}, {"rating": "4", "text": "A thinker, a real complex thinker. Not at all a bad thing; however, when the audience is neglected and one too many turns are made, it no longer is enjoyable."}, {"rating": "6", "text": "\"Identity\" is a 2003 James Mangold Directed film about 10 strangers who meet at a seedy Nevada motel and soon realize that they are being killed off one by one. Let me start off by saying that I love a good thriller. If you have an intriguing premise and a good touch of tasteful twists here and there, I'll ultimately find the movie to be, to some degree, good. \"Identity\" definitely possessed the former, but tricked me with the latter. From the moment this movie starts you are almost immediately pulled into it's fascinating plot. And as the movie goes on, twists ensue, leading you to reconsider every view of every character in the film. However, the last twist of this film, in short, angered me. I found the final twist of the film to make sense, but it was the most unsatisfying ending I could have imagined this film to present. The film presented an incredibly new type of plot for me and in my opinion fudged up the ending a bit. However, every minute up to the last 5 were pretty thrilling and intense. All of the actors did a good job in their roles and their lines were fairly well written. The direction by Mangold is really quite beautiful - he really creates some unsettling imagery here. Overall, I can say that \"Identity\" was a enjoyable movie. . .up until the end."}, {"rating": "7", "text": "If you've ever read And Then There Were None, you know what you're getting into... for the most part. This movie starts out on autopilot, pulling out a lot of whodunit cliches, until the last half of the movie goes off the rails into its own twisty and intense thriller. The little twists and turns surprised me and kept me invested in the plot, and the twist towards the end, while not mind-blowing, is a nice change for this type of movie, if only it wasn't revealed so early. The final ten minutes of the movie is slightly confusing, and the \"shocker\" ending is almost laughable. It's on Netflix, so if you're looking for a suspenseful and fun movie, I recommend it."}, {"rating": "7", "text": "Entertaining \"who-dun-it\", with a great cast and lots of fun twists and turns. The major problem that I have is that each individual characters story line seems to fall out of a soap opera."}, {"rating": "5", "text": "When All or Nothing Is What It Seems.\r In \"Identity,\" which opens today nationwide, a group of strangers find themselves stranded at a ramshackle motel on — how to put it? — a dark and stormy night. Like the setting, the characters themselves have the damp, bedraggled air of cliché. There is a spoiled, has-been actress (Rebecca DeMornay), whose limo driver, a former policeman (John Cusack), has apparently driven in from a French movie, with his dark overcoat and his dog-eared copy of \"Being and Nothingness.\" These two are joined by a creepy desk clerk (John Hawkes), a call girl with a suitcase full of money (Amanda Peet), a nice-looking family (John C. McGinley is the dad), a desperate-seeming young couple (Clea DuVall and William Lee Scott), and a corrections officer (Ray Liotta) transporting a snaggle-toothed criminal (Jake Busey).\r This is an awful lot to keep track of, especially since each of these folks seems to be carrying around a secret. Before long, though, they begin to die off, horribly, one by one, leaving the survivors and the audience to speculate about who the killer, and the next victim, might be. The desperate-seeming young wife has a vague recollection of seeing something similar in a movie once before, though she declines to cite the title, which is either \"And Then There Were None\" or its send-up, \"Murder by Death.\"\r \"Identity,\" a piece of elegant directorial hackwork by James Mangold (\"Girl, Interrupted,\" \"Kate and Leopold\"), goes through its generic paces with enough flair and mystery to keep you moderately entertained. The apparent premise, creaky though it may be, holds ample opportunity for suspense and second-guessing, and Mr. Mangold handles the revelations and reversals of Michael Cooney's script with nerve-racking aplomb. There are horror-film conventions — eerie sounds, slow camera movements, half-open doors and carefully arranged shadows — that retain their effectiveness no matter how many times you've seen them before, and Mr. Mangold adds to these a grisly repertory of severed heads and bloody handprints.\r The second-handness of the situation, and of the characters who inhabit it, is explained — or justified, if you prefer — by an enormous, gold-plated pretzel of a plot twist that I will not divulge, lest my own head end up in someone's clothes dryer. I should note, however, that the television commercial in which Mr. Cusack is shown in conversation with Alfred Molina comes very close to spoiling the surprise, which is odd since without the surprise the movie would have no reason to exist.\r Whether it has much of a reason to exist with the surprise is another question. Once it is clear you are no longer watching the movie you thought you were watching, there doesn't seem to be much point in going back to the movie that you thought you were watching, which is nonetheless what happens. Still with me? When the revelation comes — the moment that explains why all these panicky people are running around in the rain miles from anywhere — it does administer a pleasurable jolt. You think: \"Wow. Cool.\"\r But the impression of cleverness, and the filmmaking dexterity that created it, fades pretty quickly, and you are left thinking: \"What? Wait a minute.\" All of those anxious, obvious characters — and the game, earnest performances of, especially, Mr. Cusack, Ms. Peet and Mr. Hawkes — suddenly lose dimension, and they did not have all that much to begin with.\r \"Identity\" is a reasonably well-executed thriller. It suffers not from awkwardness or silliness, which would make it more fun, but rather from its air-brushed, expensive pretentiousness. Like last year's \"Panic Room,\" the springtime box-office success of which Sony may be hoping to repeat, \"Identity\" is a dressed-up B picture, a hunk of cheese trying to sneak into the gourmet food aisle of the supermarket.\r The cheap grubbiness that was always the hallmark of the best horror movies, and that survives in straighforwardly exploitative pictures like the recent \"Final Destination 2,\" is missing from preening high-concept movies like this one and the disastrous \"Dreamcatcher.\" Mr. Mangold acquits himself much better than Lawrence Kasdan did in that nightmare, and \"Identity\" is not terrible by any means, but there is nonetheless something depressing about seeing so many interesting actors stuffed into such an empty, ersatz vehicle."}, {"rating": "6", "text": "60/100  It's meh ...  Well, I didn't really like it. The acting is decent, a story I've seen many times before, is filmed ok... I think. There are some twists ... one is ok but the rest are useless.  I do not know what to say... I could have seen something better..."}, {"rating": "10", "text": "I was entirely blown away by the script ,cucak is in his full elements."}, {"rating": "8", "text": "The problem with this movie is that you don't get what you expect. If you expect a typical horror-mystery thriller, you will not become happy with this movie, because in the end it is almost a psychological study. So if you are open for genre-mixtures, you will get a good movie. I give it a 8, because for me it was too obvious who was the murderer."}, {"rating": "5", "text": "I could not get into this movie, I found it rather stupid and the twist in it was just ridiculous. Decent acting and atmosphere, but not much else."}, {"rating": "8", "text": "Although the final plot twist is slightly lame, the premise is interesting."}, {"rating": "7", "text": "A decent whodunit inspired by the great Agatha Christie. It could have been a little clear."}, {"rating": "10", "text": "Awesome movie. One of my favorites. Very suspenseful. Keeps you interested till the end. The only thing that sucks is once you watch it once, it ruins to watch it again cause you know exactly what's going on. Worth a watch for sure."}, {"rating": "9", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"}], "recommendations": ["the_skeleton_key", "the_rental", "the_call", "the_autopsy_of_jane_doe", "i_see_you", "alone", "secret_window", "a_perfect_getaway", "the_invisible_man", "the_voyeurs", "split", "cold_pursuit", "the_forest", "the_uninvited", "a_cure_for_wellness", "the_little_things", "escape_room", "the_next_three_days", "happy_death_day", "the_machinist", "the_mothman_prophecies", "shutter_island", "oculus", "before_i_go_to_sleep", "man_on_a_ledge"]}