{
  "id": 3341,
  "title": "Idiocracy",
  "starring": [
    "Luke Wilson",
    "Maya Rudolph"
  ],
  "runtime": 84,
  "genre": [
    "Comedy",
    "Science Fiction",
    "Adventure"
  ],
  "description": "To test its top-secret Human Hibernation Project, the Pentagon picks the most average Americans it can find - an Army private and a prostitute - and sends them to the year 2505 after a series of freak events. But when they arrive, they find a civilization so dumbed-down that they're the smartest people around.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/k75tEyoPbPlfHSKakJBOR5dx1Dp.jpg",
  "categories": {
    "plot": 5.636363636363637,
    "acting": 7.428571428571429,
    "ending": 4.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.037037037037037,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I'll still be discussing this film with my buddies 50 years down the road - I've never had any other film provoke so much thought about the direction of mankind and society as Idiocracy has. The irony of this film is amazingly well-hidden under a thick veil of fart jokes and anatomical references, intentionally hidden from the two audiences that it seeks to satirize: the snooty crowd that probably didn't make it through the first 30 minutes of the film (and likely rushed home to their computers so they could write some very negative reviews), and the mainstream crowd that was too busy laughing at \"OW, my balls!\" to notice that they're the heel of the humor. Mike Judge proves, once again, that he is the true spokesman for my generation."
    },
    {
      "rating": "9",
      "text": "Totally original comedy. This movie is a brilliant return-fire against everything that sucks.  This is our little secret against the blaring egos and consumerism of today's culture."
    },
    {
      "rating": "10",
      "text": "Social satire at its best! Is it any wonder that Fox - the brethren of FOX NEWS - is dumping this so unceremoniously? It is a brutal political smack down in comedy clothing. Genius and really ambitious. Another cult classic like Office Space, with a dose of seriously cautionary tale-telling (veiled as broad comedy). Support this movie!"
    },
    {
      "rating": "8",
      "text": "Imagining a future void of intellectuals or leaders is not that hard. In Idiocracy, the priorities of the populous are grounded in spectacle and pleasure. Set almost 500 years from present day, Uh-merica has become disadvantaged by its own breeders. The film astutely points out how ignorant people, by nature, will continue to reproduce at alarming rates. Survival of the fittest is turned upside down when considering the sheer number of people uncomprehending of consequence. Stupidity infesting the world like cockroaches is all too relevant.Our President is most certainly an idiot. We are forced to put up with his gross misconduct and abuse of our countries name because he has disguised his ignorance as faith. Unfortunately, the people steering Bush into destroying the free world are all too aware of their actions. While the world of Idiocracy is unjust and uneffective, at least it lacks the evil genius. The president in the film is Mr. T and Ludicris rolled into one. I cant help but think a president dependent on threats and demands plausible considering the direction we are currently headed. Idiocracy appropriately does not deal with faith because without peddlers smart enough to deal intangible truths, there is no use for it.Comparable to the fall of Rome, Uh-merica finds itself existing without knowing to what end. There is no sense of unity or hope for the future, but only an acceptance of shallowness. In essence, writer and director Mike Judge deals with how flavor has replaced purity. As we have come to learn, spin can alter events globally. In Idiocracy, entertainment and free love are as holy as it gets. Altering the mundane is condemned in the film, as even Starbucks perseveres 500 years only to provide affordable and expedient sexual gratification. A combination of ebonics and hillbilly has usurped the English language providing a flashier and less coherent means of communication. Ralph Waldo Emerson wrote, To be great, is to be misunderstood. In Idiocracy this sentiment is taken to a thought provoking extreme.The film delivered ample laughs. It was glaringly uneven, but the short running time helped me forgive some inadequacies. Like Office Space, I enjoyed the characters and premise enough to wade through some of the filler. Mike Judges film will undoubtedly appeal to low brow audiences. However, seeing as the film lacked any endorsements or hype at all, there is something to be said for the exclusivity associated with even knowing about it. The film would have done well if Luke Wilson and Mike Judges previous success had been exploited to sell it. Instead, I shared the theater with maybe seven others on its second day of release. Despite the crude jokes, I couldnt help feeling like my own aptitude had earned a unique and enjoyable viewing experience."
    },
    {
      "rating": "9",
      "text": "Not too many movies are so funny and so disturbing at the same time. I am still thinking about scenes from this movie weeks after seeing it, both the laughs and the social commentary. My wife and I refer to it almost daily, whenever we see Jersey Shore or hear that 20% of Americans think Obama is Muslim, etc."
    },
    {
      "rating": "10",
      "text": "it would be funny if it was not the most accurate premonition currently being realized in our very \"modern\" societies... more and more entertainment, less and less brain power..."
    },
    {
      "rating": "10",
      "text": "Loved this movie when it first came out, and still catch it at least once or twice a year.  One of the funniest, thought provoking movies I've seen in a long time. I cannot count the number of times I've heard people quote this gem, and this will definitely be one I will recommend throughout my life.  Kudos to Mike Judge, Luke Wilson, and so many others on such an awesome film!  And on a side note:  That Brawndo product is actually pretty good!  LOL"
    },
    {
      "rating": "9",
      "text": "in 2505, they'll watch this old movie and wonder how we predicted the future.  Then, they'll look for the Time Masheen and wonder where they can find Brawndo.  Upgrayedd!"
    },
    {
      "rating": "10",
      "text": "Horribly underrated, smart, and way ahead of its time. Idiocracy is one of the funniest movies I've ever seen. If you haven't seen it yet, rent it online...NOW."
    },
    {
      "rating": "10",
      "text": "great movie. the truth abought Amerika. this will be a exact history movie in the year 2500. so keep on consuming amerikans. Well the names a not correct it will be monsatos, gogle, mcdonald,.."
    },
    {
      "rating": "10",
      "text": "At this point in time this movie has to be considered a documentary and a drama instead of a comedy."
    },
    {
      "rating": "10",
      "text": "I can see why this film has so many negative reviews, but as a person from the future, i will rate this 10/10. This basically became a documentary. We are ****"
    },
    {
      "rating": "10",
      "text": "This film is becoming more and more true at each day that passes, at each new show, at each new idiot uneducated celebrity, at each new election! In 1980, in an article in Newsweek entitled \"A cult of ignorance\", Isaac Asimov was already analyzing the US society by his famous quote: “There is a cult of ignorance in the United States, and there has always been. The strain of anti-intellectualism has been a constant thread winding its way through our political and cultural life, nurtured by the false notion that democracy means that 'my ignorance is just as good as your knowledge.”  This movie follows the prediction by even more precise predictions!"
    },
    {
      "rating": "10",
      "text": "Best movie ever!! I'll still be discussing this film with my buddies 50 years down the road - I've never had any other film provoke so much thought about the direction of mankind and society as Idiocracy has. The irony of this film is amazingly well-hidden under a thick veil of fart jokes and anatomical references, intentionally hidden from the two audiences that it seeks to satirize: the snooty crowd that probably didn't make it through the first 30 minutes of the film (and likely rushed home to their computers so they could write some very negative reviews), and the mainstream crowd that was too busy laughing at \"OW, my balls!\" to notice that they're the heel of the humor. Mike Judge proves, once again, that he is the true spokesman for my generation"
    },
    {
      "rating": "10",
      "text": "Oh, this movie was just a stream of honey on my heart, brain and liver. I was so... HAPPY after I realized such movies exist. However, I would not recommend it to everyone. The painful truth may hm, hm... hurt somebody's unprepared soul:)."
    },
    {
      "rating": "10",
      "text": "One of the best movies to watch.....One of the best movies to watch.....One of the best movies to watch.....One of the best movies to watch.....One of the best movies to wat0ch.....One of the best movies to watch.....One of the best movies to watch.....One of the best movies to watch.....One of the best movies to watch....."
    },
    {
      "rating": "10",
      "text": "Sadly, this movie is less of a movie and more of a documentary because, in 2020, I don't see much difference between the state of our society and that of the one portrayed in this satirical masterpiece. People are being dumbed down on a massive scale and our culture promotes and rewards toxic values and qualities. Sometimes I ask myself if it's already too late for humanity to get back on track. We'll see. But this movie provides a great glimpse into what we'll likely become if we don't change our ways."
    },
    {
      "rating": "8",
      "text": "Possibly the most humorous movie I've ever seen. It's just too bad that what makes it so funny is the truth behind the story. It was reportedly turned down by nearly every studio to which it was presented because of a fear of insulting stupid people. Well, there ya go...STUPID PEOPLE NEED TO BE INSULTED!!!"
    },
    {
      "rating": "5",
      "text": "This is no Office Space!!! I think Mike Judge had a good idea for a movie here, but it never quite gets off the ground. Maybe with a little more effort all around, it could have been like a live action Beavis and Butthead, but instead the plot is really poor and even the little skits come off as tired and dated. Do most people even drink Gatorade any more? Judge's satire used to be so dead-on, and in this it's just so dead. Maya Rudolph's character made no sense at all. I couldn't think of any reason she was frozen, except that they needed a love interest for the main character so they could stretch the movie out to full length. There is enough of Judge's usual surreal stupidity to make it worth renting, but its really not very good."
    },
    {
      "rating": "10",
      "text": "This is quite possibly the most brilliant comedy movie I have ever seen.  Every part of it is funny and thought provoking.  I would recommend this to all my friends."
    },
    {
      "rating": "6",
      "text": "Not a bad movie but also not as funny as some reviewers are saying. However, it might be the route the mankind is taking right now so the film is not just a comedy but also provides us with something to think about. Nowadays, kids don't do much reading, use computers and calculators for pretty much everything so what was shown in the movie can actually happen. This is a scary vision and something we should not allow to happen.\r 6 ot ouf 10 from me because I expected a bit ore from the movie."
    },
    {
      "rating": "9",
      "text": "You can really tell that this is from Mike Judge.Just like Beavis and Butt-head,its writing is focused on making fun of stupidity that we come across every day.Unlike Beavis and Butt-head,though,it features two normal protagonists in a society of morons,rather than two moronic protagonists in a society of normal people.And it does this setting very well.The society of 2505 really feels like what the world would come to if it was run by idiots.News reporters are half naked,the president is basically Hulk Hogan,the most popular film is a still shot of someone's ass,and so on.It really makes you reflect on yourself and think if you're contributing to society becoming like that.Makes you rethink if the things you like,people you admire,the way you talk or the food you eat make you an idiot.For that,the movie's depressing,but it's the constructive kind of depressing."
    },
    {
      "rating": "0",
      "text": "I really do think that this was probably the Worst movie I have ever seen and it's a shame too since I love Luke Wilson. Mike Judge...You're a Bastard for trying to just sell something just because of your name!!! I really never thought I would ever say that I have seen \"the Worst movie ever\" but I most certainly have! Anybody else kind for feel like they were watching Roger Wilco the Movie...Hahha!!!"
    },
    {
      "rating": "5",
      "text": "To all the diehard \"office Space\" fans out there. Do yourself a favor and do not see the movie. It will not live up to any expectations. There are some good gags, but the inherent logic doesn't work. [That everyone is extremely stupid.] B plus for effort, C minus for execution."
    },
    {
      "rating": "3",
      "text": "I agree with Variety. This movie has a lot of good ideas, but it goes out of steam. After a few minutes it gets very tiresome listening to people grunting and uttering words like ass and f*ck every ten seconds. A real shame - I love Office Space."
    },
    {
      "rating": "5",
      "text": "The premise was great. The first 5-10 minutes was great also when discussing survival of the fittest. But unfortunately bad acting and even worse dialogue took over from there. It may sound easy to write and play a society of morons but that is completely disproved 20 minutes in."
    },
    {
      "rating": "0",
      "text": "Let me preface this by divulging that I have never given a movie a zero before. Until now. My only explanation for the movies high marks is that idiots themselves are watching this. I did not find one ounce of humor in this entire movie. Although I must admit I had to keep watching it. When I read reviews someone always says, \"I want the last two hours of my life back.\" I feel that way for the first time ever after watching a movie."
    },
    {
      "rating": "0",
      "text": "Are you kidding me? Probably the worst movie I have ever seen. Even if the clever idea to use IDIOT humor is somehow magically funny I didn't appreciate it."
    },
    {
      "rating": "4",
      "text": "A great idea executed quite terribly. I, like Don S., had very high hopes that Idiocracy would be brilliant, but it turns out that it's merely another failed comedy movie."
    },
    {
      "rating": "5",
      "text": "A movie with good intentions, but not a complete film. Lack of screenplay talent hurts this one. The movie is only an hour and 15 min. and the writing could only sustain maybe 22 min. Overall a great concept, just not carried out to fruition. Better writers would have made the difference."
    },
    {
      "rating": "2",
      "text": "The movie is basically just an ego trip for normal people. The jokes are pointed out excessively, its unrealistic, dumb satire."
    },
    {
      "rating": "3",
      "text": "I had very high hopes for this movie, but I was sorely disappointed. I think a lot of people go so caught up in the whole studio-backstab saga they just assumed that the movie must be something special. The final cut of Idiocracy was very poorly put together and missing many crucial scenes. It reminded me of the bonus Anchorman movie entirely comprised of deleted subplots and strung together with narration. Mike Judge probably could have done a fine job if he had full creative control, but forgiving Mike Judge does not make this movie enjoyable."
    },
    {
      "rating": "5",
      "text": "Awful acting, and awful visuals. Ridiculous premise. Upsetting conflict. Questionable climax. Acceptable resolution. You might watch most of it during commercials of a TV sporting event. Otherwise, don't bother."
    },
    {
      "rating": "2",
      "text": "I gave this \"film\" a 2 only because it was an interesting concept. Beyond Judge saying \"Hey, this would be a good concept for a film\", his execution was terrible from start to finish. Don't waste your time. If  you want a dystopian story about how stupid have become in the future read Super Sad True Love Story."
    },
    {
      "rating": "4",
      "text": "A marvelous plot but like she said, he couldn't finish.  Idiocracy was a waste of resources as it had so much potential.  Maybe with a higher payroll and budget the movie could've gone farther to make history."
    },
    {
      "rating": "5",
      "text": "The main concept is great but the film itself is a total disaster. From the very first minute it appears that it's a low-budget comedy with an awful plot and a poor scenario. The jokes aren't funny and it is obvious that the script is not deliberate. They did not take into consideration a lot of things. Great idea but a worse movie."
    },
    {
      "rating": "6",
      "text": "It was an average comedy. It had an interesting original story and interesting actors, but it wasn't very funny, it was way too over the top for it's own good at times and the ending wasn't very good. It's not a bad movie, it's just not that good."
    },
    {
      "rating": "5",
      "text": "Идея хорошая, правда имеет глупости, но вот подача в целом плоха...Операторская работа не ахти, диалоги скучные и не смешные, а ведь это комедия! Эффекты дешёвые, я бы простил это, если бы сам фильм был неплох.Итог: Средний фильм."
    },
    {
      "rating": "0",
      "text": "Because this is free. Anybody just come here and say something idiotic (like lets say: this movie is any good), and gives it a 10Fine. Nobody gets hurt, but the point of sharing opinions its that you make it honestly. And if you want to give this aberration of nature a 10, fine, but then you don't have that 10 for your honest opinion on an actual movie that you actually like That seems fair to me. A 10 for this ain't"
    },
    {
      "rating": "8",
      "text": "Pretty funny stuff. Dumb humor, but that's the point of the movie. Judge must have really rubbed someone wrong to have the movie cast aside like this, because there's nothing wrong with the product on-screen."
    },
    {
      "rating": "9",
      "text": "Some reviewers don't get this movie, and some bad reviews aren't even real reviews at all, just lame synopses without any real editorial content. Watch this movie for yourself. If you already understand the sort of extremely dry satire that is Mike Judge's specialty, you'll probably like it. If you don't, you'll hate it."
    },
    {
      "rating": "10",
      "text": "To use reveiws from the theatrical release of this movie is an outrage, since the DVD is garnering a whole new set of reviews. I for one do not believe for one second that Josua Rich from entertainment weekly actually watched this movie before he reviewed it. I would recommend havind a word count on reviews. To everyone who is thinking of seeing this movie... do so, it's really great."
    },
    {
      "rating": "9",
      "text": "No movie comes closer to Terry Gilliam's \"Brazil\". Idiocracy's satire, however, is loud, brash, and brutal -- a spot-on match for modern culture."
    },
    {
      "rating": "9",
      "text": "All science fiction is about the present. Really a fantastic job, I was laughing and creeped out by the dead-on observations the entire movie. Maya Rudolph's character was a weak point but didn't stop it from being solidly enjoyable. It's like an optical illusion, if you only see one movie you need to look harder."
    },
    {
      "rating": "9",
      "text": "So frighteningly close to where the world stands today intellectually, you might find it hard to laugh. But it's brilliant, biting satire with some of the funniest visuals in recent memory. The cast is uniformly excellent, and if this film doesn't make you run out and read a book, nothing will."
    },
    {
      "rating": "10",
      "text": "Selling products depends on dumbing people down to the point where they will buy pretty much anything at the company's price. The film exposes this, hilariously, and that is why, when Fox figured it out, they pulled the plug. There is an even darker strain to this movie, which is the horrible implications for democracy when the people raising the most children tend to be the ones least capable of being rational citizens."
    },
    {
      "rating": "8",
      "text": "A belly laugh worth your money. Actually made me want to open a dictionary more often."
    },
    {
      "rating": "10",
      "text": "I have not laughed this much in a film in at least five years. Yes, the effects are terrible, yes, the acting is often marginal, yes, the movie is stupid, but never before has a stupid movie been so smart, or so funny. I laughed so hard I almost passed out."
    },
    {
      "rating": "8",
      "text": "I can see how difficult it would be to make a movie like this without the satire becoming annoying (as it did at times). But overall I think this movie worked. And at the rate this country is going, I doubt it'll take 500 years for the Fox News anchors to be working shirtless!"
    },
    {
      "rating": "9",
      "text": "This is a hilarious anti-corporate anti-cronyism comedy that deserves more recognition. Any studio executive in his right mind would bury this movie, and they did! I only happened to watch a few minutes of it when it was showing at 11:00pm on a Friday night on TV and the more I watched the better it got. All hail President Kumatro!"
    }
  ]
}