{"id": 2560, "title": "If I Stay", "starring": ["Chloë Grace Moretz", "Jamie Blackley"], "runtime": 106, "genre": ["Drama"], "description": "Mia Hall, a talented young cellist, thought the most difficult decision she would ever have to make would be whether to pursue her musical dreams at prestigious Juilliard or follow her heart to be with the love of her life, Adam, a rock singer/guitarist. However, a car wreck changes everything in an instant, and now Mia's life hangs in the balance. Suspended between life and death, Mia faces a choice that will decide her future.", "releaseYear": "2014", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/7Twh8h3Wh7GC9npTAEUThgkxkWL.jpg", "categories": {"plot": 4.857142857142857, "acting": 5.111111111111111, "ending": 3.8333333333333335, "soundtrack": 5.333333333333333, "cinematography": 6.0, "familyFriendly": 3.3333333333333335, "funny": 2.0, "action": 5.0}, "reviews": [{"rating": "7", "text": "It If Stay es una película que a pesar que se puede sentir más para las mujeres que para hombres, está hecha con sentimiento.\r Esta película se podría decir que es un drama sentimental que está llevado más al lado femenino que al lado masculino, (pero eso no quiere decir que las mujeres serán las únicas que disfruten del film) y que al final resulta como un largometraje disfrutable y conmovedor que manipula su contenido de una manera decente y se envuelve en una historia que nos lleva desde la música hasta el amor y la desesperación hasta la tristeza, manteniendo su toque optimista a lo largo de su trama en donde también abundan algunas sorpresas."}, {"rating": "9", "text": "Fab movie, great elements. A real chick flick i think, Gals if you feel like crying this is the right movie for you. **** ending though but overall love this movie :) 9/10"}, {"rating": "10", "text": "this movie was amazing sure the book is better but come on it's a movie it's never going to be just as good as the book but I got to said again it was amazing. This movie had me in tears just like the book. All I want to know is will there be sequel. The second book: \"Where she went\" was even better than the second one. There's got to be a second movie too."}, {"rating": "1", "text": "If I Stay is loaded with amateur flaws, and it isn’t a film so much as it is a theatrical release of a made-for-TV After School Special.  And even then, there isn’t anything special about it."}, {"rating": "10", "text": "Love,love,love,i dont get why this movie has so much negative feedback,i personally loove this movie,love the acting,the actors for this movie were brilliant,the story was to cry your heart out,what more do you need,loved everything"}, {"rating": "0", "text": "Please god stop this kind of movies, i prefer seeing Batman and Robin (1997)  and Spider-Man 3 (2007) and all The Twilight movies, i see them 100 times in a same day, and please hollywood stop."}, {"rating": "1", "text": "I didn't want to see this movie, it was my girlfriend who lied to me she said i wanna see Guardians of the Galaxy, and we went and see If I Stay, god what a bad movie"}, {"rating": "7", "text": "It was alright, actually, the novel are goods, but dosen't add up alright in the movie. The cast was not great, except Chloë Moretz role in it. The plot were 60/100 but ahh, i felt there is something missing though.... Can't tell what the f--- it is... -_-"}, {"rating": "2", "text": "If I stay is a trashy teen movie that has zero chemistry between its leads. It takes forever to get the ball rolling and just when you think it was turning around, it provides you with a terrible ending to seal the deal. If I stay is nothing but a sappy, manipulative, cheesy film that even teenagers should find ridiculous."}, {"rating": "3", "text": "If I Stay is like a third-rate The Fault in Our Stars; it's sappy and manipulative, but in the worst ways. It's cheesy, derivative, and ridiculous, even on a \"12 year old girl tearjerker\" level. Chloë Grace Moretz is a good actress and will have a great career, but the guy in the movie can't act for his life.\r The one good thing about this movie (and I mean the only one whatsoever) was the cello repertoire. As a cellist, I can say that Mia's fingerings on the cello and the way she played were technically right (which is surprising for a movie like this), and the pieces played in the movie were very prestigious and nice to listen to.\r Overall, this movie was tedious, cheesy, and clichéd to the max, and even the girl I went with hated it. That's saying something. Even if you like movies in this genre, avoid it at all costs."}, {"rating": "2", "text": "Chloe sucks at choosing her roles to many remakes she did,  and The Equalizer look's like a remake of Taxi Driver (1976). Taken. And If I Stay has the worst ending it is really bad."}, {"rating": "1", "text": "The movie is to long and the ending was really bad,  i prefer seeing that her family is happy that she is alive, but no this is the worst ending i seen in a  movie."}, {"rating": "1", "text": "This movie is ,The Lovely Bones (2009) . Flatliners (1990) and Hereafter (2010)  ,And it looks like another remake of Chloe Moretz ,  lazy writing and dull direction ."}, {"rating": "1", "text": "The movie is to long and the ending was really bad, i prefer seeing that her family is happy that she is alive, but no this is the worst ending i seen in a movie."}, {"rating": "0", "text": "A lot of potential wasted on a sugary teenager melodrama that will make you cry just because of the time and money you wasted on this disaster, And huge waste of time. The whole movie was a huge building up to a disappointing ending, Please, don't stay!"}, {"rating": "1", "text": "Hopelessly romantic 15 year old girl who can handle really cheesy acting and very corny, stereotyped story lines, and it is a huge waste of time, The whole movie was a huge building up to a disappointing ending."}, {"rating": "0", "text": "BARBRA STREISAND - song - The Way We Were.\r Mem'ries,\rLight the corners of my mind\rMisty water-colored memories\rOf the way we were\rScattered pictures,\rOf the smiles we left behind\rSmiles we gave to one another\rFor the way we were\rCan it be that it was all so simple then?\rOr has time re-written every line?\rIf we had the chance to do it all again\rTell me, would we? Could we?\rMem'ries, may be beautiful and yet\rWhat's too painful to remember\rWe simply choose to forget\rSo it's the laughter\rWe will remember\rWhenever we remember...\rThe way we were...\rThe way we were..."}, {"rating": "1", "text": "Are you kidding me? Chose between a successful life or some loser slacker dude? That is a no brainer except in this movie. Let's throw in some life and death twists and this movie is truly one that only a teenage girl growing up in a cave could love."}, {"rating": "2", "text": "When you have such high expectations then the movie just turns out to be pure garbage,  This is other monumental dialogue can be yours for the low price of $8 and 2 hours of your precious life."}, {"rating": "1", "text": "Was incredibly disappointed by this. The book was actually pretty decent. I'm not a fan of chick flicks but i thought i'd watch the movie anyways since I read the book. Waste of time and money. It was boring, the casting was bad. Moretz was definitely not the right choice for the role. It was all around horrible."}, {"rating": "5", "text": "If I Stay is very sentimental in its themes about family relationships which makes it heartbreaking yet engaging but for the main ideal relationship between the two-star cross lovers (Chloe Moretz and Jamie Blackley), their love for each other seems to be incoherent and yet forced especially the ending part. Its not all that satisfying towards their relationship but at least it gave me tears for the parts when Mia's (Chloe Moretz) parents died in the accident. And one other thing is that; (I don't know if many people agree with me in this one)nwhy the movie showed first the accident scene before the past scenes where Mia meets the boy, and then knowing that her parents are rock music lovers. I don't think it should be that order of appearance, -- its a little rip off to know the life of the people who died in the accident. Overall, If I Stay is sometimes sweet, less funny, and an incoherent piece of melodrama aimed for the young and old."}, {"rating": "5", "text": "Sometimes in life you make choices and sometimes choices make you.”\r Adapted from Gayle Forman’s popular young adult novel of the same name, If I Stay hinges on choices and is quick to spell out this message to its audience. Protagonist Mia (Chloë Grace Moretz) and her family are involved in a massive car wreck early into the film and she finds herself in a state of limbo, forced to watch in horror as she becomes an orphan overnight.\r The film alternates between the past and present, filling in the gaps of Mia’s life up until the accident. The past shows Mia’s as a budding cellist with some series talent, hailing from a family of rock music enthusiasts. As a result she has always doubted her talent and questioned her place within the family; enter Adam, an ambitious musician played by Jamie Blackley. Adam is the type of gorgeous, charming, too-good-to-be true love interest that only ever exists in fiction. It takes a fair amount of coaxing from both Adam and her parents (delightfully played by Mireille Enos and Joshua Leonard) before she finally gives into them. Only a few short scenes later and they’re declaring their undying love and doing it in a shed. So sweet. Things begin to go pear-shaped for the couple when Mia considers pursuing her musical dreams and attending Julliard rather than remaining in Portland with Adam.\r The present is significantly less interesting. A large chunk of the film is Chloë Grace Moretz running around a hospital with a look of intense bewilderment on her face while her remaining loved ones and an ICU nurse keep pleading with her unconscious body to fight for her life. Therein lies the crux of the story; should Mia stay and fight for a life that doesn’t include her family? Or end it all and keep from feeling the brunt of that pain for the rest of her life?\r Unfortunately several members of the cast (including Moretz) seem to be suffering from a serious bout of overacting. This isn’t entirely Moretz’s fault, she isn’t given a whole lot to begin with. Apart from the incredible cello playing, Mia is a rather bland protagonist whose sole personality trait seems to be that she’s insecure. Yes, that comes with the territory of being a teenager, but how this girl has such low self-confidence is beyond me. Her parents have been encouraging and supporting her for her entire life. She has a great friend who always has her back and a boyfriend who is totally besotted with her. This, not the fact that a person can have control over whether live or die, is the biggest stretch of If I Stay.\rhe film isn’t without its merits, however. Even though Mia’s interactions with Adam lapse almost too far into sentimentality, the scenes she shares with her grandfather (Stacy Keach) are among the film’s best. He is her biggest supporter outside of her immediate family, and his respect for her musical talent is quite touching. I did get a little teary despite myself during his heartfelt speech at Mia’s bedside as he tells her he will understand if she doesn’t have it in her to fight anymore.\r While there are a number of scenes to enjoy, I can’t help but feel like I was cheated out of a more compelling story – the one where a girl copes in life after the death of her family. But hey, I hear there’s a second book, perhaps I’ll see some of you for the sequel."}, {"rating": "2", "text": "Why, Chloe Grace Moretz  enjoy making horrible movies with terrible production value? Does she get some kind of sick pleasure out of it ?,  it  is another stupid remake of Chloe, this movie is The Lovely Bones from (2009)"}, {"rating": "2", "text": "I was looking forward to seeing this film. It was advertised very well on TV but when I went to see it with my mum we were both very disappointed. It was awful. There was no story arc. Chole Mortez's character just stayed the same through out the film -- no character development. She just ran around the hospital looking pretty. The secondary characters (her friend, little brother parents) had more character development then her and where frankly much more interesting. It was way too long. Some parts of the film could of been cut out as a lot of the scenes where too prolonged and dull. I found myself getting very bored. If I was Gayle Forman (the author of the book) I would of been very disappointed with the film."}, {"rating": "2", "text": "mmmmm.................................................................................................................................................................................."}, {"rating": "2", "text": "This movie is bad. Very, very bad. It proves once again that movies mad from young adult books are not meant for anyone, of any age who considers themselves to be adult. Chloe Grace Moretz is marvellous, as she usually is, particularly in the cello playing scenes. That being said...the flick is maudlin, contrived, tear jerking schmaltz. Chloe did not deserve to have this movie thrust upon her."}, {"rating": "6", "text": "Many will hate If I Stay because it is, well, very much a chick flick at times. But, even as a guy, I managed to enjoy this one on varying levels. At times, the romance was very, very cheesy. It was over the top and felt very unrealistic. On top of that, this one can be incredibly melodramatic. However, in saying that, there are many redeeming qualities for If I Stay that I truly feel outweigh the negative. For one, Chloe Grace Moretz is great. She oddly cannot seem to cry, sure, but she was very good. On top of that, this one got me to cry just a little bit at times, which was not what I expected at all. While a lot of it felt very authentic romance wise, emotionally, this one was on point and certainly did a great job there and managed to wind up being a very touching film. The script is also fine, not great, but it got the job done and the cinematography worked well for the most part with some good and some bad. The music is also very good on this one and really completed the film nicely. However, the real reason why I like this one is  because of the supernatural element here regarding death. Death fascinates me and this one had a very interesting twist on the whole idea of death, which certainly piqued my interest in that regard. While If I Stay is far off from an Oscar winner, it is a fine film that does not deserve the amount of hatred it has received from some."}, {"rating": "5", "text": "Went in to this movie not expecting anything special. Knew the plot from the trailer - girl gets in accident while in a romantic relationship. Everyone else in the family is gone (Seriously in the trailer!).\rThere's one line - sometimes in life you make choices, and sometimes the choices make you. Really good line, I'll have to remember that next time I need it.\rOther than the flashbacks (to a high-school relationship) and flash-forwards (to the present-day hospital room), really relate-able movie. \"High school relationships are the most inconvenient to try and sustain. Long distance relationships are BS.\"\rIn summary, see it for the lines, not the plot. If you have to decide between this and Sin City for date night, see this one instead. Otherwise, wait for it on Redbox or Netflix."}, {"rating": "5", "text": "There's something really nice about seeing teenagers depicted as thinking breathing human beings who are at a point in life where they have to make huge decisions. Unfortunately, IF I STAY surrounds these super characters with a plot so contrived you can never believe it, let alone weep. It would be so lovely if this was a blatant tear jerker but it's a nice story about nice people making decisions. Not much more."}, {"rating": "6", "text": "'If I Stay' has tons of romantic cliche's that's the problem with the movie, however actors were trying (basically everyone was trying.) Chloë Grace Moretz plays her strong role as Mia a talented musician who loves Adam (Jamie Blackley)  then tragedy between Mia's family then links the characters together (cliche) Mortez gives us a performance that was \"glaring\" her parents were funny as well. This movie is sad but i was so moved by the story and the characters. Grade B-"}, {"rating": "5", "text": "If I stay is a big disappointment.Bad acting and predictable story,if I stay is just a waste of money.I didn't read the book but i bet he's 1000 times better than the movie."}, {"rating": "4", "text": "It is a film with no inspiration; it is dull, a lame excuse for a love story; it intersects with flashbacks of Mia with Adam; who is \"meant to be\". Chloe Grace Moretz delivers a winning performance, but just not in a winning movie."}, {"rating": "5", "text": "This is pretty forgettable movie with forgettable characters, forgettable story I'd like to forget (Richard Roeper reference). But yeah really nothing in this movie is memorable whatsoever."}, {"rating": "6", "text": "At the start, it was a wave of tranquility. The main actress, Chloe, did an average job and yet, she suited it well.  Can't say the same about the guy(boyfriend) though. What an emotionless zombie even until the end. Not as passionate as I expected them to be. But seeing as I am a girl who still believes in all the emotional love-is-forever crap, I've got to admit it was an undeniably moving story(teared up during a few scenes). However, the ending was definitely **** There better be a sequel coming up!!"}, {"rating": "5", "text": "If I stay, more like can I leave. The movie is about a 17-year-old cellist with a bright future ahead is involved in a devastating car accident that takes the lives of her parents. Now in a coma, she finds she can still leave her body - and relive the first 17 years of her life - all leading to one decision - to face a very different future or move on altogether. This is my big problem with these teen romance movies, and that is with it's force romance that goes nowhere with the main two love birds of the film. Chloë Grace Moretz did good in the movie but this movie tries to be like the fault in our stars and fails hard. The movie just feels force and the characters are pretty bland and forgettable, and overall this movie bored me and made me look at my watch a couple times."}, {"rating": "6", "text": "If I Stay is a film that wont stay long in the memory of the viewers. Part of that is because the story is weak and  cheesy add to that the weak supporting cast, In the end, If I Stay is an average film."}, {"rating": "8", "text": "Based on the Gayle Forman novel, this teen weepie is wrenchingly emotional and packed with girly fantasies.\r Watch it here http://www.watchfree.to/watch-29f60a-If-I-Stay-movie-online-free-putlocker.html"}, {"rating": "9", "text": "Loved loved loved this movie. I cried like a little girl through most of the second half of the movie. But I loved the story and I loved the book. It was a while ago I read the book so I can't recall how accurate it was or wasn't. I just loved the cast and the connections and the cello. everything!"}, {"rating": "10", "text": "Loved this movie inside and out! The cast, the soundtrack, everything was beautifully done. I love the movie just as much as the book, which rarely happens, tbh."}, {"rating": "8", "text": "I watched the movie for the second time and really enjoyed it was very nice.I can guarantee you will definitely cry an incredible emotional movie.Actresses were great especially Mian's grandfather playing player was very good.love, sadness, happiness you feel each emotion separately.only some visual effects were bad because, was a low budget movie but i liked it very muchthe most beautiful side of the film was the songs used very well,It was impressive,I think most of the songs for this film were songs of the film."}], "recommendations": ["the_vow", "a_walk_to_remember", "bridge_to_terabithia", "the_notebook", "midnight_sun", "we_bought_a_zoo", "the_last_song", "the_lake_house", "the_lucky_one", "paper_towns", "boyhood", "the_spectacular_now", "the_fault_in_our_stars", "seven_pounds", "the_curious_case_of_benjamin_button", "me_before_you", "the_best_of_me", "the_twilight_saga_breaking_dawn_part_1", "flipped", "last_christmas", "magic_mikes_last_dance", "something_borrowed", "the_holiday", "hannah_montana_the_movie", "soul_surfer"]}