{
  "id": 821,
  "title": "Igor",
  "starring": [
    "John Cusack",
    "Myleene Klass"
  ],
  "runtime": 87,
  "genre": [
    "Animation",
    "Comedy",
    "Family",
    "Fantasy",
    "Horror"
  ],
  "description": "A cliché hunchbacked evil scientist's assistant aspires to become a scientist himself, much to the displeasure of the rest of the evil science community.",
  "releaseYear": "2008",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mI4SPs0bZQm7bGVZKToC8KUsTd.jpg",
  "categories": {
    "plot": 5.7,
    "acting": 4.0,
    "ending": 5.0,
    "soundtrack": 5.5,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 6.928571428571429,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Worth to watch. But not smart enough to be an animated movie on this era."
    },
    {
      "rating": "0",
      "text": "I am going to turn into Gordon Ramsay but hell I'm a critic.  The animation was f*cking atrocious.  The character style was trash.  15 years well awaited, my ass."
    },
    {
      "rating": "3",
      "text": "I want to like it so much, but it wasn't funny and its computer animation let me down and it had a hit and miss premise that let me down and the voice performances were boring. I give this movie 27%."
    },
    {
      "rating": "10",
      "text": "Great, yet unfortunately, underrated film. Good laughs, voice talent, art, it was creative, and in all: Thoroughly enjoyable."
    },
    {
      "rating": "2",
      "text": "Not suitable for children, or really anyone for that matter. With good voice talent, competent animation and a pre-halloween season to play within, this 1.5 hour tour has much going for it, but like Frankenstein's monster, it turns out to be over-sized mess that scares children and horrifies adults. Having received free passes to see it a week in advance, I don't like to be unkind, but having made the mistake of taken young children (ages 2.5 and 4.5) to the movie, I'd like to take this early opportunity to dissuade others from doing the same. But if you like to expose your youth to slapstick without the funny, countless suicide jokes and lowbrow dialogue ranging from name-calling to hate-speech, then who am I to stop you. Those drawn by the voice talents of John Cleese (playing here a mad scientist reminiscent of the schoolteacher from the cover art of Pink Floyd's the Wall) will be gravely disappointed, as Mr. Cleese evidently had the good sense to leave the movie after the first 10 minutes. If only I had been wise enough to do the same."
    },
    {
      "rating": "10",
      "text": "Charming animated film that tells us Igor's side of the Frankenstein story. Once in a while, the little guy wins!"
    },
    {
      "rating": "6",
      "text": "Entertaining, amusing and creative, great score, fine script and enjoyable animation. Good voice overs. Curiously though it's not very memorable."
    },
    {
      "rating": "8",
      "text": "This was a wonderful family film. It is humorous not only for little kids but adults as well. The movie has an interesting and unique plot that develops its character's well. I would recommend this to people who generally like animated movies and are looking for a good family fun film."
    },
    {
      "rating": "7",
      "text": "In the tradition of Valerie Martin's 1990 Nebula-award-winning novel \"Mary Reilly\"(later adapted to the screen by Stephen Frears), an igor, like the nameless servant in Robert Louis Stevenson's \"Dr. Jekyll and Mr. Hyde\", gets to be the protagonist of his own narrative, stepping out, at long last, from being stereotyped, a stock character usually in possession of a low I.Q., who was first seen in James Whale's original \"Frankenstein\"(there is no mention of Igor in the 1817 Mary Shelley novella). The mad scientist, even in Mel Brooks' parodic \"Young Frankenstein\", is portrayed as the smartest man in the castle; but \"Igor\", in the film's most clever conceit, reimagines these mental giants as idiots(Dr. Glickenstein, voiced by John Cleese) and plagiarists(Dr. Schadenfreude, voiced by Eddie Izzard). This igor is like the Will Hunting of igors; he may possess a hump, but he's \"wicked smaht\", stuck in a malevolent world of chowderheads. Being that there are no igors of the fairer sex, and since he's straight, when Igor(John Cusack) plays God, he creates woman. He creates Kirstie Alley, but this former lab-assistant calls her Eva(Molly Shannon). His monster is an actress; a not-so-inside joke about how all female thespians have the potential to be divas. While \"Igor\" works as an old-school Hollywood picture about the entertainment biz, like most 3D-animated films not made by Pixar, however, the filmic elements are too post-modernist by half; in other words, too many pop culture references spoil the soup. When the showtunes kick in, it's like watching Tim Burton's take on \"Moulin Rouge\". But give \"Igor\" some credit for being insightful about how popular film, historically, and to this day, has a tendency to misrepresent people of all persuasions, in particular, this class of igors. Igor doesn't walk, or talk, the way he's supposed to; the way we're pre-conditioned to accept his kind, as servants, as people on the margins. See what the film is getting at?"
    },
    {
      "rating": "0",
      "text": "This movie was really awful. We have movie night every Saturday for the whole family and this doesn't make the grade. We watched about 1/2 of the movie and shut it off based on everyone's vote. Thumbs down."
    },
    {
      "rating": "7",
      "text": "Maybe a little too clever for the kids, but the girlfriend and I really enjoyed both the corny story and the in jokes. The Burton-esque setting was superb."
    },
    {
      "rating": "10",
      "text": "I LOVED this movie!! I was lucky enough to be invited to a sneak preview and went with less than great expectations, and was blown away. There are too many 'lairs' to talk about to give the film full credit, but I will say that after seeing this film, I want to see it again to catch the jokes I missed when the audience was laughing. And the political sidenotes did not go unnoticed. There was a tough of George Bush in King Malbert, who looks like a cockroach. But more than that, the movie shows a take on good vs. evil in a different light. Sometimes, you need something created out of the ether to show you whats wrong with the world, and Igor discovers those ills via Eva, played by Molly Shannon, who helps in exposing the truth behind malaria and who is in charge. I recommend this movie!!!"
    },
    {
      "rating": "10",
      "text": "Great movie...very funny w/ good animation."
    },
    {
      "rating": "8",
      "text": "Original, cut out the cliches, and was certainly clever, but the comedy was \"not laughing through the whole movie funny\"."
    },
    {
      "rating": "10",
      "text": "Lucky enough to get tix to the sneak preview! I loved it. Fun to watch...loved the dry,smart, subtle humor. Animation was beautiful. My husband and I keep quoting it and laughing...the sign of great movie!"
    },
    {
      "rating": "10",
      "text": "I was forced to go to this as a favor to a co-worker who was given preview tickets and didn't want to go alone. Pleasantly suprised.. laughing so loudly that it got awkward! This is a funny one!"
    },
    {
      "rating": "10",
      "text": "I really enjoyed this movie. The animation, the music score, the writing all worked. The characters were funny and interesting and the voice cast is second to none. My kids liked it also, highly recommended."
    },
    {
      "rating": "10",
      "text": "This movie is funny. Good for all ages."
    },
    {
      "rating": "6",
      "text": "Igor was an interesting character, but the supporting cast I found annoying and heroic trio was a cliche cast of characters both in attitude and behavior. \"Brain\" was annoyingly stupid and a poorly designed character to make him likeable. That rat rabbit got on my nerves with his comments and voice over. (good actor, but maybe not suited for animation voice overs). And the leading lady... the monster was obnoxious as well on the order of an American Idol reject. Sorry, too many good animated films out there for this Tim Burton knock-off to deserve a 7 or higher."
    },
    {
      "rating": "1",
      "text": "Voices and Music poorly cast and chosen. Found the actors to not hit the right feelings to properly portray the given character. The music in many scenes was distracting and again didn't fit the scene as a whole. At times had to fast forward because I found it so awful."
    },
    {
      "rating": "6",
      "text": "Muy original poder hacer una historia con el eterno secundario del Dr. Frankenstein. Quién no ha visto siempre a Igor como un personaje divertido, que nos recuerda al Jorobado de Notre Damme. Muy divertidos los personajes secundarios, el gato immortal y sobretodo el cerebro."
    },
    {
      "rating": "3",
      "text": "A movie with slim to none comedy and a pathetic and much-spoofed storyline. The animation, writing, plot, voice acting. All of it was of either median or sub-par quality. I could not find one joke or reference funny. In fact, I could not remember one person in the theatre laughing and leaving the theatre everyone was silent and unaffected. Neither Pixar nor even Dreamworks could ever stoop this low."
    },
    {
      "rating": "2",
      "text": "This film was full of cheap jokes that neither my eight-year old sister or I found funny, and the plot just wasn't entertaining at all. The characters annoyed me and I couldn't sit through the whole thing."
    },
    {
      "rating": "4",
      "text": "Igor is devilishly average.\rThe movie isn't bad, and it isn't good. The animation is average and there are few to no laughs. Worth seeing, but not worth remembering."
    },
    {
      "rating": "4",
      "text": "It's normal for Igor to be this least favorable, but what Igor keeps trying is failing to improve itself in front of the audience. Fun, but quickly forgettable and leads to a mixed situation in the mixed bag."
    },
    {
      "rating": "9",
      "text": "Really enjoyed this movie. It was a cute new look at the story of the Frankenstein Monster!\r Watch it online for free: https://www.primewire.ag/watch-25-Igor-online-free"
    },
    {
      "rating": "6",
      "text": "This was an okay movie! But not the best! I rewatched this movie and it was okay!"
    }
  ],
  "recommendations": [
    "captain_underpants_the_first_epic_movie",
    "ice_age_the_meltdown",
    "spies_in_disguise",
    "hotel_transylvania",
    "hotel_transylvania_2",
    "zookeeper",
    "marmaduke",
    "madagascar_escape_2_africa",
    "the_smurfs",
    "yogi_bear",
    "alvin_and_the_chipmunks",
    "madagascar",
    "over_the_hedge",
    "despicable_me",
    "robots",
    "minions",
    "cloudy_with_a_chance_of_meatballs",
    "ice_age",
    "megamind",
    "peter_rabbit",
    "scooby_doo",
    "penguins_of_madagascar",
    "storks",
    "alvin_and_the_chipmunks_chipwrecked",
    "despicable_me_2"
  ]
}