{"id": 2636, "title": "Immortals", "starring": ["Henry Cavill", "Mickey Rourke"], "runtime": 110, "genre": ["Fantasy", "Action", "Drama"], "description": "Theseus is a mortal man chosen by Zeus to lead the fight against the ruthless King Hyperion, who is on a rampage across Greece to obtain a weapon that can destroy humanity.", "releaseYear": "2011", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/swJ3VuuSMJUDoi899VuXG5OqmPG.jpg", "categories": {"plot": 3.4375, "acting": 3.673469387755102, "ending": 3.6153846153846154, "soundtrack": 5.0, "cinematography": 2.0, "familyFriendly": 3.0, "funny": 6.5, "action": 4.866666666666666}, "reviews": [{"rating": "2", "text": "Immortals is what can only be described as a mess. The acting is poor, the plot is thin, dull and poorly executed and the script is the worst I have ever encountered in a profesional film. Even the films one the redeeming feature - the action - is often flat and dull. There are only two good things in this film.  The first is the action scenes involving the gods which are exciting, dramatic, fast moving and satisfyingly gory but far far too brief. The second is the performance of Mickey Rourke as the evil king Hyperion who is easily the best actor in the whole debacle. The main con is the acting ability of all the other actors which makes a plank of wood look like Laurence Olivier. Theseus is played by the typical good looking guy who clearly feels that muscles are a fitting substitute for performance and John Hurt, who is a generally a very good actor, is woefully misused. It is difficult to point out a single actor who acted in any way which didn't seem forced and unreal. However, this may not be their fault as the characters are given the depth of a thimble of water by the script and I imagine it must be hard to work well with a script that is so badly written that it would embarrass a ten year old. Several times, throughout some of the \"profound\" speeches the characters gave I actually got goosebumps, not because it was such a poweful use of the English language but, because it was so cheesy that it made my skin crawl. This similarly applies to the sex scene which was so completely random and seemed shoe-horned into the film just because every film should have romance. This brings me to the plot which was so predictable that you didn't need to be Nostradamus to stay 3 steps ahead of it. It really does seem like like the creator picked up \"Ancient Greece for Pre-School\" at a book sale, scavenged some names from it and mushed them all together rather than having any clue about what they are famous for (Eg: Since when was Theseus a bastard? and wasn't Hyperion actually a Titan himself?) but lets just skip over my gripes as to how the film was unrelated to Greek mythology in almost every way as to most readers that will be rather boring. The final nail in the coffin was that the battle scenes, with the exception of those previously mentioned, seemed rather unoriginal, flat, and, dare I say it, boring. Never have I been less interested in the clash of two great armies. Similarly the pre battles speeches had none of the badass attitude or brevity of \"Tonight We Dine In Hell\" and none of the epic grandeur of the speeches in Lord Of The Rings', instead they just sort of fizzled out in banal nonsense. If I, sat safely in my cinema seat, thought that the supposedly rousing speech was terrible and that the person giving it had the charisma of plague victim then how can we be honestly expected to believe that it could inspire men to charge into almost certain death? Quite simply this film was terrible and I would honestly encourage you not to waste your money and if you really must watch it then buy it cheaply from a bargain bin."}, {"rating": "3", "text": "Whoever doesnt know or ever read greek mythology this movie has some action elements to be liked.But for those you know about greek mythology they will agree that this wasnt a  greek mythological fantasy action movie... it was an ancient greek tragedy.Faults of this movie are so many and obvious it made me laugh. In a bad way.  Where should i start...Bad story , cheesy dialogues , unnecessary gore , ridiculous costumes, missing gods ( from 12 there were 6 ) , Titans looked like they are some kind of wilds from amazon , Greek name \"darios\"!! which is a persian name.... I can go on till tommorow but i dont want to spoil anything ( did you know Black sea was full of oil ? ).Bad scenario, cheap production,nothing sticked to original greek mythology , bad acting at times ... All felt BAD.3/10 MAX"}, {"rating": "1", "text": "Sincerely, this movie is simply disgusting. Top contender for: most fake sunsets (really bad lighting of the sets), ridiculous and over the top costumes (mask of Minotaur?), silly story (why Perseus is in that story at all, if story resolution does not depend on him?), bad acting and zombie like titans (really, is that 28 Days Later?)."}, {"rating": "4", "text": "With a budget of 75 million dollars, with a biceps ala Henry Cavill, the film has made somewhat good job, making profit of 200 million dollars.\r The story: the film is inspired by Greek mythology, but it's somewhat adjusted to the director's vision that saw too much manga.\rAccording to the film, in the early universe they were immortals, only that they were split and they beat each other. Olympian gods have become winners, and the losers became Titans, who were huddled in a cage with bars stuffed into their mouths, growling forever.\r Only a plump king, Hyperion plans to release the Titans, so he organized an army of heracliens wearing masks like those of executioners inspired by the medieval dungeons and torture rooms and go to seek his bow Epirus, a super- weapon of mass destruction which is able to reproduce the molecular beam arrows with balls of mass and strength, able to make holes through walls.\r And so begins the story of Theseus and the mother of the devotees who often go on to bisericuta.Tezeu was driven by lower Zeus, disguised as an old man catches him there ..... invasion, Theseus is cornered and his mother is killed in Hyperion his eyes by telling him he looks like hell.\rAnd as in any genre film, Theseus and his friends are enslaved, but with a oracles-virgin, escaping the clutches heraclienilor.\rOne of the deserting soldiers city, get to endure the ordeal that he suffered from Hyperion just to feel useful and he, kissing him in the ass.\r Zeus, meanwhile, tells the other gods that are not allowed to intervene.\rWe arrive at the scene where Theseus grab bow and kills the Minotaur .... actually a masked man, then the final battle will take place at Mount Tartarus.\rPhaedra, although a virgin oracle, **** easily with lightning first man who comes along.\rThe film is trying to tell you something, the idea of ​​free will, mature has several aftershocks, but a bit superficial forms.\rIronically, although immortal, in the final battle, all gods die.\r Overview: the effects are pretty good, but sepia, as in 300, it's too exaggerated, designed to make you feel on the thirteenth century. Olympic gods are not those deities dressed in white tunics, dancing merrily on a mountain with clouds, but some models are ........ playboy calendar, dressed in golden armor, including Zeus which is a few tens of thousands years younger, virile and Athena, goddess of wisdom which alone do not give me the feeling, but a pitzi in playboy, which has less and babardeste with Zeus, who was his father.\rTrue, the scene in which Poseidon into the sea full of oil's millions, believing that if you bathe, Zeus will not suspect anything, though ... do not know if Greece were tsunamis thirteenth century.\r Actors John Hurt and Mickey Rourke in the role of Santa's were about the only ones who played pretty well.\rRating: 4.5 indulgently."}, {"rating": "3", "text": "Not a bad movie, but not good either. Full of cliche scenes and hillarious costumes, also the 3D effect wasn't the best (even commercials before the actual movie were way better). Let me just say that I had never fallen asleep (twice!) on an action movie before this one. Deffo worse than Clash of the Titans."}, {"rating": "1", "text": "Had high expectations! Set myself up for disappointment. Never again will I get hopes up for another film because of this one. It spoiled my appetite. I'll remain neutral from now on...no matter how HYPED trailers look better than movie. Dry slow to a crawl direction and acting. Only one spectacular scene with Zeus fight"}, {"rating": "5", "text": "If you like this genre, you should enjoy this film.  It was too dark (literally and figuratively) for my taste and the spurting blood gets to be old very quickly.  It says a lot about a movie when you are relieved to see the credits roll."}, {"rating": "1", "text": "Let me begin by saying that I love \"300\", a film that has style, substance, plot, decent acting and engaging dialogue. Immortals has none of these. it is without a doubt the worst film that I have seen in many years. So bad that I have got off my lazy ass to sign up to this site to say just how bad it is...If you can only resist buying one thing that you really want this year then make damned certain that this is it!This film is a terrible waste of the material offered up by the original Greek mythology and could be a potential career killer for many of those unfortunate enough to be involved in it.The plot is a collection of ticks placed in boxes on a producers must have marketing list. Everything just happens because it must in order to fulfil this cliched criteria...Theseus must have a best friend, enter one cheesy Yankee(George Bush Jr could have done no worse in the role than this guy did) who with one terrible line of dialect becomes just that.The virgin Oracle soon becomes the ex-virgin Oracle after shedding her robes for a man she has only just met(Mr Producer picks up his pen and places a confident mark in the box for \"Intimate relationship and romance\"...).The sets range from bland brown rocky areas to more bland brown rocky areas with a couple of uninspiring and over used locals thrown in amongst these bland brown rocky areas. In 300 this was not an issue, they were holding one narrow pass against their foes for most of the film. In Immortals the whole of Greece has suffered an unfortunate makeover that would kill there tourist industry(and economy) overnight if it were real. Maybe the lead special effects designer has worked in the game industry, maybe on some post apocalyptic FPS as that is the grim vision of Greece that we are presented with here...The icing on this turd cake comes from the costume design, in particular that of the Gods. Camp shiny efforts for most of the film topped off by super camp yellow outfits for the finale. So camp that you would still stop and stare even if they were walking down Canal Street of Manchester in the middle of mardi gras weekend(ps: the street sign said something rather different for many years due to the unfortunate removal of the letters C and S...)."}, {"rating": "3", "text": "This movie was recommended by a good friend, after having watched it i know that he was wrong. A movie without emotion and feelings. The story is one we've seen many times before, there's noting new and everything ends as you think it will. And the most important: a lot of things happen for no reason, like in most of the movies we see nowadays."}, {"rating": "4", "text": "Haha. What the **** Just simply, what the **** Don't get decieved by the posters ladies and gentlemen. Tarsem Singh's \"Immortals\" isn't exactly like \"300\", although it tries to be with it's rich visuals. It can never be like \"300\" because of the crappiest Greek God script I've seen in YEARS. What kind of ****ing story flushes down characters like **** and adds fight scenes every 5 seconds? Haha, the movie gave me a good laugh though."}, {"rating": "2", "text": "One word : mediocre, the word says it all, this movie is bad from the beginning to the end, the characters are flat, the sex scene is completely useless, the gods looks like idiots with their golden suit, the story could have been interesting but is very poorly developed (all the hype around the Hyperion bow(something like that) is never exploited ), the fight of the gods against the titans is just ridiculous because they are only some sort of fast moving martial art practitioners and I expected them to have some sort of powers like Zeus shooting lightning bolts or Poseidon using water but no it doesn`t happen. Overall, this is just a bad movie, too much focused on blood scenes and not enough on the rest, it had potential but it`s only a ridiculously bad version of God of War."}, {"rating": "6", "text": "A decent flick; nothing special at all. The acting was average. The story was a bit boring: what ruined it the most (for me at least) was the romance between the protagonist and one of the main characters. I find that it was unnecessary. In this day and age, however, romance is a must, so I can't remove points there. Plenty of action scenes as the trailer suggested, except that most of them were dull, save for the one right at the end. The characters were flat: they were all either passive or aggressive, so all of them were quite extreme. I found the main villain rather engaging, but that's up to you to decide. The acting wasn't too shabby. The ending.. wasn't too good. All in all, a pretty regular movie, as expected from Hollywood these days."}, {"rating": "2", "text": "It's obvious that the filmakers behind this film were far more interested in the visual effects and the set pieces because somewhere along the way they forgot that they actually needed to tell a story here. The visuals are striking: the scenery is quite beautiful, the action well choreographed, even the acting was solid but everything else (everything that mattered) is just awful. The characters have absolutely no depth and lack chemistry; Henry Cavill is just required to look heroic and handsome because his character is pretty much the same as Sam Worthington's Perseus from Clash of the Titans. Titans may have been a bad film but at the least the plot was coherent enough unlike Immortals where the filmakers decide that they (needlessly) have to have Poseidon send a giant wave in to help the heroes fend off about 6 soldiers when Theseus himself killed at least that single handedly earlier in the film. It's just misplaced and silly; much like an unneccessary love scene that just came out of nowhere. It's misjudged and doesnt make much sense. Nothing really to recommend here."}, {"rating": "3", "text": "This isn't so much a movie as a vehicle for sleek visuals. The plot was anemic and the characters laughably flat. Visually, it picks up where 300 left off, but adds in some epic (and beautiful) landscape shots to go with the truly visceral battle scenes. If you're looking for blood spatter in HD, this is your flick, but overall, the cardboard characters, imbecilic plot, and absurd;y self-important voices overs are just to bad to make this move enjoyable. This movie falls far below \"300,\" which at least had the good sense to let itself be fun."}, {"rating": "5", "text": "Well, i am disappointed. The only colourful person is Mickey Rourke, all other actors are just boring.And the design is simply annoying - the armor is made of plastic, the helmets of the gods are ridiculous, and you always feel that the movie has been completely made in a studio or designed by computer.OK, in the end the titans get sliced, smashed and choped in any possible way and here and there is some nice cruelty and a few naked breasts in 3D, but there are no memorable highlights. For example the scene before the final battle, where Theseus makes his speech to encourage the army. He just says some shallow blablabla and the people start grunting to hide he is only talking rubish. If you compare this to other blood, gore and iron movies like Braveheart, Gladiator or 300 this Theseus is just a plain schmock.I have to give it 5 points because my girlfriend insists - she liked the nude boys and one of the actors played in Twilight."}, {"rating": "4", "text": "It was decent nothing to special about it boring at times but terrible story telling a few scenes of true exciting action but I think 300 was way better in content and script writing."}, {"rating": "1", "text": "I'm giving this a ONE instead of a ZERO for the great casting for the gods and their costume designers, who did a terrific job making each one identifiable, and the set designers, who made the top of Mt. Olympus look breathtakingly serene. Too bad the god's actions and fighting scenes weren't godly enough.I think this will be one of those films that would have been more interesting if Henry Cavill and Freida Pinto's characters never appeared."}, {"rating": "3", "text": "Mediocrity at its finest.  Let's call this the poor man's 300.  Nothing about this was exceptional at all.  It started pretty solid, but faded as it went along.  There wasn't a single stand-out moment in this film for me.  The acting was mediocre, the characters were all very one dimensional (I didn't care for any of the characters) and poorly developed characters like the monk (yes he is literally just called \"the monk\") serve quite literally no purpose in this film.  Even the action, the true focus of the film wasn't up to scratch.  Apart from the battle with the gods (which looked awesome, but wasn't enough of it), none of the battles caught my eye.  Infact, there was one point in the film where I fell asleep momentarily due to sheer boredom, which has only ever happened to me in one other film (funnily enough, it was Clash of the Titans).  Nothing about this film is great or even good.  Literally everything is either \"meh\" or just plain bad.  If you want to see the film and develop your own view of it then by all means be my guest because you may enjoy it, but I didn't.  One final word of advice: Do NOT waste your money on the 3D.  Go 2D or not at all."}, {"rating": "9", "text": "This story line was a little dull and the movie didn't have much depth, but the visuals, effect and gore were top notch. Gave me that 'God of War' impression."}, {"rating": "2", "text": "A mortal movie... won't be remembered. Mediocre acting, mediocre story, a sex scene completely unnecessary, not so great special effects... and boring the first part."}, {"rating": "0", "text": "As a mythological movie, this is really one of the worst disaster that I have ever seen, the actors seem more sci-fi soldiers than ancient Greeks, and the story is inane and lame, and not based on the real greek mythology. The action scenes are not bad, but the overall feeling is more like seeing a (mediocre) videogame that a good movie."}, {"rating": "3", "text": "A rather mundane way to waste a couple of hours. This film reeks of average content, average scripting and (mostly) average acting. That's not to say it's bad, it's not not good in any real way. Certainly the action scenes (which we all are watching it for, lets face it) can be quite good, but those that are are unfulfilling in their length. A great deal has been said about Immortals comparison to 300, well of that film it falls far short, but the lineage of this bastard son is notable in the attempt at the slow motion visceral combat scenes. Yet somehow director Singh has managed to take all the slickness and clarity out of these scenes. In the predictable final battle, after a rather lacklustre pep-talk by main character Theseus, the melee is so confusion and the colours so drab that its very difficult to see exactly what is going on and whose doing what. Not that you'd care much; the characters of this film are all pretty mundane and without intrigue, popping off a couple of cliched lines occasionally and then dying appropriately as the drama demands. You have Theseus, the main protagonist who has a rather worrying relationship with his mother and that's about all there is to distinguish him. He blathers a bit about faith and the lack of faith (a running theme), but it's so irrelevant to the overall plot you can pretty much disregard it. There's Phaedra, the virgin oracle who doesn't remain so very long (here the film is similar to 300 in its gratuitous and pointless sex scene, although not as funny as 300). Then there's, for me, the one true highlight of the film, the \"evil\" king Hyperion, played by Mickey Rourke. Rourke is by far the strongest character of the film and I actually found myself rooting for him more and more; he had a game plan, set morals and didn't seem like a piece of wet tissue paper like a lot of the other characters. I genuinely hoped he would win in the end (he didn't, this is Hollywood after all). Another stronger point is the battle sequences of the gods, which are fast and viceral, though too short to be really satisfying. Watching what one of them splatter bad guy head with a hammer in slow motion was pretty fun. But tragically that's about it, the greek gods, who are dressed in bizarre garish gold costumes something akin to a French perfum advert, are pretty anonymous - the only way to tell Poseidon appart from Zeus is that he's holding a trident. I'm sore pressed to say who the other two gods were, possibly Apollo? Maybe Helios? Perhaps Whocares, god of weak character development? Athena, who is actually named, seems a bit of bimbo and quite pathetic, rather than the strong willed, stubborn goddess of wisdom and war she's meant to be. But, like all other characters in this film, even the gods are just there as padding until their dramatic deaths (I did tick the \"spoiler\" box). Of course only a Titan (whom Hyperion is attempting to free to bring about a new world order or something....) can do it. I bet they're massive! I hear you cry. Well no, they're not titanic, ahem, they're more like the savages from the Decent and plastered in grey mud, then they die like Hollywood vampires by crumbling into dust, much like my interest at this point. All that isn't bad, it's just not good, it's weak but its palatable. It's average but its not terrible. What's really bad about the film is little irritating stupidities that make no sense whatsoever. It might just be me, but Phaedra drinking from pool of water in the least efficient way possible (holding her hand vertically so that no water is actually retained) and then dribbling water from her own lips into Theseus' was just ridiculous. The misuse of actors like John Hurt who had so much more potential. The random sea of oil that has no function to the plot whatsoever. The knife wound that Theseus receives in the end but doesn't stop him - at least Maximus in Gladiator had the good grace to die after such a wound. The village that is undefendable despite the fact that its only obvious entrance is a narrow corridor cut into the stone of the cliffs themselves - as we all know, small narrow corridors are totally undefensible unless manned by half naked Greeks... oh wait. These things and others just pander to ridiculous pointless features that are there as padding for an empty film with barely enough strength of character to stand up on its own. I suspect the lifetime of this film is slightly less than its title puports.\r P.S. I really do wish Hyperion had won in the end, at least I felt like he had put the hard work in."}, {"rating": "1", "text": "Immortals is just another one of those, loud, noisy, thinly written, and overproduced movie that is just sloppily made and poorly acted. And also,  the  movie makes sev"}, {"rating": "6", "text": "Overall Movie: 3 Acting: 0 Storyline: 6  Notes: Special effects: 10 Wow, does this movie blow you away with it's epic special effects. In the mood for a good movie? NEVER WATCH THIS!!!!!!!!!!!!!!!!!!!!!! In the mood to have fun and ignore the bad acting and stupid storyline, and just enjoy the special effects? IMMORTALS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "7", "text": "I was a bit let down by the story, which in my opinion is more or less cliche now, but the action sequences and CGI more than make up for it.  The 3D version, should you choose to see it, has good use of 3D.  Seeing some blood from a killed person fly at you is stunning.  I would have made one or two changes in the cast as well.  I won't say who, but I felt that at least one of the characters did not fit into his/her place as well as I would have had hoped.  If you like action, then this is worth a look, especially if you are a fan of movies like 300."}, {"rating": "5", "text": "Apparently anyone who gives this film anything above a 5 or 6 hasn't ever seen a good movie let alone a great movie.  For every good thing this film does style wise it does something bad in every other area (sound, acting, direction,dialogue, etc).It can be entertaining at times but most of the time it's \"been there, done that, have the t-shirt\"."}, {"rating": "6", "text": "Immortals was decent enough but it had the potential to be so much better. Henry Cavill did well as Theseus but Mickey Rourke could've been more menacing as King Hyperion. I mean he (Hyperion) was definitely a demented psychopath but he seemed to be more thoughtful and measured than off his nut which seemed more warranted but hey, I didn't direct this. The slo-mo highly stylized scenes of ultra-violence were done well, human obliteration looked more authentic than ever, and this is one of the film's elements I think worked well. My biggest disappointment was with the gods, they were played simply by normal humans with little to no special effects augmentation. If I were director, at a minimum, the gods would've been an impressive 20-ft tall then it's just discretionary elements from there but that's not what they did. The film is fine as a rental for a few bucks, but it's not a keeper."}, {"rating": "9", "text": "Its been about 8 months now since Zack Snyder \"Sucker Punch\"ed us with an awful PG-13 cut of what could have been a good film (the R-rated cut wasn't bad). And while Zack Snyder sold out on his fans, \"Conan\" was murdered by a bunch of miniscule children (Spy Kids 4) and civil rights rendezvous (The Help), Tarsem has the courage and audacity to make a movie that he wants to make, and it proves to be a near-rival to Zack Snyder's hit 2006 film \"300\", while utterly hacking \"Clash of the Titans\" in half. All I can say is, I'm pretty damn impressed. Its pretty much what the \"Clash of the Titans\" remake should have been.Not with the script, which in a way was mediocre, but the impressive and sometimes haunting visuals make up for a portion of the obvious cliches.Its also possible to tell that this is trying to be the next 300, when it really is and should be its own style.Overall, the fight scenes are insane (theres absolutely no way this could have been PG-13), Henry Cavill is a convincing Superman, Mickey Rourke is a believable villain (unlike Stephen Lang who makes Quaritch likeable, you really just want to maim and kill the Heraklion King Hyperion).Either way, I recommend you RUSH to see this in theaters, especially in 3D (which Tarsem uses fairly well, especially at the end). Its worth the $14 and if you disagree, then we can have a good old debate."}, {"rating": "7", "text": "Immortals will be remembered more for its slick, breathtaking visuals than its slow and at times, boring, storytelling. Director Tarsem Singh (The Fall, The Cell) has a distinct style that everyone recognizes, and it is perfect for a movie that deals with Greek mythology. This movie is definitely a sight to see and will be more appreciated if it is seen on the big screen. And you cannot help but think of movies like Clash of the Titans and 300 when you see the previews for Immortals and it is even more on your mind when you actually see the movie. Is it better than Clash of the Titans? You bet. But is it better than 300? Not a chance.\r Theseus (Henry Cavill) lives the life of a peasant in a small village and is full of pride and confidence no matter what his status is. More importantly, he stands up for those he loves and he does not love anyone more than his mother. But when the brutal, ruthless King Hyperion (Mickey Rourke) attacks the village, he murders Theseusâ"}, {"rating": "5", "text": "Beowulf tried to one-up 300, They FAILED! Clash of the Titans tried to one-up 300, THEY FAILED even worse. Do i even need to repeat myself for this one? The acting is mediocre, there is action but it doesn't help the story, which has a worse plot than that of the power rangers movie or Barney."}, {"rating": "10", "text": "This is definitely the best movie of all time.  It's a brutal combination on 1% excellence, and 99% PURE AWESOME.  The day before I went to see this movie, I thought I knew what awesome was, but I was so wrong.   This movie is more awesome than Zeus and Chuck Norris fighting to the death on a cloud of Ferraris, Nukes, and Bacon while the entire casts of 300, Sin City, Robocop 2 and Tuesdays with Morrie have their collective faces melted off from sheer exposure to awesomeness."}, {"rating": "10", "text": "If you are looking for entertainment, then stop here because this movie is exhilarating fun!  Although this movie is being compared to 300, it is an entirely different story, but with all of the epicness!"}, {"rating": "5", "text": "Several holes in the script and fluctuating epic. good special effects that cover many gaps in the film. A film that ultimately makes you just say these words .. and then? very disappointed"}, {"rating": "10", "text": "A totally awesome film! A must see if you're a fan of 300. From start to finish this film does not stop. Amazing action scenes, amazing score, and if you're a gamer you will appreciate the movie (Reminded me of God of War). Go see it... you will love it!"}, {"rating": "6", "text": "The movie was pretty decent, and honestly this 6 is because of the well choreographed fight scenes and the cinematography, especially towards the end. The characters were boring, and the time spent advancing the thin plot felt like filler, because you really dont care about the characters, and dont even get me started on the costume design. Overall if u go to this movie expecting some great greek epic, you may be disappointed but if you want to see some awesome action scenes then go for it."}, {"rating": "6", "text": "The performances were all pretty good with Mickey Rourke standing out for me; he has such a great screen presence. A very violent film with plenty of claret on show, which will please all the splatter-fest fans. It"}, {"rating": "6", "text": "Gods and mortals tangle in this classic mythological tale told with sumptuous style and up-to-date action. Director Tarsem Singh is known for his lavish and inventive visual expression and he's applied his unique images to this stuffy story. Theseus (Henry Cavill) is a peasant who leads the mortals in battle against a bloodthirsty king (Mickey Rourke). The buff golden gods occasionally drop in from Olympus and their final scene kicks some cool CGI butt. The dialogue is stodgy and the drama slows the pace, but the violent action and the imaginative look make it fun to watch."}, {"rating": "10", "text": "It was a good movie!! Sure they could have done alot more with it but it wasnt horrible!!! Hopefully when They make the next one they will broaden their arises!!!!!:-)"}, {"rating": "6", "text": "The story was slow and plodding.  The plot was supposed to be about keeping a magical bow out of the evil King Hyperion's hands (played by a mumbling Mickey Rourke), but the bow really didn't come into play much.  King Hyperion gets his hands on the bow and uses it once to break open a gate and that's it.  I also have an issue with poor audio and actors mumbling their words so that you couldn't understand them.  The acting ranged from mediocre to good.  I'm still giving the movie a pass because the visuals were great.  The 3D was slightly above average, but the computer drawn vistas looked superb.  The fight scenes were gory and exciting.  If you liked 300 you will probably like this one."}, {"rating": "5", "text": "I wanted to like this movie more than I did, the first half was engaging but the last half fell short for me, i agree with what a lot of ppl are saying about it but in the end I still liked 300 much better, theres not much in theaters right now so if your looking for something to do its worth it but if your tight on funds id save the money for a rental or download"}, {"rating": "7", "text": "Good but not great. It's got a lot of things going on, and while not all of them work like they should, it can satisfy you if your a fan of movies like Clash of the Titans and 300. So if you like those movies you'll probably like this one, just don't expect greatness."}, {"rating": "9", "text": "I really enjoyed this movie. Tarsem is one of my favorite directors and I feel he still delivered on a \"big budget\" movie. The 3D was unnecessary (as usual), but I think the visuals were still solid. The acting was decent for this type of action-centric movie, far better than 300 in my opinion. You just can't go wrong with Mickey Rourke and John Hurt. The story isn't the stand out here, but that's sort of predictable for this kind of movie. My expectations weren't high walking in, but I'm happy to say I was thoroughly entertained."}, {"rating": "6", "text": "Like 300 with a magic bow and arrows...that doesn't get shot nearly enough...oh, and rabid Titans.  Note to self: if someone gives you a magic bow with unlimited ammo arrows? Hold it with both hands..."}, {"rating": "9", "text": "Ok I watched this, and I had a good time.  Why?  Well...I'll be blunt...the murder ratio was up to par.  There is a lot of horrifying murder in this picture, and that's a good thing.  I wasn't trying to watch 'Steel Magnolias', feel me?  This movie had excessive splattery gore that just made my day. Legendary Pictures alrerady has a well-defined artistic look, and I respect that heaps. The villain (Mickey **** Rourke) is so dope in this, I wanted to cry.  He does pure, but disaffected, evil so well, it makes me just wanna get hammered with him somewhere.  He's the ****  The only thing that seemed out of place was the last scene, with a Bieber moptop and some Kanye West self-indulgent montagÃ© ****  That was just dumb as hell...because it was pointless.  You guys already made a good movie.  Pouring **** on it isn't gonna help. See? Anyway, that was a misstep, but I still really liked it, & it's a good time........if you like murder. :}  I do."}, {"rating": "4", "text": "It's definitely cool looking, but sometimes that's just not good enough. The acting and the action scenes were both patchy, the plot was ridiculous to the point of unintentionally funny, the 3D was weirdly flat, and easily 2/3 of the scenes could have been cut without the movie losing anything. Though I had to add a point for Mickey Rourke, who was awesome."}, {"rating": "10", "text": "very very good moovie.Maybe better than the 300.I found this moovie very good from the first to the last second.The most interesting moovie of the year after Harry Potter."}, {"rating": "8", "text": "Mickey Rourke (nobody plays a better antagonist) is enigmatically brilliant as Hyperion and Henry Cavill puts in his best performance since \"The Tudors.\""}, {"rating": "10", "text": "So happy to see Mickey Rourke having a resurgence and getting the big roles he deserves.  He should have won an Oscar for his role in The Wrestler but Hollywood politics got in the way and the award was instead given to Sean Penn because he is more \"politically correct\" by Tinseltown's twisted standards."}, {"rating": "10", "text": "Sorry, but any movie with Mickey Rourke as the bad guy is worth the price of admission.  Just saw \"Angel Heart\" over Halloween and I forgot how awesome that film was."}, {"rating": "8", "text": "This movie was epic. When i saw the trailer i thought it would be really stupid but i was definitely wrong. The acting was definitely not the best, but the action definitely was. Amazing and epic action scenes. My mind was blown. I loved this movie. If you liked 300 then definitely see this, but if not unless you like really well choreographed action, then this movie isnt for you. This movie requires a certain taste, but if you have that taste then you must see this. You wont be disappointed. 8/10"}], "recommendations": ["clash_of_the_titans", "transformers_the_last_knight", "pompeii", "underworld", "underworld_blood_wars", "battleship", "bloodshot", "hercules", "300_rise_of_an_empire", "ghost_rider_spirit_of_vengeance", "poseidon", "jumper", "teenage_mutant_ninja_turtles", "pacific_rim_uprising", "the_old_guard", "into_the_storm", "priest", "king_arthur_legend_of_the_sword", "sanctum", "the_legend_of_hercules", "infinite", "suicide_squad", "gemini_man", "xxx_return_of_xander_cage", "jonah_hex"]}