{"id": 4543, "title": "In a Valley of Violence", "starring": ["Ethan Hawke", "John Travolta"], "runtime": 104, "genre": ["Western", "Action"], "description": "The story of a drifter named Paul who arrives in a small town seeking revenge on the thugs who murdered his friend. Sisters Mary Anne and Ellen, who run the town's hotel, help Paul in his quest for vengeance.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/j8XBfRFShrYzyp04NW9dSIL6Zm8.jpg", "categories": {"plot": 5.2, "acting": 4.636363636363637, "ending": 5.666666666666667, "soundtrack": 7.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.0, "action": 6.0}, "reviews": [{"rating": "2", "text": "Another shocking example of why directors should not be screen writers. They have no one to say \"That doesn't work\". Ti West's dialogue is cliched and laughable in this boring and predictable western. Although Hawke and Travolta did their best with the turgid material, how on earth do fools like James Ransone get these jobs? His acting was pitiful. A waste of time and money. This took $61k at the box office. I bet they asked for a refund."}, {"rating": "1", "text": "I had really high hopes for this, but through some badly performed amateur acting (not from the headliners, they were fine) mixed with some really horrible writing, I lost count of the number of times I rolled my eyes. Awful, do not pay a dime to see this."}, {"rating": "7", "text": "Nothing Special, Just an old fashioned Western with its cliches and trademarks from Leone and Corbucci. Also music sounds just like the themes from Ennio Morricone.\rYojimbo+Mad Max+ The Dollar trilogy+ Rambo: First Blood = In a Valley of Violence"}, {"rating": "0", "text": "We are given 30+ minutes to become enamoured with a wonderful dog as one of the lead characters. The dog is then shot, and while it lies whimpering in pain, a story character hovers over the doc with a large knife threatening it's owner, and then stabs it. UNACCEPTABLE. *NOT* 'entertainment'. Gross. Appalling."}, {"rating": "6", "text": "And the Academy Award for Good Dog goes to....JUMPY. If you watch that video of him on Youtube, you can see everything he does in this movie, but with his owner and years before this movie. It also has the added benefit of sparing you watch him be killed by a real **** Do not worry though, Ethan Hawke killed the **** out of that dude, which is the good news. Bad news though, the dog does die in the movie. Why must movies kill these good dogs? Apparently Jumpy's trainer is the same one that trained Uggie from The Artist, so you know that this dog knows what he is doing. Director Ti West respectfully takes a step back and allows the film to celebrate Jumpy's talents with him biting a priest, leading a horse, tucking himself into bed, and covering his eyes like a good dog are the true highlights of this film. No shame either: I skipped over the parts with Jumpy being written out of the film. I knew he was going to meet his demise and that Ethan Hawke would go brutalize the men that did it, so no need to watch Ti West drag that scene out far longer than needed (it is actually a few minutes long; Jumpy gets shot and then the really bad guy breaks out a knife after speaking to Hawke with Jumpy whimpering for like three minutes, so I skipped it at that point and realized I did not want to know what happened). Regardless, Jumpy is the real star of this film. Everything is just done to give him a platform to bigger and better productions, so for that, In a Valley of Violence is entirely worth it. Otherwise, it is just a solid film from Ti West.A spaghetti western throwback with the plot line of John Wick, it is clear that Ti West likes Sergio Leone. The score is very Morricone, but worse. The introductions and font type at the end are very Leone. The introduction of this stranger rolling into town is very Leone. Only problem: he has a name, which is Paul (Hawke). He also talks way too much. That said, West does a relatively decent job of bringing the same sort of style to the film in this relatively straight forward update of a spaghetti western. Infusing it with comedy and graphic violence, West puts his stamp on the proceedings enough to make it more than just a straight stylistic rip-off.As Abbie's (Jumpy) human, Ethan Hawke turns in a typically solid performance. He just goes around hanging out with Abbie and killing dudes who kill Abbie, so he does not do much here, but the guy sure can kill people. In all seriousness, Hawke is a very good everyman actor and this really shines through here as we quickly relate to his problems and past as a cliched Indian killer in Oklahoma or Kansas for the military. He has regrets and does not want to kill anymore like every other western protagonist, but by God, you cannot kill a man's dog and expect to continue breathing. I know if anybody touched my dog, I'd rip their throat out and make them swallow it. Now, that may go poorly since they would no longer have a throat, but the imagery is quite powerful I'd say.Other than Hawke, John Travolta is fine and leads the way for the rest of the cast. He plays the Marshal who is the father of a stupid son who, along with the other deputies, killed Abbie. Travolta's Marshal tried to get them to leave Paul alone, but could not. He is a decent man who may have risen to power in the town of Denton by force, but is hardly an evil man. His son, however, is real trash. Watching him get the **** beat out of him with a boot was oddly satisfying. James Ransone overacts as the despicable Gilly a bit, but he is still solid. As the only other characters with any semblance of lines, Taissa Farmiga and Karen Gillan are really bad. Either their dialogue was awful, which it was, or they were just bad, but their confused delivery of lines seem to indicate it is little bit of column A and a bit of column B. Regardless, their characters were bad and they were bad in the roles.Largely a cliche and run-of-the-mill western, Ti West has some fun, but never wows here. The film definitely thrills and entertains though, but it is ultimately a film that is largely just an above average nostalgia film. West clearly has some good instincts with the genre though so I would love to see him try to be less derivative next time he works in the genre, if he does. He is a guy that critics seem to like, but audiences hate and I have no idea why. His films, from what I have seen, are largely quite palatable and straight forward. This is just a genre film that is pretty harmless, yet some viewers seem to think it is absolute garbage. It is a well made, largely well acted, and thoroughly entertaining western. It is slow, yes, but all westerns are slow. Did y'all pop this in and expect Fast and Furious or something?"}, {"rating": "6", "text": "In the old west, it's always about the revenge!Believe it or not, this is the western version of 'John Wick'. Same storyline except it takes place in the desert of the old west. A man who had enough killing native Americans, is now abandoned everything and heading towards Mexico for a fresh start. But on a way in a small town, he gets into a trouble. After surviving the assault, he goes back to hunt them all and like most of the western film, the end is predictable.This is not a bad flick, but it was not fresh enough, either its story or the gun fights. With a bunch of decent actors, a decently made film. The characters were limited, the atmosphere was like deserted. So the overall narration was focused on a few characters in its entire 100 minute run. I felt sorry for Travolta, they did not get anything out of him, he just had a presence and nothing else. In other hand Ethan was okay, but his role was designed as an average man in the old west, not a powerful one as we expect in this type of film.The title says it all, but it was not that ruthless as compared to the most of the similar western films I have seen. Mostly it will bring a disappointment for its viewers, but definitely a few would enjoy it for its simpleness. For me, it was an average, but thought it could have been better, particularly in the gun battle. So it's nothing more than just once watchable with a low expectation.6/10"}, {"rating": "9", "text": "I disagree with those that say it is cliche.It is low-key style-wise, simple, and same for the acting, but it works and I didn't guess the ending.Kind of a nice little romance built in and I liked the female lead -- sweet and kind of plain, but in an attractive way.  Ethan Hawke has grown on me in recent years, he was kind of over the top and annoying in his youth, but not now; this Western role fits him pretty well, a reluctant hero.So few Westerns these days (at least without Aliens!) --  grading on the curve this is an 8 or 9."}, {"rating": "8", "text": "Really good movie in my opinion, gritty and had everything that I expected from a western. I enjoyed the acting and everything and it had some funny moments too, don't know how anyone can dislike it."}, {"rating": "7", "text": "I suppose \"entry level\" is a term you could use in describing this one. All the western boxes are ticked. Drifter protagonist? Check. Dusty desert town with crooked law enforcement? Check. Saloons, jailhouses & general stores? That's three checks, right there. You can even check off the \"snake oil salesman\" box for this flick as well. So, what honestly moved the needle for me when it came to \"In A Valley Of Violence?\" Well, it's a spoiler that I won't get into, but I'll say it's a narrative enhancement maneuver that a very recent and very profitable film franchise has basically trademarked. It's essentially the \"ol' reliable\" of making the audience's investment in your story spike almost exponentially. And, yes, as soon as \"it\" happened, I was right there, ready for what the rest of the movie was most likely going to give me. Blood, vengeance and a lot of snarling Ethan Hawke. What can I say? It's simple, satisfying fun."}, {"rating": "5", "text": "A Love Letter Burned To Ashes.In A Valley Of ViolenceWest believes on doing a good job, no matter how B grade the work is. This Sergio Leone-isc style of his, practically whispers his love for the western genre. Call it a sincere homage or an open love letter to those Eastwood films, it locks and loads gun like they used to in the old days. The sharp sound effects that amplifies every step or a knock on the wood or an echo of a fired bullet or a horse ridden in a hot dry land, every aspect of it defines the genre it claims to be, along with the opening title and the eerie zoom-in of the camera.The John Wick of the western world is the plot and surprisingly the style matches the background score it has got, with a competitive nature that each character is brimmed off, the hot-head world isn't balance at all, but then it sort of is the premise of this valley. And cloaking on this John Wick suit, is Ethan Hawke in Ti West's evidently and meant to be unoriginal film. Hawke enrages you with his cold looks coming from warm escapist familiar eyes where he is told to carry on the film with nothing but power and anger, not his forte to be honest, but this theater artist never disappoints.If Hawke is left alone on the screen, John Travolta on the receiving end is dependent to someone else. He is always sharing the screen, the references he makes while justifying the deeds, even the plans he makes in attempt to kill Hawke. Personally, I feel connected with the most cinematic and practical character of all, Taissa Farmiga who leans in towards Hawke as part of an obligation that shines a complete honest light on her trajectory and how she must have survived In A Valley Of Violence."}, {"rating": "6", "text": "It’s a solid modern-western, revenge shoot ‘em up. It knows what it is and doesn’t try to be more. The only thing questionable is the casting; Karen Gillan and James Ransone seem so out of place and have to wonder if they did single takes because they’re so bad."}], "recommendations": ["the_salvation", "jonah_hex", "jane_got_a_gun", "payback", "the_last_stand", "the_magnificent_seven", "prisoners_of_the_ghostland", "cold_pursuit", "white_house_down", "gangster_squad", "savages", "the_punisher", "live_by_night", "public_enemies", "free_fire", "machete", "those_who_wish_me_dead", "machete_kills", "from_paris_with_love", "taken", "the_crazies", "the_november_man", "the_equalizer", "the_mechanic", "mile_22"]}