{"id": 4871, "title": "In Fabric", "starring": ["Marianne Jean-Baptiste", "Sidse Babett Knudsen"], "runtime": 118, "genre": ["Horror", "Fantasy", "Comedy", "Mystery"], "description": "A haunting ghost story set against the backdrop of a busy winter sales period in a department store, following the life of a cursed dress as it passes from person to person, with devastating consequences.", "releaseYear": "2018", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/puGJX5Ko9KUMWM5cGqPZ5nyxa8c.jpg", "categories": {"plot": 6.181818181818182, "acting": 6.0, "ending": 5.0, "soundtrack": 7.0, "cinematography": 7.0, "familyFriendly": 7.0, "funny": 7.0, "action": 5.0}, "reviews": [{"rating": "6", "text": "\"In Fabric\" is inaccessible in a lot of ways. I have respect for Peter Strickland and he has proven  previously that he is a visual and talented filmmaker, but this film never attracts you whether in story or characters and the way the story is executed never really makes you interested to follow and grabs you. it is also one of the only films with fully uncharismatic cast."}, {"rating": "7", "text": "Very strange, very stylish, very funny, but not for everyoneIn Fabric is easily the most impenetrable work in writer/director Peter Strickland oeuvre thus far. With his usual commitment to the more tactile elements of the medium, he is here concerned with mocking consumerism, particularly the pernicious lure of \"the bargain\". In Fabric's biggest problem, however, is that it's made up off two loosely-connected storylines, but because the first one is so much more interesting, it leads to some narrative slackness in the second half, and all in all, it's not a patch on his best work to date, The Duke of Burgundy (2014).Set in a London suburb at an unspecified point in the 1980s, the film tells the story of bank teller Sheila Woolchapel (Marianne Jean-Baptiste, playing the role as if she's in a piece of 1960s social realist cinema). A recently-divorced mother to a teenage son, Vince (Jaygann Ayeh), whose girlfriend Gwen (Gwendoline Christie having an absolute blast) seems to have moved in without asking, Sheila visits a Dentley & Soper department store looking to buy something nice in the January sales. All but accosted by sales assistant Miss Luckmoore (Strickland regular Fatma Mohamed), she is talked into buying an \"artery red\" dress. However, it doesn't take long for Sheila to realise that something is not entirely kosher about the garment - from prompting dog attacks to trashing her washing machine to floating above her bed.In Fabric is a consumerist satire, along the lines of Dawn of the Dead (1978). The malignant control that capitalism exerts on the masses, the commodification of desire, the exploitation and manipulation of notions of self-worth - all are interwoven into the film's style and texture. With the highly-stylised aesthetic commenting on the ultimate emptiness of retail therapy, Strickland leans into the artificiality of the film's milieu, making no attempt to construct a believable, lived-in world.With that in mind, although this is not an especially realistic film, it is an absolutely gorgeous film. Reproducing the hyper-stylised look of classic giallos, Strickland and cinematographer Ari Wegner bath the film in a lurid colour palette of over-the-top reds, purples, and greens. The other-worldly vibe is helped immensely by Cavern Of Anti-Matter's synth score full of harsh electronic screams and repetitive droning, and the queasy, disorientating sound design by Martin Pavey. Filling the soundtrack with non-diegetic whispering and incantations, the aural design keeps the viewer constantly on edge, as if the evil in the dress has somehow infected the magnetic track.One of the film's most successful elements, and one of the reasons it's so funny, is how ultra-seriously everyone takes it, with the cast acting as if they're in a Ken Loach film, whilst Strickland approaches the whole endeavour with a similar reverence - there's no winking at the audience, and it's the absence of such winking that makes it all so funny. The film's humour is rooted firmly in the fact that no one acts like they're in a comedy (just look at the conversation about the difference between \"looking for staff\" and \"trying to find staff\"). The scenes of the dress crawling around Sheila's house are especially funny partly because they look so ridiculous, yet Strickland treats them with complete sincerity. A film about an evil dress shouldn't work on any level except parody, yet it's precisely because the film doesn't seem parodic that it works so well.In terms of problems, by the very nature of what he's trying to accomplish, Strickland is somewhat guilty of allowing the film's sensual elements to overwhelm the characters. Certainly, the film burrows under your skin and lodges there, and Strickland has absolute mastery of the tone, but aside from Luckmoore, none of the characters really linger because none are especially interesting as people. From an emotional point of view, there just isn't a huge amount of empathy or pathos. Also, because the Sheila plot is so much more interesting that the Reg plot, the film seems front-loaded, which is never good. And although it didn't bother me, some people will dislike the amount of loose ends, unexplained background, and narrative dead ends, especially in the last act.Nevertheless, I enjoyed In Fabric. Yet more evidence that Strickland is a master stylist, the craft behind the film is simply beyond reproach. Feeling for all the world like a rediscovered giallo, lost for the last four decades and restored to its original glory (complete with very questionable dubbing), it's cryptic and impenetrable, but so too is it hilarious and a feast for the senses. No one makes films quite like Strickland, where the existential and esoteric rub shoulders with the tactile and the sensual, where the textures of the milieu leap off the screen right alongside the themes. Hypnotic, seductive, and enjoyable, In Fabric is unlike anything you'll see all year."}, {"rating": "3", "text": "the movie  was emotional my friend cried when she saw this movie I would not recommend this movie at all it wasn't that good as well"}, {"rating": "3", "text": "To say this is an odd movie is an understatement. To say its bizarre is to give it far too much credit. Failed attempt at a horror movie making a statement on..... fill in the blank."}, {"rating": "4", "text": "Es una película muy extraña, tiene una estética increíblemente fina, retro y onírica, pero el argumento es demasiado errático e inverosímil para tomarse en serio, la primera parte estuvo bastante bien, pero la segunda parte es ridícula y anticlimática."}, {"rating": "7", "text": "Peter Strickland has developed a unique and hypnotic style that makes all his films so irresistible. 'In Fabric' may very well be his strangest film to date, but it's almost ridiculous concept could've only executed by him. The evil dress story puts the movie on a b-series level, but the allure of it all is undeniable. With a commentary about consumerism, the director delivers his most critical movie; sadly, the decision to split the plot into two halves, the second one being kind of dull, prevents 'In Fabric\" from being excellent."}, {"rating": "1", "text": "Godawul. Boring. Calls itself artsy, but drags on for **** ever without any release."}, {"rating": "0", "text": "Pésima película, absurda, pretenciosa, utiliza imágenes bizarras de manera innecesaria, no suman en lo absoluto en generar atmosfera o en contribuir en la trama.Realmente una pérdida absoluta de tiempo, el director me debe 1 hora  de vida, que es todo lo que pude soportar."}, {"rating": "1", "text": "I found it rather confusing, lacking consistency. I was expecting a better plot and I didn't get  interested in any of its characters. I definitely don't recommend watching this movie."}, {"rating": "2", "text": "Felt very long like it should have been a 20 minute youtube video not a fully movie. Honestly was so boring it made me want to sleep."}], "recommendations": ["the_green_knight", "the_killing_of_a_sacred_deer", "you_were_never_really_here", "the_brothers_grimm", "blade_runner_2049", "amulet", "us", "the_ballad_of_buster_scruggs", "ex_machina", "the_favourite", "color_out_of_space", "the_neon_demon", "nocturnal_animals", "terminal", "trance", "bone_tomahawk", "the_grand_budapest_hotel", "eyes_wide_shut", "the_french_dispatch", "titane", "sicario_day_of_the_soldado", "the_nutcracker_and_the_four_realms", "hugo", "the_fly", "the_rover"]}