{
  "id": 156,
  "title": "In the Name of the Father",
  "starring": [
    "Daniel Day-Lewis",
    "Pete Postlethwaite"
  ],
  "runtime": 133,
  "genre": [
    "Drama"
  ],
  "description": "A small time thief from Belfast, Gerry Conlon, is falsely implicated in the IRA bombing of a pub that kills several people while he is in London. He and his four friends are coerced by British police into confessing their guilt. Gerry's father and other relatives in London are also implicated in the crime. He spends fifteen years in prison with his father trying to prove his innocence.",
  "releaseYear": "1993",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5HaQacOMOjA2wX1XnwnDd2VaXCf.jpg",
  "categories": {
    "plot": 7.8,
    "acting": 8.166666666666666,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Eminently watchable, with great performances and full of righteous anger. It suffers from some of the problems that many historical pictures tend to; namely a lack of focus and coherence in service of plot elements that leads to not always understanding the significance of certain scenes and character actions (especially the years in prison with Gerry teaming up with and then turning on an actual IRA terrorist). But this is minor, really, in the grand scheme of its storytelling prowess."
    },
    {
      "rating": "10",
      "text": "Daniel Day-Lewis , Emma Thompson and Jim Sheridan were really fantastic in this important film...I can see this film every week.......thanks to the producer."
    },
    {
      "rating": "10",
      "text": "What is there not to love about this movie? Powerful, profound, touching,and beautifully scripted, you can't miss it! Experience yourself the beauty of this masterpiece! I love it so much!  I own the dvd!"
    },
    {
      "rating": "8",
      "text": "Really good film. The shocking true story of Gerry Conlon and his friends is presented with shocking beauty and power with fabolous acting from the entire cast, especially Daniel Day-Lewis, Emma Thompson, and Pete Postelthwaite. Really well done all around."
    },
    {
      "rating": "8",
      "text": "In The Name of the Father is a harrowing tale that shows how corrupt government officials can pin any crime on pretty much any person, but eventually will pay the price. Daniel Day-Lewis and Pete Postlethwaite's survival are the central story with many sub-plots that eventually come together to create a cohesive whole of a film."
    },
    {
      "rating": "10",
      "text": "Harrowing and Devastating picture about the truth.Daniel Day Lewis leads an awesome cast and Jim Sheridan's work is nothing short of spectacular.One to remember."
    },
    {
      "rating": "9",
      "text": "just a brilliant biographical movie with superb performances from almost Daniel Day-Lewis , Emma Thompson etc. One of Jim Sheridan's best movie.   Remarkable"
    },
    {
      "rating": "7",
      "text": "hold my hand..In The Name Of The FatherIt's strength is of course a great cast especially Daniel Day Lewis who puts his heart into it and it was worth it since the movie offers some chilling moment and definitely has a gripping plot but it falls into bits and pieces once in a while."
    },
    {
      "rating": "9",
      "text": "One of the best movies about NI and Belfast and they killed my DAAAAAAAAAA."
    },
    {
      "rating": "8",
      "text": "From the hollow, perfunctory, ill-paced and overlong first act, that its only remarkable merit is giving us a glimpse of Gerry Conlon's frivolity and rebelliousness (well, plus one of the best opening sequences ever), to the not-so-convincing sense of time in prison, this otherwise heart-wrenching biopic is definitely not without its flaws. However, I can't recall that I have seen a troubled father-son relationship (brought to life by astonishing performances from Daniel Day-Lewis and Pete Postlethwaite) has been better depicted than in this. Just look at how the experience of imprisonment somehow matured Gerry up, whether by getting to know his father more and better (the dialogue between Gerry and Giuseppe is just phenomenal), or merely due to the incidents and mishaps that he had in prison. Not to mention the painful and provocative meticulous dramatization of a miscarriage of injustice, vividly portrayed by some of the most sensible, artistic, emotionally-charged scenery that Jim Sheridan's nuanced direction are responsible of. Happy Birthday to the greatest actor ever, Daniel Day-Lewis. I do miss him!(8/10)"
    },
    {
      "rating": "10",
      "text": "Amazing movie. Daniel Day Lewis is spectacular as expected. But the real star of the show was Pete Postlethwaite."
    }
  ]
}