{
  "id": 3033,
  "title": "In the Heights",
  "starring": [
    "Anthony Ramos",
    "Corey Hawkins"
  ],
  "runtime": 143,
  "genre": [
    "Drama",
    "Music",
    "Romance"
  ],
  "description": "The story of Usnavi, a bodega owner who has mixed feelings about closing his store and retiring to the Dominican Republic or staying in Washington Heights.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/RO4KoJyoQMQzh9z76d4v4FJMmJ.jpg",
  "categories": {
    "plot": 7.478260869565218,
    "acting": 7.137931034482759,
    "ending": 6.75,
    "soundtrack": 7.684210526315789,
    "cinematography": 6.714285714285714,
    "familyFriendly": 6.0,
    "funny": 6.0,
    "action": 7.25
  },
  "reviews": [
    {
      "rating": "10",
      "text": "An Outstanding Movie!This is a movie the whole family can come and see.It is about the Struggles of life, But the hope that burns within."
    },
    {
      "rating": "2",
      "text": "Some pretty cinematography, and some good choreography. The actors are amazing and gave it all they got. But this is just a bad movie, y'all.  No plot! Mad, mad stereotypes! Especially of women. It got boring before the halfway point. And after that? Nothing happened. Also, this may sound weird, but there was a major issue that killed any good choreography that was in there: Too many dancers. The camera had to go whoosh past like 900 people every two seconds. We lost track of our main characters, and we didn't get to really check out any of the cool choreography that was going on. It all flew past before you could be like \"That was coo- oh. It's over.\"  And here's what's really bad:So much lame After School Special stereotyping of Latin people. Real Talk, this felt like a bunch of white kids from Harvard wrote a musical about the Barrio. Also Real Talk: anyone who was all upset about a lack of Black representation in this movie is tripping on acid. There were Black main characters, Black side characters, Black dancers. Tranquilo, todo el mundo.This was just a bad movie. No way around it, y'all. No story. They said the neighborhood was disappearing. Wha? With a million people dancing in the streets, and a million more in the clubs and parties? Also, did the main characters really \"save\" the neighborhood at the end? It really didn't feel like it. One character helped another, that was sweet. But it didn't feel like there was any problems to solve. I don't get what this was about.  And yo, who cares about the blackout?? Why was that even a thing? This ain't even a movie, mis amiguitos. Hate to say it. I had high hopes, but please be real. Don't be like the Critics. Don't give this movie props for checking boxes. Or not checking them. Look at it for what it is. Weak stereotypes in a blender, with no shape and no sense of purpose."
    },
    {
      "rating": "6",
      "text": "Talking about musicals in film is kinda difficult because when they're transformed into films, they're allowed to be explored in a very different way than how they manage to do it in the theater.In some cases this usually works because the production is brought to life in another way that is simply impossible to do on stage.The numbers can be more ambitious, more complex.Visual effects and special effects can be included.We can get different perspectives from the performers that are otherwise limited in theaterIn The Heights knows that, and uses it to its advantage, but it also has the enormous disadvantage that what feels natural in the play, in the film becomes an extremely simplistic and repetitive narrative device.What do I mean by this? I'm talking about the musical numbers.In the play each performance represents a process, beginning and end, but when you're following a narrative in a film, the fact that the characters speak for 3 or 4 minutes and then start singing and dancing, it feels unbalanced. It takes you out of flow in a very rough way.I cannot deny that there is a lot of talent in what is seen on screen, especially effort, and the film looks very good.The execution of both, the dance numbers, and the performers, is really good.The message of inclusion is more than vital and contemporary in the Latino community, but if you really analyze the film, it's 143 minutes that yes, they can be colorful and fun, but they're also a bit hollow.The music is good, and it can be very impressive to many in the audience, but for me, I gotta be honest, I didn't take anything of the experience with me after it ended.You feel neither different nor more enlightened from what you saw at the beginning with what you saw at the end.As I said, the experience can be very entertaining, and that's valid, but at least I need more so that I can say: \"This was great, this was memorable.\"It's appreciated that it provides a conspicuous setting to demonstrate this diversity, but ultimately it does nothing to be a better movie.And I know you could argue that it's not about that, but about having a good time, having fun, and I can understand that aspect.And I applaud what this movie does very well. The funny and remarkable moments, but I also emphasize what it doesn't achieve, and that is that beyond the idea, the promise and the dream, In The Heights doesn't provide something that will make it a musical worth remembering. At least for the long haul."
    },
    {
      "rating": "10",
      "text": "A rare musical of family and dreams, It’s all about community and neighborhood. I really loved it!"
    },
    {
      "rating": "6",
      "text": "Good but not enough, algunas actuaciones no son buenas. De momentos aburrida"
    },
    {
      "rating": "3",
      "text": "My family really enjoyed Hamilton, having seen the play multiple times as well as the Disney airing of the production they filmed. So, we were really looking forward to this as well.I have no idea why the critics aren't being honest about what a bloated mess this movie is.  It's WAY TOO LONG (even after they shaved like 25 more minutes before sending it out). The singing is overall not great and often more sing-talking than actual singing. When the grandma has the best number in the movie with the best singing (it's REALLY GOOD), there's a problem since she's a pretty small part overall. The storylines are of the \"very special movie of the week\" type and are resolved in unsatisfying and unrealistic ways - or not resolved at all. And we have to talk about how UNNECESSSARY Lin Manuel's shaved ice character is in the movie. He SUCKS and KEEPS SHOWING UP, offering nothing to move the story along. And then the final insult- he's in an extended after credits sequence that was overplayed and unfunny. Yeah, it was with a Hamilton actor, but who cares? At least give the audience something good in the process. It was just another ego scene in a movie that didn't need ANY of them.I know Jon Chu can direct a great movie - Crazy Rich Asians was WAY more enjoyable than this. So, I don't know what went wrong, but it's DEFINITELY wrong.Like I said, we saw Hamilton multiple times, both live and on film, but I have zero desire to watch any part of In the Heights again. That should tell you everything you need to know."
    },
    {
      "rating": "5",
      "text": "It’s colorful and fun, but just a bit too long (I get it’s based on a play but some of the scenes/songs could’ve definitely been cut out)"
    },
    {
      "rating": "1",
      "text": "They missed by being so politically correct they forgot who lives there. West Side Story redux."
    },
    {
      "rating": "3",
      "text": "I had no expectations when I went to see this movie.  Only knew that it was a musical and expected to really enjoy it.  Wrong!  I had no idea that the “music” was mostly rap and that there would be no catchy melodies to remember.  For me and my companion, sitting through the first hour was torture.  Hardly any plot, no wonderful music to enjoy, no feeling of wanting to dance in the aisles.  Very, very disappointing!  We left at that point.  Totally not my cup of tea!"
    },
    {
      "rating": "7",
      "text": "The movie is based on the autobiographical musical by “Hamilton” creator Lin-Manuel Miranda. It revolves around people who live and work in a Hispanic immigrant neighborhood in New York’s Washington Heights, celebrating the culture in an explosion of color and exuberance. Each of the primary characters gets their moment to sing about their challenges and wishes and some of them come together in romantic relationships. On top of this is the ebullient spirit of the community that’s captured in the genuinely zealous performances, the frenetic dancing and the snappy editing. The songs, which blend hip hop and Latin influences, aren’t especially memorable, but director John M. Chu’s staging brings a creative energy. While the downsides of the immigrant experience are mentioned, it’s the effusive essence of celebration that makes this film so appealing. NOTE: Sit thru the credits for one final solo/punchline from Mr. Miranda."
    },
    {
      "rating": "5",
      "text": "Amazing cast… Orgullo Latino…Just makes you wanna dance and remind you what was like to leave in the Barrió."
    },
    {
      "rating": "8",
      "text": "The actors are superb and bring to life all the main characters. The music is solid. The production is amazing for a musical. The themes of the movie are a tad repetitive. Each character feels like they have the same goal. Which could make the movie feel like it's dragging during the third act. Overall enjoyable and a fun time."
    },
    {
      "rating": "6",
      "text": "An alright film, consisting of well-shot scenes and decent choreography. A definite step-up from Hamilton, comparing the pacing and plot. The atmosphere of the setting and shots however feel like a constant Coca-Cola ad - take that as you will. The music is most definitely its most shining feature as you should expect for a musical. Overall, not a terrible experience but not a movie I would be coming back to watch again."
    },
    {
      "rating": "9",
      "text": "Capturing theatre and fitting much of its dynamics into a film is no easy task. It probably explains why I had my fears from the day this film was announced. Yet for some reason, this films swiftly handles the task at hand, they know cinemas limitations and clearly understand that things can't simply be lifted from one medium to the next. In the Heights is a delight to watch, the storytelling, even when it's not completely alligned with the source material, it tries to entertain while addressing issues dear to a Latino or African staying in the diaspora at the moment. This is whether one is legal or not, then the musical numbers and an amazing job by the little known cast. So, is it worth it? I am Ugandan in a second pandemic lockdown, this film becameall the sanity I needed. It's a feel good film that will make you say wow a couple of times, if it's not for the music, it maybe for an expression by a character."
    },
    {
      "rating": "8",
      "text": "Based off of Lin-Manuel Miranda's Broadway hit of the same name, this film follows various people throughout Washington Heights chasing and striving to achieve their dreams of fame, fortune, success, etc. And it's just as dazzling and colorful as one could hope for! I can't even single out any cast members in this, cause everybody killed it and had a chance to shine in their own right! The story does feel like it follows a few too familiar tropes and beats at times, but is made up for through the sheer spirit and joy in every scene and actor present. Overall, this is a certain crowd-pleaser, even if there are a handful of predictable moments, but this film is too much fun for that to matter"
    },
    {
      "rating": "10",
      "text": "A rare musical of friends, family and dreams! It’s all about community and neighborhood. I loved  it!"
    },
    {
      "rating": "3",
      "text": "There is no denying that Lin-Manuel Miranda can write a good song and I really wanted to stick with this movie for that very reason.Unfortunately, only some Spanish dialog is subtitled and, as far as I got before turning this off, none of the Spanish in the songs.I found my high school level Spanish classes were insufficient to the task.  Unless you are fully bilingual or don't care that you're missing out, just skip it.Also, I dinged one point for some unnecessary political garbage.Another Miranda musical with an over-inflated rating."
    },
    {
      "rating": "5",
      "text": "It was ok. I don’t really like spanish music or speak it so it is what it is. A lot of the actors singing was great, and the cinematography was too, just some people with some weird faces and mediocre acting chops."
    },
    {
      "rating": "10",
      "text": "I love the reiteration of In The Heights that recreated the whole experience from the musical to movie, the every little detail has blasted me from act 1 to 2."
    },
    {
      "rating": "10",
      "text": "There is nothing better than 2 hours and 22 minutes of In The Heights, it's fun, groovy, and extraordinary, with a fascinating color, cinematography, great music, and incredible performance, In The Heights is simply one of the best films of the year, i highly recommended."
    },
    {
      "rating": "10",
      "text": "I’m not really a big fan of musicals or even Latin music but I love how upbeat, positive & authentic this film is! Now I just wish Lin Manuel Miranda would write a movie about 80’s retro music & we’ll be set!"
    },
    {
      "rating": "8",
      "text": "Streamers, it's finally here! In the Heights has been released this weekend simultaneously in theaters and on HBO Max after being delayed an entire year due to the pandemic. I'm sure for fans of the Tony-winning Broadway production they have been waiting even longer than just this year delay. With this vibrant and energetic musical coming to the big screen, it's just another sign of America gradually emerging from the pandemic and the summer movie season in full swing. I braved the theater to get the \"heights\" of In the Heights, and here's how it went.As I mentioned, In the Heights is an adaptation of the Broadway musical from Lin-Manuel Miranda with the screenplay written by Quiara Alegria Hudes and directed by John M. Chu. The elements come together with eye-catching visuals, fierce choreography and heartfelt songs to tell the story of Washington Heights and the people there who are striving to achieve their dreams. Our main character and narrator is Usnavi, who owns the bodega, but he is saving to move back home to the Dominican Republic. Usnavi introduces us to the rest of the main ensemble, which includes Vanessa, an aspiring fashion designer trying to move downtown; Nina, the brilliant student who left to attend Stanford; Benny, Nina's love interest and dispatcher at Nina's father's business; Mr. Rosario, Nina's father who will do anything for Nina to succeed; and Abuela Claudia, the heart and soul of the community. Their stories weave in and out infused with music and hope telling a quintessential story about community, growth and the price of chasing dreams.If you are a fan of musicals, you will be swept away by In the Heights. The filmmakers have done a remarkable job translating this stage musical into a movie spectacle. Everything is big - group dance numbers, swooping shots of Washington Heights, bright, enticing colors and infectious music. Casting Anthony Ramos as Usnavi was the best thing for this movie. He's a grounding presence and such a talented guy. Ramos has got that Lin-Manuel cadence down pluses he's cool and charming and can move. He captures the emotion of his character and connects to the others in the ensemble very well. I'll also single out Olga Merediz, who is the emotional center. She is so wonderful as Abuela Claudia. She really embodies the warmth attributed to her character, and it is so believable that the entire block sees her as their abuela. She has a moving musical number as well. Ramos and Merediz are just two of the cast that are great, but all of the performances are top notch and each character has a moment to shine.What's really great about In the Heights is that it truly is a feel-good movie. There is no unnecessary villain, and even though some of the story tends towards some clichés, it is always engaging. There are some really great set pieces with a lot of dancers and great, propulsive music - each one is like a big shot of adrenaline. The film does a lot to keep your attention and movie the story along to a satisfying conclusion. However, it must be said that 2 hours and 18 minutes is a long runtime. It could have been 20 or so minutes shorter and still told the same wonderful and vibrant story, but I didn't mind spending this time in Washington Heights with Usnavi, Abuela Claudia, Vanessa, Benny, Nina and the rest.For me, In the Heights is a must see film, especially for musical fans. There's a great cast giving wonderful performances. The music is infectious and the visuals are vibrant. While the film is too long, it never bores and has a really heartfelt and beautiful message. Grab that big box of popcorn and don't miss this movie - at the theaters or on HBO Max, whichever you prefer.S2S: I agree with Trip wholly. As a New York resident and public defender of the Bronx, this is absolutely a lovely story about our people. This is also a story that needs to be explained across the country. We have Americans all across this country from different backgrounds that are just coming to live a great life. Let their stories be heard and give them a chance to thrive. Let's keep the neighborhoods alive and with the spirit they've cultivated for decades. Never forget the past and never stop trying to bring about a better future. My only qualm with this movie is it feels a bit too Hamilton/Lin-Manuel-ish at times. He's brilliant, and Quiara Hudes has brilliantly distilled the stage musical into this movie. Can't wait for more from both with an even more unique voice. Musicals aren't everyone's jam but for those of you that are afraid of the singing and dancing, I must admit you'll still be touched by the storytelling and visual display in this movie. You might not rush to it, but if you have time and HBO Max you'll be entertained with a bowl of popcorn."
    },
    {
      "rating": "10",
      "text": "This movie goes hard and i am here for it. GOOD TIME GOOD MUSIC AND GREAT MOVIE. Start your summer right with in the heights"
    },
    {
      "rating": "10",
      "text": "Amazing direction, story, choreography, and a joyous ensemble cast stacked with stars waiting to breakout. When history looks back on “In the Heights,” it will be remembered as one of the greats."
    },
    {
      "rating": "9",
      "text": "A phenomenal mixing of great musical score, excellent adaptation, and wonderful cast and performances sets In The Heights as the summer blockbuster it is meant to be."
    },
    {
      "rating": "9",
      "text": "This is a movie I have waited for so long for, and I was not disappointed. Ramos killed his role, the music was just as good as broadway. I am about to watch it a 3rd time. You should too."
    },
    {
      "rating": "0",
      "text": "This is such a main stream media / propaganda brigade. This was a horrible movie. I cant imagine anyone actually enjoying this. If you claim to like it, tell everyone why you liked it. And saying its \"stunning and brave\" doesnt count."
    },
    {
      "rating": "10",
      "text": "A brilliant and heartwarming musical, definitely a must watch for anyone who liked Hamilton."
    },
    {
      "rating": "8",
      "text": "Actually, I'm not typical drama musical guy, but since La La Land, I'm trynna liked this kind of genre.In the Heights not just telling you about Usnavi's life, but all story surrounding Washington Heights community, the culture, the diversity, and mostly their DREAMS. Everything wrapped perfectly with Latino Spanish hip hop musical numbers and energetic dance choreography, made this movie look alive and colorful.Also, the cinematography and visual look great and eye-catching. You can feel the summer vibe party here. The production design also good, nice set. The editing and camera movement was amazing too. I love the part when Nina and Benny were dancing up and down over the building walls. Wow!Even though, we'll enjoying the vibrant of song and dance, the storyline is the weakness. Of course its talked about culture, diversity, and community issues. I just don't know why, but at some point, the story toward the end about family, friends, dream things is 'a bit' cliche to me personally. Also technically, the duration is overly long. I guess 2 hours is much better, the story drags a bit in the middle. However, its still great storytelling, and this weaknes is just minor flaws. And one more, personally, I'm not really suck in to the music, its not memorable enough. I loved the first music 'Washington Heights'.Overall In the Heights is a joyful drama musical with bright visual, uplifting music, and energetic dance, indeed, its not perfect, the story is 'a bit' cliche, duration overly long, but still entertaining and so much fun. And maybe one of the best drama musical this year. I loved it!"
    },
    {
      "rating": "9",
      "text": "In the Heights accomplishes to fuse 5 compelling storylines in a musical full of rythm and passion."
    },
    {
      "rating": "10",
      "text": "Loved this movie the music is fantastic, the acting is on point! I can't wait to watch it again. I'm listening to the soundtrack at work trying not to dance. Lin Manuel does it again!"
    },
    {
      "rating": "6",
      "text": "IT IS TOO LONG!Listen, it is really well done. The music is good, the story mostly nice. But they could have cut each musical number by 25% and lost nothing. I was looking at my watch and at one point it was 9:45, I looked again and it was 9:41. When my date and I got up at the credits, the usher came over and said, “you’re going to want to stay and wait for an extra scene at the end.” I looked that man in the eye and said, “I can assure you, sir, that is not what we want.”"
    },
    {
      "rating": "9",
      "text": "Terrific ensemble acting, directing, dancing, camerawork--DOOMED to generate little word of mouth.  I read all the review excerpts on Metacritic. Couple things mossing.   This is story about 2nd generation immigrants, written by a first generation immigrant (Miranda).  ??? audiences now are primarily 3rd and fourth generation immigrants.  This film is 30 years too late!  If released in 1990, I think it would have soared  like Star Wars.  As Tim Cogshell noted, In the Heights is of the same period as the musical Rent (1996).  The 2021 audiences I saw it with seemed more mystified than engaged by the mismatch of generations.   Also missing, thematically this is a movie about giving up your unrealistic fantasies, surrendering to your ordinariness, committing to be ordinary--and having this work out with grace and ease.  This is what happens for both couples.  Give a shout out to the 400 dancers (per the credits), some mad directing and occasional mad, rule-braking camerawork.Also missing from reviews is this:  If you liked any of the Step Up dance films, this is more and better.  If you did not like Step Up, you may be cool on this too if the characters don't grab you.  They grabbed me like they did in Fame.  I felt it was sufficiently racially diverse.  It's primarily about LatinX people, not about African-american experiences.  Perhaps complainers wanted more gay and LGBT figures which may be how Washington Heights is in 2021. Excerpts from the Metacritic reviews I agreed with: - a work of affection for both its subject and its medium.teh casual centering of so many marginalized voices makes the movie feel, in its own way, revolutionary: a Technicolor marvel as heady as Old Hollywood, and as modern as this moment. Read full reviewpulls off the impossible as it accurately represents the Dominican, Cuban, Puerto Rican, and many other Latin diasporas in the United States. Read full reviewa musical that doesn’t shy away from tackling issues of racism and immigration, viewers will find themselves immersed in a song-filled, universally relatable story about chasing dreams and building community.The cast all give deeply felt, deeply fun performances, with Ramos, Merediz, and Barrera as standouts. In the Heights is a celebration of a rich culture and a group of dreamers, who are messy and full of contradictions, but whose emotions always ring true. this is a pretty quaint image of street life, whose unrealities probably worked better on stage."
    },
    {
      "rating": "9",
      "text": "perfect[ adjective, noun pur-fikt; verb per-fekt ]adjectiveconforming absolutely to the description or definition of an ideal type:a perfect sphere;a perfect gentleman."
    },
    {
      "rating": "0",
      "text": "This movie lacked diversity and I’m really disappointed I didn’t get to see Afro Latinx community on this movie"
    },
    {
      "rating": "1",
      "text": "¿Es acaso esto un musical sobre latinos? La música no sé, no representa. ¿Esto no está lleno de estereotipos? Los personajes no representan ¿Por qué alaban a este director que de latino tiene, o entiende, muy poco? Encima denigra a los migrantes. ¿Y la historia?"
    },
    {
      "rating": "7",
      "text": "If you can't catch Hamilton this will have to do. All joking aside, this is a solid musical."
    },
    {
      "rating": "5",
      "text": "Great singing, dancing, music,. Ode to Washington Heights. But there was a little or no story. It was basically a fairytale. Would I see it again? No. It was basically an extended MTV music video."
    },
    {
      "rating": "8",
      "text": "As long as they are singing, “In the Heights” is really fun to watch, but after the initial setup, things really slow down, and it never quite picks up again.  If you like the “Hamilton”, music there is plenty more of that style here.  Definitely worth giving a watch, but if you start to get bored half way in, feel free to turn it off, because it doesn't get any better.  I give it a B, next time you’re in the mood for a movie, this one won’t disappoint."
    },
    {
      "rating": "8",
      "text": "This was a great piece of art. Soundtrack is ace, cast do a fantastic job. Story is super cheesy but the film carries a great and positive spirit to it. Cinematography was pretty standard. Overall as good as it was, it's tough to be wholly original within the genre."
    },
    {
      "rating": "7",
      "text": "I did enjoy it and consider a good movie, but maybe some of the topics werent that close to me so I am not putting it higher rating, plus since I saw Hamilton, then this wasn't as fresh concept anymore. But I do get why it has praise from critics - not easy to make such movie with such good songs and it moving through well with plot"
    },
    {
      "rating": "9",
      "text": "No conozco la obra musical original pero, lo más que puedo decir es que se trata de un cálido saludo a las comunidades latinas de Nueva York, que saben preservar sus raíces y poner buena cara a cualquier contratiempo. Lo suficiente para seducir a los que no se identifican con el género."
    },
    {
      "rating": "8",
      "text": "A beautifully-shot movie with great acting, music, and choreography. It sends a very hopeful and cheerful message, and it is an example of great cultural representation. The pacing, however, is a bit slow, and some parts may seem a little bit boring. But it's still a great piece of cinema."
    },
    {
      "rating": "10",
      "text": "In the Heights was perfection; I smiled, laughed, cried, and obviously danced and sang along I loved every minute of it. The writing especially the story was outstanding, it was a beautiful story. The musical numbers were spectacular; the choreography was exceptional especially in the numbers \"96,000\", \"The Club\", and \"Carnaval del Barrio\". The performances from Anthony Ramos, Melissa Barrera, Daphne Rubin-Vega, Olga Merediz, Leslie Grace, Gregory Diaz IV, Lin-Manuel Miranda, Dascha Polanco, Corey Hawkins, and Stephanie Beatriz were phenomenal. The vocals were superb especially from Olga Merediz, Melissa Barrera, Anthony Ramos, Leslie Grace, Daphne Rubin-Vega, Lin-Manuel Miranda, and Gregory Diaz IV. The costumes, makeup, and hairstyling were excellent. This is my favorite movie of the year so far, an A+, and I'd say one of the top 10 favorite movies I've ever seen."
    },
    {
      "rating": "9",
      "text": "Seems like the vast majority of the movie reviews I read denounce it for lacking in cohesion, and I simply think they're missing the point. In The Heights plays out like a rhapsody, with each character's storyline thread is given singularity and distinct nature to stand out, yet they're all integrated partly due to the free-flowing structure the movie has as well as its main theme that encompasses the entire story — the classism of gentrification and its impending repercussions. Thus, the story offers a sort of communal experience, that it reflects not only its characters, but the whole block that was \"disappearing.\" The story's goings-on spans several days before and after \"the blackout\" amid a scorching summer. It's Washington Heights where everyone chasing their own little dream (or sueñito), hoping one day they finally reach for the heights that seem to be just there over the horizon yet actually no one can see as they're beyond the blinding streetlights of the soon-to-be-gentrified Nueva York. At the centre stage, we have our narrator, Usnavi. A small little corner store (bodega) owner with a dream of returning home to the Dominican Republic, Usnavi also has a longtime crush on Vanessa — a girl in the neighborhood with an artistic talent for fashion designing, working in a beauty salon and dreams of moving downtown. There's also Sonny, Usnavi's younger cousin and sidekick who works with him. On a side note, Lin-Manuel Miranda decision to leave the role of Usnavi, which he originally played, to Anthony Ramos is a really smart one. Ramos gives his character an amiably rogue-ish charm that Miranda would no longer be able to emanate.Nina's storyline, though, is by miles the richest, more compelling and intricately detailed—albeit more conventional—one. Her father had sold half his share in business to pay for her education, only to find out that her daughter dropped out after her freshman year. Nina's story touches on a few interesting topics as it unravels. She grew bitter at the idea of being an outsider and couldn't stand seeing herself through the prejudiced perspective of her colleagues. Her family of first and second-generation immigrants had managed to assimilate with the new culture without losing their identity, ultimately partly seceding themselves to form their own community. But as for her, she experienced some sort of weltschmerz when she discovered that the hurdle of inherent prejudice still exists. She's unwelcomed, and even humiliated and treated as a dodgy person solely because of her ethnicity. What further exacerbates Nina's adversity is the fact she has always been regarded from her father, as well as her whole neighborhood, as the genius kid from whom they anticipated a lot. Even as an undergrad, the small girls in the block look up to her as an inspiration. All that proves a burden to her already self-disparaged self.All that said, we always see that community standing in solidarity and resilience in the face of their hardships, sustaining their Washington Heights with hectic and lively atmosphere. We get plenty of insert shots that focus on, in the words of Abuela Claudia—the barrio's matriarch, \"the little details that tell the world [they] are not invisible.\" Speaking of the character of Abuela, she's basically the heart and soul of the community. She inherited the \"American dream\"— that of barely surviving the new environment—from her mother. When she was young, she managed to cope with the challenges she faced on a daily basis. As an old woman, she burnt herself like a candle for illuminating her neighbourhood in ways that seem to surpass the metaphorical sense of the word. Furthermore, the matriarchal power of the neighborhood, in general, lays on the acculturation basis of \"integration\" rather than either \"assimilation\" or \"separation.\" As Carla sings, \"My mom is Dominican-Cuban. My dad is from Chile. Which means, I'm Chile-Domini-Curican. But I always say I'm from Queens.\" Here we get that they aim to simultaneously adopt the new culture while retaining their heritage proudly.On multiple occasions throughout the movie, and especially in the titular musical number, we see the players' movements synchronized with music perfectly. And it's clear there was a painstaking attention given to the choreography of every musical number. Whether they're jumping in the air, splashing water or dancing in the streets, all the players are seen engaged in unison in jubilant celebrations of the potential for realizing their dreams, or for warding off the their troubles along with the heatwave. It's worth noting that many of the tunes are syncopated (the offbeats are emphasized; the weak beats are stressed instead of the normally strong ones), which lends the music a more human quality due to its decidedly imperfect nature. The tonal shifting is blatantly inconsistent at some points, but that's the only complaint I can think of."
    },
    {
      "rating": "8",
      "text": "This is a jolly musical with heart, like other Lin Manuel Miranda musicals (he's involved in this one too). The songs are good - energetic and vibrant and the characters are nice. A fun all round musical. I'd recommend this, yes."
    },
    {
      "rating": "8",
      "text": "Aunque no es más que una comedia romántica simplona, siendo honestos, es muy divertida, disfrutable y dinámica, no se puede pedir más para una película de este estilo, y es genial.Es raro que se te peguen las canciones sin haberlas escuchado nunca, son muy buenas y pegadizas, también los bailes.Las actuaciones, asímismo el reparto, es muy bueno, en lo técnico un sobresaliente, en general es bastante buena.Cosas buenas: La música, tanto las canciones como los bailes, las interpretaciones, técnicamente es buenísima, es muy muy inmersiva, y aún siendo algo simplona, es bastante crítica.Cosas malas: Se te puede hacer algo cansino el ver tanta felicidad, pero es lo que te esperas.Conclusión: Muy buen musical, muy disfrutón, y la verdad es que me encantó, sobre todo por lo inmersivo que consigue ser, no quieres que se acabe, a pesar de durar lo suyo, lo recomiendo con creces."
    },
    {
      "rating": "10",
      "text": "It is a heartwarming movie that no one should miss this summer. A movie that is so relatable that transcends cultural boundaries. Despite being a mix of English and Spanish, it was not difficult to understand the story. Some might ask for more subtitle,  but the clever thing about Miranda's song is that you dont have to know every single word."
    },
    {
      "rating": "9",
      "text": "I'm so disappointed for all involved that this bombed in cinemas! Hopefully people discover it in years to come on the small screen.Incredible choreography, masterful lyrics, brilliant casting and performances. I've watched the opening 8 minutes on YouTube about twenty times; I can't get over the level of love and care put into every frame, every choreographed action and every dynamic camera move.I especially liked the way they *didn't* resort to using a Hollywood star, and just used very talented actor-singer-dancers. And the finale took me by surprise and made me well up!I've deducted a mark for lack of \"blockbuster\" choruses, possibly a reason 'word of mouth' faltered. I can sing the songs now, of course, having listened to them on Spotify multiple times, but have to admit I wasn't really humming a tune coming out of the cinema. I guess the 'grower' quality of the songs gives it less immediate appeal than the likes of 'The Greatest Showman' which has several absolutely banging choruses."
    },
    {
      "rating": "2",
      "text": "This film drags on for far too long before becoming interesting. The cast do a great job in their flat, one dimensional roles. \"The Heights\" themselves seem like a concept rather than a fully formed suburb. The concept relies so heavily on stereotypes to feel authentic. The songs aren't as memorable or enjoyable as the trailer would have you believe."
    }
  ]
}