{
  "id": 4393,
  "title": "In the Line of Fire",
  "starring": [
    "Clint Eastwood",
    "John Malkovich"
  ],
  "runtime": 128,
  "genre": [
    "Action",
    "Drama",
    "Thriller",
    "Crime",
    "Mystery"
  ],
  "description": "Veteran Secret Service agent Frank Horrigan is a man haunted by his failure to save President Kennedy while serving protection detail in Dallas. Thirty years later, a man calling himself \"Booth\" threatens the life of the current President, forcing Horrigan to come back to protection detail to confront the ghosts from his past.",
  "releaseYear": "1993",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3NvOFpmyECI3DNExYMtFIRcGMsu.jpg",
  "categories": {
    "plot": 8.625,
    "acting": 8.857142857142858,
    "ending": 6.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.333333333333334
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Top thriller with great performances by Eastwood and Malkovich. Especially the character Booth is a perfect bad guy: very intelligent and therefore so dangerous. the psychological games between Eastwood and Malkovich are the best in the movie."
    },
    {
      "rating": "10",
      "text": "John Malkovich gives one of the greatest performances I've ever seen, with Eastwood not far behind. An intense, evenly paced, gripping thriller."
    },
    {
      "rating": "9",
      "text": "In the Line of Fire is a 1993 drama thriller starring Clint Eastwood, Rene Russo and John Malkovich.... Clint Eastwood plays some secret service dude and Rene Russo plays someone in the service too. John Malkovich gives the cops and secret service people the run around and genuinely has fun in the movie and probably more so than Eastwood if I'm totally honest. John Malkovich is telling Clint Eastwood that he's gonna assassinate the president which is a criminal offence even if you don't mean it and people end up dead even before he attempts to kill the president and on foot and roof chases take place as Eastwood is attempts to catch the villain but fails and also the villain in question (Malkovich) changes disguises regularly and uses false names to confuse everyone except the audience who aren't as gullible. Some romance happens between secret service workers Eastwood and actress Rene Russo and the film has some action scenes. Only downside about In the Line of Fire is not the acting, performances, storyline and overall plot and action but the chemistry between Rene Russo and Clint Eastwood because at times it seems out of place and Clint Eastwood is probably old enough to be Rene Russo's grandad so the idea of love and romance is pretty disturbing but otherwise this is a great movie."
    },
    {
      "rating": "8",
      "text": "Overall, In the Line of Fire does not take too many steps off the typical thriller path, but in spite of that, it does it very well. John Malkovich is fantastic as the bad guy and really gives you the chills. He has the right amount of hurt and insanity for the character he played and did it phenomenally. Clint Eastwood, though a little old, is very good as well. The story is intense and Wolfgang Petersen does a great job creating a ton of tension. The pace is brisk and I liked the focus on dialogue, rather than a focus on action shootouts like in many thrillers. I think the love interest element was unnecessary and just tossed in there, as it added really nothing to the film, honestly. As a whole, In the Line of Fire is a good, intense thriller that works from every angle and though formulaic, it is a great example of using a formula very successfully."
    },
    {
      "rating": "8",
      "text": "This Wolfgang Peterson picture is full of amazing compelling elements, John Malkovich puts on one of his most underrated performances, and Clint Eastwood is at his best as Frank Horrigan."
    },
    {
      "rating": "5",
      "text": "Voici Papy Clint qui reprend du service à courir à côté de la bagnole de \"l'homme le plus puissant du monde\" (sic ! ces Américains...) parce qu'il n'a pas encore digéré l'assassinat de Kennedy et que surtout un détraqué l'appelle tous les soirs pour lui confier son projet de buter le \"chef du monde libre\" (tu m'en diras tant...!).Mouais, on a vu mieux comme point de départ... et à parler franchement, c'est carrément bancal voire complètement con. En fait, ça ne tiendrait pas une seule minute si le détraqué n'était le si présent et si dense John Malkovitch tombé dans le charisme quand il était petit et qui met à mal notre Papy Clint poussé dans ses derniers retranchements et vieux tics d'inspecteur Harry en pré-retraite.Commence alors un jeu du chat et de la souris assez bien fichu mais qui ne tient pas sur la longueur. Le film tire en effet un peu trop sur la corde du blabla, se perd en amourette avec la grue Rene Russo au menton en galoche pour un final finalement très convenu. Il reste la réalisation très soignée de Petersen et la musique un peu fatiguée de Morricone pour faire passer la pillule in extremis. Mais bon dieu que c'est limite !"
    },
    {
      "rating": "6",
      "text": "Horrigan is a horrible actor. The dialogue scenes between Eastwood and Malkovich are move like Bryant \"big country\" Reeves trying to D-up Vinny \"The Microwave\" Johnson. Total mismatch."
    },
    {
      "rating": "7",
      "text": "I wish it was paced better, but 'In the Line of Fire' still makes for a good time.Clint Eastwood and John Malkovich is a great line-up and both are entertaining in this, the latter is just terrific at playing a loopy bad guy. There's a fair few well known peeps behind them, including John Heard and Gary Cole - it's a fairly strong cast.The story is an interesting one, though given that you'd expect the film to move along at a better pace but it kinda just walks through its 128 minute run time. It's not a drag or anything, but I definitely wasn't on the edge of my seat unfortunately. It's still a film I'd recommend, though."
    },
    {
      "rating": "6",
      "text": "Third attempt to write a review. With all the pop ups this is getting to be a chore.Did you read any reviews before watching this movie or rating or even reviewing this?I did.I think that my feelings are best captured by Hello Texas11 on IMDB, but I am somewhat more benign towards the movie. Basically this is a movie that goes by the numbers and serves the usual tropes. And it does so without twists. The good part of this movie is that it is well made and has a few good actors to carry it. Most of the credit goes to John Malkovich and somewhat less to Clint Eastwood. The latter mostly reprises his Dirty Harry role, but more of a burned out kind. Rene Russo and Dylan McDermott are doing their best in their supporting roles. Russo gets the lesser role as the prospective romantic interest for Eastwood.The main issue is that there is nothing remarkable about this movie. Hello Texas11 describes it as an attempt to be a mix of the Manchurian Candidate and Silence of the Lambs, but never getting to the depth of both movies. I would agree even though Silence of the Lambs seems somewhat unfitting. But the thing is: it tries to put Malkovich in the scary killer role and it fails in making him scary. What we get is a run of the mill thriller, well executed but mostly forgettable. There is no depth, nothing captivating and in the end nothing to take home with you.I can imagine more interesting movies: the Manchurian candidate being one of them.This is therefore a mundane thriller that doesn't tickle the fancy: a six at best."
    },
    {
      "rating": "8",
      "text": "This movie is endemic of the 1990s with well-made, well-acted, and actually plausible action movies. Perhaps the best aspect of 'In the Line of Fire' is the back-and-forth between Eastwood and Malkovich, who prove that opposites can attract in movie chemistry. The movie is entertaining and it keeps you on edge through the whole two hours."
    },
    {
      "rating": "9",
      "text": "They don't make them like they used to as in great films with star actors. Tense cat and mouse game by two competent dangerous and lethal foes. With nice a redemption story arc."
    }
  ]
}