{
  "id": 3118,
  "title": "In the Heart of the Sea",
  "starring": [
    "Chris Hemsworth",
    "Benjamin Walker"
  ],
  "runtime": 122,
  "genre": [
    "Thriller",
    "Drama",
    "Adventure",
    "Action",
    "History"
  ],
  "description": "In the winter of 1820, the New England whaling ship Essex is assaulted by something no one could believe—a whale of mammoth size and will, and an almost human sense of vengeance.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/weVvNPfk6FM9vBg3BXtRtNAmiYM.jpg",
  "categories": {
    "plot": 6.070588235294117,
    "acting": 5.872727272727273,
    "ending": 3.5,
    "soundtrack": 6.0,
    "cinematography": 5.818181818181818,
    "familyFriendly": 6.0,
    "funny": 6.0,
    "action": 6.166666666666667
  },
  "reviews": [
    {
      "rating": "9",
      "text": "This movie is not bad at all I don't know why people would give this movie a 1 give me a break. The acting was on point and just to see all the people starve until you see their rib cage mad me really emotional. Go see the movie if you give this movie less than a 6 you're a troll?"
    },
    {
      "rating": "10",
      "text": "Most unfavorable reviews about this movie (both by users and by professional critics) seem to stand on the fact that the movie was said to be a representation of the actual story that inspired Moby Dick, the book, when the truth is the movie is far from what you will find if you read the original story. In my opinion, if you are not attached to expectations based on Moby Dick or on the actual In The Heart of The Sea book, you will be stunned by the marvelous visual art in the movie (take together everything, cinematography, visual effects, costumes, soundtrack, all impeccable), the solid acting, the intriguing plot, and the involving atmosphere. As the story unfolds, the viewer may feel, at some points, that some reflections that the movie tries to provoke are left hanging and unfinished. However, in the end, when the main plot finds its way, all the little things that were left hanging during the movies become teasers that leave you with a bittersweet sensation of \"I wanted a little more\". More of what? Well, more whale fight scenes, more conflicts between the men, more storms... I could easily take another 20 minutes of scenes in the ocean with this movie!"
    },
    {
      "rating": "8",
      "text": "Suspense, drama and action. The movie have some incredible ponts of view in the camera panning, the story is easy to understand and it doesnt give you time to be bored."
    },
    {
      "rating": "7",
      "text": "Raping whales for blubber oil draws a vengeful whale from hell leaving its human hunters in desperate situations steeping to desperate means for survival.  A classic man versus nature period piece told masterfully by veteran director Ron Howard and acted well with a good cast, this film should inspire strong emotions and interest in the attentive viewer."
    },
    {
      "rating": "7",
      "text": "Though mundane at points, veteran Ron Howard's sea tale In the Heart of the Sea is an entertaining man vs nature story that is well acted, beautifully shot and masterfully directed."
    },
    {
      "rating": "7",
      "text": "Everest (2015) and In the Heart of the Sea (2016) are both true-life disaster stories from non-fiction books.  I believe both have the exact same script problem.  It may be easier to see in Everest.  We like the characters but we never know much of WHY they do what they do--because it was not in the book.  So the miraculous recovery of the Outside reporter played by Josh Brolin lacks the backstory to buttress an amazing acting performance.\r I agree with Anthony Lane in New Yorker that we don't get to see enuf of a character arc in any character in Heart of the Sea to engage us that much.\r Not all \"inspired by true events\" scripts hold water.  But in this regard Bridge of Spies (2015) is a master class in how to cobble together true life characters and detail into a story with dramatic meaning.\r The spectacle of Everest and Heart of Sea are not enuf, probably can never be enuf, to compensate for engaging dramatic construction.  This is why do few film scripts exist each year; so few have an authentic or archetypal dramatic story with adequate character arcs to tell."
    },
    {
      "rating": "7",
      "text": "Movies are meant to be entertaining and this story does just that. No this film won't produce Oscars but that is in a vast majority.  Ron Howard did a more than adequate job with the screenplay and the acting roles were well played out.  So disregard all the negativity spewed by the few who found this movie unrewarding. It is what it is and presented in the best way possible."
    },
    {
      "rating": "7",
      "text": "This movie is one of the most i personally anticipated this year.The reason is that my curiosity of what exactly happened to whale ship Essex.The other reason is Ron Howard,he is one of the most highly respected movie director.back in 1980's era i've seen the movie \"Cocoon\" and in 1991 \"Backdraft\". I really impressed by Backdraft cause the way the director describe the fire is like a living persons that breath and ready to burn and destroy everything.That fire also can be a very dangerous weapon.Guess all the moviegoers must remember The Da Vinci Code. The thing that i saw in Backdraft is recurred again in Ron Howard's new movie. Set back in 1820 when the Essex whale ship's voyage must face the deadly assault by a 90 feet sperm whale.This movie stars based the storytelling by Tom Nickerson-the only ex crew of Essex that still alive- to a novel writer Herman Melville.A young novelist that have this ambition to write one of the most spectacular fiction adventure novel ever written. A whale ship that sail under the navigation of Captain Pollard (Benjamin Walker)-a captain by ancestry and off course lack of experience- assist by Owen Chase (Chris Hemsworth)1st Class Sailor-who also reluctantly but have no choice but to accept this task by the owner of Essex ship.Takes a very short time for this 2 character involved in psychological war between them.At first Essex managed to catch a whale, but after a few months of traveling, where food stocks thinning finally Chase and Pollard decided to divert the direction of the ship towards the path of tropical waters of the Pacific-after hearing the story of a Ship Captain Spain who survived the attack from 90 feet white whale.However, both Chase and Pollard ignored the warning from the Spanish Captain. A decision based on ambition and greed which then carry Essex into a catastrophe. they only imagine hundreds of whales on display in front of the eyes waiting to be hunted and brought home 2000 gallons of whale oil.And then, Essex was brutally attacked by a whale with a size that was never imagined by them. Essex ship was sinking to the bottom of the Pacific ocean. And crew who survived the attack separated into three boats had to live in the shadow of a very painful death.Stranded in tropical oceans where sunlight stings during daytime as whole body skin burns. In the course to survive, all the crew had to face moral dilemmas by do the abomination or die slowly in pain. Once again Ron Howard managed to do what he's really excel,the whale that destroyed the Essex described not only as a ferocious monster but as a god of the ocean, the whale protectors of human greed. Internal conflicts between cockiness Pollard as the ship's captain and Chase as a seaman 1st class who is an expert in calculating weather and sharper instincts. A little unfortunate that this film only lasted 2 hours which I think is not enough time for Ron Howard to explore the burden of the old Tom Nickerson who have to live for decades with terrible memories. Also not enough time to explore the mental burden of the young novelist Melville (Whisaw). And looks like Ron Howard strive very hard to share a story segment. Even if the film is not a masterpiece but I feel satisfaction in watching this movie. Even if all the actors act well, but it is the whale measured 90 feet that steal the show.Whale is described as being so characterized, the authority that gives lessons so valuable that a knowledge sometimes requires sacrifice so heartbreaking. Ambitions that humans will someday be stopped by the might of the children of nature."
    },
    {
      "rating": "7",
      "text": "How did Melville come up with the idea for \"Moby Dick\"?  This movie tells the tale of an actual whaling ship that was attacked by a giant white whale.  The survivor of the sinking tells Melville how it happened; the basis for his book.  Factual, made up, who cares?  It's a great story of how men battled the ocean to earn their living, the risks they took.  Also, a parable of our times where the rich elite get richer off the labors of the 99%."
    },
    {
      "rating": "10",
      "text": "Although I know I am in the minority, I thoroughly enjoyed In the Heart of the Sea. I loved the very realistic special effects and the excellent acting, and I thought the pacing was perfect. Perhaps I am wrong, but I think this will someday be considered one of Ron Howard’s finest films. You feel like you are really on the ocean and in the boats after the white whale attacks."
    },
    {
      "rating": "9",
      "text": "This is one of the world's greatest adventure stories.  One can sit back and enjoy it or analyze it til you sink it.  I've sailed across the Atlantic several times including once without an engine or any electronics and from an old salt's perspective enjoyed  \"In the Heart of the Sea\" immensely."
    },
    {
      "rating": "9",
      "text": "This is a great Moby dick movie.It works perfectly. It is intense.And the design of Moby Dick is awesssssosommmmmmmmmmmmmmmmmmeeeeeeee!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "7",
      "text": "Since this is the truth-based story that inspired 'Moby-Dick,\" you'd expect it to be all about the crew vs. the whale. While that's a big part, this narrative expands to become a story of survival at sea. The encounters with the CGI creatures, as well as a harrowing storm, are amazingly rendered. On top of that, the grand style of the cinematography and rich look of the art direction add a layer of visual majesty. Then there's the actual drama: It unfolds with encounters and relationships that are too trite, flashes back to the storyteller (which halts the pace) and never really creates characters that are compelling (even Chris Hemworth seems like yet another superhero). The film attempts to be grand storytelling in a classic vein (albeit with lots of quick cuts), but lacks the spirit to capture the heart."
    },
    {
      "rating": "7",
      "text": "Based on the creation of the suspenseful and at times terrifying novel, Moby Dick, the film In the Heart of the Sea manages to convey such aspects, but is unable to sustain it for the course of the film's entirety. Whilst several scenes stuck with you on an emotional level, Brendan Gleeson's narration was superb and the story was immersive at times, a lack of character development, mixed visual effects and an over reliance on a narrative that shifted its focus off the whale itself, harm the film overall. Whilst the film experience was a positive one, I was left slightly underwhelmed as the story had potential to provide for something far more gripping."
    },
    {
      "rating": "9",
      "text": "this was one of those movies were the preivews lead u to think one thing and it turns into a whole other it was not as action packed as it looked was still a decent movie it defenetly had its intence moments and a good story it had alot of heart too just a little slow in spots but a wonderful movie i say go see it dont expect nonstop action but see it its wonderful"
    },
    {
      "rating": "6",
      "text": "Mainly the determination and commitment from the cast along with some good character conflict and somewhat impressive CGI whales are what make this film worthy to watch. Although there is some poor cinematography, crowded scenes and a strange accent from Chris Hemsworth. Overall this was an average movie and does not showcase Ron Howard's talent as well as his previous films."
    },
    {
      "rating": "8",
      "text": "Una película conmovedora que te tendrá pegado al asiento maravillado durante las dos horas que dura. Sinceramente, no entiendo el motivo de las críticas tan negativas que se ha llevado en algunos medios. Un peliculón en toda regla."
    },
    {
      "rating": "10",
      "text": "Loved this movie. This was the most realistic visually stunning film I have seen to date. My hat goes off to Ron Howard for another amazing piece of work!"
    },
    {
      "rating": "4",
      "text": "Even having seen the mediocre score on here, I decided to check the film out anyway. I like Chris H and thought... how bad could it be? Well, folks, it is that bad. It's a solid 4. It's a bit of a snooze-fest, nothing of note happens in the first 1/3 of the movie. The visuals are weird - some shots look like you're watching a 3d film without the glasses - fuzzy and distorted. The 2nd third of the movie was ok, some action etc... but you don't really care about any of these characters. The 3rd part has about 4 different endings. It's just keeps going and going and going. Intermixed throughout is the cliched storyteller. No one cares about the storyteller - it aint interesting nor exciting. Very disappointed."
    },
    {
      "rating": "7",
      "text": "Ron Howard latest film is ambitious and creative, however it falls short of that goal making it a solid entry to his portfolio. With beautiful scenes and solid performances In The Heart Of The Sea will not displease nor please viewers instead entertain them for a moment."
    },
    {
      "rating": "6",
      "text": "Based on the 1820 event, a whaling ship is preyed upon by a giant whale, stranding its crew at sea for 90 days, thousands of miles from home. I'm happy to say that this movie was surprisingly good! Sure, the pacing was slow and at a few parts it got dull. But away from that I though it was a fun watch. The movie's build up was long, It took almost the entire movie to get to the actual meat of the film. The acting wasn't phenomenal but was most definitely watchable especially the ones from Chris Hemsworth and Tom Holland. For the time they are on screen together, they have a very watchable chemistry. The whole Mentor and Mentee thing going on between them is quite enjoyable. The cinematography and visual effects were absolutely breathtaking. Every time you see Moby Dick destroying the ships and wrecking havoc is just tension filled and heart pumping. The darker twist in the movie was supposed to cause “oh's” and “ah's” but I didn't see it. It felt forced into cause drama but just like Legend. You can't take it out of that true story because it is a true story and people would feel cheated. In the end, This movie was surprising. The setup went on a little too long and the writing was weak at times but besides that, beautiful. I'm giving this one a 6/10 (a positive 6/10)."
    },
    {
      "rating": "3",
      "text": "I think what's so insulting about this movie is that it presents itself as the real story on which the fictional novel Moby Dick was based, and yet this story is fictionalized as well, often in pointless and overly conventional ways.\r The film trumps up a competition between captain and first mate that goes nowhere and creates ridiculous and unnecessary foreshadowing, before leading to a downright comical conclusion. If you believe historical accounts, it is true that this ship was sunk by a whale, but the notion that the whale stalked the crew for weeks thereafter is ludicrous, let alone the shred of humanity the filmmakers tried to imbue in it.\r Moreover, none of the actors are believably Bostonian whalers and the CGI isn't very good either (I saw it in IMAX 3D so I'm not getting cheated there). Even in 2015, fake water still looks like fake water. And the nastiness of being stranded is painfully obscured by the PG-13 rating, though you can look forward to some unpleasant whaling footage.\r Perhaps the worst sin is that they missed out on the true story. The survivalism of the crew is fascinating, but is compressed into a few scenes. An anecdote about the crew burning down an entire island by accident, a golden cinematic opportunity, isn't in the film at all, nor are some of their other adventures. Thinly drawn trope characters are allowed to replace whatever genuine story inspired Melville to write his famous novel. Time is wasted on using Melville as a framing device. Though, in truth, the whole movie ends up being a waste of time."
    },
    {
      "rating": "1",
      "text": "In The Heart Of The Sea tries so hard to entertain the viewer, but all it brings is a sloppy attempt at a true story. The two hour film feels like forever, and is such a bore."
    },
    {
      "rating": "6",
      "text": "It's a good, true story. However one that's enjoyable elements are strictly tied/limited to the whale(s). The other stuff which includes tension between the captain and first mate, Herman Melville interviewing the last survivor of the disaster, and some character moments all fall short. They aren't enough to sink the ship, but they do make for less than smooth sailing.\r It's hard to get into at first. I didn't care about the characters so when much of the film's opening consists of introducing us to these characters it's hard for the mind to not wander. Then the first whale shows up and things turn around. The characters themselves still aren't interesting, but their adventure begins to find some life. We get a fascinating look at whaling and some visually stunning creatures. The ocean and the whales that call it home are gorgeous here. It's that visual splendor and hardships the crew suffers because of them that carries the film back to port, even if worse for wear.\r We have seen these survival elements before, so there is a sense of familiarity to it all. However that doesn't make the depiction of being stranded at see any less harrowing, especially with a gorgeous, massive whale making things harder for them at every turn.\r It's a beautiful and occasionally boring survival story. One that never quite gets any morals out there. However the whales bring a dose of life to the film to keep in from being dragged to the depths of Davy Jones' Locker. The fact that it's a true story also helps. For land lovers this isn't going to be the cruise ship you're looking for, but for those with a love for the sea it's worth setting out to sea. Even if it's little better than a rowboat at times.\r 6.2/10"
    },
    {
      "rating": "5",
      "text": "\"In the Heart of the Sea\" was a film that tells what has not been told of \" Moby Dick\" , half of the film was very boring , but the performance of Chris Hemsworth was the one that stood out."
    },
    {
      "rating": "6",
      "text": "A movie where Thor meets Moby Dick meets Whale Wars meets Jaws meets an Unfortunate title is a movie I should have waited for Netflix to watch.  See Krampus not Whale Wors 3D"
    },
    {
      "rating": "7",
      "text": "Great story, great special effects, great sets, costumes, production design and sound editing.  Why didn't this movie get more Oscar consideration for these awards.  Actually, the biggest problem with the film is that the white whale encounter isn't dramatic or terrifying enough.  The original 'Moby Dick\" with Gregory Peck did a better job of conveying the terror of confronting a monster whale.  However I still recommend it.  Its better than you think."
    },
    {
      "rating": "1",
      "text": "I hate this movie. I love Ron Howard but this was terrible. I felt nothing for the humans and was rooting for the whales. I enjoyed when bad things happened to the people."
    },
    {
      "rating": "7",
      "text": "In the Heart of the Sea has a few pacing problems and never quite reaches the heights it potentially could but, thanks to some top notch performances from the cast and fantastic special effects, it makes for an entertaining couple of hours."
    },
    {
      "rating": "5",
      "text": "Has good visuals but really doesn't make the most of a pretty good story. Hemsworth isn't the best."
    },
    {
      "rating": "6",
      "text": "If you were expecting an action film, you are in for mostly drama with a few spare scenes of whale action. Otherwise it's completely about the sailor's survival stories, which is alright but not at all what it was made out and sold to be. The cgi was also a bit cheesy if you ask me."
    },
    {
      "rating": "4",
      "text": "The first half of the film is dreadful and gets a little better by the end. Overall the film is bland, with poor acting and in someways a meaningless story to tell."
    },
    {
      "rating": "6",
      "text": "Ron Howard is a good director. What separates him from being great is that he is entirely dependent on his script. He is a good director because when given any material, he plays to its strengths and lets the narrative and characters do the talking. He is not flashy and lets the film breathe, rather he is a confident, knowledgeable, and smart filmmaker able to make the most of any material he is given. Unfortunately, this also means that bad material he is given will be watchable, but still bad (The Da Vinci Code). Great material lives up to its potential and Howard's assured hand gives the film the extra push to become a top-notch film (Apollo 13). In the Heart of the Sea is in the middle of these two. A solid film that would have been awful under a lesser director, but could have been special with a great director, the film is a middle-of-the-road film with pros and cons.In the pros column, we have the visuals. Painstakingly gorgeous, it is a shame that this film bombed because it deserved recognition for the cinematography. On land, it beautifully captures the whaling towns and the New England feeling of these small sea towns. In town, the browns and grays are gorgeous. Gratuitous shots of the ocean from  Owen Chase's (Chris Hemsworth) home with the green town on the side. With Anthony Dod Mantle's camera gently floating up and catching this beauty of the small seaside town in 1820s Nantucket, it feels practically idyllic. On the open ocean, the sunset lends beautiful oranges and yellows to adorn the film that leads to lush greens and blues. With long shot after long shot of the sun's orange casting down on the green and blue of the open ocean, In the Heart of the Sea is a painfully beautiful film. The cinematography gives this film impeccable visuals that feel like a painting one could find of ships in the 1800s. A true visual accomplishment, In the Heart of the Sea is a film that demands to be seen in order for every living person to be awed by the sheer beauty of the proceedings.Unfortunately, this perfect cinematography is not matched by the visual effects. Compared to another film based around oil and disasters, Deepwater Horizon, the visual effects in this film are pretty bad at times. The whale looks incredible and, again, shots on the open ocean look great. The fire looks terrific too. Unfortunately, shots during the storm and while whaling are really ruined by how fake it all looks. It is similar to car being driven in a film from the 1940s or 1950s. It looks like it was filmed on a set, which is a shame. Similarly, a few action set pieces also look entirely staged, similar to the effects in a 1970s disaster movie. These moments do no just disrupt the suspension of disbelief on the part of the audience, but just look awful compared to the gritty realism of the rest of the film.Another major negative for this film is the acting. In the lead role, Chris Hemsworth plays Thor. Pretending to have a New England accent in one scene where he says apaht instead of apart, he is fine and entirely palatable. But, either have an accent throughout the whole thing or just forget about trying. Sean Connery made a whole career on his looks, being cool, and playing every character as a Scotsman. Hemsworth can do the same, but he has to stop pretending. Alongside him, Benjamin Walker is pretty bad Captain Pollard, but nobody is as egregiously bad as Tom Holland. Every line he speaks honestly hurts. From the very beginning, Holland never utters a line with any conviction. He knows he is acting and we know he is acting. Shame the production team made the actors suffer so much (500-600 calories a day) to capture authenticity for such bad performances. Cannot say it was worth it on their parts. The only actors trying are Ben Whishaw and Brendan Gleeson, but as Herman Melville and old Thomas Nickerson, all they do is talk about the story and are not given much to do throughout. Of those who suffer, Cillian Murphy is alright, but even he turns in a lackluster performance compared to his body of work.With bad visual effects and bad acting, In the Heart of the Sea is a film that simply lacks the depth needed to be a good film. Its story and characters are fine, but never as rich as the cinematography and painting-esque shots adorning the film. That said, as with all Ron Howard films, it is entirely watchable, riveting, and a film that entertains throughout despite its seemingly crusty and aged story."
    },
    {
      "rating": "5",
      "text": "As a whole, In the Heart of the Sea is a visually grand, well-acted, disappointment of a film. The writing is weak, the characters are boring, and the pacing is sluggish."
    },
    {
      "rating": "7",
      "text": "We actually know this story, but not the truth until now!\r Ron Howard's latest sea adventure, stars Chris Hemsworth in an important role. So the people comparing it with 'Moby Dick', because both the film is about the same story, but one was inspired and the other one was, I mean this film was based on the actual event. I had seen the BBC film 'The Whale', not a bad film for a low budget television film. Most importantly, it revealed the truth about what I was not aware of from one of my favourite sea adventure films.\r I never read the book, but saw the British version, so I knew what I'm going to witness. Still, I was very interested to check it out, because it is a grand film and as expected I loved the visuals. Those sea adventures were very realistic, except the action sequences which is obviously cinema gimmick. The surprise part was the narration. It was a flashback story, something like 'Life of Pi', a man recall his old memory of his survival at the sea with other crew members of the ship Essex when it was attacked by a big white whale.\r It is kind of impossible to believe what this film says is true. And obviously what we see is not what exactly happened, but very close. So see this film to believe it. Whatever it is, I totally enjoyed watching it. The 2 hour long never looked too long. There are a few mild disturbing scenes due to the theme concept, but it is a good family film. If you like 'Moby Dick' then you should watch it. Definitely an underrated film by the film critics.\r 7/10"
    },
    {
      "rating": "5",
      "text": "Ron Howard is a good director, but he's not always a sure things. He does have some weaker movies and sadly In the Heart of the Sea is one of them. The film relies more on visuals than on a interesting story and characters. Ron Howard collaborates with Chris Hemsworth again after he was great in Rush in 2013. I'd be completely fine if Hemsworth replaces Tom Hanks as Howards new frequent collaborator. He was definitely one of the upsides of the movie. I have no doubt in my mind that this man is a true movie star. Cillian Murphy is also in this film and he is painfully underused considering how talented he is.\r The major issue with In the Heart of the Sea is that it just does not have the characters that you can latch onto and care about. Then when the **** hits the fan later on in the film you really don't care if they live or die. I would find this film very comparable to Angelina Jolie's Unbroken from last year. Its also about 10 or 20 minutes too long."
    },
    {
      "rating": "6",
      "text": "The most obvious big remake Hollywood has yet to do that I've had in mind and talked about for years is \"Moby Dick\".  While this isn't that but a tale of the true story that inspired the writing of that epic literary classic, it's probably as close as we'll get for a while now.  With Ron Howard being behind this especially classically styled epic you'd expect it solid in craftsmanship all the way round and it is.\rThe image is intentionally old style and looks as if it could have been shot 60 years ago, yet was made with the latest digital cameras using all the most advanced techniques going with state-of-the-art CGI of course, which looks good.  The whales are realistic if not all the sun flares and water droplets.  I did particularly like the unorthodox use of yellow/greens in the picture which look lousy in TV spots for the movie, but just fine on the big screen.  (I started noticing about 10 years ago that CGI in movies often does not hold up on any kind of small screen even in Full HD, while the same shots look stunning in a theatre.  This is a whole issue I need to get into sometime…)  I've also often stated that if \"Jaws\" were made today it would not be nearly the classic it was because CGI would certainly ruin it.  I stand by that, but here it's great.  It's a much different kind of story and with whales not one shark.\rUnfortunately the film drags.  It just didn't involve me despite my desire for its story and subject matter.  The music score for example is stale and uninspiring as is much of the latter part of the story if anything because we've seen it before too many times and there is nothing unique here driving it.  I wish they made more out of the ecological aspect that's nicely touched upon and directly connects today's world.\rOverall a noble effort probably lost on today's audience."
    },
    {
      "rating": "6",
      "text": "Ron Howard movies usually interest me and I was excited to see this when I first saw the trailer but this one just didn't do it for me. Good acting and decent CGI effects. Not the best Ron Howard movie. Check it out though if your sitting around the house bored everyone likes different things."
    },
    {
      "rating": "5",
      "text": "Owen Chase: \"Look where we find ourselves. What offense did we give God to upset him so\".\r In the Heart of the Sea takes place in 1820, a whaling ship out of New England, the Essex, encountered a sperm whale that seemed to have a streak of human vengeance, assailing the ship and stranding the crew out in the ocean for 90 days. The true story was the inspiration for Herman Melville's classic novel, Moby Dick.\r So I've just seen In the Heart of the Sea and it very disappointing. It was one of my most anticipated movie of December right next to Star wars, The Revenant and The Hateful Eight, but sadly it didn't live up to my expectations as much as I wanted it to. The trailer for the movie completely lied to us just like most trailers today, I mean the whale itself shows ups a couple of times in the movie and we stuck with characters that we don't care about.\r Ron Howard can be a mix bag sometimes when it comes to his movies. Some are good, some are in the middle and some bad. But I still think he's a great director that can really bring a well crafted and brilliantly directed movie. While I thought Rush (the 2013 film with Chris Hemsworth and Daniel Brühl) was a solid movie, but it's not the type of movie I'll be re watching any time soon, but still I think it's a well directed movie and it showed that Ron Howard still got it when it comes to film making. And here he's still got that unique film making quality in him and I think he did a good job of making the audiences feel really small, and it's not just because of the whale that makes you feel small but the sea itself. But I feel like he really lost himself mid way through the movie as he really lost it's touch. The directing was good, just not brilliant as I wanted it to be.\r Chris Hemsworth was really good in this movie and this is the role that he really went for it. If you haven't heard about the shocking weight loss that he did just for the movie and now that's what I call dedication right there. The same thing can be said about the rest of the cast as there wasn't a weak performance. Hemsworth's accent dose go off and on quite often, but overall all the performances from everyone were good.\r The movie is basically a man vs nature type of movie which is favorite part of the movie by far.\r Now for the problems: I did not give a crap about any of these characters and that's a big problem. The characters are so bland, so dull and quite unlikable. Nothing is development with the characters and the only time that I actually cared for them is around the third act. The writers try to make us care for Hemsworth character just by adding in the most cliche thing that any screenwriter can writer to his character and that's having are main hero have a pregnant wife who's at home, so he fights for survival to get back to her, but do the writers know that makes the character more basic, unoriginal and cliche. That's not going to make me automatically like the guy.\r The visual effect's was another thing that was so disappointing to me, because the effect's were very noticeable at times and it's mostly the CG background. The effect's on the whale looked great but the effects for everything else was pretty bad and quite disappointing, since effect's should be better right now, but then again, I said the same thing about Transformers 4 and Fant4stic.\r Overall In the Heart of the Sea was very disappointing and it could have easily been great. The characters are dull, the effect's are noticeable, it's slow at times and the cinematography doesn't quite have that epic scope that the movie wants."
    },
    {
      "rating": "7",
      "text": "A nice intent of emulating the 1800’s narrative in today cinematic forms, but stays as a try. Never completes the circle to take us back to the past even it excels the trills and risks of the nineteenth century navigation beyond the clichéd pirate themes. Quite enjoyable only for those who love already the sea adventure genre or Moby Dick."
    },
    {
      "rating": "5",
      "text": "Ron Howard's new dramatic invention is so confusing and complex that falls short of making a quality product. How it is actually the movie as complete ? Many ways to define this project can be used although it become countless ways. Could be defined as the last work of the enigmatic director, An adaptation of the novel that inspired the classic \"Moby-Dick\". Could be defined as the mix between non-fiction and drama, thing that can´t be combined quite right because it loses the center point of the movie which it's fully the drama of a best-seller tragedy. Could be defined as instructive, development was incredibly slow and It seems to teach us that a whale is not just a small animal, it´s the God of the seas and for this reason the human beings should not be interested in whale oil or in any of its strong attractants, managing to create a teaching in the global fisheries mind.Could be defined as a story about the survival of a group of brave men (to the style of \"The 33\" they had families and wanted to either go home) led by a macho and wealthy captain George Pollard (Benjamin Walker) it as cliche would not have affinity with the role of Hemsworth (Owen Chase). Finally, Could be described as an opportunity to show the corporate ethics, where the survivors are forced to lie about what happened, fearing that the company does not cover agreed costs.\rIt is not exaggeration, this, manages to capture each of the previous designated items but at the same time fails nothing, What does this mean? The project director was so ambitious that to mix so many elements for achieve an award fell into the void spilling any possibility of a prestigious Academy Award. OK, \"In The Heart Of The Sea\" would be a quaintly dark paint with  thinking philosophically of Directors as 'Steven Spielberg' or 'Werner Herzog' but Howard had a completely different view, for this reason it is that so far his best film is 'Apolo 13'.\r The point of break of all the film is this, wanting to be everything at the same time the film is converted into short-movies separated in sub-genres of a central theme \"A marine attack on a whaling ship\" but the central point of its break is its narrative, having Melville goes to the house to interview, ask and write down what happened that day (Brendan Gleeson in the present-day scenes, Tom Holland as his younger self)  for the creation of his successful book that tends to reduce his own writing to transcribe the happened on 1820s, often interrupted for memorable action scenes, for example of this the beautiful work of directing, cinematography and editing at the time of the splendid onslaught of the mammal. Sometimes this could be screenwriter Charles Leavitt's attempt to create a cinematic equivalent to Melville's tendency to interrupt his narratives with  with passages and literary events that surprised us to read.\r As soon as it completes the scene, feels a vacuum feel to see the result of a succession of mistakes and successes to the terrible sub-narrative.  Without a doubt it's anachronistic and incoherent, the moment where the whalers if they did well to kill the whale (seriously not, It's 1820 not 2015, Mistake #1) or the bits where the afflicted whalers explain to the young Melville that the whaling industry was so successful and triumphant as today the oil industry (seriously not, Perhaps they sent you a message on Facebook or WhatsApp or you get an e-mail where you explained that a man decided to open a hole in the ground and extract a liquid called \"oil\", It's 1820 not 2015).\r Okay, it is impossible that contemporary writers unearth their minds of the demons of present and do we immerse in the years 1820 without details of the topicaly, since it is very difficult that the facts of the past surprised for own merit. This is not to say that the old is not lucrative and amazing knowing that some of the best historical movies and TV series shine for its details and pragmatisms of the represented time.\r Touches that seem to be ironically forced into cinematography - such as the character of Hemsworth, Owen Chase, Owen tries to spear the vengeful whale for the second time but freezes after staring into one of its large and curious pair of eyes, seems foolish here. Are we to believe that a man who has lasted his entire life hunting whales (for a promotion to captain) goes to cow having in his hands his life and the crew??? All is a collusion fully planned, something that water, a good body and a whale may not remedy.If another director took the mandate of the boat and the whole film would have been different.\r Unquestionably, \"In The Heart of the Moby-Dick\" should be the title of this film, having been an interesting thriller, a disjointed film, an almost exact copy of the book of auto-help and one look wrong. How would have been this movie with another narrative? Perhaps had come out of the port? Amenably attractive exciting and inscrutable, \"In The Heart of The Sea\" never manages to collect its greater role."
    },
    {
      "rating": "8",
      "text": "I find an interesting parallel between the reviews of this movie and the reception of Moby-Dick when it was first published. This is a good, well-made movie. Yes, it is complicated. So is the true story."
    },
    {
      "rating": "5",
      "text": "Lovable and decent, but it's too forgettable to be called a movie anyways. In the Heart of the Sea will be decent to those moviegoers and lovable to some people."
    },
    {
      "rating": "4",
      "text": "There is only one movie to hold this or any other movie of this genre up to, and that is Jaws.\rThis does not come near.\rI have noticed from the movies of the past 5 years that special effects are presumed excellent.\rWatching this movie will undoubtedly cause you to miss the admittedly fake shark.  That shark was close and wet and salty and ferocious above all else.\rThis whale won't hurt mickey mouse because that doesn't happen in these cartoons.\rNothing ventured......"
    },
    {
      "rating": "4",
      "text": "A truly great book ends up being a mediocre movie.  With such a ready made story, it's shocking the film does not succeed.  Because the movie spends so much time focusing on the recurring narrative technique which has Herman Melville meeting with the last living survivor of the Essex (the usually incomparable Gleeson), it loses the opportunity to character develop the two main characters on the ship.  Thus, when the encounter with the whale and its aftermath ensues, the viewer has little emotionally invested in any of the survivors.  Apart from spectacular visuals with the whale, the movie has little going for it in any area.  Recommend the viewer invest in the book for a well told, exciting and amazing true life adventure story."
    },
    {
      "rating": "4",
      "text": "In the Heart of the Sea tells the tale of the wailing ship called the Essex and the true story that inspired Herman Melville to write the novel, \"Moby Dick\". But the movie is more about the survival of the fittest of our characters as they are attacked by the enormous whale, leaving them adrift in the ocean, stuck for months.One of the biggest advantages of this film is the talented cast involved. We have Chris Hemsworth, Cillian Murphy, Benjamin Walker and Tom Holland playing as the crewmen, but their characterizations are little thin to make them the big selling points of the movie. They are just expendable bodies, the CGI ocean can drift and play with.The movie takes a long time to get engaging, and it’s not until the second half, where it picks up and starts getting interesting. There are some enthralling action sequences involving Moby Dick, and a 19th century vibe by using lighting choices which feels seamlessly believable.VERDICT: In the Heart of the Sea floats, but sinks deeply."
    },
    {
      "rating": "1",
      "text": "Couldn't wait for this to end after 30 minutes of viewing. Paid to view this, so was determined to see it through.  Wished I hadn't.  This has everything that's wrong with modern film making in it.  If I was dear old Ron, I'd want my name removed from the credits. A shocker !!"
    },
    {
      "rating": "7",
      "text": "It's Ok.--------------------------------------------------------------------"
    },
    {
      "rating": "7",
      "text": "In the Heart of the Sea tells the 'true story' behind the white whale later called Moby Dick. We follow Owen Chase, a whaler who is crossed by the Nantucket family by not granting him the title of Captain. He has to get along with Pollard, a Nantucket family member who gets to be captain by heritage. Both set out on their ship to collect Whale oil, which at that time is used to light candles. After suffering poor results in their hunt for whales, they decide to sail over a 1000 nautical miles to find a supposed hotspot of whales. Things go wrong and a great white whale sinks their ship, leaving them stranded in the middle of the pacific ocean. After facing hunger, cannibalism, insanity and thirst, they find rescue.So, the movie tells a pretty straight forward story. It goes into surprisingly much detail at times, yet completely shies away from anything that could be R rated. The whales are all shot in CGI (no surprise there) but fail to look very realistic. At times shots are even re-used, which comes across a bit lazy. The characters all seem to lack conviction in their portrayal.It was enjoyable to watch nonetheless. I learned more stuff about whailing. I give it a 7/10."
    },
    {
      "rating": "6",
      "text": "This movie reminded me of when I worked in catering. Everything looks appetizing, everything is basically in the right place and the decor is definitely good but when you start to look at the actual ingredients and take a bite, you feel somewhat robbed. And that's how I feel after this film. I am satisfied but still hungry, hankering for something more substantial. The actors are solid but the material itself, well, while fascinating, doesn't seem to give you more than a good long plunge into the dire straits of whale hunters. Everything felt tacked on from obvious class conflict between the ship captain and first mate. Then the hunting of the whales. That was painful to watch where at one point, I couldn't sympathize with the crew. Then, when that one mighty whale figured enough was enough, I was more on board with the beast and thought, let these buggers have their tea and come-uppance. Some died, some survived. I didn't get the impression grand lessons were learned or some moment of transcendence occurred. It was a good yarn in the main. That's about it."
    }
  ]
}