{"id": 4019, "title": "In the Shadow of the Moon", "starring": ["Boyd Holbrook", "Cleopatra Coleman"], "runtime": 115, "genre": ["Science Fiction", "Thriller"], "description": "In 1988, Philadelphia police officer Thomas \"Locke\" Lockhart, hungry to become a detective, begins tracking a serial killer whose crimes defy scientific explanation. When the killer mysteriously resurfaces nine years later, Locke's obsession with finding the truth threatens to destroy his career, his family, and possibly his sanity.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/5DSVYlKwEzGBxTkS95L73c3oxLs.jpg", "categories": {"plot": 5.0, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "Awesome documentary, fascinating from start to finish with excellent interviews. It is very well edited, never sluggish and frequently thought provoking. A wonderful and educational experience."}, {"rating": "10", "text": "One of the best documentaries I've seen since One Day in September. Of course, the feeling this film leaves you with is completely the opposite of that one - this movie is so uplifting and powerful. Even for someone who wasn't alive at the time when landing on the moon was a miraculous event - this film captures that time, that excitement.... it transports us back to the early days of the space program and moved me to tears of joy! The filmmaking is excellent. The director wisely lets the spectacular images and the succinct storytelling of the astronauts do all the work. A great movie for families. The audience I saw it with applauded several times. Pretty impressive given that we all know how this one ends!"}, {"rating": "10", "text": "I know it's easy to give out absolutes -- 10 or 0 -- but in this case, just trust me. This film, without narration, isn't a documentary. It captures so much about what makes us Americans, what makes us humans. There's so much nuance here, you're generously rewarded for paying attention, I'm not sure even the Astronauts knew what the filmmakers were putting together. No SFX will ever match the Saturn-V ignition or Buzz Aldrin being the first human to pee on the Moon. It's inspiring, touching and crisp enough to never be boring. Spellbinding."}, {"rating": "10", "text": "This is easily the best documentary on the moon landings, and probably one of the best space documentaries in general.  Instead of focusing too much on technical details or basking in nationalism, this film puts you in the astronaut/cosmonauts' shoes and explores the human experience of being on the frontier of exploration.  Forget the trivia e.g. about the apollo investments paying for themselves several times over or whatever else of that sort.  Rather, this film truly conveys the innate and thus self-justifying human desire to explore--something which transcends all of the supposedly necessary economic motivations (and is unfortunately often not realized without experience).\r I can't even begin to imagine what it would have been like to participdate in such a thing--or even to be alive during that time (if I had been, I certainly would have taken interest in the sciences at a much younger age), but this film gave me a glimpse of it and also of what our future *could* be."}], "recommendations": ["before_the_flood", "the_tree_of_life", "the_fountain", "nomadland", "nine_days", "life_of_pi", "silence", "i_origins", "snowden", "eyes_wide_shut", "avatar", "apollo_11", "arrival", "a_hidden_life", "donnie_darko", "contact", "the_pianist", "mainstream", "united_93", "empire_of_the_sun", "flashback", "cloud_atlas", "2001_a_space_odyssey", "europa_report", "the_lost_city_of_z"]}