{"id": 3876, "title": "Incendies", "starring": ["Lubna Azabal", "Mélissa Désormeaux-Poulin"], "runtime": 131, "genre": ["Drama", "War", "Mystery"], "description": "A mother's last wishes send twins Jeanne and Simon on a journey to Middle East in search of their tangled roots. Adapted from Wajdi Mouawad's acclaimed play, Incendies tells the powerful and moving tale of two young adults' voyage to the core of deep-rooted hatred, never-ending wars and enduring love.", "releaseYear": "2010", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/zQdcNGCi4aVIv02wMHaTWlF7M2w.jpg", "categories": {"plot": 7.948717948717949, "acting": 8.095238095238095, "ending": 8.23076923076923, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 3.0, "funny": 5.0, "action": 7.0}, "reviews": [{"rating": "9", "text": "A tremendous film. Even though there's a lot going on, and there's much to unpack, the way the story unfolds is so effortlessly handled, and it's quite a story - packs an enormous punch.  Throughout, I kept having to resist my yearning for more historical & geographical context, but I'm guessing the writer/director wanted to keep the focus on Marwan and her personal struggles and tortured history. Highly recommended."}, {"rating": "10", "text": "Greatly made building up suspense until it dazzle's you with it's shocking finish. One of the best movies of last year!"}, {"rating": "10", "text": "A wonderful piece of motion art with a disturbing conclusion . Its a painting of a harrowing scene told in the most beautiful strokes. It stays with you long after."}, {"rating": "5", "text": "It seemed a tad busy, and the languages not being my own first, robbed me I'm sure from some being able to tell if it was genuine in some scenes with the acting...though Grandmother's did seem a little over the top, not buying it some. The story did move in time a lot. The two female lead's too much alike in look made it a good challenge to see where we were in the story. Fine. But a lot of things we could guess what were what and yeah, intentional, what with the characters finding out later...but, so much repetition of some story lines, felt as if, you know, CUT CUT CUT already. We get it. Still, heavy impact at the latter bits. WOW. No spoilers here but, advice: GO TO A COMFORTABLE SEATING PLACE! Regal Cinema in Irvine's blows!"}, {"rating": "9", "text": "My favourite pick of the 2011 Oscar nominees for foreign film (along with Dogtooth).  A haunting story, full of twists, notable for the remarkable performance of Azabal."}, {"rating": "10", "text": "This was the most powerful movie I have seen in current memory. The screenplay was incredibly dramatic and kept me on the edge of my seat throughout the entire movie. The suspense was complete and when the truth was revealed I found that I had no idea expectation how it would end. In addition to a well written. the actors were superbly chosen and fitted for their roles. The cinematography was beyond description...in my opinion, this is academy award material"}, {"rating": "8", "text": "Movie itself contains some really painful moments, but it's a beautiful story. I wasn't really convinced by Simon, I thought his character lacked some life. But both female roles were astonishing. I thought older brother's story was really painful and I felt compassion for his character. I would love to see more of him and his story in the movie. Overall I think it's a great movie."}, {"rating": "7", "text": "Cold As A Viscous Flame.IncendiesVilleneuve is a gentleman when it comes to respect the genre he plays in. In fact, he respects the whole system, even the hefty hectic part of the film. If his film ticks for more than two hours, he definitely has edited at least half an hour from it. He isn't ashamed, afraid or lazy on going deep in to the tunnels and get his hands dirty. He foliates the darker side of the human as a compelling arc for the storytelling. Take the imprisoned part of Nawal's (Lubna Azabal) life, even something so informative and dry part of the script as such, Denis Villeneuve, the director, has crafted out a nail biting drama where the emotion is installed in it by introducing a song in it.Now, this song isn't something he just throws out randomly, he first teases us by formulating a title to that very act as \"The Woman Who Sings\", so incredible is that name, that every time it is referenced for advancing the storyline, there is a pathos in its vocab that he armors in for this long, long battle. There are plenty of scenarios in the film and often the filmmaker loses the tone of the film and there is an uneven pace that itches the viewers, but Villeneuve's experience is mostly the saviour of it.While the rest of it, is left upon the actors like Lubna and Melissa, where despite of going back and forth in timeline there is an equal force resisting the dogmatic postulates of the world. There is a poetic bridge connecting these parallel worlds and the answer is the performance so magnificent that it deconstructs all the semantics of the script. Incendies is the fire that will not spark the charge but will burn the whole forest down unapologetically."}, {"rating": "10", "text": "The masterpiece which comes once in decade this movie is very unfamous that should be changed because every aspect of this movies is perfect"}, {"rating": "8", "text": "This was a very good movie that reflected the realities of Lebanon's civil war. Although brutal and tough to watch at times, I thought the film captured the essence of that period based on my knowledge of it. I do think the film could have had a prologue explaining the political situation in which we the viewer were about to be injected.  One of the things I admire about foreign films is they are less likely to glamorize or gloss over the brutality that exists. I went and looked up the history of the conflict and found it to be as complicated as this film portrayed. The scenes that really struck me were he cold blooded killing of the little child on the bus and the sniper killings in Beirut.  History seems to be continuously repeating itself in the Middle East."}, {"rating": "9", "text": "superb movie.  gripping, difficult material to watch.  it stays with you for a long time afterwards.  superb acting, interesting plot twists and very intriguing movement from present to past and back again.   highly recommended."}, {"rating": "7", "text": "Lebanese-Canadian Nawal Marwan (Lubna Azabal) has passed away.  She was at the swimming pool, started staring off into space, and then slowly faded away in the hospital.  She has left behind her twins, Jeanne and Simon, who are in their early â"}, {"rating": "6", "text": "At times, the movie is so good that it could have been a masterpiece (no wonder it was nominated for Oscar in International movies category). But it is not.The final twist of the story (which is tightly connected to the beginning) makes the whole of it somewhat of a farce.In my opinion, the topic of great magnitude, such as civilian population suffering in a war, should not be confined into an obscure and improbable case.Still, I cannot overlook the number of impressive, magnificent scenes which make the movie definitely worth seeing."}, {"rating": "5", "text": "I'll keep it simple. Incendies gets a score of 5:The storytelling is sparingly engrossing.The plot feels too contrived.It leaves you morally browbeaten.It contains multiple \"r u serious?\" moments"}, {"rating": "9", "text": "A wonderful movie, it was a bit hard to follow at times going back and forth between the time periods but what a great story!  It had more than one gut wrenching exposure, but the ending of it all was so unexpected!  I highly recommend this movie, a great expose on human life."}, {"rating": "9", "text": "As much as a love movies, it's still difficult for me to watch foreign films, because of the whole subtitle reading.. but this movie transcends language. I highly recommend it."}, {"rating": "8", "text": "Another year, another Oscar snub. The movie is too tragic to be true. The movie leaves you shell-shocked with umpteen twists and turns as the plot swerves from one direction to another disclosing unbelievable facts. A treat to lovers of mystery."}, {"rating": "9", "text": "Wow is Incendies messed up. Telling the story of Jeanne (Melissa Desormeaux-Poulin) and Simon Marwan (Maxim Gaudette) on their journey to find their father and brother in the aftermath of the death of their mother, Nawal Marwan (Lubna Azabal). A thoroughly heartwrenching journey through a religiously and war torn Middle Eastern nation that is part self-discovery and part war story, Incendies feels influenced by classic Greek and Shakespearean tragedies (namely one that I will mention later on since it is a major spoiler) and also feels incredibly important for today. Yet, Incendies' greatest power is its emotional impact and the way in which it leaves you absolutely stunned at what you just witnessed.\r An incredibly crafted mystery film from director Denis Villeneuve, the ending of Incendies is not one you see coming. In fact, when the reveal occurs, you are left stunned as it is most certainly not what was anticipated. Rather, through shocking twists and turns throughout its story, Incendies is a haunting story of civil war in an unnamed Middle Eastern nation. Telling the story of Christian nationalists who reject refugees against Muslims who accept the refugees, the film breaks your heart from the very first shot of Nawal's involvement in this classic tale. Given the political goings on in the United States today, it is not hard to draw comparisons between Incendies and current events. The fact that Nawal is a Christian who loves a refugee makes this film almost have a Romeo & Juliet feel to it in the very beginning, except this time Romeo actually dies and Juliet brings shame on her entire family, almost being killed as a result. The rest, when told from the perspective of Nawal, details her journey to find the son she and her now deceased lover had together. This journey brings her face-to-face with the Christian nationalists before she winds up in political prison. Nawal's journey is particularly harrowing and incredibly well told. As a character, her motivation is clear: to find her son. The path she takes is solely towards that goal, in spite of her being caught up in the civil war.\r Yet, the greatest influence on the story of Incendies has to be Oedipus. Mirroring the tale as Nawal is forced to give up her son, Nihad (Abdelghafour Elaaziz), for adoption, only to wind up being raped and impregnated by him in prison (unbeknownst to both of them at the time), Incendies gives the viewer the same sickening feeling as Oedipus does. Yet, it takes Oedipus one step further by having their children find out the truth as well. The reactions of the characters is just painful and thoroughly messed up to watch  unfold. Though it lacks the free-will and Oracle elements of Oedipus, it does feel as thought the film's story does bear marks of influence.\r In terms of Incendies itself, it is incredibly well shot to go along with its tremendous emotional power. There is one shot in particular of Nawal crying beside a burning bus she was once on. After Christian nationalists slaughtered everyone on the bus for being Muslims, but sparing Nawal as she is a Christian, the bus burns in the background. The spiraling black smoke and orange flames are gorgeously captured alongside Nawal's pain-filled cries.\r Before the ending is revealed, the mystery is thoroughly well-developed. Always leaving you on edge as Jeanne and Simon discover more-and-more about their mother's previously unknown past, the film really spins a terrific yarn and brings you throughout the region. In the process, it not only explores this deeply destroyed family, but also explores this deeply destroyed region. With many Middle Eastern countries going through this process, the emotional impact of seeing this nation blown to bits is incredible. Upon revealing the mystery, the final letters left by Nawal for Jeanne and Simon, as well as the two for Nihad are absolutely heartwrenching. Filled with emotion, forgiveness, and power, the film reveals its true heart here as it is not just a story about a mother searching for her son, but also a story of forgiving that son for all the pain and suffering he had caused her. Truly powerful in this regard, Incendies leaves an indelible mark on all who view it for this very reason.\r The only foreign-language film from Villeneuve that I have seen, Incendies reveals that I have far more to watch. Having seen all of his English-language works and eagerly anticipating Arrival and Blade Runner 2049, Villeneuve has to be one of the best filmmakers working currently."}, {"rating": "10", "text": "The scenario, the direction, the pacing and sensibility of the horrors of war and endless reprisals. A must watch"}, {"rating": "8", "text": "Lets come to the end of the movie-> What??? Can you think? What a fairy-tale. After the first shock about the revelation, I was asking to myself, how is it possible? It is not...And the woman became pregnant, while her body was being tortured? She even punched her stomach to loose the embryos...With another ending I wanted to give the movie a 10, but the end is a fairy-tale."}, {"rating": "7", "text": "Incendies is a work of art that is at some points very disturbing and quite hard to watch. It is let down by a burlesque ending which is disappointing as the rest of the film is a triumph of modern cinema. I thought the actors and actresses played their roles very well. And there is one scene which I found very, very upsetting. Big thumbs up to this film!"}, {"rating": "10", "text": "Because it’s so good, after watching Canadien/French Film Incendies for the second time, I thought that it must be based on a novel of play. I needed to find out. I now know that it is based on a play by Wajdi Mouawad. Mouawad is a Canadien writer, and to my delight, Incendies is part of a series of four plays. This means I have three more Incendies-like plays still to read.\r I won’t go through a run-down of the plot, talk in abstractions about arch, characters symbiosis or lack-there-of…. there are tons of proper film reviews out there already dealing with these topics. I thought I’d just talk about two things, the two things that I thought make this an outstanding film: Photography, and the remarkable unfolding of a dramatic story; better film critics than me, which is to say any real film critic, have said that this film pulls off tragedy better than the Greeks.\rThe photography… was just as good the second time as it was the first time I saw it. The film opens in a village that could be mistaken for Greece of Israel. At thought maybe this was set and shot in Palestine, but I think most of the film as actually shot in Jordan. Theses shots are actually set to portray a fictional Lebanon, both past and modern day. The history intertwined with the movie seems to be loosely fictional; I can’t find any information on any of the places that appear in film. My Lebanese civil war history is a little rusty. Anyone else?\r There are two shots in particular that stand out. Both are shot at a distance to reveal the vastness of the landscape, unmistakably Mediterranean. Rocky, and the trees, not that I’m a tree expert, but they must be olive or fig trees, they are almost overused as prototypical symbols of the Med, but they work great.\rThe first shot I like is actually two shots, meaning one type of shot that is used twice, almost identically. It’s of a bus traveling on a skinny, mountainside road. At first, the camera is in close then pans way out to show the whole panoramic view, massive landscape, and tiny bus,  a common technique in World films that are shot in exotic landscapes. The other shot is similar. It is later in the film. One of the characters is driving to a modern day Deressa Refugee camp and there is a shot taken from the sky of the winding roads leading up the side of a mountain. This shot is amazing, and whatever effects of filters the photographer added to make it fit the film’s tone so well, I can’t think of a better word to use to describe them, and the shot as ‘cinematic.’ I know that’s a terrible term to use when describing Cinema, I really do, but a shot like this is so expressive and well-placed in the film, there is nothing going in the film here excepts visuals, the shot on it’s own stands out as an artistic, filmmaking achievement.\rThe storyline…unfolds with the precision of a textbook tragedy. It sets up the conflict right off the top--- find missing brother and father. As the drama unfolds the story becomes more and more complex, adding twists and turns to the plot that we never even thought possible. In the end we are left with remains that challenge Oedipus the King in magnitude of ruination, yet still manage to exit the scene with a sparkle of hope. Forgiveness lets the audience breath a little easier as the film closes, a catharsis, but even then the story, the film, will haunt your subconscious for a good while after."}, {"rating": "9", "text": "A very, very disturbing story which was told in so realistic way. This movie haunts me the next couple weeks, i guess. I enjoyed the way this was made; I was hooked from beginning to end. I loved the way the storytelling moved from past to present and so on.  Great movie."}, {"rating": "9", "text": "This is a superbly filmed and paced drama/thriller.  A Quebec family with Middle Eastern roots is forced to confront its painful past following the death of a woman.  She leaves behind a couple of letters for her 2 kids with instructions to deliver them to their father and their brother, whom they had thought to be either deceased or non-existent.  The daughter takes charge and begins a solo investigation back in the old country.  Much of the action takes place in this fictional Arab nation (which has a lot in common with Lebanon), a violent place where war breaks out between Christian and Muslim militias.  The ending is shocking to say the least, and I had to look it up to make sure I had not misunderstood it.  I wonder if there are any Middle Eastern films that take place in fictional Western countries - that would be interesting to see if it exists anywhere."}, {"rating": "0", "text": "Un psychodrame à la mords-moi-le-noeud qui se déroule à la vitesse d'un escargot et dont les enjeux passent par dessus la tête : on n'en a rien mais vraiment rien à cirer de cette histoire socio-dramatique à la con qui ne réussit jamais à capter l'attention.Au contraire le film distille l'ennui à une cadence infernale, ce qui appelle des batteries de baillements irrépressibles... les comédiens sont à la ramasse et l'accent québécois est ici un obstacle non négligeable à la compréhension (où sont passés les sous-titres, christ de tabernak ?)Evidemment, la réalisation du gars Villeneuve qui a fait bien mieux à Hollywood par la suite (mais pas toujours, loin s'en faut...) reste bloquée à deux de tension, ce qui garantit au moins un sommeil de qualité. Même si on espérait un \"vrai\" film à la base..."}, {"rating": "5", "text": "An okay movie, but extremely overrated by critics.The story is basically a two-hour intellectual torture porn, piling tragedy upon tragedy so inflationarily that after one hour, I lost all emotional connection to the protagonist. Talking about protagonists, the three main characters lack depth and development and feel like they are just there to enable the (admittedly rather skillful) telling of the plot. As has been criticised by a lot of other reviewers, the plot twists become more and more contrived to the point of absurdity - which is not a big problem if you accept the movie as an illustration about the effect that war has on the fate of the individual. What's a lot more unfortunate is that exactly this illustration is ill-executed because we get so little insight into the world of the characters. The movie doesn't make a firm commitment to telling either the story of a society torn by war or that of individuals broken by war and, as a result, fails at convincingly telling either of the two.I guess the good reviews are a result of the many - and not very elaborate - references the story makes to topics which are usually well-received by critics, regardless of the quality in which they are presented: cultural oppression of women, sexual violence, child soldiers, perversion of religion for the purpose of war, etc.On a more positive note, it has some very well-crafted and intense scenes and well-picked scenery.In the end, neither Incendies' plot nor its message warrant sitting through two hours of headshots, bombs, rape, child murder, torture and screaming women, so I wouldn't recommend it."}, {"rating": "9", "text": "I am truly delighted with this movie. Unpredictable end, great acting. One of those movies which after watching leave you a bitterness in your mouth."}, {"rating": "10", "text": "I'm speechless, confused and shocked. It is all happened because of the unloyalty to the words of God."}, {"rating": "7", "text": "This is quite a grim, slightly grizzly watch. It involves both war and torture. It has some plot twists and it felt quite powerful as the meaning of things became clear towards the end. Its a bit of a tough watch and it won't appeal to everyone but its a reasonably good film overall. I wouldn't especially recommend it as such because its so bleak."}, {"rating": "10", "text": "As a middle-eastern I believe these stories are not spoken enough. This story isn't about tragic effect of war on society. In contrast, is describing a small religious war, which might not have as adverse effects on society as other tragredies in human history had. But is only talking about the tragic effect on an individual. These wars are happening every day, and god knows how many individuals are being thorn apart.mesmerising movie. Keeps you on your toes until the end. One of top 10 movies I watched."}, {"rating": "10", "text": "10/10 superrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr"}, {"rating": "0", "text": "A movie that almost kills from boredom and yawningI don't know why it was so longThe graphic scenes are bad and very disturbingThe scenes were slow, dull, and weakActing is not that good"}, {"rating": "9", "text": "So tragic and disturbing. It's true that it may be a bit slow-paced by times, but the ending is brilliant and punches you right in the face."}, {"rating": "10", "text": "What an amazing film, it's a movie which is so far and so close, occurs in the other side of the world, but the pain, sadness and love that it transmits is global. The script, the performances, the cinematography, the editing and the directing are excellent, Denis Villeneuve exploits his full potential in a indie film. He also do the same with Arrival but in the category of a big budget. This is my second favorite film of this director, behind Arrival."}, {"rating": "10", "text": "Incendies is the most foreign language war drama film ever made by Denis Villeneuve. This film yet talks about families being separated in parts of tragedies long lost in time for how mothers can be able to see their children again for another time when they are long gone, imprisoned, or dead but there's more to this film I wanted to see in the end. To be real Denis Villeneuve's screen adaptation of a play by the Lebanese Canadian playwright Wajdi Mouawad tells a story-masterfully-of courage, cruelty, family mysteries and a chain of anger that can only be broken by love. To me I say this film was far too amazing."}, {"rating": "10", "text": "Incredible, gripping movie. Definitely one of Villeneuve's best movies. A must watch."}], "recommendations": ["the_road", "frantz", "a_hidden_life", "the_aftermath", "the_33", "the_book_thief", "mine", "hostiles", "the_lost_city_of_z", "allied", "the_secret_scripture", "you_were_never_really_here", "the_guilty", "the_way_back", "sin_nombre", "melancholia", "a_ghost_story", "searching", "donnie_darko", "alpha", "dunkirk", "the_impossible", "13_hours_the_secret_soldiers_of_benghazi", "anthropoid", "silence"]}