{"id": 585, "title": "Incredibles 2", "starring": ["Craig T. Nelson", "Holly Hunter"], "runtime": 118, "genre": ["Action", "Adventure", "Animation", "Family"], "description": "Elastigirl springs into action to save the day, while Mr. Incredible faces his greatest challenge yet – taking care of the problems of his three children.", "releaseYear": "2018", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/9lFKBtaVIhP7E2Pk0IY1CwTKTMZ.jpg", "categories": {"plot": 6.5396825396825395, "acting": 6.678571428571429, "ending": 6.666666666666667, "soundtrack": 7.0, "cinematography": 7.0, "familyFriendly": 6.375, "funny": 6.863636363636363, "action": 6.764705882352941}, "reviews": [{"rating": "5", "text": "The most incredible aspect of this film is the praise it received from critics, incredibly biased towards the nostalgia effect more than the merits a film should have to stand by itself.In essence, Incredibles 2 is an enjoyable Disney Channel Movie, with a premise not worth the length of a feature big screen film. The story is clearly a 90 minutes original stretched in production as far as possible to place all kind of viable items-to-become-toys surplus to the story.Disney is becoming too cynical about their interest on making money over all possible instances (ahem, Finding Dory?) instead of being respectful with the public. It is not a bad film, but a dishonest product just like those x-ray glasses sold in old Marvel Comics: bad for you if you expected the real thing, we got your money anyway."}, {"rating": "10", "text": "Simply...Incredible!!! The wait was well worth it. I just hope I don’t have to wait another 14 years now for number 3"}, {"rating": "0", "text": "Sad that the blatant sexism in this movie still goes under the radar. Yet another movie/show with a father who is depicted as a sort of buffoon who is talked down to by his wife. I couldn't keep watching. The disrespect of men in the western world since the early 1900's is talked about by some notables but hasn't quite made the mainstream yet. I suspect the people who created this film were just trying to do their best and perhaps were portraying how they see/experience life. However, in an era of examination of roles, tropes, and stereotypes men haven't had their fair shake yet. We need a Men's movement in the best sense of the word."}, {"rating": "2", "text": "14 years in the making and it still feels very half-baked. The plot is unoriginal, predictable and features a completely forgettable villain who makes no sense in doing what they are doing. You see a gender swap here where Helen becomes the big hero and Bob is now the stay at home dad dealing with Jack Jack's developing powers (probably the only funny thing about this movie), Violent's typical teenage girl problems and Dash just kind of chilling and not really doing much all film other than an occasional one-liner.So yeah, All in all, this film suffers from some pretty terrible writing that tanks it. Kind of wish they'd stop doing sequels because they just don't even compare to the original for a majority of the time."}, {"rating": "7", "text": "I enjoyed this movie overall, HOWEVER it still is incredibly disappointing and kind of discouraging to see how this movie could have been so much better instead of this safe and corporate sequel we got. Like a better sequel would have been that the film took place years later then right after the last film when the Underminer attacked the city. Violet, Dash, and Jack-Jack can be all grown up, taking up identities removed from their family lineage, Bob and Helen could contemplate retiring now that a newer generation of heroes are taking over. It would have built on more of the family dynamic that worked so well in the first film and it would have been appropriate for fans who grew up with the first film. But instead it's basically Mr. Mom but with superheroes...Okay that's not really fair, there are plenty of things that are good about this film. For one, the family dynamic is still great in this film. As much as I joked before about this movie having the same plot of Mr. Mom, I do like how Bob grows in this film at struggling to raise his kids, which included one touching scene. The action scenes are phenomenal, they make a lot of great use of their powers and setting, especially Elastigirl. I also like how this movie (really both films) feels a lot more like a spy film than a superhero movie, which I mean considering that Brad Bird directed Mission: Impossible - Ghost Protocol, it make sense but still. The animation looks great and it is a ton of fun to see the characters updated with subtle updates to their models. The humor is pretty great too, especially from Jack-Jack which I was not expecting to like that much (although it is more of the characters reacting to Jack-Jack). The music is basically the same from the first film, but I mean the score to the Incredibles is one of the best film scores of the 21st century so who can complain?Okay so for the bad.  A lot like Mr. Mom (which no I will not shut up about), the characters never grow and they just end up right where they were when the film starts. Helen never learns any lesson in the end, Dash and Violet don't get a lot to do, and while Bob does have a meaningful plot about being a good dad, he pretty much just ends up being the same old Mr. Incredible from the last movie! I don't feel like any lessons were learned or any growth given to them. The dialogue can be pretty crap too. The whole legalizing superhero plot is incredibly on the nose and lacking any tension as it's never challenges any of the characters, along with some cringe-worthy lines that just do not sound right when the voice actors are delivering them. But the big issue is the villain. Screenslaver sucks! For one it is so obvious who Screenslaver is, trying to have like a red herring twist to it that is never convincing, and also the motivation they give Screenslaver is just terrible! I mean say what you will about Syndrome, at least he was well rounded, was interesting and had quirks that made him unique, and his motivation made sense to his character!Overall I get why people will not like this movie, but I still enjoyed it personally. But it really could have been so much better than bordering on average!"}, {"rating": "6", "text": "This is like Finding Dory to me. It made me think about my memories with The Incredibles, but this film doesn't have anything special. Predictable Storyline, Weak Villain, Slow Plot works badly, but the characters, speedy actions are great. Pixar may gain a lot of money, but they failed to make a masterpiece."}, {"rating": "7", "text": "Not incredible enough for me!Lower than the average Pixar movie. Clearly, It does not deliver. Not as good as the first one. Still a good movie, though.The writers didn´t push any envelope. Action scenes are nicely done but storywise the movie is lacking of the entertainment, freshness, and 'incredibility' from the first one. It slow and patchy at times."}, {"rating": "7", "text": "Incredibles 2 ended up being pretty much what I feared it was going to be, more of a cartoon. However, although it never comes close to the original, it still is very entertaining and tons of fun."}, {"rating": "7", "text": "Good movie, i enjoyed it, but, the first one is much much better. The story (in the 1st one), the ambient, the plots, were just very interesting and realistic in a deep way.you really cared about the characters and villians on the first movie. Here, it just feels like a safe, easy going sequel. lacks of action, the antagonist is weak and predictable as hell. It has funny spots and moments, i like the redesing of the characters, the new ones look okayish, but, my problem goes with the plot, so bland, so safe, nothing really interesting to see after the first one. Pixar is going downfall since the last years, yes, deal with it, Pixar movies are not reaching their standars like before. Fun movie, entertaining, but, its bland and safe. I expected a better plot, ambient and structure here. 6.9/10"}, {"rating": "4", "text": "The original was a clever inventive highly amusing sendup of superheroes and spy thrillers at a level only Pixar could do and one of their best in a long run of out of the park home runs.  This along with almost everything they've put out since 2011 is lackluster, strained, tired retread and suffers from the same overlong, seen it all before, cliché laden action fare it's supposed to spoof.  Sure same high production and artistic standards, but what's fresh here?  Maybe the novelty of computer animation has worn off, or more likely it seems for Pixar it used to be:  \"We have a good idea!\" whereas now it's \"How can we best do another of these?\" and sadly the result is the magic is mostly gone."}, {"rating": "7", "text": "I loved the first one so i was looking forward to this. It was a mixed bag of good and bad for me. There a lot of nice action set pieces mostly involving Elastiwoman .The animation was sharp and beautiful and the sound was great.The film is heavy with feminist themes .Mr Incredible is the typical dumb man with toxic masculinity and the women in the film are the smart ones .They do a work reversal with him staying at home and being house dad and her being the hero so we get the guy struggling of course. They are pretty blunt with the hammer sometimes and i could have done without it really but i guess that's what we're in for now for awhile.The plot was decent and interesting.The best parts were involving jack-jack and the kids really,especially jack-jack.Edwina or whatever her name is,the suit designer was excellent as well.So overall i enjoyed the film but could have used less social justice."}, {"rating": "7", "text": "It's very rare that Pixar has a misstep. Thankfully, Incredibles 2 is not one of those missteps. It's a riveting, fun adventure for kids and is just as entertaining for the adults, even if it never reaches the masterful heights of its predecessor.I think that the first Incredibles film is a masterpiece. What made it so great is that it had--in addition to its eye-popping beautiful animation and action--an emotionally affecting story about a married couple that rediscovers how much they rely on one another, how neither one of them is complete without the other. This made it so much more powerful because it was deeply resonating for adults while still being very entertaining for the whole family. Incredibles 2 is certainly still a lot of fun for the family, but I just didn't feel that it had the emotional heft that was boasted by its predecessor. There are some sweet scenes that explore the dynamic of the Parr family that elevate the story, but they feel much more forced with dialogue that often doesn't come across as natural.The weakest aspect of Incredibles 2 is its story and villain. Neither of them is bad by any means, but there's just nothing unexpected about it. 15 minutes into the movie, it's clear what the direction is and the plot then proceeds to follow expectations beat for beat.That being said, Incredibles 2 is another fantastic achievement from Disney/Pixar. The animation is so fully realized that I could not believe my eyes. The color perfectly sets the tone of the scenes, the action is perfectly choreographed and constructed, and while some of the humor feels shoehorned into the script, the vast majority of it works very well and it all adds up to make this sequel a great summer film and a crowd-pleaser.Story: 4Acting: 9Script: 6.5Visuals/Sound: 10Entertainment Value: 7.5Overall Score: 7.4/10"}, {"rating": "4", "text": "I always loved The Incredibles, having originally seen it twice in theaters, something rare for me, because it met my peak of superpower fascination as a twelve-year-old. Today as a film studies undergrad, I continue to cherish how it retells classic familiar superhero tropes through a bleak commentary on legitimate discrimination at a time of nuclear threat. Second to Toy Story, it stands as my favorite Pixar motion picture. So right when Pixar announced this sequel, I knew it would become nothing more than unnecessary, lazy fan service.Turns out I guessed correctly.Now I shall go on to explain why I hated The Incredibles 2: Rather than realistic revision of classic comic book tropes, it embraces them, right down to the villain’s predictable secret identity. Unfortunately, it goes beyond mere unoriginality; more like serious inconsistency. I mean, hero work is said to remain illegal, except how did this family of supers steer clear past prison bars three months after destroying Syndrome’s Omnidroid v.10? Even more noticeable, the family’s lack of knowledge about Jack-Jack’s powers until about midway through the film contradicts the previous feature’s climax.I’ve voiced before serious disdain towards superhero flicks, but I do believe it can be done right with the right level of care. Heck, fourteen years ago; besides SpongeBob, my favorite show was Teen Titans--I even made each new episode an event by dragging my Dad into watching them all with me (since I thought he might have enjoyed it too). Those fantastical beings’ characterizations were consistent, instead of carelessly thrown around like here.Plus, it also contradicts its own message. The main villain, “Screenslaver,” says TV stops our communication, with no thanks to supers, yet here these screenwriters go freely celebrating supers on a giant screen! On a personal level, Bob lies to his wife without facing punishment, making him less sympathetic. At a deeper level, a hollow liberal “Make All Supers Legal Again” act drives the key narrative without ever addressing the real meat of the discrimination issue it attempts to talk about.You may think, “Hey! It’s written AND directed by Brad Bird… who gave us the first addition!” Well, remember Tomorrowland? Keep anticipating his eventual comeback folks. Just like that George Clooney embarrassment three years ago, miniscule originality comes out of his newest project, he rather just copies other iconic comic book movie scenes. One example: an early action sequence copies Spider-Man 2’s train stopping to far weaker results. Another example: the villain’s key weapon, mind control, has been overdone to death in other superhero plots.Okay, pop quiz: what do kids love to watch more than anything?A) Intellectually stimulating educational programs.B) A Mister Rogers documentary.C) Julia, the first autistic Muppet.The answer:D) A baby fighting a raccoon bandit.Jack-Jack’s screen time tops Dash or Violet combined, who unlike the baby go through growing pains necessary to the story. Consequently, Jack-Jack turns each sad moment suddenly funny under a surface-level Marvel mentality that hurts the entire viewing experience.Although to be fair, it’s understandable why most people love this sequel to The Incredibles. The foul script’s blame shouldn’t go on the reprising voice actors, since Holly Hunter does act well through her vocal work to match Elastigirl’s new exhilaration of feeling fifteen years younger, while Craig T. Nelson delivers a fantastic common core joke perfectly. Beyond the voices, there is some value here and there, such as Bob’s amends to become a good pop, and a memorable spectacle that pits Elastigirl against someone inside a brainwashing room, six walls blaring hypnotic swirls, her eyes closed for the whole fight. Violet also gets a fair share of great hand-to-hand combat worth her pre-established adolescent problems. Though Dash doesn’t do much other than attempt math homework, possibly to make his feeble motivations less obvious.Like the imbalance between the attention of the characters, the odd arrangement of the two subplots between the mother and father rattles both by a choppy tone, building up to a forgetful visual-driven climax. From the first act, Helen’s growth literally falls back at square one; her letting Dash and Violet help still raises her skeptic fear as if nothing happened since the first movie. It barely can even be called quality family entertainment: some dialogue says the word, “damn.” Inappropriate for a PG rating!If anything, the hopping lamp company’s gradual downfall into sequel madness only made me further appreciate their older works. We deserve better than an ingenuine nostalgia commercial. Sorry."}, {"rating": "6", "text": "Admittedly this film was never going to match the 14 years of hype build up around it. But having said that it never really felt like it came close.It is unfortunately and almost directly recycled plot from the first movie but in a slightly worse manner. It also had a hugely dissapointing lack of actual powers used in it and a story much to focused on Jack Jack.By no means a bad movie, but not a scratch on the first. If i didnt already have love for the franchise i would of probably rated this lower.A fine family film for a rainy day but dont go out of your way to see it."}, {"rating": "9", "text": "So the Incredibles is back, and it’s safe to say that the sequel has definitely paid off after a very long hiatus. After fourteen long years waiting for a heroic sequel for the Incredibles, the voice acting, clever script, and animation has been fully upgraded for clearer entertainment. Is it better than the first? no. But does the sequel deliver? Definitely! And trust me, you will definitely have a blast seeing this flick with your family and friends."}, {"rating": "6", "text": "“Help me bring supers back into the sunlight”.It’s been 14 years.After all these years and sitting through three ‘Cars’ movies - The only sequel that needed to happen has finally happened. It couldn't come quickly enough. Because I cherish ‘The Incredibles’ on multiple repeats when I was little. Also losing count of how many times I've played the PS2 game version. So yeah, this meant the world to me and anticipating a sequel for a long time, just like everyone else.While ‘Incredibles 2’ doesn't quite hold a candle to the first, but still, I liked it. There’s a lot to like and enjoy. And yet recognize it’s flaws as well. It's not a disappointment, which makes me happy, just judging by Pixar recent involvement with it’s sequels.Brad Bird is a talented film marker and storyteller, both in animation and live action. In animation however is where he really shines. Bringing a rich style of nostalgia that clearly influenced his personal life - Going back to the golden age of cinema and inputting into his work. Same thing applies with this movie and managing to keep the level of quality strong after all these years.The animation was great, now that’s nothing new, yet this needs repeating. It’s bright, colorful, and full of life. Pixar always succeeds in animation. The choreography during the action sequences was energetic and exciting with the animation being glue to hold it altogether.The character’s screen time is perfectly balance so you got to see just enough of everyone. Probably the most enjoyable part of the whole movie is watching Bob (Or Mr. Incredible, if you like) trying to take care of his kids. I think the reason why is the family dynamic and the reverse roles in that situation. Most of the heart and humor are in those scenes. I mean, it’s better than the actual plot itself involving Elastic girl.Now this ties in with my main issues: The villains are paper thin and painful generic. I don’t want to spoil anything, but then again, the movie basically spoils itself from having a predictable narrative. When the villains motivations are revealed it’s pretty ridiculous and you just don’t buy it.I wished this wasn't a continuation from the first, especially when you notice the actors who voiced these characters sound much older, since this takes place immediately after the original. It would've been a lot better if it was set years later in a new time period, where more homages to campy superhero movies and TV shows, because around the 60’s or 70’s, the genre itself got more corny, but also gives Pixar more material to work on and have a creative spin on it. I know it may seem unfair to keep comparing this to the first, but this movie does everything it can to remind you of the first film, including plot points- So not really.Oh and is it just me, or dose Catherine Keener character model looks exactly like Roxanne Ritchi from ‘Megamind’.Overall rating: ‘Incredibles 2’ is a good movie and came out around the perfect time where superhero movies are bigger than ever. I can safely say it was worth the wait. Again, not quite as clever or excellent, although I am glad we finally got a sequel, good or bad.I’ll see you in 25 years."}, {"rating": "6", "text": "The Incredibles 2 is a sequel id been hoping for for 14 years. It had to happen and was always going to at some point, and it is a truly good film. The switch of focus to Elastigirls perspective of crime fighting is welcome and the returning and new characters are charming. However there are a few gripes i have with it my main being how much of a continuation of the first film it felt like. It didn’t need to take 14 years to tell a story that was mildly predictable and had elements ripped straight out of the first film (a train heading straight for certain death, prejudice against supers) and there was cringe child dialogue that felt like it was from an Illumination Animation feature. HOWEVER this film is very fun and a blast to watch, Pixar is back on its winning streak."}, {"rating": "0", "text": "this was a terrible movie not worth waiting for 14 years.................trash"}, {"rating": "6", "text": "I see people criticizing The Incredibles 2 for it's apparent “foul language” and for how “it's not suitable for smaller children.”  In the first movie we literally see a man jump from a 10+ story, city building with the intent of taking his own life,  for some reason that's better for your children than them hearing some characters using words like “damn” and “hell” in commonly used phrases; or the parents becoming so called “zombies” for a short time.Are you kidding me? That is the most absurd criticism I ever heard and really goes to show how much people are sheltering their children nowadays.I wouldn't even say this movie was “darker” than the first movie.  If you  go back and look at the fist films plot,  it's about how superheros can't do what is morally right  because of corporate heads who only care about money. This is dark in of itself. The start of this movie was almost the same as the first. Superheros who cant do their jobs get a random invitation to do superhero stuff again.  This time, instead of Mr. Incredible doing all the superhero stuff Elastigirl gets the spotlight, while Mr. Incredible is at home babysitting the kids. The villain in this film is much weaker than Syndrome from the first movie. Syndrome had a pretty okay reason for wanting to do the bad stuff he did.   Unlike the villain in this movie, who just came off very petty and pathetic.Even the new superheros who were introduced didn't not play a well enough role in the movie. We barely saw them, let alone saw their powers used in a well enough fashion for them to be considered cool superhero characters like they should be.I'd honestly say the best parts in this movie were when Mr. Incredible was trying to be the best dad he could be, by trying to fix his daughters relationship and taking care of Jack Jack.The animation, colours, and everything visually was far, far superior of course but, unfortunately that was the only thing better about this than the first. That being said, was this a bad movie? No. Was it entertaining? Yes. I'm simply comparing it to the crazy standards the first movie was able to set and I don't think this movie was original enough or innovative enough to exceed those standards."}, {"rating": "10", "text": "A SEQUEL THATS WELL WORTH THE WAIT i loved the original and i loved this its best sequel weve gotten this year the characters are great the jokes are funny the the character arcs for mr incredible and violet worked great the villain of the movie was kinda underwhelming but the movies less about the villain if you liked the first then i highly recommend you go see this"}, {"rating": "6", "text": "My expectations are always high when its a Disney animated movie for obvious reasons.  This one for me is just an average Disney animated movie.  It's not a classic nor is it innovative enough.  But its not a bad movie.  It's good."}, {"rating": "7", "text": "Considering the first film is my all-time favorite Pixar film to this day, I had pretty high hopes for this to be just as good, if not, better, and that this 14 year wait would really pay off. The result is a fun return, yet one that came up a bit short of my expectations. Really all it felt like was a role reversal of the first. Instead of Mr. Incredible going out to fight crime/the main antogonist and getting captured, it's the exact same things only with Elastigirl this time. Certain side plots felt a bit rushed as well, particularly the opening moments of the film, and it also copied a scene from the short 'Jack Jack Attack' almost word for word, which was a bit amusing but mostly came off as kinda lazy to me. Nevertheless, the action of course is bigger and more colorful than ever and it's got its fair share of fun and humorous moments as well, especially with Jack Jack, but I also wish there could've been slightly more screen time for Edna Mode as well. Overall, it's definitely a fun sequel that's worth checking out, as it gets the job done in terms of entertainment, but I personally felt that it doesn't hold a candle to the first."}, {"rating": "7", "text": "Tons of fun, neat villain, awesome new characters, poor sequel. WARNING: there is a scene that contains tons of flashing bright lights that seems like it could harm photosensitive viewers. Incredibles 2 was a blast to watch in the theater with awesome fights and jokes that were laugh-out-loud worthy. The villain was insightful and, like most great villains, had a great point to make. I especially liked the creative ways they use the different supers' powers, with each new fight feeling like more than a punch-fest with particle effects. Marvel should take note. One gripe that really bothered me, however, was how they handled Mr. Incredible himself. At the end of the first Incredibles movie, Mr. Incredible had undergone an epic personal journey. He began as a selfish father seeking the glory and adrenaline of his past, to the detriment of his friends and family. After facing numerous challenges and nearly losing his family, he realized that his family was his greatest adventure and became a good father. At the beginning of this movie, all the lessons Mr. Incredible learned have been thrown out the window. He's back to being a bad father who seeks personal glory, only this time he's more violent about it. As a sequel, this seemed to undermine the value of the first movie."}, {"rating": "10", "text": "Remember in 2004, when the biggest hit of the last quarter of the year that you should already be aware of its existence by now named The Incredibles was in theaters? It was literally the best experience to be in theaters and watch The Incredibles in the big screen at the time. Even if you didn't see it in the big screen when it was in theaters, there's always a chance to relive the experience with Incredibles 2, easily taking home the best movie of 2018 without any explanations or doubts. You clearly do not want to underestimate this film since, like the first movie, it's got enough strength to live up to its title name in particular. It's got what you've seen in the first movie, like basically everything that makes this sequel worth watching. The biggest question comes to mind though... was it worth the 14-year wait? If time went so fast that mentioning 2004 immediately turns the events of that year older than you can already think out of your mind, I say it was definitely worth the wait."}, {"rating": "7", "text": "A decidedly inferior, yet enjoyable sequel, featuring Pixar's signature animation and director Brad Bird's unique take on the superhero genre. In terms of anything that's improved, I'd say the fight scenes and set pieces in this one have gotten a welcomed amount more intense - something I'd imagine that the improvements in animation has paved the way for. But other than these things, \"Incredibles 2\" never really wowed me with its thematic content or narrative developments, especially when it came to its villain. But they can't all be Syndrome, I guess. Still, this is a fun, expertly designed film that just reaches the \"worthy enough\" zone in terms of following in the footsteps of its predecessor."}, {"rating": "5", "text": "Definitely NOT one for the smaller children.  Two days later my 8-year-old is still having concerns at bedtime. A lot of parents on the boards complain about the foul language but that is the least of my worries (my wife didn't notice it) but when kids see their parents turned into \"zombies\" and are left alone in the world (a child's biggest fear) then this ceases to be Disney fare and becomes a different sort of movie.  Definitely PG-13, I'd say keep 'em away if they're under 12.  Lots of violence, lots of parents being blown away (off-screen)."}, {"rating": "7", "text": "Incredible 2 is a good movie. The story was kind of following the Marvel trend in a way. The humour was just ok for me, and there wasn't a sense of novelty anymore. I though the movie was too dark in general and lack the colour quality of the first movie. The voices were amazing. The pace was good but the movie seemed a bit long at one point. In that sens I am not sure it's for a very young audience. Kids might be scare of some elements in the movie. I give it a 72%. There is no need for a third one I hope. Maybe a spin-off from one of the heroes."}, {"rating": "10", "text": "Whether you like superhero movies or not, \"Incredibles 2\" is a must-see. Pixar's newest - 20th - film reminded me why I fell in love with the original. The dazzling animation, the relatable and realistic heroes, the honest and subtle emotional momments, the funny and serious way it deals with superheroism, the scenes with the fabulous Edna Mode, the menacing villain with the dark aims, the family spirit and the extremely talented cast are all back once again, to tell a story worthy of its predecessor and the decade long wait - although I do hope it won't take that long for a third film."}, {"rating": "9", "text": "Really good film. It's a rare franchise these days that you KNOW is going to deliver with confidence.  I'm so glad that the voice actors all returned (Craig T. Nelson and Holly Hunter in particular).  The action is terrific, and the look and feel of the animation is spot on.  Kudos to Pixar!"}, {"rating": "7", "text": "The original Incredibles is not only one of my favorite animated movies, but it's also one of my favorite superhero movies ever. So there's no doubt that this long-awaited sequel was one of my most anticipated movies of this year, especially before seeing the trailers! I didn't like the trailers, the first one in particular, because I predicted that this movie would lean heavily on a formula we got tired of. This formula includes two messages; the female empowerment, and \"taking care of your family is the true superheroic act\", and that's exactly what we got in this movie, especially the first message, it's a political issue, so .... why not? This formula didn't just make everything in the movie looks like I've seen million times before, but it also made this movie feels outdated. Actually, the problem isn't only related to the messages, but the plot itself is formulaic and outdated for a superhero movie. Almost everything happens, every event, every element, every part in this movie is archetypal.The developments of the story are typical. The characters are slightly developed, but also in away that doesn't feel authentic or original by any means.The villain, Screenslaver, is stereotypical and feels if he comes from an old cheesy superhero movie, or an animated movie from any animation studio except Pixar. This villain even acts like The Joker, so that's saying something. Even his motives are well-worn, and he revealed them in a single monologue. Yes, this very monologue that Syndrome mocked in the original movie. So don't expect a villain like Syndrome. So don't expect to see a villain like Syndrome. And of course, we have a plot twist in this movie but I saw it coming from far away, so it definitely didn't work. Also, what leads us to the ending is rushed and quite absurd. Nevertheless, there are some subtle plot details in the part when Elastigirl was fighting crime. They leaned so heavily on the humor in this sequel. The humor wasn't bad at first. In fact, almost every joke that is related to Jack-Jack worked, and I couldn't help but burst out in laughter almost every time he made a single noise. But the jokes became repetitive, so they lost all their sharpness. Also, the timing of the humor was very bad at the third act. What's worse, at least for me, is that they made Bob Parr a total moron so he can be the comic relief while making Elastigirl the real heroine of the movie. Now, Dash is my favorite Incredible! What a likable character he is! He is very cool, and all his actions are fit for his age. That gave this character a sense of reality. In fact, all the characters act if they were real. When they interact with each other, when they get tired, when they become happy, when they laugh, even when they breathe they feel if they were actual people, if they were humans, and that's really INCREDIBLE! All the cast is great, as usual. But Holly Hunter who shines in this sequel. She gave even more energy Helen Parr/Elastigirl.I was worried because they replaced Spencer Fox, the original actor who voiced Dash, but I think Huck Milner is even better! Frozone had much more time in this sequel, and that made this character seems much more like Samuel L. Jackson, and of course this is a bonus! Jack Jack's new abilities are basically perfect, both in what his powers are and in how they are revealed. Michael Giacchino's score is gold, and well-used. The animation is top-notch and seamless. But it's the action in this movie that should have a fair share of praise. Incredibles 2 has some of the most thrilling and exhilarating action sequences ever in an animated movie, if not memorable enough. The movie full of flashing lights that aren't just annoying, but they really can be harmful to the eyes, especially if you watched the movie in 3D. I'm sorely disappointed, but I'll try as much as I can not to make my let-down affect my rating, especially because most of the issues I've with this movie are related to one thing, the triteness that I, as a Disney/Pixar fan, didn't get used to. (7/10)"}, {"rating": "10", "text": "Telecommunications guru Winston Deavor enlists Elastigirl to fight crime and make the public fall in love with superheroes once again. That leaves Mr. Incredible with one of his greatest challenges ever -- staying home and taking care of three rambunctious children. As Violet, Dash and Jack-Jack offer him a new set of headaches, a cybercriminal named Screenslaver launches his dastardly plan -- hypnotizing the world through computer screens. Incredibles 2 reunites Pixar's family crime fighting team for a long-awaited follow-up that may not quite live up to the original, but comes close enough to earn its name. Final Grade is an A+."}, {"rating": "10", "text": "Our family went to the drive-in to see this.  Everyone really enjoyed the movie.  Highly recommend!"}, {"rating": "0", "text": "No Has a lot of problems and I don't enjoy it I really hate itdon't waste your time"}, {"rating": "8", "text": "Decent, well made, fun, animation movie by Pixar, albeit reasonably predictable. Not quite good enough to be great. Fun and lots of action. My kids liked it better than the first Incredibles they'd seen again just a couple of days ago, but I don't share that opinion. If I take their opinion into consideration an 8 is well deserved, otherwise it would have been a 7 (and a half) from me. Good movie to see with the kids."}, {"rating": "6", "text": "The visuals are good , the fight scenes fun , but the paint by numbers story is disappointing. Watched it on Apple TV , clicked fast forward a lot ."}, {"rating": "6", "text": "It was fine, but to be honest I thought it was a little boring. Because the \"surprise\" villian was way too obvious, I probably would have preferred it not be an attempt at a twist, as it actually just wasted story time, and that story time could have been used to develop the kids more, who were really treated 2 dimensionally, (for instance the daughter's story just was almost like an after thought). Baby scenes were the most fun, and quite frankly, I think they could have done the whole movie about being a super hero family and trying to manage the three kids and the kids development into supers and people at the same time.  Maybe for #3?"}, {"rating": "7", "text": "I enjoyed it well enough.It's missing an interesting villain and I think that is the main difference between this and the first one.Lack of humor, not that it's required but it just felt off like people in the theater were trying to laugh but the opportunities where few and far between."}, {"rating": "4", "text": "Incredibles 2 is a completely derivative pointless cash grab from Pixar that shows their quality output is decreasing by the year. I had high hopes this would at least match the original masterpiece which is one of the greatest superhero/family films made with its enduring characters and themes that deconstructed the modernity of family life through Randian objectivism of its era. However, this trash film is basically a rehash of the original with little plot and one of the most subpar villain ever put on screen. Whilst there are some good laughs and the quality of the voice acting and animation is pushed further, the non-sensical plot, snail-pace pacing with the most boring A-B storyline and rehashed moments, puts this sequel as one of the worst and most disappointing film of all time. Its a shame Pixar has seemingly been dumbed down ever since Disney has purchased it. It makes me fear what Toy Story 4 will end up being after this garbage-trash tier film."}, {"rating": "9", "text": "The villain may not be anything special, but the 14 year wait was wholeheartedly worth it in the end!"}, {"rating": "7", "text": "Every Super Hero movie demands a good villain. Unfortunately, The Incredibles 2 fails in creating a good one. The script is fine, i would say good for an animated movie, but overall predictable. Technically the movie shines, not even one complain, visually and audibly. Characters, Flash couldn't be more useless, Mr. Incredible is more annoying than ever, Violet is also pretty annoying (reasonably), and Elastigirl is by far the best character in the movie (after Jack Jack). Also Frozone is still super cool.So, overall, the movie is good, but tremendously hurt by its script and villain."}, {"rating": "8", "text": "Not as good as the original Incredibles but still a great Pixar movie. The animation just keeps getting better and better and it really shows in this one as the animation in this film are amazing.  great watch or adults and kids alike. Wasn't a perfect movie by any means as movie was pretty predictable at times but still a very enjoyable watch. Just hope we don't have to wait over a decade again if they decide to make a sequel."}, {"rating": "6", "text": "The movie was a bit of a disappointment, my expectations were too high.  I really loved the first one, but there wasn’t as much to keep my interest the second time around.  One of my friends fell asleep during the movie and complained about it afterwards."}, {"rating": "7", "text": "So to start off, this movie could easily be a 6/10 simply because of how lazy Mr. Incredible's parts were. It's easiest to review this film by taking apart the two plots. Mr. I at home and Mrs. I at work, as well as what happens before and after. First, the movies begging. Pretty good, actually. The beggining fight scene with the villian known as the underminer, was pretty solid. Second, we get into the part where the incredibles get in trouble for being heroes when heroes are illegal. They get in trouble blah blah blah. Later Mr. and Mrs. Incredible are apprached by Frozone and he tells them there is a guy who wants to make heros legal. Ten minutes later we learn about this guy and his sister and Mrs. I is choosen to go into hero work and let Mr. I stay home with the kids. This is where we see Mrs. and Mr.'s incredbibles realationship show. They have an imperfect bond and I like how their relationship with each other was written. Sadly though, this relationship is underultilized. Now, into the two main plots. We'll start with Mr. I and his plot while he watched the kids at home. This plot was unfortunatly very lazily written and the worst part of the entire movie. Everything her has been used before. Its just the same dad has trouble taking care of the kids while mom is away with the work Superhero slapped on. Violets boy trouble, Dash's boy trouble, and Jack Jack being a problem because he's a baby. The only thing that makes these problems original is the fact that they are caused by superhero powers (save Dash, he's apparently just bad at math). Despite plot problems, I will give this part of the plot this: Its surprisingly funny. Its not always laugh out loud funny, but you'll find yourself smiling or chuckling at times. Edna's scenes were by far the best and most humorous. I mean, Mr. I's part of the plot was really only comic relief and was only really important at the end of the movie. Next, Mrs. I's plot. I loved Mrs. I's plot. It was fun, action packed and honestly, just really enjoyable. There were no humorous themes and the plot got a bit dark at times which I appplaud. On top of that the action scences are really fun the watch and the villian was really interesting, even if at times her interesting villian motivation ended up being a bit unrealistic. Now comes the twist, the villian is the sister of the guy who wants to make supers legal. She believes her father died (he was shot), because he depended on the supers to save him to much, even after they were made illegal. Its a interesting motivation, even if it is a tad unrealistic. She is known as the Screenslaver and the scences where she uses optical illusions to control people are really cool. Now we get to the part where the two plots intersect. Screenslaver takes control of Mrs. I lures Mr. I to Mrs. I and enslaves him two, and well as enslaving a lot of other heros. I dont know what to say about the conclusion. There is nothing wrong with. The kids free Mrs. I who frees Frozone and Mr. I and they stop Screenslaver from crashings a boat into the city. Supers are made legal, blah blah blah. In conclusion while Mr. I's parts were bland and lazy save some humor, Mrs. I's were fun and intewresting. I found myself able to tolerate the movies many weaknesses due to its stranghts. Where you give this a six or a seven depends how much you liked the jokes and Mr. I's parts. Mrs. I's you'll prouboubly find most people enjoying. PS: The music was also good."}, {"rating": "7", "text": "Incredibles 2 has a scope that both reaches to the past and extends forward into the future.  What I enjoyed the most was the family element, what makes a family, and also how different family dynamics can play out.  I found the Parr family struggling with their new situation very insightful and entertaining. Edna was wonderful and Jack Jack was endearing, though by the end I found it a little ridiculous with how many powers he started to exhibit.  The villain, though the reveal and character switch was a little predictable and contrived, I found their motivation very compelling and relevant in today's age and added to the suspense. In summary: It was very satisfying, funny, and compelling and I can't wait for the next one. PS:-- The short at the beginner (Bao) was very touching.  Not as good as Chess Game, but then what really is right."}, {"rating": "8", "text": "\"Incredibles 2\" faz valer a pena os 14 anos de espera. Apesar de o vilão não ser tão forte, enquanto personagem, o filme ainda fala sobre a maturidade, as responsabilidades e as realizações pessoais.8/10"}, {"rating": "7", "text": "A decent movie with really good  fighting scenes.But they are some inconsistencies  like in the first movie they knew that their baby had super powers but in this one they just find out that it has powers??Also the villain is pretty boring and cliche"}, {"rating": "8", "text": "I really enjoyed this one. I haven’t seen the original in forever (I know, I’m a bad Pixar fan), so I can’t really compare it to the first movie, but from what I remember of it, this seemed to get across the same spirit. It had great comedy, great animation, great action, and a good story with good characters! It’s very well-written and well-done overall, and I recommend it to anyone!"}, {"rating": "0", "text": "They just reversed everything they could see....its actually an animation for women...."}, {"rating": "6", "text": "It’s pretty much the exact same movie as the first one, near beat-for-beat at points, and never truly justifies its existence after a 14 year wait. Still, the voice acting is solid and there are some thrilling moments. My childhood wasn’t anywhere near ruined."}, {"rating": "10", "text": "If more movies were as good as the Incredibles Two, the world would be a lot more super."}], "recommendations": ["turbo", "bumblebee", "despicable_me_2", "minions", "hotel_transylvania_2", "the_lego_movie_2_the_second_part", "the_lego_movie", "penguins_of_madagascar", "hotel_transylvania_3_summer_vacation", "ant_man_and_the_wasp_quantumania", "shazam_fury_of_the_gods", "guardians_of_the_galaxy", "the_secret_life_of_pets_2", "avengers_age_of_ultron", "shazam", "the_croods", "terminator_genisys", "kingsman_the_golden_circle", "despicable_me_3", "love_and_monsters", "teenage_mutant_ninja_turtles", "super_8", "tomorrowland", "the_lego_ninjago_movie", "jack_the_giant_slayer"]}