{"id": 1143, "title": "Independence Day: Resurgence", "starring": ["Liam Hemsworth", "Jeff Goldblum"], "runtime": 120, "genre": ["Action", "Adventure", "Science Fiction"], "description": "We always knew they were coming back. Using recovered alien technology, the nations of Earth have collaborated on an immense defense program to protect the planet. But nothing can prepare us for the aliens’ advanced and unprecedented force. Only the ingenuity of a few brave men and women can bring our world back from the brink of extinction.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/9S50foUIYGwiNPWOxi1WJF6IPwI.jpg", "categories": {"plot": 4.866666666666666, "acting": 4.512820512820513, "ending": 4.666666666666667, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.076923076923077, "action": 5.35}, "reviews": [{"rating": "5", "text": "Like all of Roland Emmerich's films the dialogue is absurd and the acting is over the top, but there is some fun to be had.  Jeff Goldblum was the best part for me he seemed to embrace his old role.  There are way to many characters in this movie some having nothing to do with the plot.  Judd Hirsch and his sub plot was so unnecessary, he was just here because he was in the last movie.  Overall this is an overstuffed ridiculous bit of fun.  C+"}, {"rating": "5", "text": "The sequel to the sci-fi blockbuster with the same name is a catastrophical failure. There’s no fun, no stakes -- only a messy CGI bash of nothing! We get way too many characters, some are old ones and other are completely new – but there're no inside to any of them. They’re just there to carry the story on, but we barely get to know them. Their interactions are neither that excellent, but the actors did a great job to visualize their characters – but what a waste of talented people! Still; it’s one heck of a ride with a massive amount of great action & sci-fi, and it’s without any doubt fun to finally see the classic characters back on the big screen. But what’s the fun in a film where the story is rushed, badly written and full of expositions – nothing! It’s like they came up with the basic premise meanwhile shooting the film! There are no stakes, no real want-to to win, not even to the action. It just drags along. Even though – I did enjoy the film form an action/sci-fi point of view. It's one messy, but fun ride.\r Personal rating: 45/100\rCritical rating: 25/100"}, {"rating": "5", "text": "There were too many stupid jokes, empty dialogues and characters. The alien sphere was too amoebic. It seems like the Independence day created for people with low iq"}, {"rating": "2", "text": "Simply put, this is a movie that shouldn't have been made, but studios will do anything they can to separate you from your cash.  This movie is exactly the same as the first, they just doubled down on everything.  Bigger White House, bigger aliens, more ships, etc.  The only things they got right was not having Will Smith in the movie, and giving us double the Jeff Goldblum."}, {"rating": "1", "text": "Pure disgusting, filthy, trivial, ridiculous, junk & trash. Grotesque, not deliberately, not funny, stupid. Take only audio-track and make it play on a Dolby system, the rest is really sh*t."}, {"rating": "4", "text": "It's hard to nail down where this movie goes wrong exactly.  Probably because it goes wrong in so many different ways, but not so much to fall completely flat in any one category.\r Only ten minutes in and you'll realize the story is far too disjointed.  There's no flow to the movie.  There's no time to make us care about the characters, or for character progression, or much in the way of back stories.  Which might not be a bad thing considering how bland the new cast is.\r Also, if a movie is going to take itself serious, it better make logical sense.  This movie had so many cop-outs and miraculous coincidences, it's difficult to suspend your disbelief long enough to actually enjoy it.  The characters often make incredible leaps of insight that no one could actually do.  \"They're drilling.  Oh, they must be here to harvest our molten core!\"  What?  How'd you come to that conclusion?  I mean, even the opening credits had a logic fail, where the aliens somehow had a recording of the President's 4th of July speech from the original movie!  How exactly did they get that?\r I think the biggest problems with this movie were the screenwriting and the directing.  Scenes often didn't go together cohesively in a logical way.  Their homages to the original amounted to basically copying and pasting lines directly from it.  Most of the gags fell short, or were overly cheesy for the seriousness of what was going down.  Characters didn't react realistically to what was going on around them.  I could go on and on with these faults.\r As I mentioned before, the visuals were top-notch.  I have a serious hatred for CGI that doesn't look realistic, yet gladly this movie doesn't fall into that trap.  It has plenty of CGI, but it is incredibly well done.  Too bad the other aspects of the movie don't match up.\r If nothing else, this movie has shown me how much I want a GOOD space opera.  Yet sadly, it may also be the reason we don't get one in the near future.\r Good luck with that third installment Fox."}, {"rating": "6", "text": "It took them 20 years to forget how to make a really engaging blockbuster.\r This movie is fine. The effects are excellent. The people are pretty. What's lacking here, something that the original had in abundance, is the human element.\r This marks a significant change in film making since the mid-90s and is specifically a feature of modern blockbusters.\r There is not a single character in this film. There are cardboard cutouts of character types who are given a two-beat backstory that the audience is somehow supposed to care about instantly.\r The first ID spent a full half of the movie introducing audiences to the people in the story. It raised the stakes and made the later actiony bits mean something. IDR does none of that and leaves you feeling hollow about the whole affair."}, {"rating": "5", "text": "Independence Day: Resurgence is here, and it would seem with the direction they went that Independence Day may have been better if it hadn’t had a sequel. The original film was admittedly dumb, and considering Roland Emmerich’s filmography I didn’t go in expecting this film to be thought provoking, but Independence Day: Resurgence lacks the impactful moments the first one had. Independence Day: Resurgence is full of cliches, features weak characters, and lacks the iconic moments of the original. It is sad to say but given the filmography of Roland Emmerich, the fact that this movie isn’t very good isn’t a surprise.\rThe original Independence Day wasn’t very original, but it found a way to surpass it’s generic approach with entertaining acting and storytelling. However, Independence Day: Resurgence loses some of that charm, and ends up being even more generic. The story takes a radical departure from the realistic approach of the first one, and puts the audience in a super technologically advanced earth. The film is also hurt by the lack of charismatic leads, who have been replaced by young more dull actors.\rThe problem is partially that the actors aren’t all that good, whether that’s a lack of direction or a lack of ability is up for debate. That being said the actors are only part of the problem, as even if they were great the characters are one dimensional. Another major problem is that the original film was a perfect example of dumb fun, where it was funny and frankly dumb, the sequel is just as dumb, if not more and half as funny. The end result is when a major character dies or anything happens in this film it’s hard to care.\rThe lack of care for major moments resonates as the ultimate disappointment of Independence Day: Resurgence. Even if you hate Independence Day you can’t deny that when Bill Pullman delivers his speech, everybody watching gets a little emotional, and there are various other moments from that film that resonate. There are next to none of these moments in Independence Day: Resurgence. In the end Independence Day: Resurgence is boring because it’s not emotionally gripping, and just trugs along.\rIndependence Day: Resurgence is in essence a sequel made purely for the profit, that departs from what made the first film so special. The sequel is inferior to the original in most aspects, and in some areas doesn’t even feel like a sequel to Independence Day. The characters are one dimensional, the story is generic and cliched, the dialogue is weak, the film is incredibly dumb, but admittedly the special effects are amazing. In the end if you like action and want a release where you can go and just shut your brain off, then this is for you, otherwise you may be disappointed."}, {"rating": "5", "text": "Independence Day: Resurgence is your basic dumb summer action movie that dose it's job well of entertaining you, but the flaws is something that shouldn't be ignored despite people telling you to ignore them.\r The effect's (for the most part) was pretty solid and Jeff Goldblum being the best part of this movie is no surprise. You just can't get enough of the Goldblum, as he always got this welcoming presence to him in every movie he's in. I was never bored while watching the movie and this is the kind of the film that would have been great if it was released in the 90's like the first movie, as this would have fitted right in.\r Unfortunately, \"Resurgence\" misses a lot of the charm and charisma that the first film had, as the squeal is just mindless entertainment and if you enjoy those type of films then you most likely going to like this one. The amount of coincidences that happens in this movie is quite unbelievable, with character's coming across each other by accident or how the problems are solved was way too easy. And it's attempt of humor was a bit awkward and force, but that's mostly because the movie doesn't want to be too dark or serious for audience members, so the humor is thrown in there to lighten up the mood.\r Overall rating: \"Independence Day: Resurgence\" is a sloppy but enjoyable movie that's only mindless fun....kinda like the first movie in a way."}, {"rating": "5", "text": "This movie is a huge disappointment.\r There are too many subplots that lead no make. I did not feel the sorrow that Will Smith's son was supposed to feel when his mother died. I did not feel the love between Chris and the president's daughter. There are too many characters for any of them to be fleshed out.\r The dialogue is horrible. The acting was bad. The CGI looked cartoonish. It makes the whole film look fake because it isn't quality CGI.\r And the ending made no sense. So they steal alien ships, take down the alien queen's shield, destroy her weapon, and then the queen suddenly realizes that she can control the ships. I won't even get into it. It's stupid."}, {"rating": "5", "text": "\"Independence Day: Resurgence\" Is Even More Hollow, Superficial, Insubstantial and Infuriating\r We're talking about a film of 1996 that stipulated the directives for the upcoming blockbusters based in the invasions of aliens created by Roland Emmerich and Dean Devlin. It was the model for many of the current movies, those empty but entertaining films that are the daily bread in American films, too much CGI, combined with some comedy and drama, the perfect summer film, though, that magic has begun to agonize. \"Resurgence\" lands in the worldwide film market as a sequel in which in addition to not be present the soul of the original, Will Smith, it's responsible for presenting a constant self-parody and not funny at all that makes it easy to find the myriad of lacks of which owns.\r \"We Had Twenty Years to Prepare\", states the tag line at the top of the poster, but were it really twenty years?. After the catastrophic event in 1996, Earth has managed to reinvigorate its weaknesses and they have decided to unify all nations in order to preserve human life -  a help for the writers, they take for granted to United States going  to take the decisions – creating contraptions of high technology, such as the conception of the speed of the ships or the defiance of gravity , What premise!. \"So Did They\", one fortified attack and more resistant returns to Earth, with powerful strategies that will put at risk millions of lives, again.\r It's not correct to affirm that \"Resurgence\" disappoints, since at no time it promised more than excessive action - a kind of \"Star Wars\" recycled-, aliens - with notable references of the genre -, destruction of cities - \"2012\", also directed by himself - and abundant mentions of its predecessor which give the audience a tone of nostalgia.\r Roland Emmerich is a film director that started his career in his native country Germany, with \"Franzmann\" in 1979 and later with \"The Noah's Ark Principle\" in 1984, which was accused him of recreating American films in Germany. Roland took the decision to try to sneak into cinematic mecca of the world, and he succeeded it, opening his experienced curriculum vitae with \"Universal Soldier\" in 1992 with Jean-Claude Van Damme. He was gradually settling in major film studios with projects such as \"The High Crusade\" and \"Stargate\" both released in 1994. Acquiring knowledge, seniority and expertise in the sci-fi genre, it was in 1996 in where his greatest success was evidenced, Emmerich debuts with  Will Smith \"Independence Day\". He already established as one of the directors most requested in Hollywood launches \"The Day After Tomorrow\" in 2004, \"2012\" in 2009 and a number of projects that had not too much impact, but which were of great help in the construction of a CV so honorary so disconcerting. It's in 2016 when the sequel to his project more outstanding it is released, the final collection of each of his projects and even though have not been praised by movie critics, these are loved and remembered by many viewers, especially his grand debut in the genre.\r Undoubtedly, special effects are the strong point. With amazing visual effects - obviously, executed by CGI and green screens - transform a boring narrative journey in a visual show \"Star Wars\"-style. In one scene of the film, a spaceship arrives on Earth to pick up David Levinson (Jeff Goldblum) and his team, at that time in which the ship lands, my brain generated a reaction of unreality, i.e., I thought that the scene was completely fictitious and utopian, but not by its sparkling effects, it was an involuntary reaction that that was not possible. Something unaware to the CGI. Space battles, imposing aliens, an exciting opening scene and much apocalyptic disaster is accomplished in its greatest splendour.\r A plot quite simple and poor, linear and boring with a development for nothing worthy of its predecessor, adorned with stunning visual effects that do not save it of a long and tense space travel. The yawns were unavoidable. The script is full of imperative exclamations; It has not got dramatic base nor much less to real. But the worst were the comic touches, which gradually were horrible, immature and exasperating, destroying to one of the most endearing characters of the original. The script gets all the shortcomings of American projects. The new cast is pathetic, they have no charisma, they have no chemistry, and with total humility and respect there were too many times in where I laughed. Liam H., Maika M. and Usher are some of the new crew.\r The soundscape is clearly inferior than the visual. Harald Kloser and Thomas Wanker were responsible for creating the correct musical ambience that, although not shine in the slightest . It was not bad, but it was standard, something that does not help at all.\r An unnecessary sequel is added to the list of \"Unwanted projects\" and although its effects are amazing, narrative and acting charge of its predecessor has gone to the moon. Finally, \"ID: 3\"  already has been announced and we hope that Will Smith is in this."}, {"rating": "5", "text": "If there is an 'alien action movie 101 for movie makers' then this movie follows it to the last dot. It is as generic as it can be.\r There is nothing particularly bad but there is also no redeeming feature.\r Generic alien movie checklist: Soldier hero, mad scientist, advanced alien race, mass destruction, (mostly) located in USA, and finally triumph over aliens because somehow the aliens did not use their full arsenal and was weakened by convenience so we can have the ending we all expected."}, {"rating": "5", "text": "So, I finally broke down and out of sheer boredom went to see this movie. I know that the critics have been lambasting this movie for a week, but I figured I had now been inoculated against major disappointment and what the heck. I caught the 1:30 matinee in a mostly empty theater with only a few, elderly retired couples. I guess they had nothing better to do either on a Monday afternoon. I found the movie mildly entertaining, much like a Transformers movie, which also promises wanton, unnecessary destruction on a global scale. Neither movies, this or the Transformers franchise, makes any pretenses of sophistication, pathos or intellectually redeeming qualities like The Martian or Interstellar. Jeff Goldblum is funny as is Judd Hirsch. Brent Spiner probably single-handedly carried this movie and of course he sets up the sequel at the end. I just hope they don't take another 20 years for ID4 III. I won't live that long."}, {"rating": "5", "text": "Independence Day: Resurgence was a film I didn't expect to be made into a sequel. With the absence of Will Smith, it lacks the charisma the characters once had in it's predecessor. There was a very flat acting, writing and directing collaboration in this film. However, it does manage to entertain you in a way were you're not wasting your valuable relaxing time. It hooks you in with it's outstandingly awesome action sequences with superior visual effects.\r Rating: 4/10\r A+ = 10\rA = 9\rA- = 8\rB+ = 7\rB = 6\rB- = 5\rC+ = 4\rC = 3\rC- = 2.5\rD+ = 2\rD = 1.5\rD- = 1\rF = 0"}, {"rating": "4", "text": "Deutsche Review - Kritik\r Story: 8/25 Punkte\rSchauspieler: 9/25\rTechnik/ Bildbearbeitung: 21/25\rSound/ Voiceacting: 8/25\r Gesamtpunktzahl\r 46/100 Punkte"}, {"rating": "6", "text": "Okay, so apparently, Independence Day: Resurgence is actually a thing, can you believe it!? I remember first seeing the original and being completely blown away, it's all anyone seemed to talk about. And now the sequel is here, and it's once again directed by Roland Emmerich and has the cast of Jeff Goldblum, Liam Hemsworth and unfortunately, there's no Will Smith or Mae Whitman, but there is Bill Pullman.\r So, how good is the movie then? Well, it's one big loud CGI-fest with so much corny dialogue, so pretty much exactly like the first one, in almost every way. You see, while the first movie had charisma and energy, this film has none of that, this is just mindless fun. To be honest, it really makes me miss Will Smith for this film, since he was what made the first film so great. His replacement is so bland and so dull and Liam Hemsworth doesn't bring anything new to the table for me. You know what the best part of this film is? Jeff Goldblum. He actually feels like he is enjoying this movie and is a lot of fun. I also wonder why Maika Monroe was chosen to play the president's daughter when in the original, she was played by Mae Whitman, who is a really great actress right now.\r So, this movie is fun, the CG is sometimes awesome, but it does suffer from having so much stuff on the screen at once. However, one of the biggest problems with this movie, though, is the massive abundance of characters. In the theatre, I was surprised by the amount of times a new character was introduced. Also, Brent Spiner was back in this film and he had way too much screen time. This movie also had one of the most on-the-nose set-ups for Independence Day 3, I was so shocked when watching it. Overall, though, this movie was fun, but it just didn't have that sense of urgency that the first movie had, and for that I am going to give this movie a 6, because it was watchable but nothing compared to the original."}, {"rating": "4", "text": "There was nothing exciting this time. The visual effects were surely updated a few notches, unfortunately, the script made it almost abusive to the audiences to experience nothing promising for 2 hours. The only thing worse than this unpleasant story is the awkward comedic timing, sees so desperate."}, {"rating": "0", "text": "UNE VRAIE DÉCEPTION !\r Comment faire d'un premier Chef d’œuvre une suite totalement pourrie...\rTant le scénario, que le scripte, que les acteurs, cette suite est de loin, mais alors de très loin à la hauteur du premier !\r Votre suite fait penser à une série B de Disney Chanel. Les faux décors, les acteurs bidons et le script réellement vide de texte. Vous n'avez pas pensé aux fans d'Indépendance Days, mais à votre porte feuille.\rVous devriez réellement investir dans de vrais décors, de vrais acteurs et un vrais script, une vraie histoire.\r C'est tellement gros que ça sonne complètement faux ! Un vaisseau qui se pose sur la planète. Pas la terre, dans une ville, mais sur la planète ! Ensuite, cette reine géante qui court après un bus ! Et Wall-E qui débarque pour sauver les humains. Non mais vous êtes vraiment sérieux ?!\r Étant un grand fan du premier, j'ai attendu ce second avec impatience, me refusant même de voir les bandes annonces et il en ressort quoi ? Je me suis carrément endormi pendant le film au cinéma et à la pause j'ai même voulu partir !\r UNE VRAIE DÉCEPTION..."}, {"rating": "0", "text": "This is the worst film of 2016 and demonstrates the collapse of the Hollywood Blockbuster. Totally unoriginal, boring effects, Smith was right to pass on it. If only I had..."}, {"rating": "5", "text": "Direct to video screenwriting with IMAX special effects.   You cannot replace dialogue with some one screaming . Pull up on the plane joystick? SCREAM. Pull the trigger on your gun? SCREAM. Swerve your vehicle to get out of the way? SCREAM.  SCREAM.  SCREAM.  SCREAM.\rI give it 5 for the special effects, 0 for the editing, 0 for the directing."}, {"rating": "2", "text": "This movie is nothing but total disappointment. The scriptwriting is extremely predictable, the action sequence is very cliché. Despite the fact that this is a movie about fighting aliens, the level of absurdity and messiness of the action sequence is beyond unbearable. The acting was pretty terrible throughout the film as well. The only thing saving this film from a complete flop is that there is still some fun in watching it, I did feel like I was sort of on the edge of my seat, but for the time being, it does not live up to its predecessor by any measures. Total disappointment. If I were you, don't bother buying a ticket to watch it in the cinema, just wait for it to be broadcasted on television."}, {"rating": "0", "text": "Let me preface my remarks by stating I was at the midnight screening for the original Independence Day in a jam packed theater twenty years ago.  It became one of my favorite movies as I must have watched it a million times.  I can recite just about every line in the original.   When I heard they were making ID2 I couldn't wait as I tried to get every bit of information I could.  I saw it today.  How in the world can anyone connected to this project look at themselves in the mirror.  Without question it is one of the worst movies I have ever seen.  How can you take something so special and turn it into a computer generated CGI video game.  There is nothing to like here.  The script is totally lame!  The acting terrible.  And the directing possibly the worst I have ever seen. You care nothing for any character.  When you make a movie there is supposed to be a story.  Sadly, there isn't any.  They took the original and turned into a video game with explosions.  Giving this movie a rating of one is stretching it.  Roland should be ashamed of this utter garbage."}, {"rating": "2", "text": "As a big fan of the original, I was looking forward to a fun, ridiculous spectacle of destruction with this sequel. What I wasn't expecting was the uninspired, insipid, boring two-and-a-bit hours of idiocy, coupled with cliche upon cliche, wrapped in nothingness that was this utterly disappointing film. I was not made to care about anything in this film. Not about the paper thin characters, stupid storyline, visually impressive yet somehow still mediocre action sequences, or the vague attempt at 'heartfelt' moments. A completely lacklustre film that isn't worth your time. 3.05/10"}, {"rating": "9", "text": "Saw it this Evening in 3D , it was a great film it had some great special effects, some awesome seens and some good action sequences all balanced with a story based on humor,brotherhood,friendship and romance , im giving this film a respectable 9 ,its not a perfect film but its still a great film to see in 3D :)\r PS Metacritic you may want to look into the critic reviews they seem lil bit biased and purposely tanking this movie!!!"}, {"rating": "6", "text": "Resurgence ultimately fails to live up to the standard of it's predecessor, hit & miss comedy, cheesy dialogue and some horrendous acting really flat lines the squeal. However the CGI & action sequences are done effortlessly and look crisp!"}, {"rating": "5", "text": "It is starship troopers with worse acting (except Goldblum). Only watch if you get it on HBO or Netflix. It lacks story, originality, cohesion, and is way too long."}, {"rating": "0", "text": "Painfully bad.\r The first movie was art. Every detail was painstakingly prepared and executed. The first movie was perfectly written and directed. The sequel, unfortunately, was a disaster.\r I will outline for you WHY Independence Day Resurgence was horrible:\r 1) Poor storyline. The plot was absolute garbage. Not even remotely realistic.\r 2) No suspense. You can clearly see what's going to  happen. The movie literally spoils itself.\r 3) Reckless directing. An alien chasing a schoolbus around the desert? Was the director on crack?\r 4) In the first movie Earth won thanks to cleverness and ingenuity - neither of which were present in the sequel.\r 5) The first movie attempted to emulate the workings of the US government at least to some degree. In the sequel, there's a trigger happy female President who gets everyone, including herself killed. She was as reckless as the director.\r 6) Spiner manages to pick up some of Roland Emmerich's slack but it isn't enough to save the movie.\r It really felt as if Emmerich was TRYING to make a lousy movie.\r I absolutely loved Independence Day. And I absolutely hated Independence Day Resurgence.\r Save your money this movie sucked big time."}, {"rating": "0", "text": "Argh, how I missed Will Smith in this movie. Actually the director took the same storyline, same old actors, but what we see is cheap and easily made with no love and no creativity. After five minutes it's already clear and obvious: thin story, no fun, just waiting untill The End. A completely lost evening."}, {"rating": "0", "text": "I really wanted to love this film. Unfortunately, it fell extremely short of any goal. The scenes were scattered without logical or cinematographical cohesion; It was put together in a sort of quickly-built Frankenstein of a movie that everyone hoped would miraculously spring into some kind of life. But it never did. The acting was far less impressive. I place more blame on the casting crew than on the actors themselves - they did try. Where was the mystery? the suspense? The anticipation? the call to arms across the screen into the hearts of the audience?!? Everything that I loved about the first was completely absent in the sequel. And what the f*#k is up with the obsession with diversity?? Suddenly I see why people oppose affirmative action. Whatever. I'm mad. I want my $15 back."}, {"rating": "10", "text": "I'm with the Metacritic fan who also gave this a 10.  Apparently another classic case of jaded critics unable to estimate entertainment value for the average movie goer. IF YOU LIKED ANY OF ROLAND'S MOVIES IN THE PAST, YOU WILL LIKE THIS ONE.  It's one of his best.\r I don't say this lightly and I don't give 10s lightly, only my second 10 rating.  I liked this about as much as the first ID.  It has much more humor in it.  The plot surprised me with how many obstacles it elegantly hurdled.\r I wonder if critics generally dislike Roland's pattern of using the first 30-50 minutes to introduce and build up a cast of characters to care about.  He uses it here again, to good effect."}, {"rating": "10", "text": "Great movie. The plot is very similar to the first one, which is not a bad thing. The pace is actually better than the first version, the movie is full of great characters (in the beginning they look generic, but they grow during the film) and, well, the movie the best action scenes I've seen in years. The special effects are really well made and very creative.\r If you liked the first one, you're gonna love this sequel."}, {"rating": "2", "text": "This b-style reboot lost its way somewhere between too much main characters with complex relations, unimaginative punch lines (\"definitely... bigger than the last one\"), absence of good (acted) humor - Will Smith style - and a huge patriotistic plot line with of course America saving the whole damn bunch altogether.\rWhere its predecessor had its good moments with a lively mix between sci-fi and horror, (for the time) outstanding visual effects and being generally a \"new kind\" of movie, Independence Day: Resurgence  feels more like a zompy resurrection from a movie which has died from old, but good, age.\r - - - - -\r-- Having to see the old movie beforehand in order to understand all the character relations\r-- Too much (main) characters\r-- Gravity tricks: which seem nice, but for the more alert viewer feel completely wrong.\r-- Patriotistic plot line forced upon the viewer in a Chili Sauce thick montage scene where natives in small huts, huddled around candlelight listen on shortwave radio to the powerful words of the almighty saving-the-day American president\r-- Nukes: they solve everything\r-- With the introduction of a larger ship, also comes the introduction of larger aliens -like an Alien Queen- which, somehow, becomes extremely interested in flipping a school bus full of children instead of steering her mothership and sticking to her earth devouring plan.\r- - - - -\r +++++\r++ Introduction of a friendly and highly evolved alien species\r++ Realistic cloud dynamics from incoming mothership\r+++++"}, {"rating": "10", "text": "My 10 won't make a dent, but this movie is better than what the numbers say - it's more like a 6.5-7.  I really don't get the hate  - it's no better or worse than the first one.  Braindead story, good action and decent special effects - lots of destruction - it's exactly as advertised.. I say set expectations low and you'll be pleasantly surprised by how decent this is."}, {"rating": "0", "text": "It's a B movie with special effects. I'll save you some cash:\r -a man yells in chinese at liam hemsworth\r-liam hemsworth & friends steal a squadron of alien spaceships from inside the mothership and fly them with 0 problems, until...\r-the giant queen alien chases a school bus around the desert\r-at which point they can no longer fly their hijacked UFOs\r-they kill the queen by shooting her in the butt\r-the new, sphere aliens ask Lt. Commander Data to \"kick ass\"\r the end."}, {"rating": "8", "text": "The movie suffers from pacing, some bad acting, and just flat humor but I still enjoyed it. This is not say that all the acting was bad but some of it was."}, {"rating": "5", "text": "This movie has problems,issues.But it is not a garbage.It has overused CGI and bad pasting.The old casting from the first movie is great,and the others are not....They put too many sub plots and characters in this movie.The alien queen in this movie looks like a kaiju from pacific rim or Godzilla,which is completely unnecessary and stupid.The aliens should have just open their gravity field and erase human from history.With 100 times military weapons ,the aliens can just nuke area 51,there is no need for all those explosions and CGI.And you are going to make a third movie? go fxxk yourself"}, {"rating": "1", "text": "I wish I had seen the score before i wasted $20 and 2 hrs of my life on this movie. Heads should roll at 20th Century Fox. The script was absolutely abysmal and the plot and sequences were geared to 5 year olds instead of adult,which by the way are the people who go see movies (if the people at 20th Century) read this. Additionally, I am so sick and tired of Hollywood trying so incredibly hard to be diversified. We had asians, indians, women presidents and fighters, african americans, etc... Sorry, but the United States isn't that diverse. Focus on the scripts instead of political correctness."}, {"rating": "3", "text": "20 Years to write a good script...and they didn't. Don't waste your time on this movie. The only thing good about it are the special effects but I go to the movies to see movies with good storylines, not just video game CGI. The acting is bad, the pacing is bad, the script is just plain terrible. I barely cared about the characters and its a shame because they all know how to act - but given this horrible of a script...yeah, nothing good came out of this movie. Save your money. I would say Red Box it but its such a forgettable and cliche cash grab of a film that you're better off saving your money and not even seeing it at all. Huge disappointment. I give it 3/10 just because the SFX are very well done...that's really about it."}, {"rating": "0", "text": "Never written a review before but felt compelled to review this excrement. Quite possibly one of the worst movies I've ever seen, it's offensively bad. Can't think of one redeeming feature: the acting and dialogue are just awful. Hated every minute of it."}, {"rating": "0", "text": "awful...absolutely nothing in it.Wasted 2 hours of my life watching this movie.Totally illogical, no story at all........................................."}, {"rating": "2", "text": "Wow if you thought Fantastic Four was bad wait till you see this movie........WORST ACTING EVER!!!!! GOD AWFUL!!! So many things wrong with this stupidity of a movie, don't waste your money LMAO OMG!"}, {"rating": "7", "text": "If you enjoyed the first one, and walk into this with the same headspace, you may enjoy it.\rI did!\rRife with all the cheese and camp the first had,this feels like a 90's movie with updated visual effects.\r This isn't a \"good\" movie. Plot, characters, script, don't quite gel. But this is a fun movie, or at the least it tries to be."}, {"rating": "3", "text": "CLICHE, CLICHE , CLICHE ,CLICHE , CLICHE ,CLICHE,CLICHE, Patriotism, CLICHE , CLICHE , CLICHE. CLICHE, Pew pew, CLICHE CLICHE, Sleep, CLICHE, CLICHE , The end."}, {"rating": "0", "text": "It's a very-very bad movie. Nothing to compare with a first film. In 1996 Independence day was a big step forward for blockbusters. ID 2 - is a stupid copy/past work. Don't spend your money for his $#!+."}, {"rating": "8", "text": "Yes, it's a bit cheese and absolutely predictable, but it's what you expect from a sequel for predictable by the numbers cheese blockbuster. Good guys win (oh come on, like you woundn't guess), bad guys loose, we tragically lose some minor character, good guy crack some cheese jokes, world will unite, shy guy gets the girl way out of his league, etc, etc...\r It's not nearly as bad as it's described by critics for some reason, in fact - it's pretty enjoyable, fun and lighthearted summer action movie. Just does not expect unreasonable things from movie that never even intended to deliver on them."}, {"rating": "1", "text": "Pure Crapola.\r Even in the Popcorn Movie oeuvre this film is a major disappointment: Brainless, soulless, insipid, insulting to one's intelligence.  But boy are the SFX great! (Who cares.)\r It's twenty years too late, for one. Truly despicable, for two.  Films created specifically to launch other films, that is.  Cobbing an idea from \"Falling Skies,\" \"ID: R\" finds a friendly ally to fight an intergalactic war against the Universe-Hopping-To-Suck-Your-Planet-Core aliens.  You know, kinda like the Borg, but far less believable.  I wonder how the alien light drives work fueled by magma.  Must be some special gas, er, magma tank to withstand 11,000 F molten metal.  Maybe the magma cools.  Oh, I see.  It's really a drive running on iron.  Guess these aliens haven't figured how to mine iron.\r Then there's a queen.  All that's missing from those scenes is Ripley shouting, \"Get away from my planet's core, you ****\r Brent Spiner is ecstatic.  Lot's more screen time, and the final word.  The rest - Jeff Goldblum and Judd Hirsch the biggest perpetrators - either phone it in or sleepwalk through a story so predictable eyes flutter with drowsiness waiting for it to unfold.  And how did Hirsch, all alone, find his son in that huge desert?  Magic, I suppose.\r There's much to be said for brainless entertainment where one allows the idiocy to run down the back like water on a duck.  Then there's braindead entertainment such as this useless, bland sequel to a better, far more fun film.  Attend a showing if you must.  You've been forewarned"}, {"rating": "10", "text": "If you are a sci-fi fan you will enjoy very much, the special effect is fantastic, very action pack.  I personally think this movie deserve a full score, don't understand why people give such low score. The plot is very interesting, I would high recommend to other people!"}, {"rating": "6", "text": "Just like in real time, this sequel takes place 20 years later, when the world has recovered from the last invasion and adopted some of the alien tech. When they return…bigger and meaner…even all our sophisticated equipment is no substitute for good ole grit. The plot's pretty mundane and the dialogue isn't much better, but there's plenty of average action to keep it moving. All of the special effects are adequate, but not especially innovative. Even though it sounds like I hated it, it's actually not horrible. Also not wonderful, but OK. (Look for the somewhat subtle romantic gay moment, thans to out director Roland Emmerich.)"}, {"rating": "6", "text": "It's just a big, dumb popcorn movie. The kind you watch for the crazy destruction, absurd stakes, and cheesy writing. Resurgence makes it a point to never take itself seriously. It's got a silly sense of humor in the face of it's potentially world ending conflict. The human race is facing it's possible extinction and everyone is smiling and cracking jokes.While this does add a extra sense of fun to the movie, it also makes it hard to really care about what's going on. There's simply no urgency to the events. The new characters are bland and there's no way to get emotionally invested at all. This is the kind of movie you watch for the visual panache and not much else. There's a lot of cool sci-fi stuff onscreen to keep things interesting enough to keep you watching. It just doesn't engage your brain. But hey, it's fun for what it is. I got some laughs and some cool action. That's really all I was expecting anyway. Fans of the first can get a kick out of seeing the familiar faces return (with the exception of Will Smith) and references. Roland Emmerich also makes it pretty clear he's got some ideas for a sequel. Basically, come to have some mindless fun or don't come at all. Resurgence doesn't offer much else.6.6/10"}, {"rating": "7", "text": "Not a perfect movie, but definitely worth watching. It had a good action, and good one liners, but not a good script or good story. Nonetheless, the movie was great to watch if you're a fan of the first Independence day, you'll have a lot of fun watching this."}], "recommendations": ["pacific_rim_uprising", "geostorm", "transformers_the_last_knight", "the_tomorrow_war", "poseidon", "battleship", "the_matrix_resurrections", "the_darkest_hour", "volcano", "the_cloverfield_paradox", "jupiter_ascending", "riddick", "into_the_storm", "rampage", "jurassic_world_dominion", "clash_of_the_titans", "san_andreas", "bloodshot", "2012", "valerian_and_the_city_of_a_thousand_planets", "the_last_airbender", "the_new_mutants", "infinite", "teenage_mutant_ninja_turtles", "guardians_of_the_galaxy"]}