{
  "id": 2770,
  "title": "Indiana Jones and the Kingdom of the Crystal Skull",
  "starring": [
    "Harrison Ford",
    "Cate Blanchett"
  ],
  "runtime": 122,
  "genre": [
    "Adventure",
    "Action"
  ],
  "description": "Set during the Cold War, the Soviets—led by sword-wielding Irina Spalko—are in search of a crystal skull which has supernatural powers related to a mystical Lost City of Gold. Indy is coerced to head to Peru at the behest of a young man whose friend—and Indy's colleague—Professor Oxley has been captured for his knowledge of the skull's whereabouts.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/56As6XEM1flWvprX4LgkPl8ii4K.jpg",
  "categories": {
    "plot": 3.933333333333333,
    "acting": 3.7142857142857144,
    "ending": 4.0,
    "soundtrack": 3.5,
    "cinematography": 4.333333333333333,
    "familyFriendly": 6.0,
    "funny": 6.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "What a complete waste of time and money! Not one ounce of creativity or fun. From the first lame sceen with the groundhogs (Caddyshack?) to the last third rate SFX water flume ride this movie was a complete disappointment and both Spielberg and Lucas should be ashamed."
    },
    {
      "rating": "0",
      "text": "Disgrace to Indiana Jones. I laughed through it it was so bad."
    },
    {
      "rating": "2",
      "text": "Maddeningly idiotic. I was so angry when I left the theater as to what they did to a great franchise. It has George Lucas's stamp of cutesy lameness all over it. I hated this movie, and I was so excited to see it."
    },
    {
      "rating": "0",
      "text": "Worst film ever. Plot is non existant. SFX are poor. Pacing is aweful. Harrison Ford looks like he's wearing depends the entire film. George Lucas kills another franchise. Don't waster your time or money on this, you'll never get it back"
    },
    {
      "rating": "2",
      "text": "Full of ridiculous sequences that would never work and also inconsistencies that make it painful to watch. (Some spoilers) Two parallel paths through thick south american jungle even after the machine is blown up? A skull which decides to be sporadically magnetic. A cloth prevents the magnetism but a metal case and crate don't? Surviving an atomic bomb at ground-zero? Falling down three waterfalls onto jagged rocks without any injury? Swinging on vines faster than jeeps?"
    },
    {
      "rating": "4",
      "text": "I firmly believe that the generally favorable reviews from the critics is simply bias towards what was supposed to be an awesome movie. I really wanted to like this film; I tried so hard to look past some of its faults. But by the end, I was just rolling my eyes. It definitely had its moments; some suspenseful, some action packed, blah blah blah. But the overall premise doesn't live up to what an Indiana Jones film should be. It's almost painful. Nice try, Lucas, but I think it's time we move past aliens and think about something new. And I swear to God, if one more movie/game involves looking for Cebola or El Dorado, I'm punching the nearest person in the face."
    },
    {
      "rating": "4",
      "text": "I'll give the film some credit. Cut off the first 20 and last 30 minutes of the movie, and it actually drew me in. Good cinematography and decent action made me forget about the film's shoddy intro. And... that's about all I can say positively about it. The film started from an absolute crawl, and the absolute absurdity of the ending drew me to try and pull my hair out. Scenes were thrown in for the sake of sensationalism, dialogue was poor as is usual from Lucas' works, the movie destroys any sense of mystery by explaining every detail to the viewer, and most visual effects were thrown in for the sake of showing off ILM's latest developments. Avoid."
    },
    {
      "rating": "1",
      "text": "terrible acting, karen allen should've stayed home, Harrison Ford seemed all hunched over when he walked and if they think Shia Labeouf will be the next indy for years to come, this will be very disappointing"
    },
    {
      "rating": "5",
      "text": "Ford is old, Spielberg is complacent and Lucas is senile."
    },
    {
      "rating": "2",
      "text": "yes truly, this film is a crime against cinema. Given the time that was supposedly spent on getting the story right and the 3 great films preceeding it , to come up with this rubbish is unforgiveable. The problem is its Indiana Jones and you feel compelled to see it no matter how bad the reviews and heresay. If you are a fan of the previous films try your best not to fall into this cynical trap."
    },
    {
      "rating": "0",
      "text": "I went into this expecting very little and I got even less. Lucas needs to admit he's past his glory days and stop trying to revisit them and Spielberg shouldn't indulge him. With hardly any real plot, no sense of urgency during any of the action scenes and their lousy CGI infused effects, and no truly great Indy moments that were memorable this film should be avoided by all but the hardcore Indy fans."
    },
    {
      "rating": "0",
      "text": "I went in with low expectations because of word of mouth and found it to be shockingly bad. Horrible special effects, terrible over-dubbing early on and rediculous plot. Do not see this movie."
    },
    {
      "rating": "6",
      "text": "I get why ppl hate this movie, I do. I was expecting that there was gonna be a big red bar full of \"negative\" votes. But here's my opinion about the movie, I thought it was okay. It's definitely not a masterpiece or as goos as Raiders of the Lost Ark & Last Crusade, but does it mean it's bad? Of course not! I want to review the 2 main rants that people nitpick all the time.1. Aliens don't belong in an Indiana Jones movie. It's like Indie meets Mars Attack.- I wouldn't put it that way. Did anyone even know that the Kingdom of the Crystal Skull are known to be Extra-Teresstrial? Also, why don't aliens belong in an Indie movie? Did anyone even watch the other Indie movies? What about the Ghost that killed ppl in RotLA, the 700 year old knight protecting the holy grail from Last Crusade, or the voodoo stuff from Temple of Doom? Why not have science fictional experience?2. The refrigerator scene was ridiculous and unrealistic.-No Sh*t! I know this isn't realistic, many movies do that all the time but nobody complains about them. Again, did you watch the other movies? The unexpected and unseen tank escape from Last Crusade, falling off a helicopter with a inflatable boat and making it off a cliff without a scratch or a broken bone from Temple of Doom. I haven't heard anyone argue about that.In my opinion, I thought the movie was okay. I found it like a great comeback to Indiana Jones and the other 80's and 90's icons. We got the comeback of Die Hard, Terminator, Scream, Mission Impossible, Rambo, and Rocky Balboa and coming soon Men in Black. I liked that Indie came back as well. I would like to see Lethal Weapon 5 or Ghostbusters 3. Anyways, Indiana Jones 4 wasn't as bad as a lot of people put it. I liked it, my friends liked it, my family liked it, basically many people liked it, and others hated it. But I honestly find it to be a decent adventure movie."
    },
    {
      "rating": "1",
      "text": "As with all recycled forms of art and entertainment, there is a serious danger of losing something important in any later reincarnation of something so intangibly brilliant. Hence the relationship between this newest of Indiana Jones films and the incomparable first installment of the legendary trilogy. Artistically speaking, Spielberg and Lucas have sacrificed all integrity and craftsmanship in making this movie, and it sadly begs the question of arrogance, greed, and/or possible serious degradation of their once electrifying, even magical movie-making skills. This film is not only an insult to their previous work and its enduring audience, it embodies everything that is wrong with modern film production. What made such films as \"Raiders\" and \"Star Wars\" so compelling was their balance of superb acting, script, and plot, coupled with a measured employment of technology, thus delivering a movie that had a soul and a story to tell. Just as in modern music production, we're seeing less and less of that as the years go by. Just because we have CG doesn't mean it must be used rampantly, and just because a film has Indiana Jones contained in the title doesn't mean you don't have to try as hard to deliver on the fundamentals. Perhaps all concerned with this movie are laughing all the way to the bank, but it leaves one with a dejecting, inescapable question: are these really are the same people who brought us those iconic masterpieces of yesterday? Maybe so, but thankfully the works they made when they were hungry, innovative, and masterful will live on even if their ingenuity won't."
    },
    {
      "rating": "5",
      "text": "In its day, the indiana Jones movies were innovative; they have been since surpassed by the superhero films, Matrix trilogy and others. There was nothing new here. It seemed like it had been made 20 years ago with the other three."
    },
    {
      "rating": "4",
      "text": "The final act was too short, too muddled, and most critically, did not provide a MORAL DILEMMA WORTHY OF INDIANA JONES. Throughout this Franken-script, a lot of themes were merely touched on, but a solid closer would have solidified the main one. It seems, in the end, George, Steven, and Harrison couldn"
    },
    {
      "rating": "0",
      "text": "Crap they mad this movie just to make money, sad sad day for movies."
    },
    {
      "rating": "4",
      "text": "This is not the exciting, rip-roaring adventure that we were promised. It does have two good parts that come kinda/sorta close to capturing that old Indy feeling but the rest comes off as pale and lacking. And give me a break--there's no way that a guy would be wearing the same costume as he did 20 years ago (apparently Indiana hasn't grown that much since we last saw him). Ford is always a treat but the attempts to make him look like a spry action figure seem a little too forced. And it's great to see Karen Allen again, but the whole \"crystal skull\" thing is just plain silly. This film is about ten years late."
    },
    {
      "rating": "10",
      "text": "I can't be the only one who doesn't live in a dream world where aliens are less ridiculous than a box that melts faces, right?"
    },
    {
      "rating": "10",
      "text": "If you liked the others you'll like this one. Even Shia Labouf (or whatever) did a surprisingly good job. My only gripe (if I must have one) is that try though they did it still looked like a current style movie with CG and what not, but hey, no big deal. I hope they do another!"
    },
    {
      "rating": "7",
      "text": "This should be spoiler free, so here goes: The good bits are really, really good"
    },
    {
      "rating": "8",
      "text": "Just as much fun as the others. I don't see what all the fuss is about. At first I had difficulty with it but frankly it quickly swept me up in an extremely fun adventure."
    },
    {
      "rating": "10",
      "text": "This film was everything I hoped it would be. It felt every bit as thrilling as the old trilogy, and it is going to take some beating. Indy 4 is lining up to be my Film of The Year!"
    },
    {
      "rating": "8",
      "text": "Not a Masterwork, but good clean Indie fun the way you remembered it. A tad too much popcorn for the kids, but plenty of adult level plotting to keep you engaged during the entire \"ride\"."
    },
    {
      "rating": "8",
      "text": "This movie rocks. Ya'll are haters... what'd you expect, 2001: A Space Odyssey? C'mon, cut 'em some slack."
    },
    {
      "rating": "6",
      "text": "I'm not sure if fans of Indiana Jones will be more disappointed than the uninitiated on this one, or vice versa. Ford does a great job putting the hat back on. It's also great to see Shia making the most of his role. Unfortunately, the script is too academic and undercooked, never mind the unusual lack of humor, and doesn't allow these great characters to really shine or even intertwine.......and it wouldn't be difficult. Indy and the gang are fantastic characters. That part was set, or so I thought. The actual plot is arbitrary nonsense that is amusing, but not engrossing.....and as the film throttles into the finale, the light saber duels and telekinetic....um, whatever become downright stupid. Since the script is so muddled and inept, when the action stops, so does the movie. The self destructing action set pieces fall in line with tradition and they're as implausable as ever, but they're still fun to see. Loved the prairie dog cameos too. Still, this one gets a mixed note from me. It'll make a good rental."
    },
    {
      "rating": "8",
      "text": "Looking forward to the next installment, where Harrison plays to Shia, as Sean did to Harrison. Pls don't make us wait until 19 years!"
    },
    {
      "rating": "8",
      "text": "Not perfect but very enjoyable Indiana Jones film. Many people hate the script but I think it suits the older Jones better, can't have him in the same frame of mind as before. This film is brilliantly crafted, great acting, directing, special effects. Better for having been a different sort of film than being a crowd-pleasing rehash of past formula's."
    },
    {
      "rating": "8",
      "text": "The movie delivered exactly what you should expect from an Indiana Jones movie. Some over the top action with some supernatural elements. It was a fun two hours."
    },
    {
      "rating": "9",
      "text": "I swear by the Ark of The Covenant, some people need to lighten up. I went to this movie expecting the worst and came away pleasantly surprised. It's an Indiana Jones movie! Many of the criticisms are valid, however, so I will say it once again: It's an Indiana Jones movie! What are people expecting? Personally I was happy that they weren't fighting ex-nazis or some rehash of the old films. It was good to see something new."
    },
    {
      "rating": "7",
      "text": "It's a decent enough sequel in the series, I don't think it deserves the harsh criticism the users are giving it, maybe it's just out-dated."
    },
    {
      "rating": "10",
      "text": "What the heck is with all the negative critisism? This movie is awesome! It feels exactly like an old fashioned Indy movie! Granted, its not as good as those movies, but who would expect it to be? The acting is great, the action is intense and lots of fun, and the same adventurous atmosphere that made the others so much fun is back full throttle! Yes, it's very unrealistic, but what Indy movie is? Yes, I didn't really like the whole alien thing, but that's the only thing I didn't like about it. Overall, KOTCS is a great installment in the amazing franchise."
    },
    {
      "rating": "7",
      "text": "Pretty cool movie. The concept is interesting, the camera work is as always for a Spielberg film amazing, it is great to see Ford back as Indy and he is still great in the role, there some good to great moments here and there. Where it goes bad is its use of a **** of pretty bad CGI, ridiculous sequences like Shia swinging with some monkeys and a ludicrous CGI crapfest ending that makes all the attempt of making this movie a bit serious worthless."
    },
    {
      "rating": "6",
      "text": "Whoever came up with the idea of letting Shia La Puke play the son of Indiana Jones should be handed over in the hands of Mola Ram. Why does Indiana need a son anyway? Was it so the series can continue with his son as the hero? Ridiculous.\r Harrison Ford is playing his role perfect as usual, although he's getting too old for this. Marion is back and she gained a few pounds extra. The music is still good and there are some nice parts in the movie. But mostly the cgi is so bad and the movie feels like a parody on the Indiana Jones movies. Shia swinging in the trees with monkeys is the best example of this. Also the giant ants are clearly computer animated, It's like Spielberg and Lucas didn't even try to make it look real.\r Also the whole idea about the aliens or beings from another dimension is so over the top. I read somewhere that this was the idea of Lucas, while Spielberg realised that the alien thing had been done plenty. Unfortunately Lucas got what he wanted.\r They should have stopped after the original trilogy which was perfect."
    },
    {
      "rating": "7",
      "text": "If aliens, Shia LaBeouf, and nuking the fridge aren't what you're complaining about, then yes; Indiana Jones and the Kingdom of the Crystal Skull will be as enjoyable as the first three movies."
    },
    {
      "rating": "8",
      "text": "Although it's not my favourite Indiana Jones, Kingdom Of The Crystal Skull provides a lot of fun and real Indy feeling. There are some flaws I can ignore and some I can't. The diner fight though remains one of the most hilarious moments of the entire series."
    },
    {
      "rating": "8",
      "text": "This film was actually pretty good.  If you are demanding the first time thrill of seeing \"Raiders\" this film will never meet that expectation.  I am mystified why so many reviews think this film is unforgivably bad.  If you want bad, you don't have to look any further than Indiana Jones and the Temple of Doom.  The sequence of two adults and a kid escaping a flying plane in an uninflated raft that then gives them an unpunctured toboggan ride to the middle of India...that, my friend is crap. It makes the nuked fridge seem downright clever.   If you like the vicarious pleasure of a B-movie with Harrison Ford cracking the whip, you'll enjoy the film just fine."
    },
    {
      "rating": "8",
      "text": "Some fans may have been thrown off by Indy 4's shift from 30s serial homage to 50s B-Movie homage, but at its heart, Indiana Jones and the Kingdom of the Crystal Skull is made up of the same ingredients as Raiders, Temple, and Crusade."
    },
    {
      "rating": "6",
      "text": "It's a fun movie but nowhere near as good as the 1st or 3rd, yet still better than the 2nd. The very low score negative reviews are exaggerated. If you like the original films, this is definitely worth it. That said, even though the series is supposed to be a throwback to similar historically and culturally inaccurate campy adventure films from the 30s to 60s, so being critical that it isn't realistic is misunderstanding the series, it does push the unbelievable and supernatural (in this case, also sci-fi) elements WAY too far, the worst in the series in that regard, even more than the 2nd. They overused the green screen and computer generated effects. The Mutt character was really unlikable, don't think the issue was the actor, though not as awful as Willie from the second. Ox is never really treated like Marion's ex husband or Mutt's surrogate father. The Russian Soviet villains were not as interesting as the German Nazis. The plot plays out pretty predictably. Wish they either used traditional film or a filter making it look like that rather than the blurry white glow filter."
    },
    {
      "rating": "2",
      "text": "Huh, what the hell just happened? Just back from the Midnight premiere. Indiana Jones meets Mars Attack. Not to mention killer ants, sword fighting, and Shia LeBeauf swinging on vines with a gang of monkeys. I am extremely baffled. I really am. Aliens...really? C'mon Spielberg, lets try to keep Indiana Jones and E.T. seperate films. And please god don't let Shia become the heir to the throne. End this series now, before you make it worse...again."
    },
    {
      "rating": "4",
      "text": "Entertaining simply based on the implausibility of every plot twist (if you can call it a plot). I sat there thinking \"this might be the dumbest movie I've ever seen\" throughout the entire ordeal, but luckily I remembered that I saw a free screening of Van Wilder 2: Rise of Taj. Honestly, it seemed like it was just an homage to the originals with a trumped up cast (Blanchett was absolutely atrocious)."
    },
    {
      "rating": "1",
      "text": "Hmmm, let me think for just a moment....why did they make this movie? Better yet, how did they allow this script to get in the hands of Spielberg. Suppose they said,\"The hell with it.\" I thought Temple of Doom was the weaker of the series, but it's a masterpiece next to Crystal Skull. I wanted to like this movie, but the interest just gets tired as it progresses. Sorry to all fans, stick to the originals."
    },
    {
      "rating": "1",
      "text": "Worst movie I have ever seen. I'm sorry I stayed up late to watch the premiere. Absolutely terrible."
    },
    {
      "rating": "2",
      "text": "I want my $10 back. This movie was horrid! On par with Crash Landing and Gigli.... it was a freaking joke from beginning to end. Horrible, horrible, horrible. Do not see this movie!"
    },
    {
      "rating": "2",
      "text": "This was the movie I had hoped I wouldn't see. How could the critics have liked this? I want to know. What about this was good film-making? The dialoge was tedious, the script was terrible, and the editing and cinematography was flat-out laughable. Everybody who made this should be ashamed. I would have been pleased with a movie half as good as Temple of Doom, but wasn't even given that. Spielberg, Lucas, AND Ford, how dare you? Critics, please watch this film again, it is not a good film by any means. It is closer to being horrible than good. I'm hurt that this movie was made. I grew up on Indiana Jones and this is the thanks I get? Again...how dare you?"
    },
    {
      "rating": "3",
      "text": "This movie was completely rediculous. The story line was boring and I was falling asleep in the theater, literaly. I dozed off and woke up to see Shia Lebuf winging with monkeys through a forest to get back to the jeep. Then an X-Files moment accured and that is when I really wanted my money back. Do not see this movie in the theaters, wait until the dvd comes out, if you still have a desire to see this awful movie. I've seen the others, and this one was just terrible."
    },
    {
      "rating": "8",
      "text": "After reading the reviews here I decided I should put my 2 cents in. If you didn't like it that's fine, but to blame it on the effects...is sort of ridiculous. The originals are known for amazing effects, why wouldn't they do the same here. I felt the plot and script were good. The story was great. The idea was fun and interesting. I felt it was a fine piece of cinema."
    },
    {
      "rating": "1",
      "text": "There is a moment watching Indiana Jones and the Kingdom of the Crystal Skull when I realized that maybe seeing this film was a bad idea. That moment occurred less than 3 minutes in when way too much time and effort was spent focusing on a CG gopher, that did not look at all real. It added nothing to the plot and just looked bad. Someone, somewhere made a bad choice leaving that in. In effect choosing cheap thrills over trying to make a good movie. There were a lot of things like that because it was the start of a long disappointing ride.\rMy favorite moment in this film is when Indiana Jones rides out that nuclear blast in the lead lined fridge. He comes out the other side alive and in one piece. Sure he gets the awkward scrub-down after. But he`s not cooked hamburger, which is a testament to how ridiculous the film is as a whole.\rI don`t really remember much of the ``plot`` of the middle of the film. Something about not dead-dead people, a crazy friend and indies son played by actor Shia Labeouf. I get they were trying to go for an Indie 2.0 here. Maybe create a character likable enough for a spinoff franchise, or taking up Harrison Ford`s mantle. In this regard they failed badly. His character has all the swagger of Indiana at the end of the original trilogy, without having done anything to earn it. And it makes him extremely un-likable. They should have gone back to basics. Choosing an actor that more reflects Indiana at the start of the first film and show him growing up.\rThrow in all the extremely unlikely chase sequences (I know how ridiculous the original trilogy is in that regard, but the setup was better), the intermittent magnetism of the crystal skull, Harrison Ford being ``too old for this sh*t`` and capping it all off with that bizarre out of left field ending. And what you are left with is something so awful it does not deserve acknowledgement as an Indiana Jones film. This is a bad B movie with A list actors, an A list director, and a huge budget.\r If one good thing came of this film it is this. Scientists went back and examined the crystal skull`s in the museums, and found them all to be fraudulently passed off as historical relics, when they are more simply modern art."
    },
    {
      "rating": "2",
      "text": "I had to create an account just so I could review this atrocity! I honestly can't find one thing positive to say (It took me two attempts to even get through it!). Harrison Ford is as grouchy as ever and has no chemistry with anyone on screen. Karen Allen still can't act and Shia LeBeouf brings nothing to his role. Even Cate Blanchett seems to have nothing to do with her stereotypical role beyond her accent and atrocious wig. The plot is moronic and the third act may have actually cost me IQ points! Every chatty scene (and there are A LOT of them!) looks like it takes place on an indoor set and every action scene looks like it takes place in front of a green screen. Which may be on purpose but it's far more obtrusive than in previous installments. I could write full paragraphs on the stupidity of the refrigerator, Oxley, the monkeys, the quicksand/snake scene, the ants, the waterfalls, the aliens, the well as deus ex machina OR the fact that Mutt's real name is Henry Jones III, yet he somehow believes it's Henry Williams. OR a tenured professor who cannot pronounce the word \"nuclear\" correctly. Ugh."
    },
    {
      "rating": "0",
      "text": "Infuriatingly awful. Obviously a movie hijacked by George Lukas. Worst of all, it started turning into Stargate."
    }
  ]
}