{
  "id": 2847,
  "title": "Indiana Jones and the Temple of Doom",
  "starring": [
    "Harrison Ford",
    "Kate Capshaw"
  ],
  "runtime": 118,
  "genre": [
    "Adventure",
    "Action"
  ],
  "description": "After arriving in India, Indiana Jones is asked by a desperate village to find a mystical stone. He agrees – and stumbles upon a secret cult plotting a terrible plan in the catacombs of an ancient palace.",
  "releaseYear": "1984",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3CUUdNP7bHvJ7UT2MiG9iDKIRdu.jpg",
  "categories": {
    "plot": 7.666666666666667,
    "acting": 7.423076923076923,
    "ending": 7.0,
    "soundtrack": 7.857142857142857,
    "cinematography": 6.5,
    "familyFriendly": 6.638888888888889,
    "funny": 8.125,
    "action": 7.358974358974359
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Lucas and Spielberg botched the second installment, 1984's Indiana Jones And The Temple Of Doom. After a great opening in a Shanghai nightclub, Ford lands in a remote Indian outpost where a revived Thuggee cult engages in slavery and human sacrifice. Temple suffers considerably for working on a less ambitious scale, saddling Ford with a shrill heroine (Kate Capshaw, stepping in for the vastly more appealing Karen Allen) and engaging in the worst kind of exoticism. (Foreigners are weird, backward, and dangerous, and they eat gross food.) But the clumsy attempts at darkness are what really spoil the fun. All the shots of emaciated children laboring away under threat of death make Temple feel less like a Raiders sequel than a warm-up for Schindler's List."
    },
    {
      "rating": "10",
      "text": "My favorite in the entire series. It had a magnificent cast, great action sequences, Willy was super funny, and was definitely worth making it. It was intentionally darker, but Lucas was going through a divorce and and accident during a Spielberg movie killed an actor, and yet people don't take enough time to actually watch it, instead of bashing it. Yes, it was darker, and the heart scene was too much, but it was a great movie otherwise. Definitely watch it! Classic. I unashamedly love this film.The three main characters represent every level of the audience. 1. Indy - the hero we all want to be. 2. Short Round - the person we most likely are and 3. Willy Scott - the person we really dont want to be. This is why the comedy aspect of the movie works so well. Supreme adventure film. Dont take it too seriously. I dont understand all the hate for the movie in India - sure there were Indian bad guys in the Thugee cult but there were lots of Indian good guys too. Good and evil exists in any country or culture."
    },
    {
      "rating": "7",
      "text": "while not as a good as the original its still a good movie in its own right that desrves to be respected more"
    },
    {
      "rating": "7",
      "text": "Not as impressive as the first installment, but still watchable.\r The Indiana Jones-magic is still present, but there're are a lot of smaller flaws. The biggest is without doubt the actors. Jonathan Ke Quan and Kate Capshaw are both non-fitting actors for their role. Jonathan is a really bad actor, he totally ruined the movie. Some of the dialogs are forced and the chemistry is a bit vague at some places. The opening scene is slow but great, and the movie is overall really funny and entertaining. It also got great cinematography and the classic music is spectacular! But it's not as great as the previous movie, and the major reason is the plot. It's not as adventurous or entertaining, but it's still a great movie!\r A less impressive sequel.\r 7/10"
    },
    {
      "rating": "4",
      "text": "The only nice thing about this film is seeing Harrison Ford in his Indy costume while still in his prime.  The rest of the film is a dark, noisy mess.  It is easily the weakest entry of the sequels to Raiders of the Lost Ark.  The character of Willie Scott was about as deadly to the film as Jar-Jar Binks was to Star Wars: The Phantom Menace.  She's given tons of screen time to whine, scream, and complain about just about everything around her.  The mcguffin of \"Magic Rocks\" was weak too.  Following the Ark of the Covenant, it would have been better to go with the Holy Grail instead and worry about a Mcguffin  for Indy 3 later.  Perhaps a fan edit could undo much of the damage by cutting Willie's scenes by about half, but I know of no such fan edit.  As it stands, it is a dark ugly mess.  As an over-correction, Indy3  was too cutesy by half; which is why I thought the balance applied to Crystal Skull was just about right...even though the Mcguffin there was weak too.  My guess is that Indy5 will be more like Bond, and have Indy fighting over a conventional menace instead of an ancient mystical one."
    },
    {
      "rating": "4",
      "text": "It's a fun movie but there was too much action once they're in the temple and it's in that dark setting for so long, \"Willie\" was so awful (completely helpless, constantly nagging and screaming, materialistic (\"OMG diamonds!!!!\"), even that odd choice of a name for her), and it veers too far from reality (the first film felt like it could all really happen, sort of, with some limited supernatural elements until the end). The child slavery was unsettling. Sure, stuff like that has happened in human history, maybe not exactly like this, but was it necessary to see children getting abused and so much? I didn't like the cheap gross out scenes in the first film and for some reason they decided to do a lot more of them for this one, just really don't see the point. The audio, at least the version on Netflix, is really imbalanced and too low so it is very hard to hear the dialogue and I tried tweaking the sound settings a lot and had the volume at almost double what I needed for the first film. Lucas and Spielberg admitted they messed this one up due both of them going through divorces around the time it was being made. I'd give this film a 5 or possibly 6 but some people do not know how to give criticism and blindly rate stuff 5/5 or 10/10, which really gives a misleading average score."
    },
    {
      "rating": "10",
      "text": "This is definitely an unpopular statement when I say Temple of Doom is my favorite Indy movie. I mean I don't get it! Why do people say this is a weaker entrance in the series? I thought it just improved upon everything in Raiders! Now I can agree that Kingdom of the Crystal Skull sucked badly, but why do people think this is weak. Its a funny (Thanks to the very annoying but hilarious characters Short Round and Willie) heartwarming action packed adventure with one of the best Indy villains of all time. And this a film you won't forget. Trust me. 10/10"
    },
    {
      "rating": "2",
      "text": "Kings being served snakes, soup of eyeballs and the desert. Yuck!!! Since when did kings in India eat these? Who told the producer this? Stupid producer with lack of basic knowledge. And what gives him the right to show such insulting stuff?? And making fun of worshiping idols. The worst movie...couldnt watch because of utter nonsense! Probably made in 1984 when the western world had little or no idea about India and the other countries on the other side of the world. LOL! I was pretty surprised that Amrish puri said yes to acting in this **** movie. Indian kings never ate this kindoff stuff. It was so stupid to show this and give a misguided look at India. Insulting india was the only thing it managed to do...The director and writer lacked basic common sense and lack of knowledge about the eastern world."
    },
    {
      "rating": "8",
      "text": "While it dosen't quite live up to Raiders, Temple of Doom still features exciting set pieces, rousing action, strong acting from Harrison Ford, and typical first-rate special effects."
    },
    {
      "rating": "9",
      "text": "An iconic dark and non-stop action/adventure movie, with a great performance by Ford, awesome practical effects and set pieces, incredible camera work and of course, the Spielberg magic. While not quite reaching its predecessor's heights, it is still tons of fun."
    },
    {
      "rating": "7",
      "text": "It is likely the most boring movie about Indiana Jones if to take the original trilogy. But it is still fine adventure movie from Spielberg. A setting boring and story about India weren't so interesting as bible stories. And the cast gives way to two other movies."
    },
    {
      "rating": "3",
      "text": "In this film, the second in Indiana Jones franchise, the famous explorer goes to India, where he will face a strange and dangerous cult that kidnaps children in a nearby village of their temple. Directed by Steven Spielberg, this prequel to the first film has script by Willard Huyck and Gloria Katz, and keeps Harrison Ford in the title role.See this movie and compare it with the first of the franchise makes you want to ask Spielberg what the hell went wrong. After a film as interesting as \"Raiders of the Lost Ark\" (which revealed some flaws, but had a very own charm), this one is a real cold shower. Kate Capshaw is a perfect casting error, never managing to overcome the mediocrity. Harrison Ford, although don't embarrassed his character, also doesn't appeared to be properly inspired, making his role without much emotion. For posterity, however, are the scenes of the banquet in the palace, who can start sonorous laughter from any audience. The script is not necessarily interesting, missing movement, the action is very concentrated only in certain sequences. The photograph is bad and boring, colors are too loaded, especially red tones, which is not good, although the visual effects have won an Oscar. The costumes are well imagined and some scenarios as well but the soundtrack brings no surprises or novelties.People say that there is no love like the first, and this is true in the movies: after a movie like \"Raiders of the Lost Ark\" was very hard not to disappoint the audience, but it would have been easier to please with a smarter script, a more vivid and adventurous story, a less forced photograph and a main actress better and less noisy."
    },
    {
      "rating": "8",
      "text": "It is a circus ride full of so much adventure and action. A wonderful experience it is to be in the company of Indiana Jones on his journey. One of Spielberg's best."
    },
    {
      "rating": "8",
      "text": "There are some scenes where it's too dark and gross, but this excellent sequel doesn't fail to entertain us with humor and action. A must-see if you enjoyed the first."
    },
    {
      "rating": "7",
      "text": "\"Dr. Jones, I am an Asian child stereotype!\"-Short Round, probablyOh look at the ritualistic satanic foreigners who have some kind of mystic and magical power! Oh look at the dumb bimbo blonde who breaks her nails and shrieks at everything! Racist, insensitive, and sexist, Indiana Jones and the Temple of Doom still remains a terrific little adventure film. With fun action scenes, banter, and a charismatic turn from Harrison Ford, Temple of Doom may be a lot darker and more violent than even Steven Spielberg liked, but it is still a very campy and fun film that delivers all of the Indiana Jones spills and thrills anticipated courtesy of great action set pieces and his iconic lasso.What is always striking about the Indiana Jones films is that they are both compelling romps through archaeological legends and rip roaring good times nonetheless. While the archaeology is hardly a focus of the films, the mythology always is and Spielberg continuously delivers compelling and fun mythology. Here, the film is set in India with a magic rock missing that is being used by a Kali worshipping occult group that sacrifices people to honor Kali. Sent in to find the magic rocks and put a stop to this group of weirdos, Dr. Jones faces some considerable pushback from this demonic underworld while running about with Asian child sidekick Short Round (Jonathan Ke Quan) and blonde bimbo Willie (Kate Capshaw). While the film's beats are hardly different from Raiders of the Lost Ark in this prequel, the film's fun energy and blending of this mythology with excellent action set pieces consistently sets this one apart from other dumb blockbusters with half-hearted mythology that never lends itself to the action. Instead, the mythology and legend of the film is always given room to breathe and is always given the time of day instead of being squandered by focusing solely on the action. As a result, it is a blockbuster with a fun and unique plot that has great action instead of a hollow piece of trash that is just action with no substance whatsoever.That is not to say the film is not flawed, nonetheless. While dripping with historical mythology, the film does still get a bit too wrapped up in the action as it reaches the end of the second act. From the point where Indy drinks to the blood to when they get off the bridge, the film barrels full speed towards its climax and falling action with reckless abandon. The set pieces are all very nice, but just become too much to become far too long. While the scenes all serve a purpose, they just go on for far too long and for a non-action junkie, though the scenes are truly excellent pieces of filmmaking, it just felt like Spielberg opted to ditch that aforementioned strength in focusing evenly on action and mythology in the name of just going balls to the wall with action scenes. It is a sadly hollow result, no matter how nice they look (aside from the severely dated special effects on the bridge that are hysterical, especially when that chief demon heart ripper out guy hits the mountain).The film's flaws continue to its various cultural issues both in the stereotypical comic relief antics of the young Short Round, but perhaps the worst is Willie. A blonde bimbo who worries about breaking her nails, the character smacks of Spielberg having just watched Alien and thinking, \"Ha! Women could never do that.\" Though he is hardly a misogynistic filmmaker, the character of Willie is certainly one of his worst with her just there to provide cleavage and comedy about how useless women are in \"manly\" situations. She screams when it will reveal their position, is too weak to get on elephants like young boys can do easily, she freaks out with bugs, and has to be shown how to do literally anything. Oh and she also is just there to flirt with Indy and use suggestive innuendo. Charming character, to say the least. The writing is hardly the reason to see this film, but this piece was just above and beyond terrible.Fun, action-packed, and excellently anchored by Harrison Ford, the Temple of Doom may be a stepback from Raiders of the Lost Ark, but it is a good film nonetheless. That said, I do miss everybody from the original film and wish this were not a prequel, even if the Nazis would have needed to be involved in this film (as Spielberg makes it sound, if it were a sequel). Rather offensive to Hindus and women alike, the film is otherwise harmless fun with excellent blockbuster filmmaking by Spielberg with fun and inventive set pieces, smart mythology, and the perfect establishment of stakes to give this one considerable weight. Though imperfect, Temple of Doom is nonetheless another fun Indiana Jones film."
    },
    {
      "rating": "10",
      "text": "This is another great, fun and action packed addition to the Indiana Jones series.  I really enjoyed this film (the adventure tone is great, and the darker tone is fresh and new), the cast is great (Harrison Ford is once again a beast), the romance is good (Kate Capshaw is a hilarious actress and I personally enjoyed her performance), the story is fresh and new and fun, the music is spectacular again (John Williams is the man!), the action is top notch along with the visuals, the locations are awesome, etc.  This film packs it all in and really leaves a good mark on me, I love this film!  Another great classic adventure film!"
    },
    {
      "rating": "9",
      "text": "Indiana Jones and the Temple of Doom may not be as great as the original but is still damn awesome. Just like in the first; the direction, the writing, the performances, the action, and the music all make this film so great. Definitely a must watch, after the first one of course."
    },
    {
      "rating": "7",
      "text": "Great props, locations, and stages. Great performances. An enjoyable movie for all ages. A movie that will stand the test of time. A must see film for anyone."
    },
    {
      "rating": "10",
      "text": "This is my favorite Indiana Jones movie in the series. While Raiders of the Lost Ark and The Last Crusade are really great, I also have a fun time watching this amazing adventure."
    },
    {
      "rating": "0",
      "text": "Indian Culture and Hindu Religion have been insulted in this Movie. ......."
    },
    {
      "rating": "7",
      "text": "Not close to Raiders but still a lot of fun with great wit and action. Very entertaining."
    },
    {
      "rating": "8",
      "text": "While it may be considered a weaker Indiana Jones movie, it's still a fun action-adventure. Overall, it's dark and adventurously fun. Be sure to check out my YouTube channel, \"TheMovieManLife\" for all things movies."
    },
    {
      "rating": "8",
      "text": "My least favorite of the Indiana Jones movies, but a gem nonetheless. The movie is a little more darker and slightly more intense than the first one, but the story and characters are still pretty memorable."
    },
    {
      "rating": "8",
      "text": "This misunderstood sequel to Raiders has truly stood the test of time. I love its originality, its humour, its use of special effects and look into the occult."
    },
    {
      "rating": "10",
      "text": "\" Daring , thrilling , best adventure film directed by Speilberg\". I love watching these of kind genre adventure movies especially Harrison Ford playing the guy with the hat in the film series. Ok Temple of doom is a prequel which i did not know why  but it is brilliant. Ford is the perfect Indiana Jones for this movie. The movie was great , the stunts were great , also the setting was great , a good wonderful cast that is lucky to go on an adventure like this with Director Speilberg. Grade A+"
    },
    {
      "rating": "9",
      "text": "This might be an unpopular statement...but this Indy is my favorite. Most people gave it a mixed review but i dont get it....its a perfectly good fun film. what else do you want?"
    },
    {
      "rating": "10",
      "text": "Childhood memories up in here, loved the Indiana Jones Franchise. This is the best and my favorite of the three Indiana Jones Movies, not watched the fourth one yet"
    },
    {
      "rating": "6",
      "text": "Indiana Jones comes back in this dark gritty sequel,when he enters in an unexpected adventure that leads him into a temple filled with the devil's followers.Funny,intense,suspenseful and action filled,Indiana Jones and the Temple of Doom is a very enjoyable sequel."
    },
    {
      "rating": "9",
      "text": "Though some may complain that it feels nothing like an adventure film, its dark atmosphere and funny characters make it worthwhile for Indiana Jones fans. Definitely a must-see and another great adventure!"
    },
    {
      "rating": "9",
      "text": "While not having as great a story as the original film, \"Indiana Jones and the Temple of Doom\" serves as a very entertaining picture towards this adventure franchise, which has lasted decades and deeply impacted cinema. I must say that the characters in this film are much more fun to watch, due to their silliness, and the direction is just as good as before."
    },
    {
      "rating": "7",
      "text": "\"Indiana Jones: The Temple of Doom\" was a very good movie, comic, and interesting, although it did not surpass its predecessor, had much in common, and I do not know why the Hindu culture in this film was very rare, But at last I had fun."
    },
    {
      "rating": "9",
      "text": "With Indiana Jones and the Temple of Doom there seemed to be two different directions Spielberg wanted to take with his Indiana Jones movies: on the one hand the humor was more silly than in Raiders of the Lost Ark, but on the other hand the movie also took a dive into the dark side of human nature.\r The movie starts very light-hearted with a car chase involving the little chinese boy Short Round who's driving the car using blocks on his feet. Then it's of to India where doctor Jones, the female night club singer Willie and little Short Round meet a village with desperate people who had their children taken from them. Next there is some comic relief again: the banquet with a lot of strange foods and also the very funny scene in the catacombs with the insects scattered allover the floor (\"It's not cookies doctor Jones!\") After that Jones and his friends go in a temple where a secret cult is torturing people, ripping their hearts out of their chest and trowing them in hot lava.\r This constant changing of atmosphere can bring some confusion and can even make the viewer feel uncomfortable if he takes it all too serious. Maybe it's best not to do that and just enjoy the wild ride. And a very wild ride it is!\r I rate this movie slightly lower than the first one, 9 out of 10."
    },
    {
      "rating": "8",
      "text": "I've been telling you guys this same old pattern like a million times already... since when did opinions became so stupid? The answer is... long before you guys even exist."
    },
    {
      "rating": "8",
      "text": "This movie is underrated by critics. This is a prequel to one of my favourite movies of all time. It has a darker story, and still entertains, evej though it feels like the first one."
    },
    {
      "rating": "9",
      "text": "I don't know why this movie gets such a mixed reaction, I enjoy it as much as the first, maybe a very tiny bit more. I think the darker and more over the top moments add a lot of entertainment to the film, especially the iconic ripping the heart out of the chest."
    },
    {
      "rating": "7",
      "text": "Indiana Jones and the Temple of Doom was released in 1984 and was directed by Steven Spielberg. It is the sequel to Raiders of the Lost Ark and the second instalment in the Indiana Jones series.Something that you may not know is that this film is a prequel to the first film. The only thing in the film that points this out is when it states the year at the start of the film (this one is 1935, Raiders is 1936). Other than that, there's nothing really that says that this is a prequel and it's just something I wanted to point out.I appreciate this film for being entirely different to Raiders which makes a refreshingly new experience and with a story pattern not used previously, it makes the story less predictable and therefore more exciting.Harrison Ford is still great as Indiana Jones and is as charismatic and heroic as he was in the first film. Other characters along for the ride are Willie Scott and the little kid Short Round. At first, Willie may seem quite irritating as she's constantly screaming and complaining but if you think about it that's how someone who'd never experienced these situations before would probably react. Also, towards the end of the film she seems to help a lot more which is good to see as it shows how her character has developed.Short Round is easy to love and he's quite a good character; intelligent in thinking and with no fear, much like Indy himself. His acting can seem quite unrealistic at times but he was played by a child so you can kind of let it pass and also I think it's above standards for a child actor. You can see how these characters don't have the best of relationships at first but as the film progresses their relationships grow and it's great to see them all working together in the final act.This film does have quite a dark tone to it, so dark that it contributed to the creation of a new rating: PG-13. There are things in it such as monkey brains, eyeball soup, snakes being cut open, heart being ripped out and child abuse (don't worry, none of these are as graphic as they sound). To be honest, comparing the content in this film to the original, it's not that much darker. It is certainly darker than the original but definitely not as dark as some people make it out to be.The sets in this film are great and all feel authentic. The practical effects are also still great, especially the heart scene. However, some of the green-screen isn't particularly good like in the original but it's something that doesn't appear much thankfully.There aren't really many notable action scenes in this movie; in Raiders pretty much every action scene is memorable, however the only one that really stood out to me in this film was the final bridge fight.As I began watching the film, I wasn't sure whether I was going to like it or not because not as much was as investing as the original but as the film progressed it certainly got better and the final 20 minutes are great to watch.Overall, this is a nice change from what we received in the original and is an enjoyable watch. It does have a darker tone than the original but when comparing it to the original it's not too bad. This movie is definitely not as good as Raiders but is still a very good movie and I would recommend giving it a watch.7.8/10"
    },
    {
      "rating": "9",
      "text": "I enjoyed it more than the original. The characters are entertaining, funny, and acted well. The story isn't perfect, but neither was the first, story wise that is. It is a classic, even if it isn't super realistic. It is worth a watch for sure."
    },
    {
      "rating": "9",
      "text": "Really Good SequelIt’s definitely not as good as it’s predecessor, But Temple Of Doom is still a great movie."
    },
    {
      "rating": "4",
      "text": "Weird one and kind of gross in places so not really a fun family movie for sure. Sets looked Las Vegas Stage Show cheap and the acting really bad in places for the small supporting roles. Comes across as cheap amature hour compared to Raiders of the Lost Ark. Serilously wtf did I just watch?"
    },
    {
      "rating": "8",
      "text": "Steven Spielberg's Indiana Jones and the Temple of Doom is a great sequel/prequel to a fantastic film. The action scenes are just as good as the previous film. The acting is, of course, great and the music is still iconic. The reason a lot of audiences and critics didn't like this film at first was because of how incredibly violent this film was compared to the first. But overall, I love this film and I think that it's great"
    },
    {
      "rating": "3",
      "text": "The Temple of Doom is a silly film that becomes more atrocious as it ages. During this period of golden age film making, there were a lot of experiments at mixing comedy with violence/horror while still trying to make it family friendly. Such a result can be seen here. It is an extremely gorey film, yet its targeted at children to an extent. It's disgustingly dishonest and pulls itself apart so inelegantly.Couple with an incredibly weak (yet well acted) annoyance of a female lead, a child who seems more fitting to be the 2nd main, and you have probably the most mismatched protagonists of any action movie.The only saving graces are the lavishly detailed sets and vibrant colours, with some acceptable action sequences. But growing up and reflecting on what was made all those years ago; looking at what you could get away with, Temple of Doom doesn't deserve the praise it gets, for its guilty of just being too unsophisticated and unintelligent."
    },
    {
      "rating": "10",
      "text": "The only possible thing that could make this movie better is that if it were Lego. If it were Lego, it would be better , but its not so I must give this movie a 2. ignore the fact that it says 10, its lying."
    },
    {
      "rating": "3",
      "text": "I was told growing up that this movie wasn't quite as good as the original, and that the gore and violence was over the top. I'm so used to hyperbole that I expected the movie to not be that bad, but now that I've watched it I can confidently say that this movie is SIGNIFICANTLY worse than the original. Almost every scene is difficult to watch because of the violent imagery, and this is coming from someone who loved The Revenant. The plot is garbage, and revolves around Indiana Jones helping a Hindhu tribe get their magic stone back. Jones was apparently willing to risk the life of a young boy throughout this entire adventure, and it wasn't even for some greater good cause, it was so some Hindhu tribe could get their magic stone. Such a downgrade from the original."
    },
    {
      "rating": "7",
      "text": "Some interesting ideas and a wholly culturally insensitive screenplay come together in this effects laden action adventure film. While not the best screenplay in the series, it's a fun watch and it's great to see the effort that went crafting an original second outing for indy. Kinetic and well produced with a fantastic cast."
    },
    {
      "rating": "9",
      "text": "It is for many the weakest movie of the original trilogy but you will hear almost never a complain that it is a bad movie. Instead of playing it save with a more of the same sequel they tried some new things. It is chronological the first movie and a bit more grim and darker. After again an intense introduction I wont spoil Indianan Jones, his (eleven year old) sidekick Short Round and American singer Wilhemina Scott crashed in India. Here they will experience a dark and intense adventure. Many people hear that it is the weakest movie and expect an awful disaster and are surprised afterwards how good it was. I just repeat myself it is a really good movie that is weaker than Raiders of the lost Arc which is by all standards one of the most acclaimed and cherished movies of all times. Storywise it fully delivers. I cant remember many boring moments and it has some really intense and memorable scenes. The action scenes are also well done and are breathtaking. There is the complaint that it is too dark by many and that it has no humor. While I see the validity of the first argument I think it is not too dark and it delivers and intense atmosphere and immersion. For the humor I think that is a wrong statement. There are many humorous scene that often come up in discussions for the movies. Lets talk about the strong cast. Harrison Ford delivers again a great performance as Indianan Jones. However I think that Jonathan Ke Quan as Short Rounds made an even better performance. He is the hidden star of the movie and became a favorite character, Lets talk about Kate Capshaw as Wilhelmina (Willie) Scott. I know that many think that I dislike her character and start a rant. However it is the opposite. She gave a great performance and delivered. Many find her annoying but that is her role. It is a trope or stereotype and she nailed it. I recently discovered that this movie hurt her career and I am sorry for this. Then there is Amrish Puri as Mola Ram. He is a great antagonist and so intimidating that it will give you nightmares. One of the most underrated villains in movie history and on a side-note winner of many best villain awards. This movie has a great cast and I see no real flaws here. I want also praise the sets and visuals. Everything looks great and realistic (=as you expect it to look). They nailed the temples, jungle and mines. I read that they wanted to film in India but after some difficulties filmed in Sri Lanka. Visually and stylish there is also not much to criticize. It creates or helps to create the atmosphere and immersion. Then there is of cause again the legend himself John Williams who is one of the best film music composers of all times. Again a great soundtrack as expected. Overall this is a great movie and without Raiders of the lost Arc it would be appreciated more. While I agree it was the weakest of the trilogy it is still remarkable. Look at Kingdom of the Crystal Skull how a terrible Indianan Jones movie looks like."
    },
    {
      "rating": "7",
      "text": "On its own it is a fun yarn, but compared to the brilliant Raiders of the Lost Ark it is a disappointment. The story is rather overblown and not as well thought out, Kate Capshaw's shrill and annoying heroine is one of the least engaging characters in the series and the character of Short Round didn't do much for me either. However, the sets and cinematography once again are fabulous, as is the score. The script has some nice touches, the direction is good and the pacing is brisk. There is also some terrific action especially the wild roller-coaster ride through the Indian Mine, and Harrison Ford is still very engaging as Indy. On the whole, disappointing but it is still pretty decent. 7/10 Bethany Cox"
    },
    {
      "rating": "5",
      "text": "Though not a terrible movie, Temple of Doom is certainly a tier below Raiders of the Lost Ark. There's plenty of comic moments and entertaining action sequences, but overall the film is bogged down by weak side characters, glaring stereotypes, and the unrelenting darkness of the tone."
    },
    {
      "rating": "9",
      "text": "The Raiders template works. But Temple of Doom perfects it. Every quirk, stumble, and miscue of Raiders (they are there) is polished and improved."
    },
    {
      "rating": "7",
      "text": "The Temple of Doom is a good film, but the script is not as appealing as the original and the rhythm and pace is sometimes quite bad.The action scenes are wonderful, let's be clear about that."
    },
    {
      "rating": "10",
      "text": "An interesting and exciting adventure, marred by ridiculous violence and darkness (although I'm no longer as bothered by that as I used to be).  Like the other movies in the series, it has something of a historical basis (emphasis on the word \"something\" - LOL), although this one is probably more accurate than the others.  Many condemn it as racist, sexist, etc.  That's ridiculous.  (And condemning it for condemning idol worship is also ridiculous.)"
    }
  ],
  "recommendations": [
    "thor_the_dark_world",
    "the_fifth_element",
    "thor_ragnarok",
    "the_scorpion_king",
    "jungle_cruise",
    "avengers_age_of_ultron",
    "kung_fu_panda_2",
    "guardians_of_the_galaxy",
    "thor",
    "last_action_hero",
    "the_suicide_squad",
    "hercules",
    "the_adventures_of_tintin",
    "captain_america_the_first_avenger",
    "kung_fu_panda_3",
    "doctor_strange",
    "bumblebee",
    "dredd",
    "the_terminator",
    "king_arthur_legend_of_the_sword",
    "the_three_musketeers",
    "highlander",
    "the_last_witch_hunter",
    "rango",
    "black_widow"
  ]
}