{
  "id": 2788,
  "title": "Indiana Jones and the Last Crusade",
  "starring": [
    "Harrison Ford",
    "Sean Connery"
  ],
  "runtime": 127,
  "genre": [
    "Adventure",
    "Action"
  ],
  "description": "In 1938, an art collector appeals to eminent archaeologist Dr. Indiana Jones to embark on a search for the Holy Grail. Indy learns that a medieval historian has vanished while searching for it, and the missing man is his own father, Dr. Henry Jones Sr.. He sets out to rescue his father by following clues in the old man's notebook, which his father had mailed to him before he went missing. Indy arrives in Venice, where he enlists the help of a beautiful academic, Dr. Elsa Schneider, along with Marcus Brody and Sallah. Together they must stop the Nazis from recovering the power of eternal life and taking over the world!",
  "releaseYear": "1989",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sizg1AU8f8JDZX4QIgE4pjUMBvx.jpg",
  "categories": {
    "plot": 8.526315789473685,
    "acting": 8.941176470588236,
    "ending": 7.5,
    "soundtrack": 9.75,
    "cinematography": 0.0,
    "familyFriendly": 6.0,
    "funny": 9.7,
    "action": 9.636363636363637
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I still don't care too much for the opening, which tries to explain some of the back story of the Indiana Jones character (fear of snakes, the whip and fedora, etc.); but the rest of this film mesmerizes me.  The addition of Connery to the cast (as Indy's father) is a nice touch, providing further insight into the character development, though it does seem to be pushed a bit past the limit at times.  Still, in a film-ic version of old serials, limits were made to be pushed.  There is not much time to relax during the entire running time, but I don't see that as a problem.  The humor (through both the Marcus Brody and Saliah characters, as well as the interplay between the Fords) is in just about the right proportion (again though, it does push the limits).  The storyline harkens back to the \"Raiders\" style, drawing on religious themes and including everyone's favorite bad guys:  Nazis.  It's flicks like this which go a long ways to atoning for past mistakes (re:  \"Indiana Jones and the Temple of Doom\")."
    },
    {
      "rating": "8",
      "text": "Last of the three original Indiana Jones Movies with Sean Connery. Adds a new Flair to Indiana Jones,   providing good  chemistry between Ford and him"
    },
    {
      "rating": "10",
      "text": "My favorite movie! The plot was the best and the scenes were epic! The actors definitely improved from the previous movies. What can i really say? Stop reading and start watching!"
    },
    {
      "rating": "10",
      "text": "This movie is so good that it makes it very hard to say which of the Indiana Jones is the best. The film hits all the right notes, as the first one did, with the Spielberg magic at its highest, everything is just like you would expect it and like it to be in an Indy film. A great entertainment for all ages that will never get old or tired."
    },
    {
      "rating": "9",
      "text": "Raiders of the Lost Ark was absolutely brilliant, while Temple of Doom was pretty good if disappointing. The Last Crusade improves on Temple of Doom while just lacking the brisk efficiency of Raiders. It looks fabulous and has a great music score. The script is deliciously witty especially with the interplay between Ford and Connery, and the story is engaging. The action is epic, and I liked the neat sequence at the beginning that explains things such as Indy's fear of snakes and how he got the scar on his chin. Steven Spielburg does an excellent job directing, while both Harrison Ford and Sean Connery(in a masterstroke of casting) are perfectly cast as Indy and Indy's father. On the whole, exciting, witty and fun. 9/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "Many people will say that this movie and the first Indiana Jones movie are the best two in the whole series, and they are right!\r This movie is again filled with action, excitement, adventure and humor. The chemistry between Harrison Ford and Sean Connery is fantastic. The music of John Williams is great as always, the main theme just doesn't get old... it's one of the most famous themes in the history of film music.\r Indiana Jones is kicking some nazi butt as usual, this time pursuing the Holy Grail, and while he's at it also finding his father dr. Henry Jones senior who has been kidnapped. This time Indiana gets to see Hitler eye to eye, and he even gets his autograph.\r The Last Crusade gets a score of 10 out of 10, just like the first Indiana Jones movie Raiders of the Lost Ark."
    },
    {
      "rating": "10",
      "text": "Everything clicks in this action-packed cliffhanger. In his third (and what for years what thought to be his last) adventure, Indy is on the hunt for that ultimate treasure, the Holy Grail. Along the way he must contend with Nazis, a secret brotherhood and, of course, snakes. Sean Connery is a wonderful addition as Indy's father, and the chemistry between he and star Harrison Ford may just be one of the best in film history. The movie is a true rarity in that its attempts to outdo each preceding chase sequence succeed. Though children might have trouble interpreting the plot, this crusade is one people of all ages will enjoy."
    },
    {
      "rating": "10",
      "text": "It's getting better, better, and more fun, Indiana Jones And The Last Crusade is another fantastic adventure, Harrison Ford as usual, always great, and Sean Connery who's doing an amazing performance, Raiders Of The Lost Ark is the beginning yet a great adventure, The Temple Of The Doom is the craziest one, and The Last Crusade is the most fun, i highly recommended."
    },
    {
      "rating": "8",
      "text": "The movie still has its adventurous spirit with a bad ass performance by Harrison Ford. However, the movie  may be boring for some of those who already have watched its prequels due to the extreme similarity. Overall if you like adventures, a great movie to watch."
    },
    {
      "rating": "10",
      "text": "The best of all of the Indiana Jones."
    },
    {
      "rating": "10",
      "text": "In my opinion the best film in the entire series, The Last Crusade was a huge step up from Temple of Doom and a huge improvement from Raiders of the Lost Ark. Why? The action was better, the plot was more engaging and probably the main highlight is the father and son chemistry between Harrison Ford and Sean Connery  that completely made the film so damn enjoyable."
    },
    {
      "rating": "10",
      "text": "The best opus of the Saga. Great acting, specially from Ford and Connery. This movie is a perfect mix of humour, action and good scenario . No doubt it's a cult movie !\"Pro\" critic reviews is just a joke, it deserves, at least a 80  rating !"
    },
    {
      "rating": "10",
      "text": "It's flabbergasting that this movie has a 66/100 metascore from \"critics\".  not sure what they were smoking back in 89 but this movie is unsurpassable in the Action/Adventure genre."
    },
    {
      "rating": "10",
      "text": "This film is excellent, it really holds up to the first 2 without a doubt and is way better the disappointingly over awful fourth film, Harrison Ford and Sean Connery's on screen chemistry is brilliant, easily one of Sean Connery's best movies.  Really entertaining throughout."
    },
    {
      "rating": "9",
      "text": "Not as good as Raiders of the Lost Ark, but better than Temple of Doom. The Last Crusade plays it safe by going back to the more successful style of the franchise's first installment, which was welcomed by fans after some didn't approve of Doom's dark tones."
    },
    {
      "rating": "10",
      "text": "\"The Last Crusade\" is the final film in the original Indiana Jones trilogy - and fittingly, the most entertaining of them all. This time, Indy's dad joins the adventure, played by Sean Connery, and the chemistry between these two gives the movie a fantastic human center quite unique to the series. They find themselves on a quest to prevent the Nazis from acquiring the Holy Grail - and yeah, although this is essentially a rehash of the original, it's just so damn much fun that you simply don't care or even really notice. I'd seen films 1 and 3 several times before I suddenly realized how similar they were, and that's the impressive strength of \"Last Crusade\" - you get so caught up in everything with Indy and his dad, so swept up in spectacular chase sequences, that they could be after the Ark a second time and you still wouldn't care. \"Raiders\" may have established this traditional Indy formula, departed from only in the very different \"Temple of Doom\", but it is perfected and tied with a bow here in \"Last Crusade\". The music is at its best, the action is at its best, the characters are at their best, and of course Spielberg is at his best. It's a straight-up A-grade thrillride."
    },
    {
      "rating": "6",
      "text": "Until the last half hour or so, Last Crusade was a pretty solid film. It's just the ending was so painfully stupid, It sort of ruined the film for me. I mean sitting through it for 2 hours for that ending was sort of disappointing."
    },
    {
      "rating": "0",
      "text": "Geared towards 12 year olds. The dialogue is so cheesy, it makes you cringe. Every single scene is so made, it is just way too obvious that there is a camera on the other side. Sean Connery as Indiana's dad is completely and utterly miscast. The rest of the characters are all too cliche. The entire story is so bad, it is just plain boring."
    },
    {
      "rating": "0",
      "text": "When Dr. Henry Jones Sr. suddenly goes missing while pursuing the Holy Grail, eminent archaeologist Indiana Jones must follow in his father's footsteps and stop the Nazis in this adventure of a lifetime. But this adventure truly does nothing, a soulless atmosphere and dull shit."
    },
    {
      "rating": "0",
      "text": "A discovery that looks for the surreal, superb mystery of theoretic discoveries of the holy grail, what holy grail? I never realized that the grail was involved ever since the title said it was a crusade. During the crusades, nobody was looking for any holy grail, not in WW2."
    },
    {
      "rating": "0",
      "text": "Not my type, doesn't even hit the spot, it gets me thinking that this should be one of the TV episodes. Its that cheesy."
    },
    {
      "rating": "8",
      "text": "Harrison Ford saves the day again along with Sean Connery."
    },
    {
      "rating": "8",
      "text": "Love this film, not quite as good as Raiders but still highly entertaining, Ford and Connery are hilarious. Great ending."
    },
    {
      "rating": "9",
      "text": "One of the more worthy installments of the franchise, containing a hefty amount of laughs, lots of stunning effects and some great chemistry between Connery and Ford. A great conclusion to a classic franchise."
    },
    {
      "rating": "8",
      "text": "A great film! I just loved it and its my second fav Indiana Jones film. Indiana Jones and the Last Crusade 8.9/10"
    },
    {
      "rating": "9",
      "text": "The fast-paced third installment is brainy, exciting and it's better than both of its predecessors. It's not as dark as \"Temple of Doom\", and there are scenes that are just hilarious. This is a thrill ride and it won't leave you disappointed."
    },
    {
      "rating": "10",
      "text": "Unlike the disappointment that \"The Temple Of Doom\" was for me, I really enjoyed \"The Last Crusade\". It was filled with action, comedy, a great musical score, great acting and great directing just like the original \"Raiders of the Lost Ark\". And unlike The Temple of Doom it has no annoying girl screaming through the whole thing lol.. This is my second favourite Indiana Jones movie, with \"Raiders of the Lost Ark\" being my favourite."
    },
    {
      "rating": "8",
      "text": "One of the more worthy installments of the franchise, containing a hefty amount of laughs, lots of stunning effects and some great chemistry between Connery and Ford."
    },
    {
      "rating": "9",
      "text": "The third Indiana Jones movie is fantastic, and probably the best of the series, because its thematic is fun and good to explore and in the hands of Spielberg, this is perfect, because nothing could be better than Idiana Jones and James Bond, fighting Nazis while discussing the relationship of father and son and the holy graau hunting."
    },
    {
      "rating": "10",
      "text": "This is the BEST Indiana Jones film of the series with a very witty and well written script that makes it feel fresh and new, fantastic performances by Harrison Ford and Sean Connery really make this film hilarious and awesome, the direction and tone (Spielberg does a fantastic job at focusing the film on certain spots), the action is top notch epic, the adventure tone is very well done and is done in a sort of race tone which makes it more fun and enjoyable and the music is wonderful (once again Williams is amazing!).  This film packs it all in and tops the others in every way possible and makes one of the greatest adventure films ever made!"
    },
    {
      "rating": "9",
      "text": "The third installment to the Indiana Jones trilogy (I do not count the fourth one) is very refreshing and unlike most second sequels, still has a lot of energy and hope. Sean Connery is great as Indy's befuddled father who was never there for his son as a child."
    },
    {
      "rating": "8",
      "text": "A great finale to the Indie Trilogy (Crystal Skull doesn't exist I tell you!). Sean Connery is brilliant as Indie's Dad as the religious archifact adventures of our favourite archaeologist continue."
    },
    {
      "rating": "8",
      "text": "Sean Connery and Harrison Ford...father and son? its great. This movie like its predacessors is alot of fun. Harrison really shines in this film and boy do things go down hill in the next one....."
    },
    {
      "rating": "9",
      "text": "While the special effects are just as top-notch as ever, it's in the character scenes between Harrison and Sean where the film really shines.  They share such great chemistry the audience truly believes they could be related."
    },
    {
      "rating": "0",
      "text": "It is the worst of the franchise . Not only historically incorrect , it is unfunny. It is rather insulting for some. I will stick with the second one."
    },
    {
      "rating": "10",
      "text": "To quote Dr. Sheldon Cooper (actor Jim Parsons) from \"The Big Bang Theory\": \"Indiana Jones is the love child of Steven Spielberg and George Lucas\". Harrison Ford has always been charming and great in his movies. But his roles as the archeology professor with an appetite for adventures put viewers all over the world in excitement and contentment. Indiana Jones is without a doubt an unforgettable character. \"The Last Crusade\" is the third movie which on my opinion is the best. I've watched it countless times. The father - son relationship between Harrison Ford and Sean Connery (who plays his father) is remarkable. The wittiness, dangers situations and the funny commentaries from Ford and Connery makes this movie so much different, special and unique from the others. All that combined with the wonderful presence of the late Denholm Elliot and John Rhys Davies blasts the movie extremely high. Spielberg and Lucas did create a masterpiece which will outlive us and will always fascinate everyone. All of those who love adventures, danger, adrenaline, history will enjoy to the max this epic production."
    },
    {
      "rating": "10",
      "text": "I am extremely biased, having first seen it at around 11 or 12, I was and still am enthralled by this movie. From the score(which I happen to be listening to right now) to the several favorite movie lines, ie-“you lost today kid, but you don’t have to like it.” To the non-stop action, funny moments and epic cinematography. This is Spielbergs best, ET comes a close second, or it’s a tie.Go watch it, immediately."
    },
    {
      "rating": "10",
      "text": "'Radier's of the Lost Ark' was good. 'Temple of Doom' was awful. The third in the Indy series, 'The Last Crusade,' is, by far, the best in the trilogy. Sean Connery is great as Indy's father and Harrison is, of course, awesome as Indy Jones. An excellent movie."
    },
    {
      "rating": "9",
      "text": "It is very good. Much better than Temple of Doom but not nearly as good as Raiders."
    },
    {
      "rating": "10",
      "text": "The 2nd best Indi movie after Raiders. I'm surprised it doesn't fair well with the critics, this is a classic in my opinion."
    },
    {
      "rating": "8",
      "text": "Another good adventure moie with Indiana Jones. However, I really think the search for religious artifacts was becoming tiresome by this point."
    },
    {
      "rating": "7",
      "text": "It was good but not that good. I think Sean Connery was a great addition and works well with Harrison Ford. The rest of the cast was fine as well. I would have liked it see it be more original then the previous films but it was still a solid addition to the series."
    },
    {
      "rating": "9",
      "text": "Not the best movie in the series but still great fun. And I really liked the chemistry of Ford and Connery. And to everyone who says that nobody was looking for the grail at the time: IT'S NOT REAL! It's just a movie. Other than that, the movie is a blast."
    },
    {
      "rating": "9",
      "text": "This was my favorite of the series when I was a child, but Raiders is just a better movie. I love the banter between father and son in this particular installment. Ford and Connery worked well together here. A vast improvement upon Temple of Doom. This is the second best of all four movies."
    },
    {
      "rating": "8",
      "text": "Compared to the first two I think the third installment was just a little under, but only by a little as all three films were very good. Indy is back of course but this time joined by his Father, played by Sean Connery. It's a decent addition to the series with enough entertainment similar to the first two films, but I think it's starting to miss the freshness that the original had, and the new twists brought in the sequel. Overall still a good film and a great series of movies from the 80's."
    },
    {
      "rating": "7",
      "text": "Great cinematography, excellent plot, much better actors and classic & spectacular action-sequences.\rThis third movie truly is greater that its predecessors. It's one fun and entertaining movie.\r7.8/10"
    },
    {
      "rating": "8",
      "text": "Fantastic cast and direction. Borrows heavily from the format of raiders but that's hardly a flaw. Solid direction and production value all around. Shame the screenplay isn't quite as tight as raiders but it's a must watch for series fans."
    },
    {
      "rating": "10",
      "text": "The best of the Indianan Jones movies. The addition of Sean Connery and River Phoenix alone is remarkable as both were great actors. The dynamic between Indianan Jones and his father (Sean Connery’s role) is some of the best (estranged) father / son relationships in movies. Then there is River Phoenix who is only used in the introduction scenes but it is one of the best introduction scenes in movie history and tells you everything that you need to know about Indiana Jones. Also praiseworthy Paul Maxwell role here as man with the panama hat (Don't know if he is even named in the movie). Short appearance but so memorable that everyone remembers him. But lets go back to the movie. After the legendary good introduction scene Indiana Jones is informed that his father is gone missing on his search for the Holy Grail. The Grail is his fathers lifelong obsession and Indiana Jones only goes on a journey to save his father as they have a rocky relationship and are a bit estranged. This is the beginning of a legendary adventure. The story is excellent and I do not see any flaws here. It has the right pacing and a good mix of action, humor, good twists and character development. I know I sound like a fan boy here but its one of the best performances from director Steven Spielberg, writer George Lucas and the whole team. Lets go to the actors. Harrison Ford is always great in his signature role (Even in Kingdom of the Crystal Skull) and this is his best performance as Indiana Jones. I already praised Sean Connery and this is also one of his most remembered roles outside of James Bond. River Phoenix died far to young and would be possibly one of the most acclaimed actors in Hollywood today. Paul Maxwell shines in such a small role. John Rhys Davies and Denholm Elliot return to their roles and this improves this movie too. Both are fan favorites and well remembered characters too. They have again not the longest screentime but make a great performance. Then there are the antagonists I wont spoil here. All are excellent and enjoyable villains. This is such a great cast and an awesome performance. The script, actors and directing accomplish each other. This movie has so many memorable scenes be it the humorous (Non spoilery example: No tickets, the special “autograph” or the stamp joke), action scenes (No spoilers here) or character developments (Again no spoilers here). Again the sets and special effects are top notch and everything looks amazing and believable. Also again we got the famous and legendary John Williams for the score. He should have deserved more credits as he improved every movie where he made the score. Overall while there is no perfect movie this comes close. It became the gold standard for Indiana Jones movies and action adventures while also becoming a cult classic. I rewatch it once in a while because it is a movie you can enjoy again and again."
    },
    {
      "rating": "7",
      "text": "Indiana Jones's secrets are revealed in this extremely entertaining adventure,where he is forced to work with his father in order to solve the mystery.Indiana Jones and the Last Crusade is the last piece of gold in the Indiana Jones franchise and it's pure entertainment."
    },
    {
      "rating": "10",
      "text": "It should be clear to all that The Last Crusade is easily the best in the Indiana Jones series. Its comedy and wit gives it charm and breathes new life into the series, much needed after the dark Temple of Doom."
    }
  ],
  "recommendations": [
    "pirates_of_the_caribbean_the_curse_of_the_black_pearl",
    "the_world_is_not_enough",
    "goldeneye",
    "the_dark_knight",
    "spider_man",
    "the_batman",
    "raiders_of_the_lost_ark",
    "hook",
    "highlander",
    "die_hard",
    "indiana_jones_and_the_temple_of_doom",
    "the_spy_who_loved_me",
    "true_grit",
    "last_action_hero",
    "catch_me_if_you_can",
    "die_another_day",
    "back_to_the_future_part_iii",
    "the_fifth_element",
    "rocky_ii",
    "the_incredible_hulk",
    "batman_begins",
    "sherlock_holmes_a_game_of_shadows",
    "tombstone",
    "terminator_2_judgment_day",
    "goodfellas"
  ]
}