{"id": 2128, "title": "Inferno", "starring": ["Tom Hanks", "Felicity Jones"], "runtime": 121, "genre": ["Mystery", "Thriller", "Drama", "Action"], "description": "After waking up in a hospital with amnesia, professor Robert Langdon and a doctor must race against time to foil a deadly global plot.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/dtMJQzCxw2AY6tfcxhzlFpiD3BM.jpg", "categories": {"plot": 5.264705882352941, "acting": 5.523809523809524, "ending": 4.461538461538462, "soundtrack": 3.3333333333333335, "cinematography": 4.0, "familyFriendly": 6.0, "funny": 10.0, "action": 4.461538461538462}, "reviews": [{"rating": "6", "text": "Inferno stays true to its source material in terms of story and quality, delivering escapist thrills at the expense of a dense plot and too many characters."}, {"rating": "5", "text": "This should be familiar to anyone who has seen the previous Dan Brown adaptations that Ron Howard has directed, especially to anyone who saw the Da Vinci Code and rather like those films, I wasn’t really into this one.  It’s a really bland thriller which has some plots that you can see coming a mile away.  Anyone that is familiar with Dan Brown will know that his stories tend to have very good build up and promise, but then a poor pay off, and there is no difference here, in fact it almost feels like it’s been taken to the outer degree and once again, the big problem is that the screenplay writers are pretty much forced to make more adaptations than the novel, cutting very little out of it.  Expect the characters to talk a lot of exposition in a way that is fine in a novel, but does not work in a screenplay.  I would only recommend it if you enjoyed the Da Vinci Code or Angels and Demons, if you didn’t skip it, this isn’t going to change your mind."}, {"rating": "6", "text": "Racing to stop men with bad intention!Compared to the first two films, it took a long time for the third film. But I expected 'The Lost Symbol' before this one. I don't know why they skipped that book from adapting which was done in the last minutes by the production house. My guess is it might be a controversial as the first one, or simply not good enough for the cinematic version. Anyway, this film was not as good as previous two. Once again, it was directed by Ron Howard and Tom Hanks returned as professor Robert Langdon. Two hours long, but very fast storytelling, non-stop adventures.This is another tale in the series about fighting against the men who believes in the ancient text that's written about to curb the issue the human would face in the future, which is now. After waking up without any memory, professor Langdon with the help of a young woman escape from an assassin. In result, they look for the reason why and whoever behind it wants them dead. So it's not a good story, but entertaining film. Especially if you like action-adventure- suspense.Nice cast, including Hanks and Jones. The other supporting cast was not bad either. Like always, it's a European adventure, particularly in Venice and neighbouring countries. Some cool secret places, might be the settings, but awesome. Since this part was not received well, I wonder the next one, 'Origin' would be made or not. Even before that, this time I expect 'The Lost Symbol' first to hit if they want to continue with the film series. This is not a film to recommend, but not bad for watching it once.6/10"}, {"rating": "7", "text": "I have a confession. I liked the Dan Brown books and honestly, I don’t really understand the amount of stick they get. He is no Umberto Eco mind you but he is hardly Stephenie Meyer. The other confession? I have not liked the movie adaptations.The first was one was okay mind you but Angel’s and Demons was the kind of train wreck that really requires Mike and the robots to enjoy.Hope springs eternally and while director Ron Howard has certainly had some misses recently star Tom Hanks is always a dependable watch. I was expecting a decent movie and got a surprisingly good one. Even more shocking Ron Howard's direction is one of the strengths this time.First off though let me get this out of the way. The story is pulpy illogical nonsense. The twist in the middle can be seen from space and the twist, in the end, makes absolutely zero sense. (Still better than Angels and Demons Illuminati scavenger hunt, however.)What works though is the visuals. Ron Howard creates visions of hell that are actually effective and creative. The travelogue element is beautiful and unlike Angels and Demons (God I hated that movie) it is in daylight so one can actually see and enjoy the scenery. (Angels and Demons didn’t have permission to film in the Vatican so a lot of the scenes were at night, in the rain with all the lights turned off to hide this fact.)As for the cast, Irrfan Khan steals every scene he is in, Tom Hanks is dependable as usual. Sidse Babett Knudsen is dull and has zero chemistry with her costars, Omar Sy almost gives an OJ Simpson Naked gun performance that seems like it should be in a Pink Panther film, and Felicity Jones does that pixie eyes thing so all is forgiven there (No actress could really make her character work so she gets points for looking cute while flailing around.)Overall a fun film with surprisingly good visuals, some decent performances, and a silly story. Grab some popcorn."}, {"rating": "4", "text": "belongs in the series. I do believe the world is overpopulated and I've been saying it for ten years..but enough of that..i don't like the way they felt the need to change the lead female role from a 6 to 7 on the hotness scale. it just seems like a cheap shot...but i guess they are talking about overpopulation so what the hell...i own all three but i've watched this one the least by far"}, {"rating": "3", "text": "Let me break this down for you in terms of my thoughts:The best:+ Tom Hanks is ace as usual+ Some interesting ideas+ It's nicely shotThe worst:- Hanks hair- Felicity Jones character- It's boring- Bland directing- Horrible writing- Who ask for a third one?Good luck with the next Han Solo movie, Howard."}, {"rating": "7", "text": "Not as good as the Da Vinci Code, but I didn't read the book so I don't know if it's the movie or the book.  Prof. Langdon wakes up in the hospital with a wound to the head and he doesn't remember the last 2 days.  It was Langdon's deciphering of the clues that drove the story line of the \"Code\" but in this movie he can't remember squat.  Not good.  If the Da Vinci Code was an \"A\", this was a C+"}, {"rating": "2", "text": "Too bad it wasn't in a foreign language, I would not have been aware of how badly the lines were delivered. When you put a mediocre movie in your best theaters showrooms expectation doesn't only make the film more disappointing but also the whole movie going experience. This is sad because seeing a good movie in a Cine 1 is worth the extra cost."}, {"rating": "0", "text": "Giving this a zero for one main reason: They changed the ending from the book. That's pretty cowardly of them. Keeping the correct ending might have saved this movie. In addition, the movie just felt empty, like a train with no passengers travelling hours from destination to destination, just because it is scheduled to do so, even though the reason for it's movement (passengers) is absent. I kinda feel bad for people who watch the movie without reading the book. They are really missing out on the flesh of the story."}, {"rating": "7", "text": "It's not easy to review this film, because what are the standards for a 'good Dan Brown adaptation' ? You can't make gold out of crap. That said, I found this film cinematic, beautifully shot, well cast and it has some good scenes. Does it make sense? Not really, but I've seen worse films. I liked the colorful supporting actors, especially Ana Ularu as the ruthless assassin Vayentha. She has nearly no dialogue and very few scenes, but makes a powerful impression. Usually I don't buy the Hollywood actresses in 'tough parts', but she was tough as nails. I would have loved to see more of her. All in all, if you're a Dan Brown nut, you might enjoy this a lot, because it's formula, but otherwise it's more of a rental."}, {"rating": "0", "text": "Don't watch this. It follows the book just fine, apart from the single most important part!!! (the ending). I really enjoy the novels, which to the contrary of several reviews form user and critic; they are masterfully written. You can't just take a best seller and then change the single most important aspect of the story."}, {"rating": "7", "text": "Very good film! Amazing story and characters but it was very little mysteries. There are an interesting plot coups in Inferno. I can praise the actor role of Tom Hanks. You might enjoy this film."}, {"rating": "7", "text": "Pay no attention to those nattering naysayers. This latest installment in the Dan Brown mystery thriller series is a fun, suspenseful afternoon at the show. Admittedly it's not groundbreaking cinema nor especially original (as several previous James Bond movies have already demonstrated), but its intellectually gonzo attitude, intriguing plot twists and beautiful cinematography of some of the best Europe has to offer make for a rollicking thrill ride against the clock. Don't expect Oscar material here, but don't be disappointed by the sheer entertainment value it effectively serves up."}, {"rating": "2", "text": "Though a huge Tom Hanks fan that doesn't mean he always makes good movies. I saw but don't remember the first two films based on the books by Dan Brown and this is the most forgettable of all, that is if you can even remember what the plot was about though it was again a case of a man wanting to rule the world and the good people who want to stop him.\r Tom Hanks, not being a Tom Cruise, doesn't go around fighting 5 people at a time and winning the fight and, in fact, gets beaten up a few times, but, yes, recovers pretty quickly as only movie heroes can. At 60 he isn't running as fast or as much as he use to but the one thing Hanks has is that tremendous likability that always makes him a winner in any movie he is in.\r There is a strong supporting cast made up of young, middle aged and old actors doing a professional job but, alas, all for nothing. I am a firm believer of checking your logic at the door when coming to see an action movie but the screen writer David Koepp and director Ron Howard seem to be deyfing you to follow the film. Yes, someone wants to eliminate half the population, as he feels we are overpopulated, releasing a virus and there are a load of red herrings and some people are out to stop the virus from being released.\r Three things going for the movie are the soundtrack by Howard Shore, the production design by Peter Wenham and the cinematography by Salvatore Totino in Florence, Venice and Istanbul but that's not enough for a good movie.\r If you haven't seen Tom Hanks in \"Scully\" then skip \"inferno\" or save your money to see \"Moonlight\" next week and \"Loving\" the week after!"}, {"rating": "10", "text": "Great movie. Continues the excellent genre of thriller/history lesson that I've come to appreciate in this modernized trilogy. Lost of twists and turn, well acted, very happy with the movie."}, {"rating": "7", "text": "Inferno was alot better than I expected it to be and I would say it holds up well to the other Dan Brown installments. It breaks no new ground, the plot is a bit dense and it bastardizes the book a bit but Tom Hanks and Felicity Jones did well as well as some of the other actors. Overall, I liked it alot and if you're a fan of the series then give it a shot and see what you think."}, {"rating": "4", "text": "The first two in the series were good (7 or 8 ratings here), and while \"The Da Vinci Code\" was not received well by many due to its convoluted hard to follow plot, I had no problem since I had read the novel which was really a screenplay waiting to be made like no other book in memory.\rThis time the plot is so convoluted and the action so fractured and non-linear it just about lost me from the start.  I get the whole contrivance of starting with the lead's amnesia, but at a certain point they run the risk of losing the audience which I believe they did here.  Needless to probably say, it goes down the typical over formulated Hollywood route in due time and turns one big boring through the motions cliché.\r A couple details to point out:  there is an African actor and an Indian actor both of whose English is so freaking incoherent that they need sub-titles or should have been over-dubbed!  Diversity of casting is fine and the real world, but INTELLIGIBILITY in movies outweighs this bs always!  It's surprising someone of Ron Howard's stature let this by.  And all the handheld camera work ( just barely passes the subjective POV test) is not welcome.  Please Ron, do not be tempted to try to stylize up and ride current \"hip\" trends which are detrimental to a film overall and ultimately will not fare well down the road and be looked at as dated someday.\rPretty colors and lights in shallow deprh of field shots that appear acquired with newer DSLR type sensor tech makes for \"cool\" looking visuals, but the audience for these level blockbusters will never ever be satisfied by those touches.  Putting new smaller cameras on planes and vehicles for angles never before seen is fine (just about nothing is unseen at this point though, especially with this replication of GoPro tactics), but is about 1/100th the importance of story, structure, logic, pacing, and performance in these kinds of large endeavors.  Hitchcock understood this and was a master of that balance."}, {"rating": "4", "text": "This film does admit it tries its best like its predecessors, but Tom Hanks looks typically depressed about getting another role as Robert Langdon as the predecessors weren't that powerful enough for him to help improve his career. Inferno cannot be one of those movies based on novels that are willing to save a franchise from having straight mixed reviews."}, {"rating": "4", "text": "Taking the Robert Langdon series to an all time low, Inferno may stay true to its source material, but it lacks the intensity, complex plot, and interesting characters needed in order to excite audiences."}, {"rating": "8", "text": "If you're a fan of the series, it really is a film worth seeing. That being said, if you're a fan of the books it may leave you cringing at how they butchered a couple of the characters. Essentially, they had to change the ending so that it was less of a think-piece and less drawn out, but unfortunately they ruined one of the main characters in the process and that alone left me uneasy at the end of the film. Not to mention they basically blow through one of the cities so fast it almost feels like it wasn't even really a part of the story, which it absolutely should have been.\r Regardless, I think one could certainly enjoy actually seeing some of the many places mentioned in the book during the film, which basically takes place exclusively in beautiful places. Minus the depictions of hell, which feel a bit like a horror film, at times. Still, worth seeing"}, {"rating": "7", "text": "I was surprised that this opened so poorly. My wife and I are both fans of this series and we thought that it was consistent with the quality of the first two movies. I thought the actress who played Dr. Sienna Brooks was very convincing in her role. The plot was decent - a little out there but good enough to cause me to think more about it. I would probably prefer the first two over this but would still watch this one again!"}, {"rating": "0", "text": "I think this isnt a good movie...................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................."}, {"rating": "3", "text": "I have read all of dan browns books and I have watched all of the movies that were made based on the books and I was so sicken by the changes made in this movie especially toward the end that I will never waiste 20 dollars to see another one of these movies in the theater. To the actors i do not blame you but I blame the group of people that allowed the movie to deviate the ending away from the book in the hopes that a violent gun fight would sale more tickets compared to a non violent and truthful ending as the book presents."}, {"rating": "3", "text": "So many useless characters that don't do anything to an already messy plot, with more puzzles needed to be solved, inconsistency with dialogues and story telling, even Tom Hanks couldn't save this movie"}, {"rating": "5", "text": "The 3rd time is definitely not the charm as Tom Hanks returns to solve another puzzle in the Dan Brown series. This time he races to stop a virus that may destroy most of the world's population. The first 30 minutes are pretty compelling: full of disconcerting imagery and a promising pace. By the climax, there's been such a swirl of twists and chases (and some dull emotional moments) that you just want it to be over (the music during the climax is overbearing and wrong). Despite some grand locations and an interesting concept, the pastiche of intrigue is cluttered and ultimately unrewarding."}, {"rating": "6", "text": "More of a slow burn than the first two but builds to a satisfying conclusion."}, {"rating": "3", "text": "Tom Hanks gives it his all, but he can't save Inferno from being completely unremarkable and very boring...not to mention convoluted and at times ridiculous."}, {"rating": "6", "text": "Never read the books, loved the first movie - angels and demons was very silly but I rather enjoyed this outing! Great acting, good fun thrilling globe trotting with the usual silliness... Worth your time if you liked the first two."}, {"rating": "8", "text": "I love this movie - good story - best actor tom hanks - best location - excellent genre of thriller/history. angels and demons + the da vinci code + Inferno"}, {"rating": "6", "text": "I haven't read this particular book, but the movie felt like a bit overcomplicating things at times and making it harder to follow. Also the story itself felt a bit dumb, making World Health Organization like some crime fighters or something etc. I think this for sure is better as a book than movie (even though havent read it but I assume)"}, {"rating": "0", "text": "Either Dan Brown is an idiot or he, on purpose, exploits stupid people. His books are poorly written and the plots as full of holes as a sieve. But since most people are idiots, I guess there is an enormous market for this rubbish. The plot in this book and movie is no different. It's so enormously dumb that it beggars belief that even Hollywood makes a movie out of it. But, of course, Hollywood is well known for exploiting stupidity."}, {"rating": "3", "text": "Inferno is as eerie and unpredictable as the other pictures of Robert Langdon's trilogy. And also leaves a surprisingly thought-provoking conclusion that may surprise some viewers. Unfortunately, the result is still being flawed and unsatisfying."}, {"rating": "6", "text": "What could you expect from a proffesional director like Ron Howard?He's a cliché. He knows how to direct any kind of scene, knows how to score those scenes, the rhythm the scenes require, everything. He's also soulless. He doesn't elevates anything. Granted. These books (Da Vinci Code, Angels and Demons and Inferno) are hard to elevate because Dan Brown (I love him) writes very simplistic almost-direct-to-movie-script-like movies.But still, Ron Howard does this with other material too. In this case, he gets some visuals sueper right (R. Langdon's nightmares). But those are just a few.Other than that, this is a movie to turn your brain off and enjoy the ride, but not much more than that."}, {"rating": "5", "text": "Despite a few utterly astonishing scenes, Inferno cant help but feel like a cliched boring wild goose chase that we have all seen before in the alot worse Da vinci code, the twist is predictable which makes for a very average viewing experience"}, {"rating": "3", "text": "Why does this movie exist? Did we really nedd more of this series? Where there people claiming for the exciting conclusion? Because to be honest, this was never exciting, interesting, comprehensible, or even fun. The imagery is confusing as hell, Tom Hanks seems to be more interested in finishing the movie that to solve the mystery. The villain has a plan that even now I'm not sure of what was about, the camera flashes and moves to a point that was very annoying, the music never captured anything, and all together came together in a mixture that ended up annoying and boring me a lot. Not recommended to anyone. Move on."}, {"rating": "5", "text": "I had been meaning to watch Inferno when it first came out in the cinemas, but circumstance kept me from doing that for several weeks. If I had known then what I know now, I would have skipped the cinema altogether and waited until the movie is out on Netflix.The BookI listened to the book version earlier this year and it took me months to finish. It was just really not that good. Something about the story kept me from putting it aside and listen to something else in between several times. The story just drags on and on. Dan Brown really tries hard to recreate the success of the Da Vinci Code. But he doesn't quite get there. I think he needs to get away from the Robert Langdon stories and come up with something new.I listened to Deception Point awhile back and that was brilliant. It is one of his earlier books, pre Langdon era. I reckon after The Da Vinci Code it was a logical step to keep the momentum going. Angels and Demons and The Lost Symbol where still okay, although already declining in that order.  I may need to take a break from Dan Brown for a while. Maybe I start enjoying his books again in the future.With all of that in mind I was wondering why I was so eager to watch the movie Inferno in the first place. I suppose the answer is I read the books and I saw the other movies. Might as well keep going.Mixed FeelingsDon't get me wrong, I like the idea of the story. There is something intriguing about it. Why I had such a hard time finishing it I don't know. Maybe they're we're just too many twists and turns. The momentum got lost along the way. Movies are never as detailed as books; how could they be, and that partly appealed to me in this case. Plus I really do enjoy watching Tom Hanks. The previews for the movie looked halfway interesting and that settled it for me in the end. So, when I finally got the chance I went ahead and booked my ticket.With all that in mind however, I didn't have very high expectorations for the movie and thus I was not disappointed. It is by no means terrible, but it is definitely not the best movie ever made.The MovieTom Hanks once again resumes to role of Robert Langdon, a Harvard university professor, who specialises in religious iconology and symbology. In this instalment he finds himself waking up with a head wound in a hospital in Florence, Italy with no idea of what happened. He does not know why he even is in Florence nor does he remember how he got there.From here on the story develops pretty close to the book for a while. The ending has been changed to conform more to a Hollywood style finish, which is a shame. It's a disease in the movie industry to change stories, sometimes almost beyond recognition. It didn't go quite that far with Inferno but still. I rather liked the book ending.The StoryRobert Langton wakes up in the hospital in Florence Italy struck with a head wound and partial amnesia. He has no recall of the past two days and no idea how he got to Florence and why he is there. When a fake police officer attempts to show to him he is rescued by his doctor Sienna Brooks. They find a bio hazard tube in his belongings that turns out to be a projector for the scene of Dante’s Inferno. Together Langdon and Brooks race to put the pieces of the puzzle together to find out who wants to kill him and what is behind those strange visions that Langdon has. In the end it come down to saving the world from a major catastrophe. We would not expected anything less.It's fascinating how the movie incorporates the weird dreams and flashbacks that Langdon has. That part was very well done and is as disorienting to the viewer as it must have been for the character himself.Overall, Inferno is not a terrible movie, but in my opinion its also nothing to get excited about. I guess that is why it has taken me quite a while to write the review."}, {"rating": "0", "text": "Le fameux prof ésotérique reprend du service en la personne du très estimable Tom Hanks, flanqué ici d'une jolie bécasse qui me disait vaguement quelque chose... mignonne sans être vraiment jolie avec cette serpillère sur la tête en guise de coiffure, j'ai mis du temps à la reconnaître... pour me rendre compte qu'elle tenait le premier rôle dans le Star Disney Wars, celui qui sent le poisson : Rogue One ! Autant dire qu'elle était peu convaincante et qu'ici, elle ne m'a pas convaincu non plus. Ce n'est pas cela dit le plus gros souci de ce film à complot qui penche beaucoup trop du côté du thriller catastrophé avec ses courses-poursuites effrénées et agitées. Non, le plus gros souci, c'est le dit complot tout-à-fait grotesque et confus qui sort des lapins de son chapeau à intervalles réguliers et nous prend pour des gros cons.C'est en fait tellement bas du front qu'on dirait une production Luc Besson mais sans Liam Neeson ni Jason Statham, c'est dire le niveau ! certes, on y fait du tourisme et on déblatère sur l'Enfer de Dante mais il ne s'agit que de poudre aux yeux !En outre, notre bouffon hystérique français très à la mode, Omar Sy, y tient un rôle assez important et fort sérieux ! il est encore pire qu'au naturel, un vrai boulet pour le film qui n'avait pas besoin de ça pour couler à pic encore plus vite.La réalisation de Ron Howard n'est pas exempte de défauts non plus : il abuse des gros plans et sa caméra est un peu agitée elle aussi. Enfin, les effets spéciaux sont également très confus et à l'image de cette production qui fait dans l'ensemble tout et n'importe quoi."}, {"rating": "4", "text": "Though Tom Hanks and Felicity Jones give good performances, \"Inferno\" is ultimately a disappointment with a convoluted storyline and shallow characters."}, {"rating": "5", "text": "Un peu déçu... L’intrigue est lente et manque de peps. On comprend vite l’ensemble et du coup ça devient long."}, {"rating": "6", "text": "The Pandemic Movie Is Perfect for The Current Covid-19 Pandemic.First of all, I didn’t know anything about Inferno (2016) movie things are the sequel to The Da Vinci Code (2006) and Angels & Demons (2009). In the earlier minutes, I get puzzled by a lot of things, and sadly, I just understand it in the middle of the movie. How stupid I am or I’m supposed to be felt like this as the moviemaker intended? The movie is about a professor, Robert Langdon (Tom Hanks) had puzzled by an amnesia attack and tried to figure out about any event that actually makes him a crucial world-changer – involved in a pandemic attack idea. So, maybe it is okay for me to get puzzled caused the main chars are also puzzled lol.In my personal POV, I didn’t expect anything and I’m very ready to get surprised by this movie. Overall, it's satisfied me and I’ve had a lil bit surprised. The pros of this movie are the insightful knowledge, great movie plot, and systematics narration. I really like how insightful this movie is with various actual knowledge – science, history, and pandemics. I’ve been triggered to do my own research about all of that. I’ve felt getting smarter even though I didn’t really get it lol. The other pros are this movie had a tricky plot which is amazing, and systematically great narration because as a person who knows nothing, I could catch up for this movie sequel. However, the movie's cons are the plot transition felt too puzzled without a simpler explanation. It felt kinda boring caused of their long explanation to solve the main char's puzzled memory. It's getting more boring because of lack of emotional quality, I didn't feel any intense at any intense moment. Lastly, the movie ending seems didn’t satisfying enough and the audiovisual quality is just standard, followed by the quality of the acting performances.Overall, it is great to watch as movie consumption during the Covid-19 pandemic. Inferno really gives insightful knowledge and entertaining value. But beware yourself, just please don’t think about conspiracy theories about pandemic was actually purposed to be made. If Covid-19 was really like that, I’d definitely believe whoever made it’s gonna chased over the centuries. LOL. Just enjoy your Inferno with the iconic actor, Tom Hanks."}], "recommendations": ["the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "percy_jackson_sea_of_monsters", "the_maze_runner", "maze_runner_the_scorch_trials", "the_hunger_games", "terminator_genisys", "the_golden_compass", "harry_potter_and_the_goblet_of_fire", "seventh_son", "the_chronicles_of_narnia_prince_caspian", "glass", "the_hunger_games_catching_fire", "pirates_of_the_caribbean_on_stranger_tides", "the_hobbit_the_desolation_of_smaug", "the_dark_tower", "now_you_see_me", "jumper", "i_am_legend", "the_hunger_games_mockingjay_part_2", "tinker_tailor_soldier_spy", "sherlock_holmes", "fantastic_beasts_the_crimes_of_grindelwald", "the_hobbit_an_unexpected_journey", "21", "next"]}