{
  "id": 32,
  "title": "Infinite",
  "starring": [
    "Mark Wahlberg",
    "Chiwetel Ejiofor"
  ],
  "runtime": 106,
  "genre": [
    "Science Fiction",
    "Action",
    "Thriller"
  ],
  "description": "Evan McCauley has skills he never learned and memories of places he has never visited. Self-medicated and on the brink of a mental breakdown, a secret group that call themselves “Infinites” come to his rescue, revealing that his memories are real.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/niw2AKHz6XmwiRMLWaoyAOAti0G.jpg",
  "categories": {
    "plot": 4.588235294117647,
    "acting": 4.538461538461538,
    "ending": 3.875,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 5.956521739130435
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Paramount understood that it had a failure on its hands, and preferred to exile it to its exclusive streaming service.However, this is not the kind of film that will make the public interested in subscribing, far from it.Infinite makes for a very poor entry in Antoine Fuqua's repertoire.He's not a great filmmaker, but this is without a doubt, one the worst films he's ever done.And it's not a lack of ambition that tears it apart, but a lack of good execution.This was unimaginative, uninspired, uninventive, unoriginal and uncreative.Everything is just in a poor automatic mode.From the unconvincing and exaggerated plot, to the stiff and insipid performance of Mark Whalberg, who shows that since The Fighter, he's only interested in his pay.Chiwetel Ejiofor is a cartoonish villain, and he conducts himself that way the entire time he appears on screen.There's action, explosions, fights, shootings, but these are not entertaining, and that's only the last blow to this disappointing and miserable film."
    },
    {
      "rating": "2",
      "text": "Simply put: a poorly executed dumb script with actors just don’t giving sh*t for anything else then their paycheck. Terrible dialogue, tons of inconsistencies… ehh I could go on and on. The simple truth is: this is something you should avoid, because it’s neither stunning, smart or funny. It’s what an action movie shouldn’t be"
    },
    {
      "rating": "5",
      "text": "When I saw the trailer of this flick, I was taken aback: wow...it looked so glossy and high budgeted. What luck that I can watch this at the comfort of my home. I was anticipating it until I really watched this and lo and behold....we then know why this film was dumped on the streaming service. Let's face it., all of these movie stars coveted a franchise picture like Mission Impossible and the Fast Series. Wahlberg seems to expect this to be his...and recruited the very dependable Fuqua to helm it. Both talented personnel seemed to be a miss for this project. Fuqua is a brilliant action director, but he is more of the gritty type. This sort of high octane, 'Superhero' type of action is not his forte.  Set pieces were brilliantly staged but looked CGI-ed to death. Mark Wahlberg? Between his deadpan delivery and 'Boston tough guy' persona, he felt utterly unconvincing as this character. Many have undermined Keanu Reeve's ability to fit into these projects with ease, but he somehow elevated films such as the Matrix into these iconic pictures. In short, Infinite....another mixed bag blockbuster released during this pandemic year...dumped unceremoniously on a streaming service. If you are looking for a better iteration of this, watch the Old Guard on Netflix instead."
    },
    {
      "rating": "2",
      "text": "The biggest red flag is Mark Wahlberg as the lead. But even worse is the villain's motivation for being a villain. This has to be the most ridiculous villain I have ever seen. He's tired of being reincarnated because he gets his memories as an infant while everyone gets theirs as adults, and therefore wants to end the world? Wow. That's where the movie lost me."
    },
    {
      "rating": "1",
      "text": "This movie steals from a few others: Matrix, The Highlander & Inception.An awful CGI action movie so terrible written.I dont know about Mark Wahlberg. How is it that every time i see him in a movie is like he personally never wants to be there. He always looks like he just want to go home and lift some weights. He always play the same obnoxious, egotistical selfish characters.Oh the Characters. They are little to be interested in, and there is plot holes plenty.For instance: The bad guy Bathurst. He is dead set to annihilate all life on earth so he does not have to be reincarnated anymore. He is tired and want it to end.. He want to destroy all life on earth once for all.Yet the guy carries a gun called the Dethroner that can trap a soul in a memory card if he shoots another reincarnated in the head, thus ending the cycle.See the thing here? WHY doesn't he use the Dethroner and blow his own brains out and simply end the movie in 5 minutes?This is so dumb and silly beyond measure.Why have the streaming platforms become such a mailbox for bad scripts these days. They cant seem to produce any good movies anymore?"
    },
    {
      "rating": "0",
      "text": "This movie is the stupidest movie I've seen in the past years. It looks like some 5 year old boy came up with all this."
    },
    {
      "rating": "3",
      "text": "Really, truly bad. So confusing and boring at the same time. This makes Netflix’s streaming movies look like MCU films. No one will sign up for Paramount+ for this…"
    },
    {
      "rating": "0",
      "text": "Yeah, this is dismal. Did Markie Mark write this? What a terrible attempt to ripoff both Highlander and Wanted. Cringey, and not in a fun way. Couldn't finish it."
    },
    {
      "rating": "7",
      "text": "The opening of this movie with Dylan O'Brien was energetic and amazing. It got me hooked. The movie has the best fight scenes and car chase scenes. It will give u a feeling of fast and furious, the old guard and assassin creed movie.But the movie was lacking the details in the sci-fi concept. There were too many plot holes and unanswered questions related to the main concept of science fiction that should be explained and these unanswered questions will leave you empty in the end."
    },
    {
      "rating": "3",
      "text": "few thousand years old act like a teenager!!That's the main issue here!!People alive with the worth of thousands of years of knowledge and experience acting like teenagers just starting to walk into their realization of what life is and how to approach it!!Despite of that, i liked the idea which was not presented in it best suit.I liked the beginning of the movie, then came out beloved great actor Mark Wahlberg with his \"who woke me from my nice sleep\" face and you feel like his presence is not needed and the movie will be way better without his tiredness face.Everything else is average and below."
    },
    {
      "rating": "3",
      "text": "Commando 1985 is documentary compared to this and don't know who approved this that's all I have to say."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "9",
      "text": "Nice movie. Action packed and concept of spirituality shown in a different way."
    },
    {
      "rating": "10",
      "text": "I enjoy the movie i dont see where all the hate xoming from if you want action and over the tops scenes  then hell yea,story is good to i find it can even  be turn into a series."
    },
    {
      "rating": "8",
      "text": "This movie is a solid 8. Please don't follow the reviews. Watch the movie for yourself. Its a very nice movie, top notch action. It seems for reasons incsnt explain reviewers decided to bash the movie. Don't listen to them."
    },
    {
      "rating": "10",
      "text": "fantastic movie must watch sci fi action and popcorn movie To ‘Infinite’ and beyondi love you Mark Wahlberg"
    },
    {
      "rating": "5",
      "text": "Having suffered reoccurring dreams of memories that are not his own, Evan McCauley finds himself caught in a battle between two mysterious factions that will reveal the truth about his past. Infinite sets up an initially intriguing premise, but it never takes it anywhere interesting and the plot borders on incomprehensible at times. In the end it just feels like a poor copy of the original Matrix movie."
    },
    {
      "rating": "5",
      "text": "It could have been a cool film but mediocre writing and even more subpar acting makes this weird cringe fest. It's an ok movie at the end of the day but nothing special at all."
    },
    {
      "rating": "9",
      "text": "One of the best action movies exposing the public to reincarnation.  You can ignore the low scores here and on Metacritic.  This film is NOT chaotic (it had three directors, keep reading).  Rather, this film suffered the same negative reviews any film using valid metaphysical concepts does.This is an actioner in the GI Joe Snake Eyes mold; also, the best of Stephen Sommers best summer popcorn actioners; possibly, also David Leitch's Hobbs and Shaw (better film). The way actioners entertain is based on:- Pacing is more important than character,- Imaginative action stunts help a lot,- The conviction of actors and director to the material is crucial.This movie has lots of in-camera and CGI effects.  This means the movie's director can use the two VFX directors working on this film with him as a \"brain trust\" for how to shoot scenes, camera angles and many plot points.  I believe this is happening here.  The visual flair here is way above many of this director's other films, for example, The Equalizer."
    },
    {
      "rating": "5",
      "text": "I can see now why certain movies go direct to streaming, a fate certainly befitting of this sci-fi misfire. While director Antoine Fuqua's reincarnational action-adventure certainly serves up an intriguing metaphysical premise, its execution leaves much to be desired. In an age when many humans have learned how to recall their past lives with remarkable clarity, they have taken opposing views of this capability -- one camp believing it provides an opportunity for mankind to learn life lessons that leave the world a better place with the other seeing reincarnation as an inescapable trap with no hope for nothing better -- a difference of opinion that has led to conflict between the two sides. The exploration of this idea is indeed an interesting one, but, unfortunately, the story through which it is told consists of a string of implausible, overlong and not terribly interesting action sequences, as well as the plodding performance of Mark Wahlberg and the stunningly hammy overacting of Chiwetel Ejiofor. And what's with all the mascara? Makeup is something that's supposed to be invisible, not glaringly obvious or garish, but these characters often look like they're made up for a '70s glam rock performance. It's regrettable that this vehicle underperforms in light of what it has to work with as a starting point, but that's what can happen when the wrong elements are brought together. And why movies like this end up premiering on the internet instead of in theaters."
    },
    {
      "rating": "5",
      "text": "Infinite is a typical fantasy film featuring Mark Wahlberg. In general, the whole story with the reincorption of bodies and the struggle of two opposing factions is not surprising. The main plot of the film is secondary, it does not stand out and for the most part keeps the viewer with only a few well-staged action scenes. The cast also does not stand out, except perhaps Mark Wahlberg. Infinite is a classic B-movie. Film for one evening, for one viewing. A highly predictable ending. If Infinite had more information about factions, the film would be much more interesting about their history and confrontation with each other. And so it turns out that the viewer is not explained at all as if this is not a film but a fan movie for a narrow circle of viewers."
    },
    {
      "rating": "6",
      "text": "Not sure why this movie is so unpopular. It's a pretty average action/sci-fi movie with a somewhat intriguing plot and okay acting. It's not winning any awards, but it's not terrible either."
    },
    {
      "rating": "6",
      "text": "INFINITE is an exciting distraction at best and a middling, oft-times wooden thriller at worst. Antoine Fuqua directs with a sense for 90's action flicks and while that's not necessarily a knock on the movie, its certainly a case of so-bad-it's-good. Mark Wahlberg is, like always, playing himself, and with a spattering of likeable side characters, there's definitely nothing to hate here, just nothing you haven't seen before."
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)Fuqua would be commendable if he wondered questions about identity, memory and history (the existential one, the cinematographic one, the universal one) and about the value of a their hypothetical connection. But he already has all the answers and they are the most foolish that can be formulated both philosophically and filmically."
    },
    {
      "rating": "3",
      "text": "this movie is a bootleg wanted , the matrix, highlander, the old guard and assassin’s creed. this movie is all types of bad. I don't know if the production rushed but this feels like an entire season of a tv show that got cancelled after one season. why wasn't Dylan O'Brien the lead, Mark Wahlberg is horrible in this role."
    },
    {
      "rating": "6",
      "text": "Shoutout to my homeboy for hooking me up with the paramount plus, a real one!As for Infinite boy oh boy is it not what I expected, keep in mind I did not see a single trailer for this one, so I went in blind only knowing it was Marky Mark and Antoine Fuqua who made the really great Equalizer flicks ( hopefully it gets a 3rd) so I was pumped and did it deliver ? yes and no. In a way this is my kind of popcorn flick that’s pretty bad but still fun. Premise wise SUPERB, execution not so much ,like the Old Guard that came out on Netflix last year it deals with immortality and having many lives and for a brief few seconds you think you’re going to see said lives play out but you don’t and it’s a shame ,it would have been cool to see what Mark’s character goes through throughout the different Eras of time.It’s biggest crime is slowing down for a bit too long focusing on the whole world building and lore and this goes on for most of the film which was disappointing. Once the action rolls back into gear you might have lost the interest of some viewers.Mark Wahlberg despite being a figure of controversy I like him as an actor and the majority of the films he’s done I come out enjoying so seeing him in the forefront helps but man what a waste of Dylan O Brien who does fantastic work with the few minutes of screen time he gets. I hope in the future he gets more work cuz the dude is awesome. As for Mark himself he once again kicks ass and proves why he’s one of best action dudes of this era. Chiwetel Ejiofor once again does great work and gets to really ham it up as the villain and gets a cool tony stark like moment in the finale that was wicked fun. Sophie Cookson shines as a Sarah Connor like character( if you’ve seen Terminator Genisys you know what I mean, her entrance with the car) she’s badass and sells every fight scene she’s in.Despite some really great action set pieces ( one including a plane and a katana blade) its biggest crime was making it PG-13 if this had been given an R it could have gone way more brutal with the kills. Mark’s character helms this badass katana and doesn’t even use it for his fight scenes until the finale which is a bummer. Quick cuts & fast camera movements really ruin the good fights as they start to gain momentum . Thankfully every now and then the camera is allowed to breathe, and we see some cool stunts. Shocking to think this was the same dude who had my boy Denzel go Rambo in Home Depot a few years prior because that energy is missing bigtime. Music wise pretty bland I didn’t really take away anything from it. I can see now why paramount decided to dump this on the service as cinematic as it feels at times especially with the VFX it does feel like a Netflix wannabe. Overall still a good time if you shut your brain off and don’t think too much of its flaws.If they decide to continue this as series I’m down given the way they leave it off is very exciting reminds me of Snake Eyes coming out later this year."
    },
    {
      "rating": "10",
      "text": "I absolutely loved the movie, think they should have took more time to refine one or two scenes, however overall a great movie for me and my husband"
    },
    {
      "rating": "3",
      "text": "Infinite is fast-paced and filled with a lot of spectacular actions. However, the actions suffocate the message of the story.The dialogue is generally insipid, with very few thematic titbits that are placed too far apart.The premise is great, but the plot is too loose and shallow; so many unknotted strands.Chiwetel Ejiofor is perhaps the stand out performer in terms of characterization; others lacked depth, including Mark Wahlberg's character Evan, distastefully."
    },
    {
      "rating": "8",
      "text": "Interesting movie, great effects, ok plot. If you have the time I'd definitely recommend. It satisfies that action packed, effect heavy, Marvel-esk type craving."
    },
    {
      "rating": "2",
      "text": "starts with the first guy you meet when you r arrested, the bad guy, who has a selfish plan to destroy the world by killing everyone, which his squad doesn't mind. Then our cliché hero who doesn't believe he's one, goes on his way to save everyone in the most predictable storyline ever. Then a perfect cliché when everybody meets and live happily ever after.The only interesting thing about the movie is that you can't believe it's Mark in a crappy movie. He even flexes in most scenes, so pathetic."
    },
    {
      "rating": "3",
      "text": "A film it is. A good one it is not. You can pretty much tell what your in for with in the first 15 minutes. Over blown fast paced CGI action that get boring very quickly. The acting isn't very good and the plot has so many holes and doesn't answer anything like for instance; a film about reincarnation and the baddies plan is to wipe out the earth of all living things but the humans only get reincarnated as humans never animals. It also gives vague similarities of both the highlander and wanted film's , which are much better than this."
    },
    {
      "rating": "3",
      "text": "this movie is a bootleg wanted , the matrix, highlander, the old guard and assassin’s creed. this movie is all types of bad. I don't know if the production rushed but this feels like an entire season of a tv show that got cancelled after one season. why wasn't Dylan O'Brien the lead, Mark Wahlberg is horrible in this role."
    },
    {
      "rating": "4",
      "text": "Infinite has an interesting story idea that gets buried beneath CGI-heavy & subpar action sequences, barely fleshed out characters, and a general lack of worldbuilding."
    }
  ]
}