{
  "id": 515,
  "title": "Inglourious Basterds",
  "starring": [
    "Brad Pitt",
    "Mélanie Laurent"
  ],
  "runtime": 153,
  "genre": [
    "Drama",
    "Thriller",
    "War"
  ],
  "description": "In Nazi-occupied France during World War II, a group of Jewish-American soldiers known as \"The Basterds\" are chosen specifically to spread fear throughout the Third Reich by scalping and brutally killing Nazis. The Basterds, lead by Lt. Aldo Raine soon cross paths with a French-Jewish teenage girl who runs a movie theater in Paris which is targeted by the soldiers.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7sfbEnaARXDDhKm0CZ7D7uc2sbo.jpg",
  "categories": {
    "plot": 3.1333333333333333,
    "acting": 5.55,
    "ending": 7.083333333333333,
    "soundtrack": 5.5,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 9.285714285714286
  },
  "reviews": [
    {
      "rating": "0",
      "text": "WWII in Tarantino's fantasies. This movie is worse than the worst of the Tarantino movies - Django Unchained."
    },
    {
      "rating": "10",
      "text": "Fantastic Christoph Waltz ! Brilliant Tarantino! Standing Ovation for Christoph Waltz  A.K.A.\"Hans Landa\" in this movie. Best Actor for the \"Oscar\" in my opinion."
    },
    {
      "rating": "9",
      "text": "I enjoyed this movie very much. I've been a Q.T. fan for as long as he's making movies. Although, this isn't as good as his crowning achievement, Pulp Fiction, it comes in as a close second. My friend feels that it started slowly, and then it was awesome. I thought it was great from start to finish. The dialogue was excellent. Scenes were often funny, but extremely intense at the same time. Brad Pitt speaking Eye-Tallian almost made me spray soda out of my nose. Great acting, action, and dialogue with classic Tarantino sprinkled throughout the film. If you're a Q.T. fan, you should check out this movie."
    },
    {
      "rating": "10",
      "text": "This is such a great movie! Christoph Waltz is unbelievably good in the role of Landa. The audiences applaused in the end and I enjoyed every single minute of this masterpiece. By the way, I'm German."
    },
    {
      "rating": "10",
      "text": "Best since Pulp Fiction. Typical of Tarantino movies the opening scene is so engaging you can't turn away. You people are morons and need to get back to your reality shows if you can't appreciate something original."
    },
    {
      "rating": "10",
      "text": "Sadly, the metacritic score that \"generalizes\" the reviews and critical responses to this brilliant masterpiece does Inglourious Basterds absolutely no justice. Simply put, Inglourious Basterds is Tarantino's finest work since Pulp Fiction, and quite simply one of the best films of 2009, if not the best."
    },
    {
      "rating": "10",
      "text": "Very impressive. Great acting!!"
    },
    {
      "rating": "10",
      "text": "Best film of the year!!"
    },
    {
      "rating": "10",
      "text": "O fator replay dos filmes do Tarantino é tão bom que minha experiência acaba se tornar mais e mais rica.Os diálogos são incríveis, nos prendendo na tela o filme todo. A cena do bar, a minha favorita, tem tantos elementos que mesmo assistindo pela 5° vez me surpreendo com algumas secadas geniais, como o superior no ponto cego do bar.As cenas de ação são cômicas de uma forma que só o Tarantino pode fazer. Inclusive, o personagem do Hans Landa é como o Coringa no Dark Knight. O filme não seria o mesmo sem ele. Tanto a introdução quanto a cena no cinema provam quão bom ator ele é."
    },
    {
      "rating": "1",
      "text": "Only Tarantino can take an event like WW2 and make a boring directionless movie like Inglourious basterds. He decides to recreate WW2 events to show the world his love for (hard on for) mindless violence and long pointless dialougues. The fundamental problem with this film, is that if you are going to recreate an actual historical event,  the film has it has to be funny. Without Humor an audience familiar to WW2 history will find this to be boring inaccurate rubbish. The movie is formulated into several chapters covering lives of Shoshana who escapes near death at hands of Christopher Waltz and the nazis. I will not get to much into detail because i do not want to spoil the move. However the movie evolves into an unreleastic convulted plot to assasinate Adolf Hitler. The ending does provide a little suspense but this is around the 2 in a half hour mark. When the movies was over I was left wondering why did I waste 2 in half hours watching this abomination.  All in All we have a Quentin Tarantino's wet dream of what happened in WW2, packed with mindless violence, boring dialogues and worse convuluted plot imaginable. This movie is neither humourous or entertaining. Avoid at all cost."
    },
    {
      "rating": "1",
      "text": "The weirdest movie ever. The story is inaccurate and way to crazy to be enjoyable. Acting ridiculous doesn't mean it's good. Another Quentin movie that shows he can't move on and is stuck in the past. What a disappointment."
    },
    {
      "rating": "10",
      "text": "Inglorious Basterds isn't going to appeal to everyone. Then again, it doesn't try to. At 153 minutes, Tarantino is given free reign to exercise every cinematic whim that floats into his twisted brain. Patience is rewarded with blistering humor and outrageously over-the-top action. For his portrayal of the evil Colonel Hans Landa, Christoph Waltz deserves an Oscar nod. Pitt is absolutely hysterical and magnetic as ever. He delivers lieutenant Aldo Raine's lines in a voice that's a cross between George W. Bush and Billy Bob Thornton in Sling Blade."
    },
    {
      "rating": "3",
      "text": "Tarantino is the King with no clothing. Lauded by critics and film aficionados, but truth be told he is an abject failure as a storyteller. His films drag and sag and never have anything beneath them besides slapstick mayhem. The Basterds are no different 2 and 1/2 hours plus ending as Eliot would put it \"not a bang but a whimper.\""
    },
    {
      "rating": "2",
      "text": "Incoherent, self-indulgent mis-match of a movie. Insulting to Jews, Germans & anyone with knowledge of history or any sort of moral compass. I have no idea what this movie was trying to achieve, satisfy Tarantino's ego?"
    },
    {
      "rating": "3",
      "text": "Some great acting and great lines but for a film that is 2.5 hours or maybe a little more there is almost ZERO character development.  You have a Nazi Loyalist who completely flips in the period of 30 secs for no reason, and its never explained.. just one of many holes.  Many long boring moments with characters that could have been left out...very long and overall boring film...with a few great moments sprinkled in.."
    },
    {
      "rating": "1",
      "text": "There is nothing in this movie that makes for a good movie save for an interesting opening sequence. The premise is terrible and ignores the historical context of WWII. An all Jewish unit sent to infiltrate Germany. Nevermind that it's glossed over how they get into the country. Let's ignore the fact that none of the infiltration team speaks German or any other European language fluently. I'll even let it pass that the guerrilla team hangs out at the site of an ambush to torture their prisoners which is tactically absurd. What I cannot forgive is demeaning and dishonoring ourselves and our veterans by lowering ourselves to the level of Nazi's. For instance, in the ambush seen, Brad Pitt's character gives the Nazi a choice of betraying his comrades or being beaten to death. In this scene, the Nazi is the more honorable figure, selflessly going to a painful death rather than betraying fellow soldiers. Carving swastikas into the foreheads of the dead? Where is the morality or honor in that? If we have become so jaded that we cheer for the mutilation of human beings; for grizzly unjustified torture, I'm saddened for our future. It boggles the mind that we glorify this by nominating it for best picture. Not just because of vacuum of morality. It's bad writing. Taking 15 minutes to introduce multiple characters at length only to have them eliminated five minutes later is obnoxious. Especially, when no one replaces those characters. The dialogue is long winded, pedantic, and campy. The art direction seems more like it's trying to mock Saving Private Ryan than establish it's own style. I get the premise and the concept, no one likes Hitler. He was recent history's most prominent monster. But this movie cheapens the memory of those who apposed him. This should've been a straight to DVD release."
    },
    {
      "rating": "3",
      "text": "From this movie comes no conclusion, no morale. At the end, the only thing I felt was emptiness. The plot (if it can be called so) is simply terrible or non-existent despite the great visuals and spectacular acting (except Hitler's character, which was not realistic enough, too caricatural). It's just bundle of moments (often too long) patched up together and the two separate story lines have no interactions other than the final location of the story. It also holds no historic value whatsoever. The violence and gore are not justified for it does not add up any values of interest to the movie. All in all, the movie has nothing beneath it, nothing to tell, and just comes short of interest in its lengthy 2.5 h, a great disappointment. 0/10 for the plot 9.5/10 for the acting 8/10 for the visuals and 0/10 for all else."
    },
    {
      "rating": "0",
      "text": "Enduring this film is about as close to the human suffering of the concentration camps as I can possibly experience. If you somehow found this enjoyable I hope that God will have mercy on your soul..."
    },
    {
      "rating": "1",
      "text": "I really disliked this movie. If this movie had not had Quentin Tarantino's name attached to it I'm fairly sure most reviews would have said this was garbage. It's just a movie people watch to say \"It's good because it's bad, and since I'm smart I can see what the movie was -really- trying to say\". Unfortunately this movie was completely directionless, devoid of purpose, and did not say anything any other WWII hasn't said better. The violence also felt way too forced, which just made the experience pointlessly uncomfortable."
    },
    {
      "rating": "3",
      "text": "Only Christoph Watlz's excellent performance, good cinematography and a great soundtrack keep this from being a 0. It is one of the most repulsive, offensive movies I've ever seen, and the people that gave it a 10 obviously delight in seeing a theatre full of people being burned alive, mowed down by machine gun fire, and ultimately blown to bits by, get this, Jewish suicide bombers. That the victims are Nazis is beside the point."
    },
    {
      "rating": "4",
      "text": "This was a film that didn't know what it wanted to be. The trailers bill it as a black comedy which led to audiences laughing at scenes that were supposed to be serious, which in turn ruined the feel of those scenes. The Michael Myers scene was completely unnecessary and ruined the film's feel and pacing. I have given Tarantino the benefit of the doubt for too long and this film has convinced me that I am no longer going to give him any more of my money or time. Deathproof was not a psychological thriller or a suspense film and neither was Basterds. This film is another case of critics looking at a mudball spit out by Tarantino and treating it as gold. We get it, Tarantino has seen a lot of movies, and he loves referencing them ad nauseum in his films. I can also no longer stand his characters, yes they are not the traditional movie archetypes but they are so completely and utterly one-dimensional. Not every Nazi officer during WWII was a Sherlock Holmesian sleuth waiting to catch American spies off-guard. Also Aldo and Landa both begin the film as intelligent and crafty soldiers yet by the end they are both bumbling idiots. This is a film filled with unnecessary scenes, inconsistent story-telling, and an ungodly number of old film references. This simply was not a strong movie."
    },
    {
      "rating": "5",
      "text": "whoopee, politically corrected Dirty Dozen redux via Pulp Fiction, with BP as Lee Marvin. myself, I preferred Lee Marvin."
    },
    {
      "rating": "8",
      "text": "Suspenseful storyline, laugh-outloud funny dialogue, and visually interesting scenes; this movie is vintage Tarentino. Great movie, loved it."
    },
    {
      "rating": "3",
      "text": "Tarantino's world-war 2 effort is a very mixed bag: although it is a cinematographic tour-de-force and wonderfully polished in its technical execution, the nihilistic story feels like a waste of some great performances by the star-studded cast, Christopher Waltz and Diane Kruger being particularly excellent as Hans Landa and Bridget von Hammersmark. Although the violence may shock and the slick scenes may briefly hold the attention, ultimately this is as soulless and empty as Deathproof, and less likable in many ways. Pulp Fiction it is not."
    },
    {
      "rating": "9",
      "text": "One of the biggest surprises of the year, 'Inglourious Basterds' is definitely a great film, and one of Tarantino's best.With one of the best best acting ensembles of recent memory and a (traditionally Tarantino) excellent and interesting story line, it provides for two very important elements of any good film.Technically, the film is flawless and everything just works. It is also highly entertaining and very funny. My favourite thing were the Italian accents of Brad Pitt and his boys. Amazing. Excellent film!"
    },
    {
      "rating": "8",
      "text": "Inglourious Basterds is an exciting film and that is not a surprise because is a Tarantino creation, so we can notice all the things that are repeated in his filmography. First we have the desire for revenge, represented by Shosanna; here we notice the famous persistent and meticulous job of Beatrix Kiddo, and the sarcastic and dedicated work of Jules Winnfield with Vincent Vega; the shocking thing is that it all occurs at one time in one place, rather than the search that we saw on Kill Bill and Pulp Fiction.\rSecond, is visible the minimalism characteristic of Tarantino, because he shows too much with little things and express a few with big things. For example: in the dialogue between Coronel Landa and Mr. LaPadite about the rats, what we actually see is a way of changing a whole ideology about what people think of Nazis and Jews; in contrast, when all the important Nazis are gadder in the cinema, and Shosanna with Marcel execute their plan, we see an enormous disaster, but is nothing more than vengeance.\rFinally, the classic fragmented reality is very well developed. Tarantino put us on his labyrinth and force us to solve his puzzle. The only failure of this film is that all the fragments (chapters) are order by time, nothing is timeless, and the development is one direction; in the other Tarantino pictures we move forward, then travel to the past and then finish in the present, preparing to jump to another time again; and that could enrich a lot Inglourious Basterds.\rThe direction, music and script are just perfect and Christoph Waltz is astonishing."
    },
    {
      "rating": "5",
      "text": "If not for the brilliant performance of Christoph Waltz this movie would have been a total write off."
    },
    {
      "rating": "1",
      "text": "Odd movie.The Germans, who are supposed to be the bad guys, are made to look like the good guys. It is almost impossible to feel sympathy for the basterds after they smash in the head of a POW in the most disgusting way possible. A POW, for Christ's sake. And one with honor as well, since he refuses to betray his comrades. Cinematography is great, acting is as well, with the exception of Brad Pitt. The weirdest thing is that they use a David Bowie song that has already been used in 'Cat People'. That is really the killer."
    },
    {
      "rating": "2",
      "text": "Well, let's all lean back, shall we.. Have a drink and smoke our pipes and talk, then talk some more.. And then, just when you think we've talked enough, let's continue the conversation in french, with a german translation.. Or vice versa. You choose. I don't care. When we've finished talking, someone else will take over. They too will smoke sigars, drink whiskey, maybe even milk. They'll eat cake and talk some more, some in french, then in german. This film had me leaving the theatre in pure boredom. I think I lasted about 90mins before I had worn out every imaginable sitting-position you can cram into a cinema seat. I did this for Tarantino; because I've thought he was a genius. Until now. Apparently this basterd of a movie lasts for 153mins, and something cool probably, eventually happens. But I don't care. QT has grown overconfident in his ability to produce lengthy dialogues. And here there are no \"charming m*f* pigs\" either.. You wait for them, of course: Those nuggets of clever conversation. But they never come.. At least not within the first 90mins. So, I didn't see the whole thing. I think if this weren't Tarantino, alot of people wouldn't. All the overrated reviews of this proves QT has reached a point where he gets a good rating by default.. I think he's developed a speech impediment. It's a damn shame."
    },
    {
      "rating": "10",
      "text": "Delirious fun from ringmaster Tarantino. Unlike any World War II film ever made. Beautiful cinematography to go along with wicked dialogue and some great performances by Waltz and Kruger. The ending has a goofy twist and adds to the continuous fun, though I will say the film is very violent, maybe his most since \"Kill Bill\"."
    },
    {
      "rating": "10",
      "text": "Bold and fearless throughout. Tarantino has created a film without boundaries--allowing us to immerse ourselves into his unconvential, freakish and often extraordinary adventure. Christoph Waltz gives the finest performance of the year in the best film of the year!"
    },
    {
      "rating": "5",
      "text": "Quentin Tarantino's \"Inglourious Basterds\" is a messy movie, a movie that needs precise trimming. The characters are unstable and undeveloped while the whole dialogue is extremely measured towards the Jews. I know Hitler killed a lot of them, but this is just too unfair to the Nazis. At least Tarantino had to show a little bit of respect to them, not just spitting at them and killing them with baseball bats. Chrisopher Waltz's  performance was powerful and charismatic, but unfortunately he acted in the wrong movie."
    },
    {
      "rating": "0",
      "text": "War movie? Violent? Hardly. The entire body count until the last couple minutes of the movie is in the single digits. This movie is utterly boring. I've never been tempted to walk out part way through a movie until now. I stayed, hoping it would improve, but it did not. It's as long as The Dark Knight or Transformers 2, but it doesn't have a fraction of the action."
    },
    {
      "rating": "9",
      "text": "I've never been a terribly big fan of Tarantino, until now maybe. Seamless acting and considering the language barrier, highly interesting dialogue fill the film throughout. As long as your attention span allows you to read for a few minutes straight your interest should last until the visually striking action scenes. If you find yourself perhaps put off by the subtitles or the occasionally zany Colonel Landa, please watch the climactic finish with a fresh mind. It should stun anyone who will allow it to. I ended up staring blankly with my mouth agape even as the credits began rolling. That might be because I thought the movie would be, in general, historically accurate going in, but afterwards I was extremely glad that it wasn't. I was equally disappointed that this wasn't how World War II actually ended, because Hitler's face being riddled with bullets is a much more fitting way to end such a life. Speaking of fitting ends, the final line reads, \"This just might be my masterpiece.\" Well Tarantino, I think you might just be right."
    },
    {
      "rating": "8",
      "text": "spellbound\rgreat narration\rintelligent photography\rtypical tarantino film\roverall performance good\ras for hans landa aka christoph waltz is just too good man  too good"
    },
    {
      "rating": "10",
      "text": "When all the story lines finally come together you realize this movie is a masterpiece. With all the cast giving breathtakingly solid performances especially Waltz and Laurent. You will be offered amazing action and wonderful cinematography to spare. I give the movie 98%."
    },
    {
      "rating": "9",
      "text": "This film is horribly inaccurate in terms of history, but screw it, it is fun as all get out. Like all Tarantino fare, we get our stylized violence, our pitch black comedy, and of course our closeup of an actress' foot (Diane Kruger here). Also, we get a great film. A close second place for me behind Pulp Fiction in terms of Tarantino, Inglourious Basterds features great cinematography and great acting, namely from Christoph Waltz, who absolutely killed it. Brad Pitt was also great and quite hilarious, to boot. From the onset of the film, Waltz' performance takes center stage as we watch him do what he does best: hunt Jews. We then see the same from his counterpart, Pitt, who is great at killing Nazis. These first two parts of the film really setup the film incredibly well for the final act, where spoilers. In addition to Waltz and Pitt, the whole cast did exceptionally well, in partucular Melanie Laurent and Diane Kruger. Michael Fassbender, Daniel Bruhl, and shockingly, Mike Myers, all have good turns as well. Throughout the film, there are many different genres being used terrifically. Of note, the comedic elements were great, in particular the scene in which Pitt attempts to speak Italian. These moments of comedy help to lighten the mood against the hyper violence that takes place (though never too dusturbing, typically the stuff depicted would bother me more, but Tarantino is so stylish, he gets away with it). However, the film also includes many thrilling/suspenseful scenes where your heart is in your throat as you await what happens, while coupling that with elements of war, drama, adventure, action genres, all of which used very artfully and really help to add to the general entertainment of the film.\r On the negative side, the final part is a tad over the top. It came off as extremely odd and slightly off putting. However, the impact on the viewer is certainly still great and any over the topness is not a major complaint, rather something small that bugged me a little bit. Overall, Inglourious Basterds is one of Tarantino's best films and ultimately worthy of the praise it has received since its release."
    },
    {
      "rating": "8",
      "text": "Brilliant film. Probably not a \"must-see\" but certainly worth your money. The combination of humor and more serious elements in the film is great, I loved it. Certain parts, particularly towards the end are a little crazy, but they won't take away from how good this film is"
    },
    {
      "rating": "9",
      "text": "A film carried by Christoph Waltz's brilliant performance.  He mixes menacing evil with a sense of style through Tarantino's fantastic script.  Tarantino continues to be one of the great directors of our time."
    },
    {
      "rating": "10",
      "text": "A bold war movie unlike no other. The film is as funny as it is thrilling. With Inglorious Basterds Tarantino has shown once again that he can make fun thrilling stylised films while adding intricusies and good writting. Not quite Pulp Fiction but it is still very good. What a relief after the Kill Bill series to see Inglorious Basterds."
    },
    {
      "rating": "10",
      "text": "Hold up why does this movie have a 69 this is without a doubt one of the greatest films i have ever seein from the first scene to the amazing bar scene to the theater scenes i mean wow if u didnt like this film just go watch xxx state of the union since this film was too much for you."
    },
    {
      "rating": "10",
      "text": "Besides Brad Pitt sounding like a constipated John Dwayne this movie is intense and spine tangling the actually kill Adolf Hitler its amazing!"
    },
    {
      "rating": "0",
      "text": "Unless you are a sadist who revels in blood, human butchery, and overly long preposterous stories with many tedious scenes in which case it would be a 10."
    },
    {
      "rating": "0",
      "text": "Never liked Tarantino. This movie made me hate him! The most stupid movie I've ever watched."
    },
    {
      "rating": "2",
      "text": "Overlong and boring, punctuated by periodic scenes of incredibly uncomfortable violence. It's like Tarantino's other movies, only without the charm and wit. Very disappointing."
    },
    {
      "rating": "0",
      "text": "You sit through the drudgery of prolonged and monoyomous dialogue only to be met by ridiculous shootouts. And it doesn't even have the decency to be short."
    },
    {
      "rating": "4",
      "text": "This is a terrible movie, but then I'm not a fan of Terantino's work, so if you are, maybe you'll like it. However, as an objective reviewer, it's all style over substance. In a movie, the resounding question is \"Is it entertaining?\" The answer to that question is no, it is definitely not entertaining. There are interesting parts, but for the most part, dull, uninteresting, not worth the watch."
    },
    {
      "rating": "0",
      "text": "Could be used as a clinical test for diagnosing brain atrophy."
    },
    {
      "rating": "1",
      "text": "QT still proving he's got the subtlety of a bull with a chainsaw and the ability to turn promising subject matter into dross. Even taking into account the offensive subject matter the film could have at least had a cartoon appeal; instead it just angers and alienates the viewer. The only film I've ever walked out of at a cinema."
    },
    {
      "rating": "10",
      "text": "Incredible movie. Best movie of the year so far."
    }
  ]
}