{
  "id": 4585,
  "title": "Ingrid Goes West",
  "starring": [
    "Aubrey Plaza",
    "Elizabeth Olsen"
  ],
  "runtime": 97,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "Ingrid becomes obsessed with a social network star named Taylor Sloane who seemingly has a perfect life. But when Ingrid decides to drop everything and move west to be Taylor's friend, her behaviour turns unsettling and dangerous.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3LEyW11onDltXHo0L1X23j9Nnvg.jpg",
  "categories": {
    "plot": 6.9,
    "acting": 6.961538461538462,
    "ending": 7.214285714285714,
    "soundtrack": 5.0,
    "cinematography": 7.333333333333333,
    "familyFriendly": 3.0,
    "funny": 7.3,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "A film about obsession and loneliness that deserves to be seen by many. Aubrey Plaza was born to play this role and she does it great. Plaza plays this role so well it's kind of scary. A-"
    },
    {
      "rating": "7",
      "text": "I admittedly relate quite a bit to the Ingrid of Ingrid Goes West, I’ve selfishly studied people’s news feeds, publicly cried out when I felt left out, and Facebook frequently made me feel left out, particularly throughout high school. So now the common emotion cranks up to eleven when watching the Instagram obsession of Ingrid. These usually mundane, harsh glowing screens within the larger movie screen prove to us how social media has turned us into layered liars, until an @ symbol in front of our specialized name replaces our flesh-and-bone identity.Ingrid’s story starts after getting out of rehab for stalking and pepper-spraying the bride of a wedding she didn’t get invited to. Now, she spends significant time revising the way she types laughing in a comment while scrolling through her feed, just like what I too have done before. This lonely main character stalks everybody she wants to mimic, and openly hates them for the public to see. Yet we still understand her predicament, since we are immediately told why. She cries uncontrollably when watching the happier lives through her news feed, mainly because she lost her mother to a heart attack at a young age, her urn resting in the living room.Then when she starts stalking another young woman in Los Angeles, the fun really begins. The stalking starts normal enough, but you soon grow amazed to see the dangerous and often funny risks she takes to steal and lie her way to friendship. Just when you thought she already reached her limit, she proves you dead wrong.Since everything passes through a filter nowadays, director and co-writer Matt Spicer matches the common Instagram user’s worldview: sunbeams, drinks served in mason jars, hammered copper cups, Joan Didion novels, and modern “art” sold of social media lingo pasted onto paintings. Even the fashion trends here match the creativity millennials contributed to society, setting a strong contrast between the filtered and unfiltered life. At home, she throws on miserable rags, sweats, and towels. When out in public, she attempts to look confident in her lightweight, costly dress. When she finds the ideal Instagram figure she wants to befriend, she copies her look, including dying her hair blonde in a look which clashes against her dark skintone. The usually gorgeous actress, Aubrey Plaza, (Parks and Recreation, Scott Pilgrim vs. the World) looks unflattering as Ingrid, dissimilar to the girl she idolizes, who flaunts the most Instagram-y hairstyle and wardrobe.My greatest praise goes to the casting director, stunt choreographers, pyrotechnicians, and visual effects team for creating an intense, valuable production where communication was clearly strong. Although, stylistically speaking, you could tell this was Spicer’s first attempt at a full-length feature. Early on, he sets up a montage of still images in the style of The Big Short, only never to be seen again. For the most part, the camera and lighting decisions look very plain, sometimes even underexposed, especially with the white walls plastered along the set pieces.If anything else bothered me, besides the characters’ inconsistent motives, it was the unrealistic “fake out” ending like in Birdman or (the Unexpected Virtue of Ignorance) that communicated a potentially harmful message.Looking beyond the flaws, the performances turn out better than they needed to be, Aubrey Plaza’s sorely delightful portrayal compels you as she drowns in a pool of her own mascara-drenched tears. Billy Magnussen (Bridge of Spies, Into the Woods) also gives a very disturbing performance as a drug-addicted brother. Plus, Ingrid’s Los Angeles landlord, a vapor-smoking screenwriter, played by O'Shea Jackson Jr. (Straight Outta Compton), sombers you with his backstory about why he loves Batman so much, then delights you when he and his lover engage in Catwoman-themed sex.So while the visuals may not capture the Los Angeles culture, the people in it certainly do. They trap you in the city by bringing the lighthearted sunny appearance into thriller territory packed with robberies and cocaine. So Ingrid Goes West does do one thing better than La La Land: Communicating the hard truth about the famous city of stars.Overall, Ingrid Goes West gave me one important takeaway: tell the truth on social media, for we each need that openness to let others know the real us. Once the real us comes out, then the real friends will soon open up to us."
    },
    {
      "rating": "9",
      "text": "Such a well-executed, well-directed film. Aubrey Plaza does a phenomenal job, as usual, but O'Shea Jackson is the glue that makes it work, tonally. Very much worth seeing."
    },
    {
      "rating": "8",
      "text": "'Ingrid Goes West' is a timely and well-executed take on the world of insta-fame.  Aubrey Plaza is perfect in the role of a mentally unhinged wanna-be \"it girl\" armed with a smartphone, and the rest of the supporting actors are just as believably cast.During the run-up to the ending, I found my thoughts wandering ahead, wondering how they were going to bring the story to a fitting conclusion.    The actual result was unexpected, original, and incredibly prescient.  Writer-Director Matt Spicer is clearly talented and his decision to make a debut feature film that focuses on two female leads is quite bold and highly respectable.   As a result, we'll be keeping an eye on him, hoping Hollywood success and longevity lies ahead."
    },
    {
      "rating": "8",
      "text": "This was a very disturbing and uncomfortable film to watch about an extreme stalker.  I was not fond of this character in which this story was about, and that is due to Aubrey Plaza's acting.  That might seem like a criticism, but in fact her acting is so damn good. Albeit I am squirming at times by the decisions she makes throughout the movie. Audrey does her job so well, I do not know I care about her character, Ingrid, until the end of the movie when tears suddenly well up in my eyes.  This movie was almost bordering on the horror genre and as a big fan, I loved that about it.  The final scene left me wanting more, and that is what each one of us wants when we drop the bills down for a movie.  I would nominate Audrey Plaza for an Oscar right now if I had a vote because this person she created will stay with me for a very long time, in a most creepy, shivering type of memory."
    },
    {
      "rating": "7",
      "text": "In a young culture that's obsessed with being \"liked\" on social media, Ingrid (Aubrey Plaza) is an awkward misfit who's overly fanatical about her image. She moves to LA to stalk her favorite Instagram influencer (Elizabeth Olsen), who's superficial, shallow and self-possessed. Comparisons to \"Single White Female\" are inevitable and Plaza effectively captures that creepy vibe. She also manages to make her character understandable, although not ever sympathetic. Olsen's portrayal also embodies the appropriate vacant, phony vibe. The only real sincere character is played by O'Shea Jackson, Jr. who's appealing in his first role since \"Straight Outta Compton.\" The film's desperate narrative pushes credibility in some of the relationships (esp. his), but it does tell a compelling story. After the controversy over \"13 Reasons Why,\" it's disconcerting that a similar subject reinforces desperate behavior, even though it effectively explores the phenomenon. BTW, there's a strange little short that precedes the feature."
    },
    {
      "rating": "4",
      "text": "Just as I won’t stop reading a book no matter how bad it may be I find it almost impossible to walk out of a movie theatre until the end credits start.  I watched “Ingrid Goes West” for 90 boring, never-ending, slow dragging minutes wanting to walk out though I was sort of taken with Aubrey Plaza’s performance in the title role but the last 7 minutes made me glad I stayed as not only did her performance reach an even higher level but the whole picture crystallized into what the screenplay writers Matt Spicer, who also directed, and David Branson Smith wanted.Up to that ninetieth minute, the film seemed to be aimed at the current generation and their total involvement with smartphones, Instagram, social media, mores, manners, and comments. We meet Ingrid, after time in a psychiatric hospital, whose mother just died leaving her $65,000. Ingrid is basically a cyber stalker and becomes intrigued with Taylor Sloane (played by Elizabeth Olsen) who is famous for having thousands of followers on her Instagram account and becomes even more famous shilling products.Ingrid takes her bag of money, leaves Pennsylvania and takes off for Los Angeles, rents a house from Dan (O’Shea Jackson, Jr.) a screenwriter who is obsessed with Batman and is writing a film, so he believes the next Batman film. After concocting a plan to meet Taylor she becomes her BFF and insinuates herself with Taylor’s husband, Ezra (Wyatt Russell) who claims to be an artist of some sort. Then enters what is to become Ingrid’s nemesis, Taylor’s brother Nicky (Billy Magnussen) an amoral coke addict and alcoholic who is very aware he is a muscle gym guy without any inhibitions.While we know Ingrid can be and has been violent in the past and we see her in all sorts of moods from feeling ecstatic to a deep sadness there is that sense of craziness about her that will come to the forefront, along with the violence.The screenplay and the characters are all over the place and there are constant shots of smart-phones with Snapshots and Instagram lines but the focus is on Ingrid and her acts in the last 7 minutes show who she really is and makes up for a lot of scenes that don’t make sense or are just fillers for the film.Aubrey Plaza makes the film what it is and though she has done TV and a few other movies this should be the one that makes her a star if the audience can sit through the first 90 minutes!"
    },
    {
      "rating": "8",
      "text": "A truly challenging watch from beginning to end, Ingrid Goes West is one of those films that is often disturbing, frightening, darkly comedic, and oh so cringey. No matter how smart and funny it is, the cringey actions of Ingrid Thorburn (Aubrey Plaza) keep the film as being one that is often best watched through the gaps between one's fingers. Spiraling out of control as she stalks and befriends social media influencer Taylor Sloane (Elizabeth Olsen), strikes up a romance with landlord Dan Pinto (O'Shea Jackson Jr.), and moves to Los Angeles, Ingrid is a woman with a few screws loose in her head. A tragic figure, she serves as the gateway for director Matt Spicer to critique modern culture, celebrity worship, and reveal the damage both have done to those who partake or follow these vapid and fake human beings that proliferate social media. Equal parts funny, dark, and sad, Ingrid Goes West is an excellent feature debut for Spicer.From the very get go, we are introduced to the world of Ingrid. Using Instagram extensively and being hurt by a \"friend\" that did not invite her to her wedding, Ingrid resorts to stalking the woman's instagram, crying over the wedding photos, and then showing up to pepper spray the beaming bride. Locked up in a mental hospital, healing, and soon released, Ingrid decides to get a new start in Los Angeles after reading a magazine ominously calls Taylor Sloane \"your next girl crush\". A classic social media influencer with sponsored posts, \"deep\" quotes with stupid photos, and living in a constant state of vacation, Taylor is the perfect target for Ingrid. Working her way in Taylor's life by stealing her dog and then returning it the next day, Ingrid befriends Taylor and her husband Ezra (Wyatt Russell) effortlessly and quickly catapults to minor stardom after she is included in an Instagram post by Taylor. Meanwhile, she uses her inheritance from her mother's death to rent an apartment from Dan and abuses his trust by both taking his car all day, missing a planed appointment with him that she agreed to in order to borrow his car, and by wrecking that very same car. What ensues is an often chilling portrait of modern society and the damaging effects social media has had.Chief amongst these critiques is Spicer's demonstration of how life is now lived through phones and social media. Part of it is certainly being obsessed with news and what is happening, but much of it is in the desperate search for affirmation. By liking posts on Instagram and commenting constantly, Ingrid hopes to create new friends and be as popular as the girls she sees on the site. In a life of solitude after her mother's death, this world of social media is her only opportunity for human interaction and she makes the very most of this chance. Yet, she is hardly the only one. Taylor lives her life in a similar fashion, yet is never called deranged for the same behavior. She lives behind a screen, posts constantly to remain popular, and forgets to actually live life in the process. Even worse, her world vision is so warped by social media that she convinces Ezra to quit his job to make paintings where he just takes somebody else's work, tosses a social media buzzword like \"#SQUADGOALS\" on it, and then sell it for over $1,000. This constant and desperate search for affirmation in the eyes of followers, shows the dangerous impact social media has had on our world. Emotion, feeling, experience, and life, have become disposable. In their place, false compliments and shallow popularity have taken their place with people valuing themselves solely based upon how many followers they have and how many likes they get. Prior to her discovering that Ingrid is a psycho, Taylor is great friends with her. However, once Harley (Pom Klementieff) - a social influencer with 1 million followers - arrives in town, Taylor forgets all about Ingrid. Even her husband feels slighted by her new lifestyle, as she was once a normal girl with no friends in Los Angeles, but would now do anything for followers. By sacrificing herself and her own personality in the name of becoming famous on Instagram, Taylor has lost herself in this world and, for many, the same exact thing occurs. Social media has become people's reality with a phone not just being a device to call or text occasionally, but rather a life support machine that serves as a person's only connection to the outside world. In Ingrid Goes West, we see Taylor and Ingrid do drugs, blow their money, and practically sell their soul, to gain any semblance of popularity. For them, nothing is too steep a price for a like on Instagram."
    },
    {
      "rating": "7",
      "text": "A kind of \"Talented Mr. Ripley\" meets \"The King Of Comedy\" for the millennial circuit, \"Ingrid Goes West\" does well in blending the topical social commentary with the darkly comic stylings of its perfectly talented cast. The result is an insightful, if appropriately unsettling study of the limits certain individuals will traverse in order to make themselves appear the way they want to be perceived, sociopathy or not. High marks go to Aubrey Plaza for what is far and away the most brilliant performance she's ever given, but make no mistake, the supporting cast - especially Elizabeth Olsen, O'Shea Jackson Jr., and Wyatt Russell - also works hard to keep this piece afloat."
    },
    {
      "rating": "9",
      "text": "Hilariously and cringingly of the moment, anchored by a great performance from Aubrey Plaza leading a perfectly cast ensemble. It's like a prequel to Black Mirror's season three \"Nosedive\" episode, at once laugh out loud and horrifying. Might just make you put your phone down."
    },
    {
      "rating": "9",
      "text": "What an enjoyable film this is! Very funny with a screenplay that was inventive but still made sense (it deserved to win at Sundance), and full of wonderfully sly comic acting by the entire cast, especially Aubrey Plaza and Elizabeth Olsen."
    },
    {
      "rating": "6",
      "text": "Aubrey Plaza gives one of the better performances of her career as of late, but unfortunately, that wasn't quite enough to make up for the rest of this uneven oddity of a film that I felt attempted to deliver a few too many mixed messages on society, social media, etc. If anything, it had me leaving the theater with an uneasy feeling about society and the sort of impact that social media can have on it, especially on some of the more unstable ones, as examined in the film with Plaza's titular character. Overall, if you're a fan of Plaza, she's the main reason to see this. Otherwise, not really worth it in my opinion."
    },
    {
      "rating": "9",
      "text": "Will grow as a semi-classic. True horror movie in that it is based in all possible events. Not fun to watch, but it is effective. And effectively cautionary - kind of like Super-size me for a big part of society."
    },
    {
      "rating": "9",
      "text": "A scathingly devastating dressing down of social media culture and our vapid obsession with today's undeservedly overrated adult iteration of \"the popular kids.\" Aubrey Plaza delivers a solid, award-worthy performance in the title character's role, backed by a strong cast of supporting players who execute their roles with precision and incisive accuracy. Those who easily see through the thin veneer of what's supposedly laudable these days will handily detect the unfortunate shallowness of many of our collective ways wickedly brought to life in this impressive debut feature from director Matt Spicer. Let's hope the message sinks in, especially amongst those most in need of getting it."
    },
    {
      "rating": "7",
      "text": "Fun and different. Aubrey Plaza gives a great performance and she really sells that weird stalker she was going for. The movie also has some laughs and some genuine heart felt moments. This movie is all about some Instagram and maybe it relies a little too much on it."
    },
    {
      "rating": "6",
      "text": "This premise is so ripe for social satire, mocking deconstruction of a self-obsessed generation, and good old-fashioned thrills and chills, yet it settles for light fun and self-congratulatory good humor. It never digs deep enough to draw blood nor aims for the belly enough to knock the wind out of you - it's just alright."
    },
    {
      "rating": "6",
      "text": "Ingrid of Instagram!The film was decent, but was not my kind. I mean I've given up using the useless social media a long time ago and I'm happy the film highlighted the evil side of such platform. I liked the casting. The combinations were good. Particularly, I think Oshea Jackson should do more films. He could be the next big name.It was about the social network, revolved around Instagram platform. It's all about getting popular in the virtual world. And people are ready to do anything for that. One such incident based film is this. A young woman who lost all her friends and ended up in an asylum for a breakdown is now preparing to start afresh. So heads west, Los Angeles, and makes a friend with one of the popular Instagram stars. But the path she chooses was not conventional. She knows the consequences, yet she goes on with it, but when it all comes to that point, what happens to her was revealed at the end.As I said, it is not for everyone. It is for the young generation, particularly any generation who uses or addicted to social media. The story was not fresh enough. We've seen similar tale with a different perspective and platform. Then the result of the tale is all same. The message was good, but I don't think that was the intention of making it. Overall, good for once watching.6/10"
    },
    {
      "rating": "8",
      "text": "Aubrey Plaza at her best, shes scary good in this.  Its a challenge to watch this film from beginning to end and thats not entirely a knock on the film as it is to see Ingid continuously do this stuff to herself out of loneliness and the need to just be accepted. It's a rare film with a knack for providing social commentary on how our generation is obsessed with social media and using it to as a means to seek acceptance. The message at the end of the film really resonated well with me as it really brought the film to a shocking close and really summed up the movie well. Ingrid Goes West is truly underrated in terms of 2017 releases, it provides great direction, scene setup and overall quality film making. It's also a very underrated performance from Aubrey Plaza, who along with O'shea Jackson and Elizabeth Olsen really make the glue that hold the film together"
    },
    {
      "rating": "3",
      "text": "I like Aubrey Plaza and her work, but this to me seemed just too dumb of a movie. I mean I get that it looks at how people can be lonely and want attention through social media etc, but overall the movie was just a bit too boring for me."
    },
    {
      "rating": "7",
      "text": "this film is really relatable to every young generation today and this could hit them like a truck. and if they say it's not they must be a hypocrite. it makes me like this film because how subtle Spicer could be a writer-director can tell this story and the details. well i guess i dont have to compliment how great Plaza is because this kind of Character is how good she is to be an Actress."
    },
    {
      "rating": "7",
      "text": "For a couple of years I've been hearing that Aubrey Plaza is an incredible comedy actress, not to me, but I've gotta say, she delivered the goods in this one.First time for everything I guess."
    },
    {
      "rating": "7",
      "text": "Entertaining, chilling and timely, Ingrid Goes West gets at how people go insane in the age of social media. The message is clear and the film delivers well. Helmed by Audrey Plaza and Elizabeth Olsen, it's a movie that tends to play the mood more often than it should, but is still worth your time."
    },
    {
      "rating": "8",
      "text": "I liked Ingrid Goes West way, way more than I expected to, and I think I can attribute that primarily to the generation I'm apart of. I can see people that aren't in the Millennial or Z generations really not liking it, though, because social media is a HUGE part of the plot. if you are in high school or college right now, Instagram is a big deal. It's almost impossible to avoid it, and as a result it's inevitable that you will meet some people that are addicted to it. That's what the main character of this film is, she's addicted to Instagram. She's got plenty of other issues as well, but her obsession with IG plays a big part in this story. Essentially, this is the story of a girl who wants to be friends with another girl she finds on Instagram (and get famous herself after befriending said girl), but she's a psycho...so really she just ends up being a stalker. And that's what this film is at it's core: it's a movie about a stalker. I knew what the ending was going to be the entire time, and while they did put a little twist on it at the end which I found perfect for the type of film that this is, I feel like that's the only real flaw that this film has. It's predictable. I knew what was going to happen in a general sense, but I still enjoyed watching how it all unfolded. The script isn't particularly remarkable in any way but there are some moments where it shines. I will say that I really enjoyed the cinematography of this film. It definitely has the kind of look that I would expect for a film like this. I really didn't expect to like this one as much as I did. I thought it was going to be a story about two girls trying to get Instagram famous after moving to California, actually. But I was in for quite the surprise. I recommend giving it a shot."
    },
    {
      "rating": "6",
      "text": "A well-acted, enjoyable enough illumination of the emptiness behind performative social media posts, but ultimately fails to land a point about meaningful relationships, or offer a solution to the loneliness social media can exacerbate."
    },
    {
      "rating": "8",
      "text": "Haha, oofda, holy sh*t was that uncomfortable to watch! BRAVO!Aubrey: Outta the park. (That was legitimately an Oscar-worthy performance)O'Shea: Surprise MVP.Elizabeth, Wyatt, Billy: Nailed your characters to a T.Super well written, or well crafted, or whatever, for the subject matter.Damn!"
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)A mentally unstable young woman, stalker of social media influencers, moves from Pennsylvania to Los Angeles to emulate an Instagram star: by now a pandemic form of the borderline personality disorder, it is presented in a bad way, with a very black satirical humor that is misplaced to render the drama of the psychiatric problem. How many, after viewing the film, will have catapulted to talk about it on a social network? Then better \"Chiara Ferragni - Unposted\": in the brutal rawness reality still trumps fiction."
    },
    {
      "rating": "7",
      "text": "This is a relatively thought-provoking watch focussing on a very contemporary theme - the younger generation's obsession with social media and how shallow it is. Its also about manipulation. I thought it was a bit like an episode of Black Mirror. The plot is perhaps a little predictable but I thought it was a pretty good watch regardless - one I may have recommended to parents wanting to warn kids of the dangers of becoming obsessed with social media 'influencers', I suppose, if it weren't for the final scene, which I didn't feel was entirely credible. It had an unnecessary cheesiness to it. I thought it was quite realistic for the most part, until that final bit but I wouldn't say it's not worth a watch at all based on the very last scene, which lasts barely a minute. I'd still say its worth a watch overall."
    },
    {
      "rating": "9",
      "text": "Very good movie on so many levels. Without the humor of which is in perfect balance, it would have been dark, very dark. Aubrey Plaza is perfect for this role and the rest of the cast does a great job as well. Highly recommended."
    },
    {
      "rating": "6",
      "text": "An inspirational film about loneliness, finding a goal in life, believing in yourself. And the dangers of technology and gadgets, of course. Aubrey Plaza got used to the role. And two beauties from Marvel in the wings. Interestingly, if the main character used Utopia p2n, could the story end differently?"
    },
    {
      "rating": "6",
      "text": "Don't get me wrong, I love Elizabeth Olsen and Aubrey Plaza as much the next person (maybe even more) but this movie just.. was hard to digest from the diagnosis that was never talked about and too many loose ends that were never tied up."
    },
    {
      "rating": "8",
      "text": "Aubrey Plaza gives a standout performance in this smart, funny, and even at times chilling dark comedy."
    }
  ]
}