{"id": 2149, "title": "Inherent Vice", "starring": ["Joaquin Phoenix", "Josh Brolin"], "runtime": 149, "genre": ["Drama", "Mystery", "Comedy"], "description": "In Los Angeles at the turn of the 1970s, drug-fueled detective Larry \"Doc\" Sportello investigates the disappearance of an ex-girlfriend.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/hyan5Uc0lGpPuad94DM1pLxneiP.jpg", "categories": {"plot": 4.75, "acting": 5.111111111111111, "ending": 3.75, "soundtrack": 0.0, "cinematography": 4.333333333333333, "familyFriendly": 3.0, "funny": 7.0, "action": 5.2}, "reviews": [{"rating": "10", "text": "The Rockford files on acid. The way the artists could shift gears from drama to slapstick, then back, impressive.\r There Is so much subtle homage to Chaplin, whether Phoenix intended it or not I cannot help but wonder. It is great work by the actors. As someone who grew up in SoCal, it was eerie that PT Anderson could make me feel the humidity and temperature in one scene.\r This movie, quite simply, is a masterpiece"}, {"rating": "9", "text": "Though I knew P. T. Anderson is an amazing director, I wasn't sure how successful he would be adapting Thomas Pynchon to the big screen. Mr. Anderson did not disappoint. He does a great job of capturing the stoned vibe, weirdness, and zaniness of the novel. There is a lot in the book that didn't make it into the movie, but it would have been next to impossible to jam all of the book's plot in there. I'm grateful that Mr. Anderson decided to adapt this novel because Mr. Pynchon's weirdness is definitely compatible with the director's style. The cinematography is wonderful. The pacing is just right for the source material: I felt hypnotized by the dialogue - I actually felt stoned after the movie was over. Joaquin Phoenix's portrayal of Doc Sportello is a comedic tour de force. Josh Brolin does an outstanding job and Katherine Waterston does a fine job as the femme fatale. The movie was hilarious and I thoroughly enjoyed it. Seeing as how I'm a  huge Thomas Pynchon fan, it was thrilling to see this masterful director and these virtuoso actors transform the offbeat novel into a thrilling, enjoyable film."}, {"rating": "9", "text": "If you'd have asked me to rate this the first time I saw it, it would've been around a 3 or a 4. It was very hard to keep up with the convoluted plot. I personally don't know who could've ever kept up with it! But then I gave it another viewing, just going with it (as many sites and reviewers have suggested), and I loved it! The atmosphere is wonderful and it feels like it came straight out of the 70s. I noticed a lot I never noticed before and some of the movie is just plain silly (in a good way; silly dialogue). I definitely recommend this movie, just enjoy it for the aesthetics and laughs rather than trying to remember everything that goes on and every named mentioned (or you won't enjoy it). Then again I haven't read the book either, but I'm intrigued to do so now. Also, I wouldn't compare this in any way to The Big Lebowski.. It's nothing like it. There's really nothing like this movie. It's definitely neat and original."}, {"rating": "10", "text": "Genuinely funny, trippy neo-noir sees stoner PI Phoenix trying to unravel a case while being out of it all of the time. Beautifully shot, first rate direction and strong performances across the board make this the best film making the rounds. Phoenix and Brolin are excellent."}, {"rating": "7", "text": "Even it's a touch long, the pace and cadence of the action - especially the dialogue - is never boring and mostly very funny.  It's probably my favorite Joaquin Phoenix movie - and my favorite Josh Brolin film. Unfortunately (and it's really not a knock on this film), it's not close to my favorite PT Anderson film.  Punch Drunk Love, There Will Be Blood, Boogie Nights - those were massive achievements. This is more light, breezy entertainment."}, {"rating": "10", "text": "A great experience. Many chuckles; one intriguing character after another. Much unresolved, but that is so true to Pynchon. Best movie I've seen in years."}, {"rating": "8", "text": "I love films like this for the most part and Inherent Vice is no exception to that. Perpetually in a drug induced haze, Detective Larry \"Doc\" Sportello, portrayed brilliantly by Joaquin Phoenix, stumbles around trying to solve a case he cannot quite wrap his head around. Hell, there may not even be a case. But, what is certain is that he has no idea what is going on and neither does the audience. Impossible to follow and impossible to wrap your head around, Inherent Vice is a film that gives you a bunch of different puzzle pieces from different puzzles and tells you to put them together. Yet, in spite of that, I loved it. Our confusion mirrors that of Doc and really makes the film and enjoyable watch. It also does not hurt that it has a stellar cast on top of Joaquin Phoenix, including Benecio del Toro, Josh Brolin, Reese Witherspoon, Katherine Waterston, Joanna Newsom, Michael K. Williams, and Martin Short. No one other than Phoenix has that much screen time, but what they are given, they knock out of the park. The direction and writing from Paul Thomas Anderson are stellar as always. The film also does a great job capturing the drug-induced era it is set in and is a beautiful snapshot of the less than nice areas of Los Angeles in the 1970's. If you are comfortable not knowing what the hell is going on, but are willing to still sit there and try to piece together this possibly unsolvable \"case\", Inherent Vice is the film for you. Though it may not make much sense, Inherent Vice is just a really enjoyable and really, really well made film that even if the \"plot\" does not do it for you, there should be enough here for you to appreciate."}, {"rating": "1", "text": "Ten minutes in, I think this is a brilliant movie.  An hour later, I am frustrated by the choices the Director has made; an hour later I wonder why this story was told at all; it seems designed to annoy and frustrate the viewer...as much as I tried to appreciate \"The Master\", I now feel that the Director is way too focused on style over substance, and the storytelling of \"Boogie Nights\" is nowhere to be seen.  All the more frustrating because I wanted to love this film."}, {"rating": "5", "text": "If The Big Lebowski had been a two-part episode of The Rockford Files, it would have been Inherent Vice. Except, it would have been a lot better than Inherent Vice."}, {"rating": "2", "text": "It's a sort of absurdist/stoner \"comedy\" which isn't that funny\r I've enjoyed all of PTA's prior films to varying degrees though this didn't resonate with me, my wife, or the majority of the audience in Manhattan as far as I could tell given the expressions I gathered from fellow theatergoers\r All in all, I'd avoid unless you read the book for it and know what you are in for and appreciate this sort of oddball story and aren't expecting anything with any sort of tangible/semi-linear narrative"}, {"rating": "8", "text": "Really like an 82-83. Not the best film of the year to be sure, and a great deal of people won't like it. I enjoyed it immensely, Joaquin Phoenix and Josh Brolin are fantastic, and I am always intrigued by PT Anderson's choices as a director, even if I don't agree with them. While I wouldn't count this as PT's best, I enjoyed it just as much as I did \"The Master,\" which was one of my favorite films that year. At year's end, the best films I've seen have been The Grand Budapest Hotel, Boyhood, the sadly under-rated Blue Ruin, Nightcrawler, Inherent Vice, and Whiplash. I am still very excited to see J.C. Chandor's \"A Most Violent Year\" as well. You might not enjoy Inherent Vice much (maybe not at all), but if you have enjoyed PT Anderson's films in the past, it will at least be an interesting experience. Not for everyone, but it's easily one of the most interesting films this year, and certainly one of the better."}, {"rating": "2", "text": "This is the perfect movie for insomniacs. Or people who actually LIKE Thomas Pynchon novels. Only two things will disturb your rest. Josh Brolin, in his relatively limited screen time, manages to inject actual energy into his role. It's worth staying awake to see him. And, of course, Katherine Waterston bares all, and that will surely wake you up. Personally, I was glad when I needed to leave the theater for a while and use the facilities. The folks selling popcorn and soda pop were more engaged than anyone on screen ('ceptin' Brolin, of course)."}, {"rating": "7", "text": "If Hunter S. Thompson and David Lynch got together and wrote/directed a comedy, Inherent Vice would be the likely result.  The movie is bizzaro.  Joaquin Phoenix plays hippie dope-head private investigator Doc Sportello, who is trying to solve the disappearance his ex-girlfriend (Katherine Waterston) and her new lover (Eric Roberts), a wealthy real estate developer.  The dialogue, at times, is difficult to hear/understand.   The plot is even more difficult to follow.  All you can do is inhale the psychedelic haze the permeates the movie, let go of reality and let things unfold.  Unfortunately, there isn’t quite enough substance to the story line to sustain the movie’s almost 2½ hour run time.  Joaquin Phoenix, as, always, gives a terrific performance.  The cast is deep (including Josh Brolin, Reese Witherspoon, Owen Wilson, Beneicio Del Toro, Maya Rudolph and Jena Malone).  Brolin is perfectly cast for his role, which is a send-up of the quintessential 1960’s LA police detective.  Martin Short is particularly funny in a brief stint as the immoral and drug abusing dentist Rudy Blatnoyd.  I found aspects of the movie fascinating, but overall, it came up short.  I recommend this movie only if you are looking for something irreverent and off-beat."}, {"rating": "9", "text": "Not for everyone, to be sure, but I loved it.\rQuirky funny moments with deeper melancholy.  Great cast in small but unforgettable roles for many, but three really solid strong, subtle leads (Doc, Shasta, and Bigfoot).  Jonny Greenwood gets special recognition for his interesting sound track.  PTA does a really outstanding job of capturing the feel of the book (most likely the only Pynchon novel even close to being filmable)."}, {"rating": "2", "text": "I do believe everyone is entitled to their opinion, but how a single person was entertained by this film is beyond me.  PTA has some great work under his belt (There Will Be Blood, Punch Drunk Love, and Magnolia personal favs) and this is easily his worst and least entertaining piece to date.  Joaquin mumbles his lines, random characters babble nonsense, a scene ends with an obscene gesture, rinse and repeat.  There's no denying there are some great \"meandering\" films out there, nice camerawork and good actors will only take you so far with a screenplay like this.  This was a shrill experience and one of the worst art-house films I've seen in a while."}, {"rating": "2", "text": "Does the world need another cinematic stylist whose visual talent is exceeded by his capacity to bore audiences.  How about some storytelling basics?  I mistakenly bought into reviewers' claim that this was somehow a companion piece to Altman's \"Long Goodbye\" and, once again, found myself staring at my watch.  After this empty exercise and \"The Master,\" I am off PT Anderson for good."}, {"rating": "10", "text": "Inherent Vice is the most enjoyable, funny and gripping movies of the year. It symbolizes and homages Tarantino, Drugs and Comedy in a way nobody has ever seen before. Joaquin Pheonix gives us a splendid performance as Doc Sportello and Josh Brolin gives a good performance as well. The chemistry between the two is funny to watch and very well written as well. The cast of A listers also does a great job. The sheer enjoyment of watching a funny, relaxing 60's drug fulled drama is just... Perfect. Inherent Vice is a movie, you need to catch on the big screen with a soda and popcorn in your hands. Paul Thomas Anderson really knows what Cinema means."}, {"rating": "10", "text": "Joaquin Phoenix and Josh Brolin are good fun to watch. Almost sufficiently Pynchon-esque, references to Philip Lorca Decorcia, Tarantino and south-bay jackie Brown. Some Kubrick-like absurdity. I think the drug confusion could have been expressed better, wish Owen Wilson and his baggage had not been dropped in. I wonder if PT can make a film relying on caricatures a little less, Magnolia comes close. Perhaps 15 minutes could have cut out with no damage. All these comments are trifles; there is just so much more here than you get these days. The film is not for everyone. Not for a lot of people, actually. I had a great time."}, {"rating": "9", "text": "A thoroughly entertaining joy ride through the drug infused world of the stoner gumshoe protagonist, Doc Sportello.  It's like a zany complex doped up Raymond Chandler just let it all loose in early 1970's California.  I laughed throughout the film and felt the amazing contact high the film offers.  Can you follow the twists and turns of the plot?  Not without a lot more drugs you can't!  And who even really cares about the narrative anyway.  Expect to walk out of the film with a smile on your face and severe case of the munchies.  WARNING:  Don't watch this film if you have a stick up your but.  It will only make things worse for you."}, {"rating": "1", "text": "From the director of the horrible film \"The Master\" comes another incoherent bore with a running time that's a joke. Inherent Vice is verging on painful to sit through because it really isn't very interesting. I hated this film."}, {"rating": "10", "text": "Phoenix with one of the all-time great comedic performances. It boggles my mind that more people can't enjoy fantastically bizarre films like this. It's f---ing hilarious!!! Comedy of the year, hands down."}, {"rating": "0", "text": "Another 'has been' director that should quit making movies.  Whoever gave him the money for this should be arrested and their assets frozen for all time.   Judging by the number of people with me in the theater who got up and left this will probably and hopefully be the last anderson film ever.   I love this guy, 'hard eight', 'boogie nights' and 'magnolia' were great films.  'magnolia' is hard to watch but it's at the top of my favorites.   Everything about the movie is genius.  But this movie looks like a bunch of bored, rich actors run amuck.   The movie is insulting and I'm not sure if that wasn't really the point.  To make a great movie you have to get about a 100 things right all at once.   This movie is 0 for 100.  It's not just that it's not funny or entertaining.  It's nothing.   Or, maybe I just wasn't stoned enough ....not sure if there is enough weed in cali to make up for it though."}, {"rating": "5", "text": "INHERENT VICE is utter nonsense and unfortunately made me realize that except for MAGNOLIA, I don't really care for the films of Paul Thomas Anderson. There is no denying the talent of this masterful director but it's all so sophomoric--look Mom what I can do! INHERENT VICE is pointless with little depth beyond masterful direction, wonderful cinematography, and great production design. The film looks like the 70s but what's really the point? This is basically THE BIG SLEEP set in the 70s. Which means INHERENT VICE is essentially a remake of Robert Altman's THE LONG GOODBYE without the humor or disdain. An ambitious empty exercise."}, {"rating": "5", "text": "A largely disappointing stoner noir crime comedy that promises more laughs in its trailer than it actually delivers in the finished product. When the movie is on, it's hilarious, but those bits are so few and far between that it hardly seems worth it, especially since the narrative padding linking those moments is so uninteresting and convoluted that no one really cares. The film ultimately comes across like an attempted fusion of \"The Big Lebowski\" and \"American Hustle\" but doesn't come close to matching the quality of either of its predecessors."}, {"rating": "1", "text": "No amount of weed could make this movie enjoyable. It's makes me wonder if PTA has ever smoked weed, and made this movie about what he think its like to be a stoner. Plain and simple, it sucks! No PANICAKU!"}, {"rating": "0", "text": "This film is so wrong for so many reason. No plot. No characters. No sense. Its like a horrible hangover. I felt stoned.....in a bad way. I have such high hopes for this, but man. what disappointment I love P.T. Anderson but he really let me down."}, {"rating": "10", "text": "Everything you would love from PTA! The acting is amazing, and the way the film is directed is fantastic! Probably the best movie of the year! This turned out to be one of my favorite movies not just of today, but of all time!"}, {"rating": "10", "text": "I went to see this film reluctantly due to the fact that the trailers made it look like a ridiculous pot smoking-infused version of American Hustle, which I loved, and didn't want to see \"ripped off\"!\rWhat did pull me in was the fact that I would get to watch Joaqin Phoenix for a full two and a half hours, which for me would have been well worth the price of admission regardless of the quality of the film.\r What I saw was unbelievably hilarious while still subtly and powerfully wrapping the entire endeavor in a poignant melancholy for all that is wrong with the society we inhabit together today. That is a huge undertaking for a film and it could have gone in a depressing or simply ranting direction. Instead, this filmmaker elicits both outrage and empathy in the viewer for the conditions surrounding us humans as we flail our way through the inevitable injustices and heroics of life in the 21st century.\rJoaquin Phoenix and Josh Brolin create a chemistry which sums up so much of the opposing forces that surround us, socially, politically and spiritually.\r I highly recommend this film but suggest you allow yourself to go along for the ride, and let the multifaceted emotions, and wonderful humor wash over you as you plough through, an, at times, indiscernible plot. The full experience of the closing will make it worth your patience and tolerance for ambiguity."}, {"rating": "4", "text": "It's sort of a murder mystery. But there's no suspense. Oh and it's also sort of a buddy cop movie. But we don't actually care about anybody. Oh and it's also like, sort of a tragic romance. But there's no love in it.\r So...\r I guess that makes it clever? I don't know. I didn't read the book so maybe I'm missing the point. Or maybe my brain is not smart enough for the film. I don't know. In the end I wasn't entertained, so to me, the movie is a failure.\r However...\r If you desperately want to be confused, watch people get stoned and slam telephones, and laugh occasionally at Josh Brolin, you may enjoy this. If you're expecting PTA to tell a satisfying story about people you care about, just go watch Magnolia again. Maybe he should too."}, {"rating": "10", "text": "After Einstein created the Theory of Relativity everything he did had credibility and huge value. Same with PTA after There Will Be Blood. This movie is delightfully entertaining, superbly acted and a literature lovers dream. If you feel within a fog the first time thru that is about how Doc Sportello feels.\r If you don't understand something its probably your fault and not the director just like if you don't understand Einstein."}, {"rating": "3", "text": "Tedious, pointless, a wast of time. Just can't believe how a great director who has made brilliant films like Boogie Nights, Magnolia and The Master could squander effort on something so meandering and facile."}, {"rating": "2", "text": "I haven't read the Thomas Pynchon novel, but if it's anything like the movie I wouldn't make it thru the first chapter. Set in the early 70s, this California noir revolves around private eye Doc Sportello (Joaquin Phoenix, who is fun to watch) as he talks and talks and talks in convoluted language about the confusing plot. The story is hard to follow and director Paul Thomas Anderson's oblique style and often-unblinking camera make it even more frustrating. Despite the sparse sprinkling of jokes and the stoner sensibility, the deadly pacing make this meandering mystery a tedious exercise in self-conscious cinema."}, {"rating": "1", "text": "Not stupid or pretentious enough to even waste time seeing this.  If you're not onto this sham of a director and his complete lack of talent and story-telling ability, then you deserve what you get.  He's a writer who doesn't outline or have any respect whatsoever for the audience.  He is anti-audience, anti-Hitchcock, anti-structural coherence.  Self indulgent prima donna that never bothers with endings much less what leads up to one.  Yet it gets an 81 from critics on here just showing the very unreliable nature of this site's worthiness and worse just how pompous, out of touch, and just plain stupid most film critics are these days.  Boycott their reviews, write in demanding their firings, etc.  Anything to get the jackasses out."}, {"rating": "3", "text": "This movie sucked c**ks alright! Apart from Joaquim Phoenix brilliant performance - like he always do - this movie is a disaster. I can't remember watching such a long, dull and confusing movie since I don't know when, and it looks almost impossible it was made by the same guy who did the very good \" There will be Blood\". Safe to say I'll never touch a book written by Thomas Pynchon..."}, {"rating": "7", "text": "This reminded me of Tarantino storytelling meets the Big Lebowski, crossed with Fearing and Loathing in Las Vegas, I watched it (all 2 1/2 hours of it) and I'm not sure what the h*ll I just saw. Pheonix was dynamic in his leading role and the constant appearance of other actors in minor roles, made for a reason to stay awake. If nothing else you can sit back and try to figure out how all of the things that happen somehow tie together. Or when the movie is over, you can wonder-\"thats it?\""}, {"rating": "9", "text": "This movie is hilarious!!! There are scenes that will leave you with so much laughter you will be embarrassed how much you are enjoying this movie. Wondering which plot devices are imagined and which are real is perhaps the best part of this story. It makes you never want to try drugs for any reason that is for sure!"}, {"rating": "9", "text": "Being a fan of several of PTA's films, I absolutely loved this film despite not having read the book it's based on. It's definitely one of his lighter-feeling films compared to some of his previous works, such as Magnolia and There Will be Blood. The film had a lot to offer. It was surprisingly funny on several occasions and didn't take itself too seriously. The whole entire ensemble cast also manages to put on a grand show. Joaquin Phoenix made for a great and funny lead. Josh Brolin also had several funny moments. Overall, it's definitely another great addition to PTA's directorial filmography and one of the best films late 2014 had to offer!"}, {"rating": "2", "text": "Ridiculous exercise in tedium.  I can't imagine a more unappealing character  than the one Joacquin Phoenix plays, and plays badly.  There are a few funny moments in it, but for the most part it's false, pretentious, and ridiculous.  Seriously;  this is what allegedly smart, indie films have become?  This is now what passes for good cinema?  Phew."}, {"rating": "0", "text": "I suppose it's supposed to be a movie like the 70's noir classic Night Moves with Gene Hackman--but the plot is very hard to follow. This is because the main character is stoned throughout the movie--along with every other character. It was honestly a huge slog to get through. Maybe if I could have followed the plot, I would have enjoyed it more. Also, it's supposed to be a comedy? Maybe? It was a lot like being around actual stoned people at a party who think they are hilarious. They aren't--and neither was this movie. It is very well shot--and the costume and set design looks AMAZING. The music is also fantastic. I gave it a 3. Sorry--but I think it stinks."}, {"rating": "3", "text": "This movie really plods along, making it very difficult to stay awake. The Art Direction was beautiful, the acting was terrific, but ultimately the story was incoherent."}, {"rating": "3", "text": "gimmicky, pseudo-hip nonsense from the usually great Paul Thomas Anderson. This film along with his last one, the Master, have both been dull and not a shadow on the great 'There Will be Blood.'"}, {"rating": "6", "text": "Inherent Vice tries really hard to be The Big Lebowski but lands quite a bit off mark, ending up somewhere close- it's an enjoyable film, all in all- but falling just short in every important way. The gags aren't as funny and the story is much harder to follow, to the point of being incoherent. Of course, this style of narration is meant to mimic the experience of a hallucinogenic experience, and I suppose it succeeds in doing this. If you're into psychedelia and dig what was going on in California in the 1970's, then you should enjoy this film. But , in the end, Joaquin Phoenix's \"Doc\" is no \"Dude.\""}, {"rating": "5", "text": "I've seen this movie twice, both because I'm a PT Anderson fan, and because on first viewing, I came out scratching my head, and I thought that I might be missing its merits.\r As opposed to other films of its ilk that have an intricate, even deliberately convoluted plot (The Big Sleep, The Long Goodbye, The Big Lebowski, and maybe Kiss Me Deadly or other noir), Inherent Vice isn't wall-to-wall engaging scenes.  A few of the scenes are, but far too many aren't sufficiently engaging.  Half the scenes in this movie, right from the start, are highly skilled (the lighting, the acting, the composition), and otherwise wholly shruggable.\r There's plenty of brains and heart as the movie talks about squares vs\rsubversives, or the abandoned values of the 60's being more human than the greed to follow, but if you've considered all this before, it might not add anything for you.\r It's skillfully made, smart, and challenging.\rBut I'm still not sure I see what the artistic insights or merits are."}, {"rating": "3", "text": "PT Anderson seems to continually make well acted films which start out promisingly and then go absolutely nowhere.  It's almost his own genre, with the Coen brothers sometimes churning out similar fare when they feel bored.  I'm starting to think Boogie Nights was a fluke, because he totally nailed everything on that film and outdid the Altman and Cassavetes films he was emulating. Nowadays his movies just feel like an Altman movie that gets eaten by your VCR halfway though. When the tape clears you just see that it was taped over a german scat  porn, one where a director is trying really hard to take a dump on a reel of 70mm film. In the end the results are a lot less exciting than we could hope for."}, {"rating": "0", "text": "When I started watching the movie, it looked promising... but after the first half hour, my stomach started to turn and I realized I was watching a really, really bad movie.\r The relationships that this character has with other characters aren't well-developed (or developed at all), so you spend most of the movie watch the main character having wacky interactions with other characters, with no understanding of what's at stake, why their dynamic is what it is and why it seems that the emotions/behavior of the characters has no connection to what's happening in the story.\r Another thing is that behavior of these characters... I have no idea why, but at a certain point, the movie devolves into a wacky cartoon... it's as if someone realized the movie was a steaming pile of crap and thought that acting wacky would somehow entertain the audience."}, {"rating": "0", "text": "This is the worst crap i've seen in 33 years. I'd rather watch AVP2 10 times in a row than ever have to watch this again. It's boring, slow, not funny, confusing, and without a sense of direction, typical of Paul Anderson latest stuff. But the worse of it all is that it's crowed with A-List actors, and not one, except for Joaquin, can add up anything that's worthwhile. It's crap, crap, crap...."}, {"rating": "3", "text": "This is the worst possible kind of time-wasting DVD ... the cast & quirks are good enough that you can't watch while multitasking, yet the loose mumbling & vague plot are just not that interesting. Joaquin Phoenix wears the same expression on his mutton-chop mug throughout, that of a clueless Wolfman Jack. He's supposedly a private investigator, but he never seems to have a case (or means of support?) and never investigates anything except the fate & whereabouts of his ex-girlfriend. There are smatterings of \"L.A. Confidential\" -- minus the wrenching emotion -- and some droll & delightful turns by an excellent supporting cast. Honestly glad when this meandering thing was over, though."}, {"rating": "1", "text": "What a horribly boring film. I could feel myself age minute by excruciating minute. I tried to bear with it, with its cameos by A/B-list celebs but Phoenix's character was uninteresting along with the grit of the early '70s in Calif. It smacks of a straight-to-tv movie they used to feed the public back then. Waste.of.time."}, {"rating": "8", "text": "Possibly PTA's worst film, but...still a good film.  It is a bit long, and slow at times.  Maybe the director wanted to create the feeling of being high ?  I don't know.  Its also very hard to follow along as many key plot points are said in low tones or a whisper.  You need to be ready to pay attention but there is some humor and I love the 70's nostalgia, and the plot is all over the place.  (Keeps it interesting despite the slow pace at times.)"}, {"rating": "9", "text": "I really disliked Joaquin Phoenix as an actor before this film. But he pulls it off. The roll he plays, a dumb dope fiend/clever private eye is basically a contradiction. But in his hands it just works. Its the little thing he does. Like crying a single tear as his weed is destroyed that really sells it.\rAll the performances in this film are excellent. Josh Brolin as the tough cop who doesn't have it as together as it seems. And all the relatively unknowns who play a big part in this move.\rThe parts by Reese Witherspoon, Benicio Del Toro, Owen Wilson and Martin short, though small are quite effective. They feel like complete characters leading their own lives of which the protagonist is only a small part.\rThen there is the plot of the film. The pace of the film is generally slow, so if you aren't watching out for all the clever little details they can be easy to miss. This is not one for the wider audiences. The story is complex with false leads. Trails that seem to go nowhere before they come back around. All the things a good detective film should have. Also there is rampant drug use with more than a little nudity, so not one for the kids. But to the mature film goer looking for an engrossing experience, it is good."}], "recommendations": ["lucky_number_slevin", "match_point", "the_gambler", "logan_lucky", "tinker_tailor_soldier_spy", "tenet", "tusk", "now_you_see_me", "the_prestige", "thor_love_and_thunder", "gone_girl", "bad_times_at_the_el_royale", "there_will_be_blood", "seven_psychopaths", "the_departed", "twelve_monkeys", "the_power_of_the_dog", "burn_after_reading", "the_irishman", "greenberg", "rocknrolla", "vanilla_sky", "hugo", "the_hateful_eight", "the_american"]}