{
  "id": 3007,
  "title": "Inside Man",
  "starring": [
    "Denzel Washington",
    "Clive Owen"
  ],
  "runtime": 129,
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "When an armed, masked gang enter a Manhattan bank, lock the doors and take hostages, the detective assigned to effect their release enters negotiations preoccupied with corruption charges he is facing.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5ljZJLpQj8s3iSk3LylnFDyDoIK.jpg",
  "categories": {
    "plot": 5.038461538461538,
    "acting": 4.9743589743589745,
    "ending": 4.818181818181818,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "This is hack work. I was a fan of Lee's even when the buzz around him died. And I love all the major actors in this movie. But I thought it was one of the clumsiest movies I've seen in a long time. No energy, momentum, style. The script was anemic and corny. I'm not sure how this film was supposed to translate. As suspense it failed because it telegraphs everything in advance. It has a distracting sublot with a nazi sympathizer that is based on an ubelievable premise. It also has too many A-list actors like Jodie Foster and Christopher Plummer doing small parts that are little to work with and that is something I always find distracting. I'm not trying to be a hater, but I really disliked this movie and am taking the time to write this because I disliked it so much."
    },
    {
      "rating": "0",
      "text": "This is truly one of the worst films I've ever seen. On several occasions, this mess was nothing more than thinly veiled racial jabs masquerading as a crime thriller that goes nowhere. We see Spike's usual M.O. on display throughout the film, which basically amounts to making caucasians feel guilty about...well being caucasians. Spike Lee was in way over his head on this one. Case in point...Lee is the only dolt transparent enough to cast Jodie Foster as a manipulative power broker (who's white of course since white=manipulative in Spike Lee joints) then proceed to name the character Ms. White. Even the overt racial sarcasm falls flat as his breathless pursuit of half cocked social commentary drags this sophomoric production down to the abyss of most forgettable films of all time."
    },
    {
      "rating": "3",
      "text": "Pretty terrible, really. The masterful Denzel, even more so than with \"Man On Fire,\" is swimming upstream here and Clive Owen better think of a way to add some vulnerability to his hardass act soon because it's wearing thin. There is some really painful dialog as our heros dissassociate from the grave danger threatoning fifty human lives, and, while Spike himself doesn't appear, there is scene after scene featuring talentless people demonstrating his acting technique of very nearly winking directly into the camera."
    },
    {
      "rating": "1",
      "text": "Here we have the second worst film I have ever seen. This DVD should come with a packet of \"eye bleach\". Boorish from it's inception, this film quietly reminds you why Hollywood is dead. I gave it a \"one\" because Ms. Foster's knees look like tadpoles in the gullet of a large pelican."
    },
    {
      "rating": "3",
      "text": "A silly and limp \"thriller\" by an otherwise intelligent director. There were laughs in all the wrong places."
    },
    {
      "rating": "6",
      "text": "No one can deny that this movie has a great cast. The acting is terrific. The directing is classic Spike Lee--brilliant at times, but he takes every chance to work in commentary about race, religion and ethnicity. All in all, this movie presents a good picture and the plot depicts what would be a brilliant heist if it were true. However, there are serious flaws in the plot (which are gracefully glossed over by expert acting), but the end result is that we really don't know the various character's motivations for their behavior. At one point we are told by one of the theives \"I did it for the money\", but that doesn't seem to add up with what was taken. Similarly I'm still trying to figure out exactly what motivated Denzel to bring Jodie a telephone number in one of the last scenes. The sequence of the movie is expertly executed to both provide hints and keep you guessing. Denzel's character is likeable, funny and feels real. Jodie Foster's character is a bit unbelievable in terms of profession. Oh, and keep an eye out for the Albanian woman. I thought she was excellent."
    },
    {
      "rating": "3",
      "text": "Due to the generally positive response to this film, I asumed I would like it. Wrong!!! Sorely lacking in style, this potboiler is all over the place! The writing of Denzel Washington's character is often ridiculous; and he works valiently to overcome it. The only real entertainment value for me were the unintential (I assume) moments of camp; notably, the telephone scene between Denzel and his girlfriend; and the bizarre performance from Jodie Foster, who seems to be trying to channel Ann Coulter! Foster's attempts at being cool and cunning come off as simply laughable. I'm not sure how Christopher Plummer kept a straight face in his scenes with her. For me, only Foster's performance fiasco made this film worth my viewing time. And why was Willem Dafoe's participation needed here? I used to believe Spike was good film director, but a poor screenwriter. After seeing \"Inside Man.\" I now have my doubts about his skills as a director. I think most of the \"names\" signed on for the money."
    },
    {
      "rating": "3",
      "text": "you think the movie is clever, but its not, there's way better movie out there than is one, and please, don't take your girlfriend to a movie like this one."
    },
    {
      "rating": "1",
      "text": "The worst thing about Inside Man is not that it is such a terrible film, (which it is) but that it received such good reviews. What's the deal? Are the critics just so used to lousy movies that they give a bomb like this good marks? This is a really bad script, poorly acted (what is up with Jodie Foster?-i've seen better acting at my kid's school play), and poorly directed by Spike Lee-who hasen't made a good film since-maybe never. Boring, stupid and a waste of time!"
    },
    {
      "rating": "1",
      "text": "Of all the films of 2006, the largely favorable critical reception of this one is truly the most baffling. It actually manged to make at least one film critic's 10 Best List!!!! Slick? Yes. Good? Absolutely not! The only reason I give this film \"1\" point is for the highly-entertaining, unintentionally laughable performance by Jodie Foster -- she's so awful in her seething intensity, that she's wonderful! Foster's megacorporate red-herring heavy-breathing was the only aspect of the film that kept me interested -- just to see what she would do next... The whole enterprise is slick garbage! I'm sure they all enjoyed cashing their checks when the project was finished."
    },
    {
      "rating": "2",
      "text": "The best part of this movie is the trailer you see on tv.. looks great.. till you get there and the two hours of your life is over. Boring not enough action.. Jody Foster has lost her acting abilities. I wanted to not the fack smile off her face.. But i dont hit woman."
    },
    {
      "rating": "2",
      "text": "I agree that the best part of this movie is the trailer on TV. Unnecessary social commentary inserted into useless waste of time scenes (at one point, denzel instructs a low level patrolman not to use ethnic slurs and the bank robber owen tries to steer a child away from playing a violent video game, lame for a supposed heist movie) jodie foster's character was useless and the acting belonged in \"mean girls\". If you're looking for a plot with standard rising action/climax/falling action don't expect any from this film. Yes I understand the ending but that doesn't mean that it was clever or interesting. Over half of the theater waited throughout the entire ending credits with a desperate hope that they would eventually get there money's worth and a portion of the plot would be seen to completion. no such luck. Loose ends are everywhere from the role of clive owen's fellow bank robbers to how the robbers got all of their information to how they were at all connected to Case. Although Denzel's observation that \"this ain't no bank robbery\" is correct, I was disappointed with the \"deep\" and \"complex\" conspiracy that for some reason involved the mayor of new york, although his character seemed unaware of even his own role halfway through the movie"
    },
    {
      "rating": "0",
      "text": "Lee, for one, is long beyond his days as a civic provocateur and voice for the radical social world. Like John Singleton, he may have found his legs as a pulp manufacturer whose least arguable claim to fame is that he can do fast, funny, attitudinal genre films better than Tony Scott. Washington and Foster, for their parts, are merely dukes in a sick kingdom, taking what roles they're offered for people their age (and sex) just to keep their careers afloat in the public brain-pan. Lee is playing the genre like a board game, and his film is a sniggering riff, filled with hyperbolic New York stereotypes, sexist jokes, puns, scattershot commentary on racial profiling and smug banter. As bogus in its way as Richard Donner's 16 Blocks, Inside Man has an even more irritating disrespect for the verities of police work and for the emotional life of urban Americans. There are a few rousing achievements on the table, in particular a comical police debate--instigated by a faux riddle tossed by Owen, about trains, U.S. currency and Grand Central Station--as well as a fast joke involving a Sikh hostage who, outraged by profiling, acknowledges that yes, he can easily hail a cab in Mid-Eastern-cabbie-saturated New York. But heist films are hardly what they used to be; for decades, they were a vehicle for postwar desperation and fatalism, and today the genre has an empty tank of frisson to offer without film noir's acknowledgment of doom. The difference between, say, Stanley Kubrick's 1956 masterpiece The Killing and contemporary daydreams like Inside Man is the difference between a luckless hell on earth and a dull weekend in the Poconos."
    },
    {
      "rating": "7",
      "text": "Too much Characters are introduced and ignored in the movie, but nevertheless \"Inside Man\" is a powerful heist movie full of ready-tension."
    },
    {
      "rating": "0",
      "text": "This movie is an insult to intelligent movie making in every imaginable sense. The story is flat out lame, with the super \"surprise\" ending being nothing more than a tired joke. Now it seems that everyone from critics to casual movie goers have been willing to excuse this movie solely based on the great cast. Which would have been understandable, had the acting itself not been the greatest weakness of this pretentious mess. Washington gives one of the worst performances of his career here, playing a sarcastic know-it-all cop who is annoyingly juvenile and devoid of any compelling thoughts or emotions.i.e., he and his partner stare at a female victim's large chest while interogating her, making light of her emotions. (this is supposed to be funny) Foster is also terrible playing a mysterious liason with her own agenda. Dafoe is miscast as a clueless police captain. Owen is the only exception here, suffering through an under-developed role. The movie is ruined by random attempts at comedy, both intentional and unintentional, which ruins any suspense or tension that might have helped it. THE BOTTOM LINE: A pretentious hollywood film that trys to pass itself off as an updated Dog Day Afternoon, but instead feels more like a failed comedy with an A-list cast."
    },
    {
      "rating": "10",
      "text": "Inside Man was an action packed, tense and suspense filled, and overall exciting movie. This movie is going into my book as my favorite movie. The actors were absolutely amazing and they fit their part.\r If I had to watch a movie over-and-over again, this would be it. It is filled with energy and is absolutely incredible. The soundtrack was amazing and fit well in the movie. The actors were well placed, and were great at their job.\r Clive Owen's ego and personality really fits the character \"Dalton Russel\" as explained. Denzel Washington also did a fantastic job of \"Detective Keith Frazier.\" Overall the actors of this movie really had a place and knew what they were doing.\r If you are looking for an action-packed, somewhat comedic, and suspense-filled movie, you should really check out \"Inside Man.\" Spike Lee has outdone himself on this one, as it is a well put together film that is sure to please you. It is rated 'R' so be careful who watches it. Overall great movie."
    },
    {
      "rating": "9",
      "text": "Mükemmel kurgulanmış benzerlerinden oldukça farklı çok değişik bir tat veren olağanüstü oyuncu kadrosuyla ve yönetmen spike lee eşliğinde daha önce neden izlemediğimi düşündürten film. Kesinlikle klasikler arasında yerini alacaktır mutlaka izlenmeli..."
    },
    {
      "rating": "9",
      "text": "Very UniqueInside Man is a thriller that has the terrific talents of it’s cast."
    },
    {
      "rating": "10",
      "text": "This movie is almost flawless, its not the classic American movie where the good guy beats the bad guy, in here there's no bad guy, everybody is just trying to make it. The ending is awsome, and helps u comprehend the whole movie. There hasn't been a better thriller since the sixth sense."
    },
    {
      "rating": "7",
      "text": "Though certainly Lee's most mainstream film to date, Inside Man is much more political than most critics are giving it credit for. Ultimately, Lee reveals detective and bank robber as dual protagonists, fighting corporate and government systems that reward corruption, injustice, and opportunism at every step. Between this, V for Vendetta, and Dave Chappelle's Block Party, I'm feeling revolutionary. Down with the white majority!"
    },
    {
      "rating": "10",
      "text": "Thought it was great!"
    },
    {
      "rating": "7",
      "text": "Clever and entertaining. It seems as Mr. Lee wanted to show the world he could make a good \"normal\" film and he did it."
    },
    {
      "rating": "5",
      "text": "A movie where the whole didn't add up to the sum of its parts. Solid if not spectacular performances by Denzel, Jodie and Clive, decent enough pacing, but there was something missing. The story was VERY anticlimactic...the twist with Christopher Plummer was revealed very early, and movies like this are more effective when they end with a bang than a whimper. It was so-so...I wouldn't recommend it."
    },
    {
      "rating": "5",
      "text": "The writer and producer think they are so clever, but the basic plot is ridiculous. Spike Lee makes it interesting with various directing techniques. The last 15 mnutes is a big letdown. Lucky Sleven does this type of movie much better."
    },
    {
      "rating": "9",
      "text": "One of the best caper flicks in years. Only The Score comes to mind among recent ones as being anywhere near as good."
    },
    {
      "rating": "8",
      "text": "No it's not perfect, but it sure is entertaining. And thats all that counts isn't it?"
    },
    {
      "rating": "9",
      "text": "This is just great. An entertaining heist movie with (thanks to being directed by Spike Lee) a social conscience. The best bits being the portrayals of everyday predjudice and the dangers inherent in a generation growing up playing 'harmless' videogames."
    },
    {
      "rating": "9",
      "text": "Go with the critics on this one. Excellent movie! Spike Lee is consumate film maker. He pays attention to the details. Easy to understand why artists perform for him. I compare this one to Usual Suspects which Roger Ebert gave a 38 rating in 1995."
    },
    {
      "rating": "8",
      "text": "Taut, compelling thriller; it kept me on the edge ot my seat and wanting more throughout. This is the best movie I have seen this year. Nonetheless the movie had a few weaknesses: the characters lacked depth and I found the ending a little weak, but these are really nitpicks. An excellent movie. Strongly recommended."
    },
    {
      "rating": "6",
      "text": "This film can be summarized in five words: \"All flash and no substance.\" The lead actors deliver solid performances (as you would expect from the likes of Denzel Washington, Jodie Foster, and Christopher Plummer) but are unfortunately expected to carry a largely incomprehensible story where the plot is vague and convoluted and the motivations of the characters are poorly defined. Top it all off with a resolution that leaves more questions than answers and you have a film that is hard to recommend. To Spike Lee's credit, he can be confident and inventive director, but he still goes for \"film student gimmickry\" when the film would have been better served with more restraint and a tighter focus on the narrative. \"Inside Man\" is entertaining enough as a popcorn flick, but there are better films more deserving of your time."
    },
    {
      "rating": "7",
      "text": "Very slick indeed, all actors are playing to strengths here and it shows. Great dialogue brings alive a tried formula."
    },
    {
      "rating": "7",
      "text": "If the ending were as good as the rest of the movie I would have given it a 10. Most of the way through the movie was great... good plot, good acting... then it ends, and leaves you feeling \"what happened.\" Four of us went together and none of us could figure out what happened at the end. Very frustrating!"
    },
    {
      "rating": "8",
      "text": "Entertaining and compelling to the end. Not a flawless film but a fun and engaging ride."
    },
    {
      "rating": "5",
      "text": "Judging by the reviews on this site I was anticipating a good movie but I was dissapointed. It had its moments and had the right idea but went wrong in a lot of area's. Overall it was incredibley cheesey. But I expected that as soon as I saw the opening credits and was reminded that it was A SPIKE LEE JOINT."
    },
    {
      "rating": "9",
      "text": "Thought it was very well done. Excellent acting by Washington and Owen. Lots of action and a good story line. Great movie. Got to be good with Denzel Washington playing the lead. Excellent."
    },
    {
      "rating": "7",
      "text": "I generally do not like Lee's movies, but this is an exception. The story keeps you on your feet and although I generally do not like Washington he was pretty good in this one. I only see about two or three movies a year and I'm happy this is one I did see."
    },
    {
      "rating": "9",
      "text": "This movie is a must-see movie. It's not the best movie in the world for sure, or even close to that, but it's a movie everyone should see in the big screen."
    },
    {
      "rating": "9",
      "text": "It resembles \"The Usual Suspects\" in many ways, although the cast definitely has more star power. My expectations were met; I was entertained, I was surprised, and I laughed. This is the one and only Spike Lee film I've ever liked."
    },
    {
      "rating": "4",
      "text": "I am a big fan of Spike Lee, and think a lot of his other moveies have been very underrated. So I saw this with high expectations and was quite disappointed. The movie has little suspense, the plot is unbelievable, and some of the minor characters are so stereotypical, they are both unbelievable and distracting. The only really great performance in the movie was by Clive Owen, who is mesmerizing. The other main actors (Denzel Washington, Jodie Foster) are good, but have been better in other movies."
    },
    {
      "rating": "8",
      "text": "Beautiful."
    },
    {
      "rating": "10",
      "text": "This is the PERFECT genre movie and has been completely underrated by almost everyone. I expected very little from this other than a competent heist movie and was completely overwhelmed by both the cleverness of the action and pacing, the way that Spike Lee played with your expectations, and the taught character interplay. Everything about it was an unexpected pleasure. The only movies that this can really be compared to are the great French thrillers like Rififi or Les Diaboliques, which were made (like this) by great directors who fully respected the conventions and limitations of the genres they are working inside."
    },
    {
      "rating": "10",
      "text": "100% Satisfaction guaranteed! Highly recommended! Spike lee's best for years."
    },
    {
      "rating": "8",
      "text": "I'm surprised at the number of negative comments posted on this movie. Although not perfect, this movie is certainly entertaining and is better put together than most junk you see on the screen these days."
    },
    {
      "rating": "9",
      "text": "I enjoyed watching this movie. A very surprising thriller."
    },
    {
      "rating": "8",
      "text": "Filmmaker Spike Lee's first foray into big-studio genre movies, Inside Man is a twisty thriller that makes up for its flaws with star power and sharp observations about post-2001 New York. It's about the volatile showdown between a determined cop and a perfectionist bank robber is sent spiraling toward disaster when a scheming power broker steps in to take control of the situation in this hair-raising heist flick directed by Spike Lee and starring Denzel Washington, Clive Owen, and Jodie Foster. Dalton Russell (Owen) is a bank robber with a difference. In his quest to execute the perfect heist, Dalton has taken every possible factor into consideration. Dalton's uncanny ability of staying one step ahead of the law thwarts even-tempered Detective Keith Frazier's (Washington) best efforts. But there's another factor at play. The bank president (Christopher Plummer) has requested the services of high-profile negotiator Madeline White (Foster). Despite her commendable track record, Madeline is something of a wild card, and before the day is over, this bank robbery will go down in history as one of the most elaborate heists ever executed. Inside Man's plot is exciting, and the acting by Washington, Owen, and Foster all have a stellar performance of their own. I couldn't have liked it more."
    },
    {
      "rating": "5",
      "text": "\"Inside Man' is at its best when Jodie Fisher, Clive Owen and Christopher Plummer are on screen.; theirs is acting on a consistently high level. Unfortunately, the same cannot be said for Denzel Washington who is often too mannered; this is not his finest hour."
    },
    {
      "rating": "9",
      "text": "This movie has all the trappings a heist movie ought to have, engaging plot, solid and diverse cast, slick direction, decent score. all works and looks great together."
    },
    {
      "rating": "8",
      "text": "Implausible yet oddly entertaining, a testament to the fine job of the cast and director I suppose. Given the way the plot (finally) plays out, it's quite ironic that the \"getaway car\" is a Volkswagen."
    },
    {
      "rating": "10",
      "text": "Wow.. This movie was spectacular.. I really enjoyed it. The theatre I was in unfortunately had a fire alarm when it got to the part where Clive Owen walked out of the bank just like he said. And words cannot describe how bad I want to see what was going to happen after that.. Once again.. fantastic movie."
    },
    {
      "rating": "10",
      "text": "A fantastic film! I'll be seeing this one again and buying the DVD when it comes out!"
    }
  ],
  "recommendations": [
    "lucky_number_slevin",
    "the_departed",
    "money_monster",
    "body_of_lies",
    "breach",
    "jack_ryan_shadow_recruit",
    "american_gangster",
    "knives_out",
    "logan_lucky",
    "gangster_squad",
    "the_accountant",
    "safe_house",
    "broken_city",
    "the_equalizer",
    "triple_9",
    "the_taking_of_pelham_1_2_3",
    "american_hustle",
    "man_on_fire",
    "shooter",
    "suburbicon",
    "changeling",
    "widows",
    "the_equalizer_2",
    "the_guardian",
    "mystic_river"
  ]
}