{"id": 1506, "title": "Insidious: Chapter 3", "starring": ["Stefanie Scott", "Lin Shaye"], "runtime": 97, "genre": ["Horror", "Thriller", "Mystery"], "description": "A twisted new tale of terror begins for a teenage girl and her family, and revealing more mysteries of the otherworldly realm, 'The Further'.", "releaseYear": "2015", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/iDdGfdNvY1EX0uDdA4Ru77fwMfc.jpg", "categories": {"plot": 6.660377358490566, "acting": 6.583333333333333, "ending": 6.3076923076923075, "soundtrack": 1.6666666666666667, "cinematography": 6.0, "familyFriendly": 5.714285714285714, "funny": 7.75, "action": 7.333333333333333}, "reviews": [{"rating": "6", "text": "It's a solid horror flick - the lead actress plays her role well, Dermot Mulroney is quality, and the older lady psychic is excellent, as usual.  What I can say is that the final jump-scare a the VERY end of the movie is terrifying.  Reminded of the old \"Quart of Blood Technique\" from 48 hours... You know that some scary is coming when they roll out an extended, benign resolution."}, {"rating": "4", "text": "The movie is forgettable. The first one was the best of the three. Insidious 3 relies on jump scares and not so much on the creepy, disturbing terror that the 1st movie employed so well. Not only that, but the trailer gives away A LOT of the jump scares that the movie uses, so you'd know what to expect in this particular scene. It just ruined a good chunk of the movie. Acting was mediocre, and it just wasn't a good movie overall. There were a few gems here and there but is it enough to save the movie? Don't count on it."}, {"rating": "5", "text": "Decent. albeit formulaic, horror movie.  Some of the \"clever\" turns in this film are references to the other films. The acting is inconsistent:  some are good, others are very stiff.  It is a relatively fun ride with a number of good scares.  This is not torture porn, none of the images are more than \"disturbing\" or \"cringeworthy.\"  Decent little movie."}, {"rating": "5", "text": "It isn't a great horror flick, most of the scares feel earned, definitely not all of them, and there's a little too much subtlety for it's own good. But it isn't a bad one either, relying heavily on crazy loud banging and crashes in sweaty effort for cheap surrender of fear. One scene in particular will actually keep you sitting still until it finishes, involving a lead teen played convincingly by Stefanie Scott, lying on her bedroom floor and looking adjacent to a pair of clawed feet walking toward her from the other side of the bed. The 3rd installment in the franchise is actually a lot closer to the 1st one, despite it being a debut from Leigh Whannell, rather than horror veteran James Wan. This film gets him on base for me, I'll stick around and see what else he's got up his sleeve, fingers crossed for more neat tricks."}, {"rating": "1", "text": "The Further? Again? Yes its a prequel but can't they introduce a new environment where these demons came from, perhaps another portal? Fresh ideas please."}, {"rating": "9", "text": "I saw this last night at a late night showing, but I forgot to write about it. Absolutely terrifying... the atmosphere and tension made the movie almost unbearably scary. I covered my eyes at least 3 times."}, {"rating": "7", "text": "This isn’t the best horror movie of 2015 by any stretch. Honestly, based on most areas of execution, Insidious: Chapter 3 is pretty bad.  But Shaye is mighty enough, and the cinematography is gorgeous enough, and the scares are quite scary enough to elevate the film to theater-worthy status."}, {"rating": "8", "text": "If you're a fan of the insidious series, and a horror fan overall, this one won't disappoint. Has good scares and it's well acted. Definitely enjoyed it"}, {"rating": "10", "text": "The creepiest of the insidious film series! just awesome! good acted and fantastic atmosphere! i liked it! easily is the second best horror movie of the year...!!!!"}, {"rating": "9", "text": "Without James Wan in the director's seat it's not hard to wonder if the third entry in the Insidious series would live up to it's predecessors. Thankfully first time director Leigh Whannell knocks it out of the park. This very well might be the best of the series.\r Some well-crafted creepiness does a good job of setting up tension early on. There are a few effective jump scares to be found here that are setup by ominous pacing and uncomfortable atmosphere. Things do get noticeably less scary during the movies final act, almost as if it's burning out, but the film still goes strong thanks to the fantastic story and characters.\r The cast here is incredible. Their characters are actually well fleshed out and feel like real people. It makes it easy to care about them and the conflict. A rarity in modern horror films. That's this movie's real strength. The family drama and watching returning heroine \"Elise\" (the fantastic Lin Shaye) overcome her fears and turn into a confident protector help add a little bit of heart to the horror. Returning characters \"Specs and Tucker\" help to bring in some of the humor the previous two films had. Although those elements are kept much lighter this time around. It keeps itself mostly straight-faced throughout.\r It might not terrify you or keep you up at night, but it will certainly provide some creepy thrills and a story that will keep you watching. It's a very satisfying sequel/prequel with ideas that make it feel fresh amongst all of the other horror movies that clog up all of the senses lately. It's an excellent horror movie, and one that makes me excited for any future this series might have.\r I give this movie a 9.2/10."}, {"rating": "7", "text": "2spoopy4me 2spoopy4me 2spoopy4me 2spoopy4me 2spoopy4me 2spoopy4me 2spoopy4me 2spoopy4me 2spoopy4me  2spoopy4me2spoopy4me 2spoopy4me 2spoopy4me 2spoopy4me2spoopy4me"}, {"rating": "9", "text": "AWESOME ONE ........... STORY MODE IS LAGGY  ONE ,,,,,,, BUT ITS ENOUGH 4 A HORROR MOVIES .. AS COMPARED TO OTHER HORROR RELESES IN THIS YEAR\rHORROR SCENES IN THIS MOVIE R AVERAGE TOO ..\rFINALLY ,,, A AVERAGE HORROR MOVIE AND ALSO 3RD PLACE IN INSIDIOUS SERIEs"}, {"rating": "5", "text": "Even though it's the 3rd in the series, this is actually a prequel. It's another haunting story with a teenager (Stefanie Scott) who's terrorized by an evil presence. Psychic Elise Rainier (Lin Shaye) is thrown in the mix for continuity. The ingredients are typical: ominous music, dark hallways, ghoulish specters and jump scares. There were 2 or 3 genuine jolts, but the rest is just fearsome atmosphere and mild suspense. Nothing original or particularly frightening."}, {"rating": "7", "text": "Flaws from the past might still haunt Insidious, but this chapter of the old clairvoyant and new tormented souls proves to be adequately as well as intimately harrowing. A scare is much like a joke, tell it too many times and it will lose its charm. The third chapter of Insidious aim to repeat the success of the original with new characters and old proven methods of distributing chill. It has different atmosphere than previous rural haunting plus screeching hymn, which is a nice change of pace. At times it might revert back to repetitive gimmicks, but ultimately the capable cast led by Lin Shaye as they witness the perilous yet private story of a haunted girl manage to fright and fascinate.\r Quinn Brenner (Stefanie Scott) is saddened by the loss of her mother. Out of desperation she seeks Elise (Lin Shaye) to make unworldly contact. Elise is reluctant to help the troubled girl as she is distraught by her own problems. Though unwilling she still senses that an entity follows Quinn, but it is the farthest thing from her mother. While this premise is similar to The Conjuring, or others of the genre, it still works simply because the characters in predicament are likeable.\r Lin Shaye is very good on drawing sympathy, she looks fragile yet her on-screen compassionate nature is infectious. She also has a way to convey dread as a sort of more neighborly psychic instead of outright doomsayer. The new cast of Brenner family is also presentable. Stefanie Scott as Quinn is believable as an ordinary teen girl, with her typical girl issues and aspirations. The way she might seem plain, not a scream queen, is actually a boon to the movie as she's so much more relatable.\r Dermot Mulroney as Sean, Quinn's father is a great choice. He appears convincing as a father, especially as a single parent who must deal with raising two kids and now the addition of invasive entity. The chemistry between the two as father-daughter is solid, while other supporting characters build up the suspense or deliver a glint of humor between the dark days.\r It all comes down to the how horrifying this third chapter is. The set-up for horror is exceptionally done for the majority of the film, at several scenes it has some clever ways or perspectives to raise the thrill. However, it's still plagued by the same flaws of the franchise, such as resorting to screaming jump scares or it might lose steam as it goes further like the original. These rehearsed stuffs are admittedly have worn out their welcome, whether they persistently linger of not.\r What really nails the horror is the victim, Quinn, as she is gradually gnawed by this malicious existence. In an analogy of a young woman abused, both physically and emotionally, she is shown of losing herself bits by bits. It has a bit of oriental touch as some scenes reminded me of Japanese thriller, and they work very well in tandem with confident acting of the cast. It’s much easier to invest to their ordeal as it looks so personal.\r Before the story Lambert family, there is a tale of breathlessly unfortunate lady. Familiar her story may be though the private display of her trial is suitably eerie."}, {"rating": "5", "text": "Meh. Average modern horror flick that doesn't come close to touching the first two Insidious films. I wish studios would occasionally have the sense to stop and say \"Hey, we made a couple of great films. Lets move on to something new.\" rather than \"Lets keep making these until we completely bleed the franchise dry and then milk it some more\"."}, {"rating": "0", "text": "I don't get the point of this movie. For a prequel, It established nothing that couldn't have been explained in the previous 2 films and offered nothing new in terms of information for the franchise. Also, It wasn't scary in the slightest."}, {"rating": "8", "text": "While it's no better than the previous instalments, it's still a very solid movie. Fans might be a bit disappointed because it doesn't really reach the height of the first two movies. But, one can't deny that some of the scares works effectively, even better when the story slips in a bit of emotional undercurrents, which is one of the improvements this series has offered. Leigh Whannell has a good eye in projecting a moody and frightening atmosphere, though what follows it are jump scares. Those jump scares almost dissipates the whole tension building. Luckily, we have Lin Shaye. Elise Rainier has never been more than a caring clairvoyant. And here, we get the chance to see how vulnerable she was and what are her motivations to get back on track in being a ghost (demon) buster. Stephanie Scott did a pretty good job and I hope I'll see her in future movies. Dermot Mulroney and the rest of the cast did well either. So, if you're just trying to find a good scare, I don't mind recommending this film. Just don't compare it with the first and the second. It stands on its' own."}, {"rating": "8", "text": "Insidious doesn't break any new grounds when it comes to horror, production or even execution, but it does stay true to the horror genre as a whole.  Compared to the other two chapters, it's not as new, fresh or original as the other two films, but it does expand upon the story as a whole and grow the characters in general and that's enough.\r Out of a year of awful movies being released, Insidious 3 isn't all that new or original, but it doesn't fail to entertain. If you are a fan of horror or even background story and character growth, this movie will do fine by you."}, {"rating": "6", "text": "This one is probably the scariest one of the 3, but it's the kind of scary where things are jumping out and surprising you. I watched it alone in a movie theatre in Vegas. I was literally the only one in there. So this movie got my adrenaline going, which helped my get over my hangover faster (this is science, right?).\r Hard to give this 7 or higher because it's really just rehashing same ideas. They need to get creative with \"the further\" or retire this series. Like what if a good spirit took over a bad person's body? Get creative."}, {"rating": "8", "text": "I think this was the best Insidious film I have seen. It was more intense that the previous two, and was actually quite emotional because the personal relationships between the characters were so real. This is very rare in a horror film, where you may find the characters interesting and care about them (as in The Innocents, for example), but not as intensely and personally as in this film. Much of the credit for this must go, I think, to Lin Shaye and also to Dermot Mulroney, both of whom were completely believable while all hell broke loose in the “spirit world.” And it is always great to see our old friends Tucker and Specs again, for both the humor and seriousness they bring to the film."}, {"rating": "7", "text": "Like the other two Insidious films this film has its moments where you need to turn on the lights.  For the most part prequels don't work in the case of this film I was pleasantly surprised.  B+"}, {"rating": "8", "text": "''two thumbs up''....I was quite glad I watched this 3rd installment I had low expectations before watching this I wasn't sure but I did its even better then the first to its very well made and crafted the scares are decent and the jumps are good leigh whannell did very well with this film I don't agree with the critcs id give atleast a 75/100 for those who like the franchise go and watch it its worth watching three times.."}, {"rating": "2", "text": "If you want another movie with cheap scares and a massive load of idiotic jump scares with no satisfying plot, go for Insidious: Chapter 3. Throw one jump scare and that's fine but no actual creepiness and relying only one jump scares is a terrible idea."}, {"rating": "7", "text": "Insidious: Chapter 3, directed by Leigh Whanell, is the most terrifying and entertaining Insidious film yet. This is considering the fact that the first film was slightly scary and the second not at all."}, {"rating": "4", "text": "\"The man who can't breathe\" gets to be the only enjoyable character from the hole film and the \"trama\" that surrounds him; the rest tends to remain as mediocre enough for a Chapter 4 that would only exist if the franchise wants to apologize to the public.\r *Actually, if you think about it, it can also become a \"suspense\"-comedic movie."}, {"rating": "5", "text": "This film showed so much potential at time but still fell to an unsatisfactorily average level overall. First i'll start of with the positives.\rThis film did actually try to bring some psychological uneasiness to the table with ceratain scenes that out matches most from Insidious 1 and 2. These were subtle and worked brilliantly, like in one scene were the demon shuts out all light in the room slowly, really building the scene up. There were more great scenes like this but for the sake of not spoiling the film i will refrain from typing them. However, i found these scenes brought the films score up dramatically.\rNow the negatives.\rThis film still suffers from the problem pretty much every modern horror film other than recently The Babadook and It Follows suffers from; it's reliance on jump  scares. How many times do we have to tell you jump scares aren't scary, they just make us jump. STOP RELYING WHOLE HORROR FILMS ON THEM. They are fine to be used occasionally. Also, the fact Elise is able to have \"super powers\" of sorts in The Further is a ridiculous addition to the Insidious canon, WHY HAVEN'T WE SEEN ANYONE DO IT BEFORE?!? It looks ridiculous at points to say the least. Also, the introduction of how some characters met seemed so forced, along with the chemistry that becomes of them later in the film. It was cringe worthy to watch. Also, the film suffers from a lack of an interesting colour scheme that the first film even had, only the iconic red door still stands. Additionally i must say, the dad's performance of him being a struggling father was just so overplayed.\rNow finally I must make 2 more points as to why the film ultimately fails. The plot is so bland, boring and uninspired that it is literally kind of annoying to watch. The first 2 Insidious films wrapped themselves round each other quite nicely plot wise but this film is just typical \"girl tries to contact someone. Girl gets haunted. Girl almost gets possessed/ taken. Family call for spiritual help. Family save daughter.\" HOW MANY TIMES HAVE WE SEEN THIS? WHY MAKE A PREQUEL THAT DOESN'T EXPAND ON ANYTHING IF THE PLOT IS THE MOST UNINSPIRED STEREOTYPICAL HORROR SCRIPT EVER?!??!?!\rAnd that brings me into my last point, the connection between the films. This film isn't the third film, it is a prequel so I was already a bit annoyed about the title. This film then also has no connection to Insidious 1 OR 2, other than the red demon from the first film popping up at the end. THAT IS HOW YOU CONNECT THE FILM AND SELL IT AS A PREQUEL?!??!? The film shows promise for what they can hopefully do in Chapter 4 but don't count on seeing anything originally scary here. Just get that popcorn in your lap firmly and wait for the jump scares to pop out as usual, which by the way, a lot of them were even in the trailer."}, {"rating": "8", "text": "Probably the best Insidious yet.The first one was really good,but the second one was a big disappointment.This one is more focused on the physical horror rather than the psychological.And it works really well."}, {"rating": "8", "text": "More of the same. I am a great fan of the insidious series and this is more of the same. its a good film but does nothing new and its nothing to write home about. if you enjoyed the other two then i highly suggest going to watch it, if you didnt then i would say avoid."}, {"rating": "8", "text": "Insidious: Chapter 3 is as good as the first Chapter (definitely better than Chapter 2). It is better than it could've been, it is better than it should've been and it delivers a surprising dramatic heft along with the scares. If you are NOT to see this movie because it is a prequel/sequel, see it because of Miss Shaye."}, {"rating": "6", "text": "Insidious 3 is far better than most threequel horror movies. James Wan has left the franchise but he was replaced by Leigh Whannell who has written several scripts for Wan's films over the years and even though Whannell never directed a movie before you can trust him with this film. I feel like Chapter 3 is almost on a smaller scale than the first two movies were, the plot just doesn't feel as significant but the acting was pretty good with several familiar faces returning that have been in the franchise since the first film. I was never a huge fan of the Insidious movies but I think if this is the conclusion to this series it is acceptable."}, {"rating": "7", "text": "Overall, Insidious: Chapter 3 is a scary but fun fright-fest that does exactly what it is supposed to do: entertain and scare the audience at equal measure."}, {"rating": "8", "text": "No soy fan de esta saga, pero debo decir que fue mejor de lo que pensé. No asusta, los Screamers funcionan en muy pocas ocasiones (si están acostumbrados a ver cine de terror, les aseguro que no se asustaran para nada) aunque la trama es predecible en todo sentido, es interesante y tiene momentos divertidos, no es mala, tampoco perfecta, pero cumple, entretenimiento asegurado, screamers poco originales."}, {"rating": "7", "text": "Taken over by writer Leigh Whannell to direct the franchise, the theme does not divert too much from the previous two sequels, maintaining the usual plot development that James Wan did previously except a little bit surprising easy solution final act. Composer Joseph Bishara returns with his usual eerie, loud, noisy and irritating scores that help to boost the scare and the spooky effects, though not as terrifying as Conjuring and Insidious, it is still consider passable for its PG-13 ratings. Even though the performances from other casts are not really up to expectation, characters development are still fine while Lin Shaye's outstanding portrayal as Elise has given her sufficient room to be the lead role. It might not offer any fresh ideas to the franchise, but this warm-hearted frightening chapter stressing on the note of love and loss owns its moment that is not found in previous installments."}, {"rating": "7", "text": "Actress Lin Shaye helps to make these films a bit more entertaining as she always gives a tight performance. The other actors in this film a pretty good as well and there are some effective \"boo scare\" and creepy moments. Of all the Insidious films, this prequel is actually the best. Kudos to Leigh Whannell for his decent sense of direction and a fairly solid narrative."}, {"rating": "7", "text": "For those who love the franchise, this film is a great prequel to what happens to Lambert's family. Elise's story is quite interesting and Quinn's terrifying moments are really scary. We might have many clichés of the genre but Insidious is highly entertaining. Many surprises and a few funny sequences with our beloved Specks and Tucker."}, {"rating": "5", "text": "Boo.\r Insidious: Chapter 3 is a prequel that takes plays years before the Lambert family experiences own haunting. A younger Elsie Rainier, still a gifted psychic, reluctantly uses her power to contact the dead when a young girl is targets by a supernatural entity.\r Well in Insidious: Chapter 3 we don't have James Wan on the directing chair this time but we do have Leigh Whannell directing this movie and he previous wrote the other Insidious movies and was in the 2004 film Saw playing a character. Now this isn't very new with a first time director who previously wrote movies, did stunt work, acted and people who did the soundtrack to the movie have taken the directors chairs and most of the time it can come off good, but also bad, and in this one it comes off average at best when it comes to film making and the film itself.\r Leigh Whannell who has worked with James Wan in every movie that James did and in this movie I think Leigh cough the tone of the other two movies just about right, I mean this movie isn't has scary as the first movie (In my opinion) because the first movie had that unsettling tone and it's brilliantly use of it's shots which are terrifying and sets up the first movie, yeah it can get a bit ridiculous at times even towards the end but still the first half was some of the most best suspense horror film in recent history. Leigh Whannell did a fine job directing this movie as it's not easy directing for the first time and he did good, at least he caught what made the other movies so horrifying and put he's own twist to it.\r The acting in this movie was alright for the most part. I thought it was better from some from horror movies I've seen so far this year, but the real stand out this movie was Lin Shaye as in this movie she gives a better and strong performance as I can see she really did care for this movie and I better the other cast members did too, but as I said before she was the true stand out of the movie as she did a excellent job.\r The movie does have it's scary parts and yes some of them involves jump scares, now listen you can hate this and the other two movies but you got to admit these movies take jump scares and at least do something with them and they use jump scares at perfect moments where the jump scare can be effective and actually make you jump with terror.\r Now for problems: All the positives for the film pretty much ends here as this movie really doesn't do anything new with storytelling and the movie is kind of predictable at times with it's scares and how it's going to end. The character's in the movie are pretty flat and I'm not going to remember them soon as I finished this review.\r The movie doesn't do anything new as I said before and overall it's kind of forgettable, I mean I won't remember this soon as the year comes to a close.\r Overall Insidious: Chapter 3 isn't a god awful horror film, but it's nowhere near great or even alright, it's stuck in the middle of not so good but not so bad."}, {"rating": "9", "text": "Insidious Chapter 3 is a very terrifying and a satisfying third entry to what has become a complete and very good Insidious Trilogy.This movie is way better than any other third movie in any horror franchise what so ever.\rIt has great acting,especially by Lin Shaye who gives one of the best performances of the year until now.Stefanie Scott does also an amazing job at the leading role and Dermont Mulroney nails it as her father.\rOverall the movie is very scary even tho it has jump scares they are real jump scares,not some nonsense but when you get scared it is for a very good reason with demons all over the place.And I also liked the way that the main demon looked and also Elise's story with her demon is very good and very well done until one point when she becomes a total bad ass.\rAs for flaws,the main thing that puts this movie down a little bit is that it doesn't explore much of the back story to where the main demon came from,as it should because that is why we're supposed to be getting a prequel.But the movie has chills and frighting scenes until the very end,where it ends with a wonderful and very well done scene.\rI really liked the movie even though I don't watch many Horror movies I love this franchise and I hope that they don't make a fourth movie just to cash grab because the three movies as perfect as they are."}, {"rating": "6", "text": "A little bit of fresh air in the franchise, the movie is acceptable, better than 2, but still easily forgettable. Its well constructed, well acted, but on the scare part; not so impressive... There is two or three creepy moment, but most of the time its only jumpscares and loud sounds. For those who enjoyed the first one, I have to say you will like the ending a lot."}, {"rating": "5", "text": "This is a really good film, i like this film because it physiological makes you think about the film and what the twist is. The bad thing about his film is how it drags out the scene and makes everything pop out, in some sort of viewing that what gives the film the story line."}, {"rating": "7", "text": "Definetly, Chapter 1 & 2 are way better than this chapter. This chapter is just a plain prequel of the first 2. Predictable ending but still apretty good movie. The story is so simple, it doen't give me a creepy feeling after watching  like what i feel in the past 2 chapters. Hopefully James Wan will direct the Chapter 4.\rChapter 1 is the scariest among the three\rChapter 2 has a very unique and good sequel, the story is very good and its very creative\rChapter 3 is a plain and pridictable prequel but still a good movie. I give it 7/10"}, {"rating": "5", "text": "2010 was the year that director James Wan (Insidious, The Conjuring, Furious 7) introduced us to as well as scared us with the film Insidious. By 2013 James Wan gave us a pretty good sequel by the name of Insidious: Chapter 2. Now, this year (2015) James Wan decided to produce a third film and pass the director’s chair to actor/director Leigh Whannell (Saw, Insidious Trilogy) who in my opinion did a decent job with this third installment Insidious: Chapter 3.\r The plot and vibe of the film is very similar to the previous ones. Insidious: Chapter 3 is definitely better than most horror movies that are released now a days but still are nothing compared to other James Wan’s horror classics, like the original Insidious, or The Conjuring.  The film involves seventeen-year-old Quinn Benner played by Stefanie Scott (Jem and the Holograms) who shows up to Elise’s (Lin Shaye) house seeking her help in order to contact her dead mother from the paranormal world. Elise tries to help Quinn but midway through her reading finds that things don’t go as planned. This is when Elise discovers that an evil spirit/demon is stalking Quinn.  As the film goes on we see how the demon does everything in his power to make Quinn’s life a living nightmare until he eventually takes her to “The Further”.\r Now, as for the characters none of them really made a good impression unlike the original. Along with the great original characters, the evil spirit and demons from the originals, made the films creepier and far more intense than this one. Sadly this time around everything fell flat and was ineffective or unsatisfying. The only person that made the movie for me was Lin Shaye (There’s Something About Mary, Insidious 1 & 2) who played Elise. Elise was a sweet surprise for me; she was the bad ass of the film. Some of her scenes made the movie far more enjoyable.  Her role expands far more than it ever did in previous films which I love. Here we learn from where she comes from and what she’s been through.   As for Leigh Whannell as an actor he did a great job embracing the same character that he portrayed in previous films. as for the director, he does a great job, especially exploring different themes within the characters like Quinn, and Elise.\r In conclusion Insidious: Chapter 3 is a decent horror film that has some great moments that allowed great characters like Elise to finally shine on screen. As for the scares, some are visually good scares that contain great imagery while sadly, the rest consist of jump scares that we have been seeing a lot of recently. With all that said it was obvious that director James Wan was not in the director’s chair, which made the film lack suspense and good character development. Because of this, the film ended up being enjoyable to watch but also forgettable.\r Final Score: 5.9/10"}, {"rating": "0", "text": "Diminishing returns on a franchise abandoned to whatever soundtrack scares go bump in the night and a premise wearing thin through each successive iteration. After the transgender hate crime of chapter 2, Insidious returns with a prequel that shifts our attention to another imperiled family. Though the entire film focuses on a convoluted teenage girl prone to occult spirituality as she mourns the passing of her mother and attempts to contact her spirit. Instead of slowly developing the web of relationships and anxieties between this new family we focus on the barely present stereotypical outlines of her perpetually distracted and stressed out working father and the pest younger sibling. Quinn becomes a quasi-maternal center in a family that resents or ignores her coercing her to seek the ideal dead mother who is defined by an interest in vinyl records and the adulation of her daughter (but nothing else). When Quinn calls out to one dead person, one with a more Insidious purpose responds. Sadly the presence of this \"parasite\" or \"demon\" or geriatric ghost in a hospital gown and oxygen mask is far from frightening unless the grim specter of aging is the greatest fear our generation possesses. Watching all three movies makes me question what laws govern \"the further\" (time is not linear as we saw in Chapter 2) there are malevolent spirits, demons and haunted places defined by trauma or violence (but was the red-faced demon in the first movie in the attic of the old house because of the murder that continued to haunt the house in the other realm or was the demon responsible for instigating that uncanny act, just like was the house of the Black Bride near Josh's childhood bedroom because of a connection made when he witnessed the death of the castrated old man?) I realize a supernatural horror film using astral projection as a plot point does not need to conform to logic, but the films are content with telling us a story we already know (like how Chapter 2 combines every gender confused serial killer from Silence of the Lambs to Psycho except with a domineering ghost mother that dresses like a Victorian Vampire and has a vicious right hook). This movie uniquely offers insight into the antagonistic relationship between the murderous Black Bride and psychic Elise and also fabricates a tragic background story about a spouses suicide, it also explains how she teamed up with the technologically savvy ghost hunters who added comic relief to the first Insidious though were less interesting in the second and were ultimately con artists relying on blogs and computer editing to establish a cult reputation as ghost chasers in Chapter 3. So if you are prone to jumping at loud sounds, are afraid of the elderly, find mysterious black footprints that climb the walls unnerving and have spared yourself from seeing the trailer in order to be genuinely startled by the limited soundtrack manipulation of this movie it is well within your rights to see it in the theaters. For those who are more reluctant to part with hard earned money, it will probably be on Netflix in a matter of months."}, {"rating": "7", "text": "Certainly scarier and more chilling, than the second one, \"Insidious chapter 3\", will leave you breathless at times and it will remind you, why you fell in love with this franchise, in the first place."}, {"rating": "6", "text": "\"Insidious: Chapter 3\" is a slightly good movie, the good point shows the one case that the character of Lin Shaye had to solve before the Lambert case, and that handling of the prequel was good. The story itself was good and the handling of terror was improving, although the characters did not show some impact than the previous ones."}, {"rating": "6", "text": "This review contains spoilers. It's a solid horror flick - the lead actress plays her role well, Dermot Mulroney is quality, and the older lady psychic is excellent, as usual. What I can say is that the final jump-scare a the VERY end of the movie is terrifying. Reminded of the old \"Quart of Blood Technique\" from 48 hours... You know that some scary is coming when they roll out an extended, benign resolution."}, {"rating": "10", "text": "Very dark and interesting story and I liked more than the first two, especially when it comes to the plot and how real life hardships are mixed with a dark story. i would recommend it I liked it."}, {"rating": "6", "text": "This trilogy is awsome ! After wating for decades for a movie that scares you without you need nausea bag while you watch the movie ! But I feel there was  no good screenplay that you admit that !"}, {"rating": "8", "text": "An okay horror-flick. It's an entertaining movie with some scary parts in the first half, some decent writing, good acting and good directing. The second half of this movie went a bit too far for me, but on the other side it also brought a lighthearted element to this paranormal thriller. Because I really think movies like this nowadays take themselves way too seriously. I was a bit disappointed in this movie's villain though; he wasn't fleshed out at all and was just there with no back-story being creepy and villainous.\rBut who cares, this movie was okay. It was a lot of fun, it certainly wasn't the best horror flick out there but I think it also didn't really try to be. This movie succeeded in how scary it was even though the story wasn't something new."}, {"rating": "2", "text": "I'm not a fan of horror movies and horror movies are not my type of movies. In this prequel, we learn that scaring people has became cheesy and clichéd during 97 minutes of movie time."}, {"rating": "10", "text": "This is the SCARIEST FILM IVE EVER SEEN! It's terrifying to the bone and will keep you up with the lights on, and I hope there's going to be a chapter 4! It gives you a reason to love Blumhouse, and is worth time, money, and you might need some extra pair of underwear :)"}], "recommendations": ["ouija_origin_of_evil", "the_conjuring_the_devil_made_me_do_it", "insidious_chapter_2", "sinister_2", "the_conjuring_2", "insidious_the_last_key", "lights_out", "the_conjuring", "the_woman_in_black", "annabelle_comes_home", "it", "scary_stories_to_tell_in_the_dark", "dark_skies", "the_ring", "annabelle_creation", "it_follows", "the_babadook", "happy_death_day_2u", "the_prodigy", "the_haunting_in_connecticut_2_ghosts_of_georgia", "the_possession", "the_black_phone", "scream_2", "final_destination", "annabelle"]}