{"id": 1152, "title": "Insidious: Chapter 2", "starring": ["Patrick Wilson", "Rose Byrne"], "runtime": 106, "genre": ["Horror", "Thriller"], "description": "The haunted Lambert family seeks to uncover the mysterious childhood secret that has left them dangerously connected to the spirit world.", "releaseYear": "2013", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/chnxUtTmTRZh5FE7Ha4aUOZ9ahs.jpg", "categories": {"plot": 5.229166666666667, "acting": 5.40625, "ending": 5.571428571428571, "soundtrack": 5.4, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.090909090909091, "action": 6.75}, "reviews": [{"rating": "6", "text": "Honestly, I feel like they put a lot of thought into this story, they just weren't amazing at telling it. Some things happened so abruptly that I had to ask my fellow movie goers how they got from one place to the other. There are too many spirits to focus on, that look alike, and I don't know which spirit is possessing who, and who is actually dead in the further, and apparently you can time travel while in the further, and it was just sort of confusing. I feel like they made things up mid story just to make the story tie in and work. The acting on Rose Byrne's part was good, and for a lot of the part I thought Patrick Wilson was decent as a possessed guy... until the end it got kind of cheesy. I've seen this film twice now, and the first time I thought it was scary, the second time not so much, which just goes to show that a lot of the scares are because of the unexpected, rather than because of the unknown and wonder. The horror flicks that mess with your mind are the best kinds, like the Blair Witch Project, Paranormal Activity, etc. This was watchable, for a horror sequel it actually wasn't bad... the music volume has GOT to be lowered though. Good lord."}, {"rating": "5", "text": "This film was as good as the first. Horror films lately to me haven't been putting me on the edge of my seat. It seems that all horror comes down to nowadays  is around 2 scares out of it. Nothing felt original in this movie and more or less felt like a remake with scares from the first one. Even the order of events were the same, \"scares\", arguments, \"more scares\", arguments, get professionals, more and more \"scares\", into dream, and more \"scares\", end. And these scares we've seen way too many times in horror movies and it's time to grow up and think of something new. People around me and my friends were jumping out of their seats and I'm sitting leaning on my hand like \"Really?\" If you scare easily and are a novice to horror movies, I guess you'll get the experience more than I did. But if you're not scared from dark corners and jump scares, which was basically what this movie was like, then I suggest giving it a miss. People will disagree and say the build up in music tenses you. Sure for the first time it happened, not for the 10th time in a row. This feature felt as though it was getting shoved down my throat and I'm getting bored of it. This movie did have a few chuckle moments in it even though they were quite funny. I was honestly hoping it to be a good scare and not be able to sleep last night, but I slept absolutely no bother. Also, at the beginning it shows Elise when she was younger and they dubbed her voice in with the actress that plays her. It was a really lame part of the movie in my opinion. Although, the good things I can say about the movie was that the ending was good and the acting was very believing.\r Good Points:\r +Good acting\r+Better story than the first\r+Thumbs up to the make-up and props\r Bad Points:\r-Barely frightened or scared me\r-Too predicable\r-Dubbed over voice of Elise\r-Brought nothing new to the horror genre\r-Jump scares are not scary\r-Followed the same timeline of events as the first one\r To me, this a miss. For novice horror movie fans, go ahead you'll probably get a scare. But tough horror movie fans like me, you'll find yourself being more entertained by watching novices  themselves.\r 5/10."}, {"rating": "5", "text": "Let me just start off by saying that I am not a fan of scary movies. Jump scare scenes freak the crap out of me, but I managed to make it through Chapter 2, without peeing myself. That's both a good and bad thing, clean boxers, but a sub-par movie. Not seeing the first installment, I can tell you that the movie made full sense to me, and others in the same scenario. The film managed to switch between present, past, and future, which made for a touch I usually don't see in movies, especially without a lot of plot.\r I felt more like I was watching the cast walk through a haunted house, then a scary movie. Let’s be honest here, when you see a house in a scary movie, it looks nothing like a “real” home, especially for a family. The acting in the film was absolutely terrible, and it was more funny then scary, because you could tell the cast was \"trying\" on screen. It also did not help that the script lacked creativity too. Most scenes had a false sense of urgency, which made the characters show fake emotions. All of these factors added together, made for an extremely predictable, overhyped movie.\r Along with the acting was the same exact song track that would start every time like 10 seconds before a jump scare, so it was obvious to be ready for someone popping out of something. The scary part for me was the editing flaw. I would see a metronome, or a plant in one scene and a minute later when they would cut back it would be gone, or a Macbook Pro sitting next to an old tube TV, and film camera. It reminded me of a Paranormal Activity, more then as if it was its own film series. Picture two for example, was already done in Paranormal Activity 3, and the main actress (Rose Byrne) reminded me of Julie (Lauren Bittner in Paranormal Activity 3), all the way down to the hairstyle.\r (SPOILER) What no film critics seem to be talking about in their reviews was how main character Parker Crane as a child was a reluctant transvestite. Portrayed as a little girl in aspects of the film, he ends up pulling a wig of his head. His room filled with girly items, later reveals that his mom (picture one) wanted a girl named Marilyn. (END SPOILER)\r After discussing with others who have now seen both films, many were disappointed with the lower amount of scary scenes shown. I think they wanted to make it more about the family in this film, and (LITTLE MINOR USELESS SPOILER) as all scary movies do; we were left with something to think about, obviously letting us know of a Chapter 3.\r Basically, if you are a fan of the Insidious', then go see Chapter 2. Other than that, it was a crap movie, with a bad script, terrible acting, and predictable scenes. Definitely save your $9.50 on this one and borrow the DVD from your friend in a few months, when you’re looking for a scary movie to watch a year from now."}, {"rating": "3", "text": "One of the most lazy and unthoughtful films I have ever had the displeasure to see. Is it a horror film? A comedy? A family drama about redemption? I wish I knew. The film is constantly trying to fit all of the above categories into a film that is so conceited that it leaves you feeling disoriented and annoyed. The movie isn't fun; and it isn't scary either. All of the thrill and scares that the movie tries to bring in come from cheap scares that come from overly loud sounds and somewhat disturbing visuals. The plot makes no sense; even after seeing the first one when it came out, I was left wondering what I was watching. The characters are flat; it's almost as if the director and writer didn't even try to come up with something original. The climax to the film is a weird mixture between The Sixth Sense and The Shining that left me bored and slightly shocked that someone could be so unoriginal. Patrick Wilson plays the only redeemable character in the film, but James Wan's directing is so bad, that Mr. Wilson comes off as a second rate Jack Nicholson from The Shining... only without everything that made The Shining so good.\rUnless you are a fourteen year old and feel like getting some cheap thrills off of your allowance money, or you're an adult and like my friends, drink booze during the film, you're not going to enjoy Insidious: Chapter 2. I wish I didn't pay full price for this. I wish I didn't even watch it. Horrendous film making; It saddens me to see the horror genre fall to this, and see people give high ratings to a movie as lazy as this."}, {"rating": "6", "text": "It doesn't live up to James Wan's previous works like The Conjuring or the first Insidious, but it still manages to provide a somewhat entertaining experience even though it does lack fear. The music and atmosphere are still creepy, but the film ends up relying too much on lame jump scares that failed to elicit any sort of reaction. The film also ends up being intentionally funny at times. All of these flaws really should have killed this sequel for me, but there's something about this film that did keep me thoroughly entertained throughout.\r I really enjoyed the continuation of the original film's plot and I liked how it added more details as to what was going on, even if not everything is as well explained as I would have liked. This movie ends up feeling refreshingly self aware, using it's goofier characters to its advantage. I was never scared but I found myself enjoying the film despite that. It's kind of like a haunted house at a carnival or something. You go into it with a couple of friends and end up having a blast and getting more than a few good laughs at just how not scary the whole things is.\r I ended up enjoying this throwaway sequel to one of my favorite horror movies just because it was a sequels to one of my favorite horror movies. If you liked the original then you should like this one for the same reason I did. It might be throwaway and lacking in any sort of scary moments, but if enjoyed the first then you should give this one a look. However if you didn't watch the first then this isn't for you, as you'll probably just view it as another one of those lame, non-scary horror movies that just end up being a waste of time, rather than the goofy, thrill-ride continuation of the first movie that it is."}, {"rating": "6", "text": "There is something more frightening than any curse or apparition that resides in movies; it is the blight of terrible sequel, and Insidious: Chapter 2 is haunted by it. Audience would come and expect the same terror from the original, but sadly will only find inferior version of it, a formulaic possession horror flick with little charm and plenty of high pitch noises. To its credit, it does bring some good acting and direction. The script also works as a continuation, but perhaps because the mystery has dwindled; it only manages to be an average horror without the same chill its predecessor has.\r Story follows the events of Insidious where Josh Lambert (Patrick Wilson) returned with his son from the Further, an astral realm. However, an entity is believed to be latching onto him as the clairvoyance Elise Ranier (Lin Shaye) is found dead near him. His family grows restless from the apparent continuous haunting and ultimately tries to solve the problem despite the grim obstacles ahead. The plot is rather bland, there's simply a lack of tension as the terrorizing entity is somewhat predictable and plastic.\r Patrick Wilson delivers a good performance, he displays more variety of emotions to establish the dread. In some scenes he gives off cold enigmatic feel to puzzle the audience. Returning cast reprise their roles, Ross Bryne as Renai Lambert does a fine job, although her display of motherly concern at the first title was slightly better. The two ghost hunters are back, this time for more comedy relief than anything. There are probably too many humorous scenes, some are unintentional, in this sequel.\r Its use of music is cringe-worthy, in fact even with only the sound, it'd be quite terrifying. The scares don't have the same weight though, as they are reduced to simple bursts rather than real frightful ones. James Wan's camera angle is great; he casually makes the viewers think there might be more in scenes than there really are, especially with a hint of contrasting color, shadowy background or some objects in outer peripheral vision.\r The movie does poorly when the mystic of its entities is unveiled. Getting into fisticuffs with ghosts diminish the atmosphere since they seem unreal, part of me inadvertently immediately knew it's just make-up and sound effect put together for an illusion. Take away the jarring build up, replace it with mediocre possession scheme, even if the directing is well done, and you'll have a subpar sequel. It still performs its scare tricks decently, so at the very least it'll make you flinch a couple of times."}, {"rating": "4", "text": "The original \"Insidious\" on its own terms works well enough, but its repetitive, unimaginative sequel clearly verifies that director James Wan is overextending in the name of continuing a franchise. \"Insidious: Chapter 2\" isn't a total disaster, but it is a disappointment when compared to the first installment, and Wan's most recent success with \"The Conjuring\" (2013). Despite some clever plotting, interweaving the film's second half with events from the original, it simply lacks tension and falls short on scares.\r The opening prologue set almost 30 years prior, gives us a shadowy realm called the Further. In this place, the souls of the dead who refuse to accept their fate, and wander around searching for a way to reconnect with the real world. Following the prologue, events pick up right where the first movie ended. Josh (Patrick Wilson) has just rescued son Dalton (Ty Simpkins), whose spirit form had traveled away from his physical body, and is now trapped in a dimension not meant for the living. In their return to the real world, however, the same spectral presence that terrorized Josh as a child  an old lady wearing a black veil in a wedding dress, has followed him back.\r With the present-day Elise (Lin Shaye) found strangled to death, Renai (Rose Byrne) cannot curb her intuition that husband Josh might have had something to do with it. She trusts him and doesn't believe he'd be capable of murder, but when she looks into his eyes she no longer recognizes the man she married. As forensic sends away tests on fingerprints, the Lambert family go to stay with Lorraine (Barbara Hershey), hoping the worst is behind them.\r What made the first film creepy and chilling is now all familiar material, and the addition of a back story infused with some artificial conflict isn't nearly enough to compensate for its lack of suspense. The storyline lacks structure leaving the movie noticeably uneven, and the plot ultimately becomes tiresome and convoluted. The ending is your typical, predictable sequel conclusion to keep the franchise going after Wan's exit. Inevitably, \"Insidious 3\" is only a matter of time, and it will continue to stretch a story that doesn't have much else to say."}, {"rating": "3", "text": "As a fan of the original, I have to say that this one was a let down. So much of this movie makes no sense and characters do a lot of stupid and nonsensical things where as nothing of the such was present in the original. It's also not nearly as scary as the first. The directing, the editing, the writing, everything seems vastly weaker in Chapter 2. I hate to be that guy who says \"It's a bad horror movie sequel to a masterpiece\" especially because I usually don't feel that way, but this time it is the case. Insidious 2 is not worth paying to see, or at the very least is only worth a one dollar rental. At the very least, you'd probably just be better off rewatching the original."}, {"rating": "10", "text": "James Wan and Leigh Whannell's Insidious Chapter 2 fully delivers in terms of exploring the mysteries left behind in the previous installment, while also expanding on its intriguing mythology. However, the sequel also embraces the first film's quirkier, campier aspects, which makes for a few good laughs, but also some less-than-terrifying horror sequences. It's an excellent horror piece to swivel into the spiral of its previous film."}, {"rating": "7", "text": "I like the first one a tad more, but this film is still a lot of fun.  I know James Wan is moving on from the horror genre, but I hope not for good the guys got a real talent with making films that mixes scares with a solid sense of humor. B+"}, {"rating": "1", "text": "If you are not a fan of the first movie, don't bother. This movie is extremely cheaply made and really formulaic and unexceptional.  Where I live in england they have a trailer showing the audience screaming at the shocks, to try and get you to go... a technique which works well... unless you look closely and realise the audience members screaming look like 12 year old girls.  Really not one at all for any adult over the age of 20 unless you are really really bored."}, {"rating": "10", "text": "Considering this is a sequel and sequels are usually rubbish, James Wan does a brilliant job of taking us straight back into the action and exploring the universe he's created in even more depth. If you loved the first film I'd be very surprised if the second one doesn't hit home. Another visionary masterpiece from the best horror director around right now"}, {"rating": "10", "text": "I really enjoyed this movie.  I was so scared I was shivering!  A nice continuation of the story.  I definitely recommend to anyone who enjoyed the first one.  I'm no movie critic but I can say I was very entertained."}, {"rating": "10", "text": "When viewed as a continuation of the first installment, Insidious: Chapter 2 is seamless. There are jumps and gasps galore, a haunted hospital, the proverbial \"woman in white\" ghost, and an interesting subliminal message about domestic violence. What's not to love?"}, {"rating": "8", "text": "Especially for a sequel, Insidious 2 is really quite a success. I enjoyed it a lot, and so did the person I went with. The whole theater jumped at several points, myself included. Great job, James Wan."}, {"rating": "4", "text": "What a disappointment. This is one of those films that focus more on storytelling than actually making it enjoyable. Unlike the first film, almost all scares were predictable, it wasn't creepy, it wasn't that suspenseful, and it had only ONE effective scare. I can't believe I wasted $16.00 to contribute to its box office money."}, {"rating": "8", "text": "its nice chance to see another part from Insidious..as we rarely find good horror movie these days..some people don't like old lady but she is or he really scares me with that over makeup ..best of luck to part 2..we are waiting a lot"}, {"rating": "7", "text": "It may not be better than the first one, but there are a few good scares. I enjoyed how it explains a few unanswered questions from the part one. Still better than a lot of current horror films"}, {"rating": "3", "text": "This movie like the other one isn't scare at all, sometimes is ridiculous, the story just like the other one doesn't make sense  sometimes, it has the same mistakes than the other one, if you doesn't like the other one do not expect that one to be better..."}, {"rating": "9", "text": "Chapter 2 will surely be a greatest hit on this years scale.\rI went to see this movie expecting a lame chapter 2 like most movie make but it really surprised me when I got there. I jumped and loved this part 2. Al though the sounds are a bit...bad...I still loved this movie!\rI recommend this movie to anyone."}, {"rating": "8", "text": "Insidious, Chapter 2 takes a lot of effort to enjoy this creepy, fun, and scary. Much like the first one, this sequel has some few good scares and other was weird backstories with complicated sets that are too silly, but it's a worth to enjoy!"}, {"rating": "9", "text": "I just came back from the theatre and I cannot express enough the genius of James Wan and how he directed this film. It's weird at first because it seems to start slow. After 20 minutes I started asking myself whether I wanted to continue to sit through or get up and leave and wait for the bluray version, But, DON'T LEAVE! It starts connecting and leading the viewer to places you've been familiar with in the first Insidious. Scarier..... about the same. Eeery..... just as much as the first. More screams and bumps in the night..... Definitely! And, this one even has some comedy from the ghost hunters. So glad I watched this and will be buying it when out on bluray!"}, {"rating": "7", "text": "It may not be as good as \"The Conjuring\" or even the first \"Insidious\" movie, it is still a pleasure to have some good old fashion scares. Overall, a surprisingly good sequel. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies."}, {"rating": "10", "text": "How rare is it that a sequel is better than the classic hit it's based on? Pretty rare, but Insidious 2 gets everything right and even enhances the original, which is just what a good sequel needs to do. It explains just about every single thing that's happened and why, which is a definite plus for this kind of stylistic movie. The secondary antagonist from movie 1 becomes the primary in this follow up, which isn't surprising, but watching it happen was freaking awesome. Not many movies can hold your interest like this one and its predecessor."}, {"rating": "8", "text": "A less scary but a well pulled off sequel to one of the best horror movies of the decayed. A expansion in a rich story, excellent script and a all round out standing performance. Something not so easily pulled off in horror movie sequels. Worth your time and money can't wait for another!"}, {"rating": "7", "text": "I was hoping this would be better, and creepier then the first movie but sadly it wasn't barely anything was creepy and it relied too much on jump scares. But I do like how they explained what happened in the first movie, and the beginning of this one and I loved Patrick Wilson's acting it reminded me of Jack Nicklaus from the Shining."}, {"rating": "7", "text": "Insidious: Chapter 2 wasn't as scary as The Conjuring and it's predecessor, but I still had a lot of fun watching the movie. It continues where the first movie left off and from then it's a ride of mystery, scares and some laughs. The movie wasn't really that scary like the first one but some scenes still gave me goosebumps and chills. When an intense or horrific scene is happening at the moment, a comedy part was involved and I found that a bit weird. It was a bit weird for me, because some of those scenes were really intense and adding a funny tone to it just doesn't really help. There were plot points that I found really interesting and those things kind of overshadowed the main genre of the movie, horror. It was really interesting that this movie was connected to it's predecessor but I still wanted scenes that would really convince me to leave the theatre. James Wan still did a good job with Insidious: Chapter 2, even though it didn't beat it's predecessor. I am going to give Insidious: Chapter 2  a 7/10."}, {"rating": "4", "text": "I really hate to say it, but this movie was so disappointing. I expected the same, if not more of the same type of scares I got from Insidious. The acting was a bit turgid  most of the plot was sort of cheesy. The scare sequences are predictable and boring. However, I do admire the fact that it was made under a small budget and became so successful commercially. I also admire the fact that the crew shot the movie sort of like an homage to 1970's and 1980's horror films, camera wise. The music is also spine tingling. But other than that, it's just a disappointment. I'm sorry to be so harsh but it wasn't what I thought it would be. I felt like I was in the theatre like 4 hours because of how long and drawn out it was."}, {"rating": "10", "text": "This movie and the previous movie did a great job.It has a reasonable state of each events. Like director wan is focused on the flow of each events. He made it clarify and clear for the audience how it is happened, why is it happening, how it happened. Normally, we can see that the movie has many repetitions but that's because director wan wants us to understand each events. While I'm watching this chapter 2 I said to myself that \"Oh,so that's why\". As your fans, we are expecting an another chapter from this movie. In the end, we can see that there's another entity again, if you really deep understand the story you will feel that there is still something wrong and like it is not done, there is still something that we don't know. I don't know if anybody feel that. Overall my ratings would be 100% excellent movie."}, {"rating": "7", "text": "Insidious: Chapter 2, fue creada en una época donde las películas de terror son una verdadera porquería y no se toman en serio, es por esta misma razón y por muchas otras como por ejemplo, un buen argumento e interesantes giros de trama, momentos de suspenso que tortura la mente del espectador para esperar lo menos esperado y muchas escenas perturbadoras que producirán a los que no están acostumbrados a este tipo de películas, varios sustos incontrolables. Si se hubieran esforzado un poco más en la distribución y desarrollo de personajes, la película quedaría espléndida, pero, por ahora me gustó aún más que la primera parte, y algunas de sus escenas te perseguirán hasta lo más profundo de la noche cuando estés durmiendo."}, {"rating": "8", "text": "A definite improvement over the first one. Even thought that was a good film. Contains a strong use of jumpy scenes with build up of tension. The was the film goes back and forth in time to make sense and fulfil un explained answer later on in the film seemed very clever and keeps the viewer engaged.\rA definite watch for horror fanatics"}, {"rating": "10", "text": "James Wan shows us an amazing sequel!  Insisdious: chapter 2 was an excellent movie, full of scares and ghosts, I really enjoyed this film. It was better than the first one  more action  suspense and horror/humor :P"}, {"rating": "5", "text": "obviously no where near as good as the first one but it wasn't that bad, the friend I was with, really enjoyed it, I wasn't so impressed. felt as though the writers were trying to fit so much in when it simply wasn't possible. don't make another"}, {"rating": "8", "text": "this is the most dumb thing that they could ever do make a another insidious . i thought the sequel what stepped up a a little bitt but it is not that fun . i hope they end insidous 3"}, {"rating": "8", "text": "Insidious: Chapter 2 es una película con un argumento interesante que explora conceptos poco usados en el cine y los convierte en una buena película de terror."}, {"rating": "8", "text": "First of all, I DARE YOU TO WATCH THIS FILM BY YOURSELF IN THE DARK!!! Survive that and your critique would be taken seriously. lol. Whoever said that this movie is a disappointment, cannot deny experiencing some flinch-in-fear moments, that they aren't proud of. lol. C'mon you've gotta admit that this film was pretty good, as far as scary movies go. I mean, if you search for the top scariest movies, you'll come across old \"not really scary anymore\" scary films with bad special effects."}, {"rating": "5", "text": "Insidious (1) had a unique premise mixed with some established horror scenarios.  For the most part atmosphere was great and the characters were well created, written and acted.  I didn't feel the film needed a sequel or sequels, but I watched Insidious Chapter 2 out of curiosity.\r The opening scene was interesting and set up parts of the origin story and continued where the first film left off.. however it then immediately fell flat after the opening credits.  The wife's character suddenly went from being a strong but terrified woman out of control and scared for her family with knowledge of something horrible from the first film's last scene, to a weak and pointless character that seems to have forgotten anything she learned from the first film and simply became a plot device babysitter while all the other adults were busy.\r Patrick Wilson's character turned into a cliché bad guy that had none of the threat or complexity the first film had set up, and the children, as like the first film were mostly plot devices that really serve little purpose than to offer a couple of jump scares.\r The main characters of this film are really the supernatural detectives and even they don't seem as well written or as interesting as they were in the first film.  I actually found the entire first hour of the film (post credits) extremely mundane and boring, with the film only becoming interesting again after that hour mark, wherein it establishes more of the origin story and then proceeds to offer some interesting and memorable scenes that really don't justify the film's existence.\r For some reason handycam footage is inter-cut into parts of the film, and atmosphere is really fairly weak in the movie, relying much more on jump scares this time round than in the previous 'chapter'.\r I feel like this movie could've been more if it had had more time spent on the writing and didn't tread on the toes of the original film so much (there really is very little new in this film).  The best parts of this film where when it directly intercut with the original film, as suddenly you understand a bit more of what's going on in the mysterious scenes of that movie, but personally I like mystery and would've been happy never seeing this sequel.\r Personally I'd recommend against watching this film unless you really don't mind redundant sequels, and look out for the cup-and-string scene on youtube somewhere, as that really was the only original thing I saw in this film."}, {"rating": "7", "text": "A satisfying horror sequel from the director of 'Saw'. As a second installment to 'Insidious', it went deeper into the behind story of a character of the movie. Yeah, the first one was told about a boy's special talent astral projection where he can travel to another world in his sleep. I considered that was the movie's advantage but comparing to this, they just implemented the same idea with neglecting the boy. In this movie it describes more about the father's perspective of the story without held back the much required secret for the twist at the end.\r It opens with a story that set in 1986 where Josh as a kid is haunted by the souls of dead. Soon the story commence on present time where the Lambert family begins to feel again the presence of evil forces in their house. A team of spiritual medium begins their part to expose and free the family from dark forces. I thought the spiritual medium characters Elise and Carl is imitating the dwarf woman and an Indian characters from 'Poltergeist' movie series. I can say director was a clever, he just put away the usual ingredients of the horror genre and added different flavours like time travel and psychology.\r For adults, most of the horror movies won't scary but watching during night will give more effective. So it a such movie you should try at a dark time for your own advantage to extract from it a better entertainment. I liked the first movie and this one is not far behind with the quality that all horror movie must have. So felt it is a decent follow up with a flashback story."}, {"rating": "2", "text": "After spending 105 minutes with this film, I can honestly say I have no idea what was achieved. Too dull and predictable to take seriously and guilty of plagiarising from not only the first instalment but every competent horror film made since Psycho. It's worst crime however is adversely affecting how we see the first film which was far superior. Yet, despite it's incompetence, Mr Wan has the audacity to end by setting up Chapter 3, we can only hope for a short book."}, {"rating": "6", "text": "Well definitely entertaining, maybe in the wrong categories a few times. Acting is still good, creepy is somewhat still there in like the first half. The story is interesting, the directing is perfect. I don't know it just  didn't make me jump more then 2 times. Hell that's still 2 more times then The Conjuring and Paranormal Activity (1-2-3-4). See it with your friends or 3+ people for a good times, other then that, it's not the best."}, {"rating": "4", "text": "Insidious Chapter 2 is a solid follow up to it's predecessor the 2010 low budget but highly successful film, Insidious. It might be not as good as the first one, but it was up to the creep level and style of the first, with low budget considered to other horror movies, James Wan shows us what he can do with such budget, he knows where to spend money, considering that he spent a little bit more on this film. Insidious Chapter 2 has that 90's vibe to it although it is original, with SOME ideas never used before, but still there is some cliched stuff and predictable jump scares, but what is funny that you know it is coming and you know what will scare you but you still jump. The acting is good, the tension is solid at times, the effects are really good, but at most  of the time it falls apart, and somehow it becomes dull and predictable. Is it better than recents (The Conjuring, You're Next)? NO. Is it worth checking it out in theaters? For the scare yes. Is it worth checking at all? if you are fan of the first one, if not I recommend The Conjuring, which is ten times better and scarier, it received an R rating for just being scary for God's Sake!"}, {"rating": "6", "text": "Other than a few decent creepy moments, I wasn't the biggest fan of the first one but I found I enjoyed this one.  Although the film is one giant collection of unimaginative, cheap \"jump\" scares, this sequel is spooky as James Wan crafted a very creepy and unsettling atmosphere with the film.  This one also worked in the comedy element better than the previous one (last time I felt the comic relief was grating and out of place) and the story is very good...I especially enjoyed how creatively it connected the two films.  While it's not the best horror film out there, it still is far superior than most horror films released."}, {"rating": "1", "text": "Very stupid, tedious and generally nonsensical movie. Every screamer and \"scary moment\" are predictable and those make you rather laugh, than scare. I regret watching this and advise to avoid as plague."}, {"rating": "7", "text": "Never seeing the first installment, I was able to understand this second installment without watching the first.  This movie to me felt like a mixture of The Sixth Sense and The Others.  This installment goes into detail and explains what happened in the first chapter and why it was happening.  Throughout the movie you never loosen  up because there is always something that has you in suspense.  In my opinion the make up effects could have been more scarier.  It doesn't contain any gruesome killing, foul language, or nudity which I know some parents may want to know before letting their kids watch it."}, {"rating": "8", "text": "I'm a really big fan of James Wan and the first Insidious. I thought it was one of the best horror films to come out in the past decade, so needless to say I had really high expectations for Chapter 2, but to be honest, I came out kind of disappointed. It wasn't a bad movie at all, it just wasn't anything special. And seeing this after The Conjuring (which took the first Insidious' place as my favorite scary flick of this decade or so), just made me feel very underwhelmed. It felt a lot more like a thriller than it did a horror movie. Theres wrong with that, but its not what I was expecting. The acting is just as good as it was in the first, but the actual film wasn't as suspenseful or scary as I was hoping. And cheap jump scares don't make a movie scary."}, {"rating": "4", "text": "Wan's second chapter to the 2010 horror hit film Insidious is disappointingly less scary, less intense, and loosely-scripted. The story here is confusing and incoherent -- you don't exactly know who is the real antagonist ghost here. A bad sequel but still acceptable."}, {"rating": "6", "text": "It lacks scares and falls short of the first movie but otherwise, Insidious: Chapter 2 delivers a solid narrative and good acting to compensate for it."}, {"rating": "5", "text": "This film was so much less than the first film, not as creepy an atmosphere, unnecessary comic relief that felt so campy and badly executed. The story was wrapped in a rather cool fashion but some things were still kind of unexplained, along with plot conveniences making a frustrating watch. It's still kind of enjoyable but far more like a typical jumpscare fest film. Missable."}, {"rating": "8", "text": "One of the best horror sequels, if not the best horror sequel ever and one of the main reasons for that is because unlike most horror sequels it is original and scary.\rAnother good thing about this film is that it ropes you in at the beginning by picking up from were the first one left off and throughout the film it explains a lot about the first one, for example it explains why the ghostly old woman decided to haunt Josh.\rLike the first one this film focuses on the Lambert family, who are now trying to find out who or what killed Elise (Lin Shaye.) And they also soon find out that the ghosts that were haunting them in the first film aren't done with them yet.\rBut even though at first the film builds up suspense and gets more scary at a very fast pace, towards the last half hourthe film goes a bit downhill and tries to focus more on action than on horror, which I thought wasn't a very good idea. Another bad thing about the last half hour is that at times it got a bit confusing and a bit hard to follow.\rI think my favourite part in the film is when Lorraine (Barbara Hershey), Specs (Leigh Whannell), Tucker (Angus Sampson) and Elise's friend, Carl (Steve Coulter) are trying to find out more about the old woman thatis haunting Josh and they go to her old address where she lived when she was a child. I like this scene because it keeps you on the edge of your seat with a mixture of action, horror and suspense. I thought it was particularly suspense-filled in one bit were Specs and Tucker find a mysterious little girl in one of the bedrooms.\rI would recommend this film to people who liked the first Insidious and to people who like horrors that will make you jump out of your skin. And I would give this film an 8 out of 10. And if you asked me to choose between Insidious and Insidious 2, I don't think I would be able to choose, they're both as good as eachother."}, {"rating": "8", "text": "Insidious: Chapter 2 is a direct follow up to the first one. If you haven't seen the first I strongly recommend you see the first before you watch this one. Insidious 2 follows up directly after the end of the first movie. It starts with same tone the first one ended with so I was instantly intrigued by it. I am also a massive fan of the first one so my expectations were pretty high going in. I was not disappointed with this at all. This was a very similar style to the original and still had all the elements that made the first one so ground-breaking. For a horror movie, the story is incredibly interesting, something the first movie didn't quite have. It was directed by James Wan, who is now an established director, especially for horror with movies like The Conjuring, Saw and Insidious. James Wan is fantastic at building suspense and using it at the right times to scare the audience. The performances are great in the film as well, especially from Patrick Wilson . His performance in certain parts of the movie reminded me of Jack Nicholson in The Shining. Rose Byrne was also pretty decent but this was Patrick Wilson's movie. I also really liked the way James Wan films his scares and suspense scenes. His style is very unique and extremely effective. He uses a lot of make-up and practical effects rather than CGI which I enjoyed as well.\rFinal Score\rActing-7/10-- Patrick Wilson is really good, but it is a horror movie so nothing major\rPractical Effects-8.25/10-- Make up in the movie was really good\rScript--7.75/10--The script is very clever and doesn't follow typical horror movie formulae.\rOverall Score\rInsidious:Chapter 2--7.7/10-- A very solid horror movie, especially for a sequel can't wait for a third instalment."}], "recommendations": ["dark_skies", "sinister_2", "insidious", "annabelle", "insidious_chapter_3", "malignant", "the_grudge_2", "the_possession", "dead_silence", "insidious_the_last_key", "the_amityville_horror", "the_ring", "the_grudge", "devil", "countdown", "the_conjuring_the_devil_made_me_do_it", "happy_death_day_2u", "the_conjuring", "chernobyl_diaries", "the_haunting_in_connecticut_2_ghosts_of_georgia", "final_destination", "poltergeist", "the_strangers_prey_at_night", "the_boy", "it"]}