{"id": 1124, "title": "Insidious: The Last Key", "starring": ["Lin Shaye", "Angus Sampson"], "runtime": 103, "genre": ["Horror", "Mystery", "Thriller"], "description": "Parapsychologist Elise Rainier and her team travel to Five Keys, NM, to investigate a man’s claim of a haunting. Terror soon strikes when Rainier realizes that the house he lives in was her family’s old home.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/nb9fc9INMg8kQ8L7sE7XTNsZnUX.jpg", "categories": {"plot": 4.5, "acting": 4.666666666666667, "ending": 5.3, "soundtrack": 6.5, "cinematography": 5.5, "familyFriendly": 4.714285714285714, "funny": 4.3, "action": 5.5}, "reviews": [{"rating": "8", "text": "It's not as good as the first two parts, but the first two parts are a masterpiece. However it is still better than the third part. I think it will be one of the best horrors this year. In the context of current horror production, it is an above-average work. If you want to enjoy the movie, you will enjoy it. If you look for subjective mistakes and compare with the first part, you will write unnecessarily negative ratings. I like Insidious series and I left the cinema satisfied."}, {"rating": "7", "text": "The absence of either James Wan or Leigh Whannell at the helm can be felt. Both still remain connected to their hit horror series with writer and producer credits, but this time the directorial duties have been taken up by Adam Robitel. Who, despite having made a well-received horror debut back in 2014 with The Taking of Deborah Logan, makes some very rookie mistakes.For one thing the lighting is too bright. It robs the creepy new antagonist of terror and prevents Robitel from being able to achieve the same tense atmosphere as his predecessors. Whatever unsettling little flourishes there could have been from the main demon such as the scenes that make eerily playful use of it's freakish hands are ineffective as it looks too much like someone in a rubber suit.Insidious fans need not worry too much though as some of the series' greatest strengths are still intact. Such as it's silly sense of humor, strong lore, and likable characters. The character of Elise might just be one of the best things Wan and Whannell have ever created. Of course this is largely due to Lin Shaye's performance which is a mixture of selfless bravery and inner struggle. The story dives into her tragic backstory and has a strong emotional component as a result as well as a few cheesy sweet/touching moments. Because of this I was able to enjoy the movie even though the horror side of things was sometimes sorely lacking.Being that this is a prequel story there really isn't any tension. We already know everyone is going to be okay. Instead The Last Key's appeal comes from how it further fleshes out one of, if not the, best protagonists in modern horror. Even if it comes at the expense of the antagonist who we never get to really understand. I'm definitely ready for the Insidious series to pick up where Chapter 2 left off, but this was a decent way to hold me over until it's finally decided where the franchise will go next.7.2/10"}, {"rating": "7", "text": "While i won't say the movie is the best in the series, I do have to give it praise for being above average. The story was well told and was enticing and kept me watching to see what happens next. The movie was a mixed bag of some comedic moments and some nail-biting moments. Overall the movie was worth going to see but felt more like a filler than an actual movie and that filler was to tell the story of elise which we didn't have before. One thing notable is how it connects to the other movies and with that I can't wait for the next one. I would say go watch it!"}, {"rating": "6", "text": "Earlier this week, I had the pleasure of seeing #Insidious The Last Key and I'm pleased to share that it's much better than it could have been in the hands of filmmakers simply trying to string together cheap scares to bring in teens. It feels like a solid series finale of a television show, in the way that it worries more about the character work and relationships than the horror aspect. This makes for some sappy moments, but at this point, I'm a sucker for the further adventures of this crew. This is a fourth entry for crying out loud.I will say this is one mostly for fans who already love Lin Shaye as Elise and enjoy her partners Specs and Tucker. It has some fun moments of humor that are more hit than miss. In an era of edge of your seat prestige horror, this arguably takes the more heartfelt route, which will not be for everyone. Critics have been decidedly harsh about this. Don't go to this one strictly for scares.It's not incompetent, but it doesn't stand alone like the first entry of the series does. What other fourth part in a horror series has this many redeeming qualities though? I'm happy with it, small problems aside. I wasn't insulted by a barrage of cheap thrills. A fine midnight movie to catch and be sucked into."}, {"rating": "1", "text": "Awful,stupid,cheap,unfrighten,not interesting,horrible(not in the good way) that's how I can call Insidious:The Last Key. I was disappointed when I saw it because other parts of Insidious franchise was normal movies,but that is one of the worst movies of 2017. It has bad actors,bad story,awful screamers and of course this movie isn't interesting at all. And I hope that it's REALY last movie in Insidious franchise."}, {"rating": "5", "text": "Better than it has any right to be being a January horror movie, but unfortunately this is the weakest of the Insidious series as well. It's more of the same, nothing scary or memorable here."}, {"rating": "4", "text": "I honestly dont know what to say about this movie. it leaves you with more quesrtions than answers and proves some horror movies do need to end."}, {"rating": "10", "text": "Love it!!!!!! Elise is back in her role once again!!!!! And she is the heart of this film which is why I truly can say this is AN AMAZING HORROR FILM!!! How many 74 year olds do u see taking charge of a franchise??? And this is a horror franchise which is just brilliant! Excellent story and acting especially the second half of this film!!!! Go watch it!!"}, {"rating": "2", "text": "The geniuses behind chapters one through three decided that it would be a great idea to make another installment for possibly one of the most forgettable franchises in the horror genre of cinema history. What's even better for me is that this is a film released in January, that month of the year where box office performance is ridiculously low compared to other months of the year. This means that Insidious: The Last Key will literally be the last key to enter the keyhole known as the forgettable Insidious franchise and I sure hope this is the case because I do not want to see any more from this awful franchise."}, {"rating": "8", "text": "3.7/5  I really don't understand the low ratings and negative reviews for this. It's easily the best entry since the original and showcases the best performance from Lin Shaye, as well as the most hauntingly powerful demonic entity  in \"Keyface\" perhaps of the whole franchise. Sure there are some horror cliches left and right, but they work and the story does too in developing a background for Elise's character and how her career came to be. I actually appreciated the bizarre twist midway through and thought it added an even more sinister aspect to the already dark subject matter. Some of the attempt at comic relief were miserable i will say, but it could have been worse. The jump scares were thoroughly enjoyable and once again the make up and performance of Javier Botet as Keyface was flawless though some was cgi. Regardless a very good entry into a solid horror franchise that apparently people despise for no reason now. If they come out with more films, i would definitely go see them and i advise anyone that enjoys effective horror to do so as well."}, {"rating": "5", "text": "Insidious: The Last Key wasn't as good as I wish it was. It's not horrible, but it's just kinda there, with not much substance present. It's not even as iconic as Insidious: Chapter 3 is (and I'm only saying that because I think of Chapter 3 as the most forgettable horror movie sometimes)."}, {"rating": "6", "text": "may not be the bes insidious movie but the next one is gonna be worst. the scrares suck"}, {"rating": "0", "text": "It was horrible I can't even say enenything good don't WATCH IT THE ACTING suck"}, {"rating": "7", "text": "While the writing is not as strong as the first movie, Lin Shaye continues to be amazing. With 5-star production and special effects, and several legitimately startling scares, it does not disappoint as a 'good' movie. Not great, but certainly not deserving of a bad review. People giving it these types of scores need to see Death Bed: The Bed That Eats (1977)... :)"}, {"rating": "7", "text": "My score for this film is for fans like my family only. Favorite cast members returned and were as excellent as always, especially Lin Shaye who is really wonderful as Dr. Elise Rainier. The film was atmospheric, but unfortunately continuity was not very good and there were plenty of plot holes. The biggest one was the prison mentioned at the beginning (Dr. Rainier’s wicked father was a prison guard), and the many dangerous murderers and electrocutions that were hinted at just disappeared. Instead Dr. R’s brother and his daughters turned up for an Insidious-style family reunion. If you are unfamiliar with this series, this film is not the best place to start."}, {"rating": "6", "text": "The worst of the franchise to date yet still plenty of scares to be had. The film easily could have fallen into the lazy typical sequel trap, but I appreciated that it stayed close to the Insidious franchise and I'd be okay with another. B-"}, {"rating": "6", "text": "Another part of the Insidious series I like, which unfortunately disappoints to a large extent. The characters known in the previous parts and macabre looking, though not terrible ghosts, are the most powerful element. The problem is the plot, which on the one hand fits into the cycle of the previous parts but on the other hand it is nothing revealing."}, {"rating": "4", "text": "And lets hope it's the last.This took me three days to finish by the way. Three. F**king. Days! Remember the scene in the first Insidious film where the camera slowly zoom towards a widow in Dalton's room and you know something watching him. How effective and simply it was. Well in this movie they took the same scene and added in a jump scare, and I laughed my head.The only saving grace was Lin Shaye performance, but that's really it."}, {"rating": "2", "text": "Universal and Blumhouse's horror franchise must remain under lock and keyDespite the pic exhibits flaws here and there regarding timing, pace, narration, editing, artistic complex and performance level, each of these is strongly stirred up by two terribly nugatory triggers. The first one, without hesitation, is the disastrous writing process. Even though the storylines have been propelled by the characters created by Leigh Whannell, the first two films enjoyed Wan's endorsement and protection, evincing the insightful skills of the filmmaker to form nerve-racking situations, however, it's curious to detect that the progressive fading of the franchise begins at the moment that the Malay only credits as a co-producer, a fact that gave his buddy full freedom to write and even direct new stories over his creations, a deadly mistake. The Australian actor and screenwriter claimed to have found the ideally respectful way to re-enter the world of \"Insidious\", the key: a new leading role. However, his assertions are false by realizing that he has shattered to exhaustion a fictitious universe that had promising possibilities, full of ways to build moments of genuine terror.To make matters worse, with \"The Last Key\", the writer becomes an imminent danger to the franchise, he has not found a success either as a director, as a writer or an actor, being one of the shameful members of the comical hypercompetitive \"ghost-hunting\" couple. Digging up the past of a character who, although is charismatic and one of the few strengths of story, is already dead is not an evidence of overflowing originality or feasibility of entertainment; piecing together events, by way of prequels, over the reconstruction of a character's past doesn't bode good results for a genre film and so it is, Whannell's script tries to moralize Elise by means of the mold of heroin with infinite lives and a logos that  shames a promising series of stories that, one day, was in the hands of groundbreaking minds. As for the horror sequences, the main and possibly the only purpose for most audiences, the decline in effectiveness is potentiated by cementing tension explicitly in jump-scares and unstoppable crescendos confining it in the list of those films of apparent horror, not achiving scenes that make moviegoers' hair stand on end is a big problem in this kind of film, likewise, it incredibly gets even worse as there are two sequences in which it could deploy a creating tension process moderately disturbing, just to be interrupted and abruptly disrupted by the incessant insertion of contiguous scenes or a traditional horrible cheap scare, simply depressing. The screenplay is another story. If the audience goes to the laughter and not the lament to react to your film, there is something to worry about. With thousands of indie films as supporting evidence, not always the most valuable actors are those who perform interpretations for an award, however, in this film, although none of them has a great recognition around the globe, no one can get the story off the ground, mainly by the melodramatic and outrageously laughable lines of dialogue.Entrusting to a newcomer a franchise that was announcing its agony ultimatum is the other big trouble. Adam Robitel is a producer who has to his credit more functions as an editor and actor than as a filmmaker, it doesn't mean that he does not contemplate the necessary know-how to make a triumphant flick, however, the fourth installment of the franchise should have never ended up in his hands. The director is said to be the captain of the film boat, it's also said that an audiovisual work reflects the vision of such filmmaker, namely, on his or her shoulders lies the weight of the decisions that an idea must take here and there, this is why when \"The Last Key\" screening is over, it seems alarming the difficulty of the novice director to conceive an intense and refreshing complete pic, three missing epithets.Inserting, with short shrift, digital and manual techniques averagely, as the footage runs, one warns a kind of freak show where creepy and cartoonish creatures file, fulfilling a simply acceptable function.\"Insidious: The Last Key\" by Adam Robitel should throw away the last key that opens the door to the franchise. Rigid, intermittent and lack of any vestige of narrative power, the fourth installment digs up the laughable past of an emblematic character for a saga that seems lost, while simultaneously, buries the short possibilities of recovering the strengths from past times. That characteristic old-school touch that gave the images and sounds an obscure spooky nature is buried under exhibitionist visual dust. Anyone who pays a ticket for this silly idea, will have to get ready to go to the darkest side of Hollywood world, an uninspiring and vile place where men with leather briefcases and stately ties dictate sequels or conclusions of stories that, one day, could transcend a fictional barrier."}, {"rating": "5", "text": "\"Insidious: The Last Key\" turned out to have the least impact that fans had to receive, although the characters have had a very good development, both the story and the development of it ended up being less convincing, with missing parts of the plot and a little more annoying, something that the Insidious franchise has lost with it."}, {"rating": "6", "text": "Overall Rating: 6/10Cons: The movie is not all that scary and it takes a while for the movie to pick up steam. Based on the premise it could have been a lot more terrifying.Pros: Lin Shaye is once again amazing as Elise. Like the rest of the Insidious movies, the film is well-made-- what it lacks in scares it makes up for with effective storytelling and an emotional core. There is enough of an eerie atmosphere to make the few jump scares effective.Consensus: Insidious: The Last Key lacks a lot of the thrills from the original, but this fourth entry maintains the chilling atmosphere and strong performances that made the series memorable."}, {"rating": "4", "text": "No hay mucho que decir de esta pelicula.Mala en general.Argumento con muchos altibajos Muy accelerado sin mucho sentido en general."}, {"rating": "4", "text": "Leigh Whannell is a genius, trust me, he's not stupid at all, he has managed to gain milllions by creating two of the most successful horror franchises of the recent decade by having a crucial element that Hollywood loves, they cost little and they make a lot of money. No doubt they are a perfect business, but quality, well that's a completely different matter.The problem here is that Whannell is doing the same thing that was done with other famous horror franchises, non-stop sequels to which they only gave a little shake-up in their plots and they were ready to have another new movie to attract audiences hungry for cheap scares.Insidious: The Last Key shows that the formula is already exhausted and the environment, the scares, the plot, its development and conclusion no longer give for more, especially because it seems obvious that Whannell no longer knows what to add to Elise's character. Lin Shaye continues to do a good job but the script provides very little for her and frankly her character is already stuck in the repetitive.Honestly this was a very poor sequel and without a doubt the worst movie of the franchise so far. Now what Whannell should do is to close the cycle and deliver a final movie with Elise facing the so-called Lipstick-Face Demon, because he has been announcing their confrontation for four movies now but he also has been extending things too much. The ending of this movie seems to announce a conclusion, I hope it is like that and I hope he will give a strong and worthy closing to the franchise."}, {"rating": "8", "text": "good movie, my favorite of the saga and also answers many questions that I leave the previous ones, maybe it is not superior to its predecessors but it is my favorite without hesitation"}, {"rating": "3", "text": "Being as this is the first movie of the franchise that I have watched I wasn't too impressed at all. I'm not a big horror movie fan so I didn't have much expectation going into this one. It wasn't very scary at all, I get scared pretty easily and even this one didn't deliver the scares. A weak story as well with poorly placed jokes made this a very unforgettable movie."}, {"rating": "6", "text": "it's so scaring more than previous Insidious: Chapter 3 and Insidious: Chapter 2"}, {"rating": "6", "text": "The magic is over, but it's not a bad movie. The big problem are the music and the direction, the story is not bad.Lin Shaye did a excelent performance."}, {"rating": "6", "text": "An improvement over the last one, but still lacks the scares and the originality of the first two installments."}, {"rating": "7", "text": "Insidious- The Last Key is a sold finale to the Insidious franchise that gives the series lead Lin Shaye a chance to take a graceful final bow"}, {"rating": "5", "text": "Sajnos nagyon gyenge (10/5) befejezése lett ez a sorozatnak. Nem magyaráztak el semmit, minden összevisszaság és értelmetlen volt. Csak az nézze meg, akinek tetszett a másik három rész."}, {"rating": "10", "text": "➳Insidious: The Last Key FULL MOVIE ►:][[ ]][:◄ ➱Insidious: The Last Key FULL MOVIE ►Insidious: The Last Key FULL MOVIE ☀Insidious: The Last Key FULL MOVIE ♅Insidious: The Last Key FULL MOVIE ⪨Insidious: The Last Key FULLMOVIE ♡Insidious: The Last Key FULLMOVIE ⨭Insidious: The Last Key Full Movie Insidious: The Last Key FULLMOVIE ⩡Insidious: The Last Key Full Movie Insidious: The Last Key FULLMOVIE ⪓Insidious: The Last Key Full Movie_bⓁAⓝgsAⓀ⨭_ Insidious: The Last Key FULL MOVIE"}, {"rating": "6", "text": "Dissapointing, it has lost it's shine but i fear with the box office success we will still see a fifth film.It wasn't scary it was comical and that's not what the original set as it's standard.  If a fifth is coming please make it scary!"}, {"rating": "5", "text": "The movie wasn't the worst. I warn you; this review might spoil it - so if you want to watch it - don't read it. Decent, cosy acting, with the old lady in the lead and all. The thing that kills this movie, is it's terrible, nonsensical script. It's just garbage. The script. All the other things with this movie is decent, and could be good, if the script wasn't complete s###. Silly buildups, and very expected progression. They start off by highlighting this whistle ridiculously much. Ridiculously. And unsurprisingly it is key to the whole damn movie. In the dumbest f'ing way imaginable. This movie kinda grips you in. Then just lets you go everytime something happens. It's not good. It's not bad. Well, it kind of is, but it's more on the \"meh\" end of the spectrum. The actors (apart from the mother) could all have done better jobs with a better script that wasn't garbage. Oh, also, I watched this thinking it was supposed to be a thriller? Then... why the heck is there a jumpscare lurking around every corner? I hate jump-scares. They're not really scary, and they're just cheap tricks to mask a crap movie."}, {"rating": "8", "text": "Scientists have concluded that monsters live underneath beds because they drink kid pee.Fortunately, the fiend in this horror movie feeds off of fear, not tinkle.When medium Elise (Lin Shaye) agrees to help the new owner of her ancestral home get rid of the evil spirits within, she takes the opportunity to reconnect with her estranged brother (Bruce Davison) and family.But when a creature called Key Face captures Elise's niece's soul to feed upon, she must travel to the astral plane to reclaim it, and destroy the entity that has hounded her family for years.While this prequel, and fourth installment in the metaphysical franchise, ties nicely into the original movie, the mystical realm concept has definitely run its course. What's more, the key-centric villain is utterly laughable, while the scares are predictable.Besides, this lady should just be thankful that her childhood home hasn't become an infill. Red Light"}, {"rating": "5", "text": "With mostly jump scares to up the scare factor, it is quite evident that this series is losing steam."}, {"rating": "4", "text": "Insidious: Chapter 3 wasn't enough of an unnecessary addition to the franchise, so we got this one. ..Good : What this film does good is it adds some more depth to the character of Elise. They give the back story and all, along with some \"origins\" of Elise. Her character moments are quite good. Some jump-scares, particularly one or two, were good ones. And that's it. ..Bad : The remaining of the film, just like the third one, felt more like a typical \"haunted house\" story, rather than an \"Insidious\" film. The concept of astral projection they brought in the first film has been turned into a mere plot device ever since the third one, this fourth installment clearly isn't an exception. Honestly, I feel that is the thing that made the first two films what they were. And the way \"The Further\" works has been quite a bit ludicrous ever since the second one, the ludicrousness increased in the third one and now in this one, everything convenient to the plot can be done in \"The Further\". Just like astral projection, this is just a plot device now. And nothing is explained about how the things work to stop that demon. It was just \"you're watching a horror film, so anything that we do for our convenience, you should accept it, no matter we build it or not\" sort of **** The jokes that the two \"sidekicks\" of Elise crack were CRINGE-WORTHY. Just some perverted moments time and again, some unnecessary **** most of the comedic parts feel out of place and did not match the tone of the film. And even though the jokes and all that stupid stuff felt out of place, this film felt like a comedy more than horror. Speaking of horror, it just had jump-scares, none of which made a real sense. Remove them, nothing is \"horror\". Also, some predictable and obvious \"Insidious\" twists at some places, which no longer feel appealing. Also, \"The Last Key\" ..... I am still wondering what was so special about the key, except for Elise giving the demon the last key. It was just a demon who manipulated Elise's father and had fingers made up of keys which served some vague purpose not explained in the movie. The demon when appears in some jump-scares, it scares (at least). But when it really shows up, nothing is speacial about it. So, where's the horror? Scaring and terrifying are different things, and for a good horror film, most of us prefer the terrifying stuffs. The presence of demon serves no purpose? And he's the only demon?!! And how is that blowing a whistle calls Elise's mother to rescue her and a single kick kills the demon? (If only it had some purpose and some story added to the part of the demon like in the first two, it might have worked.) Also, what's with her Elise's dad's spirit dying in \"The Further\"? There are many such questions unanswered by the film and this is not obviously an \"Inception-themed\" or \"Memento-themed\" movie, this was just an incomprehensible mess of a movie. Then, there's a scene of Elise opening the boxes to realize the killings her father committed, where we were teased of jump-scares, and we didn't get a jump-scare at the first time, and after a couple of stupid teasings we get a jump-scare. And if the makers thought we won't be able to predict what they were doing in this scene, they're fools. See? A scene committed to an unnecessary jump-scare, but nothing done to give some actual horror. Doesn't that prove that horror film makers don't know what horror is? And where's that man dressed as bride in a black dress trying to kill Elise, which was supposed to follow her every time she went into \"The Further\"? The film ties up with the events of the first one, which clearly creates some plot holes as the entire film was about astral projection but the way this film ties it up shows as if it was something similar to this film, making this more of a nonsense. In fact, the best part of this film is that it had some scenes from the first Insidious film, which reminded me how good the first two were. Rest of all, unnecessary crap. ..Conclusion : This one does have some good elements in it, and definitely more of the bad ones. All in all, the film felt like a below average \"horror\" film. This film really felt underwhelming to me, and I already had very less expectations. If the franchise is to proceed further (no pun intended), they need to change the direction or reboot it. But the best thing would be to stop it right here. ..Rating..Score : 4.1/10Grade : D+"}, {"rating": "3", "text": "Possibly Insipid would have been a better title. We only expect some twisted scares from the dark and gloomy Insidious franchise. Particularly disappointing in this one are the awkward, unwelcome, comedic failures brought forward by the \"Side Kicks\"."}, {"rating": "7", "text": "Scary one time watch!Amazing music and sounds.acting was good Lin was literally amazing through-out the series.the nerds were awesome and fun to watch,the family and the brother were great specially at the end they were amazing.the screenplay was good,story was decent although as per series prequel it just messed the whole time-line without any explanation of the time-travel and the red ghost  story,i was expecting this to be continuation of the 2nd part with the hint in that movie at last about the red ghost ,but it was another prequel,its like only 1st one was fresh and 2nd one was different with unique time-travel and other awesome things.3rd one was amazing prequel with another mess-up of time-line and as per this last one this need to be concluded and cleared the whole things but certainly it messes up even little extra but as per origin of Elise it was decent movie the ghost was forgettable and the key and door thing went un-explained and pointless at last with connecting it to the 1st one,as per scares it was a terrifying and amazing horror,the tunnel scene was like teasingly impressive it was like its coming now.....then suddenly the jump scare it was surprising and amazing.the nieces of Elise and the Flirts of the Nerds was amazingly fun.every time the nerds say anything it was hilarious.the last act was amazing although the impact is missing it was like its just happening although love the parents in that scene and rescue mission.the hospital closing scene was amazing and the last tease was like here we go again.Overall it was a messy movie as per timeline of series and it felt like running same formula of prequels but Fun and scary movie!"}, {"rating": "6", "text": "For me, The Last Key was the weakest part of Insidious franchise. First two parts were so different but afterwards the franchise turned into a normal horror franchise. I am not saying that this part was bad but it was very simple which you don't expect from Insidious franchise especially after watching first two movies.What I liked about this movie was that it added some more depth to the character of Elise. They told her back story. Her character moments are quite good. Some jump-scares, particularly one or two, were good ones.What went wrong that that after 2nd part the franchise felt like an average horror film.If the franchise is to proceed further, they need to bring back James Wan but it would be better to stop the franchise right here. Overall, the movie is almost unnecessary unless you want to know little about Elise's childhood."}, {"rating": "8", "text": "Origin story where a demon causes men to kidnap and murder young women across two different time periods."}, {"rating": "3", "text": "The Last Key is the first movie in the Insidious franchise that I dislike. This movie doesn’t add much to the franchise and the writing and direction aren’t great either. The dialogue is really cliche and corny at times which takes away from the effectiveness of some scenes, and the scares are very predictable and are a big letdown from what we got in Chapter 3. Even the acting isn’t great at times which causes some moments in the movie to feel really awkward, though Lin Shaye gives another great performance as Elise Rainier. The story of The Last Key is an improvement from that of Chapter 3 and takes us even further into the past than Chapter 2 did by taking us through Elise’s childhood and her experiences as a young girl with her “gifts”. This is nice as it gives even more depth and history to the franchise. The movie also does a good job of tying Elise’s past into the present in a way that makes sense and culminates decently in the movie. It still has some elements of character stupidity, but not in way that we saw in Chapter 3 so that’s an improvement as well. There are also moments where the film ties into the previous ones in the franchise to give us big “ah-ha” moments that clarify stuff from those films. For me, unfortunately, these are the only redeeming qualities of the movie. It feels like it was made as a bit of a cash grab for people who were big fans of the first three movies and excited for a fourth one, and feels like it doesn’t add too much to the franchise, either. The Last Key should’ve been a spin-off movie about Elise and her past, because this franchise was founded on the Lambert family and it feels like it’s gone away from that and been distracted by telling other stories that only have some relevance to the Lambert family. Chapter 3 was acceptable mostly because Specs and Tucker played big parts in Insidious 1 and 2 and Chapter 3 explained how Elise met them, so that gave us necessary context for 1 and 2. The Last Key gives us a lot of unnecessary context and it takes away from it’s ability to be a true part of the franchise. That aside, there are just some bad moments in this movie, as I mentioned above, that hurt the quality of it and disrupt the flow. The twist regarding Ted Garza causes this movie to go way off the rails and is really unnecessary; I would rather have had the filmmakers do some cliche jump scare than do this. Overall, for me, The Last Key is the worst installment in the Insidious franchise and shows that the people making these movies should really stick with the Lambert family and their story since that’s what made Insidious 1 and 2 as good as they were."}, {"rating": "7", "text": "A pretty good movie with good moments of suspense. Here, too, as in the rest of the saga, there is a demon fighting infesting the house where the psychic grew up, here she will have to fight against the same demon that terrified her as a child, this detail is the only one that differentiates this insidious from the others."}], "recommendations": ["insidious_chapter_3", "insidious_chapter_2", "sinister_2", "the_conjuring_the_devil_made_me_do_it", "ouija_origin_of_evil", "annabelle_comes_home", "the_conjuring_2", "scary_stories_to_tell_in_the_dark", "happy_death_day_2u", "the_haunting_in_connecticut_2_ghosts_of_georgia", "dark_skies", "the_grudge_2", "the_invasion", "annabelle", "final_destination", "annabelle_creation", "malignant", "the_conjuring", "it", "chernobyl_diaries", "lights_out", "a_quiet_place_part_ii", "the_curse_of_la_llorona", "the_invisible_man", "the_ring"]}