{"id": 4793, "title": "Insomnia", "starring": ["Al Pacino", "Robin Williams"], "runtime": 118, "genre": ["Crime", "Mystery", "Thriller"], "description": "Two Los Angeles homicide detectives are dispatched to a northern town where the sun doesn't set to investigate the methodical murder of a local teen.", "releaseYear": "2002", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/riVXh3EimGO0y5dgQxEWPRy5Itg.jpg", "categories": {"plot": 8.2, "acting": 7.636363636363637, "ending": 7.4, "soundtrack": 5.0, "cinematography": 8.666666666666666, "familyFriendly": 3.0, "funny": 8.0, "action": 8.625}, "reviews": [{"rating": "9", "text": "It's brilliantly cast and stunningly effective."}, {"rating": "9", "text": "The humble beginnings of Christopher Nolan became quite popular after he took over the Batman reigns, 'Insomnia' offers a thoughtful and intriguing concept in a typical story of homicide. Al Pacino plays the gruff and seasoned detective sent to the mountainous regions of Alaska to investigate the murder of a young teen girl, but we immediately begin to understand the life of Pacinos character, Will Dormer. He knows the ins and outs of how to study a crime scene, looking for the little details, but he also seems exhausted, soaking up life through routine as a man who has seen it all, tired, possibly bored but still able to show up the young blood at any given turn. His younger partner Eckhart (Martin Donovan) respects the decisions of his superior, but he also has the opportunity to give evidence against his older counterpart to Internal Affairs, but their motive in the film is to help out with the murder, where Dormor finds a fan on young and motivated cop Ellie Burr (Hilary Swank), hangs onto every word of the ageing detective. But we he an unexpected and thrilling introduction to the person responsible for the crime, ***SPOILERS*** Dormor and his men stakeout a clue and tragedy strikes when Dormor shoots and kills his partner, this was an accident, right? Dormor is overcome with guilt to the point where he cannot admit his mistake, but one person knows what he did, that person is the man responsible for the young girls death. Robin Williams plays the calm and sophisticated writer, who tells Dormor that it was all an accident, we now have a cat and mouse game, the scenes Pacino and Williams share are excellent, two fine actors, Williams in particular, who proves his talent yet again for dramatic roles, but this style of storytelling is truly fascinating because of its revelations halfway through the film, which are brought down by simplistic and routine Hollywood chase sequences and silly throw-ins to give that blockbuster touch, which are unnecessary, especially when the thrill of the chase, all through dialogue and performances, is already so interesting. Pacino is excellent as the now sleep-deprived cop, who can't even rest away from the world, while Williams plays a cunning adversary who has it all worked out, as he keeps telling us, but its rough justice which wins out, Nolan sets it in remote parts to capture the essence of being alone with your thoughts, while still not escaping the ramifications of something that makes you run away."}, {"rating": "9", "text": "Christopher Nolan's Insomnia is a riveting psychological thriller that is immaculately cast, mysterious and thrilling. It's layered plot is full of twists that develop characters rather than confuse. Brilliant filmmaking."}, {"rating": "9", "text": "A very well made movie: the progression of the plot, the rythm, the images, the music. A super note to Al Pacino's high acting. With Donnie Brasco and the Heat 'face_à_face' scene with De Niro, it's, imo, of his reallly best work here. Full of nuances, small things in the way he reacts to some lines, his intonation, ....Very impressive artist. Robin Williams offers a very convincing 'counterpart', and the dialogues between Pacino & him work totally. David Julyan's score is of great quality, following the tone of Memento. Insomnia and Memento have many links, besides (flashes, camera moves, music, the ambiguity of the 'hero', etc...) A real good work, anyway; Thank you Christopher Nolan."}, {"rating": "9", "text": "Insomnia is a great thriller with a strong cast and Nolan as a director. There's suspense and it works. It's unusual to see Robin Williams as an antagonist. Insomnia is a high movie, first of all for the fact that there is no black and white and there is only grayscale. The ending gives even more pleasure, it is realistic."}, {"rating": "8", "text": "In relation to sounds,music and some details it could have been better, but 'Insomnia' is a captivating crime movie. Al Pacino will never disappoint you. The plot was interesting like it's development. The directing by Nolan was also decent. Overall Insomnia deserves it's high score."}, {"rating": "9", "text": "A fantastic psychological thriller that is beautifully crafted by the talented Nolan.One of 2002's best movies."}, {"rating": "9", "text": "********************************************************》》》》》》》》》》》》》》》》》》》》》》》》》》"}, {"rating": "6", "text": "It was ok, not as good as his other movies tho."}, {"rating": "9", "text": "An exceptional film, but not \"better than\" the original Norwegian version. The original is creepier and more morally compromised than the American version. Pacino's Dormer is ultimately redeemed, whilst Skargard's Engstom is not."}, {"rating": "10", "text": "An excellent director combined with amazing actors(williams and pacino in particular) and a compelling script combine to make a highly successful and thrilling film."}, {"rating": "8", "text": "Another quite brilliant Nolan film with excellent cast, writing and music. Pacino is great."}, {"rating": "3", "text": "Despite the expected great acting from the main cast, the film seemed eternal and I found myself waiting for it to end. It is ironically the cure for it's own title."}, {"rating": "8", "text": "Probably my least favorite Christopher Nolan movie, which says a lot for Nolan.  Al Pacino and Hillary Swank give good performances, but the stand out is Robin Williams."}, {"rating": "9", "text": "Christopher Nolan knocks one out of the park again. Insomnia is everything you want in a crime thriller. He manages to cultivate and maintain an atmosphere of general dread, malice and suspense. Al Pacino is as great as we expect him to be and Robin Williams is something a bit more unexpected but completely welcomed. Filled with outstanding performances, beautiful cinematography, and terrific editing. Not to mention incredibly well written and directed, all thanks to Christopher Nolan. (With no small thanks going to the original short story written by Jonathan Nolan.)"}, {"rating": "8", "text": "Insomnia is largely by-the-numbers when it comes to detective films, but that does not stop it from having truly great things that sets it above other thrillers of this ilk. First off, Al Pacino and Robin Williams are phenomenal. I love comedians doing roles that are completely against their type and boy oh boy did Williams do that here. He was phenomenal, creepy and unsettling all wrapped into one and he nails the role. Director Christopher Nolan shows incredible talent here as he manages to creepy a truly unsettling atmosphere that never scares you to be sure, but certainly keeps you on edge. The script is very good and the characters are very well done, to the point that you are never truly sure who is good and who is truly bad. Overall, Insomnia is a good, but not great thriller that is not Nolan's best work, but that certainly does not mean it is ever bad."}, {"rating": "4", "text": "Even though Nolan has several good approaches, Insomnia is nothing more than generic, unspectacular, and forgettable in the long run. Hillary Seitz’s adapted screenplay is laden with crime show stereotypes and gratuitous dialogue but lacks real character development or any unique elements. The best example for this is Hilary Swank who obviously has the most unfavourable role as an aspiring assistant detective that wants nothing more than to get advise from the old-established cop. Due to all of that, remarkable achievements in terms of visuals can’t help the film anymore than Pacino’s dedicated acting and Insomnia is best watched on a weekday evening while eating lunch and conversing with your partner."}, {"rating": "8", "text": "Good director, great actors, a story with some twists and a lot of moral dilemmas. The movie keeps in tension. Overall, a decent detective/thriller/drama movie."}, {"rating": "9", "text": "While this is definitely not the best Christopher Nolan film, this was still an amazing film. The cast was amazing and the story was amazing. Finally, we see Robin Williams doing something other than bad comedy."}, {"rating": "6", "text": "Insomnia will keep you awake.\rAl Pacino stars in the mystery thriller that entertains but fails to reach a conclusion. A very well directed idea with a sub-par ending that doesn't allow it to reach its potential."}, {"rating": "9", "text": "Definitely not Nolan's best but probably my favourite (at least tied with 'Batman Begins') because I love the Norwegian original so much AND the subtle changes Nolan made with it, as well as what the three stars (Al Pacino, Robin Williams--in his first villainous role, I believe, and Hilary Swank--in probably my favourite performance of hers, next to the downright decadence and naughtiness she displayed in 'The Black Dahlia') bring to the table here. I greatly enjoyed the five short extras on my DVD (a double-sided disc I bought years ago that has 'The Devil's Advocate' on the other side, yet unwatched): a conversation/interview of Nolan with Pacino; 'Day for Night: The Making of...'; 'In the Fog' (which interviewed cinematographer Wally Pfister); Nathan Crowley: production designer; and 'Eyes Wide Open' (which interviewed sleep disturbance experts), which thankfully I viewed before I watched the movie, to enhance my experience.\r Greatly recommended to fans of contemporary crime thrillers, regardless of whether you watched the Norwegian original or not. There are enough differences to still make it worth your while as a cinephile."}, {"rating": "9", "text": "Intense, riveting, spectacular, these are the words to describe Insomnia. Al Pacino, Robin Williams, and Hilary Swank all give great performances to make this movie exciting to watch."}, {"rating": "8", "text": "Insomnia,AKA Nolan's first step in a big studio like Warner Bros,AKA Nolan's most underrated movie (Ok,time to stop with the AKA...). It's hard explaining how i felt on Insomnia,since this isn't your typical Nolan movie with magnificent storytelling (like Memento or Following) and instead it acts like your typical mystery/crime movie,even though at some point,i could've seen where Nolan was trying to make a thing of its own,with some great cinematography,and probably some memorable lines too. Keep in mind that they were trying to remake a classic European movie of the '70,and i know you shoudn't mess while remaking a classic movie (like most 'modern' remakes),but,even if the story wasn't Nolan at its best,i still enjoyed it. It's one of those rare movies that keeps an eye on every plot and subplot without forgetting anything,like Dormer (played by Al Pacino) having accidentally killed his partner,or the case of this girl being murdered by someone. It's because of the creepy imagery that Nolan's trying to set up during some moments of Dormer having some troubling moments in some scenes (As the movie goes). I was lucky the movie didn't feel choppy,since from minute one to the 40/45-minute mark,the editing made the movie feel like it was going 'Fast' a-la LEGO Movie. The acting,as always,was superb,but Robin Williams felt bored as the movie was coming to the end. In the end,the story not being Nolan at its best may be the reason on why Insomnia may be the most underrated Nolan movie,but other than that,it still has some powerful cinematography,some superb acting,and impressive sound effects."}, {"rating": "7", "text": "I had some expectations when I saw this movie. Its almost impossible not to create them, when we have before us a film by the prestigious Christopher Nolan, with actors as strong as Al Pacino, Hillary Swank and Robin Williams (the latter - rare case - in a role of dramatic villain). Only later did I come to discover that this was a remake of another Norwegian film, which I never saw.The script is based on a police investigation into a crime in Alaska, where the Sun has the peculiarity of, at the peak of Summer, never to disappear from the horizon. Will Dormer, a Los Angeles cop, goes there, but he's not used to the environment or the white nights, so he cannot sleep. Something that worsens as the remorse for his past haunts the investigation.Nolan is a skilled director with unquestionable ability. However, this movie is far from his best. In fact, if we didn't know that he was in, this movie could perfectly well be any other good American director. But there are moments of brilliance: the way insomnia was portrayed, the way the white Alaskan landscape was used to make the place oppressive, mysterious and inhospitable... The script, in turn (in one of the rare films where Nolan avoided getting involved in writing), has more of a turnaround and can get our attention. Although we know very early on who is the criminal and the great villain, the film focuses on the figure of the policeman, calling into question his way of doing justice, avoiding making him a hero, just as he avoids making the victim an innocent figure. The murdered young woman, in fact, was not a choir girl.Al Pacino was perfectly up to the challenge and along with Williams dominates the entire film. This duo of striking actors is fundamental and was able to do what it took to make their characters strong and domineering. Right behind, we can appreciate Hilary Swank, an actress whose performances have not always appealed to me in other films, but who was very well here."}, {"rating": "7", "text": "Perhaps my favorite Alaskan movie. Sleep Will be the Last Thing on Your Mind."}, {"rating": "0", "text": "Like the title, Insomnia will keep you awake and tuned in because of the directing but an incomplete and sub par ending make you wish you didn't have to focus so hard the entire film."}, {"rating": "8", "text": "Insomnia was the second major motion picture by acclaimed writer/director, Christopher Nolan. Even in the most early stages of his career, it's easy to see his genius, that's why so many big stars wanted to work with him right away. Insomnia is the least well known of all his films and does lack some of the things that have become Nolan's trademark, but it's still a terrific film. The story follows two L.A. Detectives sent to a remote part of Alaska, where the sun doesn't set for six months and then doesn't rise for six months. They're there to solve a brutal and calculated murder, but circumstances lead them down a different path. Despite being one of the best Hollywood has to offer, I haven't really been much of a Pacino fan. To me, it seemed as though he had lost something with age, his performance in Insomnia proved me wrong. Terrific is not the word for what Al Pacino was and he's not the only genius Nolan surrounded himself with. This film is incredibly well written and being the perfectionist that he is, Nolan got only the best people to star in it. It's not the kind of Nolan film, we've been spoiled with over the past 10 years, but Insomnia is a great story, with an unbelievable cast and in my opinion is a must see."}, {"rating": "8", "text": "Directed by Nolan and starring Al Pacino, Insomnia is nothing short of a thrilling masterpiece. This is a great film for lovers of psychological thrillers."}, {"rating": "6", "text": "Like the title, Insomnia will keep you awake and tuned in because of the directing but an incomplete and sub par ending make you wish you didn't have to focus so hard the entire film."}, {"rating": "9", "text": "Brilliant acting, super interesting story, drama, mystery and action... what more could you wish for? Al Pacino and Christopher Nolan deliver one of the best criminal movies i've ever seen!"}, {"rating": "7", "text": "Insomnia is a great thriller with a great plot and some fascinating actors like Al Pacino and Hillary Swank. It is not a masterpiece like Se7en but you will not get bored and you will like the film. It doesn´t have something special but it is just an entertaining crime film with some suspense in it"}, {"rating": "8", "text": "Insomnia might be the most flawless movie from our beloved director Christoffer Nolan.\r Insomnia is an exiting and well made movie, which also has a gorgeous story and an awesome ending. It's also a highly unique movie, and combined with great actors couldn't the film been done better. The story in Insomnia is marvelous, because it's so mysterious.\r Insomnia is much better than it's predecessor Memento, and you can really feel that Nolan is on track to make the perfect movie.\r Insomnia gets a 8/10"}, {"rating": "7", "text": "Christopher Nolan's first test at a mainstream film is a fair accomplishment; it has genuine suspense, a captivating psychological theme of guilt and morality that is all the more gravitated by the duo of Al Pacino and the late Robin Williams, both of whom bore a range that seems to stretch far and wide. It has the merit of a good suspense film, one that I can enjoy without growing bored of halfway through."}, {"rating": "8", "text": "'Insomnia' is a captivating crime movie with a chilling performance by the late-Robin Williams"}, {"rating": "9", "text": "Al Pacino gives one of his best performances, and Robin Williams also gives one of his most innovative performances as well, Hilary Swank also gives a stellar performances but the key of this movie is Nolan's direction and writing"}, {"rating": "7", "text": "It's a very well made action thriller. The acting is excellent, the story is interesting and engaging and the movie was quite entertaining. It's not the most original movie out there, but it's still a fairly enjoyable movie."}, {"rating": "8", "text": "A gimmick is only a gimmick if it's in service of nothing but its own gimmickry. The big twist in Christopher Nolan's astonishing Memento–a thriller that unfolds in reverse chronological order–is that the gimmick suddenly melts away, revealing a deeply considered and profound statement about the slippery nature of memory and the human capacity for self-deception. So it only follows that Nolan's next project, a compelling big-budget remake of the superb Norwegian \"sunlit noir\" Insomnia, would segue smoothly (and in reverse anatomical order, no less) from memory to perception, relishing the sometimes fuzzy connection between the eyes and the mind. Those who aren't familiar with Erik Skjoldbjærg's original will likely be immune to the remake's biggest flaw, which is the disappointing suspicion that Nolan, for all his talent and craft, never came up with a reason for the remake, other than to translate a great film into English and introduce it to a wider audience. But while his additions and subtractions are negligible, the premise still carries an ingenious metaphorical hook, centering on a man whose guilty conscience can never escape the light of day. In a role originally played by the much younger Stellan Skarsgård, Al Pacino looks haggard; his world-weary demeanor speaks volumes about his character, a veteran L.A. detective assigned to investigate the murder of a high-school student in small-town Alaska. As an internal-affairs unit prepares to mount a corruption case against him back home, Pacino and partner Martin Donovan track a methodical killer during summer in the Arctic Circle, under perpetual sunlight. A ruse to snare the suspect pays off, but a shootout on a foggy beach ends with Pacino accidentally shooting Donovan and then hastily covering it up, worried that his partner's cooperation in the internal-affairs case will make him the obvious culprit. While a local officer (Hilary Swank) collects evidence for a report on the incident, the sole witness (Robin Williams, in his best performance in about 18 years) blackmails Pacino to save his own hide. As Pacino endures day after day without a wink of sleep, Insomnia skillfully turns the screws, delving further into his troubled mind as it's haunted by past and present sins, as well as deceptive visions that seem to bleed out of his conscience. Nolan's solid, workmanlike direction doesn't strike any memorable grace notes, but he draws out the key ambiguities in the story with great precision, to the point where even Pacino himself isn't certain whether the shooting was an accident. Long on atmospherics and short on plot, the original Insomnia drifts so far away from the initial murder investigation that it nearly becomes incidental to the real story, about a crooked man deprived of the darkness he needs to conceal his secrets. Nolan reverses the emphasis–;no surprise from the director of a plot-driven film like Memento–but achieves the same end, bringing Hollywood noir under the harsh glare of permanent daylight."}, {"rating": "7", "text": "A good drama based on a murder. Although  the plot was weak as at times it felt more like an inner conflict than an a external one. However the highlights of the film was Al Pachino performance and the amazing camera shots that straighten the film."}, {"rating": "9", "text": "I'd lean towards the supporting characters that aren't just filling in for the leads, they have got some gunpowder in their pocket.InsomniaNolan tases you with a sassy outlook on a crime thriller that flips the priorities and expectations of the viewers. But hold onto your hats, for unlike the textbook Nolan phenomenon, we are in awe with the journey rather than the big reveal of the film. In the sense that it is more fascinating to see who is what then who-dun-it case. And on that note the plot takes a major turn on making the detective a criminal. And it is not until in later stage you find that road taken by him, when you see Will Dormer played by Al Pacino panting and worried sick about getting caught from the police of his very own department. Will, a hardcore successful detective, finds himself on a new case that haunts him back to his own self.The only feature, as of now, to mark in Nolan's filmography where he contributes only as a director and not a writer. Although it is said that he did write a rough draft of the screenplay. And I was really excited to see him pull off someone else's material and quite early in the film I was assured that this heavy yet sensitive responsibility couldn't have gotten a better caretaker. And it is that fog crime scene in its first act that shows you, how precise Nolan is on projecting himself exquisitely to what is told in the paper.You cannot not mention the interrogation scene between Robin Williams and Al Pacino when talking about this film. And yes, I get that it has much more juicy whistleblowing information revealed where the entire film hinges upon. But it is also a testament on how to \"look\" in an act. How to gaze at each other, Pacino, and not gaze at each other, Williams, and play cards with higher stakes. P.S. it is a joy to watch Pacino evolve into a person suffering from Insomnia step by step, frame by frame, just with the way he handles his eyes and how they hung low with his brow as the film ages on screen."}, {"rating": "7", "text": "It didn't match with the poster or the trailer. When I first saw this film on the screen, I was very confused. Now, I love this film. It's true that it's the film that we can not see Christopher Nolan's talent in the film. However, I guarantee that this film will make you actually feel that you have insomnia. I loved the acting in all ways. I loved characters in every ways."}, {"rating": "10", "text": "Christopher Nolan’s 2002 crime thriller is, in my opinion, often overlooked by his fans and general audiences alike. I feel like perhaps they tend to have just come off the back of Inception, or The Dark Knight, and are surprised to see a film of such small scale coming from a director renowned for his high grossing blockbusters, but what they forget is that before Nolan was trying to become the next Kubrick (exaggeration I know), his films were much less high octane and in a sense far more indie, which is a style that to an extent I prefer. I was initially disappointed with insomnia’s slow pacing and narrative simplicity, but upon rewatching it I found my views on the film had drastically changed. The story takes place in Nightmute, Alaska, where a well respected detective (Al Pacino) and his partner are called over to investigate the murder of a 17 year old girl. On one hand, he faces scrutiny fromInternal investigations for his morally ambiguous decisions in the past, a situation which is only made more intense by the accidental killing of his own partner. On the other he has to deal with Robin Williams’s Walter Finch, the murderer himself who seems only intent on playing mind games with Pacino. Finally to make matters worse, due to the story taking place in Alaska during the summer, meaning that during the night the sun stays out preventing him from getting any sleep, hence the name 'Insomnia'. It’s hard to pin down what exactly makes this movie so great in my eyes. For one, I absolutely adore how the atmosphere gradually increases in intensity as the plot begins to thicken. Pacino’s flawless performance (which may be my favorite of his) perfectly conveys his stress and fatigue, which is made all the more real by kinetic editing, that frequently cuts to brief flashbacks and hallucinations in order to catch the viewer off guard.On the other hand the absolutely stunning scenery and beautiful score by David Julyan acts as a welcomed contrast to the otherwise overwhelming tension. As much as I love Hans Zimmer I do sometimes miss when Julyan scored Nolan’s movies. Robin Williams is also as always phenomenal, giving a performance so chilling it made me feel physically uncomfortable, similar to (although not quite as extreme as) his other 2002 thriller 'One Hour Photo'. Other than the aforementioned qualities, one of my favorite things about the film is that underneath the fact that it’s another suspenseful crime thriller (which I am a sucker for), insomnia is a dark, ponderous inquiry into morality of pragmatic \"dirty cops\" who bend the rules for the greater good. Pacino’s character is far from innocent, but at the end of the day does the end justify the means? Are his past illegal actions excused by the all good that comes from them?At the beginning he is more or less comfortable with the reality that he has all this time been doing the right thing, but this idea is called into question the young and inquisitive Ellie Burr, who is played by Hillary Swank adding yet another stellar performance on top of both Pacino and Williams. In the end I could go on and on about why this movie is underrated, and why I believe it is one of Nolan’s best films, but for the sake of brevity I’ll leave it here. Ultimately Insomnia is a fantastic psychological thriller that has a lot more to it than meets the eye. It’s high levels of stress and themes of moral ambiguity are perfectly executed due to the stellar cast, fantastic editing and gorgeous contrasting cinematography and music."}, {"rating": "7", "text": "Even before Christopher Nolan started directing the Batman trilogy, he managed to serve us a film called Insomnia. His previous films were pretty psycho so I was expecting something like that here, but I wasn't quite there. I can't say I was disappointed though. The film is not as mysterious as the previous ones, but the plot is cool. From one particular action moment onwards, I was just waiting to see how the film would end, and in the end I was satisfied. On top of that, the casting of the main character is impeccable in the form of Al Pacino, who this time has put his hands away from criminal activities like The Godfather or Scarface and follows the footsteps of a detective investigating the disappearance of a young girl. For me, a good film that I recommend."}, {"rating": "7", "text": "A quite good crime thriller, being the script and performances its strenghts. On the other hand, it falls a  bit short and plain when comparing it to other films from the same genre and I found direction in some scenes a bit weird. It also is the least \"Nolanesque\" movie of his filmography."}, {"rating": "10", "text": "A complex, clever and surprising story with the unique play of Al Pacino and Robin Williams with a wonderful ending."}, {"rating": "9", "text": "ningjghfgfgdqweertyyuioppllkjhhggfdssazxcvvbnnmlkkopoiuuyyttreewqassdfghnnkkljmmmnbbvcxzzryjjoopkjhhfdsadgjkkkhg"}, {"rating": "10", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."}, {"rating": "10", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙☆☆☆☆☆⊙⊙⊙⊙⊙●■●■●■●■●■●■●■●$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%"}, {"rating": "9", "text": "A Masterpiece...It's been a good while since I've gone to the movies and seen a movie that FULLY met my expectations. I had high expectations for Insomnia...with Al Pacino (one of my a favorite actors), Robin Williams (who I DEFINITELY prefer in serious roles, remember \"Awakenings\") and Christopher Nolan, who did Memento... I really expected this film to be something special. This film is simply a masterpiece. The whole look of the film, the wonderful, engaging story and the aura that Nolan presents with his filmmaking is brilliant. Pacino and Williams were absolutely dynamite in this film...I feel there should be Oscar nominations for these 2 .....Pacino especially. This film is highly recommended, I don't remember the last I came out of a movie theater as satisfied as I was with Insomnia. This is easily the best film I've seen so far this year."}, {"rating": "7", "text": "Los Angeles department agent Dormer is called to a country in Alaska to investigate the death of a girl. A colleague accompanies him. He collaborates with the young local policewoman Ellie, who considers Dormer a true legend. Running after the killer in the fog, Dormer accidentally kills his colleague and is not in a position, due to a certain investigation launched by his department, to take that responsibility. He blames the killer, but he has seen it all and believes he has the policeman in his hand. The two would therefore be linked by complicity. They meet, they are forced to protect each other. But Dormer is too honest to handle the game, and then the cop begins to understand.This movie is a solid thriller/crime story and there are some homages you can find here (such as Caroemter for example). This is not my favourite Nolan movie but it isn't his worst one."}, {"rating": "8", "text": "Insomnia is so under-rated. It doesn't get brought up enough when discussing Nolan or his filmography and it often gets lost in the shuffle of his more high profile films like The Dark Knight series, Interstellar, Inception or Dunkirk.Its pretty similar to films like Se7en and Wind River where the environment is just as much a character as the humans on screen. You have Hillary Swank, who is fantastic as this young, starstruck local detective whose a fan of Pacino, an LAPD detective whose slowly going mad from sleep deprivation and being unable to solve the murder of a young local girl. Robin Williams gives one of his best \"bad guy\" performances here as a local crime writer whose a suspect in the murder. Its not as flashy as Nolans aforementioned work but its still very very good."}], "recommendations": ["primal_fear", "from_hell", "the_fugitive", "chinatown", "catch_me_if_you_can", "casino", "arbitrage", "zodiac", "all_the_money_in_the_world", "conspiracy_theory", "breach", "donnie_brasco", "state_of_play", "black_mass", "body_of_lies", "a_most_wanted_man", "the_iceman", "the_godfather_part_ii", "the_devil_all_the_time", "the_untouchables", "the_score", "morgan", "along_came_a_spider", "the_lincoln_lawyer", "heat"]}