{
  "id": 2071,
  "title": "Instant Family",
  "starring": [
    "Mark Wahlberg",
    "Rose Byrne"
  ],
  "runtime": 118,
  "genre": [
    "Comedy"
  ],
  "description": "When Pete and Ellie decide to start a family, they stumble into the world of foster care adoption. They hope to take in one small child but when they meet three siblings, including a rebellious 15 year old girl, they find themselves speeding from zero to three kids overnight.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xYV1mODz99w7AjKDSQ7h2mzZhVe.jpg",
  "categories": {
    "plot": 7.6,
    "acting": 8.285714285714286,
    "ending": 6.25,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 6.0,
    "funny": 7.954545454545454,
    "action": 8.25
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I loved this movie!  It is sweet, funny, frustrating and heartwarming.  Rose Byrne and Mark Wahlberg are great as Ellie and Pete, a happily married couple who renovate and flip houses.  But, something is missing from their lives.  They decide to go to an adoption event and see what it is all about.  The story goes from there and we follow them through the fostering process and see all the pitfalls and difficulties they experience.  It is predictable and often too pat, but it is still fun to watch.  We all four enjoyed it very much."
    },
    {
      "rating": "7",
      "text": "The movie was actually better than the previews led me to believe. Took my daughter & granddaughter and everyone enjoyed it. One scene was a bit racy but went right over my 7 yr old's head. ( At least we hope so ) Had some good life lessons intermingled into the story."
    },
    {
      "rating": "6",
      "text": "Who would have said that Mark Whalberg would come to offer a more satisfactory film in the one story in which no one expected it?Ironically his most recent entries in the action genre had been rather simplistic and in the drama field he had done nothing substantial in a couple of years. As it turns out, this modest family flick was all he needed.But unfortunately, it went unnoticed. Itbarely made twice it budget at the box office and yet I would choose it any day over films like Mile 22 or Daddy's Home 1 & 2."
    },
    {
      "rating": "9",
      "text": "Instant Family - 92% Funny, fast-paced, has some emotional moments, but overall terrific!"
    },
    {
      "rating": "10",
      "text": "This movie was just amazing. I just got so into this movie and I loved it so much. It really showed me what it is like to be a foster kid or a foster parent and some amazing stories about it and how you can change someone's life by doing it."
    },
    {
      "rating": "8",
      "text": "Blood is one thing to make you related to a group of people, but even without blood, this movie gives a powerful lesson, showing how love is what truely makes a group of people a real family. A great balance of humour too!"
    },
    {
      "rating": "10",
      "text": "This movie was beautiful and hilarious at the same time. I got teary eyed and cried a few times in this movie. The writing, story, and screenplay were hilarious, beautiful, and sad. The entire cast performances were stupendous especially Mark Wahlberg, Rose Byrne, Isabela Moner, Margo Martindale, Tig Notaro, Octavia Spencer, Gustavo Quiroz, Julianna Gamiz, and Julie Hagerty. Instant Family is my 2nd favorite comedy movie ever, my 3rd favorite drama movie ever, one of my top 5 favorite movies of 2018, and one of my favorite movies of all time. A+."
    },
    {
      "rating": "3",
      "text": "Many scenes in this movie feel awkward and I think the main reason is that it is heavily focused on convincing the audience of the value of foster parenting.  It is way too preachy."
    },
    {
      "rating": "9",
      "text": "First of all, the acting in this film just perfect. In every scene, you can see and tell that all the actors and actresses were giving it their one hundred and ten percent. Mark Wahlberg and Rose Byrne played compelling characters that seemed like real people. I think any parent will be able to relate to them in one way or another. The kid actors did great, especially Isabela Moner who plays Lizzy. Just like how Mark and Rose played characters parents can relate to Isabela played a character that a majority of teens can relate to. I know I could easily relate to her. The pacing in the film was surprisingly great. I thought for a film like this they would want to rush some scenes but no. All the scenes seemed to have the perfect pacing in them and only a few of them were cut a bit too short but that didn’t bother me too much. The humour in this film was placed in the right places and didn’t seem forced. This film will take you on an emotional rollercoaster. At some parts, you’ll be happy and laughing while in others trying to hold back tears. I also really enjoyed how the film felt like you were a fly on the wall during all the scenes. I think my only big problem with this film is when they tried to throw more conflict into the film. I won’t say what they did but it was unnecessary and could have just been cut out of the film altogether. Also, the few scenes that should have been longer but weren’t also kind of bugged me but didn’t ruin my enjoyment of the film. In the end, this film is an excellent film for the whole family to go and see."
    },
    {
      "rating": "6",
      "text": "Alright film about family and separation. You have seen this before trust me I knew everything before the movie started and I predicted it exactly. It sometimes is really funny and sweet, best performance from Rose Byrne, but it never goes to some amazing comedic and new place. Its the same cliched fun family film that you parents can take your 15 year old's to if they are to old for Ralph breaks the internet. Which trust me see Ralph Breaks the internet instead. But this one is always there for a matinee. 6/10"
    },
    {
      "rating": "3",
      "text": "I can't imagine what more can be done to show that this is a propaganda movie. There is everything leftwing progressives need.Moviewise one of the irritating parts was about quick cuts to just roll the movie like to show the necessary things and at the end to get you emotional.To be fair, the movie does show some of the difficulties of adopting kids but if they made a little less perfect and rich families, it would be more realistic."
    },
    {
      "rating": "0",
      "text": "marky mark should’ve stayed in the funky bunchI’m so grateful for my best friend Olivia who made me come watch this movieAlso I love harry styles"
    },
    {
      "rating": "5",
      "text": "The critics were a little easy on this one.  It's competently made, but you've seen this little story 100 times before on after-school specials and Lifetime movies.  Rose Byrne really saves it. She's awesome."
    },
    {
      "rating": "7",
      "text": "As a chronic cynic who thought this movie looked like vacuous drivel based on its initial trailers and TV spots, I honestly could not be more surprised by it and ashamed of myself in turn. By God, not only does it have something to say, but it's actually quite effective at communicating it. Pulling from co-writer/director Sean Anders's true-to-life experiences as a foster parent, this has to be the most meaningful and agreeable film of the guy's career. I usually don't say this of a director whose other films I haven't seen, but with Anders's other films consisting of \"Sex Drive,\" \"That's My Boy\" and the two \"Daddy's Home\" movies, am I really that off-base here? With this, it's the honesty that hooked me. This is a movie that isn't afraid to rattle off and address the litany of issues that have plagued the American foster care system and the difficulties associated with being foster parent/child. Even if it has its missteps along the way, I have to commend the project for even attempting to touch on topics like this, let alone within a studio comedy setting. Major props to Anders and everyone else involved for crafting something that — in addition to being a genuinely entertaining and surprisingly humorous watch — could make a difference in someone's life."
    },
    {
      "rating": "9",
      "text": "A genuinely heartfelt story that sheds light on the struggles of adoption on both sides of the fence. The actors all bring it here with Rose Bryne, Isabella Moner, Octavia Spencer and even Mark Wahlberg churning in a very real performance showing much versatility from his usual tough guy action star films. Instant Family was a pleasant surprise"
    },
    {
      "rating": "6",
      "text": "Instant family has fun with its concept at the expense of the more dramatic qualities in the plot. Overall, to me it felt like an average viewing experience which is a shame as it could have been far more compelling as a drama. Worth a watch."
    },
    {
      "rating": "6",
      "text": "Adopt And Adapt.Instant FamilyAnders has methods that are often on trial and questioned at times, but no matter how far away the film is from being perfect, it is undeniably and thoroughly entertaining. The tear jerking acts of the film comes in handy with the concept but what's surprising is the slick humor of the script. The screenwriters Sean Anders (the director) and John Morris tries way too hard on drawing on the laughs between these big wallop of dramatic antics, and even though you can practically see them sweating behind the camera to try and tickle you, for the most part of the film they do succeed.And primarily, I think this is their major contender- the surprise factor- since it is made with your typical format and textbook structure, one does not presume to have fun time. Does it get you? Yes, it does. And at times the writing does go manipulative but the film has a big heart for you to let few things go by, you wouldn't mind doing so, in fact, you'll love it. The support meetings are genuinely fun, with some cheap shots and repetitive jokes, the energy of that room is something we all connect and nod to.The kids are allotted few characteristics to stick by; like the boy always gets himself hurt, which shucks away the integrity, but then it also draws in few chuckles. Rose Byrne as the mother of this family is sweet but unfortunately nothing more than that, despite of her irritation or annoyance towards the work that goes into it, barely anything else communicates to you. Mark Wahlberg as the father too looks a bit constrained and not in his A game on this one, although in his hectic last act, his meltdown is definitely powerful. Instant Family is exactly it sounds like, fast, flawed and heartwarming."
    },
    {
      "rating": "9",
      "text": "This is such a strong movie. I will not say great movie, because it does have it`s flaws. Possibly the greatest adoption movie ever. It feels real, the emotions, the high and lows. But it`s message is strong and truly makes you think about your life. I love all the main cast. Mark and Rose and especially the kids."
    },
    {
      "rating": "5",
      "text": "No es chistosa, los niños son antipaticos, lo unico rescatable de la pelicula, son los 3 protagonistas."
    },
    {
      "rating": "8",
      "text": "You can’t help but feel enamoured by its happy-go-lucky feel, reinforced more by Michael Andrews’ breezy, almost Ferris Bueller-esque composition; both airy and poppy. While the running time stretches out just a little too much and some jokes don’t feel as natural as others, Anders’ endless optimism takes over in a film that, honestly, not many really expected to be such a success. Any moment of gooey schmaltz by the end feels completely earned, triggering a flutter of the heart rather than a roll of the eyes – including a near sinful use of Starship."
    },
    {
      "rating": "8",
      "text": "While it has a few forced unfunny jokes, \"Instant Family\" successfully brings comedy and heart together into a satisfying film."
    },
    {
      "rating": "8",
      "text": "Very enjoyable movie overall, interesting and solid performances from the cast."
    },
    {
      "rating": "5",
      "text": "This is a really cheesy and I mean REALLY cheesy film. The characters are nice enough and its an easy and alright watch but its certainly cliched. There are a few amusing moments and I guess it raises an important topic, that of foster children and the care system in general I suppose. I'd have given it a higher rating if it weren't for the last 2-3 scenes, which tipped the balance to unavoidably/overly cliched and cheesy, I felt. The performances are good enough, especially Isabela Merced, who plays the older foster child, Lizzy.This film is ok but I wouldn't go out of your way to see it as such and so I wouldn't especially recommend it, no."
    },
    {
      "rating": "7",
      "text": "This is one of those movies that is just hard to review. The casting was great, with some big names including Mark Wahlberg, who performed well in this lighthearted film. I'm going to start with the comedy. The movie had funny slapstick comedy situations, with a solid bit of shock humor. The movie featured a disgusting scene that I don't care to talk about. Other than that sexual pile of goop and the 'beaner' gag, the movie took a lighthearted, and family friendly approach to humor. The movie tackled a serious topic in the form of foster kids, adoption, crime, and more. The problem with the drama implemented in this film was that there was always a cliché, happy ending to the situation. The ending was picture perfect, and everything felt so forced. That doesn't work when you're trying to make a drama. Though there are seemingly a ton of things I didn't like, it was an enjoyable crowd pleaser. Be in the right mindset to enjoy this."
    },
    {
      "rating": "9",
      "text": "As my girlfriend and I were attempting to figure out what movie to watch this evening, she brought up this movie and after watching the trailer I immediately dismissed it claiming we could do better. Eventually, our options ran dry and we decided that we could not in fact do better. This movie was genuinely funnier than I thought. More heartfelt than I anticipated. Brought me closer to tears than I had imagined possible. Don't be a pretentious cinema viewer like me and judge this movie by its undistinguished poster. Instant Family is not just another 2 hour cliché. You'd be hard pressed to find a movie with smart and daring humor like this, with actual life lessons for any age, and a character dynamic that makes you fear the impending credit roll only because you want to see this cast flourish and expand these roles in perpetuity. Many movies struggle to contain one of these qualities, yet Instant Family wraps them all up into one big package that will be understandably, yet tragically, overlooked by too many viewers."
    },
    {
      "rating": "7",
      "text": "Es una buena película, aunque no se enfoca mucho en la comedia; la trama es muy buena, las actuaciones son excelentes y la música es decente; la duración pudo ser reducida un poco, aunque sigue siendo una entretenida y conmovedora experiencia."
    },
    {
      "rating": "9",
      "text": "Ill be honest, I don't understand how the critic score is so low. I'm hit or miss when it comes to Mark Wahlberg movies but this was such a sweet comedy and genuinely did brilliantly in making the emotional scenes investing. The comedy you can take it or leave it but there are some genuine laughs even if subtle. Definitely been one of the better movies i've seen recently.The dynamic between Mark, Rose and Isabella is definitely one of the shining lights and the younger kids have some really funny bits as well as delivering in making you care about what happens in the end."
    },
    {
      "rating": "8",
      "text": "A beautiful movie that really shows that the family arrangement, whether bound by blood or not,  is a divine gift that provides an ideal setting for displaying unselfish love. The movie gets you tied in emotionally to the idea that family is a beautiful garden that provides a refreshing refuge from the stress of everyday life and shows that such a haven is not automatic, so family bonds have to be built, strengthened, maintained and the journey is so worth it."
    }
  ],
  "recommendations": [
    "the_big_sick",
    "little_miss_sunshine",
    "the_edge_of_seventeen",
    "moonrise_kingdom",
    "captain_fantastic",
    "seeking_a_friend_for_the_end_of_the_world",
    "me_and_earl_and_the_dying_girl",
    "the_king_of_staten_island",
    "chef",
    "the_intern",
    "the_spectacular_now",
    "palm_springs",
    "we_bought_a_zoo",
    "the_family",
    "midnight_sun",
    "silver_linings_playbook",
    "the_upside",
    "3_idiots",
    "christopher_robin",
    "spanglish",
    "eddie_the_eagle",
    "last_christmas",
    "wonder",
    "click",
    "the_perks_of_being_a_wallflower"
  ]
}