{"id": 297, "title": "Interstellar", "starring": ["Matthew McConaughey", "Anne Hathaway"], "runtime": 169, "genre": ["Adventure", "Drama", "Science Fiction"], "description": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.", "releaseYear": "2014", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/gEU2QniE6E77NI6lCU6MxlNBvIx.jpg", "categories": {"plot": 6.389830508474576, "acting": 6.076923076923077, "ending": 5.888888888888889, "soundtrack": 4.8, "cinematography": 5.0, "familyFriendly": 5.8, "funny": 4.25, "action": 6.166666666666667}, "reviews": [{"rating": "10", "text": "The best thing about Interstellar is that, like Inception, the science and the ideas are as real, as sophisticated, and as advanced, as any ideas out there. If you see a critic or somebody saying this is convoluted or overly complex that says more about their lack of understanding than about the movie. We should be thrilled Nolan is thinking about and making movies about these things. Bravo."}, {"rating": "10", "text": "Christopher Nolan did it again; Interstellar will twist your mind and fill your heart with love. Interstellar isn't just a massive space-adventure. It's much more than that; it’s a film about human bonding.\r Interstellar is by far the best sci-fi film of the year, and one of the greatest of all time. The vast storyline about the connection between us humans is so incredible, I felt so attracted to the characters and I almost started crying because it's so dramatic and epic. I usually don't feel so attracted to the characters like in Interstellar, so this was just so incredible! When it comes to the actors and their roles, are they all superb. Matthew McConaughey as Cooper is just fantastic; he's both dramatic and stunning in action. Jessica Chastain and Mackenzie Foy as Murph are both awesome, even a bit touching. One aspect of Interstellar (when it comes to the actors) is that there's one actor I didn't expect to be in this film, so it was a big surprise! There's even some humor between the characters in this film, which I didn't expect. As mentioned, the story is wonderful, but there might be some slow scenes in the end of the first act, but the ending explained it all so there's nothing wrong about it!\r Interstellar is a film that just kept going and going when I saw it. I thought it would end like 3 or 4 times but instead it just continued with even more exiting and innovated things that I never have seen before. I can tell you this: if you thought Inception was something innovating and spectacular, go and watch Interstellar, you won't regret it! Some people think the last act of the film is less impressive, but I don't agree, it's fantastic! The structure of Interstellar is in my opinion very similar with The Prestige, maybe not as excessive but I totally love it! It's so clear that this is a film by Christopher Nolan, just the visuals are incredible and I was so amazed while watching it. It even looks more real than the film Gravity, and the first 30 minutes of Interstellar is totally superior than Gravity. I couldn't even see if there are CGI in this film, and that there's no 3D is a great thing!\r There are some minor flaws in the film, and the first thing is the soundtrack. Yes it's from the famous composer Hans Zimmer, and I love his previous works like the music in The Dark Knight Trilogy and in the film Inception. But it's not exactly as massive and touching as I thought it would be. It's still impressive, but not as vast or touching. Another thing is the first act of the film; it felt like they had cut too much scenes, because it felt a bit to fast. There could also have been a bit more action. The last aspect is the trailer, it doesn't spoil much about the film, but I think they should have shown less of the visuals. It could have resulted in even more surprising things with the film.\r This is the best film from Christopher Nolan to date, but it's not a perfect film. Even though, I don't think we need to wait that long until he creates something even more spectacular than Interstellar.\r Interstellar get a 9.5/10"}, {"rating": "10", "text": "Music perfectly falls on the picture, the story can not tear myself away from the screen for almost three hours. This is simply the best modern sci-fi film. And don't forget, story based on Kip Thorne works, and theoretically it can be true! ^_^"}, {"rating": "9", "text": "In my opinion, Interstellar certainly lives up to the hype. Words simply can't describe the experience I had while watching this movie unfold before my eyes in that glorious 70 MM Imax format. The visuals were jaw dropping, acting was superb, and the story was filled with originality and hand full of surprises along the way. There is so much to this movie you don't know about when you go into seeing it for the first time, which was a huge plus! The less you know about the story for this movie, the better. While there are a lot of positives for this movie, my only complaint would have to be the pacing of the story. There were a couple instances where I felt like the story was being rushed and that I had to just go along with what was going on at those points. Despite the movie being almost three hours long, I kinda wish it could be a little longer so that the story could progress more naturally. Other than that, I have no other negatives to mention. I walked out of the theater feeling satisfied and wanting to experience it again! And probably will!"}, {"rating": "10", "text": "Not a film about science as we commonly understand it. In fact, Interstellar works hard to convince you to see science in unimagined ways and this (that most critics are using as a reason why the film fails) is its strongest asset. A film with incredible imagination, Interstellar weaves reductive iterations of themes like exploration, love and time together so cohesively that the audience is challenged to see them each with new wonder.\r Anne Hathaway is given one of her most complex roles to date and her work here is both efficient and subtle. Technically, the editing, cinematography and score all work hard to bring the ideas of the story to new heights."}, {"rating": "10", "text": "I emplore everyone to put the critics aside and go into this film with an open mind.  It does get pretty science-y but do not let that stop you!  This movie is a brilliant opus to both 2001 (with a MUCH more satisfying climax) not saying the end of 2001 is bad, also another amazing movie.  There is also some subtle points to the movie The Black Hole.  If you have seen both of these, movies then you should get the references.  Jaw-dropping soundtrack!  Cinematography is some of the best that I have seen this year.  I really feel that this is Nolan's love letter to the genre.  The movie is not without fault though, but everything blended so WELL that I still gave it a 10.  I have not had a movie invoke so much emotion as this one did in a long time!  One more thing to note, if you plan on seeing this, please see it in 70MM IMAX!  It just adds to the size and scope of the movie!"}, {"rating": "5", "text": "Interstellar may have been scientifically accurate but that doesn't excuse it of its thematic flaws.\rFoe one I think it's tediously wordy at times. There's a lot of unnecessary dialogue that just takes away from the emotional heart of the film - like that bloke who starts explaining why worm holes ought to be spherical in 3 dimensions using flowcharts and diagrams. What was the point of doing that? For one you'd think a Nasa pilot whose mission is to enter a wormhole would know that but more importantly it degraded a thrilling moment (entering the wormhole) with a bunch of prose. And there's a lot of this in the film. The part on Newton's 3rd law made me cringe.\r Characters explain the effects of warped space-time to each other and throw away cheesy relativity punch lines but they hardly ever have real human moments. I would've preferred if the film explained none of its scientific complexities. Let the audience rise up to the occasion, let them figure it out. But this is where Nolan's commercial instinct takes over. I get that he's trying to sell the film to a wider demographic and I get that there had to be some amount of exposition but Nolan does this to such an extent that it takes away the humanity of his characters. Why should I care about them? Exposition is a cheap alternative for not being able to convey your ideas through imagery. Anne Hathaway's Dr. Brandt is a poorly written character because midway through the film, her personality just flips in a dime and we have a new character clothed in the same flesh. She's introduced as a stern and no-nonsense woman but later on she starts spewing the most nonsensical things in the movie - like that \"love is quantifiable\" baloney she's obsessed with. Again just shows you Nolan's women can't be strong women, they can only be strong lovers. I was shocked in the end when I found out that Cooper and Brandt were supposed to end up together. Was there any chemistry there? And then you have Matt Damon who's not really a character but a walking wikipedia that's there only to list the pro's and cons of being human - the performance doesn't help either.\r The part of the film that needed explaining is the sci-fi-y part (which you can't look up in a book) about how humans are planning to leave the planet. In fact I still don't understand it. So the astronauts went searching for some specific numerical data required for solving some equation that could be found only inside the black hole but how would the unification of general relativity and quantum mechanics help us leave the planet. In fact how did we leave the planet? Weren't we out of fuel? I'm not trying to poke holes or anything. I just don't get it.\r There's things that the movie does very honestly and get's right - like the relationship between Murphy and Cooper but I also think there's stuff the film gets very wrong. The best scene Nolan's ever directed is from the Dark Knight when the Joker leans out of the police car and shakes his head in glee. There's no dialogue, there's no music but it's a haunting and beautiful sequence that conveys volumes. In my opinion Interstellar never achieves that sort of artistry. I still liked it but I don't think it's as good as recent sic-fi films such as Wall-E, A.I., Children of Men, Minority Report, Eternal Sunshine of Spotless Mind or Nolan's own the Prestige. Interstellar may leave one feeling completely indifferent or deeply moved. Sadly I'm among those who felt it was contrived, unfocussed and eventually self-defeating."}, {"rating": "9", "text": "An absolute visual feast, Interstellar delivers on its promises, and it actually - believe it or not - has a more satisfying ending than 2001.  Not that the story is superior to Kubrick's classic, but there's a heart to it that I did not expect.  I enjoyed the science - it does not talk down to its audience, and I can say I learned a few things.    I especially enjoyed the robots with their matter-of-fact voices/affect.  Though they don't have a human appearance - they initially appear super clunky (until you come to realize what they're capable of) - you instantly feel comfortable with them, which I credit in great part to the incredible voice acting of Bill Irwin.  The father-daughter story is touching - both the young actress and Chastain are tremendous.  McConaughey, if you've seen him in True Detective, does not disappoint."}, {"rating": "10", "text": "this is other masterpiece movie from Mr.Nolan. the visualy are very stunning and it hase an emotional aspect. Well done Nolan!!! i was blown away for the second time and i will go tomorrow for the thirth time to enjoy his movie in Imax format, because that is the only experience that you can see it in the cinema."}, {"rating": "4", "text": "Very disappointing.  Everything is done for cool visuals and nothing makes sense.  Serious and pretentious and ultimately boring.  Wants to be about the future of the human race, but ends up being about the power of love.  ;-/  There's a lot of great visual references to 2001 and some good humor actually, but you can't help wondering how the script was green lit.  It could have been great if he had taken more (or less) LSD!"}, {"rating": "10", "text": "I am not a Nolanite. Maybe I'm an anti-Nolanite. I have nothing but contempt for movies about comic book superheroes. I hated Inception. I went into this movie with enough baggage to get me thrown off a plane.\r It was superb. It was mind-blowing. I'm old. I saw 2001 when it originally came out, when everybody who saw it, came out saying \"WTF?\" Then, people discovered watching 2001 while high - and everything fell into place!\r During the (controversial) 3rd act, I was back in 2001 (and wondering where I left my bong years before..). I didn't really need to heighten the sensation though, Nolan bombarded the audience with son et lumieres and McConaughey bombarded the audience with the most beautifully wrought portrayal of abject desperation and unconditional love I've ever seen on screen.\r It broke my heart and I'm cynical as hell. The screenplay was serviceable, the dialogue was atrocious (this is Nolan after all), but it didn't matter. The visuals made Gravity look like it was filmed on an IPhone. The performances? Even Anne Hathaway was fine. Jessica Chastain and Mackenzie Foy, I shall forever revere. But McConaughey? Good God, this man is working on a level unknown to other actors. Absolutely electrifying. Not the Oscar bait that the Academy usually rewards, I think a Nobel Prize is in order.\r I never suspected a film would come along this year that could threaten my beloved Boyhood's hold on my heart, yet Interstellar comes perilously close."}, {"rating": "9", "text": "Unlike his usual blockbuster style, Nolan has challenged both himself and the audiences a greater depth in this stunning space opera creatively. Slightly clinched and flawed in term of plot wise, this pure hard science fiction that stresses a lot on Quantum theories, space elements, astrophysics, time, gravity and the rushing, complex and slightly illogical third act might squeeze one's mind in this heavy 3 hours mission, but the worthy and meaningful dialogues, enormous expansion from the universe in Gravity, strong and connecting relationship between father and daughter have overall made the film entertaining, thrilling and thought-provoking. Hans Zimmer﻿ follows the director's effort in terms of scoring, which the musics sound more emotional, calm and creepy rather than the usual loud and powerful style; award-winning cinematographer Hoyte van Hoytema did perfect job to present stunning, immersive and state-of-the-art visual effects of the space, wormholes, black hole and unknown planets beyond our galaxy. It might not be the most epic and perfect film, but this love letter from Nolan which is heavily inspired by 2001: A Space Odyssey, sending through the time and gravity somehow represents a rare film that begins and ends so beautifully and stellar."}, {"rating": "5", "text": "A surprisingly underwhelming offering sorely in need of judicious editing, better writing and a clearer focus. Despite capable performances by Matthew McConaughey, Matt Damon and Jessica Chastain, as well as an emotive score and terrific sound, the picture suffers from largely mediocre special effects, uneven pacing, underdeveloped characters, bland supporting performances and a choppy, bloated script. When telling a tale that aspires to epic heights, the worst offense a director can commit is to make the story boring, which is precisely what has happened here. Don't believe the hype; this release is far from what it could and should have been."}, {"rating": "10", "text": "The best sci-fi movie for 2014. It has a mixture of human psychology, drama, sci-fi and actions. I felt the movie was a bit short even if it's almost 3 hours long, extra 15 minutes would do. Good ending and it worth my time in the big screen."}, {"rating": "2", "text": "I don’t know at what point I stopped caring about the main characters in “Interstellar” but it must have been upon losing all interest as to whether they ’make it’ or don’t. Or it may have been at the one point a crew member is lost and the reaction was, “So what?”\r The film is long, at 169 minutes, with a lot of forgettable science verbiage that is forgotten by most of the audience before the credits start running. Will even the science nerds in the audience remember the dialogue regarding the black hole or the worm hole? Isn’t it enough to say that  one hour in space will equal 7 hours on earth without getting into quantum theories? I’d rather hear how Anne Hathaway’s hair stays so sculptured after having a space helmet on for a flight, walking in water and on ice plus the gravity experienced, which is talked about but doesn’t seem to affect hairdos!\r Director Christopher Nolan and co-writer of the script with his brother Jonathan, seem to know what they want to say when dealing with family relationships but when the abruptly take off space they seem to get lost. “Gravity” set the bar high for filming in space and spaceships and “Interstellar” comes nowhere near those scenes and feelings. The Nolans, along with the Director of Photography Hoyte van Hoytema, get the feel, sights and sounds of earth drying up and the possibility of the end of earth is made believable as are the various family relations, but once the movie blasts off to space everything comes to a halt except for a robot that seems more livelier than the humans.\r The cast do what they can with what they got but Matthew McConaughey as Cooper, former test pilot who is brought back to lead this mission to find a place that the humans on earth can move to before they die, is fine in the father and daughter scenes but does not bring much to the hero aspect of the film. Oh, and a side note, he does need to put on some of the  weight he lost for “Dallas Buyers Club”. Anne Hathaway has a thankless part while Michael Caine as her father gets to repeat Dylan Thomas”s poem “Do not go gentle into that good night” a few times. Murph, Cooper’s daughter, is played by 3 actresses and as the 10 year old Mackenzie Foy is a stand out while Jessica Chastain as Murph in her 30s has nothing to do but being angry.\r David Gyasi and Wes Bently as the crew working with McConaughey and Hathaway, along with computerized robot voiced by Bill Irwin, are more than adequate. They are 3 other actors, not to be named, in the film so as not to provide spoilers. Also Casey Affleck, as Murph’s brother, in an underwritten role does what he can with it.\r Ah yes I must give credit to Hans Zimmer for the too often loud music, signifying nothing, for keeping me awake in the last hour of “Interstellar”."}, {"rating": "3", "text": "Here we go again reviewing yet another failed giant which clocks in at a butt numbing 169 minutes. It's an ambitious but flawed venture that is big in concept, big in budget and explores  big themes. Sadly what this all adds up to is a big disappointment. The story, full of as many holes as there are black ones in space, is a mish mash of ideas which never really gel and one never quite gets a hold of what the point of it all is. The actors don't offer much by way of compensation either. Anne Hathaway shouldering the worst of the dialogue is the biggest casualty here, but Michael Caine is also tiresome as is Matt Damon who adds nothing. Matthew McConnaughey is better, but whatever emotion or empathy the film generates, and there are some very moving moments, are purely due to the wonderful Jessica Chastain. The film's biggest asset is her performance, although it's good to see film legend Ellen Burstyn showing all the others how it's done in just one tiny scene.\r The banal dialogue is often gibberish and causes the rolling of one's eyes in disbelief or embarrassment. Nearly all scenes are over extended and often one is inclined to tune out long before they are finished. The special effects are good, but aside from a couple of sequences (a huge wave and the final set piece involving McConnaughey and Chastain),there really isn't much that we haven't seen before. The music comes on strong and sounds like an extended version of Mike Oldfield's 'Tubular Bells' from 1973's 'The Exorcist', co incidentally starring Burstyn in one of her finest roles.\r The sound is very loud and effective during the set pieces, but is then often inaudible during simple dialogue exchanges between characters. I have no idea what Anne Hathaway was mumbling at the end in so pained a manner.\rThere are some marvellous compositions of the outside of the spacecraft filmed in complete silence, which are then judiciously cut with the sound included inside the ship. More of this and less dialogue would have been appreciated all round. Another gimmick that serves little purpose was the almost inevitable inclusion of the robot TARS. I would have recommended the removal of his power pack.\r Director Christopher Nolan is certainly full of ideas but, unfortunately, they are never fully realised. He comes over like a young boy trying to communicate a passion or a hobby that no one else gets. His direction is over indulgent and left me confused and bored. Perhaps after two dramatic failures (Inception was very similar in style, but an even worse film!) he should try his hand at comedy. After all laughter in a cinema in infinitely preferable to sleeping."}, {"rating": "2", "text": "*** spoilers ***\r While visually stunning, this is one of the most flawed films in recent memory. Flawed, because more time was spent rendering out the special effects than developing a screenplay worthy of the cast and budget. When you're a filmmaker who can make anything you want - on film - there is no excuse for your films to not bring something new to the table and work at a basic screenplay level.\r Interstellar does not ask new questions and with a script that literally feels like a first draft --I'm just shocked that Nolan didn't develop this more. The entire core of this film is the relationship between our lead Cooper and his daughter - but this is so rushed and honestly, extremely cheesy, that we don't care what happens. They spend far too much in time in space - with a ridiculous plot involving Matt Damon - and cut back to Earth is sporadic cuts that pull us into so many directions. There is no focus in this film.\r This film proves that the Nolan brothers can not handle a couple of things: writing females and writing emotional characters that we're attached to. The dialogue was laughable - over the top in many places - and basically just a ton of one-liners.\r We cut from Cooper learning he has to go to space - says goodbye - boom on the rocket - NO ATTACHMENT. There is zero development here - just get him to space, which fails to tell the core story well - which bites this movie in its ass in the third act. There are countless films that do this way better - Apollo 13, Close Encounters (they don't even go to space there) - if you want the audience to care about your characters then you have to spend more time making them care - not as much with the science and pizzaz - and I know everyone will love this movie, but it's not just minor flaws here - it's gaping holes in both motivation and development.\r Forced. Rushed. However you want to put it - I'm sorry folks - it's not a great movie - not even a good one. Everything is spoon fed to the audience - no, not just the science - the twists - I didn't know on the nose screen writing was so acceptable in Hollywood - guess it is. They talk about ghosts so many times within the first act that anyone with half a brain KNEW there was something there - and if you know anything about space travel, black holes - or any of the stuff that is talked about in the trailers - you can put two and two together and call the major twist in the FIRST ACT. I literally turned to my girlfriend and called it - as did the other 5 people we were with...\r And yes - I understood all the underlying themes and motifs he was playing with - love/gravity etc - but it wasn't enough to save a script where the characters aren't given room to breath."}, {"rating": "0", "text": "The more you know, the stupider this film seems. If you passed any high-school science class or played Kerbal Space Program for a few hours, you will want to retch. Some of the SFX will impress people who think loud music means drama. This is a fraud, an insult to the notion of science fiction."}, {"rating": "0", "text": "My first review for Metacritic. inspired to join to record my disappointment  with this film.  And I wasn't the only  one. People were leaving to go to loo thoughout the film, often a bad sign.  I honestly thought the film was 4 hours long.  Long scenes of boring dialogue.  Like other reviewers, I found it astonishing that one astronought would have to explain to another  what a worm hole was. And the robot was so unweildly. We conveniently skipped how it got in and out of the spacecraft. I love a good space movie. But give me Moon, Gravity or Apollo 13 any day."}, {"rating": "0", "text": "3 Of Us Fell Asleep, 6 Of Us - Out Of 7 - Hated It! That's the score from a group of 7 friends who went to see Interstellar tonight. If I hadn't been with friends I would have walked out!\r The only friend who liked it said she enjoys soap operas. That pretty much sums it up! IF YOU LIKE SOAP OPERAS YOU WILL LOVE INTERSTELLAR!\r There are so many plot holes several of us were cracking jokes by the end of the movie. So many parts of Interstellar are so ridiculous or makes no sense -whatsoever- it borders on camp. Sure the cinematography is magnificent. But in the end it's nothing but pretty wallpaper when the story is drawn out, tedious, annoying, maudlin, nonsensical, irrelevant, dopey and depressing. (I heard way too many violins in the soundtrack! LOL!)\r All I can say is when the only food humanity has left to eat is corn & corn products, then you are going to end up with a very corny movie!"}, {"rating": "3", "text": "Terrible performances and even worse writing, filled with gaping plot holes and over wrought direction.  It's a clunky mess of film.  Such a shame.  It had so much potential."}, {"rating": "6", "text": "Nolan is Michael Bay with a slightly longer attention span. Interstellar is filled with movie ruiners; Matt Damon, a Deus ex Machina ending, and sad characters; The daughter doesn't find resolution or make emotional sense in regards to her dad. This one was typical of Nolan's past style where what you see is what you get. It never finds new ground, a new level of artistry, or metaphor like 2001 did. This ain't Kubrick. The story is part JJ Abrams Star Trek, Astronaut Farmer, and any post apocalypse movie. It does not even surpass how fun Gravity was. The actors and sound designers all did a good job though. It has some cool moments where I thought it might be a great movie. The first half of the movie is great honestly. The fighting scenes and unoriginality seep back in. The previous mentioned movie ruiners really set this back. You might be thinking huh? When you figure out everything you realize that it doesn't set the bar higher."}, {"rating": "5", "text": "The plot ends up depending upon an absurd paradox.    It's not 'scientifically accurate' as some seem to believe either.   You can't effect the past in physics exactly because it results in the absurd paradoxes that are seen in this movie."}, {"rating": "10", "text": "Interstellar é, sem sombra de duvidas, o filme mais lindo e magnifico que já assisti.Por muito tempo, o considerei meu filme favorito. Com mais proximidade, fui conhecendo outras outras e aumentando meu repertorio cinéfilo. Dito isso, revi o filme após quase 2 anos - e já tendo o visto pelo menos umas 5 vezes; e devo dizer que estava um pouco receoso pois minha visão mudou muito com o tempo, mas fico feliz em dizer que minha visão me proporcionou outra experiencia, que diferente do que eu pensei, foi tão boa senão melhor do que das ultimas vezes.Agora pude observar aspectos que antes nem notara, sejam mais técnicos ou envolvendo roteiro. Ao assistir em 4K, numa tela grande, fica bem claro que Nolan faz filmes para o cinema especificamente. Quem teve o privilegio de assistir essa obra no cinema não sabe a sorte que tem - provavelmente sabe sim rs. O IMAX faz toda diferente, e as melhores fotografias vem daqui. Você fica hipnotizado, quase que literalmente. Principalmente no buraco de minhoca, qual eu acredito ser a retratação mais linda e complexa. A caracterização do mundo funciona bem, com uma poeira mortal, sem contar nas plantações infestadas. Acredito que poderiam ter dito algo no subtexto para os países a fora, mas tudo bem, minha ligação com a trama e os personagens é tanta que nem penso nisso. E o que falar da OST de Hans Zimmer? A melhor dele, senão uma das melhores. Essa parceria com o Nolan é uma das melhores coisas do cinema. A retratação do universo mais essa trilha é simplesmente uma obra de arte completa. MasterPiece.Eu gosto muito dos personagens, e as cenas dramáticas me pegam de jeito, principalmente nas primeiras vezes que assisti. O plot twist é maravilhoso, e pra quem gosta de viajar nas sci-fi da vida, se entregar ao mistério e não se acomodar a respostas, esse filme é pra você. E alguns \"subplots\" como um todo funcionam bem. Matthew McConaughey tá excelente, mais uma vez se provando um ator completo. Mackenzie Foy me surpreendeu, tendo um futuro muito promissor. Menções honrosas a Jessica Chastain, Matt Damon e Michael Caine, que estão excelentes.O trabalho de mixagem e edição de som é muito bem feito, sendo obrigatório assistir com um fone de ouvido bacana pra imergir completamente. O filme tem 3 horas mas parece que se passam 1h e meia. Os planetas são magníficos, uma real experiencia IMAX. A caracterização de todos é ótima, mal dando pra acreditar que, de fato, foram filmadas na terra. Os personagens também são bem desenvolvidos, pelo menos os principais. Algumas coisas tu só pega na segunda ou sexta vez assistindo...Enfim, Interstellar é uma obra obrigatória a qualquer cinéfilo, e tem tudo que um filme precisa ter para ser uma verdadeira obra de arte. Nora 10.Audio: English, no subtitles [14°] - Zenfone Earphones [Dolby 2.0]Quality: 4K HDR [Bluray]"}, {"rating": "5", "text": "I am really  not a fan of this movie.The visuals are great and I'm sure the science is very accurate and that's very impressive... but the writing is total mess.I never liked how Cooper completely ignores his son Tom, who he clearly loves less than Murph. I never liked Brand's awful monolgue about love. I get that she's supposed to be wrong and irrational and over-emotional in this scene (isn't she supposed to be a scientist?), but she's proven right in the end, which just sucks for so many reasons. I mean, they seriously made the only female scientist on board be the one that almost jeopardizes the mission because she gets emotional and misses her boyfriend. Yikes.I never liked dialogue. I've always had a problem with how Nolan movies are written. Full of endless exposition and corny speeches that are meant to be deep, and this is no different.The following is an actual conversatiom from the movie:-------------------------------------------------------------COOPER: All of this, is one little girl's bedroom, every moment! It's infinitely complex! They have access, to infinite time and space, but they're not bound by anything! They can't find a specific place in time, they can't communicate. That's why I'm here. I'm gonna find a way to tell Murph, just like I found this moment.TARS: How, Cooper?COOPER: Love, TARS, love.-------------------------------------------------------------This movie wants to be 2001: A Space Odyssey, but it feels like Nolan didn't trust the audience to be smart enough to understand the film like Kubrick did, so instead of conveying its themes and science visually like 2001, he makes the characters constantly explain the science to the audience and give long speeches about whatever he's trying to say. It's like he thinks we're babies or something.I like most Nolan films, but this just feels like he didn't respect the viewer's intelligence enough, and it turns what could have been a poetic space epic into a bunch of boring characters telling us what's going on at all times."}, {"rating": "5", "text": "Christopher Nolan is the smartest writer/director in Hollywood, so smart that a lot of people claim his films are over their heads. The master of twists and deception made Batman real, showed us how dreams work in Inception, and brought us inside the dangerous world of magic in the Presitige. In his latest film, Interstellar, Nolan tackles the concept of time and how different it is from what we perceive. This film does have a great twist in the end and some terrific special effects, but beyond that it is one of the longest and slowest moving films I've seen in years. Once again, Humans have finally destroyed Earth and have gone looking for a new home, but outside our solar system, things are much different than they appear. Time and gravity are different concepts in different regions of space, and the effects on the crew, who had hoped to one day see their families again, diminish with each passing day. Matthew McConaughey stars and as is the case with most of his films, he's terrific. Based on some of the poor choices he made in his younger years, he has a bad rep among critics, but the fact is that he's always fun to watch, and is one of the most intense actors out there today. As for the rest of the film, it's usually Nolan's genius that makes the film unique and special, but in this instance he was too smart for his own good. The story moves very slowly and at times is more than somewhat confusing, not to mention at nearly three hours long, it's a challenge to sit through to even reach his famous twist at the end. Nolan films are something I always look forward to, as they are different and both entertain me and make me think, but in this case, I was just beyond bored and fed up with the whole thing. I guess sometimes even genius takes a holiday."}, {"rating": "5", "text": "At the end of the day, this is a movie. Whether or not the science behind it is realistic or not is irrelevant. As a movie it is meant to entertain. Does it do that? Here and there.\r The movie does have a clever premise, but it also feels like the writers dumbed it down a bit too much. Pacing is slug like at times. It takes way to long for the movie to go anywhere, and when it does, it does so in sporadic bursts.\r While the story is an interesting one, it is far too predictable. No real surprises. It feels like this was done deliberately to ensure a broader audience could follow the narrative.\r Matthew McConaughey does do his very best. In fact I kinda think he overdid it at times. I give him credit, he knows how to cry on queue. Other than him, none of the other cast were memorable.\r Overall:\rInterstellar is a good idea that just was far too dull the way it was executed. Either do the Hollywood thing, or do the artsy thing. Don't try to do both.\r Side Note:\rAnyone else wonder why McConaughey's skin looked orange in the movie?"}, {"rating": "5", "text": "It seems that Nolan decided to outdo Kubrick's \"2001: A Space Odyssey\". To hog the laurels of the best sci-fi movie. Dubious attempt, given the disparity of talents. But what Nolan really quietly \"taken over\", is a Paul Anderson's story \"Kyrie\", replacing supernova by black hole, telepathy by gravity, and stuffing it by cheap and highly implausible melodrama. The result is another \"Batman\" - not a masterpiece movie picture a la Kubrick, with his attention to details and authenticity, but a grotesque movie-SF- comics, caricature Gargantua. However, Nolan's talent was enough to make this inappropriately stretched movie to be quite fascinating for what he could receive 6 out of 10, but taking into account the theft of Paul Anderson's idea, 5 out of 10 will be the most honest assessment."}, {"rating": "9", "text": "This movie is like 2 in one: The first part is more about a nature catastrophe on earth in the future USA and we get to know the family of the protagonist. The 2nd part is about the universe, dimensions and the interactions with the scientists. The characters are well written and the connection between Cooper and his daughter was often beautiful."}, {"rating": "6", "text": "This movie is not nearly as great as the hype it recieved. Nolan just is trying to be a better director on emotional levels, but he simply cant. Get over it Nolan!"}, {"rating": "6", "text": "A much anticipated movie displaying tones of '2001' especially the classical music laced over the visual backdrop of space and the 'trapped in time-like' ending. A strong performance from McConaughey and a reasonable plot although displaced by a somewhat 'Hollywood style' last 20 minutes. This could have been so much more..... Space visuals were pretty ordinary, good effects Re spacecraft and... It just seemed to go nowhere!!! A good movie, but could have been far more superior than what was delivered."}, {"rating": "4", "text": "Christopher Nolan seems to draw a buzzing mass of Nolan-fanatics wherever he goes. These little buzzers swarm around The Light That Is Nolan and in His light, nothing can ever go wrong. Who cares if Bane’s death in The Dark Knight Rises was ridiculous?\r Okay I get it, Memento was ingenious, The Dark Knight set new standards for the superhero-scope of the cinemaverse, but Nolan sure doesn’t have the Midas hand of movie-making. He’s a man, he makes mistakes, and not all of the stuff he makes turns out so fabulous.\r Sure, Interstellar has fancy technology, as its Oscar for Best Visual Effects will demonstrate. The most accurate portrayal of a wormhole, precision of orbital physics and astrophysics, [insert fancy jargon here]……\r All that’s great, except that there’s more to a movie than just technical splendor.\r Stanley Kubrick’s science fiction masterpiece 2001: A Space Odyssey isn’t considered one of the greatest sci-fi films ever created only for its revolutionary techniques in portraying space and spaceships; its profound ruminations of the nature of man and the questions it raises on the divide between natural and artificial intelligence are what has put the film on the pinnacle of cinema. Of course, the movie’s amazing sequences of spaceships moving slowly in harmony with Strauss’s majestic pieces cannot be overlooked, but that does not mean they are the sole reason behind A Space Odyssey’s critical acclaim.\r Interstellar tries valiantly to mimic both the technical and philosophical marvels of historical sci-fi films like 2001: A Space Odyssey, yet it fails by a long shot in delivering a significant, poignant message. The early scenes between Murph and Cooper fall flat in emotion; neither the acting nor the dialog carry through the fragile emotions that should have been exchanged in such a scene. Nolan’s efforts to raise questions on the “human identity” are easily spotted in scenes that seem almost forced, with little contextual connection to the sequence of events that move the story forward. The best example would be Anne Hathaway’s excruciatingly cringe-worthy scene in which she claims love is worth jeopardizing their whole mission and the future of humanity for. Seriously, this comes out of nowhere—when did Hathaway’s character become so irrational and obsessed with her probably long-dead lover?\r “Love is the one thing we’re capable of perceiving that transcends time and space,” she cries. Sound like something from one of those turn-your-life-around-through-these-10-steps books? It’s unbelievably sloppy and unrealistic dialogue, and something I’m not at all surprised to find in a Nolan movie. Self-important, philosophic textbook quotes may work in a superhero movie where the hero is expected to be somewhat presumptuous, but not so much for a supposedly realistic science fiction flick.\r What I’ve concluded is that Interstellar is neither unique nor special; its ideas of travel through wormholes and warped time in different areas of the galaxy have already been entertained in science fiction films of an earlier age such as Star Trek. The only factor that Interstellar can show off above all other is the accuracy to which it incorporated modern theories of space and time—the wormhole’s curved surface is supposedly the most accurate representation of such a thing ever put on screen.\r Perhaps the supposed scientific genius of the movie becomes more real to its audience because of the background of the movie, or the way the subject of space travel is treated. Science fiction movies like Star Trek seem far off from reality—such movies portray themselves as fiction, a made up world, a world that is usually beyond the parameters of a “what if” world that diverges from our own. Interstellar, however, tries to make itself seem like an extension of the reality we live in—our future very well may have in store for us a dry, bleak land that has forsaken the human race. Dying potato fields and giant dust storm seem less childlike, less like a figment of our imagination than do lightsabers and evil warlords waging war on the galaxy. We are led to empathize with the world of Interstellar as if it were our own and not a created fantasyland, which is why some of the things that happen in the movie seem less absurd than what happens in other films of the same genre (of course, these “things” exclude the infamous bookshelf and Morse code scene, the absolute bane of the movie and the epitome of Christopher Nolan’s over-ambition with his newest project).\r So if you thought Interstellar was an absolute blast, good for you. Congratulations for spending those extra dollars on watching IMAX 3D or whatever it is they have these days. Next time though, you might want to consider crashing on your couch with a nice, homemade bowl of buttery popcorn and let Netflix lead you through the world of true, time-proven science fiction. (Of course, Interstellar re-runs are always available. Respect personal preference I must.)"}, {"rating": "5", "text": "Visual is good. Story is under average. Dialogues are boring. The main idea is badly premeditated.  Warning! Drink a lot of coffee before seeing this movie to avoid fall in sleep."}, {"rating": "6", "text": "An overrated, slow-paced and surprisingly dull adventure that could only win a redemption by its great cast and it's impressive script. Interstellar has a good message but its ending can be imagined by anyone who has creativity."}, {"rating": "6", "text": "Interstellar attempts to be a character-driven space drama grounded in pseudo-realism. “Attempts” being the operative word. The character-driven drama is undermined by awkward story jumps and rushed / poorly explained motivations (though at almost three hours, the film isn’t short). None of this is helped by some nonsensical subversion of sci-fi common sense (seriously, who would think about inhabiting a planet near a black hole - let alone THREE planets near a black hole?). Add in a classic time-travel paradox and the seeds have been sown for some major confusion. It's a Christopher Nolan film, of course, so you can expect some great visuals, a great score by Hans Zimmer, and some good acting by all involved (except, strangely enough, leading man Matthew McConaughey, who mumbles half his lines and has a wooden expression on his face for the first two-thirds of the film). Interstellar tries to be thoughtful, insightful, reflective and predictive, but never inspires the sense of wonder that is a part of any great sci-fi film.Interstellar is worth a watch once if you enjoy Nolan's film-making. Watch it again and you'll begin to pick the flaws apart. A disappointing 6/10."}, {"rating": "5", "text": "Visuellement le film ne casse pas une prune je trouve les effets de lumière grenelée les mise au point flou (Oui filmé en mode année 50 Imax 70mm) et les effets visuels dans l'espace complètement raté et je ne parle même pas de saturne qui doit être une .PNG fournie par la nasa sur lequel ce déplace un point blanc pendant 10 secondes sur un plan 2D bref en ligne droite pour nous dire que c'est le vaisseau... Pas de 3D c'est vraiment dommage !!! (de toute façons Christopher Nolan et les nouvelles technologies ....) Après il ne faut pas lui enlever la scène de fin qui est quand même belle et celle dans la sortie de la galaxie.Pour la Music, mise à part le thème je ne vois pas ce que contient la BO et dire que c'était Hans Zimmer qui n'a d'après ce que j'ai lu sur des news, pas vu le film ni lu le scénario (non, mais c'est quoi ça .......Le scénario et bien il nous perd dans les théories de la physique quantique, la relativité et j'en passe et des meilleurs. À la fin [spoiler]    \"\"SPOIL\"\" ce retrouver en pause ou mort dans la 5D puis jeté par on ne sait par quel moyen et retrouver comme ça a coté de saturne 116 464km de Diamétre un homme de 1 mètre 78 \"\"SPOIL\"\"    [/spoiler]    Bref la ou Inception nous prenez par la main et nous faisait voire un film de science-fiction ici c'est un documentaire qui s'en mêle les pinceaux avec toute c'est théorie balancer a l'aveugleOh et au niveau des personnages je me suis plus attaché au robot qu'au Personnage principal LOL."}, {"rating": "10", "text": "What a masterpiece, this is now my favorite movie of all time. GO AND WATCH IT NOW!!"}, {"rating": "6", "text": "Had high hopes for this but they messed it up in the usual way by mixing in half-hearted family matters into the hard science action adventure.  These things just don't mix and the obligatory inclusion of a family story that's not really done with any conviction, spoils the entire drama and dynamic of the film.  It's just like when they have the kid in Terminator 2 having fun with the Terminator.  No, no, no!  Jumped the shark right there with a cutesy family angle.  Stupid!  And the same kind of thing spoils this film.Also, the adventure isn't very interesting either, and I can't even remember much about it now, that's how dull it was.  One problem is that Hollywood needs to realize that BLACK HOLES ARE OVER -- they aren't interesting or cool anymore.  That was the 70s, guys.  Let's move on to other topics, please."}, {"rating": "10", "text": "Took me quite sometime to get myself to actually watch this movie mainly because of it's length and those who acclaim it(see:filmbros) but nevertheless they were correct. This dystopia mission against time takes ambitious paths to tell a human story about the power of love. Interstellar is simultaneously a big-budget science fiction endeavor and a very simple tale of love and sacrifice.It’s a bold, beautiful cosmic adventure story with a touch of the surreal and the dreamlike, and yet it always feels grounded in its own deadly serious reality. I'm completely blown away"}, {"rating": "6", "text": "The secret of this movie lies in its pressing on emotional buttons of human soul. It also contains a bunch of scientifically looking inserts which makes it to appear more hm... solid, truthfully looking, you know... The truth is \"I don't buy it\" was the phrase I constantly repeated while watching this movie. While each scientific ground is true in separate, together they form a frankenstein. Fuel consumption in the time-slowing gravitation field of Gargantua (it is horrible, guys, horrible, unless you use gravitational engine with galactium as a fuel:); the ability to perform a kryo flight and the inability to maintain hydroponics... or to extract oxygen from the environment (for those, who forgot or never knew, oxygen accounts to 49% of it by mass) In general: clumsy solutions to the invented problems. I don't buy it.I would not mention scientific and common logic as an argument at all, but without it the movie is just boring. If you do a melodrama, don't fill the movie with the science. If you do a scientific apocalypse, make sure it looks plausible in the whole, not just in parts.The only plus of this movie: it is well made in visual forms and actions. Only because of that respect to the amount of work done it is 6/10"}, {"rating": "5", "text": "Not true. Basis: story in the New Yorker.Description: Earth is dying in a draught. Team goes off to Space in search of a habitable planet. There is mischief afoot- some people die; others are abstracted into a bookcase/ Jean Michel Jarre concert for eternity.Reaction : I think it’s about a single dad starting to look for a companion.Thanks."}, {"rating": "10", "text": "A whole Masterpiece. Those soundtracks, this plot, this end, it is another level at all."}, {"rating": "10", "text": "Truly the most awe inspiring film I have ever seen. An absolute masterpiece of science fiction that will be regarded as one of the greatest movies of all time."}, {"rating": "10", "text": "This is without a doubt my favorite film of all time. It does so much right with emotions and is visually a masterpiece."}, {"rating": "10", "text": "This is by far the best movie i’ve ever seen in my life. The special effects are insane, the plot is very well thought out, and the actors are amazing. Great Job Christopher Nolan."}, {"rating": "10", "text": "My favorite movie of all time. An amazing mind boggling adventure that only Christopher Nolan could pull off. A true Masterpiece."}, {"rating": "10", "text": "This movie is a complete work of art, and solos anything that Metacritic could ever pull out their ass. In fact, the CD for this movie should be put up in museums and shown in history textbooks, for being known as the greatest movie ever that Metacritic gave a 74. I don't know what apes watched this movie and didn't like about it, I'm assuming it is the apes that are shown at the beginning of 2001 A Space Oddessy. ooh ooh ah ah silly ahh monkey people be able to discover Obelisk but can't discover a good reason to like this masterpiece made by Christopher Nolan (goat). If I were Christopher Nolan, I wouldn't even stress if I got a bad rating from Metacritic, knowing they gave Intersteller and Dune (2021) an 74. Actual **** apes who run this silly ahh website full of fat ass nerd who can't even see past their bellies when they wake up in the morning, the amount of fungus and popcorn under those **** chin and stomach roles would help starving children eat, and even then they still would give interstellar something other than 74. I'm honestly not shocked that you people didn't like the movie, I just know you were lost in confusion before they even left the atmosphere. But I bet you guys got really excited when they brought up cornfields until you have more corn stored under your rolls than they have on the entire planet. I now want to review the movie using a 3 act structure. Act 1 (Exposition-Inciting Incident) Act 2 (Midpoint-Rising Action) Act 3 (Climax-Denouement). We are introduced to our Main Character 'Cooper' played by Academy Award Winning Actor Matthew McConaughey, a farmer born in the wrong generation, grew up through many life-altering and developing world issues, being a previous Nasa Astronaut, settles down with his family where he becomes a father of two, his daughter 'Murph' played by Mackenzie Foy. And his son 'Tom' played by popular actor Timothée Chalamet. Without being shown on screen it is shown it is hinted that the mother of the two died. That introduces the Co-Parent to Cooper 'Donald' played by Golden Globe winner John Lithgow. It is also told that he is the father to the mother of Cooper's children. Eventually, Cooper ends up on a mission to a different galaxy to hopefully find a life-sustaining planet. Act 1: Act 1 (just like every act in this film) is an undisputed masterpiece, it starts out the film trickling with minor little problems, Murph getting into trouble at school, sand storms, and slowly losing all food resources year by year. But our first lead up to the 'Inciting Incident' is when a sandstorm occurs and they are forced to retreat home, when reaching home Murph is quick to realize she had left her window open, Cooper and Murph quickly head up to her room to not only discover sand all over her room but sections of gravity that seem to be spelling something out in binary. It's revealed to be coordinated to a hidden NASA base which Cooper and Murph Decide to head to, but are quickly taken in for questioning. When brought in it is discovered that an old friend of Coopers 'Dr. Brand' played by Academy Award-winning actor Michael Caine. This is when Dr. Brand introduces us to our 'inciting incident' Dr. Brand reveals he has been trying to find a way to bring the entire planet to space without killing everyone, and bettering human life, but he does not have the means to do the equation, so plan b is to enter a wormhole and enter a new galaxy, to find a planet that is suitable for human life. This is when Act 2 begins. Cooper is told that a team of people was sent to the galaxy to study and find the best planet, but all had lost contact with Earth. Cooper is given a new mission to go to this galaxy, find the best planet, and start the new human race. He accepts the mission and leaves his family. Murph is heartbroken and angry at her father for this. But that does not stop Cooper from doing the greater good. I got bored don't feel like finishing whole review Metacritic sucks, Christopher Nolan is the goat, bye-bye"}, {"rating": "10", "text": "Perfect!Not just science fiction, but also family love, bravery, and many other elements.It is a film that I am glad I was able to see in theaters."}, {"rating": "10", "text": "how is this is not the best movie in the entire human history? it reminds us the true purpose of humans and what is going to happen if we dont stop polluting our only home. we are made for a purpose. we are the universe, universe is us.. and we need to explore"}, {"rating": "10", "text": "An absolute masterpiece delivered to us by Christopher Nolan, Interstellar is a space-settled story of human dreams, love and sins. Typical Nolan's focus about time feels great and gives us two not-so-different point of views on humanity. Most heartful Nolan's movie so far. Hopefully not the last one."}], "recommendations": ["arrival", "sunshine", "annihilation", "the_martian", "chaos_walking", "the_midnight_sky", "mortal_engines", "inception", "avatar", "gravity", "in_the_heart_of_the_sea", "coherence", "tenet", "predestination", "contact", "lucy", "the_green_knight", "donnie_darko", "ex_machina", "midnight_special", "what_happened_to_monday", "blade_runner_2049", "elysium", "dunkirk", "prometheus"]}