{
  "id": 1328,
  "title": "Into the White",
  "starring": [
    "Stig Henrik Hoff",
    "Lachlan Nieboer"
  ],
  "runtime": 104,
  "genre": [
    "War",
    "Action",
    "Drama"
  ],
  "description": "Based on a true story. On 27 April 1940, Luftwaffe pilot Horst Schopis' Heinkel 111 bomber is shot down near Grotli by an RAF Blackburn Skua L2940 fighter, which then crash-lands. The surviving German and English crew members begin to at shoot each other, but later find themselves huddled up in the same cabin. In order to survive the harsh winter in the Norwegian wilderness, they have to stand together. An unlikely, lifelong friendship blossoms.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/glnBVGMFpwFfdtKbqZRBUrouJmU.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.0,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "why its offical  rating is so low,i really think it is one of my favourite movies.\rit moved me,i like watch the movies base on war,but i am not really like war,this show the true human nature about war,not cold blood.i like this Anti war film."
    },
    {
      "rating": "9",
      "text": "this movie has a really good story, I think the movie is very wll done and has really good actors, they showed what the can do by acting wonderful, they showed the story in a very good way so people can understand it. I really enjoyed it, I recomend it."
    },
    {
      "rating": "8",
      "text": "It was inspired by the true story but made few changes in script to look dissimilar to other similar plot movies. But still people are comparing it to movies like 'No Man's Land' and 'Hell in the Pacific'. This Norwegian movie had international cast. A couple English and a trio Germans. It was almost an English language movie, except in few parts where German soldiers speak German.\r Unlike other fictional stories this movie was breathtaking. The whole movie was shot in a wooden cabin which located in the snow covered no man's land. That setting reminded me the Charles Chaplin's 'The Gold Rush'. Don't mistake it as a pure war movie, it was a drama with a backdrop of second world war. You can see only men with a soldier's suit and guns which they never use it.\r This movie tells the certain parts of the story that happened back in 1940. The filmmakers chose to tell only the drama parts, but I wanted the rest of the story. Like when they were taken back to the nearby English soldier camp what happen to the German prisoners. Of course they said it in words during before the end credits roll up. But I am eager to see it in a movie because I love movies.\r I think Rupert Grint had a good role other than he had in the Harry Potter series or any other recent his movies. The rest of the guys were also given their solid performances, especially Germans cast and their characters were so diverse. It was an unbelievable true story, glad to know it through this fine movie. All the thanks to the cast and crew for this wonderful drama."
    },
    {
      "rating": "9",
      "text": "I have not seen a film this good in years and I watch a lot of movies.  It's a strong character driven movie.  What will happen when you put people together in a stressful fight-for-your-life situation. Great film, reminiscent of films from 30 years ago that don't rely on special effects and explosions.\r My wife came into the room and was busy doing other things and stopped to watch.  We watched the whole film together.  This is saying something since my wife's philosophy on movies is, \"I've got 20 years of movie watching after I retire, why waste time now when I could be outside on my bike.\"\r I'm giving it a 9 and not a ten because of the subtitles.  However, most movies I've sat thru with subtitles have been excellent because I won't waste my time on them unless they have been highly rated or in this films case, it was suggested by a friend who loved it.  So, this review is really 3 peoples opinion that this is a great film. You won't be disappointed."
    },
    {
      "rating": "7",
      "text": "I quite enjoyed this film. It's inspired by a true story and it's mostly driven by the story's very realistic characters and the actors did a good job."
    }
  ],
  "recommendations": [
    "unbroken",
    "red_tails",
    "jarhead",
    "the_1517_to_paris",
    "titanic",
    "12_strong",
    "the_13th_warrior",
    "midway",
    "300",
    "pearl_harbor",
    "soul_surfer",
    "woodlawn",
    "three_kings",
    "valkyrie",
    "blade_of_the_47_ronin",
    "risen",
    "red_dawn",
    "v_for_vendetta",
    "lone_survivor",
    "pay_it_forward",
    "apocalypto",
    "blood_diamond",
    "hereafter",
    "ben_hur",
    "the_hurt_locker"
  ]
}