{
  "id": 4391,
  "title": "Into the Blue",
  "starring": [
    "Paul Walker",
    "Jessica Alba"
  ],
  "runtime": 110,
  "genre": [
    "Action",
    "Thriller",
    "Adventure",
    "Crime"
  ],
  "description": "When they take some friends on an extreme sport adventure, the last thing Jared and Sam expect to see below the shark-infested waters is a legendary pirate ship rumored to contain millions of dollars in gold. But their good fortune is short-lived, as a ruthless gang of criminals gets word of what they have uncovered.",
  "releaseYear": "2005",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/h5oXcjRu0EOiAxSxYuGq58897tu.jpg",
  "categories": {
    "plot": 7.421052631578948,
    "acting": 6.75,
    "ending": 5.0,
    "soundtrack": 10.0,
    "cinematography": 5.666666666666667,
    "familyFriendly": 6.0,
    "funny": 6.666666666666667,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "A guilty pleasure movie. It probably takes itself a little too seriously at times, but come on...who doesn't like Jessica Alba in a bikini for 2 hours!?"
    },
    {
      "rating": "7",
      "text": "Four young divers come across a legendary shipwreck that is rumored to contain millions in gold, but nearby to their lucky find is another more sinister mystery. As rival treasure hunters begin to suspect their discovery, their friendships and loyalties are tested; and they must make haste before they become the hunted along with the treasure.The story is solid enough, and in truth it was well above my expectations, captivating my interest very early on and remaining suspenseful and intriguing enough throughout the picture. The cast are all good enough, although they were probably chosen as much for their looks as their acting abilities, but who can deny that Jessica Alba and Ashley Scott did add a sexy feel for the male audience, and i guess Paul Walker and Scott Caan did the same for the ladies.What really made the film for me was the truly fantastic scenery and the underwater camera work; it was flawless and stunningly beautiful in a way that is rarely captured on film, three cheers for the direction and the film crew for that."
    },
    {
      "rating": "1",
      "text": "Horrible. I gave up after 20 minutes. It is so annoying that one would think that it has to get better but it doesn't. What a waste of talent and resources."
    },
    {
      "rating": "7",
      "text": "Kept a bus of 50 high school students on their way to a ski resort quiet for the 2 hour drive, so there's definitely some \"watchability\" to it. At first I thought their attention was due to Jessica Alba in a bikini, but there's more to it than that. Let's face it, everyone likes a good treasure hunt movie. Many here have said the movie is just a mindless watch, but I found the conflict faced by the protagonists -- namely whether to use the funds of selling a discovery of cocaine to finance their underwater search for REAL treasure -- to be particulary interesting. Of course, they fall deeper and deeper (no pun intended) into trouble, which makes for a good moralistic argument as well."
    },
    {
      "rating": "10",
      "text": "An absolutely fabulous film, great action, stunning scenes, romance, great theme music the list goes on. Its a film for all ! men, women, boys and girls it has a bit of everything ! and absolutley THE Best star in Jessica Alba ! Simply Gorgeous, (nearly as good as my wife !) and my wife also liked Paul Walker so a winner all round!"
    },
    {
      "rating": "5",
      "text": "Bland and forgettable."
    },
    {
      "rating": "1",
      "text": "Strictly for the crowd that wants to ogle Alba. Probably will open to around 12 mil. Hey, I loved Bisset in The Deep so how can I condem the morons who go to this film. Alba is hot and you should jack off to her, but still; you should be ashamed at what you do. This film is idiocy and Scott Caan is the only redemption in this crap."
    },
    {
      "rating": "6",
      "text": "Even though John Stockwell's dippy but not totally disposable underwater booty-and-booty epic wasn't actually released until October of 2005, it's really the purest mindless summer junk to come out that year. It's not trying to be postmodern (like The Dukes of Hazzard), or lazily imitative (like The Longest Yard) or trashily noisy (like Four Brothers) or slick but totally nonnutritious (like Mr. and Mrs. Smith). It really tries to tell a serviceable story involving two kinds of buried treasure (one legit, the other not so much); the underwater photographers really earned their paychecks and then some; the four leads fill their skimpy suits effectively, although Scott Caan and Ashley Scott are far better actors than topliners Paul Walker and Jessica Alba and therefore get to have all the moral ambiguities. In short, Into the Blue is to cinema what Garfield's nemesis Odie is to comic strip canines: really pretty dumb, but its energy and enthusiasm make up for a lot without totally letting you forget that it's really pretty dumb. The same goes for walker's performance; the Fast and the Furious star is a terrible actor, but his overcaffeinated dudespeak is something to behold. As for Alba (Sin City, Fantastic 4), she delivers the goods she was essentially signed on to deliver, which means that this DVD will be sold to lots of 13-year-old boys and lonely middle-aged men who want to...study her performance further. During the sections of the film in which the stars are required to put some clothes on for a change, Stockwell (who also did the Kate Bosworth surfing flick Blue Crush; the man gets more mileage out of the color blue than any entertainment figure since Bobby Vinton) keeps his viewers awake with some decent car chases, torture sequences and shark attacks, but ultimately spoils his movie by being just a bit TOO eager to please; few movies are destroyed in the last two minutes, but Stockwell tacks on a \"have-your-cake-and-eat-it-too\" coda that totally negates the central \"which is more important, love or wealth?\" question that actually if temporarily lent the movie some thematic weight. But then, I already DID say this movie was really pretty dumb in the first place, didn't I?"
    },
    {
      "rating": "7",
      "text": "I have seen Heaven, and it is Jessica Alba's ass in a bathing suit. Besides that, it's a good popcorn flick, Scott Caan is reasonably funny and...there's sharks! Can't go wrong with sharks."
    },
    {
      "rating": "6",
      "text": "It's not horrible and it's not great. About half the movie is shot underwater and if you are a diver or like to snorkel, it's worth a matinee."
    },
    {
      "rating": "6",
      "text": "The trailer didn't do this movie justice. The movie is well-paced and the narrative, not as simplistic as the trailer led me to expect, is coherent and somewhat interesting. The performances from the actors are mixed, however, and the gratuitous, lingering shots of the sexy bodies on display are distracting in a bad way! Some of the underwater scenes are well-shot. The central theme of a man's integrity and the value of love and of wealth is adequately handled until the end, when the movie really lets itself down. There are some aspects of the plot which are unlikely but not enough to spoil it. The movie is not without charm and I was happy to sit through it. I wouldn't watch it again, however."
    },
    {
      "rating": "7",
      "text": "Let's just say, it's better than expected. That being said, I wasn't expecting much."
    },
    {
      "rating": "5",
      "text": "The only reason that made give this lousy movie a 5 was because of jessica alba. She's hot, and goes in the water a lot. So that's the only good thing. Other than that, this movie isn't even the least bit entertaining, crappy effects, pretty bad acting, and lackluster presentation all add up to the movie not to see this year."
    },
    {
      "rating": "0",
      "text": "Imponderably predictable. Simply listening to Paul Walker is annoying enough to make one throw up their innards. This was the first time I have ever fallen asleep in a movie theater since Lord of the Rings Fellowship."
    },
    {
      "rating": "4",
      "text": "Not at all terrible, but a dull and completely forgettable. For the most part an otherwise bland film with particularly outstanding water photography."
    },
    {
      "rating": "6",
      "text": "Into the Blue is a succulent, sexy guilty pleasure for the intelligent movie-goer. Though it has its benign moment, it doesn't insult us with stupidity, and it's surprising well edited, especially down the last twenty minutes."
    },
    {
      "rating": "7",
      "text": "Obviously one of the main selling points here, as was demonstrated in the film's marketing campaign if I remember correctly was you get to see plenty of Jessica Alba in a bathing suit. Its a decently acted thriller, Josh Brolin can read the phone book and make it entertaining and Jessica Alba is easy on the eyes. Let's just say this , it's better than expected. That being said, I wasn't expecting much."
    },
    {
      "rating": "4",
      "text": "It's a very flawed, but watchable movie. The acting was decent, the kills were fun and the cinematography was beautiful. Unfortunately, the plot was stupid, the characters were stupid, there were a lot of plot holes, it was unbelievable and none of the characters were sympathetic at all. The last half hour tries to give you the action movie promised, but it can't save the first horribly cheesy and disgustingly bad hour."
    },
    {
      "rating": "8",
      "text": "While it's a little generic, Into the Blue is an entertaining and sexy crime thriller. The story follows an aspiring treasure hunter and his friends who discover a possible shipwreck near a crashed plane full of drugs on the sea bed, and must work secretly to uncover the ship's location before others get to it first or the drug cartel comes looking for their lost plane. Starring Paul Walker, Jessica Alba, Ashley Scott, and Scott Caan, the film has a good cast. But the characters are poorly written and the plot is really convoluted. Still, there are some nice action sequences and the underwater scenes are beautifully shot. It's gratuitous and silly, but Into the Blue is also kind of fun."
    },
    {
      "rating": "10",
      "text": "Into the Blue never demonstrated any pretense of becoming the next academy award winner, and instead faithfully executed its focus -- beautiful ocean scenery, beautiful bodies, and a significant degree of tension and action to carry the plot. I found the characters believable, especially given the target audience of the movie: the dialog was fairly cleverly humorous, but serious when it needed to be; the characters were adequately conceived, including the intentionally unlikeable 4th party woman who \"wasn't family.\" Most of all, I enjoyed the pacing of the movie. Some slow underwater scenes were accompanied by peaceful music belying the increasingly perilous situations the characters found themselves in. Halfway through the movie, the tension never fully dissipates, as each event flows into the next as the stakes rise. The badguys are dealt with intelligently, and there are enough twists to convincingly carry the instability and danger of the situation.I went into this movie wanting to enjoy it, and I wasn't disappointed. Though its premise wasn't the most intellectual of premises, I don't feel as if it were dumbed down as much as many action movies do, and instead carried out is plot with due respect given its expectations. I'd recommend this movie as a good post-summer adventure flick!"
    }
  ],
  "recommendations": [
    "the_tourist",
    "hanna",
    "baby_driver",
    "miami_vice",
    "kate",
    "those_who_wish_me_dead",
    "gunpowder_milkshake",
    "immortals",
    "jumper",
    "pompeii",
    "till_death",
    "jolt",
    "cellular",
    "black_snake_moan",
    "san_andreas",
    "savages",
    "premium_rush",
    "red_riding_hood",
    "snow_white_and_the_huntsman",
    "the_ice_road",
    "elektra",
    "the_italian_job",
    "parker",
    "red_sparrow",
    "magic_mikes_last_dance"
  ]
}