{
  "id": 3760,
  "title": "Invictus",
  "starring": [
    "Morgan Freeman",
    "Matt Damon"
  ],
  "runtime": 134,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "Newly elected President Nelson Mandela knows his nation remains racially and economically divided in the wake of apartheid. Believing he can bring his people together through the universal language of sport, Mandela rallies South Africa's rugby team as they make their historic run to the 1995 Rugby World Cup Championship match.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cNUoXM8dtg5mRt90GLrAHBP9IGE.jpg",
  "categories": {
    "plot": 4.647058823529412,
    "acting": 5.0,
    "ending": 4.75,
    "soundtrack": 5.0,
    "cinematography": 5.5,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "An excellent movie, with excellent performances, both by Morgan Freeman and Matt Damon. I liked this movie, and I don't even like rugby. A good sports movie."
    },
    {
      "rating": "6",
      "text": "I think the acting in this movie from Morgan Freeman and Matt Damon really save this movie for me. It isn't a bad movie at all but it certainly could have been better. I don't have too much of a knowledge on the actual history (or rugby even) and I didn't feel like I finished the movie with much more than I started with, which is kind of disappointing."
    },
    {
      "rating": "10",
      "text": "Excellent movie. Well done!"
    },
    {
      "rating": "1",
      "text": "WOW!! Clint Eastwood's incomparable thirst for willful ignorance strikes again.... The real heroes of the 1995 world cup final were and always will be the All Blacks.... So much pressure (the only thing clint does get right) was indeed on mandela and the south africans that the heirachy of the SARFU and some government officials conspired to poison the all black rugby team. The food (at an 'event' organised for the team) was poisoned by a lady calling herself 'Suzie' - this is fact. To this day AB's coach Laurie Mains is haunted and bitter about it. Look at any footage of the game and you can see how ill the team was - jeff wilson visibly throwing up on the field as were others etc etc etc.... Lomu looked fine? He was..... he did not eat the dinner. But 12 of the team did. Yet somehow, courageously, the New Zealanders survived almost 100 minutes of rugby, away from home, in front of a crowd that only a decade earlier had not allowed Maori or people of colour to play for the all blacks in their country because they are hateful racists...and almost won it in extra time. Trust an american fool to see the story he would like to be true - and then make it as it suited him. When asked by a kiwi interviewer about this, clint interrupted and said, and I quote, \"I have never even heard of this..... Iand suppose pigs are flying around the moon...\".... What!!!??? He is not only a denier, but he had not even heard of it? That is appalling. It is general knowledge, unless you are, like a crooked cop, finding the evidence to suit the story you have in your head. I am genuinely disgusted. What else didn't happen Clint? The holocaust? Slavery? Hang your head old man."
    },
    {
      "rating": "0",
      "text": "They cheated and gave the All Blicks food posening. Shame on Cint for making such an untruth. its like making a movies where the enigma code was cracked by the yanks in WW2."
    },
    {
      "rating": "5",
      "text": "If anyone cared about rugby, Invictus might just be a decent sports film, instead we the greatest African-American actor alive today pretending to be Nelson Mandella wholly on his slight resemblence of him. Morgan Freeman is Morgan Freeman in Invictus, no make-up, no accent, just Morgan Freeman and his heavenly voice reading scripted lines intending to make us believe he is Mandella. He didn't, not for me anyway. A big disappointment after such high hopes."
    },
    {
      "rating": "6",
      "text": "Good movie, but something about it holds it back from reaching its full potential. A lot of people have said that it was too embellished...but my problem is that it lacks movie magic. The musical score couldn't keep up with the emotion that the film should've been evoking. The editing was choppy and I kept finding myself lost. On top of that, I still don't really understand what happened. There was sooooo much fluff, but nothing about nothing about the rules of rugby or how the playoffs work. When the movie ended I still thought they were supposed to play England. Basically, if you know what happens you can enjoy it and if you know how rugby is played you will enjoy it, but the rest of the audience (aka the majority) is extremely alienated. Too bad because every part of this project had potential except Matt Damon."
    },
    {
      "rating": "5",
      "text": "It"
    },
    {
      "rating": "3",
      "text": "Just reread William Ernest Henley's poem Invictus. Earnest indeed. It makes me think that the movie could just as well have been title Dickhead. I know that's unseemly but it does seem true."
    },
    {
      "rating": "10",
      "text": "This is a great movie! Anyone and I mean ANYONE who thinks that is not a powerful story about overcoming racial barriers are completely close minded. I am a white male in my middle age and this is the kind of thing we should be teaching our children! Learn from it, grow from it and for god sakes change your pov!"
    },
    {
      "rating": "4",
      "text": "Confusingly and utterly dry and boring through most of the movie. Morgan Freeman does an excellent job as Nelson Mandela but Invictus fails to capture any passion or emotion at all feeling dead and boring the entire way through."
    },
    {
      "rating": "8",
      "text": "Bit superficial, but it wasn't a problem, it rose above it!Felt rushed and some things were left unspoken, such as the airplane thing or the kid with the bag, like he was carrying a bomb, but it was a beautiful inspirational movie, even broke a tear here and there. Loved the idea! Great quote material, great original songs. As for the nominations: Morgan's definitely worthy, I haven't seen the rest of the nominees performances, I can't say yet if he deserved the Oscar yet, but I will say when I'll watch the winner; Damon's wasn't deserved, too brief and \"natural\" performance to be up there, but the movie deserved a best director and best picture nomination at least, in my opinion! We need more movies like this! Peace!"
    },
    {
      "rating": "9",
      "text": "Clint Eastwood is a legend on and off the screen."
    },
    {
      "rating": "3",
      "text": "How could a movie about such an inspiring subject be so uninspiring? I'm not sure what critics and others are smoking, but I think the only reason this movie has received such good reviews is because Clint Eastwood directed it. I think the actors did whatever they could to save the movie (Morgan Freeman was great, and Matt Damon did the best he could to act despite his character being highly underdeveloped), but ultimately Clint gave them no chance to shine or show the true depth of their characters. Overall, this movie had no dramatic elements to it, and it was very boring. Also, the rugby scenes were terrible and didn't really show the intensity of the sport at all. Way to jack this one up, Clint."
    },
    {
      "rating": "8",
      "text": "This film was one of those films that made you wish, gee, I think that could've been better. However, Eastwood does direct beautifully in the lead up to the Final. Here, I will say only one thing : It doesn't matter if the NZ team had food poisoning, what mattered, was they didn't win on the day. They acknowledged that. It would be unfair to say that it wasn't a real victory. They lost, and you can't change the past. Fat is fact, and with the wonderful performance by Freeman, I believe Eastwood captures the moment as it was, and forever will be."
    },
    {
      "rating": "2",
      "text": "(disappointed sigh) It is difficult to review these movies because if you say anything bad about a movie on racism, you are deemed a racist. I am not caucasian so I say this with all love of races in mind, this movie was terrible! The only bright spot was Morgan Freeman's performance as the president. He did phenominal! The movie was boring and the conflicts disapeared halfway throught the movie with no explanation. Nothing ever really changed on the Barney kids' (soccor team) part, but everyone celebrated as if something changed. They would extablish character traits and plot points that never paid off. Remember, I am not a racist, I just know that this movie was awful!"
    },
    {
      "rating": "8",
      "text": "Donnie B- YOU ARE A RACIST!!!! Nah i'm just kidding its your opinion. I thought this was a good movie. Nothing fantastic, but good. I think a few details that should've been explained weren't (ex. They never explained how Mandella gained the loyalty of the African's. Other than that, it was good."
    },
    {
      "rating": "8",
      "text": "Eastwood Damon and the incomparable Mr Freeman , succeed royaly in creating a glimpse into the majesty of the man whose humility changed a Nation and the world and surprisingly had me really into the rugby games too! Fantastic movie! Really Heartfelt and genuinely moving!"
    },
    {
      "rating": "2",
      "text": "The film did very little to educate us on the history of Mandela, and apartheid (it assumed the audience would know that already), and the performances were one-dimensional. I felt Damon and even Freeman to an extent were trying so hard to pull off the right accent, that the performance did not come through. I only wonder how many overdubs they had to do with the accents, but even so the performances were boring and there was hardly ANY real conflict shown. Visually underwhelming, and surprisingly amateur in its execution. I had high hopes and an open mind, but left feeling cheated and not entertained."
    },
    {
      "rating": "7",
      "text": "Works better as an interesting history lesson, and a glimpse of the greatness that is Nelson Mandela, than it does as a sports movie, or than it does as an inspiring/poignant/feel good story. Morgan Freeman is excellent. Matt Damon is merely ok."
    },
    {
      "rating": "10",
      "text": "Grandious epic on leadership and humanity. Very inspiring, uplifting, dramatic...just incredible. Old champ Clint Eastwood is just getting better and better."
    },
    {
      "rating": "2",
      "text": "A ham-fisted, Disneyfied, plodding, schmaltzy attempt at a film. The rugby scenes were very poorly done and lacked any excitement. 2 stars out of ten for the efforts from Freeman and Damon in the face of a terrible script and directing. Yes, we all got the message because the film was completely lacking in any sort of accuracy or subtlety. \"Yay! Everyone's friends again. Kumbayah!\""
    },
    {
      "rating": "2",
      "text": "Very disappointing, no real tension in the film, glossed over the facts of the time in South Africa. Freeman was made for this role, but Damon did not stand out at all. Really expected a more rousing performance, no stand out speech or team boosting outbursts. The actual games looked terrible as with the stadium, Eastwood shouldn't do sport, particularily sport he doesn't know. Think this was too much aimed at an American audience that knows nothing about South Africa or rugby."
    },
    {
      "rating": "8",
      "text": "Enjoyable sports/historical drama set in South Africa immediately following Nelson Mandela becoming president. Wish I understood rugby better."
    },
    {
      "rating": "9",
      "text": "As others have said -- well done and entertaining. A pleasant surprise, and meaty too."
    },
    {
      "rating": "10",
      "text": "This movie is just boring for people that didn't get its message. It shows how sports and leadership can reunite people historically separated; we can see that in the final scenes, when South Africa wins the match and everyone forgot about the other person's color and just accepted, even if it was just for that moment. And also, the performances by Freeman and Damon and Eastwood's direction were absolutely outstanding."
    },
    {
      "rating": "8",
      "text": "Fascinating, inspiring and (if you're tragically uninformed about the actual history, like myself) suspenseful."
    },
    {
      "rating": "9",
      "text": "Very inspiring."
    },
    {
      "rating": "9",
      "text": "Excellent, moving yet understated look at a remarkable man and his bravery. Go see it."
    },
    {
      "rating": "9",
      "text": "Superb acting, deeply touching story, well-told. Loved the raw feel of the film, almost like and Indy from Sundance."
    },
    {
      "rating": "10",
      "text": "Saw this film last night and reveled in its simplicity but also powerful message. Morgan Freeman should be nominated for Best Actor Oscar. I enjoyed the subplot of black/white security guards learning how to get along."
    },
    {
      "rating": "5",
      "text": "The cooler head prevails, so the Springboks retain their name, their emblem and colors, and the baggage of their apartheid affiliated past that goes along with it all. Free at last, during a town hall meeting, the National Sports Council has payback on its agenda, but President Mandela(Morgan Freeman) urges the recently emancipated members to reconsider its kneejerk reaction, \"and surprise them(the Afrikaaners) with compassion, restraint, and generosity.\" The filmmaker then shrewdly cuts to the vehicle containing a triumphant Mandela and his aide, celebrating the narrow margin of victory in favor of the Springboks' continuing survival as a national sporting enterprise. With his speech of showing compassion toward the Afrikaaners, Mandela creates two factions: those who are in a forgiving mood, and those who are not, and if the filmmaker stayed in that decision room, the imagined dialogue between both factions would give the moviegoer a more rounded picture of South Africa's black constituency. According to \"Invictus\", all it took was a Mandela-run p.r. campaign, in which the Springboks held rugby clinics in shanty towns, that convinced the native population to cheer on their former oppressors, a team composed primarily of Afrikaaners. The native blacks are painted as being naive, or worse, simple-minded. For instance, Eunice(Sibongile Nojila), the Pienaars' housekeeper, asks Francois(Matt Damon) to relay a message for President Mandela that makes her sound like a bright child. And then her face lights up like a child's, late in the film, when it dawns on the maid that the extra ticket for the country's match against New Zealand, is indeed, for her. While Mandela had already made peace with the country's apartheid past, a majority of his people probably wasn't, and that's what \"Invictus\" neglects to show."
    },
    {
      "rating": "4",
      "text": "Agree with Miami Herald review. Yes...boring is a word that comes to mind. It's a real Ambien of a movie....virtually tension-free. The Saturday night audience I saw it with in Manhattan seemed asleep."
    },
    {
      "rating": "8",
      "text": "While is by no means perfect, it exudes the same warmth expected from such an uplifting tale. In particular, Freeman and Damon give outstanding performances. Freeman's depiction of Mandela is so good that I often forgot this was a portrayal by an actor."
    },
    {
      "rating": "5",
      "text": "I think what at least some of the user commentors are confusing, is the story with the film. It's a fantastic story, and a much much much less than fantastic movie."
    },
    {
      "rating": "10",
      "text": "Great movie, maybe not everything is true, but its captivating, touching, and really interesting. Acting is almost perfect and directing is really good. It kept me without any distraction, I couldn't think of anything different from the film."
    },
    {
      "rating": "7",
      "text": "The well delivered message of tolerance and acceptance is reason enough to see the film. It film style feels foreign, which makes it all the more intriguing. I recommend watching on Blu-Ray or DVD."
    },
    {
      "rating": "1",
      "text": "Very pointless. That's all."
    },
    {
      "rating": "9",
      "text": "Best movie of the holiday season ... you might actually learn something, too. Morgan Freeman's understated portrayal of Mandela is sensational. We see the man, his flaws and his pain."
    },
    {
      "rating": "9",
      "text": "Once again, Clint Eastwood means to impart some wisdom to his audience, this with a story where everything went right for once! Nelson Mandela demonstrated what Jesus meant when he said by faith you will move moiuntains. Mandela (Freeman) does move mountains and even molehills of predudice through his backing of the country's all-white soccer team and his belief in putting the past where it belongs - (behind us). This film is a meditation on what it means to be human. Several lumps in your throut, multiple tears in your eye, numerous chuckles, one big smile on your face at the end. Best film of 2009."
    },
    {
      "rating": "9",
      "text": "Great movie, great subject and great cast."
    },
    {
      "rating": "10",
      "text": "One of the best Sport movies of this decade. It also provides a rare glimpse into how rugby was used to unite a nation. Definitely worth a watch."
    },
    {
      "rating": "9",
      "text": "I was 16 when the Springboks played New Zealand in the World Cup. Absolutely Awesome movie. America you have to watch this one."
    },
    {
      "rating": "4",
      "text": "BORING at best. You know you have seen a good movie when hours or even days you catch yourself thinking about some aspect of the movie. For me I was actually looking at my watch hopeing it would end SOON. Other than writing this and maybe telling co-workers to save their money, I will never think of this movie again. well maybe to kick myself for wasting my hard earned money. good for a rental movie....by yourself."
    },
    {
      "rating": "4",
      "text": "I actually have to wonder if I was watching the same movie as A. O. Scott and Kenneth Turan. The version I saw seemed like a bad rough cut of a movie. The pacing was terrible, the cuts were repetitive and interminable. In the last seen for example, Eastwood cut at least 40 times to different groups of people watching the final match. Not only was this tedious, but it sucked any emotion out of the scene. I was literally rolling my eyes half way through it, Overall, Freeman was fine, but he could do this character in his sleep. There was no real depth to Mandela other than a few throwaways about his lack of relations with his family. Damon did a good job with a tricky accent, but the character was a dud, with no development. In this film Eastwood strongly tends towards the obvious and pedantic (just like Million Dollar Baby and Gran Torino) but obviously he has charmed the critics. Good for him, not so much for us."
    },
    {
      "rating": "10",
      "text": "Morgan Freeman and Matt Damon both give Oscar worthy performances in this masterpiece of a film. Clint Eastwood was able to bring light to subjects that tend to be ignored and was able to get two leading men to play roles many have not seen since Ghandi."
    },
    {
      "rating": "3",
      "text": "Bottom line is that everything besides Morgan Freeman's acting is average to awful. Matt Damon doesn't do a terrible job, but his character is utterly boring. The lines fail in their attempt to evoke emotions and are often cheesy. The movie often brings up certain information, such as Mandela's separation from his wife and family or him collapsing from exhaustion at one point, only once or twice and never goes in depth into any of it. The rugby stadium is so obviously fake that it should make you laugh. In general, the movie just didn't convince me that a rugby team could just singlehandedly unite a nation, probably because it can't."
    },
    {
      "rating": "8",
      "text": "Pretty good movie!! historically very correct! And even as a South African, you are oblivious of a lot of this going on in your country.. I was ashamed how people were treated.. but.. we shal prevail!"
    },
    {
      "rating": "10",
      "text": "The film is, in my opinion, an accurate depiction of the world cup and took me back to the euphoria and celebrations. One scene I really liked was the little street child listening in on the match with the cops. It got so many things right and painted everyone in a positive light - a true gem and uplifting experience. Well done, Mr. Eastwood"
    },
    {
      "rating": "6",
      "text": "Worth seeing, but dissappointing. The historical truth of the story gives the movie heft way beyond what's actually on the screen; and many, many opportunities for something much more impactful are missed, whether it's big political stuff or just effective sport movie zing. Especially surprising is how flat Matt Damon is. He perhaps revealed something of the reason on a talk show when he said that he once asked Clint Eastwood if they could try another take and he responded with: \"Why? So you can waste everyone's time?\" You can see how little Eastwood knows about acting from how he consistently casts unforgivably bad performers in supporting roles. Still, the setting is great, Morgan Freeman is solid and, again, that story and the real man portrayed in it are amazing."
    }
  ]
}