{
  "id": 129,
  "title": "Iron Man 2",
  "starring": [
    "Robert Downey Jr.",
    "Gwyneth Paltrow"
  ],
  "runtime": 124,
  "genre": [
    "Adventure",
    "Action",
    "Science Fiction"
  ],
  "description": "With the world now aware of his dual life as the armored superhero Iron Man, billionaire inventor Tony Stark faces pressure from the government, the press and the public to share his technology with the military. Unwilling to let go of his invention, Stark, with Pepper Potts and James 'Rhodey' Rhodes at his side, must forge new alliances – and confront powerful enemies.",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6WBeq4fCfn7AN0o21W9qNcRF2l9.jpg",
  "categories": {
    "plot": 6.096774193548387,
    "acting": 6.12,
    "ending": 4.5625,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 4.4,
    "action": 5.526315789473684
  },
  "reviews": [
    {
      "rating": "6",
      "text": "I'm a big fan of Downey but even he couldn't bring this film  to life. His character, arrogant yet funny in the first installment was simply just arrogant this time round. At least Paltrow and Johansson provided some enjoyment and the hope that the film might continue just that little bit longer. Cheadle also at times outshone Downey's own character. The action scenes were enjoyable though. However, even more annoying than the lacklustre script was the feeling that the ending had suddenly been tacked on and then was over far too soon"
    },
    {
      "rating": "7",
      "text": "Many have expressed their disappointing about this sequel. I personally think that it is just as good as the original. Robert Downey JR is great as usual, the action has been improved and Mickey Rourke is entertaining as the terrible Russian. Even thought there are improvements to the sequel, there are also too many characters in the film and the final action scene is quite anti-climactic. Still a high recommendation to fans of the original"
    },
    {
      "rating": "5",
      "text": "After the excitement that was the first Iron Man, the sequel contributes little of anything notable. The story is simply not as entertaining and the action not as captivating as before."
    },
    {
      "rating": "9",
      "text": "I quite liked it. A couple of plot holes (like, if Scarlet Johanssen could hack Rhodey's suit from the Hammer terminal, why couldn't she call off the drones, etc), but all in all a fun, enjoyable movie, and I thought everyone onscreen turned in great performances.\r The complaints about confusing plots and multiple villains are really pretty laughable. The first had multiple villains, and the plot is pretty straightforward assuming you were kind enough to leave a little paste uneaten in grade school."
    },
    {
      "rating": "6",
      "text": "After the first Iron Man movie I was expecting a great sequel, but this fell short because they tried to add to much drama (think Spider-Man 3) and took out a lot of the humor and action that made the first one pop, while the first one was awesome this one was just ok."
    },
    {
      "rating": "8",
      "text": "It's disappointing that Iron Man 2 has a case of sequel-idus, with too many characters crammed and a few too man plot lines for you to really be engaged with all of the characters. Still though, Iron Man 2 has excellent acting, stellar and improved action, great special effects, and good humor. It is not as good as the first, but for a fun summer blockbuster, you can't go wrong with Iron Man 2."
    },
    {
      "rating": "6",
      "text": "I enjoyed it as much as I enjoyed the first film. I thought it did a good job at cameos as well (building towards the Avengers film). The acting and the action was solid as well. It was just a little too corny and generic for my taste. Also I did not like the main villian in the film, Im sure there could have been a better one for them to pick."
    },
    {
      "rating": "10",
      "text": "The movie is just an awesome creation of science fiction and this movie is glorifying the name of iron man in the top super hero names .The movie has great visual effects and  Robert Downey jr has done a great job"
    },
    {
      "rating": "8",
      "text": "This is the first Iron Man movie I've ever seen. It was actually pretty good. My only problem with this movie is that Iron Man isn't seen that much in the film. But all in all, it was a good sequel."
    },
    {
      "rating": "7",
      "text": "Iron Man 2 is an awesome movie which features plenty of action and great CGI. It has an interesting plot and is highly recommended for everyone. Overall, this is a pretty good movie."
    },
    {
      "rating": "5",
      "text": "For a sequel to one of the greatest superhero movies ever made, I gotta say, I was quite disappointed!  It's not a terrible film in any way, the action was fine and Robert Downey Jr is still awesome as Tony Stark!  But the movie is just trying to be so big that it it gets tiresome and nothing goes anywhere!"
    },
    {
      "rating": "6",
      "text": "Stale plot and villain but overall good comedy and action moments and once again great cast, this movie is pretty good!"
    },
    {
      "rating": "6",
      "text": "55 / 100I hope this movie was made as a joke...The first Iron Man was amazing and this one... it's the opposite."
    },
    {
      "rating": "6",
      "text": "This film is a mixed bag. The performances are great, the action is entertaining, and the comedy was done. However the film try's to many plot-lines all at once and fails to make any of them have meaning. They all fall flat, the villain's are really cheesy, and the writing is all over the place. This film follows the same mistakes as The Incredible Hulk but at least the performances where good and the new introduced characters such as War Machine are really likable. A pretty fun but mediocre film."
    },
    {
      "rating": "6",
      "text": "It has all the things first Iron Man film didn't have. And that's not necessarily a good thing. ..Good : RDJ is fantastic as Iron Man and Tony Stark. He has proven himself to be perfect choice in the role in multiple films now, and this is no exception. No matter how ridiculous the screenplay was, he is the last thing wrong with this film. Also, we get introduced to two new characters, Nick Fury and Natasha Romanoff. Their introduction feels very apt for the first Avengers movie which came in 2012. Samuel Jackson and Scarlett Johansson prove to be the perfect choices in the first go. RDJ has a very great chemistry with all the cast members. His sarcastic and a$$holey one liners are damn good. In the entertainment and performance level, there are no complaints. ..Mixed : Even though it was entertaining, it was a total mess. It had a ton of good ideas for a solo Iron Man film, but all of them do not coalesce together to form a solid plot of the film. The plotlines were good, but the final story did not turn out to be so good. I can appreciate what they tried but not what they did. It feels like a misfire. The arc they tried to give to Stark was quite good. But, the screenplay was ridiculous at many parts. We don't feel sorry, neither we sympathize him. Instead, he feels like a gigantic a$$hole, even though he was to be sympathized. ..Bad : It feels like an advertisement for Avengers, rather than an entertaining build up. Studio allowing a very short period of time for making this movie is quite apparent. Whiplash feels as if he would've been a really great villain, but due to ridiculous screenplay, he feels uninteresting. He had motives to stand against Stark, but in the end he feels like a slimy goofball who wants to kill Iron Man to show that he is tough. And the other villain, Justin Hammer, is a blant rival of Iron Man who is a kind of a pu$$y and just a clichéd villain. I loved Terrence Howard as War Machine. Don Cheadle sucks. When Howard was casted, I felt like I would get a War Machine solo some day, or at least be in a really good role other than being a sidekick to Iron Man. But with Cheadle, I felt that it would be better if they make him just a sidekick and luckily, that's the case till date. ..Conclusion : It's an entertaining mess. You will enjoy RDJ and his one liners, and, the overall charisma that everyone, except Cheadle, bring to the characters they play. But if you expect it to be a solid sequel, it ain't so. Whiplash feels like a wasted villain and Mickie Rourke feels like a wasted talent. He did fine with the material he was given to work with, but it never felt like he was necessary for the role. But the biggest issue would be that it feels like an advertisement of Avengers rather than a build up, and the plotlines not meshing together makes it a disappointment to a certain extent. ..Rating. ..Score : 6.3/10Grade : B"
    },
    {
      "rating": "6",
      "text": "Upon watching this movie I can definitely tell the script is rushed and while it is kind of enjoyable after watching Tony's death in Endgame. Even though RDJ is great I really did not like him in this movie and there are a lot of storylines in this movie."
    },
    {
      "rating": "4",
      "text": "I have to admit that I thoroughly enjoyed the predecessor of this Iron Man franchise.  Well it was not exactly cerebral as The Dark Knight (its Summer opponent of 2008), it was fast-paced and indeed had enough action to fill its run time. I wish I could say the same about the sequel, Iron Man 2. What was a franchise known for its action, is now a dull plot-developing movie. The majority of the movie focused on the foolishness of Robert Downey's character.  Although well-acted, I wish there was more \"Iron Man\" than of Tony Stark.  The final scene of the movie does go back to it comic-book roots with the duo of War Machine & Iron Man, but it feels empty because there was not much to support it. It is an acceptable and somewhat enjoyable blockbuster, but I could not get over the mindless drama and lack of action."
    },
    {
      "rating": "7",
      "text": "I would have given it a 7.5 if they hadn't shown Mickey Rourke's rotten fingernails so many times. Actually, they would had to have shown his fingernails zero times to get my 7.5 Dear Mickey Rourke's Fingernails: See you in my nightmares."
    },
    {
      "rating": "9",
      "text": "\"Iron Man 2 is one of the sequels that by far beats out its Predecessor .. I loved every second of this thrill to the min Extravaganza ,Robert Downy Jr. Was Brilliant as Tony Stark .. a MUST SEE for everyone!\" .. A"
    },
    {
      "rating": "10",
      "text": "Jon Favreau has done it again!"
    },
    {
      "rating": "3",
      "text": "I was pretty bored to tears while watching this movie.  It's a real shame since the first one had some nice moments to it, the film just stays within the constraints of those people who would be satisfied with classifying every no-brain-required movie as \"hey, it's just entertainment\".  Once again it could have more than the sum of its highly expensive parts and give us something other than by-the-book action sequence after sequence.  Stark is pretty much the same except that now he has a bit of angst, but don't worry that's quickly solved by some BS that the writers threw in to wrap things up quite nicely.  Nothing has importance or impact, and I was just waiting for the happy ending that inevitably followed.  The only glimmer of light in the whole movie was Mickey Rourkes and Sam Rockwells performance.  Let's end these superhero movies while we still have some diginity...or take a freakin leap of faith and someone start writing better ones instead."
    },
    {
      "rating": "4",
      "text": "The whole movie was crap. The movie never had its \"climax\". All was pre-pre-pre-pre-pre- final scene. All the movie i was thinking \"so...whats next... i already saw this at iron-man 1...boring....joke not funny...\"The scene protagonized by Scarlett Johansson sucks... In general i think the writers said :- \"how we can make a better movie\"- \"Iron-man 1 was great\"- \"oh, i know! what if... if 1 iron-man is great, then we should put 30 iron-men in scene\"- \"yeah!! spectacular\"- \"but the story?\"- \"does it matter? Fill it with anything\""
    },
    {
      "rating": "5",
      "text": "the first iron man was really enjoyable the second one just fails to deliver . downy is still fun to wach as stark but thats about it . the plot doesnt seem near as entertaining as the first and it feels like theres even less action then the first and what action it has feels so ho hum it just doesnt grab you. the final battle especially basically just iron man running around for 10 min then the last 1 min is the final battle . it all felt so anticlimactic and just not very enjoyable . such a shame."
    },
    {
      "rating": "5",
      "text": "With a baffling story and really unnecessary humor, Marvel's \"Iron man 2\" doesn't seem to have the prominent blockbuster spirit its prequel contained."
    },
    {
      "rating": "4",
      "text": "Sure, it isn't The Dark Knight, but its the near-perfect blend of action, drama and humor that makes Iron Man 2, one of the best comic-book films of all-time, and undoubtedly, one of this year's best films as well.  A 10/10."
    },
    {
      "rating": "3",
      "text": "I found this film to be highly disappointing. When I saw the first Iron Man, I was blown away by it. It was an epic, action packed adventure. Which included an excellent, easy to follow script and a great, entertaining story. One of the best super hero movies I had ever seen. This movie however couldn"
    },
    {
      "rating": "10",
      "text": "I'm giving this a 1 since it fails on so many levels. I go to the movies to escape reality / this film had too many political overtones. It felt like whatever script was available fell away only to be replaced with a jabbering/chattering Robert Downy Jr. His character seemed like a horny 11 year old amped up on caffeine and sugar. The first Iron Man had some meat to it, a decent story with a great mystery which was portrayed with great acting and outstanding special effects. This film just has special effects, nothing else."
    },
    {
      "rating": "10",
      "text": "im not sure why this movie is rated so low? it had the perfect mix of action and comedy, had great acting ,an interesting storyline and some killer special effects. honestly what more could you ask for?"
    },
    {
      "rating": "0",
      "text": "What a let down, I thought the first movie was pretty good (except for the fact that Iron man gets his %$# kicked by the bad guy and then defeats him without the need of his iron man  powers!). The action scenes were boiler plate stuff, nothing special, the final battle was short and lame, and Downy's character was just plain annoying throughout the movie, and yes, once again Iron Man could not beat the bad guy  with his Iron Man suit, he needs help this time around. Glad I waited to rent it!"
    },
    {
      "rating": "3",
      "text": "Its a 2 hour movie with what feels like 15 minutes action. Endless babbling plus a bad story. Waste of time except for kids. Great animations though. Its probably a good movie for the youngest."
    },
    {
      "rating": "3",
      "text": "Felt promising for the first 15 minutes or so, then it just didn't go anywhere. There was absolutely no suspense, no payoffs, no real emotion, not even any good laughs. To top it all off the film had some of the most boring action sequences I've seen in a recent superhero movie, and surprisingly few at that. It was as if the entire thing was just filler."
    },
    {
      "rating": "3",
      "text": "This movie was stupid. I dare anyone out there, including the script writers, to tell me what the point of the movie was. There are some dorky references to other super heroes, some things that seem like inside jokes to the geeks that think their comics are \"good source material.\" The hero doesn't risk anything, nothing is lost, he's never really threatened by the villains, every problem was resolved easily and required no cleverness. SPOILER: Building a particle accelerator in your basement and creating a new element to fix his heart device is stupid - it's not even a level that Star Trek writers would sink to. Sam Jackson's side plot was distracting and pointless. The jokes were L-A-M-E...like tongue-in-cheek 1960's Batman lame. The only thing I can say good about Iron Man 2 is that Downy Jr. and Rourke are good at what they do. But I have a feeling if they weren't recovering drug addicts, we wouldn't be rooting for a 45 year old alcoholic corporate superhero fighting a 58 year old vodka-drinking villain."
    },
    {
      "rating": "3",
      "text": "The movie was almost totally devoid of true excitement and tension. The closest it came to a a thrilling scene was the Monaco face off with Whiplash but that was over very quickly and what follows is largely a CGI-fest that was silly and boring. Very disappointing sequel."
    },
    {
      "rating": "5",
      "text": "For an action movie in my opinion it fails to excite. Downey plays the flamboyant Tony Stark well as do the other actors but its divergence"
    },
    {
      "rating": "4",
      "text": "The 1st one was good (rate it 8). This one not so much. Unbelievable action scenes, not much of a story. Hoping the Avengers movie will be better. Couldn't wait for this one to be over."
    },
    {
      "rating": "5",
      "text": "Beware! We've all seen this predictable plot before many times! After the first 10 minutes of the film it was clear what would happen the rest of the movie. Robert Downey carries this turkey on his back with his fun Stark character. Without him this movie would fail miserably. The sequence where Tony Stark creates a new element was ridiculous, but then the movie is purposely over the top and we know that going into it. Some of the CGI was surprisingly lame, especially the fight between Cheadle and Downey at the house, but most of the CGI was very good."
    },
    {
      "rating": "9",
      "text": "Iron Man yet again rocks the house in this hair raising thriller when he faces his newest rival, Ivan Vanko. With better effects, sound, picture, & action, Iron Man 2 will have you wanting more before the credits even roll."
    },
    {
      "rating": "8",
      "text": "Although the first movie was much better, this was still a lot of fun!  Highly recommended for all to see.  Don't forget to see Robert Downey Jr. in Sherlock Holmes, too!"
    },
    {
      "rating": "8",
      "text": "Even though the movie is not as exciting or surprising like the first installment, this second part is still great superhero entertainment with a good script and nicely done action scenes. Robert Downey Jr. and Gwyneth Paltrow stand out once again with their great characters even more on this film. Yet, the change of the actor of the lieutenant may have not been for the best, because Don Cheadle does not show enough emotional friendship with Tony Stark. Still, it is a movie worth to check out!"
    },
    {
      "rating": "0",
      "text": "Paycheck movie extraordinaire.Just awful. RDjr's and Don Cheadle's talents are utterly wasted on this exercise in big budget Hollywood garbage. Gwynth Paltrow has no talent, so she's well within her element here. The writing is so uninspired, and the BIG part Jon Favreau plays is frankly lame, and not a little self serving. Where were the editors on this movie too, because it has massive balance problems, and endless filler scenes? This was no doubt a bridging movie to get us into the much vaunted trilogy territory. If there is an I.M.3, and it seems impossible there won't be, you can count me out."
    },
    {
      "rating": "2",
      "text": "a big disappointment yet again all the summer blockbusters are overhyped rubbish as usual the sequel is not nearly as good as the first.All of us wait in anticipation and for what?"
    },
    {
      "rating": "1",
      "text": "terrible, just awful. the clever discovery and good action and characters and humor and everything else from the great first movie is replaced by pure stupidity and disappointment."
    },
    {
      "rating": "7",
      "text": "Good, but not nearly as good as the first one. Somehow Mickey Rourke builds a super suit and still gets his ass kicked by Ironman?? Can't stand the good guy always winning every battle no matter what the odds storyline. I guess it's worth watching"
    },
    {
      "rating": "2",
      "text": "When ironman 2 started I thought wow impressive, the effects were quite impressive, but then the story ends up spoiled, like a pair of spiked pants. The whole it becomes alot disorientational and uninspiring, I mean what the hell is goingOn here.Stark himself is a **** guy, suit gets robbed, drones, the wrestler with whips lmao seriously get a grip."
    },
    {
      "rating": "2",
      "text": "This movie is a dud.  It's just as bad as \"Transformers: Revenge of the Fallen.\"  Mickey Rourke as a Russian scientist?  Give me a break, or at least my money back."
    },
    {
      "rating": "6",
      "text": "This film was a major step down from the first film.  I was not a fan of how they took Crimson Dynamo and Whiplash and turned him into a villain that was nothing more than a punching bag for Iron Man & War Machine.  This movie just didn't feel like it had high stakes and started playing too much for humor instead of taking the source material seriously.  Black Widow was definitely a nice touch though."
    },
    {
      "rating": "6",
      "text": "Iron Man 2 is not exactly a worthy followup to the original. My problems with the film: The fight between Rhodey and Tony in his mansion with DJ AM in the background was really dumb. These two guys are supposed to be best friends? Yeah Tony was being a douche, but that doesn't mean you steal one of his suits and proceed to try to beat his ass and tear up his whole damn mansion in the process. It just felt like they needed an action beat, like they said \"Oh hey, it's been x amount of pages since we've had some action to entertain the audience, we need to stick a fight scene in here according to this scriptwriting 101 guide.\" It seemed very forced and unnecessary to me.Justin Hammer was cheesing up the joint and just acting way too goofy.Tony and Pepper's playful banter had turned into a lot of bickering that wasn't that fun to watch.Tony's father had hidden away his secret formula for an amazing new element as... the overhead blueprint for his **** Stark Expo? What the hell, why would anybody... what? That doesn't even make any sense. How would he know that Tony would possess a nifty holographic projector that could strip away the details and reveal this magical wonder element? Why not just write down the formula on a piece of paper, why hide it as the layout for a stupid ass expo? This... this **** stinks.How is Tony's new power source poisoning his blood? The palladium core goes right into his arc reactor, why would this end up in his bloodstream? His bloodstream seems completely segregated from the reactor. Couldn't he just invent some filter between the reactor and his body? He seems good at inventing stuff.At the race track, when Vanko attacks... why don't the security guards just shoot Vanko in the chest with their guns? His exoskeleton doesn't seem to cover his chest, they could shoot him to death.Rourke's Vanko spends most of the second half of the movie in a factory building robots. That's kinda boring, you shouldn't have your main villain squirrelled away that much.The final battle with Vanko was way too short and just involved IM and WM doing some stupid high-five with their repulsors. Vanko also opens his helmet for no reason, making his head incredibly vulnerable. But other then that, I thought it was an enjoyable experience."
    },
    {
      "rating": "8",
      "text": "The biggest flaw of the film is how they pause the action just to show you upgrades to the suit. It was interesting to see what was so different about each suit but to do it right in the middle of a fight takes away all the excitement of the fight that is happening. I didnt mind the plot either but it could have been a lot more interesting and it could have taken a lot less time to explain.\r I did like how it featured a lot of interesting action through out. I liked the addition of Don Cheadle (as Terrance Howard's replacement) and Robert Downey Jr gave a great performance as well. I suprisingly liked it a lot more then the first film."
    },
    {
      "rating": "4",
      "text": "Okay Iron Man 2 is better than the first because the new actors but yet again there isn't much action and when there it is it sucks. More stupidy throughout the film. But hey its an improvement from the first."
    },
    {
      "rating": "5",
      "text": "I really felt like something was lacking from Iron Man so when i heard about the sequel i was of, coarse, very skeptical. Iron man 2 is an enjoyable film, none the less, yet has so many flaws that kinda out way the positive, first the Humor is funny, the action and fight scenes look amazing and spectacular and the acting is solid plus it hints at a future Avengers movie, yet despite all this the things that matter to me the most are just Terrible, the characters come of as annoying and i really didn't care what was happening i just wanted to see stuff blow up, the Villain in appalling and is very forgettable, the plot doesn't really have any focus and feels boring and slow at times also whilst Iron man had a really weak final act this one has an awesome astonishing final act yet the rest feels like pointlessness that really served no purpose.\r Overall i wasn't really surprised that this sequel didn't live up to the good original film, yet, still i recommend siting down and watching the film cause it is pretty entertain when it wants to be.\r 5/10"
    }
  ]
}