{"id": 354, "title": "Iron Man", "starring": ["Robert Downey Jr.", "Terrence Howard"], "runtime": 126, "genre": ["Action", "Science Fiction", "Adventure"], "description": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.", "releaseYear": "2008", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/78lPtwv72eTNqFW9COBYI0dWDJa.jpg", "categories": {"plot": 6.964285714285714, "acting": 7.464285714285714, "ending": 3.75, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 5.285714285714286, "funny": 8.777777777777779, "action": 6.75}, "reviews": [{"rating": "9", "text": "A charismatic lead from Downey, Jr., spectacular effects, a surprisingly coherent story, and witty dialog, Iron Man is the rare summer blockbuster that manages to be ridiculously fun while also providing a great story and characters.  I couldn't have imagined a better start for the MCU.\r 9.5/10"}, {"rating": "8", "text": "Iron Man is a great way to kick start the Marvel Cinematic Universe. Robert Downy Jr. gave a really god performance as Iron Man, and the movie had witty jokes and good quips. This certainly is one of the better Marvel films."}, {"rating": "8", "text": "A great start to the MCU. Tony Stark is a great character and one of the best things about the movie is the fact that there's no \"if so-and-so isn't stopped, the world will end\" thing from a lot of superhero flicks. Some bad stuff will happen, but nothing that'll bring about the apocalypse. Robert Downey Jr. Gave a good performance (truth be known though, he was essentially playing himself...)  it's definitely a good movie. Nice beginning to one of the most well known superhero franchises ever... The Marvel Cinematic Universe."}, {"rating": "9", "text": "It-Doesn't-Get-Any-Better-Than-This! What a ride... This movie is the reason you pays yer money to see it on the big screen. Wow. And, in a weird way, the high tech world of Tony Stark doesn't seem so far fetched, considering it's a comic book fer cryin' out loud! Attention Robert Downey, Jr.: Stay sober, man... You are a fantastic actor & you pull off this anti-macho, cool cat, hipster industrialist Big Time."}, {"rating": "9", "text": "Iron Man is easily one of my favorite super hero flicks. The characterization of Tony Stark as Iron Man is wonderfully done and his growth and development as a character was really well done. Robert Downy Jr. was amazing along with the rest of the cast. The honest characters moments and brief exchanges make the movie feel real and the characters are written so honestly. The romance is well done, the humor, however the motivations of the villain get muddled later in the film. The action scenes are rare which makes the pacing way better and leaves more room for the story and characters but also makes the action scenes super rewarding. They are very entertaining and fun to watch. Its a superb film and it was nearly perfect and will be remembered as a classic."}, {"rating": "2", "text": "Am I crazy here, or did nobody else notice how crappy this movie was. Yes, Robert Downy Jr. is a good choice for the role but not when every line he has is some horribly cheesy joke. The robot banter also seems right out of the eighties. The romance between him and Paltrow is egregiously underdeveloped and the action wasn't even that good."}, {"rating": "5", "text": "The only good thing besides the effects is Downey!, almost the worst of Marvel comics."}, {"rating": "4", "text": "A good movie to nap to during a Sunday afternoon matinee. Way over rated."}, {"rating": "1", "text": "This is basically 'Robocop' updated to 2008. Except it's nowhere as good as that film. The '87 thriller is set in the future with a semi-plausible scenario: the body of a murdered police officer is used to create a robot who still retains traces of the dead man's memories. The core of Iron Man is totally implausible: set in the present time, the iron man (played by Robert Downey Jr.) must prance around with some kind of magnet implanted in his chest cavity, preventing shrapnel from puncturing his heart. Then, he invents an iron suit which enables him to fly at supersonic speeds and kill terrorists without suffering serious injury. Like Robocop, a computer interface is suggested inside the 'mask' of both superheroes; but in Robocop the hero is haunted by the memories of the dead man whose body was used to create him. There is no such internal tension in Iron Man. It's strictly a good guy-bad guy shoot 'em up. Downey plays Stark, the head of a large corporation which manufactures weapons. Stark is depicted as an arrogant playboy who takes no precautions when he travels around in a Humvee in Afghanistan. He ends up being captured by a local warlord and his crew of motley insurgents and realizes that they have been using his company's weapons to fight US troops. Now he suddenly has a change of heart and uses his skills (he's a genius!) to create an iron man outfit to escape the bad guys (they think he's working on a missile). When he returns to the US, he decides to utilize the prototype of the iron man outfit he created in Afghanistan to become a superhero fighting for good. A good part of the film is taken up with Downey designing the new Iron Man outfit; during the 'testing phase' he gets thrown against the walls of his laboratory numerous times (how exciting!). Finally, he starts flying through the air with this metal suit on and almost crashes when he goes too high up in the atmosphere and his suit gets frozen with ice (funny how he wasn't smart enough to invent some kind of deicing device contained on most commercial aircrafts). Terrence Howard (of 'Hustle & Flow' fame) isn't doing much hustling and flowing here in a do-nothing part as an army liaison officer for the munitions company. Similarly Gwyneth Paltrow, Stark's personal assistant, engages in a great deal of pointless banter leading to a non-romantic moment at the film's denouement. Jeff Bridges probably has the best part as Downey's partner in the multinational corporation who ends up betraying him and working with the warlords and terrorists in Afghanistan. But how did he so easily get past the alarm system or other security devices in Downey's home? You would think that breaking into a home like that wouldn't be so easy. In the end, there is the obligatory battle between the two machines (done much better in Terminator 2). Bridges looks ridiculous when he takes off his metal helmet and all you see is his face inside the metal contraption. I fail to see why so many critics gave this film good marks. It's strictly a film for uneducated teenagers who read comic books all day. It also serves to lull people in this country into a false sense of security vis-a-vis the terrorist threat. By creating an invincible 'Iron Man\" who can easily mow down terrorists and bad guys, it makes us forget that the bad guys in real life are not so easily defeated. Case in point: 9/11. The only winners here are the actors who collected nice paychecks for participating in such a cheesy and worthless venture."}, {"rating": "2", "text": "I don't understand what people liked about this movie. Boring and stupid. Cool graphics can't make up for a sagging plot and horrendous storyline."}, {"rating": "4", "text": "Plenty of expsnsive gadgets and state-of-the-art cg for the tech-and-status-obsessed 14-year-old in us all. The dark underside of all of this sound and fury is the perverse idolatry of Hollywood Wastrel #1, Robert Downey, Jr., who is in essence playing himself, the bad boy who is more smug than ever for having gotten away with it after all these years. One of the most cynical products of our cynical age."}, {"rating": "5", "text": "I thought the story was flat and marred by so many dull plot elements. If not for Downey's irrepressible personal traits that I suppose everyone wanted to be part of the character, there would be no one on screen worth bothering about. The robot is cool, there are a slew of fancy sport cars, the baddies are politically current and a bevy of hot ladies grace the screen. . . All the essentials are down."}, {"rating": "5", "text": "The good: Great, great special effects and CGI. This can't be stressed enough. Great acting all around. The bad: Stale plot, predictable plot. Can you say \"stereotypical middle eastern bad guys?\" I gotta be honest: I'm not a huge comic book guy and this was the movie I chose to break my streak on. I'm wishing I didn't. This is just the usual Hollywood stuff being churned out en masse as any original ideas have virtually dried up."}, {"rating": "2", "text": "Even checking your brain at the door might not be enough to save this film. I got a free ticket and felt that was an over-charge. To be truthful, I did walk out half way through (around the time where Ms Potts pulls the coil out of Stark's chest), so it might have picked up from there. If you are gung-ho military, have racist attitudes towards Afghans and do not mind a very unconvincing script, see this movie!"}, {"rating": "10", "text": "I've never been a giant fan of Comic book movies, but I always seem to enjoy then none the less-as long as there decent:I'm talking to you Incredable Hulk. Though I don't quite have words to describe how wonderful this movie was-and how amazing Robert Downey Jr was. No one, absolutely no one could have played this character better. It's the best casting I've seen since John Barrowman in Torchwood. Amazing story, fantasticly snarky, and the genious of Robert Downey Jr, who could ask for more! I saw it twice the first weekend:)"}, {"rating": "10", "text": "This movie was breathtaking!!!  It was action packed, funny, and quite intelligent too!!!  Robert Downey Jr was born to play the role of Tony Stark and this will always be known as one of the greatest comic book movies ever made!"}, {"rating": "8", "text": "One of the good MCU movies. Manages to be thoroughly entertaining, with very few boring moments."}, {"rating": "10", "text": "STill a very good MCU film in 2019. Really like how they made him say I am Iron Man in this film than in Avegers: Endgame."}, {"rating": "8", "text": "Iron Man started all the fame for which Marvel can thank today. Were it not for the success of Iron Man, who knows what would happen to Marvel today. But Iron Man has been a success, and I'm not surprised. The story is excellent, the action scenes as well and the soundtrack pleased. It all just works here and I can recommend the film."}, {"rating": "9", "text": "Strong start to the MCU and this is still one of the best MCU movies ever made. And RDJ as Tony Stark was perfect and it is just a classic Marvel origin movie."}, {"rating": "8", "text": "This is Robert Downey JR's film. He is Iron Man and he is the thing that propels the film ok comic book film, to great comic book movie. Definitely watch this movie, especially if you want to get the most out of watching the avengers."}, {"rating": "10", "text": "It's an origin story minus the boredom. There's a whole lot of action, drama and humor that will keep you on the edge of your seats. Intensely exciting, you can't keep your eyes off the screen because any moment, something intriguing may unfold. Great script, great director, great actors, what more can you ask for?"}, {"rating": "7", "text": "The action and humor is amazingly strong and unnecessary to prove the movie that its worth more than the others; in the end, \"Iron Man\" is just a decent summer blockbuster."}, {"rating": "10", "text": "Jon Favreau made some great effort in making this superhero epic hit with some talentive acting from Robert Downey Jr."}, {"rating": "8", "text": "One of the best superhero movies i've ever seen, but not the best. I like Downey and the character of him. I love this movie."}, {"rating": "9", "text": "Definitely one of the best superhero movies of all time, Iron man has it all, action, humor, and most importantly intrigue. It saddens me that the later marvel films (with the exception of TWS)  weren't able to capture the same magic. Iron man not only revived Downey's career but also gave the comic books the recognition that they deserve."}, {"rating": "10", "text": ".........................................................................Robert Downey Jr, is Amazing in his Comeback full of Style, Iron Man is a potent Blockbuster, With Humor, Action and Coherence..."}, {"rating": "5", "text": "Run of the mill plot twists almost seem besides the point in this movie. The director/producers/screenwriters hit all the marks of a typical superhero movie, knowing that the movie will be a crowd pleaser.This movie feels as though it would have been fresh at least 10 years ago, but, as seen in 2008, the movie is somewhat dull. Robert Downey Jr's line readings and the banter between him and Gwyneth Paltrow are the most entertaining elements of the movie. Even the character of the villain is boring. If a movie of this sort doesn't have a strong, seemingly invincible villain, then what is the point?"}, {"rating": "10", "text": "Thanks to its excellent cast, especially Robert Downey Jr., the awesome humor, impressive action, and great script, Iron Man is one of the best comic book movies of all time!"}, {"rating": "9", "text": "Great film with an amazingly well-translated origin story.  The first half of this film is fantastic, for both casual movie-goers and hardcore comic book fans alike.  However, unfortunately, the film starts to lose a bit of direction in the second half  it never gets bad...it just starts to fall a little bit flat.  I don't feel like Iron Monger was strong enough of a villain to carry the ending.  Great movie overall though, one of Marvel's best."}, {"rating": "9", "text": "The first of the Marvel Universe is one of its best. Before this flick, Downey Jr was a 'has been actor' and Iron Man is considered as a B-List Marvel Super Hero.  That practically changed overnight, with Iron Man. Exciting, humorous and 'organic', Iron Man carries with it a peculiar Indie sensibility in its dialogue.  Great and career defining performance by Downey Jr, catapulting him into an A-Lister.  He is Tony Stark, pure and simple; a performance on par with Chris Reeve iconic performance as Superman.  Rewatch it again to prepare yourself for Iron Man 3, folks!"}, {"rating": "9", "text": "Iron man is the first MCU movie and it is great Iron man is about Tony Start is conducting a weapon test while the terrorists kidnap him and force him to build a weapon instead tony stark builds an armored suit and ends hit captors than stark builds a better suit for the crime in the city and in America as a whole this movie is great as an MCU and as a stand-alone movie Robert Downey Jr as tony start and iron man is great I do like Rhodey he did not come back for the sequel of the movie the villain in the movie is Obadiah Stane after the first act he starts to get mad ate tony start of what he is doing with his weapons everything in this movie I like besides the first act of the movie I think is a little to slow but it does pick up when he starts to build his first weapon when he is  captured there is a lot to like here in this first MCU movie I give Iron Man an A-"}, {"rating": "4", "text": "Very strange film, very strange message - seemingly thus; man has epiphany that making weapons is wrong (regardless of it allowing him a billionaire playboy lifestyle). What does he do? Makes himself a new, more powerful weapon and starts warring again. Scratch the surface and it still brashly glorifies advanced weapons and war too (I thought in these Iraq war-years we'd all lost our appetite for such things. Seemingly I was wrong."}, {"rating": "5", "text": "I want everyone to just hold on a second and think this through. Is this movie really what passes for good these days? It wasn't more than acceptable. The plot is moronic. I guess everyone just takes that for granted, but can't we maybe afford to raise our standards a bit? Downey Jr is just a sardonic james bond, complete with his own moneypenny and over the top gadgets."}, {"rating": "3", "text": "Overrated movie, just another solid action movie. Nothing more, nothing less."}, {"rating": "3", "text": "Where previous American cultures made cinematic spectacle of the Bible or historical turning points, we, sadly, celebrate comic books. So, of course, this is thin. As you watch this your mind can wander... remember when Robert Downey Jr. broke into a house and went to sleep in some kid's bed... I thought at one time Terence Howard was going to be a good actor... did they approach Paltrow's husband to do the music?... who's the bad guy in this film, anyway... oh, sure, it's him... but what's his deal? If you like this movie a lot, maybe it's time to put away childish things."}, {"rating": "4", "text": "The leads are riveting; the story is not. AND, the play upon ethnic stereotypes is obnoxious. I wanted to watch for Robert Downey Jr and Gwyneth Paltrow, and also the computer effects, but in the end I just couldn't tolerate the movie and it's standard good guy-bad guy stuff."}, {"rating": "0", "text": "Worst movie I've ever seen honestly i don't know what they were thinking. Minimal fighting scenes and slow and long. So bad please take my advice do not see this movie."}, {"rating": "5", "text": "Military industrial complex driven movie should be inspiring for a younger generations. Perhaps thats why most of the corporate media gave it a big thumbs up. The perfectly sanctioned Pentagon film for the cattle. Enjoy."}, {"rating": "3", "text": "I feel like I was watching a commercial rather than a superhero movie. Burger King, Audi and others really make me feel like this movie was made to showcase all the brands. Sure, Transformers also did it but it was not obvious. Robert Downey Jr. really portrayed the billionaire Mr. Stark but Gwyneth really disappoint me. Hope the sequel will be a proper movie rather than a commercial disaster."}, {"rating": "5", "text": "No matter how much the CG costs, it will never be a substitute for good dialogue and plot. Iron man was lacking in both of these areas. Acting was brilliant all around, but the stereotypical middle-eastern terrorists/psychopaths were far too cliche. In summary, there was good eye candy and great acting, but everything else was well below average."}, {"rating": "3", "text": "I'm not familiar with the comics but this movie was garbage. The character development seriously lacked. Who is Starks and why should I care about him? It seems to me that such a conflicted character could have been handled a bit more seriously. The whole movie felt like filler with a few decent scenes mixed throughout. The acting was one dimensional and dialog felt forced throughout the entire thing. A few cheap laughs, guilty of working over the audience multiple times is not what I call comic relief or entertainment. Even for summer blockbuster fare, I thought it really did not deliver."}, {"rating": "7", "text": "Every time i sit down and watch Iron Man i just cant help but think that its kinda average at best, will above average. Maybe its just the fact that i personally cant really relate or like Tony Stark because hes got 2 much of an ego and just feels like a blunt Batman ripoff without the emotional complexity, also the film just kinda drops in quality after the second half with a very disappointing third act that i felt was rather rushed and didn't really quite hit all the right notes. All In all its an enjoyable film with an amazing performance by Robert Downy Jr just is not the greatest marvel film of all time and really managed to lose my interest.\r 7/10"}, {"rating": "7", "text": "O melhor dos 3 sem dúvidas"}, {"rating": "3", "text": "It was okay, I didn't really vibe with the movie though. The graphics and the suit looked cool though. The movie could have been a lot better but then again maybe I'm just criticizing too hard."}, {"rating": "9", "text": "After disappointments like \"X-Men: The Last Stand\" and \"Spider-Man 3\", \"Iron Man\" is a big renaissance for the Marvel Universe and it is STILL a solid superhero movie."}, {"rating": "8", "text": "A great film has a great soundtrack, good special effects, has some funny scenes, Robert Downey Jr. played very well the role of Tony Stark, the story was very well done, and the armor of Iron Man was also great, I recommend for those who have not watched, you watch, worth it."}, {"rating": "10", "text": "This is where the Marvel Cinematic Universe began, and possibly the benchmark for comic book movies in general. Before there was 'Captain America: The First Avenger' (2011), before there was even 'The Avengers' (2012), there was 'Iron Man'.\r Robert Downey Jr. makes a comeback for his career as Tony Stark, an eccentric businessman who gets kidnapped and builds a robotic, weapon suit and manages to escape. Gwyneth Paltrow is Pepper Potts, Tony's assistant throughout the entire film.\r Jon Favreau, best known as Pete Becker from 'Friends' (Monica's rich boyfriend), and directing 'Elf' (2003) directs this movie with confidence and sure-handedness. 'Transformers' (2007) was released the year before, and I complained that the action scenes, while dazzling, were a bit of a technological mess. Here, you know it's strange when a comedy actor/director can craft a better action movie than Michael Bay, a filmmaker from day one and has directed many action films in his career, but hasn't won the respect of any film critic or audience member.\r Jeff Bridges plays Obidiah Stane, the main villain of the film who wants Stark's technology and will do anything to get it.\r 'Iron Man' is a dazzling summer action blockbuster, full of the comedy charm we expect from Robert Downey Jr. and the action scenes are cleaner and less confusing than the ones in 'Transformers' (2007).\r This movie, along with 'The Dark Knight' (2008) are two of the best comic book movies of 2008, and they have raised the bar for the genre. This is fun, and edgy. No other Marvel movie could be a better start to a fantastic universe."}, {"rating": "8", "text": "Comic-book-to-film franchise starters often sag under the weight of creation stories, establishing conflict between the super-heroic and super-villainous and introducing a roster of iconic characters familiar to comics geeks but unknown to the general movie-going public. That's an awful lot of exposition for any one film to handle. Jon Favreau's Iron Man wrestles with those responsibilities as well as a relatively unique conundrum: How do you make audiences care about a character whose face is hidden under a metallic scowl? The Iron Man filmmakers' answer is to cast Robert Downey Jr. in the lead role and keep him out of the Iron Man suit for as long as possible.\r Downey stars as dashing billionaire playboy Tony Stark—part Howard Hughes, part Errol Flynn—who leads a life unencumbered by reflection until he's captured and held hostage in Afghanistan by terrorists using his company's weapons. Downey escapes by building a crude version of his Iron Man suit. Upon returning home, Downey perfects the robotic flying suit, but when he announces that his company is getting out of the weapons business he makes himself an inviting target to rivals, including enigmatic father figure Jeff Bridges, who looks disconcertingly like Winter Kills co-star Sterling Hayden with his shaved head and mad-prophet beard.\r Iron Man takes its sweet time getting Downey into the Iron Man suit, and it doles out big action setpieces sparingly once man has fused triumphantly with machine. Downey is so much fun as a breezy cad that it's a shame he spends so much time brooding and luxuriating in obsession. Like Ang Lee's Hulk, Iron Man is a comic-book blockbuster characterized as much by heavyweight acting and sober intellectual concerns about the use and misuse of power and technology as the usual comic-book foolishness. But Iron Man finds a much more palatable, audience-friendly balance between delirious spectacle and tortured introspection thanks largely to Downey, a great actor who's also a great entertainer. His relationship with a fire-extinguishing robot is funnier and more poignant than the central relationship between humans in most movies, and there's nothing arbitrary about love interest/long-suffering assistant Gwyneth Paltrow. Having gotten all that exposition out of the way in a brisk and entertaining fashion, Favreau paves the way for more pure fun and excitement in future entries. Iron Man is the rare comic-book movie that makes the prospect of a sequel seem like a promise instead of a threat."}, {"rating": "8", "text": "Great film made even better by the arc Tony takes through the whole MCU. The villain is the only down point"}], "recommendations": ["iron_man_3", "daredevil", "iron_man_2", "the_amazing_spider_man", "the_equalizer", "ant_man_and_the_wasp_quantumania", "spider_man_far_from_home", "thor", "the_league_of_extraordinary_gentlemen", "hellboy", "demolition_man", "captain_america_the_first_avenger", "men_in_black_ii", "wonder_woman", "spider_man_homecoming", "gangster_squad", "spider_man_3", "angel_has_fallen", "true_lies", "the_incredible_hulk", "man_of_steel", "red", "hulk", "spider_man_no_way_home", "elektra"]}