{
  "id": 367,
  "title": "Iron Man 3",
  "starring": [
    "Robert Downey Jr.",
    "Gwyneth Paltrow"
  ],
  "runtime": 130,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "When Tony Stark's world is torn apart by a formidable terrorist called the Mandarin, he starts an odyssey of rebuilding and retribution.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qhPtAc1TKbMPqNvcdXSOn9Bn7hZ.jpg",
  "categories": {
    "plot": 4.038461538461538,
    "acting": 4.290322580645161,
    "ending": 4.75,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 5.421052631578948,
    "funny": 3.473684210526316,
    "action": 3.8461538461538463
  },
  "reviews": [
    {
      "rating": "6",
      "text": "I have to say that this movie was a disappointment overall.  Mandarin aside, which comic junkies will kill this film for, this movie just wasn't Ironman.  Yes, there are a ton of Ironman suits, but Tony Stark spends more time being James Bond than Ironman.  The emotions and stress that Stark is dealing with is interesting, and the subtle references to The Avengers is good, but other than that, this movie had no real depth at all.  The motives for the bad guys is not really evident, nor is the explanation of the extremis virus.  One minute you have a glowing man turning into a bomb and the next you have 10 glowing guys who breathe fire and regenerate except when killed?!?!?!?!  All the Ironman suits were cool but how they get to that point is pretty pointless.  It was an ok movie, and probably better than the second one, but was more of a money grab than a great film."
    },
    {
      "rating": "4",
      "text": "A lot didn't seem to click with this movie, as with the previous Iron Man films.  The villains are always so underdeveloped or underused to the point of asking, who is Iron Man fighting?  After ruining Whiplash who was perfectly cast, they completely ruined Mandarin.  I'm not a huge comic buff but I know enough to realize it was done poorly.  That doesn't make the review though, the movie as a movie just wasn't good regardless.  The run time of two hours and fifteen minutes felt like four hours and thirty minutes.  There were a lot of parts that just didn't seem to matter.  Additionally, there was a lot of screen time of Iron Man not being Iron Man.  Where Tony Stark would sneak around like beloved secret agent 007 but I felt it really didn't fit the character.  Especially since it didn't make any sense as later in the film we discover he had fifty Iron Man suits waiting under his house.  Instead he decides to fix up the 42 and fight the baddies in human skin.  The reason I disliked him being out of the suit is because we know he isn't trained like Batman/Bruce Wayne, Iron Man is the suit.  On the topic of things not mattering, Mandarin attacking Iron Man's home.  We all know he has a huge ego and endangered those he loved but of course being a super hero movie, nothing significant happened.  We see that suits are blowing up but later in the film Jarvis commands like fifty more that are unharmed.  The hero of the movie is Jarvis, his AI Jeeves.  And this begs the question, if those suits were dormant underneath his house, why didn't he just call upon them while he was stranded in Tennessee?  I guess there wouldn't be a movie then, right?\rAs far as the humor goes, I definitely found myself laughing at parts which was nice but it also took away from the overall weight and depth the movie might have been going for.  Instead of trying to save a president who is dangling high above ground or his girlfriend from evil clutches, jokes are being made about being shot at, etc.  Thankfully though, all the bad guys suffer from stormtrooper syndrome.  So Iron Man, basically Jarvis though, can save the day woo hoo!  In the matter of Pepper, her purpose was to be injected and dropped into the fire so that she could live the drop and the fire haha.  Saw that one coming but seriously, I hated that.  I guess I just want a movie where a bad guy doesn't keep the hero's GF around as a trophy or doesn't give a long speech about how they're the best and just shoots them.  Anyway, I'm a bit upset I spent a whopping $25 for two tickets to a movie my girlfriend and I were just begging to be over so we could go about our merry way.  For whatever reason, I thought this would be different from Iron Man 2 but I don't know why I thought that.  If you look at it with total disregard for comic canon, reality (i know it's a super hero movie), and sense; it can be kind of fun.  Definitely a rent in the future and not worthy of the shelf!"
    },
    {
      "rating": "2",
      "text": "My heart is successfully broken. Waiting to see it at midnight at the El Capitan, I watched with anticipation as director Shane Black took the stage to introduce, joking about the silliness of the Fantastic Four films. I now see the irony. Did they spray excrement all over The Mandarin? Yes, but that pales in comparison to everything else wrong with this film. Huge plot holes, failed character motivation/development, and just downright bizarre and/or silly pointless choices are all factors. Worst yet, it also somehow manages to nullify the very theme of the previous movies. I'm not sure how the future of the Marvel Cinematic Universe would ever recover from this slaughtering of tonal continuity.\r One word comes to mind: Why??? It's as if Shane Black decided to insert Iron Man characters into an old 90's action thriller comedy script he happened to have lying around, throwing in silly, plastic dumbed-down \"bad guys\" from G.I. Joe and Ghost Rider: Spirit of Vengeance. So many of the characters are pointless or have terribly weak, if any motivation for behaving like they do. Even the magical bravado of RDJ couldn't save it, and that's saying a lot. Of course there are funny and clever bits and some slick and cool action, but  when a film has all that and loyal fans are still sitting there not caring or invested at all whatsoever, it's a problem. In any case, Black clearly doesn't get it, and apparently no one saw fit to help him out.\r I suppose it's possible you could enjoy it if you are able to look past all these flaws and can watch it absolutely out of context from the comics, the other Iron Man movies, and entire Marvel/Avengers franchise. If not...it's painful. Needless to say, I walked away with nothing to think but \"What the hell did I just watch?\" \"Was this FOX's interpretation of Iron Man?\" \"Whedon, WHERE WERE YOU??\" Unfortunately, we now know nothing is truly safe, not even in the hands of Marvel Studios themselves. It really is a shame. Feige and the Marvel gang have a lot of explaining to do."
    },
    {
      "rating": "10",
      "text": "So first of all, I want to say that I loved this movie, but I do get the hate on it, for it's controversial plottwist.\rBut there are some reasons why some fanboys shoud NOT be so angry about it;\r- first of all, the fake mandarin was set up, to not set up a racist stereotype and more of like a fun character.\r- aldrich killian revealed that he was the real mandarin, he even had some dragontattoos across his chest.\r- a big part of the fanbase was angry at Tony throwing his arc reactor away at the end, but Tony states that he is still Iron Man and he picks up one of the extremis holders, which will likely mean that he will build an extremis suit, powered by repulsor technology (which has also been confirmed as the new energysource for the suits.) and this will set up a suit that will allow Tony to go into space with it, and this will probably set up the bridge between guardians of the galaxy and avengers 2.\r so for me this was a very good movie, and I think they've done a great job with expanding the MCU even further"
    },
    {
      "rating": "5",
      "text": "This is a big disappointment, they totally ruined a beloved villain and a big slap in the face of fans. The movie has lots of issues, like why can the extremis infused bad guys damage Iron Man so easily, while Thor had issues with it... He is the god of thunder! And the action is mostly just Tony Stark messing about, some of it is good, but what we really want to see is Iron Man in action, and not remote controlled.\rEven the best action scene in the movie is not done by Tony Stark as the Iron Man, it is done by Pepper.... There are some good parts, the story is more personal and  there is a kid in it that is not annoying for ones. There is lots of humor, even the worst part of the movie is still funny and the special effects are good. I did sit through the whole movie, but it is the first Marvel movie I doubt I would want to watch again, as there is nothing really re watchable about it."
    },
    {
      "rating": "0",
      "text": "A slap to the fans of Comic books in general. The Mandarin was the joker of the Iron man world. Instead we get trevor and all he did to Iron man was offered him some beer."
    },
    {
      "rating": "0",
      "text": "I've never felt so cheated after watching that trailer.  I realise that a trailer is not an abridged version of a film, but when I seen the trailer to Iron Man 3 it set a certain expectation for the Mandarin, for Tony Stark but it totally does not deliver at all, and to be completely honest I almost walked out at the end such was the ridiculous finale.  When I got home I watched the trailer again and it;s like it was made for a different film.\r If this is our first look at Phase 2 I'm concerned.  Iron Man 3 shows franchise fatigue, it felt stretched, rushed, basically like a Brett Ratner film.  Expect something more like Rush Hour than an Iron Man film.\r Credit to Marvel for at least trying to concentrate on Tony Stark's inner demons, the problem for me was how the film presents that.  Instead of intertwining the action and human (Stark inner demon) elements into a finely crafted whole film it is more like each element is fighting for screen time, at odds with each other.  There is another problem with the parts where Tony is trying to get over his experience in New York (Avengers), Robert Downey Jr has so many wise cracks and laughs the serious bits come off as funny, and not in a good way.  I think these problems are less about RDJ's acting and more with how Marvel has marketed Iron Man from the first film; as family friendly entertainment, not the darker exploration of an alcoholic come hero from the comics (but hey they can always reboot right?).\r Now on to what they did with the Mandarin, I have no idea how they got Marvel to sign off on making one of Iron Man's greatest villains into a joke.  I read that the Mandrin is to Iron Man what the Joker is to Batman, but after watching this you would never know that.  I've never witnessed such a disregard for a property and disrespect than what Marvel has done to this character and fans  about what Fox does to X-Men? This is on another level of insult lol\r A sorry excuse for a super hero movie, more an action comedy (Lethal Weapon, Rush Hour etc)."
    },
    {
      "rating": "1",
      "text": "So Shane Black you hate comic-fans so much? Well... we hate you in return. Thanks for ruining our beloved hero with such an ease. I hope Marvel will never turn an eye on you. God damn it, Black. We are disappointed."
    },
    {
      "rating": "9",
      "text": "This is what i love about america... so many people hate our country but love our movies, music, and video games. Well this movie is gold, i loved it from start to finish. it is true that the mandarin isn't like the comic book one but in the dark knight rises bane isnt either so yeah shut up! please see this amazing movie this weekend so it proves that iron man is the hero and king of the american box office"
    },
    {
      "rating": "1",
      "text": "Complete garbage of a movie.  This is a movie in which hollywood completely is milking the franchise and is just literally a set up movie for the avengers.  No real thought into the main villain while destroying the mandarin  which pretty much ruined this movie for me.  I get the spin on mandarin but he is essential to the Ironman series, making a mockery out of him was a big no-no for an Ironman fan.  The only reason why I didn't give it a zero is because of the suits and rdj.  ALL IN ALL I'D RATHER WATCH PAINT DRY ON A WALL FOR 2 HOURS"
    },
    {
      "rating": "2",
      "text": "Unfocused in its purpose, plot, and characters, Iron Man 3 is ultimately a disappointment. Perhaps its only highlight was the action and explosions, typical of most action blockbusters. It does get credit for framing the tale in a manner that explores Tony Stark's issues in balancing his superhero persona and normality. Otherwise, the jokes are stale and the characters one-dimensional. Neither the villain (The Mandarin) nor Tony Stark seem to have a legitimate motivation or back-story to make the conflict legitimate. In the end, it becomes apparent the movie was made only to make money."
    },
    {
      "rating": "0",
      "text": "Ten Reasons Iron Man 3 was an absolute disappointment. Ranked in no particular order.\r 1) No AC/DC\r 2) Replaced Tony's Alcholism with Anxiety Disorder\r 3) Mandarin was fake and was completely misleading in the trailer\r 4) Apparently the suits no require a \"charge\" rather than pulling energy from the ark\r 5) Tony destroys all his suit because his grilfriend says so...\r 6) Kills Iron Man, Tony removes the ark and scrapnel from his chest, that apparently could not be done in IM 1 or 2, even though the entire second movie was about the ark poisoning him...\r 7) Extremis Goons could apparently more easily destroy Iron Man armor than the god of Thunder\r 8) Should have been called \"Tony Stark 1  I can't do anything I use to do and barely where my suit.\"\r 9) 70's Spy Movie Montage for Credits\r 10) Bruce Banner unknowingly making commentary on the terrible movie by falling asleep to Tony'y retelling of it.\r This movie is a terrible conclusion to one of the best franchises. Just don't see it."
    },
    {
      "rating": "6",
      "text": "Iron Man 3 is the beginning of the new summer blockbuster movie with Marvel fans are participating for the new sequel. The first Iron Man was the original classic superhero movie, the second one did alright, but even though the moviegoers didn't appreciate the sequel, and of course third one was okay. The story takes place where Iron Man/Tony Stark fights over Mandarin to assassinate the president with his reinforce baddies. Robert Downey Jr. returns as Tony Stark known as Iron Man is planning to make a new magnetize costume to suit it up, but overall he needs to spend time with his girlfriend (Gwyneth Paltrow) in the holidays. The two main villains are Mandarin (Ben Kingsley) and Aldrich Killian (Guy Pearce) are making an evil plan to kill Iron Man and to kill the president, but not Mandarin its Killian. The action scenes are spectacular and the effects are well done, but the only two good parts in this movie was Iron Man saves the passengers from the sky and Iron Man faces Killian at the docks with full of Iron suits. I would say that Shane Black did very well with the action scenes and the effects are good, but overall the movie wasn't that spectacular like most other Iron Man movies or even classic The Avengers. My main problem is that characters are a little bit too much, the lines are off charted, and sometimes it’s okay to check out the action scenes. It just difference between Stark with his girlfriend, Stark get complain with the little boy, Stark didn't realize that his old girlfriend works with Killian, or even the villain like Mandarin was a goof ball pretending a bad guy and just a fraud actor, but it needs to rewrite the lines and the story needs to take it seriously. Iron Man 3 was okay, but not is much. Thumb Down."
    },
    {
      "rating": "6",
      "text": "I was pretty disappointed in the movie.\r The whole Tony Stark inner turmoil thing really didn't ring true for me.  I get the whole dwelling on \"aliens really exist\" thing, but it didn't really work IMHO.  As well the use of the Mandarin really was disappointing.  He could have been a really good evil character.  Ben Kingsley could have absolutely nailed it if left to make the character his own.\r As it was it was an OK movie.  Watch it if you like the superhero genre, if not its not that interesting."
    },
    {
      "rating": "6",
      "text": "Mediocre at best, especially when seen as a follow-up to Avengers. Other than constantly mentioning the events in NY, this movie consistently ignores the existence of everything else in the MCU. Where is SHIELD when AIM is posing a massive terrorist threat to the world with Extremis and other programs? Why didnt Stark call SHIELD or anyone else, like Cap, for help during the movie?\r And it drags on and on in the middle as Tony spends faaar too much time outside the suit. I didnt mind the plot twist with the villain though the ending was completely moronic. There was no reason to destroy all of his suits when he's just gonna rebuild them for Avengers 2."
    },
    {
      "rating": "5",
      "text": "Iron Man 3 has amazing effects and fine performances, but the story is what drags it down. It starts off well, testing Tony in ways the audience hasn't seen anymore, but quick fixes to the plot make these elements cliched and underdeveloped. The twist with the villain also ruined the movie, especially because Guy Pearce was not a good replacement for the Manderin. All in all, Iron Man fails to deliver anything worth watching, which is unfortunate after the success of phase 1 of Avengers filmed. Highly disappointed."
    },
    {
      "rating": "6",
      "text": "I'll put it as bluntly and as simply as I can; It's not what you expect.  The jokes come off strained and poorly written, and the story leaves a lot to be desired.  Still, the visuals are amazing, and so is the music (although the lack of AC/DC was somewhat disappointing)."
    },
    {
      "rating": "6",
      "text": "Disappointing. After viewing this movie twice, just to be sure about my feelings about one of the best Marvel super Heroes that have been brought to the cinema screen, I can surely say that the third episode of Iron Man 3 is really a huge disappointment. The story has been presented in a \"jumpy\" and poorly believable way. Tony stark opts for revenge only after the Mandarin has hurt a friend of his, while other previous victims of that terrorist are simply unimportant. Many scenes are missing a direct link with each other: in a scene Stark is driving a car in a cold mountain road, while in the next scene he's in Miami trying to infiltrate in a hardly believable (home made weapons made with Christmas decorations and gadgetry! Holy crap!) way the place where the Mandarin is hiding, thousands of miles away from the place of the previous scene. And the huge surprise of the mandarin himself being an old actor addicted to drugs playing only a role just to cover the real identity of who is pulling his strings... yes it is a surprise, but not a good one. Even if I'm not personally so linked to the Iron Man comic's true story. To be clear: the Mandarin is simply a joke!  A sad joke. I have to add an interesting consideration: the original Iron Man 3 without cuts should have been a solid 3h 15m movie! Here is the site telling the surprising fact:\rhttp://ca.movies.yahoo.com/blogs/wide-screen/iron-man-3-originally-3-hours-15-minutes-184317207.html\rMaybe, with those scenes the movie would have been better, not so discontinuous and jumpy!\rThe real villain of the movie, acted by Guy Pearce, is not very convincing: he looks more like a malfunctioning version of the Human Torch in Fantastic 4. And the female character played by Rebecca Hall changes her mind too easily just after a brief talk with Tony Stark.\rFinally, the various Iron Man suits look very weak and vulnerable to the enemies superpowers. In the previous movies the suits looked more resistant to the enemies strikes.\rTo complete my personal review, I must say that the movie is not that bad, but is really not what it should have been."
    },
    {
      "rating": "6",
      "text": "While some of the action scenes were quite spectacular, and up there with some of the biggest action films of recent years, the film overall felt very shallow and wayward and lacked any kind of real soul behind the fancy shots.  Robert Downey Jr played a more vunerable Iron Man this time, which was a nice change, and Ben Kingsley pulled up a fantastic character double in The Mandarin.  Guy Pearce as well, was fairly entertaining, but begun to tread heavily in the cliched towards the end.  The plot holes run thick throughout, and I never really felt any concern for any character throughout the film this time.  A really disappointing outcome, for what was otherwise a decent comic book series."
    },
    {
      "rating": "6",
      "text": "The problem with Iron Man 3 is that it missed countless opportunities to great, and is no where near as engaging as some of the recent superhero flicks, but its still an entertaining summer blockbuster with some excellent set pieces. But be prepared, you will be disappointed."
    },
    {
      "rating": "4",
      "text": "I saw Iron Man 3 last night, and first of all; it’s really disappointing to see a film series that started out so strongly reach to the unenviable level of mild entertainment, if even so. \"A piping hot mess\", as Tony Stark would put it. The tonal shifts, absurd plotting and the sheer level of disrespect for the source material (for all the geeks who care) made this summer blockbuster a piping hot mess, indeed. Our new director on board is Shane Black and I must admit he did pretty good job in the way of characterizations in the first half of this flick. Tony's post traumatic stress disorder, from the events of 'The Avengers', was developing well. But, as the second half rolled in, things drastically change from being a character-centric event to a bloated non-stop action fest, which, mind you, wasn't even creatively staged. There seems to be a belief that more plot equals better story, but that bombardment of ineffective plot twists only regressed the story at hand. Being so focused on surprising the audience, I don’t think the writers were ever fully capable of telling a solid story and polishing the muddy motives of our paper thin villain. And I can’t leave here without mentioning those perennial bursts of “humor” which only functioned to pull the audience out of key dramatic moments. Overall the movie relied so heavily on build up but ultimately undid itself in several ways. This really showed how hollow this shiny hunk of metal really was."
    },
    {
      "rating": "6",
      "text": "Another movie that wants to be The Dark Knight. Only it abandons that after awhile, and starts trying to be its own thing, which I can respect. These kinds of movies can use some more twists and surprises, which Shane Black delivers. Unfortunately, while it's funny in several places  it's just not enough fun.\rI wouldn't call myself a Black Sabbath or an AC/DC fan, but there was something pretty great about Robert Downey flying around to it previously  that doesn't happen in the third film.\r No, the third film wants to be serious. Except it doesn't. You can't have it all."
    },
    {
      "rating": "2",
      "text": "The film was pretty much predictable. You would really know what will happen in the coming seconds or the next scene. I hate predictable movies. And pretty disappointed by the Mandarin to be a total bum. Could've been a badass villain.\r Film contains too much action, no real emotions or anything."
    },
    {
      "rating": "0",
      "text": "Iron Man 3 was colossal: a colossal disappointment.  I was squirming in my seat from the idiotic script and terrible direction.  This fil practically ruins the francise and degrades the product.  Jon Favreau did a wonderful job directing Iron Man 1 and 2, if it ain't broke, don't fix it!  Do us a favor: keep Shane Black far away from these properties!  He alters Tony Stark's personality with this pointless anxiety quirck.  The FX was stupid and seemed to be thrown in to patch the poorly written and conceived script.  The Mandarin character could have neen developed into something great in the hands of a capable writer and director: instead it is willfully forgettable.  Awful, awful awful from every perspective that made Iron Man 1 and 2 so great.  I am sorry for the great talent in this film which was mismanaged.  I wish I could have previewed it and not bought the blu ray, which I thankfully got at a big release discount, but I think anything over $2.99 for. The blu ray is a rip off."
    },
    {
      "rating": "0",
      "text": "As a movie watcher, I enjoyed Iron Man 3. It is action packed, it's pretty, RDJ as Iron Man/Tony Stark is as always one of the best casting decisions for any comic book adaptation ever.\r But as a fan of the comic books, I feel disgusted and betrayed. The Mandarin, and Extremis- two of the best things to ever happen in the Iron Man universe- aren't even shadows of what they were in the comics. They're completely unrelated to their comic book source material, in fact. Ugh. I held off watching the movie, avoided seeing it in theaters, because I knew the Mandarin couldn't be handled properly in our politically correct world, and I disliked Ben Kingsley as the Mandarin. Even though the trailer seemed to imply he'd be imposing and bring to the role his usual mastery.\r The trailer was an outright lie. This movie took THE Iron Man villain, and made him a fraud. It showed the ten rings, for all of a second, and they turned out to be props. So  awful. So disgusted, I want not just my money back, I want my time back. The Mandarin was one of Iron Man's most formidable enemies, and this movie made him a fake, played by \"a stage actor\" who's got a British accent and a recreational drug problem. REALLY?!?!\r And Extremis. Let's talk about Extremis, one of my all time favorite story arcs  and I have literally read almost all of them. This movie was written by someone who'd heard the word and thought it was a good idea. Aside from the fact that Extremis is unstable and can aid regeneration, nothing from the original masterpiece storyline remains. So if you watched Iron Man 3 looking forward to seeing the Mandarin's ten rings and the suit of armor Tony built into himself, you're out of luck.\r Despite the fact that those two things are what the words \"Mandarin\" and \"Extremis\" promise.\r This is by far the worst mainstream comic book adaptation. I wanted to love it. I really did. If they had called the Mandarin literally ANYTHING else, it would not have altered the storyline one iota, and yet they had to use \"Mandarin\"? WHY?! Same goes for Extremis, for that matter. If the serum had been called  it would not have altered the storyline one iota.\r It's like Shane Black and the other mongoloids who are responsible for this storyline WANTED to piss off fans. It's like they specifically made these choices in the writing of this film to piss on the greatest Iron Man villain and one of the greatest Iron Man storylines of 50 YEARS of the character's history.\r While writing this review I have gotten even more angry than I was already, and the score dropped from a 5 to a 0, because the more I think about it, the more I realize that there is no reason for this shameless butchering of canon. Pathetic attempt to sell a comic book movie by someone who has no love and no concern for the comic book. Bottom line if you're looking to enjoy an action movie with Iron man, watch Iron Man or Iron Man 2 or the Avengers. Don't give Shane Black a dime of your money, and don't waste your time. I could pick apart why this movie doesn't deserve a solid rating, but the real reason boils down to the fact that the movie's creators pissed on their fans so thoroughly and shamelessly."
    },
    {
      "rating": "3",
      "text": "Unfortunately I am in the group of people who really wasn't a fan of this film, I went into it with the buzz of the avengers still going months down the line and it was all going quite well at the start, that was until about half way through the movie. I wont spoil anything, but it was disappointing for me, and I'm not even a fan of the comics. It feels to me like the film was written be to many different people with conflicting ideas, and was a product of that. I still have high hopes for the Marvel Cinematic Universe, but this and Agents of S.H.I.E.L.D. looks like the beginning of the end for me as a fan of this series."
    },
    {
      "rating": "5",
      "text": "it is the biggest disappointment of a movie superheroes marvel,I can even have a little fun but still they do not take the film too seriously,too bad  for marvel"
    },
    {
      "rating": "0",
      "text": "That movie so bad, not only the choice of Mandarin, but the whole movie is a mess, is ridiculous and stupid moments with silly humor unfunny. This between 5 Worst Movies of 2013."
    },
    {
      "rating": "0",
      "text": "Lousy god, humorously goofy child. Slowly destroying the movie goes and turns in the show Tony Stark. Well this movie is extremely bad, rubbish and certainly the worst of the 3."
    },
    {
      "rating": "0",
      "text": "La película para mi es una completa mierda, para retrasados mentales, una basura. La verdad no se como hay gente que le gusta, todo porque tiene esa ilusión de no romper un sueño, como la película fue tan esperada,porque sacarle mierdas, porque sacarle defectos, es asombroso lo mala que es esta película."
    },
    {
      "rating": "4",
      "text": "The villain of the story the Mandarin was disappointing and as far as superhero movies go this is in my top 5 biggest let downs. He was trying to fix his Iron Man suit more than he was in it. I give this a miserable 4 out of 10"
    },
    {
      "rating": "5",
      "text": "Consistent inconsistency.Iron Man 3 starts out alright with a fun scene of Tony Stark trying his new version of the suit. It's entertaining and laid back, but then this film decides to go for a darker tone and it does not work. At all. The main villain is boring and terribly acted and for some reason this other bad guy also gets a surprising amount of screen time, and he was even more atrocious. Those characters had absolutely nothing. I did not care. There's the Mandarin guy who I liked, but he's barely in the film.This film is a weird mix of action that's sometimes fun and sometimes absolutely ridiculous and headache inducing, scenes of the Mandarin threatening people on TV or Tony Stark doing something actually kind of fun with this one kid character and later Iron Maning. But it's all very inconsistent. I never felt that invested in anything because the quality of the scenes was so unstable. Some scenes were fun and looked good, and some scenes especially in the end looked absolutely awful.The characters are also inconsistent. Tony Stark is cool, Jarvis is funny and War Machine was alright. But then there's Pepper who's just a bait for the whole movie and the kid character Harley who ends up being somewhat pointless even though he and Tony Stark together was fun to watch. And the villain, like mentioned earlier, was some serious drivel.This thing is so inconsistent. There's fun stuff every now and then but it's always followed by something stupid."
    },
    {
      "rating": "6",
      "text": "The hype to see the Mandarin on the big screen was totally over because of the twist Ben Kingsley (The Mandarin), was just a drunk, British stage actor that worked for the real Mandarin, a guy who gets very hot and can melt things with his hands. It was very underwelming, the villain was not as powerfull as intended. The Chemistry between RDJ and the little kid is very good, I liked it. When Pepper, with the hot-making stuff in her, fell in that fire, I didn't feel anything, because it's just a side character and not so well-established. The trailer was beter than the film itself."
    },
    {
      "rating": "6",
      "text": "Iron Man 3 takes the character of Tony Stark in a new, more personal direction, but it continues the Marvel tradition of having a weak villain, and even weaker finale."
    },
    {
      "rating": "2",
      "text": "Terrible film, i was expecting something so much better. There is so much wrong with this film that i'd be here for ages if i were to write it all down.."
    },
    {
      "rating": "6",
      "text": "Iron Man 3 was a decent movie but lacking in a lot of places. The villains were odd with unusual humour, wasn't very keen on the lacklustre mandarin plot."
    },
    {
      "rating": "6",
      "text": "Not as good as The Avengers.  The villain is weird, it's hard to put in words but he feels out of place.  The high points in IM3 are pretty high, but the lows are pretty low and    \"weird\".  Why is Tony Stark running around with a gun at the end of the movie?  How did Pepper Pots just get \"cured\"?  What's with his anxiety attacks exactly?  It's his third movie fighting bad guys and other assorted crazies, but his encounter with aliens in the Avengers messed him up?  Just feels contrived and weird.  I like Guy Pierce, but this villain doesn't work, and they should stop doing \"greedy\" bad guys in IM films.  Not a bad movie, but could have been a heck of a lot better, especially after The Avengers showed everybody how it should be done.   There's no excuse any more after Whedon's awesome hero flick.  If you've got nothing to do, this movie's okay to fill in some time, otherwise I can't even recommend it as a rental when there are so many other good movies out there."
    },
    {
      "rating": "6",
      "text": "While clearly having its usual charismatic flair, Iron Man 3 doesn't succeed in all its attempt for Stark's solo career after The Avengers. It is however, entertaining enough to warrant audience's time with slightly darker tone and witty humor. Robert Downey, Jr has melt into the character so well, it's nigh impossible to imagine someone else portray Tony Stark. There are few memorable scenes aside from your usual humdrum explosions and they manage to differentiate the movie from its predecessor, but this also goes with awkward plot holes.\r Recurring characters, such as Don Cheadle as Rhodes and Gwyneth Paltrow as Pepper are so comfortable with their roles, it creates natural on-screen relationships with Tony Stark. This time Pepper has a lot more screen presence as she breaks out from her babysitter cocoon, and quiet frankly has her most substantial role in the franchise thus far. Ben Kingsley as Mandarin is somewhat over-the-top, borderline corny. I suppose they want it to be a surprise, but It could be perceive as shallow and demeaning to an already established character.\r Guy Pearce as Aldrich Killian is vague, he provides better challenge than previous nemeses, but his motivation is superficial. It's utterly hard to imagine that a supervillain would arise from such trivial excuse. Script has its moments, mostly in accidental parental relationship between Stark and Harley, a kid who becomes temporary side-kick for Stark. I understand the need to humanize Stark, in short; taking the suit for some parts of the movie or make him deal with psychological repercussion of his actions, and mostly, it delivers.\r Graphically, it suffices in rather predictable ways. The addition of 3D doesn't add much though, I have a harrowing feeling that there's cumbersome muddy visual all over the otherwise crisp effects. On top of that, there's not enough depth perception to fully utilize the 3D, I strongly urge to see the normal version instead. Action involves plenty of missiles, bullets and cannons being fired, as expected. There's admittedly clever gimmick for the suits usage, so it does break from simple combat.\r Between the fast paced screen transition, there are some plot holes which may be convenient for the movie in the expense of giving any plausible explanation. Given the fresh changes, Iron Man 3 is a flawed movie, but one which isn't sorely lacking in entertainment value."
    },
    {
      "rating": "6",
      "text": "It's hard not to like Robert Downey Jr and he was entertaining, but Iron Man 3 was quite predictable. His attempt at having panic attacks was very prosaic. Didn't really  like Gwyneth Paltrow. she's too stiff. Don Cheadle as Tony's comedic foil was great as was Ty Simpkins. The action was good, but nothing special. Cheadle and Downey make the movie worth seeing. Also, don't waste the $3 for 3D."
    },
    {
      "rating": "3",
      "text": "Ironman 2 was an entertaining movie that failed to live up to its predecessor. Ironman 3 is a slap to the face. Most of the movie chronicles the adventures of Tony Stark, who has set aside his intellect and technological mastery in favor of idiocy and laughable ineptness.  What was once an invincible piece of machinery becomes a joke, continuously malfunctioning, and being destroyed by anything that touches it. But that's just the parts where Stark is actually IN a suit. For most of the movie, typically for no good reason, Tony Stark is running around with a handgun. This is like watching a spiderman movie where he only shoots web in one scene. Or a Superman movie where he doesn't fly. The \"amazing plot twist\" was easy to see coming, and left us with a villain who is entirely bland. Pepper Potts steals the show by beinf better at using Ironman's armor than Ironman himself. The president is caged up in War Machine's armor for reasons never revealed. And Tonys decides the best way to fight a man made of magma is a fistfight. Its not until pepper gets the suit that she decides to fire a missle and easily defeat the big bad guy. Are you kidding me?"
    },
    {
      "rating": "6",
      "text": "La cosa migliore  la sequenza dei titoli, posta in conclusione, costruita con immagini provenienti da tutti e tre gli episodi della serie e montate a ritmo adrenalinico secondo uno stile da telefilm anni Settanta, il tutto accompagnato dalla roboante colonna sonora di Brian Tyler. Con un nuovo regista e sceneggiatore mentre il vecchio, Jon Favreau, si  tenuto il piccolo ruolo di Happy Hogan, il terzo capitolo dedicato a Iron Man (ma io sono all’esordio, per me ‘Iron man’  la canzone dei Black Sabbath)  stato pensato e costruito come un blockbuster e il suo mestiere lo fa bene, seppur non andando troppo per il sottile: due ore filate in cui  l’azione a fare la parte del leone, con solo qualche momento qua e là per riuscire a tirare il fiato. Si confermano le tendenze dei film di supereroi degli ultimi tempi: il protagonista tende ormai alla mezza età e comincia a essere stanco (anche perché soffre di attacchi di panico lascito della lotta contro gli alieni di ‘The avengers’) ma finisce per trovarsi a lottare basandosi più che altro sulle proprie forze e la propria intelligenza perché gli aggeggi di cui si circonda fanno cilecca più del dovuto. Se  vero che Tony Stark  meno problematico di alcuni suoi colleghi, ha più di loro il dono dell’ironia, grazie anche alla capacità di sdrammatizzare di Downey jr. che riesce a funzionare pure quando  ripreso in primo piano all’interno di una delle sue armature (specie quando  intrappolato nella non proprio perfetta Mk42). Attorno a lui, tutto il cast dà l’impressione di divertirsi parecchio: Paltrow ha ammesso in un’intervista che lavorare in una pellicola del genere rilassa, mentre Ben Kingsley sfrutta alla perfezione la parte del Mandarino, in cui può gigioneggiare in libertà, tifare per il Liverpool e ammiccare, nella sua ultima scena, a ‘Viale del tramonto’. La sceneggiatura non si fa certo mancare le citazioni, anche se qualcuna si perde nel doppiaggio, ma ha il pregio di tenere un buon ritmo sapendo distribuire tocchi di commedia: l’importante  non domandarsi come possano succedere così tante cose in così poco tempo (a parte un prologo, tutta la storia si svolge a Natale) per non parlare di una successione dei fatti che non si preoccupa sempre di avere una logica e di uno sviluppo che non concretizza tutte le premesse. Niente da dire, invece, sugli effetti speciali, che per una volta non sono curati dalla Industrial Light & Magic: notevoli anche se tirate un po’ per le lunghe (il prezzo da pagare alle copie in 3D?) sono sia la distruzione della villa di Stark, sia il gran finale nel porto, in cui, seppure a fatica, infine defunge il cattivone di turno  Guy Pearce comincia ad essere abbonato ai ruoli di villain. Nelle sequenze conclusive c’è un tirare le fila di tutti i personaggi, con quello principale che pare decidersi a ripensare la propria esistenza con annesso rapporto di coppia: non essendo Bruce Wayne, però, finirà per ritornare, come difatti  scritto dopo gli interminabili titoli di coda. Il rullo sembra davvero infinito, ma vale la pena aspettare che scorra non solo per leggere la promessa di una nuova puntata, ma anche per vedere la breve scena che conclude il tutto con un ultimo sorriso"
    },
    {
      "rating": "5",
      "text": "Very boring movie and with almost no good fighting scenes or action at all. Beats the second movie at least but that is all there is to say about this."
    },
    {
      "rating": "2",
      "text": "This ranks up there with one of the worst comic book adaptations I have ever seen.  Id rather watch some of marvel's early failures like Daredevil and even the fantastic four series than this garbage.  Pretty much it all hinges on wether you think it was funny that an Iron Man staple villian is used as a big punchline on punking the audience.  This comes in Marvels ineptude of creating good villians, something that I feel most DC movies have a one up on them.   I felt like walking out of this one as I waiting for some great scenes with a great actor playing an interesting villian, instead you are treated to is a monty python type comedy sketch that goes on way to long.  The rest of the movie didnt really matter to me cause I start to not take any of it seriously."
    },
    {
      "rating": "3",
      "text": "Boring action, terrible screenplay. Another Disney/Marvel movie aimed at milking the audience money.\rThis is not a movie by a long shot but some product made just to be watchable enough so people pay money.\r Happy that I did not see that at theatres and I downloaded it by torrent. This movie absolutely did not deserve any money. I give it a 3/10 and not 1/10 because \"some\" Tony Starks lines were funny, because \"Blue\" of Eiffel 65 at start."
    },
    {
      "rating": "5",
      "text": "My review could be biased since Iron Man has never been an appealing super hero to me. None of the movies have impressed me and this last one which closes the trilogy did not either. Strong points are the action sequences and visual effects and some comical scenes Iron man movies have offered in the whole trilogy. but apart from that there´s not more to it. The 3 of them are very simple movies when it comes to the script, there´s no heart in the characters, the love interest is totally bland, no strong villains and I could go on. I did not mind the Mandarin surprise, that is not the reason why this movie is average. And no amount of hype, budged and big box office success can change that. So many comic book movies superior to this out there."
    },
    {
      "rating": "4",
      "text": "so yeah, this one was terrible, it seems as if they shot each scene alone and forgot that all the scene are going to come together at the end and should make sense\rand the movie start off very lame as  RWJ as the narrator who have no idea what to say relying on his ego\rand then he made a joke 5 seconds after his girlfriend just fall off 2000 feet and should be dead ?\rand you have a terrible performance from Guy Pearce who apparently can't Starr in a good movie recently,\rand the director trying so hard to bring himself on the screen in pointless scenes who add nothing to major all clusterfu**\rjust stop this series already."
    },
    {
      "rating": "6",
      "text": "I was sadly disappointed by Iron Man 3. Maybe because I was expecting too much out of it. I didn't get as much Tony sass I as hoped for. I just felt like it was missing something along the way. I did still enjoy Iron Man 3. I liked how it tied back to The Avengers. I could have been much better, but it still could have been worse."
    },
    {
      "rating": "5",
      "text": "There is a problem that exists with casting big hollywood stars to play masked superheroes, and the more of the hero's face is covered with mask, the more pronounced that problem becomes. Big hollywood stars want their face on the screen. Close-ups preferably. Compare two \"Judge Dredd\" movies. The one from 1995 with Stallone and the recent one with Karl Urban. The comic book Judge Dredd never removes his helmet, but it was not good for Stallone, cause he is such a big star or whatever. So in 1995 movie most of the movie Dredd is seen not just without his helmet but without his uniform at all. Karl Urban. on the other hand is not such a big star (yet?) so he stayed true to the source and spent the whole movie in the helmet.\rNow lets look and those Iron Man Movies.When in the first movie we saw way more of Tony Stark than we did of Iron Man. It was kinda okay. After all we were watching the origin story so it was to be expected. The second movie was showing too much of Tony Stark and those \"inside the helmet, holograms on the face\" close-ups.. but we got to see War Machine and Downey Jr. is really a good actor so it was kinda okay.\rBut Iron Man 3.. oh man. they should've named it \"Tony Stark 1\" instead of \"Iron Man 3\". It is not about the \"MAN inside the armor\". Its \"man inside THE ARMOR\" what made Iron Man what it is today! We do not care about Tony Stark that much, come on! Even in the final confrontation most of the fight Stark is outside of the Iron Man armor. They even made those \"inside the helmet\" close ups when Stark is actually OUTSIDE the helmet... come on! What the hell is this about? This movie makes me wish for Downey Jr. contract NOT to be renewed and for the studio to cast someone less famous (that does not mean less talented, just dive into TV actors pool and you can find some gems there) who has no problems with gvivng more screen time to CGI Iron Man Armor and just providing the voice."
    },
    {
      "rating": "5",
      "text": "Lots of explosions and other special effects! Also, some very funny \"LOL\" moments. This is a great movie for the eyes and the ears but plot holes, contradictions and absurdities negatively influenced my experience greatly.\r Most the plot holes are spoilers so I will not elaborate. I will say the first two film were much more intelligent than this film. I completely agree with Orndorf's points about the film's disjointedness but I was surprised he skipped its many plot holes and contradictions.\r Prior rules set by the first 2 movies (involving his chest wound, its relation to the armor and also how the armor functioned) were ignored and contradicted. Also, and perhaps only serious for comic book enthusiasts, the Mandorin's comic book mythos was almost completely ignored (He basically just looked like the Mandarin.)\r Next, with a crazy movie premise (man in iron suit,) I was surprised no attempts were made to ground the movie's remainder in reality. IM3's intelligence was influenced by in-your-face and conveniently placed plot devices and ridiculous stunts performed by characters (not the magical ones) without care or injury. Also, character behaviors and actions, though funny and entertaining, were stupid and ridiculous. No forethought was placed on certain characters who were, magically, able to heat 3k degrees but stay clothed. This reminded me of Hulk and his ability to keep clothed. Finally, national security protocols, and awkward use of firearms were also hard to swallow... Ahhh! Some of the above examples were (admittedly) petty but still distracting.\r The above greatly influenced my enjoyment, unlike the previous entries. Don't get me wrong, the first 2 movies required a suspension of disbelief as well, but with top-notch script, dialogue and direction I was able to suspend and enjoy.\r Oh well. I will still buy the Blu to finish my collection."
    },
    {
      "rating": "6",
      "text": "It is really fun and very enjoyable. The visual effect are very Well done but is a normal movie. The movie is not an spectacular  movie but is really run to all family"
    }
  ]
}