{"id": 3821, "title": "Iron Sky: The Coming Race", "starring": ["Lara Rossi", "Vladimir Burlakov"], "runtime": 93, "genre": ["Action", "Comedy", "Fantasy", "Science Fiction", "Adventure"], "description": "Twenty Nine years after the events of Iron Sky, the former Nazi Moonbase has become the last refuge of mankind. Earth was devastated by a nuclear war, but buried deep under the wasteland lies a power that could save the last of humanity - or destroy it once and for all. An old enemy leads our heroes on an adventure into the Hollow Earth. To save humanity, they must fight the Vril, an ancient shapeshifting reptilian race and their army of dinosaurs.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/l5t2Nf1F7iQUKTrODg93xmQzZLj.jpg", "categories": {"plot": 5.0, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "7", "text": "It wasn't that bad. It's a fun and silly movie, though not as good as the first one it's still pretty much enjoyable. They're now taking shot at reptilian shapeshifter conspiracy theories on which they missed a lot of good joke opportunities here and there. They could've also taking shot at flat earthers as that is hotter than hollow earth theories. Not bad but definitely not good either."}, {"rating": "3", "text": "This film is so bad it makes the first film (6/10) look like a 11/10 masterpiece. Never a good idea to employ low brow antifa activist writers who are on a trigger fest through life. The writers took pot shots at religion, conservatives, republicans, big tech and even Trump. While the commie got the girl.This film is about as sophisticated as a hammer and sickle to the face. They couldn't just make it about Nazi' Lizard people from outer space. Something everyone could of come together on and just had fun with. So yeah Liberals, Republicans, Conservatives and Abrahamic Religious types brace yourselves for all the cringe writing targeted at you. This is a divisive film with a really big F you all message."}, {"rating": "0", "text": "as soon as they took a stab at drumph i was out. super woke trash. dont waste your time on this one. could have been cool and original but they sold out for cheap laughs."}], "recommendations": ["geostorm", "district_9", "machete", "snakes_on_a_plane", "piranha_3dd", "iron_sky", "doomsday", "shadow_in_the_cloud", "the_host", "the_meg", "the_predator", "skyline", "vampires_suck", "national_treasure_book_of_secrets", "the_forever_purge", "baywatch", "legion", "scouts_guide_to_the_zombie_apocalypse", "indiana_jones_and_the_kingdom_of_the_crystal_skull", "the_green_inferno", "battleship", "lockout", "idiocracy", "crank_high_voltage", "sausage_party"]}