{
  "id": 2639,
  "title": "Isle of Dogs",
  "starring": [
    "Bryan Cranston",
    "Koyu Rankin"
  ],
  "runtime": 101,
  "genre": [
    "Adventure",
    "Comedy",
    "Animation"
  ],
  "description": "In the future, an outbreak of canine flu leads the mayor of a Japanese city to banish all dogs to an island that's a garbage dump. The outcasts must soon embark on an epic journey when a 12-year-old boy arrives on the island to find his beloved pet.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/c0nUX6Q1ZB0P2t1Jo6EeFSVnOGQ.jpg",
  "categories": {
    "plot": 7.550561797752809,
    "acting": 7.914893617021277,
    "ending": 7.166666666666667,
    "soundtrack": 8.5,
    "cinematography": 6.0,
    "familyFriendly": 6.0,
    "funny": 7.785714285714286,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "like always the director doesn't disappoint you, for the people who have watched his previous movies, the style remains the same and the music is similar. Story plot style is just unique considering it as a stop motion picture. may be this style suits the director best. Funny and punchy and thrilling and lovely, a roller coaster of emotions and drama. Loved it."
    },
    {
      "rating": "10",
      "text": "If you've seen Fantastic Mr. Fox, you know Wes has a passion for animation. In this film, full of terrific voices, he improves beautifully and what you get is everything from a stop-motion clay animation that Aardman hasn't been able to give you."
    },
    {
      "rating": "7",
      "text": "Wes Anderson near his best, this film has great animation and Anderson's typical quirky genius."
    },
    {
      "rating": "8",
      "text": "\"Isle of Dogs\" was a wonderful movie, with some very good performances and an exceptional narration and dialogue, the story is very emotional and extremely entertaining, and gives a special value to Japanese culture. The animation of the film was very good and the voices of the characters, very convincing, in fact, have chosen the cast very well. In addition to the dialogue of Japanese humans, may not be understood at all but thanks to their translations, easily explains everything that happens. In this film, the dialogues adhere to the reality of our relationship with dogs, but we can understand it thanks to a meticulous analysis and a fluid connection between the characters in the film. The film itself sometimes feels like a documentary, but it does not affect its premise at all, and the interventions of the character of Greta Gerwig were unnecessary, but they have a greater contribution in history, besides leaving a great message about how we relate with the dogs and how we treat them. Maybe it's not a perfect movie, but it's certainly one of my favorites."
    },
    {
      "rating": "8",
      "text": "There is no need to say that this movie is visually stunning, beautifully stop-motion animated, or that it has imaginative, creative, and above all that a heart-warming story, nor it's necessary to praise it for its witty visual humor using the setting, the symmetric cinematography, etc. Simply, because it's a Wes Anderson movie!What should be mentioned are the pros of this very movie. And, of course, Isle of Dogs, as any Wes Anderson movie, has what distinguishes it from any other Wes Anderson movie. In fact, there are three new pluses here. First, and foremost, the visually storytelling. Yes, I know it's not a new thing to say about a Wes Anderson movie, but there is no Wes Anderson movie, nor any stop-motion animated movie that has used its visuals to tell its story in this way. Specially, when you know that this movie has many scenes where there is no dialogue in English, just in Japanese, or where there are just Japanese subtitles!The second great thing about Isle of Dogs is the voice cast. Sorry Fantastic Mr. Fox, I love you more, but here the cast really adds up to the movie. The cast isn't star-studded just because it's a Wes Anderson movie, but every single actor, or actress, really made every character feels distinctive. Bryan Cranston voices Chief, who is, by the way, could be considered to be the real protagonist, and Bryan is GREAT! Easily the best. But really all the cast shines in this movie. Edward Norton is my second favorite.At last but not least, comes the music score from the Oscar winner, Alexandre Desplat. It has some Western touch in it, along with a traditional Japanese music. What a wonderful soundtrack that sticks in our mind long after watching the movie!As I mentioned above, I prefer Fantastic Mr. Fox to Isle of Dogs. That's because Isle of Dogs, unlike any other Wes Anderson movie, is convoluted for its own good. That didn't hurt the movie as whole, except at the third act, which is quite rushed and messy. Also, I wanted the character of Atari to feel more life-like person. Because I felt he was overshadowed by the dogs, nevertheless, Atari is a well-developed character.Isle of Dogs may didn't live up to my expectations, but still it is my favorite animated movie of 2018 so far!(8/10)"
    },
    {
      "rating": "8",
      "text": "Good animation movie, but I though Fantastic Mr Fox was superior overall. Same type of animation with some 2d. Voices over/narrator were great as usual with Wes Anderson movies. The story was more for children but too graphical for young crowds. The story felt a bit too formulaic from Anderson. It does follows the same patterns, and I think we are at a point where this is showing and getting boring. Yet because of the overall quality of the movie you can't fault this film that much, and it has it's charms. I give it a 77%, because I felt like a kid again."
    },
    {
      "rating": "9",
      "text": "The animation, editing and sound design are the main brass here, and are used to great effect to communicate much of the story.The Isle of Dogs is on the nose about its storytelling, obligatory moments such as flashbacks and story structure are highlighted as to get necessary information communicated as quickly as possible, so the film can get back to living in the moment, exploring its quirky characters and scenery. There is an air of self awareness about the story that, rather than disengaging, is used to draw the viewer more into the inherently ridiculous story. There is an artistry to suspending disbelief, and this is an endlessly creative way to get the audience to do so. To make them aware they're getting conventional information or that certain things are ridiculous plot details, even tropes, and highlighting such details to actually enhance the storytelling rather than distance the viewer. After a point you accept the strange pacing and rapid editing style as part of the universe of this film, and when you do , The Isle of Dogs is an audio-visual experience so cathartic you won't want it to end."
    },
    {
      "rating": "10",
      "text": "I got this movie on a USB drive and every-night i watch is its the best movie of the year so far i have watched 26 times yes i had fantastic Mr fox and watched is over 100 times until some data got corrupted ... i cant stop watching it."
    },
    {
      "rating": "8",
      "text": "Isle of dogs is a world-building visual masterpiece suitable for all ages, with the most painstakingly detailed characters and set designs I've ever seen in a stop motion picture. The plot of this film has a pretty large scope for a stop motion film, covering an array of characters and subplots, with lots of heart and character development naturally integrated into it. The director seems to have struck a good balance between story and art. The characterisation of the dogs fit perfectly with the actual voice actors, with some of the dialogue feeling like they were tailor-made for Jeff Goldblum's or Bill Murray's character. The musical score adds an extra layer of lightheartedness to the overall feel of an already humorous and entertaining film. However, I do believe that there are deeper underlying themes surrounding political propaganda and how they can incite xenophobic fear and hatred. Is it any coincidence that this film was in development during the rise of Trump's presidency? In any case, Isle of Dogs can be viewed multiple times for its immaculately detailed aesthetics (as it is so detailed you will never see everything upon the first viewing) or you can simply enjoy it for a heartwarming tale of the endearing relationship between a boy and his dog. Isle of Dogs gets an 8.5/10."
    },
    {
      "rating": "4",
      "text": "This is one of those movies that I wanted to like a LOT, and I DID like it...kinda sorta. There's much to admire, especially in the area of visualization. The problem is that...well, I just kept falling asleep, and so did my wife. It pains me to write that it did not hold my attention very well. Is that a character flaw? Am I a bad person? If I were to sit down and read the synopsis, I'd say: \"YEAH! That sounds like a cool story!\" But the reality is that this movie did not fascinate me. It obviously worked for a lot of people, and -- for some reason -- that makes me happy. All in all: A creative work that may or may not enchant you."
    },
    {
      "rating": "6",
      "text": "Director Wes Anderson's latest film continues his practice of creating visually dazzling offerings that are long on style, overlong on story and, ultimately, short on substance. The film's clever whimsy is cute, warm and funny at times, but it becomes so exactingly overwhelming as the story plays out that it becomes tiresome and exasperating long before the credits roll. What's more, the film's clumsily structured narrative and screenplay tell the story in such a disjointed and convoluted way that it's easy to lose interest, despite the superb stop motion animation eye candy. Meticulously crafted it is; engaging, unfortunately, it isn't."
    },
    {
      "rating": "10",
      "text": "Audiences around the world go to see a Wes Anderson film for many reasons; imagination, creativity, wonder and most of all, amazement. A man who has crafted and added to, not only a branch of the film industry within the independent market, but an individual who arguable has his own genre of film, proves with his latest that you are able to make an independent success, commercial darling and fading animation style feature film revolutionary. After eight feature films which enrich the medium as a whole, Wes Anderson delved, for a second time, into the stop-motion foray with his ninth future film, and quite possibly his best yet with Isle of Dogs. You heard the rumours right? About Isle of Dogs? Sure, there are a ton of rumours, controversy and discussions about the auteur director’s latest film, both positive and negative (which we will discuss further into this review) including some fun facts that if you say the film’s title fast, it’s actually the equivalent of saying “I Love Dogs”, as well as arguments about cultural appropriation, hmmm.The fact of the matter is, first and foremost, Isle of Dogs is a film that pays tribute and homage to so many of the things that Anderson loves and hold very dear to his heart. From his love to canines, to his homages to legendary filmmakers and vanguards Hayao Miyazaki and Akira Kurosawa, to his love of stop-motion animation; Anderson’s second venture into stop-motion animation is a film anchored by his passions, as well as a TRUE film for dog-lovers everywhere. DISCLAIMER: NO ACTUAL dogs were harmed during the making of this film–fact!Nevertheless, don’t let the animation fool you, Anderson’s Dogs is as convoluted a story and themed complexly as any other of his films.A true underdog story, the film follows a young Japanese boy Atari (Koyu Rankin) and his odyssey to save his beloved guard dog Spots (Liev Schreiber), a short-haired Oceanic speckle eared sport hound, who so happened to be the first dog to be sent to Trash Island, a fictional land outside of Japan’s fictional Megasaki City twenty years in the future, although the story seems more relevant now than it may in twenty years [hopefully]. Trash Island was sanctioned by Atari’s mayoral uncle, Mayor Kobayashi voiced by Anderson collaborator, who also served as one of the screenwriters, Kunichi Nomura. Kobayashi, following an age old dynasty that transgresses from his farthest ancestors, with strong pro-feline beliefs, sets course to sanction a law to deport all dogs to Trash Island, blaming “snout-fever” and “dog-flu” as an incurable disease for its people, despite two scientists (Ken Wantanabe and Yoko Ono) on the verge of a medical breakthrough with the cure.“What ever happened to man’s best friend?” indeed becomes one of the driving forces of the film. While Atari steals one of his uncle’s jets, the mayor himself Kobayashi, who serves as the boy’s ward following his parents tragic death years before, become family members and foes overnight. Questions arise as to why Atari on a quest to save Spots and deliberately chooses to throw his comfortable life away, despite Spots being one-helluva cute dog? It hurriedly becomes apparent that not only was Spots Atari’s loyal companion, but the pup also served as Atari’s loyal and trusted doggie-gaurd, despite Atari’s hesitations at first. Fast forward some time and Atari’s crash landing onto Trash Island, a desolate, ugly, grungy and garbage-filled wasteland inhabited only by dogs, populated with the brittle bones of animal carcasses, leftover waste, as well as spoiled and half-eaten food of Japan’s Megasaki, the journey becomes a young man’s ode to self-discovery and his ultimate moral fibre. Anderson, who so wonderfully, brings to life fantastical worlds in true Wes Anderson-esque fashion, seemingly chooses this story to showcase a very different side of his of his visual, truly allowing garbage, trash and waste to serve as a beautiful and poetic backdrop to his newest canon of films. Adding signatures such as Anderson’s symmetrical filming style, the use of pans and deep zooms, and Trash Island as well as the overly-populated Megasaki City fit right in with the rest of Anderson’s highly staged universe’s. It also becomes quite easy to see that Anderson is also pioneering himself into cinematic prestige; using Isle of Dogs as his Avatar, progressing and improving stop-motion, maturing the visuals of the medium as well as mastering the ways of its presentation, especially comparing it side-by-side to his first venture with the form in The Fantastic Mr.Fox."
    },
    {
      "rating": "10",
      "text": "Isle of Dogs is all at once an animated, slapstick comedy, an epic, and a redemption story. Wes Anderson has once again created a masterpiece of cinema that skillfully combines the highest comedy and the lowest tragedy into a delight for the soul. This is the best movie I have seen in theaters thus far in 2018, and one of the best animated films I have seen in recent memory. I can't recommend Isle of Dogs enough!The stop motion animation is charming and beautiful. The art direction and design is so specific and intricate that you'll find new things in each frame every time you watch the movie. There is beauty in the desolation of Trash Island, and the characters feel alive and real.Speaking of characters, the voice acting in this film is truly incredible. The Wes Anderson staple of a highly talented, highly acclaimed ensemble cast is in full effect here. Bryan Cranston and Greta Gerwig shine as the rough-around-the-edges stray turned pack leader and the American exchange student with a conspiracy theory respectively. The banter between Bill Murray, Edward Norton, Jeff Goldblum, and Bob Balaban as the pack of alpha-dogs is simply delightful. Every single cast-member gets their moment in the spotlight, and it's a joy to watch.In terms of direction, there is simply no director like Wes Anderson. The man is a modern-day auteur, and every film he's ever made is unlike anything I've ever experienced. Isle of Dogs is hilarious, somber, whimsical, melancholic, and utterly beautiful. There is something for everyone in Isle of Dogs, from kids, to animation fans, to Wes Anderson fans, to the average movie-goer. If you get a chance to see Isle of Dogs in theaters, GO. Do not miss this one!"
    },
    {
      "rating": "5",
      "text": "The latest from Wes Anderson (and his 2nd stop-motion animation after \"The Fantastic Mr. Fox\") takes place in Japan, where a plague has caused all dogs to be transferred to Trash Island. When one boy comes to rescue his pet, it starts a journey that ends in the expected. As is usually the case with Anderson, the art direction is imaginative, inventive and delightful. The story starts with a quirky energy that's fun, but about half way thru, things get a bit precious and the pace starts to lag. This is filmmaker with a singular style, but it sometimes becomes too self-indulgent.  Still, Anderson showcases his unique approach to storytelling, character and visual style."
    },
    {
      "rating": "9",
      "text": "This canine-themed stop-motion beast wags its tail because of Anderson's filmmaking loftiness. Wes Anderson is not a cult artist, he's a prolific maestro. His films always enjoy an added cachet that positions them far above many only-entertainment flicks, and his latest classical animated jewel meets perfectly what one would expect from an indie author who has erected his sublime filmography frame by frame. It's neither a blatant cultural appropriation of East Asian culture nor a scurrilous Japanese stereotyped assortment drawn by an injurious foreigner, it's a beautifully hand-made and delicate love story, a widely different, a fertile pic in visible and veiled exclamations on freedom, press, politics, principles, fear, transformation, friendship and human and dog's life which feeds off from a top-of-the-range vocal cast and a visual and technical section as eccentric and neat as every of the narrative ambitions of a filmmaker who not only sets up a baroque addition to his exquisite filmography and artistic growth but imbues this high-concept film, with some complacency, of a razor-sharp, sophisticated allegory that is clearly geared to the grown-up minds, those who resist to consider art as a channel of trivial thoughts, not as a mechanism of inescapable contact and advancement. There's no doubt that for Anderson's style newcomers the first thing they will highlight is tangibility of the pictures. When the screening was over, the up-front reference that arose in my mind was the most recent piece of art of Laika Entertainment, \"Kubo and the Two Strings,\" not precisely by the concordance with the cultural basis or some moral similarities, but by the beautifully crafted creations, by being an invaluable gift for cinema, by the unspeakable visual prowess that hundreds of artists have built for us. The symmetrical compositions of the ever-perfectionist director who refuses to subdue his works under the phenomena of the digital age are straightforwardly glittering; a sharper aim to circumvent known superficialities and immerse it into the complicated, visually speaking, Japanese pulp places this film on a higher level in artistic terms, even unfolding the majority of the action on an adjacent island. More broadly, what decorates with personality the feast of strangely gorgeous frames is incredible and awardable cinematographer Tristan Oliver, rich in nuances and recesses endowing the pictures with irrepressible force which grows uncontrollably as the film runs, every frame is an authentic, finely crafted and shaped sculpture passing through the hands of hundreds of exquisite animators who with their talent, literally and figuratively, capture the obsessions of an animation maestro; a spellbinding experience. Anderson isn't only known for his peculiar and unpractical but extremely gratifying filming method, the textual motives that mobilize such handmade constructions intervene in the success of the narrations. The script is written undeniable by the American director because the characteristics of a concise writer arise, sensitive in a given moment, but coolly manipulative when the film itself requires it. With regard to the dicey, well-intentioned plot, it's conceived by eight hands with own name and recognition: Kunichi Nomura, in his first work as a writer; Jason Schwartzman, in his third experience as a film screenwriter; Roman Coppola, in one of the greatest successes of his career; and Wes Anderson, a man who doesn't need a description, just run and get covered with his artistic visions. The perspective he gives the story is simply unique, social and pleasantly revitalizing not only due to the fussy field of animation but the drama genre lines it uses with an unusual confidence in levels of conviction and coherence with respect to a plot that doesn't set in an explicitly human context, in the strictest sense of the word. \"Isle of Dogs\" by Wes Anderson mesmerizes from beginning to end, partly by its mania of playing with the high expectations always put on a director's job. Accessible and sophisticated, strategic and human, hilarious and dramatic, strangely beautiful and directed; this animated film is an undeniable love letter from the filmmaker to Oriental culture, canines and, beyond doubt, the recesses and perversities of the feelings, actions and inspirations of humankind; A feature film that produces juicy critical, controversial commentaries through generally opposed elements that are quickly woven on a story led by any manifestation of love, prioritizing narrative, technical and artistic fields with the proportionality only a maestro could handle. If you want to enjoy a good movie you will have many more options to choose from, but if you demand a top-notch film you will be welcome to watch as a stop-motion animation monster puts an actor, screenwriter, producer and director— uninterested in making movies for an Oscar — on the front page, a place he has never gotten out from."
    },
    {
      "rating": "10",
      "text": "El estilo general de esta película simplemente me fascina, es intrépida, divertida y arriesgada, es como llevar cada pagina de un cuento infantil a la gran pantalla de la forma mas literal que se puede, además de que amo a los perros, perfecta."
    },
    {
      "rating": "10",
      "text": "An awesome wild bunch of diamond dogs with same weight of Fantastic Mr. Fox. Remarkable story in stopmotion plenty of references to Japanese art and cinema, some overwhelming for catch the most. Perchance the worst nightmare of Disney- Pixar."
    },
    {
      "rating": "4",
      "text": "I enjoyed the basic theme of the story but this was still at a level of an 'Afternoon Special\", with good old school Sinbad animation.  Really nothing special about this movie although as I watched it, I got the idea that maybe I was just not intellectual gifted enough to appreciate the direction of the whole deal."
    },
    {
      "rating": "8",
      "text": "This is more of what we have come to expect from Wes Anderson: a whimsical tale of friendship in unlikely places set in a cute dollhouse world with a plethora of sharp, unique humor. As with Wes Anderson's last stop-motion film, Fantastic Mr. Fox, the star of the show is the beautiful, near-flawless animation. It is, in a phrase, awe-inducing. The plot is muddied a bit with obscurity as to the motives of the antagonists, and it is unclear as to whether Anderson is applying social commentary to his story or not (If he is, it is difficult to decipher and doesn't quite come through. The script, as is typical of Anderson's films, if witty and amusing from start to finish. The chuckles never cease. Though it cannot help but leave some questions unanswered, this charming piece of art is a must-see for fans of unique cinema.Story: 6Acting: 7.5Script: 8.5Visuals/Sound: 10Entertainment Value: 8MY RATING: 8/10"
    },
    {
      "rating": "8",
      "text": "There is no need to say that this movie is visually stunning, beautifully stop-motion animated, or that it has imaginative, creative, and above all that a heart-warming story, nor it's necessary to praise it for its witty visual humor using the setting, the symmetric cinematography, etc. Simply, because it's a Wes Anderson movie! What should be mentioned are the pros of this very movie. And, of course, Isle of Dogs, as any Wes Anderson movie, has what distinguishes it from any other Wes Anderson movie. In fact, there are three new pluses here. First, and foremost, the visually storytelling. Yes, I know it's not a new thing to say about a Wes Anderson movie, but there is no Wes Anderson movie, nor any stop-motion animated movie that has used its visuals to tell its story in this way. Specially, when you know that this movie has many scenes where there is no dialogue in English, just in Japanese, or where there are just Japanese subtitles! The second great thing about Isle of Dogs is the voice cast. Sorry Fantastic Mr. Fox, I love you more, but here the cast really adds up to the movie. The cast isn't star-studded just because it's a Wes Anderson movie, but every single actor, or actress, really made every character feels distinctive. Bryan Cranston voices Chief, who is, by the way, could be considered to be the real protagonist, and Bryan is GREAT! Easily the best. But really all the cast shines in this movie. Edward Norton is my second favorite. At last but not least, comes the music score from the Oscar winner, Alexandre Desplat. It has some Western touch in it, along with a traditional Japanese music. What a wonderful soundtrack that sticks in our mind long after watching the movie! As I mentioned above, I prefer Fantastic Mr. Fox to Isle of Dogs. That's because Isle of Dogs, unlike any other Wes Anderson movie, is convoluted for its own good. That didn't hurt the movie as whole, except at the third act, which is quite rushed and messy. Also, I wanted the character of Atari to feel more life-like person. Because I felt he was overshadowed by the dogs, nevertheless, Atari is a well-developed character.Isle of Dogs may didn't live up to my expectations, but still it is my favorite animated movie of 2018 so far!(8/10)"
    },
    {
      "rating": "10",
      "text": "Wes Anderson has done it again, Isle of Dogs is an absolute gem. From start to finish I loved every minute of Isle of Dogs. Stop motion brought to a new level, the attention to detail is simply wonderful. Directed by Wes Anderson, you know you're going to get an off-beat comedy and the laughs just keep on coming. Filled with a star-studded cast, I could list them all but we'd be here all day. Visually stunning and immensely enjoyable.Set in Japan, Isle of Dogs tells the story of 12-year-old Atari Kobayashi and his quest to find his lost dog, Spots. After a serious case of dog flu every single dog has been exiled to trash island to live out the remainder of their lives. Abandoned by their masters and left to die. With the help of a pack of dogs on trash island Atari embarks on a journey in search of Spots. A brilliantly original story, filled with plenty of laughs and made all the better with stop motion. The voice actors were so perfectly chosen. 100% a Wes Anderson movie, what else do I have to say to sell it to you? It's quirky, funny, not to be missed and highly recommended."
    },
    {
      "rating": "6",
      "text": "Chucking away people’s furry companions into a castaway of our own junk sounds unpleasant. If the government decided to pass such an act in real life, it’d be no laughing manner. However, Wes Anderson’s Isle of Dogs explains his own unpleasant reality for the near future in a strong sense of repugnantly clever dark humor.You maybe heard Japan historically made holy good fortune symbols out of cats: the maneki-neko (Fortune Cat) and the “Nambu Jinja” (Cat God Shrine) to name a few, well once upon a time, feline lovers declared war on canines, beneath Mayor Kobayashi’s command, due to an incurable dog flu and snout fever conspiracy theory, alongside canine overpopulation. Therefore, those dogs must live off rotten apple cores in Trash Island while everyone pushing the quarantine strokes a stink-eyed kitty in his lap. In this ominous future, dogs behave like humans, and humans behave like dogs, all in an inventive level of turning dogmatic excrement into gold more movies should reach.The set pieces diverge across modern Japan’s high-contrast imagery that brims the manageable branding of Harōkiti (Hello Kitty) into the monotone, not-so Kawaii (A Radiant Face) Trash Island with many garbage cubes signifying ultimate imprisonment. Green shows up almost nowhere in this feature, causing the entire island to glow of blood-stained muddy hues much like whatever your quadruped friend may have left on the front mat. If there is anything in the real world that would normally gag your reflexes, here, it instead exhausts beauty, say for instance, an illuminated glass bottle cave that silhouettes a dog pack who rest there for the night.Wes Anderson commands everything under his own mind game, as if he’s adapting the wartime manga series “Norakuro” (Stray Black). Claymation cinematographer Tristan Oliver uses the light scheme to artfully mimic a spotlight on Mayor Kobayashi’s control; the abandonment he details in each dense frame almost always positions pack leader Chief in center, the camera pivoting on an axis to draw our attention on each individual pooch.Chief leaves a greater impact than any other dog or human followed throughout the story, black from living through soot his entire life, zero nametag in sight. Each of the hounds’ other nametags help you to identify their souls behind their fleas, not their imprisonment number tattoos, a lot like the following of typewriter names recorded as the holocaust victims state themselves in Schindler’s List. One of these hounds, King, flaunts whiskers curled in a pompous high-class moustache fashion, just one small example of the stop-motion dolls’ memorable designs. However, amongst the maggots Chief’s pack must consume, they undeniably do little anything plot-productive. The standard American voice actors in part hurt it further, who never sound drunk off toilet bowl fluids as this film demands.Though Chief is an exception to the narrative flaws his pack carries; right from the start he needs a Hachikō (Eight-Affection) type hero, until Atari, a twelve-year-old in search of his guard dog, Spots, triggers a change in attitude. Although Atari has few thoughts about each dog he meets, the main relationship between himself and Chief surprisingly sweet, topped off by some handsomely animated tears built to churn your pancreas in sorrow.In this Japanese fantasy-dystopia, captions in parentheses accompany Japanese text, dialogue mostly media translated. The dogs’ barks are translated into English, ensuring easy international adaptation. To counteract the smog of pooch anti-paradise, familiar historical images of Japan include a Neko Jinja (Cat Shrine), Taiko boys, sumo wrestling, a Nō (Talent) production, and a humorously gross seafood bento box prep sequence.The Japanese murals here resemble toys recycled for affordable government-funded programs: a world where puppets control smaller puppets within perfect compositions that suggest political control upon whatever meticulous movement made. These fascist solutions, including robot canines built to replace regular canines, ends up less feasible than public lies, leading to few surprises why an Empire of Dogs might attempt rebellion toward the oppressive leaders’ theatrical playset.Unlike most propaganda, Isle of Dogs turn the nation against itself in a weirdly entertaining way which safely repulses you enough to take initiative. In fact, the matter will get so out of hand as you watch this show, you’ll need to go outside, vomit, regain yourself, then ask the nearest bystander out loud: “Whatever happened to man’s best friend?”"
    },
    {
      "rating": "8",
      "text": "The look of this film blew me away.  Wonderful animation and it's worth the price of admission by itself.  I guess the best word to describe the movie is \"witty\".  There were really no laugh out loud moments for me, but instead a lot of chuckles throughout and the movie never bored me.  Anderson's last stop-motion animation, Fantastic Mr. Fox, was funnier and definitely does have a lot of laugh out loud moments, but I still enjoyed this film.  The cast does a great job with the voice overs.  Wes Anderson remains one of the most consistent filmmakers out there.  I'm never disappointed."
    },
    {
      "rating": "8",
      "text": "Quirky, unpredictable, and full of surprises this wonderful animated adventure is like something you've never seen before. A visual feast, full of heart and humour. It's just what you've come to expect of a Wes Anderson film."
    },
    {
      "rating": "8",
      "text": "It's got all the fun and whimsical charm you'd likely expect from Wes Anderson! Like his last stop-motion effort Fantastic Mr. Fox, the film dazzles with its incredibly detailed animation throughout. It's also chock full of recognizable voice talents (Anderson regulars such as Edward Norton, Bill Murray, Jeff Goldblum, Frances McDormand, Tilda Swinton, Harvey Keitel, F. Murray Abraham) along with some others such as Bryan Cranston, Greta Gerwig, Scarlett Johansson, etc. Overall, like I said, the film is incredibly fun and charming from start to finish and I'd find it difficult to imagine it not being able to delight even those who aren't huge Wes Anderson fans."
    },
    {
      "rating": "8",
      "text": "A beautiful visual feast with a cute yet brutal plotline. Surreal, cynical and above all, cleverly constructed (both in terms of its elaborate sets and its plot)."
    },
    {
      "rating": "7",
      "text": "not fair to the boy.. not fair to the dog..Isle Of DogsThe bonding between the 12 year old kid and a dog (\"a stray\" dog) is portrayed beautifully being the core soul and reason of the feature, the makers did invest a lot in it. The work that went behind the stop-motion is admirable and quite finely detailed too but when it comes to draw the emotions out from the screen, it isn't utterly adequate. The writing is strong, witty and fast paced (especially in its first act) which should have come off in its favor, but due to multiple characters and their sub-plots that it has to cover in such short runtime (around 100 minutes), there is very little space for the audience to breathe in. Wes Anderson's world is definitely different than its usual features and the irony in here is that, \"this\" is a simpler and asymmetrical one . A decent job on giving the voice by the star cast to these eerie characters and so was the choice on casting them. Isle Of Dogs is an intriguing feature to encounter where the execution is genuinely effective and lures you in within few minutes making the audience work for it and sweeps away its runtime like a charm but the only thing that itches you throughout the course is the writing which unfortunately isn't as convoluted as the makers think."
    },
    {
      "rating": "10",
      "text": "Wes Anderson's \"Isle of Dogs\" is a gorgeous, heart-warming story about man's best friend. With unbelievably beautiful set pieces and charming voice talents, the film locks you in for a masterpiece of a ride."
    },
    {
      "rating": "9",
      "text": "Isle of Dogs is good. Trust me, this movie is really good and K-9. Great, epic and astounding."
    },
    {
      "rating": "10",
      "text": "the whole movie was great so was the animation and music i always enjoy stop motion movies and just like the movie that came before it the humor and jokes worked well with the tone and setting and that plot twist with chef and spots were related got me and one last note the whole dog eat dog message was handled rely well"
    },
    {
      "rating": "1",
      "text": "Barking up the wrong treeIsle of Dogs is lost at sea. It drowns in its own self-indulgence. And sinks to darker depths than it can withstand. Isle of Dogs is a stop motion animated movie that looks and feels like Fantastic Mr. Fox and many other Wes Anderson movies. But Isle of Dogs leaves behind Mr. Fox's clever humor and goes full dark on the audience. The trailers made Isle look like a humorous animated kids movie about talking dogs with a simple boy searching for lost dog storyline. This was a gross misrepresentation. Isle of Dogs is a dark meandering conspiracy drama with no momentum. It bounces from title card to title card for an hour and forty minutes, never building up any sense of natural flow. This isn't due just to the choppy, symmetrical visual style. It's due to convoluted, broken storytelling that is confusing even for adults. Kids will not enjoy this movie. There are several adult themes throughout Isle of Dogs that are not suitable for children. The movie deals several times with suicide. I know that's a big deal in Japan, but it's a very serious tragic topic that needs to be delicately addressed. There are numerous depictions and discussions of graphic animal abuse to dogs. Early on we're shown a dog skeleton and led to believe that the boy just discovered his dead dog. There is also graphic violence, and a bloody surgery scene. The plot is really a massive mess of political/corporate conspiracies that overshadow the simple search for a lost dog. And we have to discuss the bilingual dialogue. Much of the movie is in Japanese. Only part of the Japanese dialogue has subtitles. Are you kidding?! This is an American movie released in America. It must be in English or have English subtitles. But even the English dialogue is lame, overcooking the Wes Anderson style. The visual style makes it hard to take anything very seriously, despite the heavy subject matter. But there is little else to lighten the mood. And without any likable or memorable characters, it's hard to stay engaged to the end. My advice is don't bother starting the trip to the Isle of Dogs."
    },
    {
      "rating": "8",
      "text": "An immensely enjoyable new effort from Wes Anderson. The stop motion animation is beautiful, the cast is fantastic, the characters are likable, the score is just as wonderful as you'd expect, and it's full of Anderson's signature style and humor."
    },
    {
      "rating": "3",
      "text": "“Isle of Dogs” is a hard picture for me to write about because during a lot of it I thought it would easily rate as one of the most boring movies of the year BUT the stop-motion animation is so intriguing that the story itself is irrelevant to what is being shown on the screen. I didn’t even try who was voicing what character because I was too busy looking at them.The story is really simple as basically all dogs are banished to a garbage dump island and a boy goes looking for the one who was his special pet.Upfront I am not a Wes Anderson fan and he wrote and directed this film but it is the animators who really deserve all the credit along with the production designers who make each dog expressive, interesting and fun to watch.Not mentioning names but I do know someone who saw it and fell asleep a few times more than he normally does—and, no, it’s not Allen! Unless you love dogs and animation “Isles of  Dogs” is not a film for you."
    },
    {
      "rating": "10",
      "text": "Wow. If you haven't watched Fantastic Mr. Fox, go see it before this movie. Then you can appreciate this, too. Isle of Dogs is a cynical, beautifully animated movie that is disgusting and surreal yet charming and full of what I call \"Andersons\" (it feels so much like other Wes Anderson movies!). An outstanding cast, extremely humorous, dark but charming, and yet.. SELECT THEATERS? Watch this movie. But it has a PG - 13 rating. Cutting up live fish, dog bones, blood, surgery, and more.. TAKE ANYBODY WHO DOESN'T MIND THESE THINGS!See it. Immediately."
    },
    {
      "rating": "0",
      "text": "Seriously, save your money, it has the looks of a badly made 1980's japanese cartoon, but less plot than any of them had, and I think most of the people watching it were of the same opinion. By 15 minutes in, everyone was chatting with their friends or surfing the net on their phones or had left. Cant believe the same guy that did Mr Fox did this dreck"
    },
    {
      "rating": "0",
      "text": "Wes Anderson is a shallow husk who has been making the same movie with the nearly the same cast for almost two decades now. You don't have to put Bill Murray and Tilda Swinton in everything. These movies are a labor to watch as they are so detailed yet have so little to say in terms of sophisticated messages and mature writing. I can't watch this narcissist search for his inner-child anymore. Any action is so corny it's embarrassing to watch and the dialogue seems like it was made from magnetic poetry."
    },
    {
      "rating": "2",
      "text": "\"Isle of Dogs\" delivers a boring and dull experience for young lings and teenager alike. The overall quality of the movie itself makes the experience presented rather blank. Not a recommended film."
    },
    {
      "rating": "0",
      "text": "The trailer was utter crap, and Im certain that with a doofus like shallow Wes Anderson, the actual movie is nothing more than an artistic scam."
    },
    {
      "rating": "5",
      "text": "The cast does a great job making their characters come alive. Chief's story arc was touching and so satisfying to see come full circle at the end of the film. The humour was scattered in bits throughout the film, Some of it was solid but some just kinda falls flat. I think Wes Anderson's humour is better off in live action because it just doesn't have the same impact when animated.A big issue for me was the plot. It wasn't interesting, It was too predictable and there were way too many subplots going on that they totally ignored the only decent thing about the film. Where this movie really strikes gold is when Atari is on the island with the dogs. That is where this movie is at it's best because you have an amazing cast, who worked great together, and you have a lot of touching, heartfelt moments during that short amount of time. Rather than deal with these stupid subplots featuring rather awful human characters, Wes should have focused more on the dogs because they're the best characters in the film.And I do agree with a few other reviews on here as well: This movie is quite boring at times and it can nearly put you or actually put you to sleep."
    },
    {
      "rating": "9",
      "text": "Boy, was I surprised walking out of this one. Thanks in no small part to some unquestionably immaculate stop motion animation, an incredible array of breathtaking sets and hilarious character designs, a winsome, eminently talented vocal cast, and -- above all else -- a quirky, charming story and world that's sure enough to make even the most adamant curmudgeons crack a smile, \"Isle Of Dogs\" ultimately shakes out to be a delightful, good time and easily one of Wes Anderson's best motion pictures to date."
    },
    {
      "rating": "9",
      "text": "\"Isle of Dogs\" is another artistically successful Wes Anderson production. It's a bit darker and more dramatic than I expected, but no less entertaining, and it's got standout moments of beauty and charm that will stick with me. It's also a fantastic showcase for the stunning medium of stop-motion animation.Bryan Cranston nails the key vocal performance as Chief, the stray dog who sticks out of the pack of alphas that hold sway over Trash Island. The other dogs have highlights and flesh out the world, but Cranston, who is at war with himself, is radiant, and almost singlehandedly sells the whole picture. Even though the premise of \"Isle of Dogs\" is so absurd, the story is rich in character moments and symbolism, and is structured like an epic. The point-of-view is more often than not from the dogs' eyes and ears, with much of the Japanese being untranslated, an interesting artistic choice that may come off as inspired to some and cloying to others, especially since the human element plays a rather large part in the plot.While Anderson has plenty of fun here with dog jokes and puns, he also manages to devote time to examining the age-old give-take relationship between humans and dogs, social and environmental issues, the increasing detritus and forgotten sins of the modern age (the price we pay for \"progress\"), the influence of media and the elite, and the pursuit of the higher self, all in the span of an hour and forty minutes.As Anderson yanks on heartstrings with close-ups of tear-filled human and dog eyes and emotionally rich scenes of great inter-species bonding and tribulation, he also pays homage to the old Japanese masters - Kurosawa, Mizoguchi, and Ozu are all referenced with gorgeous mise-en-scene, character and set design, story choices, and complex framing and tracking shots.Pay no heed to the \"professional\" critics crying \"cultural appropriation\". They are going out of their way to find fault here. I see nothing offensive in this intricate portrayal of a fictional, alternate-universe Japanese city in all of its beauty and complexity. This is a story that transcends cultural and linguistic boundaries and appeals to all dog lovers, even as it slyly comments on the elaborate fictions that we humans love to craft and live by. I'm really not sure how it will play to kids, though.Although \"Isle of Dogs\" wasn't the manic comedy I was expecting, and there are definitely pacing issues and missed opportunities, it really spoke to me in a way few films do these days, and in a manner and style that closely evokes Japanese cinema from the bygone eras of the 50s and 60s as much as it does the rest of Anderson's often-stellar oeuvre. I'm definitely seeing this one again."
    },
    {
      "rating": "9",
      "text": "Oh, i was expecting an Laila-like movie, and boy was i wrong, not even the animation looks similar, and the plot feels so good and (at least partially) new, something almost all recent movies lack (animated and live action), i would like to see more like this from wes anderson"
    },
    {
      "rating": "9",
      "text": "Wes Anderson utilizes simple concept of love and friendship with immense matriculation in crafting a tailored sequence of events to send a simple message: Dogs and humans are friends."
    },
    {
      "rating": "9",
      "text": "After seeing Isle of Dogs at my theater, it is safe to say that this movie is a must see if you’re an animal lover. This movie has an excellent casting, doggy humor, philosophical cues, superb stop motion animation, and vocal performances that you won’t ever forget. As you see this film, it will feel like you are watching an anime, but with stop motion animation that Anderson uses when making an animation film. Isle of Dogs may look like a family friendly film, but it is way more than that and I highly recommend on seeing this film if you like a smart PG-13 animation movie that has a much serious tone than the others."
    },
    {
      "rating": "9",
      "text": "A whimsical tale of maligned canines, this is Wes Anderson at his best, with the mix of absurdity and dry humour resulting in a thoroughly enjoyable and esoteric film. Beautiful design and painstaking detail makes for a visual treat, and the storyline is odd yet compelling, with the voice actors bringing the witty script to life. If you're not a Wes Anderson fan, this is certainly not for you, and a warning that this is not a children's film either, but otherwise it is a delightful and strange tale with laughs to be enjoyed. 8.77/10"
    },
    {
      "rating": "9",
      "text": "Wes Anderson's Isle of Dogs is a wonderful movie about dogs. Surprising coming from Wes Anderson, but Isle of Dogs is a tribute to dogs! They are cute and loyal and possibly sounds like Jeff Goldblum if you are lucky!The stop-motion is beautiful! The movement is fluent and very accurate to how dogs move, and the designs are stellar! It's beautifully shot too, a trademark of any Wes Anderson feature, and the world is unique and lively. In terms of scale and even the actual method of animation, is surpasses Anderson's first animated feature, Fantastic Mr. Fox by a mile. The voice acting is top notch, with a major standout going to Bryan Cranston as the main dog Chief. It's one of the best celebrity voice acting I have heard in a long time! It does have the effect similar to James Franco in the Disaster Artist where he is doing such a good job that everyone else looks a lot worse by comparrison, as many of talented voice cast do more of the Wes Anderson monotone, however for the world that they inhabit they do match perfectly. And the friendship between Chief and Atari is cute and quite touching, albeit brief.The main issue does come into the use of Japanese language. This does tie into the controversy of cultural appropriation. While it is true that the Japanese setting is mainly for aesthetic purpose rather than a deeper meaning, I wouldn't say it's that big of a deal in terms of the film's quality. However when it comes to the language barrier, it is a problem. Often they do have either characters narrating over as translation, which is fine like the case with Francis McDormand's character, other times the film have other characters English-speaking characters narrate for no real reason. I wished that Wes Anderson either just had subtitles, or just not had any and let the actions of the Japanese characters speak for themselves without having any translations, as some of the best scenes of the movie use the visual storytelling of animation speak for the non-English characters. Also Greta Gerwig's character in the film is rather pointless with her ark having a bigger narrative that the film suggests but never having a satisfying conclusion, unless it is meant to be a subtle commentary on the white savior trope.Overall another fantastic film from Wes Anderson! Here's hoping for more stop-motion efforts from him!"
    },
    {
      "rating": "7",
      "text": "‘Isle of Dogs’ is going to most readily be compared to 2009’s ‘Fantastic Mr. Fox’, Wes Anderson’s first stop motion picture, and given that the former is Anderson’s second time trying his hand at stop motion, one would expect both the technical and artistic aspects of the film to be of greater sophistication.  Simply put, Anderson succeeds on both fronts.Setting the film abroad in Japan poses numerous language and translation issues that have to be addressed throughout the film, and Anderson nimbly uses it to his advantage.  Furthermore, each of the dogs is given a meaningful amount of depth and characterization.  That being said, there were a handful of times I felt my attention drifting throughout the movie, and I found myself less emotionally invested in the plight of the characters as the film went on.  In the end, Anderson has brought to us another prototypical Wes Anderson film, a unique combination of his particular form and function that we’ve come to know and enjoy, so while I certainly recommend seeing the film, I think it would really take being a dog lover to really love this movie."
    },
    {
      "rating": "9",
      "text": "Yeah, Wes Anderson's style and character beats tend to repeat in his films, but what keeps me usually liking them is that he always tries a different subject matter or format, keeping things fresh. Plus, he still seems to be honing his craft and abilities. Isle of Dogs, in which all the dogs in a Japanese city in the near future are sent to a garbage dump island by a corrupt, dog-hating mayor when a disease breaks out, is his most impressive movie to date.Wes Anderson's films have always been visually arresting, but this one manages to beat all the others. The stop-motion format allows Anderson to control every angle, every visual in this detailed, fascinating-looking world that unfolds like a storybook come to life. Yeah, the human characters aren't the most polished-looking of stop-motion characters, but the dogss movement, including the wind in their hair, is really fluid. The story contains Anderson's traditional quirky, deadpan wittiness at full blast. The story is pretty inventive, there are even robot dogs!, while ultimately telling a heartwarming tale about loyalty to man's best friend. The ending is a bit rushed and resolved a little too easily if you ask me, though.Now if you don't like Wes Anderson in general than this won't be the film to change your mind. (He really doubles down on his style here.) But if you like something different from the usual film, than this is for you."
    },
    {
      "rating": "10",
      "text": "Isle of Dogs is a wonderous, inventive and extremely enjoyable film. Beautiful stop-motion animation, wonderful characters and strong themes make it a must-see."
    },
    {
      "rating": "8",
      "text": "After a week of medium films and the huge hoarding of Infinity War in theaters, I had the opportunity to watch Wes Anderson's new film.Certain part of me has come to believe that his films are not for the massive audiences and I curse the distributor for releasing it in my country just a week after Infinity War.I will not go deep into it, I just can only say that I loved it. I loved every second and I was delighted and although the story is too thin, it sustains enough to keep the film completely in the right place.The animation is beautiful, the vast majority of the puppets have different distinguishable features, like the dogs, which speaks of the great level of detail. The same goes for all the sets wich are pretty great.The cast of voices is of first level with quite a few of the director's well-known allies and although I don't usually mention this kind of stuff I must say the ridiculous criticism of the way in which Wes Anderson let the Asian characters speak only through something or someone translating them is just that; ridiculous. It's evident that this was the narrative approach that he decided to give to the story and it works very well.Stop seeing racism everywhere. When everybody starts to feel victimized that's when people begin to forget the real victims.But in a final note I must say that I highly recommend it and I will undoubtedly run to acquire it as soon as it is for sale."
    }
  ],
  "recommendations": [
    "kubo_and_the_two_strings",
    "ratatouille",
    "luca",
    "your_name",
    "the_boxtrolls",
    "wolfwalkers",
    "dinosaur",
    "ghost_in_the_shell",
    "the_incredibles",
    "paprika",
    "okja",
    "the_book_of_life",
    "the_iron_giant",
    "alpha",
    "finding_nemo",
    "loving_vincent",
    "the_bfg",
    "raya_and_the_last_dragon",
    "the_road_to_el_dorado",
    "spider_man_into_the_spider_verse",
    "the_little_prince",
    "the_ballad_of_buster_scruggs",
    "who_framed_roger_rabbit",
    "the_nutcracker_and_the_four_realms",
    "how_to_train_your_dragon_2"
  ]
}