{
  "id": 118,
  "title": "It Chapter Two",
  "starring": [
    "Bill Skarsgård",
    "James McAvoy"
  ],
  "runtime": 169,
  "genre": [
    "Horror",
    "Fantasy"
  ],
  "description": "27 years after overcoming the malevolent supernatural entity Pennywise, the former members of the Losers' Club, who have grown up and moved away from Derry, are brought back together by a devastating phone call.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zfE0R94v1E8cuKAerbskfD3VfUt.jpg",
  "categories": {
    "plot": 8.521739130434783,
    "acting": 8.642857142857142,
    "ending": 8.2,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 7.5,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "It is solid from beginning to end. it's much better than the first part. The cast is simply PERFECT!!! It is incredibly BRIGHT"
    },
    {
      "rating": "8",
      "text": "i actually thoroughly enjoyed this. i was surprised when a lot of people were dissapointed there was so much to digest and hard to fit a lot into the storyline. kudos to andy muschetti."
    },
    {
      "rating": "9",
      "text": "This movie I believe was made with book readers in mind, King in the past copped a lot of flack about his endings especially this book. He gives a nod to this where he pocks fun at himself through Bill's character who is unable to give a satisfactory ending to his work.   There's also a great deal of humour in the book as well, this is how the characters deal with the all the horror they face. Pennywise has absolute control of the town, controls both what children & adults see and don't see, is the cause of many major catastrophe's that occur in the town when it awakens every 27 years, leaving many unsolved murders. Had a great time watching the movie, highly recommend, can't wait to see it all put together when it's released on dvd."
    },
    {
      "rating": "9",
      "text": "A gorgeous, wonderfully acted, fluidly directed, faithful, and emotionally satisfying second half (NOT SEQUEL — ask King and Muschietti) to what is possibly the first true horror epic."
    },
    {
      "rating": "9",
      "text": "Thoroughly enjoyed this movie, loved it in fact, I honestly wished it had gone on longer, can't understand the complaints of the time/length of the film (considering how much was left out from the book).  Also, people should stop calling this a sequel, it's not, it's the second part of the story."
    },
    {
      "rating": "7",
      "text": "If you enjoyed the first It movie then you'll probably like this one. The film has very good visuals and acting. Also Bill Hader is great in this movie."
    },
    {
      "rating": "8",
      "text": "Satisfying CloseIt: Chapter Two is definitely not as good as the first film, But it still has plenty of good scares and great acting in it."
    },
    {
      "rating": "9",
      "text": "Well... I will just disagree with the other critics. I give a good mark of \"9\" to It Chapter 2. This was a great movie. It kept me in thrill and fun for 2 hours of my life that were actually one of the best nights ... Now...about the movie...It was more of a mystery / thriller movie to me than horror movie. I loved the colors, the scenario and everything that goes with it. The cast of It was AWESOME and correct to me 'cause I have read the book and as I said in t"
    },
    {
      "rating": "9",
      "text": "I found that it developed all the characters well. Yes a lot of people had criticism but for me it was worth the cinema ticket!"
    },
    {
      "rating": "7",
      "text": "Movie has a good few scares it's well put together and some creepy moments with a fantastic clown shaped creature, a must see horror of 2019, but I knock off points for the length and for a lack of reference for some sequences.I believe it would have benefited from a chapter 3 and more of a deep dive.Overall I had an overall good experience."
    },
    {
      "rating": "9",
      "text": "What can I say man....... IM CRYING THIS MOVIE WAS TOO GOODDDDD #reddieforlife"
    },
    {
      "rating": "7",
      "text": "Como adaptação pode não ser aquilo que os fãs esperavam, mas como um filme mais independente, ele faz um trabalho excelente em fechar a história título original. O primeiro é melhor, mas o segundo não deixa de ser obrigatório para ser assistido."
    },
    {
      "rating": "10",
      "text": "Really good movie. Great character development, great dialogue and writing, not completely faithful to the book but faithful enough, great acting, scary moments, funny moments, intense moments, sad moments, horror, a bit of sci fi, improved CGI, entertaining, fun, and goes perfect with Chapter 1 as one big movie/story. A job well done by everyone involved."
    },
    {
      "rating": "10",
      "text": "IT : Chapter One and now IT : Chapter Two are both better movies than the 1990 made for TV miniseries/movie. People really are hating on this movie. Most people I've seen in comments on Instagram, Facebook, Youtube, and such or in reviews even on Rotten Tomatoes and IMDB either love IT : Chapter Two or at least think it's good/good enough. It's a damn good film."
    },
    {
      "rating": "10",
      "text": "10. Really great film. I highly recommend it. Bill Nader is great and the standout but every is great in this film."
    },
    {
      "rating": "8",
      "text": "People should try reading the book to appreciate what a major undertaking it's been & how difficult this book would be to adapt to film, not to mention the incredible job of having to condense a book that is over 1400 pages long. The movie is shown in flash backs just like and throughout the book, its an excellent adaptation from a book that is in part very \"out there\",the ending of the movie has been changed & told in a way that is comprehensible to non-book readers. It's a shame that a large portion of Mike Hanlon's character especially was changed and left out, the racism that he and his parents suffered was very horrific. Despite the complaints of the length of the film, I felt it ended too soon, I wanted to see more character development with most of the characters.  But my main complaint is the letter from Stan, they should have left it as the book, that it was fear that drove him to take his life. I'm looking forward to the 6 hours cut that's been promised when it's released on bluray."
    },
    {
      "rating": "9",
      "text": "A new take on the old film. It recreates moments whilst not stepping on the old movies toes. It is good to see horror trying to make new moments rather than rehatching old tricks."
    },
    {
      "rating": "10",
      "text": "Chapter 2 will be much enjoyable for people who have read the book.  There is much more origin and storytelling in this one.  I read a bad review which criticized one of the opening scenes as being irrelevant and too violent.  There was nothing irrelevant about it.  The scene showed IT waking up hungry and the mental influence that IT has over the people of Derry, especially the low bread hateful people.  I liked it even better than the first."
    },
    {
      "rating": "10",
      "text": "An enthusiastic 2 thumbs up ! 5 star rating. 10/10. Awesome film. Too much ill timed comedy at times but that's just nitpicking. I loved all 2 hours and 49 minutes of this movie."
    },
    {
      "rating": "7",
      "text": "I had a lot of fun. I Laughed a lot, squirmed a little, but I was rarely scared at all.I loved all the actors' performances and the visuals were all beautiful.Many of the creative decisions seemed inappropriate for the horror genre and it dampens a lot the horror elements. The movie is also very long, and it doesn't have the right pacing to mask this length.If you care more about being entertained and empathizing with characters as opposed to feeling scared, You'll probably have a great time. Also skip the soda if you don't like getting up to pee - not kidding it's a really long movie :)"
    },
    {
      "rating": "10",
      "text": "Better than the first the performance of the cast is spot on ! Scarier than the first one and goes deeper . PS don't listen to the critics !"
    },
    {
      "rating": "10",
      "text": "Filme exelente maior continuacao de filme de terror não perdeu a essência do primeiro filme é ficou excelente"
    },
    {
      "rating": "10",
      "text": "Oscar worthy, not just a horror movie. This movie is an all around great movie with multiple emotions. 100% recommended."
    },
    {
      "rating": "10",
      "text": "Such an great movie! Better than the first one.I can’t understand, how this film could be bad."
    },
    {
      "rating": "10",
      "text": "Fantastic horror movie! It is easily one of the best horror-movies alongside US and Scary Stories to tell in the dark this year."
    },
    {
      "rating": "10",
      "text": "It's outstanding , the creativity for visual effects , the good ending , those actors acting deserve praises too"
    },
    {
      "rating": "10",
      "text": "Great horror movie, differs from the book in a good way, with a more optimistic ending. Bringing Stephen kings book to film would be extremely difficult and the director and the cast did a great job of creating a good movie that, is refreshing and entertaining to someone who read the book and respects the source material. I look forward to Dr. Sleep and hope they can do the same."
    },
    {
      "rating": "10",
      "text": "It's not perfect (not better than the first chapter) but I just want to see the supercut, period."
    },
    {
      "rating": "9",
      "text": "The movie is very good. But the ending is not so well. Acting of all actors are amazing. Overall It 2 is awesome for weekend plan."
    },
    {
      "rating": "10",
      "text": "Fantastic Film! 2019 must watch! The actors did a phenomenal job and even though this film was a little more jump scare heavy than the last one there was still some very genuinely creepy parts (plus the jumpscares were very well done)"
    },
    {
      "rating": "7",
      "text": "IT: Chapter Two was one of my most anticipated films of the year. The 2017 IT is one of my favorite movies I have seen in the past decade. It's a masterpiece of horror that has so much to say about friendship and overcoming life's challenges, and it's scary! Does the second installment that takes place 27 years in the future deliver on the promise the end of the first movie made?No. Not quite.IT: Chapter Two shines when it comes to it's acting performances. Bill Skarsgard remains an iconic Pennywise. The adult Losers are really good as well. James McAvoy and Jessica Chastain are amazing, but the real standout star is Bill Hader. Bill Hader brings so much sass and vulnerability to the adult Richie Tozier, and he is hands down the best part of the movie.Where does Chapter 2 fall short?The biggest and most notable problem this sequel has is that it is way too reliant on jumpscares, to the point where they became predictable and boring by the end of the film. On that note, the script is way too long and goes in circles, and this movie's three hour runtime could easily have been cut to an hour and a half. Another glaring problem is that the CGI in this sequel just doesn't look good, and a lot of the scares are so reliant on CGI that they aren't even scary. In fact, in a general aesthetic cinematography sense, the movie itself doesn't look as good as the first one, and it was really disappointing to see.However, all that being said, I still found myself enjoying IT: Chapter Two. While the first movie is a philosophical portrait of young adulthood, this sequel is a carnival rollercoaster. IT: Chapter Two is tacky, but it's a hell of a ride."
    },
    {
      "rating": "7",
      "text": "It chapter two feels as if it tries too hard  to maintain its formula, which stunned audiences in the first chapter. It chapter two just falls flat, it contains an excellent cast, which allows the plot to carry through. Most of all Bill Hader betrayal of Richie stands out in comparison to the other casting. The conclusion lets us down once again."
    },
    {
      "rating": "10",
      "text": "Brilliant follow up to part one, the acting was superb and I loved the fact there were lots of scenes with the kids."
    },
    {
      "rating": "8",
      "text": "This movie is great and did not deserve its 56 rating. It tells the story amazingly, and its flash backs are great! Read the book it has way more flash backs, so metacritic read before you rate."
    },
    {
      "rating": "10",
      "text": "Is this movie perfect ? No, but it's still great or at least really good and really entertaining and fun time with great acting and such. I have no clue why critics on here, Rotten Tomatoes, and IMDB are hating on this film like they are with such low scores. Pathetic critics."
    },
    {
      "rating": "10",
      "text": "I enjoyed every minute of It. I'm a fan of the book and didn't mind the changes. The casting was great, again, Pennywise was great, again, and it felt like a natural conclusion to the first.My only problem with it was the lame way they decided to split up to find their tokens (though necessary to tell the story the writers wanted) when they all know the most important thing to stay safe is to stay together. But that can be explained away as It swaying the Losers into an opportunity for It to try to scare them one by one once again."
    },
    {
      "rating": "10",
      "text": "Great movie great characters that’s it glorious movie they did the characters well and the movie well hope this movie gets a good box office"
    },
    {
      "rating": "5",
      "text": "Nearly three hours of me not caring about a single character in the film and it's the sequel to a picture which I actually liked a good bit. That takes some doing."
    },
    {
      "rating": "7",
      "text": "A satisfying end. The actors did an amazing job, perfect cast for the older fellas. At some points the movie feels longer than it should have been, but it still holds the attention.I find the first chapter to be the better, but i got to still recommend this one! :)"
    },
    {
      "rating": "10",
      "text": "Meilleur que le premier !!! A couper le souffle !!! D’un jamais vu!!! Génial !!!"
    },
    {
      "rating": "8",
      "text": "In my opinion, IT 2 was a very good movie.  I enjoyed the horrors scenes. Sometimes you could predict what was going to happen, so it became funny.  I  laughed a bunch of times during the movie. Other times you did not know what was going, so it was scary. The movie had a great mix of horror and comedy. Going into the movie, I thought that it would be terrifying, but after watching it, I saw that it was not a top-notch horror film like, The Shining. There was maybe a bit too many special effects used, but the effects were done and incorporated very well. I really enjoyed how throughout the movie, the characters were gaining there memories of them as kids during the first IT movie. There is an outstanding transition in the movie between the characters having flashbacks and the characters being in the present. Overall, IT Chapter 2 was done very well and if you are willing to sit for a 2 hour and 45 minute movie, are a big horror fan and do not want to see an insanely scary horror movie, or if you do, I highly recommend going to see this movie."
    },
    {
      "rating": "10",
      "text": "The sequel definitely exceeded my expectations. I enjoyed how they concluded the story while being visually disturbing for 2 and half hours"
    },
    {
      "rating": "5",
      "text": "While entertaining and funny at many points, It: Chapter Two is a lot messier, bloated, and less charming than the first part. Bill Hader and James Ransone really steal the movie with great comedy and pitch-perfect representations of their child counterparts. The rest of the cast is pretty solid as well, although Bill Skarsgard's Pennywise gets noticeably less screen time this around. The movie's central problem comes from its insanely bloated runtime, as the film runs nearly three hours and it sure feels like it. With better direction and a better editor, the film could've been easily around 2 hours. The ending as well feels cheesy and ironic considering a running joke in the film. In addition, much like the first part, the horror is mostly cheap jump scares with a couple of scary visuals. Overall, It: Chapter Two is a film with good comedy and casting, but poor plotting, mediocre horror, and a ridiculously bloated runtime make it a mediocre experience overall."
    },
    {
      "rating": "10",
      "text": "It chapter 2 had no measures to risk and entered Stephen King's universe brilliantly. It shows that the horror genre is not just stupid jump scares, empty stories, demons, and haunted houses."
    },
    {
      "rating": "8",
      "text": "Really great flick! The adult themes in the book are much more nuanced and this does a wonderful job re-connecting us with these characters in their current state. Not even to mention the task of putting a creature that can't even be explained in the book on screen. The cast is fantastically up to the task and the movie only dragged at around the 1-hour mark. Before that and after it flew and I was on the edge of my seat. Truthful to the text, funny, deep, smart, and scary in different ways. Ch. 1 was DEFINITELY a \"horror\" flick. This one was more of an adventure story with some scares and eerie things mixed in. They are adults, they're harder to scare. Makes sense to me. Great adaption of a great book."
    },
    {
      "rating": "10",
      "text": "Excelente película mi única queja es que dura demasiado pero del resto está bien lo mejor es el elenco que elijieron para el grupo sin duda la mejor peli de terror de este año"
    },
    {
      "rating": "10",
      "text": "I love this movie!!! There are differences from the book, however I think that the changes were perfectly placed so that even knowing the story I still jumped out of my seat  a few times. My husband is not big on scary movies so the touch of comedy was also great. He enjoyed a movie that he normally would not have gone to. we laughed, we cried, and saw some things that came out of our nightmares as well as giving us some new ones.  All around great movie."
    },
    {
      "rating": "8",
      "text": "After watching It: Chapter Two yesterday, I can say that I really enjoyed it. Even though the movie was almost 3h long it kept a good pacing and I was never bored. I know people say the movie was too long, but as a reader of the original book , I can confidently say that it’s not. It is a challenge in itself to summarize a 1200 page book in less than 5,5h of total movie time. In my opinion some important parts of the book were left out, like Henry almost killing Mike thus Mike has to go to a hospital and deal with Zombies from Pennywise . Then the rest of the Loosers Club building an engery-circle to give Mike power to defeat those Zombies. But all in all it was a great movie.8.4/10"
    },
    {
      "rating": "9",
      "text": "While The Conjuring franchise will most likely (and rightfully) go down as James Wan's greatest contribution to the horror scene, filmgoers shouldn't overlook how influential his Insidious movies were to the genre as we know it today. They were big haunted house style attractions that are just as funny as they are scary. You can see countless imitators popping up in theaters regularly trying to capture that same rollercoaster combination of thrills and chills. Andy Muschietti's two IT movies are very much products of that.The previous film was very much an '80s coming-of-age, comedy-adventure film à la The Goonies or Explorers that just so happened just so happened to have a homicidal clown darkening the tone a bit. Chapter 2 ends up being just as funny, but now that the characters have grown up the content has gotten a fair bit more graphic. Children are murdered in gruesome fashion and Pennywise has tricks that are even more disturbing up his sleeve this time around. Personally, this is one of the reasons I think it's a better movie.Another one is that it wasn't afraid of taking some of the book's more hard to translate material and put it onscreen. The results are a more fleshed out and faithful adaptation that just so happens to have a lengthy running time some might find exhausting. You can tell they had to leave some stuff on the cutting room floor in order to keep this a strictly two chapter affair (i.e a lack of justification for Bower's return). The only time that really bothered me though was at the very beginning of the movie. I felt they rushed getting the \"Loser's Club\" back together. We really didn't get to see who they turned into as adults and how they still were clinging to problematic aspects of their past even after all those years. Some nuance was lost as a result. Although it was made up for in the final act where they have to face their demons in a battle of wills in order to lay their collective biggest one to rest for good.I feel like they did a phenomenal job with the casting. With the exception of maybe Bill, I can actually see the kids from the previous movie growing up to be these people. That's really freaking cool.Like the book, these movies have a soft spot for the broken, downtrodden, and the outcasts. It's a group of bullied kids that face trouble at school and at home ultimately staring down the evil that infects their town after all. However, even though they represent a variety of features society deems weaknesses, they're ultimately not very diverse with only one girl and minority amongst a group of primarily straight white males. Chapter 2 tries to fix this by changing one members sexuality. It just flat out doesn't work. Aside from the issues already inherent with changing the identity of a previously established character, the decision ends up feeling like an afterthought. Especially in the face of a much more effective portrayal of the kind of violent discrimination homosexuals have experienced that occurs at the very beginning of the film and is actually based on material from the novel. To be brutally honest they did a better job of making this sequel feel more inclusive by giving the black man back his role after passing it off to one of the white characters in the previous outing (yeah, still ticked about that). Glad to see they did Mike right this time around.The return trip to Pennywise's deranged circus is certainly a long one, but it's filled with unforgettable moments both hilarious and unsettling. I had a blast with its mix of horror, humor, and heart. While there a few things I take issue with I feel like Chapter 2 did just enough to edge out the 2017 flick as the better movie and found it to be a totally satisfying conclusion to a 27 year long battle between a group of kids and a clown."
    },
    {
      "rating": "6",
      "text": "This review contains spoilers. I had great expectations, but I think this movie is a huge missed opportunity. I wished I could have a \"IT\" horror movie, but I only got a \"IT\" funny movie. I wanted to be scared, to go back home and feel frightened, but I only felt disappointed. The best part is in the development of the relationship between characters, but this should not be the best thing in a horror movie!Two big \"whys\", among the others:Why did Eddie react in that funny way when stabbed in the mouth? I mean, it's not a Ben Stiller movie, it's IT!Why do we need humor in every scene, even in the most intense ones? Someone wrote it's the \"Marvel Syndrome\" and I agree: this was meant to be a horror movie based on an amazing novel!By the way, in this movie not even jump scares managed to scare me..."
    }
  ]
}