{"id": 1543, "title": "It Follows", "starring": ["Maika Monroe", "Keir Gilchrist"], "runtime": 101, "genre": ["Horror", "Mystery"], "description": "When carefree teenager Jay sleeps with her older boyfriend for the first time, she learns that she is the latest recipient of a fatal curse that is passed from victim to victim via sexual intercourse. Death, Jay learns, will creep inexorably toward her as either a friend or a stranger. Jay's friends don't believe her seemingly paranoid ravings, until they too begin to see the phantom assassins and band together to help her defend herself.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/iwnQ1JH1wdWrGYkgWySptJ5284A.jpg", "categories": {"plot": 7.12, "acting": 7.625, "ending": 8.153846153846153, "soundtrack": 8.666666666666666, "cinematography": 7.5, "familyFriendly": 3.0, "funny": 5.0, "action": 8.333333333333334}, "reviews": [{"rating": "8", "text": "Even though it is not quite as scary as word of mouth would have us believe this is still a superb psychological thriller rather than an out and out horror movie. Low on bloody gore but high on atmosphere, most of which is wonderfully generated by simple shots such as roads, trees a gate or a swimming pool. These and many other ordinary compositions have been lit and captured in a way that gives the film its eerie sense of menace and dread. In the main the film owes its success to these simple details masterfully directed by David Robert Mitchell. Maika Monroe, looking very much like Chloe Sevigny, registers strongly as the young victim of events, and the nerve jangling score is another great contributor. It is also good to be able to report that the film does not rely on gimmicky shock tactics to raise the hairs on your neck. In fact, there are surprisingly few jumps to be had. Still, this doesn't prevent the film from holding you mesmerised in the palm of its hand for almost its entire running time or, at least, until an unsatisfactory ending somewhat disappoints."}, {"rating": "9", "text": "This movie MUST get a wide distribution this spring. There are so many meager horror movies released nation-wide every year (picture a 20-something \"possessed\" female with arms bending back and milky eyes), and there are a few gems (The Guest, You're Next, A Terrible Way to Die) that cut through the morass.  This is one of those gems. It's a beautifully shot, spare horror thriller with an amazing retro-analog synth score that keeps you tense and engaged throughout.  The basic premise and \"rules\" simple-yet-brilliant and lead to some highly fresh and fun terror sequences. Maika Monroe, fresh off her solid role in The Guest, raises her game with a stellar performance. And every one of the supporting actors, the setting, and the \"It\" are all so authentically drawn, you leave the theater with a smile on your face. It might feel a touch long as the scenes before the finale are drawn out a bit, but that's my only real criticism.  It's a must for horror fans and anyone looking for a genuine thrill."}, {"rating": "9", "text": "A sense of uneasiness looms over the whole movie.  Throughout the whole movie, you can't place when it is taking place.  There is a lack of people outside of the main characters for the majority of scenes.  Due to all this you can't quite get comfortable with the movie which I believe is the very intention.  The filmmaker said that was inspired by dreams (or I should say nightmares) that he had and just like many other reviewers I believe this movie has a very dream like quality.\r It is a must see."}, {"rating": "0", "text": "This has got to be one of the worse movies that I have ever seen. After watching 40 minutes of it, we had to leave. If you like to watch little teenagers having sex, then maybe you would like  it. If you like very slow half naked women moving toward the characters, you might like it. It wasn't for me!!"}, {"rating": "8", "text": "Slow at times, but the scary parts really do pay off. This film has a very simple concept when it comes to the monster, however it really does a great job in building the tension. This film takes a lot of elements from A Nightmare on Elm Street. For example, you'll see a female lead struggling to sleep through fear, you'll see skin bruises caused by an invisible monster, you'll see a group of teenagers dealing with the monster, while none of the parents appear to be involved, also they take a scene straight out of the movie when the female lead tries to call her friend (who happens to look a little like Johnny Depp) across the street through her bedroom window at nighttime to warn him about the monster before he dies in his bedroom... There are still a ton of original ideas in this film, but this just stood out while I watched the film. Really good film, but I wouldn't consider it a masterpiece. Still way better than all the other crap horror films that come out annually."}, {"rating": "0", "text": "It STUNK. Just awful. This movie was so bad, I literally registered here just to take this rating down a peg. What in the world are people seeing in this movie that is worth praising?? Honestly...I nearly walked out. Boring, predictable, cheesy, uninteresting, zero suspense, zero scare factor, not even creepy...just straight up terrible on top of awful on top of BAD with some deplorable and some unforgivable mixed in. Please, save your money, or just roll down the window of your car and throw it into the wind, but do NOT go spend money on this piece of garbage."}, {"rating": "3", "text": "After reading the reviews, my brother and I decided to go check this out earlier today and were both extremely disappointed. The movie just drags on for what seems like forever after an admittedly intriguing opening, only to devolve into shots that go on for way, WAY too long that focus on nothing of real significance, little is explained as to what \"it\" is, why \"it\" follows, why \"it\" is at times unable to open a door, which \"it\" then resorts to breaking windows, then is able to hurl large electronics into a swimming pool and take on a completely different level of physicality that makes you question what the hell it's actually capable of. That's how a lot of the movie is: something is vaguely eluded to and you think you know the 'rules', because as an audience, we're being told a story and we want to feel like we have a personal stake in the film, feel a little immersion, etcetera. But little to nothing is ever explained. Characters are just not interesting. Jay's sister seems to be there to be a shoulder to cry on in close ups when things \"get crazy\" and doesn't really have an arc to her story at all. There's another girl with glasses and a \"shell phone\" in the group that provides almost nothing other than famous quotes delivered in a monotonous, pretentious tone of voice during low points, just to keep it's floundering head above water in hopes that the audience will put up with just a little more punishment.\r There is some good here, though. The lead actress, Maika Monroe, is genuinely great. She's convincing when she needs to be and most importantly, does a fantastic job acting terrified, confused and worn down. The cinematography is beautiful, showcasing the various suburbs, beaches, vacant buildings, worn down houses and schools with some artistic flair, wide shots that are awesome to look at and the sound design is great as well.\r The score is alright, but songs are repeated to the point of ad nauseum and I think he's trying too hard to be John Carpenter. But to wrap this all up and to maybe paint a better picture of what I'm trying to say, let's talk about Halloween, a film I've seen some reviewers compare this to. You have the character of Michael Myers, who for the most part is a mute, slow-moving stalker of teens, much like the \"it\" of this film. The reason Michael works and this doesn't is because everything about him is laid out by Dr. Loomis. You have exposition to explain what he is, what makes him tick, he had a legitimate purpose and goal. Jason of the Friday the 13th movies is the same: we the audience know his motivation. Those movies aren't about the teens, they're about the monsters. But it's a monster we identify with. \"It Follows\" is like this: we like the 1980s, let's get some old televisions with classic monster movies on them, older cars for this never fully defined time period because what the hell, that's pretty cool. Get some teens having sex in here because that's what Craven and Carpenter and Romero would have done, right? But get this...what if I was so original as to come up with the idea that our \"Michael Myers\" is transmitted from kid to kid like an STD?! Except it isn't always the same guy and nobody can see him unless you have it. Oh, and nobody ever knows what it is and I'll never say because it's better for the audience to just come to their own conclusions about the scraps of information I've fed them, sparsely, over a 2 hour time span. I mean, Kubrick never had to explain \"The Shining\", right? I can be Kubrick.\r Guys..?"}, {"rating": "3", "text": "After seeing its sky-high metascore, I eagerly grabbed a ticket for this, and it was quite a letdown.\r Pros: Dialogue and acting were decent, and the aethetics were often very beautiful.\r Cons: Wasn't scared a single time. No nifty twists, too much filler, didn't care about the characters."}, {"rating": "10", "text": "Wow\r This really should get a wide distribution (which, sadly, The Guest, with the same lead actress, did not get) - this is a modern classic of a horror movie. Not so much a horror movie (though a few scenes were indeed quite chilling) but more psychological thriller"}, {"rating": "2", "text": "Story was clearly not a priority here. I gave it a 2 in recognition of a few fun moments and artful nods to some classic 80s horror staples.\r Scariest part: shameless propogation/use of the myth that sex kills.\r I have no idea why so many critics have gone on record saying this film is haunting, chilling, terrifying, etc. Their opinions about the film are much more haunting to me than anything in the film (except maybe all that stuff about evil, scary, deadly sex.)\r But dinner before the movie was great. Really good mac and cheese! And my husband and I had a fun date. So all was not lost. Still, here's hoping for a movie with a real story for our next movie date!"}, {"rating": "9", "text": "It Follows is a well-executed horror movie that takes you back to a more classical world of horror. It eliminates a lot of predictability often seen in other horror movies and builds its own story along with the viewer's attention. The setting of the movie is really enjoyable with somewhat relatable characters and a mysterious/terrifying force that keeps coming at you throughout the movie always keeping the main character and the viewer on edge.One thing that I personally liked is those modern movies nowadays always have to \"google\" or go to a \"library\" in order to find out what that \"thing\" is. This movie leaves that open to interpretation which was quite good and instead focuses on its intense moments and the stress the characters have to go through in order for them to succeed in getting rid of it.I also enjoyed some inducing horror aspects of the creature itself where you end up looking at the screen thinking of where or if that's the thing that is coming. A really chilling experience.+ Well acted+ No jump scares+ The atmosphere is well built as well as the setting+ The creature itself is interesting and new, well-executed+ No shakey cam+ Feels like a throwback to classic movies in all the right ways+ A chilly experience+ Better to view with someone else- It plays it safe sometimes- The ending could've been slightly better"}, {"rating": "8", "text": "An unusual allegory to the danger of pleasure, but also a dominant realization that shows us the conformism of modern life. The film takes us to where the postmodern existential crisis and the daily conformism begin. All concealed in an intelligent entity, which follows us and continues to die .. as well as everything mentioned above. Spectacular."}, {"rating": "9", "text": "Wow!This film tapped into a psychological fear of unseen, unrelenting horror.Best horror film of the decade!"}, {"rating": "8", "text": "This movie is SO good, there is a true ambiance, Maika Monroe is very good."}, {"rating": "8", "text": "A brilliantly filmed horror movie. The suspense, music, acting, and plot all come together well to create a spooky visual and emotional experience. If you are a fan of horror films, this is not one to be missed."}, {"rating": "8", "text": "good movie and a nice creepy setting. Good job by the relatively unknown actors. Not quite as good as A Quiet Place but still a cool Little film."}, {"rating": "8", "text": "Writer-Director David Robert Mitchell makes a powerful film, managing to pay homage to 1980s John Carpenter cinema while creating his own urban legend."}, {"rating": "8", "text": "It Follows is a very Carpenter-esque film, with enough slowness and ambiguity to keep you guessing as to what will happen next. The draw back is the use of the (limited) special effects, which takeaway from the spooky/real nature of the film. Overall though an intriguing film."}, {"rating": "8", "text": "Very suspenseful movie, and by far the best one I've seen from this year (yes, slightly better than \"Ex Machina\"). This movie had something that was lacking in horror films: originality. Not only that, but the performances were pretty solid and the musical score was fittingly phenomenal. Not a masterpiece, but an impressive movie nonetheless. I just love how genius is the premise. It's simply original.\r Final Score: 8.5/10."}, {"rating": "8", "text": "This movie is absolutely a must see for anyone who loves horror. It was excellent in ALMOST every way. The ONLY problem I had with it is that it's kind of obvious the writers didn't know how to end it and so it's one of those Lord of the Rings thing where you think it's going to end but then it continues, this sort of makes the film lose momentum towards the end, but overall it was an awesome movie and you should definitely see it."}, {"rating": "8", "text": "I loved the whole throwback feel to this movie. The acting was believable and the music/sound FX were a real treat. FINALLY a new horror movie that's GOOD!"}, {"rating": "8", "text": "This movie is not a 10/10 masterpiece imo, but it is a very good and original movie. The basic concept of a \"thing\" walking towards you, that others cannot see, and will never stop until you're dead or you've \"passed it on\" is both simple and very unnerving. The acting is good for the most part. The lead (Maika Monroe) is great in the movie. The best part of this movie is the atmosphere it creates. The unnerving electronic music and the beautiful and eerie wide-shots create a great atmosphere, which causes you to constantly feel slightly on edge throughout the movie, nervously searching the screen for \"It\". The pacing is good overall, but the movie starts to drag a bit in the middle. The pool scene had a few plot holes (as well as some of the decisions the characters made), but was quite intense nonetheless. An issue I had with this movie is the rules of \"It\". It is described to only walk slowly towards the person who has \"it\". Yet at times, \"It\" can crush windows, open doors, swim, jump, stand still, and other stuff. This movie gets the good score it gets for the acting by the lead, the cinematography, music and score, and as well the story. It does not quite reach the \"masterpiece\" level for the inconsistencies of \"it\", the draggy middle and a few plot holes. This movie is flawed, but overall very good and has great atmosphere."}, {"rating": "8", "text": "The pace of the movie makes the movie great. Some places you don't know what is going on or what happened. I liked that you didn't know. I couldn't help, but love this movie. If you couldn't see the connection to Elm street then you should watch it again. Elm street was my first real scary movie. Her looking out her window with the old phone just like Elm street. So cool!  They really took their time making this movie."}, {"rating": "8", "text": "This movie is strange but awesome! The reviewers that gave bad reviews must have taken this movie differently then it actually was. It has a mysterious cyber-punk feel to it and it is so different then many other movies. the horror and thrilling aspects are cool as heck. very good watch."}, {"rating": "8", "text": "Um dos filmes mais tensos e mais falados de 2015. Alguns odeiam,outros amam. It Follows tem uma bela ambientação e fotografia,além de um incrível roteiro.As atuações são medianas,mas o filme te deixa tenso do primeiro ao último minuto. O enquadramento de vídeo é maravilhoso."}, {"rating": "8", "text": "Spätestens seit Wes Cravens Scream weiß jeder: Im Horrorfilm ist nichts gefährlicher als Sex. Das erfährt auch die hübsche Jay in David Robert Mitchells It follows am eigenen Leibe. Nach einem Date mit abschließendem Geschlechtsverkehr verfolgen sie stumme Unbekannte in Küche, Wald und Wohnzimmer, bei Kontakt winkt ein furchtbarer Abgang. Warum, weiß weder sie noch der Zuschauer. Und so erlernt er wie Jay mit holprigen Schritten das bösartige Regelwerk hinter den Attacken der nackten, glotzenden, manchmal inkontinenten Besucher. Denn der Fluch hat System – ganz wie in The Ring – und es gibt kein Entkommen. Das ist unangenehm, in seinen spannendsten Momenten sogar purer Terror. Der Plot entwickelt sich zwar kaum, der Film endet fast, wie er begann – das stört aber nicht. Denn mithilfe von Mitchells interpretationsoffener Erzählweise und des pluckernden Synthie-Scores von Disasterpeace wagt It follows die Experimente eines Indiefilms – ist dabei aber unterhaltsam wie ein Blockbuster."}, {"rating": "8", "text": "It Follows is by far one of the best films of the genre that I have seen in years, I certainly recommend it, although I clarify that this film will not please the people who want the simplistic scare and do not want to dig a little more, If they are the kind of public that is educated by films as laughable and tedious as Saw and Hostal and therefore only want torture, blood and violence, this is not a movie for you, this is a fine, slow, tense and atmospheric work, loaded with suspense."}, {"rating": "8", "text": "B+ *************************************************************************"}, {"rating": "8", "text": "Mi película de terror favorita. Misteriosa, grotesca y extraña. La banda sonora es canela en rama."}, {"rating": "8", "text": "Let me start by saying I LOVE all things horror. It has been a while since I have found a horror movie (real horror without relying on jump scares) that has satisfied me. I have to say that this movie delivers in all horror aspects. It's creepy, it keeps you on edge and has you DREADING any possible jump scares, and it does all of this plus have an original idea. It was fantastic finding a horror movie that strays away from your basic ghosts, demon possessions, and aliens. Not saying anything is wrong with any of that but it truly is nice to get away from that from time to time. The only reason I am giving this an 8 is because I wasn't too crazy about the very ending of the movie. I am a writer and, to me, the ending is extremely important and I would have just added a few extra things to it to give the viewer a little bit more closure. Overall though, it is a fantastic horror movie and it left me creeped out and disturbed as a good horror film should."}, {"rating": "10", "text": "The absence of old adult characters suggests a world of failed relationships between parents and children, as well as the bare thread that conveys the bond between young adults and their caregivers. In short, an interesting radiograph of contemporary relations. The a entity can be seen as a metaphor for selfishness, especially in a large part of American society, usually involved in hegemonic conflicts with other nations of the world. This question even takes us to a group of people who carry the HIV virus and transmit it on purpose to other people, as a form of \"revenge\" for having acquired what's considered one of the greatest evils of humanity."}, {"rating": "8", "text": "An innovative horror-drama with a simplicity.\r It was not too long ago I saw the director's other film, his first one and liked it instantly. I did not expect him to go all the way from a beautiful teen drama to a creepy horror flick. But I liked this movie as well, thus that prove he's not a fluke. After seeing his both the films, I can detect the style of presentation that marks his trademark. That is very realistic, dull, but a natural societal atmosphere with a mere background score.\r I have said many times that these days horror flicks are heavily leaning on the scary noise/sounds. But this film brings the tone that's really happening around us. The story was like a straight flowing river, no twists or turns like the Amazon river. Even it did not try to hide the existence of the evil spirit. Not only from us, but among the characters in the story. That means it is a very simple tale with the compelling scenes.\r It does not look like a cheap horror, this 2 million movie can stand up to any fancy horror flicks. The writer/director's interpretation was very interesting too. Like he said IT could board a plane to follow who he's after. The theme was also very innovative. Quite similar types have made out, but this one was way better. Yep, many movie goers overwhelmed by the unexpected, even the filmmakers for the response.\r Now I pray for if there is going to be a sequel, it must be made by the same writer/director. My worry is the B category filmmakers going to spoil the original in the name of follow-up. I highly recommend this movie, especially for adults due to the plot that develops on the sexual intercourse. Though there's no strong nudity. I also suggest you to watch at night, if possible alone. I won't guarantee that it would scare out of you, but that's the best way to watch any horror flick.\r 8/10"}, {"rating": "8", "text": "One of the best Horror Movies of the last years. Great original score by disasterpiece, decent acting and an intriguing premise. An invisible force will hunt you down if you have sex with its victim. So you can choice to keep running away or try and pass it to someone else. some kind of moral dilemma. It embraces the cliches of old horrors (Like sex being the cause of every evil, using teenagers as the main characters and playing more around the idea of the killing rather than the gore of the act)."}, {"rating": "9", "text": "This one got its hooks into me pretty easily, and even after a second viewing I found the movie thought-provoking and enjoyable.  The ending might seem like a cop-out to some, but I don't think many will regret watching this.  Warning, it may not be a good date movie."}, {"rating": "9", "text": "It's a very different type of horror, which completely relies on originality and not any cheap schlock cliches. The score is **** excellent and reminded me of John Carpenter's Halloween score. Although the ending could have used a little thump."}, {"rating": "8", "text": "It follows sets up an interesting premise and it is mostly this, together with the great soundtrack, that carries us through the movie. The movie will keep you and your friends discussing hours after its end, trying to think of how \"you would've done it\"."}, {"rating": "9", "text": "Original, smart, and terrifying. It Follows is a real breath of fresh air for true horror fans. The only thing I regret is having to wait for it to arrive on Blu-Ray to be able to see it. Highly recommended!"}, {"rating": "9", "text": "This is one of the better of the modern horror flicks. Directed in a style that consistently evokes a feeling of dread without being too violent or gory, it’s well acted by a group of relatively unknowns, which only adds to its feeling of being real. It has a few \"boo scare\" moments which help add to the general feeling of unrest. It's quite entertaining."}, {"rating": "9", "text": "It Follows is a very good movie,which it doesn't rely on jump scares or other things that most horror movies this days are relying on and naturally are failing.This pays so much tribute to older horror movies and does it great.The acting is good especially the main girl does a great job,the editing is great and the camera moves in a perfect style.The cinematography is awesome especially considering that is has such a low-budget.This really should have gotten a wide release everywhere because it's worthy.\rUnfortunately it's not what most people have said it is the scariest movie ever,that's not true,I mean it's scary at times but that's not what the overall movie is,it mostly has big tension build up perfectly and that's what makes the movie for me.I'm so glad it's rated R so we can enjoy a good and masterfully done 2015 horror movie.\rIn the end I'll just say that this movie succeeded at what is was going for and that's more than enough to love this movie."}, {"rating": "9", "text": "Truly original horror films are a rare treat nowadays, but \"It Follows\" delivers a slow-burning psychological ride that will have you looking over your shoulders. The film is reminiscent of old-school Carpenter, with its use of visceral ambiance taking precedent over slash and splatter. It's slow burn approach to psychological horror makes the scares unique and effective.  \"It Follows\" bends the mind like no other recent films have managed to do. Needless to say, I highly recommend it."}, {"rating": "10", "text": "Wow, one of my favorite horror films of all time. The thought of an STD taking the form of anybody around you, making them attempt to murder you is scary enough..... but imagine watching that. It keeps cheap jumpscares to a minimum, so it finds other ways to scare you."}, {"rating": "3", "text": "I really, really do not understand why this movie keeps getting good reviews.  One of my best friends and I went to see it while he was in town for a day because it not only looked like the best of what was out, but rotten tomatoes praised it.  With very few parts that were even remotely on the scary side,(being a horror fan) that was pretty disappointing.  By, the end of the movie it was one of the first times I've ever wanted a refund (not that I would ever ask) and somebody from the upper part of the theater behind me yelled out in disappointment as well and also mentioned rotten tomatoes.  It is slow paced and as with most horror movies had many just plain stupid and easily avoidable situations.  The characters just seemed cliched(not such a surprise, as many movies borrow from others) as far as I.Q.s under 100 and casually not believing anything that was transpiring.  The only plus was that the idea of the movie was somewhat original.  I do stress somewhat.  Then, in the blink of an eye, it ended in the type of way you ask yourself \"Seriously?  What the hell did I just watch?\""}, {"rating": "9", "text": "So in case everyone hasn't noticed yet, the users (or should I say, tools) who give the lowest scores don't have any intelligent or insightful reasons for having their negative views of the movie, they just spout baseless vitriol much like a middle schooler complaining about his worst subject -- \"It's just stupid and the teacher sucks, I hate it!\" -- People who give their opinion in this way (especially when they write it in the context of \"reviewing\" a work of film literature or art) are either small-minded, or simply have poor taste coupled with a poor vocabulary.\r So if you are in open-minded individual, do yourself a favor and ignore the little brains and see this unique and chilling throwback horror film that ingeniously combines a blend of classic horror cinematography with an undeniably modern and original style of its own, which is fueled by one of the most eerily intense, master crafted soundtracks in horror cinema history.  Put on top of all this a script of refreshingly honest adolescent dialogue that never sounds campy, and which gives way to some of the best performances in the horror genre by a small cast of young actors who deliver subtle and often surprisingly introspective portrayals of the growing teenage dispassion for their modern day lives.  So to sum up -- if you are a person who is interested in something other than the trending Torture-Porn which constantly seeks to exploit the growing visual desensitization of horror fanatics at the cost of any original subtext or substance, then you'll be grateful for the existence of this intelligent and dread-inducing piece of art."}, {"rating": "9", "text": "Easily best horror film of the decade imo. I liked VHS 1 and 2 alot but this def took the cake. The soundtrack and the atmosphere are just fuc*ing incredible, sh*t is literally jaw dropping. There isn't alot of overused pop up scares, its more of visual scare. Great film def should go and watch."}, {"rating": "8", "text": "This is a really cool retro feeling horror film.  Though it's not the scariest movie it may be one of the most well made.  The score adds to the tension and I love the way the film has you guessing.  A-"}, {"rating": "9", "text": "This movie had some great acting, and a brilliant concept. The movie was very low budget and had a disappointing ending comparing to how good this movie was."}, {"rating": "9", "text": "Pretty great movie, awesome tribute to 80s horror films. Some scary moments here and there, but it is mostly an obvious message about HIV and how easy it is to get it. On that optic it is very well done, because at the same time it is not only a propaganda message, it is at it's core a well crafted film, with good acting and an unforgettable soundtrack."}, {"rating": "9", "text": "It Follows was, for me, an amazing contribution and homage to the work of the likes of John Carpenter, and a stellar counter to the modern landscape of horror. With most movies opting for the found-footage, exorcism/possession or vampire vibes, It Follows offers a refreshing blend of incredible cinematography, chilling atmosphere, and one of the best soundtracks in recent memory hearkening back to Halloween. A must-see for any true horror buff."}, {"rating": "9", "text": "One of the best and very creepy movies I've seen so far. Must watch!\r Watch it online, for free: https://www.primewire.ag/watch-2763622-It-Follows-online-free"}, {"rating": "9", "text": "It Follows, all you need there is in the title, this was a great addition to the horror movie genre, really causing a change in the establishment, this movie is not like other horror movies whom of which rely entirely on cheap jump scares.\rIt Follows really is more of a psychological horror really placing the viewer into a constant state of paranoia, having to always wonder where \"It\" is, while still trying to piece together how this all started, maybe even thinking how can our protagonist pass this thing on and even then still have to wonder if the next person will survive.\rThis movie is really a low-budget masterpiece adding great visuals and of course the amazing music which only added to the constant tension going on.\rWould have given 10/10 but some scenes were left unanswered or rather pointless like the ball hitting the window scene."}], "recommendations": ["the_conjuring", "the_witch", "the_ring", "the_babadook", "the_descent", "the_conjuring_2", "scary_stories_to_tell_in_the_dark", "the_texas_chain_saw_massacre", "the_woman_in_black", "the_possession", "the_ritual", "insidious_chapter_2", "ouija_origin_of_evil", "the_conjuring_the_devil_made_me_do_it", "antlers", "dark_skies", "malignant", "insidious", "annabelle", "insidious_chapter_3", "us", "it", "annabelle_creation", "chernobyl_diaries", "sinister_2"]}