{
  "id": 3067,
  "title": "Jackie",
  "starring": [
    "Natalie Portman",
    "Peter Sarsgaard"
  ],
  "runtime": 100,
  "genre": [
    "Drama"
  ],
  "description": "An account of the days of First Lady, Jacqueline Kennedy, in the immediate aftermath of John F. Kennedy's assassination in 1963.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nF9N33PfhizMEzbfxHoxXBo2vx9.jpg",
  "categories": {
    "plot": 7.484848484848484,
    "acting": 7.123076923076923,
    "ending": 6.4,
    "soundtrack": 5.714285714285714,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.142857142857143
  },
  "reviews": [
    {
      "rating": "4",
      "text": "A strong performance from Natalie Portman is not enough to save 'Jackie' from being plotless and plain boring. It is not necessarily a bad movie, and some people will definitely enjoy it, but it would've been much better if it covered more of Jacqueline Kennedy's life, or her post as the first lady, or her upbringing and her life with her husband. Instead, it just focuses on the aftermath of the assassination and the plans of the burrial. I wanted to like this movie, but unfortunately, I couldn't."
    },
    {
      "rating": "3",
      "text": "Portman is the only reason to invest in this portentous, too talky and claustrophobic drama that is far less compelling than its subject matter would suggest."
    },
    {
      "rating": "7",
      "text": "Natalie Portman gives a promising performance as Jackie.The film itself is built solely on Jackie's psychological journey during the event of Johns death. The movie does not explore the perspectives of other characters. Its a movie on Jackie's personal struggle. Its about how  a part of Jackie died when he died. The film feels slow and stagnant because it dwells a little too much on that. The film never steps back into the shoes of an observer and so we never see what the people at that time saw. We only see her pain we don't see the effect of her behavior on the country and how it made her an icon. And after a while it gets a bit boring. It does not focus on any background events even for a minute."
    },
    {
      "rating": "4",
      "text": "A gold-plated platform for Natalie Portman to deliver an Oscar-bait virtuoso performance but I'm left wondering if the film was made for that reason alone."
    },
    {
      "rating": "9",
      "text": "“Jackie” stars Natalie Portman in this bio drama capturing the days and weeks following the assassination of President John F. Kennedy and how his widow coped with this tragic event. Directed by Pablo Larrain (the Chilean born producer who also directed the acclaimed ‘Neruda”) and ably supported by Billy Crudup, John Hurt and Peter Sarsgaard, this is the story of a widow’s quest for dignity amidst heartbreak and great personal loss. Written by Noah Oppenheim, the film has credibility and insight as it reveals the frailties, weaknesses and strengths of those in public life and especially those who are dealing with the most intimate and private of happenings.  I give this film an 8 rating with a special nod to Ms. Portman who, like the lady she portrays, communicates a regal elegance throughout the most trying of times her character is forced to experience and endure."
    },
    {
      "rating": "8",
      "text": "Jackie isn't a traditional biopic, but a searing, intimate and sometimes unflattering portrait of the former First Lady. It revolves around the interview she granted the week after her husband's assassination and features numerous flashbacks, mostly during the events leading up to and immediately following the world-shattering event. We see Jackie go thru many emotions and Natalie Portman carries them all off with astounding insight and skill. This is a condensed character study that's wrapped in an art film package. The soundtrack is heavy-handed and intrusive, but I think it was director Pablo Larraín's intention to make the whole experience less than comfortable. Even though, the portrayal and insights are fascinating."
    },
    {
      "rating": "9",
      "text": "Very interesting peek into the Jackie the public never got to see. Powerful performance by leading actress & supporting cast. Personal historical flashback for myself & enjoyed the tour of some of the White House. Emotions pour out of the silver screen"
    },
    {
      "rating": "9",
      "text": "This is a magnificent film made all the more poignant and heartbreaking on the eve of the inauguration tomorrow. Portman is superb, it's beautifully shot and carefully edited, with a script which is delivered with subtle excellence from the entire cast. The score is used expertly and sparingly, with long stretches of silence exacerbating the brittle tension at the heart of the film. This is not a film you'd say you like, exactly, but it is one you say is breathtaking. 9.01.10"
    },
    {
      "rating": "7",
      "text": "Jackie is a harrowing look at a woman who goes from being the most powerful woman in the world to losing all of that power in an instant. Natalie Portman gives a great performance as Jackie Kennedy, and we see her struggle to come to terms with tragedy, find her place in a transitioning world, and fight to be able to truly grieve and mourn and feel her emotions. The supporting cast features some nice performances from Greta Gerwig, John Hurt, and Peter Skaarsgard. Focusing the subject matter of this biopic solely on John F. Kennedy's assassination is a very strong choice, and gives us an intimate look at a woman in turmoil. At times, Jackie can feel like it is wallowing in it's own grief and tension rather than guiding us on a journey through the main character's personal strife to a resolution. This holds it back from being a better film, but this is a good film nonetheless."
    },
    {
      "rating": "7",
      "text": "I went into this pretty blind, and in hindsight, what a strange concept. I had done no research, and just knew it was a Natalie Portman lead “biopic” of sorts. Only once the movie started did I realize this was produced by Darren Aronofsky (Requiem for a Dream/Black Swan), and I immediately tempered my expectation from “Classic Jackie O Retrospective” to “Dark Post-Assassination Character Study”. Natalie had the mannerisms and accent down pat, and I always love to see Billy Crudup in anything. One thing that I was not as enamored with as much as others, was the score. I found it a little heavy handed and leading, and at many points I found myself inundated with a combo of brash instrumentals and brain matter that was more than unsettling. But it was jarring, and that is often Aronofsky’s aesthetic. 7.0/10"
    },
    {
      "rating": "6",
      "text": "I don't usually like to use this term to describe a film since I feel as though it's become somewhat of a cliche lately, however, it's really the only one and most fitting that I can think of to describe this film: Oscar bait. Unfortunately, it's pretty tedious Oscar bait at that as well. Honestly, I just wanna cut to the chase by saying that Natalie Portman's performance as the titular character is the best thing the film's got going for it and even that's not saying much, because despite her honest and well-intended portrayal, in my opinion it still managed to come off as rather hammed up and forced many times. As for the rest of the film itself, I honestly felt as though most of its runtime was spent giving us close-ups of Portman's grieving and distraught face as well as her spending well over most of the film whining about how depressed she is and how she wishes she were dead. Overall, this was simply just a very stuffy, snobbish, and above all, Oscar baity film that has undeservedly caused huge Oscar buzz for Portman. I will seriously question the Academy's mindset should they choose to award her an unnecessary second Oscar for an ordinary performance in this ordinary film."
    },
    {
      "rating": "10",
      "text": "Pablo Larrain's \"Jackie\" is one of the most refreshing takes on a biopic in along while, and is without  doubt one of the Best Films of the Year. Natalie Portman's portrayal of Jackie Kennedy is spellbinding, Mica Levi's haunting score is unforgettable, and Stephane Fontaine's cinematography is a thing of beauty. Everyone shines, including the touching supporting cast made up of Peter Sarsgaard, John Hurt, Billy Crudup, Greta Gerwig and Beth Grant. An absolute gem of a film. Well done Mr Larrain. Well done!"
    },
    {
      "rating": "10",
      "text": "Natalie Portman gives an amazing and very moving performance in this film. She does not mimic Jackie Kennedy. She convincingly becomes “Jackie,” illuminates her personality, and leads us all through the horror of the Kennedy assassination yet again and shows us her grief and what we today would call PTSD. But a second aspect is more difficult. Can you really appreciate this film if you didn’t live through the assassination of John F. Kennedy and the period of national mourning afterwards? I found this to be a beautiful, sensitive, and deeply moving film that also gave me a different perspective on American History in both its glory and its violence and also on the human beings who have inhabited the People’s House (the White House) before and after the Kennedy era."
    },
    {
      "rating": "2",
      "text": "I thought this movie was going to be a biography of Jackie Kennedy's life.  It was only about the time during and shortly after the assassination of her husband and president, John F Kennedy.  It would have been much more interesting and entertaining if the movie covered more of her life.  And who knows if it was even very accurate.  Not what I expected, I found it rather boring actually."
    },
    {
      "rating": "5",
      "text": "Anyone a teenager or older in the 1960s remembers the 'age of Camelot\" and its horrific ending on November 22, 1963. The TV scenes from that day, and the week after, are embedded in our heads and the re-enactment of these scenes are the ones that move us the most in \"Jackie\".Natalie Portman, who is being touted as the one to beat in the Oscar race, plays the title role and it really isn't one sustained part but a part of cameos to show her before during and after the death of her husband, the President of the United States, Jack Kennedy (played by Caspar Phillipson).The premise is that Jackie is being interviewed, and she was by Theodore H. White, shortly after his death and burial, by an unamed journalist played by Billy Crudup. It is some question if she was more interested in preserving her husband's name and presidency or was she just a widow grieving for a dead husband and concerned of the legacy her children would deal with.Many of the scenes are really private moments by herself, or with others, and one wonders how much is true and how much is the figment of screenwriter Noah Oppenheim's and director Pablo Larrain's minds.Peter Sarsgaard as Bobby Kenedy, John Hurt as a priest who hears Jackie's thought of the existence of G-D, John Carrol Lynch as Lyndon B. Johnson, who reenacts the famous swearing in scene on the plane as Jackie in her blood-stained stands near him, Max Casella, as Jack Valenti, are all good in their roles but it is Great Gerwig, as Nancy Tuckerman, a loyal aide of Jackie's, that offers the most interesting role and her relationship to the First Lady.Was Jaqueline Kennedy as calculating as she is made to sound regarding her insisting her husband's funeral follow that of Abraham Lincoln's? Was \"Camalot\" something she made up or a real part of her life and his presidency? She brought a certain class to the White House that had very seldom, if ever, been seen there not only with her doing an extensive redecorating job, all done with private funding, and with the Arts, but presenting an image for future First Ladies to try and match or better.Though I wasn't as moved by Portman's performance as many seem to be and it was the showing of indelible moments we saw 53 years ago over and over on TV, and all the printed media, that affected many of us most in the audience, I would recommend this film to any one born after 1945.It is the act of Jack Kennedy's head with his brains pouring out of his head in Jackie Kennedy's lap and her trying to put them back that made me once again hide my eyes from seeing that on the screen and being one of the main reasons I still admire her today.By the way \"Jackie\" has one of the worst soundtracks of music that I have heard on screen in more years than I can remember, except for Richard Burton singing \"Camelot\" from the show he starred in on Broadway. At times I wanted to put in ear plugs!"
    },
    {
      "rating": "5",
      "text": "Highly over-rated, morbid, morose, very limited character study which critics fall for based on subject and tone alone, as the jackasses tend to do.  What separates this theatrical film from a Lifetime channel treatment?  Obscenely graphic dialogue of JFK's head exploding for one thing.  It's utterly inappropriate and doubtful she actually made those comments even off the record in reality.  No this is a typically over-zealous Hollywood screenwriter who made those gratuitous choices and injected that.  He and/or the director chose that emphasis.  What does it do for us, the audience?  Nothing beyond what we already know or need to know.  That's for sure.  It's photographed quite beautifully but the direction with its wall to wall maudlin score, an if not exactly unwelcome but unusual break from the norm, reeks of student film self indulgence.Natalie is good.  Does she deserve the Oscar?  Maybe.  Does this film deserve the praise the jackass herd trumpets?  As usual not even close."
    },
    {
      "rating": "10",
      "text": "What’s it about?An intimate portrait of stoicism, pride, and ego, Jackie is an imagining of the Life magazine interview with Jacqueline Kennedy (Natalie Portman) covering her dignified reaction to the traumatic events she experienced in November 1963, and how she created the legend of Kennedy’s Camelot from her unabashed desire for a meaningful legacy.What did I think?The culmination of a thought-provoking script, Portman’s mesmerizing portrayal of the iconic First Lady, psychological storytelling technique verging on poetic, and an innovative and organic soundtrack, Jackie delivers a profound exploration of how truth is manufactured and interpreted.Bottom line: Just give her the Oscar already."
    },
    {
      "rating": "7",
      "text": "Natalie Portman adds another stellar performance to her resume, but the movie failed to meaningfully delve into the behind-the-scenes moments that were so deserving to be explored in the first place."
    },
    {
      "rating": "1",
      "text": "I'm a fan of Natalie Portman but her impersonation of Jackie was so annoying we turned off the movie after 10 minutes. Her accent sounded like a screeching cat on Zanax. Too bad OnDemand doesn't have a refund policy."
    },
    {
      "rating": "7",
      "text": "While meticulous in its re-creation of the events surrounding the death and funeral of JFK and although superbly acted by Natalie Portman in the lead role, this different take on the biopic genre feels like it's lacking something to pull it all together. Viewers come away from the film realizing what a complex individual Jackie Kennedy was, though we're not much closer to truly understanding her than we were before going into the theater. The somewhat-jumbled handling of the seminal events and their aftermath doesn't always work, either, sometimes leaving viewers a bit confused about the timeline. All in all, a noble attempt at profiling an enigma that doesn't quite hit the mark."
    },
    {
      "rating": "6",
      "text": "#NataliePortman = stunning in @jackiefilm yet experimental artistic take with odd editing, sound design & music hurt film = #cinemascene \"C\" https://soundcloud.com/wgwgdotorg/jackie-blindside-movie-review"
    },
    {
      "rating": "8",
      "text": "I mostly fell for this exploration of grief, grace and mythmaking. Even when it was a bit too on the nose (the faults mostly lie in the wraparound story). It's concerned with how someone copes in the spotlight, how someone can make a legacy from the idea of a thing, how a person is more important than their legend but also how their legend shapes how that person is forever perceived.It's telling in the universe of the film that Jackie herself is first obsessed with redesigning the White House in what is ostensibly a superficial act of decorating, but then is revealed to be, in reality, attempting to reflect more than the legends of past presidents but also the men who shaped them. A reminder that all legends start with a simple human being doing things only a person can do. A grandiloquent gesture of political humanity for a house full of ghosts.There's a lot else to like here. Natalie Portman's performance does indeed capture Jackie Kennedy's persona, but also the legend of her and the real woman behind it all. Watching the real White House tour video on YouTube showed me how accurate Portman's breathy accent and meticulous demeanor really were. Beautifully composed, with notes of elegance and grotesqueness in equal measure. And a wonderful, tragic, near other-worldly score by Mica Levi."
    },
    {
      "rating": "7",
      "text": "Jackie is the new movie for Natalie Portman to shine and the first excursion of Pablo Larraín outside Chile. It tells the story of Jacqueline Kennedy recalling the facts surrounding his husband death. The approach chosen is far away from the common biopic, it’s not center in politics, the president’s figure, the attack or the memorial. The focus is set in Mrs. Kennedy fighting for justice, not only for JFK, but also her children and even herself. Because of that the development of the story is nonlinear, revealing cunningly the clues about the actual status of Jackie. Natalie Portman is breathtakingly amazing, giving a performance not as complex as Nina in Black Swan; however it is important to highlight the portraying of two characters fighting inside one person, both of them in mourning, the widow of the ex-president of the US versus the mother of two children expelled alone into the world. In parallel we notice a conflict regarding faith and religion. The influence of Aronofsky as producer is clear in the obsession of the protagonist to fulfill her quest and similar characteristics of Larraín’s previous works are seen, in the way that through a single individual, there is an evaluation of a political critical situation. Great job with score and cameras in first plane, for a more intimate relationship with the viewer."
    },
    {
      "rating": "5",
      "text": "A mediocre movie. Perhaps the best aspect is Natalie Portman's portrayal of Jackie Kennedy, but there were better performances in the past year. Overall, there have been too many movies made of the Kennedy presidency and his assassination, and we didn't need another one. This one is from Jackie's perspective, but it really isn't that revealing of anything we didn't know already. The worst thing about this film is probably the casting. Apart from Portman as Jackie, nobody else is credible."
    },
    {
      "rating": "9",
      "text": "Nobody will ever understand Jackie Kennedy and the pain she went through after the death of her husband. While we all have lost loved ones, few have lost a spouse. Even fewer have lost that spouse while the First Lady of the United States and none of those women were alive to be there for Jackie. She was isolated and all alone. Nobody could comprehend her grief and nobody, thankfully, can today. Sitting next to her husband driving through a parade, he is shot and his mangled head rests on her lap and she sits there with his blood splashing on her body. In this eternally lasting image, few have sat down to truly examine what that day and the succeeding few days were in the mind of Jackie Kennedy. However, in director Pablo Larrain's intimate look at her mind and grief in those days, he finds beauty, pain, and agony. But, above all, he finds a woman with so much strength, so much grace, and so much power, it is chill inducing. Punctuated by a powerful and articulate performance by Natalie Portman, the film leaves you in emotional ruins repeatedly and is an entirely beautiful, moving, and stirring portrayal of the strongest and hardest week of Jackie Kennedy's life.Upon its release, Jackie gained notoriety for its unique structure. It is not a biopic at all. Shot with grainy documentary style footage, the film is an inside look at both Jackie's life after her husband's death and the descent into madness experienced by the country afterwards. However, that is not what makes it unique. Rather, the film is lyrical and poetic. Its dialogue is overwrought, begging to be quoted. It feels too prim. Too precise. Too detached from reality. Yet, that is entirely the point. This is no biopic about Jackie Kennedy. It is an album composed of \"songs\" about her life and key defining moments: the death of her husband, the televised tour of the White House, planning for the funeral, and talking to a priest. Complemented by interludes courtesy of an the famed interview with Life Magazine, the film takes on a poetic approach to telling its story and this is incredibly irregular for the genre. As a regular of the poetry of the storytelling, it is nonlinear and it  shows scenes from those aforementioned moments before and after the assassination in varied order.This structure truly lends itself to the way in which the film is quotable, but overwrought. Its dialogue is aching to be recognized as powerful. As timeless. As stirring. Yet, it is all of those things. He may feel a tad forced in this regard, but it works. Matching the hypnotic, dream-like, and thoroughly lyrical nature of the storytelling, the dialogue feels mystical, other worldy, and unattainable. Jackie's words are so well chosen, as are those of her counterparts. In this, the dialogue catches the class, the grace, and the power with which women in her position are expected to act and speak. Her words are well chosen for fear of portraying herself and her husband negatively. In her interview with the journalist (Billy Crudup), she unleashes at times and becomes less formal, but never allows him to print these words. In these moments, she becomes wordier. With those she acts entirely formal around, her words are limited and more carefully selected. While I say the film is overwrought, it is not to detract from the film. Rather, it is perfectly elaborate in its limited words and prim/proper dialogue. Each word and each line feels quotable and verbose.This verbosity is certainly what led the Kennedy's and others in power to seem unattainable. In particular, their life was a fairy tale. It was spectacular, overwhelming, and extravagant. Their wealth was obscene and otherworldly. It embodied regality and the belief that this was the royal family of the United States, if there ever were to be one. Larrain, a Chilean-born filmmaker, has managed to eloquently and brilliantly captures this cult of personality surrounding the Kennedy family and captures it so well, in fact, that the film has been criticized for the same reasons Jackie was criticized in her life. It is too cold. Too distant. Too reserved. Yet, it is for these elements that the film is so brilliant. Not only is it poetic and gorgeously crafted narratively, but its feeling and emotions as a film keep the audience at a distance. It never hopes to understand Jackie and her mindset after her husband's death, as that is an impossible enterprise to undertake. It is simply something that could never be accomplished. As such, instead, Larrain's film reduces intimacy. He uses grainy documentary style footage, old school television footage, and has a cold and carefully orchestrated Portman in the lead role. She embodies Jackie Kennedy to the very last detail both in her manner of speaking, walking, and body language. It is a film that is cold and dead behind the eyes, shutting out the world from every hoping to understand the pain its main character underwent and preventing us from fully grasping who she was."
    },
    {
      "rating": "2",
      "text": "This movie was extremely boring and for all the hype about Natalie Portman, I thought her performance was flat and uninspiring.  The creepy music was over the top, as if it was needed entirely to convey tone rather than the acting or storyline. Billy Crudup was the most interesting part of the movie.  Don't bother with this one."
    },
    {
      "rating": "7",
      "text": "The four day episodes after the tragic event!An unusual biographical film. I have seen films about JFK, either based on the real or just fiction, but this one was entirely focused on his wife. It sets in just weeks after his assassination and soon goes back to that day and the following to tell us how Jacie Kennedy handled the bad time. From tragic event to conducting the final rites, that four days she has to fight for the right decisions. All these revealed by her to a reporter in one of the following week. Remember this film was originally meant for an HBO mini-series and then they turned it into a feature film. That was the risk taken by the filmmakers, later it paid off well.I never knew who was Jackie, so when I saw Portman's performance in the opening stage, I thought she was overdoing it, the accent and imitation. But after some progress in the story, I got used to it thinking that's how it would be. Yeah, she was excellent and she deserved that Oscars nomination. I wondered what was the source, but after the research I came to know that it was based on the magazine interview by the same reporter you would see in the film. The Chilean director's Hollywood debute. He has done a good job. Also one of the final films of John Hurt in which he was in a small role. Worth a watch for it is being unique and especially revealing some unknown truth behind and/or after death of JFK.7/10"
    },
    {
      "rating": "6",
      "text": "Her way of speaking is very off putting at first, it takes a while to get used to. I like the score. The film is intriguing but it feels too long, it really drags in the middle"
    },
    {
      "rating": "8",
      "text": "\"There comes a time in man's search for meaning when he realises that there are no answers. And when you come to the horrible and unavoidable realization, you accept it or you kill yourself. Or you simply stop searching\".I'm lost not with words, but what I just watch. What a cold and haunting film that takes grief further like another best picture nominee we know. It's pretty scary and I can't explain why. The gloomy atmosphere and how psychological it can be, you could call it a horror film. Mica Levi amazing score that still plays in the back of my head after a few days, is one key factor of the horror-like atmosphere. Or it might be the cinematography which was just terrific and well stage for some truly unforgettable moments.How the hell didn't Natalie Portman not win her second Oscar for this. Emma Stone was great, but better than this? HELL NO. It was captiviting watching her carry the emotional state of this tragic event. Especially the quite scenes and her mental breakdown.Another performance that shouldn't be overlooked is John Hurt and Peter Sarsgaard. Both actors I've rescpted for years and some of the best scenes came from them. Sarsgaard carries an emotional state as well, but keeps it hidden and tries to be strong through a difficult time, although his heart is breaking too. The scenes between John Hurt and Natalie Portman was so engaging and it's a personal highlight for me. Great send off to a beloved actor.I guess sometimes we need to stop searching for questions with no answers in our darkest time. Just wasting our little time."
    },
    {
      "rating": "8",
      "text": "Jackie is a wonderful Biography/Drama film. The events are beautifully realized and I loved the Biography feel to it. I think If people are willing to give it a chance people would like it. This is Natalie Portman's Oscar film. If she does not win the Oscar for best actress I will be extremely disappointed because she deserves it."
    },
    {
      "rating": "9",
      "text": "No More Tweed & Puerility; Larraín & Portman Reinterpret The Truth That Almost No-One Knows About the American CanonChilean filmmaker's second movie in this same year is ambivalent. Due to his ambitions and wills based on national politics, he has irrevocably consolidated as one of the most sumptuous, subversive and intransigent du jour; an individual inmost influenced by the issues of his unstable country. It isn't a great heroic deed detect why Larraín selected the annals of one of the most conspicuous ladies of the 20th century, having as reference his exclusive insights and previous film, \"Neruda\", work deserving of diverse opinions, which corresponds in the making of its pith with the film concordances such as the right rupture to common narrative skeleton for a biopic,the materialization of a public political personality's chiaroscuro, start from the most excruciating adversity in order to put together a wide real-life report or give a good-condition appearance to global people denoting part of what we're today. Independent of the opportune or extemporaneous, Larraín works with leading characters who set contemporary society origins up in exquisite form, allowing with his works that a vast compilation of filmic constituents reflect bravery, vigor, and authenticity. Authenticity, that's the convincing motive that the movie has, scrutinizing and exposing the frustrated true fairy tale of Jacqueline Lee \"Jackie\" Kennedy Onassis, the First Lady, and also the first widow. The story has a double-edged sword to concoct cardinal narrative arc throughout the film with full complacency, given that it's through American political journalist and historian Theodore White (Billy Crudup) from LIFE magazine that the film gets its main motor to start a glorious infernal and quasi-emulated lineup about what came up before, during and following to the assassination of the 35th President of the United States of America, however, it's appropriate to clarify that the plot isn't deposited in the rhetoric of the contingency, but it emphasizes widely personal trauma falling on the shoulders of his spouse. They say that the more miserable tragedies are which emerge without warning, for this New Yorker the worst tragedy just germinated on November 22, 1963.Here magnanimity works like a Swiss watch, there is no room for blunders, despite there are a few blunders; the film is a unit, but can also be dissected. For example, Larraín vivisects this woman at his whim, playing with the chronology like a time-space logogriph, goes from glorious moments to heart-rending memories. While he connects cathartic circumstances, shapes the leitmotiv; He manipulates a composed timing where Portman contemplates undaunted the euphonic melody of a violin or contemplates undaunted her husband's shattered skull on her lap, and then an agonizing dance unfolds which boasts of the scarlet stuff going down her legs or those spoils of the dura mater of the former President which viscously settled on her spotless face, a broad grin to fragility of every human being.In addition to superb English-language directional debut in the mecca of cinema made by Paul, the celluloid treasures an optimal and outstanding female lead, a woman who has cleared out everything in prestigious film festivals, she's Natalie Portman. Portman has retained a record quite high in roles that have been granted nominations and awards for her throughout her great acting life (\"Black Swan\"), nevertheless, this year she has raised up such mark with one of the roles more demanding, complex and laborious due to the impending restrictions of improvisation in this character. It's illogically sensational how she leads emotions of her character by a roller coaster, moves dazzle majestically with beautiful closeups of Stéphane Fontaine, which tempt us with power cocktails, tarnished colors, shadows and lights cinematic.It seems that Larraín neither creates a film for money nor elates litigants critics, he manufactures film because he has a defined purpose to spread with his stories, communicating a sweet or bitter truth, to produce awakenings or merely to dispel inane realities. Starkness, accuracy, viscerally and irregularity, that's what delivers the Chilean filmmaker's \"Jackie\", a feature film is assiduously degraded due to a few screenplay disorientations, abrupt pace changes, and wrong narrative elections. It gives the impression that \"Jackie\" is a resource for a mass of photographers, cinematographers, composers, actors, sound editors... etc. show all their potential, their ideas and their powers with the story of the First Lady. At any rate, Jacqueline entrusted us her legacy as well as her spouse, a legacy which is collapsing with the passing of the years, and to name one example: who's the current President of America?It's about time someone replaced the banal pink tweed by Jackie's real powerful story, an idol who became universal at the expense of her own joy."
    },
    {
      "rating": "10",
      "text": "This is the best performance of Natalie Portman to date. The movie is only 100 minutes long and it doesn´t need more time to get inside us. Jackie is very well directed by pablo larrain. This is not totally a biopic, they used a lot of imagination to do this movie, if i didn´t investigate about the movie and figure this i could actually believed that all of this happened, exactly as they told us."
    },
    {
      "rating": "10",
      "text": "Hauntingly beautiful. I honestly didn't expect much when I put this on, but I was hooked from the start. The music, the scenes, the acting, there is not one thing out of place in this movie, they all work brilliantly to tell this story. It was devastating and dark but so engaging. The power and strength of Portman make this a film worth watching, that will stand the test of time. Fantastic movie!"
    },
    {
      "rating": "10",
      "text": "A wonderfully acted, surprisingly intense and smartly directed entertainment that offers an alluring peek into a beloved American public figure's private world."
    },
    {
      "rating": "8",
      "text": "I really enjoyed this film. I am a history buff. I learned a lot of Jackie Kennedy's secrets.One of them was her smoking habit. A journalist interviewed her after the JFK assassination.Natalie Portman's performance was amazing. After you watch this movie, you will google about Jackie Kennedy."
    },
    {
      "rating": "8",
      "text": "\"Perfect people can't change. Jack was always getting better... stronger. Sometimes he would walk into the desert alone just to let himself be tempted by the Devil.\" It is this line with which Jacqueline Kennedy, with outstanding feminine empowerment answers the reporter about his late husband's flaws. A line which makes perfection seem more like a flaw in itself. It is a pattern which this movie embraces. The pattern of presenting the First Lady as a defeated human person amidst the chaos of politics and at the same time a powerful woman which faces suffering with pride and acknowledgment. It is easy to see this, as Pablo Larraín centers almost every single scene around its main character creating almost a Shakespearean monologue about loss, love and spirituality. Sure, the movie tends to delve into slight pretentiousness and annoying blabbering after the first hour but, immediately, it is revitalized by Portman's outstanding performance and the director's natural affinity for heavy poetic flamboyance. Indeed, Larraín does not offer us a documentary-like behind-the-glass view, but rather a dissection of the personal trauma of the ones closest to JFK. It is almost ironic, as it feels like an American filmmaker could not capture this event the way it was made here."
    },
    {
      "rating": "10",
      "text": "Outstanding Natalie Portman in the shoes of a mourning First Lady and her struggle for carry on the tragedy. The epoc recreation is excellent and well detailed. Take a carefully for minimalist score of Mica Levi, and John Hurt in one of his last roles."
    },
    {
      "rating": "7",
      "text": "Interesting look inside the legend of Jackie Kennedy. Well done movie that is quite dry and slow. The movie is held up by Portman's astonishing performance. I don't know that his movie could have ever been made without her."
    },
    {
      "rating": "5",
      "text": "JFK has been assassinated and the First Lady (Natalie Portman) is left to pick up the pieces. We get to see what she must have been gone through. I know nothing about the authenticity of this work but the movie looks good and it's always interesting to see the human side of the great historical figures. On this count, „Jackie“ delivers. All the doubts, fear, frailty and pettiness you can watch, and then some.Portman gives a sharp nuanced performance and has a strong physical screen presence, especially for a widow broken down in grief and fear for the future.There are a lot of good actors involved, including Billy Crudup, Peter Sarsgaard as RFK, Greta Gerwig, Billy Crudup, John Hurt, Richard E. Grant and John Carroll Lynch as Lyndon Johnson. But don't expect a strong ensemble movie, it's all about Jackie. Everybody else falls to the sidelines, ready to serve or interact when the main character when screenplay says so. But the acting’s impressive enough all around. So, everything good so far. But somehow.. the whole result is not. Sorry to put it bluntly but it felt boring as **** All Oscar-hunt and no soul. This is the most boring \"good movie\" I have watched since... well, two weeks or so, when I saw Martin Scorsese's \"Silence\".The 99 minute movie feels much longer, mostly because of its pompous style and no readiness to delve deep into any of the characters, or the experience of being human in general, which the story is actually about. The only time I really felt the experience truly coming alive for a moment was near the end, thanks to the great late John Hurt as priest councelling the First Lady.„Jackie“ was nominated for 120 movie awards and won 53, mostly for Portman’s acting work but some for music or costumes. There were one Golden Globe (Portman) and three Oscar (Portman, costumes, music) nominations but zero wins. Portman gives a sharp and nuanced performance, worthy of all her awards, although I would have given Oscar to Isabelle Huppert in „Elle“, for even more exciting role. But the real winner was Emma Stone in „La La Land“ of course. You know, just saying.\"Jackie\" is the kind of project which makes you doubt yourself as a movie lover. You see all the quality work on screen and wonder why actually you're not liking it more. It must be you, right, not being able to cherish all the good movies, right? Well, no. All the competent acting or dark and ominous atmosphere inspired by Malick, Aronofsky or Shyamalan can't compensate for a movie having no soul.So, where's the soul? Who knows. You can't always stay on the path with the heart just because you would like to. It goes to screenwriters and moviemakers too."
    },
    {
      "rating": "9",
      "text": "Jackie is a beautifully shot, well-acted movie that is perfectly executed.Acting: Natalie Portman was phenomenal, and a great fit for the role. She may have only made a few different faces throughout the entirety of the film, but she portrayed Jackie perfectly. The entire cast was amazing as well. Peter Sarsgaard was very good especially in a few scenes where he had breakdowns. John Hurt was in some of my favorite scenes in the entire movie as the priest. Natalie Portman definitely deserves the Oscar (more than Black Swan) but there are plenty of other deserving actresses that I would be okay with if they won instead.Cinematography: Jackie is beautifully shot, and the cinematography is one of my favorite aspects of the entire film. It is up-close and personal throughout, making it more intimate and like you're actually there. There are plenty of scenes where there are very little cuts, making it feel all the more natural and realistic. I've seen plenty of people say that the camerawork felt claustrophobic, but I got a more intimate feeling that blended perfectly with the tone of the film.Plot: Many people were expecting a basic biopic of Jackie's life, but it basically takes place during the few days after JFK is assassinated. So don't walk in the theater expecting it to be a typical biopic on her life. I enjoyed the way the story unfolded as well; there are about three things going on basically. One is an interview with Jackie, one is her touring the White House, and one in the \"present time,\" and there are other smaller ones like her talking to the priest. They all blend perfectly together, and don't feel convoluted or confusing at all. I also enjoyed how the movie didn't focus on making the viewer feel as sad as possible and in tears by the end, like Manchester by the Sea. The point of Jackie was not be in tears about how sad the event was, but to focus on how it specifically effected Jackie, which is executed perfectly.Screenplay: The screenplay is well-written and at times deep. To make an hour and a half movie that's mainly talking is always hard to do, and this movie pulled it off great.Score: The score is haunting, though at times a bit repetitive. There's one signature sound that plays over and over throughout the movie. However, every time it comes back it is still as haunting as the last time. The score is beautiful and atmospheric, and sets up a perfect tone for the movie.Overall, Jackie is a good movie that, in my opinion, flew just a bit under the radar, since it did not receive a best picture nomination. In my opinion, this movie deserved to be nominated over Hell or High Water."
    },
    {
      "rating": "2",
      "text": "The movie set hours and days after the assassination of JFK portrays his young widow Jackie amidst the turmoil and the tragedy of his death. The film is a mix of memories intertwined within one interview, rather than a flowing story. Portman looks great but fails with the accent of Jackie she appears more wooden than broken. So much more could have been done but wasn't ."
    },
    {
      "rating": "9",
      "text": "\"Jackie\" is a captivating movie magnifically portrayed by an Oscar winning performance from Natalie Portman. The gloomy and grey atmosphere created by Larrain's direction, perfectly compliments with the sublime musical composition from Micachu. Flawlessly achieving the connection of a true perspective from the former First Lady, and the curious, as well, morbid audience, eager to know more about that sorrowful episode of American history."
    },
    {
      "rating": "3",
      "text": "Seriously ? This film is so boring ! nothing concrete happens and i'm very disappointed. The pictures are beautiful but for too long there is nothing happening ! We sympathize with the main character but the film revolves around : nothing! nothing happens. She just wonders how to do her husband's funeral, that's all. So disappointed ... Don't waste your time."
    },
    {
      "rating": "7",
      "text": "This movie accurately reconstructs the 60s and the horrifying assassination of John F. Kennedy. It is important to see Jackie's grief and struggle. But the portrayal of her was not as accurate as it she could be. She was not stiff on TV and she did not talk like Carol Channing. I know, I saw the White House tour live. The emotionality Portman brings to the role is intense and stirring. But so much else is manipulative and unconvincing."
    },
    {
      "rating": "9",
      "text": "This was truly aesthetically pleasing. The production design and cinematography compliment really well the amazing soundtrack and Natalie's performance that was pretty great, I even got used to her not so good accent."
    },
    {
      "rating": "8",
      "text": "Natalie Portman's performance in Jackie is very compelling, but the movie overall is only decent.  Jackie recounts the tale of the end of her time in office and the death of her husband.  Portman made the story very dramatic and compelling.  The movie overall could be a little boring at times.  Overall, I would give it a 7.5."
    },
    {
      "rating": "5",
      "text": "grieved over life and death..JackieThere are few dramatic sequences installed so perfectly that it aches to see such a fine art go waste by under this huge pile of troubled mourning that neither leaves the character nor the audience to inhale for a moment. The feature is rich in costume and make-up design but unfortunately fails in background score and product design. The writing attempts a lot to grasp the viewers' attention through various perspective that may change the opinion but the real culprit in here is the premise that is restrained and something whose boundary can't be broken which is a downer. Pablo Larrian; the director, has done a tremendous work on executing this eerie character driven feature where the editing might not support it thoroughly. Natalie Portman is flat out amazing on her depiction and is supported brilliantly by a great supporting cast like Billy Crudup and Greta Gerwig. There are lots of bits and pieces that are thought-provoking and something that can be explored upon but if considered as a whole package, it shatters expectations. Jackie is a passion project that is grieved over life and death but the amount of time and the path it chooses to convey its message makes the audience work for it and frankly at the end of the line it isn't worth to that extent."
    },
    {
      "rating": "10",
      "text": "Natalie Portman, como siempre, robándose cada minuto de la película, excelente actuación merecedora de un Oscar. Sin duda, una de las mejores mujeres en la industria del cine en la atualidad. Con cada película, Portman la hace suya y nos muestra una variedad de sentimientos. Excelente diseño de producción y de vestuario también"
    },
    {
      "rating": "10",
      "text": "'Jackie' the movie adaptation of the former and assassinated President, J.F.K was a very interesting film. At times, I couldn't help but feel as though I was standing in the very room in which Jacky Kennedy's (played by Natalie Portman) interview was taking place. Every emotion that slides off her face leaves you mystified, as she depicts the story of her husbands death. Although the movie isn't without it's faults, taking a moment out of your life to experience with film, with leave you feeling as if it was time well spent."
    },
    {
      "rating": "6",
      "text": "Natalie Portman is great as always but the film feels like it is missing something."
    }
  ],
  "recommendations": [
    "the_father",
    "the_last_king_of_scotland",
    "the_danish_girl",
    "american_beauty",
    "spencer",
    "judas_and_the_black_messiah",
    "the_master",
    "the_theory_of_everything",
    "belfast",
    "21_grams",
    "melancholia",
    "fences",
    "12_years_a_slave",
    "darkest_hour",
    "spotlight",
    "carol",
    "legends_of_the_fall",
    "the_impossible",
    "manchester_by_the_sea",
    "the_imitation_game",
    "sicario",
    "anna_karenina",
    "philadelphia",
    "lincoln",
    "first_man"
  ]
}