{"id": 4340, "title": "Jackie Brown", "starring": ["Pam Grier", "Samuel L. Jackson"], "runtime": 154, "genre": ["Crime", "Thriller", "Drama"], "description": "Jackie Brown is a flight attendant who gets caught in the middle of smuggling cash into the country for her gunrunner boss. When the cops try to use Jackie to get to her boss, she hatches a plan — with help from a bail bondsman — to keep the money for herself.", "releaseYear": "1997", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/ewbLUXvm4riZL0aepy90o0vMesn.jpg", "categories": {"plot": 6.8, "acting": 7.3, "ending": 6.857142857142857, "soundtrack": 7.166666666666667, "cinematography": 7.5, "familyFriendly": 3.0, "funny": 8.5, "action": 7.555555555555555}, "reviews": [{"rating": "10", "text": "I agree that this is a vastly underrated movie and as Roger Ebert asserts, anyone who complains that it is too long has developed cinematic ADD. Beautifully written and developed characters, suspense, believable but amazing turns and twists throughout. It is just more subtle than Reservoir Dogs and less manic than Pulp Fiction. Pam Grier is a real woman, and this is a great movie."}, {"rating": "10", "text": "Easily Quentin Tarantino's most underrated film, it had hilarious scenes mixed with great dialogue and soundtrack. The acting from everyone was superb especially the more quirky ones."}, {"rating": "7", "text": "It is far from being my favorite Tarantino film, but the dialogue and story make up for its unusually slow pace for a Tarantino film."}, {"rating": "8", "text": "Jackie Brown is a lesser Quentin Tarantino movie in name recognition only.  It has just as much bombastic dialogue, bad-ass characters, and beautiful camerawork as all his other films.  The only difference is that Jackie Brown is far less violent, making it a perfect recommendation for those wanting to see a Q.T. flick but have traditionally given his movies a wide berth due to all the blood and guts."}, {"rating": "9", "text": "This was a more mature and thoughtful film than the over-praised \"Pulp Fiction\". Violence was treated more seriously, and Tarantino took time in this one to explore the motives of the characters. The tale was really about everyone in the tale, not only Jacki Brown. All the actors were convincing, especially Robert Forster. Bravo !!"}, {"rating": "8", "text": "A more mellower Tarantino film, Jackie Brown is a faithful tribute to 70's Blaxploitation films with Pam Grier starring, still looking amazing after years. While lacking in violence, Jackie Brown's strong point is its slow but carefully written plot but only appeals to the most dedicated and the most attentive. Acting is brilliant as in all of Tarantino's films accompanied by stylish directing and smart writing."}, {"rating": "7", "text": "Jackie Brown is a solid effort from Tarantino. The dialogue has the usual flair and is occasionally laugh-out-loud funny. The plot is fairly interesting and the performances are good. That said, there's something missing in Jackie Brown that restrains it from achieving the same excellence as Pulp Fiction or Reservoir Dogs. I can't put my finger on what it is exactly but I do know that it isn't quite in the same league."}, {"rating": "6", "text": "Posted on 5/26/13 08:04 PM\rQTs third film delivers none of the thrills you would expect to get from his work however this film does deliver enough twist and turns that make this film enjoyable and not a such a waste of time"}, {"rating": "6", "text": "After all is said and done, this film just isn't worth 2 and a half hours of anybody's time. Even Tarantino's brilliance and the excellent cast couldn't turn this moronic plot line into something compelling. I don't know what on earth possessed Quentin Tarantino to choose a story like this to do a movie."}, {"rating": "10", "text": "Only these words, written by Roger Ebert, can accurately describe how I feel about this film (and many other films too): Those who say it is too long have developed cinematic attention deficit disorder. How on earth you could call this masterpiece of writing, directing and acting overlong and boring I have no idea. Did you have too much red cordial before seeing the movie. Sometimes audiences have no idea what they're talking about, see The Green Mile, but in this case the people are right and the critics are just plain stupid."}, {"rating": "7", "text": "Although well directed Jackie Brown fails to be anything new. It starts slow and it never really speeds up like a typical Tarantino film does. It has no major flaws per say it just isn't anything special. It is entertaining and there was no problem with the acting but as a film it just didn't live up to it's potential."}, {"rating": "9", "text": "Easily my favourite of Tarantino's pictures--it showed the world he actually had a heart and could make something truly original, rather than simply a combination of his favourite set-pieces from a particular genre."}, {"rating": "2", "text": "The first 45 minutes was golden. The cast is great, The story progresses nicely and I honestly have no issues with it. It's the next hour and forty-five minutes I have an issue with. The pace just comes to a crippling halt, We are given long bouts of characters just sitting there talking to each other, Nothing really happening with the story is going on during this time either. It's just dialogue filled scenes that bore you to death and it sucks. This movie should have been edited down by another half hour or more. There is way, way, way too much filler here and it doesn't do what could have been a decent movie justice."}, {"rating": "4", "text": "I can certainly see what Tarantino wanted to do--explore the characters, but these characters are so incredibly mundane that it's just painful at 160 minutes. I think Tarantino realized this and just padded it out, which is why every shot in the movie is held to an absurdity, which probably made it impossible to edit to something reasonable given the lack of weight in the material. The characters are boring rehashes (a waste of great talent), the dialogue Tarantino has so much obvious talent for is mediocre and the film is a good hour too long (maybe even more). What a shame."}, {"rating": "7", "text": "\"Jackie Brown\" is a fresh departure from Tarantino's other films (which is probably why it's the least appreciated), as it plays out mostly as a straightforward crime drama. However, all of the director's trademarks are still there - much of the movie is spent focusing on minutiae and non-progressive dialogue, though the film as a sum of parts isn't quite as fulfilling as his other features."}, {"rating": "7", "text": "I pretty sure I liked it. The acting, dialogue, and camera work all really good. The film delivers an engaging story that is sold on the presentation, acting, and dialogue. The thing about Tarintino is that his strength seems to lie in characters and dialogue, which are the best thing in that film. Tarintino isn’t good at writing story. The film’s plot isn’t bad in fact it is quite suspenful and engaging there were just times when it felt convoluted to a point where I didn’t get it and the plot feels quite too similar to Reservoir Dogs. It’s a well made film I just hope that Tarintino lets the story take a backseat next time, although knowing what his next film is I know that isn’t he case."}, {"rating": "6", "text": "This quirky film had a solid cast with some great acting, but that was the best thing going for it as storyline wise I was a little lost and even bored at times. I quite like Tarantino's films but this isn't one of them, and even though I can appreciate where he was going with this one and I'm sure others liked it, I simply didn't as it's just not my type of movie I can sit back and enjoy. Props to Pam Grier who played a great female lead though."}, {"rating": "4", "text": "The start of this movie was excellent, a classic Tarentino brutal fun ride but the drawn out build up and uninteresting characters bring it down to a mid level movie."}, {"rating": "8", "text": "Possibly my favorite director of all time, Quentin Tarantino adapts Elmore Leonards novel Rum Punch for the big screen. I haven't read Rum Punch but according to people who have this is a bloody good adaptation. Full of contrasting characters who deliver sometimes chilling sometimes hilarious lines and always keep your eyes fixed to the screen, even in the scenes which regrettably are a bit slow moving. Much like Pulp Fiction the movie is mainly enjoyable because of the impeccably written dialogue and one liners, Samuel L Jackson returns as another foul mouthed black skinned murderer and yes he says  a lot in this too. However he is not the title character Jackie Brown who is played ironically by Pam Grier, as a comeback role, most well known for the blaxploitation movies of the 60's and 70's such as Coffy and Black Mama. Robert De Niro is brilliant as the almost totally silent character Louis Gara the sort of sidekick to Samuel L Jackson, in one of his few self parody roles of the 90's. While there are many others which I could mention (who all help you to become immersed in the movie) these are the three main characters even if they do not get along well. To be honest the only real flaw with Jackie Brown, apart from a few slightly boring scenes isn't even good or bad. In my personal, and possibly wrong, opinion it's a bit to much like Pulp Fiction. From the characters to the retro soundtrack and segments everything is a bit more of the same. Yes it is still interesting because no one can deny how incredibly entertaining Pulp Fiction is, but Tarantino doesn't venture into any new genres or territory. A few years after the release of Jackie Brown he did, but it was a little to late. Definitely doesn't ruin the whole movie though that is certain. I found Jackie Brown to be nowhere near as good as Pulp Fiction or Reservoir Dogs. But ideal entertainment for a movie addict like myself and many others on this website, how easily Tarantino makes you feel emotion for the people involved in the plot is amazing. I was even feeling sad at the failure of Samuel L Jackson's plan despite him being a murdering pot head gun selling bastard. Whether or not it's a masterpiece like many critics claim, isn't for me to decide I actually think it's not far off. A brilliant homage to the blaxploitation genre, but also a brilliant crime thriller full of awesome lines and killer characters. Jackie Brown gets 4 stars from me."}, {"rating": "8", "text": "Tarantino's least violent movie, Jackie Brown has a more complex plot and more character interaction, compared with Pulp Fiction's shoot em up, blood splatter tendencies. Jackie Brown is good, and it keeps you interested, but it could be a little shorter and some of the dialogue could be cleaned up a bit."}, {"rating": "9", "text": "Another Excellent Tarantino FilmJackie Brown is another great film from Quentin Tarantino."}, {"rating": "5", "text": "Jackson is hyper about it and De Niro is taking it slow. this choreography is more focused on stunts than authentic dance.Jackie BrownTarantino is conning us. Literally. With a sublime texture scraped off from these characters, his display of the boneless flesh is too flamboyant to break or shock you. The co-writer and director, Quentin Tarantino's fourth film is adapted from the novel Rum Punch written by Elmore Leonard. And this adaptation unfortunately didn't go well for Tarantino. Busy in his own state of mind and comic timing, Tarantino is either leaping over stuff or overstretching stuff. This results in a bizarre pace for the film, something that takes us plenty of time to fit in into.And clocking at more than two and a half hours, the flips and turns that Tarantino so effortlessly whispers in the script could barely be reliable enough to fiddle us with these many hokum events. And yes, it does work when it comes to pump our heart fast and scare us through one-liners by Samuel L. Jackson who states it without blinking his eyes. But that could have easily been carried off, without individually introducing these characters in the narration.By the way, no one hypes up the name of the character like Tarantino, before they even arrive or impress us, the flown rumors are so bedazzling that you ought to cheer up when they finally enter the screen. Jackson has got the coolness of the all the plot points, with a gold membership card, he has access to every track of the film and yet, it feels like he never fully squeezes it out from the script. In fact, any of the cast member, they never come alive on screen, with such a caliber of cast, from Robert De Niro to Michael Keaton, you'd think you would be moved by them colliding on the screen and instead you have to rely upon Jackie Brown who will and does cheat you; she is told to."}, {"rating": "7", "text": "The most not Tarantino Tarantino movie, yetI enjoyed the suspense and the wait, the mystery until it wasn't rewarded. It didn't had the action, the gore, violence that his movies have. The cast was big and I hoped that De Niro had a bigger involvement. Samuel's and Forster's performances were great, not bad Pam also, but the story didn't rose to the boiling that they were cooking all these +2 hours. So far, Hateful Eight and the others as personal preferences, yet. Kill Bills next! Peace!"}, {"rating": "6", "text": "Jackie Brown is a fairly good and watchable movie - it's got that Tarantino staple mark of building characters so you really get to know them, and doing this helps blur the simple line usually found between 'goodie vs baddie' for you to appreciate the film from a few different angles. It breaks tradition with the typical young, virile lead roles replaced by elder, more realistic characters and deserves recognition for doing so as it gives the  film a more authentic flavour. It also delivers a nicely sequenced last 1/4, which flows well and finishes the film off satisfyingly. The trouble is, there's too many boring bits in it and it's slowly paced - the middle 3rd seems to drag especially. It's not a boring film overall, but it does have boring bits and it's a tough ask to watch it all the way through in one sitting without a beer break. Nothing mind-blowing, decent enough and with a great soundtrack, but nothing particularly memorable either."}, {"rating": "8", "text": "I always check out Tarentino films and this one is in my collection of movies. I can watch it again and again. A true tribute to 70's blackploitation films. Plot is pretty basic but the all star cast brings out the dialog and intent of the film (Deniro kills it). Classic lines litter this flick but it is not Reseviour Dogs or Pulp Fiction, but among his best."}, {"rating": "8", "text": "Jackie Brown is a well acted, well directed, and interesting film. Like all Tarantino films, it has many of his trademarks that make it clear who the director is. It is a little long, but regardless, it is a worthy follow up to Pulp Fiction."}, {"rating": "6", "text": "Decent, but too long. Not for me, I like Reservoir Dogs better. I didn't care for anything of this movie, I see this a middle of the road."}, {"rating": "7", "text": "\"Jackie Brown's\" unpredictable story may get ahead of itself here and there, but thanks to some snappy dialogue work from Tarantino and a terrific lead performance from Pam Grier, the movie's worth the watch."}, {"rating": "8", "text": "A well-written, fun film to watch. Even though though it doesn't provide the strong gleeful violence Tarantino provides, fans should be pleased with the spectaculary performances and the overall outline of this film."}, {"rating": "9", "text": "Great and complex plot with perfect and unforgettable music. The characters were very interesting and with such actors it was fun to watch them. Jackson, De Niro and Fonda were great.The problem is only the length of the movie.especially in the middle."}, {"rating": "8", "text": "Jackie Brown is truly an underrated film full of great characters and a fantastic plot that makes Ocean's 11 a little jealous. Though critics were hard on it, it remains a true homage to blaxsplotation films from the 1970s."}, {"rating": "8", "text": "Jackie Brown is a very good movie. It is slightly confusing, but it's easy to make up something to make it less confusing. This is not one of Quentin Tarantino's best movie, however, it's still worth a watch. Or two."}, {"rating": "10", "text": "7\rAlthough well directed Jackie Brown fails to be anything new. It starts slow and it never really speeds up like a typical Tarantino film does. It has no major flaws per say it just isn't anything special. It is entertaining and there was no problem with the acting but as a film it just didn't live up to it's potential."}, {"rating": "5", "text": "Tarantino's Latest Caper `Jackie Brown' loses velocity.\r The saga of Quentin Tarantino is unique. Three years ago, he was a critical and commercial darling with \"Pulp Fiction.\" Then he went on to annoy everybody by showing up everywhere and producing bad movies and blabbing on talk shows, to the extent that now, with the release of \"Jackie Brown,\" his first feature since \"Pulp Fiction,\" it's as if he's making a comeback.\r Maybe he understands the value of diminished expectations. Had \"Jackie Brown\" been released at the tail end of Quentinmania, back when he was Orson Welles Jr., everybody would have been disappointed. But today, with much of the public ready to write Tarantino off as either an idiot savant or an idiot, \"Jackie Brown\" is looking like a fairly satisfactory piece of work.\r It might even be a wise career move: Make a movie that's not so great as to annoy those rooting against you, yet good enough that no one can deny your talent. One gets the feeling, watching \"Jackie Brown,\" that it's the kind of film Tarantino could make once every 10 months for the rest of his life. The picture is an adaptation of Elmore Leonard's 1995 best-seller \"Rum Punch,\" but with the setting moved from Florida to Los Angeles and the dialogue Quentinized. The novel's Jackie Burke, a white woman, has become Jackie Brown, played by Pam Grier, the legendary heroine of the blaxploitation films of the '70s.\r From the beginning  Tarantino tries to give \"Jackie Brown\" the flavor of a '70s low-budget genre movie, with interiors that evoke that decade and a soundtrack made up of early '70s funk music. It doesn't quite work. The music clashes with the modern-day setting and takes the audience out of the moment.\rYet from the first scene, there is the kick of once again entering a Tarantino universe. Samuel L. Jackson plays Ordell, a dealer in illegal weapons, who lectures a newly released ex-con about the relative merits of various guns: \"Then there's the AK-47, when you absolutely, positively have to kill every m-- in the room.\"\r Tarantino introduces a number of characters and manages to keep track of all of them. Robert De Niro plays Ordell's ex-con buddy, a fairly bland role. Bridget Fonda has slightly more fun as Ordell's girlfriend, an ill-tempered pothead. But the heart of the story involves Jackie, a 44- year-old flight attendant who's arrested for smuggling Ordell's money across the Mexican border.\r The movie fully exploits Grier's patented toughness in only one scene, in which Jackie gets the drop on Ordell when he comes to kill her. Unfortunately, Tarantino chooses to film that moment in almost total darkness. But Grier brings other qualities into the mix besides toughness: poise, an aura of fatalism and wisdom, and an idiosyncratic style. Grier talks the way Johnny Cash sings -- out of the side of her mouth. \"Jackie Brown\" is essentially a caper movie, in which Jackie and her smitten bail bondsman (Robert Forster) set out to steal half a million dollars from Ordell right under the noses of federal officers. But Tarantino jazzes up the story with characteristic comic touches. Crooks leave a crime scene and have trouble finding their car in a parking lot. Violence springs up for the silliest of reasons, with a suddenness that stirs uneasy laughter.\r Borrowing a trick from Stanley Kubrick's \"The Killing,\" Tarantino presents the same incident involving an exchange of money three times, from three points of view. He does it for little reason besides sheer playfulness. But playfulness is OK. There's something appealing in watching Tarantino borrow styles and techniques as if he were a kid taking items from a toy chest.\r Yet, as the film wears on, the mar riage of Leonard and Tarantino proves incompatible, or at least rocky.\r Tarantino's playful asides and slow buildups rob Leonard's caper story of its velocity. Scene by scene, \"Jackie Brown\" is amusing, but after two hours, it seems sluggish, and at that point still has a half-hour to go.\r The slow pace kills the sense of urgency, and the length and breadth of the film makes the story seem insignificant. Tarantino is still someone to watch, but \"Jackie Brown,\" before it's over, becomes a who-cares proposition."}, {"rating": "7", "text": "Jackie Brown is the weakest film in Quentin Tarantino's career. Yes, there is a good cast, there is the most important thing - dialogues written by Tarantino and several storylines intersecting to the ending. But the plot here, not the most interesting, very subsides the dynamics of the story closer to the ending. And yet this is drama, and black humor is not enough here. The film is certainly good, but you expect more from Tarantino."}, {"rating": "9", "text": "Reservoir Dogs was a fantastic movie for two reasons: excellent, quippy dialogue and exciting crime story full of realistic violence and superb acting. Pulp Fiction best exemplifies the former while Jackie Brown instead embodies the latter. While much of the violence from Pulp Fiction plays into the humorous aspect of the movie, the violence in Jackie Brown feels far more authentic. The film revolves around a main group of six or so characters who each have their own motivations, their own aspirations, their own plans, and their own allegiances. This creates a brilliant plot in which throughout the audience is trying to figure out when/how each character's true nature will be revealed to the audience. Jackson, Grier, and Forster all particularly shine in this film.This film has a decently long runtime of about two and half hours, but throughout the entire film, I remained excited throughout as the plot continued to twist and turn. In standard Tarantino fashion, something in the plan goes wrong, and watching each character act accordingly was the most exciting part for me.The first half of this film is quite slow, but it contains some of Tarantino's best writing while the backhalf contains one of the most exciting third acts that I have seen in quite a while. This is a must watch for any fans to typical heist movies as it is sure to offer something different from the norm that will keep it exciting throughout a viewing."}, {"rating": "10", "text": "This is such a classic movie and always overlooked when QT best movies are discussed. This is one of my favorite QT movies and one I can watch over and over again"}, {"rating": "8", "text": "This is one of the more laid-back Tarantino movies.Not as laid-back as Once Upon a Time in Hollywood, but still a surprisingly relaxed viewing for a movie with so much plot; more plot than any other Tarantino movie, in fact (probably because it's not an original screenplay).It's incredibly entertaining.The cast is amazing and the writing is impeccable.Definitely Tarantino's most underrated film."}, {"rating": "7", "text": "This is your typically stylish Tarantino film. Its pace quickens in the 2nd half. I like the music played, including 'Didn't I Blow Your Mind This Time' by The Delfonics, 'Street Life' by Randy Crawford and 'Across 110th Street' by Bobby Womack. Its about manipulation and money laundering, among other things. It features some of Tarantino's trademark bloody violence, although it has to be said that this film is very much less graphically violent compared to his other films, hence the lower rating at least here in the UK (its rated suitable for anyone over 15 to see). I liked the plot twists and found this a decent film overall, although the plot pace is a little slow and the direction not entirely clear to start with but it is worth sticking with - the last half an hour or so is particularly good. Its not as frenetic as, say, Pulp Fiction but it still seemed pretty slick and engrossing enough a watch to keep me, well, watching, so its still worth a watch regardless and obviously I'd recommend it on that basis."}, {"rating": "8", "text": "Quentin Tarantino's third entry, Jackie Brown, is on all accounts, a worthy follow-up to the critically acclaimed Pulp Fiction. The dialogue was terrific as always, which is something to expect from a Tarantino movie, although not as violent. The performances were superb, especially from Samuel Jackson and Robert de Niro, who brought color to the whole film with their dialogue. Pam Grier was also excellent, although sometimes, her acting leaves so much to be desired. Robert Forster and Bridget Fonda were also fantastic. The main problem of the film is its length. For a Tarantino film, long is normal, but the build-up took too much time, particularly in the first act. The film is also toned-down compared to Tarantino's previous films, with less flashy editing and violence and more character development. The plot was smartly written, but the flow gets entirely mixed up on certain scenes. But overall, this film is a fantastic addition to Tarantino's vast array of wonderfully written and shot films."}, {"rating": "7", "text": "Jackie Brown is a great movie. The movie's got an interesting story, which is about this flight attendant who's called Jackie Brown (Pam Grier) who's been caught smuggling gun money.However, she's got to make a choice between teaming up with the cops to sort out her dealer boss or to keep her mouth shut and ending up in prison.The movie's got some brilliant acting from each character throughout this movie but each character isn't that memorable.The dialogue which is given throughout this movie is very mixed. There's some very strong dialogue followed up with some very weak dialogue, which sort of ruins the characters dialogue quite a bit.Also, the cinematography which was shot by Guillermo Navarro is so beautiful. He does such a great job on capturing the scenes pretty well especially, the action scenes.The pacing throughout this movie is very mixed. There's some great pacing towards certain build ups which end up happening in this movie and than there's some bad pacing, which ends up ruining some of the build ups.The action scenes are all very well built up, despite some of the very weird pacing at times towards other build ups which end up happening throughout this movie.Finally, the movie's even got a brilliant soundtrack, which has got quite a few great songs from such artists as Bill Withers, Johnny Cash, The Brothers Johnson and many more.Overall, Jackie Brown is a great movie, despite some of it's problems. The movie's got an interesting story, brilliant acting, beautiful cinematography, well built up action scenes and a brilliant soundtrack."}, {"rating": "10", "text": "True original that stands the test of time. Pam Grier was one sassy and sweet screen icon. Film does truly capture essence of a gloriously analog age where the sublime was still possible. Its' earthy, edgy plotline would be impossible to create in today's cold, creepy digital diaspora where there is little soul and no secrets."}, {"rating": "8", "text": "Jackie Brown is a good movie. this movie is a adaptation of Rum Punch but there are a few changes here and there. Quentin Tarantino is of the greatest writer and director of all time but this movie wasn't as good as his others movies but don't get me wrong this a good movie."}, {"rating": "8", "text": "Even thoguh it could have been a bit shorter, its plot and characters turn it into an entertaining movie. The music chosen by Quentin is, as always, brilliant."}, {"rating": "10", "text": "A strong battle of wits and a plot of lines being strung along a damn good script shape Tarentino's ‘Jackie Brown' into a super smart, well-shot, acted, and directed piece of crime-drama that turns into a believable romance."}, {"rating": "9", "text": "The second best Tarantino movie after Pulp Fiction and the only one that he adapted from a book. This exploitation movie is simply wonderful, directing here is so skilfull (The robbery scene from three perspectives is fantastic) and acting is great. Pure entertainment, pure quality."}, {"rating": "10", "text": "The soundtrack is an all timer, Samuel L's best performance, a thoroughly entertaining ride from start to finish. 2nd for me on Tarantino's movies."}], "recommendations": ["reservoir_dogs", "django_unchained", "rocknrolla", "sherlock_holmes_a_game_of_shadows", "casino", "the_harder_they_fall", "the_suicide_squad", "backdraft", "desperado", "wrath_of_man", "snatch", "copshop", "the_three_musketeers", "lucky_number_slevin", "looper", "drive", "gangster_squad", "true_grit", "a_walk_among_the_tombstones", "the_equalizer_2", "the_fifth_element", "minority_report", "inherent_vice", "american_ultra", "moon"]}