{
  "id": 1547,
  "title": "Jack the Giant Slayer",
  "starring": [
    "Eleanor Tomlinson",
    "Nicholas Hoult"
  ],
  "runtime": 114,
  "genre": [
    "Fantasy",
    "Action",
    "Adventure",
    "Family"
  ],
  "description": "The story of an ancient war that is reignited when a young farmhand unwittingly opens a gateway between our world and a fearsome race of giants. Unleashed on the Earth for the first time in centuries, the giants strive to reclaim the land they once lost, forcing the young man, Jack into the battle of his life to stop them. Fighting for a kingdom, its people, and the love of a brave princess, he comes face to face with the unstoppable warriors he thought only existed in legend–and gets the chance to become a legend himself.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9jSI7saUX9Qz0JLh19jX2ulEwL7.jpg",
  "categories": {
    "plot": 5.133333333333334,
    "acting": 5.733333333333333,
    "ending": 6.05,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 4.769230769230769,
    "action": 5.35
  },
  "reviews": [
    {
      "rating": "6",
      "text": "There was A LOT of potential here, and I think that was the biggest let down. Had the studio been willing to spend more on the movie, they could have had a really great, watch-it-multiple-times movie. Instead, it was worth seeing once on Netflix or a similar service. I would be pretty excited for a sequel based on what the last few minutes of the movie hints at, though."
    },
    {
      "rating": "7",
      "text": "I admit I didn't expect much going into this, given the mixed reception.  But I actually left very entertained.  The story is loosely based on the old tale of Jack and the Beanstalk and while it for the most part stays true to it, it doesn't feel like some lazy copy from fairy tale book to movie script. But at the same time it didn't feel like a pathetic try-hard attempt to make a fairy tale \"edgy\" a la Hansel and Gretel: Witch Hunters.  It hits a nice middle ground that's able to work well on its own merits.  In other words the story isn't a rehashing or butchering but rather a reimagining.  The characters, while not particularly unique or original, do work in the roles they're given. Even if the whole lower-class-guy-meets-upper-class-girl thing is kinda done-to-death, especially when the latter is royalty, and you know very well how the story's gonna end in that department.  Also I like the idea of there being practically a whole other world within the beanstalk, rather than just an hour of climbing, which I feared the movie would be at first.  It makes for a lot of great visuals and action scenes.  Speaking of which, the fight scenes are very well-written/performed. Some notable ones (no spoilers) are the one with the giant chef and the one between Jack and Roderick in the stream.  The giants, aka the \"villains\", have a nice design to them.  And while I wouldn't say the CGI was amazing for them (especially in the close-ups) it worked well enough.  Though they were clearly the most \"cartoony\" part of the film.  One other thing I appreciate is how just when you think there's a cheap linear storybook ending about 3/4 in, it (somewhat realistically) continues in a way that would otherwise leave a massive plothole.  And I think it pays off quite nicely, with the final battle making for a great scene that really hooks you in, ending on a creative and kinda funny note, depending on your sense of humor.  Overall Jack the Giant Slayer exceeded my expectations and was very entertaining, albeit with a fairly predictable storyline and main character arch.  It's not a tear-jerker or a laugh riot but more of just a fun adventure.  I'd give it a 77/100.  It probably won't end up my favorite movie of 2013 but it is for now."
    },
    {
      "rating": "8",
      "text": "http://www.youtube.com/watch?v=KAGYge8jg Here is my review for Jack The Giant Slayer on Youtube. NOT SPAM I promise! I recently started my own youtube page. I need fellow movie lovers like you to help me out! Subscribe to my youtube page if you like my videos!"
    },
    {
      "rating": "5",
      "text": "I kinda like the way they protraite those little details. I still feel that this is not a family movie, all of the killing, squashing... is so terrifing."
    },
    {
      "rating": "8",
      "text": "Was not expecting much from this film, but I was surprised and impressed throughout. It's an old story which has been told before many times, but they've just added a ton of Hollywood and special effects which make this entertaining. It's different, some of the acting was questionable, but overall enjoyable"
    },
    {
      "rating": "8",
      "text": "Very entertaining and really good film. The plot is strong, the giants look fantastic, the acting is good and the story was enjoyable all the way through and good end. Would watch again"
    },
    {
      "rating": "3",
      "text": "So boring. So bad story. There is a lot of better blockbusters out there, keep digging and skip this one. My score is 3 and not 0 only because the visuals were nice at least."
    },
    {
      "rating": "0",
      "text": "The plot of this movie is very poor and slow. Acting seems fake, and the story is really puzzling. This movie never looked good from the beginning, but there were some humorous parts. I didn't like this at all, but I love action and humor movies. This just was plain awful."
    },
    {
      "rating": "5",
      "text": "Sure, it's worth a watch, but not a second one. Boring most of the time, sorry, also bad acting . Actually it was hard to watch till the end."
    },
    {
      "rating": "9",
      "text": "Just came from seeing this with my kids.  Was not too violent.  Kids had a total blast and so did I.  Total fun!  An Oscar winner for best picture?  Never, but who cares!  This was totally enjoyable."
    },
    {
      "rating": "9",
      "text": "I don't understand Critics.  They say they like the movie, go fun, very enjoyable, then they give it a 50 or a 60.  This is a very fun movie.  Hardly a slow point, easy to watch.  The special effects were excellent.  The ending was excellent.  Want to have fun?  Go see this movie."
    },
    {
      "rating": "8",
      "text": "If you were to combine The Lord of the Rings' story with Robin Hood's personality and The Chronicles of Narnia's fantastical whimsy, you'd get Jack the Giant Slayer.  With thrills, spills, and chills, Jack is a good adventure film that successfully modernizes its' fairy tale basis while lovingly nodding towards the classic tale.\r Great visuals and acting by the cast, with the stand-out being Ewan McGregor, who brings an Errol Flynn-like personality to Elmont.  There's a few good messages also on embracing responsibility, bravery, and self-sacrifice.  As far as a family movie night is concerned, Jack the Giant Slayer is a very mild PG-13, but I wouldn't recommend it for children under age 10.  For while there is no on-screen blood or gore (the head-chomping is off-screen and the effects are seen from a distance), it still could spark a nightmare or two for younger ones.  There's also a bit of mild language and giants are seen having gross habits.\r For a more detailed review, visit www.moviestakenseriously.blogspot.com"
    },
    {
      "rating": "9",
      "text": "A very fun movie that is a grand fairytale adventure, as it was meant to be.  Good humor, small amount of fart or booger humor, and the typical happy ending you find in a fairy tale.  A lot of critics are grouching about \"originality\" and such.  It's a FAIRY TALE!  It's a very old story, and one that people know.  If they changed it all, people would be disappointed.  The special effects were great, and all visuals were stimulating and drew you in.  If you're looking for a fun adventure story, go see this movie.  You will not be disappointed!  It's also very refreshing to see a movie not filled with vulgar language!  Suitable for everyone in your family!"
    },
    {
      "rating": "8",
      "text": "I have to say that this movie was not what I expected it to be. It was neither childish, nor what I would consider adult, but a mix between the two. One thing I will say right away is if you are expected jaw-dropping 3D, skip this movie. It has a few wow moments, but on the whole I would recommend saving a few bucks and seeing the 2D version instead.\rI did like the movie, and I feel the story is solid. I left the theatre feeling good about spending the money to see it, and because of that I give it an 8. If the 3D had been better, it would have scored higher."
    },
    {
      "rating": "9",
      "text": "Lots of fun. I brought my 6 year old and we both loved it. It's not groundbreaking, \"game changing\" or revolutionary, but it is a really good time at the movies. Well made, good characters, interesting situations and cool action. Critics need to pull the pole out of their butts and lighten up. All they had to do was say if you're a couple grown guys, you may want to check something else out. But if you are (or have the sense of fun of a) 5 to 13 year old, you'll love it. This was also one of the few movies I've seen recently where I didn't mind the obnoxious prices of the movie theater because I actually had fun experience."
    },
    {
      "rating": "7",
      "text": "Here's a storybook retelling by Hollywood that isn't completely rubbish. Jack the Giant Slayer stands proudly on the verge of decency, but doesn't really achieve greatness either. It is a stylized version of Jack and the Beanstalk that caters to more contemporary viewers. With the help of its stars, it provides a more palatable reinterpretation of fairy tale, although the script doesn't really shine. Effects are good throughout, gigantic creatures may have been digitally constructed before and while the giants here don't rewrite how they should be portrayed, they do have more humane motions in an attempt to include them more as characters and not mere monsters.\r Nicholas Hoult as Jack is an appropriate pick. He doesn't stand out as the heroic type, leaning more towards an urchin type of protagonist. His love interest Isabelle, played by Eleanor Tomlinson, is a princess who longs for an adventure. If I didn't know better, I'd say the first few scenes are from old RPG game, and truthfully. It starts slow and predictable, almost overly cliché. This is a movie that has slow beginning but eventually builds up to more interesting sequences.\r Stanley Tucci, Ewan McGregor and Ian McShane are no strangers to fantasy movie, these veterans are charming and act their parts ardently. They give more color to the otherwise wanting movie, I personally like Ewan McGregor as he steals the scenes even only as supporting role. Writing is somewhat inconsistent, some dialogues are corny and seem forced, and for those who aren't, they are decent at best. The pace is brilliantly tight however, the scenes are set in hasty fashion, not prolonged mundanely, and they are chained together fluidly.\r Action is integrated well, the ones towards the end are pretty amazing. It has compact and comprehensible battles, things happen quickly in sorted recognizable order, it's a good trait to have, considering the numbers of people involved are plenty at times. The use of 3D is serviceable, camera placement for the action are tailored for it, although not in invasive way as most 3D movies do. The switch to first person view briefly at some events is a nice touch.\r Wardrobe for the cast deserves credit, outfits are medieval yet seemingly have modern ambiance to them. Armor designs fit the theme, the characters look fine as each respective garment insinuate their personality more. Jack the Giant Slayer is a movie which isn't overly epic, it does have some issues and doesn't really make for a grand journey. However, the solid acting and good pace will likely amuse audience."
    },
    {
      "rating": "3",
      "text": "This was a just a sad waste of time. First off, the acting was terrible, especially from Ewan McGregor. Second, the fact that the story is based off of an old children's story, it just comes to show that hollywood is coming up with stupid rip-offs and unnesacary sequels. Third, the story is typical, i mean come on, trying to save the princess, isn't that overated. Anyway, Overall this was just bad."
    },
    {
      "rating": "6",
      "text": "Yet another Hollywoodization of a classic tale. The titular character gets his beans and a princess to rescue from the land of giants. It gets off to a slow start and stays that way. The action is very PG, which means noisy and dull. Although it's not terrible, there's nothing about this movie shows much imagination and the giants are staggeringly fake. A giant yawn."
    },
    {
      "rating": "0",
      "text": "Awful, just awful. The acting is atrocious, the main male character too ugly to convince that he could charm a princess, the CGI is simply poor. The story is boring and incoherent. Why are these movies made  They will never make the studio money..."
    },
    {
      "rating": "5",
      "text": "I knew this was going to happen. Another dud in the less-than-$200 Million-club. I really like Jack and the Beanstalk because it's still a great read for children and/or adults. But it's the beginning of March and there's still no new releases for me, the only movie I want to see is \"The Host\" and \"G.I. Joe: Retaliation.\" Jack and the Giant Slayer, I'm not sure what the movie's all about killing giants and..sorry Jack, but Buffy is still the undisputed queen of vampire slayers. The movie was okay, but maybe the action scenes were a little too frightening for the little ones to see. The script looks like another one of those bad fairy tale movies (Hansel  Gretel: Witch Hunters is one of them) starting to take over the box office and well.. you get the picture. Another year, another mediocre so-called \"Slayer\" to start the March season, I think Jack the Giant Slayer is going to be one of the biggest flops of the year. Maybe it could match John Carter's terrible run last year."
    },
    {
      "rating": "9",
      "text": "This was a great movie! I heard some bad things about it, but knew it had a good shot at delivering and it did.If you`re looking for an adventure look no further than Jack the Giants Slayer."
    },
    {
      "rating": "5",
      "text": "THis wasn't a great movie. I found the action scenes very good, but the movie was all over the place. At points it was a comedy, but sometimes it was a serious adventure, or a fantasy war movie, and I don't know what they were thinking with linking it to real life. As well as that, it wasn't even consistent with who it was made for. The plot was too simple for the older crowd, but too violent for the children the plot seems to cater for. I also found that not many people have much of a motive. Why did the obviously evil guy keep killing his teammates? Why did Princess Isabel run away from a moderately reasonable request from her father and king? There were some good points, like the action scenes and the character of Jack, but not enough to justify more than a 5."
    },
    {
      "rating": "7",
      "text": "I must say I was more then presently surprised by this one. Rarely these days do I watch a film at home from start to finish, but this movie had me gripped from start to finish. It's predictable, dumb, and fun. A lot of fun. I was actually surprised by some of the clever ideas they threw in the movie tactically. The way the defeat the \"king\" giant in the end couldn't be more brilliant."
    },
    {
      "rating": "5",
      "text": "The special effects are good, the 3D is good.  The giants are inconsistent in size.  When we first meet them they are as tall as the trees.  When back on earth they are smaller, and the head giant that falls into the castle moat is way smaller still.  There is no way the giants they show at the beginning would fit inside a castle to run around chasing Jack.  There are also some ludicrous moments  the audience actually groaned and laughed at a couple of them.  The worse one involves a knife fight where Jack's head is pushed underwater and his lost knife comes floating back to his head, and he grabs it with his mouth and stabs his opponent.  Knives do not float, they sink.  And try stabbing someone with your mouth while your opponent is on top of you pushing you down.  Another bad moment involves the tug of war with the rope at the castle.  It would only take one or two giants to easily win that battle, yet an army of giants can't pull the wall back down!  In the meantime, they are so strong they are uprooting trees that are on fire and easily throwing them over the wall.  Yet another stupid moment is when Jack throws the bean down the giant's throat.  The giant has picked him up and is about to eat him.  Apparently he eats in VERY slow motion which gives the bean time to do its magic.  In the end I think young kids will like this movie, but adults will be rolling their eyes a lot."
    },
    {
      "rating": "4",
      "text": "An interesting twist on the classic fairy tale, it's just a shame the movie isn't that interesting or entertaining. It falls short mostly due to predictability. A lot of the plot points have been done before, and better, in other movies. The movie gets point for its fantastic special effects that rivals the works of Peter Jackson, but that means nothing when the special effects aren't used in an entertaining experience. The action, the plot, and the humor all falls short. The cast does a good enough job even if there is some overacting from some of the supporting cast. Ewan McGregor's performance is especially entertaining and he's easily the best character in the film providing just the right amount of silliness and seriousness. All in all the movie just isn't that enjoyable and I don't recommend it. Better pass on this one. It tries hard to ride its beanstalk up into the clouds, but in the end the whole thing manages to come crumbling down."
    },
    {
      "rating": "7",
      "text": "Not as 'fee fi fo dumb' as many critics would have one believe (though I'm not watching it in a theater which actually is where such a film should be seen)..  l love (at least filmically) the era in which the story is situated..  it has quite an impressive, inventive 'look'.. engaging, entertaining & fun to watch  sometimes even funny.. very effective cinematography & editing.. appropriately un-memorable yet supportive soundtrack.. emotionally well-paced if a bit predictable  not simply because we have often heard this fairy-tail).. with more than merely adequate acting (a notable supporting cast much less the lesser known 'leads') & directing (Bryan Singer).. somewhat obvious but nice ending which is a set up for a follow-up (ooopps, jumped the gun, would have made for a good ending  & cut off  a half-hour.. still a nice ending  a nice quadruple ending).. but it's the 'look' that makes this film  \"it's a hell of a view\".."
    },
    {
      "rating": "4",
      "text": "Yet another fairy tale re imagining that sounded interesting but upon execution left much to be desired but oddly enough not in the ways you would expect. When Jack (Nicholas Hoult) is given some magic beans by a monk he thinks hes been swindled but then the resulting beanstalk causes his house to ascend into another realm along with a princess he must travel up to rescue her and prevent the giants from coming down. As a film its a puzzle because it seems like the film's climax seems to be in the wrong place with the 3rd act disappointing the first two. Bryan Singer loves telling stories about outcast heroes and Jack is a gripping protagonist as he is someone you genuinely like, hes a charming, naive oddball of a hero. On his adventures he is joined by Elmont (Ewan McGregor), a knight sent to rescue Princess Isabelle (Eleanor Tomlinson) and it is clear that McGregor relishes his character's comedy. The films best quality is its ever mutating tone while managing to stay interesting and family friendly. The film is stuffed full of comedy to provide levity to a story that is filled with dark elements. The giants are dark and twisted but they are also entertaining in their large bumbling way. While the comedy tone makes for a fun watch, the movie lacks depth or any kind of real emotion or heart and when the film shifts in the 3rd act to allow for a stereotypical finale it loses its unique character. It's one of the few films that has an epic final battle and it isn't really as good as the conclusion at the end of the 2nd act. The visuals are outstanding with the land the giants inhabit being both beautiful and menacing. The giants themselves look gruesome but with individual personas to entertain, the chef giant is a particular highlight. Overall its an inventive and funny film but never really grips you to your seat in the way an epic should and the final act disappoints both in terms of gravity and tension making for another flat ending."
    },
    {
      "rating": "7",
      "text": "Jack the Giant Slayer can be described very simply  and effectively  in one word: fun. It won't win any awards or be remembered, but that doesn't matter, it provided the core reason we go to the cinema, to have fun and to be taken into a different world. The acting on all fronts was actually good and really brought the film to life, I went into the film fearing it would contain really mundane acting that drains the life of the film, but I was proven wrong. It was silly and never took itself too seriously, which is really the only way the film could have succeeded, it's a film about Jack and the Beanstalk for crying out loud. The bottom line is this, if you're looking for a fun family film that you can just watch, Jack the Giant Slayer is a good way to spend an evening. The reason I have not given the film a higher rating is because it didn't blow me away, it just took me by surprise that I actually enjoyed it. Fun, 74/100."
    },
    {
      "rating": "6",
      "text": "Enjoyable fantasy by Director Bryan Singer is exciting in parts, but has a visual style and art direction that is too pedestrian.  Blame it on Singer, who is really good at getting fantastic stuffs grounded, be it in his X-Men saga or in Superman Returns.  Not so good for what is essentially a fantasy film. But still, Ewan McGregor did pretty well as supporting role from Stanley Tucci."
    },
    {
      "rating": "4",
      "text": "Jack The Giant Slayer has set a record that no one should be proud of. This film made the least amount of money, compared to the amount of money spent on it, in box office history! The film gives new meaning to the word bomb, as it cost the studio approximately 80 million dollars! The goal of this film was ambitious, but the problem was that it completely misses all of it's target audiences. The writers wanted to take the story of Jack & The Beanstalk and adapt it for more mature audiences. Parts of it almost seemed like they were looking to make it an epic adventure, like the Lord of The Rings, but the Lord of The Rings it is not. The problem with this film is that while they built up the intensity, they didn't go far enough to make adults want to see it. On the flip side, with all the added death and violence, it garnered a PG-13 rating, which meant that younger kids weren't going to see it either. Personally, I liked what they did with the story and I think Nicholas Hoult is a terrific actor, but the way they wrote this film was just a disaster waiting to happen. When they build up the suspense and something is about to happen, they don't show it, because it would be too intense for the kids. When they go the comedic route, the fart jokes, bees in the helmet, and gigantic bad breath is a turn off to the adults. At times I felt like I was watching a kids movie, while at other times I felt as though I was watching one of these three an a half hour epic trilogies. The film couldn't decide how it wanted to go and as a result, it didn't appeal to very many. You can't argue the fact that the film bombed at the box office and I think you can't argue the fact that it did so for a good reason."
    },
    {
      "rating": "7",
      "text": "To put it simply, Jack the Giant Slayer is a funny, action-filled, fast-paced movie with a fairly interesting plot. It's definitely  enjoyable, but isn't exactly very well written, it is written OK though. The movie occasionally drifts from it's plot and gets boring at times, this lowers it's score, also, the acting wasn't the best, as well as that  it was incredibly cheesy at times. So I give this film a... 7.3/10!"
    },
    {
      "rating": "6",
      "text": "Besides from some lame jokes and mediocre visuals, Jack the Giant Slayer is a good adventure film that successfully modernizes its' fairy tale basis while staying true towards the classic tale."
    },
    {
      "rating": "5",
      "text": "Fairytale stories always have the ability to be wonderfully entertaining or be lame attempts, and Jack the Giant falls somewhere in between. There were some great moments that could have been perfected better, but it just didn't have the riveting story or battle scenes that I could have hoped for."
    },
    {
      "rating": "5",
      "text": "The movie was fine, nothing unpredictable, If you have seen the trailer you have seen the whole movie, bit slow. But can be fun for kids as the graphics was good"
    },
    {
      "rating": "7",
      "text": "This was unexpectedly entertaining to watch.  The special effects were pretty good and it was a good spin on the traditional storyline.  Good humorous moments in the movie..."
    },
    {
      "rating": "6",
      "text": "Surprisingly entertaining fantasy directed by Bryan Singer with his usual visual style. The film has some great action and set pieces and is complimented by the wonderful cgi, especially involving the beanstalk itself. It is great to see a classic tale told well and nearly as you imagined it on the printed page (This is how to do it Red Riding Hood). Stock characters abound as is the norm for this type of film, but Nicholas Hoult  does turn in a rather flat and uncharismatic performance as Jack. His romance with the princess is also predictably uninspired. Nevertheless, the film gets by on its sheer energy. Not at all bad."
    },
    {
      "rating": "6",
      "text": "While it lacks any real substance and depth to be taken seriously, it's still allot of fun to watch. Effects are decent, most of the time, aside from the Giants (which are awful.) Tucci & McGregor really pulling off some great and hilarious performances.\r Overall:\rNot the greatest fairy tale adaptation, but an entertaining one at the very least."
    },
    {
      "rating": "5",
      "text": "Ok story that was kinda generic though. They got rid of many characters early since they were dull and un-developable. Big fight scenes were fun and impressive looking. Jack was an ok character. Iy Tried to be funny... it wasn't."
    },
    {
      "rating": "7",
      "text": "A surprisingly good movie. The CGI is cringingly bad but if you forgive that the worst thing about it is Ewan McGregor's hair which never loses it's style even after a fight in a river. Better than Man of Steel anyday."
    },
    {
      "rating": "6",
      "text": "I'm not sure it deserves all the crap it's getting from critics but at the same time it does. Does that make any sense? Well I guess what I'm trying to say is that the movie is mediocre at best."
    },
    {
      "rating": "5",
      "text": "This movie, even though its rated PG was still decent. The main characters ans even side characters were pretty good. But the story was just too all over the place. It begins with a dad and son reading about giants and then a movie about a princess trying to save the kingdom. Jack himself, didn't really do a lot of fighting in the movie. I though he was going to turn into some great giant slayer or something as the title suggests? But he spends most of his time fighting against himself, being a farm boy and falling in love with a princess. This movie would be a great 3d animation for PG. But the title is very misleading and not many 'slaying' in the movie. The movie is a good family movie but its centered around one or two characters and its about saving a kingdom. There is pg love, there is pg fights, there is pg dialogue. So no blood and guts here...just family fun."
    },
    {
      "rating": "6",
      "text": "This was a fun movie. It doesn't try to be anything it's not and is filled with good action and characters. Only complaint is that the cgi was a little spotty at times."
    },
    {
      "rating": "6",
      "text": "Jack the Giant Slayer isn't a step up movie for director Bryan Singer who has brought us the almost marvellous  Superman Returns which crashed in cinema but adored by critics. This is a whole new idea, Orcs, Knights, Warriors- not Singer's type but still it was entertaining. The movie cuts through minutes of opening with slashes and killings. The story is a mixup of Jack and the Beanstalk and Lord of the Rings that meets with Beastly's romantic touch. I'd say its pretty neat VFX type. This film's story is nothing special, just an adaption- even Walter Hill or James Cameron can do a book movie. It's good when you see it's speciality in action and special effects and coolness but nothing special."
    },
    {
      "rating": "5",
      "text": "This is just another movie filled with good special effects and computer animation but at the expensive of good story writing. The story is bland, cliché, predictable, boring and we've seen it all before in other movies.\r In today's day and age, we expect that good special effects does not a good movie make."
    },
    {
      "rating": "7",
      "text": "A surprisingly fun film directed by Bryan Singer.  The main concern going in was the giants and overall I thought they were fine.  The key to the movies success is the strong acting along with a solid directorial touch by Mr. Singer."
    },
    {
      "rating": "6",
      "text": "Decent movie, especially for the older kids and teenagers. This is fun if forgettable light entertainment. The movie has it's charms and moments of coolness, but overall predictable, cliché and a bit boring. Overall Mediocre special effects, fine acting and a blant script."
    },
    {
      "rating": "8",
      "text": "Very fun and entertaining movie. The storyline could stick a little bit better, and show more detail, but otherwise, a great family movie. There is no blood as I remember, so it should be fine for littler kids as well. A great movie."
    },
    {
      "rating": "7",
      "text": "Very interesting and full of adventure movie. This movie has a \"Peter Jacksonish\" feel in it, though it is not as great as his epics. But who cares?! this movie is very entertaining from start till end."
    },
    {
      "rating": "5",
      "text": "Entertaining and enjoyable, but nothing groundbreaking or spectacular. A lot of drawn out and dull scenes which lose your attention and takes far too long for action to start. However when the action does start, it becomes better. The scene with the beanstalk growing in the house was very boring. Overall, it cames across as any other kids fairy tale romp film and generally forgettable, but not to bad."
    },
    {
      "rating": "8",
      "text": "A film that brings out the bright-eyed child within everyone. Fun and entertaining for all ages. An interesting collection of actors and actresses that worked like magic. More please!"
    }
  ]
}