{"id": 2324, "title": "Jack Reacher: Never Go Back", "starring": ["Tom Cruise", "Cobie Smulders"], "runtime": 118, "genre": ["Action", "Thriller"], "description": "When Major Susan Turner is arrested for treason, ex-investigator Jack Reacher undertakes the challenging task to prove her innocence and ends up exposing a shocking conspiracy.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/cOg3UT2NYWHZxp41vpxAnVCOC4M.jpg", "categories": {"plot": 5.806451612903226, "acting": 5.636363636363637, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.947368421052632, "funny": 6.5, "action": 5.8431372549019605}, "reviews": [{"rating": "4", "text": "Extremely formulaic in its structure and storytelling, Jack Reacher: Never Go Back is only mildly interesting when it comes to the action sequences, and even those scenes are poorly executed and somewhat boring."}, {"rating": "6", "text": "Tom Cruise is back as the badass from the novels. The usually solo action hero teams up with an officer accused of treason (Cobie Smulders) to uncover the crooks behind a conspiracy. There's lots of running, a few gunfights, plenty of hand-to-hand combat and some personal interaction. It's all competently staged, but nothing stands out. Pretty much a by-the-numbers action flick with a steely Cruise sharing the screen with an equally tough woman."}, {"rating": "6", "text": "If you're a fan of the Jack Reacher franchise, or just out looking for an action movie some night in the near future we think you'll be entertained.  Tom Cruise and Cobie Smulders do nice enough work with what they were handed.   However, one of the bigger challenges with this film was the dialog.  We would think at this point, that with all the other things vying for our attention, that if a studio is going to go through the effort of funding and making a movie, they would try just a smidge' harder on this now. There are so many wonderful writers out there. But after the first little bit of this film (which was pleasant enough) you'll have to sit through a fair amount of cliche.\r Also, as a minor amusing note: whoever approved the wardrobe on this film really likes black. Have fun noticing that.  It's always charming when they show the the trade craft of these various professionals trying to inconspicuously follow each other, all wearing black. The black leather gloves were an especially nice touch!  Bravo!  Oh, that was the villain?! Thank you!  We didn't know.\r Plenty of good special operations consultants out there now, please listen to them a touch more. A fair number of your audience will have been in the military at this point, and they, and all of us will appreciate some extra little touches of authenticity, even if we know it's fantasy.  Anyway, if you're looking for action movies right now, this is an decent choice But there a couple other options out there. If that's the case, we'd recommend checking them out in the following order instead:  1) Hell or High Water, 2) The Accountant, 3) Jason Bourne.  The Metacritic users seem to agree.  And you'll have even more fun!"}, {"rating": "7", "text": "Not a bad action movie, but definitely nothing I will remember for very long. The action scenes were great, but the story was dull, as was the main villain. Still worth watching though, but I am glad I didn't pay to see it in theaters."}, {"rating": "8", "text": "One reason I like Tom Cruise movies is he does not start making a movie until he has hired talent into every department and down to the smallest speaking role.  This film is enjoyable as superb movie-making.  If you watch it this way the familiar plot elements are no problem.Another plus is no torture of women.  I'm grateful for any film without abuse of women.Zwick is onr of my favorite directors, and he adds a lot of dimension to familiar scenes which takes a big human heart to do.  Also remember Cruise is playing a 6'4\" bruiser with no feelings.  That's the character."}, {"rating": "9", "text": "This movie is also made from book to screen, Jack Reacher is a great hardened character and Cruise is surprisingly good as the Military detective who struggles with normal world feelings. Great action flik and a decent cast pull off a good film. This movie can get \"over-reviewed\" but its a 9 for what it pretends to be and delivers. I hope they make more Reacher movies (as there lots of books in the series)"}, {"rating": "5", "text": "The first one of these was under-rated and a decent entry in this genre (8).  This time, though it begins well, unfortunately it devolves into a highly formulaic trudge through which drags badly in the second half.  Director Zwick on board this time for his family values touch wasn't a bad idea.  The problem as much as anything is sheer over-saturation of drawn out formula plotting in all these efforts.\r As far as Cruise, like always he's good and will almost pull you through the seen it all before proceedings here.  And unlike the abominably bad \"Jason Bourne\" for example (which does not get nearly the wrath that worthless junk deserves), Cruise towers over Damon as a star and makes this kind of similar action fare with much hand to hand combat and typical over-the-top gunplay much more amusing and even sometimes funny compared to the one dimensional dour Bourne franchise.  This movie is also crafted in classical Hollywood manner and therefore trounces that phony cheap handheld consumer level poorly shot documentary simulated rubbish posing as edgy state-of-the-art realism that the stupid filmmakers of the last Bourne so-called film erroneously believe to be engaging to an audience when if the audience and jackass critics were honest, they would clearly and emphatically label as pure s---.  At least this movie doesn't annoy the s--- out of you."}, {"rating": "7", "text": "Bom filme, como eu gosto. Pura acção, adrenalina, espionagem e entretenimento. Tom Cruise neste tipo de filmes é top. É certo que o filme se parece com missão impossivel por vezes mas mesmo assim é um filme que prende ao ecrã os amantes de Tom e de acção."}, {"rating": "7", "text": "Enter the 2nd movie of Lee Child's Jack Reacher \"Never Go Back\". Adaptaded from one of the best of Jack Reacher's. It all starts Jack Reacher arrested for beat the hell up 3 or 4 men outside of a café in small town. Reacher didn't run,but sit there – maybe ordered a cup of coffee or waffle – we don't know.But he just sit there till a sheriff arrived and order his deputy to arrest Reacher. But Reacher is so calm and say that a public phone on the wall will ring in 90 seconds and the sheriff will going to jail instead. The sheriff underestimated him, made fun of him that Reacher is one hell of a prophecy and just a second before his deputy walk Reacher outside, the phone rang. And it happened, 3 MP cars arrived and arrest the sheriff (along with his friends that Reacher already beat the hell up) for a serious crime committed in the land property of US Army.\r So,Reacher call Major Turner, a middle rank MP Officer who he informed about that sheriff, and Reacher is about to take a visit and if lucky he might get a date, but then when he arrived it was somebody else sit on the desk, Colonel Morgan that informed him that Major Turner has been arrested for espionage. Reacher didn't buy it, his got telling him that something might went wrong. Then Reacher find a way to meet Turner's appointed lawyer Col.Moorcroft, instead of minimum information, Moorcroft gave him another information that after he left the service as an MP, a suit has been addressed to US Army to pay child subvention by Candance Dayton a mother to Samantha, Candace claimed that Samantha is Reacher's daughter – which Reacher denied, but still he stole Samantha's photo, and before he left he satirize Moorcroft's. Reacher begin to find for Samantha, they both met but Reacher didn't tell her why is he following her.\r Finally Moorcroft follow his conscience to inform Reacher that something awkward in Turner's case, but an ex military soldier – the hunter- came by and killed him. Then Reacher blamed for Moorcroft's dead and arrested, and for worse an MP officer Cap. Espin – who hold grudge – that Reacher once hold his rank promotion with \"thoughless\" act judgment. But it's not Recaher if then he decided to lose himself from Espin, and release Turner from her cell block, just after 2 of unknown personnel entered the cell to kill her. Both manage to runaway, and became a couple of fugitive an at a time both marked for death, and on the run Reacher found out that Samantha also marked, because Samantha allegedly is his daughter, and then three of them must play hid and seek from town to town.\r As both Reacher and Turner digged out that a weapon contractor – Parasource- is involved in the killing of Turner's subordinates whom she sent to Afghanistan to investigate. And this time Reacher is running against time to find out what kind of conspiracy happen and to protect Samantha a girl allegedly his daughter.\r This is the second movie from Jack Reacher's character - even though Tom Cruise is not exactly as Lee Child's profile- but seems like Tom manage to present his own image as Jack Reacher – kind like Harrison Ford did as Jack Ryan in Tom Clancy's Patriot Games and Clear and Present Danger.\r What I like in this movie area : the chemistry bond between these 3 characters, Reacher-Tuner and Samantha. How the arguing between Reacher and Turner about who will go out finding some clue while someone has to take care of Samantha – and it's all about male – female equality, and gave me glimpse about Turner's character background that she was so sick about the way all men treat women in all field.\r Edward Zwick work the chemistry between Reacher and Turner very good, that's sometime Turner shows the shrouded ego to prove that she also can solve their big problem as well as Reacher. And in just a little while then she couldn't hide her symphaty,her admiration, her desire on Reacher – that behind he hard attitude she admit that she really can count on Reacher alone.\r I also like the chemistry between Reacher and Samantha, how Reacher it's kind of stranded between his confidence that Sam is not his daughter and at the same time for the first time he feels his fatherhood inside, that he will do anything to protect her.\r So this is a little bit awkward, this is an action thriller movie – I'm not saying that this movie is not thrill enough – but it's nothing so great about for the action pack, and the hand to hand combat – which is good enough, but I feel like even though you don't have to make it like a mindless moves, I think they should learn some of martial arts like jujitsu,pencak silat, kick boxing and karate, cause I don't really see that in both sequel.\rBut still, all credits given to Tom Cruise, Cobie Smulders and Danika Yarosh that give soul in this movie.\r My conclusion is Jack Reacher : Never Go Back is an up to level from the first Jack Reacher (a.k.a One Shot in novel version), closer as the promising action thriller movie succeeded delivered emotional bon"}, {"rating": "4", "text": "More like Jack Reacher: Never Going Back to See That One.\r Almost all the Tom Cruise criteria was met for this movie:\r - constant chewing/jaw-clenching\r- running\r- smashing through wall/glass\r- breaking a phone\r The only thing missing is Tom Cruise riding a motorcycle. Too bad."}, {"rating": "4", "text": "Such a step down from the first. Cruise plays the backseat to two terrible actresses. The film is all over the place with none of the focus of the original. Not worth a watch"}, {"rating": "7", "text": "If you liked Jack Reacher then you will like Jack Reacher 2.  There is no new ground breaking movie effects or storyline....it just simply an entertaining action movie."}, {"rating": "6", "text": "Walking into “Jack Reacher: Never Go Back”, starring Tom Cruise, you should know what to expect and that’s what you get with a little more humor than usual. Of course, as with any action film, you have to check the logical part of your brain outside the auditorium.\r Come on, it is great, it is fun, seeing Cruise, at the age of 54, fighting 5-6 guys without losing any energy or breathing hard. He wrestles a guy, they fall off a building and he gets punched, kicked in the stomach, legs, in the head and still get up and demolish the other guy!\r Does it make a difference what the story is? You know it is about some big organization and the mean CEO and the good guys/gals going after them and you don’t even have to be told who will win.\r A bit of a difference here is that he partners with Major Susan Turner (Cobie Smulders) who keeps up with him running—and there is a lot of running—and fighting the enemy. Another female in the movie is teenager Samantha (Danilka Yarosh), who could or could not be Reacher’s daughter, who brings some humor and smarts as only a teenager can.\r Yes there is one fight too many and each is a bit long while we have the action movie mandatory car chases and let’s not forget the hissable villain here played by Patrick Heusinger.\r All the heroes, heroines and villains do their job well in the movie and Cruise, though no longer with a 6 pack stomach, but has a shirtless scene, has nothing to be ashamed of and when he threatens to break a man’s arms, legs and neck he does just that, in that order, as easy as he jumps off another building.\r “Jack Reacher: Never Go Back” is a fun movie, a movie that we use to run to as kids on a Saturday afternoon and practice the star’s moves on the walk home. Go ahead and relive your childhood or have a second one at a movie house near you. And don’t forget to get a bag of popcorn!"}, {"rating": "4", "text": "I love the Reacher books, but while the first Reacher movie was OK, this one was worse.  Some critics' reviews talk about Cruise throwing his all into the role, but to me he just looked pudgy and too old for the role (reacher is supposed to be, what, 35?).  The plot was unconvincing, with whatever facts motivated Reacher's conclusions and actions remained obscure or mysteries.  The part I enjoyed most was Lee Child's semi-cameo - to me, he's a guy who looks like Reacher..."}, {"rating": "9", "text": "If you like the first movie you will definitely like this one. It is a good balanced action thriller. The bad gay was scary, there were funny moments and to much cheese parts. A perfect Sunday movie!"}, {"rating": "4", "text": "Tom Cruise tries the best he can do to save the big screen from flopping movies like this one everywhere. Unfortunately, his attempt can't save the movie from flopping a failure from both sides. Never go back seems like the only unforgettable line for this movie because if you went to see this movie, you can't go back in time to solve your problem."}, {"rating": "10", "text": "Jack Reacher around my thoughts.\r Tom Cruise was my dream man when I was in high school and I saw him playing volleyball in his jeans and no shirt in \"Top Gun.\" I asked my dad for the VHS for christmas and he looked at me a long time and said \"Ain't you already seen it?\"\r I said I did and he took a sip of his Schlitz can and asked cruelly, \"Then why the he!!! would you pay money to see it again?\"\r He didn't understand. Never did. Still he's gone now and while I would struggle to say I miss him, I would say I wish we were closer when he was alive. He never came to terms with my lifestyle and I am sure he would be embarrassed that I make my living as a cage dancer in the Keys.\r I know Tom is going to come to terms with who he is someday and when he does he will find himself a most welcome guest at Tommy's in Key West."}, {"rating": "6", "text": "It was okay, I didn't see the first one so I didn't no what to expect from a fan standpoint but it was an okay. The plot is fairly simple and Tom Cruise still kicks ass at 56 years old but thats about it. The plot is formulatic and provides no new ground, Cobie Smulder's does good while playing a disappointingly underwritten character. With that being said, the movie is still mildly entertaining to say the least but if you're looking for anything other than popcorn fun, you may want to pass on this."}, {"rating": "3", "text": "This is really bad movie. Plot is weak, characters are dull, especially Danika Yaroshes role of a \"street\" girl. It's just a very weak movie. If I wasn't a fan of Tom Cruise this film wouldn't even get 3/10. Seriously, much weaker than the first part, and if you didn't like the prequel, this one is going to kill your brains. Much like an Uwe Boll movies. Just can't beelive that the guy that directed \"The Last Samurai\" and the actor that had played the main role just could produce the s...t like that. HORRIBLE!!!"}, {"rating": "10", "text": "excellent movie, excellent actor play.--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------"}, {"rating": "6", "text": "You might not notice the lack of depth in this well-acted thriller based on a book by Lee Child, but that's the point. Due to the overwhelming commercialism of the source material, the action lends itself well to the screen. Though, for an action movie, the gun fights are sparsely laid throughout. The film fails when it relies too much on its character development and plot, but it also shines through the performances of Tom Cruise, Colbie Smulders and newcomer Danika Yarosh. The three provide legitimacy to an otherwise monotonous escapade through action tropes and cliche."}, {"rating": "8", "text": "A big improvement from the first one. The acting was amazing, and the younger girl was a great new character. The action moments were well thought out and entertaining. You should watch it."}, {"rating": "4", "text": "An action movie stuffed with cliché movie tropes (music, dialogue, plot, fight sequences, etc.). So many, in fact, that every moment is more predictable than the one before. You will know exactly how this will play out and end within the first 30 minutes. I guarantee it or your money back (and you will want your money back)!"}, {"rating": "3", "text": "Mindless, Cartoonish, one fight after another, copy / paste dialogue. Except for the set dressing,generally disappointing.It has one or two moments, and The actors try, but it's not nearly as good as the original \"Jack Reacher ( 2012) What made the \"Jack reacher 2012\" so good was the dialogue, the tension, the detection the thoughtful approach, the pacing.That( 2012)  was written and directed by Christopher McQuarrie, and is very worthwhile.This one is \"a swing and a miss\", or a \"broken bat pop-up\"I do hope McQuarrie is brought back for the next one."}, {"rating": "5", "text": "This sequel is pretty lame with little of what made the first one decent. Disappointing."}, {"rating": "4", "text": "Not as good the first one. Cruise is solid but the script is just awful. The stupid sub plot about a girl who maybe his daughter (you find out half way through that she used it as a ruse to get assistance and isn't his kid and yet for some reason they felt they still needed to have a DNA test at the end of the film). The villains in the film are non-existent as they are rarely used despite having some pretty solid actors attached to the roles.\r The action is very basic as well and no where near as good as the first film. I also agree with another reviewer where we never see Reacher's thought process and how he comes to the conclusions that he does. He just does it and the movie goers are suppose to accept it. I'd rather they take out that weak sub plot and add a bit more investigating and back story to things to make the plot as a whole more interesting.\r Overall, Jack Reacher 2 really doesn't make you want to come back for a third. They stuck too much to the formula and don't offer much in terms of originality."}, {"rating": "7", "text": "...but he did go back and got into a trouble!The original source is a long book series, so they did not do it in order. Like the first film, which was based on the ninth book, this one was on the eighteenth. It was a stylishly made film. The actors were good, and their stunts were excellent. But not the storyline. This is a very familiar theme. You know, someone framed you and you go on to dig the truth while everyone trying to hunt you down. There are lots of close encounter, which give great thrilling entertainment. So, other than the story, everything looked fine.Jack goes to meet one of his ex colleagues at his old headquarters. But soon he discovers she's behind the bars and now he's too for the crime they did not do. So escaping from the prison and looking for clues, who framed them and why, all one by one disclosed with some excellent running-chasing action sequences. The film almost as good as any timepass action film. But like it was the new wine in an old bottle. So it won't work for everyone, especially those with greater expectations.The 55 year old Tom Cruise on the edge to become a veteran actor, but still he got that action hero macho in him. Probably another 3-4 films, including the upcoming 'Mission: Impossible' sequel. So this franchise could replace his cast with younger one in the future. Because another 20 books to go. Though, I'm thinking about the television series. Cobie too was awesome. The film justifies to its original, but not more than an above average. So good for once watching it.6.5/10"}, {"rating": "6", "text": "Tom Cruise returns as the famous title character based off of Lee Child's many novels. Having not read any of these novels, I understand that those who have and are fans were displeased with Tom Cruise in the role, since Jack Reacher is supposed to be much bigger and taller (and most of us know that Tom Cruise isn't exactly the tallest celebrity these days.) Like I said, since I haven't read any of the novels I can't really complain about that. But anyway I digress. I actually rather enjoyed Cruise in the first film with his fun mix of action and humorous moments and that's exactly what I got once again with this one! I will admit that this one did feel a bit dumbed down in terms of story and didn't feel quite as inspired as the first film did, but it was still a mindless fun and a worthwhile and entertaining sequel for the most part. Overall, it's Tom Cruise doing what he does best basically, so don't go in expecting anything more than that and it should be a stupid fun time while it lasts!"}, {"rating": "7", "text": "By replacing the insipidness of its predecessor with a stronger espionage-tinged plot as well as more kinetic action, 'Jack Reacher: Never Go Back' redeems the series as an entertaining, if indifferent, B-action film."}, {"rating": "6", "text": "I wish I could say this was a good movie. I thought the first was okay, nothing too great. This movie is filled with cheesy 1 liners and unconvincing bad acting. Some of the story elements didn't even make sense. The whole first part of this movie is filled with acting and scenes that make you scratch your head because of how bad they are. I would like to talk about it, but that would involve spoilers. I'll leave it at that."}, {"rating": "6", "text": "The movie was ok, but I did expect much more from it, especially given that it is one of the franchise movies and previous one was considered quite good. Still, I think it was quite typical action movie that did not add much to it."}, {"rating": "6", "text": "Sure what else would I be doing on a Sunday afternoon but watch Tom Cruise being Tom Cruise. I'm not going to make the obvious joke about the title and honestly I wouldn't watch this again but it was nowhere near as bad as I expected. Yes it's full of cringey one liners and action movie clichés including but not limited to a chase scene through a parade. It's nothing new, enjoyable in the moment so if you're looking for your weekly popcorn movie fix then this is recommended."}, {"rating": "4", "text": "I have not seen the previous Jack Reacher but I know tom cruise is a great action star when given a great script. He was excellent in the mission impossible movies but not so much in this one. Just like Jason bourne the action is excellent for the most part and the villain unlike Jason bourne is pretty good and the action set pieces were very good. but one of the things that make this forgettable is the girl who is supposed to be his daughter that jack does not know about. she is very forgettable and does not add much too the chemistry of the actors. It is also very formulaic playing with many of the action movie stereotypes we have seen before. Even though Tom cruise is pretty good in this role he is much better in the mission impossible movie and I left the theater very disappointed. This movie had the potential to be good but was not"}, {"rating": "5", "text": "Slow, fairly dull, and a central story that is depressingly generic - it is only partially saved by the inspired acting of Cruise & Yarosh. The action scenes were great even if the villain wasn't."}, {"rating": "4", "text": "The plot seems to be deliberately generic, with government secrets, classified weapons, crooked agents, etc. It's the kind of movie where the constant military jargon simply drains your attention span the longer it goes on"}, {"rating": "8", "text": "When did Tom Cruise become Charles Bronson? Great escapism entertainment. Just solid action with a charismatic lead. No Academy Award nominations here just FUN."}, {"rating": "5", "text": "What’s it about?Tom Cruise returns as Lee Child’s enigmatic action hero. In an action movie. With lots of action.What did I think?The second Jack Reacher film is a slick affair with quality production, scenes, and acting. It’s hard to fault specifically but its largely by-the-numbers feel leaves little impression beyond the moment. Adding emotional constipation to an action hero is hardly a huge step but Cruise handles it well while Cobie Smulders basically reprises her SHIELD role and does a good job. Youngster Danika Yarosh also entertains but the pieces somehow just don’t come together.To be fair, it’s a fun action movie that will pass the time and popcorn, but, despite the Polish, this film just doesn’t Reach (see what I did there?) great heights."}, {"rating": "6", "text": "I generally like Tom Cruise, but this movie is very forgettable. It has a fugitive on the run three which I normally enjoy in movies or TV shows. Action sequences aren't as good as the first movie, and the side plot with the potential daughter was executed poorly. Very middle of the road film."}, {"rating": "6", "text": "Jack Reacher is back. This time he returns to Washington and he finds himself in a bit of a predicament. In his own special way he goes about setting things right.Spoiler Alert!This is an in depth review of the movie. Please be aware that I discuss the story, therefore some spoilers are inevitable. Read on at your own discretion.Initial ThoughtsLet's face it. When a short dark haired man pretends to be a tall light haired giant then something's gotta give and someone is losing out. Unfortunately in this case it's the audience who is losing.I have loved Tom Cruise since I first saw him in Legend all those years ago. He is a great actor and he made some great movies. But he should stick to playing Ethan Hunt. Because he's not Jack Reacher. I'm sorry.Having said that - it’s not all bad. In fact it is a great movie. I enjoyed watching it. Actually I had planned on seeing a different movie but quickly changed my mind when I realized that Jack Reacher was out because I had been looking forward to the film since I saw the first trailers. The StoryJack Reacher heads back to Washington to meet up with his successor in the 110th, Major Susan Turner. They’ve spoken on the phone a few times and he is curious. And as he does not have much else to do, being a drifter and all, he decides to make his way to D.C. and check her out. Maybe invite her for dinner. That’s the plan anyway.But we all know - the best laid plans never really work out and so it is not surprising that Reacher does not find Turner on his arrival. What he finds is trouble. And he finds himself slapped with a paternity suit.Turner is in jail on charges of treason, which Reacher’s gut tells him is a big pile of baloney. When he begins to ask questions he finds himself re-enlisted and with the possibility that he has a child he didn't know of.After springing Turner from jail they go on the run, trying to figure out who is after them. Reacher finds the girl who is supposedly his daughter. She is a street smart kid with a habit of recreational shoplifting. As it turns out now she is in danger too and they take her with them. As they move along several people they were in contact with end up dead.Bit by bit they piece the story together. Turner had send a team to Afghanistan to investigate the disappearance of a truck load of weapons, that should have been shipped back to the US as the troops pulled out of there. Unfortunately the team got killed by what Turner assumed was someone on the inside. When she started to investigate the murders someone higher up stepped in and had her arrested on trumped up charges of treason.From Washington they move on to New Orleans for the big show down. The bad guys get what they are due and then some. The big boss is almost getting away; luckily Reacher and Turner get help from an unlikely source when it counts and all is well that ends well. Hollywood style. VerdictOne thing is certain. Tom Cruise may not be six foot five but he is in great shape. And he still knows how to do awesome stunt and fight scenes. He and Cobie Smulders bounce the story beautifully off each other.Jack Reacher - the movie is about as far removed from Jack Reacher - the book as possible, without having to change the name. It's a good movie though. It would have been a better one if I hadn't read the book, together with all the other books in the series. The story moves along swiftly and is filled with action from start to finish. I kind of hope they’ll make another movie one day. I’m sure Lee Child still has got a few stories up his sleeve. After all he just released Jack Reacher 21. Although I haven't read that one yet. Keep your eyes peeled for a review in the future.Overall I will give the movie about 7 out of 10. Its not the greatest movie ever made; nonetheless it is very entertaining. Do you have to watch it in the cinema? Probably not. It will come out on Netflix soon enough I imagine.One question remains though. Why does Jack Reacher in the movie never gets the girl?"}, {"rating": "1", "text": "Le petit Tommy vieillit et a bien du mal à garder le cap ; sur la pente descendante, il devient une sorte d'alter ego de Jason Statham, un distributeur de mandales qui tire la gueule et joue les gros bras et ici, aucun gadget improbable et facétieux de Mission Impossible pour le tirer de l'embarras !Etonnant qu'il ait réussi à débaucher Edward Zwyck pour réaliser son gros navet aussi creux que coûteux dans lequel Tommy parade comme à la parade, comme d'habitude. Zwyck l'habitué des grandes fresques à la guimauve s'y colle comme un élève appliqué que l'on vient de mettre au piquet : il torche sa punition correctement et sans entrain, sans passion aucune.L'histoire (?) de ce pseudo-complot d'une société de sécurité privée travaillant pour l'armée américaine en Afghanistan est consternante de stupidité et l'ajout d'une pisseuse et d'une milf militaro-coincée qui collent aux basques de Tommy Terminator ne fait qu'enfoncer encore un peu plus le ridicule de cette affligeante affaire.Il reste des poursuites, des mandales et des coups de feu mais franchement où est passé Statham ? je le préfère à Cruise finalement !"}, {"rating": "7", "text": "A perfectly watchable action film, and while not exactly memorable, still one you likely won't complain about afterwards. Cruise holds up as the unbeatable but far from invincible Reacher, and Cobie Smulders as well as Danika Yarosh both play nicely against him in their differing roles. It lacks the intrigue of the first film(and the novels), and there are a few dubious jumps of logic, as well as dialog left unexplored, but the plot is easily followed and enjoyed. The biggest failing is a hold over from the first film, where the big baddie is nearly useless and the true adversary is some lacky that is built up to be Reacher's equal. In the end, the conflict wraps up like a less interesting Bourne film rather than the climactic face off you're hoping for. All in all though, worth watching if you are feeling an action film and have seen the first Jack Reacher film, but otherwise, go for the first one."}, {"rating": "5", "text": "Jack Reacher : Never Go BackUne bonne soirée, mais qui malgré tous sera oublié.Il est un bon film, mais il y a énormément de raccourci que ça devient étrange. Des scènes d'actions amenées juste pour inclure de la baston, cependant le point positif c'est que les scènes d'actions sont lourdes (on sent que les poings tellement lourds que ça apporte un brin de saveur!!)Un scénario un peu copié sur Taken mais bon... Des musiques... pas de 3DPas de DolbyJuste un film d'action landa j'en attendais tellement plus"}, {"rating": "2", "text": "If I wanted to watch some unknown actress upstage one of the greatest actors of all time and one of my favorite surprise franchises of the last 10 years . . . Well I don't want to watch that. Annoying daughter in predictable plot.  Movies are an escape from the PC culture that's constantly shoved in our faces.  I much prefer lone-wolf bad-ass Jack sans tired feminist plot-line of \"I can do everything better than you\" tripe. So do millions of men around the world who were the primary enjoyers of the first film.  Deal with it Hollywood!"}, {"rating": "0", "text": "Jack Reacher was great the first viewing, looking at it now it's utter rubbish... Then Jack Reacher: Never Go Back or another name is Jack Reacher 2 if you want to be more precise came out.... Jack Reacher: Never Go Back is a 2016 film directed by Edward Zwick and stars Tom Cruise yet again as Jack Reacher. This was even worser than the original, the villains were horrible and not in a good way, they were just plain awful and crap and the action scenes were nothing special and Tom Cruise wasn't that impressive either and walking around with some female as a partner or something and I thought Reacher worked alone lol. I saw this in cinemas and the trailer looked good but upon viewing the full film I'll simply say it sucked. This was really a bad film!"}, {"rating": "6", "text": "The first 30-45 were strong but then the story didn't align fully in the end."}, {"rating": "8", "text": "Good movie. Just like a normal type of Tom Cruise movie. Where he kicks lots of butte. In this one he's like a ghost. Trying to be like the bourne identity. Still a decent movie though."}, {"rating": "6", "text": "The initial Jack Reacher was complete. It had a great plot that had you on the edge of your seat, fantastic conversation, and character development. It would be enough for Tom Cruise and his wallet to \"never go back\" because this movie absolutely sets the \"franchise\" back. I'm certain that film schools would use this as an example if the word predictable were to refer to any movie. I sat there anticipating the subsequent line. When something comes up that will be important later, you can tell because it is so overt. The storyline is uninteresting, the acting is drab, Cruise loses interest, and the movie doesn't feel like the previous one at all. It falls under the same category as the Mummy, in my opinion."}], "recommendations": ["jack_reacher", "angel_has_fallen", "killer_elite", "mission_impossible_iii", "mechanic_resurrection", "safe_house", "taken_3", "speed_2_cruise_control", "the_mechanic", "knight_and_day", "honest_thief", "white_house_down", "cellular", "the_last_stand", "escape_plan", "the_commuter", "the_taking_of_pelham_1_2_3", "jack_ryan_shadow_recruit", "taken_2", "max_steel", "once_upon_a_time_in_venice", "the_fate_of_the_furious", "run_all_night", "pirates_of_the_caribbean_dead_men_tell_no_tales", "parker"]}