{
  "id": 1025,
  "title": "Jack Reacher",
  "starring": [
    "Tom Cruise",
    "Rosamund Pike"
  ],
  "runtime": 130,
  "genre": [
    "Crime",
    "Drama",
    "Thriller",
    "Action"
  ],
  "description": "When a gunman takes five lives with six shots, all evidence points to the suspect in custody. On interrogation, the suspect offers up a single note: \"Get Jack Reacher!\" So begins an extraordinary chase for the truth, pitting Jack Reacher against an unexpected enemy, with a skill for violence and a secret to keep.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uQBbjrLVsUibWxNDGA4Czzo8lwz.jpg",
  "categories": {
    "plot": 5.487804878048781,
    "acting": 5.3428571428571425,
    "ending": 4.714285714285714,
    "soundtrack": 7.0,
    "cinematography": 8.5,
    "familyFriendly": 6.0,
    "funny": 8.0,
    "action": 7.878787878787879
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is a superb thriller and one of my favorite films this year. Story and characters are both very compelling and it was great to see how Reacher unraveled the mystery. I don't get the negative responses and suspect most probably have to do with a personal dislike of Tom Cruise or that the movie was not exactly like the books. Regardless, I loved the pacing and thought the action was great and all very realistic. Reacher is also an extremely interesting character to learn about... very intelligent, sarcastic and witty, mysterious, and strong. He's analogous to James Bond and Cruise does a fantastic job here. I very highly recommend this movie."
    },
    {
      "rating": "7",
      "text": "The movie was going along pretty good until they had to throw in the gratutious cleavage throughout the whole second half. Her wide eyed constant disbelief look / Alex from SVU voice threw me off too.\rI can't picture Tom Cruise as a menacing tough guy. Sorry, it just didn't work for me."
    },
    {
      "rating": "9",
      "text": "For putting this character up on screen for the first time I thought they pulled this off well.  Few missteps but an overall well made movie that does the character justice while satisfying where it should.  Good time."
    },
    {
      "rating": "6",
      "text": "This was a okay story with a good story and good action scenes in it as well.But this movie gets really boring at most bit witch is the real let down. So its worth a rent but dont expect anything amazing. Jack Reacher 6.5/10"
    },
    {
      "rating": "8",
      "text": "The only thing worthy in Jack Reacher is watching Tom Cruise being a badass. Other than that is just another decent popcorn movie that will keep you entertained enough a Saturday afternoon in which you have nothing better to do. The plot is mainly exposition-driven and it becomes so convoluted at some point that you won't mind understanding the stakes in it, which aren't very interesting anyway. Rosamund Pike and Robert Duvall are enjoyable to watch, Jai Courtney has a lot of potential as an action star (we'll confirm that in A Good Day To Die Hard) and Werner Herzog is just a one-dimensional Russian stereotype. But well, the flaws don't really matter, Jack Reacher achieves its goal and Cruise reminds us why he is one of the greatest action stars of all time."
    },
    {
      "rating": "9",
      "text": "Do you want to see an entertaining popcorn movie? This one is for you.  Writer-Director Mcquarrie won an Oscar for his \"The Usual Suspects\" screenplay, and does a great job here. Cruise's character is the type of hero that always seems to be one step ahead of the bad guys, and can handle anything thrown his way. What's wrong with that?  The audience, my daughter, and myself thoroughly enjoyed this film.  I've never read any of the 17 Jack Reacher books, and maybe that is where the complaints are coming from. There have been books turned into movies that pissed me off because they were not true to the source, but the author didn't have a problem with this adaptation, and I don't think you will either."
    },
    {
      "rating": "9",
      "text": "While I thought the movie could have used a couple more action scenes the plot made up for any lack. The few fight scenes were, however, extremely well done. It's a great crime whodunnit and cruise keeps the tension and suspense going throughout. Duvall has a short part but helps make the film. Whenever there is great disparity in critic reviews (0-83). (Note that the WSJ gave the 0) my radar goes up. A scene where Reacher explains why he lives off the grid away from our programmed work/sleep routine effectively lifts the veil on those Wall St Nazis who've  literally enslaved us all and I believe that is what pissed off their media whores. Show them that you see through their smokescreen and go enjoy the film - and think about the deeper message -it's an interesting one."
    },
    {
      "rating": "6",
      "text": "Definitely entertaining. This is not a complicated film nor should anyone expect anything more than a couple of car chases and some fight scenes. Story is mildly entertaining and Robert Duval adds his usual excellence. The film is so basic that it makes slow pitch softball look high-speed, but given that even Tom Cruise could screw it up. Sorry I never forgave him for the debacle that was War of the Worlds. Captain Crazypants and the Scientology wackos must have gotten \"clear\" just long enough to make a movie that is just entertaining enough to fill the void between now and the next summer season. This is just like dating, set your standards low enough and you will never be disappointed."
    },
    {
      "rating": "6",
      "text": "Película del 2012 que apenas está llegando a nuestras salas de cine.  Noveno libro de la Saga del escritor Lee Child publicado en 2005.\rGratamente sorprendida al darme cuenta que Jack Reacher no es enteramente una película de acción, tristemente decepcionada al ver una historia  floja  y sin ninguna sorpresa con actuaciones  pobres que no reflejan el recorrido actoral de los  protagonistas.\rInicia con una de las mejores escenas de la película y el eje central, un tiroteo perpetuado a manos de un francotirador.  Francotirador que es ubicado y capturado rápidamente dejándonos pensar que su culpabilidad es inminente, sin embargo en el desarrollo de la trama las cosas cambian viendo como al entrar al juego Jack Reacher logra ubicarnos en una perspectiva diferente.\rTom Cruise protagoniza el papel del exmilitar Jack Reacher, con una actuación predecible similar a la de Misión Imposible o  Minority Report con la diferencia de que en esta tiene la habilidad de dejar mujeres suspirando por el a su paso, es Cruise el encargado de la acción, el que todo lo sabe, el que investiga, el que descubre, el que pelea,  y al final el héroe, papel que ya conoce y que protagoniza perfectamente sin ningun esfuerzo. Con mucha seriedad y pocas sonrisas Reacher se adentra en la oscuridad de un guion flojo y logra desenmarañar el complot que se envuelve en medio de los intentos de convertir esta historia en un thriller.\rExcelente fueron las escenas de acción, pocas pero creíbles, buenos  planos, coreografía, sonido y con mucha claridad en el momento de los golpes y puños, seguida por una espectacular persecución en auto con un buen montaje que no deja que el espectador pierda el plano ni el sentido de ubicación (Caso contrario al de las películas de Jason Bourne)\rTristemente desaprovechadas las actuaciones de Richard Jenkins, Robert Duval, con personajes que no aportan nada actoralmente y que al parecer solo querían un dinerito extra. Rosamund Pike en un papel mediocre, que no logra pasar de la chica en apuros a la que hay que salvar, dejando por el piso el aporte femenino de la película. Con el villano tengo mis dudas, ya que queriendo dar la sensación de temor con la historia en la que se comió sus propios dedos no lo logra, por el contrario es eclipsado por Jai Courtney (Charlie) que nos regala unos buenos momentos de acción junto a Cruise.\rEn resumen tenemos un thriller de acción entretenido con unas pequeña pizca de comedia, que intenta mezclar a James Bond con Sherlock Holmes sin éxito, pero al final logra salir airosa gracias a Tom Cruise que sin ser este su mejor papel ha realizado un gran trabajo intentando sacar a flote este proyecto junto con McQuarrie que debería pensarlo mejor antes de aventurarse nuevamente en el roll de director, sabiendo que como escritor ha obtenido mejores resultados como en The Usual Suspects.\rSi quieres pasar un rato entretenido junto a tus amigos en donde no tengas que utilizar tu materia gris Jack Reacher es la pelicula."
    },
    {
      "rating": "6",
      "text": "Jack Reacher had some good and memorable moments, but overall it just felt like a cheesy crime drama series that you can find every night on TV.  This movie is based on the book \"One Shot\" written by Lee Child, which is just one of a series of Jack Reacher novels.  So this guy is sort of an icon in the literature world, and so when they wanted to adapt a movie from it and it kind of fell flat for me.  Don't get me wrong I had a good time seeing this movie and it wasn't actually bad, but there just really is nothing here that we haven't seen a thousand times before.  This guy is a cop and he plays by his own rules, who hasn't seen that dozens of times?  I realize its based off a book, but I just didn't think he was the great and intimidating action character that the film's trailer makes him out to be.  But the main reason someone is going to see this is for Tom Cruise, I mean lets face it, if he weren't in this film nobody would care about it whatsover.  I mean just a few weeks ago we had Alex Cross and everyone was disappointed with that, and now we have another crime mystery thriller.  This almost feels like it should've been released in the summer so that it wouldn't have much high expectations with a end of the year release, but sadly it must compete with the big and powerful films of December.  Some things I did like about it were the car chase sequences, which were exciting and gave the movie a little variety.  Some of the fighting scenes between Cruse and the bad guys were fun as well, but if you watch closely you can tell that these are some of the dumbest and clumsiest bad guys I have seen in a action movie for a long time.  Christopher McQuarrie directed this movie, and I enjoy a lot of his work, so I appreciate what he was trying to make here but it just wasn't as good as it should've been.  I'm not sure if I could ever make a better movie than this, but there are some moments in this film where you know they could've fixed to make it less ridiculous.  This film is fun if all you want is a simple action flick, but as for me, I crave something a little more well done."
    },
    {
      "rating": "9",
      "text": "When you are watching this movie you will feel the energy and excitement Tom Cruise has always been one of my favorites. I think this is the one of the best movies of 2012 if not the BEST movie. Great movie and a bit humorous not all action BUT the action is crazy good."
    },
    {
      "rating": "3",
      "text": "Jack Reacher is a waste of two hours and 10 minutes, it might look like a standard shooting gallery but it managed to be even worse than that given the fact that the movie is slow, which is a surprise cause these type of movies tends to be fast, plot-less and stupid. this one is slow,plot-less and stupid.\ri mean it's not a crime movie, diffidently not an action movie and most importantly it's not an enjoyable movie."
    },
    {
      "rating": "8",
      "text": "Tom cruise is like marmite you either love him or hate him, usually i tend to go for the latter. However i found this film to be very true to the book which i respect, it had action, suspense and a bit of romance between the two main leads \"Cruise, Rosamund pike\". If you're looking for a thrill ride then i recommend you go and see this despite what the critics say this is definitely a crowd pleaser."
    },
    {
      "rating": "4",
      "text": "A movie that failed to make me care about the story at all, characters were empty and uninteresting and even thou this movie had a few scenes that were pretty well done i still found myself looking at my watch time and time again hoping this would eighter pick up or just end."
    },
    {
      "rating": "8",
      "text": "Jack Reacher is a pop-corn thriller, nothing more nothing less nor does it propose to be other than what it is.  You don't go to see this movie anticipating another Mission Impossible sized blockbuster.  This is what the critics don't seem to understand.\r How does it deliver on it's promise to entertain?  Very well.   JR is a brisk entertaining adventure with a stoic and smartly played lead by Tom Cruse.    He delivers what he promised, kick butt fun.\r In my opinion the writing is smart.   The bad guys have good dialog (while we are left feeling somewhat unsatisfied on the back-story, but this is the fault of the writers not the movie) but still feel the villians are to be feared, both for their ferocity and intelligence.\r Jack Reacher is pure fun pop-corn entertainment and is highly recommended as such."
    },
    {
      "rating": "8",
      "text": "I haven't laughed so hard in an action flick in a long while. My midnight show crowd was fairly raucous with the laughs, and there were plenty of oohs/aahs during the driving/fighting sequences, so I'm guessing this is more of a target demo film than one for the critics, who seem pretty evenly divided. It has a hard-edged pulpy feel to it - and it keeps you thinking throughout. The opening sequence is particularly brutal - it's understandable why the studio cancelled the premiere in light of the recent school shootings. Tom Cruise does an effective job in the lead (I have no frame of reference with the source material, incidentally, so the complaints over his casting are lost on me). Rosamund Pike is excellent - she needs to be in more films that require some range instead of doing the next Wrath of the Titans sequel. And Robert Duvall - it's great to see him make an appearance, even in a small role. The end left me with slightly mixed feelings, but on the whole, I enjoyed the thrill ride."
    },
    {
      "rating": "8",
      "text": "Much better than I had expected. forget the naysayers; this is two hours of good if not great cinema. I am not a huge fan of Cruise the celebrity, but Cruise the actor almost always delivers the goods and this is no exception"
    },
    {
      "rating": "10",
      "text": "This was a great film. Tom as a main actor was excellent - he really assumed the role he had to play in a way that made me feel like I understood Jack Reacher as a character and person well. The secondary main actor (character Helen) was good too - she played the role very well. The story line was just the right amount of action, mystery and a pinch of romance (very slight). The way the plot rolled out was great in that it left you wondering what was really going on at every moment - who the bad guys were, who was involved and who wasn't, what really happened and what didn't and so on. Excellent film - very much worth seeing in the theatre!!!"
    },
    {
      "rating": "0",
      "text": "Just stopped watching after twenty minutes. Nothing seemed even remotely believable and the lawyer and Reacher characters dialogues were outright ridiculous."
    },
    {
      "rating": "10",
      "text": "Decided to see \" Jack Reacher\", having read all ( seventeen? ) of Lee Childs \" Jack Reacher\" books. What a great movie!\rTense & gritty & taught &  \" Noirish\" & fast paced.\r Tom Cruise channels the \" Jack Reacher\" essence, as written by Lee Child, distilling the detection, the intellect, the minutae of \" what doesn't fit in an air tight case.\" Cruise also portrays a guy tough enough to be gentle.    Reacher:    Does Sandy work here?\rStore clerk:   What are you, a cop? I'm going to need to see some ID.\rReacher:    Go get Sandy.\rStore Clerk:   Well I need to see something.\rReacher:    How about the inside of an ambulance?\r Great pacing, editing and camera work, in dark, gritty locations.\rMoves with the momentum of Indiana Jones.\rWerner Herzog and Robert Duval deliver great performances, In short, The film delivers the goods. You will be pleasantly surprised."
    },
    {
      "rating": "3",
      "text": "You may be mystified by the unknown character of Jack Reacher, but this film is completely and utterly unbelievable. Its hard to even suspend our reality to get into the movie because the immersion sucks as we are forced to call this movie on all the holes it has. I could name three or four instances of storyline that does not make sense. Terrible movie."
    },
    {
      "rating": "10",
      "text": "Honestly. as movies get worse and worse I have become more lenient  This movie was well done. Don't expect an action pact thriller though. I loved the small anti government messages and the bad taste towards cops! love to see a movie that reaches out to the non brain washed citizen. the bad reviews are from washed up retards just wanting shock value. End the Feds! peace!"
    },
    {
      "rating": "10",
      "text": "I think Tom Cruise really played the part of this Character Jack Reacher extremely intelligently and well performed. This move is very heart pounding and get you off the edge of your own seat in the theater. I love the action and every fight scene of Jack Reacher played by Tom Cruise. To me the movie never leaves you guessing and very well written for such as well played cast. I can not wait until they make another movie with Tom as Jack Reacher, because something tells me this saga isn't over just yet. Love this movie, because I seen it two times and can not wait until it arrives on DVD."
    },
    {
      "rating": "9",
      "text": "Jack Richer for me is simple, violence, real army martial skil especially as a Military Police. Humor scripts, pure action without any sexual intercourse(maybe u guys hate it! but I prefer this kind of genre as action movie really no need any sex thingy included). Jack Richer showing that Tom Cruise really still king of the action figure besides Dennis Craig in James Bond latest franchise. I really recommended friends n colleagues to watch Jack Richer. Even I heard some of the novel fans doubt Tom Cruise as he identified not as the real character in the novel but I believed he really scored there. No doubts about it! I really looking forward to buy this blu-ray movie as well."
    },
    {
      "rating": "9",
      "text": "Enjoyed the movie very much. It was on the long side and I never looked at my watch. Cruise did a great job and it had a nice twist.  The movie is what it is !, if your looking for a good thriller then you should enjoy it. The other thing I really enjoyed was that the violence wasn't over the top."
    },
    {
      "rating": "1",
      "text": "What a load of rubbish. This flic has the most rubbish dialogue ever. It just feels unnatural and rehearsed.\rIt makes me wonder if anyone who partook in making this piece of garbage, have ever had a real life conversation. What's up with the eyes of that lead actress? Is she constantly on cocaine?"
    },
    {
      "rating": "5",
      "text": "Went into theater expecting a mix of Drive and Mission Impossible. What I got was a mix of Law and Order and Sniper. Entertaining story even if it is a little far out. Wait did I say little... The only thing I do not understand is that with Tom Cruise having so much film cred what is he doing in this film that should be staring Steven Segal or Van Damne. Certainly worth a matinee viewing though."
    },
    {
      "rating": "4",
      "text": "Thought this was going to be an old-style hero kicks-ass and blows everything up doing it, but instead it's a murder mystery with Tom Cruise out of his element in this type of mixed role. Seriously, much of this film could've played out on an episode of Dateline: NBC which specializes in murder mysteries. I wouldn't say it's a waste of time but keep your expectations decidedly low."
    },
    {
      "rating": "4",
      "text": "This movie is just too fake. Cheesy lines with illogical scenes. It doesn't matter anymore if it's starring Tom Cruise or any good actors.. If the plot and scripts are bad, then the movie is bad."
    },
    {
      "rating": "0",
      "text": "This is like a bad CSI show with more guns. Boring halting cliched dialog. Every crime film cliche you can imagine. No depth at all with any character. Tom Cruise cannot do Arnold or Clint. Too many other good movies out now to waste your time and money on this. Stay home and watch Law and Order or CSI. More entertaining."
    },
    {
      "rating": "8",
      "text": "Huge casting blunder to expect Tom Cruise to play Jack Reacher.  He doesn't even begin to portray the brooding, damaged, taut-steel machismo of the the character.  Instead we wind up with a middle-aged Top Gun playing tough guy.  It falls so short of the character presented in Lee Child's fiction that I found it difficult to get into the movie, constantly finding myself thinking \"no way Jack Reacher would come across like that\".  I guess that's the curse of having heard Dick Hill narrating the audiobook to compare against.  Aside from that, the movie is good for whiling away a couple of hours.  It grabs your attention and keeps it.  I hope we see more of Lee Child's books on the screen.  Preferably with a different lead."
    },
    {
      "rating": "3",
      "text": "Not sure why this was rated over 60% on Rotten Tomatoes. This movie is terribly paced, the story is ridiculous and frankly the whole blonde damsel in distress scene was over the top. Some scenes just drag on too long and others feel like they should have been cut out all together. This is one of those movies you watch when it's free on TV and you have nothing else to do."
    },
    {
      "rating": "0",
      "text": "Please don't waste your money on a ticket to Jack Reacher. I think some of these movie studios could save a lot of trouble, if every year they would just release a movie entitled \"Generic Tom Cruise Action Movie\". This has to go down as one of the worst casting errors in film history. The premise is just so silly; Tom Cruise is what about 5' 7\"... my grandmother could kick his butt. I don't know if I'm more disappointed with Cruise, the film studio, or Lee Child, the author of the Jack Reacher novels. I guess the only people that might find this movie tolerable are people that don't read books. Lee Child's series of books featuring this character are not exactly Melville, but they are entertaining and one thing you don't forget is his character development. If you know the stories, then you know this is a little bit like casting Cruise to play the life story of Hulk Hogan. You don't have to take my work for it; look up a facebook page called \"Tom Cruise is not Jack Reacher\"."
    },
    {
      "rating": "1",
      "text": "Tom Cruise was just a bad choice. The dialoge from the start didn't match the actor who has no depth to acheive the Reach Character. This was just a movie made for a shallow actor's skills and I was hoping for more, but got a lot less.  Fortunately I had a free pass to the movie or I would be really pissed off."
    },
    {
      "rating": "7",
      "text": "Whether the critics are Cruise-hating, or comparing this to giants in the cop/robber genre, they are not giving this film the credit it deserves.  Its a 2 hour, thinking man's procedural.  Well written, well directed, and extremely well-paced.  Its entertaining, with the requisite one-liners, fights (which unlike Nolan's Batman, are extremely easy to follow and enjoy), and great characters.\r Of course McQuarrie delivers a few twists, as much as the source material will allow, but that's not really the point.  You know who the bad guy is, you know who the good guy is, and you enjoy seeing them converge in a hail of bullets and fist fights is entertaining.\r Where the film really stands out, is that this type of character hasn't really existed in this genre.  He's not a cowboy, thrill-seeker, or invincible hero.  He's a guy who likes anonymity, quiet, and ultimately justice - by any means necessary.  He doesn't answer to a police captain or superior (thank god), he's funded by his pention and lives meagerly by preference (refreshing) so he can't be bought.  He's simply a war vet who is fed up with the stench of bureaucracy.\r I truly hope audiences give this a look, because I can say without question that Reacher is going to get better with each adventure, as his character is complex and timely where we all wish someone could just punch the loudmouth at the bar, skip the jurisdictions, and shoot the bad guys to avoid lawyers letting them go free."
    },
    {
      "rating": "9",
      "text": "A very intelligently thought out thriller with an exciting plot. cruise depicts his character well in what has been a very successful and true adaptation of the novel."
    },
    {
      "rating": "0",
      "text": "I just knew not to watch this film,thought i would give it the benefit of doubt ,IT IS TERRIBLE nothing like the book shame on lee childs for selling out,what on earth is Tom cruise thinking he can get away playing the part of a 6.5 foot military police man he is a whole foot shorter,nothing like the books,just a ego trip for Cruise    S H I T E"
    },
    {
      "rating": "0",
      "text": "After the first five minutes, this starts to feel like a bad comic book flic. You'd think with millions dollars budget they could've made something reasonably believable with a coherent plot.  As it is, the movie is just idiotic, unrealistic, and badly played.  The characters are ridiculous from the \"good lawyer\" to the oddity of the Russian ex-con villain.  No character development whatsoever.  Crazy predispositions all throughout.  And the whole thing ends with the \"bad guys\" getting together waiting for Tom Cruze to come and get them, pretty much one by one.  Yeah, sure..."
    },
    {
      "rating": "10",
      "text": "OK so Tom Cruise isn't 6'5\". He is Reacher. I went into this with very low expectations due to the middling reviews this movie has been getting.\r This movie characterizes Reacher very closely to the book, and it's well done. The plot follows the book, pretty much, to the best of my recollections.\r If you expect to walk in and find \"Ethan Hunt\" as Reacher, you'll be disappointed. If you read the Reacher on Lee Child's pages, who is a bit grim and one-dimensional (except for that enigmatic deep well that motivates him), then I find that this movie succeeds on all levels.\r Oh and Werner Herzog is deliciously slimy as a villain. Bonus.\r Rosamund Pike is the hot damsel in distress. Another bonus.\r See this movie!"
    },
    {
      "rating": "7",
      "text": "There is a very quiet opening sequence that sets up the pace for this movie, its fast, smart, and enjoyable from start to a predictable yet entertaining finish.\rJack Reacher is brought to the big screen in a small way, in the form of Tom Cruise, who doesn't exactly fit the description of the monstrous Reacher of the comics, but he certainly brings his own attitude and his own cards to the table to leave behind a very convincing role as the mysterious investigator.\rJack reacher didnt fall into the action hero book to film trap of an all out explosion frenzied movie, it tries to to form a story as its backbone which turn introduces an array of characters, all with a relevant connection to the sniper events at the start of the film.\rThe cinematography in Reacher is excellent, it really was surprising to see so much focus on individual shots for a so-called popcorn movie. From the landscaping shots of the sniper scenes to the close cam car chases, it feels more intense, especially since the particular chase scene had no score or background music at all, and it simply worked.\rCruise does bring difference to a role that many would have seen as another Ethan Hawke, but Cruise manages to draw the line in his movies where he knows what the difference needs to be, Cruise's Reacher is calm, he's isolated, motivated, but more importantly, not afraid to seek justice by any means necessary, and this was portrayed on screen.\rRosamund Pike makes a starring role as counsellor Heen Rodin, and daughter to District Attorney Alex Rodin (Richard Jenkins), there is also a minor appearance from Robert Duvall.\rWhile the turn of events and climax of the film are predictable, it still has a smart finish with guns glitz an glamour.\rThe films dialogue was very good indeed and the humorous moments in the film did show that care needed to be taken not to take the film too seriously. The close combat at work here is excellent, bizarre and sometimes horrific (using one mans head to knockout another man, while they are both lying on the floor) but again it fits well with mystery and intrigue surrounding Jack Reacher.\rFun, sophisticated, well scripted, and a convincing story, the Jack Reacher film is worth the trip."
    },
    {
      "rating": "7",
      "text": "Tom Cruise at his... maybe 2nd or 3rd best. This movie is a probably see for every action lover.  Now I can type forever but I just typed 2 long reviews on Skyfall and the video game 007 Legends."
    },
    {
      "rating": "6",
      "text": "Jack Reacher is not completely without its merits. Devout followers of Lee Child’s novels had trouble accepting Tom Cruise as the strapping, Viking-esque eponymous protagonist, but to reject Tommy Boy too early is a big mistake: for all the constantly-swirling controversy Cruise somehow continues to keep simmering, he’s as able to both fill seats and entertain now as he ever has been. In fact, Cruise’s steely cool is perhaps Christopher McQuarrie’s film’s grandest asset. One can’t quite shake the fact, though, that there should be at the very least a bit more popcorn fun to Jack Reacher. McQuarrie has assembled a sensational cast  Richard Jenkins, Robert Duvall, and even our favorite thickly-accented fusspot Werner Herzog appear here  but after the gleeful advent of their mere presence wears off, there’s not all that much for them to do. Jack Reacher wants to be a new kind of Mission: Impossible where Bourne Supremacy-esque action replaces any deep need for well-rounded character, but McQuarrie and Cruise never fully get around to successfully making their case. This is easily-digestible Hollywood fare, to be sure, but there’s not quite enough meat on the bone here."
    },
    {
      "rating": "2",
      "text": "The movie started off kind of ambiguous, but as soon as Tom Cruise's character dialogue started, I knew it was going to be bad, and it was.\r Jack Reacher is this thin, but unflinchingly arrogant (rightly so) all around badass. Close to super hero status. Everyone else in the movie has a hard time keeping their wits, but Jack Reacher shows everyone their ignorance, and gets **** done.\r Jack Reacher has one mood/tone/persona, and it never changes. The movie presents about every five minutes that it has blown your mind, but it is completely underwhelming, predictable, and cheesy.\r The two points I did give the movie were because of Rosamund Pike, who I"
    },
    {
      "rating": "0",
      "text": "This was one of the worst movies I have ever seen and it was so bad in fact that I purposefully created an account on this site just so I could talk about how terrible it was. I feel like I threw away two hours of my life and will never get it back. The lead actress was wooden and laughable, as if she were trying to emote with a face-full of Botox. Tom Cruise was standard Tom Cruise. I got so angry by the end at the fact that I had to sit through this pathetic movie that I threw my bottle of water on the floor."
    },
    {
      "rating": "10",
      "text": "\"Jack Reacher\" is awesome, much better than the overrated \"Looper\" that came out earlier this year. This action movie might not pile up a ton of action, but the action it does have is believable and exciting. Tom Cruise does yet another excellent performance. Its not the most thought-provoking mystery movie i've seen, but it is epic."
    },
    {
      "rating": "5",
      "text": "I'm a fan of Tom Cruise the actor, but he doesn't cover any new ground in this over the top, ludicrous film.  Your eyes will be rolling throughout.  It isn't a horrible film, and it is mostly watchable and entertaining, but you really have to ignore all the implausibilities and go with it.  This was my first exposure to the lead actress Rosamund Pike and I wasn't impressed.  Her acting was unrealistic and unemotional throughout.  I don't know if the director was responsible or if it was her decision but she didn't behave like a normal person, particularly in the hostage scene.  The Robert Duvall character was really ridiculous.  You really felt like you were watching a poor version of Dirty Harry.  I can't quite recommend it, but I've seen so many movies like this throughout my life I've become jaded by them.  A younger person might like it more."
    },
    {
      "rating": "9",
      "text": "It's official. Hollywood critics have it in for Tom Cruise. How else can we explain Jack Reacher's aggregate low scores? This is not Oscar worthy stuff. But as far as movie entertainment goes, JR was a very satisfying action thriller. In fact, I enjoyed it much more than the latest James Bond flick (Skyfall) which has garnered across the board positive reviews. Say what you will about Cruise (and his controversial views / behavior ) but let's at least be fair!  Writer-Director Christopher McQuarrie has made a very entertaining movie. This is the best Tom Cruise flick I've seen in years..."
    },
    {
      "rating": "0",
      "text": "Possibly the worst character casting of any book to film movie. This version destroys the only main character of the book and therefore renders the movie laughable. If you are a Lee Child fan, stay away from this film and retain your original character. Tom Cruise sucked also."
    },
    {
      "rating": "1",
      "text": "What a joke.  Did the people who made this movie even look at the books, let alone read them!  A violent mish mash of badly passed scenes full of cliches.  Tom Cruise id a midget compared to what the character is supposed to be.  Not to mention WAY to much plastic surgery and botox.  Relay violent, and cliched, with no satisfaction to be had.  Save yourself the money, and if you must see this, wait for it on cable, which may show up as early as next week considering how terrible it is."
    },
    {
      "rating": "6",
      "text": "The film starts off very stylish, looking every bit the classic cop movies of the 70’s and 80’s. Sadly it does not keep this early promise and soon slips into the usual cliché‘s that have haunted many more recent cop films. I found it very hard to connect with any of the characters, although all the performances were very good. I did particularly like Werner Herzog as The Zec, a particularly shady character; other than that it was pretty mundane. I found it a bit bloated and over-long although it did pick up towards the end.\r SteelMonster’s verdict: RECOMMENDED (Just)\r My score: 5.8/10."
    }
  ],
  "recommendations": [
    "jack_reacher_never_go_back",
    "alex_cross",
    "mission_impossible_iii",
    "16_blocks",
    "knight_and_day",
    "contraband",
    "angel_has_fallen",
    "the_losers",
    "jack_ryan_shadow_recruit",
    "kingsman_the_golden_circle",
    "daredevil",
    "killer_elite",
    "venom_let_there_be_carnage",
    "mechanic_resurrection",
    "parker",
    "safe_house",
    "the_mechanic",
    "run_all_night",
    "lucky_number_slevin",
    "jumper",
    "pirates_of_the_caribbean_on_stranger_tides",
    "iron_man_2",
    "red_2",
    "the_guardian",
    "hancock"
  ]
}