{
  "id": 3633,
  "title": "Jane Got a Gun",
  "starring": [
    "Natalie Portman",
    "Joel Edgerton"
  ],
  "runtime": 98,
  "genre": [
    "Western",
    "Action",
    "Drama"
  ],
  "description": "After her outlaw husband returns home shot with eight bullets and barely alive, Jane reluctantly reaches out to an ex-lover who she hasn't seen in over ten years to help her defend her farm when the time comes that her husband's gang eventually tracks him down to finish the job.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lef7Fnj3gOoFKNYpuZ8qq1FBj55.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 6.538461538461538,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.5
  },
  "reviews": [
    {
      "rating": "0",
      "text": "terrible. shows that when hollywood idiots (like portmna) pretend to be producers this is the king of garbage that happens"
    },
    {
      "rating": "6",
      "text": "A grim but well-acted western with Natalie Portman and Ewan McGregor as you've not seen them before. Slow in places, but has the obligatory comeuppance for the bad guys in the end."
    },
    {
      "rating": "4",
      "text": "With a title like this, you’d expect Jane to be a kick-ass gunslinger. Not the case. It’s set in 1870s New Mexico, where a woman (Natalie Portman) pays her ex-lover (Joel Edgerton) to help save her wounded husband from an outlaw gang (led by an unrecognizable Ewan McGregor). It’s Edgerton who handles most of the action, but those scenes are in short supply. Much of the narrative is spent in flashbacks that show how they ended up in this situation and in quiet conversations about their relationships. Even with a strong cast and some decent gunplay, so much of this film focuses on those tedious personal interactions that I wanted to use the gun on myself."
    },
    {
      "rating": "7",
      "text": "After he is nearly shot to death by a band of outlaws, fur trader and reformed criminal Bill Hammond (Noah Emmerich) rides home to his wife Jane (Natalie Portman) and their daughter.  As he lays bleeding, he warns her the dangerous mob will come again, so she enlists a reluctant guardian:  Union hero and former lover Dan Frost (Joel Edgerton).  Jane and the two men reflect on their complicated and painful shared history as they prepare for a last stand.  The pulpily titled Jane Got a Gun is already infamous for its tortured road to the silver screen:  Scottish art-house director Lynne Ramsay quit the production just a day or so before filming began amid legal and personal conflict, precipitating a litany of changes in front of and behind the camera.  Later, original distributor Relativity imploded during post-production; as a result, the film was sold to the Weinstein Company and ambivalently scheduled for release during the January doldrums.\r This unenviable lineage invites contrary readings:  it is a bit mystifying why so many incredibly famous and talented people endured so much headache-inducing behind-the-scenes drama to realize what is ultimately a minor siege Western with inconsistent pacing and an overly tidy ending.  There is no major (feminist, genre-upending) revisionism nor is it a particularly detailed exploration of love and life on the frontier.  The prestige of the people involved and those almost involved (Ramsay, Michael Fassbender, Jude Law) indicated, at least to me, a more intricate, lyrical, and/or visceral experience on par with The Proposition, The Assassination of Jesse James by the Coward Robert Ford, or the 2010 True Grit, but this was either never the case or myriad idiosyncrasies were smoothed along the way.\r Having said this, honorable replacement director Gavin O'Connor has not made a -bad- film.  Far from it.  As a small-scale genre exercise, it delivers certain pleasures, including expansive, parched vistas; a degree of slowly burning suspense culminating in a well-executed set piece; and dynamic lead performances by Portman and a particularly charismatic and stout Edgerton, as well as a welcome dose of camp antagonism courtesy of an underutilized, but game Ewan McGregor."
    },
    {
      "rating": "4",
      "text": "Jane Got a Gun is the most boringest western I've ever stared at. The characters are boring, the actors are boring, the action is boring, the story is lame, and it just drags itself like a zombie for 2 hours. Bleh."
    },
    {
      "rating": "5",
      "text": "i would say the film has very strong aesthetics; the cinematography, the costumes, music. otherwise the story is just so so. its not a bad film, pretty moody in some scenes."
    },
    {
      "rating": "8",
      "text": "Like the old westerns of the John Wayne days, this movie was very similar in style.  Not a lot of talking, not a lot of doing, just getting it done.  There was a back story of course, and we see it slowly in flashback, and it gives meat to the \"cut to the bone\" story line.  About the only change made for today is the heroine; in the old days, it would have been a young boy."
    },
    {
      "rating": "3",
      "text": "How many times do I have to warn those guys? Princess Padme isn’t worth fighting over. Even Darth Vader threw himself in a river of lava to burn the memories away.\r The scene is the Old West. Take one homely looking woman and two average-looking men and throw them in a cabin together. Now GO! That’s your scene. It’s improv at it’s finest. Actually, that’s sarcasm. Basically everybody just stares longingly at each other and remembers how it used to be. Sigh.\r Did I say that man #1 used to be her fiance while man #2 is covered with gunshot wounds. Did I say that this is Natalie Portman we’re talking about? Hrck! I think it’s happening again! Hrck! Swallow! I think I got it.\r And did I mention that man #1 went off to war and was presumed dead on account of him never writing but he couldn’t ’cause he was one of those prisoners of war in one of those camps and didn’t get out until the Civil War was called on account of rain? Isn’t that how it all went down? Oh, the angst! What’s a princess from another galaxy stuck in the Old West to do?\r Well, man #2 got shot up good by the bad guys and the gangs on their way to finish off the job. Since we all know that a woman needs a man around to protect them (that’s the movie talkin’, not me), Princess is off to lay a guilt trip on man #1. “Get outta my face,” he says and then quickly follows her. Oh, the angst! She really loved him before presuming him dead and running off with some guy to have his baby. On the Old West. In a run-down cabin. Just because it’s the Old West, do we have to live in a run-down cabin? I reckun so. Hand me my gun.\r As you may have suspected, I’m not a huge fan of westerns (or Natalie Portman). She’s nice enough on screen, but I just don’t see her as the type to have two gruff men fightin’ over her. There’s plenty fish in the dusty Old West, boys! They’re just floppin’ round and gasping for air!\r This movie seemed plumb full of devices fixin’ to tear you up and man-i-pu-late your feelings. They don’t rightly work, but there’s all over the place."
    },
    {
      "rating": "9",
      "text": "Maybe Natalie didn't ever really really occupy this character, but she did pretty well. For an actress who always seems so young, it was nice to see her be a mature woman. The other characters were first-rate, IMO. Joel Edgerton has quite a future as an actor and writer, and Noah Emmerich played it perfectly. He could've over-dramatized that role; maybe the director had a say in that, yeah? I reckon. I thought the pacing of the story was perfect, and enjoyed the flashbacks. Finally, the cinematography was beautiful; this movie is loaded with jaw-dropping shots. Oh yeah, all the sleazeball bad guys were very entertaining! Holy Toledo, what a bunch of creeps!"
    },
    {
      "rating": "8",
      "text": "A woman's preparation to fight the outlaws.\r Probably on underrated film, but for me, I'm sure it is an underrated film. From the director of 'Warrior', another excellent film to include in his filmography. A well written screenplay, but that's where the problem is according to those did not like it. Because it was kind of 'all's well, ends well' story. That does not mean it is full of cliché, maybe they expected the film to be more harsh and violent like most of the high profile western films do.\r Sorry to those who did not enjoy it, but I did. It was nothing like only for men, but still R rated. Yep, I understand the last 10-15 minutes was so intentional, so what, the story wrapped perfectly in a right way. I must appreciate the cast, particularly the lead two actors, Natalie Portman and Joel Edgerton. This film is not an opportunity to give the best character display, but everyone did their parts quite finely.\r Ewan McGregor was a disappointment with his useless role. I mean it was a good one, but not made for him. I think the villain character lacks the toughness. That leaves it a one sided theme, so you might not know how the developments happen, but you will know which way is it heading in the earliest. Particularly as it was focused more on the romance, despite it is not a romance theme. Though there is a twist and many turns in the narration. Overall film was very entertaining, partly predictable, yet totally worth a watch if you keep your expectation locked in a safe afar while watching it.\r 8/10"
    },
    {
      "rating": "6",
      "text": "An okay western that is good enough to recommend because of its performances.  I honestly was hoping for more from director Gavin O'Connor but with the problems this film had decent is the best we can get.  B-"
    },
    {
      "rating": "5",
      "text": "By far, if you want an enjoyable movie that you want to watch, watch something else. Jane Got a Gun will be only enjoyable by your opinion and your taste."
    },
    {
      "rating": "6",
      "text": "It's an okay western. Decent acting and cinematography, but mostly predictable and somewhat lame story."
    },
    {
      "rating": "6",
      "text": "First of all, if you want to see something new and fresh in this movie - there is nothing really. Ok, I agree, movies should not be rated only in comparison with other movies but on their own too - so, first of all, while acting is not bad, the story itself is not that entertaining and actually is quite predictable from the beginning to the end. Even some twists they try to put in there do not feel like twists and you feel like - ah, whatever, this does not really change things here. It was ok and well acted, but certainly not a movie to remember for a long time and it lacked something in the storyline to be a greater movie"
    },
    {
      "rating": "4",
      "text": "The movie had a lot of trouble being made from changing multiple directors, delays, and shifting around roles. Which becomes apparent throughout the movie. All the actors do a very good job to keep the movie relevant though. Even with good performances the movie never able to overcome its troubled past."
    },
    {
      "rating": "1",
      "text": "J’aime bien le titre qui promet beaucoup, un titre évidemment difficile à traduire en français sinon que par… « Jane a un flingue… et ça va chier ! » et puis on aime bien sûr beaucoup Natalie, a fortiori dans un western qui tire sur la corde… féministe ?Que nenni… ou si peu, hélas ! Car en vérité, ce n’est certainement pas un film sur Calamity Jane ! c’est juste une calamité, à savoir un western dodo à deux de tension à dormir debout. Le réalisateur Gavin O’Connor est coutumier du fait et via un scénar déjà faiblard, il n’en tire qu’un film plus poussif encore ! c’est dire si on se fait chier à mort là-dedans…On aura reconnu dans le rôle du « méchant » un certain Ewan McGregor… pas convaincant du tout. On ne tient bien entendu pas jusqu’au bout même si cette mollesse indescriptible a au moins un avantage : la mise en scène est calme et posée, y compris dans les (très) rares scènes d’action… qui couvrent à peine le bruit de mes ronflements."
    }
  ],
  "recommendations": [
    "cry_macho",
    "live_by_night",
    "savages",
    "those_who_wish_me_dead",
    "allied",
    "widows",
    "wonder_woman",
    "taken",
    "cold_pursuit",
    "no_country_for_old_men",
    "the_magnificent_seven",
    "no_escape",
    "donnie_brasco",
    "the_town",
    "the_accountant",
    "x_men_apocalypse",
    "man_on_fire",
    "the_punisher",
    "public_enemies",
    "the_marksman",
    "3_days_to_kill",
    "good_people",
    "the_gunman",
    "x_men_origins_wolverine",
    "wall_street_money_never_sleeps"
  ]
}