{
  "id": 4141,
  "title": "Jarhead",
  "starring": [
    "Jamie Foxx",
    "Jake Gyllenhaal"
  ],
  "runtime": 123,
  "genre": [
    "Drama",
    "War"
  ],
  "description": "Jarhead is a film about a US Marine Anthony Swofford’s experience in the Gulf War. After putting up with an arduous boot camp, Swofford and his unit are sent to the Persian Gulf where they are eager to fight, but are forced to stay back from the action. Swofford struggles with the possibility of his girlfriend cheating on him, and as his mental state deteriorates, his desire to kill increases.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/55WJCdayHwoXJwRv3prpqscHt2q.jpg",
  "categories": {
    "plot": 5.235294117647059,
    "acting": 7.222222222222222,
    "ending": 6.714285714285714,
    "soundtrack": 9.0,
    "cinematography": 9.5,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 8.470588235294118
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Most of the people who have had something negative say about the movie are most likely stuck up civilians who always get what they want. To actually relate to this film you have to be a jarhead yourself. I found this movie very comforting because I can relate to it. No marines wear suits like that in 112 degree weather but that didn't detract my view of the movie. I gave this movie an 8 because marines go through things like that including suicide. Good job representing the devil dogs. Oorah!"
    },
    {
      "rating": "10",
      "text": "I am surprised that this didn't recieve a better score than it did. A huge majority of the reviews that I've read say how 'terrible' the film is because it has no huge forward motion into action or anything. But, excuse me, but Isn't that the whole idea? I'm sorry, but I loved the fact that this was an actionless war film. Not all war veterns see action all the time like in some other war films, so it's a relief to see some change in the genre. I recommend this movie to anyone who doesnt have a problem with a near actionless story. If you come in to this film looking for a good action film, you're going to be bored. If you go in to it looking for a character driven story, then you'll enjoy it."
    },
    {
      "rating": "8",
      "text": "This is a film that does not pull its punches when it comes to visualizing all aspects of war. It really gets the terror and despair but really broke new ground when it came to showcasing uneasy camaraderie and ESPECIALLY showing boredom. Jake Gyllenhal gives an incredible performance, and the great script and visuals will leave an impression on you."
    },
    {
      "rating": "7",
      "text": "It's a pretty solid movie depicting the horrors of war in a very cynical light. What I missed, though, was some sort of clear objective or better written characters with actual development, instead everybody behaves in the same melodramatic, but still very brunt, way over the entire movie."
    },
    {
      "rating": "10",
      "text": "how could it be rated 58 by paid critics is crazy, no doubt why it get a 71 from users : it's literally one of the best war movie.In my opinion, it is as good as a full metal jacket at showing war through the screen. I mean real war, not rambo."
    },
    {
      "rating": "5",
      "text": "surprised that this didn't recieve a better score than it did. A huge majority of the reviews that I've read say how 'terrible' the film is because it has no huge forward motion into action or anything."
    },
    {
      "rating": "3",
      "text": "If they were trying to show the boredom of war, they succeeded pretty well, because this movie is pretty boring and pointless. Very little entertainment value. Boy, I sure hope the real Marines aren't really like that."
    },
    {
      "rating": "9",
      "text": "The actors are great, the music is great, the atmosphere is great and the movie is great."
    },
    {
      "rating": "8",
      "text": "Good performances in a movie that was a bit outstretched and needed more action. Interesting aspect on the war however. More the war that went on in the soldiers minds."
    },
    {
      "rating": "9",
      "text": "At first, this movie was funny as hell! It made me laugh. A lot of masterbation jokes...then they hit the desert... I felt sick after this part in the film. Not from the action in it. In fact there really was no action in this film. It was the mind set of the Marines and what they saw in the Gulf that messed with me. They wanted to kill. That messed with me. The pills they had to take, the burning oil wells, that horse, the endless air strikes, this movie had such powerful cinematography/imagery in it... If you went to see an action film, I recomend Black Hawk Down or something like that for modern warfare movie cause JARHEAD is a mind-f..."
    },
    {
      "rating": "10",
      "text": "Wow...this movie blew me away. I am not all that surprised that the US Media is panning the reviews. They really want to see \"war\" don't they? Well, this is far deeper than that."
    },
    {
      "rating": "3",
      "text": "The movie evoked no emotions in me. Pointless and plotless."
    },
    {
      "rating": "8",
      "text": "Talk about missing the point. In an age of hi-tech weaponry the soldier's role is something of a grey area - a point the film makes with some visual muscle."
    },
    {
      "rating": "8",
      "text": "i clapped at the end of this movie - i thought it was interesting in not following a predictable script and faithful to the plethora of information that was in the book, i think those who read the book would appreciate the movie better. And yes the detailing of male sexuality in the military is not for everyone's delicate ears, but it happens and probably a lot more obscene than this."
    },
    {
      "rating": "10",
      "text": "I have many family members who have or are serving this country. I thought the movie was on target. I'm glad it was'nt blood and guts or making any political statement. Leave that to Michael Moore. Jake rocks."
    },
    {
      "rating": "9",
      "text": "I thought this was a great movie. Any arguement that there wasnt enough killing completely missed the point of the movie. Unfortunately people like that are the reason that film makers feel the need to explain the movie at the end."
    },
    {
      "rating": "10",
      "text": "When the movie ended people just sat a staired in aww... Now that's an amazing movie."
    },
    {
      "rating": "10",
      "text": "It's funny how the only 2 \"negative\" reviews by \"professional\" critics ARE negative because of minute details they don't care for. Being in OIF in the Army I saw Iraq first-hand, not from a movie theater whining about not enough butter on my popcorn like the critics who didn't like this movie. The moral of this you ask? It's simple: don't talk sh.t about something you don't know about aside from a movie you watched."
    },
    {
      "rating": "8",
      "text": "Those who are complaining about the lack of action in this movie seem to be missing the point of it. If you want action, go see Chuck Norris. The picture demonstrates what war has become: impersonal, distant, so much so that those who trained for it find they have nothing to do in it--that it's all happening miles away. That in fact they are unnecessary. And we actually sympathize with them when their only triggerpull is foiled--very absurd. Gyllenhal is great, and Saarsgard even better. He is bound, I think, for great things. It is not a revolutionary movie on the scale of Apocalypse Now, but it is worth seeing, unquestionably, and is far better than rated here."
    },
    {
      "rating": "8",
      "text": "It might not have a very clear point about anything, and it isn't really all that original, but it's extremely entertaining nonetheless. The script is hilarious and the performances do it justice."
    },
    {
      "rating": "5",
      "text": "Boring. This movie has such a lack of a plot. Its one of those films where they try to pull off showing you just a bunch of stuff that happens, without any clear storyline to carry it along. Obviously, when it comes to real life, we don't have perfect little conclusions to different parts of our lives, but I think that that's a good reason not to turn some true stories into movies. I don't know about the actual book, because it might have had a much more clear plot. Or not a plot, really, but at least more of a sense of closure. A lot of people on here have been railing at the REAL critics for saying not enough happened during the film, and mistaking this to mean that the critics were expecting it to be an \"action\" film. Honestly, I don't really care for action films. And if I thought that that was all this movie was going to be, I might not have gone to see it (though I do like war films, as long as they have some kind of meaning; this film had neither action OR meaning). On the bright side, many of the actors did a tremendous job with a less than brilliant script. Its not to say that the movie isn't entertaining at times, but it just leaves you feeling empty at the end, and unsure of what you're supposed to take away from it. Yes, there is the argument that the whole idea is that a lot of these guys didn't actually get to do ANYthing in the Gulf War, but that's no excuse for a lack of a real story. There are a lot of loose threads that could have been made into something more to help better translate the feelings these soldiers felt about not really doing much. Every time an occasion like this comes up, it doesn't lead anywhere. David Denby, of The New Yorker, noted that the characters are mysteries. There is obviously something bothering each of them, but we never get to find out exactly what. The end of the film is extremely anticlimactic. The film didn't have a political statement to make, nor did it need to. When one soldier starts to bring up politics, another chastises him saying, \"F*** politics. We're here now.\" I took this line to be like an aside from the writer, or maybe even Sam Mendes, as if to say, \"That's not what this movie is about. This movie is about the soldiers.\" Except it"
    },
    {
      "rating": "1",
      "text": "The movie is bad. And worse, boring. The fact that there is only about 5 minutes of combat (grenades exploding all around our heroes,no gunfire) is bad enough. However, when the story drags down and the characters are lifeless and emotionallly absent, it really makes for a bad film. A waste of 9 dollars. Avoid at all costs!"
    },
    {
      "rating": "3",
      "text": "I wish I never saw this movie because I lost respect for Sam Mendes. American Beauty was brilliant. Jarhead is flat, narcissistic, contrived and totally overdone. I guess now that Sam is a Hollywood big shot he has gotten a bit to impressed with his own ego. Wreched movie."
    },
    {
      "rating": "0",
      "text": "Just plain horrible. Language and disturbing content pretty accurately spelled out on the cover. It's not entertaining at all."
    },
    {
      "rating": "10",
      "text": "A wonderful, funny, exciting movie ! We don't see movies against war nowadays and this one is brillant!"
    },
    {
      "rating": "3",
      "text": "It kept my interest, if only because I was hoping for a scene or maybe a line that would get me thinking. It never did. Visually, it was well done. Intellectually and story-wise it was complete garbage."
    },
    {
      "rating": "0",
      "text": "A poor, dull film. Nothing happens in this film. The worst true story ever. It is a concept which can't be done well in a film. The characters are loud and annoying. It deserves a much lower score."
    },
    {
      "rating": "9",
      "text": "Sorry America if your appalled. Yes we make dick jokes, yes most women don't make it and YES we do a lot of stupid shit when we are bored. More real than America was ready for."
    },
    {
      "rating": "9",
      "text": "I thought the movie was excellent, and captured the essence of the book very well. My wife hadn't read the book, and having seen the movie she wants to read the book too; she liked the movie a lot too. People expecting a giant war movie may be disappointed, but they should know better -- the war was Desert Shield and Desert Storm, after all. The real story is the overall experience of being a Marine, through arrival, training, peacetime military, buildup to war, battle, and return to civilian life. Jake Gyllenhaal's acting is very good. He has a convincing intensity. Peter Sarsgaard is very good also. Jamie Foxx doesn't get a lot of screen time, but his part is important, and he is excellent. Chris Cooper has little more than a cameo, but he plays it well too. The directing is excellent; Sam Mendes picked up lots of awards for _American Beauty_, and he has done another fine job. The cinematography is impressive too. The screenplay does a great job of matching the mood of the book, which was a huge seller in 2003. Given the timing of the movie, during another war in the same country as the one featured in the book and movie, some people might expect a political message. There is practically none at all. It's not about why the Marines were sent off to that war, it's about their experiences as Marines, particularly Swofford's experiences. Some people may take away a political message, but if they do they're reading their own attitudes into the movie, because the movie is strongly apolitical. The one Marine in the movie who brings up political issues is shouted down by the others. The sole exception is wartime censorship; when the media visit, the soldiers are annoyed that their censorship orders go absurdly beyond protection of military information."
    },
    {
      "rating": "0",
      "text": "Dude hollywood should be ashamed.the marines in this movie r portrayed as a bunch of immatures, sex cravin. desecratin, whinin a holes. i know marine that dont and never did act like this.u will never see a troop act like this that dont all need to be pistol whipped."
    },
    {
      "rating": "1",
      "text": "One of the worst scripts ever written--pointless, boring, disconnected... the movie felt endless."
    },
    {
      "rating": "10",
      "text": "Take it from a vet of the gulf war era, this movie kix buttocks."
    },
    {
      "rating": "8",
      "text": "Mendes delivers a riveting movie experience. The first half of the film is fantastic. It loses it's way in the second half and is too long. Lacking a decisive end that the audience would appreciate, it nevertheless mimics its subject by being ambiguous about a military exercise in futility. A military trained for a type of war that has passed it by technologically. Memorable scenes and moments that will stay with you for a few days."
    },
    {
      "rating": "10",
      "text": "Please go see this movie. It has no agenda other than to honestly tell the personal cost of war. I was moved emotionally; challenged intellectually; and angered politically. Amazing. Powerful."
    },
    {
      "rating": "4",
      "text": "Some parts of the movie were funny but mostly, this movie is a waste of time. The script and plot are not very solid the whole way through...the climax is very disappointing especially. This movie never picks up pace at all. This is fundamentally an anti-war movie that just leaves a bad taste in your mouth after seeing it. The trailer did look pretty neat and if you have a stomach for unnecessary violence and sex from a negative perspective on war, you can go ahead and rent it."
    },
    {
      "rating": "8",
      "text": "From the begining one can easily tell that this movie is not like any other war movies. It opens with action and not of war but what Jake Gyllenhaal's character endures as he has \" mad a wrong turn on the way to college\". This movie contained some of the best shots i have ever seen and even tho many will agree that the movie was slow through the middle to the end then i would have to say the film accomplished exactly what it wanted. To show the disappointment and the experience of waiting. It almost is a metaphor. Great performance by gyllenhaal showing his crazy side once again"
    },
    {
      "rating": "7",
      "text": "Too much music, perhaps, in certain scenes when silence would've better described the boredom of a Desert Storm soldier? When Tony(Jake Gyllenhaal) cracks from all that sand-induced ennui, it's a little jarring because T. Rex is entertaining us as he descends into madness. But \"Jarhead\" ends intriguingly because the narration(presumably lifted from Anthony Swofford's memoir) seems to be at odds with the filmmaker's attitude towards this new generation of war veteran. The filmmaker places a Vietnam veteran on the soldiers' homecoming bus, which has the effect(intended, I think) of making Gyllenhaal's narration at the end sound overblown. \"Jarhead\" is simultaneously too mainstream and ideologically subversive."
    },
    {
      "rating": "10",
      "text": "These mixed reviews are crazy talk, and baffling coming from film critics who one would think would appreciate something a bit less formulaic. the fact that jake gyllenhal's character is reading camus' \"The Stranger\" throughout the movie should illustrate the pure absurdity of the situtation, as the experience of the soldiers in the Gulf War are equated to the experience of unfathomable persecution. Very existential, excellent performances, beautiful cinematography that can only be appreciated on the big screen."
    },
    {
      "rating": "5",
      "text": "Has some good lines and a few good scenes...but otherwise a bland, boring, incoherent mess filled with just as bland, boring, and incoherent characters."
    },
    {
      "rating": "9",
      "text": "I agree w/ James M. No need to make another \"bloody\" sensationalized war movie. It was really interesting to see a whole other perspective, especially on a war that seems to be having a longer more hideous real-life sequel, now."
    },
    {
      "rating": "0",
      "text": "This is one of the WORST military movies, and a complete disgrace to the marine corps, and our government. Besides the fact it has no story line and a dumb ending, the film is useless. Don't waste your time, money or brain on this one---remember I told you so....not even worth seeing on video if they let you have it for free---SERIOUSLY!!! This is a stupid, liberal, hollywood jerk off film."
    },
    {
      "rating": "10",
      "text": "Wonderful...Best movie ever made."
    },
    {
      "rating": "8",
      "text": "What are these downvoters talking about? This movie was surprsingly apolitical."
    },
    {
      "rating": "9",
      "text": "Breathtaking. Moving without being maudlin."
    },
    {
      "rating": "10",
      "text": "I really enjoyed this movie. The action was good and it had a great story. i recommend that if you are into war movies that you definnitely go see it."
    },
    {
      "rating": "10",
      "text": "Nothing short of spectacular. Jarhead pulls all the right kind of emotional punches. Amazing Performances by Jamie Foxx, Peter Sarsgaard, Chris Cooper, Lucas Black. But a truly sensational oscar calilber performance by Jake Gylenhaal. Mendes never fails to amaze me. After only 3 films he can be consider a living Directing ledgend. This may not be his best film, but it'll definatly be the best of the year"
    },
    {
      "rating": "9",
      "text": "I really loved this movie. Great cast, everyone played their parts well. Another great direction from Sam Mendes. It had comedy and drama. Not much action though, so please don't go into the theatres expecting a thrilling action shoot-em-up movie or you'll be disappointed. [***SPOILERS***] It was a very graphic and unflinching look at the marines in training and fighting in the first Gulf War. Not just the physical aspects of war, but also the psychological and emotional (the desert heat, sleeping in sand holes, unfaithful partners back home, the futility of their mission, no right to free speech, censorship to the media, initiations, the loss of comrades, etc). I didn't see it as anti-war propaganda at all. I recommended this movie for those who are interested in seeing what it is like in the military, from the point of view of a former marine."
    },
    {
      "rating": "6",
      "text": "A reasonable film, but by no means anything spectacular. Some unnecessary and unexplained scenes were partly at fault for it being a tad weak, coupled with its huge, long-winded build up, and hugely disappointing anti-climax."
    },
    {
      "rating": "9",
      "text": "Terrific. Sadly overlooked by the academy...at least for best cinematography. I have a feeling it'll be more appreciated in a couple decades or so...when the soon-to-be legendary Mendes releases a box set. Remember...Apocalypse Now was mixed reviewed when it was first released."
    },
    {
      "rating": "10",
      "text": "Jarhead is not perfectly executed, but that fact is neglible in rating. It is many profound and poignant statements on many contemporary issues. If you're lazy or only half-interested while watching film you will probably fail to realize it's about much more than just the profound effect of war on a human being. It is equally about the man before this change, and about the state of his society. Naturally, these themes can also strongly be found in the director's previous work, American Beauty. And a note to those unsure: the depictions in the film are accurate. The filmmaker was actively directed by two former marines, one who served in Vietnam and another who IS the main character in the film (and wrote the memoric-ish book the film is based on)."
    }
  ]
}