{
  "id": 2010,
  "title": "Jason Bourne",
  "starring": [
    "Matt Damon",
    "Tommy Lee Jones"
  ],
  "runtime": 123,
  "genre": [
    "Action",
    "Thriller",
    "Mystery"
  ],
  "description": "The most dangerous former operative of the CIA is drawn out of hiding to uncover hidden truths about his past.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xA7N41glw17MBQtcWSm2eBlBRuG.jpg",
  "categories": {
    "plot": 4.340909090909091,
    "acting": 3.6153846153846154,
    "ending": 4.4,
    "soundtrack": 5.0,
    "cinematography": 4.916666666666667,
    "familyFriendly": 4.4,
    "funny": 5.0,
    "action": 4.625
  },
  "reviews": [
    {
      "rating": "6",
      "text": "I was excited when i heard there was gonna be a new Bourne movie, especially since Matt Damon was back. Then i saw the trailer, and i got even more excited. But that was about as excited as i got. The movie itself was.......good, just.\r Firstly the action was great, exhilarating, tense, well choreographed. The acting was good, Matt Damon himself does a stellar job on his return to the character, the supporting cast was good too. The story was decent, but i couldn't help but feel it was useless. Nothing gets accomplished at all, Bourne just finds out a few things about his dad, there was really no other major threat. The movie itself just felt recycled.\r It was still a little enjoyable but it really wasn't necessary to the series."
    },
    {
      "rating": "4",
      "text": "I have been a fan of the Bourne movies and books for a while but this one does not stand up well to the rest including Jeremy Renner (Which I still enjoyed but wasnt as good as the first three) it tells a similar story to the first three in one but not as well the action scenes pale in comparison as does the story to the rest of the franchise."
    },
    {
      "rating": "0",
      "text": "As is normal for Hollywood, they won't won't let a franchise die until it's so bad, it's an embarrassment. This utter waste of celluloid isn't worth watching and for those who actually enjoyed and appreciated the first or third Bourne film, this is an insult. Don't let yourself be dragged into this pointless mess. It's also proof positive that actors and actresses have no morality at all when it comes to quality in film. Matt Damon, Alicia Vikander, Tommy Lee Jones and Vincent Cassel, you should all be ashamed. In order to maintain the status of a good or even a great actor, you can't prostitute yourself. You are totally diminished by this crap."
    },
    {
      "rating": "6",
      "text": "Matt Damon scowls his way thru another movie by Paul Greengrass, whose specialty is hard-driving action, shot and editing in such a frantic manner that it's hard to follow. Bourne is lured out of hiding by his ex-CIA boss (Tommy Lee Jones) in an attempt to stop a dangerous data leak. Once it starts rolling, the film's momentum is non-stop, but most of the stunts have been done before (with the exception of a crazy chase scene thru Vegas that defies physics). The operations machinations keep the audience wondering what's next (and sometimes what's happening), but there aren't any surprises. Nothing new or exciting here, but the movie still supplies fast-paced, vigorous entertainment."
    },
    {
      "rating": "3",
      "text": "Can't watch camera shake abuse. Please stop use this technique. During intense action scenes is tollerable but while people are talnking or simply walking I don't think is necessary. Damn I really wanted to watch it."
    },
    {
      "rating": "6",
      "text": "When is enough….enough ? The Jason Bourne franchise is terrific. Matt Damon is terrific. In this movie, Tommy Lee Jones is a terrific bad guy. Cast is terrific so why only a 6  ?? Three 10 minute chase scenes are two too many. The 1st chase was good; motor cycle up and down stairs, weaving in and out of an on going civil riot in Athens. Julia Styles on the back..its was exciting but the next two were pure overkill . Enough of the chases scenes and elaborate property damage. 2016 directors do not understand or appreciate subtlety in their films. Less is more . Other than that, film had good pacing and left a little hook at the very end to entice interest in the next segment"
    },
    {
      "rating": "5",
      "text": "Jason Bourne is another very disappointing entry into the Bourne franchise. The plot slacks considerably under the weight of Paul Greengrass' shaky cam, unnecessarily large action set pieces, and nauseating action towards the end of the film. The Bourne films have always been remarkably built around their plot, not just huge action scenes. Here, however, this is thrown to the side for a bombastic, too loud, and over-the-top film that instead of being a unique action spy film, turns this entry into the beloved franchise into just another cookie cutter action film. The acting is solid across the board and whatever plot that exists is solid, but the film seems far too eager to just skim through the story and get back to explosions. Even worse, Greengrass' affection for shaky cam leaves these fight and chase scenes completely unwatchable. The original trilogy was far more grounded and balanced, but this sequel is far too reliant on action and casts aside any semblance of a plot as a result."
    },
    {
      "rating": "2",
      "text": "So-so movie. very mediocre. too many stamps. too stereotyped. nothing new. no intrigue. not cause tension. not quite true. previous series have been made much more interesting."
    },
    {
      "rating": "6",
      "text": "If you happen to be a Bourne fan... well your wont stop being one after this movie... but\rI felt as if though the producers take us fans for granted.  The plot, action scenes, and\rdialogue is way too familiar .  Pretty much the same formula.  Bourne pops up outta nowhere,\rassassins out to get him,, a New higher up wants him dead.... lotsa of action and crash\rscenes,,,, then...  cliffhanger....\rcome on guys.... stop bringing up the past.... and lets move forward....   Im still in.... but come on"
    },
    {
      "rating": "4",
      "text": "This movie should be called \"CIA chases man\". That's all it is. A minimal plot doesn't necessarily mean a bad film (think Fury Road) but this movie is soulless."
    },
    {
      "rating": "4",
      "text": "Such good action blurred by blur....such bad everything else.\r The action is on par with the other movies, but the camera is so inconsistent and shaky its often hard to follow . This is normally done to hid an actors inability to fight well but even at his age he is really in shape and a good fighter.\r However the story is horrible for some many reasons...forcing the dad into the plot to felted that , forced and changes a lot of the history in an attempt to give the character motivation , Just like what they did with the girl, the problem is its a girl who in all the past movies there was barely more then a minute or 2 of interaction between them , no friendship , no chemistry , just no motivation.\r Lets not even talk about the 50 or so GIANT plot holes and force feed answered treating audiences like idiots.  Starting with a World class hacking facility with rerouted IPs and hardware capible of helping break into the CIA that doesnt even so much have a UPS , backup batteries or a generator....millions of dollars in hardware...and not even a 5 minute back up power...... Then a flash Drive that literally says encrypted on it , a note book of plot objectives so clearly written out they might as well of just had a voice over with internal mono log explaining things step by step like we were 2 and A Dozen other character motivations that made no logical scene"
    },
    {
      "rating": "6",
      "text": "Whilst there are a few great action sequences here, this is a film which didn't need to be made, and failed to justify itself in the execution of the final product. It's very fast paced, but much too long, and the storyline plays out with a disappointing predictability. The enigmatic performance from Damon is good, yet the lack of dialogue means that we fail to care about the characters. The cinematography is very handy-cam heavy, and while I wasn't bored per se, neither was I on the edge of my seat. A somewhat mediocre experience overall. 6.36/10"
    },
    {
      "rating": "3",
      "text": "This is probably the most boring 2 hour movie i have ever seen. For an Action film, i really don't see any action in this film at all. The majority of the film is just drama filled conversations which don't seem to to have a point."
    },
    {
      "rating": "6",
      "text": "Despite bringing what everyone loves about Jason Bourne back to the big screen, Paul Greengrass and Matt Damon fail to deliver an entry to the franchise that matches the previous instalments. Early on in the film we see Bourne living off the grid, partaking in street fighting to keep himself sane, even allowing himself to receive a beating to combat his guilt, however this interesting direction for the character is short lived and soon he is thrust into the same old scenario we have seen before only this time for a rather contrived motivation. Typical screenplay tropes litter the script and at times the story feels muddied and ham-fisted. A sub-pot merges into the A-story without really feeling developed and characters suddenly have different rules of engagement depending on what best serves the story. Having said all that the action scenes are directed with perfection as you would expect, and the fight sequences are as realistic as ever. Damon Vs Cassel is the biggest draw and when they share the screen the outcome is explosive. A chase through the streets of Vegas is solid, although not up to previous film's final chases, and the opening Athens set piece is high octane stuff. The film is a solid action film but unfortunately holds no patch to the initial trilogy. It does wipe the floor with the Renner led spin-off but you can't help but feel this flawed entry was unneeded."
    },
    {
      "rating": "2",
      "text": "This is not only the worst \"Bourne\" film to date, it's simply one of the worst sequels ever made. Why did this happen? Because there is no reason for this movie to exist. There is nothing more to tell in the \"Bourne\" universe. The screenplay is childish and ridiculous in places. Tommy Lee Jones does a baddy again, like we've seen him doing 100times before. Alicia Vikander should have never been cast as a top CIA member. Cassel is O.K., but barely has any lines. Greengrass & Damon sold out with this lazy movie. Please, stop milking \"Bourne\" to death."
    },
    {
      "rating": "4",
      "text": "I have always loved a good Jason Bourne movie (not the Renner version though). I was looking forward to this one, as I was keen to see where it would go in terms of a storyline. It's entertaining, Matt Damon is still easy on the eyes and that action is passable. Unfortunately, those are the only things that are memorable. Bringing back the whole Treadstone plot was a bit of a yawn, and Tommy Lee Jones as the government baddie disappointed. See it if you want, for old times sakes. Or skip it. It won't make a difference either way."
    },
    {
      "rating": "4",
      "text": "Jason Bourne is one of the biggest disappointments this year, a film I was highly anticipating, that ended up being two hours of monotonous chase scenes, dull conversations, Matt Damon sleepwalking through the whole thing, and a poorly thought out script that is far more concerned with getting too the next chase scene rather than setting up why we should care about anything going on. So yeah too sum it up it's narratively unsatisfying, and largely pointless, leaving you with a feeling of why did they bother?"
    },
    {
      "rating": "6",
      "text": "Matt Damon returns as Jason Bourne in the fifth entry of the Bourne saga, which still entertains after some years off-screen. Though I still believe the Bourne Ultimatum is the best in the series, the movie still delivers with some action-packed sequences and thought- provoking characters. Directed by Paul Greengrass, who was also at the helm with Bourne Supremacy and Bourne Ultimatum, the movie is able to bring back some of things that made the original Bourne trilogy so good, in particular the incredibly awesome action pieces that are sprayed all throughout the film. It also showcases Paul's signature use of a shaky-camera, and though unconventional, proves to be useful in many situations.Almost a decade after the end of the Bourne Ultimatum, Bourne (Matt Damon) is still hiding, isolated from the world, where he only joins up in the occasional street-fight. But, his involvement begins when former contact of Bourne, Nicky Parsons (Julia Stiles), hacks into the CIA server in attempt to expose information. Files concerning the identity of Jason Bourne and how they attempt to take him down brings him out of hiding.The film boasts a stellar cast, which includes Matt Damon, Alicia Vikander, Tommy Lee Jones, and Vincent Cassel, all who of whom suited their characters well within the story. The story itself wasn't as intriguing as many of other Bourne films, as there were some minor plot-holes, but it didn't concern me that much. Its ability blends a decent plot with amazing action provides a fulfilling experience for the viewer, in particular, those who are fans of the series."
    },
    {
      "rating": "6",
      "text": "Had higher hopes for a Damon and Greengrass reunion. Feels like one retread of the same formula too many. Bourne is found, needs to uncover something, run from CIA white collars in a computer lab, face off with a rival agent, car chase, fist fight, confront the shot caller in the suit, disappear, been there, done that. Can't they get any more creative with the premise? At least Legacy tried branching out a little. My biggest disappointment is the return of the overdone shakycam. Ffs, even the text you're supposed to be reading is all but illegible it's so bad. Anyway, the action is alright (Damon's age may be catching up with him), but to its credit the climactic car chase is pretty damn awesome. Altogether uninspired, though."
    },
    {
      "rating": "5",
      "text": "Was the camera operated by someone with Parkinson's Disease?? I don't think I spotted one shot in the entire movie where the camera was not shaking sporadically up, down and sideways. Just stick it on a god dam tripod for once! They would try to show us a shot of a computer monitor, as if there was something important on there for us to read, but it was honestly borderline impossible to do so. It was as if the whole movie was just one big action sequence.\r Overall, decent movie."
    },
    {
      "rating": "3",
      "text": "I love Jason Bourne movies. Will watch them over and over again. As good as Greengrass was with the first 2 movies he is that bad here. It is absurd, absurd, absurd. Plot holes that completely sabotage the audience's ability to empathize and stay with the story. It gets ridiculous!!! The last big scene just goes on and on. I'm thinking that after shooting it anybody with a brain would have cut it but since they spent so much money if they didn't use it then the studio would second guess his future films.\rWatch this movie on cable so you can fast forward. The last 2 minute scene is the best, everything else just becomes repetitive and believe it or not... boring. I was watching the clock at one point. Matt Damon is as good as ever but this movie does not work!!!"
    },
    {
      "rating": "5",
      "text": "I love the original 3 Bourne movies.  This, I didn't like.  Felt flat, unoriginal, boring.  A retread at every step.  Instead of Bourne being driven by his desire to Illuminate the mystery of his past, he comes across as a soulless robot, dancing, killing, doing whatever the writers tell him to do because they are paying him."
    },
    {
      "rating": "6",
      "text": "I am not going to lie, this movie is a little disappointing. It was better than the Bourne Legacy, but not nearly as good as the first trilogy. My biggest flaw was that it went way overboard with the shaky cam. All the Bourne movies had shaky cam, but trust me, this one goes overboard. Besides that, this movie just wasn't as thrilling as the first trilogy. It's a real shame; this movie was one of my most anticipated of the whole year, and now, I'm not even sure it's going to be in my top ten."
    },
    {
      "rating": "6",
      "text": "Since Jason Bourne is back on his feet and this time this movie felt badass and at the same time flawed.\rAfter watching Jason Bourne, I already know that there is gonna be a next Bourne movie probably the last before Damon retires his character on the big screen. Although, the same director from the Bourne Supremacy and Ultimatum is back but after watching this movie I was disappointed with the story. I would like to debunk this review into a pros and cons sections about my exact thoughts on how I feel about this film:\rPROS:\r- Matt Damon at it's finest\r- Intense Action and Quite Gripping Sequences\r- Car Chase Sequence\r- Outstanding use of Visuals and Birds Eye Perspective\r- Paul Greengrass is back!\rCONS:\r- Disappointing Story\r- Poorly Written Characters\r- Confused Plot Consistency\r- Editing (Of Couse)\r- Lack of Intelligible Writing\r Overall, the latest Bourne entry is back but didn't exceed our expectations after the biggest success of Ultimatum. Although, you can still appreciate the action sequences itself rather than plot. And I hope that the next Bourne entry will impress..."
    },
    {
      "rating": "6",
      "text": "The Bourne movies made a really epic trilogy, just a shame it didn't stay that way. First we got the Jeremy Renner mistake and now we have yet another Bourne movie. At least they got Matt Damon back and with Vincent Cassel and director Paul Greengrass this should have been better. Although slightly disappointing there's plenty of action, car chases and Matt Damon knocking out half the world with only one punch to keep you entertained for 2 hours. Also featuring Tommy Lee Jones looking all kinds of depressed, a wasted Alicia Vikander and an unacceptable amount of hand held camera. Recommended generic popcorn movie."
    },
    {
      "rating": "1",
      "text": "Matt Damon is as good as ever, but the plot and pacing were lackluster (at best).  They tried way to hard to make an exciting movie and ended up with a frenetic mess.  I was actually bored during the climatic and waaaaay too long final action scene.   If I was at home I would have turned off the movie half way through."
    },
    {
      "rating": "6",
      "text": "Jason Bourne doesn’t scale the heights of the first 3 films in the Bourne franchise even though it is better than The Bourne Legacy. While the action is edge of your seat and the post-Snowden plot is timely, if undercooked, Bourne’s backstory simply doesn’t have enough steam to justify all the mayhem caused on screen. It’s time to think about Bourne’s future and not thread each and every string about his past."
    },
    {
      "rating": "5",
      "text": "Wow, did anyone else mind the constant changing of the camera angles for this movie. I got whiplash. Every little scene they keep flipping from one camera angle to another even though there was no need for it. Matt was still good but the editors needed to do a much better job."
    },
    {
      "rating": "1",
      "text": "this was sad follow-up to the Bourne series..an incomprehensible story..the action sequences were beyond preposterous..couldn't wait for the credits to start rolling..as the people were leaving the theater there was loud grumbling about this sad excuse for a Bourne movie..wanted my money back"
    },
    {
      "rating": "2",
      "text": "This is one of the worst movies I have ever seen. Not only is the editing frenetic, way over the top and confusing, there is such a thin plot, so overstuffed with special effects and people walking around different citites glaring at each other and stalking each other, that it's almost ludicrous. The \"motivation\" for poor Jason iis a story that has been told so many times before, in so many other movies, that it just produces a sigh of annoyance when it is finally revealed. If you want headache inducing quick cuts, over real character (Jason has been reduced to some kind of superhuman robot who seemingly can't be killed). Matt Damon has become two dimensional and the director gives him nothing to act against. There is good, there is evil. There is violence, there is some tension, but whoever thinks that watching a computer download files over and over again while someone stares at the screen, should rethink what is inherently dramatic. In one early scene, which seems never to end, we have rioting, fires, chases, shooting, treachery, death, injury, the obligatory car chases, helicopters, glaring (again) evil people, grim (again) good people. This overstuffed sandwich induces nausea. We see Jason in Greece, fighting, being stalked by the evil people. We see Jason in  Berlin, fighting and being stalked by the evil people. We see Jason in London, fighting, and being stalked by the evil people. If bigger is better, you'll like this movie. If you don't care about real plot, real character, or true dramatic tension, you'll  like this movie. For me, no more Jason Bourne."
    },
    {
      "rating": "4",
      "text": "I'm so disappointed!! I'm so disappointed!! I'm so disappointed!! I'm so disappointed!! I'm so disappointed!! I'm so disappointed!! I'm so disappointed!! I'm so disappointed!! I'm so disappointed!! I'm so disappointed!!"
    },
    {
      "rating": "6",
      "text": "To be fair, I went to watch this movie it because I watched the rest of the franchise. It appears to be a curse in franchises, things started to go downhill after a few good ones.\rFor this movie, it is okay, the plot is quite boring, Matt looks really old, less combats and fighting but more running, car chasing (my least favourite).\rApart from the good-looking actress, there was really much of a highlight in the movie.\rIn conclusion, if you are a Jason Bourne fan, go watch it. If you are not a Jason Bourne fan, there is something wrong with you. Nonetheless, after watching this movie, I am sceptical about the next Jason Bourne movie if there is one. I probably will still watch but I hope not to be disappointed again.."
    },
    {
      "rating": "3",
      "text": "Everything about this movie, besides its production value, felt phoned in. This movie felt like a direct-to-DVD sequel that somehow got the green light as a major film. The silver lining is that I laughed a lot. The hacking scenes were clearly written by people who couldn't even be bothered to Google what hacking is like (actual line: \"Use SQL to corrupt their database!\"); the motivations for every character were paper-thin; the car chase ventured into Fast & Furious territory without being nearly as imaginative and self-aware as those films. Many of the performances, from normally-capable actors, even felt wooden, like nobody's heart was in it. It also felt like they took shaky-cam to a whole new level, but maybe I'm just getting old. I loved the Bourne trilogy; I mildly enjoyed Legacy. This movie was surprisingly and hilariously bad."
    },
    {
      "rating": "3",
      "text": "I am so tired of the shaky camera.  Even when showing a text on a cell phone apparently the ground is shaking.  I wonder if that's just a method to make the actual fight sequences easier to perform since they can hide the what's actually happening.\r By the way, how can the SWAT truck plow through 30 cars with such energy that they fly into the air, but it is stopped by 3 rows of slot machines?"
    },
    {
      "rating": "2",
      "text": "It was a typical action movie. Which isn't the spirit of the Bourne franchise at all. The only thing missing was your typical damsel in distress that the protagonist macho man has to save. The movie wasn't clever, jason bourne is just a vindictive killer and the ending was anti-climactic. The CIA parts were cringe-worthy, that's all I can say about them. Typical futuristic Tony Stark computers with actors clacking away at keyboards basically doing magic. \"People don't know how hacking and computers work! Just throw some big words, crazy animations and make it look cool and you got yourself a dank hacking scene!\" Also, the worst line in the film had to be, \"it's worse than Snowden.\" Like what the hell? What CIA agent talks like this? What makes it quantifiably worse than Snowden? Oh right, you just wanted to throw some smart hacker dudes' name in there to sound smart and cool. That's all this movie is... It's trying to be smart, suspenseful and cool but a little thinking allows you to see right through it.. It's a basic action film with a basic plot, basic characters, and basic storytelling. Also, prepare to be nauseated by all the shaky-cam bullsh*t this film uses to cover up bad stuntwork and editing... The entire film looks like it was filmed by a 6 year old with an iphone strapped to his forehead."
    },
    {
      "rating": "3",
      "text": "So idiot it made me laugh. Nothing of the charm of the previous Bourne movies. The only good things: images of Athens from above.Fortunately, it is so noisy that there are no chances to get asleep."
    },
    {
      "rating": "3",
      "text": "Aside from Alicia Vikander’s nicely textured performance this is the tried and not so trusted formula as before aimed squarely at audiences who prefer their movies indecipherably action packed, rather than intelligently scripted. If you want action; you got it. You want messy and frenetic editing? you got it. You want global city hopping? you got it. You want a slight, over extended and ludicrous story? you got it. You want fake tension? you got it. You want an insistently pounding score adding nothing to that fake tension? you got it. You want entertainment? Really! Well tough s*** cause you ain’t got it! Copy That!"
    },
    {
      "rating": "7",
      "text": "Matt Damon gives a welcome return in one of his most famous roles. However, as entertaining and action-packed as the film was, I can honestly say that I think this was probably the weakest of his Bourne films (it still beats Jeremy Renner's Bourne Legacy.) This offered some more great fight sequences, however, the noticeably choppy editing and camerawork made it hard to really enjoy at times. I also found the final chase sequence to be rather dumbed down and destruction-heavy, as I enjoyed and appreciated the intelligence and restraint of the chase sequences from the previous 3 Damon films. As for the story, it kinda felt like more of the same. Bourne tries to run from the CIA and has to find out why they're after him (again.) Overall, Matt Damon does a fine job doing what he does best, but it isn't his fault that the story's repetitive feel and the all-over-the-place editing and cinematography weighed it down. It was still fun at times but left me feeling underwhelmed and slightly disappointed that it wasn't a lot better, especially after the nine years since Ultimatum."
    },
    {
      "rating": "2",
      "text": "Besides the recycled wafer thin plot and dumb sub comic book dialogue, this thing is shot and edited so poorly the people responsible prove unfit to be crafting feature films much less big budget Hollywood blockbusters.  It is an injustice the incompetent director is allowed to make movies.  His signature style was used to appropriate effect in \"United 93\" and somehow didn't ruin the excellent \"Captain Phillips\" (10 rating here), but that may be because that was not an action movie and Greengrass didn't have justification to warrant going overboard on the visceral moving cam - cut to ribbons bull---- style of his.  Also an important factor is that real events re-created is an entirely different frame of mind than big dumb popcorn fiction like this movie, which no matter how much phony reality is artificially injected into the moviemaking, we all never forget this s---- is all play pretend time make believe.  Whatever the case, this idiot is a menace to cinemas most of the time.  Nobody in power bothers to really question the s----- style.  Not the studio monkeys, not the producers, not the stars.  All a herd of sheep producing pure manure that only fertilizes their jackass egos, certainly not the audience.  Kinetic action does not require shaky dumbed down cell phone quality documentary vérité.  The eye doesn't even truly ever see that way no matter how jostled.  Nor does the audience deserve to be paying admission to only be annoyed and sickened by it!  This already passé style of cinematic action doesn't raise the bar, it lowers it idiots!  It's incoherent and unintelligible!  You can't even tell what's going on most of the time!  And it's easier to manufacture this kind of bs handheld photography and anything goes editorial.  Total junk!\rBy comparison, the first movie in the series made by others and without this s--- style was good (7 rating) and the last one also directed by another without this s--- style and with a different lead actor was marginal but not infuriating (maybe a 5).\r Damon though a very good actor and maybe very solid person in life is simply not likable enough a personality on screen to have ever become a real movie star.  Disagree with that, but he just isn't in the same league as movie stars past which points to a larger issue at the movies today.\r What an excruciating, unbearable soulless bore!  For all the nonsense stupid style trying to liven things up, this movie could not be more dead on arrival.  The only reason it rates 2 here is because it does get even worse as we know."
    },
    {
      "rating": "0",
      "text": "AHAHA\rOh my god and THIS gets more rating than Suicide Squad! The camera is shaking, actor play is awful, characters are dull, no atmosphere, story is 2/10 predictable. People are so full of sh*t."
    },
    {
      "rating": "6",
      "text": "Jason Bourne does represent some of the finest Bourne moments in the franchise, but they're not enough to stress its buggy fighting scenes and typical action. This might be the first time a Bourne installment actually disappointed me."
    },
    {
      "rating": "0",
      "text": "The Bourne movies have always tiptoed around the contradiction that their main character is supposed to be a reformed assassin who just wants to live in peace, but all their entertainment value comes from watching him ultra-competently kick ass, crash cars, and blow stuff up. In between these scenes they get weighed down by his morose brooding and sulking about the people he killed, cars he crashed, etc. As a result they've always been rather joyless and unsatisfying compared to something like Die Hard or Taken, where the hero is fighting for people he loves and believes in the moral rightness of his actions.\r I don't have much to say about this specific movie except to note that it's a ridiculously cynical and inessential copy-paste exercise that brings nothing new to the franchise, and that Damon's face has aged really badly. He looks all pinched and gross now, one might say \"like a Streisand\"."
    },
    {
      "rating": "0",
      "text": "I cannot say enough bad things about this boring, unbelievable, fantastical, ridiculous, unnecessary sequel. Everything about it was bad. Everything. The story, the writing, the dialogue, the action sequences, the acting, the directing, the editing, the music. It was a a chore to sit through. I can't believe people actually liked this POS. But then again, people enjoy the Fast & Furious series, with cars driving through skyscrapers and such."
    },
    {
      "rating": "0",
      "text": "Metacritic deleted my review so I'll post it again but shorter.  This movie is awful.  The entire thing is terrible shaky cam and the story is stupid.  Paul Greengrass is one of the worst directors of our generation.  If you want to watch this movie but don't want to pay the money, just spin in circles until your so dizzy you're about to vomit and then watch Bourne Identity 1 on blu ray while randomly hitting pause, play, pause play..  It will be about the same thing."
    },
    {
      "rating": "6",
      "text": "Eh, it was OK. You might want to wait and rent it. My expectations of home rentals are lower, so if you're like me in that way, you'll enjoy it more at home. When you actually go out, park somewhere, stand in line, pay for a ticket, and stand in line again to pay for overpriced popcorn, then sit with someone's head partly in the way, you expect more for your trouble. The best Bourne movies for me are the first one and the 4th one, the one Bourne isn't even in. This one is on par with 3 but maybe not as good as 2. The problem I had with this is that, look, I know I'm not going to get tons of character development, but in place of that I at least want a plot with revelations and twists and turns. But you get none of that here. You just get a simple excuse for a plot with 3 or 4 words of dialogue once in a while to push the thin plot onward, but 99% of the movie is insane action, and in this case the camerawork was so close up all the time that it was disorienting and a little nausea inducing like the Blair Witch Project. The Blair Witch Project promoters liked to brag that viewers were throwing up in the theater - which suggested the movie was incredibly gross and frightening - but in fact people were puking because the camera work was hand-held and looking at the ground half the time and jiggling and bumping all over so that people got sea sick. Jason Bourne isn't that bad visually but it's pretty bad. Handheld cameras and close shots even during action are fine as a tool in the toolbox to use here and there to get very intense, to highlight a climactic, moment, but when you do it all the time it becomes just a meaningless blur, and that was kind of what you had here. That said, the acting, what there was of it, was good. Perhaps I give it a 6 rather than a 4 or 3 simply because I've seen the previous Bournes so I knew what I was in for when I entered the theater. I'm calibrating it against other Bourne movies rather than against other action movies generally."
    },
    {
      "rating": "7",
      "text": "Whilst not as powerful as the original three films, the latest Jason Bourne reboot is an entertaining action film. The story, dialogue and character development is slightly lacking in comparison to the predecessors, with the focus on action rather than substance for a lot of the film. Despite this, it is still a Bourne movie and shows reasonably good signs for potential future instalments."
    },
    {
      "rating": "7",
      "text": "A solid addition to the series, with all the action we've come to love from the series, albeit at times the narrative was lost behind the action. Sometimes it wasn't apparent why Bourne was doing what he was doing or going where he was going, only that there were more people to kill at his next destination. Despite this the story was solid and leaves good space for a number of sequels, which I for one will be watching."
    },
    {
      "rating": "5",
      "text": "Definitely not a bad movie, and you'll have some fun with it (esp Vikander and the dude from Elementary), but it just feels a little uninspired. The storyline is pedestrian compared to the previous films, and that's mostly a compliment to those films.  I mean, this is not like the last Die Hard, which SUCKED, regardless of how good or bad the previous Die Hards were.  The final chase/fight sequence in Jason Bourne just seemed to last forever, and I really hate when they get TOO close to the action to hide the fact that what they're filming is just not that compelling."
    },
    {
      "rating": "8",
      "text": "If you're a fan of hard hitting action with tons of cool fight scenes involving Jason Bourne beating the crap out of people, then this movie is for you. Matt Damon returns as Jason Bourne added to a great performance by Tommy Lee Jones, Riz Ahmed, Alicia Vikander, and Vincent Cassel but as entertaining and action-packed as it is, I felt that this had to be one of the weaker adaptions into the Bourne series. While it was definitely a vast improvement over Jeremy Renners \"Legacy,\" the movie still pales in comparison to Ultimatum, Identity and Supremacy. Despite this, I still really enjoyed this movie and I felt it as a welcomed edition to the Bourne series."
    },
    {
      "rating": "0",
      "text": "Been there done that, lots of holes in the story, I am pretty easily entertained but I could not get over some of these holes in the script.  Acting was so sad it was nothing in it that was surprising , it just felt from the beginning to the end of the movie they're chasing after him ........chasing scenes after chasing scenes.....just boring.  They should just quit while you're ahead and don't make anymore these movies"
    }
  ]
}