{"id": 1358, "title": "Jaws", "starring": ["Roy Scheider", "Robert Shaw"], "runtime": 124, "genre": ["Horror", "Thriller", "Adventure"], "description": "When an insatiable great white shark terrorizes the townspeople of Amity Island, the police chief, an oceanographer and a grizzled shark hunter seek to destroy the blood-thirsty beast.", "releaseYear": "1975", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/lxM6kqilAdpdhqUl2biYp5frUxE.jpg", "categories": {"plot": 9.914285714285715, "acting": 9.914285714285715, "ending": 9.666666666666666, "soundtrack": 10.0, "cinematography": 10.0, "familyFriendly": 8.0, "funny": 10.0, "action": 10.0}, "reviews": [{"rating": "10", "text": "Jaws is simply one of the greatest motion pictures of all time. Based on the best-selling novel by Peter Benchley, the film opened to audiences around the world and apart from receiving critical acclaim, grossed hundreds of millions thanks to word of mouth and clever advertising. Three mediocre sequels followed in 1978, 1983 and 1987 but the original from 1975 is THE definitive suspense film. The plot concerns a small New England holiday resort that is being terrorized by a killer great white shark. The corrupt mayor of the town wishes to regard the numerous shark attacks as boating accidents. However, as the bodies mount it becomes clear to police chief Martin Brody that the problem can no longer be ignored. So, with the help of oceanographer Matt Hooper and crusty old fisherman Quint, Brody heads out to sea on a small boat in order to catch and kill the shark once and for all. Once they get on open sea, the film suddenly becomes a straight out action-adventure film, which is a genius move by both Spielberg and the producers, because in the first half of the film, the tension is slowly built up notch by notch so that when the viewer wants the shark dead too, then the characters decide to do the same and the way it gradually makes the transition is brilliant. Also, one cannot review the film without mentioning the iconic musical score by composer John Williams, a frequent choice in nearly all Spielberg's films. The music represents the mindless attack of the shark and it also is accompanied by some traditional swashbuckler music in the less suspenseful moments. The film's other big claim to fame is the fact that it had one of the most troublesome shoots in film history. The three mechanical sharks constructed for the film rarely worked, and when they did it was only for a short while. The reason for having three sharks was so that the filmmakers could exercise their control over the shark. The cast is superb also, with Roy Scheider, Robert Shaw and Richard Dreyfuss all giving their signature performances. However, the star of the show, as all learned movie buffs know, is really the shark. The film was released on June 20th of 1975 and quickly became the most popular film of all time at that time. It set the record for summer blockbusters since, grossing over 400 million dollars and shooting Spielberg to international fame. Overall, a classic chiller that belongs in every DVD collection. (10/10)"}, {"rating": "8", "text": "What some of the other reviewers don't understand is that this movie was made in the 1970's and that the sfx was state of the art! Still a classic and anyone who says otherwise obviously doesn't know a good movie when they see it."}, {"rating": "10", "text": "Spielberg has made the first summer block buster, and Jaws is one of my all time favorite movies, as next to it, a dream works SKG developed, and Richard D. Zanuck (producer of jaws) my other favorite movie next to \"Bruce\" is Sweeney Todd. Love it! Superb!"}, {"rating": "10", "text": "I just saw this movie for this first time today and was surprisingly very pleased I don't like horror films but loved this movie I would put this more along the lines of a thriller there were a few jump scares now that we've got that out of the way i thought that over all this was a very good movie the characters were very likeable and interesting and there was fair development in my opinion there wasn't really any point in this movie where I said to myself that I was bored or wanted it to hurry up the music in this movie besides the iconic jaws theme was very good as well which is to be expected from John Williams overall im gonna say dont be like me if you haven't seen jaws go out and buy a copy you can get one at Walmart for like 5 bucks even if you watch it once it'll be a good time trust me"}, {"rating": "10", "text": "This movie has great characters and they sound and act like real people! The movie brings out screams and laughs too and this movie I do recommend to many."}, {"rating": "10", "text": "Even though some of the attacks are phoney, the way they killed Jaws was fricken awesome. Great acting, plot, and a classic overall."}, {"rating": "10", "text": "This definitely a very good movie. Steven Spielberg has delivered a great Educational masterpiece about how to begin the Story and move it to the Climax."}, {"rating": "10", "text": "OK i know it's a cult movie, and i am a member of it's cult. But even if you Hate Cult Movies, you'll love this. The acting was Great, the setting was really belivible, the music was some of the best i have ever herd in a film and really got you in the mood of the film. And it really did scare me and kept me on the edge of my set. Even after seeing it 100 times there are parts that will still get you. The acting was acctualy really good, I loved Richard Dryfuss as Matt Hooper. I am now reading the book to and it's even more exciting. Truely the greates 70s Disaster movies, no greates Disaster movie Period."}, {"rating": "10", "text": "Jaws made me so scared I didn't even want to go to the toilet in case the great white came up and ate me!! I think this film deserves more than 1 billion Oscars, no lie!"}, {"rating": "10", "text": "This is the best horror movie of all time without a doubt. With an original plot, the best special effects of the time, and the ocean's strongest predator, you will want to see this movie no matter what. Everything about this movie will keep you interested, and you will not want to turn it off until it is done/"}, {"rating": "10", "text": "Jaws was the first horror flick I ever saw, and to this day it remains the most effective. Like so many others, I was afraid to go in the water after seeing this film. Tight direction from Steven Spielberg as well as a fairly realistic looking shark (come on, it was 1975!) make this one of the greatest films of all time."}, {"rating": "10", "text": "Let's keep this simple, this is the single finest motion picture of all time. Great direction, perfect script, wonderful cast and performances to die for. Has never been, and perhaps never will be bettered."}, {"rating": "10", "text": "Its JAWS !!! does it need a review ?  ignor the negative reviews ...they are just trolling and enjoy writting negative reviews. If some how this has passed you buy ( i guess thats possible if your 20 or under ) watch it now !!! put down whatever or whoever your doing and watch it !!...it was made in 1975 remember ....now go !! my score of 10 is incorrect as it will not let me score higher , one of the greatest movies there will ever be."}, {"rating": "10", "text": "jaws is like a  a best movie of all time .  when i was little i watch jaws millions of time  not once did it get old it is one of the greatest films i seen all day"}, {"rating": "10", "text": "\"Jaws\" is absolutely a classic summer blockbuster that understands the essence of tension, fear and climax. A utterly nightmare directed by Steven Spielberg (well chosen) and a thrilling 70's movie."}, {"rating": "10", "text": "I love this movie so much!! This is my favorite movie of all time . I may have been born 16 years after it came out, meaning I didn't get to see it when it was first in theaters, but I saw it on TV when I was 7 or 8, and it really scared me, but also inspired me to go into the film industry someday (you should remember my name!). I have seen this movie at least 100 times (yes I wrote that correctly) and some parts still scare me! Easily my favorite Spielberg movie!"}, {"rating": "8", "text": "Prolly really awesome 30 years ago."}, {"rating": "9", "text": "Loads of scares, blood, and the use of not showing the shark for most of the movie make this film the best shark-horror films."}, {"rating": "10", "text": "I don't have a favorite singer, I don't have a favourite song, but I do have a favorite movie, and this is it! What makes this one the best? Allow me to explain. One brilliant acting performance in a movie is good to see. Two brilliant acting performances in a movie is great to see. But three brilliant acting performances... There's a word for a movie like that. Jaws!"}, {"rating": "10", "text": "The Godfather rises above crime movies, Rocky rises above sports movies, Seven Samurai rises above samurai movies, and Jaws rises above horror movies. This is one of those rare films that defies, and in turn, defines its own genre, and effects everything in its medium. There are the movies made before Jaws, and the movies made after Jaws. It is not about high concept or high budget; it is about what can be accomplished in film. It sports one of the greatest soundtracks of all time and truly inspired cinematography. It exemplifies what minimalism is supposed to do in Horror by hiding its monster and only drawing it out in measured doses. Similarly, the drama is measured and counterweighed with humor, humility and intertwining plot threads like moviemakers can't even do anymore. Complaints about the acting or characters are absurd; several of these stars turn in the performances of their lives. It will leave you with feelings like few horror films can, because it truly rises above. Really, what other movie can earn such a ridiculous ending?"}, {"rating": "10", "text": "Shaw and Dreyfuss in excellent form...many many memorable lines from Shaw, \"What are ya, some kinda half assed astronaut?\"...They just don't make films like this anymore folks...Spielberg's greatest work in my opinion."}, {"rating": "10", "text": "This movie is incredible. Unbelievable. Fantastic. It is the very first movie to be considered a blockbuster, and I'm telling you now , this movie is a CLASSIC. It's not a great story line, but with superb acting, script, direction and everything else- it has earned a special place in my heart and mind. I saw it when i was 6 by accident, and it is one of my all time favorite movies. For those who do not like this movie, you simply don't know a great, amazing movie when you see it. A++ One of the finest films ever made."}, {"rating": "10", "text": "Superbly directed and designed, Steven Spielberg's \"Jaws\" seamlessly transcends genres with surprisingly well-developed characters, a subtly worthwhile story, and an unfathomably iconic and multifaceted score."}, {"rating": "10", "text": "Even when Spielberg is making an adrenaline-rushing film instead of ones about topics that are universally considered serious, he does it in his own style. Jaws is filled with close calls, gruesome deaths and general bloodshed, yet the build-up is everything. He makes us wait for the shark, and only shows us bits of its work to whet our appetite. But just when you think you've seen it all, he shows his hand. The shark is truly a force of nature. Hideous, scary, deadly.\r A suspected shark kill is dismissed as a boating accident. The Mayor, having the city's best interests at heart, persuades the chief of police, Brody, to keep the beaches open for tourists. He reasons that this is their main source of income and they should not endanger that by scaring away the tourists. Even after another death, the townspeople are still adamant in keeping the beaches open. Their livelihood is attached to the sea. The mayor is a delusional man who thinks if he ignores the problem long enough, it will go away on its own. This precipitates in a lot of trouble. The shark's presence is only hinted at for the first hour, in a classic whodunit style. But when it finally arrives on camera, it is overwhelmingly cringing to see it do what it does live.\r A seasoned seaman offers to catch the fish for a price. The minute all illusion flies about the cause of the deaths, a bounty goes up which brings inexperienced seafarers into the fray to claim the prize. They think of it as a sport. Someone catches a shark and everyone thinks this is the one that made the kills. The third main character, Hooper, wants to be sure and advises on cutting open the belly and investigating the items within. When things get way out of control, the mayor relents and agrees to hire Quint to kill the shark. He is accompanied by Brody and Hooper on this voyage, which takes up most of the second half of the film. The three men lure and assault and do everything they can to kill it. This endeavour makes up for plenty of scares and surprises.\r Brody is an outsider. We can see his confusion and helplessness as it slowly dawns upon him the enormity of the task that falls on his shoulders. He does his best to convince everyone to do the sane thing, but runs into a wall every time he tries to close the beaches. Hooper is a college boy with a fancy degree. He is Brody's only support for a long time. For some reason he decides to stick around and help out the chief, probably because he has seen how the rest are taking the issue. Quint is the tough guy with a mysterious past. He's the most experienced in the field of fishing. But he names a price the city has to come up with to catch the monster and remove the taint from the island's reputation, so the tourists continue to pour in and keep the economy flourishing.\r Spielberg doesn't shy from depicting barbarity. The deaths shown are disturbing and bloody, none more than the last one. But where he differs from the typical gory movies is how he handles characterization. We see these people as real men and not archetype characters in service of the story. Spielberg knows the importance of this and that is why he dedicates the majority of the first hour in establishing two of the main characters, and using a portion of the second to develop the third.\r The score was riveting and foreboding. It established the mood fairly well yet was quiet and unobtrusive. The mechanical shark was very convincing. I went to research it immediately after I finished watching because I was sure they used a real shark. They only included real sharks in scenes where it was just minding its own business and just swimming about.\r The film never drags for a second. The first half is a set up but has its own scares and special moments involving the animal and the characters. The second half stole the show and completely transformed the movie. We follow only three characters after the mid point. The characterization was fun and felt genuine. Quint shone out especially in one memorable monologue.\r Spielberg has demonstrated how a summer blockbuster aiming for big bucks should be made. By merging scares and thrills with absorbing characters and narrative, he started a trend which has since been followed every summer after the year the film came out in."}, {"rating": "10", "text": "As gripping and intense as the no. 1 book, as soon as you see the poster you know it'll be outstandingly directed, with a perfect cast to go along, for this'll your gonna need a bigger tele."}, {"rating": "10", "text": "In comparison with modern horror-free, idiotic and laughable movies about killer sharks, we gradually pay more and more tribute to Steven Spielberg's original Jaws as a classic horror cult that successfully rose beyond mediocre plotting and storytelling in spite of somewhat umimpressive visual effects as regards to presence."}, {"rating": "10", "text": "One of the greatest films of all time and Spielberg's best movie. some people will bring it down because its old and not as scary as todays thrillers but that wont change my mind or the fact that its a classic."}, {"rating": "10", "text": "Jaws was a very difficult movie to make.  The shark kept falling apart, the cast almost drowned when one the boats began to sink, and the crew were always seasick!  Thankfully Spielberg made the brilliant decision to shoot the shark from underwater and used music to warn us when it was coming."}, {"rating": "10", "text": "Very interesting little movie. Kind of old, but nothing wrong with that. You will roll your eyes at how fake the shark looks and REALLY roll your eyes at the dumb way Jaws is killed at the end--but the characters and the dialogue are fantastic (Love to prove that, wouldn't ya? Get your name into the National Geographic.) and it's a lot of fun (even has a damn good jump scare). I can see why it was a blockbuster back in the 70's. Tried watching the sequel too, but it really stinks. I would definitely recommend this one though."}, {"rating": "10", "text": "The classic thriller never gets old, handled superbly well in the open waters by Spielberg and carried with charisma by its lead actors. 'Jaws' will never fail to entertain, and still stands as one of the greatest thrillers of all time."}, {"rating": "10", "text": "This is the movie that made me love movies. I started paying more attention to the technical aspects of filmmaking after having seen \"Jaws\", considering the fact that the film is full of incredible cgi-free special effects. The film should be appreciated by every moviegoer, even if they, personally, did n't necessarily like it very much. But, what's not to like? \"Jaws\" is an absolute classic! It has great acting, directing, special effects, writing, and so on. A definite 10!"}, {"rating": "10", "text": "The original summer blockbuster is one of the best movies of all time, hands down.  Almost every line is meant to provide context and exposition to the flawed but tremendous characters.  A classic in every sense."}, {"rating": "10", "text": "It's not often you see a scary movie that's set in the real world.  No zombies, no aliens, no devil inhabiting little girls, just a huge man eating shark.  40 years later I still think about that when I go to the beach.  That's a great movie.  I don't have a lot of DVDs but this one is in my collection."}, {"rating": "10", "text": "I love Jaws. It's one of everybody's favorite classics of all time. And I also love that theme tune as well and this is what happens when I play that theme tune over and over again and my mum heard it downstairs and she told me to turn it down because its loud for her. And I love the ending too. For example I love the part where Richard Dreyfuss in the cage surrounded by the shark and it tried to catch him and I love the part where the shark destroyed the boat and ate Robert Shaw and Roy Scheider killed the beast and that's all."}, {"rating": "10", "text": "Jaws is simply amazing. Spielberg does an incredible job of building suspense and terrifying the audience through several techniques. His use of close-ups, quick cuts, camera angles, and more all add to the horror. As well as John Williams brilliant music of course. The plot has the audience caring about the people of Amity Island as well as feeling terrified throughout. Jaws is a classic everyone should watch, maybe when you're a little older though."}, {"rating": "10", "text": "*DUN DUN DUN DUN*\r JAWS is the best move ever. No questions ever. It's by far the best damn movie I've ever seen. It's arguably one of the most influential movies ever, and a real masterpiece of modern cinema. Plus it's fun to watch all of those people get eaten. You hear the dun dun dun dun music, and see Bruce's fin protruding out of the water, and you're like, \"Oh shi'ite, dude! **** going down son!\" And then the blood fills the water, everyone screams and shouts and lets the piss run out as they're running. And then you've got these three guys, Amity Island Chief of Police, Martin Brody (played by the late Roy Scheider), marine biologist, Matt Hooper (played by the outstanding Dr. Leo Marvin), and finally, hard ass fisherman and WWII vet, Quint (played by a badass). The three set out to save all the little people of Amity, and kill Bruce, the shark. No, his name isn't Jaws, dammit! Anyway, the story is awesome, and the characters are characters you can really connect with! I mean, honestly, who hasn't set out on the high seas to hunt a monster great white before? Plus the actors who portray them really do justice to the characters. And the music is suspenseful as a **** No doubt about that! Such a simple yet ominous soundtrack, one by the incredible John Williams. Anyway, so, the movie is thrilling, is a pioneer in the art of storytelling and character development, and set the standard for modern thrillers! It's no wonder Jaws has been considered one of the best ever! I mean, **** me man, I barely scratched the surface of how awesome this movie is. You'd really have to see it for yourself. So if you haven't watched, go watch it, and if you aren't convinced, go to hell. Because Bruce will be waiting for you there. Also, Saddam Hussein was here.\r*DUN DUN DUN DUN DUN DUN DUN DUN DUN DUN!*"}, {"rating": "10", "text": "Gran pelicula, maneja la tension de una manera sublime, ademas de introducir una de las composiciones mas epica de todos los tiempos y las muchas escenas iconicas."}, {"rating": "10", "text": "Everything works here. From the score to the acting to the amazing special effects, this will forever be my number one favorite movie of all time! If you have not seen it, I Recommend you pick this up and watch it yourself. You will never regret it."}, {"rating": "10", "text": "Jaws is one of my favorite movies that truly deserves higher than a 10. That’s how damn good this movie is!"}, {"rating": "9", "text": "Jaws is truly a special film. Spielberg truly knows how to create suspenseful moments and really gives you a chilling feeling. The writing is superb, the acting top notch, a great cast of likable characters to root for and an engaging plot with plenty of suspenseful moments. Honestly what really makes the film however is the original score by John Williams which is just phenomenal. The suspenseful and nerve racking feelings you get while watching and the triumph you feel along with the characters in the end is unbeatable by any film. The run-time is a bit long but other than that the film is a true classic."}, {"rating": "9", "text": "Jaws was just a masterpiece in the horror genre as it was in the entertaining adventure genre. The visceral fear engendered from the shark sequences was almost universal and just created a whole generation of aquaphobics. Not only that but it also created a new subgenre in the industry that was later called sharksploitation movies. Roy Scheider and Robert Shaw have a perfect chemistry and understanding of how to merge themselves deeply into characters. This is in my opinion the ultimate horror adventure movie ever. This is really difficult to express my feeling about Jaws. Just watch it and get your own thoughts is probably the best thing to do."}, {"rating": "7", "text": "Jaws is one of the first Blockbusters and I think rightfully so. It's great to watch, albeit incredibly cliché-ridden. It's perfect saturday evening cinema, but not a masterpiece in my opinion."}, {"rating": "10", "text": "Jaws is about a shark lol... Obviously. It's a 1975 movie directed by Steven Spielberg and it stars Lorraine Gary, Robert Shaw, Richard Dreyfuss and Roy Scheider as Chief Brody.. The film is about a shark causing havoc in a peaceful community town and some fisherman guy (Robert Shaw) and Brody at the end go to Kill the shark. Jaws is the original and still the best movie in the series, the sequels were mainly horrible. Jaws brings suspense, terror and entertainment on every level and it bites you and never let's go. The characters are all good and the acting is fairly decent."}, {"rating": "10", "text": "Best movie of all time!!!!!"}, {"rating": "10", "text": "Steven Spielberg is so excellent directing this summer flick from the early 70s."}, {"rating": "10", "text": "I believe this was the very first Blockbuster.  The lines wrapped around the block and coining the name for big moneymaking movies.  Very scary but probably better in the theater.  You really need the large screen for the full scare impact."}, {"rating": "10", "text": "Jaws is a masterpiece of tension-building and pacing, and in addition to being one of the first true summer blockbusters (a film phenomenon that it practically wrote the book on), it is easily one of the most entertaining films of all time. Steven Spielberg was still only a young movie maverick with a few modest features to his name, but even at this stage in his career he demonstrates such a grasp of effective film language and good storytelling, and showcases just how much influence a certain Master of Suspense had on his directorial style. Roy Schieder is incredibly likable as chief protagonist Brody, a city cop newly moved to an island town with his family, and there is some great tension and class-based conflict between Richard Dreyfuss's wisecracking hippie marine biologist Hooper and Robert Shaw's condescending salty seadog Quint. The trio play beautifully off of each other, and are all engaging and interesting characters who grow as the film's narrative progresses. The \"sinking of the Indianapolis\" scene is one of the very best on film - a brilliantly emotion-fuelled character moment that shifts without warning from macho banter as the characters compare scars to the confrontation of a horrifying ghost from Quint's past. This sequence makes for a refreshing change of pace from the rest of the film, and there are few scenes in modern blockbusters that compare in terms of bringing a real sense of humanity to proceedings - we are really allowed to get under the skin of the three men, making us question every one of our preconceptions about them. One of the great blessings of Jaws was, strangely enough, that the huge mechanical shark dubbed \"Bruce\" by the crew very seldom worked the way it was meant to. Spielberg would have reportedly shown the creature much more if he were able, but it is the fact that we only glimpse the monster for much of the film that makes it so terrifying. That, and the masterful combination of \"shark vision\" POV shots accompanied by John Williams' chilling and iconic theme music. Jaws may have established much of the modern blockbuster formula, but it is far superior to the vast majority of films of that ilk through near-flawless craftsmanship, infinitely quotable dialogue, great performances and a tense, exciting story that delivers at every turn. It works as a character-driven suspense thriller, as a monster movie and at its most basic level, as pure entertainment. It's not only one of Steven Spielberg's best films, but one of the best films of the 1970s, and is deservedly beloved by audiences. Sadly, summer blockbusters will never be this good ever again."}, {"rating": "10", "text": "Simply amazing, a real thriller, one of the greatest movies of all time...This movie is worth all the buzz , it is fantastic. Excellent production , and a huge hipe"}, {"rating": "10", "text": "JAWS is the true definition of a great thriller.  Not so much the subsequent rip-offs it quote-unquote \"inspired\" (PIRANHA, NIGHTWING).  This is truly Spielberg's definitive work."}, {"rating": "9", "text": "One of Steven Spielberg's best films, and possibly the most revolutionary of them all, \"Jaws\" is the first blockbuster ever made. It is brilliantly executed and so effective as thriller that has been scaring the audience for decades."}], "recommendations": ["the_conjuring_the_devil_made_me_do_it", "the_conjuring_2", "the_island", "the_terminator", "the_wolfman", "vacancy", "i_am_legend", "it_follows", "the_conjuring", "king_arthur_legend_of_the_sword", "from_dusk_till_dawn", "top_gun_maverick", "edge_of_tomorrow", "jurassic_park", "the_magnificent_seven", "super_8", "the_invasion", "color_out_of_space", "mad_max_fury_road", "the_thing", "avengers_age_of_ultron", "bone_tomahawk", "armageddon", "godzilla_king_of_the_monsters", "thor_ragnarok"]}