{
  "id": 4375,
  "title": "Jaws 2",
  "starring": [
    "Roy Scheider",
    "Lorraine Gary"
  ],
  "runtime": 116,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Police chief Brody must protect the citizens of Amity after a second monstrous shark begins terrorizing the waters.",
  "releaseYear": "1978",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cN3ijEwsn4kBaRuHfcJpAQJbeWe.jpg",
  "categories": {
    "plot": 6.222222222222222,
    "acting": 5.666666666666667,
    "ending": 5.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Jaws 2 is a decent film but near the end Jaws 2 is really boring. But besides that it's the same thing but still good. Overall, this movie is decent but flawed."
    },
    {
      "rating": "10",
      "text": "Just when you thought it was safe to go back in the water......''Jaws 2'' didn't suck, in fact, it's the only good ''Jaws'' sequel that it still has more suspense, and although there didn't much blood unlike the first movie, and the shark is still scarier, much like ''Jaws'', most of the newer characters are pretty decent at best, and they're scary as heck, while it may not be a scary as ''Jaws'' (1975), it's still a good sequel, but ''Jaws 3-D'' and ''Jaws: The Revenge'', the last two movies are pretty atrocious.I'm sticking with the first two ''Jaws'' movie, and as well as a decent ''Jaws'' clone ''Deep Blue Sea'' (1999), the reason is, ''Jaws 2'' is the pretty fair sequel to the greatest shark movie, and Roy Schiener still did a great job as Chief Martin Brody.Although ''Jaws 2'' did receive mixed reviews, However, it is generally considered to be the best of the three ''Jaws'' sequels.So, I'm giving Jaws 2 a 10/10. Better than the last two sequels of the ''Jaws'' franchise."
    },
    {
      "rating": "8",
      "text": "Jaws 2 like most sequels is not as good as the original but it’s a satisfying shock tween movie with a shark"
    },
    {
      "rating": "10",
      "text": "Please don't hate me for this just because Jaws 2 is my favorite Jaws film. I found it scarier, cooler, and overall more interesting for people like me."
    },
    {
      "rating": "8",
      "text": "Ok Jaws 2 to be is an enjoyable movie for me I like everything that goes on besides the ending why are the kids screaming so much god drives me nuts if that was just cut I would have enjoyed this a lot more the pacing from beginning to the second act is actually pretty good I'm that person in horror movies or slashers I like seeing the shark more or more kills than say the original movies, for example, Halloween 1976 to Halloween 1981 I prefer to kills but I love both so this movie the shark is shown a lot to me I love that when I first watched Jaws 1975 I thought it was ok second time watching I love it I respect what that film did and it's history, Martian Brody, in this film I love in the original Jaws he was my second fav character in that movie i am glad he did return I do like the relation ship with Ellen Brody with his character I liked in the first too I like it even more in this movie I feel like after Jaws 2 Jaws lost its name with Jaws 3 and Jaws the Revenge i like that Brody is still working with the police with the shark stuff like that what i don't like is that he got fired really are serious for caring about what is going on that made the pacing way wierd after that it killed that comptely when that happened so than we foccused on the children that screams a lot the score in this movie has to be underrated it is different from the first to me it is more uniquie the Shark looking amazing in this movie the shark is the best looking  in this movie with the burnt mark on the shark the first two Jaws movie the ending are great like how the shark dies or gets killed is pretty awesome that is gone in the last two movies of the Jaws Movies it wierd because this movie  to be succeds as a solid movie all round and a good shark movie but for some reason the other Jaws movie lost it's self compelty so i respect what this movie did i liked it more when i watched it the second time So I give Jaws 2 an B"
    },
    {
      "rating": "6",
      "text": "AlrightIt isn’t godawful like it’s followups, But Jaws 2 is HIGHLY inferior to it's legendary predecessor."
    },
    {
      "rating": "1",
      "text": "Another sequel.... Jaws 2 is the follow on from the 1975 original masterpiece directed by Steven Spielberg which was more or less perfect which gave it it's status as one of the best films ever made and deservedly so and the acting was fairly decent and the story wasn't too bad.... JAWS 2 directed by Jeannot Szwarc in 1978 which is three years after the original Jaws film adds some of the characters from the original such as Lorraine Gary and Roy Scheider. Jaws 2 has some great moments and exciting scenes especially when the sharks electrocuted at the end and ends up like Kentucky fried chicken or in this case Kentucky fried shark!!!! Jaws 2 however has many boring moments unlike the original that always entertained the viewer and grabs their attention but Jaws 2 at times in patches is dull and uninteresting with some annoying characters. My best sequel to Jaws was Jaws: The Revenge to be honest so that's embarrassing for Jaws 2 and shows how bad it is. Mainly dull and boring."
    },
    {
      "rating": "7",
      "text": "A respectable and well made sequel to a classic film, Roy Scheider returns to play Chief Brody. Its a good film and and a solid sequel"
    },
    {
      "rating": "4",
      "text": "While Jaws 2 has the same nice cast of its predecessors, it is even less complex, smart and unpredictable every time. And all above Steven Spielberg's absence."
    },
    {
      "rating": "7",
      "text": "Jaws 2 Continues the story of the town of Amity and its being terrorized by a giant shark, and while not as good as the first one it is the last one that is really worth watching in my humble opinion. The story has a few low points and can be a bit boring at times but the ending makes up for it."
    },
    {
      "rating": "6",
      "text": "To me Jaws 2 doesn’t really add anything new. It’s really just about another shark that wants to feed on human flesh. Although the movie is a little disappointing, I still always have a fun time watching it. Not only that, Roy Scheider is in this movie so it’s cool to see him play as Chief Brody once again."
    },
    {
      "rating": "6",
      "text": "A disappointing follow-up.I enjoyed Roy Scheider's performance and the core action sequences near the end, but everything else is a bit boring. 'Jaws 2' puts high focus on the teenagers, though their story never possesses any intrigue. The effects for the shark, meanwhile, are a step down from the original.It's not terribly far from being watchable, a slightly shorter run time might've helped in that regard, but I just personally found it to be an uninteresting 115 minutes or so. Perhaps initial director John D. Hancock's ideas would've came out better, though he was fired during production; speaking of which, the issues behind the scenes for this - and even the first film, really - are pretty fascinating."
    },
    {
      "rating": "9",
      "text": "I have the very unpopular opinion of this being the best Jaws movie.  I honestly think this movie is more interesting."
    },
    {
      "rating": "8",
      "text": "For me, Jaws 2 was almost of same level as Jaws. The only problem this part had, was pacing. The pacing could have been better.It becomes a challenge for a director to make a sequel of a film which is considered as masterpiece and I can say that the director of this part didn't disappoint. Yes, he was not able to give another masterpiece but he gave us best sequel of Jaws.This story is almost same as first part. Overall, the film moves a little slowly in first half, but picks up dramatically in the second half. In fact, it turns out quite intense, just like the first film. The main mistake which I pointed earlier was that it was too slow for too long.One of the plus point was that the shark looks more realistic and this part showed attacks much better than the first. And ofcourse, the second half of this part was better than the second half of first part.Overall, if you want to watch Jaws franchise you can watch first two parts without any hesitation."
    },
    {
      "rating": "8",
      "text": "Good movie for a sequel.  Unfortunately, there is no Steven Spielberg, or original plot, but this movie was well done.  Roy Scheider did a great job as Chief Brody, and the teens were as great as ever.  The action sequences also looked really good, like the boat explosion and the shark getting a nasty gasoline scar.  John Williams’s score was also another great score-one of the best in cinema.  This movie made me afraid to go back in the water!"
    },
    {
      "rating": "8",
      "text": "Even though it's basically a remake of the first one it is still good and entertaining in it's own right."
    }
  ],
  "recommendations": [
    "halloween_ii",
    "the_texas_chainsaw_massacre_the_beginning",
    "jason_x",
    "anaconda",
    "van_helsing",
    "underworld_evolution",
    "halloween_h20_20_years_later",
    "cult_of_chucky",
    "jason_goes_to_hell_the_final_friday",
    "ghost_rider_spirit_of_vengeance",
    "halloween_resurrection",
    "the_mummy_tomb_of_the_dragon_emperor",
    "i_still_know_what_you_did_last_summer",
    "underworld_awakening",
    "halloween_iii_season_of_the_witch",
    "underworld_blood_wars",
    "deep_blue_sea",
    "saw_ii",
    "final_destination_2",
    "friday_the_13th",
    "predator_2",
    "the_thing",
    "the_meg",
    "halloween_the_curse_of_michael_myers",
    "a_nightmare_on_elm_street"
  ]
}