{"id": 2290, "title": "Jeepers Creepers: Reborn", "starring": ["Sydney Craven", "Imran Adams"], "runtime": 88, "genre": ["Horror", "Thriller", "Mystery"], "description": "Forced to travel with her boyfriend to a horror festival, Laine begins to experience disturbing visions associated with the urban legend of The Creeper. As the festival arrives and the blood-soaked entertainment builds to a frenzy, she becomes the center of it while something unearthly has been summoned.", "releaseYear": "2022", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/aGBuiirBIQ7o64FmJxO53eYDuro.jpg", "categories": {"plot": 2.0, "acting": 2.0, "ending": 0.6666666666666666, "soundtrack": 5.0, "cinematography": 0.0, "familyFriendly": 2.0, "funny": 2.0, "action": 2.0}, "reviews": [{"rating": "0", "text": "This has to be one of the worst movies I have ever seen in my entire life. The CGI is HORRIBLE. The creeper is ridiculous. The movie completely throws away everything the first two movies established about the creepers. It looks like a cosplay YouTube video gone wrong on a 100$ budget. SO BAD"}, {"rating": "0", "text": "For the love of all that is holy, please just let the franchise die. It's not just a bad Jeepers Creepers and it's not just a bad horror movie. It's a really really really really bad movie. Everyone involved in this should be publicly flogged.The Creeper is just some spindly guy in bad halloween makeup. Trying so hard to be scary that he fails miserably. The original Creeper was big and imposing and the makeup was actually good. This one is like they grabbed some dude at a halloween party dressed as the Creeper.Watching this until the end will be one of my greatest regrets."}, {"rating": "1", "text": "You actually managed to screw up a really awesome horror franchise with this film! applause !"}, {"rating": "1", "text": "My god what a garbage movie part 3  was a masterpiece compared to this awful movie"}, {"rating": "0", "text": "¿Que les sucede a los realizadores de esta cinta? Muchas veces no se aprende de los errores del pasado, y esta no es la excepción. Lograron hacer una película tan pero tan horrible que lograron que la tercera parte parezca una obra ganadora de los premios más prestigiosos de la industria del cine."}, {"rating": "0", "text": "I didn't think anything could be worse than the god awful third movie, but I was wrong.  This is even worse.  Hollywood should focus less on woke culture and more on casting actual talent.  The camera style of this movie is strange, too.  Guess this is the new low budget standard.  Jeepers Creepers 4 is another great example of how a movie can still be trash even with woke, diverse casting.  Save yourself 87 minutes and watch something else.  Unless you have morbid curiosity, like me.  And no, part 3 is not a masterpiece compared to this, like someone else said.  They're both trash.  And no, this franchise was never awesome like someone else said.  Only the first movie was ever any good, because it had a good cast and was actually very creepy and more serious."}, {"rating": "2", "text": "The first movie was really good. It was both exciting and mysterious. The second movie wasn't bad as it coincided with the 23rd day of the first movie. Then in the 3rd part actually the place is 1.5. The sequel was filmed. In other words, the movie ended as of the end of the second episode.Now they couldn't stand it and shot another episode.Horror movie of 2022. Broken from the 3 parts made before, only the creature is similar. I say similar because even that is not the same. Something like a jester. I think there is a deep structure established to disgrace this kind of one or two-part films. The creature fights hand to hand. It's funny but not funny. The plot is bad, the effects and make-up are terrible, the acting is mediocre. I'm sure the majority of the audience watched it for the sake of the first movie and they all regretted it.Still, I'll point it out for those who will watch. Sex and nudity are ignored in the film."}, {"rating": "2", "text": "Perplexing meta-film that focuses around an escape room based on the original while also introducing a completely, unrelated and unsubstantiated cult behind the creeper."}, {"rating": "0", "text": "The best part of the movie is the first five minutes, and that’s basically a redux of the opening to the first film. Majority is filmed in front of a green screen and that’s evident. It’s a cash grab at the end of a franchise. Don’t waste your minis or time. I can’t believe someone put their name on this pile."}, {"rating": "0", "text": "Absolutely the worst movie I've seen this year and there's been a funk ton of bad movies this year. Congrats on sucking."}, {"rating": "0", "text": "awful. the first 2 movies were ok for what they were, everything since then hasn't been worth watching. this is by far the worst looking and written movie in the series."}], "recommendations": ["see_no_evil", "friday_the_13th", "jason_x", "rings", "the_legend_of_hercules", "the_mummy_tomb_of_the_dragon_emperor", "the_darkest_hour", "mortal_kombat_annihilation", "jeepers_creepers_3", "skyline", "the_day_the_earth_stood_still", "the_matrix_resurrections", "halloween_resurrection", "dragonball_evolution", "ghost_rider_spirit_of_vengeance", "book_of_shadows_blair_witch_2", "scary_movie_5", "piranha_3dd", "the_eye", "red_dawn", "meet_the_spartans", "slender_man", "vampires_suck", "the_bye_bye_man", "indiana_jones_and_the_kingdom_of_the_crystal_skull"]}