{
  "id": 1296,
  "title": "Jeepers Creepers 3",
  "starring": [
    "Stan Shaw",
    "Gabrielle Haugh"
  ],
  "runtime": 100,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "Taking place on the last day of the Creeper’s twenty-three-day feeding frenzy, as the skeptical Sergeant Tubbs teams up with a task force hellbent on destroying the Creeper for good. The Creeper fights back in gory glory as its enemies grow closer than ever before to learning the secret of its dark origins.",
  "releaseYear": "2017",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pK7ge28ubs45av9aGEbVWW7ZbA8.jpg",
  "categories": {
    "plot": 5.333333333333333,
    "acting": 6.666666666666667,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 2.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "This movie is very good. Not as good as the first however it does lead it's way into Jeepers Creepers 2. All in all it was very entertaining. It would be great to see the a Jeepers Creepers 4 which would technically be after the JC2. I agree on the last post. I seriously do not agree with the critics on this one!"
    },
    {
      "rating": "9",
      "text": "To put one thing straight; I hate critics, art is subjective, anyone who says otherwsie is a hack. That being said, heres my opinion of the film; I liked it! It wasn't as good as the first film, but I found it better than the 2nd film (which was still pretty good in my opinion). I know for a fact that the film is being judged for it's director and not it's content, which sucks because it's a good addition to the series, and the confirmed 4th film is looking to be even better!"
    },
    {
      "rating": "6",
      "text": "While it certainly has elements of being ridiculously low budget with its syfy channel caliber effects, and its insanely cheesy acting, the story still manages to be entertaining and interesting enough. I'd say its on the same level as the sequel but still way below the original. If you're a fan of the franchise, this should be a decently placed entry but nothing special. Lets hope he can get a bugger budget for the next one because some of the effects were cringeworthy terrible."
    },
    {
      "rating": "4",
      "text": "Fortunately, I waited for the continents too long and I managed to shake off the fascination with the series. Very bad plot, terrible characters without expression, and the worst of all poor monster's mysticism. Not much of his skills and to little corpses in movie. Tragic promotion and ridiculous day of release with SyFy television broadcast few days later."
    },
    {
      "rating": "3",
      "text": "After waiting for nine years for a third film to a series I like, but when it finally comes \"That's it?\" is my response.Not the good kind such as 'It Comes At Night' or 'Force Awakens' where it leaves you wanting more. Just a lackluster and disappointing \"That's it?\".Wasn't scary and lacked the fun of it all. It's pretty laughable with the unneeded slow motion making the terrible CGI more clear.I Guess Jeepers Creepers 4 will fill in the blanks where my satisfaction should be. Or maybe not, if you look up the director's Wikipedia page."
    },
    {
      "rating": "0",
      "text": "Wow…This film is really bad. Like...really bad. The first one is pretty good, and the second one has its moments, but this is just a disaster. I watched it hoping that at least it would have some cool death scenes. But even those were stupid. The CGI was inexcusably bad, even for a direct to DVD movie. The way it tries to tie into the other movies is just stupid. Make sure to avoid this one."
    },
    {
      "rating": "4",
      "text": "I was feeling generous, so I gave it a \"4\" for being so cheesy and predictable that it was mildly entertaining."
    },
    {
      "rating": "8",
      "text": "I was pleasantly surprised and terrified by the original installation, slightly disappointed with the second because they chose to reveal more of the creature which is always less scary than what one can imagine. This third installation showed way more of the creature and I was sure that it was going to suck as a result but the director did an absolute amazing job of creating a creature that can actually be terrifying in broad daylight. Not a small feat.  The cinematic visuals were crisp and clear and full of texture. When you weren't so engaged with what was happening in the moment you had a visual feast for your eyes to savor in those moments but almost as if the director could read your mind, didn't let those moments linger for very long before he forcefully grabs your attention once again. The choice of actors was also quite interesting for some of their interesting physical attributes and acting abilities. I have to commend the director for attempting and succeeding in making a truly scary film that takes place for the most part in broad daylight. In my opinion, Jeepers Creepers 3 is better than the second one."
    },
    {
      "rating": "0",
      "text": "The worst kind of Horror filmmaking there is to offer in one way this should be looked at"
    },
    {
      "rating": "0",
      "text": "It's real very poor movie in Jeeprs Creeper Franchise. Very Very Bead movie. 0/10."
    },
    {
      "rating": "0",
      "text": "This ruined two and one for me which are still really good films in my opinion not even the creeper looks like grey in this film I was so disappointed because the trailers looked somewhat decent and man I am hella disappointed"
    },
    {
      "rating": "6",
      "text": "OTT sequel with visions, ridiculous back stories and a glorious dedication to the inside of the creeper's van that possibly is responsible for more deaths than anything else in the film."
    }
  ],
  "recommendations": [
    "the_wolfman",
    "the_thing",
    "the_darkest_hour",
    "book_of_shadows_blair_witch_2",
    "the_matrix_resurrections",
    "the_eye",
    "gods_of_egypt",
    "independence_day_resurgence",
    "poltergeist",
    "clash_of_the_titans",
    "annabelle",
    "the_mist",
    "malignant",
    "pandorum",
    "skyline",
    "the_day_the_earth_stood_still",
    "into_the_storm",
    "the_happening",
    "the_cloverfield_paradox",
    "indiana_jones_and_the_kingdom_of_the_crystal_skull",
    "the_haunting_in_connecticut_2_ghosts_of_georgia",
    "event_horizon",
    "i_am_legend",
    "see_no_evil",
    "the_meg"
  ]
}