{
  "id": 3369,
  "title": "Jerry Maguire",
  "starring": [
    "Tom Cruise",
    "Renée Zellweger"
  ],
  "runtime": 138,
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "description": "Jerry Maguire used to be a typical sports agent: willing to do just about anything he could to get the biggest possible contracts for his clients, plus a nice commission for himself. Then, one day, he suddenly has second thoughts about what he's really doing. When he voices these doubts, he ends up losing his job and all of his clients, save Rod Tidwell, an egomaniacal football player.",
  "releaseYear": "1996",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lABvGN7fDk5ifnwZoxij6G96t2w.jpg",
  "categories": {
    "plot": 6.428571428571429,
    "acting": 7.363636363636363,
    "ending": 7.0,
    "soundtrack": 8.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 8.333333333333334,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I really enjoyed the human aspect of this movie, Cameron Crowe does a really could job in capturing that element with his characters. In addition making those characters more real and someone we can all relate to on some level."
    },
    {
      "rating": "9",
      "text": "It is both hilarious and heartfelt. Well acted and well written. Probably one of the most quotable movies of all time, and one of the few that actually brought a few tears to my eyes. Bonus points for one of the best child actors ever!"
    },
    {
      "rating": "10",
      "text": "SHOW ME THE MONEY."
    },
    {
      "rating": "7",
      "text": "Show me the money!!Tom Cruise hams it up as usual as an agent for sportsmen, loses his job then starts up on his own.Renee Zellweger & Jonathan Lipnicki are in a good supporting cast & it's a pretty good story despite the silly ending bit with Cuba Gooding Jr."
    },
    {
      "rating": "7",
      "text": "this movie took me by surprise, i do realize that it was nominated for best picture but i didn't think that it was that good, the movie is absolutely entertaining with powerful scenes making a great story and you can see Tom Cruise at his best, i mean if you really want to watch a movie that you fell in love with Tom Cruise then this is the right place, just love it."
    },
    {
      "rating": "8",
      "text": "Tom Cruise as Jerry Maguire can be a bit annoying at points in the way he portrays the character, and some of the scenes just want to make you roll your eyes at the decisions of this man, but that's the point of Jerry Maguire; love it or leave it."
    },
    {
      "rating": "8",
      "text": "Jerry Maguire shows Tom Cruise in his comedic side, even better, this movie shows Tom Cruise even he can be hilarious more than the average comedians out there and that's saying something."
    },
    {
      "rating": "6",
      "text": "show me the money..Jerry MaguireThere are some genuine emotional moments with cliched touch which works for the most part of the movie with the help of some good performances but lacks complete understanding on executing a scene. Jerry Maguire despite of its strong writing material relies totally upon the performances and brings out the best from each and every character. Cameron Crowe still needs some work to do on supervising and executing from paper onto the screen. As mentioned earlier, it is filled with stellar performance by Tom Cruise, Cuba Gooding Jr. and Renee Zellweger. Jerry Maguire starts off slowly as it takes its time to settle on its first act and then boosts up with incredible writing and finishes off majestically."
    },
    {
      "rating": "3",
      "text": "Yeah, the kid was cute, there was a little bit of humour, but the plot doesn't make much sense. The pacing is just wildly uneven and the plot doesn't make much sense probably because you can't understand whether it's too simple or complicated. Tell me, why did I think this was any good in the first place?"
    },
    {
      "rating": "8",
      "text": "Jerry Maguire may be rather overlong and a little pedestrian in places, but overall it is a very interesting and somewhat unusual film. The concept really intrigued me and one of the main reasons why I saw Jerry Maguire in the first place, and this concept worked really well thanks to the well written story and the witty and poignant script. Jerry Maguire is also beautifully filmed with lovely cinematography and scenery, and the soundtrack is warm and infectious. Cameron Crowe's direction is very good, as are the relationships between the characters. Jerry Maguire also benefits from some superb performances. Tom Cruise gives one of his best performances here, and he is perfectly matched by Renee Zellwegger at her most beautiful and the adorable Jonathan Lipnicki. Though the real star is Cuba Gooding Jnr who is absolutely marvellous as Jerry's sole remaining client. To conclude, a very good film, well worth watching for the performances and concept alone. 8/10 Bethany Cox"
    },
    {
      "rating": "5",
      "text": "The only thing that saves this movie from being a boring, cliched romance is the relationship between Jerry and Tidwell"
    },
    {
      "rating": "8",
      "text": "Successful sports agent Jerry Maguire begins to question his purpose in life, putting him firmly at odds with his employers. Finding himself stripped of his high earning clients, Maguire is left with just one client, the unpredictable Rod Tidwell.Tom Cruise and Cuba Gooding Jnr, alongside Renee Zellweger in her breakout role, are all on top form in this entertaining and humorous sports drama. Add to this a winning script, and just the right amount of heart, and you have one of the best movies in the genre."
    },
    {
      "rating": "7",
      "text": "Really nice film. The acting is really good and the while the romance is most certainly filled with mush, it's not overbearing. Cuba Gooding Jr. does really well as the egotistic athlete and the ending (both sports-wise and romance-wise), will certainly leave you smiling."
    },
    {
      "rating": "9",
      "text": "Jerry Maquire is an essential film for everyone and is one of the most ideal date movies out there with a sports side for the males and some romance for the females. Cameron Crowe's direction is incredible as his films often are and the film boasts several good performances. Tom Cruise takes another break from the action films that made him famous to do a fun, heart warming film. Cuba Gooding Jr. plays the role of his career and is the true standout in the film and then there is the beautiful Renee Zellweger who manages to deliver one of  her most notable roles as well. Jerry Maguire avoids all the romantic comedy clichés which Cameron Crowe is also great at and serves as a building block for Crowe's magnum opus Almost Famous later on in his career."
    },
    {
      "rating": "7",
      "text": "This movie completes me. I was actually surprised my kids sat through this with me. Usually, they resent the idea of me pulling a old movie out of my ass and forcing them to watch it. Sitting through a lot of the quotable moments reminds me this is a quotable movie. \"You Complete Me.\" \"Show me the money!\" \"You had me at hello.\" \"Luke, I am your father\" Many moments to remember. The Lipinski kid was a cute little bugger as well. Thanks to him I know a human head weighs 8 pounds. I would have thought it was no more than 6 pounds. This movie also shows us what Renee Zellweger looked like before she was abducted by aliens and replaced with a not so exact copy."
    },
    {
      "rating": "9",
      "text": "Sports drama that does everything possible to avoid the conventional and succeeds, about a sports representative who must balance between commitment and reliving the career of his protégé. One of the most prominent roles of Tom Cruise."
    }
  ],
  "recommendations": [
    "a_few_good_men",
    "as_good_as_it_gets",
    "american_hustle",
    "notting_hill",
    "catch_me_if_you_can",
    "trouble_with_the_curve",
    "rain_man",
    "daredevil",
    "hitch",
    "legend",
    "good_will_hunting",
    "lawless",
    "the_terminal",
    "crazy_heart",
    "morning_glory",
    "police_academy_2_their_first_assignment",
    "the_royal_tenenbaums",
    "hook",
    "the_king_of_staten_island",
    "role_models",
    "all_the_money_in_the_world",
    "true_grit",
    "eddie_the_eagle",
    "the_dilemma",
    "black_mass"
  ]
}