{
  "id": 3340,
  "title": "Jessabelle",
  "starring": [
    "Sarah Snook",
    "Mark Webber"
  ],
  "runtime": 90,
  "genre": [
    "Thriller",
    "Horror"
  ],
  "description": "A young woman recuperating at her father's run-down home after a tragic accident soon encounters a terrifying presence with a connection to her long-deceased mother.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oyszsO25OfSxkxhKCCnk9ZrAjkp.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 3.2,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.5,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "It is a film about a young woman whose past haunts. Jessabelle is not a new concept, but it has some scary vibes going on. It is the perfect movie for a Friday night."
    },
    {
      "rating": "4",
      "text": "A young woman (Sarah Snook) returns to her childhood home to recuperate from a car accident and encounters a long-tormented spirit that refuses to let her escape."
    },
    {
      "rating": "3",
      "text": "This movie is not very good. It has its moments, especially in the first few minutes, but ultimately, it's a horror movie looking for a good scare...which it doesn't really have. It's only saving grace is Sarah Snook, who give a fairly solid performance although it's not at  the same level as her one in \"Predestination\", in which she was excellent. But, I think she's an actress to watch and may end getting some strong award buzz in the future."
    },
    {
      "rating": "8",
      "text": "One of the nice things about Jessabelle is that it isn't trying too hard.\r Watch this movie online http://www.watchfree.to/watch-2a0441-Jessabelle-movie-online-free-putlocker.html"
    },
    {
      "rating": "7",
      "text": "This movie was pretty good. If you watch too many times, you will probably hate it. But it's a pretty good film, and I really like Sarah Snook in the film, she did a great job. Not my favorite Blumhouse film, but it's worth watching. Who knows, you might love it! ;)"
    },
    {
      "rating": "6",
      "text": "This film tells the story of Jessabelle, or Jessie, a girl who went to live with an aunt as a child after her mother's death. When she breaks both legs in a car accident, she's forced to return to her father's house, which is a stranger to her. In her old paternal home, she will rediscover the memories of her late mother, as well as a spirit of her past that will disturb her. The script is, thus, explained in few words and does not seem to bring additions to the traditional ghost story: a girl who is forced to discover an obscure part of her past by the supernatural intervention of a ghost. However, despite this lack of originality, the script works well and the story is well done. It takes place in rural Louisiana and makes good advantage of traditional black cultures and beliefs, such as vodoo and African witchcraft. Perhaps this use of vodoo is, in fact, the only remarkably uncommon note in this film. The end is based on a very nice and surprising twist plot, cutting the predictability that is felt throughout history.Sarah Snook did a good job in the lead role, and the supporting cast does a competent job as well. What I would most emphasize, however, is the good performance of the director, who has shown himself capable of horror without recourse to liters of false blood and limb amputations, as he was accustomed to doing in the \"Saw\" franchise. Cinematography is good but not brilliant. The scares are good, but don't properly frighten those who are inveterate fans of horror movies. It's enough, however, to cause some discomfort and tension, which is also pleasant."
    },
    {
      "rating": "2",
      "text": "The film has a pretty bad story, the concept is interesting if it was developed properly but is a concept that can work in other genres outside \"horror\"The story and direction are boring, there are barely any creepy moments and when they appear they are poorly executed.Terrible dialog and acting with almost no character development.The whole movie unveils so slow that gets uninteresting so fast.This is a kind of movie when if you don't know what to watch then watch it, but this movie in general is a waste of time."
    },
    {
      "rating": "0",
      "text": "Sérieux ?! C’est quoi ça?! J’ai rien compris à la fin et c’est pas du tout mon genre de film"
    },
    {
      "rating": "8",
      "text": "Voodoo stuff as murdered black baby comes back to take the body of the white girl who was adopted to replace her."
    }
  ],
  "recommendations": [
    "orphan",
    "mama",
    "case_39",
    "ouija_origin_of_evil",
    "insidious_chapter_3",
    "the_woman_in_black_2_angel_of_death",
    "the_uninvited",
    "marrowbone",
    "you_should_have_left",
    "house_at_the_end_of_the_street",
    "the_woman_in_black",
    "the_skeleton_key",
    "the_boy",
    "brightburn",
    "the_conjuring_the_devil_made_me_do_it",
    "annabelle_comes_home",
    "lights_out",
    "the_forest",
    "the_autopsy_of_jane_doe",
    "the_haunting_in_connecticut",
    "nightbooks",
    "the_house_with_a_clock_in_its_walls",
    "i_see_you",
    "sinister_2",
    "the_unholy"
  ]
}