{"id": 2870, "title": "Jexi", "starring": ["Adam DeVine", "Alexandra Shipp"], "runtime": 84, "genre": ["Comedy"], "description": "Phil's new phone comes with an unexpected feature, Jexi...an A.I. determined to keep him all to herself in a comedy about what can happen when you love your phone more than all else.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/pdYhXJPoV0Kvwdih74lejHPTyWL.jpg", "categories": {"plot": 6.0, "acting": 6.2, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.25, "action": 5.0}, "reviews": [{"rating": "6", "text": "A funny insecure guy's phone takes on a life of it's own. At first it helps him with stuff, including talking to girls. But soon after it develops a crush on him and will stop at nothing to have him to itself. It sounds like a horror movie but its more of a comedy. Rose Byrne is hilarious as the voice of Jexi and cutie Adam Devine is fun as the lead. But although the movie is funny it never takes the promising concept where it could go. Instead we are left with a lot of mediocrity and some occasional inspired bits here and there.6/10"}, {"rating": "8", "text": "This is a very flawed movie, but I enjoyed it. It was extremely funny, and gave me a few good laughs. The plot isn't great, the life lesson the movie tried to teach wasn't good, and there were a few scenes that were cringy and made me facepalm, but the movie knew how to crack me up, and the delivery was great. It relieved some of my stress, and that is why I give this comedy an 8 out of 10. Not close to perfect, but a great film that was fun to watch."}, {"rating": "0", "text": "This movie wasted my time, it's not funny and takes a creative concept and makes it toilet humor. It's not engaging and no likeable characters. Comedies have gone to the crapper as of late, 2019 audiences were exposed to crap like this, Stuber, The Hustlers and ect. This movie doesn't engage the audience and wasted a novel idea."}, {"rating": "0", "text": "I hate to say it, but this is quite literally THE *WORST* movie I have ever seen in my life... It’s tragic! A completely failed attempt at “comedy”... LoL"}, {"rating": "0", "text": "I never thought I'd ever watch a movie so bad, that I'd feel obliged to create a Metacritic account specifically to write a review. AND I HAVEN'T EVEN FINISHED WATCHING YET. Actually, it's probably the worst single *thing* I've ever seen. It's not even a \"so bad it's good\" thing, far, very far from it. The plot makes zero, ZERO sense, even when it tries to be serious at times (and fails horribly). Avoid it like the plague.I feel horrible with the thought that I'll never be able to come back to a time, when I still haven't watched this movie."}, {"rating": "5", "text": "Adam Devine is often charmingly funny, so it's a good thing he's the star of this film. Other than him, the rest of the movie is pretty much by the numbers. He plays a screen-obsessed journalist whose life is upended when the titular operating system takes over his devices (think Her as a comedy). He stumbles thru his life, career and a potential romance, while trying to cope with this pushy, humanish OS (voiced by Rose Byrne). There's nothing about the plot that's original and the only supporting character who's remotely amusing is Wanda Sykes (isn't she always?). Still, Devine's sweet appeal makes this movie moderately entertaining."}, {"rating": "7", "text": "If you like Adam Devine movies, you will probably be at least amused some of the time by this movie.  Its Adam Devine silly comedy, mixed with a dead-pan Alexa-like phone talking to him.  The plot has odd plot-holes, and the story follows traditional comedy/romantic comedy style with the story arc, but as a silly comedy, its fine.  If this went to Netflix it would have been in the top #10 right now and people would be fawning over it."}, {"rating": "5", "text": "It’s lazy and surface-level as hell, but I’d be lying if I said my audience and I did not laugh a handful of times. I doubt it’s worth your time, but there are more painful movies out there."}, {"rating": "8", "text": "Maybe they were not top-flight jokes but I laughed. Hilarious application voice."}, {"rating": "7", "text": "Something different than usual, maybe a bit stupid at times, but it is a silly comedy and if you have seen trailer for this you know what to expect. nothing genius, but i enjoyed it."}, {"rating": "8", "text": "8/10Jexi is about the titular Siri/Alexa-like phone program (voiced by Rose Byrne) with a mind of her own who ends up wreaking havoc with the life of an introverted phone addict played by Adam Devine. I generally liked this.Jexi makes this film. Her smack talking brings the biggest laughs. I also appreciated that this avoids some of the cliches you usually get with AI-run-amok films. Jexi lets you know what she is from the get-go. There's no slow burn of her pretending to act regularly or slowly gaining sentience. However, her arc does become more predictable in the second half.They really didn't have to hire a known actor to do this. Plenty of people could've easily spoken in a phone-like voice without vocal change. Still, I do admit that Byrne does a good job. I also liked the usually more over-the-top Devine who does a good job with a more subdued role. (This is especially a relief because I didn't think he did a great job in his last straight man role in Isn't it Romantic.)Understand that this movie works more on a feel-good level than a laugh-a-minute one. Jexi is in about every other scene. When she isn't there, some people may find some of the scenes, many of them involving Devine's character predictably growing as a person, too leisurely for their taste.This film is a little lightweight. It's not something you need to see immediately, but it's worth giving a chance sometime."}, {"rating": "2", "text": "Why does Adam Devine still get leading roles?I mean he's like Rebel Wilson, playing the same character over and over again."}, {"rating": "8", "text": "Amazingly weird and entertaining!music was great references used throughout was awesome concept was nice could be even great but enough to entertain michael pena was amazing as always!this movie made me really feel yaa why to stare a box for so long some moments were amazing!overall amazingly entertaining movie even if critics are against it!"}, {"rating": "10", "text": "I like you'er movie a lot it was funny awesome made me laugh and fall of of my sit I am hoping that i will own it and watch it again"}, {"rating": "8", "text": "TL;DR - 8/10 - A very funny comedy, one where you don't have to think too much and can easily just chill and laugh and take in frankly a good story too.------I had never heard of this film before I saw a random advert for it so I had no preconceptions going into it, I didn't even realise it was a rom-com before starting it.Jexi is by no means \"high brow\" comedy, you won't get any intelligent jokes but this in no way means this is a bad film, in fact I enjoyed pretty much every minute of it.The \"romance\" part of the film was fairly cliche, boy meets attractive girl, boy lacks confidence, sequence of events starts the relationship...the difference is that the sequence of events is a borderline psychotic phone AI that \"wants to make your life better\"Jexi being the titular character really makes this film (and honestly that's kind of the point...) an AI that takes control of your life in an effort to make it better, with the digital world being so connected now, it makes sense that Jexi would have access to your bank accounts, email accounts etc. and can do whatever it wants should it wanted to.The interactions between Jexi and Phil (Jexi's owner) are frankly brilliant, as I mentioned before, don't expect jokes that will make you think to get to the punchline, honestly about 75% of the humour is basically Jexi abusing Phil, and if that's your thing then it's hilarious. I can understand why some people don't have this type of sense of humour but the ratings it's received I feel are quite harsh on this front.As cliche as the story is, it's a very good and modern take on your typical rom-com, and as a side effect does make you think somewhat about how much you use your own devices on a daily basis."}, {"rating": "8", "text": "This was hilarious twist on a modern movie, especially since everyone is on their phone all the time!  It is ridiculous and laugh out loud cute and funny!  Enjoyable 90 break from reality right now."}, {"rating": "0", "text": "There's a cultural divide here. I'm an older Gen Z watching with my Baby Boomer parents, who are in **** stitches over this movie whereas I am writing a 0 star review on metacritic for a movie that I am watching currently. This **** seriously sucks"}, {"rating": "9", "text": "This movie was very funny it had me in stitches laughing I was crying at some parts from laughing so much. I hope there is a sequal"}, {"rating": "5", "text": "The start was pretty good but the plot didnt work out very well. At some point the jokes stopped being funny and became repetitive. I dont regret watching it but I wouldnt recommend it to any friend"}], "recommendations": ["ted_2", "this_is_the_end", "the_hangover", "rough_night", "jackass_presents_bad_grandpa", "knocked_up", "neighbors", "dinner_for_schmucks", "the_cobbler", "neighbors_2_sorority_rising", "30_minutes_or_less", "the_watch", "identity_thief", "ted", "the_happytime_murders", "hot_tub_time_machine", "grown_ups", "good_boys", "the_change_up", "couples_retreat", "funny_people", "the_hangover_part_ii", "step_brothers", "thunder_force", "zookeeper"]}