{
  "id": 1516,
  "title": "Jigsaw",
  "starring": [
    "Matt Passmore",
    "Tobin Bell"
  ],
  "runtime": 92,
  "genre": [
    "Horror",
    "Crime",
    "Mystery",
    "Thriller"
  ],
  "description": "Dead bodies begin to turn up all over the city, each meeting their demise in a variety of grisly ways. All investigations begin to point the finger at deceased killer John Kramer.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2mUqHJG7ZiGwZYIylczFCsRPbXM.jpg",
  "categories": {
    "plot": 5.931034482758621,
    "acting": 6.25,
    "ending": 4.869565217391305,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "The Saw franchise returns seven years after the not-so-final chapter was released, continuing the beaten dead horse tradition of horror franchises returning for more quick cash grabs after supposedly being done a la Friday the 13th, Nightmare on Elm Street, Halloween, etc. After seeing this one just for kicks and giggles, I can confidently say that this did not warrant resurrecting this franchise at all! The characters were all dumb and unlikable, the dialogue was unbelievably clumsy and absurd quite often throughout, and of course, the ending deliberately left the door open for potential sequels to follow, go figure! Overall, I'd find it difficult to picture even die-hard Saw fans finding much to like about this one, other than the expected gore and over-the-top deaths, because in terms of story and acting, this one hits an all new low for the franchise."
    },
    {
      "rating": "9",
      "text": "This is a completely new story, subtly connected with the previous parts of the Saw classics, thanks to scriptwriters for this)The actors played well, I personally liked it. The film kept in suspense, ideally. Micro humor was even in the subject, although judging by the trailer at first glance you can ask: \"what the hell in the franchise saws there is humor?\"Ending class, as in the seventh partThe jigsaw was good. I was afraid that there would be **** but the film surpassed all my expectations and was able to surprise9 out of 10"
    },
    {
      "rating": "5",
      "text": "The movie is exactly what to expect from the Saw franchise. The \"main trap\" of the movie fails to surprise, and the effect it should cause its reduced by the transitions with other scenes out of the context. I have to admit that I really enjoyed the connection with the overall plot from the franchise, mostly because of the ending.The movie kept the same \"style\" as the previous movies, so if you keep your expectations based on the last movies from the franchise, I think you'll probably enjoy it."
    },
    {
      "rating": "2",
      "text": "How many Saw movies must we get before this endless parade of unnecessary sequels stops for good? Saw 8, lads enough is enough. There are only so many ways you can kill someone in the most grotesque way imaginable before it all starts to become rather dull. Jigsaw torturing his victims for an hour and a half is the most boring thing you can watch.Dead people are popping up around the city, each dying a gruesome death and all the evidence is pointing towards John Kramer aka Jigsaw aka someone who's supposed to be dead for the past ten years. Ooh scary. The entire film moves from a scene of torture to a scene in a laboratory with everyone staring suspiciously at one another because maybe someone knows something about these murders that they just shouldn't. Now let's move to another torture scene with saws and acid. And back to the lab we go for some plotsplaining. This might be where the mystery and suspense should come in but it doesn't. No atmosphere, not scary, an absolute waste of space. It's not painful to watch due to the extreme violence, it's painful because it's so bad it's boring. Not recommended, not worth your time, hopefully this will be the Saw movie that ends all Saw movies because this is a franchise that no one cares about anymore, whatever appeal Saw originally had is gone now."
    },
    {
      "rating": "10",
      "text": "Amo como logro conectarse con las demas peliculas, y totalmente haciendo una nueva historia. Sin duda entre en mi top 3 de las mejores de la saga y espero sin duda mas peliculas de JigSaw, no dejen morir esta gran saga."
    },
    {
      "rating": "4",
      "text": "Hey guys, remember Saw 3D from, you know, seven years ago? I know I did and I was completely disappointed by the result it just gave me. Apparently, they just lied about it becoming the final chapter and wanted to add more installments because they're in it for the horror and money. In this eighth installment for the Saw franchise, things saw a huge improvement right after the disappointment of Saw 3D but Jigsaw still has a long way to go to becoming the horrifying treat of the year."
    },
    {
      "rating": "8",
      "text": "Jigsaw Was a good reboot of the Saw Franchise Jigsaw did a lot of things I liked the Characters are good I care for the victims and for Logan until the ending comes The traps were interesting in this movie definitely Mitch trap specifically John was not really in this movie I was expecting he was gonna be in it a lot longer he is mainly in the third act the ending to this movie is too much for a reboot Logan helping Jigsaw makes no since once again like Hoffman in Saw IV this movie was going really good until that happened the movie lost me when that happened Saw Does this in all their movies and it hurts it I don't get that it hurts the movie they still haven't learned Ryan was a most interesting character for me where I was wondering why does he act like that does get explained a little bit So Jigsaw has likable characters the story is not good at all but If u are a fan of these movies you will have a good time and enjoy your self so I give Jigsaw An B-"
    },
    {
      "rating": "0",
      "text": "kir khar dahaneton baba ah gaEdin in filmo be mola asan man nmifahmam chera enqad kam nomre midin man khodam koon midam be in film bad shoma koonia umadin inja khayemali mikonin akhe kooniaye jende man khodam ozve deep webam miam kooneton mizaram jendeha akhe adam enqad kir tu dahan mishe...shir to shorte Madare In BalaE ham ke Enqad nomre kam dade"
    },
    {
      "rating": "4",
      "text": "Esta franquicia ya debería de acabar, Jigsaw es completamente rebuscada e innecesaria, los personajes son aburridos, la trama es inútil, lo único que salva son las trampas."
    },
    {
      "rating": "1",
      "text": "How people still stomach this crap is beyond me.  Paper thin characters, darkness, and a bunch of people being mutilated in horrible ways?  Who enjoys this filth? I mean holy crap.  Sick puppies that like watching people die. don't waste your time."
    },
    {
      "rating": "3",
      "text": "When you make the traps overly complicated to activate and function, it's a sign that Saw is losing its edge. Ffs, any trap that isn't the buckethead trap is flawed as f*ck.What's also annoying is that this movie's main plot is on autopilot until the end. So this means that the twist has to be good if the movie is going to be decent.But just like the traps, the twist is overly convuluted and confusing."
    },
    {
      "rating": "3",
      "text": "Пила 8- убогий и халтурный фильм. С каждой частью все хуже и хуже и эта часть не исключение. Ужасный сценарий и бессмысленные герои. На фильм можно идти, если только посмотреть на мясо и на креативные эффекты убийств. В целом фильм ужасен, не советую."
    },
    {
      "rating": "8",
      "text": "I must say this film cannot be compared to the original \"Saw\" movie. Despite this, it's a great franchise resurrection (after the terrible \"Saw 3D\").So, what's about film's advantages? First of all, it provides fans a totally new story and awesome plot at all: \"meat\" is not a word to describe the content of \"Jigsaw\" as blood-scenes here take quite a small part (I guess, to remind us of what franchise this film is a part of). Actually, it's a detective with horror elements and, to be honest, a GOOD one. Puzzles, twists and suspense - that's it! You watch \"Jigsaw\" being confused by the plot and then you are amazed by the explanations in the end - that's what I missed in the last \"Saw\" films, especially in the totally transparent and dull seventh one.What's more, the actors played really well. Panic? Fear? Pain? All this emotions were transferred by them in the best way. Also, I've noticed quite a great soundtrack: thanks Charlie Clouser for this magnificent music that perfectly suits the film.OK, and what about film's drawbacks?Well, I can't say straight, but the micro-humor of this film isn't necessary at all. It only disturbs you while watching such serious movie like \"Jigsaw\". OF COURSE, it doesn't make the film comic (oppositely to the dumb trailer), but it's just useless. You remove it - you get a cleanliness in the plot.The second thing I don't like in \"Jigsaw\" is its gamma. Do you remember the fifth film with its beautiful blue tones? Such detail increases the film's atmosphere and also \"Saw V\" was a boring project, it was atmospheric. What about \"Jigsaw\"? Its gamma is neutral. Just neutral with no expressions. At first you watch a great actors' performance, but then you get confused by the movie's strange colors, for instance, there's no gloominess in the indoor games scenes like it was in the \"Saw II\", consequently, no claustrophobic feelings.Two pluses, two minuses, but my rating of the film is 8. I am a fan of the \"Saw\" franchise and I like its new part.My consensus is that \"Jigsaw\" is a wonderful film with a few drawbacks. Thank you, Spierig brothers for this new experience!(Pardon if my English was wrong sometimes - I am a foreign man and still learn it.)"
    },
    {
      "rating": "2",
      "text": "The \"Saw\" films may be Halloween traditions, but the last films in the franchise (5-7) were some of the worst and most confused, incoherent messes ever in any major horror franchise. And now \"Jigsaw\" is here to continue that tradition. \"Jigsaw\" is a mess from beginning to end, it has no idea what it wants to be, or even where it should be in the brain dead timeline of this franchise. The kills are surprisingly tame, and even with the blood, do nothing to stand out from any of the other films, or even the numerous \"Saw\" ripoffs. The characters are stock, moronic, and just plain unlikeable, you are given no reason to care for any of these characters. I believe, that out of all these films, \"Jigsaw\" has the most forced appearances by Tobin Bell, he shows up because the movie tries to used the most obvious, and predictable twist this series could muster up (The movie is set between two timelines, and apparently this counts a prequel too...see the problem)"
    },
    {
      "rating": "9",
      "text": "The film is a good continuation of the saw franchise. The film is unique and interesting. I can't wait to see what they're going to do next with the franchise. If your a fan of the saw franchise or horror, in general, this film is a must-see."
    },
    {
      "rating": "7",
      "text": "Capable not the best of the franchise, and was not one of the best horror films of the year, but without a doubt, I leave a good taste in the film, and I think it is better than the horror movie Saw VII (considered for me the worst of the saga), even so the film is not perfect and makes many mistakes but despite that is enjoyable."
    },
    {
      "rating": "8",
      "text": "Not the first time a long-running horror series has made a return after it's supposed final chapter. Jigsaw delivers more of what fans want and not much else. It's new twists are clever, but perhaps not the most complex. It doles out hints at regular intervals so those who are paying attention and actively trying to figure things out before the big reveal will likely pick up on what's really going on in spite of the fake-outs. It's not as fun as just waiting for the explanations, but to each their own. My personal recommendation would be to let things play out without putting any real thought into it, because the plot is just creative enough to catch you off guard if you do. Plus this is the Saw series. Actually using your brain when watching it could kill your enjoyment of the entire thing. The new traps are fun and the deaths are as delightfully gory as ever. The Spierig's have come up with a quite a few inventive ways to kill people so the thrills of the game are still in place. You'll just have to put up with a moment of two of glaring stupidity from it's participants. It's always irritating when the would be survivors refuse to work with one another and instead just scream and refuse to cooperate. Especially in Jigsaw's case where someone's death was completely avoidable as they already new the solution, but would rather just cry and yell. At least when they go they do a lot of bleeding in the process. It's called torture-porn for a reason. This stuff isn't for the squeamish.All in all it's a worthy follow up for series. It relies on some familiar plot elements, but does enough of it's own thing to stand out from the rest of the movies while still managing to connect with them. Saw has found it's way into some good hands that have left the door open for even more. Who knows what will come next. As a fan of the previous films I enjoyed this comeback and wouldn't mind seeing the games continue on from this point. So yeah, Jigsaw is a success. Are you ready to see people receive the gruesome judgement in store for them? Are you ready to play another game? Well that option is finally here. Live or die, make your choice."
    },
    {
      "rating": "5",
      "text": "The quality of production and directing is a huge plus but I feel like the plot simply retreads a lot of what we have already seen before. The unimaginative traps were very disappointing and the main cast left a lot more to be desired, especially with Tobin Bell so annoyingly absent once more. All in all, It's better than the most recent films but not truly good."
    },
    {
      "rating": "4",
      "text": "This movie is one of those movies that never should've been made. The twist is okay, but the rest is just a lazy illogical mess. The Saw movies main characters are the traps, so you might think that they should put some thought into the traps, but no. I just hate when actions in movies doesn't make sense. To recap some example: One dude is standing exactly where a lasso is laid out on the floor. One dude is falling through the floor with one leg where a trap is. Two people goes into a silo that fills up with grain with different kinds of tools falling down on them, always landing with the pointy end down. A couple of nails falls perfectly into a womans arm. People with just some logical sense understand the impossibility of that happening. In other words: The traps, and the outcome of the movie, are dependent on stupid people walking into the traps themselves with a huge amount of randomness and lack of logic, lack of physics and lack of human anatomy involved in making the traps lethal. I bet there's tons of writers out there who could've done a much much better job."
    },
    {
      "rating": "4",
      "text": "The eighth installment in the outrageously-gory and suspenseful Saw franchise is nowhere close to being even half as good as the worst one in the original series. The gore is still there, but the general plotline came to be very predictable (especially the merging of different timelines and who the antagonist is), and the mysterious dark feel of the games we got to see in the previous films has been replaced by pointless narrowed-down bloodshed and, sometimes, humor. There are a lot of mistakes that show the lack of effort that was present sometimes (one that comes to mind is the doctors showing up at the scene of the crime in their lab-scrubs... really?). The whole film just feels tired and without purpose."
    },
    {
      "rating": "4",
      "text": "You know what I hated about this movie? Seeing the big final trap was the one thing keeping me slogging through yet another so-so set of criss-crossing story arcs starring yet another cast of tepid characters getting offed via yet another bevy of impractically Rube-Goldbergian death devices, involving yet another mystery John K accomplice and building up to yet another timeline twist.... You know what I liked about this movie? That it wasn't Saw 4, 5 or 3D. At best, just an incredibly not too terrible Saw movie. At worst, totally unnecessary."
    },
    {
      "rating": "8",
      "text": "Impressive addition to the Saw series with a great twist, fans of the earlier films won't be disappointed."
    },
    {
      "rating": "5",
      "text": "I'm a sucker for a Saw movie and this was an entertaining 92 minutes.  It was a 7 at times but I've ended up going just 5 simply because it needed to take a few more minutes at the end to explain things.  It would have made for a much more satisfying conclusion if we'd been given a bit more time, maybe two or three minutes, to take in what we were being told. Bad choice to rush it through at 100mph."
    },
    {
      "rating": "4",
      "text": "Was hoping for a new energy in this franchise instead all that's given is a stale piece of bread. There is just nothing new or interesting here and when you get to the end the twist lands with a thud. Not the worst in the franchise but nothing worth restarting it for. C-"
    },
    {
      "rating": "1",
      "text": "Normally, I'm the guy people joke about cause I like \"bad\" movies... and that goes from Paranormal Activity to The Human Centipede all the way to the Saw Series. I honestly always like the SAW saga... Of course I had a lot of notes about all movies, be it the weird-pink blood on SAW VII or the dumb characters we meet throughout the series...But wow, Jigsaw manages to almost ruin the other movies for me. It's not only a terrible movie when it comes to story telling, it sucks as the torture porn SAW movies have been made to be. Honestly, it's not nearly as gory as other SAW movies, it's not as clever, it's not as surprising... It's just the dumbest, dullest, ugliest SAW movie.Or I could be wrong and this might just be the greatest SAW trap ever.The movie is the trap and we are the victims..."
    },
    {
      "rating": "8",
      "text": "A supposed \"reboot\" of the Saw series, even though it has precisely the same charms (clever \"games\", genuine suspense, spectacular deaths) and flaws (convoluted plot, unconvincing \"twists\", absurd criminal psychology) as the earlier ones. It even stars the same actor (Tobin Bell) as Jigsaw himself, so...more like an eighth film made after a lengthy hiatus than a complete reset to the franchise.That said, it's arguably one of the better Saw films, whatever that might mean to you. Heck, I enjoyed it, like I always enjoy these films. But they're far from masterpieces, and aren't the slightest patch on the more maligned Hostel films. If you enjoyed the first seven films, though, you're unlikely to be disappointed."
    },
    {
      "rating": "4",
      "text": "The next installment of the Saw film series proved to be a very bad one for very boring people. Our criminals have a blatant sad and not good storyline. The perpetrator is a idiot and the investigation is not very brave. The final twist was the only interesting part of the whole production."
    },
    {
      "rating": "7",
      "text": "I enjoyed it, maybe not the best one of Saw series movies, but I liked the story and the ending was not really predictable"
    },
    {
      "rating": "2",
      "text": "Me encantaban las pelis del juego del miedo, esta fue malisima. Totalmente rebuscada, cero posibilidad de unir los cabos y descifrar por tu cuenta lo que pasa, el guion parece de una pelicula de bajo presupuesto, las conversaciones super cliche. Malisima"
    },
    {
      "rating": "10",
      "text": "This movie is amazing. It totally represents the spirit of the last saw movies and uses an awesome way, to connect the new movie with the old ones. A great twist.The story is great and the traps remind of the last saw traps. The spierig brothers did an amazing job and I really hope, they will do more saw movies on the future. They really respect the past movies and continue the history with honor.they do better than James wan did the past years."
    },
    {
      "rating": "6",
      "text": "It TriesAfter a massively disappointing end to the Saw franchise 7 years prior, This Soft-Reboot isn’t perfect, But it definitely tries to be at least decent."
    },
    {
      "rating": "5",
      "text": "Jigsaw is back, but in the wrong way. This new chapter of the most famous horror-splatter saga in the world isn't as good as the previsions. I think that the power of this saga is finish after the fourth chapter. John Kramer was the only and unic jigsaw, the rest doesn't matter."
    },
    {
      "rating": "5",
      "text": "I'll be honest, I watched it because I had already seen the whole saga, let's say that sometimes I sin of being a completist.But talking about this movie I have to say that there is nothing new or interesting. This movie is committed to everything the franchise had already done and it's quite evident that that was enough for them.Undoubtedly it points to the most fervent fans of the franchise and also the new audiences will undoubtedly see it as one of the horror novelties on theaters and its offer might be sufficent for them.For people like me, it's just more of the same and sometimes you've gotta say: enough."
    },
    {
      "rating": "5",
      "text": "If your 8 movies into this franchise and expecting a movie with great characters and a plot that makes sense than I don't know what to saw to you. The film was exactly what I expected it to be it was entertaining fun and thrilling. There are some things that this movie improves on a lot from the sequels, the cinematography is pretty great, it didn't rely on nostalgia, it looks a lot more professional and its a lot more fun than the other sequels. But most of the film felt really tamed compared to the other sequels and honestly it seems more like a pg-13 movie, not saying I want straight up torture porn but some more gore would have been good. I don't really have much else to say about the film because again if you're expecting a well made deep movie at this point in the saw franchise than sorry but your **** retarded. also the last 10 minutes of the film makes absolutely no sense"
    },
    {
      "rating": "7",
      "text": "The movie was pretty entertaining and the traps were pretty cool. But, the movie seems a little bland since its the same story like the other 7.0 But, I enjoyed it no matter what, I've been a SAW fan since I was 10 and it has yet to dissapoint me"
    },
    {
      "rating": "10",
      "text": "The eighth installment in the franchise once again proves Jigsaw is becoming more diabolical and twisted with his clever, self-inflicting traps to once again \"play a game.\" The characters are not as interesting, but the traps are gory and grisly as with any Saw film."
    },
    {
      "rating": "6",
      "text": "This isn't a bad movie, its story is solid and it doesn't have much gore. It was directed well and had some decent acting. but it's not a good movie. The themes explored in it are nothing new. I will not be changed by this movie. I will not refer this movie to someone looking for a new horror movie. But it was a good Halloween treat. Check out the Saw films instead."
    },
    {
      "rating": "6",
      "text": "dont get me wrong, i totally feel the appeal of hurting other people when they have it coming.  maybe this movie takes it too far.  there are better way to hurt people."
    },
    {
      "rating": "8",
      "text": "After a series of murders bearing all the markings of the Jigsaw killer, law enforcement officials find themselves chasing the ghost of a man who has been dead for over a decade, and they become embroiled in a new game that's only just begun. Is John Kramer back from the dead to remind the world to be grateful for the gift of life? Or is this a trap set by a killer with designs of his own? Jigsaw definitely won't win many converts to the Saw franchise, but for longtime fans, it should prove a respectably revolting -- if rarely scary -- diversion. Final Grade is a B+."
    },
    {
      "rating": "5",
      "text": "As a big fan of the series I was quite disappointed to see that many questions from the last movies have not been answered. The most obvious one: Where the hell is Dr.Gordon? The acting was terrible and I honestly had to cringe a lot. Especially at the beginning. But Tobin Bell saved it a bit.But I did enjoy the huge plotwist even though I had figured it out before the ending.If you are a saw fan: Watch it! If not: Its very beginner friendly. Just dont expect something too great. Its OK"
    },
    {
      "rating": "9",
      "text": "The movie is fun and entertaining and never loses that touch that we love fans."
    },
    {
      "rating": "8",
      "text": "I loved but I lacked the gore that we loved in the saga even so it is recommended this return of one of the most important characters of terror."
    },
    {
      "rating": "9",
      "text": "I loved the movie, is fantastic and inattentive, I liked the characters and the traps were the best of the movie, without a doubt one of my favorites this year."
    },
    {
      "rating": "6",
      "text": "I can't say it's not interesting, but it's too much, i don't think there was no need for making this movie."
    },
    {
      "rating": "7",
      "text": "A solid return of the film franchise! I didn't really expect much as a long time fan but I actually like this film. My one main problem is that they left out the question from the previous film but I enjoyed it. Good story, good writing, acceptable acting, and gory fun! I recommend this film."
    },
    {
      "rating": "4",
      "text": "They REALLY didn't need to make this. I mean, it's okay, but...they really didn't."
    },
    {
      "rating": "5",
      "text": "I'd say it's better than three of the previous instalments, with some entertainment to be found, however at the end of the day, we've seen it all before, and it does not really add anything new to the franchise."
    },
    {
      "rating": "4",
      "text": "Another Jigsaw game but this time, out in the countryside, tries to make you think that Jigsaw is a live and running it but it is, actually, a prequel."
    },
    {
      "rating": "6",
      "text": "Well it isn't great BUT its pretty good, i didn't like the twist at the end but it's a saw movie and its a good saw movie well better then some latest movies. If you like saw movies watch it."
    }
  ],
  "recommendations": [
    "saw_iv",
    "saw_iii",
    "saw_vi",
    "spiral_from_the_book_of_saw",
    "saw_ii",
    "saw_3d",
    "saw_v",
    "saw",
    "paranormal_activity_4",
    "paranormal_activity_the_marked_ones",
    "rings",
    "the_collection",
    "wish_upon",
    "the_twilight_saga_breaking_dawn_part_2",
    "texas_chainsaw_3d",
    "insidious_chapter_2",
    "final_destination_2",
    "unfriended_dark_web",
    "the_grudge_2",
    "scream_4",
    "chernobyl_diaries",
    "dark_skies",
    "the_strangers_prey_at_night",
    "the_new_mutants",
    "malignant"
  ]
}