{"id": 1508, "title": "Jingle Jangle: A Christmas Journey", "starring": ["Forest Whitaker", "Keegan-Michael Key"], "runtime": 122, "genre": ["Family", "Fantasy", "Music"], "description": "An imaginary world comes to life in a holiday tale of an eccentric toymaker, his adventurous granddaughter, and a magical invention that has the power to change their lives forever.", "releaseYear": "2020", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/5RbyHIVydD3Krmec1LlUV7rRjet.jpg", "categories": {"plot": 5.0, "acting": 3.0, "ending": 3.6666666666666665, "soundtrack": 7.5, "cinematography": 5.5, "familyFriendly": 8.0, "funny": 8.0, "action": 5.0}, "reviews": [{"rating": "1", "text": "A gauche and garish festive flick that neither delights nor delivers on anything remotely entertaining - 1 star"}, {"rating": "7", "text": "After suffering a loss, the world’s greatest inventor/toy maker (Forest Whitaker showing a gentle and sometimes funny side) ends up in sad seclusion. It’s up to his granddaughter to show up and re-instill his belief in his talent.  At first appearance, this attempt at becoming a holiday classic looks like a big-budget Hallmark show and it maintains some of that syrupy feeling as it develops. However, there are a few things that set it apart. Most of the musical numbers are fine, but Madelen Mills’ Miles and Miles and Keegan-Michael Key’s Magic Man G are delightful show stoppers. There are also some lovely animated segments that propel the narrative thru some of the exposition. Overall, it’s a grand staging with lots of innocent energy and attractive storybook styled art direction. Suitably sweet for family holiday spirits."}, {"rating": "10", "text": "LOVED THIS MOVIE!I just adored this movie from start to finish. I'm a huge fan of stage musicals and this definitely gave me a stage-musical feel all the way. The story's very heart-warming and I the message in it is even better - nothing's impossible when you believe it can be done. We lose so much of this feeling when we grow up that we most often lose our way and this clearly demonstrated this belief. Back to the film though - the sets were absolutely breath-taking, the music was fantastic and uplifting, the singing was truly awesome and the dancing was exceptional - the cast was fabulous too - it was a breath of fresh air to see such a fabulously diverse cast.Overall, this is one movie that will remain a favourite of mine for years and years to come"}, {"rating": "5", "text": "Positives:Solid children's Christmas movie. Broadway-style show numbers. World was built SO well! Best I've seen a \"Christmas town\" look. Performances are great. Negatives:Music is pretty forgettable. Not bad but not something that stays with you. The main character wasn't introduced until 31 min mark. Slow to start. Long to end.Personal thoughts: Black cast and WHO CARES? Race had nothing to do with any character's journey. But a black cast performing mostly(not a music expert) hiphop and soul numbers? The movie felt like it was stereotyping music to a specific race and therefore stereotyping the audience... I felt pretty unsettled.I enjoyed this movie but it is not a holiday classic."}, {"rating": "0", "text": "Nah. Skip this captain. Nit the one. Poor delivery. Songs ok. Direction is all over the place, as is the plot. Strange subplot. You have to suspend your disbelief far beyond the realms of belief."}, {"rating": "10", "text": "From the cast, to the fantasy plot and songs! This movie is perfect! Made me smile and cry! ❤️ The pinch of fantasy we needed!"}, {"rating": "10", "text": "A new family Christmas classic that is entertaining and empowering and inclusive. The score is modern and infused with cultural richness. Mathematics and innovation is made cool. The square root of impossible is ME! What an amazing charge for any young girl."}, {"rating": "10", "text": "A great movie! We will watch it for years and years. A new story which is awesome."}, {"rating": "10", "text": "Ignore the racially motivated reviews, they offer nothing. Very good christmas movie, the one we need for 2020 during these difficult times."}, {"rating": "10", "text": "A positive family movie with great music and choreography. I appreciated the colorful wardrobe, as well as the stunning hairstyles of the characters."}, {"rating": "10", "text": "Fantastic film. So depressing to see such racist reviews on here. No this film isn’t an attack on white People. Get help. This is a wonderful film for everyone and one that we desperately need now."}, {"rating": "10", "text": "OMG!!! #JingleJangle is amazing, I love every second of it. Finally a christmas story with black protagonists. Great songs, amazing characters and a magical story,just beautiful. Congratutaltions to the cast and crew for this great achievement. It was made to be a classic."}, {"rating": "10", "text": "Absolutely amazing!!!  Grab your popcorn, hot chocolate, and a blanket to enjoy an awesome start to the holiday season."}, {"rating": "0", "text": "Boring slow no real plot very poorly written worst Christmas movie ever.The movie is set in Victorian era but the shops in the streets are  named after black inventors and dance moves are of African it not a Christmas classic too much singing very poor acting."}, {"rating": "9", "text": "A long overdue film that manages to capture the wonder of the Christmas narrative tradition in a manner truly aligned to the values which the holiday is meant to represent."}, {"rating": "4", "text": "It's a musical, with some decent CGI.But what it does well in the CGI, it lacks in actual acting skills. The children, I have the feeling  it's their first time they ever acted, and for the adults.. well.. I guess it's never too late to change your career.The plot is as boring as you can expect it - man is inventor, inventions get stolen, man goes after thief. During the entire movie, every time a bit of the story progresses, it instantly comes to a halt, as yet another song is sang, and you forget what you were watching.An average Netflix movie, but not one which I'll ever watch again."}, {"rating": "8", "text": "“Brevity Is The Soul Of Wit”“ It is better to keep quiet and have people think you are a fool than to speak and remove all doubt.”Jingle Jangle is a movie with problems. Most of the problems stem from its over-exuberant conception. It’s a film that tries to do EVERYTHING. Much of it, it does well. Masterfully, even. But much of it needed to be cut. It’s overly long and overly indulgent. It feels like a novel put to film without any of the editing that would usually go into such a translation. That being said, it’s a fun world that explores itself thoroughly. And when it’s funny, it’s FUNNY.It’s biggest sin is that it’s clearly written by adults to evangelize their adult worldview rather than to be entertaining to children. Kids don’t want to watch heavy handed but veiled exhortations about the practical value of trigonometry. That kind of thing is just included so adults can feel good about themselves while weighing the movie down considerably.But, in the end, the film IS worth watching.Maybe over several days for the kind of people who watch movies 25 minutes at a time."}, {"rating": "3", "text": "This movie drags painfully long. The pacing is atrocious. Nice costumes and effects but it's a brutal watch."}, {"rating": "9", "text": "I honestly can't believe the low score reviews for this movie. Not only is this an amazing black Christmas movie, it is very well edited, great visuals, performances it is an overall funny and spirited movie with a great message that has made our must watch list every holiday season. If you haven't watch this movie because you're turned off by average review score you're doing your family a disservice...especially if you have little girls like myself. Give it a try or let your kids watch it while you prepare dinner if you must but I think its worth a sit down."}, {"rating": "1", "text": "The only reason I'm giving it a 1 is the singing is great, no memorable toe tapping songs, but incredible voices. It was so flat, the children were far better than the adults, could have been so much more than it was. Mr Jingle voice was so quiet, was almost impossible to hear, he's a great actor so can only be the director to blame. Didn't enjoy the film at all, watched with my 19, 10 and year old  who both felt the same. The 10 year old waled out in protest."}, {"rating": "1", "text": "One of the worst films ive watched in recent times, almost as bad as Artemis Fowl (which if you haven't seen it for the love of god, don't watch it).The film is a mismatch of Mr Magoriums Wonder Emporium and The Greatest Showman (two brilliant films) but fails on both fronts. There is no real character development, you don't care for any of the characters or what happens to them and the changes in mood from depressed and hopless to cheerful and full of joy are swift and without any real reason leaving you with no interest in how things pan out. I won't ruin the end but i will say it makes no sense and raises so many question about the decisions that had been made and how nobody had noticed.The songs are so far out of sync with the actors singing them its laughable and they've chosen powerful show style songs sung with emotion and told the actors to walk along and mouth the words with a straight face. It just doesnt add up and the acting is almost as bad from the majority of the cast even some well known actors that are usually much better. (The songs are sung and produced well, just poorly executed on screen, the story is neither good nor executed well)We really wanted to enjoy this film, we all love christmas films and were hoping this would be a new addition to the usual films. But unfortunately it is a let down from the very start and doesn't get any better throughout, my wife left after the first 40 minutes and went to bed it was that bad.I watched this with my 10 and 13 year old girls and both of them were very disappointed, it may be ok for very young children with all the songs and flashy colours but other than that it hasn't got a lot going for it nor will it be watched again."}, {"rating": "10", "text": "I  loved it, gave me THE WIZ vibes and not your usual corny Christmas movie!!"}, {"rating": "1", "text": "It had a lot of potential but became a nonsensical mess that is unbearable to watch unless you are high or under the age of 5. This is musical and not a Christmas movie, the storyline and plot was all over the place but had all the ingredients to be good."}, {"rating": "10", "text": "Very good production quality. Fresh and innovative storytelling in a comfortable and traditional holiday setting. Design, Wardrobe, And styling is top notch with an awesome chorus and ensemble. A holiday classic perfect for the stage or cinema. And great casting. Keegan Michael Kay, Forest Whitaker and more"}, {"rating": "1", "text": "I gave this a 1 because it had a good hook and colorful set design. Don't feel it is the fault of the cast as some are my favs. But, in the year of BLM, I felt the director pandered to the social current, and that trying to create a statement on race outweighed storytelling and flow. Many professional critics who rated this could not stop gushing about its diversity and racial statement. It almost seems like there is a fear of being branded a 'racist if you are too critical of it. As a person of color, when my 8 and 6 year old kids beg me to change the channel, the overweighted positive reviews seem to echo social justice and racial correctness. Please keep political correctness out of Christmas entertainment. Such an amazing cast and set deserved better than the equivalent of kneeling during the national anthem. Like everything lately, some are willing to suspend logic and critical thought, or truth, in lieu of social justice."}, {"rating": "10", "text": "This movie was so touching! The aesthetics were delightful with its steam punk inspired Christmas. The story line was well thought out."}, {"rating": "3", "text": "Positives:- Lovely animation- Clear care in the design- Great singing and choreo- A beautiful line or two about imaginationNegatives:- Flat characters who don't change- Questionable performances- A rushed ending and an odd demise for the antagonist- Sync issues during songs- Confusing plot elementsOverall not for me."}, {"rating": "10", "text": "A modern Christmas classic!!! From the cinematography to the music, this film is brilliant. I can't understand the bad reviews. It's such a joyous, empowering, feel-good film with a great message and some genuinely powerful and memorable moments. Really hope they make a sequel!"}], "recommendations": ["over_the_moon", "trolls", "the_greatest_showman", "yesterday", "cruella", "sing_2", "into_the_woods", "klaus", "in_the_heights", "cats", "strange_magic", "vivo", "rio", "mamma_mia_here_we_go_again", "the_sound_of_music", "trolls_world_tour", "rio_2", "spirit_stallion_of_the_cimarron", "begin_again", "soul", "moulin_rouge", "the_book_of_life", "bohemian_rhapsody", "ferdinand", "peter_pan"]}