{
  "id": 2384,
  "title": "Jingle All the Way",
  "starring": [
    "Arnold Schwarzenegger",
    "Sinbad"
  ],
  "runtime": 89,
  "genre": [
    "Family",
    "Comedy",
    "Adventure"
  ],
  "description": "Howard Langston, a salesman for a mattress company, is constantly kept busy at his job, disappointing his son. After he misses his son's karate exposition, Howard vows to make it up to him by buying an action figure of his son's favorite television hero for Christmas. Unfortunately for Howard, it is Christmas Eve, and every store is sold out of Turbo Man. Now, Howard must travel all over town and compete with everybody else to find a Turbo Man action figure.",
  "releaseYear": "1996",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6QLkeLXPIxiihuX5enHHNEuCCzy.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 9.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Don't trust the do-gooders from 1996. Jingle all the way offers a fun movie set around Christmas time. While it might not offer the depth of roshamon, it is a fun movie for children with a smattering of slapstic and action sequences."
    },
    {
      "rating": "7",
      "text": "A good movie, but not great. Excellent watch if you don't know what to pick."
    },
    {
      "rating": "7",
      "text": "Jingle All the Way. It's turbo time! This is a great Christmas and family comedy, but it also gives lessons. Make promises and spend more time with your family."
    },
    {
      "rating": "8",
      "text": "Qwertyuioplkmjnhbgvfcdxsazaaknninnbuinnugyftutyyiihojjojopkojigyfrsrstfgigdrestfyiginhijhhkkhj"
    },
    {
      "rating": "8",
      "text": "●●●●●●●●●●●●●●●●●●☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°`````````````........."
    },
    {
      "rating": "1",
      "text": "Absolute junk, I only saw Jingle All the Way a few times and this role didn't suit Arnold Schwarzenegger. He was better in Twins and Kindergarten Cop."
    },
    {
      "rating": "3",
      "text": "Jingle all the way is embarrassingly bad. Two thirds of the movie is a fine 5/10, but that ending was just awful. All the performances in this movie are just weird. Like I prefer Jake Lloyd in Phantom Menace over his performance in this film. Everything is fine till, until that end. The ending has got to be one of the stupidest and most, what in the world, moments in film. I still don't understand what happened in that ending. Also Arnold Schwarzenegger punches a dear. So that was.... something? This movie gets a 3/10 and an F."
    },
    {
      "rating": "8",
      "text": "♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%"
    },
    {
      "rating": "6",
      "text": "Your typical Christmas classic. A father waits to long to buy the most popular kids action figure turbo man. He goes out on Christmas eve to try to buy it and to no one's surprise, it is sold out."
    },
    {
      "rating": "8",
      "text": "+++++++++++++×××÷×××××÷÷÷=++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "9",
      "text": "a hilarious movie for the family. I bet it will make you laugh your ass off. A ton of jokes, a charming performance Sinbad, and a great plot."
    }
  ],
  "recommendations": [
    "night_at_the_museum_secret_of_the_tomb",
    "elf",
    "diary_of_a_wimpy_kid_dog_days",
    "the_game_plan",
    "my_spy",
    "christmas_with_the_kranks",
    "the_christmas_chronicles",
    "deck_the_halls",
    "fred_claus",
    "night_at_the_museum",
    "night_at_the_museum_battle_of_the_smithsonian",
    "the_santa_clause_3_the_escape_clause",
    "the_croods_a_new_age",
    "american_pie_2",
    "the_pacifier",
    "sonic_the_hedgehog",
    "jumanji_welcome_to_the_jungle",
    "hannah_montana_the_movie",
    "just_go_with_it",
    "the_night_before",
    "bad_santa",
    "alvin_and_the_chipmunks_the_squeakquel",
    "tower_heist",
    "last_vegas",
    "second_act"
  ]
}