{"id": 120, "title": "Jiu Jitsu", "starring": ["Nicolas Cage", "Alain Moussi"], "runtime": 102, "genre": ["Action", "Science Fiction", "Fantasy"], "description": "Every six years, an ancient order of jiu-jitsu fighters joins forces to battle a vicious race of alien invaders. But when a celebrated war hero goes down in defeat, the fate of the planet and mankind hangs in the balance.", "releaseYear": "2020", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/eLT8Cu357VOwBVTitkmlDEg32Fs.jpg", "categories": {"plot": 4.285714285714286, "acting": 3.7777777777777777, "ending": 3.0, "soundtrack": 1.0, "cinematography": 2.5, "familyFriendly": 3.0, "funny": 3.6666666666666665, "action": 4.5}, "reviews": [{"rating": "7", "text": "The plot, character development and continuity issues may frustrate some people, but I like ambitious plots, and there's a certain comedy to extreme ambition executed poorly. this movie is a champion for this in a big way. Take elements from cheesy Japanese martial arts movies, first person action movies like hardcore Henry, throw in some great elements of popular films, thrown in without context, it almost feels like the writer was paying homage to unique, but unpopular attempts of reimagining the classic Bruce Lee action movie, but for some reason it works, and the production value is far higher than it has any right to be. it's like the pug, so ugly it's cute, Watch it with an open mind, and no expectations and you'll probably enjoy it, just don't expect to take it seriously, the writers, actors and director didn't, and I doubt they expected you to either, far less frustrating than movies like pacific rim that have the same problems but don't know it"}, {"rating": "1", "text": "It's a stinker guys. It really fails at everything it's trying to due. crab mans in it and that's funny"}, {"rating": "1", "text": "The directing is amateur, the script is nonsense, the fighting and shooting scenes are lame and monotone.Overall experience resembles Uwe Boll."}, {"rating": "10", "text": "Great movie.Don't get me wrong it is never going to win an academy award. But if you want to have fun,  this movie is full of it. Great action scenes. Great photography and acting..No media agenda (orange man bad/good BS).A great movie to entertain yourself."}, {"rating": "10", "text": "nice movieall the action movesplease support movie makers despite of pandemic"}, {"rating": "10", "text": "nice movieidol tony jaabest martial arts actorwatch it this is a good movie"}, {"rating": "3", "text": "This is a strange mash up of martial arts and space invader. A crew of expert fighters takes on an almost invincible creature that plagues Earth every 6 years when a comet passes overhead. Cage plays the wizened father figure who dispenses wisdom and occasional humor. Other than that, it’s almost non-stop battles, which could be fun if they weren’t so bland in execution and originality. Anyone who can identify any of the stars other than Cage will probably enjoy seeing this lineup of luminaries whacking away."}, {"rating": "2", "text": "This was a  bad movie. There was no story, no plot, no character development. Just a confusing mess of interactions and a lot of violence. Nicolas Cage has stooped to his lowest in getting involved in this film. It it had not been for him I wouldn't have bothered. It's just really bad."}, {"rating": "3", "text": "I wanna think that Nicolas Cage has some fun in these terrible roles, beyond the money he charges, and that he's no longer interested in the quality of the projects in which he puts his name."}, {"rating": "3", "text": "I think this movie's biggest flaw was the incredible lack of plot! There was just nothing to it but one random battle scene after another, with a whole lot of NOTHINGNESS in between! I felt like I was in a video game, except I didn't have the controller in my hand to control my man. It was a very strange paradox, I can assure you."}, {"rating": "3", "text": "Jiu Jitsu stars martial arts skills in the lead role with Alain Moussi, Nicolas Cage, and other familiar faces, which all together form an ancient order of jiu-jitsu fighters who, every six years, battle a vicious race of alien invaders in order to save mankind. The movie itself sounds a bit ridiculous in terms of its plot, and I can assure you that it lives up to the description above. I'll give it to you straight with this review because if you're looking for an exceptional film with fantastic dialogue, interesting characters, top-notch acting, or intriguing themes, then this probably isn't the movie for you. However, there are some positives with the film that could have an appeal to many viewers around. Jiu Jitsu feels like one constant fight scene as it rarely takes a break from the skillful martial arts battles between the characters to lay the groundwork for something bigger. Therefore, if a martial arts action film is something that you like, then it may be worth a watch, since almost all the actors can seriously kick butt. The showcasing of the actors' skill in fighting is amplified by its cinematography, which features long takes of the fight choreography. In addition to the above, the film features some aggressive camerawork which keeps pace with the flow of the action, although it sometimes feel too over the top.In terms of acting, the cast didn't have much in terms of script to work from, but the non-lead roles tried to make the best of it with some small scenes where they can display some emotion, or provide fun comedic relief. In terms of the lead role, Jake (Alain Moussi), there never really feels like a moment where you connect with the character since it was written very one-dimensionally. The main character ends up coming off as a clueless actor standing on center stage, whose only job is to fight while everything happens around him.Jiu Jitsu is not very unique as it borrows heavily from past movies and seems to take a Jason Bourne-like approach to a Predator inspired plot. Although this may offer some intrigue, it was never executed with the level of tact that those films did.Overall, Jiu Jitsu is engaging enough to watch if you are solely focused on the action, but don't expect much more than that."}, {"rating": "2", "text": "Characters are written to be inept and sloppy, making hard to root for them.Would definitely say Tony jaa, nic cage and frank Grillo wasted here. Some of the camera work is good and some is bad(experimental choice perhaps) The plot is average at best and the alien design is not bad. Took me 3 days in 3 section to watch this. Had to give points to some and least bit of the good stunt work. But an excruciating watch nonetheless. Nic cage is almosta glorified cameo in this movie."}, {"rating": "3", "text": "Not sure how you can mess up an action/martial arts movie with a cast like this, but unfortunately Tony Jaa, Frank Grillo and Nicholas Cage are co-stars to a lead with great martial arts skills but, IMHO, no charisma, personality or acting skills to speak of. Throw in a nonsensical plot, amateur directing, poor special effects  and middle of the road action scenes and you get a very forgettable movie."}, {"rating": "4", "text": "Jiu Jitsu had a good potential to become a decent movie but its script and terrible dialogues ruined everything. Good cast, good fights, good operators work, good locations but... Cyborg-Alien? Jiu-Jitsu?"}, {"rating": "0", "text": "i haven't been so disappointed in a long long long long long long long time"}, {"rating": "0", "text": "this movie sucks, that is why it will never be successful ever in life at all."}, {"rating": "1", "text": "I don't know why the whole movie is a soundtrack. The music is so loud throughout the movie it just distracts the fight scenes and action. It was really annoying to watch, I couldn't finish."}, {"rating": "10", "text": "a all aroud graet mouvie. a graet time if you dont want to wory about complacated plot and just want pure dumb fun action."}, {"rating": "0", "text": "who liked this movie? WHO? and WHY? I just don’t get people these days smh."}, {"rating": "0", "text": "are you serious? a 4.2 user score on metacritic? just just just just just just just WHY????"}, {"rating": "0", "text": "weave this movie to the trash!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "1", "text": "What a disappointment. Nicolas Cage rocks up half way through the movie and it doesn't help. Just avoid this movie like the plague"}, {"rating": "10", "text": "filme gostoso,filme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostosofilme gostoso"}], "recommendations": ["haywire", "triple_frontier", "bloodshot", "the_one", "project_power", "the_three_musketeers", "wrath_of_man", "gemini_man", "kate", "mission_impossible_ii", "the_transporter_refueled", "hercules", "clash_of_the_titans", "gunpowder_milkshake", "fantastic_four", "the_equalizer_2", "the_equalizer", "safe", "desperado", "skyscraper", "sabotage", "pacific_rim_uprising", "miami_vice", "extraction", "xxx_return_of_xander_cage"]}