{"id": 4602, "title": "Jobs", "starring": ["Ashton Kutcher", "Josh Gad"], "runtime": 129, "genre": ["Drama", "History"], "description": "The story of Steve Jobs' ascension from college dropout into one of the most revered creative entrepreneurs of the 20th century.", "releaseYear": "2013", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/qkHr510BpWnibuIWnjycvvI29jL.jpg", "categories": {"plot": 5.791666666666667, "acting": 6.564102564102564, "ending": 5.5, "soundtrack": 6.5, "cinematography": 5.0, "familyFriendly": 5.6, "funny": 5.0, "action": 3.0}, "reviews": [{"rating": "5", "text": "The decade the film skips  when an ousted Jobs created his software company NeXT, which he eventually sold to Apple  seems like a lost chapter that could have illuminated it subject. How does such a driven man survive after being driven out? Instead, the film picks up in 1996, when Jobs inexplicably has a new wife and young son; his now college-age daughter snoozing on the living-room couch. He's lured back to Apple and transforms it into the most profitable company in the world. (That's not a spoiler, it's history  you can check it on your iPhone.) And that's the problem with \"Jobs.\" While it's interesting to see the history of Apple and how Jobs' singular determination was crucial to its success, the history of a company isn't as compelling as the history of a person, especially one as complex, innovative and influential as Steve Jobs."}, {"rating": "5", "text": "From all accounts, Steve Jobs was a brilliant innovator, but also a demanding, inconsiderate  This biopic starts with his free-spirit college days, spends lots of time creating the first computer in his parents' garage, then traces his rise and fall and rise at Apple. Ashton Kutcher, who is an on-screen charmer, is out of his league in this role, unable to plumb the characters' complexities. Even though the screenplay tries to show Jobs' good and bad sides, it's just a flat, yet absorbing history lacking in emotion, drama or excitement."}, {"rating": "0", "text": "Boring movie, complete waste of my time. I wish there was more to it not just a history lesson that pretty much anyone knows or can read up on. Save your money and go see something else."}, {"rating": "5", "text": "The movie is quite entertaining and not bad overall but where it fails miserably is the decision to cast Aston Kutcher. Every moment that is suppose to be taken seriously, having feeling, or make a point comes across as cheesy. \"Jobs\" is certainly no \"Social Network\"."}, {"rating": "5", "text": "It ain't no \"Social Network\", it's a movie that lingers in some aspects. For starters I'll say that the acting is pretty good, especially Ashton Kutcher. I don't know how he did it, but he off Steve Jobs pretty good. But the big problem with this movie is that source material used is a bit of a mess. They exaggerate some factual source material, yet at the same time they don't show enough of other source material. Overall, it's a heart-less version of \"The Social Network\".  Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies."}, {"rating": "6", "text": "\"How does somebody know what they want if they haven't even seen it.\" This one sentence really explained to me why Apple was created. JOBS, is the biography/film recreation of Steve Jobs' (Ashton Kutcher) life. Being founder of Apple, we follow him and Steve Wozniak (Josh Gad), as they create the company and watch it flourish. The film starts in 2001 (picture two) as Steve introduces the first iPod, and then it jumps back to mid 70's when the company first started. Starting the company in his parent’s garage with the other Steve, we follow him through his hard work in Apple. We could tell that Steve really was a jerk after starting his company, but we also saw how he cared about his good friends and about the association.\r The movie really gave me an understanding on how his life changed the world. I learned that words did not affect Steve; he never gave up with hundreds of people hanging up on his phone pitches, and in live demos. The film JOBS really showed how great of an actor Kutcher is. Throughout the film, I was convinced that he was Steve Jobs. He had got everything right even down to the walk Steve actually carried.\r Being an Apple fan, I really enjoyed JOBS. I think that any viewer would enjoy the film, but I feel like the movie will only attract people who care about the history of Apple. It's more of a selective audience for this film, because there is no point in seeing it if you are not an Apple fanatic. I think Josh Gad also did a great job as Wozniak, and I still think he and Jonah Hill have the same voice.\r Even in the 130 minutes the film ran, JOBS did not cover the last decade of his life when Apple really took off. Sequel, maybe? I wasn't sure if Open Road Films (which I've never heard of) had to pull the plug on the ending. After thinking about the film, my only idea is that they did not need to continue the film because we can just pull out the device in our pockets. They did not need to cover the next decade, because we already know what happens. The company expands so greatly that Steve gets his wish of changing the world with over 25% of American adults, owning iPhones.\r I felt the film started to drag on, even though some scenes were rushed. For example, Steve's wife and children came into the picture at a time that didn't seem appropriate. Overall, I think Jobs really defines Steve’s life, and the start, and growth of the company everyone knows about. If you own an iDevice, or want to learn more about Steve; JOBS is the movie for you."}, {"rating": "4", "text": "Joshua Michael Stern's \"Jobs\" is like an assembly line for the best moments in the career of Steve Jobs, but seriously lacking in depth, and without much significance. It is a truly unremarkable biopic of the \"master of innovation\" as you could possibly imagine. \"Jobs\" follows an overly safe, unimaginative course that clocks in at a tiresome 122 minutes. The storytelling is painfully straightforward, covering only the principal events of his professional trials and tribulations, and providing little else beyond what is already public knowledge.\r Developing his imagination for computer programming at Atari, Steve Jobs (Ashton Kutcher) brings in his friend Steve Wozniak (Josh Gad) to help with the hardware aspect, forming a partnership that would soon lead to the founding and development of Apple Computers, a force within the industry throughout the 1980s. Steve is not prepared for the financial demands and the ruthless business mentality, and is eventually forced out of the company he began, only to return in the 1990s with a fresh game plan on how to bring Apple back into the public consciousness, and to dominate the industry once again.\r \"Jobs\" is a biopic with a very narrow focus, and without any sense of risk or adventure. It is so intent on covering Jobs' entire corporate career, that it simply reduces his personal life to a footnote. Stern completely glosses over Jobs' personal life, which is essential to any self-respecting biopic.  The entire production feels rushed and slapped together simply to benefit from being the first one out of the gate.\r To his credit, Kutcher puts forth a good effort, and he undeniably looks the part of Steve Jobs. Unfortunately, Ashton always looks like he is trying too hard to play the part, and never fully becomes the character he's portraying. His limitations on the big screen prove to be a major liability. He has developed a screen persona as likeable character, which has served him well with numerous TV sitcoms. Not so much with movies.\r What emerges is a movie that has \"a made for TV\" feel, which depicts a self-absorbed creep who stabs everyone in the back to simply to get his way that goes on for two plus hours. A thoroughly unsatisfying tribute, and we are still left none the wiser as to what made \"The Father of the Digital Revolution\" beyond what we already know."}, {"rating": "3", "text": "Jobs is a boring movie. It feels like the low budget, made-for-tv version of The Social Network. I'm angry that I wasted money on it, and I'm upset at how bad it turned out to be considering how good the trailer looked."}, {"rating": "1", "text": "Just another piece of Apple advertising, it was so biased toward Jobs and his life that it was completely cringe worthy to say the least, it give no depth, is often too over-the-top, and at times just downright inaccurate, the movie feels like it's juggling reality and Hollywood, also, Bill Gates never existed according to the writers."}, {"rating": "10", "text": "Ashton kutcher did an amazing performance. The movie itself could be better directed. Yet it is still inspiring and amazing. Kutcher by far did the best performance of his career and showed that he has a great potential."}, {"rating": "8", "text": "Great movie but once again another rushed ending. Kutcher did a very great job and this movie makes me sort of want to buy a mac or and iphone(NOT) but in all great movie you wont be disappointed."}, {"rating": "7", "text": "Pure entertainment. Critics have ruined it for me. The ending was good, although it could be much better if it  was with Jobs as an old man. I saw some directing mistakes, but Ashton Kutcher did an AMAZING performance!!!!! Excellent to him. A huge well done to the movie. Do not listen to the critics, and watch it!"}, {"rating": "6", "text": "jOBS Review\r Originally posted at: http://www.yeahyeahcool.com/2013/08/18/jobs-review/\r by Carla Valdes @karluccia\r In 2011 the world lost one of the most important visionaries of our era. Two years later, from director Joshua Michael Stern, we have Jobs; a bio-pic that should have looked back on the extraordinary life and career of Steve Jobs, but rather focuses more on the boardroom drama of Apple Computers.\r Ashton Kutcher does a fair acting attempt with a respectful performance, even taking on Jobs’ distinctive mannerisms and walking stride.  Comic relief is provided in the way of Josh Gad, who portrays Apple co-founder Steve Wozniak. The rest of the cast does its fair share at responding to Kutcher’s rants, looking wide eyed and fearful when needed.\r I feel the problem with Jobs comes from the script, which focuses on Jobs being a neurotic, unlikeable, vindictive, angry genius and bad father, who suffers from occasional screaming fits, usually done while speeding his sports car through the rain.\r Much of Steve Jobs’ personal life is randomly mentioned in the film, one moment being the emotional impact his adoption had on him which is touched upon during an LSD trip. Omitted completely is the important work Jobs held with Pixar, his development of the iPhone, his emotional search of his biological parents, how he met and married his wife, and most important his history with Bill Gates, the latter being reduced to a heated one sided phone call with Jobs screaming at the top of his lungs.\r Maybe Steve Jobs wasn’t the nicest person when he was alive, but surely he deserved more than this depressing, uninspired and disappointing film.\r D+"}, {"rating": "5", "text": "Ashton Kutcher may have the talent to play Steve Jobs, but the rest of the movie cuts out a few very important details of his life, while being monotonous in the process. But it is worth watching."}, {"rating": "9", "text": "JOBS really surprised me with how accurate it is. Scenes unfolded just like I imagined them after I read some books about Steve Jobs' life.\r Pros:\r-Very detailed and accurate.\r-Entertaining ride.\r-Ashton really surprised me. I was never a fan of him, but he did a superb job.\r-Supporting actors were tremendous.\r-Very educational for the whole family to see.\r Cons:\r-I wish the movie had continued into the 2000s.\r-I wanted to see more of Jobs' home life away from Apple."}, {"rating": "10", "text": "I really don't see what the negative criticism surrounding this movie is all about; it was pretty good. Whether or not the movie is accurate in portraying Steve Jobs, I don't know. Did it gloss over some important things in Steve's life? Maybe. But I do know is that this is  a compelling drama film and Ashton Kutcher's performance was good. Liked seeing Steve Job's humble beginnings. I don't think the film is biased or \"just another piece of Apple advertising\"; on the contrary, it shows the positive and negative aspects of Steve's personality and life. I wish the film had covered more of his life, particularly leading up to his death.\r Too bad Steve sometimes seems kinda like a douchebag and an insane perfectionist. (He even refuses to support for or provide for his own daughter!)\r If you liked this review, read my other ones on a wide variety of movies and TV shows and mark this review as helpful."}, {"rating": "0", "text": "Ashton Kutcher is probably the worst thing in this movie, the only good thing he has in this film is the similar look he shares with Steve Jobs..but that's it"}, {"rating": "5", "text": "Jobs tells the story of Steve Jobs but that’s it. As a film that serves to show Steve Jobs (Ashton Kutcher) going from guy in garage building personal computers to guy in charge of Apple it works. I’m not quite familiar with the life of Steve Jobs but the story seemed to flow alright. Making a bio-pic may not have been the best course of action for the film as its story is stretched out. Rather than focus on a specific point in Jobs life (ex. working in his garage) the film shows a broad approach. On one end, this helps to show how far Jobs has come in certain areas going from nothing to a big celebrity but at the same time it means that none of these moments can be fleshed out a lot. The film is constantly jumping around causing jobs arc from jerk to megajerk to nice guy doesn’t get fleshed out properly. The film feels long and empty because it covers so much yet there is no substance or heart to allow me to connect to Jobs’ struggle. The film fails to flesh out Jobs as a character and at times it just feels like a cheap rip-off of The Social Network where a smart genius is a jerk pushing away people while climbing the ladder of success.  It feels like an Oscar wannabe at times with all the key moments guy struggling and lots of shouting clips that I’m guessing the filmmakers thought could be used when Ashton Kutcher got the nomination he never received. It’s a shame too considering how the filmmakers got a lot of actors that look like their real-life counter-parts, J.K. Simmons, and a relaxing guitar score; that isn’t enough to cut though the film needs substance and heart and this film lacks it. Hopefully the new Steve Jobs film with Micahel Fassbender will tell a more in-depth, substancial, and better take on the story."}, {"rating": "2", "text": "Watch THE PIRATES OF SILICON VALLEY if you want a real, less romantic look at Mr Jobs.  That movie was far superior and more interesting, this was 2 hours of fanboy glory.  zzzz"}, {"rating": "6", "text": "i expected more from this film, specially since it runs over 2 hours..\ri expected to see more about the product creation, i expected at least a mention of pixar and for last i expected  the timeline to reach at least the first iphone..\rI however did like that they didnt try to pass steve as a good doo'er and got to show hes  side.\rThat being sad, i did not disliked the movie, liked it about as much as one could like a movie about a genius  if i would have to choose between this and the social network, i'ld go with facebook thos, just a better script and better acting."}, {"rating": "3", "text": "Ok so Jobs wasn't the disaster I expected but it certainly wasn't good either. It really didn't teach you much about \"Who is Steve Jobs?\" it was almost like it was in fast forward, it just showed a few events that occurred yet somehow it was dragged to over 2 hours. Ashton Kutcher was possibly the worst possible choice to play Steve Jobs, only thing he did well was Steve's walk which really isn't a big deal at all. It's not all his fault as to why this film was bad, the other reason is Joshua Michael Stern who has next to nothing under his belt director or writer wise. This movie was written horribly and Ashton Kutcher like I said before was the worst choice. Ben Affleck would've been a great choice in my opinion but I know Ben certainly wouldn't agree to be a part of this awful script. 3/10 although 2 is probably more deserving but I'll give it a charity point. Not a complete disaster (I've seen worse) but still pretty darn bad. Don't waste your time and definitely don't waste your hard earned cash."}, {"rating": "5", "text": "Jobs is a monotonous and very biographic film. During two hours all what we see is the life of Steve Jobs, just as it was. He started working in the garage of his house with some friends fixing computers and ended founding his own company, from which he was fired and the rehired; to finally become a living celebrity. The problem of the movie is that it waste a story with so great potential, I mean the director could evaluate the reaction of the protagonist during the time without job, or when he lose all his friends, and even when he was successful. Although there are some things that are really good, for example how it manage to capture the legend that Jobs represent, also is the unbelievable acting of Ashton Kutcher, and the way it is use the camera; because at the beginning of the film we see the moment when the IPod was presented and Steve was at the summit of his career, the camera record from below, giving the character an unreachable figure. Just after that its shown when he was stuck starting the university, the camera is placed above, meaning that he is a person of no importance. The problem is that the movie is nothing more than a history class."}, {"rating": "4", "text": "Jobs is a boring straightforward biopic that shows Steve Jobs at his highs and lows without any insight into anything. While these are real people, the characters themselves are underdeveloped. The script is lousy and cliché, and the director seemed to be making a TV movie at best."}, {"rating": "3", "text": "I'm a big fan of Steve Jobs because he was and he's my idol but this movie is not a good biographic movie! That's only a large target audience movie who don't answer to the real fans wait."}, {"rating": "8", "text": "Not knowing anything about its subject I approached Jobs with minimal interest and found it to be a surprisingly compelling, if rather conventionally told, biopic about the recently deceased techno wiz. Based on its own merits Ashton Kutcher's performance is probably the best of an otherwise undistinguished career. However, at times and partly due to the screenplay, he is over emphatic in portraying Jobs as both unscrupulous and unlikeable, which he very possibly was. Under rated by the critics and despite a shaky start, the film does settle down to become very entertaining."}, {"rating": "7", "text": "This movie is nothing like The Social Network. I'm not saying that as a bad point or as a good point. I'm just starting my review with a common mistake. The Social Network was about two friends and how a big corporation ruined their friendship. Jobs is about the big corporation, not the people involved with it.  Ashton Kutcher was a decent actor in this movie. When it was announced that he was going to be play Steve Jobs, everybody lost their  But he's actually alright, nothing special, but not a bad performance. Pretty much everyone is nothing special. Ashton Kutcher is the only actor who I can name off the top of my head, who was in Jobs. Besides JK Simmons who has such a memorable face that I will always recognise him. You may think that the story of the movie was already prepared, but the writers had to pick some events in Steve Job's life which were interesting. They did not do it too well. I would have preferred to have seen more about the later life of Steve Jobs, than him sitting in an office shouting at people. The writers obviously noticed how good Ashton Kutcher looked as old Steve Jobs and decided to give him as little screen time as possible. Also it was not made clear what year's things were taking place in. I'm not an expert on Steve Jobs so I have no idea what year he was born in (probably in the 50's), after watching the movie about his company. I still don't know. One of the things I did like was the soundtrack. There was some of The Beatles some of The Rolling Stones (I think) and it really gave the movie a vintage feel. I'm guessing that's when a lot of it took place because I had no idea what year it was most of the time. To be honest Jobs did not teach me much about Steve Jobs at all. I can't remember what college he went to (even though it's in the second scene). I can't remember the name of his wife. Or whether she was even his wife?\r As an autobiographical movie Jobs is not good and focuses more on which people he shouted at than what products he made. But watching people getting shouted at is funny. As a movie overall Jobs is good and for the most part enjoyable."}, {"rating": "8", "text": "The turtleneck definitely steals the show. Its accuracy is impecable, from its length to its color. This turtleneck is spot on. My only complain is that there are scenes with no turtleneck, like when Steve wakes up in the morning. Seems like a missed opportunity."}, {"rating": "5", "text": "Jobs is an inspiring movie about working hard and dedication. Jobs accurately represents Steve Jobs as he was. This movie is slow at first but once it picks up, it never falls. It's so interesting to see how Steve Jobs and the rest of Apple can go from working in a garage, to becoming the worlds most valuable company.\rAshton Kutcher shows a different side of his acting talents, Kutcher plays Jobs so well, while looking much like him. Althoguht the movie leaves out some really interesting patches of Steve Jobs' life. Like his work with Disney, and Pixar. But bottom line, regardless of all of that other stuff. There was a lot and i mean a lot, of things wrong, false, and incorrect about the movie. I think this film was too rushed and could have been dont a lot better. If the film wasn't so rushed Steve Wozniak could have maybe been on set to help out."}, {"rating": "3", "text": "All I learned from this interpretation was that Steve Jobs as absolutely brilliant but hated shoes and could really be a huge jerk  If you aren't interested in computers then this movie is very dry and lacks entertainment. All I could think about while watching the movie was that I forgot my iPod at my parents house It really did nothing for me. I can see a demographic of people really enjoying this movie, I certainly wasn't one of them."}, {"rating": "6", "text": "La historia esta bien relatada JObs es una pelicula de esas que,son difíciles de calificar gracias a que tienes sus bajas y sus altas además de ser una películas que trae varia polémica en la critica"}, {"rating": "8", "text": "Jobs is a stunning movie that really presents the characters excellent, and it got a hell of a story! The first thing I got impressed in this movie is Ashton Kutcher, Josh Gad and Giles Matthey´s performance, they're playing their roles so good, not just by their appearance, but also the way they talks & how they express themselves, especially Ashton Kutcher, because he was born to play Steve Jobs!\r The movie has a wonderful beginning and just felt beautiful at some places, kind of dramatic actually, and it was really inspiring! From my point of view is Jobs a very well made biography film that really shows us how well and sad our lives can be, in this case, Steve Jobs´s life. I would give this film a nine of a ten if it could have a more creative ending, because the feeling the movie gave thought the film just disappeared in the end, so they could have done that better, and maybe to show us a little more what happened later in the 2000s inside Apple. The film itself is spectacular, but there is some scenes that that could have been better, because it was a little lengthy & boring at some places, but overall this movie did a hell of a job at everything and I really recommend this movie for everyone, especially technology & Apple-fans!\rJobs gets a 8/10"}, {"rating": "5", "text": "\"Jobs\" was ambitious but it never really felt like a big budget biopic about Steve Jobs and, ultimately, felt like a made-for-TV story about the Apple guru.  I wasn't sold on Kutcher's performance and only saw him as Ashton the entire movie and not Steve.  Additionally, I felt they handled Jobs' growth as a person poorly as the movie jumped from point to point and any character development needed for the next scene was just conveniently there when the story arrived.  However, I really enjoyed Josh Gad as Wozniak, the soundtrack was great and I admire that they didn't sugarcoat the reality that Jobs had a reputation of being kind of a big meanie-head.  In the end, \"Jobs\" was a passable biopic about the man who created a company where people will wait in line for days to get a phone that is really no different from the previous one they waited in line for."}, {"rating": "6", "text": "Jobs isn't the best biopic on Steve Job's life, but it isn't a dismal attempt. It lacks good narrative in the beginning, but by the middle parts you might even start to like it a little. Ashton Kutcher has his moments of great acting, but they are mostly overshadowed by his lack of emotional depth in the character."}, {"rating": "1", "text": "Shallow movie. Ashton was ok, but not more. I missed aspects of his personal life, and of course about his illness and dead. The movie goes around his caracter and the imperium he create, but nothing new. All aspects well known about everybody. I was expectiting rhe wonderfoul Standford speech, but never happen.\rIt could be a great movie, but it was more an acting docummentary."}, {"rating": "1", "text": "What a mess, I did not think it was possible to create such an uninteresting story of such a dynamic individual. I bet David Fincher and Aaron Sorkin would have created a gem.\r Save your money."}, {"rating": "8", "text": "I really don't see what the negative criticism surrounding this movie is all about; it was pretty good. Whether or not the movie is accurate in portraying Steve Jobs, I don't know. Did it gloss over some important things in Steve's life? Maybe. But I do know is that this is a compelling drama film and Ashton Kutcher's performance was good. Liked seeing Steve Job's humble beginnings. I don't think the film is biased or \"just another piece of Apple advertising\"; on the contrary, it shows the positive and negative aspects of Steve's personality and life. I wish the film had covered more of his life, particularly leading up to his death.\r Too bad Steve sometimes seems kinda like a douchebag and an insane perfectionist. (He even refuses to support for or provide for his own daughter!)\r If you liked this review, read my other ones on a wide variety of movies and TV shows and mark this review as helpful."}, {"rating": "7", "text": "It kind of drifts through the usual biopic doldrums and skims through elements of Steve Jobs's life that would have made for a more fully-rounded story, but for the most part, I found \"Jobs\" to be engaging, interesting and was pleasantly surprised by a great performance by Ashton Kutcher. It's a refreshing change from his usual roles and he does incredibly well in the role. It could have done with a bit less gloss and bit more substance - that's where it misses the mark most and that's not Ashton Kutcher's fault (I'm disappointed by how unfairly trashed he's been for this movie) - but it piqued my interest in its subject matter: a computer tycoon. And I hate computers."}, {"rating": "6", "text": "Jobs isn't a bad biopic on Steve Jobs, especially considering we got another biopic on him a few years later. This one is far from dismal and Ashton Kutcher definitely surprised me here. Delivering easily the best performance of his career, its just sad that the direction and screenplay fail to do the same"}, {"rating": "9", "text": "Excellent movie! With Ashton Kutcher at his best, was so convincible as Steve Jobs that made me believe they revived the executive and put him on the screen."}, {"rating": "8", "text": "Kutcher was the best Jobs.  Interesting, fast-moving, well-directed and acted.  Should've been 3 hours long.  One thing I do like about the other Steve Jobs movie was the incredible meanness was palpable, although I didn't enjoy Fassbender's delivery.  Sorkin's version is more like an edgy music video--it tries to be great but in the end, the script is a pop-culture rendition with tons of emotions shoved into each scene."}, {"rating": "4", "text": "The film does tackle very important points about Steve Jobs and his life, but in the end it really all comes down to the casting, particularly Ashton Kutcher's role as Steve. Which was the big mistake of the film."}, {"rating": "5", "text": "An okay film but not what I wanted to see, in any simple way of putting it's disappointing, only hope Steve Jobs gets a better quality film about him and not just the products he made."}, {"rating": "3", "text": "When the beginning of the movie, it looks like the story line just have nice work. But go more and more, the movie just like  run out of control so haphazardly.\rLet me give the parable, there are the number \"1, 3, 5, 7, 9, 15, 74, 79, 99, 111, 131, 133, ...... and so on\".\rMovie well-run when 1-9, when go to 15 I still can tolerate it. But when go more (when the number as far as 74 and so on), it feels like, \"Oh God, help me. I wasted my time for this, Why with all this people? Why can't people just think?\""}, {"rating": "5", "text": "\"Jobs\" 10 Scale Rating: 5.5 (Decent) ...\r The Good: Kutcher is one of the few actors whose mere appearance in a film will cause it to lose points for me, but he was actually pretty good in this. In fact, the entire cast did a good job. Jobs is a fascinating person, so it wasn't hard to keep my interest.\r The Bad: Jobs has been described as difficult and downright anti-social at times, but \"Jobs\" makes him out to be a Grade A jackass. I don't think that was their intent, but when the lead is this unlikeable, it really takes away from a film. Other critics have already pointed this out, but the film also feels like a made-for-television movie."}, {"rating": "8", "text": "A great movie about the life of Steve Jobs. Where its problems like pacing and an uneven narrative problems are seen, the solid acting and nostalgia make up for it. 8/10 (Great)"}, {"rating": "8", "text": "The movie was great and Ashton Kutcher playing the main character call all the attention. He was really into it. The direction was also good, maybe a little slow but anything you can't enjoy."}, {"rating": "4", "text": "Jobs' too messy to have a movie like this. We got such a better Steve Jobs movie coming up a few years later in 2015. Like Hulk, we could be watching this seconds and seconds, minutes and minutes, hours and hours... even better.... years and years!"}, {"rating": "7", "text": "I watched the movie \"Jobs\" which was released in 2013, after watching the movie \"Steve Jobs\" that was filmed in 2015. Contrary to the general opinion, I can say that I love this movie more. I think that, rising of Steve Jobs from his college years and his relationship with people who played really important roles on his life such as Wozniak, Markkula, Sculley are told more clearly in this movie. Although I thought that Ashton Kutcher is a poor choice for the role, Ashton Kutcher proved me wrong with his performance and his resembling Steve Jobs was better than Fassbender's. The only problem in the movie was that Steve Jobs aged slowlier than people around him in the movie. I think they did not pay enough attention about that matter. I found this one more succesfull than the 2015 Steve Jobs movie in terms of integrity and biography."}, {"rating": "8", "text": "Jobs, as the name suggests, tells the story of the legendary Steve Jobs, without whom we would not have an Apple today and perhaps still use push-button phones today. Steve was played by Ashton Kutcher, who was cursed by a lot of people, but I think he did a brilliant job and played his part in number one. In the film, we watch how Steve Jobs got from a small garage to a huge company and created very important products that moved electronics a bit further. Overall, this is an excellent film, which I definitely recommend."}, {"rating": "10", "text": "Ashton Kutcher is an amazing actor. Love this movie. I don't understand why this movie is underrated. Great job(s)"}], "recommendations": ["steve_jobs", "good_will_hunting", "invictus", "the_upside", "gone_baby_gone", "21", "the_blind_side", "the_town", "snitch", "greenberg", "the_intern", "chef", "the_gambler", "going_in_style", "american_gangster", "public_enemies", "the_guardian", "the_king_of_staten_island", "the_accountant", "changeling", "pay_it_forward", "the_pursuit_of_happyness", "uncut_gems", "burnt", "donnie_brasco"]}