{"id": 4877, "title": "Joe Bell", "starring": ["Mark Wahlberg", "Reid Miller"], "runtime": 93, "genre": ["Drama", "Adventure"], "description": "The true story of a small town, working class father who embarks on a solo walk across the U.S. to crusade against bullying after his son is tormented in high school for being gay.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/9HfQD60w6f6PPkfdiI6ipJSw0bD.jpg", "categories": {"plot": 5.0, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 9.0}, "reviews": [{"rating": "4", "text": "Great movie. Don't listen to critics. Extremely moving and well executed. Great performances."}, {"rating": "9", "text": "Breaks my heart so many people would downvote or nitpick on this. Where the **** are your morals or heart or sanity? This kid committed suicide for being bullied for being gay and his dad took a trip to tell the world his story. Anyone who's lost a parent or child should especially to suicide should be able to relate. I hate what leftism has done to the world, but homophobia still exists despite all the gays you see on TV and as an elder gay who came out a long time before all of this in the 80s/90s fighting for gay rights and visibility, it astounds me how many people on the right just think homophobia went away like it was some fantasy. No, it's very real and one of the last few prejudices people are 'okay' with behind closed doors and even openly sometimes. Maybe you wouldn't know that from all the gays on television and in movies, but that doesn't mean a lot of people haven't just moved their prejudices from the front porch to inside the house. If you're a conservative or centrist and don't hate homosexuals, I'm not talking about you- but I've encountered a LOT of homophobia on these free speech platforms and I don't mean someone using the word gay or **** or whatever (It has never bothered me when people use slang esp when gaming or busting each other's balls) but TRUE homophobia where someone is just disgusted or hates you for actually being homosexual and open about it. I don't use the terms racism or homophobia casually unless I see actual evidence of it. Soapbox rant over."}, {"rating": "10", "text": "The best movie I have ever seen in my life"}, {"rating": "5", "text": "Larry McMurtry and Diana Ossana co-wrote the breakthrough gay film Brokeback Mountain, but this new effort (based on a true story) is not nearly as successful. Mark Wahlberg plays Bell, a father who treks across country to make a statement about bullying and the effect it had on his gay son. Not only does he deal with prejudice and homophobia, he also delves into his own flawed reactions. There’s a kernel of effective drama here, but the bland and sometimes seemingly aimless writing misses the mark. Speaking of Mark, a more accomplished actor might have made the this work, but Wahlberg simply doesn’t have the depth or skill to portray the character’s internal conflict. In contrast, Reid Miller’s portrayal of the son is multilayered and touching. Thirty years ago, this film might have had a powerful effect, but now it just seems overly preachy and lacking the punch the subject deserves."}, {"rating": "5", "text": "Full of good intentions, but the situation it presents needed a more focused approach. One that would've really confronted the viewer, and Joe Bell just fails in that regard.And most of all, it needed a better actor to be able to sell that message.Mark Wahlberg is consumed by the material, and is unable to deliver what it takes for his character to be seriously convincing.It could've been much better."}, {"rating": "6", "text": "(Mauro Lanari)A new nosographic category has been added in the DSM-5: \"persistent complex bereavement disorder\" (PCBD), formerly known as \"prolonged grief disorder\" (PGD). Experienced by about 10% of people who survive the death of a loved one, this is the very painful universality of the movie, regardless of homophobia, bullying and social inclusivism."}], "recommendations": ["the_hate_u_give", "the_miseducation_of_cameron_post", "sweat", "war_room", "machine_gun_preacher", "just_mercy", "munich", "disobedience", "the_hunt", "courageous", "the_shack", "crash", "silence", "the_case_for_christ", "freedom_writers", "ingrid_goes_west", "overcomer", "the_mauritanian", "the_reader", "i_still_believe", "detroit", "leave_no_trace", "the_pursuit_of_happyness", "a_time_to_kill", "nine_days"]}