{
  "id": 3768,
  "title": "Johnny English",
  "starring": [
    "Rowan Atkinson",
    "Natalie Imbruglia"
  ],
  "runtime": 88,
  "genre": [
    "Adventure",
    "Action",
    "Comedy"
  ],
  "description": "A lowly pencil pusher working for MI7, Johnny English is suddenly promoted to super spy after Agent One is assassinated and every other agent is blown up at his funeral. When a billionaire entrepreneur sponsors the exhibition of the Crown Jewels—and the valuable gems disappear on the opening night and on English's watch—the newly-designated agent must jump into action to find the thief and recover the missing gems.",
  "releaseYear": "2003",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lx3Y7teA6DaoQ6cIhwzrlnDZpFW.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 6.5,
    "ending": 5.0,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 5.0,
    "funny": 7.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Great movie if you just want an easy laugh and you like Rowan Atkinson. I dont know what the people who gave zeros in their reviews were expecting but you shouldnt expect a Oscar winning movie in the first place.I really encourage you to watch this movie!"
    },
    {
      "rating": "10",
      "text": "Personally one of the most hilarious movies I've ever seen. Watched it countless times and the jokes never fail to make me laugh. A MUST SEE for all Rowan Atkinson and British Comedy fans."
    },
    {
      "rating": "10",
      "text": "Soooo funny! Rowan Atkinson is the best !"
    },
    {
      "rating": "7",
      "text": "Although it is almost unforgivably goofy, there are still enough laughs within \"Johnny English\" to garner a couple more viewings."
    },
    {
      "rating": "10",
      "text": "The way the movie is crafted, is by MR. Bean letting things happen, the dumb way though. Witch makes it funny and gives the movie its own perspective."
    },
    {
      "rating": "6",
      "text": "Good for a few laughs and pleasantly almost smut free, but if you want to see Rowan Atkinson at his best, get the Blackadder disks!"
    },
    {
      "rating": "8",
      "text": "Better than I thought it was going to be, it's funny and manages to be a great parody of spy movies, granted you can see some bigger Johnny English's screw ups coming they still turn out funny do to good acting, not sure I would show this to younger audiences, but maybe kids about 13 and up, still if you like goofy spy parody movies then this is for you."
    },
    {
      "rating": "9",
      "text": "Johnny English is positively one of the most funny films I have ever watched. As soon as I saw the tag line on the DVD box I new it would be good, also, who better to play the bad guy than John Malkovich. Honestly, I can't wait to see the sequel."
    },
    {
      "rating": "5",
      "text": "Atkinson is great and there are some quite funny bits but ultimately the humour is too inconsistent."
    },
    {
      "rating": "9",
      "text": "I only need to say this simply... Johnny English is a hilarious and fun-filled movie that is full to the brim with silly gags and crazy action. It's the most funny film I've ever seen, and I'll never forget the first time I watched it, I just couldn't stop laughing. It may be a little technically flawed, but the pure hilarity makes up for that.\rAs comedy films go, I'd say this is the best out there, as it does what it intends to brilliantly  make people laugh (or make me laugh). So I give this film a... 90/100!"
    },
    {
      "rating": "4",
      "text": "Occasionally, we have some cool and funny scenes but the majority of the film is pretty    dull."
    },
    {
      "rating": "4",
      "text": "Perfect for young children, but just plain stupid for anyone older."
    },
    {
      "rating": "5",
      "text": "Some comedies are very underrated due to the fact they are stupid and nonsensical. Johnny English is a solid comedy movie thanks to Rowan Atkinson's performance, but the movie itself is too predictable and too dumb that doesn't provide enough laughs to convince the audience."
    },
    {
      "rating": "5",
      "text": "WHAT I LIKED: An amusing take on spy spoofs, 'Johnny English' is a lot of fun. This is mainly thanks to Rowan Atkinson who takes his every role onto the next level\rWHAT I DIDN'T LIKE: It suffers from an over-abundance of silliness that makes it so unbelieveable you occassionaly struggle to laugh (for example, the entire ending sequence) You have no care for the mission or the character as it lacks overall conviction\rVERDICT: A funny but mostly ridiculous spy spoof."
    },
    {
      "rating": "7",
      "text": "There are always going to be movies of a particular sort where critics just don't do justice to the value of what the movie bring to the table.Johnny English is simply that sort of a movie. There are two simple reasons to watch this movie despite any hindrances you may face:1) Rowan Atkinson - The man can make anything sound and seem funny, especially when he has to (try to) be serious. And supported by the character foil that is Bob, it is hilarious riot throughout.2) John Malkovich - His french accent in portraying Pascal Sauvage is a hearkening to the the characters that bring the wacky narcissistic psycho-babble that is Malkovich Malkovich.Plus Lorna Campbell is an almost Bond babe, if Bond were to be arrogant pompous British failure whose stature is far too overstated... well, there you go."
    },
    {
      "rating": "7",
      "text": "A genuinely entertaining movie from start to end. Rowan is at his best with an decent supporting cast."
    },
    {
      "rating": "5",
      "text": "This was not as good as the latest two. It had little humour and I wasn't impressed much"
    },
    {
      "rating": "9",
      "text": "This movie is hilarious. I loved the little jokes and just general slapstick humor that Johnny and Boff have. I also love how Johnny pretends to know everything. I would recommend this to any James Bond or comedy fan."
    },
    {
      "rating": "9",
      "text": "It is an entertaining movie. The jokes are good. The cinematography is great the music is great."
    }
  ]
}