{
  "id": 366,
  "title": "John Wick: Chapter 2",
  "starring": [
    "Keanu Reeves",
    "Common"
  ],
  "runtime": 122,
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "description": "John Wick is forced out of retirement by a former associate looking to seize control of a shadowy international assassins’ guild. Bound by a blood oath to aid him, Wick travels to Rome and does battle against some of the world’s most dangerous killers.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hXWBc0ioZP3cN4zCu6SN3YHXZVO.jpg",
  "categories": {
    "plot": 8.222222222222221,
    "acting": 8.25,
    "ending": 8.0,
    "soundtrack": 10.0,
    "cinematography": 7.363636363636363,
    "familyFriendly": 3.0,
    "funny": 8.666666666666666,
    "action": 8.210526315789474
  },
  "reviews": [
    {
      "rating": "9",
      "text": "After rating the first on e rather highly, I had reservations about them making a sequel and seeing this franchise become another \"Taken\" but I was pleasantly surprised how well this entry into the series turned out to be. There is a lot of good fight scenes that are very well choreographed mixed in with some comedic elements and witty dialogue. The movie also does a good job or widening its scale whilst staying as relatively grounded as the first one. Oh and Keanu Reeves is as bad ass as he was in the first one"
    },
    {
      "rating": "7",
      "text": "Rapidly, John Wick is turning into Jason Bourne. Dispatching the lengthy one-liner, \"Oh my God it's Jason Bourne\" for the simplistic, \"Oh,\" when a poor sap realizes who is after them, Chapter 2 of this saga is another stylish entry into this newfound action franchise. Dishing out headshots like Oprah Winfrey gives away cars, John Wick: Chapter 2 finds the famed Boogeyman fighting for his life once again. After losing his wife, dog, and car, in the first film, Wick loses his freedom this time around via Italian crime boss Santino D'Antonio (Riccardo Scarmacio). Cashing in a marker given to him by John that let Wick get out of the game the first time around, Santino thrusts him back into the world of assassin work by tasking him to kill Santino's sister, Gianna (Claudia Gerini). Unraveling from there, the world comes crashing down around Wick with Gianna's bodyguards, fellow assassins, and then the entire world all coming down on him by the film's end.As with the original, John Wick: Chapter 2 has absolutely exquisite action sequences. With a seamless flow and orchestral feeling to the action, the film is a sight for sore eyes. While its love of headshots leaves the film blood soaked, the fight sequences always take center stage. It is like watching a ballet with two equal foes entering in a dance with one another that only one will survive. Former stuntman turned director Chad Stahelski continues to show what makes this franchise so appealing: its gorgeous stunts and fight choreography. For those who do not believe that action can be beautiful and put together in such a fine-tuned and structured fashion that it becomes like a dance with guns and knives, John Wick continues to stand as the perfect counter to that claim. Yet, its choreography is not all that makes the film's action appealing. Utilizing great set pieces - such as the Reflections on Self exhibit in the museum that plays out like a hall of mirrors - there is always some new secret or foe hiding around every corner. They are nuanced, extravagant, and detailed sets that allow Stahelski and his star, Keanu Reeves, to really feel their way around the dance floor and find out what spot on the set is the perfect one for each move. Alongside this, Stahelski's refusal to turn the film into a handheld camera mess continuously rewards the viewer with steady, heavily digital, and incredibly crisp action scenes. The camera certainly moves, to be clear, but it is never jarring. Instead, it is in rhythm with Wick and the action with no frivolous cuts that could disorient or distract from what is taking place. Instead, the fight is given room to breathe and it takes incredibly deep breaths.Matching the gorgeous visuals of the fight sequences is the color scheme of the film. With its neon backlighting in every sequence, it is hard to deny that John Wick is a truly stylish film. Tossing in a gorgeous usage of blue blended with any number of warm colors, John Wick: Chapter 2 is a truly beautiful film. With the crispness of digital photography matching perfectly with the film's neon aesthetic, the composition of shots and blending of colors in the background make this a film that is littered with eye candy. Together with those aforementioned fight scenes and the film is one with visuals that far exceed the quality of its plot and acting. Whenever the story may slack or a line comes off awkwardly, the film's impeccable use of color always picks it up off of the ground. The framing and composition are similarly top-notch, particularly in the sequence with Gianna. As she lies naked in a tub with the blood from her wrists taking over the water, the camera rises to the ceiling and looks down upon her. In a candle-lit bathroom with blue water and deep red blood all over, Gianna lays with her hands outstretched. It is a powerful scene before this, but with this final image of the bloody but silent carnage left by a visit from John Wick, it really cements itself as a highlight of the film.Unfortunately, too much of the film is obsessed with reminiscing on the original. While the references to the original are quite limited, the film nonetheless keeps the same plot idea: people are stupid to mess with John Wick. Wherever he goes, his name is met with horror and fear. It is obvious why this is the case, but this was the same situation in the original. Though it is nice to stay consistent to some degree, it would be nice to see the franchise mix it up instead of constantly reminding us he is deadly. In the first film, we needed to know this information. Now, however, it feels purely masturbatory with regard to how great of an assassin Wick is. Going through a plot where literally every person in the world becomes an assassin or knows who Wick is without being told, it does become rather implausible for one, but also feels a bit like a satire."
    },
    {
      "rating": "7",
      "text": "The first half of the film is a problem because there is basically no action beside the (great) 10min Opening and I was getting bored. Luckily the second half is the opposite and the action shifts to like 70/30% for the rest of the runtime. The catacombs sequence is fantastic and every Keanu Reeves+Common scene is highlight material"
    },
    {
      "rating": "9",
      "text": "Just one word: Amazing; one of the best sequels of all times; action scenes made by the own american Bruce Lee, Keanu Reeves; Jackie Chan, JetLi & Jason Statham are nobody compare to this guy; an immediate continuation of the first one, with a common thread among scenes, a continuity that explains what the other installment doesn't; it expands this mythology of the Continental Hotel, the assassins, this sect in the underworld life very different than the one we know; it still expands the good things from the first one but in another place (Rome) without repeating the same we watched before, is not a remake; there is no a funny character, has some comic moments; the character has his moral/honor code that makes us likes him because he doesn't kill for killing, if he doesn't have to kill you, he lets you leave; He has an inner suffering, typical tough hero who doesn't talk much. He isn't a superhero (but he seems), is a regular person & makes you feel that you can be him. lots of action without any cuts, many weapons, hand-to-hand fights, Jujitsu; It's not the typical movie where the bullets are always; people hurts him, It's much more credible than the rest of films of this genre. a Cassian (Common) spin-off could be made, since he follows the same method as John, behaves in the same way; the choreographies are beautiful, the production design is visually exquisite and photography is beautiful. This is La La Land for action movies. I want John Wick 3 now."
    },
    {
      "rating": "10",
      "text": "In the second chapter the audience get a closer look at the workings of this underworld of assassins. We find out that the Continental is more than just a chain of international safe haven hotels but the controllers and distributors of the gold currency system. That when someone receives a marker that they have promised in their blood a hit or I am assuming a huge favor. We finally see the process of having a contract created on a hit and how the message is sent out to all the assassins. It is definitely is more colorful and professional than the film Wanted where hits were crafted  in coded cloth from unknown gods. The music in John Wick has been well thought out to deliver power, aggression and action. There was a good balance between knife combat, gun fighting and mix martial arts. The wrestling in the film gave the fight scenes a real rawness and took away the choreograph look. The only thing  I would fault is the clarity behind who our villains are. We seem to be given a succession of high leaders from an Italian bloodline but it is unclear of what they actually do and control. I guess the questions have been left to be answered in the next chapter. All I know is I will be there to watch it."
    },
    {
      "rating": "8",
      "text": "it's an excellent action movie with brilliant cinematography and soundtracks. the story is not so great as the first one, but it was okay. overall, it is really a great fun action film. definitely recommended for all the action movie lover!"
    },
    {
      "rating": "9",
      "text": "An action film lovers set dream is the best way I can describe how I feel about John Wick Chapter 2. This time the film plays out fairly similar to the first only this time the dog thankfully doesn't die. Keanu Reeves does all of his own stunts the same as the first and it works brilliantly. There's no shaky cam or episodes during fight scenes where the camera is jerking around everywhere so you can really admire the incredible amount of effort that Keanu put into making this film. One more thing I really enjoyed about this is that this time around the filmmakers delved deeper into the secret society that was introduced in the first film. After the first film many moviegoers included myself wanted that badly and it's clear the filmmakers heard those pleas. The only negative I can mention is that the sheer size and influence of this secret society sometimes reaches the point of being a bit ludicrous and almost fantasy especially at the end of the film."
    },
    {
      "rating": "10",
      "text": "Ultra Violent,classy and stylish fun with an mean sexy soundtrack.With keanu reeves still looking young and handsome What is there not to love.story isnt in complex or in depth but thats not why we are here. 10/10"
    },
    {
      "rating": "8",
      "text": "John vuelve más Wick que nunca.En esta brutal (aunque quizás innecesaria) secuela del famoso asesino, todo es más espectacular que en la primera entrega. Coreografías increíbles, fotografía excepcional, secuencias de acción intensas...John Wick 2: Pacto de Sangre es una muy sólida secuela que gustará a todo tipo de públicos.Recomendada."
    },
    {
      "rating": "8",
      "text": "Chad Stahelski's John Wick: Chapter 2 is a bigger, better, longer, action-packed, high stakes film than its predecessor. It packed so much more heat, and audiences will grit their teeth throughout the movie. The action scenes are more fluid and more exciting, although sometimes, it gets kind of repetitive. It has to do with its length, and by the time the third act came in, audiences had had quite enough of Keanu Reeves fighting and killing dozens of men (and women.) The acting was the biggest problem of this film, albeit the high score, which was because of the glory-ness of the film. Keanu Reeves isn't precisely the dramatic type, though what he lacks in acting chops, he makes up for with his action scenes, a problem that was also found in the previous movie. Overall, the film is a thrilling ride more in-depth down into the assassin brotherhood. The cinematography and the production design was amazing, and this film is a must-watch for anyone, action movie fan or not."
    },
    {
      "rating": "7",
      "text": "If you enjoyed the first movie, it's more of the same. I think the first is probably required viewing however - as a standalone, you might be left confused. You could still appreciate the inventive and well-crafted action scenes, however."
    },
    {
      "rating": "8",
      "text": "While missing alot of the charm that made the first movie a surprise hit, there's still enough great action scenes here for most people to get by. While the story is your standard fare in regards to these types of movies, the ending felt rushed just so they could make way for a 3rd movie. Still though Keanu Reeves really has put his all into this and you can tell how much he trained just by the action scenes alone. His acting leaves something to be desired but you don't go into a movie like this expecting award winning acting so I'll let it slide. It's a good time waster and a good action movie for those who like it. I'd still recommend the first one to people over this one though."
    },
    {
      "rating": "9",
      "text": "I love it, excellent action movie and i enjoy the gun blazing scenes all the way to the end. It's John Wick and that means alot of dead bodies. Not sure why other users rate it below 3? I thought minimum would be 6 for fair assessment. This is a movie created to entertain and alot of bs."
    },
    {
      "rating": "9",
      "text": "An excellent follow up to a modern action classic. Not quite as good as the original, but fantastic none the less. Awesome gunfights and choreography. Its not going to win any awards but damn its fun. Looking out for part 3!"
    },
    {
      "rating": "8",
      "text": "A non-stop action film that actually has a brain. Keanu Reeves deserves some credit acting wise. Yes I said it. For someone who looked like \"duh...\" through most his career. He's actually solid in the John Wick movies. I mean, it requires some acting to be so damn bad ass. Sure Neo was a cool character but Keanu still looked lost through that whole trilogy. Here, he owns this character and every single action scene \"and there's a lot....a whole lot.\" While there's plenty of colorful characters he goes up against. The hot deaf girl stands out the most though. I love how she and John communicate back and forth with sign language, each with their own death threats. Even John's dog is a great character. The film is so stylish, draggy and action packed that you might grow a little bored. Especially bored with so many gun shots to the head. If you're an action junkie though, John Wick 2 is heroine."
    },
    {
      "rating": "8",
      "text": "First of all, I am not a big action movie fan, so please don't take my comment to seriously.I did not enjoy the car chasing scenes, not sure why did the biker got hit in the first place and what was stolen. And as we all know the bullet-proof John Wick.However, I do enjoy the movie overall, it gave us a glimpse of the structure of that underworld which is nice. Despite I am not an action movie fan, I do looking forward to the next movie to see how the story progress.I think I might have an eye problem, coz I think the CGI (or graphics in general) looks a bit strange, and I kept thinking to myself whether the things are real (e.g. the dog). I am surprised no one discuss it so it is quite likely I have an eye problem."
    },
    {
      "rating": "8",
      "text": "Not as good as first one in my opinion, but still really good action scenes and the story was interesting also, even though some things didn't make any sense really (I mean how characters reacted to some things). Either way, a movie worth a watch for sure."
    },
    {
      "rating": "8",
      "text": "Awesome!! The action scenes are amazing, the image is brilliant and the sound is just staggering. It's exactly like is predecessor but it delivers once again. John Wick 2 doesn't fells wash out like it happens so many times with action sequels, no instead raises the bar keeping the same pace and turmoil.As i said in the first, you'll sit and enjoy every little piece of this film."
    },
    {
      "rating": "8",
      "text": "\"John Wick Chapter 2\" is a great and fun action movie, starring Keanu Reeves in the eponymous role. While the first movie was a bit shallow, this sequel greatly expanded the franchise's lore and improved on every aspect. The action is over the top, but it also borders on the ridiculous sometimes. Nevertheless, these action scenes are choreographed so beautifully, you ultimately don't mind that an entire army of killers can't hurt John Wick, or that his guns rarely need reloading even when he is all-guns-blazing in the middle of a shootfest."
    },
    {
      "rating": "9",
      "text": "John Wick: Chapter 2 manages to deliver even more non-stop action, while continuing to build upon the fantastic world it inhabits."
    },
    {
      "rating": "8",
      "text": "With a choreographic rhythm, it narrates the return of a hired killer forced out of retirement. the story may have its inconsistencies but it can be overlooked by the action scenes, due a Keanu Reeves who shows more character than developed in The Matrix. For binge with a large bag of popcorn."
    },
    {
      "rating": "9",
      "text": "John Wick: Chapter 2 looks logical continuation. Everything is made at the level of the first part, there were only several places of actions. The action began look even more abruptly, and now John kills dozens of people with much more serious reason, than just murder of his dog. I wait for the 3rd part)"
    },
    {
      "rating": "7",
      "text": "L'effet de surprise est certainement passé -à moins de ne pas avoir vu le premier !- et l'on peut craindre une répétition non moins certaine des affres de Monsieur Wick dans cette suite -et la prochaine...- et la lassitude qui va conséquemment de pair. De ce fait, John Wick 2 est moins drôle et moins surprenant que le premier John Wick... et tout aussi bête.Pour autant, ce Wick 2 parvient encore à réussir ce qu'il fait de mieux, tout comme le premier : distraire et distraire !... et plus les macabés s'entassent, mieux on est distrait à l'instar des jeux du cirque à Rome, dans le temps jadis. Il faut dire que les massacres sont très bien chorégraphiés et qu'on a pas vu mieux (en quantité...-encore que !) depuis Hard Boiled ou The Killer de John Woo.S'il n'utilise pas de ralentis, le réalisateur délivre une réalisation solide et très appliquée, ne coupe pas comme un sauvage et ne cadre pas comme un demeuré : bref, tout le contraire de facilement les trois quarts de la production des films d'action depuis... belle lurette !Et si le film est moins drôle que son prédecesseur, il l'est encore suffisamment par bien des façons à la limite de l'absurde d'ailleurs. Keanu Reeves est bien sûr dans son élément à la fois pathétique et indestructible, détaché et obsédé. Quelque chose comme... un con avec un flingue, des tas de flingues... et vous savez quoi ? les cons ça ose tout !"
    },
    {
      "rating": "10",
      "text": "John Wick 2[spoiler]    121 kill 0 Mort (J'ai compté pendant le film)    [/spoiler]    Enfin il est sorti ce film avec ce personnage mythique !! Tellement Badass, tellement propre, Ethétiquement ravissant. Certaines scènes vraiment bien réalisées, elles nous donnent envie d'en avoir d'autres. Vivement John Wick 3[spoiler]    Au faite John Wick 121 Kill / 0 Mort LOL (je me suis amusé à les comptés \"intervalle de tolérance  4\" )    [/spoiler]    Pour les faiblesses je dirais les musiques ... dommage.Mais le reste est un rêve d'un film d'action génial !"
    },
    {
      "rating": "9",
      "text": "Они взорвали его дом, он убил их. 2 часть одна из стильных боевиков про наемных убийств."
    },
    {
      "rating": "10",
      "text": "Better Than The First!Chapter 2 is definitely one of those rare sequels that are better than it’s predecessor."
    },
    {
      "rating": "10",
      "text": "This movie is awesome! part 1 was good too, but part 2 was edge of your seat non stop action for 2 hours. really loving this series and glad Keannu is the star. can't wait for part 3."
    },
    {
      "rating": "8",
      "text": "First, let's be clear, John Wick series of movies is a lot of things. It's excellent fighting choreography, brutal deaths, an orgasm of male testosterone wish fulfillment. That isn't bad, I absolutely love it for what it is, a great revenge thriller, Keanu Reeves delivers an excellent badass air to himself. It has a lot of great supporting actors including Ian McShane as the Manager, Common is great as a foil for Keanu and even Ruby Rose, whom I dislike a lot as an actress fits in it.The best part about it, is it stays in its lane. It doesn't try to be more than what it is and because of that it scratches that itch of an up-powered action flick that has a lot in common with the 80s revenge movies. I will see these as long as they keep coming out.I was surprised that Keanu, who recently turned 52, can do the part. There is no doubt in his performance that he plays the person perfectly. I was surprised that I didn't want to tear my ears out with Ruby Rose's character. They were smart, they had her play a mute, used her looks as an attractive assassin. The only part about her I didn't like was the portrayal that she is a badass, sorry I didn't buy that for a second... then again I think it was reflected in her last fight scene so maybe the writers had judged correctly as well. The rest of the cast were great too, no complaints.The thing I liked most about the sequel was its subtle expansion of the world of assassins. I won't go into depth as I don't want to reveal any spoilers, but the movie unwrapped a small slice more of the world, making it feel deeper and more real (well as real as wish fulfillment fiction can be).Oh, and I really liked that they didn't repeat the same plot devices they used in the first (that is the only semi-spoilerish thing I will say).The good: great action with lots of choreography, gun porn, and Keanu just rocked it.The bad: could we please stop with \"how cool\" Ruby Rose is already?"
    },
    {
      "rating": "9",
      "text": "(90/100)Improves on the first one with longer action sequences, expanded story and more insight into John's past."
    },
    {
      "rating": "8",
      "text": "Chad Stahelsky returns back to the director's seat for 'John Wick: Chapter 2'. At this point for an action flick this could have gone either really bad or really well. Luckily, 'Chapter 2' not only respects the dark and serious aesthetic of the original film, it builds on it and is better in every way.Like the first film, this also starts hard with an action scene in which John attempts to recover his car (or rather the picture in it with his dead wife) from some Russian mobsters. Yet, unlike the first film, this is less personal, focusing more on the inner workings of the criminal underworld. A world marked with complex rules and principles.There is no rest for John Wick, though, the premise starting when an Italian mobster, Santino, asks him to kill his sister. That takes him to Rome, where he has a friendly discussion with an old friend who asks him with a worried look: \"Are you here for the Pope?\". John offers a negative answer. This might seem funny at first, but actually this goes to show what a legendary status Wick has built up among his peers. He is constantly praised for his skills and he is feared. When he gets to his target there is a party happening among the ruins of Rome. This has a symbolic meaning. It goes to show the historical influence and power this criminal underworld has. There were secrets and shadowy politics governed in the past among these now ruined walls.The most powerful scene in the film comes when John finally meets his target. Santino's sister does not put up a fight. She knows Wick's reputation, she respects him and realizes that he cannot be stopped. Yet she dies her own way, by cutting her wrists and pondering at the afterlife. \"Do you fear damnation, John?\". After Wick's positive response she claims: \"I always thought I could escape it.\" as she gives her final breath. Unfortunately, for all its aesthetic and deep beauty, its a bit pointless.From here on, things take a turn for the worst for The Boogeyman, as Wick is known, but the action scenes are still one of the best I've seen. John Wick is a man of few words but many actions (like this film to be honest). It is still a satisfying and entertaining action flick, but is polished by visceral imagery and a gripping soundtrack."
    },
    {
      "rating": "8",
      "text": "It's undoubtedly bigger and better than the original; it has a more cohesive, and convincing plot, more compelling story, and more doses of thrills.This sequel also expands this ravishing universe of criminals and assassins to another level with more rules, bigger scope and reach. It also emphasizes on the titular character's charm as well as Keanu Reeves's charm.But it's also undoubtedly less entertaining than the original; it has \"more of the same\" choreographed action set-pieces, which , of course, don't feel as fresh as they were in its predecessor. But it still nothing short of pure fun.Another issue I've with this movie is that the denouement is a bit messy, and longer than it should be.All in all, John Wick: Chapter 2 is one hell of a ride that with its exceptional pulp flick make almost every other pulp action flick seems nothing more than a cash grab!(8.5/10)"
    },
    {
      "rating": "9",
      "text": "A sequel that takes what you love about the first one and doubles down on it in the best way. Better action than the first and a deeper exploration of the fascinating world we got a glimpse of in Chapter One. It doesn’t quite have the emotional punch that the first had, but that’s fine. It still works. Keanu Reeves is still the lifeblood of this franchise, supported by Chad Stahelski’s direction and a top notch stunt team."
    },
    {
      "rating": "7",
      "text": "I want to compare with the first movie.I think it was worse than the first film,it became more popular,earned more money, but I think the first movie was much nicer.Firstly this movie was a bit silly, especially some scenes were irrational.I love john wick movie I enjoyed the continuation of the series and I look forward to a big third film.I'm sure this will be better than this movie.In general terms john wick love the universe he created with mafias.a very different world has been created for us and we are entering that world for 2 hours.Keanu Reeves playing the role exactly as it should be.He is very well handled by the sense of revenge he is going to make us wonder until the end of the film allows us to stay connected to the end and find the bad man to serve his fine.I have very positive thoughts about john wick in general and it should definitely continue the series but this movie was bad and ridiculous compared to the first film."
    },
    {
      "rating": "10",
      "text": "One of the best action movies and sequels ever. Preparation scene is every man wet dream."
    },
    {
      "rating": "8",
      "text": "This is a straight-up action flick, with extremely brutal, fast-paced action sequences. The film realises its ridiculousness, and embraces it to the point where we simply sit back and enjoy all the thrills."
    },
    {
      "rating": "7",
      "text": "I liked the movie. Its been a long time since I have seen keanu reeves on the big screen. If you love great action scenes you will love this movie. However there isn't a lot of story and therefore the reason behind all the action misses. It compensates itself with great and sometimes funny actionscenes. I therefore rate this movie a 7."
    },
    {
      "rating": "9",
      "text": "Not too many sequels follow a similar path to the original and still manage to make it as good. John Wick Chapter 2 does so because even tho the main plot is similar, it actually tells you new things about the world Wick lives in."
    },
    {
      "rating": "10",
      "text": "This is even better than the first one. The first one was absolutely awesomeness. Recomend Recomend Recomend!"
    },
    {
      "rating": "9",
      "text": "Not too many sequels follow a similar path to the original and still manage to make it as good. John Wick Chapter 2 does so because it actually tells you new things about the world Wick lives in, which is what made this action franchise so much fun in the first place."
    },
    {
      "rating": "9",
      "text": "John Wick Chapter 2 does a great job at building the world established in the first John Wick.  By that I mean you learn a lot more about new people and places that you saw in the previous film.  For example, you learn more about the Continental Hotel and more of the rules that are in place when people like John stay there.  Little details like that really open this world up to interpretation and a possible cinematic universe that could branch off from the background we got in this movie.  While you are following John Wick the entire time, the scale of this movie is much larger than the first.  In that you visit a lot more places around the world unlike the first film that was primarily based in New York for the whole movie.  The expansion, in scale, really benefited the movie because you got a look more into John’s past and who he’s interacted with throughout his time as a hitman.The filmmaking on display in this movie is something that all action movie directors and actors need to take notes on.  This is some of the best action filmmaking I’ve ever seen.  This really comes to light in this movie because of Keanu Reeves and his physical acting with the stunt work he does in this movie.  While there are parts that a stunt double was needed, you clearly see that for a ton of those fight scenes it is Keanu doing a lot of the stunts himself.  It is so refreshing to see and actor who can do his own stunts and isn’t afraid to be physical with his role.  This also translated to amazing editing of the movie with a lack of cuts and shaky cam that makes your eyes hurt.  This puts less stress on the director, a former stuntman, and allows them create these amazing action sequences without a variety of cuts and allows the audience to see the action.  It’s so hard today to find an action movie that does that all that because many actors are incapable of doing their own stunts.  This movie was a breath of fresh air with the amazing filmmaking on display with all of the one-take action scenes that the audience is in awe while watching.John Wick Chapter 2 is an amazing sequel and Keanu gives another amazing performance as the hitman himself.  Some of the best on-screen action I’ve ever seen while sitting in the theatre.  The filmmaking on display is great and John Wick Chapter 2 is a more than fitting sequel to John Wick."
    },
    {
      "rating": "10",
      "text": "Amazing. non-stop edge of your seat. Well written story and as always KR knocks it out of the park. Can NOT wait for the third! Must see how this ends. I have an idea."
    },
    {
      "rating": "9",
      "text": "Amazing. Better than the first. I'm looking forward to how much better the 3rd can be"
    },
    {
      "rating": "9",
      "text": "If you love action films, John Wick chapter 2 will blow you away. The one thing that makes these film so great is that the main lead Keanu Reeves makes most off his stunts himself and it just gives so much realism to the action that occurs on the screen that you just buy that this guy is the real deal action hero. Chapter 2 never gets boring and apart from a bit slow pace from time to time the movie still kicks buts, and gets a well deserved 9 out of 10 points."
    },
    {
      "rating": "10",
      "text": "John Wick: Chapter 2 PvC Review (5/25/19)ProsNaturally building off the world, action, characters, and rules introduced in the first movie; John Wick: Chapter 2 perfectly continues the story in such an awe inspiring way that cannot be put into mere words. All my complaints from the first movie disappear in this beautifully fashioned tale that dives even deeper into the lore and continues straight off of the first movie with no wasted time to dive straight into the vastly improved action sequences that bleed with style and grace. The scenarios have tremendously improved too with the final major scenario being absolutely jaw-dropping and a blast to watch. In my opinion this may be the perfect sequel, not the perfect movie by any means but a perfect continuation of what was already established in the first movie. It kept me wildly entertained the whole way through but I should discuss the very few cons. + Expands the world in a natural way+ Scenarios are beautiful+ Settings are wonderful+ Action is top-notch + Payoff is satisfying+ Beautifully shot + Story is intriguing as well as the newer characters+ Soundtrack is amazingConsNow the reason the pros description was very lackluster was because I could honestly gush about this movie all day. But there are some issues I have found with this flick and while small I should mention them. For instance body continuity on the ground sometimes lacks or the fact that the plot, when expanding the universe, can lead the viewer to get a bit lost at times. Tiny things like that, that I noticed and just couldn’t shake. It never really detracts from the enjoyment of the film at all but they are just being noted as noticed.- Body continuity can be lacking- Sometimes new universe details can be hard to follow but they still are intriguing- Gunplay has improved but I still find it so much more fun when he doesn’t have a gun- Beats from the first movies plot are revisited, a bit of fanservice but it can feel a bit lazy at points (it is a similar gripe I had with certain sequels, felt familiar to the reused jokes in Deadpool 2)OverallJohn Wick: Chapter 2 is a gem within the genre as it expands the world so lovingly while also providing dramatic improvements over areas where the first film lacked. There are small issues here and there but this movie is beyond entertaining, leaving me craving to see the third installment of the franchise."
    },
    {
      "rating": "10",
      "text": "John Wick 2 builds on the first movie with even more of the best action scenes in recent memory. Like the first movie, it's a dark, violent, gritty, and intense film with incredible visuals and sounds on 4K bluray disc format. I watched it for the first time with a 4K streaming service, but the difference compared to 4K Disc is night and day. If you love guns and martial arts (\"Gun Fu\") in your films, then John Wick 2 is an absolute must in your collection. Sequels are usually hit and miss, but John Wick 2 is definitely a hit in my opinion. Watched on a 4K LG OLED TV C7 65\" with LG UBK90 4K Bluray player."
    },
    {
      "rating": "8",
      "text": "CTRL-V review from John Wick. Equally as enjoyable as the first, glad to see the quality continue. Better stoned."
    },
    {
      "rating": "10",
      "text": "This movie is just as great as the last one, lots of action and again, an amazing film."
    },
    {
      "rating": "10",
      "text": "Still a fantasticly written, acted and just plain amazing action with a story that is not hard to follow but builds up the interesting world of John Wick"
    },
    {
      "rating": "8",
      "text": "All eyes on him and all guns pointed at him.It was not an attracting title for a sequel. The first film was good, completely an unexpected, but I was expecting this one, even though not as much as I was excited to see 'Jack Reacher 2'. That film was good, but did not meet with its first film's merit. And this sequel, really amazing. One of best follow-up flick and better than the original. That feat considered very rare in cinema and here is the one.Entirely different than the first. I meant the storyline. A new action, a new adventure, and even on a bigger scale. Though the initial parts were average. I totally disliked that killing assignment Mr. Wick took in his hand, but what followed after made the film great, definitely not to be missed for that alone. Especially if you are an ardent action film fan. For me, that reminded me 'Kill Bill', but they are not the same kind, except the fighting concept with hundreds.Continued from a couple of days later where the previous narration had ended. Now the retired assassin, John Wick forced to take a final job, but soon he finds he was backstabbed. Every eye on the town on him and every gun pointing at him, there's no way he could get out of it easily. So, he has to fight them all, just in order to survive. Then what comes later are even more aggressive screenplay that's ends with left open the door for the third film.Now this became a stylish franchise. That's what happens when a stuntman takes up the directional job for an action flick. He did not write it, but he knew exactly how to create them, technically perfectly. Besides, he got wonderful, dedicated actors to achieve that. Not just Reeves, but all were awesome. Believe the third film would be a kick-ass, particularly the pace that could match with likes 'Crank'. Just watch it already and be prepared for the next, the mega finale.8/10"
    },
    {
      "rating": "7",
      "text": "John Wick is a film that you go in simply for the adrenaline you get off of the immense action sequences. The plot was OK, but not memorable, and the villains lacked in 'wow factor'. Keanu Reeves played his part well, really showing the age in the character and giving off a sense of realism, that John Wick isn't some superhuman man that never ages and whose instincts never slow. All in all, a film that probably won't stick with you for long, save some incredibly choreographed and executed fight scenes."
    }
  ],
  "recommendations": [
    "john_wick_chapter_3_parabellum",
    "john_wick",
    "the_bourne_ultimatum",
    "the_bourne_supremacy",
    "kate",
    "mission_impossible_ii",
    "upgrade",
    "nobody",
    "the_matrix_reloaded",
    "mission_impossible_ghost_protocol",
    "creed_ii",
    "hardcore_henry",
    "haywire",
    "mad_max_fury_road",
    "the_magnificent_seven",
    "abraham_lincoln_vampire_hunter",
    "300_rise_of_an_empire",
    "avengers_age_of_ultron",
    "atomic_blonde",
    "mission_impossible",
    "quantum_of_solace",
    "the_equalizer",
    "top_gun",
    "the_mechanic",
    "hanna"
  ]
}