{"id": 391, "title": "John Wick: Chapter 3 - Parabellum", "starring": ["Keanu Reeves", "Halle Berry"], "runtime": 131, "genre": ["Action", "Thriller", "Crime"], "description": "Super-assassin John Wick returns with a $14 million price tag on his head and an army of bounty-hunting killers on his trail. After killing a member of the shadowy international assassin’s guild, the High Table, John Wick is excommunicado, but the world’s most ruthless hit men and women await his every turn.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/ziEuG1essDuWuC5lpWUaw1uXY2O.jpg", "categories": {"plot": 8.264705882352942, "acting": 7.9, "ending": 8.375, "soundtrack": 5.0, "cinematography": 8.5, "familyFriendly": 3.0, "funny": 8.666666666666666, "action": 8.265822784810126}, "reviews": [{"rating": "10", "text": "This is amazing!!!!!!I waiting for the continuation!!!!!!!!!!Keanu Reeves you the best!"}, {"rating": "10", "text": "An amazing movie which takes all the previous John Wick films experience to a higher level."}, {"rating": "10", "text": "If you compare it to it's peers in the genre, it's an all time great action movie. It's better than the other two Wick films which are already ranked on several all time action film lists."}, {"rating": "8", "text": "While the first film is the overall best out of these first three movies, Chapter 3 proves that this franchise still has steam and is in no rush to end. From the opening scene we are thrown into a tense night where John fends off attacks from every assassin in New York City. The action is just as great, if not better, than the first two films. John must adapt to survive against the different enemies which keeps things fresh and exciting. The story does struggle a bit but the fast paced scenes keep the film engaging from start to finish!"}, {"rating": "8", "text": "What a weird tone in this highly entertaining movie. It made me question my morals, given how mesmerised I found myself at what mostly consisted of an endless stream of killing. But the humor, the extraordinary characters throughout .. it just made for a blast. It's only a movie after all, right? But boy, there's a lot of killing."}, {"rating": "8", "text": "Some of the most satisfying action ever put up on the big screen. Perfect amounts of bloody fun."}, {"rating": "8", "text": "I think I liked this movie the least of the 3 so far. Seems to me as the plot is wearing a little thin three movies in, and now a fourth on the way LOL! Anyway, Keanu Reeves is great and Halle Barry not so much, but the action is pretty good from start to finish and they up the ante a bit from the first 2 movies in that regard. If you enjoyed John Wick 1 and 2, well this is a no brainer. Definitely the best action film to see in a while although I hope they finally end it with the fourth film. It's a quadrilogy! You can actually consider these 3 movies to be just one long movie since the end of one is the start of the next and so on. I wouldn't recommend seeing this if you haven't seen the first two."}, {"rating": "7", "text": "\"Whoa\" This sequel is action packed and i'm looking forward to the next sequel! There are some questionable actions by the assassin's (choosing melee weapons over guns, and using melee weapons when they have guns?!); the action scenes they went with was still enjoyable with a suspension of belief."}, {"rating": "10", "text": "John Wick is the best action movie ever made, period. Action is just 10 levels above any movie before it."}, {"rating": "8", "text": "I really enjoyed this great action movie.John Wick kills a lot of people.He is still hero.I liked \"Zero\" who is a Japanese sushi chef and assassin.His Japanese is \"Okay\".I understood it!"}, {"rating": "9", "text": "Very few film franchises manage to keep things fresh, while keeping what we all love about a film franchise, yet John Wick: Chapter 3 somehow delivers."}, {"rating": "10", "text": "Just...I don't...I mean...How do you even...Wow.More. That's all I can say. MORE."}, {"rating": "8", "text": "This is a John Wick movie, and it's exactly that. The movie starts with a action scene right away, because the movie picks up right after Johns excommunicado from previous movie due to him killing someone in the continental ground.The underline plot of the movie is basically John looking for the \"Elder\" to get everyone to stop trying to kill him and the the other plot that is going the same time is that someone sent by the High-Table to kill everyone who was involved with the mess that John made. But this plot point is thrown under the boss on the last 3rd. Halle Berry was in the movie for some reason, but she wasn't bad the action scene with her was quite good.But what falls face first is the last 3rd of the movie, which is located in New York's Continental where the High-Table has sent assassins and a small army who have \"Plot armor\" on which both blocks bullets and doesn't, but what was truly terrible was the assassin fights.They dragged on and on, to the point of I got bored, while it was amazing but when it took so long and then right away next assassin fight started I got frustrated. None the less a good movie and the ending means there will be a John Wick 4 and maybe 5, where he is going to end the High-Table."}, {"rating": "8", "text": "JW 3 is a very good action flick. The story doesn't bring much to the characters. If anything, it is kind of a loop that brings you to the start. The acting was pretty good. I really like the H. Berry scenes. There are smalls moments of pure fun in the movie. The action is precise, violent and very intense. The film doesn't take itself too seriously and it shows this time around. I give it a 80%. In terms of action this movie is a blast. In terms of story they could have give us a bit more. But you feel like a lot is unsaid, for the other movies."}, {"rating": "10", "text": "Best action movie in a long time! Keanu Reeves is so sick in this movie and to me it is the best of the franchise so far. Not a dull moment the whole time and it always keep you on the edge of your seat. Cant wait for the continuation"}, {"rating": "8", "text": "Everything involved John Wick, dog, motorbike and swords are great. The rest? no so much."}, {"rating": "7", "text": "John Wick: Chapter 3 - Parabellum is possibly the most diverse film of the trilogy, and with diverse I mean the film with possibly the best choreography of the three, but the worst script of the three."}, {"rating": "9", "text": "Esse filme é porradaria pura, ele é otimo, acho o melhor dos 3 e concerterza um dos melhores filme do ano"}, {"rating": "8", "text": "John Wick Chapter 3 proves that this franchise is still going strong. Here are the negatives. Some lines of dialogue feel kind of weird. Asia Kate Dillon’s performance felt really wooden and she never showed a lot of emotion. There are sequences where John Wick and another character are talking and all of a sudden they start talking in a different language and then switch back to English. It does start to get annoying. My last problem would be that I think Halle Berry was way underused. Here are the positives. Keanu Reeves does a fantastic job. He has done an outstanding job in each of these films but he did a lot better in this one. Laurence Fishburne and Halle Berry also do a fantastic job. The rest of the supporting cast does a great job. The standout for all the John Wick movies is the action. It’s no different here. The action is awesome. It’s hard to believe that Keanu Reeves is actually doing all of these stunts. The John Wick movies are basically 2 hours of dumb fun action. Each fight scene has some sort of unique flare to it that makes the scene interesting to watch. The cinematography is pretty good in this film also. Each action scene is shot differently and it makes those scenes ten times cooler. There is a cool long take action scene on a bridge. The score for the film is good. It’s not outstanding, it’s just good. The story is interesting also. We get to learn a lot more about where John Wick learned to fight and it’s very interesting. There are a couple of jokes that did manage to get a chuckle or two out of me. The locations used in this film are really cool such as Casablanca and New York City. It’s good to see these different environments in this film. The film is paced really well and the tone remains consistent most of the time. Before you see this film, you must watch the first two John Wick films or you will be confused. Overall, John Wick Chapter 3 - Parabellum provides more hard hitting action with great acting and solid worldbuilding. I give John Wick Chapter 3 - Parabellum an 8/10."}, {"rating": "8", "text": "The movie has plenty of action but it doesn't seem like much is happening except for wick fighting some guys."}, {"rating": "8", "text": "An excellent addition to one of my favorite action franchises. It has very fast-paced action, but also contains interesting themes that make the viewer think. My only issue is that the style of the films is starting to get a bit repetitive, however, it is a system that still works. Overall, it's a great film that I'd definitely recommend."}, {"rating": "9", "text": "Once again the John Wick series keeps its momentum and manages to produce a third quality movie in its franchise. After the first two movies I thought the action sequences couldn't get better but once again they prove me wrong and show more amazing continuous shots of all out brutal action. The story once again takes more of a back seat to the general high impact action of the movie however I don't believe you're watching this series of films for the plot more so the camera work and action shots, so whilst some stronger narrative may aid the film I don't at all think it is needed as the quality story present generally aids the outstanding action sequences."}, {"rating": "9", "text": "Very rarely will the third chapter of a film franchise garner the best rating on IMDB or any other aggregate movie review website, for that matter. As far as film franchises go, most tend to drop off and just become cash cows that are created for the sake of making loads of money. The Transformers and Terminator franchises are a perfect example of this. Then there is John Wick: Chapter 3 and it has quite simply, broken all of the aforementioned rules and may have set a new standard. The plot is effectively laid out for you in the first ninety seconds of the movie. John Wick is excommunicated, and there's a $14m bounty on his head. Following that brief bit of exposition are two hours of endlessly entertaining action, and while the film does keep you engrossed with its sense of mystery and intrigue surrounding this world of allegiances and deception, it's the thrill of the chase that ultimately matters.Parabellum maintains a rather cutthroat pace throughout, right from the frantic opening half hour through to the brutality of the final act. There's a lot more humor on show in this installment, which works due to how ludicrous some of the action has now become.If you want depth, character development, and story-telling then go watch The Godfather. In a grade A action film, the pacing is more important than depth, the choreography is more important than character development and the story is only used to get the hero from one set-piece to the next. Parabellum is absolutely relentless in that it's ridiculous in the best ways while being loud and violent from start to finish. Chapter 3 feels like a celebration of the action genre, showing no franchise fatigue and referencing a number of great action films in the process, even a nod to the original action man, Buster Keaton, graces the film in its opening moments. The first two films delivered hard-hitting action but Parabellum takes it to a whole new level for the franchise, with books, horses and dogs playing a major part in doing so.Suspend your disbelief and strap yourself in because John Wick is back in spectacular fashion. Over the course of three films, he's earned his place in the action hero hall of fame in a franchise that should be regarded as one of the greatest within the action genre."}, {"rating": "7", "text": "Solid entry to Wick franchise, tons of excellent action sequences with Keanu still cool as Wick. Pointless desert section with a bland main villain do weigh down film IMO, but if looking for great action, MUST watch."}, {"rating": "7", "text": "This movie is OK. But there are still some things missing...guns (too much knifes and swords), better dialogue and the list goes on. Acting is better in this one then previous John Wick movie. After the movie it feels like something is still missing."}, {"rating": "9", "text": "The way this movie ends sets up a sequel and I'm itching for it but Keanu did say this might be his last one."}, {"rating": "9", "text": "One of the best action movies for last 10 years, by the way they are use cliffhanger in the ending. What isn't so good for film like this.I'll wait chapter 4 and hope that this story will have happy end."}, {"rating": "8", "text": "Filme muito bom, desistam de matá-lo! A cena com dois orientais foi demorada demais e quando foi lutar contra o “CHEFÃO” foi rápida demais.Vai ter continuação"}, {"rating": "10", "text": "GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD"}, {"rating": "8", "text": "Part 2 was a rare sequel that was actually more inventive and enjoyable than the original. This time, Keanu Reeves is back with a $14 million bounty on his life, which brings a continuous stream of assassins trying to collect (and some silly business about the High Table). It continues with the absurdly high-body count and Reeves’ flat delivery, but seeks even additional ways to reek violence. Some of the scenes succeed (the dogs, horses and motorcycles), but almost every fight seems to go on longer than necessary. As a result, some of the stunts seem repetitive. Like previous incarnations, there are some snazzy locations. This non-stop rampage of killing features lots of well-staged action, which will satisfy Wick fans."}, {"rating": "9", "text": "The look and sound of the movie is excellent.  I watched it in 4K.  In some of the action sequences you can't help but laugh out loud at the ludicrousness.  The action is over the top, and even though he is WAY outnumbered by the opponents in every fight scene (especially the Halle Berry fight sequence with dogs), there somehow only seems to be a couple of people at a time that fight him, but the fight sequences are all about the choreography and will have you scratching your head about \"how did they do that?\"  If you cannot stand gore, do not watch a John Wick film.  I admit I even had to cover my eyes a few times.  They should rename the film \"John Wick - The Man Who Cannot Die\".  When you see the end of the film in particular you'll know what I mean."}, {"rating": "9", "text": "Its a hell of a ride. Packed with violence and gore and probably contains the best John Wick kill streaks. If you're in it for a good story its there and if you want a break from other films and just want to watch some ass-kicking fun. OH ITS HERE."}, {"rating": "8", "text": "Brutal, poderoso, acção até aos dentes e voltas e reviravoltas. Adorei o filme em todos os momentos. Top.Best 2019 action movie until now."}, {"rating": "7", "text": "I just watched Dangerous Liasons with Keanu, he was good in fight scenes even back then! Very entertaining, great imagery, great fight scenes, Keanu is fantastic....I gave it a 8 since it had weak moments for me: 1. Halle Berry was a baaaad casting, her scenes are not believable and ruined it for me 2. Asia Dillon did nothing for me, she was over acting and forcing it and I cannot get over her character in Billions , she brought the same character on with the difference that she was trying to be too sexy and forcing it, didn’t buy her either. Sofia Boutella would have been a better cast for Halle Berry btw. 3. Hokie fight scenes:- several ocassions where the bad guys had a chance to I’ll Keanu but they let him get up and fight again!!! Strange humor that didn’t work in the middle of some fight scenes- fight scene in train station, people dying left and right and the bystanders don’t even react!! All when blood spatters everywhere and bad guys are being cut and killed!!! 4. Non stop action sequence seemed video game like at some points"}, {"rating": "9", "text": "Keanu Reeves beating the sh**t out of everybody? Yes please, can I have some more? When it's awesome, it's awesome."}, {"rating": "8", "text": "The sociologists of the 40th century are going to break their heads trying to explain why this saga has its fans. It is true that the action sequences are well justified with dynamic choreography. However, what happens in the middle of them seems irrelevant, not to say boring. But if it is accompanied with popcorn ..."}, {"rating": "7", "text": "John Wick 3 is a slight disappointment. Not here are the action scenes perfectly set, here there is again a perfectly played Keanu Reeves. But in the first 2 parts there was still a great scenario, which in 3 parts turned into a clown. It seems that in the script I tell more about the world, and it turns out nonsense. Part of the plot in Africa is not clear at all how it affects the plot. I certainly understand that in the film, where the main thing - realistic production of action scenes the plot is not the most important, but not to drop to the level of Marvel in the development of the script. And so the film is great."}, {"rating": "8", "text": "This series is getting long in the tooth, everyone involved felt like they were getting tired, cgi was unleashed on a series whose signature is stunts.  The one saving grace was Halle Berry, she stole the whole movie with her acrobatics and dogs that tore the testicles out of every bad guy around."}, {"rating": "8", "text": "Не плохо. Но фильм начал сдавать позиции. Не стоило им продолжать эту шикарную трилогию. Это чревато провалом. И я твердо могу сказать что на четвертый фильм я уже не пойду в кино, лучше посмотрю дома. Киану как всегда на высоте. Каст актеров - шикарный."}, {"rating": "10", "text": "My personal best movie of the year. Excellent choreographed actions scenes, zero romance, shotguns and cool dogs. What else do you need?"}, {"rating": "8", "text": "\"Art is pain. Life is suffering.\".( 81/100 ).Hay muchas fortalezas en el universo que se está construyendo alrededor del nombre de John Wick, y aunque su ejercicio narrativo está absorbido por su acción, también sorprende el hecho de que se logra construir un camino con golpes y peleas más que con palabras y \"complejos\" discursos.En este capítulo, el público continuará como testigo del recorrido que John Wick realiza en busca de su libertad. Ésta vez, él está dispuesto a ir hasta la punta del iceberg para negociar su salida de aquella red de sociedades bélicas y dedicadas al crimen organizado.Parabellum tiene lo suficiente para entretener y emocionar a un público amplio: Las secuencias de acción son ingeniosas, creativas y, varias veces, hipnotizantes, los diálogos están adecuadamente decorados con frases poéticas sobre el dolor y la gloria, la fotografía y la escenografía son difíciles de ignorar por su atractivo e impacto; tanto Keanu Reeves como Halle Berry demuestran una química y una chispa de energía increíble y, lo más importante, se nos permite descubrir más sociedades, artefactos y personajes que incrementan la intriga en el recorrido. Sin embargo, aunque la intriga crece, toda esa información no complementa la comprensión de dicho universo. Hay situaciones de alta importancia que se tratan de forma muy esporádica y situaciones \"poco\" importantes que toman \"mucho\" tiempo en resolverse. Sí, el enfoque de esta saga de acción es construir situaciones de alto impacto visual con coreografías realistas y que fluyan técnicamente, pero, aunque sabemos que Wick quiere sobrevivir porque está siendo cazado, la película incrementaría el valor de su historia si tan solo explicara por quien y por qué.-There are many strengths in this universe being built around the name of John Wick, and even though the narrative exercise it's absorbed by its action, it's surprising the fact that the film achieves to build its way with punches and fights more than with words and \"complex\" speeches.In this chapter, the public will continue as witnesses of John Wick and his road to freedom. This time he is willing to go to the tip of the ice-berg to negotiate his exit of that warlike society dedicated to organized crime.Parabellum has enough to entertain and excite a wide public: The action sequences are clever, creative and, several times, hypnotizing; the dialogs are accurately decorated with poetic phrases about pain and glory; the photography and scenery are hard to ignore because of its attractiveness and impact; both Keanu Reeves and Halle Berry shows an incredible chemistry and a sparkle of energy, and, the most important, the intrigue in the story is increased by the introduction of more societies, artifacts, and characters. Nevertheless, even if the intrigue increases, all that information doesn't complement the understanding of that same universe. There are topics of high relevance with a sporadic treatment and situations of \"little\" importance that take \"a lot\" of time to resolve. Yes, the focus of this saga is to build high visual impact situations with realistic choreographies and technical flow, but even if we know that Wick wants to survive because he is being hunted, the film would increase the value of its narrative if it just would explain by who and why."}, {"rating": "10", "text": "John Wick Chapter 3 only expands upon everything that made the first two great. First, the action. A lot more variety and creativity in the fights, such as the use of knives and interaction with the environment. The action itself is smooth and has a special feel or realism in it that we've seen before. There is some more humor in this one and it's all very well timed with what's happening. Keanu Reeves does his thing and there is nothing else to say other than he's a man of focus, dedication, and sheer will. The movie also goes deeper into the world of John Wick and the assassins and we meet some new faces who are well established in their position. Overall, it's fun, badass, and has Keanu Reeves, so you can't go wrong with this one."}, {"rating": "8", "text": "I didn't expect an original story, given this is a direct continuation to where Chapter 2 ended; but all I asked for, besides the brilliant, over-the-top action sequences, is an interesting story that can keep me immersed throughout the entire film. Parabellum doesn't even have a plot of its own: it's completely reliant on its predecessor. This really didn't bother me at all ـــــ at first.The way this one picks up only moments from where Chapter 2 ended is just unbelievably great. I really couldn't have hoped, or imagined, for anything better. We get to be fully immersed into the fictional, and almost dystopian, crime world in a way that reminded me somehow of Blade Runner.The action sequences are stylish, insanely brilliantly choreographed and, most importantly, have innovative ideas and execution. John Wick franchise no longer sets the bar high for other action films; it sets up new standards for how action sequences should be shot and choreographed.Story-wise, though, this installment really disappointed me. As I mentioned above, all I asked for is an interesting story, be it a mere continuation of the last film or not. Unfortunately, the story here lacks everything that can make it intriguing. It's simply continuation to Chapter 2's with a rehash of storylines we saw thousand times in other action films to fill in the gaps. Moreover, Halle Berry's Sofia is almost an unnecessary addition to the film. I said almost because her dogs partly redeemed the presence of such useless, and even problematic, character.Drama is definitely not what I expected to see; but with all the silliness in the original and its first sequel, I was, somehow, ـــ unlike here ـــ emotionally invested in the goings-on and concerned, somehow, about the protagonist. That said, Keanu Reeves is absolutely fantastic as ever. He never gives us let us think of his John Wick as the formidable and invincible hero, even if we are one hundred percent sure he would win at the end of the day.All in all, John Wick: Chapter 3 - Parabellum is a decent sequel that proves another excellent entry in the franchise, by further expanding upon this exceptional universe and taking even more risks regarding the action scenes and fight choreography.(8/10)"}, {"rating": "9", "text": "John Wick 3 tem tudo que um filme de ação deveria ter, no minimo. As cenas de ação são muito bem coreografadas, sem aquela síndrome do \"tremelique\" que os filmes incompetentes adoram flodar. Em suma, até nos dão um bônus agoniante pelas mortes mais violentas, sem precisar apelar para qualquer tipo de gore desnecessário.A historia é uma continuação direta do filme anterior. Ela tem mais um papel de background para que aquilo tudo aconteça, não sendo o foco principal, o que já é o bastante caso entenda a proposta do filme. Os personagens são legais e bem construídos, principalmente a Sofia, que eu particularmente amei, com o filme dando uma boa enfase não só a ela, mas com seus cachorros também. E não podemos esquecer do próprio Keanu Reeves, que da vida e faz as cenas de maneira quase que orgânica mesmo estando \"acima da idade\" - não parece.A fotografia também não decepciona, a paleta de cores é linda e da um bom aspecto ao filme. Nada único, mas suficientemente agradável."}, {"rating": "9", "text": "In these repetitive days of cinema, john wick resembles a ghost in a ghostly cinema."}, {"rating": "10", "text": "Thank you john wick for undoing jason bourne's awful influence over action movies, without you there wouldn't have been netflix's daredevil,aquaman or wonder woman"}, {"rating": "8", "text": "Sign me up for a Chapter 4. This is one of my favorite trilogies of all time. What a fun thrill ride. A perfect roll for Keanu Reeves. Not a lot of talking, just butt kicking. Pure adrenaline from beginning to end."}, {"rating": "9", "text": "As usual this movie is the best you can see in this year! Everything is ok. Enjoy watching it."}, {"rating": "7", "text": "Just a great movie to zone out to and enjoy as a slick action sequence.  Dont watch this for anything other then a badass action movie."}, {"rating": "10", "text": "Giving 10 to how Keanu plays his character. And I love the involvement of Hae Berry. Giving 9 to how the story goes"}], "recommendations": ["john_wick_chapter_2", "john_wick", "the_bourne_ultimatum", "mission_impossible_ii", "the_bourne_supremacy", "mission_impossible_ghost_protocol", "kate", "quantum_of_solace", "nobody", "atomic_blonde", "the_mechanic", "boss_level", "creed_ii", "mission_impossible", "angel_has_fallen", "sherlock_holmes_a_game_of_shadows", "first_blood", "safe", "wrath_of_man", "den_of_thieves", "haywire", "run_all_night", "the_equalizer", "the_foreigner", "avengers_age_of_ultron"]}