{"id": 3785, "title": "John Q", "starring": ["Denzel Washington", "James Woods"], "runtime": 116, "genre": ["Drama", "Thriller", "Crime"], "description": "John Quincy Archibald is a father and husband whose son is diagnosed with an enlarged heart and then finds out he cannot receive a transplant because HMO insurance will not cover it. Therefore, he decides to take a hospital full of patients hostage until the hospital puts his son's name on the donor's list.", "releaseYear": "2002", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/xEE91LvXiqgs7Hmdl44LCzHtFf6.jpg", "categories": {"plot": 6.4, "acting": 6.055555555555555, "ending": 8.0, "soundtrack": 3.0, "cinematography": 8.0, "familyFriendly": 6.0, "funny": 6.0, "action": 5.0}, "reviews": [{"rating": "3", "text": "The directing has gone into overdrive with its message and use of music and scenery. And not in a good way, although the acting is good. The writing just feels tacked on and unoriginal."}, {"rating": "10", "text": "The underrated Denzel Washington, gives an Oscar worthy performance as John Q, a man willing to do anything to save the life of his son. This movie shows two things. How heartless the rich and powerful can truly be and how one man can make a difference. This is a powerful movie that shows how strong the relationship between father and son can be and just how important it is for every person in the country to have health care."}, {"rating": "8", "text": "I thought it was a good film. It does take a little to get into and its a little boring at first but in the end its well worth it. I really enjoyed it and I think many others would as well."}, {"rating": "4", "text": "\"oh dad, im a cute little boy who loves my family and now im sick, please feel sorry for me and make the doctors fix me\" - \"We dont have enough money son because I have a crappy job and the man is out to ruin our lives\" blah blah"}, {"rating": "4", "text": "A crowd-pleasing film that is shamelessly exploitative and manipulative. Denzel does his best, but his performance alone cannot lift a script so recklessly sappy."}, {"rating": "8", "text": "With great acting performances, an interesting (although highly unrealistic) story, and a very emotional ending, John Q is a very underrated drama. Even though it's a very cheesy movie and even though the message the movie was going for was everything but subtle, it's still worth a watch."}, {"rating": "4", "text": "While I liked the idea of the movie, and the message, I don't like this movie, first off Denzel Washington is the only tolerable actor I find, and the hospital takeover takes too long to get going and goes by too fast."}, {"rating": "4", "text": "Denzel Washington is no stranger to cinema, with notable movies he has done in the past that includes \"Malcolm X\", \"He Got Game\", and \"Training Day\". He is a man of steel for his most famous roles; for collaborating with director Spike Lee on multiple occasions, and even starring with A-list actors in a handful of his films. The same does not go for \"John Q\", who is a father of a son who is dying and needs a transplant as soon as possible.\r The movie starts out rather keen, with John Quincy Archibald (Denzel Washington) and his wife Denise (Kimberly Elise) see their son collapse at a baseball game. Their son is immediately taken to the hospital; it is not long until they find out their son has an enlarged heart and needs a heart transplant. Unfortunately for John and Denise, they cannot afford it. Being the heroes they are, John and Denise break down and are afraid they will lose their sons life. John's anger and rage comes out of him as he threatens a hospital, he locks down the hospital with eleven people with him inside the building.\r The whole \"Dog Day Afternoon\" scenario of the movie is the hostages themselves. They are all forced to follow John's orders and stay with him until his son's heart gets transplanted. Denzel Washington looks like he wants to play like Al Pacino's role from \"Dog Day Afternoon\", just looking very closely will become obvious. A handful of supporting roles come into play about thirty minutes into the movie, with actor Robert Duvall playing the chief of the local police station. We also get a few cameos by Ray Liotta and James Woods who only appear in a few shots unable to save the movie from more catastrophe.\r John Q is a likable character, along with his son and his wife Denise. Unfortunately, the other characters do not help and are only there just to keep the film reel rolling for its nearly two hour running time. Another thing that does not help is the screenplay, this story has been done before in previous movies where there have been hostages in a building or someone kidnapping. There is simply nothing original in this story, even if the film makers were trying to hide it.\r I did like Denzel Washington's strong performance, but I felt that the supporting actors were just there and not to actually try to make the movie better. Maybe this will find a perfect audience for some movie-goers who are looking to find a good-bad movie on television late at night. If that is not the case with some, then I do not know what is."}, {"rating": "1", "text": "One word to describe this movie \"Corny\". I got into this movie in for free, yet I felt like i should've got paid for watching it. My two friends like it. They thought it was a smart movie because they got the repetitive \"message\". But this is coming from a couple of bone heads thought \"Deuce Bigalow: Male Gigolo\" was a brilliant comedy."}, {"rating": "9", "text": "I'm a nursing student from the Philippines. I watched the movie not because it was my choice but because it was a requirement in our nursing program. At first, I thought that the movie was all crap, just like what most movie reviews says..But they are mistaken because for me, Denzel Washington deserved the award that he got after doing the movie(best actor) because it was so good..Call it corny or anything like that but also admit that these kind of things can happen in the real setting, especially if you have the kind of family that John Q. had, a not-so-well-off family.. There was even a part of the movie where in I have to get out of the room just so I won't make myself be a laughing stuff and cry in front of my classmates!!! It feels so good to be able to watch a good movie like this after 'beyond borders'... This should be how fathers dedicate themselves in taking care of thier children.... Keep up the good work guys!!!(for all the members and crews of this movie)."}, {"rating": "3", "text": "I'm pretty sure this was written as a comedy and then the director thought he could get Denzel two Oscars. It's the only explanation for a film this simultaneously ridiculous, preposterous, and incredibly earnest."}, {"rating": "5", "text": "The movie's message is heartfelt (no pun intended), and Denzel Washington gives a marginal performance, but there's something missing from John Q: Memorability."}, {"rating": "4", "text": "John Q. was a drama , where a family man becomes a murderer to save his son, who is between life and death , because the plot was very good but very loose expected to see but protruding the acting of Denzel Washington."}, {"rating": "8", "text": "This film exceeded my expectations, giving us a pleasant family drama around a son's illness and a father's difficulties in getting the treatments he needs because he can't afford them. In fact, the US is a particularly ungrateful country for people who, unfortunately, find themselves in need of expensive and ongoing medical care. The absence of a public health system that tends to be free of charge, along the lines of those in most of Europe, limits the care that is available to those who have no money, and makes private health insurance particularly powerful, to the point where they can decide whether it is worth paying for the treatment of someone who is sick and needs help. What this film does is fiction, but I felt that its story can find reflection in many stories of real people, if we look for them.In this film, John Quincy Archibald and his wife Denise must secure an urgent and very expensive heart transplant to save their son's life. It turns out they don't have the money, and health insurance refuses to cover the treatments. With the hospital already threatening to discharge the boy because his parents can't pay, John gives up on acting rationally and, in desperation, takes a pistol and barricades himself in the hospital's emergency room, with several hostages, including the heart surgeon responsible for his child.The film may seem exaggerated or melodramatic, but it manages to make us put ourselves in that father's shoes, making us think a lot about what we are seeing. That's what happened to me, at least, and it helped to make the movie more serious and uncomfortable. In the midst of all this, however, there are weaknesses: what bothered me the most was John's exaggerated kindness, really caring about not hurting the people he's arrested. That looks good, makes the character palatable, but it wouldn't work in real life. The way in which the hospital director changes her mind about including the boy on the waiting list for organs also seems forced, as do many other situations that arise during the film.Nick Cassavetes' direction proved to be effective, although not without flaws or criticism. The cast is led by a powerful and pleasant Denzel Washington, an actor who manages to give the character charisma and presence without losing a human touch. Robert Duvall works well in the role of a policeman in charge of negotiating with John, but he is far from having real relevance. The rest of the cast is average: Kimberly Elise just needs to cry and look grief-stricken, Anne Heche is worthy of our deepest contempt, James Woods just needs to look very hypocritical, and Ray Liotta says nothing more than a few cynical words.Technically, it's a standard Hollywood drama film, with a reasonable budget and a relatively middling set of production values. With competent cinematography and good filming locations, the film combines good editing and satisfactory sound work. It's not a film that stands out for its technical aspects, but it has what it takes to work."}], "recommendations": ["the_pursuit_of_happyness", "the_judge", "gone_baby_gone", "blow", "brothers", "the_descendants", "snitch", "the_town", "jobs", "fences", "manchester_by_the_sea", "live_by_night", "steve_jobs", "good_will_hunting", "dallas_buyers_club", "the_hunt", "falling_down", "flight", "collateral_beauty", "the_intern", "man_on_fire", "shot_caller", "promising_young_woman", "assault_on_wall_street", "donnie_brasco"]}