{
  "id": 341,
  "title": "John Carter",
  "starring": [
    "Taylor Kitsch",
    "Lynn Collins"
  ],
  "runtime": 132,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "John Carter is a war-weary, former military captain who's inexplicably transported to the mysterious and exotic planet of Barsoom (Mars) and reluctantly becomes embroiled in an epic conflict. It's a world on the brink of collapse, and Carter rediscovers his humanity when he realizes the survival of Barsoom and its people rests in his hands.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lCxz1Yus07QCQQCb6I0Dr3Lmqpx.jpg",
  "categories": {
    "plot": 8.6875,
    "acting": 7.857142857142857,
    "ending": 9.272727272727273,
    "soundtrack": 8.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 8.5,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Who would have thought that the highest professional critic score for a movie like John Carter would come from the Village Voice??  I thought I'd check this one out after reading about the massive loss that Disney would be taking on this film, wondering just how bad it could possibly be.  I was shocked to find how much I enjoyed it.  Other than the Dark Knight films and the first Matrix, I can't remember another superhero-style movie that kept me so interest during it's full length. It's immensely satisfying.  The marketing campaign - from the billboards, to the trailers, to the TV spots - revealed nothing of the charm of this film - and it has it in excess. The John Carter character and the double-pronged story are interesting as hell. The \"green\" inhabitants of Mars feel completely real to me - unlike any of the beings in the Star Wars prequels.  (If only Jar Jar Binks had been one of these suckers - or even the massive space dog - which I loved - The Phantom Menace wouldn't have been such a joke.) The romance between Carter and the princess is somewhat reminiscent of Han Solo and Princess Leia - if Leia kicked a ton of ass, that is.  I'd MUCH rather see this movie again than The Green Lantern, Captain America, Thor, Hulk, or just about any of these Marvel/DC films which felt so hollow. An easy recommendation."
    },
    {
      "rating": "8",
      "text": "This film has been receiving the most baffling bad reviews and after deciding not to see it because of them, I changed my mind and took a chance. Wow, am I glad that I did. I have no idea why some people have decided that big special effects automatically make a story bad. Whatever the reasons may be, I don't think I have disagreed more with critics on any movie so much, in recent memory, anyway. The story, the effects, even the acting save for a couple of scenes (and I didn't think Dominic West did a very good job either) were amazing. In my book, Andrew Stanton just hit it out of the park yet again. I'm definitely going to be paying to see this again, and that's including the ridiculous 3D IMAX price, too."
    },
    {
      "rating": "10",
      "text": "John Carter is an unjustly dismissed sci-fi masterpiece...grossly unjustified. What was wrong with it? Specifically, what was wrong? Pacing? It was intense!!! Coming from someone who uses this word sparingly, this movie was \"EPIC\". I am almost certain that time will enable objectivity, and objectivity will redeem it from the stinging taint slapped on it due to a predictably simplistic aversion to what is \"mainstream\" by film critics. If a studio other than Disney could have created the same film with half the budget it would have been heralded as a cinematic achievement within the sci-fi genre, but its budget was viewed as ostentatious and its production studio as childish, so it became \"cool\" to hate on it before anyone had even seen it. Who makes something and how much they pay to have it made has nothing to due with the quality of what is actually produced, it may be indicative of quality or lack thereof, but the final product speaks for itself. Reviews of John Carter tell us more about film critics than the critics told us about the film. It was practically perfect. \"Incomprehensible plotting\"??? They laid the groundwork for the presumed sequels by deliberately leaving a few questions unanswered, which I hope they still make and answer because I loved this first one! Mars was epic, and then in the end we are reminded that the story began on Earth and the film ends stronger than I could have hoped for! An excellent story masterfully told on screen."
    },
    {
      "rating": "10",
      "text": "It's the best BIG movie I've seen since Avatar. And when you keep in mind that the story was written about 100 years ago it makes the movie all the more impressive. And I thought since it was Disney that there wouldn't be much killing.....boy was I wrong. The story even had a twist or two that I wasn't expecting. Worth seeing. And worth seeing in IMAX."
    },
    {
      "rating": "10",
      "text": "I have never watched a movie that made me feel sad after I watched it because it was getting a bum rap.  I almost didn't go see it because of all of the bad publicity now I am glad I went. John Carter is a good film, fun, entertaining, funny and visually stunning. Strong interesting characters, good storyline. I blame Disney and its small mindedness for its failure. It is a fantasy film, it should be marketed as one. They should have never changed the name from John Carter from Mars, they should have hit up the fanboy network, and yes there are lots of fangirls out there too who would rock this movie in cosplay..  Disney opened the door and practically begged the critics to pan the movie.  The trailers sucked, there is a fan trailer on youtube that is fantastic which is 1000 times better than the lame ones Disneys put out. Give this film a chance, it is a fun ride and worth seeing."
    },
    {
      "rating": "10",
      "text": "What the critics missed was that this was not the wall-to-wall action-fest that Disney promoted -- it was a romantic sci-fi saga that remained true to the Edgar Rice Burroughs novels AND had wonderfully stirring action in support of that.  What I will remember most is the absolutely flawless pacing of the entire movie from beginning to end."
    },
    {
      "rating": "10",
      "text": "Fantastic looking movie with a wonderful story. The shame is that Disney sabatoged this movie before it was even released. For months leading up to the movie release a certain website advertised this movie as Ghosts of Mars. The travesty is that a bit of marketing could have saved it. It was a huge mistake not to push the love story or to include Mars anywhere in the title. There is a huge following of the books that probably overlooked it because they did not use \"Princess of Mars\" or \"John Carter of Mars\". It is a shame because now we will never see the others."
    },
    {
      "rating": "7",
      "text": "I wasn't expecting much but I was pleasantly surprised. I saw it in 3D and I think that did help. Totally crazy story and plot but to me that has to be a good thing when every other movie is a sequel or remake. At the same time it can't help but remind you off some sci-fi classics like Star Wars and Avatar, with a bit of Thor thrown in. Even some of the comedy moments work with a six legged dog! A few good action scenes but for such a big budget movie I don't think there are enough of them. Transformers is an example of too much action and this is an example of not enough. All in all worth a watch in 3D."
    },
    {
      "rating": "8",
      "text": "They really don't make them like this any more. Enjoyable from start to finish, those familiar with the books will undoubtedly get more from it - many plebs find names like Dejah Thoris and Tars Tarkas difficult to remember, credit to the film makers; John Carter doesn't appear to be motivated as a money-maker, isn't diminished for broad appeal and doesn't insult the intelligence. The story is modified slightly from the books (for those familiar with them) but is still, instantly recognizable. Reminds of cult classics like Star Wars, Flash, Dune, Willow, etc.  The work of ERB predates them all."
    },
    {
      "rating": "9",
      "text": "John carter is an amazing sci-fi/action adventure movie with a bit of cheese. It's got incredible special effects and 3D, very good action scenes, really good music, an awesome story-line (it's a little confusing at times), and good acting (mostly). I really recommend watching it, do it for Disney (they're losing money), let them make a sequel!"
    },
    {
      "rating": "10",
      "text": "The film is exactly what you expect going in. There is a decent plot supplemented by gorgeous backgrounds and the occasional action scene. Shakespeare this is not, but is a genuine good time with its mixture of humor, scifi, and western themes."
    },
    {
      "rating": "10",
      "text": "First and foremost, this film is a ton of fun, with characters you like that have some depth and soul - even the strange and wonderful aliens and monsters. It has great action, effects and a sweet romance at its core. Ignore the bad press and ignorant reviewers who think this copied \"Avatar\" or \"Star Wars\" - I'd like to know how a 100 year old story managed that little trick? Edgar Rice Burroughs \"A Princess of Mars\" may be 100 years old, but the creative team behind this gem of a movie has updated the story nicely while retaining what makes Burroughs \"Barsoom\" stories so wildly entertaining. Yes, it was an expensive movie to make - but it shows it all on the screen, and then some. This film is a nice throwback to better movie making, where actual sets were built and actual locations were journeyed to, creating a level of realism you don't see in films shot on green-screen sets. Do yourself a favor and see this movie: relax, let go and enjoy one of the most entertaining films in the last several years."
    },
    {
      "rating": "10",
      "text": "Fantastic movie, I absolutely loved it. I have read the entire works of Edgar Rice Burroughs and I believe he\rwould endorse this movie. The story was written in 1912 and the movie is a good rendition of the book.\rThe 3D and digital effects and film technology available today have made it possible to bring to life this\rgreat story by one of the greatest writers of all time. Tarzan, Journey to the Center of the Earth and other of\rhis stories have been made into movies before. I sincerely hope sequels follow as there are more novels\rin the series."
    },
    {
      "rating": "8",
      "text": "We saw the 3D version. It's a cross between Avatar, Star Wars...and Thor...I LOVED it!! IMDB rating 7.1 ....I think 7.5 is more like it.Don't listen to those who wanna give their \"not so expert opinion\" It was a great FAMILY movie!! I loved the story line....I loved the ending...I loved some of the characters...was never sold on any romantic connection between the leading man and woman...no spark...bit still...LOVED IT!  :)"
    },
    {
      "rating": "8",
      "text": "I don't remember a movie that I liked so much that was reviewed so poorly. It is not Casablanca but if you're in the mood for an adventure film with a solid story a really great special effects and aratsy visions of alien cultures,  this is it. It's a matinee adventure with classic hero/heroine/evil doers. The bad rap it has so universally received from paid movie reviewers is very  unfortunate and does not jib with the audience reaction, which has been predominately positive. . The movie deserves much better. I have seen a half dozen of this genre in the past year or so that were far less entertaining, Green Lantern, Percy Jackson. . and I'm a fan. . .to name only two.  Go see this movie. Drop your Andrew Sarris precious-ness, open the kid-part of your brain (if it still exists, and I hope it does) and you'll have fun. My 12 year old son and I both liked it a lot."
    },
    {
      "rating": "8",
      "text": "I am going to give this movie love because it deserves it. It also should be getting the box office numbers that The Hunger Games is currently getting. John Carter is a better film. It was a fun, entertaining time. The story, the direction, the acting, the effects work were all great. If you love SciFi, you should go and see it right now. It is possible that because of the horrible title and the horrible trailers this movie didn't do nowhere close to as well as it should have done. Also, who are there 50-70 year old men that are movie critics these days? Don't listen to them."
    },
    {
      "rating": "9",
      "text": "ItÂ´s a great movie, full of action, adventure, incredible landscapes, realistic creatures....and there is love. Anyone who loved Indy, Star Wars will love this movie. Dejah Thoris will rule forever."
    },
    {
      "rating": "10",
      "text": "The movie is fantastic, the story is very good and special effects are the best, actually when I saw it I thought it would be a success at the box office, not because it was not, I can only congratulate Disney."
    },
    {
      "rating": "8",
      "text": "I had no idea what to expect going into this movie. Now, I've got to say that I thoroughly enjoyed it and thought it was allot of fun. A really novel idea with some great effects and interesting characters. But if I have to gripe, I would say that the story feels like it was condensed a bit. This almost feels like they took three movies and condensed it down into one. I felt like there could have been more. I feel this movie would have worked better if fleshed out a bit more and perhaps done as a TV series or even a mini-series.\r Overall:\rJohn Carter is an enjoyable movie that just feels a bit incomplete. Otherwise still fun to watch."
    },
    {
      "rating": "8",
      "text": "I wasn't sure what to expect from this film but i enjoyed what i saw. it has a very throw back feel to it with modern efects . i kept thinking of the old flash gordon movie with all the queen music in it . it also reminded me of many other older films. it feels very simple and i would not say thats a bad thing in general since this is disney after all they are trying to make this family friendly . i know my 6 year old nephew really enjoyed it and over all i thought it was a pretty solid film . if i had to complain it would be the dry acting and weak dilouge in the film and also the pacing is abit slugish. over all though worth a see especially if you have kids who like SciFi films."
    },
    {
      "rating": "9",
      "text": "Typical storyline. But quite interesting... It reminded me of Star Wars a lot. (John Carter was written decades before Star Wars)"
    },
    {
      "rating": "10",
      "text": "I was very skeptical of this movie, I had read the plot of the books online and it sounded just too hard to accept.  Then the commercials did not really shine--they focused so much on action.  My father told me that the movie was great, watch it, and basically shut up on the criticisms til I had seen it.  He was totally right.  The richest parts of the film are the internal conflicts of the main character.  The flashbacks do a beautiful job of explaining so much in mere seconds.  Combine that with the civil war and lost causes and bam...great stuff.  The suspension of disbelief was quite easy and about 15 minutes in it was easy to accept this view of the solar system and forget all about rovers on Mars and what we scientifically know.  The final 15 minutes are a brilliant, simply brilliant ending with some twists that I won't ruin for you.  A must see!"
    },
    {
      "rating": "10",
      "text": "I just gave John Carter a 10 but after months of reflection. I grew up reading the Princess of Mars and in fact all of the books in the Barsoom series. They were transformative. I remember picking up the first one, probably out of order, as a child in the school library. I read about the Green Man from Mars and my life changed. So, I approached this film with huge skepticism and watched it with an eye jaundiced by what I perceived to be the Disney-fication of it. Meanwhile, I read about the marketing mess, the high budget, the overreach and the staleness (these were the critics and the Hollywood blogs). But no other film, short of perhaps one of the early Star Wars films, has touched me as when John Carter at the end whispers the incantation followed by \"Barsoom\". My God this was a romantic story. Not perfect, but on a scale of 1 to 10, it touched my heart and soul (or certainly the heart and soul of the little girl who first imagined the distant worlds and the fiery Princess and the brave John Carter and his friend, the Green Man Tars Tarkas) at the level of 10. Barsoom."
    },
    {
      "rating": "8",
      "text": "Is it a bit dated and corny, sure. But, that's what John Carter of mars was, and while the movie wasn't any Avatar, it was a fun show, with heart and nice effects. You won't need your copy of \"the scientists guide to alien technology\"; --- But, bring a large bag of popcorn, sit back, and prepare for a couple of hours of enjoyable vintage comic book style  science fiction / science fantasy. This movie is a romp, rather than an epic... and it was far better than we expected going in."
    },
    {
      "rating": "7",
      "text": "Far from perfect but still manages to entertain. \"John Carter\" starts off unbelievably slow and almost as dry, barren, and lifeless as Mars itself. But it does manage to quickly pick up the pace. Featuring fantastic special effects and an enjoyable, if sometimes stale, plot. The action is satisfying and the cast great. Other than the slow opening this movies flaws are with a predictable romance and the main characters lame backstory. But these flaws don't manage to ruin the movie when it's firing on all cylinders. With humorous moments and great action scenes the movie succeeds at being an enjoyable experience, even if it's not what I would call a great movie. The main character's powers are what gives the action scenes an edge. Watching \"John Carter\" leap through the air like Marvel's \"Incredible Hulk\" is constantly entertaining, and put the feats of enhanced strength put the new Superman movie to shame. So overall \"John Carter\" is an enjoyable experience, but it does have some issues holding back from greatness."
    },
    {
      "rating": "7",
      "text": "John Carter was surprisingly a fun filled ride from start to finish. Not sure what the hate is all about and why Disney could lose so much money on this venture. It was a tough book to adapt to the big screen, but I think it was done fairly well."
    },
    {
      "rating": "7",
      "text": "the movie is worth seeing.  plain and simple.  Avatar did the same type of thing better a couple years ago and unfortunately a big part of being successful is getting there first  (no matter when the material originated)"
    },
    {
      "rating": "9",
      "text": "Having read such negative reviews from the critics, I was unsure if I would drop $20 on it. I had some cheap tickets and thought it was worth a risk. i am so glad I did. Thoroughly enjoyable spectacle, I enjoyed it immensely.Well made, well paced, great story...just don't expect it to be a masterpiece of cerebral film-making that the critics and the pretentious gush over."
    },
    {
      "rating": "8",
      "text": "Going into the movie, I was questionable about the movie and my friend was all about the movie. Afterwards, I enjoyed it and he questioned it. Maybe it was my expectation thinking that it was going to feel like a Star Wars Episode 1-3 type of movie is why I ended up liking it. I don't know if I would go back for the IMAX 3D... but it looked great there. Only real complaint is the theater played 35 minutes of previews... too much."
    },
    {
      "rating": "10",
      "text": "As a person who plays many many computer games, I was not expecting to be entertained as much I I thought I would when I wen to see this movie. Now I have not real the Novels but I was taken aback by how well this movie had been put together, the visual effects are rather excellent, the characters meaningful and true to human nature.\r From what I gather this movie is not true to the original story but this tends to happen and I think the story is true and particularly well put together.\r I would certainly recommend this movie to almost everyone even, I went into this movie purely to just \"see a movie\" and I came out extremely happy with my choice."
    },
    {
      "rating": "6",
      "text": "Disney's John Carter seemly doesn't have many original ideas, but what you've got to remember is that the source material the film is based on pre-dates all the movies this film appears to be referencing - it's a bit of a paradox really. You feel like you've seen it all before, but everything is executed extremely well. Visually, John Carter is superb, with some of the best sci-fi action since the Star Wars prequels. Taylor Kitsch's star is on the rise, but perhaps he isn't the best actor to lead a film, as excepting one notable scene that makes very effective use of juxtaposition, he is rarely able to demonstrate much emotional depth to the titular Carter, but he can certainly handle the physical demands of the role. Lynn Collins manages to emotionally ground the whole film and Mark Strong makes another effectively creepy villain. Unfortunately the usually brilliant Ciaran Hinds and James Purefoy play pretty much exactly the same characters they did in HBO's Rome, and Dominic West's performance is pedestrian at best. The film makes use of some hugely convenient plot devices to avoid slowing the story, the script is so-so, and many of the key characters' motivations remain annoyingly unclear throughout. I'm also yet to decide whether the framing device for the main story on Mars works or not - is it clever and unusual, or just tonally misjudged? You end John Carter with a feeling that you've only just scratched the surface of this rich world, and I sincerely hope that the film makes enough money to justify a second installment, as a great sequel has been set up, a sequel which wouldn't require anywhere near as much clunky exposition, and in which we might be allowed to finally learn what on Earth (or Mars) Mark Strong's villain is trying to achieve."
    },
    {
      "rating": "8",
      "text": "Looking at the critic reviews,  the Positive and Average far outnumber the Negative ones so I really do not understand why was this received negatively. I think $175 mil box office sounds successful only until you consider what it cost to make.  However this film has just started to come out World Wide on Blu-Ray and Dvd and I think it will still be a great success. I saw this film with wife and children and everybody loved it. I thought it was very entertaining movie and Taylor Kitch was good but it was the gorgeous Lynn Collins, the Wolverine squeeze, who stole the show. James Purefoy, of the sadly US shunned Solomon Kane, was also great.  A great fantasy adventure movie, not for the Woody Allen fans, probably."
    },
    {
      "rating": "7",
      "text": "John Carter is an experience worth experiencing and it is most definitly not a bore. However the film does have it's faults. This film seems rushed by thedirector. The editing is sloppy and many things in the film that seem like large and key pieces to the plot are rushed when there are 2 minute long scenes of drama that ultimately does not affect the viewer. Too bad because the film had many scenes that are so well done but when i think of this film i will only be able to think of it's faults."
    },
    {
      "rating": "8",
      "text": "A good made movie that showcases some really good effects and action as well as not forgetting emotion in its plot, Jhon Carter is a good experiance that will suprise a lot of people looking for a blast of fresh air in story telling and action, though its length and pacing could be a bit better the movie entertains nonetheless"
    },
    {
      "rating": "10",
      "text": "I went into this movie with my family not expecting too much for what I was gonna see. We just wanted to see a cool movie in the theater because we hadn't been to the movie theater for a long while, up until March. Let me tell you though, I thought this movie was very surprising. My family and I have never read the book of John Carter on Mars, so that might be why I was surprised by how the story turned out. All the sort of alien creatures that John Carter meets, are awesome. The acting involved with the aliens are quite believable. The plot is well told as well, and with a good supporting cast, it makes for some good dialogue. Okay maybe not outstanding dialogue, but it is well done. My point is, if you go into this movie not expecting much out of it, and maybe if you haven't read any info or read the book, except maybe seeing a trailer or TV spot, than you'll probably be quite surprised by John Carter. So the verdict on this movie I give John Carter, a 8.1 out of 10. Now it's not the most amazing movie I've seen, that's for sure, but it is quite good."
    },
    {
      "rating": "10",
      "text": "Great movie for the whole family. John Carter is a funny, action packed movie. Yo will enjoy the time spent on the script, and effects. I watched it with my parents and they laughed more thank I did."
    },
    {
      "rating": "6",
      "text": "A little bit slow at the beginning it starts a good pace at the middle end of the film. As many people say, when you go to see some films, you enter with some expectations, and for me this was suposed to be a super-action adventure non-stop film, but despite the fact it was a pretty average film I wouldn't recommend watching it it beyond a BR/DVD release."
    },
    {
      "rating": "10",
      "text": "I was thinking this movie would stink when I took notice of the critics reviews but It wasn't. In fact, it makes up for a nice and entertaining fantasy story with a twist in the ending that holds your breath to the very last minutes. Indeed a nice movie, I enjoyed watching it. This does not contain a juggled story like Avatar with an \"okay usa!\" feeling."
    },
    {
      "rating": "7",
      "text": "Having just recently just read the books in preparation for this release I was really excited to see this movie. The character work was well done. The special effects were amazing. The story line staggered at times. But with all of it's supposed short-comings, I felt that this was a very cool movie. I will agree that this movie could do with a directors cut when it comes to the DVD/Blu-ray release only to address some of the finer story points that I felt could do with some further exposition."
    },
    {
      "rating": "7",
      "text": "It wasn't great but it WASN'T bad either.  I actually enjoyed seeing JC brought to the big screen.  It was an ambitious undertaking.  If you are a JC fan, go reward yourself."
    },
    {
      "rating": "8",
      "text": "Well, I went this week to see â"
    },
    {
      "rating": "7",
      "text": "I was sceptical about John Carter from the minute I saw the trailer. It looked like James Cameron and George Lucas had brainstormed a science-fiction film together. But then I saw Andrew Stanton's name in the credits and decided to give it a try. It wasn't great.- the acting was flawed, there was some choppy cinematography and the story didn't flow so well- but it was enjoyable. Not perfect, but fun all the same."
    },
    {
      "rating": "9",
      "text": "John Carter has a good story and even though its a full 2 hours it never gets boring which is a real achievement these days.  The setting and its aliens and red humans are interesting and most of the CGI is very good. It totally overdoes the jumping thing in the 1st half of the movie but it looks good and there are good battle scenes."
    },
    {
      "rating": "8",
      "text": "Probably one of the more underrated films I've seen in a while. Sure it doesn't have A-List actors, wildly intense nature scenes, or the greatest plot, but I found the movie quite enjoyable and very underrated. While the plot is somewhat cliche (you got the tough reluctant hero with the hot damsel in distress), you can't help but enjoy the subtle fun this movie brings. I found the portrayal of the characters to be very fitting; John, a rough southern confederate soldier going through a hard time after the loss of his family. The female lead was okay, script made her seem a little naggy. The CGI, while not as visually stunning as other movies, brought a believable Mars atmosphere (if it were inhabited by civilization). I think the critics looked at the price of the movie, and expected something on the level of Avatar. And because no one knew what John Carter was really about was probably why it didn't do as well in theaters. I'd even argue the Disney name might have hurt this movie. But I found this movie very enjoyable and encourage people to go out and see this movie if you are into the action/adventure genre."
    },
    {
      "rating": "9",
      "text": "Had a lot of fun with this one, which I've been waiting for ever since I read the books as a young teenage boy. Don't listen to the naysayers, John Carter is a good time to be had at the movies. Good old school Sci-Fi adventure!"
    },
    {
      "rating": "8",
      "text": "The \"official\" Critics are too low for this one! Much love and care went into the making of this movie, and it shows.Despite some over-acting in the beginning scenes and quite some illogical/inconsistent \"physical\" stuff this is a total fun-ride and very worth to be watched on the big screen.Great visuals, good humour, well-done action and many nice little twists included, it's one of the best popcorn-movies I've seen in some years. *Not to forget: the score by Michael Giacchino is marvellous*"
    },
    {
      "rating": "8",
      "text": "I am a fan of the original books and was looking forward to this film.  I don't understand the low critic reviews, I really liked the movie.  My only complaint would be that the character relationships didn't seem to develop enough for m tastes, so certain character motivations seem questionable at points.  Overall good though!  Effects, design etc all above par."
    },
    {
      "rating": "9",
      "text": "I watched this movie in 3D and really liked the special effect and the kind of imagination the created. I liked the characters and aliens that were statistical. Really good movie and worth the money.."
    },
    {
      "rating": "9",
      "text": "My wife and I had a great night at the movies with this film. I read the books when I was around twelve, was anticipating a great movie, and was not disappointed. I am surprised that some of the reviews lead one to believe that this film was influenced by \"Star Wars\" and \"Avatar\" when in reality those films were influenced by the John Carter series of books."
    },
    {
      "rating": "10",
      "text": "A fun and fantastic adventure story. Wonderful, imaginative settings and characters, and it feels like a return to the fun romps of Star Wars and Indiana Jones- back when they were good!"
    }
  ]
}