{
  "id": 1271,
  "title": "Johnny English Reborn",
  "starring": [
    "Rowan Atkinson",
    "Gillian Anderson"
  ],
  "runtime": 101,
  "genre": [
    "Crime",
    "Adventure",
    "Action",
    "Comedy",
    "Thriller"
  ],
  "description": "The most prominent heads of state in the world begin gathering for a conference that could have a major impact on global politics. When MI-7 receives word that the Chinese premier has become the target of some high-powered killers, it falls on Johnny English to save the day. Armed with the latest high-tech weaponry and gadgets that would make even James Bond jealous, the once-disgraced agent uncovers evidence of a massive conspiracy involving some of the world's most powerful organisations, and vows to redeem his tarnished reputation by stopping the killers before they can strike.",
  "releaseYear": "2011",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1T6qnlTVkrGr0mpgZbpSwVU5FWW.jpg",
  "categories": {
    "plot": 5.344827586206897,
    "acting": 5.357142857142857,
    "ending": 5.4,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.75,
    "funny": 5.746666666666667,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Johnny English Reborn is a hilarious and action filled film, but isn't as good as its predecessor. The film begins well and hilariously (and cringe-worthingly), but the film slowly gets slightly worse and worse, until the climax around the world  where the quality and hilarity of the film reaches its peak. Rowan Atkinson does a great job as Johnny once again, and the other actors do pretty well playing their roles. This film isn't lacking action, as it's like an explosion spread across the whole film; and it certainly isn't lacking comedy either, the comedy is best described as a huge nulear bomb being let off during the start, then letting of funny gas  this 'funny gas' reaches its peak of 'hilarity' during the climax. The story of this film is just as silly  and great  as its predecessor's. It's just that the gags and action frills of this film didn't make me laugh anywhere near as much as I did the first time I saw the first film.\rSo I give this film a... 86/100!"
    },
    {
      "rating": "9",
      "text": "Johnny English Reborn is a love it or hate it movie. Some people won't like the humor, some people will. Personally, I almost couldn't stop laughing. Johnny English and Johnny English Reborn are one of my favorite movies of all-time. Yes the jokes are predictable but that's what makes them so funny in my opinion. I rate this movie a 9/10 because the first movie was better, especially the interaction between Johnny English and Bough made it so great. This movie is a bit more over-the-top and sadly Bough is missing here. Still a 9/10 is a good score and this is a must see movie for all Johnny English fans."
    },
    {
      "rating": "3",
      "text": "Johnny English is back and unfortunately not for the better. I found the the original surprisingly funny therefore its a great shame the sequel is a massive disappointment. Since the first film English has been dismissed from MI7 after a disastrous mission in Mozambique but is brought back to MI7 to prevent a group of international assassins from killing the Chinese Premier and causing global chaos. The original was far from the funniest film ever made but provided some genuine LOL moments. Sadly, Reborn rarely has you break into laughter or for that even crack a smile! Don't get me wrong there are some, very few, infact they are few and far between funny bits but it fails to sparkle and fizzels out to be a dreadfully dull movie. The fact is the film tries to be funny and provide funny moments but its just an epic fail, simple as that. For any fans of the original trust me when I say stick to that because Johnny English Reborn isn't a patch on its predeccesor and even that wasn't the funniest of films, tells you everything you need to know. As a fellow reviewer said; painfully unfunny, and that sums this film up to a tee!"
    },
    {
      "rating": "10",
      "text": "This is the funniest movie I have ever seen! It is original with its skits and everything, and there is one point in the movie that I think I will remember for all of my life. Please watch this movie, its so original."
    },
    {
      "rating": "5",
      "text": "Recommended to watch together with children under the age of 10 years old.  The jokes will be very much up their street and their heartfelt laughters  will invariably make a difference to your outlook on this film.  If you have no children or cannot borrow some for an hour and a half, don't bother."
    },
    {
      "rating": "5",
      "text": "I thought it was fairly funny in some bits. A lot of the funny bits however had already been shown in the trailers. Otherwise it was fairly funny but not funny enough that I would watch it that many more times. It really depends what your type of movie is. If you really liked the first Johnny English you might like this but it not better than the first one. If you did not like the first one you will probably not like the second one either. I liked the first one but this one was just ok, so liking the first one does not guarantee that you will like this one. It still was entertaining but nothing close to a master comedy or master film."
    },
    {
      "rating": "5",
      "text": "Entertainment wise it is good, nonetheless the story is repetitive like the first film; good thing is I intended to have a very low expectation about this film, so I'm impress and entertain. You''ll laugh at almost part but the story is not as good (structure) as the first one. I am not saying it is bad, what I am saying is that is doesn't compare to the first movie. There is no sequence between the movies, but there are no time line errors, which is very good. Overall, this film is very flat and dull. Granted the humor is good at points, and some of the special effects are fun, but more often than not you're given boring dialogue, ridiculous story with many plot holes and flat acting that is uninspired and just not humorous; but I'll still entertain and happy what I've spent in theater."
    },
    {
      "rating": "1",
      "text": "Johnny English Reborn - Skip-it - New This Week - Unless you are a die-hard Mr. Bean fan (which is a whole other issue) you will think this Rowan Atkinson spy comedy is painfully unfunny."
    },
    {
      "rating": "0",
      "text": "Worst comedy ever. Stupid jokes, people falling... Really pathetic evon for Johnny English standard. There are so many better comedies out there that its a pitty to watch this one"
    },
    {
      "rating": "8",
      "text": "He's back... and better than ever. The plot is interesting. Rowan Atkinson is brilliant, as his character is both funny and fascinating (to see what next blunder he'll make). I love it how he fits perfectly as an alternate James Bond, if he would have that extra of bad luck around him. If you loved the first movie, any Mr.Bean movie or anything that just involves Rowan, go watch the movie right now! You'll have a blast."
    },
    {
      "rating": "5",
      "text": "I found this to be a very disappointing sequel. It still manages to provide some laugh out loud hilarious moments. Unfortunately it's nowhere near as funny as it's predecessor. Much of the humor ends up falling very short of the mark. The plot just ends up being filled with familiar twists that we've seen time and time again in the serious spy movies. All in all I don't recommend this for a watch, even if you were a fan of the original. I found myself saying \"wow that was stupid\" way more than I was saying \"wow that was funny\". To me that's the sign of a lackluster comedy."
    },
    {
      "rating": "4",
      "text": "There's laugh out loud moment and also the corny ones. Funny, how this movie works. The movie itself undeniably awful. Not Rowan Atkinson fan? You should forget it."
    },
    {
      "rating": "8",
      "text": "Honestly This Is A Good Movie, But It Wont Win Movie Of The Year! I Think The Whole Movie Was Good, No Scenes Really Made It \"Bad\" The Acting Was Really Good! :D"
    },
    {
      "rating": "2",
      "text": "An absolute horrific film that fails on every single one of its ambitions and thats not very much to begin with. English is a unfunny horribly acted directed and written. Im agonizing while righting a review on this film because I already lost an hour and a half of my life watching it so I wont go into full deatail of it's awfullness"
    },
    {
      "rating": "10",
      "text": "I watched the movie in a cinema during it's premiere with my family.When we watched, I can literally say everyone, including me in the cinema cracked up. We couldn't stop laughing. This is certainily a great sequel and I loved this film."
    },
    {
      "rating": "6",
      "text": "Johnny English Reborn is all about the amazing Rowan Atkinson . He was as amazing he always is and super funny . Without him This film would get 0 . Except Rowan Atkinson most of the things in this film sucks . The Story was so bad . Except for Rowan most of the Actors wasn't good at all . Oliver Parker should stay with St. Trinian's . Soundtracks was 50-50 . So Overall Johnny English Reborn is Rowan Atkinson Rowan Atkinson Rowan Atkinson ."
    },
    {
      "rating": "8",
      "text": "Johnny English Reborn - is exactly what you expect in case you have watched its predecessor. Its fun, its both smart & silly simultaneously, it doesn't put too much pressure on your brain and ... it has Rowan \"Mr Bean\" Atkinson! The first part was funny, but still was lacking the Clouseau or Get Smart effect. However, this part adds the missing edge perfectly and puts Johnny in the race with Austin Powers & fellow Spy spoof-ers (though not a close one yet!) successfully.Rowan is excellent as the over-confident dumb-wise Spy. The movie doesn't make you laugh continuously, but it has its moments, a lot of them! Johnny is on a Shaolin or similar monastery, refining himself both physically & philosophically, when he is called back by MI7 to prevent the predicted assassination of Chinese Premier. While investigating that (and failing miserably), he finds out that this has a connection with his last mission in Mozambique, which was a disaster and the sole reason for his suspension. Can Johnny figure it out before the Premier gets killed? Is Johnny wiser than before? Does Johnny know what he is doing, at least a little more than before? Watch the movie to find out - won't be a terrible loss, I promise."
    },
    {
      "rating": "3",
      "text": "I enjoyed the first movie. It was just the way I imagined Rowan Atkinson as a \"spy'.The sequel is a mistake, though. 3 or 5 laughable moments just aren't enough. It's the same thing all over again. I just didn't buy it. Just as I wish I hadn't bought those damn tickets for \"Johnny English Reborn\". It just wasn't worth it."
    },
    {
      "rating": "6",
      "text": "Before I started to watch the movie I knew it was not going to be as good as Johnny English 1. I wasn't surprised. Some laughs, but nothing hilarious. Not disappointing as I wasn't expecting much."
    },
    {
      "rating": "10",
      "text": "This movie was decent. The chinese lady made me lol. I havent seen the original so I dont know how this compares with it. But in the context of all action movies this is good."
    },
    {
      "rating": "6",
      "text": "Johnny English Reborn is a silly yet fun spy comedy that will appeal to fans of James Bond, Mr. Bean and the first Johnny English film. The film will make a great time if you are watching it with friends or family."
    },
    {
      "rating": "4",
      "text": "Perhaps slightly better than its predecessor, this sequel still remains mostly dull. It tries to be an intense spy movie, but all we're getting is a silly, tired spy comedy."
    },
    {
      "rating": "0",
      "text": "A disappointing sequel to Johnny English, the plot and the jokes are weak. The movie is so bland and is trying to be serious from time to time, sometimes too serious so it ends up getting awkward. The jokes in this movie aren't funny at all they are just cheap and stupid. The same goes for the new characters in this sequel, they are not humorous just boring and serious. This movie should never have been made."
    },
    {
      "rating": "6",
      "text": "Johnny English Reborn is funny and inventive with another hilarious performance from Rowan Atkinson. Not as funny and memorable as it's predecessor but still a riveting time."
    },
    {
      "rating": "9",
      "text": "I really loved this movie, with classic humour. You gotta love it. The chinese cleaner that comes back all of the time is also very funny. This movie is an absulute 9."
    },
    {
      "rating": "8",
      "text": "This film is so godlike. There's so many references to James Bond, and it's got great comical value. Truly, the role of Jonny English couldn't have been played by anyone other than Rowan Atkinson. It's definitely funny and not story-heavy. They could've done more to make it an even more hilarious parody but it's certainly a good laugh. The only thing lacking is story, which in a film is arguably the most important aspect."
    },
    {
      "rating": "4",
      "text": "I am a massive fan of the first film but disliked this one. It is more in the vein of Daniel Craig's Bonds rather than the old Bonds, (which is what the first film was based on, since it came out in 2003). As such it has to include a lot more complicated elements, which means there is more time devoted to plot twists and ergo serious moments, rather than a simple story which leaves a lot of room for comedy (as the first one did). In addition, the comedy seems quite lazy and I did not find it very funny. The is mostly due to the fact that in this film Johnny English is actually good at combat, so it means there's not much room for the type of physical comedy Atkinson is great at."
    },
    {
      "rating": "6",
      "text": "The story is somewhat unorganized, but it makes up for it with great humor. The acting is mostly convincing. It could have been better storywise, but its a fun little treat."
    },
    {
      "rating": "5",
      "text": "Pretty much the same as it's predecessor, a few laughs but underwhelming. Should be funnier."
    },
    {
      "rating": "8",
      "text": "I love Rowan Atkinson. I love his style, his acting. Obviously I find Mr Bean and Black-adder to be great programmes. Then Johnny English came in 2006 and I found it amusing, however, it was a bit too silly. I watched Johnny English Reborn with an 8/10 in mind and after watching it I think it deserves that. It did start to drift somewhere in the middle of the film but there were some truly epically funny scenes. After watching the deleted scenes, I think that they all should have stayed and if they had then I would have definitely given this film a 9/10"
    },
    {
      "rating": "7",
      "text": "Far better than you'd expect it to be. Watch it as a double feature with a real Bond movie - but don't watch Reborn first or you won't be able to take Bond seriously. A very funny film. I don't like the first movie that much, but Reborn is very good - just like Bean 2 was better than Bean."
    },
    {
      "rating": "9",
      "text": "This film is super funny!!!!! I'm sure you cannot stop laughing till the end of the movie. I do recommend you this movie. It's not long movie like 2 hours or more, so if you have time little, you can enjoy this movie!!!!!!!"
    },
    {
      "rating": "4",
      "text": "Jhonny english reborn is a good film but not that good it was a huge dissapoint compared to the first one which was full of comedy. This one however was not I found it had good moments and bad moments and every now and then it had boring moments. If you expect this to be as good as the first one or better ,which I did, then u r most likely to be dissapointed."
    },
    {
      "rating": "10",
      "text": "Johnny English Reborn is a very funny, action-filled, great story, a sense of mystery film. Really funny and very nice combats. This movie is the funniest movie I have seen so far. I would definetely give it a high score."
    },
    {
      "rating": "7",
      "text": "A surprisingly funny comedy. Roman Atkinson proves once again that he knows how to do satire, and for spy fans, this is what you've been wanting. With some well crafted action scenes comes impeccable comedic timing that makes you laugh for minutes on end. I just wish the movie didn't resolve a conflict through a drawn out and pretty awful speech."
    },
    {
      "rating": "1",
      "text": "This is one of the dumbest movies i've ever seen! Horrible acting and storyline! I really regret i spent 90 minutes of my life watching this. Respect for R.Atkinson though"
    },
    {
      "rating": "10",
      "text": "All I expect from Rowan Atkinson is comedy. And I have to say he totally EXCEEDED my expectations. Although at times the jokes were corny, I couldn't help laughing. It was pure brilliance."
    },
    {
      "rating": "6",
      "text": "While I think this is a slight improvement over its predecessor and ,sometimes, it provides a few laughs, Johnny English Reborn nonetheless isn't quite refined as the other comedy movies."
    },
    {
      "rating": "8",
      "text": "A fun, family-friendly comedy that feels like a combination of Austin Powers and Ernest P. Worrell.\r Watch this movie here for free http://www.watchfree.to/watch-299ecd-Johnny-English-Reborn-movie-online-free-putlocker.html"
    },
    {
      "rating": "8",
      "text": "WHAT I LIKED: Better than it's predecessor, 'Johnny English Reborn' loses (some of) the stupidness of the first. Thus we can relish in the humour when it's there, but still have care for the improved plot and supporting characters\rWHAT I DIDN'T LIKE: It's nothing particularly inventive and Rowan Atkinson isn't utilised to his full potential, but for what it is it's pretty good\rVERDICT: A great spy spoof that will have you laughing throughout. This improves well over it's average predecessor."
    },
    {
      "rating": "6",
      "text": "This is a sweet indulgent farewell sorta return to the comic masterclass that is Atkinson and his silly, hilarious antics that are perhaps an art form now. Also with some goofy roles by Tim Mcinnervy, Rosamund Pike, Gillian Anderson, Dominic West and Daniel Kaluyaa (Black Mirror & Get Out), the funny and flimsy take on the British spy films and cult of Atkinson is rather good for passing time."
    },
    {
      "rating": "5",
      "text": "I have mixed feelings about this one. The movie is way too inconsistent with its tone and humour. Half of the jokes are really witty and funny. The other half is just silly goofiness we see coming a mile away. It felt a little bit long at the end. But overall, it was too predictable and inconsistent. A lot of missed opportunities."
    },
    {
      "rating": "6",
      "text": "The movie was really funny but also made us really nervous about what was going to happen."
    },
    {
      "rating": "5",
      "text": "This is a mildly amusing action/comedy film and a sequel to the original Johnny English film. The comedy is slapstick, thus very much visual based. For anyone who hasn't seen the original 'Johnny English' film, this is like a cheap comedy spoof of a James Bond film. The comedy is pretty basic, you could say childish, such as one scene whereby his swivel chair keeps lowering to the ground and the other characters, trying to hold a serious conversation, have to act like nothing is going on. Johnny tries to come off as cool, calm and sophisticated, while other characters take advantage of his bumbling nature. Most of the plot is fairly thin, although, to be fair, this is definitely the kind of film which is intended to be watched as a bit of entertainment, not to be thoroughly analysed, put it that way. The film has a total running time of an hour and forty minutes, so its a relatively short film, by todays standards and although some of it was a bit cringey, other scenes were so outlandish and made me chuckle, so I can say I found it entertaining.The musical score is quite good, in that it sounded quite slick, with pieces played during key fight scenes and other tense action scenes, giving it a more authentic James Bond type feel to it, if but momentarily. Character wise, Simon Ambrose (played by Dominic West) probably comes across as the most sophisticated - with charm, charisma and plenty of confidence. Gillian Anderson plays Pamela, the head of MI-7, someone with deep reservations about having to resort to bringing Johnny back, after the disaster that was the result of his last work mission. Rosamund Pike plays Kate Sumner, Johnny's love interest, while Daniel Kaluuya plays Johnny's younger partner, agent Tucker, a rather impressionable and inexperienced spy but still one who seems to foresee Johnny's pratfalls (pardon the corny word-related-pun).Of course Rowan Atkinson (or Mr. Bean fame) plays the main character, Johnny. His face appears almost rubber-like, with various fast twitchy facial expressions and the like being clearly visible.This film can be watched without having seen the original film but it does also contain plot elements which relate to the prior film. I have seen the original film but that was numerous years ago, yet I felt I had a decent understanding of roughly what was what. The story is pretty silly, well obviously most of the film is quite silly but then it is primarily a comedy, with action scenes/elements to it. As a parody spy film, which is the other fairly obvious genre I'd classify this under, its not too bad. As daft and unbelievable as the plot certainly is, I still felt quite tense at times and was keen to keep watching to see how the story panned out, what became of certain characters and the like. This film features some impressive panoramic shots, so its worth seeing on a big screen I reckon. There are some fast paced chase scenes which I quite enjoyed too. I'd say that generally speaking the plot pace is fairly slow, although it certainly does speed up more towards the end.A part of me felt that there was a slightly stereotyped element to the characters, in as much as the mastermind villain being an English character (not Johnny but I won't say who) and another of the baddies is a Chinese lady, who reminded me of a character from a James Bond film. Still, it is a fairly watchable, if unmemorable and cliched film. I think it depends on your sense of humour and how much you tend to (prefer to?) analyse films, plus whether your primarily looking for a decent drama or thriller film, compared to more of a parody comedy based action film - obviously if its the former then your unlikely to think much of it but this was never intended to be a serious spy film, I'm pretty sured it wasn't marketed as such, so it'd be unfair to judge it as one (in my opinion).No, I don't think I'd specifically recommend this film - its amusing and somewhat entertaining but it certainly isn't particularly memorable and neither does it have a great plot. The slapstick comedy is amusing and I felt fairly engrossed in it, in as far as wanting to see what the outcome was for certain people and to see how ludicrous the plot ended up being. If you don't take it seriously and are just looking for an easy watch to pass the time, then you could do worse than this but there are both better and worse films around."
    },
    {
      "rating": "8",
      "text": "Johnny English Reborn is the best comedy film, Released in 7 October 2011, it stars Rowan Alkingon an English actor comedian and writer . He's really funny in this film .I love this film because the plot involves the stupidity of Johnny English from the start of the film , and after that a lot of funny situations .The film is set in London city in the UK and the soundtrack is very interesting , performed by English singer .I've watched it many times, I'am really laughing every time I see it .I would highly recommend Johnny English Reborn the film is amazing and because it will make every one happy and laugh and spend good time with my family and friends to watch it together  ."
    }
  ],
  "recommendations": [
    "hot_fuzz",
    "johnny_english_strikes_again",
    "pitch_perfect_2",
    "the_wedding_ringer",
    "the_three_stooges",
    "johnny_english",
    "scary_movie_3",
    "deadpool_2",
    "scary_movie_4",
    "pineapple_express",
    "mortdecai",
    "identity_thief",
    "the_dictator",
    "anchorman_2_the_legend_continues",
    "30_minutes_or_less",
    "ted_2",
    "22_jump_street",
    "deadpool",
    "this_is_the_end",
    "eurotrip",
    "scary_movie_2",
    "zombieland_double_tap",
    "the_watch",
    "zack_and_miri_make_a_porno",
    "jackass_presents_bad_grandpa"
  ]
}