{
  "id": 4333,
  "title": "Johnny English Strikes Again",
  "starring": [
    "Rowan Atkinson",
    "Emma Thompson"
  ],
  "runtime": 89,
  "genre": [
    "Action",
    "Adventure",
    "Comedy"
  ],
  "description": "Disaster strikes when a criminal mastermind reveals the identities of all active undercover agents in Britain. The secret service can now rely on only one man - Johnny English. Currently teaching at a minor prep school, Johnny springs back into action to find the mysterious hacker. For this mission to succeed, he’ll need all of his skills - what few he has - as the man with yesterday’s analogue methods faces off against tomorrow’s digital technology.",
  "releaseYear": "2018",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tCBxnZwLiY1BOKw3tH6AxHZdqPh.jpg",
  "categories": {
    "plot": 6.388888888888889,
    "acting": 5.933333333333334,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 7.0,
    "funny": 6.1875,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Really enjoyed this movie, I've been a longtime Rowan Atkinson fan since he his Blackadder days & familiar with the other Johnny English Films."
    },
    {
      "rating": "5",
      "text": "In a world filled with serious and kick-ass James Bond’s and Ethan Hunt’s, especially after the expectedly explosive summer blockbuster season and approaching the very serious fall award season fair, one man and one film aims to give audiences the laugh-out-loud moments and gags everyone deserves. Johnny English Strikes Again may be a Rowan Atkinson vehicle for a once applauded physical-comedy actor to cash a cheque in a cultural landscape where audiences are obsessed with uber realism and knock-your-socks off action, but the placement of the newest English film may be the spy’s most daring mission yet. What is the third (and perhaps final) entry of the spoof spy series, Atkinson returns in his second most memorable role as a spy with no clue as to what he is actually doing. Call it luck or being surrounded by the best company possible with his reliable and witty sidekick Bough (Ben Miller), Johnny English Strikes Again is one heck of an entertaining, silly and gratuitous time at the movies during a heavy hitting awards filled season.Approaching sixty-four years of age, Atkinson still proves that he still looks dashing in a suit and willing to fill the spy shoes once again, maybe not giving Cruise a run for his money for his physical stunt work, but surely showing that his elastic face and comedy acting chops are surely not a thing of the past. Yet, the film’s plot of a cyber hacker infiltrating all the knowns agents within the British Intelligence agency, is the main focus of the film, English must use as little tech as possible, to track down a villain who’s biggest threat, is technology itself. Refusing cellphones, glitzy gizmos and gadgets, English and Bough track down their nemesis using good old fashion guns (that require them to fill out health and safety forms), skeletal armour suits and of course, their most reliable tool…pay-phones.While the premise of Strikes Again couldn’t be more spot on for a spy-spoof film in 2018, its English’s interactions with the high-tech gadgets that truly get the best laughs throughout the course of the film, most notably, a hysterical virtual reality simulation scene that finds English wandering, crawling and scaling the streets of London, sporting a virtual reality mask and imaginative tools and weapons, to defeat his virtual enemies.While it may be hard to believe that these films has any sort of cult following or intense built-in audience, the last two entries in the franchise, which more than quadrupled their production budgets, prove that the Johnny English franchise and trademark is alive and kicking, even if those kick aren’t too painful or threatening. Atkinson proves that English is most effective when the actor so effortlessly spoofs his British humour, along with his signature elastic facial expressions and slippery unknowingness.Whats most impressive of the English franchise, especially when thinking of the newest entry is the unexpected star-power in front of the camera. Emma Thompson, who plays the very naive and bewildered Prime Minister, brings some of the films biggest laughs purely from dialogue and delivery, showcasing Thompson’s comedic chops which may surely be unexpected coming from such a renown British actress whose focal comedic chops come in the form of British romantic comedies and family friendly films. The film also boasts cameos from acting greats like Michael Gambon, Charles Dance and Edward Fox, as well as making a very tongue-in-cheek casting with Olga Kurylenko, a former Bond girl in the most recent Daniel Craig era.While many may think that slap-stick comedy may very well be a thing of the past, Johnny English Strikes Again shows that during a very crowded and formal season of movies, a few strikes of comedy wit, hilarity and fun may be exactly what audiences may be craving after all. Even if those strikes are more inclined to deliver tickles and giggles, Johnny English Strikes Again with exactly what you might expect, and that may very well be not so bad after all."
    },
    {
      "rating": "10",
      "text": "Usual Rowan Atkinson fun, just leave your serious brain at home and just enjoy."
    },
    {
      "rating": "6",
      "text": "An average movie. Didn't really feel the elements of Rowand Atkinson's older movies. All in all, its a hilarious and enjoyable movie.6/10"
    },
    {
      "rating": "10",
      "text": "A Lot of people don't rate this, but Rowan is at his best again. Could not stop laughing. I would highly recommend seeing this."
    },
    {
      "rating": "8",
      "text": "Sometimes we need mindless entertainment to wash away the negativity of the day"
    },
    {
      "rating": "7",
      "text": "E-Value: 7Acting: 7Plot: 4Rowan Atkinson is back on the big screen as the parody of James Bond-type secret agent, Johnny English, for the third instalment of this franchise.Johnny English (Atkinson) has retired from being a secret agent for the MI7 for years and he is currently a geography teacher at an academy where he secretly trained his students in espionage. Things go south when a mysterious hacker committed a cyber-attack on MI7 which exposed the identities of all their current agents.Due to the exposure of all current MI7 agents, English was called back into action and reunited with his old sidekick and fellow agent, Angus Bough (Miller), to capture the mysterious hacker. Together, they travel to south of France and begin their mission from there. During their mission, they meet a Russian woman, Ophelia (Kurylenko), who seem to have something to do with cyber-attack or does she? It’s up to these two agents to save the world.Having watched Rowan Atkinson as Mr Bean and Johnny English, he still manage make everyone laugh and it never gets old when it comes from his acting. I laughed so many times when he done all those silly and crazy acts despite all those acts seems to be recycled from his Mr Bean role. Nevertheless, it was funny and fun to watch.Unfortunately, I cannot say the same for plot and character development especially the supporting characters and the villain. For the plot, I noticed that the story is derivative from the first two movies which became so predictable and added nothing new to the franchise. Furthermore, the pacing of the movie is kind of rushed which I believe affected the time of character development for supporting characters. The villain in this movie is weak and not fully developed like the villains in the previous movies.If you are looking some good laugh especially if you are the fan of Rowan Atkinson, this movie is still worth to watch provided if you watch it with low expectation."
    },
    {
      "rating": "4",
      "text": "It's funny to watch Rowan Atkinson as an actor in a comedy film but it's a ridicules and empty movie from any sense of humor that we expect from his character as a comedian."
    },
    {
      "rating": "9",
      "text": "Johnny English Strikes Again is a great time. The jokes were amazing because of Rowan Atkinson's great performance."
    },
    {
      "rating": "10",
      "text": "This movie is a **** masterpiece and i dont understand why people think its bad and unfunny but whatever thats their opinion, BUT theres one thing that you have to decide before you watch this film and thats that it depends what kind of person you are, if you're serious most of the time and you're not may i say the \"Funny guy\" NOT THAT THERES ANYTHING WRONG WITH THAT but i dont thing you will enjoy it, to enjoy this movie you need to have a type of humor and if you dont think you will enjoy this movie than most likely you wont so i recommend this movie to the people who have a sense of humor and not people who think movies are art or what not but i dont think thats wrong its just you won't really like this movie. BUt this movie is definitely one of my favorites and i would recommend to ANYBODY except people who dont have the same sense of humor as me since I know for a fact they wont like it. So GOOD NIGHT"
    },
    {
      "rating": "7",
      "text": "\"Johnny English Strikes Again\" is a perfectly enjoyable and hilarious, if eventually exhausting and unmemorable action-comedy. You get exactly what you expect here."
    },
    {
      "rating": "2",
      "text": "There are a few humorous moments sprinkled into what would otherwise be a long, slow, dull, and completely forgettable spy-movie spoof. Avoid this unless you must see Rowan Atkinson."
    },
    {
      "rating": "4",
      "text": "The best things about this movie: it's only 89 minutes long and the funniest person is Emma Thompson (as the prime minister). Unfortunate, considering it's another of Rowan Atkinson's bumbling spy flix. He sets out to save the world from a high-tech takeover, but not before causing disaster and mayhem everywhere he goes. While the energy never lags, the laffs are almost non-existent. The outcome of almost every gag is telegraphed by the setup, which leaves no surprises. Even with his Mr. Bean expressions and over-the-top physical comedy, it still falls flat (and not in a funny, pratfall way)."
    },
    {
      "rating": "3",
      "text": "Most of my 3 of 10 stars go towards the production value of the movie, it's well made; however, this plot and set of characters don't deserve to be treated this well. It got a pitiful $4M in ticket sales here in the US which reflects the low regard we have for such banal, tiresome humor, thus \"Johnny English Strikes Out Again.\" Rowan Atkinson (\"Johnny English\") is an ancient 64 years old, WAY past his prime days of \"Black Adder\" and \"Mr Bean\". He's just not funny anymore and needs to retire already. IMDB doesn't show any involvement from him in future movies/shows so maybe \"they\" finally got the message."
    },
    {
      "rating": "5",
      "text": "Too many unfunny jokes or slapstick which is overplayed already. I did like the first ones, but this keeps repeating most of the stuff and the jokes get really predictable. Somehow wasn't that funny altogether. SO basically quite average"
    },
    {
      "rating": "4",
      "text": "Strikes Again is an average movie. The story is pretty obvious. There are good moments and for me it was when he was at school. There was a nice appeal and chemistry with the kids. And that part was a better idea then all the rest of the movie. Sadly, the movie is quite predictable and the gags too. I give it a 40%. They should have exploited the spying school idea."
    },
    {
      "rating": "5",
      "text": "Equal to the first two, has many funny moments but is overall far more stupid than clever."
    },
    {
      "rating": "7",
      "text": "+Great cinematography+Memorable soundtrack+Interesting action set pieces+Fantastic cast-The usual limited spy film plotJohnny English strikes again excellently captures the cinematography from the spy genre it is spoofing which is a huge plus. Because the characters are each taking the world so seriously I found the comedy here works better for this reason than in the many other modern contemporaries. I laughed out loud multple times expecially with Rowan's clowning antics. Overall this is perfect to watch in a family setting or if you're a fan of the spy/comedy genre."
    },
    {
      "rating": "6",
      "text": "Even though the story was not good at all, it was the funniest of the trilogy"
    },
    {
      "rating": "7",
      "text": "There are some funny scenes with rowan Atkinson. But the biggest problem of the movie is that the funniest scenes were showed up in the trailer and so missed the movie mostly the momentum for the gags. Some gags are restored from the first one like Johnny is spying under drugs because he took the wrong one. One big problem is the simple and lazy story. The plot is just a mess. And it's a shame that Emma Thompson and rowan Atkinson also ben Miller couldn't make this movie great.."
    },
    {
      "rating": "7",
      "text": "An improvement on 'Johnny English Reborn', if still a large distance off the entertaining original.'Johnny English Strikes Again' does feel more like the first film though, unlike the 2011 sequel. That's in positive and negative ways. The vibe of the film being one of the pluses, but one of the cons being a couple of scenes felt repeated from the original.Rowan Atkinson (Johnny) remains the standout piece of the series, while it's good to see the previously missing Ben Miller (Bough) return. Olga Kurylenko (Ophelia) is alright, while Emma Thompson (PM) is pleasant to see.One issue I do have with this installment is the villain, who is extremely mundane and not at all threatening, menacing or funny. The main reason why the original is so much fun, at least to me, is that you had John Malkovich absolutely perfecting the villainous role and remaining on the same level as Atkinson. In the sequels, it's basically Atkinson and that's it. Bring back Pascal Sauvage, I say.The humour in this third release is suitably fine, despite nothing truly hilarious. There are a few good scenes, the most memorable to me being the VR one. The ending is just about passable, almost bad but not quite. Overall, I found just enough that I enjoyed about this."
    },
    {
      "rating": "9",
      "text": "Johny English 3 a comedy at this heart and soul. And thats how it should be. Comedy is greatly executed and I couldnt help but keep laughing through it all, this movie isnt to be taken seriously, it doesnt want to be. It can start getting to feel a bit overwhelming, but it does offer moments of peace to more focus on the plot. The story isnt super original and mainly is there to bridge the moments of comedy, however the theming of old vs new is interesting and greatly executed. Its ever present, but doesnt get stale.Acting is on point and characters are memorable. Rowan still has it and other actors also did a great job. The visuals are beautiful, shots are well executed and you always know whats going on. Score is also memorable and licenses dont feel forced like in many movies. They suplement the plot and just feel like they belong. At times gave me flashbacks to Shrek 1&2. Sound overall is sharp and clean.The third act can feel a bit awkward in some moments, but other than that I hardly have anything bad to say about this movie. After first watching I would rate it a 7 or 8, but it really took the third watching to fully appreciate the movie. I usually preffer to give much more longer reviews to explain the rating, but really one sentence is enough: Its fun. Its a good comedy movie. And a good movie in general. If you cared enough to read through this review, you should watch this movie. Because its fun yet has depth if you seek it. This is a good movie.9/10 This movie is a hidden gem and doesnt deserve the reception it has gotten. Living in the age where everything seeks to be grand and gigantic, its refreshing to see a simpler spy movie. Yet I left the cinema changed, I was happy. Tell me how many movies can do that these days."
    },
    {
      "rating": "6",
      "text": "A film that is somewhat entertaining and tolerable, but extremely repetitive and superficial, which reduces the quality of the work."
    },
    {
      "rating": "7",
      "text": "A funny film with a very charming and entertaining protagonist, even if most of the plot points occurs due to the characters being dumb."
    }
  ]
}