{
  "id": 837,
  "title": "John Wick",
  "starring": [
    "Keanu Reeves",
    "Michael Nyqvist"
  ],
  "runtime": 101,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "Ex-hitman John Wick comes out of retirement to track down the gangsters that took everything from him.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nCzzQKGijVzfGFg42id7uDLOjY5.jpg",
  "categories": {
    "plot": 8.333333333333334,
    "acting": 8.35,
    "ending": 8.666666666666666,
    "soundtrack": 7.8,
    "cinematography": 9.666666666666666,
    "familyFriendly": 3.0,
    "funny": 7.333333333333333,
    "action": 8.698630136986301
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is definitely a guy's movie. Blood, guts and a lot of spewing. I liked the parts where it showed the code of honor among bad people, like the membership in some kind of pleasure hotel, where when you break the rules you're dead. It appears there are bad people have honor, and of course, those that don't. The best part is Keneau Reeves. He gives the proper intensity and he's back to his Matrix moves. Damn he looks good for 50 years old! We need to send The Equalizer, John Wicks and Liam Neeson's characters to fight Issis and make this a better world."
    },
    {
      "rating": "9",
      "text": "One of the most original action movies to come out in recent history, this flick makes good use of Keanu Reeves' bad-ass performance, amazing stunts, and a great mafia world, that is to be explored in the sequel."
    },
    {
      "rating": "8",
      "text": "Stylishly executed and at times comedic assassin's revenge film that, while maybe a little too lean, is a fun enough diversion."
    },
    {
      "rating": "9",
      "text": "(88/100)I didn't expect much from this movie, and damn did it satisfy me. Believe me, my friend said it was a movie about a guy who's dog gets killed and as a consequence he kills an entire Russian gang. It sounded silly. But boy was I wrong, Keanu is amazing in this role."
    },
    {
      "rating": "7",
      "text": "The very first scene of Chad Stahelski's 'John Wick' depicts the title character portrayed by Keanu Reeves severely hurt, not even being able to stand. The first thing he does, though, is not attempt to ease his wounds, but rather take out his phone and watch a video of a girl on the beach. We later learn that was his wife, which died from an incurable disease and the man in question is probably one of the most feared and respected hitmen.The premise of this film is that his wife leaves him a dog as present for him which is killed by a naive mobster's son just for fun so he can steal Wick's car. After that, we have the classic hero looking for revenge. But unlike most films, 'John Wick' offers a fresh premise, with the dog representing the last thing left for him by his wife, almost like a child, if you wish. More so, it offers some brilliantly directed and choreographed action scenes which flow perfectly and a soundtrack which is booming and dangerous.So, this is a pretty cool film. It has the makings of greatness, but unfortunately there are some issues in controlling these elements. First of all, there are occasional awkward pacing issues, and also sometimes the film ditches its somber soundtrack for generic 'cool' pop-rock singles which are inappropriate. The character of John Wick himself is rather dull and emotionless (apart for his feelings of sadness and vengeance) although I tend to believe this was done on purpose. What is better is the way in which the main villain, mob leader Viggo Tarasov (Michael Nyqvist) is presented. He develops a fascination for Wick and his skills and determination, even though sometimes he seems a bit cartoonish.Another great thing is the way in which John Wick is referred to as an unstoppable and feared hitman, almost like a supernatural being. The action scenes though, are perfectly balanced, realistic and by the end of the film Wick is bruised and beaten... but he survives. It is this perseverance which makes him truly powerful, but more so, he seems to be the only man which has true friends in the cold Mafia underworld, like Marcus (Willem Dafoe) who had many chances of killing him but could not do it.In the end, 'John Wick' is a slick, dark and stylish action flick which despite a few awkward and overly dramatized moments offers one of the best, brutal and elegant fighting dynamics."
    },
    {
      "rating": "9",
      "text": "I actually really like this film.The movie had a really good suspense, camera work, sound design and editing.The sound design captures every little sound that happens in the movie.The music goes right  with the flow as John here absolutely rips through crowds of bad guys.Every single gunshot and or stab is really emphasized and very hard to miss.Now onto the backstory and story of John.He has his wife and dog killed and niw he aims to avenge them by killing the one who’s caysed this and pretty much EVERYBODY  relAted to that ONE person.The one thing I really like is how absolutely merciless ge is for pretty much everybody that gets in the way of his wratch.The final scene though was pretty dissapointing overall.It was a pretty simple knife fight with a pretty obvious outcome.What is this outcome you may ask?Well of course its our boy john killing the last bad guy(kinda like a mini boss from a video game). The movie ends with John nearly dying and gets himself a new dog.Also, the gore in the movie was awesome  and didnt really seem out of place.Just pure unesecary but awesome gore.This film defies our expectations for an action film as it doesnt hVe the cliché plot of the very typical “huehe lets save the world guys!’ , but it has a very different story.The whole movie happens because this russian guy from John’s former crew kills his dog which was John’s wife’s last present to him.Not onlh that but the dude straight up steals his car.This kovie is driven by revenge.Literally the whole movie is just about John getting revenge on basically everyone that did wrong to him."
    },
    {
      "rating": "9",
      "text": "It was a very long time ago i saw a really good action movie, but this one really hit the mark. Awesome movie!Also; Free from SJW stupidity!"
    },
    {
      "rating": "8",
      "text": "Whilst the premise is absurd, the movie manages to (somehow) convincingly pull it off. A man's dog is slam dunked and he goes on a rampage. Slick is an overused term, but this film fits it. One of the best action movies of recent times, nice cast of colourful characters, save one or two who fall flat."
    },
    {
      "rating": "9",
      "text": "it's a well done revenge movie the plot is good and there are moments where we know john wick would have died but this is a movie so if your willing to give that a pass the story and action is pretty good for an action movie overall a good watch for action movie goers"
    },
    {
      "rating": "10",
      "text": "John Wick muscles its way to the top of the list of all-time best action films. Combining the Hong Kong action style with American neo-noir, John Wick has strong visual similarities to The Matrix and Oldboy. Keanu Reeves demonstrates once again his deep affection for action choreography with an outstanding stunt crew. The action covers gunplay, martial arts, muscle cars, and good-old street brawling. The plot even makes sense - something you wouldn't expect from such an intense action-driven film.There is so much to love about this film. Truly one of the greats and a testament to Keanu's dedication and hard work; he surrounds himself with talented directors, designers, camera crews and stunt crews, and these perfect films are the result."
    },
    {
      "rating": "8",
      "text": "Awesome!! Of course it's an action film but hell it's so damn good. The action scenes are amazing, the image is brilliant and the sound is just staggering. Of course it falls short when it comes to plot and character building but who cares when you're having this much fun. You'll sit and enjoy every little piece of this film."
    },
    {
      "rating": "9",
      "text": "Keanu Reeves and director Chad Stahelski manage to sell me on a film about an ex-assassin who goes on a rampage to avenge his dog."
    },
    {
      "rating": "9",
      "text": "Initially the character is nothing and comes to lose a presence. The character seeks revenge without anything stopping him and after a long rest he wakes up never to stop. You surely recognized an actor capable of assuming this role. What a pleasure to find what is for me \"my favorite actor\" in a role that sticks to the skin. This film is a CV to the future Matrix trilogy. It is also a thank you letter to wachowski. And while being what is quoted previously takes us in a tempting coherent story to caress the dynamic of matrix and keep a clean image for a series that I hope will not stop at the 2nd episodeAu départ le personnage n'est rien et vient à perdre une présence. Le personnage cherche à se venger sans que rien ne l'arrête et après un long repos il se réveille pour ne jamais s'arrêter . Vous reconnaissiez surement un acteur capable d'endosser ce rôle. Quel plaisir de retrouver ce qui est pour moi \"mon acteur préféré\" dans un rôle qui lui colle à la peau. Ce film est un CV à la future trilogie Matrix. Il est aussi une lettre de remerciement aux wachowski. Et tout en étant ce qui est cité précédemment nous emporte dans une histoire cohérente tentante de caresser la dynamique de matrix et garder une image propre pour une série qui j'espère ne s'arrêtera pas au 2e épisode"
    },
    {
      "rating": "9",
      "text": "It's much better than third chapter \"parabellum\". I didn't know such good film could fall so low after a successful start."
    },
    {
      "rating": "8",
      "text": "Они убили его собаку, он убил их. Хороший боевик с классной музыкой"
    },
    {
      "rating": "9",
      "text": "Excellent Action FilmWith a terrific performance from Reeves, John Wock is the beginning of one of the best and most brutal action franchises of all time."
    },
    {
      "rating": "7",
      "text": "Very stylish film with good close combat action sequences (and some vehicle action). Villain is made to be fairly realistic and mortal, more so than John Wick, which is a nice change as these types of films often make the villains seem unrealistically bad. There's subtle dark humor mixed in throughout the film. Negatives, biggest is the large contrast of dialogue volume to music and sound effects, at least on a standard TV (may be better with an external sound system). You will need the remote, trust me. You also just have to accept it's unrealistic like many action films with the main character seeming to be invincible (though constantly getting beat up and seeming on the verge of death). The premise is borderline absurd though it's likely intentional, that he takes down a massive NYC crime mob all on his own because the son of the mob leader killed his dog and stole his car (why is explained as the film goes on, trying to avoid spoilers here). Could use more variety in the action, most of it is indoor gun shootouts, him versus 50 mob people several times (how big is this mob anyway? law enforcement has really failed if they've allowed something this big to develop). His dialogue is intentionally minimal but when he does speak, sometimes it comes off a bit corny and he has one mood / demeanor the entire film with a few exceptions (again, that likely isn't an oversight but what they wanted). Soundtrack is okay, may have been better without some of the alt-rock songs, not sure."
    },
    {
      "rating": "8",
      "text": "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"
    },
    {
      "rating": "9",
      "text": "With John Wick 3 coming out, I realised I hadn't watched John Wick 1 and 2. I was so entertained that by the time I finished this movie I had to start watching John Wick 2 straight away. Amazing high action movie!"
    },
    {
      "rating": "3",
      "text": "REVENGE PORN is my summation of this film. I get the sensation of being emotionally manipulated to root for an ex mafia hit man when in reality, they are all despicable P.O.S.Oh! They killed his puppy! Think for micro second.. John Wick probably did worse than that before he fell in love and left the crime world in order to live the good life from all of his ill begotten riches.Coupled with absolutely no other true character development and for what of that there is, it takes a back seat to the non stop MATRIX LIKE hand to hand battle sequences that make up 95% of the film. Isn't that nice of Hollywood to develop a series of films where Keanu Reeves doesn't have to act and involves almost identical battle sequences using his skillset that he had previously learned for The Matrix trilogy.. hmmmm things that make you go hmmmm.... at least the matrix had an interesting and way more complex storyline to frame the action sequences in it. This film is extremely unsophisticated REVENGE PORN. How ever polished it may be."
    },
    {
      "rating": "9",
      "text": "I would give this film about an 8.5, but it gets bumped up to nine for the impact it has had on action cinema. This film came along at a time when action films were suffering deeply and showed them all how it’s done. The home invasion sequence and the Red Circle shootout are some of the best action sequences of the last decade. But the action of this film isn’t all it has to offer; it goes above and beyond what an action movie is called for by setting up an entire underworld of assassins that... it’s just so cool. The premise is extremely simple yet ruthlessly effective because of its setup, and of course; Keanu. F#cking. Reeves. His dedication to his craft gives these movies a passion that otherwise wouldn’t exist, and he even manages to pull out a decent performances in the quieter moments. (As much as I love Keanu, his acting ability isn’t what makes him so awesome). Unfortunately, the movie definitely peaks in its first two acts; after John achieves his goal, there isn’t much that tops that intensity. I mean, Wick takes on entire squads of trained henchman with ruthless efficiency and the final battle of this film is an old, out of shape Russian gangster that manages to get the closest to killing John that anyone has? Yeah, I don’t buy it. But an underwhelming finale is the only real knock against this film, it’s still an excellent piece of action cinema."
    },
    {
      "rating": "8",
      "text": "John Wick could have easily have been a bad movie. I mean, think about it, if you were to listen to a pitch for a movie that was based around a former assassin who goes on a killing spree because his dog got killed...you probably wouldn't have high hopes for the movie. But, John Wick is about as good as it could possibly be. The action sequences are simply some of the most entertaining I've seen in the many movies I've seen. The world itself is also very interesting, and I'm looking forward to seeing the spinoff TV show about the hotel if it ever comes to fruition. There are some cheesy moments, and the story is pretty typical for an action film in the end, but it blew away my expectations when I saw it back in 2014 and I still enjoy watching it to this day."
    },
    {
      "rating": "8",
      "text": "I was really touched by the admittedly idiosyncratic way that John Wick demonstrated his love for his dog. Some of the other parts of the film seemed fabulously unnecessary, though. There already exists a hotel which caters to professional mass murderers. It is the Lotte New York Palace Hotel."
    },
    {
      "rating": "9",
      "text": "Stylish and violent action, what else should you need from an awesome movie.Rather simple story, tho."
    },
    {
      "rating": "7",
      "text": "Since \"The Matrix\", when was the last time you saw Keanu Reeves kicking so much ass? \"John Wick\" is an exciting and stylistic action-packed movie, one that turned out to be a lot better than everyone thought it would be."
    },
    {
      "rating": "7",
      "text": "An unoriginal and rudimentary story, filled with all the tropes you would expect with a high body count.Sometimes I just want an uncomplicated movie and I thought this one would be fine to waste a couple of hours with , but damn it was fun; I have watched many time now and I still enjoy it."
    },
    {
      "rating": "9",
      "text": "John Wick might feel like a typical action film to some. But the main characters and the whole criminal world they live in makes it much more interesting that what we're used to seeing in the genre."
    },
    {
      "rating": "10",
      "text": "sin duda la mejor pelicula de accion para mi sus escenas son muy buenas y contiene mucha pero mucha accion lo cual es bueno para mi"
    },
    {
      "rating": "9",
      "text": "John Wick might feel like a typical action film to some. But the main characters and the whole criminal world they live in makes it much more interesting that what we're used to seeing in the genre."
    },
    {
      "rating": "10",
      "text": "Featuring a simple yet effective story, sharp action and a realistic tone, \"John Wick\" is like Taken for adult audiences: gripping, entertaining and highly enjoyable."
    },
    {
      "rating": "9",
      "text": "Amazing underworld, pulled off in ways that make it believable, when thats not an easy thing considering what there selling. Reeves is amazing as always."
    },
    {
      "rating": "9",
      "text": "John wick is probably one of the greatest action movies ever made. This is a movie where the plot is simple John wick wants to retire but bad guys kill his dog so he gets revenge on them. If you like action movies this is a must see and its 2 sequels."
    },
    {
      "rating": "10",
      "text": "Keanu Reaves comes back strong with this movie.I loved him in the matrix but I never thought of him as an exceptional actor, Matrix was just a great story with so many strong characters that I felt he was wrapped in.But in this movie, he show he has dept and I gained massive respect for him. This movie is an absolute must-see if you like action-packed movie. There is never a dull moment and you have the very defition of what a top badass is."
    },
    {
      "rating": "8",
      "text": "Loved this movie. They did the dog wrong though. This was a very action packed film, and Chapter 2 and 3 should be just as good."
    },
    {
      "rating": "8",
      "text": "its a good action movie. its not a big film with somebody trying to save the world from nazis, and i like that. it's just about a man serving a nice cold glass of justice. it shows just a chapter of john wick's life and you can tell that it is part of a bigger picture. this film is a small yet enjoyable one with great fight scenes, an interesting world, and an awesome protagonist. it is very entertaining and i really enjoyed this film and i highly recommend it."
    },
    {
      "rating": "9",
      "text": "John Wick PvC Review (5/25/19)ProsComing from an honest, emotional approach; John Wick lays down the groundwork for an enthralling world of assassins in a way that is completely unique from other movies like it. Witnessing a grieving man try to move on in his life only to witness him being dragged back into his past that he fought to escape, to find out that he is in fact a trained killer and the best of them all. You explore his dark past with him, you see this world that seems to be grounded in reality but is so surreal in its own right and you naturally learn its rules as well as its figures. I think that’s what I love best about this film, it’s not all the high octane action but the cleverly written world it is presenting before me. But needless to say the action does shine a lot; it is quite beautifully done thanks to Keanu Reeves’ knowledge of the stunts performed, the shots done with the camera, and the way the music compliments it to its fullest extent without missing a beat. But it is also the action that can hold it back for me. + Enthralling world+ Intriguing characters and narrative+ Fantastic soundtrack+ Good Action+ Naturally paced story and progression+ Beautifully shotConsIn this story you follow John Wick as he seeks revenge against the people who took away the rest of his normal life, hence making it an intriguing vengeance story, but the payoff of actually him getting his man for both occasions just doesn’t feel gratifying or it feels too quick to make it satisfying. Also in terms of the action scenes, while really fast paced and entertaining to watch, I found myself growing less interested in the typical cover shooting gun fights along with the settings they took place in. It felt too typical of a movie of its genre at times when it could’ve done so much more in the world that they had beautifully created. Maybe it was the praise the movie had received that made me feel a bit let down with some of the action segments or the fact that the fights got a bit samey towards the end. Regardless of this, it doesn’t hold the movie back from being great. It was just a bit disappointing in some of its aspects.- Payoff isn’t all there- Action can be a bit disappointing at timesOverallJohn Wick is a fantastic action flick with a genuinely intriguing world and with genuinely wonderful characters that feel natural to it. While some things are a bit disappointing it doesn’t take away the fact that this is a wonderfully entertaining film."
    },
    {
      "rating": "10",
      "text": "wwjdjdjddjfkfkfkkfkfkfkkfkfkkfkfjfjjffjfjfjjfjfjfjdjdjsjsisuskskdnbgsisnsnsldlc"
    },
    {
      "rating": "10",
      "text": "An true masterpiece of a modern action film. Some of the depth is hidden on the first view but this is a story of a man who gave up his former life for a woman who then dies . He is alone given up his former life and having his current one torn apart . In this depressed and lonley state he receives the gift of a puppy from his deceased wife he sees this puppy as the only joy in his life a chance to prove to himself that there is still good inside him . someone then kills this puppy and steals his pride and joy a vintage Mustang (in the second film it is revealed this contains the last photos he taken of his wife .he then in beautifully choreographed scenes proceeds to rain  lviolence down upon those that killed his dog and stole his pride and joy.The true masterpiece here is the cinematography and choreography of the fight scenes this is what makes it a true masterpiece of the modern action genre .with long takes and few cuts the action scenes stand out from anything that has come before it .with an emphasis on realism that is often missing from action films every with bullet is counted and every target is eliminated with a brutal elegance."
    },
    {
      "rating": "7",
      "text": "After watching this movie I don't really know, where all the hype around the news parts comes from. It's an alright action movie with greatly executed fight scenes and setpieces, yet the story and (under-)world is absolutely boring to me. John frequently causes massacres depopulating entire city-blocks and it's mostly nodded off with a witty one-liner, that's fine one or two times, but it's seen multiple times throughout the entire movie.Still better than any Fast, Furious, or otherwise stathamy movie these days and Keanu Reeves definitely carries the entire thing."
    },
    {
      "rating": "10",
      "text": "John Wick has some of the best action scenes out there. It's a dark, violent, gritty, and intense film with incredible visuals and sounds on 4K bluray disc format. I watched it for the first time with a 4K streaming service, but the difference compared to 4K Disc is night and day. If you love guns and martial arts (\"Gun Fu\") in your films, then John Wick is an absolute must in your collection. Watched on a 4K LG OLED TV C7 65\" with LG UBK90 4K Bluray player."
    },
    {
      "rating": "8",
      "text": "If someone killed my dog I would also go on a murderous rampage. Relatable. Better stoned."
    },
    {
      "rating": "8",
      "text": "It's really the best action movie so far, Keanu is a peaceful guy but i cannot imagine any other actor as John Wick, it is breathtaking."
    },
    {
      "rating": "10",
      "text": "Real action movie. No close shaky cameras . lots of steady wide shots. Great ActingNo dull moments."
    },
    {
      "rating": "10",
      "text": "If you like violent movies, then John Wick is the film for you. Great acting, fast paced, & quite a few well known actors. I really like this movie."
    },
    {
      "rating": "10",
      "text": "Super strong violence makes this movie a perfect action movie. It is a perfect movie, no doubt about it."
    },
    {
      "rating": "8",
      "text": "I'm tired of the same action films, but I really liked this one. I'm not sure if it's because the director knows that this is an action movie and doesn't aim higher so you don't fall short of expectations. A simple, but effective story for the main character, good fights and stunts, good characters and an opened door for a sequel."
    },
    {
      "rating": "8",
      "text": "Who cares about a plot.This movie is solely about action and how much you can squeeze into a run time of 101 minutes.To do that, the action has to be excellent and for the most part it is."
    },
    {
      "rating": "8",
      "text": "it has good action scenes Story is avarega well good for that reason good movie..i think it should be watched"
    },
    {
      "rating": "10",
      "text": "the best movie that I have ever watched outstanding amazing lovely just must watch that now what am I saying"
    },
    {
      "rating": "10",
      "text": "GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD"
    }
  ]
}