{
  "id": 102,
  "title": "John Wick: Chapter 4",
  "starring": [
    "Keanu Reeves",
    "Donnie Yen"
  ],
  "runtime": 169,
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "description": "With the price on his head ever increasing, John Wick uncovers a path to defeating The High Table. But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes.",
  "releaseYear": "2023",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vZloFAK7NmvMGKE7VkF5UHaz0I.jpg",
  "categories": {
    "plot": 9.695652173913043,
    "acting": 9.789473684210526,
    "ending": 9.25,
    "soundtrack": 9.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 7.5,
    "action": 9.44943820224719
  },
  "reviews": [
    {
      "rating": "10",
      "text": "incredible action entertainment !! this franchise kept improving and find innovative ways to make actions to treat the audience to highest standard !Not only just actions ,the cinematography is brilliant ,one action sequence in Paris road traffic and single long shot action scene is fantastic!nobody and his dog and caine character are exciting to watch AND soundtrack placement is impressive !!Chad Stahelski and his crew is outstanding to make this exceptional action cinmea to enjoy....!!& the man ,the legend, the BABA YAGA -JOHN WICK AKA KEANU ,he is born to play john ,he is sensational as WICK ; everything is perfect about him ,his walk,his voice tone and the way he loading his gun and dispatching his enemies is amusing to watch .if you want to experience great action movie on big screen ,you can not miss this one !!!"
    },
    {
      "rating": "10",
      "text": "Best action movie and the best ending. The fight choreography is the best and the car fight is the best part and the ending is perfect."
    },
    {
      "rating": "10",
      "text": "Mind-blowing action scenes. This is beautiful violence that's never been done on this level, even down to the finest details. Anyone who's ever done what he's doing in the movie, like martial arts, guns etc can truly appreciate the realness of everything. Since when have you seen nunchuks used like this in a movie? The action never gets boring and always keeps you on your toes. Usually movie quality drops as more are made, it's rare sequels are ever as good as the first but not with John Wick. Each movie just keeps getting better, they never lost sight what made the movie so great and why people keep coming back for more.Let's hope the story continues."
    },
    {
      "rating": "10",
      "text": "Near perfection. The action keeps going and going. I maybe blinked three times in the near three-hour run in an effort to not miss a beat."
    },
    {
      "rating": "10",
      "text": "John Wick Chapter 4 is a love letter to action film-making and every action cinema lovers wet dream. The cinematography is oscar worthy, the neo-noir genre has never looked better on the big screen as the bold and vibrant colours makes each scene of this film a bold underlined statement that what you are experiencing is something special.The action choreography utilizies 100% of each and every set design used in the film to incorporate drama, thrill and also comedy. This movie has everything you could ever ask for - guns, knifes, nunchucks, katanas, martial arts, cars, flamethrowers, bare hands etc. The stuntwork is jaw-dropping and adrenaline inducing, specially a stunt that was performed on a staircase on the later half of the film, left me wondering how did the stunt coordinator get that Tom Cruise-level life threatening stunt greenlit.But what truly makes this story special are the characters and the drama surrounding them as they manoeuvre their way through this twisted world of crime where each person is their only friend. There are a lot of new characters introduced and none of them feel throwaway as each and everyone of them bring something new and exciting to the table and moves the narrative forward. And the centre of this narrative, Keanu Reeves who plays John Wick, a loving husband proves once again why his contribution to this role will be remembered forever as something that revolutionalized action film-making.This was the one of the most satisfying experience I ever had inside a movie theatre and it leaves you with the question that how many times are you going to return to experience this once in a lifetime masterclass in action film-making.10/10 - John wick Chapter 4 is a a modern day classic"
    },
    {
      "rating": "10",
      "text": "Best Movie Of This Year Deserves Oscar Best Motion Picture In Action Genre Keanu Reeves….Mann!!!Give Him An Oscar for sure , Even At Age 60 he’s performing with Very Instant movements in his Body No one Can perform Every art form of Fighting as Keanu when it Comes to Acting through fights."
    },
    {
      "rating": "10",
      "text": "Phenomenal movie! Keanu reeves never disappoints! Action packed! There wasn’t one scene where I looked away or yawned!"
    },
    {
      "rating": "10",
      "text": "This movie is the best since it has the guy from Fortnite"
    },
    {
      "rating": "10",
      "text": "Perfect Sequel For a Franchise Hold.Expecting Lot More to Come Emotional Ending ,But Everyone Would have already been Satisfied with The Action Sequences done in the Movie. Chapter 4 Adds more Depth to the JW’s  Character and his Emotions And his Past Life Tragedies that he Went Through . Story Depth is less as Compared to Part 3 and More as Compared to 1 & 2 .. Little Bit of Lag But we Can Still keep on Watching and holding ourselves for Upcoming Action Scenes."
    },
    {
      "rating": "9",
      "text": "Absolutely, thoroughly, unbelievably, undeniably, sincerely, entertaining. John Wick 4 provides a cinema experience which boasts one of the most captivating and engaging stories that I have ever witnessed. Utterly and fully a time at the movies you will never forget. The already dazzling storyline is this time mixed with a suite of impeccably shot and staggeringly choreographed fight sequences. On the level of anything you've seen from this franchise and more. The scope is broadened to represent the full scale of what action films have to offer. Lengthy battle scenes somehow don't drag out a 3 hour long film, but only serve as to enhance this marvel of a gem of a picture that unreasonably locks you up in chains and takes you for a ride you can't escape. But even if you could, you wouldn't want to. This is a film you absolutely MUST see on the biggest screen possible."
    },
    {
      "rating": "10",
      "text": "Ever since John Wick came out in theaters in 2014, unknown to general audiences, as a niche action-thriller film with R-rated action, its success has catapulted the character and its franchise into stardom. Many critics now hail it as \"a work of pop cinema so blissfully, albeit brutally, entertaining that you come out of it feeling even more resentful of its multiplex neighbors for not making a similar effort.\" with some even comparing it to the Mad Max franchise, another critically-acclaimed action franchise. As always, due to the high bar set by its predecessors, it is always certain that one may harbor doubts if another sequel(a fourth one!) would be able to live up to the anticipation. It is especially true in an era of sequels, remakes, or spin-offs that fall short of the mark, to devastating consequences to the franchise.I can say that JOHN WICK: CHAPTER 4, has not only lived but exceeded expectations(both personally and generally) in all aspects, especially its story. The continuation to John Wick 3, where John was found wounded and seeking revenge against his foes, the way how the story travels not only throughout the world but with also the characters, who are with complex personalities and motives that make you understand and even sympathize with the characters. Of course, there is the recurring cast of Keanu Reeves, Laurence Fishburne, Ian McShane, and the late Lance Reddick(R.I.P). They once again seamlessly fit into their characters and continue to provide Oscar-worthy performances. This is a brief review(for now, the characters). I will be re-editing this with more about the cinematography, setting, and more details about the plot. Ps: This is for now not a spoilers review."
    },
    {
      "rating": "10",
      "text": "What a movie…I was graced with a cinematic masterpiece that balances aristocratic civility with spectacular video game-like violence. It was a visually stunning joy ride, as each scene unfolds like a carefully crafted work of art. The lighting and diverse locations perfectly complement the jaw-dropping action sequences, making John Wick Chapter 4 a true sensory marvel. While I had to suspend disbelief and buy in to the fact that this is despite what characters say, consequences are variable in the world of John Wick. This did add a certain delightful quality when normals rules didn’t apply, it didn’t feel out of place - given Wicks journey so far, little would by the time you sit down for chapter 4.Highlights for me include the confrontation scene in Osaka, everything involving Caine, Killa, and of course that staircase. Certainly sets a high bar for cinematography in the next award seasons, it is tremendously impressive work. For me this was the best action movie I’ve ever seen, top class!  As action goes I have felt in recent times that this genre needed more substance, and this brought it in droves and body bags, action doesn’t get much better than John Wick 4. Go see this!"
    },
    {
      "rating": "9",
      "text": "Why on Earth there's not an Academy Award for Best Stunt Team? A movie like 'John Wick: Chapter 4' deserves some kind of industry recognition. The Arc de Triomphe moment, the crane shot sequence... Come on, Academy, make it happen."
    },
    {
      "rating": "10",
      "text": "They went all out and all in for Chapter 4, worht every bit of the 2 hours and 49 minute runtime. Spectacular... End Credit Scene is very underwhelming."
    },
    {
      "rating": "10",
      "text": "Taking things from many other movies and perfecting in its own style.Best action movie of the decade."
    },
    {
      "rating": "9",
      "text": "If you came here for a mature quality action movie, it's hard to do better."
    },
    {
      "rating": "10",
      "text": "John Wick is one of the best action franchises in modern cinema. When John Wick first came out in 2014, it was one of the most surprising yet most enjoyable experiences I had. What is even more amazing is that the 2 sequels it got were also amazing! We are now on the 4th entry and the question is if it continues to maintain the quality it has so far.Let's get the obvious out of the way, the action scenes are still absolutely amazing! One thing each entry in this franchise continues to do is to make the action bigger and crazier than the last. There are so many incredible actions set pieces with a roughly 30-minute action scene in Osaka with bows and swords, a stunning sequence in Paris with cars and traffic, a Hotel Miami style action sequence with overhead shots, and one of the best action sequences ever involving stairs. I give every single praise to the stunt people who worked on this as they take some very painful falls in this film. This entry is also the best-looking one in the franchise. The set design and cinematography are phenomenal. John Wick killing people has never looked as beautiful as it does here.Keanu continues to be awesome as John Wick by still doing the action choreography at the age of 57. We get to see him fight with nunchucks and shoot goons while driving a car. Ian McShane, Lance Reddick (R.I.P) and Laurence Fishburne return as Winston, Charon and the Bowery King respectively. They're all still great but have a smaller role this time. There are many new supporting characters are great as well. Donnie Yen joins the franchise as Caine, a blind assassin, who is an old friend but now foe. Donnie Yen always gives his A-game and here is no exception with how he does action as a blind character makes him interesting to watch. Hiroyuki Sanada is Koji who is the manager of the Osaka Continental Hotel who is just a badass and cool guy, Rina Sawayama makes her acting debut as Akira and she does a good job in her small role with some good action as well. Shamier Anderson plays an assassin who tracks John Wick and he also does some great action. What they do with his character is interesting but the best thing is that he has a dog which makes him 100% better. Scott Adkins plays Kilia and he does a good job as a minor antagonist. The main antagonist, Marquis Vincent, is played by Bill Skarsgard and he does a great job of being hateable.What Chapter 4 has over Chapters 2 and 3 is more emotional elements to the story. John Wick is deservingly angry after 3 but you also get to see him contemplate more about when this bloodshed will end. You see him question a lot of what he is doing and whether these conflicts that are bringing his friends into are worth it. Additionally, his relationship with Caine (Donnie Yen) adds some weight to the conflict by making close friends fight each other. The stakes in this film feel bigger as well. Some people complain about the 2-hour 45-minute runtime but the pacing never felt bad and the quieter moments are enjoyable too. If I had to give a negative then the only one, I can think of is the post-credit scene which dampens the ending a little bit.Overall, what an outstanding film! It's insane to think that even on its 4th entry, this film continues to be entertaining and somehow still amazing! Director Chad Stahelski has made an extraordinary franchise and shows everyone in Hollywood, how to make an action movie. With the inclusion of a post-credit scene, I wonder if the plan is to make a new cinematic universe which worries me a bit. There are a lot of potential spinoff ideas such as a Caine (Donnie Yen) spinoff or a Tracker spinoff (Shamier Anderson) or a spinoff with the John Wick 3 character Sofia (Halle Berry). Whatever they do, if it is the same quality as the John Wick movies, then I will be first in line to watch."
    },
    {
      "rating": "10",
      "text": "1 of if not the best action movie ever go watch now movie of the year & great way to end the series"
    },
    {
      "rating": "9",
      "text": "Phenomenal action film. Fitting finale of John Wick saga. Perhaps just a little bit too long for my personal taste of such films."
    },
    {
      "rating": "8",
      "text": "John Wick did not disappoint with his action again. At least for me. In my opinion, this series is pretty safe. He can do action scenes and that's the main thing for me and I was entertained the whole movie. Add to the fighting and shooting a hilarious soundtrack and the fun was taken care of. I've heard a bit of criticism about the length, but I was fine with it. I wasn't bored for a moment. I also praise the surprise ending. I thought the fourth episode was very good. But after some thought, I'm still leaning towards the third one, which charmed me with its action a bit more than here. The locations were also great and I liked them a lot, but I will mention the third part again, which appealed to me more with its setting. I don't have much to add. John Wick is a luxury action series for me and probably always will be. The action is the main thing here for me and it succeeded this time and once again I praise the surprise ending. For me, a great film that I recommend to fans of the series or action genre enthusiasts."
    },
    {
      "rating": "8",
      "text": "What a perfect love letter for John Wick fans. If you're a fan of John Wick than this movie is for you, this movie is full blown with beautiful cinematography, action scenes, and good charactherization. But because the movie is almost 3 hours long it's bloated with too many fight scenes. in the end i believe this movie would be my top 1 greatest movie so far in 2023."
    },
    {
      "rating": "10",
      "text": "Best action film ever made I can't believe what I just witnessed this has to be the epitome of madness keanu is a treat to watch"
    },
    {
      "rating": "9",
      "text": "Worth watching in the theatre. Not the best of the John Wick series but very good. I was entertained the whole time. It was like watching a live action anime. Non-stop action - Recommend viewers bring a urinal bottle to prevent the risk of missing any action."
    },
    {
      "rating": "10",
      "text": "This is one of the best fighting action movies I have ever seen in years!!! This is the best John Wick, other than chapter 1! The story is just a love letter to the entire 4 chapter adventure and to John Wick, himself. Wow and the cinematography in this flick is something that needs to be seen. Bravo and might have to see it again in the theatre just to fully absorb this movie...Epic!!!"
    },
    {
      "rating": "7",
      "text": "Not bad, although I prefer the previous chapters (2nd and 3rd in particular). Too many “mini bosses” and “bosses” this time to my taste, what makes the fighting scenes prolonged and even less believable than previously (if it’s possible ;-)). Also, too many times Johnny looks rather more lucky than more skilled, comparing to his opponents. Still, kudos for very long, continuous takes full of action, even if some of them were in fact seamlessly composed from multiple pieces."
    },
    {
      "rating": "7",
      "text": "All I can say is, damn!  I hope the stunt men on this picture got paid double pay.  John Wick brings it yet again. Story wise it was great.  Keanu is Keanu.  Bill Skarsgård was great as an antagonist.  Donnie Yen was excellent.  RIP Lance Reddick.  Looking forward to seeing where Chapter 5 goes.  Also curious if the Ballerina spinoff with Ana de Armas is still going to come out."
    },
    {
      "rating": "8",
      "text": "It starts a bit slow but the second half is the greatest action to be ever made"
    },
    {
      "rating": "10",
      "text": "Best John Wick film to date. Each scene is amazingly well put and the entire movie is a joy to watch. The fight sequences are not boring, the colors and artistic shots are outstanding, its just really good to look at."
    },
    {
      "rating": "9",
      "text": "I've always enjoyed the John Wick series. but, this movie... takes everything enjoyable... and cranks it up to 20. Everything in the movie is amazing. It's a must see."
    },
    {
      "rating": "10",
      "text": "This movie is so goooodddd!!!!. I loved every minute of it. Keanu Reeves is the man!"
    },
    {
      "rating": "9",
      "text": "Sweet dose of 'toxic masculinity'. Sets are stunning, great cinematography, breath taking action choreography, practical effects, story is good. Excellent and entertaining movie. And no preaching."
    },
    {
      "rating": "10",
      "text": "One of the greatest action movie ever...Last 1 hour don't miss Especially car chasing fight sequence awesome...100% Must watch for action film lovers..."
    },
    {
      "rating": "10",
      "text": "probably the best action film ever made, absolutely fantastic.    ."
    },
    {
      "rating": "10",
      "text": "Amazing! Story 9/10 Characters 10/10 Action 9/10 Music 8/10 Keanu 11/10 Doggooo"
    },
    {
      "rating": "10",
      "text": "The action in this is some of the best you will literally ever see in your lifetime."
    },
    {
      "rating": "7",
      "text": "It's ok for action movie to entertain you for a night. Grow up watching kungfu, action films, all the bad guys in JW like in sleeping mode, when they fight any heroes, it's not so fluid like they beg to get hit."
    },
    {
      "rating": "8",
      "text": "Stylish as any movie ever made, the movie is an almost three hour riot, that flies by. Filled with fantastic characters and beautiful set-pieces, John Wick and co go about killing even badder guys, and lamenting the consequences of their choices in life. It's a movie about nothing really when you think about it, but then I don't think you want to think about anything while you watch it. Great, great action flick for which you do need to suspend rational thought. Not hard to do though, when the action and characters are this good. Would have liked to have seen more Laurence Fishburn, but then you can't have everything I guess."
    },
    {
      "rating": "10",
      "text": "Wicktastic!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "Brilliant filmmaking with some of the most incredibly choreographed stunts ever filmed. Honors the mythology of the three previous films, but does not go further down the rabbit hole.  Keanu's great, but his supporting cast, especially Donnie Yen and Bill Skarsgård are fantastic. Great franchise and looking forward to The Ballerina."
    },
    {
      "rating": "9",
      "text": "As always 90% action 10% talking, sometimes the fighting scenes were bit long but i wasn't boring. Hopefully they find a way gor a chapter 5."
    },
    {
      "rating": "9",
      "text": "AÇÃO CINEMA! Melhor expansão do universo de John Wick até agora. Os novos personagens são bons, as novas armas são foda, as cenas de ação são excelentes e a trilha sonora segue impecável. História ainda é simples mas as cenas de ação compensam. Talvez o melhor da franquia. São quase 3h que não senti passar."
    },
    {
      "rating": "9",
      "text": "Realmente o melhor da franquia. Muita ação e um grande elenco.  Uma pena a morte do ator Lance Redrick"
    },
    {
      "rating": "10",
      "text": "The best John Wick movie. It is action from the beginning to the end. The John Wick 4 is not just a movie. In some parts it is also art."
    },
    {
      "rating": "10",
      "text": "10/10 Masterpiece, everything is on top level, action,acting, stunts,music, cast, etc. Love it."
    },
    {
      "rating": "7",
      "text": "From what I was led to believe that this was a non-stop ride from start to finish and with plenty of (or Lack there of) Exposition when it becomes relevant and skirted when they needed to avoid diving deeper cutesy of talking head, Ian McShane. I forgot who the villain was towards the end because they threw in 5-6 connected action sequences that started and didn't know when to stop and escalated very quickly. You know who you are when you like a series of films that follows one man army, John Wick, on his quest to quit his job. Action Good, Story Meh"
    },
    {
      "rating": "10",
      "text": "The film was a masterpiece. It expanded itself in every way from the previous films.The story was well written and thought out with a clean and interesting structure that takes inspiration from a video game quest.The cinematography was the biggest star for me. The amount of beautiful and artistic shots with vibrant colors and fantastic set pieces made the movie so engaging to watch.The new characters were surprisingly great and I had a connection to them by the end of the film. This is a must see film."
    },
    {
      "rating": "10",
      "text": "Great action movie. One of the best in the last 5-10 years. John Wick is one of those movies that are saving Hollywood! I'm not sure about what happens next in the franchise after that amazing ending. Let's help this movie make at 500 million worldwide"
    },
    {
      "rating": "10",
      "text": "This movie has great action.The way they designed the ending was good.Cinematography was too good .Keanu Reeves was great asusual.For John Wick  & action lovers it will be a great watch . Don't miss John Wick ..In one word, The movie was next to an extreme level."
    },
    {
      "rating": "10",
      "text": "John Wick: Chapter 4 delivers a thrilling and immersive experience that keeps the audience on the edge of their seats from beginning to end. Despite being the fourth movie in the franchise, it's clear that the filmmakers haven't run out of tricks, and the result is a movie that is as fresh and exciting as the first.Keanu Reeves' portrayal of the world-weary assassin is masterful, with his weariness and struggles palpable throughout the film. The high stakes and increased death count make the character's journey even more intense, and Reeves rises to the challenge with ease.The action sequences in John Wick: Chapter 4 are nothing short of spectacular. Each set piece is magnificently choreographed and shot, with a clear homage to classic martial-arts genres and Hollywood Westerns. The movie also manages to top everything that's come before in the franchise, with new and creative ways to keep the audience engaged.It's also worth mentioning that the film is an absolute joy to watch in IMAX, with the immersive experience making the action sequences all the more thrilling.While the weight of trying to top everything that's come before is not lost on the filmmakers, they rise to the challenge with elegance and creativity, delivering a movie that is both a homage to the classic action genre and a fresh addition to the franchise.In short, John Wick: Chapter 4 is a killer night out at the movies. With an incredible performance from Keanu Reeves, stunning visuals, and non-stop action, it's a must-watch for fans of the series and anyone looking for an immersive and thrilling cinematic experience."
    },
    {
      "rating": "10",
      "text": "Masterpiece movie !!! Not a typical action movie the best John Wick out of the 4 movies I hope we can see a next one"
    }
  ]
}