{
  "id": 2116,
  "title": "Jojo Rabbit",
  "starring": [
    "Roman Griffin Davis",
    "Thomasin McKenzie"
  ],
  "runtime": 108,
  "genre": [
    "Comedy",
    "War",
    "Drama"
  ],
  "description": "A World War II satire that follows a lonely German boy whose world view is turned upside down when he discovers his single mother is hiding a young Jewish girl in their attic. Aided only by his idiotic imaginary friend, Adolf Hitler, Jojo must confront his blind nationalism.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7GsM4mtM0worCtIVeiQt28HieeN.jpg",
  "categories": {
    "plot": 7.67741935483871,
    "acting": 7.897435897435898,
    "ending": 8.125,
    "soundtrack": 9.0,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 8.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Thought provoking and a bit of an emotional rollercoaster. Challenging but very funny."
    },
    {
      "rating": "8",
      "text": "Honestly, this is one of the funniest movies I have seen in a long while. It does a very good job of using comedy and satire to broach some very serious topics. I would highly recommend this movie, though I would say the accents are pretty terrible..."
    },
    {
      "rating": "8",
      "text": "My 17 and 12 year old boys were very interested in seeing this movie. I think it is fair to say that it was NOT what they were expecting. This is likely one of the reasons for some of the negative reviews.  This movie is ambitious. It draws you in with what you expect to be fully satirical slap-stickish humor and then rudely wakes you up to the realities of war, prejudice, and fanaticism. The movie triggered the full spectrum of emotions from goofy happiness, to anger, to love of many forms, to shock, sadness, anxiety, and finally uncertain joy.  The success of the movie, and its innocent goofiness, comes from the fact that it is ENTIRELY presented from the perspective of a 10 year old boy. A boy forced to deal with the horrors and glamour of war at the same time that he is dealing with the normal hardships of growing up, like any of us.  While we can relate to some of his experiences, the backdrop of his reality amplifies the circumstances and consequences of his actions and experiences. The story telling, though at times imperfect, is ultimately successful because of the amazing performances of the cast and the honesty and value of the message being conveyed. The boys did not get the movie they were expecting but instead were treated to a film which challenged their beliefs, expanded their thinking a bit, an triggered great conversations. They loved it."
    },
    {
      "rating": "6",
      "text": "TThis was a rather unusual film. It follows a young Nazi-raised boy by the name of Jojo and his upbringing and various misadventures in war-torn Germany, all alongside his mother (Scarlett Johansson), a young Jewish girl he discovers in hiding (Thomasin McKenzie), and his imaginary friend who happens to be a much sillier version of Adolf Hitler (Taika Waititi, who also directs the film.) Throughout much of the film's runtime, it gave me some serious Wes Anderson vibes, what with it's quirky and bizarre nature, eccentric characters, and offbeat dialogue and jokes. Unfortunately, it's these jokes that hindered the film's potential for me. Just about all of them fell rather flat to me personally, and a surprising amount of them felt really dragged out and in slightly bad taste too. All of the actors, which also included the likes of Sam Rockwell and Rebel Wilson, are given great opportunities to shine and a fair amount of screentime, but I simply felt as though their talents were undermined by the film's flimsy premise and story. Overall, it made a decent effort, but not only did it feel like a Wes Anderson wannabe, I simply found it rather forgettable and subpar in terms of its attempts at dark humor, especially when looking at something as risque as jokes about Nazis and anti-Semitism during WWII."
    },
    {
      "rating": "10",
      "text": "Finally a Nazi film for the whole family :DI give 10 Hitler-Jugends out of 10"
    },
    {
      "rating": "9",
      "text": "a charming offbeat, wartime parody set in WWII that has shades of Wes Anderson’s style of films. Jojo is a character who I grew to love in this film. Its his character arc that makes this film so good. Taika’s creative use of colour, music and wonderful shots show a more personal and mature side then what we were used to from Ragnorok."
    },
    {
      "rating": "7",
      "text": "\"Your mother took me in. She's kind. She treats me like a person.\"Taika Waititi is on a roll recently and rightfully so, because he's got a great comedic vision.'Jojo Rabbit' is a World War II satire that's both hilarious and surprisingly tragic. Joy, terror, love, hate all in one movie. Waititi knows how far to take a joke and how humor can put on light on ugly issues. While absurd looking on the surface, but on a deeper look it's something unique.Newcomers Roman Griffin Davis and Thomasin McKenzie take center stage upon the big cast. Their comedic timing, emotional range and overall performances are nothing short than impressive. Also Archie Yates is like the adorable child version of Nick Frost.Speaking of big name stars. Scarlett Johansson is having a fantastic year and she once again delivers a wonderful performance. Sam Rockwell is amazing in pretty much anything he's in and here is no different. Rockwell playing a closeted homosexual Nazi is hysterical, and yet meaningful when you look at it more thoughtfully.The weakest actor upon the cast has to be Rebel Wilson. I really didn't buy her as this character. I thought she's just doing her usual comedic traits like in every other movie, which I'm not a fan of.Not only is Taika Waititi directing and writing, but also starring as Jojo's imaginary friend of his very own idol... Adolf Hitler. Apparently Waititi didn't have to research playing Hitler, because he thought Adolf was 'a f**ing c***'. Anywhere, the concept itself is really bizarre and really fascinating. While silly and entertaining, but could've been left out, in my opinion. There was a point where he completely disappears from the movie to later reappear during the finale.At times I feel like it tries hard to be like a Wes Anderson movie, in terms of staging, quirky humor, and overall setting. Influence is one thing, but it came a point when it wasn't being it's own thing.Overall rating: Criticisms aside, I had an absolute blast. Endearing and highly vocal. I'm glad a movie like this exist."
    },
    {
      "rating": "9",
      "text": "Love is a powerful word & should never be used casually. This said, i love Jojo Rabbit & really, really can't understand how anyone can possibly think bad of it. It's a beautiful, funny & heartfelt piece of work & deserves every one (& possily more) of it's Oscar nominations."
    },
    {
      "rating": "8",
      "text": "I went into this only knowing that it's Taika playing Hitler as an imaginary friend to a Hitler Youth. I expected a comedy, what I got was a an incredible satire with comedic elements. This movie is deep and beautiful. I put it up there pretty close with Schindler's List, thought it's not quite THAT brutal.Since I don't want to give any spoilers, I can only say that I truly believe you will not be disappointed with it. To make a movie such as this with such a controversial subject and do it so well shows sheer brilliance on Taika's part."
    },
    {
      "rating": "7",
      "text": "Making fun of Nazi Germany is a double-edged sword, after all it serves as a satire but you also can't forget the horrors that happened back then.Jojo Rabbit swings between satire and a feel-good story. It manages to work and I don't think it was insulting. Written and directed by Taika Waititi, Jojo Rabbit is a movie that certainly borrows a lot from Wes Anderson. The opening sequence is more than evident and although that may be considered problematic for some, Waititi manages to emerge gracefully from the evident comparisons, though with its obvious ups and downs.Another point to emphasize is that you will enter the world of the movie or you will not and personally I think that depends a lot on whether you'll enjoy the movie or not.There's moments where I couldn't help feeling the film stretches a lot the absurdity, but once again Waititi manages to recover enough the pace so that things don't get out of hand.While not all jokes land and honestly the movie is never as funny as it thinks it is, passing the bumps, Jojo Rabbit shows the heart of its narrative that is the friendship between Jojo (Roman Griffin Davis) and Elsa (Thomasin Harcourt McKenzie), the young Jew girl that her mother (Scarlett Johansson) is hiding in their home.This is essential because Jojo being the main character and obviously the narrative driver only knows what he has learned so far, what they instructed him and is that the Jews are vermin therefore his growth as a character and evidently as a person lies in that plot point although obviously that's where the failure of the story lies because at this point that's not something that is no longer known or needs to be learned, perhaps it should be emphasized but not only towards the Jews but towards the whole world in general considering that kids today continue to be feed with that kind of hate.Jojo Rabbit is a conventional film but it stands out for its style and it's an honest story, as honest as its plot can provide. It's nothing special but personally I had a good time watching it and that is also what cinema is about."
    },
    {
      "rating": "7",
      "text": "First, let's get the whole \"it's somehting not to joke about\" out of the way. This movie is'nt just trying to get some laughs out of tragic events, but as well make fun of how stupid humanity can be sometimes. Some critics giving this movie implications like \"What is the point?\" Reminding even the same kind of critics Roberto Benigni's La vita è bella got for getting some humor out of this dark period of human history, hence completely missing the core of that movie which was positivity of hope for the future. And talking about Jojo Rabbit, though it really doesn't have anything too philosophical to say, it delivers what you sign up for: Having a good time and hope for the future!But of course it's not flawless by any means, there are some insinuations for romances here and there that do not get really to some point in the end. Some character motivationes, that may seem merely plain or somehow unexplained, can get the overall perception that secondary characters have in fact little care, with one very specific exception in the very end of the movie. Sometimes the plot can feel a tiny bit dragged or feeling like you have to wait a little bit for that important thing to happen.Now let's get the great parts on the table. The performances from the younger actors are really on point, and across the board the perfomances of the main characters are great, highlighting Waititis funny performance as Hitler and the realtion between each character with Jojo in a natural and realistic way. Scarlet Johansson can get from really funny to really compelling quite smoothelly, but on one very specific moment that was meant to be really sad and shocking, can actually get a little off putting or with misunderstood feelings that you may forget after 5 minutes; and that can be a problem, ther are very emotional events here and there that can get you on the edge of heartbreaking so to get back to the general feeling of comedy they appeal to use, although very comical, out of nowhere jokes which can be annoying for some people.And the best part of this movie, the feeling of hope and opportunity for the future that it reamins on one's mind for very long. It really pays off in the end as a movie which has something to say in a very heart warming way, something that can go around the sentiment of keep going 'cause it gets better."
    },
    {
      "rating": "10",
      "text": "A simply brilliant portrayal of Nazi Germany through the eyes of a child. Moments of genuine sadness, true comedy and (thankfully) pure joy. A really creative film and a must see for 2020!"
    },
    {
      "rating": "10",
      "text": "Best movie I’ve seen in many years. Funny, moving, brilliant. The look of the movie is amazing. A sort of awesome Anderson at the beginning when it’s more light hearted and funny. And deeper colors when it gets deeper in meaning."
    },
    {
      "rating": "10",
      "text": "It is a masterpiece and a must-see. It is funny and clever keeping me gripped the whole way through. Is one of the top ten best movies i haver ever seen."
    },
    {
      "rating": "10",
      "text": "Very lighthearted, soft and innocent film that everyone must watch. It manages to take a serious topic and narrate it in a manner which is acceptable yet fun."
    },
    {
      "rating": "9",
      "text": "This is one of the most original \"war movies\" I've ever seen and I LOVE war movies. A war movie with more heart and profound social message than anything I've seen in a very long time."
    },
    {
      "rating": "8",
      "text": "Very unusual, NOT a movie for young kids. A sensitive and extraordinary way to tell this story of a young boy's realisation of the horrors of Nazism. Performances all around are superb, especially by young Roman Griffin Davis. Highest praise for the treatment of a very difficult subject."
    },
    {
      "rating": "9",
      "text": "Sweet, funny, just a lovely film. Great cast and I’d be very happy to watch it again. Waititi has the golden touch right now. Go see this."
    },
    {
      "rating": "9",
      "text": "Satire on the Third Reich from the point of view of a teenage boy. The first act is extremely funny, the second is boring, the third is dramatic."
    },
    {
      "rating": "9",
      "text": "Jojo Rabbit was better then I expected. Taika Watiti manages to blend the sillyness and tragedy of the story into an excellent final product.The young kid playing Jojo was phenomenal, one of the strongest performances I've seen from such a young actor. Jojo Rabbit managed to make me laugh and pull at the heart strings, it's a film I'll watch multiple times in the future."
    },
    {
      "rating": "8",
      "text": "This has been a bad year for critics. I'm honestly wondering if metacritic has any value whatsoever anymore. Perhaps with the explosion of the internet, any idiot can be a critic. Joker, Jojo Rabbit and Lucy in the Sky are the few I'm aware of that have been way too harshly criticised. None of these films are classics but they're all very good films that have been deemed trash by critics. Well, they're wrong. These people shouldn't even have jobs as critics as they're utterly clueless. As long as these fools are in work this site is without value. Discover for yourself. **** the critics."
    },
    {
      "rating": "7",
      "text": "The story of an precocious but wimpy member of the nazi youngsters maybe not fits for all tastes. Not enough funny, but not lousy, either. Taika does his effort as a ridiculous Hitler but he isn't enough hilarious as Bugs Bunny and Charlie Chaplin."
    },
    {
      "rating": "9",
      "text": "How this hilarious and heartwarming movie for the critics is more than 30 points under an average reinterpretation of Little Woman is beyond me.  I mean, Greta is a good director, she made a good movie but Waititi with this film showed of being a real artist.  The ending of this movie alone have more cinematic value of all Little Woman.  It's a scream of joy and freedom in a world of darkness and pain. In the future will surely be rehabilitate as a classic."
    },
    {
      "rating": "7",
      "text": "Jojo Rabbit has a good story. The part with Hitler is more occasional then omnipresent. I especially like the acting. Very strong performance from all the actors. The film is not that offensive. It represents some aspect of that time in a very symbolic way, yet still menacing. I give it a 72%. It won't inform you about the war, but it's told with emotion and some dark humour."
    },
    {
      "rating": "8",
      "text": "First off, I'd like to address to what seems to be a common criticism in the other reviews. the impression of Hitler is goofy and in a way reminds me of mr. bean, however this is only how Jojo (our young protagonist) perceives him. Jojo idolises Hitler and has him as his imaginary friend so its only logical that a child sees his imaginary friend as child-like thus, the directors/ writers arent in any way saying the real Hitler was anything like how Jojo imagines him to be, they just made the imaginary version of him mirrors the boy which by the way was very comedic and well done  as for the rest of my review, Jojo rabbit is supurb, every character is believable and most are actually likeable which is a nice breath of fresh air when it comes to nazi movies. the film does a great job at showing not all nazis were crazy killing machines that believed in the aryan race concept(but its definitely talked about in the movie) and humanizes them greatly. it pulls heart strings effectively and takes on a good deal of themes and doesnt suffer for it  8/10 film, would see again"
    },
    {
      "rating": "7",
      "text": "I love the style, I love the jokes, and I love the message of this film. However, when the twist happens, it didn't really have much weight behind it. It should have been an incredibly heavy realization with some kind of fallout, but the main character doesn't seem to really have to deal with it. It just kind of happens and he continues to move on down the path he was already heading. That moment alone brought the score down for me. If Taika Waititi had nailed that tonal shift correctly, this could have gone down as one of my favorite films of the year."
    },
    {
      "rating": "10",
      "text": "This is the best movie that I have seen in all of 2019. It is a rare film that can break your heart and put it back together, again. I don't know if there is an over-abundance of Nazi sympathizers around that cannot grasp the satire, or not. I love this movie as I feel more than anything, it is a redemption story. It may be historical in nature, but it is still a work of fiction."
    },
    {
      "rating": "9",
      "text": "No, its not just another movie that makes fun out of the nazis. It makes fun out of the whole extremist thinking and ideas itself. You can see the war through the eyes of a 10 year old german boy, who got his brain washed by the nazi propaganda and he have his best sidekick, the imaginary Adolf Hitler. But this Hitler doesn't thinking like the real one in Berlin. No, he thinks like Jojo's darker side, like an evil 10 year old kid whos get confronted with Jojo's good side. Aside its incredibly funny scenes, there is some really dark scenes aswell which makes the audience really really sad and think about there is never any good reason to start a war and hate each other. This movie have a really biiig heart nad i love it. But for me, the main message of the movie is: \"It's definitely not a good time to be a nazi\" Yes. There is never a good time to be a nazi. Or anything extreme."
    },
    {
      "rating": "8",
      "text": "I didn't know what to make of this movie when I first watched the trailers for it. It seemed, to me at least, that it was gonna preach to the audience as one would expect in 2020. But after watching the movie I can say with full confidence that this is a fantastic movie. Taika Waititi knows how to get you hooked on a story. It's an emotional rollercoaster that will make you laugh and cry. I don't care if \"professional critics\" don't like how this movie tackled the topic. It wasn't made for them. It was made for moviegoers and if you like dark comedies, you'll love this one."
    },
    {
      "rating": "9",
      "text": "If you can get past the film's joyful tone in the context of such atrocity, there are wonderfully funny and cathartic moments to be had. And the performances are superbbbbbb."
    },
    {
      "rating": "9",
      "text": "Jo Jo Rabbit Was Funny and Sad. It opens eyes. It takes place on the last bit of WWII. It shows how the Third Reich brainwashed its citizens. Even the youngest and most vulnerable ones. I have always said I like to see a movie from the perspective of a German Citizen. There are some Historial inaccuracies. But they are minor. They put a lot of effort to make it as close as they can. It feels like a European movie. This is a must see movie. Taika Waititi took a Lesson from Mel brooks.    \"You have to bring him down with ridicule because if you stand on a soapbox and you match him with rhetoric, you're just as bad as he is, but if you can make people laugh at him, then you're one up on him,\" -Mel brooks"
    },
    {
      "rating": "8",
      "text": "A well-produced and well-acted satire of Naziism that uses humor effectively to entertain and at the same time point out the falsity and absurdity of the premises of the ideology."
    },
    {
      "rating": "9",
      "text": "What a fantastic movie! A wonderful story, very well written. Perfect art directing with excellent acting paired with great humor.Mr Waititi proved again to be one the greatest writer and director talent of his generation. Perfect casting and I applause to the young actors who brought the story to life. This movie is so much more than just a satire."
    },
    {
      "rating": "9",
      "text": "ok, let's talk about JoJo Rabbit, a film that certainly divided opinions. This film can be briefly described as a satire about Nazism, but this work is much more than that. JoJo Rabbit brings countless discussions that make the viewer think. Taika Waititi's direction is very interesting, as well as the script, which manages to develop the characters very well. Taika also acts in this film, and his role is very funny and very relaxed. All the performances in this film are very good, all are very well: Roman Griffin Davies, Scarlett Johansson, Thomasin McKenzie and Sam Rockwell. Another interesting point of this film are the changes in atmosphere, that is, the transition between funny moments and dramatic and more serious moments, there are scenes to laugh and scenes to cry. JoJo Rabbit is a very well produced film, with a very comfortable atmosphere, but at the same time very dramatic, in addition, the film has a very well directed children's cast and a story told in a different and relaxed way. It is a good job with very few defects."
    },
    {
      "rating": "10",
      "text": "A creative and entertaining take on one of humanity’s darkest moments in history.  While there are stylistic similarities to Wes Anderson, JoJo Rabbit was the most inventive movie of the year."
    },
    {
      "rating": "9",
      "text": "This is a great film. Funny, witty, entertaining, and at times surprisingly poignant and moving. Loved it"
    },
    {
      "rating": "10",
      "text": "Jojo Rabbit is a hilariously beautiful film that towards the end gets very sad, but its a beautiful film to look at as well. The movie is about being yourself and not following the crowd. If you havent watched it please do."
    },
    {
      "rating": "10",
      "text": "it is a sensacional movie, i think this movie wasn't made for cry, but i cried"
    },
    {
      "rating": "7",
      "text": "JoJo Rabbit Learns A LessonThe Stream: The whipsaw changes in tone can be disorienting and highlight lulls in the forward momentum of the story.The Big Screen: Compelling performances from a good cast bring offbeat humor and depth of emotion.The Final Bill: It is humorous with a distinct point of view and a heartfelt message, but if you’re not on the wavelength with that point of view, you won’t get it.-Trip FontaineHow do you solve a problem like Jojo? He’s a 10 year-old, Hitler Youth with Adolf as an imaginary friend. Does he understand what it all means? Or, does he really just want to play dress up and be a part of a club, as is suggested by one of the other characters. How does a 10 year old navigate this complicated and dangerous world? Jojo Rabbit explores these themes and more through a delicate balance of satire and drama. Taika Waititi wrote and directed Jojo Rabbit, which is based on a novel by Christine Leunens called Caging Skies; and he brings his special brand of boffo comedy – even portraying Jojo’s imaginary confidante, Adolf. It’s both wacky and serious. Sometimes it is both within the span of minutes.I have had a difficult time digesting Jojo Rabbit because I wanted it to be more impactful to me than I felt it was. It’s a coming of age story with many of the tropes that a coming of age story has. Jojo is destined to learn a lesson. On the other hand, Waititi, as writer, director and cast member, has a strong point of view about lampooning the ridiculousness of Nazism and through his brand of humor dismantles other hate-filled ideologies. In that way, the film is novel and a worthy viewing. The whole thing can be disorienting, which may take some audience members out of the overall experience of the film.Roman Griffin Davis plays Jojo. This kid is great. He has the weight of this sometimes silly and sometimes very serious movie on his shoulders. Through the eyes of this child, we see and question war, ideology, love and loss. Davis always seems appropriately in tune with his character. There are other great performances by Scarlett Johansson as Jojo’s mother and Thomasin McKenzie as the mysterious stranger Jojo develops a relationship with. I’ll say that Waititi’s Adolf is very impactful in his brief scenes; and there’s a hilarious and threatening cameo by Stephen Merchant. The only out of place and unnecessary cast member is Rebel Wilson, which is true of most of the roles she’s portrayed. No offense to you, Ms. Wilson.Overall, Jojo Rabbit is a good movie that should be seen. It will not be what you expect. The balance of comedy and drama achieved by Waititi didn’t always work to me. If you are not calibrated to this satirical tone, then you may not enjoy Jojo’s ride. I say proceed to the theater with caution."
    },
    {
      "rating": "7",
      "text": "I usually like Taika Waititi's movies but this one felt a bit short. It has all the details to be a good movie, but something is off..."
    },
    {
      "rating": "10",
      "text": "My absolute favorite film of 2019!It had so many good moments. Hilarious, sad, exciting and different.I laughed out loud so many times and at other moments really touched. Im going to look up more from this director.Only sad part is now I can never watch it again for the first time."
    },
    {
      "rating": "10",
      "text": "This film Funny, Dramatic, heartwarming and interesting. I would recommend watching this to anyone."
    },
    {
      "rating": "10",
      "text": "The best film I have seen in a long time. An emotional roller coaster so sad so funny and sweet and clinical."
    },
    {
      "rating": "8",
      "text": "A ballsy black comedy romance centered around the holocaust and the ending days of it. It surprisingly pulls it off well and shows the main characters as people who are or end up being against the war and Nazi in general. Good performances all around, especially from the young actors. Pacing felt correct, it ended before it became a bore. Many laughs had through the film."
    },
    {
      "rating": "10",
      "text": "I loved this movie! Taika Waititi got a very heartwarming style and every piece of his filmography it's deep, yet funny, and always incredibly smart. The work done here reminded a lot La Vita è Bella (Life is Beautiful) by Roberto Benigni – both having innocence/kids protected thanks to sweet lies and phantasies against the inhumane dread of nazionalsocialism. It is worth your view, and it's shameful to see so many bad reviews from criticts! Having directors like Waititi producing this kind of content it's just a blessing."
    },
    {
      "rating": "9",
      "text": "At first I was not sure I would enjoy this film as it seemed to poke fun at the events of World War 2, but as the film progressed it seemed to be a satire on how silly the Nazi's in the minds of children and how the realities of this war were much more terrifying."
    },
    {
      "rating": "10",
      "text": "Do critics just not get satire anymore? A beautiful, hysterical, incredibly well crafted masterpiece. I will have to watch it again to decide if this is my favorite from Taika or not."
    },
    {
      "rating": "9",
      "text": "A hilarious piece of political satire that isn't afraid to be seriousBased loosely on the 2004 novel Caging Skies by Christine Leunens, Jojo Rabbit is a political satire written and directed by Taika Waititi. Positing that the first casualty of indoctrination is objective truth, Waititi follows in the footsteps of filmmakers such as Charlie Chaplin (The Great Dictator), Mel Brooks (The Producers), Roberto Benigni (La vita è bella), and even Quentin Tarantino (Inglorious Basterds), in attempting to defang Nazi ideology by rendering it utterly absurd. Marketed as an \"anti-hate satire\", the film has no easy task – to use Nazism as the (mostly) humorous background to what is essentially a bildungsroman, without it seeming exploitative or dismissive. And Waititi manages this tricky balancing act exceptionally well. The satire and slapstick elements are as funny as anything in his filmography, and the film's more serious moments (of which there are several) arrive like an absolute gut-punch.Großdeutsches Reich, 1945. In the fictional town of Falkenhem, ten-year-old Jojo Betzler (an astonishing debut by Roman Griffin Davis) lives with his whimsical mother Rosie (Scarlett Johansson doing probably the best work of her career) and his imaginary best friend - none other than Hitler himself (a ludicrously over the top Waititi), or at least Jojo's conception of Hitler. Believing absolutely in his duty to the state, Jojo attends a Hitlerjugend camp run by the cynical Cpt. Klenzendorf (a powerful performance by Sam Rockwell that was outrageously ignored by the Academy), who was forced to leave the front line upon losing an eye. However, the overzealous Jojo is injured and forced to return home. At which point, he discovers his mother has been hiding a young Jewish girl, Elsa Korr (a nuanced performance from Thomasin McKenzie), in a crawlspace.The film mixes slapstick humour, caricature, satire, dramatic irony, and hope, but never does it seem like its ignoring or trivialising real suffering - when the comedy is dropped and Waititi gets serious, the tonal shifts pack a shocking punch. Crucially important to the film's tonal qualities are director of photography Mihai Mălaimare, Jr.'s bright, colourful palette and Ra Vincent's whimsical production design. Together, they speak to the fact that this is Jojo's worldview rather than objective reality, with the look of the film reminding me a great deal of The Grand Budapest Hotel (2014). It sure doesn't look like any World War II movie you're ever likely to have seen.Thematically, the film examines multiple issues; the devotion of motherhood, the importance of kindness in defeating indoctrination, the disconnect between unchallenged ideology and complex reality, the predetermined attitudinal stance towards the Other, the clash between doing what one knows to be right and what one is expected to do. Klenzendorf's arc is especially telling in this respect. Introduced as a hyperbolic caricature, the source of some of the film's biggest early laughs, as things progress, we realise there's considerably more to his character, and he commands what's easily the most moving scene in the whole film. This is Jojo's story, however, with much of the runtime concerned with his attempts to rationalise the cognitive dissonance between what he's been taught and what he can see with his own eyes.Of course, although set in 1945, Jojo Rabbit is really about today, as it mocks political extremism, particularly people who hate based on ethnicity or religion. Jojo's belief that Jews are demonic figures capable of powerful magic stands in for people who believe all Muslims are terrorists or all Mexicans are rapists. In this sense, the film is partly about the role adults play in inculcating children into hate and partly about exposing the power of propaganda to subvert truth. But so too is it about rising above such ideology, no matter how ingrained it might be. And although all of this is presented humorously, it never becomes didactic or monolithically preachy – Waititi balances his tones too well.Of course, Waititi does gloss over some of the more horrific atrocities carried out during the War. The Nazis in the film are, by design, cartoonish, although that is done so as to render them as easily dismissed. The reality, of course, was far darker, and it wouldn't have hurt to have at least one Nazi who isn't a figure of fun. In this sense, the film doesn't represent the awful truth, but it never claims to.Jojo Rabbit is beautiful, emotional, heartfelt, and devastating, but mostly hilarious and always hopeful. It's an extraordinarily sweet film without ever becoming saccharine, as Waititi strikes a perfect balance between comedy, tragedy, and drama. It's a very funny World War II film which imparts a vital message for our confused and divided world of today – if we let them, love will always trump hate, hope will always light a way through the darkness."
    },
    {
      "rating": "5",
      "text": "Meh. Wes Anderson meets The Girl in the Striped Pajamas. Hitler was funny, but overall it was boring. I also got an Its a Beautiful Life vibe off it, and I hate that smarmy **** Shame, I really wanted to like it."
    },
    {
      "rating": "10",
      "text": "Perfectly walks the line of comedy and seriousness, and whoever thinks it's making light of what happened in WWII, congratulations you missed the point."
    }
  ]
}