{
  "id": 60,
  "title": "Joker",
  "starring": [
    "Joaquin Phoenix",
    "Robert De Niro"
  ],
  "runtime": 122,
  "genre": [
    "Crime",
    "Thriller",
    "Drama"
  ],
  "description": "During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/udDclJoHjfjb8Ekgsd4FDteOkCU.jpg",
  "categories": {
    "plot": 9.4,
    "acting": 9.636363636363637,
    "ending": 8.333333333333334,
    "soundtrack": 10.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 9.666666666666666,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Ladies and gentlemen!!! THIS IS A MASTERPIECE. It is an INCREDIBLE origin story. One of the best movies based on a comic character. Joaquin Phoenix's performance is SPECTACULAR! Thank you Todd Phillips for bringing us this shocking story."
    },
    {
      "rating": "10",
      "text": "A must watch movie of the year especially the month (October).Joaquin Phoenix's performance was a masterpiece.Robert De Niro's acting was also mind blowing."
    },
    {
      "rating": "10",
      "text": "This wasnt a superhero film, and thank God it wasnt!!Joker is, by far the darkest and most tragic story in all of the DC universe.  Not only was it respectable to the source material, everything in the movie reflected what The Joker is, when you take Batman out of the story.  Fair warning:  the film is very graphic.  It holds nothing back.  Also dont expect a special fx show.  This is a sit down and shut up flick.  This is a film about madness, illness and sadness."
    },
    {
      "rating": "9",
      "text": "Joker is one of those rare movies that my only regret in watching it is that I can never watch it again for the first time. That being said, I'm not sure when if ever I could watch it again as it's such an exhausting experience. And I mean that in a good way. One of the best movies of this century so far."
    },
    {
      "rating": "10",
      "text": "I generally agree with Metacritic's movie score over Rotten Tomatoes but not this time. Forget the paid critics biased views of Joker and go and see one of the best movies of this century and maybe the last."
    },
    {
      "rating": "9",
      "text": "Joker is a hard film to love but an easy one to admire. As many others have commented, it is a very grim watch with only a few moments of gallows humor to lift the tension. That being said, I would urge any lover of cinema to see it. At least once."
    },
    {
      "rating": "9",
      "text": "I think the word 'masterpiece'is going a bit far but Joker is an amazing film. If Joaquin Phoenix doesn't get the best actor oscar award there really is no justice; he's that good."
    },
    {
      "rating": "9",
      "text": "Joker is deep, immaculate, powerful, and triumphant as you witness Joaquin Phoenix giving the Oscar winning performance of his entire career as the Clown Prince of Crime in 1970’s unforgiving Gotham City. All thanks to Todd Phillips’ inspiration from Martin Scorsese’s Taxi Driver and The King of Comedy, it is safe to say that this film is one of those films that will be talked about for a very long time. And there is no doubt that Joker can deliver a mature fish out of water story that is dark and psychologically brooding that every comic book fan needs to see. May the future of DC Black begin…"
    },
    {
      "rating": "8",
      "text": "Felt like more of an Arthur Fleck movie than a Joker movie. But in this case I think that worked in its favor. Honestly, when compared to other \"gritty\" and \"grounded\" dc comic book movies, this one actually works and is better than most. But, if you are going to compare it to something like taxi driver? Well then it's just average. It has some issues but nothing glaring. Overall I think everything works well. Not blown away but impressed."
    },
    {
      "rating": "10",
      "text": "the new “Joker” is totally worth to be considered as the best of DC’s movies now. gorgeous, breathtaking, horrifying but amazing."
    },
    {
      "rating": "9",
      "text": "Unrelentingly bleak but absolutely captivating. There's really nothing more that I can add to the praise it's already garnered. Go see."
    },
    {
      "rating": "10",
      "text": "The film is an excellent story of origin, departs from comics, and allows you to see the psychology of the character. You can also see that it has enough similarity with the current era in some attitudes quite well reflected. It is a movie to feel and think."
    },
    {
      "rating": "9",
      "text": "I went into this film knowing two things, the score from Icelandic composer Hildur Guðnadóttir (friend of Johann and Chernobyl musical genius) meant the tone of this film was going to be glum at best and Phoenix throwing himself into all his roles would undoubtedly deliver. Both of things for me at least were spot on.The story is desperately sad if not a little predictable, my only really gripe being  the use of on screen notes to move the plot along at times, I find trying to nail which part I am meant to be reading takes the immersion out a little and I’m pretty sure It happens on at least three occasions. Acting across the board is fantastic; I can understand why Phoenix has been called out by some reviewers but for my mind the Joker is meant to be over acted and his slow descent into madness is perfectly executed.Overall this feels like the sort of film you end up studying in English class, there is a lot to take in and you will have questions come the end. Not everyone will love this as it can plod a little at times but it’s a needed plot that adds to the overall mood of the film."
    },
    {
      "rating": "10",
      "text": "Don't listen to the critics who don't know the difference between art and reality. Go and watch the movie and make your own opinion.Joker is a masterpiece and JOAQUIN PHONEIX deserves all best actor awards of the year."
    },
    {
      "rating": "10",
      "text": "Is a joke not everyone gets.The critic can't decide if is good or not, so is up to you."
    },
    {
      "rating": "9",
      "text": "Great movie, it touches the themes of mental illness well, and the necessity of escaping pain by suicide.. That some people feels, this is a different joker, who is trying to accept his cruel life.. Great movie, only bad aspect is that it ends in a weird way."
    },
    {
      "rating": "10",
      "text": "We truly do live in a societyBut in all seriousness, this movie was amazing. A dark and disturbing character piece led by an Oscar worthy performance by Joaquin Phoenix. You really do feel bad for this guy, which makes it all the more heartbreaking when he inevitably becomes the clown prince of crime we all know and love, although we've never seen him like this. We see him suffer throughout the movie to the point we're almost rooting for himk to become a mass murdering psyco clown, because that at least will make feel better; then it happens and we just wish this could have all just been avoided, because es so messed up. We feel for him and care about him. By the time he's the joker, we wish we could've helped him. There's a lot of great nods to the greater Batman universe, yet the movie is a self contained character piece. It had me shaking and disturbed for a long time after I left the cinema, and that can only be the mark of a great movie."
    },
    {
      "rating": "10",
      "text": "One of the best performance by Joaquin, Bold and intense storytelling makes this one terrific and influential. Cinematography and set pieces were almost great. Don't miss this one"
    },
    {
      "rating": "10",
      "text": "Beautiful piece of art the acting the shots the intensity I was focused on the screen through out the whole movie"
    },
    {
      "rating": "10",
      "text": "There’s no word describe how amazing this movie is. This man deserves an award for this role. The real Joker is back!"
    },
    {
      "rating": "10",
      "text": "The most disturbing movie ever made. It is seriously a must-see and the critic reviews lie."
    },
    {
      "rating": "10",
      "text": "Gives a view of the darkest the world can be and builds up well to the worst day someone can have with that dark life, which births the Joker. Doesn’t glorify violence, (spoilers) with the main character being initially hesitant to take a gun from a coworker (first 10 mins of the movie) and he expected says he doesn’t have any political stance and just manages to fall into place because of the public’s reaction. Not a movie I’m planning on seeing a millions times in my life because of it being so hard to watch someone fall like the Joker does, but it’s a movie that needs an award. All the acting is great, the plot (while similar to Taxi Driver) is brilliant and the quality of the movie shows you don’t need CGI super powers to be a great villain in a Superhero movie."
    },
    {
      "rating": "9",
      "text": "Having just finished watching, I am stunned to say the least. Jaquines' portrayal of a sociopathic, mentally unstable man's transformation to the iconic Joker was non other than a grippingly accurate, realistic and touching rendition. As unfortunate event after unfortunate event baraded the Joker leading to circumstantial wrong-doings, I truly felt for the character, while also being aware that his actions were wrong. Amidst the action packed superhero movies presented today (and as much as I do enjoy those as well) this movie is truly in a league of it's own.  Joker takes the lore and characters we have grown to love and revere as immeasurable beings, and throws it in your face as an all too real, true to life possibility."
    },
    {
      "rating": "10",
      "text": "Joaquin Phoenix shines in this dark character study about one of the most popular comic book villains. The slow but rewarding direction is accompanied by an eerie score that fits perfectly with Joaquins Oscar worthy performance and will leave audiences feeling disturbed and uneasy,  exactly how the joker should make one feel."
    },
    {
      "rating": "10",
      "text": "Lived up to the hype, loved it, don’t listen to critics, they’re idiots, they got scared of this film, hence why the rating is low"
    },
    {
      "rating": "10",
      "text": "Amazing and beautifully haunting film. Joaquin Phoenix oscar worthy performance in another level."
    },
    {
      "rating": "10",
      "text": "Joaquin Phoenix gave extraordinary acting in depth as well as Tood Philips who was able to make the Joker the person I know best through his films."
    },
    {
      "rating": "10",
      "text": "Es una obra maestra absoluta, olvida los comentarios negativos, la pelicula no es aburrida y la actuación de Phoenix es, excepcional."
    },
    {
      "rating": "10",
      "text": "Данный фильм не рекомендуется любителем экшена, любителем комедий и прочей лабуды, фильм реально тяжелый, я был на третьем сеансе мировой премьеры, видел улыбающихся и смеющихся людей, которые заходили в зал с огромным количества еды.Я то знал на какой фильм пошел, а вот большинство зрителей увы нет, и моему удивлению не было предела когда на 20 минуте фильма и до самого конца, я не услышал ни одного звука в зале, люди смотрели закрыв рот, забыв про свою жратву. Теперь о фильме, повторюсь фильм тяжелый если в него вникать, а вам придется это сделать иначе вы не поймете фильм, это не Marvel, не каких глупых шуток и сисько-жопного юмора, но свой юмор все таки есть, в этом фильме всего около 15 выстрелов из револьвера. Игра Феникса на уровне, я не такой критик что бы как то дать оценку, этот Джокер хороший ответ Джокеру Хита, в гримме данный Джокер выглядит на много круче Леджера, один минус это акер дубляжа, хотел бы я посмотреть его в оригинале, и обязательно посмотрю. Моя оценка 10/10, возможно даже больше, фанатам DC фильм зайдет и тем кто попытается в него вникнуть."
    },
    {
      "rating": "10",
      "text": "Joker Movie is a dark and emotional movie that hides behind the laughter of Joker . A disturbing movie but powerful performance by Joaquin Phoenix is the beginning of new era.It is one of the best example on flim making... Pure art work with camera( Less VFX expenditure)Take a bow Todd Phillips for your excellent execution. Inspite of Todd Phillips's confirmation that Joaquin's joker won't meet Pattinson's Batman, I believe Todd and Joaquin,Both should reconsider their decision to unleash full potential performance against Robert's batman. Because joker needs batman in order to show his full potential. This movie is \"the raise of the joker.\""
    },
    {
      "rating": "10",
      "text": "This was farthest thing from what you expect from a \"superhero\" universe type movie. Even if this movie had a different title and stood alone it would have been just as great! The writing was absolutely amazing. The mood set for the different scenes and the slow uptick of this movie was absolutely on point. Phoenix deserves every accolade possible for this stunning portrayal. Would reccomend for anyone tha appreciates deep writing, dialogue amd the classic sense of how a truly timeless movie is put together!!!"
    },
    {
      "rating": "10",
      "text": "The movie is an absolute masterpiece.Joaquin Phoenix's performance is OSCAR worthy as well"
    },
    {
      "rating": "10",
      "text": "I find it somehow disturbing, yet undeniable amazing. Joaquin Phoenix did a great job in both being a normal person with bad days and the Joker, the one we are familiar with."
    },
    {
      "rating": "10",
      "text": "An amazingly well crafted masterpiece with perfect acting, great story, thrilling moments, great camera and actual deep message. Phoenix is perfect for the role and his depiction of a joker may be the best i have ever seen.BTW: go see the movie dont let yourself fool by urinalist \"professional\" critics who started their campaign to denigrate the movie almost right after the first trailer. Remember those same people think that utter trash garbage like the last jedi or captain marvel were good movies. So go to see the Joker its the best movie about comic book character in many years"
    },
    {
      "rating": "10",
      "text": "Great movie! Sometimes I feel these so called critics do not know a good movie and good acting even if it slaps them in the face."
    },
    {
      "rating": "10",
      "text": "Truly spectacular! It's been SO LONG since I've seen a movie with QUALITY, something that makes you think, something that's different and as creative as this. Honestly... just when I was starting to lose faith in the movie industry this comes along and blows me away, it gave me that feeling of \"finally! A movie we've been desperately needing in the age of reboots and remakes and remasters and live cartoon adaptations and political correctness BS\" this is the direction the movie industry has to go and keep going. It's exactly what I personally always wanted as a Joker movie, a character study analysis about a broken man. Joaquin Phoenix deserves an award for his performance he killed it and honestly crushes all the previous Joker's that came before him that we've seen on screen and that's a huge statement. That laugh will send chills of disturbances down your spine every single time. It's a mix of sadness, confusion and just downright creepy I will even dare to say it's better than Mark Hamill's laugh. Make of that what you will. Acting? Superb!! Atmosphere and tone was perfect for this style of movie very depressing. Story? I won't spoil but it is very engaging, makes you think and you definitely feel for the Arthur. You'll be asking yourself questions even after the credits roll. No post credits by the way so don't sit through it. Music is a huge plus the composer really made the perfect soundtrack for such a film, she captures the mood and mentality of Arthur with every key note played a real treat. Loved it, I don't care what anyone says this is a 10/10 to me. If you love the Joker, or just a very good thriller about a broken man - watch this you won't regret it. Also - the snowflakes crying about wanting this banned because of violence? Ha... there was hardly any. I think other movies are worse in that regard, more drama than action if anything so no it won't promote a mass shooting or anything like that if anything it helps raise awareness on helping the mentally ill. Don't believe the fake news and mass hysteria, do yourself a favor - watch it and make your own judgement.Joaquin Phoenix man... that guy never fails to impress."
    },
    {
      "rating": "10",
      "text": "uma obra impecável e simplesmente perfeita, joaquin vc é lendário, taca um oscar nessalenda"
    },
    {
      "rating": "10",
      "text": "Uma obra de arte! Perturbador e encantador ao mesmo tempo, necessário para nosso tempo."
    },
    {
      "rating": "10",
      "text": "That's beautiful. Лучше фильма в наше время, с такой актерской игрой вы не найдете."
    },
    {
      "rating": "8",
      "text": "Gorgeous film, haunting score and a pretty incredible performance from Joaquin Phoenix. It's a slow burn, and I can definitely see where the film will turn a lot of people off, but I really liked it. ﻿"
    },
    {
      "rating": "10",
      "text": "Um filme perturbador porém INCRÍVEL!!, Joaquin Phoenix fez mais do que um ótimo trabalho, o filme está impecável, sinto que o Oscar é de vocês."
    },
    {
      "rating": "7",
      "text": "The Joker is an entertaining movie and its depiction of the titular character was compelling from begging to end.  Joaquin Phoenix's performance was outstanding and will be remembered as on of the better Joker performances. Unfortunately, the movie falls flat when it comes to its themes and what it wants to say.It seems like it wants us to be on the side of the working class. After all, the joker is a working class man who's issues are exacerbated by the upperclass. The government cut funding to mental health services, leaving him without his therapist and medication. Thomas Wayne seems uncaring and critical of the poor and even his celebrity hero made jokes at his expense.  Following the Joker's actions, you can see how the class divide came to a head with the working class finally having enough of the oppression of the upper class and want social change.However, this falls apart when you consider the actions of the Joker and rioters. The Joker, while more sympathetic in this iteration, is still a psychopathic killer and he is propped up as the hero of the working class. The working class started rioting and one even murders the Waynes in the alley as a form of revenge on the upper class. If the film wants us to take the side of the working class as the ones being taken advantage of, it failed.  The upperclass were **** but the working class are dangerous criminals. This isn't helped by the fact that the movie showed the murder of the Waynes. We all know what will become of young Bruce. He becomes the hero of Gotham.  He is also the top 1% Billionaire playboy. So eventually the hero of Gotham will be a rich man saving Gotham from people like his parent's murderer, who happens to be a poor and angry at the rich.Even if the movie wanted to try to take a 'both sides' argument, it fails because the  actions of the working class were way worse than the actions of the upperclass.  The upperclass are the ones getting murdered in the streets. The working class are the ones idolising a killer clown. It seems very one sided."
    },
    {
      "rating": "10",
      "text": "The best film of the year and the best film of DC all timeJoaquin deserved an Oscar"
    },
    {
      "rating": "7",
      "text": "Coming from the dude who made the hangover films (which I dont think highly of) I was surprised to see joker, not watching any trailers I was surprised with the final product. Acting was amazing. Cinematography was phenomenal. However the major flaw to this film is the pacing. It jumped alot and there were moments where I asked myself why this part was important. Lots of slow mo wide shots pan the film tine to reach over the 2 hour mark. Its action is intense which is brilliant. Watch it"
    },
    {
      "rating": "10",
      "text": "Absolutely amazing, thought provoking movie that is more to do with mental health, modern society and culture than anything else.  Much better than mindless fantasy drivel; for although this has roots in fantasy storytelling, it paints a picture that is well within the bounds of reality and that will resonate with people of all ages and backgrounds.  10/10, magnificent.  Oh, and that Phoenix guy does and OK job, too.  :-)"
    },
    {
      "rating": "10",
      "text": "Wow, relatively uncontrived drama from a big Hollywood movie.  When was the last time?  This movie surely slipped under the studio's radar.  Almost like they knew it was a gamble and green-lit total creative freedom.  Fantastic!  The soundtrack, both original and licensed, the setting, the pacing, the scene composition, the dialog and the story were all excellent.  I'm not sure the actor was the best fit for Joker, but he did a great job regardless.  He hit the somber lows really well, and the lows were necessary fuel for the Joker's highs that he performed satisfactorily.  There was still slight room for improvement, but not enough to push it out of the 10/10 slot: the movie could have ended 5 minutes earlier and been more subtle in a few places, almost like the director is asking \"Did you get it?  Let me explain it for some of you\", but overall, this goes well beyond expectations for a comic book movie.Now give Watchmen the same treatment!"
    },
    {
      "rating": "10",
      "text": "Psychiatrists will call you \"crazy\" and prescribe you drugs. Hypocritical people will tell you \"I care about you\" when they kick you in the ass. Whenever someone dares to speak about it, is beaten up. But the Joker puts some paint on all that and really stands out. He does care about things, although in a way that will hurt, just because most people are unable to face the ugly truth. Masterpiece."
    },
    {
      "rating": "10",
      "text": "La pelicula me ha encantado! Creo que es la mejor que he visto en mucho tiempo. La recomiendo 100%"
    },
    {
      "rating": "10",
      "text": "Easily Oscar material. Joaquin takes us on a tour de force into the insanity of a psychotic derange criminal from a beginning of a begnin man who struggles with mental illness and poor social circumstances. I absolutely loved the movie and I WILL watch it a second time in a Cinema, which is something I do not do ever.The storytelling, the in setting logic, the lore of the Joker, all was respected and all fitted. Well worth your money."
    },
    {
      "rating": "10",
      "text": "Wow, I have to say I left the theater not knowing what to think, and I mean that in the best way possible. Never have I seen a film blend both fantasy and reality together so well since Pink Floyd The Wall. Excellent work to the filmmakers and the amazing actors."
    }
  ]
}