{"id": 70, "title": "Jolt", "starring": ["Kate Beckinsale", "Stanley Tucci"], "runtime": 91, "genre": ["Action", "Thriller"], "description": "A bouncer with an anger management problem goes on a furious and resentful rampage after the murder of a friend.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/gYZAHan5CHPFXORpQMvOjCTug4E.jpg", "categories": {"plot": 3.411764705882353, "acting": 4.0588235294117645, "ending": 4.5, "soundtrack": 5.0, "cinematography": 2.0, "familyFriendly": 3.0, "funny": 6.666666666666667, "action": 4.590909090909091}, "reviews": [{"rating": "3", "text": "Kate Beckinsale can play the badass role without any problem.The Underworld saga is her legacy despite its quality, but that's the only thing that could be mentioned about this painful and sloppy story in which they try to turn her into a kind of female Crank while using a true behavioral disorder as a catalyst and to some extent a punchline.Jolt is trash released as a big name by Amazon.Here's the true death of cinema in a movie that would've died miserably in the theaters."}, {"rating": "4", "text": "(Mauro Lanari)If you're an over 40 actress and have some precedents in action movies (like Theron too), then the offer of a female vengeful version of Wick or Crank is inevitable. Despite being as brilliant as a graphic novel, it leaves no memorable traces."}, {"rating": "2", "text": "A mess of a movie.With a clearly aging Beckinsale unable to do most of her own stunts, a movie all about violence and fighting joins the list of terrible jump cut spammed monstrosities. She's still got the look and the voice, but the movie would have been better with a younger lead.The story was straight forward and predictable.The characters were split between really well done to complete garbage caricatures.The cinematography had some nice shots and some terrible low quality slow motion.Will probably never watch it again"}, {"rating": "8", "text": "Super fun dumb action! I hope this is a trilogy. I am going to say this and hope it doesn't offend. This movie is John Wick with a Chick and I want more."}, {"rating": "2", "text": "Promising start of this movie quickly changes into cheap inconsistent mess. Packed with great deal of woke nonsense but missing proper story. Locaions on a budget. One more thing... the protagonist need logopedic training due to very bad articulation of words. Did not finish acting school? Verdict... you can pass this garbage."}, {"rating": "10", "text": "For something that's could have been just fun, this has an impressively well realised lead character, which lifts it above the standard formulaic action movie into AAA territory. Despite her condensed back-story, within a few minutes of Kate taking over the role you totally get her. Then you know everything is going to go pear shaped, and fortunately the pacing is excellent. The action scenes are brilliantly staged, being visceral and believable. While the film is self-contained, I hope we get to see what she does next."}, {"rating": "1", "text": "La jolie Kate a dû (encore) passer sur le billard… parce qu’elle ne fait (vraiment) pas ses 48 balais !… je féliciterai personnellement le charcudoc ! Cela étant, elle n’est certainement pas mollassonne et on voit bien qu’elle s’entretient. Elle reste de fait une sacrée bonnasse, ma foi (bravo le charcudoc… non je suppose que ce sont les pilates, tout ça et tout le reste !).Quoi qu’il en soit, Kate joue ici la fille très nerveuse, sujette à des crises d’ultra-violence pour un oui ou pour un non… ce qui fait penser d’une certaine façon à l’excellent Serial Mother… à une grosse différence près cependant : Jolt est très mauvais !Ce n’est en effet même pas un nanar d’action au moins correct mais une simple comédie de merde à l’humour souvent graveleux, vulgaire et con (« vous pétez dans l’ascenseur ? ») dont le scénar tout foireux s’avère… pratiquement inexistant. De toute façon, on ne se donne même pas la peine d’aller jusqu’à la fin de cette production Amacon : on a mieux à faire… malgré Kate !"}, {"rating": "4", "text": "Forgetable. What a shame.They wanted their own, female version of \"Crank\" with Jason Statham. And it could've been great action-comedy if they went full on crazy, but instead we got this bland soup of \"meh\" action scenes, boring vilains and bad writing.P.S. Kate is still great. I'll take any bad \"Underworld\" sequel instead of this mediocrity."}, {"rating": "4", "text": "Как Бекинсейл согласилась сниматься в этом мусоре, фильм просто скучный, диалоги не интересные, сюжет вообще банальный. Настолько он бездушный и трешовый, просто нет слов, зарывает актриса себя всяким хламом. Жалею о потраченом времени, фильм днище."}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "7", "text": "Jolt, released in 2021 as an Amazon Original, stars Kate Beckinsale as a fem fatale with anger management issues.  I feel that this movie could have been a 10/10 if it were not for some writing issues.  Just so you know, this review was produced with my wife's approval, so please don't take this the wrong way when I say that the film is riddled with misogyny references, bad jokes and cheesy, cliché plot lines.The Good: Kate Beckinsale (Underworld, 2003) and Stanley Tucci (The Hunger Games, 2012) do a phenomenal job at portraying their characters.  However, their combined AAA stardom eclipses the rather lackluster performance of most of the rest of the cast.  This is the problem with hiring Triple-A Hollywood stars and pitting them in roles alongside TV actors.The Writing: This is where the movie can be hit or miss for many people.  In my case, I *mostly* enjoyed the movie.  If you can stand the misogyny jokes and some poor performances, then you will enjoy this movie.  It was not horrible, and in fact the writing has some brilliant moments that make you feel at awe.  However, it is clear that this is writer Scott Wascha's first film.  At some points it seems that he is trying too hard to make the audience laugh.  On one particular scene babies are involved and it is meant to be funny, but is actually kind of dumb.  Some viewers may find it funny, though so I won't knock off too many points for that scene.  Unfortunately, there is just enough to hate about the writing as there is to love, and so it cancels out in the end.Overall:  If it were not for Beckinsale and Tucci's performance, the movie would fall flat on its back.  Overall, Jolt delivers just enough electric volts to keep you entertained for one viewing, but is ultimately not worth watching again.  My advice is to watch it once for a good time, and then forget about it."}, {"rating": "9", "text": "So much fun! The action is amazing, but the main character is incredibly funny, and following her journey to kick everybody's butt is a delight. Funny, messy, corny. Great combo!"}, {"rating": "3", "text": "Horrible wannabe action film that was so contrived that it was probably dumped yet again on a streaming service. It aims to become a John Wick like franchise, yet fails to deliver any memorable action set pieces whatsoever. Moreover, if you see the arc of this character, she would have looked like a 'Ronda Rousey'- MMA type person, not somebody like Kate Beckinsdale.  You are lead to believe that somebody as dysfunctional as her would be patient enough to draw perfect make up, and looking great throughout the movie. Again folks, believability and context are important in these types of flicks. So when they went ballistic with the action sequences, audiences would go on with the ride. This one didn't achieve that purpose."}, {"rating": "6", "text": "For starters, I love Kate Beckinsale. She plays a really physical role here and kicks a whole lot of ass in this movie. Shes entertaining as hell here and makes a predictable and run-of-the-mill premise entertaining."}, {"rating": "5", "text": "Jolt was a forgettable action film that tries to shoehorn in a sci fi muffin reason for the main characters super strength and fighting skills but ultimately the screenplay was lacking and the action scenes were mediocre overall. While the cast were excellent, it felt like a tired attempt in its overcrowded genre."}, {"rating": "9", "text": "Very good movie, Amazon Prime is starting to make pretty good movies, the only downside is that if you don't have an OLED TV, you don't take advantage of the quality of the movie."}, {"rating": "2", "text": "What a disappointment.Considering the budget that was available for this movie, the result is an utter failure. The writing is just horrible with both the story and the characters seeming like early attempts at a movie by some college students.In a lot of scenes you have to sit there and realize how the plot and characters are completely incoherent. I honestly expected that there would be a superhero reveal at some point, because the punishment Lindy (Kate Beckinsale) can dish out as well as soak up, is way beyond what any human being could. Her condition does not explain it at all.It's a shame that Kate Beckinsale wasn't put to a better use than this. But also many of the other actors would have had a lot more potential than what they were allowed to show here. It is sad to see that the director didn't have the first clue as to what to do with them.You'll be needing a lot of booze to enjoy yourself with this movie, as it offers nothing above average and even only a few moments reach a level of mediocrity. I recommend you skip this movie entirely."}, {"rating": "7", "text": "I enjoyed it. While i watch movie \"Kate\"just before this where also main lead is female and is goin around shootin bad guys etc - here at least there was an interesting twist. Of course it was not realistic at times but I still think it was interesting and with action throughout."}, {"rating": "3", "text": "Gives people with IED a bad name, by \"scaring\" people into thinking they want to murder you randomly. IED is a form of PTSD, NOT sociopathy.With that said, the action scenes were okay, but then the film ends up ruined by the CIA testing subplot."}, {"rating": "4", "text": "Beckinsale does a fine performance but the movie alone is not much to get excited over. Poor storyline."}, {"rating": "2", "text": "SHORT VERSION: Unexpectedly low budget, bad choreography and nonsensical writing make this movie not worth watching. Not even for free. Avoid.LONG VERSION (may contain some spoilers):When I watched the trailer I knew this was going to be a story about how evil men are and how righteous it is for a woman to beat them up. It's a fashion trend that's not going away any time soon, so I accepted it. However, I thought that, at least, this could be an entertaining popcorn action movie with good production value: it's got Amazon's money and a good cast... right? Nope.The whole movie is shot in a set that tries to reproduce an intersection with two or three blocks in each direction, plus a number of indoors locations (most of them one-room, empty). There are no gun fight scenes. The two or three hand to hand combat scenes that are there, are terribly choreographed and shot, with close shots and continuous changes in camera angles to hide what's really happening.Then there's the writing. The premise of the movie is how the condition that afflicts the main character shapes her life... but you get all her background in a narration dump in the first five minutes. The movie then proceeds to show you her daily life and, for those 15 minutes, you kind of get to sympathize with the character (any sympathy you could have for her vanishes when later in the movie she uses a baby as a human shield, but anyway...). But then we move into the \"revenge story\" which takes most of the movie. Here's where the writing goes out the window, especially with the main character saying a one-liner after the other, all of them taken from bad comedies from the nineties that do not make any sense. It felt like the writer (whose only credit on IMDB is this film) tried to convey the notion that the main character copes with her condition through humor, but failed miserably at it.Looking at the few prior credits of the director, it looks like she wanted to make a movie about a girl with a condition trying to have a normal life in a world filled with evil and / or stupid men; but she had to comply with Amazon's mandate to make an action flick, with the additional restriction that  most of the budget went into hiring Kate Beckinsale.Avoid this flick at all costs. Not worth your time; not even for free."}, {"rating": "6", "text": "Prime Video released a new action, thriller, Jolt this weekend. You don't even have to leave your home to see Kate Beckinsale kicking butt and not caring about names. Yes, Jolt is one of those action, thrillers but with a twist dealing directly with the lead character's mental health. Kate Beckinsale plays Lindy, a woman who has severe impulse control issues characterized as intermittent explosive disorder. She gets pissed and strikes out in an uncontrollable rage. Lindy has gotten her rages in check with a contraption she wears that will send a shock, or jolt of electricity, if you will, to her. In order to bring some normalcy to her life, Lindy goes on a date with Justin (Jai Courtney), who seems to be a nice guy and a prospect for a lovely future. When Lindy finds out the next morning that Justin was murdered, she sets out on a hunt to find his killer and avenge him. Fights and mayhem ensue.Above, I gave you a quick plot synopsis. The issue with Jolt is that it makes absolutely no sense. Okay, someone avenging the death in a murderous rampage is par for the course of most action thrillers. The part that is ridiculous here is that Lindy has been on two dates with Justin. Why would she go on this long, violent odyssey to avenge his death? She barely knows him! It does not make any sense that she would do what she does in this movie. Yes, Kate Beckinsale is good, aside from the stupid blonde wig, and she is at least passable in the fight sequences, but the motivation of the character is unbelievable. Unfortunately, that's all there is to this movie.There are two good things I will note: First, the runtime is short. I clocked it at an hour and 22 minutes, or so before the credits. Although, I do think that the movie goes on a bit after it actually should have ended. Otherwise, there isn't any wasted time. Second, predictably, there are two cops (Bobby Canavale and Laverne Cox) chasing Lindy as she tears through the city looking for Justin's killer. The best scene of the movie that made me laugh out loud took place during a chase scene between Beckinsale and Cox in a hospital. I won't spoil anymore than that. At the very least, that scene is a must see.Ultimately, Jolt is a ridiculous thriller with a premise that doesn't make a lot of sense. The mental health issue of the lead is treated rather flippantly, but while there are good fight sequences, it doesn't add up to much. If you have an hour and 22 or so minutes free and nothing else to watch, then grab a handful of popcorn for this one should hold you."}, {"rating": "9", "text": "Gotta love Kate in this one.  Writers and editors let the actors down a bit."}], "recommendations": ["the_old_guard", "sabotage", "honest_thief", "miami_vice", "the_ice_road", "mile_22", "shadow_in_the_cloud", "suicide_squad", "unhinged", "wild_card", "wanted", "salt", "mechanic_resurrection", "man_on_a_ledge", "3_days_to_kill", "the_november_man", "kingsman_the_golden_circle", "infinite", "taken", "the_mechanic", "jumper", "red_sparrow", "wonder_woman_1984", "next", "lockout"]}