{
  "id": 4017,
  "title": "Joy",
  "starring": [
    "Jennifer Lawrence",
    "Robert De Niro"
  ],
  "runtime": 124,
  "genre": [
    "Drama",
    "Comedy"
  ],
  "description": "A story based on the life of a struggling Long Island single mom who became one of the country's most successful entrepreneurs.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/drHYguFkQO4nQQFUhRYqIbl45oT.jpg",
  "categories": {
    "plot": 5.9156626506024095,
    "acting": 5.769230769230769,
    "ending": 3.4,
    "soundtrack": 5.0,
    "cinematography": 7.25,
    "familyFriendly": 6.0,
    "funny": 5.125,
    "action": 4.666666666666667
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Jennifer Lawrence made a name for herself by starring in The Hunger Games, and she's easily one of the most recognizable actresses in Hollywood. But what does she do now that The Hunger Games has ended? Her first post-HG project is reteaming with David O. Russell, director of Silver Linings Playbook and American Hussle, which netted her one Academy Award win and two nominations (including Joy). Although Joy wasn't as well-received as their other pairings, it still gives Jennifer Lawrence a movie to carry on her own without a franchise title to support her. Joy is a biographical film about the life of Joy Mangano, the inventor of the Miracle Mop, because evidently she needed a biopic. She grew up in a home where everyone around her had a dead-end job, and her grandmother was the only source of optimism for Joy. By the time she's 30, Joy is a divorced mother of two, working a dead-end job, her parents are divorced but still live with Joy, and her ex-husband lives in her basement. To add insult to injury, her sister constantly humiliates Joy in front of her children. The rest of the film is Joy overcoming these obstacles to become an overnight success with her first invention, the Miracle Mop, and selling the product on QVC. It is one of those inspirational bio-dramas we get a few times a year, but it never feels overly sappy or fake. The real issue is the film's first half which drug on about 20 minutes too long hammering in how much the characters' lives suck. Once Joy makes the prototype for the Miracle Mop and starts her business, the movie's quality picks up immensly. You actually start caring about the characters rather than just saying \"Wow, their lives suck.\" The ensemble cast, which includes Lawrence, Bradley Cooper and Robert De Niro, does typically great work and salvages the movie's slower parts. Joy is definitely one of those movies that you really go see for the cast, but it's often fun to watch Joy's race to the top even if it takes a long time for her to start."
    },
    {
      "rating": "6",
      "text": "Joy has a lot going for it that ultimately makes me like it more than not, but it is undeniable that this is a deeply flawed film. For starters, Jennifer Lawrence and the entire cast is phenomenal. Many claim Lawrence did not deserve her Academy Award nomination, but my God did she ever. She was stupendous. Not my favorite performance of the year, but certainly up there. Bradley Cooper and Robert De Niro were also quite good. Additionally, the pacing was fine, the film was always captivating, and the story had some very good comedic moments that had the whole theater in stitches. However, that is about where it ends. Yes, Lawrence's acting is good enough to outweigh everything else, namely the story. The story and the way it was written is deeply flawed. Based on a real woman, I have to assume the real story could not have been that bad that they had to Hollywoodize everything. Not only does Joy's story follow the traditional character arc and story structure a little too well, it just feels so fake. Even more, much of it designed to remind you of how strong a woman Joy is. I get that she is strong and independent, but I do not need a reminder every five seconds. I have no issue with strong women, but a film about one does not need to keep reminding you of such. Instead, it should demonstrate it. However, this is a sin the film commits quite often, as it often tells rather than shows, namely in the form of its narration. Entirely useless, the narration here is a major cop-out and is used solely to have forced exposition and connect scenes together. The script finds ways to get worse, however, as all of the characters are one-dimensional. Real humans do not act this way, let alone ones allegedly based on real ones. In particular, Joy's half-sister seemed to cruel and mean, yet there has to be more to her tale than the film let on. Ultimately, Joy is compelling, funny, and incredibly well-acted by Jennifer Lawrence, but its story handicaps it throughout."
    },
    {
      "rating": "6",
      "text": "Jennifer Lawrence and Bradley Cooper deliver typically brilliant performances in an otherwise mess of a film that works in parts but not at the full sum."
    },
    {
      "rating": "9",
      "text": "This movie definitely is one out of the three best movies released in 2015. Good story different from other movies and wouldn't have been the same without Jennifer Lawrence. No one could pull of the role of Joy better than her!\rThe other two best movies released in 2015 are:\rStill Alice\rThe Hunger Games: Mockingjay Part 2"
    },
    {
      "rating": "6",
      "text": "What a rags to riches story!  Is it all true?  Mostly true?  Joy comes from the ultimate dysfunctional family.  To see where she came from to where she ended up is a miracle.  Unfortunately, the making of the movie did not thrill me, no matter how great the story of Joy.  The movie is over 2 hours long, maybe some editing would have made it better."
    },
    {
      "rating": "4",
      "text": "I can not say that Joy is a bad movie, but it does feel disjointed and not so much because of the script, but the director who apparently never seem to know what he wanted to do with this story. Regardless of the performance of Jennifer Lawrence, the film barely survives by itself."
    },
    {
      "rating": "6",
      "text": "Jennifer Lawrence barely holds this movie together. Joy has a few memorable scenes but the film suffers from a weak story that isn't all that interesting."
    },
    {
      "rating": "1",
      "text": "This movie is joyless for the viewer.  Even the \"happy ending\" is not happy for the character or the audience.  The actors played their parts well but the movie was boring."
    },
    {
      "rating": "1",
      "text": "One of the most boring, awful messes of the year.  Save for a few moments when Lawrence goes off on people when her entire world is threatened, it's not dramatic, it's not funny, and it'sunwatchable.  The entire story is narrated by her alleged grandmother, which makes for the most boring and tedious exposition imaginable.   Joy is this alleged genius inventor, but you never see any of it - it's just told to you.  It's just all over the place, and I couldn't care less about any of them."
    },
    {
      "rating": "9",
      "text": "This is a terrific film about the human spirit and how against all odds you can sometimes succeed.  The cast are all great here especially Jennifer Lawrence who really gets you to root for this character and her never say die attitude.  David O'Russell does fine work again behind the camera as well.  A"
    },
    {
      "rating": "1",
      "text": "Who wants to watch a movie about the creator of a mop? Nobody. Don't get me wrong, I'm a big fan of David Russell's previous work, but Jennifer Lawrence has definitely worn out her welcome. Huge snoozfest"
    },
    {
      "rating": "2",
      "text": "David o' Russell was sitting in his kitchen at his wit's end. Then he saw his mop...\rHe should have gone to bed.\rSome minor patenting legal speed bumps, nothing to worry about. House wife does good.\rSorry, don't want to ruin this masterpiece of domestic efficiency, but...... write a goddamn story.\rNew mop from JML is the last chorus of the one-time lucky film-maker.\rI've got an idea for a career-killer. Sorry, just seen someone has already sliced bread.\rI feel like a lazy bastard."
    },
    {
      "rating": "2",
      "text": "- No Drama + No Comedy - Stakes = Zero Story -\r Mostly, the everyman applauds when another everyman struggles against odds to find success. Sometime those struggles are herculean. Not the case in \"Joy.\" While the real life, inventive Joy deserves kudos, the bottom line is this is a feature film about the creator of a better mop.\r Russell struggles, unsuccessfully, to portray as harrowing the path to the mop. Joy (Jennifer Lawrence), deals with a houseful of kids, only a few of them children by age. The motley crew in a small house is not on Joy's side. She is the breadwinner, the adult, the rock whose imagination is a liability to those overly dependent on her. It's a paint-by-numbers affair from there – familial jealousy, dirty financial dealings, the nightmare foretold by the old saw, \"Do not do business with your family.\"\r The only one with an eye on Joy's genius is Grandma (Diane Ladd). Joy uses her small crumb of encouragement to build a mop prototype. She brings it to QVC where the initial sale segment bombs. Slick QVC huckster Bradley Cooper takes a chance and allows Joy to showcase the mop herself. Bingo! The mop sells out. Success? Nope. The parts supplier is screwing Joy, every sale of the mop loses money, and the family wants their money back. Financial ruin follows. Then Grandma dies. But the plucky Joy womans up to settle all scores financial and emotional. Hoorah!\r In lieu of dramatizing a woman overcoming, Russell instead created a painfully unfunny comedy. His palette is broad with a spectrum of quirkies mincing about with a family dynamic that could only exist in a poorly written movie like \"Joy.\" The spot-on Russell eventually had to fall. \"Joy\" is the X marking the spot.\r Made-for-this-film, unfunny soap opera segments are unmotivated. There is no subtext pointing to the off-TV characters. There's also no payoff. There are out-of-left-field scenes of the soap in the first quarter and it's never seen again. What's the point?\r The Cooper-Lawrence chemistry bright and vibrant in past screen pairings is absent in \"Joy.\" Here, it's given way to forced discomfort. There's a sense Lawrence, Cooper and DeNiro at some point knew \"Joy\" was a dog and tried hard to not phone it in. That or their direction was, \"You've just been hit by a phaser on stun.\"\r The tonally confused \"Joy\" offers little on the path to an unsatisfying end where Joy makes it big, big, big and helps others succeed.\r There's little sympathy for Joy. The stakes: not living to one's potential and living with unfulfilled dreams. Her children are healthy. Her dad, DeNiro, runs a going concern and could help financially if push came to shove. She's smart and capable of working. Poor Joy.\r One wonders about the scores of courageous men and women who daily struggle against far greater odds, wolves at the door, to put bread on the table. Where are tales of these folks? It's an odd and tragic choice for Russell to highlight Joy's story (and insensitive in the current economy where one in seven US children go to bed hungry). The can-do attitude of a person overcoming trials is powerful. Open your eyes, Mr. Russell. There are far better underdog tales to make. They're just not sexy as Lawrence dancing with a mop."
    },
    {
      "rating": "9",
      "text": "This was a really effective infomercial. I can tell the producers definitely tried to add a bit of story and personality to provide a deeper connection between the audience and the mop, which was nice, but they do a pretty good job of just focusing on the mop itself and its many nice features. I am really looking into buying this mop but it is proving difficult to find at the 20$ price the nice blonde lady mentioned in the infomercial. Anyone know where I can order this mop?"
    },
    {
      "rating": "9",
      "text": "《翻轉幸福》主題是一位失業的單親媽媽發明\"魔術拖把\" 並以最基礎的方式成功成為一位企業家的故事\r 劇情並沒有麻雀碰到王子變公主的故事\r只有只有一位女人，自行努力、想辦法、解決問題、並奮鬥向上\r劇中顯現出了\"女人當自強\"的新理念\r相較之下男性在片中反而顯現出男人得薄弱\r結婚後的紛亂、無法解決的姊妹之爭、商業上的隨意甚至故意的設計\r讓本劇主角更添有沒有男性卻能自己成功、找到自我、開放發明世界的風采。\r 劇情快速，雖片段、不完整，但我們仍然能夠看見喬伊在為了自己的事業而努力\r喬伊雖表面冷酷，卻表現出了一個堅強女人的心，以及他真正心中的脆弱\r當喬伊快速的想像出魔術拖把並製作出的那一刻\r其實劇情就好像全部轉移到了拖把上一樣\r喬伊為了拖把努力，大家為了拖把關心\r甚至到了商場上的各種陰險\r以及劇中各種諷刺融資模式、產權糾紛，這些感覺並不出乎意料之外的劇情顯得涼徹入骨\r 導演以肥皂劇交織形成出喬伊\"發明\"並行銷商業的精神以及決心\r雖然喬伊屢次跌倒\r但是也因為家人傳達得最深刻理念\r雖然一度放棄\r但是再爬起來，找個出口，解決辦法，這又何妨呢?\r家人、朋友，永遠是最好的依靠\r在愛中與苦相伴 能成功不就是成功的翻轉幸福了嗎?"
    },
    {
      "rating": "2",
      "text": "Joy-- it is not. In the kitchen, having the best ingredients available to you does not ensure the success-- if the recipe you are working with is bad to begin with.  That is true also with Joy.  It is blessed with a star studded cast of actors who probably should have run away from this turkey at first sniff, but wait, David O. Russell has had a string of successes, so what the hey!\r Russell usually has been able to make his films work by moving the story along at a fast enough clip that the viewer doesn't have time enough to dwell on how cliché and contrived some of his characters and situations are. That is not the case with Joy. In fact, there are a number of scenes in this movie where the characters are caught in almost Wes Andersen sort of trance-- they have that deer in the headlights look. The difference is that this is not a Wes Anderson movie and the writing and direction is not good enough to make you want to suspend belief. You never really believe in the characters because you never really get to know and care about them enough. Isn't that what any good film should always have at its core??\r Joy throws a lot of star power around with actors like Robert DeNiro, Bradley Cooper, Virginia Madsen, Isabella Rosselini playing the supporting cast, but they are pretty much wasted and only serve to divert our attention away from Jennifer Lawrence's character, instead of helping to illuminate it. You end up simply not caring about her or the others. All the clichés are exposed for what they are. Perhaps this is because the original script by Annie Mumulo was reworked by Russell and certain key biographical elements of the real Joy Mangano were taken out? Who knows? What is clear in the end is that this film loses a viewer’s attention one-third of the way through and never gets it back."
    },
    {
      "rating": "9",
      "text": "Joy is the best movie about Entrepreneurship and Family business I have ever seen.  Being in one myself, it is incredibly accurate and plays along the fact that being in business is tough,and it takes a lot of smarts and endurance even to stay afloat.  Joy on one hand is a perfect companion piece to The Social Network, which is essentially the new 'way' of doing business: having an online business, a great concept that attracts a lot of investors.  It is generally the old fashion way: make a great product, know how to sell it and have the guts to manage your business to provide constant returns.  Great...highly recommended and too bad it didn't win any Oscars during its release."
    },
    {
      "rating": "8",
      "text": "Joy is the true story of Joy Mangano, a self-made millionaire who created her own business empire selling patented products like revolutionary mops through telemarketing. Despite how cheesy and uninteresting that sounds this is an excellent movie.\rFirst of all I never really liked most of David O. Russell's films (like Silver Linings Playbook-2012 and American Hustle-2013) but this one truly reveals Jennifer Lawrence's unique talent. She shouldn't have been nominated for Oscar for American Hustle and she shouldn't have won it for her performance in Silver Linings Playbook but in this one her undoubted talent unfolds to such an extent that I now consider her the best actress along with Charlize Theron. We can definitely say she's the next big thing in Hollywood. The story is really interesting and the film never gets tiring despite it's duration (124 mins). Not only that but it's really emotionally moving. In a nutshell you can say that it's an American dream story built through constant difficulties, a modern Cinderella story with a strong anti racist vision. All classes and races may come together and succeed if there is enough talent, confidence and persistence, that's the point of the film. Robert De Niro tries to copy himself in Meet the Fockers and Bradley Cooper is good but nothing special, like in all his movies. After all there is no reason for them to try to challenge the imposing star of Jennifer Lawrence, who really brings \"Joy\" to her character. Needless to say the film got nominated for two Golden Globes, Best musical/comedy and best performance by an actress."
    },
    {
      "rating": "10",
      "text": "This isn't writer-director David O. Russell's best film, but this is not terrible despite it's bland,  but Russell's style is vigorous and Jennifer Lawrence's performance is peppy, together their craftsmanship is splendiferous. Originally Annie Mumolo (\"Bridesmaids\") wrote the screenplay in 2013, so Russell signed on to direct also he selected to write the script, he didn't re-write the script, he wrote his own screenplay and Mumolo got the story credit and produced the film, for Russell got the soul screenwriting credit. Here's a fact for ya!: Kirsten Wiig almost starred in the film as \"Joy\" but Lawrence took her place. Jennifer Lawrence stars as Joy Mangano she is the only sensible person in the family, so she's been running around the household most of her life. Things are now complicated, her father Rudy (Robert De Niro) moves backs in to her house after his second marriage has failed, her mom Terry (Virginia Madsen) who is obsessed over soap-operas and watches TV non stop. Joy's ex husband Tony (Edgar Ramirez) lives in the basement pursuing his favorite dream about being a musician, Joy's sister (Dascha  Polanco) who undermines everything she does. Joy's grandma Mimi (Diane Ladd) who's the only one who has confidence in her. Joy has an inspiration for a mop getting it on the market, so she captures the attention of Neil (Bradley Cooper), who runs a brand shopping network called QVC. Tony and her childhood friend Peggy (Elizabeth Rohm) believe in her. Dad's new girlfriend (Isabella Rossellini) invents in her mop, no one thinks she'll achieve any success. Lawrence is wonderful not only she has the star-making is great but so do the chemistry that she, Cooper, De Niro and O.Russell have together, this is the \"Silver-Lining Playbook\" team's third collaboration together, they all love each other on set you could also tell by Lawrence saying about director David O.Russell  \"I want us to be buried next to each other, I really do.\" O.Russell's script is bland, but I am wowed by Russell's style also Linus Sandgren's cinematography not to mention Lawrence's star-making and charisma. I also thought that the film shouldn't win best picture, but it's really a good film. Grade A"
    },
    {
      "rating": "10",
      "text": "I loved \"Joy\" -- It's wonderful. Funny, moving, incredibly well acted. Jennifer Lawrence is terrific. The script is right on the money. Beautifully directed. See it."
    },
    {
      "rating": "6",
      "text": "Good casting but the dysfunctional , eccentric father role played twice a year by Di Nero is getting old. Lawrence and Cooper always good as was Virginia Madsen (didn't recognize her). Nice story about never taking no for an answer, believing in yourself , rags to riches, etc., etc., but it got me wondering how much dramatic license the film makers took. Was Joy Mangano really like that, nice,decent,ambitious woman or in real life, was she obsessed, self involved and irresponsible in her parental duties. Its worth seeing"
    },
    {
      "rating": "0",
      "text": "Oh merde, Jennifer Lawrence et Bradley Cooper, les abrutis réunis, lui le charisme d'un frigidaire à la casse, elle sa tronche bizarre un brin mongoloïde et sa nullité de jeu qui irradie de tous ses pores comme un cri à la face du monde \"faites quelque chose, je suis nulle à chier, aidez-moi\". Seulement, même en détresse la pouffe, on a juste envie d'une chose : lui enfoncer la tête dans un seau.Alors, lorsqu'on apprend que dans son rôle de gourdasse, elle se veut la lauréate au concours Lapine de son balai à chiottes auto-essorant lavable en machine pour le fabriquer en série chez une bande de cons, on est pas plus étonné que ça.De Niro est là pour la galerie en papa à la masse à gesticuler comme au Muppet Show et pour le reste, rien à signaler, rien à mentionner si ce n'est l'ennui (quasi-mortel... sinon on ne serait plus là pour en parler) qui habite cette espèce de film, cette sous-comédie qui se permet de moraliser et donner des leçons comme un pilier de bar sur le point de s'affaler dans son vomi.Joy donc, c'est pas la joie !"
    },
    {
      "rating": "0",
      "text": "I simply do not know what the purpose of this movie was, either in watching it or in making it. Joy tries to tell the story of a woman \"making it\" against odds due to her hard work and \"can-do\" attitude. It tells the story, but it doesn't make the story seem particularly plausible, nor did it make me care."
    },
    {
      "rating": "5",
      "text": "I really wanted to like this movie, but there is no other way of putting it. \"Joy\" is a joyless mess. To be fair, Jennifer Lawrence gives a great performance as Joy, but honestly, it's hard to acknowledge her great performance when this movies multiple styles and awkward pace overshadow the main character herself. At one point, it feels like a Scorsese movie, at another point, it feels like it's suppose to be lighthearted. And my God, the pacing towards the last half felt like the fantastic four. A very long first act, no second act, and a rushed 3rd act. There's no clear vision of what this movie wanted to be and the movie made me kind of angry. Overall, there's no point in getting into the story when the movie isn't even sure what it wants to be. I give it a C!"
    },
    {
      "rating": "7",
      "text": "While watching this film, I couldn't help but repeatedly remark to myself, \"What unusual subject matter for a movie.\" To make such a movie work, though, it has to fire on all cylinders, which it unfortunately does not. The movie works in a number of ways (acting, casting, inspirational themes) but drops the ball in others (writing, pacing, staying on point). Had the script and film editing gone through some additional tweaking, this might have been a truly terrific movie, but, as it stands now, it's merely above average. With that said, however, be sure to give sufficient props to Jennifer Lawrence, Isabella Rossellini and Virginia Madsen for great acting turns in their respective performances."
    },
    {
      "rating": "6",
      "text": "\"Joy\" stars Jennifer Lawrence, Diane Ladd, Robert De Niro, Virginia Madsen, Edgar Ramirez, Isabella Rossellini and Bradley Cooper. The film was directed by David O. Russell and co-written by Mr. Russell and Annie Mumolo. This is the loosely based story of Joy Mangano, the lady who went from rags to riches via the QVC Network after demonstrating and selling her new invention, a mop that never touches your hands and whose head can be washed in a washing machine. The story is really quite predictable with the other actors playing caricatures in a modern Cinderella tale with a heroine who mops the floor and a stepsister who is her arch rival.\rThe dialogue is trite and leaves little to the imagination save the gaps that the viewer must fill in because some of the scenes and scenarios just don’t make much sense.  If you delete the \"J\" from the title of the film you end up with the word \"oy\" and that’s the word I used after I viewed it. I give the film a rating of 6 and suggest that the ticket price would be better spent on buying the mop featured in the story."
    },
    {
      "rating": "5",
      "text": "Jennifer Lawrence teams up for the 3rd film with director David O. Russell (“Silver Linings Playbook,” “American Hustle”), this time based on the life and career of Joy Mangano, inventor of the Miracle Mop. There’s irony behind the movie’s title, because there’s almost no joy here. She has a deeply dysfunctional family, an intense struggle with her product and a pretty unhappy life. Russell loves to create characters that are less than likable and put them in situations that challenge them and the viewer. Also, the music choices are often dreadful. There’s no question that he’s an interesting filmmaker, but not always the most enjoyable. I wanted to like the person and the movie, and even though her bio is fascinating, this movie takes too long and is downright unpleasant."
    },
    {
      "rating": "10",
      "text": "We absolutely loved the story and how the story was told. The kooky characters reminded us of certain people in our own family and how people turn to the strong one in the family. Critics don't know what they're talking about because we found the movie to be highly entertaining and inspirational."
    },
    {
      "rating": "9",
      "text": "With Joy, Russell and Lawrence (and Cooper) ascend to another level as creative collaborators.  Unlike their mixed previous efforts, this film transports the viewer to a destination that cannot be defined by tics, tunes, or tailors.  It’s a destination that can only be measured by the trial, error, success, defeat, and perseverance it takes to survive there – a survival celebrated by the defiant display of the scars earned along the way."
    },
    {
      "rating": "8",
      "text": "Walking into Joy, I had very low expectations. But once the film actually starts, all your doubts about the movie vanish. Once again, David O. Russell and Jennifer Lawrence deliver a film that could easily place as one of the best films of 2015."
    },
    {
      "rating": "9",
      "text": "This movie was excellent. Jennifer Lawrence was excellent in it (she provided a great acting performance). Joy... is filled with pain and overcoming. It's a very inspiring movie to say the least. I highly recommend this sad but beautiful story of the American Dream. It's family, insanity, ruthless business dealings, corrupt people, shameless individuals and it's ...greatness. It's wonderment and Joy... it's educational, relational, hardship and celebration. It's a movie with heart ...it's loss and it's victory (it's the showcase of a woman's will)."
    },
    {
      "rating": "10",
      "text": "I think it's an underrated and under appreciated movie I personally LOVED, like all David O. Russell's previous movies. Russell's vision and the idea of taking something as simple as a mop and use it to tell a story about success, exploring all the aspects that come with it, it's brilliant. Jennifer Lawrence once again delivers an Oscar-worthy performance which was the highlight of the movie and Bradley Cooper is very good. It was nice to see them in this employer-employee working relationship, unlike their previous collaborations. One may critique O. Russell's extravagant and original execution but I feel like this movie will be appreciated more in time for the little gem it really is and the important, powerful messages at its core regarding life, business, success and women's strength, the strength of motherhood."
    },
    {
      "rating": "8",
      "text": "Though it may be too slow for many, Joy is beautifully shot and wonderfully cast with a very believable script that in no way turns over-used! It may not be for everyone, but it is an inspirational story of one person's struggles and successes in running their own business."
    },
    {
      "rating": "5",
      "text": "The joy of “Joy” is that Jennifer Lawrence is on screen for 95-98% of the time,  otherwise the movie is too busy and has too many unnecessary characters such as the Isabella Rossellini’s role which supplies one way to forward the story but adds a lot of nothing to an expanded role.\rThe best part of the movie are the scenes involving Bradley Cooper as he and Lawrence just have a natural chemistry no matter what roles they play opposite each other. Following close are the scenes with Edgar Ramirez as her ex husband still living with her and their two kids. Also living with them are her mother, Virginia Madsen, her father, Robert De Niro, andf her grandmother, Diane Ladd who narrates the movies. Also in supporting roles Elisabeth Rohm as her half sister, Dascha Polanco as her best friend, Melissa Rivers as her mother Joan  along with soap opera icons like Susan Lucci, Laura Wright and Maurice Benard fill in the story with the latter three stretching out the film making it seem longer than it really is.\rThe movie is ‘based on a true story’ about Joy Mangano’s inventing the self-wringing  Miracle mop and all it took to make it a success from appearing on the QVC channel, being duped by men regarding business, her going into monumental debt and finally standing up for herself.\rAs it is the film is very chaotic with all the family members, the business and TV angle, independent woman in the 1990s, instead of concentrating on that plus her ex, their kids and how she handles all that plus fighting in a business world.\rJennifer Lawrence continues to show her expertise as an actress in playing various roles and doing a good job in each and though she is excellent in “Joy”, the movie itself, as directed and written by David O. Russell, it is not up to her capabilities."
    },
    {
      "rating": "8",
      "text": "I'm always a sucker for any of David O. Russell's films, especially his past couple of collaborations with Jennifer Lawrence, Bradley Cooper, Robert De Niro, etc. So I was really looking forward to seeing this, and I must say that I found this film much more enjoyable than the critics would have you believe. Yes, it's a bit underwhelming compared to O. Russell's last two films, Silver Linings Playbook and American Hustle, but I still really enjoyed it and was entertained overall. Lawrence delivers another headstrong performance. Supporting men, De Niro and Cooper also give worthwhile performances. Overall, I'd say that it's definitely an entertaining and worthwhile film, especially if you're fan of O. Russell or any of his previous films, and also if you want to see him direct Jennifer Lawrence to another great performance."
    },
    {
      "rating": "8",
      "text": "My first ever review is happening here and now because I really liked Joy and want people to see it. Because it's funny. The crazy assortment of characters in Joy's family are just a hoot. And since they stand in her way more often than they help her, they give Joy even more obstacles to overcome. But most of all because Joy is inspiring. You want to see her succeed and you don't know how she's going to pull it off, so the suspense carries you along. In addition to a terrific Jennifer Lawrence, De Niro, Rossellini, Virginia Madsen, Edgar Ramirez are all wonderful to watch. If you're looking for some laughs and some uplift to sweep you into the new year, this is definitely one film to catch."
    },
    {
      "rating": "0",
      "text": "Absolutely boring. horrible movie. I couldn't even stand the first 30 minutes of useless scenes that build into more boring useless scenes. I want the time back that I waisted watching as far as I did."
    },
    {
      "rating": "7",
      "text": "Though it takes a while to get to the heart, Joy delivers with swells of emotion. Lawrence plays the part of entrepreneur with steely resolve, going to low lows and high highs. After it gets off the ground, portraying the complicated life of a divorced mother with children, the picture strives to drive home the point of an indomitable spirit. The low-scoring critics seem to have more questions of the story as a whole as if they're upset that this semi-biopic isn't a novel they can study. But I found myself on board, delighted with the unique scenarios and the unlikely subject material that landed plausibly."
    },
    {
      "rating": "7",
      "text": "In another collaboration with his muse, David O. Russell offers a unique look at a unique story. Despite another formidable performance from Jennifer Lawrence, JOY misses some of that flair seen in Russell's other productions. Still, the film’s atmosphere is enough to make this life’s journey an enjoyable one."
    },
    {
      "rating": "7",
      "text": "Joy is enjoyable and moves with ease under David O's direction. It isn't among his best work, but is still a nice story with yet another very strong performance by Jennifer Lawrence at the center of it."
    },
    {
      "rating": "7",
      "text": "If you've known someone who's been in debt and unable to pay and provide for their family then you'll connect with Joy. I felt sorry for her in her lowest moments and Jennifer Lawrence was really good in the role."
    },
    {
      "rating": "9",
      "text": "A small accident can lead to a great achievement, but difficult path is certain.\r It is a semi-biographical film about a person who invented a modern hygienic mop. So all the depicted events and characters were partially real, but for the cinematic reason they have been fairly altered for a good outcome. And yes, I loved it. A very inspiring film among all the Oscars nominees this year. In some way I also felt Jennifer Lawrence should have got the award for her fine character display.\r Honestly, I was not interested in this, so I wanted to get over it silently as soon as possible. But I ended up enjoying a lot and instantly it became one of my favourites of the 2015. What I expected after watching its trailer was like I judged it by its cover. As I hesitated in the earlier, but strangely now I'm recommending it to all.\r The story of a woman who grew up listening her grandmother's motivational speeches. But realises the life is tougher than she thought and making a living is very competitive. After so many struggles in the life, she finally invents something that changes her and her family fortune forever. But like any new initiative does face, the problems arise and how she is going to fix them is what the remaining film narrates.\r A very interesting film in the perspective of the career option. Forget the doctors, engineers, lawyers and those who're settled in their lives with a good job in hand that pays big, but there are billions of people, to them it will definitely serve as an inspiration to ignite their future.\r The rating for this looks like a fair value, but still a very underrated film everywhere. Amazing actors, a little funny and a little emotional, but a very impressive film directed by the one who bought the Oscars to Jennifer Lawrence for their earlier venture together. I don't know what's between her and Bradley Cooper, but looks like their onscreen chemistry is doing something big impact. This is their's fourth project together and second with the director, so I hope they do more in the future as well. This is really a wonderful film, so don't miss it.\r 8.5/10"
    },
    {
      "rating": "7",
      "text": "Joy is an overall decent movie that starts out sort of badly. The first portion of the film is lively and well shot but oddly uninteresting. Once the mop comes into the film though, the movie begins to take off. From that point on the movie is almost never less than solid and occasionally more. You really do root for Joy to succeed and become frustrated at the obstacles set in her way. Lawrence gives a decently engaging performance ,although it's not her career best in my opinion. It's not nearly as consistent as American Hustle or Silver Linings Playbook which were both invigorating their entire runtimes and some of the best movies of the past decade but it's still worth watching if you accept that it takes a while to cohere into an interesting story."
    },
    {
      "rating": "9",
      "text": "Except for the one 100 professional review, I'm amazed at the other pro reviews.  Wha' hoppen??? This is the most beliveable story of feminine self-empowerment based on character within my memory.  This is the most emotionally layered movie since Silver Linings Playbook in my memory and this is better, as other reviewers suggest.  These are two or three of the best-written female roles in years.\r Hmm I notice 95% of the professional reviewers are male.  Not all the female reviewers praised it tho.  One did:  Lawrence is gritty, real and totally genuine. And, after ‘Brooklyn’ and ‘Carol’, here’s another film that passes the Bechdel Test for [authentic] female characters with flying colours."
    },
    {
      "rating": "6",
      "text": "Joy the story of a woman that most of the world is completely unaware of and it is kind of random selection for a project. David O Russell and Jennifer Lawrence have already worked together twice so its easy to get our hopes up. I wasn't a huge fan of American Hustle but I could respect it. The real strong side of Joy is the great performance by Jennifer Lawrence. I totally understand the Golden Globe nomination. Joy is by far the most interesting and loveable character in the film and she's very easy to root for as the movie goes and she continues to struggle. Now the main issue with the rest of the cast is that they aren't very likeable. Robert Di Niro and Bradley Cooper are both in this film but sadly they are almost unlikeable. Joy comes from a life of dysfunction and because of that there are times where she is completely on her own. Then there are certainly some scenes that really stand out above the rest."
    },
    {
      "rating": "7",
      "text": "Joy is a well made film if you look at it purely as a charter piece mainly because of Jennifer Laurence's performance which is the best part of the film. however it does kind of fall down when you look at it any other way and the last third of the movie has pacing issues however it's not enough for me to dislike the film because this was much better than i was expecting it to be"
    },
    {
      "rating": "5",
      "text": "JLaw is very good and no doubt most of the weirdness of Joy the film is intentional but I was left w/ a feeling of Is That All There Is? (which, come to think of it, would have been a cool addition to the soundtrack). Part of the film's problem, overall, might be unintended consequences from oversimplifying the business issues faced by Joy the character, i.e., Do the oversimplifications actually cause greater confusion? All this is especially problematic w/ the patent issues. Patent law is about as complex and tax law. The film 'wants' us viewers to understand it but doesn't really give us much help (maybe it doesn't understand it either). Also, the woman's success story is admirable but at times it feels like it is straining to be political correct. I'm not sure I'm right about most of the above. I am merely setting forth my reservations about this film by a director whose work I'm often crazy about."
    },
    {
      "rating": "5",
      "text": "Joy: \"We got here from hard work, patience, and humility. Don't think the world owes you anything because the world owes you nothing\".\r The story is about a Long Island single mother who had to fight every inch of the way when she came up with the Miracle Mop - a self-wringing design that turned her into one of the most successful entrepreneurs in America.\r So I've just seen David O. Russell's new film \"Joy\" and it was pretty disappointing. This is coming from a guy who wanted this movie to be brilliant and it was on my most anticipated movie of December, but it sadly didn't live up to that exceptions.\r You had no idea how much I wanted \"Joy\" to be a great movie and also how I wanted it to be David O. Russell's best film, because while I wasn't a big fan of American Hustle (after re-watching a few times) but I thought this movie will bring him back to his old roots, because I've notice he picks style over substance in his last movie (Silver Linings Playbook isn't one of them). The story in the movie seemed to be laid back for David O. Russell, so he doesn't go too carried away with the style he presents in his movies. And there are a few good shots, creative camera work in some scenes, and that's really it. He dose nothing to the story that made it exciting or even interesting. I like David O. Russell as a director, I really do, but this guy is pretty far away from flawless.\r Jennifer Lawrence performance was the one thing that wasn't disappointing. She did a great and strong performance in this movie, but her Long Island accent was a bit off at times and you may think that the actually person herself that Lawrence is playing (Joy Mangano) sounds like that, well I did my research and let me tell you no, she doesn't. But all that side, she did a solid performance and she was the only likable character in this movie. Great work Lawrence.\r The story itself isn't that interesting coming to think of it. Just reading the story of what the movie is about isn't that engaging, but I thought with a huge cast like this, David O. Russell behind the camera and the trailers made it look promising, because maybe these more to this story that we don't know about, but in the movie stuff happens and are main character is going through hell...oh and these the unlikable characters in Joys life. This story is loosely based on Joy Mangano life.\r I didn't give a single crap about any of the character in this movie and that's this movie biggest flaw. All of characters (expect Joy) feels like movie characters and every time their say something it wasn't convincing and didn't feel real. Not once did I feel attached to any of these characters. Theses a lot of characters in this movie played by big name actors, but I just wished it was written and executed better.\r The first half of the movie didn't really know what it wanted to be. It was very scatted as it goes back and forward showing what Joys family life was like. All of that is trying to do some character development or just to flesh out her character, but I wish those flashbacks had a purpose in the rest of the story, as I felt it was thrown in there.\r Overall \"Joy\" isn't a bad movie, I mean Jennifer Lawrence basically saves this movie from getting a much lower rating from me. The movie looked good, it was well shot at times and even when I didn't like the characters in the movie, I still thought the actors where good. I wanted to like this movie but sadly, it was a mess."
    },
    {
      "rating": "5",
      "text": "Jennifer Lawrence is reunited with director David O. Russell in a semi-biographical comedy/drama based on Joy Mangano and her journey from struggling New York single mom to entrepreneur, inventor, millionaire business owner and powerful family matriarch.\r Writer/director David O. Russell’s formula of stylizing real stories, featuring ensemble casts portraying humorously dysfunctional characters, against the backdrop of classic rock & pop soundtracks has served him well in recent years with films like ‘American Hustle’ and ‘The Fighter’. And by uniting Jennifer Lawrence, Robert De Niro and Bradley Cooper for the third time, O. Russell seeks to work his magic on this female empowerment and “American Dream” story.\r Despite many a seemingly mundane subject resulting in many an entertaining movie, you might think that a semi-biographical story about a rather typical middle-America single mom, who transforms into a rich shopping channel star, just wouldn’t be that compelling… and you would be right.\r Hollywood megastar and media darling Jennifer Lawrence stars as “Joy”, the only seemingly functional character in the story, who’s surrounded by quirky friends & family that rely on her while life and responsibility drags her down. Only for circumstance to conspire with her precocious nature to help her fulfil her potential in this true, and yet rather fanciful tale about never giving up in the pursuit of your “American Dream”.\r ‘Joy’ certainly does have its redeeming qualities with plenty of offbeat characters and deadpan humour to keep you entertained, for the first half at least. Robert De Niro’s turn as Joy’s self-styled father particularly steals the show, and Jennifer Lawrence central accomplished performance just about holds the movie together. But the tone of the film changes drastically towards the third act and the comedic charm is lost as it moves towards a rather flat emotional character drama.\r No amount of toe-tappin’ tunes will disguise the fact that this film is very uneven with most of the narrative focusing on Joy’s early entrepreneurial days, which then suddenly and conveniently wraps up in the final 10 minutes, with no lead-in, into her current status as a powerful family matriarch, and then that’s it, the film’s over.\r The Bottom Line…\rDirector David O. Russell can’t seem to wrangle a strong ensemble cast, a delightful soundtrack and plenty of belly laughs into a compelling and cohesive rags-to-riches “American Dream” story. ‘Joy’ is a rather flat and underwhelming comedy/drama that loses steam, let’s see if O. Russell will now rework his winning formula or apply it to more yielding material."
    },
    {
      "rating": "7",
      "text": "Joy is better than I expected and I honestly wasn't expecting much. The plot itself was kind of boring, I must admit, but the powerful performance given by,Jennifer Lawrence made me care for Joy and feel sad for her. Bradley Cooper is like in almost every Jennifer Lawrence drama movie but in this film, he did a really good job and I actually understood his part in the film. It's based on a true story so it might be boring plot wise, but I was entertainined at some of the scenes. I felt the director did a very great job especially in the scenes in where there was silence and Joy was angry because I could feel some of the tension. Solid movie that has a powerful message. (73/100)"
    }
  ]
}