{"id": 1628, "title": "Joy Ride", "starring": ["Paul Walker", "Steve Zahn"], "runtime": 97, "genre": ["Mystery", "Thriller", "Drama"], "description": "Three young people on a road trip from Colorado to New Jersey talk to a trucker on their CB radio, then must escape when he turns out to be a psychotic killer.", "releaseYear": "2001", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/1LVGjf1QWgkNNPQssZtuT1GYKoP.jpg", "categories": {"plot": 0.0, "acting": 4.666666666666667, "ending": 4.666666666666667, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 10.0, "action": 8.0}, "reviews": [{"rating": "8", "text": "A movie so intense and fun that it won't bore you even for a moment! This is one of the movies that you'll like to watch more than once, because... okay, no spoilers!"}, {"rating": "8", "text": "Two brothers played by Paul Walker and Stephen Zahn prank on a truck driver with a CB radio while on a road trip to pick up a friend (Leelee Sobieski). Very soon after they regret playing the prank. The truck driver is insane and makes their lives a living hell.\rWhat makes Joy Ride, late Paul Walker's best film is that it's a fun thriller heightened by chilling voice work by Ted Levine (Silence of the Lambs) as the truck driver. Walker impersonating a woman named Candy Cane on the CB radio which starts everything, is pretty funny. I'm not sure how anyone would believe he was a lady."}, {"rating": "7", "text": "It was trilling, but something was missing. The part including the bus following them and almost not ending up killing them got me like \"oh nonononon.. That was close....\" The end was really well made. Overall I would recommend it."}, {"rating": "0", "text": "Watched this movie as a sneak preview in theatres and discussed with the rest of my group to walk out half way. Managed to stay until the end just to see what would happen, but the movie didn't redeem itself. It's just a bore with uninspired characters and unrealistic events."}, {"rating": "5", "text": "Quite a few scenes in this movie were edge of your seat, nail biting moments.  The movie unraveled, with hills and valleys, pretty well until the end.  For some reason this movie got my adrenaline going and then I fell a little flat.  I had to ask myself if 5 minutes of the film was strong enough to disappoint me after watching the previous hour and a half?  I think, yes."}, {"rating": "5", "text": "Doesn't really make any sense but possibly a class above most horror films."}, {"rating": "10", "text": "This is the greatest movie of the century! It is everything you want from a movie. It has tons of scary moments but still funny enough to make you watch this anywhere, anytime!"}, {"rating": "7", "text": "Brilliant (also their official cite) but it is litlle predictive."}, {"rating": "7", "text": "With believable acting performances and an interesting story, Joy Ride is another early 2000's horror movie that succeed at being both terrifying and entertaining."}, {"rating": "2", "text": "Un road movie à la Duel et à la Hitcher qui pioche volontiers de ci de là dans ces deux classiques pour faire monter la mayonnaise... sauf que notre équipée de branques (les frérots gogols et la blonde sans cervelle) sont bien loin de donner toute la crédibilité nécessaire à ce thriller qui met beaucoup de temps à démarrer. Sans même parler de jeu d'acteur ou d'actrice...Paul Walker est un cave certes mais le mongolo Steve Zahn qui l'accompagne met à mal le film en entier par sa stupidité et sa crasse nullité de débile profond fraîchement diplômé. Lorsqu'enfin le film se met en route et que le psychopathe les poursuit, on a perdu presque toute la motivation nécessaire et ce, jusqu'à la fin qui abuse de grosses ficelles un brin élimées...Malgré paradoxalement la bonne réalisation de John Dahl, cette virée vire donc à la catastrophe et au ridicule à l'insu de son plein gré. Eminemment regrettable."}, {"rating": "8", "text": "{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"}, {"rating": "8", "text": "\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,=,"}, {"rating": "8", "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,》●》●》●》●》●》●》●》●》●》■》■》■》■》■》■》■"}, {"rating": "8", "text": "●●●●●●●●●●●●●●●●●●■■■■■■■■■■■■■■■■\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",+,+,+,+,+,+,÷,÷,÷,÷,=,,=,."}, {"rating": "8", "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡********************************************************"}], "recommendations": ["i_know_what_you_did_last_summer", "cellular", "tusk", "disturbia", "friday_the_13th_the_final_chapter", "friday_the_13th_part_2", "47_meters_down", "sex_drive", "machete_kills", "unhinged", "from_paris_with_love", "vacancy", "out_of_time", "friday_the_13th_a_new_beginning", "the_hangover_part_iii", "final_destination_3", "paranormal_activity_3", "awake", "bad_trip", "reasonable_doubt", "21_jump_street", "the_call", "night_at_the_museum_secret_of_the_tomb", "the_toll", "friday_the_13th_part_iii"]}