{
  "id": 3777,
  "title": "Judas and the Black Messiah",
  "starring": [
    "Lakeith Stanfield",
    "Daniel Kaluuya"
  ],
  "runtime": 126,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "Bill O'Neal infiltrates the Black Panthers on the orders of FBI Agent Mitchell and J. Edgar Hoover. As Black Panther Chairman Fred Hampton ascends—falling for a fellow revolutionary en route—a battle wages for O’Neal’s soul.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iIgr75GoqFxe1X5Wz9siOODGe9u.jpg",
  "categories": {
    "plot": 8.057971014492754,
    "acting": 8.19277108433735,
    "ending": 8.142857142857142,
    "soundtrack": 10.0,
    "cinematography": 8.857142857142858,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.555555555555555
  },
  "reviews": [
    {
      "rating": "9",
      "text": "One of the first and most powerful films I've seen so far this year! This chronicles the Black Panther Party Movement of the 60s and 70s, and follows an FBI informant (Lakeith Stanfield), who, in lieu of serving prison time for his previous crimes, is tasked with infiltrating the local chapter of the Black Panthers, led by Fred Hampton (Daniel Kaluuya). The story is especially timely, important, and relevant to today, what with the BLM movement going strong today, and racial division and tensions being stronger than they've been in years. It's a hard-hitting and sobering reminder of the unfortunate persistence of racism and bigotry that continues to be felt and examined in this country today. Setting the history aside, however, the film is sharp as a razor and brilliantly told, thanks to several different contributing factors, including the powerful musical score to the brutal and honest performances from all involved. Lakeith Stanfield and Daniel Kaluuya in particular both own the film with their unforgettable and potent performances. Both men are more than worthy of all the awards and recognition they can get! The film itself never flinches away from or pulls its punches in depicting the events and in all of their full and somber detail, no matter how hard or tragic it may be to watch or accept at times. By the time the credits rolled, I found myself both infuriated and heartbroken by these real-life events that had transpired. Overall, it's another eye-opener to just how divided and tense things have been and unfortunately still are in regards to race in this country. Nevertheless, it's powerfully acted and told in a taught and hard-hitting way, making it one of the first great films of the year for me."
    },
    {
      "rating": "7",
      "text": "Judas and the Black Messiah tells the story about an FBI informant William O’Neal who infiltrates the Illinois Black Panther Party and is tasked with keeping tabs on their charismatic leader, Chairman Fred Hampton. Daniel Kaluuya continues to prove to be an amazing up and coming actor in the role of Fred and LaKeith Stanfield doesn’t fail to disappoint either. The cinematography was something that really caught my eye as it felt like I was watching a Spike Lee film and I feel as if that filming style really helped capture the essence of the late 1960’s. Although the film is barely over 2 hours long it is a pretty slow burn and hardly has any action focused scenes. This might cause it to be hard for some viewers to sit through. Regardless, the story is decent. Dialogue and delivery is great, but I feel as if the main character, William, is a bit weak. During my viewing I thought to myself, either this film should’ve been solely about Fred or the focus of Will should’ve been increased. For having a metaphorical title name and objectively being the protagonist, Will honestly feels like a supporting character or a side thought during a majority of the film. I wish we got to see more of the mental toll that his role as an FBI informant had on his life. I wish we got to see more of his reasoning for why he is doing what he is doing. I wish we got to see more of his personal beliefs shine on the war between the corrupt government and the questionable acts of the Black Panther Party. Something I appreciate about a film like this is that it doesn’t play sides. It doesn’t push a liberal agenda as right minded viewers may think it will. It tells the truth about the Black Panthers, the Klan, the government, and how these events shaped history. This movie is for those who want to know American history. Despite the shortcomings with some of the characters, Judas and the Black Messiah didn’t fail to entertain and educate."
    },
    {
      "rating": "9",
      "text": "What a fantastic movie with great directing from Shaka King. Daniel Kaluuya's performance is out of the charts. Lakeith Stanfield also gives a great performance making you feel as if he is experiencing the story in real life. The score has this eerie feeling to it that makes it very different especially from the start. Overall Judas and the Black Messiah is a phenomenal movie with a fantastic cast."
    },
    {
      "rating": "10",
      "text": "This is (so far) the best movie of the year. I can't imagine any real film buff not giving this at least a 6. The acting is great, the story is compelling. Obviously it got a little bit of \"Hollywood treatment\" but mostly it sticks to true events. This movie has several awards nominations coming. Highly recommend.Regarding all the Negative reviews, I really wish Metacritic would do something about the \"haters\". It's clear there are a bunch of INCELs that can't stand people of color and women. It's pretty disgusting that great art such as this movie can't be appreciated just because you don't agree with the politics. You guys are pathetic."
    },
    {
      "rating": "7",
      "text": "While it makes for a good history lesson and features fine performances by Daniel Kaluuya and LaKeith Stanfield, this tragic biopic about Black Panther leader Fred Hampton and the FBI undercover informant who contributed to orchestrating his assassination doesn't quite reach out and grab viewers emotionally the same way that many other movies about the civil rights movement do. In part that's due to a screenplay that feels sketchy, like a collection of events patched together but without a lot of cohesion, character development or back story. It also fails to nurture the kind of empathy a story like this should engender in light of the many tragedies and ample heartache embedded in the narrative, almost as if some secret ingredient to make that happen has been left out. This is certainly a good film but not the kind of great one to which it aspires."
    },
    {
      "rating": "10",
      "text": "Based on a true story, seriously related to the fight for civil rights. The performances as well as the period adaptation are absorbing and make the viewer curious to know further. An example of how risky it is to make pacts with the Devil."
    },
    {
      "rating": "7",
      "text": "Despite some pacing issues, and how it struggles to get a more centered focus, Judas and the Black Messiah is too interesting, relevant, and pulsing for those to be distracting elements.Certainly several aspects can feel minimized, and to some extent tainted by traces of sensationalism, after all it's a dramatic recreation. But that's precisely the film's strength, even beyond its real story, because the performances give it life, and they're still as crucial as the theme itself, because if your actors can't bring it to life, the theme simply won't have justice.And this film breathes incredibly through the performances of its protagonists, especially Daniel Kaluuya, who will undoubtedly have to get an Oscar nomination this year.Perhaps the most defining thing about Judas and the Black Messiah is how it becomes part of the circle that the African American community cannot abandon as long as they're still considered a danger by their white compatriots, and of course by the people in power. Especially police authorities.It's quite **** up to be seen as danger in your own nation because of your skin color. If you're white, you're manageable, regardless of your crime.If you're black you must be controlled at any cost, and perhaps executed, regardless of your crime.Judas and the Black Messiah does not manage to land everything it seems to propose, but it remains a crucial perspective of a story that keeps repeating itself, and from which it seems that nothing is learned."
    },
    {
      "rating": "8",
      "text": "Wow. Shaka King has given us something that is so powerful. I can’t even begin to talk about how much this film is going to affect people.Every. Single. Performance. Is. Incredible.They joke that Lakeith’s character should get an Academy Award in this movie, and I would be shocked if he, Daniel Kaluuya, Jesse Plemons, or anybody else in this movie isn’t part of next year’s nomination list. This year, 1969, has been covered so much in the past couple of years and while that was.. man 52 years ago, everything going on back that is as relevant then as it is now. Racial inequality and police brutality (to put it lightly) are constantly at the forefront of discussion at both points in time. I wish we could look back and say.. wow what crazy times folks like that lived in. But the reality is, it’s not much better now.It is.. a haunting film in that regard and in others. But I honestly do not have much else to say right now. This is something that needs to be seen. Luckily, you won’t have to wait much longer as it is being released in theaters and HBO Max on February 12th. Please, seek this out."
    },
    {
      "rating": "8",
      "text": "I really thought Sacha Baron Cohen was going to win but, they gotta give that award to Kaluuya inmediately. Pretty good movie, has some really strong moments, especially Hampton's speeches."
    },
    {
      "rating": "9",
      "text": "Judas and the Black Messiah is a historical drama based on true events of the Black Panther society during the late 60s. The story centers around Fred Hampton played by Daniel Kaluuya, the chairman of the Illinois Panthers and the man who would betray him and the Party, William O'Neal played by LaKeith Stanfield.Bill is caught stealing cars on the southside of Chicago and is offered a chance to skip jail time if he infiltrates the organisation. He does not however bargain for the sense of identity and belonging he finds within the movement making the eventual betrayal that much harder.This film immediately grabs the attention and much of that is due to the acting talent of the cast with the standout role going to Stanfield.The dialogue of this film really stays with you and tells the story better than the plotline with lines that really grab you and convey the exact emotion of their intent. One of the things I found interesting about this film is that MLK's shadow seems to loom over it in both a spoken and unspoken way. King after all was viewed as a Messiah himself. I believe Fred saw himself as the bridge between MLK and Malcom X. The Panthers followed the ideology of Malcom X and while they wanted peace, they realised there could be no peace without war.What's great about this movie is that every character follows what they believe to be their own moral compass. From Fred to Bill and even the FBI agent. He thinks he understands, indeed he believes he's on the right side of this war because to him the Panthers are terrorists that must be stopped. In actuality, his own ingrained prejudice blinds him to the plight of blacks. Like the Panthers,he believes he is doing what he has to in the name of the greater good. I think the message of this film is that regardless of how well we mobilise in the fight against racism and oppression, the biggest threat to the movement will always be the colloquial Judas. That person from within who's content to take the 30 pieces of silver to betray their brothers. We see it happening everyday with \"sellout culture\".This film is not only a story about the past but a reflection upon our present.9.5/10 definitely recommend."
    },
    {
      "rating": "9",
      "text": "This movie is a masterpiece. Easily one of the best crafted films in the pass 5 years. I see alot of people trying to bash the movie for not following a fantasy structure. Like character arcs, development circles. When it does. O'Neal gains more morality. While Hampton becomes more radicalized after his prison appeal. How can people say this movie has no development or showings of the characters emotions. When the whole first hour of the film O'Neal is self serving and by the end he looks traumatized and shooked about having to assist in the raid. To the point he was having a nervous breakdown. Hampton goes from this unwavering figure of charisma and charm to shouting about how he gone die."
    },
    {
      "rating": "10",
      "text": "What a performance by Daniel Kaluuya, he should win the Academy Award for Best supporting actor. The soundtrack is GREAT, especially the original song “Fight for you” by H.E.R. A great movie with a powerful and timeless message."
    },
    {
      "rating": "10",
      "text": "This was an awesome movie...it was intense and I couldn't look away. The whole movie was very good, but the actor who played Fred did such a good job it is worth watching just to see him. The only negative is that it took a little while to calm down after watching."
    },
    {
      "rating": "8",
      "text": "While the movie sometimes gets bogged down by pacing issues, it more than makes up for it with gun punch drama and phenomenal performances, especially Daniel Kaluuya."
    },
    {
      "rating": "9",
      "text": "The kind of dramatic retelling of actual events that'll leave you thoroughly haunted as you stagger your broken ass out of the darkened theater, \"Judas And The Black Messiah\" looks to not only act as a coming out party for up-and-coming co-writer/director Shaka King, but as an artful portrait of one of the twentieth century's greatest struggles. Completely excelling in either regard, \"Messiah\" uses an unequivocally talented hand to tell the story in question, sure, but it's not showy, constantly asking the audience to note the filmmaker who crafted each frame and camera movement. No, here, the filmmaking simply adds to the storytelling, only looking to act as an accompaniment to the film's heavier moments and as an incredible stage-setter for the the quieter ones. However, nothing quite frankly outdoes the work that Lakeith Stanfield and Daniel Kaluuya have put in here; Kaluuya, an utter dynamo of charisma; and Stanfield, a walking ball of anxiety who's honestly difficult to watch at times (and for the right reasons). Be sure not to miss this one, as its conclusion is a much needed gut punch that's rife with contemporaneous meaning. Meaning we all could use these days."
    },
    {
      "rating": "8",
      "text": "Judas and the Black Messiah had me strapped to my chair for 2 hours straight without getting up.This film told a story about a group in Chicago called “The Black Panthers” who are activists fighting for the injustice in America.It explores and gives perspective on how black Americans were being discriminated on by the police and how they’re being treated.Good stuff;Visuals are always telling a story.MusicActingLighting feels like something is about to give someone to the audience.Well crafted characters.Dialogue creates tensions to the story.Bad stuff:The pacing seems all over the place in my opinion.That’s about it."
    },
    {
      "rating": "9",
      "text": "Cool, tense and topical. At times plays out like a 1960s version of The Departed, with informant rats trying to stay in the weed. Great performances, a great score, and just a great movie."
    },
    {
      "rating": "10",
      "text": "Literally left me speechless out of respect from all angles of history and story telling this is a great great movie - finally!"
    },
    {
      "rating": "10",
      "text": "Amazingly done piece on an historical figure everyone should know about. RIP Chairman Fred."
    },
    {
      "rating": "10",
      "text": "Best film of the year.  This is yet another example of how the American government kelp its knee on the throats of Black people.  This is a great cinematic achievement.Please note: Some of the folks who give this movie a negative rating are the usual bigots who go from movie site to movie site determined to undermine Black movies. In most cases, these bigots haven't even seen the movie and never will.  This has been happening for about 8-10 years."
    },
    {
      "rating": "10",
      "text": "Masterpiece alert!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!+!++++++!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "I wish to highlight THIS MOVIE HAS A SCRIPT.  It has PERFORMANCES.  It has CONVICTION and COMMITMENT.  See for the filmmaking even if you don't care for the issues.  In the future, this is likely to be a film shown on college campuses to disabuse white youngsters from a-historical nostalgia for the Old South and the white passions standing behind \"law and order.\""
    },
    {
      "rating": "5",
      "text": "A five at best and I am being generous.  It’s politically correct to praise this movie.  For starters, Kaluuya’s accent is irritating.  There’s more but I will leave it at that. This movie is not 12 Years A Slave or Do The Right Thing.  Not even."
    },
    {
      "rating": "10",
      "text": "Loved it. Surprisingly entertaining and it balances well between the two points of view. Excellent performances (Fishback and Kaluuya in particular) across the board, masterful direction and a stunning cinematography from Sean Bobbitt help this powerful story excel."
    },
    {
      "rating": "9",
      "text": "Judas and the Black Messiah is a remarkable storytelling about Fred Hampton and William O'Neal with a riveting performance by Daniel Kaluuya, outstanding cinematography by Sean Bobbit, a great ensemble work and a good soundtrack. If Warner did a better job by promoting more the movie, It could really be a strong contender getting nominations for: Best Picture, Best Director, Best Actor, Best Supporting Actor, Best Supporting Actress, Best Editing, Best Cinematography and Best Original Song."
    },
    {
      "rating": "8",
      "text": "excellent[ ek-suh-luhnt ]adjectivepossessing outstanding quality or superior merit; remarkably good."
    },
    {
      "rating": "9",
      "text": "One of the best movies I never want to watch again due to the sheer tragedy of the content."
    },
    {
      "rating": "0",
      "text": "Leftist propaganda. You don't bring people together, segregating. For them, this is not about equality; its about power. If they use movies and media was weapons, I automatically boycott."
    },
    {
      "rating": "1",
      "text": "Over exaggerated aimed at creating more tension,  acting was mediocre, charecters lacked real development outside of anger and bs"
    },
    {
      "rating": "0",
      "text": "If you want race relations to heal in the US, do you repeatedly pick at the scab, keep making movies about previous injustices, slavery movie after slavery movie after slavery movie.....after.....wait for it.....slavery movie; WE GET IT, you hate us. I think it is time for a divorce. I am citing irreconcilable differences. You know, on account of the whole \"We hate you because of slavery even though you had no part in it\" whole thing. I'm seriously sick of it. Also, does anybody care about the Oscars? If you cared a year ago you are not too bright but in the last few months they announced that in order to get an Oscar, you have to meet certain diversity quotas or your film has to have a certain message about anti-racism. So, the Oscars aren't about talent anymore; they aren't even pretending that it's about talent. No, they are flat out telling us that their nomination process is political."
    },
    {
      "rating": "8",
      "text": "Daniel Kaluuya gives the best performance of his career. The Supporting Actor category in the Academy Awards sure has some big names and roles, but we can all agree that the most impactful is his. Lakeith Stanfield is very close, so this award is a sure thing for 'Messiah.'The scene at Hampton's apartment almost at the end made my blood run cold. This film honors the black struggle in so many ways and will be remembered for the time to come."
    },
    {
      "rating": "7",
      "text": "Good, but not great.  There is no context around some of the action, so the film feels like it is missing elements, and most of the side characters are never developed, never say anything interesting at all.  This film had potential to be...much better than it was, so while I enjoyed it, I can't say it was as good as the trailer made it out to be.  Great performances make it worth watching and the story of course needs to be told, even if done through the lens of the informant, which, while interseting in itself, is not neccesarily a film about Fred Hampton himself.  Overall: definitely worth seeing, but I feel like it lacks context and at times, tension, that should have been there."
    },
    {
      "rating": "9",
      "text": "Es increíblemente fabulosa de principio a fin, quedé completamente fascinado por la historia y sus excelentes actuaciones, lo único que me molesta es que el protagonista Wild Bill no convence, a mi como espectador me generó rechazo en todo momento, nunca llegas a sentir empatia y comprensión por el, de hecho el personaje de Daniel Kaluuya tiene más importancia y carisma siendo que es el actor de reparto cuando su trabajo en esta película es mucho más que eso."
    },
    {
      "rating": "8",
      "text": "Long awaited and long overdue, Stream To Big Screen finally gets a chance to watch Judas and the Black Messiah. When the trailer for Judas and the Black Messiah premiered last summer, the expectations from just those two minutes were set very high. Does the feature live up to the hype created by that dynamic trailer? Here's how it goes. The synopsis of the movie is as follows: Fred Hampton (Daniel Kaluuya), a young, charismatic activist, becomes Chairman of the Illinois chapter of the Black Panther Party. Bill O'Neal (LaKeith Stanfield), a low-level car thief, gets caught impersonating an FBI agent and is used to infiltrate the Black Panthers. As Hampton's influence grows, pressure from the FBI overtakes O'Neal and leaves him to make some fateful decisions.S2S: I mean wow. This is the film that was needed in 2020 and the one the people deserved to watch given the events of this past year (both culturally and politically). By that I mean, 2021 is starting off with a quality film; and just in time for the Academy Award season. Why do I say that? Sometimes to see where the country is going or needs to go, we have to remember where it has been. In the time of George Floyd and countless others, it's important to remember the US has always been in the business of killing black folks! \"Good coloreds,\" \"bad blacks\" and \"urban hoodlums\" were all treated the same by our government. They have not been for us. So let's start there because acknowledging the problem is the first step to resolution. They (meaning the government and those in charge) have used black people in this country for hundreds of years, for their profit and for our own destruction. Your skin-folk ain't your kinfolk but your kinfolk is also only trying to survive as well. But let's not go there because this movie went there for us and the cast showed this strongly.Trip: Yes, Judas and the Black Messiah has inherent relevance to 2021 American culture considering all that's gone on in the last year. The film as directed by Shaka King takes care to show how the Black Panther Party, and Fred Hampton in particular, was more than some militant, anarchic political radicals, but that there was a deep connection to the need for social and economic justice across racial lines. We see Hampton going to various groups to build his Rainbow Coalition. The charisma exuded in Danial Kaluuya's performance is essential to the success of this movie because without it we wouldn't understand why the FBI and U.S. Government were so afraid of Hampton. I'll also note that LaKeith Stanfield is very good, as he usually is. Stanfield has the more difficult part in that O'Neal, ultimately is not a sympathetic character because he's the turncoat. However, Stanfield does well to show that O'Neal has no good choices - he potentially loses his life and freedom whichever decision he makes. Other than that, I'd say Judas and the Black Messiah is a top notch biopic, hitting the highlights and transporting us back to such a volatile time through its style and performance.Trip: Judas and the Black Messiah is a must see film. The central performances are stellar, especially Kaluuya, and so, if you only see it for that, it is worth the price of admission. Yes, this is a big box of popcorn, sit back and enjoy.S2S: I must agree with everything that Trip said. I mean wow. Judas and the Black Messiah is a big box of fresh popcorn and that's all I have to say about that. You can kill the movie reviewer but you can't kill this movie."
    },
    {
      "rating": "9",
      "text": "The film was absolutely moving, heartbreaking and awesome. The performances of Daniel Kaluuya and Lakeith Stanfield are excellent. It paints a very vivid picture of the Black Panthers and the environment in which they were born and grew. Lakeith really bodied his character and i think he did an outstanding job. I did feel like some scenes were a bit dull and could have been cut but ultimately the film is nothing short of excellent."
    },
    {
      "rating": "8",
      "text": "Judas and the Black Messiah is a look into the lives of Fred Hampton, Chairman of the Illinois Chapter of the Black Panthers, and Bill O’Neal, the man who betrays him to the FBI.  Judas shows us the charisma of Hampton, leading both through inspiration and politics, to become the symbol of power and strength suddenly feared by white government.  As his star rises, the fortunes of Bill O’Neal fall, and he becomes entrenched in the schemes against the Black Panther movement and a plot to silence the growing influence of Hampton.  Judas illustrates the rise and fall of Gods and Monsters, in an era where normal men were both, largely by circumstance. Judas and the Black Messiah is written by Kenny and Keith Lucas (21 Jump Street), written and also directed by Shaka King (Newlyweeds, Mulignans).  It Stars Daniel Kaluuya (Get Out, Black Panther) as Chairman Fred Hampton of the Illinois Black Panthers, and LaKeith Stanfield (Knives Out, Selma) as his duplicitous Chief of Security Bill O’Neal.  Other notables include Jesse Plemons (The Irishman, Game Night) as FBI Agent Roy Mitchell, Dominique Fishback (Project Power) as Deborah, Algee Smith (Detroit) as Jake, Darrell Britt-Gibson (Three Billboards) as Bobby Rush, and a disturbingly supremist J. Edgar Hoover portrayed by Martin Sheen. The Trial of the Chicago 7 identifies Hampton as Bobby Seale’s choice of attorney, largely unavailable for being in prison.  The early part of Judas gives us some insight into what was happening with Fred at that time, closing important loops in both stories.  Bill’s story starts out in a seemingly simple manner that becomes more complicated.  An innocuous barroom car theft scheme soon gets spun into federal charges, putting Bill unexpectedly into the control of Agent Roy Mitchell.  With each ask of the FBI, Bill positions himself deeper into the Panthers, escalating his stature to Security Chief, gaining their trust.  Ultimately, that trust demands the highest price.  This film is about normal human beings leading remarkable lives in complicated circumstances.  Each character is delicately painted within the frame of the confusion and uncertainty of 1960s civil rights.  Deborah sees the light and leadership of Hampton’s imposing Chairman, but questions the violent nature of his message as parenthood looms.  Agent Mitchell devolves from appreciation for O’Neal’s service, and even his friendship, to a cold focus on objectives, largely defined by the supremacist figure of J. Edgar Hoover.  O’Neal himself struggles with his ever-growing role in the demise of Hampton and the Panthers, to the point of assassination.  But he takes the money, and the guilt that goes along with it.  He is an expert in both his roles.  The star here is Daniel Kaluuya though, as the larger-than-life Fred Hampton.  This is an Oscar worthy performance by Kaluuya, gracefully walking the tightrope between the energy of an inspirational leader, the anger of a man that exists in a reality of loss, and the conscience and gentility of a community servant.  He encourages power and action, but not at all costs, and the actor allows us to admire the personality and leadership of a merely 21-year-old Hampton.  As a historical drama, and a character study, Judas and the Black Messiah is both socially relevant, and highly entertaining, and I give it 4 out of 5 Stars."
    },
    {
      "rating": "10",
      "text": "London Regalia is a Masonic supplier in USA. Best Masonic Regalia Store that provides you quality Masonic Regalia Supplies at reasonable price.We offer you wide range of Masonic supplies which include Masonic Regalia, English Regalia, Knight Templar Regalia, Masonic Symbols, Freemasons Symbols, Masonic Apron, Blue Lodge Apron, Masonic Sashes, Masonic Caps, Scottish Rite Caps, Knight Templar Sword, KT Sword Belts, Knight Templar Rosettes, Masonic Banners, Kilts for Men, Kilts for Women, Leather Jackets and more.To shop please visit our website: https://londonregalia.com/"
    },
    {
      "rating": "10",
      "text": "Great movie with historical background. I like the most, that the movie is from the perspective of an informant, the Judas. It was very interesting to see the background how the state was infiltrating the Black Panthers. Grat performance by Daniel Kaluuya as Fred Hampton."
    },
    {
      "rating": "9",
      "text": "This film is getting alot of buzz for awards season and rightfully so, this is was a very good film with knock out performances especially from Kaluuya and LaKeith Stanfield. The story itself is devastating and you get accounts from both sides of the coin. Its a truly devastating film and definitely worth a watch."
    },
    {
      "rating": "8",
      "text": "“I’m free.” The first great movie of 2021 folks! Out of all the ‘Civil Rights Movement’ movies I’ve seen over the years, I honestly believe that this might be the best one. Without falling into any traditional biopics tropes that could easily dramatize its history. It instead focuses on a story about fear, violence, betrayal, and loyalty. It is heavily empathise from different perspectives; it’s the reason why it was more effective.In the movie, whenever someone gets shot, beaten, or just hurt, you feel it. The sound work, directing, and the performers manage to make it believable. Very brutal and realistic. However, what surprised me the most is how suspenseful the movie was at times, with the payoff either being soul crushing or shocking.All thanks to Shaka King’s directing and Sean Bobbitt’s cinematography that manages to capture the most difficult times in American history, but also capturing the feeling of that time, or what it must have felt like. Daniel Kaluuya, what a beast of an actor that keeps growing momentum over the years. Powerful and natural, he really is one of the best working actors of today. Not only did he capture the accent but nailed down the overall feeling of the charismatic activist Fred Hampton.LaKeith Stanfield, a fantastic character actor that pops up everywhere and fully commits to every role he plays. In this movie, he delivers a fantastic performance and he continues to surprise and amaze me. Perfectly casted as well, him playing Bill O'Neal, the tense and sleek FBI informant who infiltrates the Black Panther Party and keeps tabs on their charismatic leader. Stanfield himself already has that intense look in real life, which best suits him for this type of role.Martin Sheen and Jesse Plemons were also fantastic in their supporting roles. Dominique Fishback also deserves a mention here because I thought she was brilliant as Deborah Johnson, the woman who falls in love with Fred Hampton. There’s one particular scene in this movie, without her uttering a single word, absolutely killed it and made the scene itself more devastating. I’m keeping it vague because it will be spoiling things and we don't want that, do we? Watch the movie and see for yourself. I found the overall experience devastating, and yet, a hopeful one as well, as there was little glimpses of light, because despite there being so much hate in this world, both past and present, you cannot destroy a revolution.Overall rating: People say that ‘The Trial of the Chicago 7’ kept their interest throughout, but for me it didn’t, as I thought there had to be a more interesting movie to be made around the Black Panther Movement. Well, everyone, here it is."
    },
    {
      "rating": "7",
      "text": "By alluding to the history's most nefarious story of betrayal, the title gives away that the movie draws a modern parallel between William O'Neal and Judas Iscariot. In such a risk-taking move that could easily spoil the ending, we can assume that the story here has more than meets the eye. The real significance of the story doesn't lie in its relevance or in the sense of \"history repeats itself\" per se, but rather in the fact we recognise that. This is what makes it all the more shocking and shameful. With all that being said, the movie itself is quite daring. Hollywood has made quite a few films about The Black Panther Party recently, but the relative dearth—as far as I'm concerned—have tackled the story of life and death of Illinois Black Panther Party chairman Fred Hampton. It is no easy feat, but what's even harder is neither villainising O'Neal's character nor absolving him from culpability. In other words, the movie doesn't take sides when it comes to the two lead characters, portrayed by LaKeith Stanfield and Daniel Kaluuya who gave astounding performances that further cement their status as two of the best actors working today. Stanfield perfected his character's uncertainty to a tee, while Kaluuya showcases his acting chops in full swing whether at his most theaterical or understated moments.However, the movie can be accused of playing it safe storytelling-wise. Apart from the few opening minutes that instantly hooked me, the progression of events couldn't have been more pedestrian. I could feel a blood-boiling energy that has something of Spike Lee about it, but it seems quite repressed because the plot is restrained. Thankfully, the second half let this energy loose, regaining the sense of intrigue the movie has been lacking in except in its stylish moments, and acceletating tension of the plot in the process. Another qualm I have with this is how Mitchell, the FBI agent, tries to convince O'Neal to become an informant literally by saying that the KKK and the Black Panthers are no different. I mean, really? Regardless, this movie is definitely my biggest surprise of 2020, especially since I didn't even have the urge to watch it because the trailer made it feel like one of these style-no-substance movies that are entirely dependent on flaunting their anger to drive home their moral value.(7.5/10)"
    },
    {
      "rating": "9",
      "text": "A truly exceptional piece of filmmaking. I was surprised that this was Director Shaka King’s 2nd Feature Film and it was this good. Daniel Kaluuya is my lock in for Best Supporting Actor at the Oscar’s this year and he definitely deserves it. So far, Kaluuya’s performance is my favorite of 2021 and it will probably be that way for a while. He brings a lot of emotion to this role that I haven’t seen him do in a long time. It’s obvious that he cares a lot about this project. Lakeith Stanfield also did an incredible job too. He’s outshined bu Kaluuya in some scenes but you can’t deny the powerhouse of emotion he brings to his scene. Jesse Plemons is an actor I’m definitely keeping my eye on as he seems to be the Philip Seymour Hoffman of his generation. From what I researched and listened to, this film is very historical accurate with maybe one or two exceptions here and there but it presents everything in an incredibly tense, outstanding, and emotional way. If you know the story of Fred Hampton then you know what happens to him and the way the film portrays this is anger inducing and incredibly emotional at the same time. This is all thanks to the writing and how the film is shot. The film looks great. The way some of the shots are set up is fantastic because of how much it shows and how much it doesn’t show. This is an emotional powerhouse of a film that I would definitely recommend even if you’re not fully engaged in this subject."
    },
    {
      "rating": "8",
      "text": "A title like Judas and the Black Messiah tells you not only the kind of relationship the main characters will have but also how it will end. It also sets up the characters as figures of mythic and grand proportions. Fortunately, the approach by director Shaka King, the Oscar nominated screenplay, and the excellent cast emphasize the human elements of this true story. It seems as though everyone involved in making this film knew there was little that they had to do to convey the importance of the story of Chicago Black Panther chairman Fred Hampton and the events that led to his death. This may sound like a heavy film given the subject matter, and at times it certainly is, but, in addition to the people and events depicted, the craft and skill on display in every aspect of the movie make it well worth watching. I was reminded of a Roger Ebert quote: “No good movie is depressing; all bad movies are depressing.” Judas and the Black Messiah is a good movie. The film opens with Bill O’Neal (LaKeith Stanfield) finding himself in an unfortunately ironic predicament. He has been caught by the FBI for impersonating an FBI agent in order to steal cars from unsuspecting bar patrons. Now, real FBI Agent Mitchell (Jesse Plemons) offers O’Neal the choice between going to prison or infiltrating the Black Panthers and becoming an informant. O’Neal takes the deal, eventually working his way to becoming the head of security for the Panthers and the driver for Fred Hampton (Daniel Kaluuya). As he passes information to the FBI, O’Neal also comes to believe in the cause of the Panthers and finds himself greatly conflicted. Stanfield has great emotional scenes with dialogue and quiet moments trying to hold back his conflicted emotions. His character is always under stress, always presenting one persona to Hampton and the Panthers and another to the FBI. His betrayal of Hampton is by no means excused, but Stanfield shows us the emotional and mental state of the man driven to it. As good as Stanfield is, the real standout is Daniel Kaluuya as Fred Hampton. He captures the confidence and charisma of the 21-year-old activist, but the screenplay also allows us to see him in private moments like him reciting along to a record of a Malcolm X speech to practice his own oratory skills. Dominique Fishback as Debra Johnson also gives a great performance as Hampton’s fiancé. When she first attends a Black Panther meeting, she is immediately captivated and enchanted by Hampton’s speech. Kaluuya’s performance makes her attraction both to his words and his presence easy to understand. His scenes with her allow for quiet, intimate moments that further show this figure from recent history as a real person. Kaluuya is the frontrunner for the Best Supporting Actor Oscar, in part because he is actually a co-lead along with Stanfield, who is also nominated in the Supporting Actor category. True stories can make for great films, but great films based on true stories do not necessarily make for great history. I do not doubt the authenticity of the characters or major events depicted or the FBI plot that led to Hampton’s death. I have read and seen enough documentaries to know that J. Edgar Hoover’s FBI was motivated by his serious but mistaken belief that the Civil Rights movement was being controlled by communists and had to be stopped before it destroyed the country (here Hoover is played by Martin Sheen in a performance too small to be especially good or bad, however, his makeup is especially bad). Judas and the Black Messiah is the best kind of based-on-a-true-story film: it engaged me with the story and characters, giving me a real sense of what things were like for them, and it makes me want to learn more about the events and people depicted. The film ends with documentary footage and these short clips actually enhance the emotions of the movie instead of undercutting them. If you already know the story of Fred Hampton and the FBI’s insidious campaign against him and the Black Panthers in the late 1960’s, the reason to watch Judas and the Black Messiah is for the incredible performances from Daniel Kaluuya and Lakeith Stanfield. This isn’t just another biopic or a reenactment. At times it plays like a tense thriller in the same vein as Martin Scorsese’s The Departed. At other times it plays like a quiet drama. At every moment we are made aware of the social imbalances and injustices that motivate Hampton and the Panthers and come, too late, to move O’Neal as well. It is unfortunate and frustrating that these social imbalances and injustices are still being dealt with today.  Judas and the Black Messiah comes as close as any movie does to bringing history to life."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)The best parts are those that avoid the black and white (!) of militant polarization by pointing out contradictions and ambiguities (already the very etymology of revolution, public and private, collectivism and individualism, war and motherhood, populism and charismatic leadership, Christology and atheist/immanent/materialist utopia), but they are not numerous enough."
    },
    {
      "rating": "9",
      "text": "The tragic story of former Black Panther Party leader Fred Hampton has found a worthy recipient in director Shaka King. In his second feature film, Shaka tells the story of the rise of the young Hampton in Chicago in the late 1960s. The latter is unaware that a member of his own ranks is cooperating with the FBI to put a stop to him and the party.Judas and the Black Messiah is marked by outstanding performances. Lakeith Stanfield acts as the \"Judas\" in the film, i.e. traitor William O'Neal, who is infiltrated into the Black Panther group as a mole by FBI employee Roy Mitchell (Jesse Plemons) after attempted car theft. The two share a very believable and atypical chemistry that almost makes you suspect a friendship of sorts. The real person behind William O'Neal even said years later that he admired Mitchell. Stanfield is the real protagonist of the film. Large parts are taken up by Daniel Kaluuya as Fred Hampton, the \"Black Messiah\" beloved by many but just as much opposed by many. Kaluuya is tailor-made for this role. He is electrifying, powerful and does not hold back in illustrating his emotions. It is above all Kaluuya's eyes that say a great deal about his character and illustrate the determination Fred Hampton displayed to assert his values. Especially during speeches he lets it all out and combines all kinds of emotional states: suffering, passion and anger towards the \"Pigs\" (racists). Dominique Fishback, as Hampton's partner and mother-to-be Deborah, takes up quite a bit of screen time and displays enormous poetry and passion in her few dialogues. She and Kaluuya also have terrific chemistry.Judas and the Black Messiah is ultimately just a semi-biopic about one of the most significant black freedom fighters in American history. The focus is on O'Neal's betrayal and Hampton's relentless fight against racism and for equality. Besides the superb acting performances, the cinematography and King’s atmospheric direction stand out as major strengths. If the film can be criticised for anything, it is that due to its lengthy structure it often fails to find a red thread and gets lost in arbitrary subplots a few times. These have relevance to the main plot, but take up several minutes of the running time. Without Stanfield's authentic acting, his character would lack a lot of humanity, because it is difficult to empathise with him despite him being the protagonist. The exact opposite is the case with Kaluuya, who absolutely dominates and captivates the film. From start to finish, he fills Hampton's big shoes brilliantly, honouring a historical figure who unfortunately flies far too much under the radar. Judas and the Black Messiah is an excellently realised film and communicates important and educational incidents."
    },
    {
      "rating": "8",
      "text": "The best thing I can say about this film is that it is extremely bold and makes you want to do a lot of reading afterward to find out more. It is also extremely well-made, with great performances all around -- particularly from Daniel Kaluuya. I always felt the film was teetering on the edge of being truly great, but in the end I felt it did not quite get there. It is hard to put my finger on why, but I think it is because the film has so much to say that it doesn't know what to prioritize and ends up feeling a little unfocused. Regardless, it is a good film, and worth your time."
    },
    {
      "rating": "7",
      "text": "This was easily one of my most anticipated films of this year. However, this movie simply left me feeling disappointed. Character development is just underbaked and some parts of the film are flat out boring. Daniel Kaluuya gives a dedicated performance yes, but not a great one. LaKeith Stanfield's character is criminally left out to dry with no development or reason to how he feels. Sure, it's very interesting to see the divide in black Americans response to the racism around them. I just wish they would've done something more interesting with it. I do understand that this a hard thing to do since this is a true story, and changing the story too much would be straight up lying. This is just one I'm not going to remember sadly..."
    },
    {
      "rating": "8",
      "text": "Um grande filme, que possuí excelentes atuações (principalmente a de Daniel Kaluuya), e que conta uma história real muito interessante"
    },
    {
      "rating": "8",
      "text": "Judas and the Black Messiah (2021): Judas and the Black Messiah follows William O’neal (played by LaKeith Stanfield). He is a car thief that gets caught trying to impersonate an officer while stealing a car. To avoid going to jail for 5 plus years, he agrees to infiltrate the Black Panther chapter in Chicago for the FBI. In the end, the FBI hopes he'll be able to have enough info to indict the head of the chapter and self-identified revolutionary Fred Hampton (played by Daniel Kaluuya).Problems: The biggest problem in this film is the throwaway scenes. Some scenes are just there, they don’t add anything to the plot or further the story in any meaningful way. In the worst case, this happens when what should be pretty important never gets mentioned again. Like how in one scene Williams is being scolded by Fred for having a plan to blow up a government building. This causes Williams to get mad and basically call Fred a race hustler, which is a pretty massive claim especially since he is the leader of the party, yet after this scene, it is never brought up again.-The Score works, but sadly it's nothing to write home about. This sucks cause there are so much Jazz and blues that would have fit perfectly in the setting of 1960's Chicago.Praises:- I liked how the story is incredibly genuine in portraying the actions of the black panthers and the police. It doesn’t glamorize either side it. Instead, it shows the evils and good deeds of the Black Panther group as well as effectively portraying the brutality and injustice committed by the police. I also love the action scenes because they’re built up which gives the audience this suspenseful feeling which is always given a payoff that never fails to disappoint. For example, there is this scene early in the film where the Panthers are meeting with a rival Black power faction in hopes to unite. In this scene, Williams is recognized by a foot soldier of the rival faction as the guy who tried to steal his car the other day. Before the soldier can make a scene and confront him he is stopped by a boss from his faction nonetheless though this catches the eye of a few of the Panthers. As a result after the meeting, they hold him at gunpoint and interrogate him. They find out that he would dress up as a fake FBI agent to rob cars. They become highly suspicious after this is revealed since they previously had to kill a member who turned out to be an agent. So, to make sure he’s legit they tell him to hotwire the car they’re in, or they will blow his brains out.-I love the dialogue because it’s smartly written and really makes’s each character feel unique as an individual instead of just another face in the crowd. I also Have to praise Daniel Kaluuya’s acting as Fred Hampton which is definitely Oscar Worthy. He portrays this character with real charisma and confidence that reminds me of De Niro in Casino. It also really works at making Fred feel like a character that was able to persuade young hearts and minds to join the Panthers cause after hearing Daniel deliver some of those speeches I felt genuinely shocked. LaKeith Stanfield also deserves praise for his performance as Williams. He conveys this feeling of being split between two worlds and the fear that comes with the territory. Judas and the Black Messiah does have some problems, but overall it’s a package that hits hard and entertains all the way through. For these reasons I would say this is a definite eight out of ten and the first real must-watch film of 2021."
    },
    {
      "rating": "7",
      "text": "An important time in American History that should not be over looked. You can't judge a book by it's cover. Great soundtrack. Powerful, sad story."
    }
  ],
  "recommendations": [
    "hidden_figures",
    "the_last_king_of_scotland",
    "just_mercy",
    "12_years_a_slave",
    "spotlight",
    "blackkklansman",
    "green_book",
    "the_imitation_game",
    "richard_jewell",
    "patriots_day",
    "race",
    "the_mauritanian",
    "darkest_hour",
    "42",
    "hostiles",
    "jackie",
    "12_angry_men",
    "only_the_brave",
    "snowden",
    "the_last_duel",
    "the_help",
    "hotel_rwanda",
    "the_post",
    "the_hate_u_give",
    "the_white_tiger"
  ]
}