{
  "id": 106,
  "title": "Judgment at Nuremberg",
  "starring": [
    "Spencer Tracy",
    "Burt Lancaster"
  ],
  "runtime": 179,
  "genre": [
    "Drama",
    "History",
    "War"
  ],
  "description": "In 1947, four German judges who served on the bench during the Nazi regime face a military tribunal to answer charges of crimes against humanity. Chief Justice Haywood hears evidence and testimony not only from lead defendant Ernst Janning and his defense attorney Hans Rolfe, but also from the widow of a Nazi general, an idealistic U.S. Army captain and reluctant witness Irene Wallner.",
  "releaseYear": "1961",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cqumfgd74ftVzOKJpFGOG64WlXL.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 4.0,
    "soundtrack": 4.0,
    "cinematography": 4.0,
    "familyFriendly": 4.0,
    "funny": 4.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Should you be judged by following the law? This film shows the dilemma faced during the trials after WWII. What should've being taken into consideration? What is the right thing to do? Is it worth spending 3 hours watching it? Yes it is, for sure."
    },
    {
      "rating": "5",
      "text": "i don't make wagers..Judgement At NurembergDespite of its overlong runtime, there is a lot of material in it to feed off the audience for more than 3 hours. Abby Mann's adaptation might be the only strongest link in this feature excluding Stanley Kramer; it is a bit loose on depicting the intensity and the emotions behind all the drama and the editing too seems liberal (they could have narrowed it down to around 2 hours). On performance level, it holds up the expectation and delivers without flinching by great actors like Spencer Tracy, Maximilian Schell and Montgomery Clift. Judgement At Nuremberg remains true to its nature and loyal to the tone of the feature till the last frame which possibly is the only reason to encounter this experience for it lacks gripping screenplay, better editing and execution of a scene."
    }
  ]
}