{"id": 374, "title": "Jumanji: The Next Level", "starring": ["Dwayne Johnson", "Kevin Hart"], "runtime": 123, "genre": ["Adventure", "Comedy", "Fantasy"], "description": "As the gang return to Jumanji to rescue one of their own, they discover that nothing is as they expect. The players will have to brave parts unknown and unexplored in order to escape the world’s most dangerous game.", "releaseYear": "2019", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/jyw8VKYEiM1UDzPB7NsisUgBeJ8.jpg", "categories": {"plot": 5.771428571428571, "acting": 5.930232558139535, "ending": 5.5, "soundtrack": 5.5, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.864864864864865, "action": 5.833333333333333}, "reviews": [{"rating": "0", "text": "This movie is trash kevin hart isn’t funny for one second , kevin hart is not funny"}, {"rating": "4", "text": "The 2017 film was enjoyable, primarily watching the 3 leads (Dwayne Johnson, Kevin Hart & Jack Black) play against type (my review). This one takes the same stars, tosses in a few new characters and plops them back in the imaginary world, where they must save the game and their lives. However…this time it isn't very funny. Granted, Hart's delivery can mine a laff out of almost any line, but the script doesn't give any of them much to play off (director Jake Kasdan also wrote this time). The action and visuals are OK, but the film lacks suspense, excitement or even much fun."}, {"rating": "1", "text": "Badly written and cringe-inducing, pre-school level of filmmaking. As a film imitating a video game, Jumanji:TNL fails to capture any aspect of what makes either medium great. Together with 90% of comedies, it's badly written only to provide cheap laughs at the expense of any sense of good storytelling."}, {"rating": "6", "text": "This movie has many sins. One of the biggest is that it is like The Hangover 2 same plot and jokes as the previous installment into the series. This movie will make a good family movie because Danny Devito sadly does not make his signature suicide jokes that we all know an love. If you are bored one day and do not know what to do, give this movie a chance. But this movie is better than the original"}, {"rating": "0", "text": "I was highly disappointed in this movie. I took my whole family to see it and was appalled by the usage of “GD” throughout the ENTIRE MOVIE!! That’s nonsense. There was other foul language but that was uncalled for!"}, {"rating": "2", "text": "This movie shows how to take the name of a good movie and turn it into trash. Dated jokes, lame one liners, and Jack Black playing Jack Black. Why are so many new movies such utter garbage?"}, {"rating": "2", "text": "Some of the acting seems to be off somehow, I can't explain how why etc, lacked the punch of Jumanji one. I hate to say it as I'm a fan of several of the people/actors who are in this film, we got bored."}, {"rating": "1", "text": "Left a bad taste that tainted the nice memory of the first one. So many flat-falling one-liners, forced scenes, inane deaths, such squandered potential :("}, {"rating": "4", "text": "Ok I did laugh out loud in parts but in general this film was very lack lustre and sloppy in relation to his predecessor, which I loved. The first hint of something not right is watching Danny Devito 'act old,' stumbling around, falling over, which is so fake as the writers are just trying overly hard to create a contrast between that version of him and his morphing into BravestoneThen there's the fact that the group decide to follow their friend into the game and risk their lives so willingly, even though they have no idea what he's up to and why he'd risk them doing such a thing and endangering themselves. This time the group are just so stupid, wasting countless lives without even fighting any enemies. Then there's the Character switches. Jack Black playing an African American is just a bit lame and he has like no decent lines in this film. They should have kept the roles the same. Saying that, Kevin Hart really carries this film with his performance as Denzil Washington. His lines are all amazing. Ok, so why are the group like superheroes now? They can fall out of planes, have car crashes etc and not even die? This kills the suspense. I had high expectations for this film but the story telling is lazy."}, {"rating": "2", "text": "It's not that it's a bad movie, It's more because The Next Level recycles virtually everything we saw in Jumanji 2. The same exact jokes and an incredibly similar plot. It killed any potential enjoyment for me because so many times I was saying to myself \"They did that in the last movie\"."}, {"rating": "5", "text": "Next level is an uninspired waste of a decent production budget. I feel with this franchise there lies the potential to tell a fascinating story which is once again squandered for the sake of the lowest common denominator. There is nothing to challenge the audience as there is simply no tension of being stuck in a vitious game of death. It feels as if the cast are given little to no screenplay to work with and so everything just goes through the motions. Do not waste your time on this movie."}, {"rating": "3", "text": "Save for a few jokes here and there delivered with a natural finesse by the actors and some breath-taking action and chase sequences, Jumanji 3 felt like a rehash of the second instalment that just leaves too much to the imagination with the game characters having it too easy this time and the addition of at least one annoying character. TN."}, {"rating": "4", "text": "That's the cool movie at least it should be if you compare it to the previous one. I love the first part but I can say about the second \"the Next Level\" it's a joyless cash grab. And the Ming character just worst character ever you cant do a first porn video if you know what I mean. Finally, this part has to be twice awesome than first but nope. I hope the third part gonna blow our mind."}, {"rating": "5", "text": "Jumanji 's sequel turned out to be even worse than the remake. In general, it seems that it is the same, with the same heroes, but the second time no longer works. The first film looked successful in using the original 1995 film. The authors of the sequel understood this and even tried to diversify the film with new geproes and locations. But it didn 't work out, a passing family movie. Jack Black pleased again with his game)"}, {"rating": "6", "text": "Suddenly Jumanji is a film that goes in opposite direction to the original. Original Jumanji = Games enter the real world. Jumanji new generation = people from the real world enter the game. Here we are again with the new generation. Although .... In any case the film goes much further in terms of action, team, smile, wink as well as environment. The dead are more diverse and the puzzles too .. Only it is the same more. It is the latter that can be hurtful for the spectator. Just the fact that when it's not new people tend to get bored without knowing why. That's the reason. The film is too much like the old one without revolutionizing one of the genres it shows. A good action, child oriented adventure. For my part we find ourselves in front of a good time .. It all depends with whom you spend itDu coup Jumanji est un film qui va en sens inverse par rapport à l'original.. Jumanji original = Jeux rentre dans le monde réel. Jumanji nouvelle génération = les gens du monde réel rentrent dans le jeu. Ici nous nous trouvons encore avec la nouvelle génération. Quoique que .... En tous cas le film va bien plus loin en termes d'action, d'équipe, de sourire, de clin d'œil ainsi que d'environnement. Les morts sont plus diversifiées et les énigmes aussi.. Seulement il est le même en plus. C'est cette dernière qui peut être blessante pour le spectateur. Simplement du fait que lorsque ce n'est pas nouveau les gens ont tendance à s'ennuyer sans savoir pourquoi.. La voilà la raison. Le film est trop ressemblant à l'ancien sans révolutionner un seul des genres qu'il montre. Une bonne action, aventure orientée enfant. Pour ma part on se retrouve devant un bon moment.. Tout dépend avec qui tu le passes"}, {"rating": "6", "text": "Dumb and fun action adventure movie with a few laughs. This is not quite as good as the previous Jumanji films. Yeah still had fun with it though, but not as much fun like the other two movies."}, {"rating": "6", "text": "This movie was a disappointment to me and definitely not as good as the last one. The writing was not that funny and things that were supposed to be funny were really not funny at all. The acting was great especially from Awkwafina, Danny DeVito, Karen Gillan, Nick Jonas, Jack Black, Rhys Darby, Dwayne Johnson, and Kevin Hart. I felt that the acting from Dwayne Johnson and Kevin Hart was not as good in this one as it was in the last one just cause the writing was not funny. The visual effects were phenomenal just like in the last one. The music was great. Overall not a horrible movie but it was far from the perfection of the last one and it was one of my least favorite movies of 2019."}, {"rating": "6", "text": "Apenas mais um filme de ação com um roteiro clichê, algumas cenas se destacam mas nada demais... 6/10"}, {"rating": "6", "text": "In true sequel fashion, it is not the hit that its predecessor was. While the use of Danny Devito and Danny Glover is funny, it doesn't hide the fact that characters have the same issues as in the first movie. The charisma of The Rock is non-existent, and other than Jack Black there's not much reason for this cast to be in it. The plot is forgettable, but there's just enough humour in it that it wasn't a failure. It's an average movie."}, {"rating": "0", "text": "Rock was cute but the movie was very bad. did not enjoy watching it. I miss the money I spent"}, {"rating": "4", "text": "This one was a little better and more interesting than its previous one Welcome to the Jungle. The characters and ideas were the same and everything was pretty average but it had a little more comedic value and it had Danny Devito baby.I hope they stop doing these movies because milking something thats not even good is even worse than remaking something from a previous great movie."}, {"rating": "5", "text": "The original Jumanji from 1995 is dated but fun. The sequel from 2017 is not good but the 2019 sequel is slightly better than it. This film has basically the same plot as the original although it does differentiate in a few places but its repetitiveness leads the film to be predictable. I was able to predict what was going to happen before each “level”. Since I felt it was predictable, I did get bored during some sequences. The film has a noticeable lack of tension due to its repetitiveness and predictability. I knew the characters would be fine and make it out of each situation okay. The script is nothing too good either. It isn’t terrible but I felt it lacked a little bit of charm and caused some of the jokes to feel a little forced although a handful of jokes got a smile or chuckle out of me. The video game characters played by Dwayne Johnson, Karen Gillan, Jack Black, and Kevin Hart did a pretty good job. In the first film, they had to impersonate only one character but in this film they had to impersonate two or three and I felt they did a great job at that. In the first film, I felt Jack Black was the only funny character but in this one Jack Black and Kevin Hart were the funniest ones. Gillan and Johnson were able to get a laugh out of me though in a couple of areas. Unfortunately, the acting from the real life characters, besides Danny DeVito and Danny Glover, was not so great. They do not have any chemistry together and just felt awkward around each other. The action set pieces are new and unique in some areas but similar and repetitive in others. They were entertaining yet a little boring at the same time. Some of the technical aspects are just okay. The music is bland and boring but the cinematography is serviceable. The visual effects were mostly below average in the first one but they were better here although very shotty in a few areas. Overall, Jumanji: The Next Level is dumb popcorn fun with good acting and chemistry from the video game characters but its predictability, repetitveness, and lack of tension takes away from the film."}, {"rating": "2", "text": "\"Jumanji: The Next Level\" se acomoda, traz mais do mesmo e joga todo potencial, trabalhado no seu antecessor, fora - por pura sede de dinheiro.Ok, este é um filme Blockbuster, então há coisas que já deveríamos esperar, e justamente por isso que acabamos gostando de filmes sessão da tarde: Sabemos o que há por vir. Mas quando falamos de uma sequencia, é de se esperar ao menos coisas novas, e aqui o que houve foi um roteiro preguiçoso e quadrado.O filme já começa errado no motivo da volta ao jogo, que é no minimo desestimulante. Porquê trazer os mesmos personagens se não haverá o minimo de construção? E digo mais: Porquê trazer novos personagens se eles não acrescentam nada de significante a trama?Ao prosseguir do filme, fica bem claro que o mesmo zomba da inteligencia dos telespectadores, reapresentando conceitos que já foram trabalhados no ultimo filme e explicando-os de maneiras preguiçosas e até insuportáveis dados momentos - talvez os novos personagens tenham esse proposito, servir de gancho a explicação para que quem não assistiu o primeiro Jumanji pudesse acompanhar sem precisar usar o minimo do seu cérebro. Fora os clichês e situações que já ocorreram no primeiro filme, só que de maneiras diferentes - como a explicação dos animais ou o Dance Music Skill.O roteiro também é muito conveniente, fazendo a mesma técnica do primeiro filme, só que de maneira mais escrachada. Em diversos momentos, os personagens perdem vidas de maneira inexplicável, forçando um certo tipo de receio pela vida dos personagens que só existe na cabeça dos produtores - e eliminando completamente em quem é minimamente atento. As atuações nunca foram piores, o que deixa claro o despreparo do diretor ao guiar atores como Dwayne Johnson, Alex Wolff e Rory McCann. Inclusive, tenho a impressão que quase todos foram melhores no primeiro filme. E levando em conta o orçamento de 125 milhões de dólares, eu esperava efeitos especiais mais convincentes.Jumanji: The Next Level é um filme fraco, com um roteiro acomodado e uma direção desatenta. Merecia mais - nós, o publico, claro."}, {"rating": "4", "text": "A film that shows that a second part is not necessary. Part 1 was fun and funny but in part two the characters don't fit at all. I think Kevin Hart and Dwayne Johnson are great in most films but in this film they do not come into their role. Letting play Dwayne an Kevin play as two older men for a large part of the film was a mistake from the writers. The second part of the film was a little better tho. In the end this film is not funny but not serious either."}, {"rating": "3", "text": "Horrible acting but a note thinker entertainment type of movie. Jack Black gives a little character to this bombshell but overall it's a movie to wait that goes to Netflix"}, {"rating": "6", "text": "While it has its moments where it touches all the great things from the first, it simply doesn't have enough to match it. Jokes wear thin and dialed back Kevin Hart isn't as fun as loud Kevin Hart."}, {"rating": "6", "text": "Palomera, para pasar el rato, película generica de la roca donde interpreta al mismo personaje rudo y carismático"}, {"rating": "0", "text": "I couldn't enjoy this like the rest of the garbage Hollywood makes this day. The characters are gay. You have a female \"mary sue' warrior beating up men (as if this is possible) and the male chacters acting weak (feminine). I didn't except nothing less from the dysfuntional people running Hollywood. They can't make normal (hetrosexual) characters anymore."}, {"rating": "5", "text": "A rather dull and pointless sequel. Hart & Black try to give this movie some life but it's just not enough to elevate this above being a bland mess"}, {"rating": "5", "text": "Jumanji:The Next Level review UStarring Dwayne Johnson,Nick Jonas,Kevin Hart,Karen Gallen.Rating=2.5/5Positive1.Dwayne Johnson Acting2.Comedy Scenes3.Cinematography4.Casting5.Decent Screenplay6.Music.Negative1.Not a good story2.Lag3.Not thrilling4.Not a powerful Villain5.Logic mistakes6.Climax was very predictable.Verdict=Jumanji : The next level is a bad adventure movie .Jumanji:The next level=JUMANJI:THE BAD LEVELSabharish G"}, {"rating": "4", "text": "This movie is pointless. It's a bargain bin version of the first one. A few funny scenes spread out but significantly worse than the first."}, {"rating": "4", "text": "Es una película innecesaria por donde se la mire, nada que ver con la anterior que estuvo bastante bien y eso que no le tenía fe. En la película anterior hubo varios momentos graciosos, pero en esta me quede esperando ese momento en el que te matas de la risa y más teniendo a Jack Black, que de por sí era el mejor personaje de la primera.Es la misma trama que la primera película, sólo modificada en ciertos aspectos. Es una cinta que se disfruta más en el cine, sobre todo por sus efectos especiales. Es un film predecible, más que nada al final.No puedo decir más que esto, el resto de las cosas están relativamente bien."}, {"rating": "6", "text": "Fun but forgettable. If you enjoyed the first film then this will do the trick just fine, but just like the first film this runs out of steam come the third act. For a sequel though, it’s pretty fresh."}, {"rating": "8", "text": "\"Jumanji: The Next Level\" continues the Jumanji franchise with yet another entertaining and hilarious instalment. While the film drags, there are plenty of fresh elements that keep the film interesting. The acting is terrific, the jokes land most of the time, and the plot is adequate. There is a mid-credits scene that sets up an interesting sequel."}, {"rating": "8", "text": "Hard to beat The Rock, Kevin Hart and Jack Black combination. The last Jumanji took a billion at the box office and this one will probably do the same if not more. It has all the right ingredients. It’s actually a bit better than the last one, a bit slow to get going but once it does its great. CGI is very good too."}, {"rating": "8", "text": "The movie is made for one purpose and one purpose only: to entertain the viewer. And that it does. Even knowing roughly what will happen, the movie's uplifting and bubbly tone, the creativity of the settings and the actors all make it a great fun ride. Love the chemistry between the characters, the fun and funny dialogue, the action and the absurdness of it all. It's all just great fun. The movie flew by. Love that the actors can all poke fun at themselves. So needed a movie like this, can't wait for the next one."}, {"rating": "9", "text": "Plot's consistent , but very Entertaining in its own right.went in with not much expectations , but turned out real good.movie felt a little short."}, {"rating": "0", "text": "Al igual que la anterior, una horrenda película, en mayor medida gracias al insoportable grupo de protagonistas."}, {"rating": "9", "text": "My spoiler-free thoughts on #JumanjiTheNextLevel:A third chapter that’s as good as the last one aided by action and adventure along with humor and wit from a returning continuously perfectly blended cast along with new faces including Danny DeVito, Danny Glover and Awkwafina. Also, the best way to see it is in IMAX.My rating: 4.5 out of 5 stars. ⭐️⭐️⭐️⭐️.5 or 9 out of 10."}, {"rating": "7", "text": "I'll just say it. It was fun. Parents were there and they brought there kids. Just like Star Wars was before Disney bought it and ruined it. They could make as many as these movies as they like and people will show up and have fun. I see at least one more of these movies in the works. There too easy to do. Maybe the last one could have a bit more of a twist? Still entertaining though, bring your kids. They'll have fun, the way movies should be. Without politics."}, {"rating": "0", "text": "First movie I've ever walked out of Danny DeVito tried and failed to save it it was absolutely horrible!!!"}, {"rating": "7", "text": "After two years of anticipation from the first reboot, ‘Jumanji: Welcome to the Jungle’, we’re treated to the clear definition of the sequel disease. What I mean by this is good enough, but still lacking in the “health benefits”. The second installment in the Sony-rebooted ‘Jumanji’ series is nothing short of high stakes. It’s adventurous, action-packed, and funny, much like its predecessor. But while watching the film, I couldn’t help but notice the poorly conceived villain, some inconsistent pacing, and some areas of the film being much less hilarious than ‘Welcome to the Jungle.’ There were definite moments where I burst out laughing, but there were at least two to three times more in the first. Overall, it’s a good enough installment in the ‘Jumanji’ series, and I’m still eager to see what happens next."}, {"rating": "7", "text": "Jumanji: Next Level Stays the Same LevelThe Stream: Not so different from the first movie.The Big Screen: A few laugh out loud moments throughout the movie.The Final Bill: A solid family movie during the holiday season.-S2S*Jumanji drums pounding*Welcome to Jumanji! Pick your avatar! Hold on… I accidentally got sucked into the game for a second. Hey everyone, welcome back to Stream To Big Screen. This weekend we were able to review Jumanji: The Next Level. This is the sequel to Jumanji: Welcome To the Jungle from 2017. This movie again stars Jack Black, Dwayne Johnson, Kevin Hart. This time they welcome a few new old timers to the series Danny DeVito, Danny Glover, and Rory McCann (the Hound).On Level 1, we must discover the plot. If you saw the first one, then you pretty much will get this movie. Basically, the film brings together a ragtag group of individuals who think they know who they are but this game will ultimately help them find out more about themselves. It happened in the first one, and it happens again here. That’s not why you come to this movie.*loses a life*On Level 2, you come to this movie to be entertained, pure and simple. The Rock and Kevin Hart work together quite well. Unfortunately, here they don’t get to play off of each other as much as I’d like, but they still give some gems. Do not get me wrong, my viewing neighbor and I were cracking up throughout the movie, but at times the jokes got old. Honestly, just thinking about Kevin Hart doing an impression of Danny Glover and Dwayne doing his impression of Danny DeVito’s character was quite hilarious; however, by the end of the movie the old people jokes have worn out their welcome.The movie just felt too long – partly because they overused the same jokes.*loses a life* There were a few lulls throughout the movie, but in the times of action or comedy the movie does a good job of keeping you entertained. And, the direction of the action is good enough to make the audience feel as if they are really in a video game, which makes up for some of the lulls in the movie.Final level of this review, Jumanji: The Next Level is a fun family friendly movie. There are laughs for the old folks and the young. If you liked the Jumanji from 2017 you will like this one. I would suggest during this holiday season that you take the kids to a matinee and allow yourself to get sucked into the game.Call it by its name….. JUMANJIIIIIIIIII!"}, {"rating": "10", "text": "Great fun throughout the whole story, enough new things to keep the franchise interesting."}, {"rating": "7", "text": "Much better than I expected such a quickly released sequel to be. Especially one that looked like it wasn't going to be much more than a cash-grabbing retread of the original. While it is certainly familiar, The Next Level is actually a minor improvement on its predecessor with everybody's shtick being a bit funnier this time around. Watching Hart and Johnson play old men never gets old, Jack Black proves once again to be one the best character actors out there right now, and Awkwafina almost gives him a run for his money with her dual performance. Even Karen Gillan who is largely stuck in the same role as last time gets a brief moment to embody a different persona, which she does impressively.The action set-pieces are also more exciting and memorable. While I'll only ever remember Welcome to the Jungle for its jokes, sequences here like the one where the cast dodge mandrills while jumping across moving rope bridges will stick in my mind just as strongly as any of the laughs. The themes of friendship and self-acceptance play out noticeably sweeter as well.The flaws are the same as before. Namely, not every gag or one-liner landing and it being kind of hard to pinpoint the target audience as far as age range goes. The comedy still varies wildly in terms of maturity. There are some moments clearly aimed at young children and others where the humor is so raunchy it seems only acceptable for older teenagers and adults. Because of this it kind of falls into a weird area where it's not going to be the most appropriate or comfortable choice for everyone's family movie night.Yet, I can't deny that it's a lot of fun. It never tries to go bigger than the 2017's Jumanji. Instead it introduces a few amusing new twists and some subtle refinements while saving the big changes for what looks to be a pretty interesting third (technically fourth) chapter. It's a better sequel because of that.7.9/10"}, {"rating": "9", "text": "I came to this movie with somewhat low expectations. I watched the previous entry, and while entertaining, and clever, it didn't leave me with a lasting impression. I expected an average experience.However, Jumanji: The Next Level really took the ideas and characters of the previous film to the next level. Rather than taking the easy route, and introducing new characters, the four original protagonists return, and their relationships had evolved prior to the plot. This requires to both portray new complications, and new dynamics between them. Kudos to the writers for that.Danny DeVito and Danny Glover proved to be an excellent addition. The interactions they provide - both in real life, and in the world of Jumanji - are rich, and humorous. I liked the display of the generation gap, when it comes to video games, and how the two adapted to concepts that were previously very foreign to them.All the actors perform well in this film, and seem comfortable in their roles. Their fun translates to an overall fun experience for the viewer as well.For me, one scene stood out above the others. It includes a perilous situation involving rope bridges and numerous angry primates. It reminded me of a similar scene in The Hobbit, where the heroes were in no real risk, and the horde of enemies provided no actual threat; no decisions based on character personality were made, and the whole thing was reduced to a perfectly timed CGI dance. Jumanji chose to provide much more than eye candy that fits a video game cut-scene, and again kudos to the writers.This review turned out longer than I intended, so here's the short version: go watch it!"}, {"rating": "7", "text": "I actually liked The Next Level better than the previous installment in this franchise. The idea that the characters could change personas was a bit more interesting and showed the range of each actor."}, {"rating": "7", "text": "I think that a vital element to reviewing movies lays in understanding the context and purpose of what it is you are watching. With that in mind, Jumanji the Next Level is not trying to be an Oscar worthy exploration of the median of film making, nor should it be. It is self aware in its goofiness and frequently leans into it. When the previous Jumanji movie came out I was pleasantly surprised by how entertaining it was. I wouldn’t say this film feels quite as fresh as its predecessor, since it relies on a number of similar jokes, however for the most part, the film was entertaining, and got some genuine laughs out of me. All the actors are clearly having fun with the roles, and that fun is infectious. Likewise there is solid on screen chemistry. I do worry that the continuation of this franchise could see it tire out very quickly and since the film does hint at a sequel (combined with Hollywood’s obsessions with flogging franchises of every penny possible) it wouldn’t surprise me to see another. We will have to see then whether my fears were justified.However for now, this is a bit of fun that is well made for the most part and worth the price of admission even if it is just an exercise in switching your brain off for a couple of hours. There is nothing wrong with that either, life and the world are too dark to not have room for some silly entertainment sometimes.7/10 Silly, Goofy Fun - primarily aimed at a younger audience."}, {"rating": "7", "text": "better than I expected, the higher rating professional reviews get it right"}, {"rating": "10", "text": "The sequel is again a masterwork for playing with stereotypes, cliches and tropes of video games and movies. They added Danny deVito and Danny Clover to the mix. Both are very good actors and are a fine addition of the already great cast. Then there is Awkwafina. While she had not as much screen time as the other delivered an awesome performance. Like in the prequel all characters are inside other characters as avatars. But now the roles are switched which is hilarious funny. Imagine the old man Danny deVito inside Dwanye Johnson body or in Awkwafinas. I will praise again the whole team and actors for this movie. You can see the fun they had during filming and are delivering the other characters personalities close to perfection. There is no out of character moment or misstep in this category. All jokes are working very well. We were entertained and did not stop laughing for a while. My only complaint are the first 20 minutes. They need a bit of time for the set up to get the story started. Maybe this is not a valid critic because we want more Jumanji and not a set up. However the later parts are more than enough to balance this out. Overall the title “The Next Level” is a fitting description for this movie. More of the same with added content and improvements. They keep the strengths and added new actors, abilities and lore."}], "recommendations": ["jumanji_welcome_to_the_jungle", "deadpool_2", "shazam_fury_of_the_gods", "pitch_perfect_2", "logan_lucky", "tag", "zombieland_double_tap", "ghostbusters_ii", "thor_ragnarok", "the_a_team", "deadpool", "the_losers", "night_at_the_museum_battle_of_the_smithsonian", "kingsman_the_golden_circle", "rocknrolla", "the_green_hornet", "minions", "baywatch", "thor_love_and_thunder", "spenser_confidential", "horrible_bosses_2", "guardians_of_the_galaxy", "hancock", "night_at_the_museum_secret_of_the_tomb", "pitch_perfect_3"]}