{
  "id": 1053,
  "title": "Jumanji: Welcome to the Jungle",
  "starring": [
    "Dwayne Johnson",
    "Kevin Hart"
  ],
  "runtime": 119,
  "genre": [
    "Adventure",
    "Action",
    "Comedy",
    "Fantasy"
  ],
  "description": "Four teenagers in detention discover an old video game console with a game they’ve never heard of. When they decide to play, they are immediately sucked into the jungle world of Jumanji in the bodies of their avatars. They’ll have to complete the adventure of their lives filled with fun, thrills and danger or be stuck in the game forever!",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pSgXKPU5h6U89ipF7HBYajvYt7j.jpg",
  "categories": {
    "plot": 6.538461538461538,
    "acting": 7.068965517241379,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.739130434782608,
    "action": 6.8
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Pretty entertaining movie.  I had no real expectations going into this but i enjoyed the film. I thought they did a good job of incorporating the different video game elements, and the humor throughout the film was mostly good.  Did not enjoy Kevin Hart too much, thought he could have been funnier but overall an enjoyable movie."
    },
    {
      "rating": "8",
      "text": "When I first saw the trailer for the Jumanji sequel, I was a little offended.  My first reaction was that they were taking a great child hood movie of mine and turning it into a comedy.  After seeing some positive reviews online, I decided to give it a shot. Needless to say, I was thoroughly impressed!    The film was more of a spiritual successor then an actually sequel, and it was not just funny but a well-structured movie.  For someone like myself that has played video games all my life, it was a real treat with all of the game jokes. All of the actors did a great job making this film work, with Jack Black really standing out.  Every scene he was in brought a smile or laughter from me.    If you are a Jumanji purest and want to see a movie similar to the original, you will be probably walk away disappointed. If you throw out preconceived notions and just want a fun & entertaining film, then this is an overall good family film to see. (Slight cursing from Kevin Heart)"
    },
    {
      "rating": "6",
      "text": "passable.  not great, not terribly awful, just about right in the middle, actually better than i expected it to be, the special & practical effects in this movie were top notch, the casting was alright, the story was simple. there are worse ways to spend 2 hrs."
    },
    {
      "rating": "6",
      "text": "I can say this for Jumanji: Welcome to the Jungle: It was way better than I expected, even getting more that a couple of genuine laughs out of me, and having a good, if nothing special, story, with some good action set pieces, and some memorable moments. Nothing special, but a fun ride nevertheless."
    },
    {
      "rating": "6",
      "text": "Jumangi was a pleasant diversion for an early evening: lots of silliness with a quasi-heart-warming ending.  I have no familiarity with video games, and so some of the characters and events were no doubt lost on me.  All four of the principal characters are stereotypes of personalities one can encounter among high school kids, and it was an interesting idea for each of them, once sucked into the game, to be stuck in a body drastically different from the bodies in which they had grown up.  Dwayne Johnson attempted to play the role of a scrawny geek suddenly endowed with an immense, powerful physique; but his acting chops were not sufficient to pull it off.  (Johnson, in every movie of his I have seen, basically plays himself.)  So the movie was by no means great art, but it was lots of fast-paced improbable fun."
    },
    {
      "rating": "9",
      "text": "Such a beautiful tribute to the wonderful and never forgotten actor, Robin Williams! Of course as many can tell this was not a sequel and did not feel like a sequel whatsoever, but it was and came off well as a continuation bringing our loved classic into the modern society. The humor was silly and unique, bringing a laugh to so many. The cast was absolutely top-notch and brought their characters forward and sold it despite many opposite traits of the actors and characters. Strong and confident Dwayne Johnson playing a terrified teenager? Jack Black playing a popular teenage girl? There's much more and the performances were just spot on. They tied everything back together just like in any well made movie, and you can't forget the very well written \"Indiana Jones\" feel soundtrack. This film is definitely not one to be forgotten!"
    },
    {
      "rating": "7",
      "text": "I gotta say, I thought it was going to turned bad but it turns out surprisingly funny. Yeah, there was a lot of movie clichés we already seen a billion times but this was a really fun film."
    },
    {
      "rating": "7",
      "text": "I thought that the movie was good. It had mostly good jokes, with good but too much CGI, an ending that I didn't like an good acting. It was mostly the ending that made me not like it as much. And there were some other things that didn't make sense. But I thought that it was a good movie"
    },
    {
      "rating": "6",
      "text": "Historia divertida con varios guiños a la película original. Destaca el humor (aunque a veces sea un poco absurdo). Ingeniosa adaptación del concepto original de juego de mesa al concepto de videojuego, Jumanji se renueva¡¡."
    },
    {
      "rating": "7",
      "text": "It's not the greatest movie ever, but it so incredibly fun at times it definitely worth a watch."
    },
    {
      "rating": "7",
      "text": "Very pleasantly surprised by this was was worried about this film with the original being one of my favourite childhood films but they did a great job and had many many laughs and a great cast."
    },
    {
      "rating": "7",
      "text": "PROS: 1) The adult cast is a good ensemble, although I feel like Kevin Hart's portrayal of Fridge is far more spastic than the younger actor, so someone was not matching the other. 2) Karen Gillan in Tomb Raider-esque attire. 3) It's mostly funny when it tries to be, and even when it fails, it's not embarrassing. 4) The video game setting is a cool way to update the concept. 5) The visuals are excellent. CONS: 1) The villain is incredibly uninspired. 2) The story beats are formulaic (no surprise, there, but hey, I gotta mark it zero, dude). 3) I know this is pedantic, but most video games do not have playable characters that have no offensive skills in a clearly adventure-based game."
    },
    {
      "rating": "8",
      "text": "Jumanji: Welcome to the Jungle is directed by Jake Kasdan, written by Chris McKenna and staring Dwayne Johnson, Karen Gillan, Jack Black and Kevin Hart.Story by Chris McKenna, and it's about four high-school kids discover an old video game console with a game they've never heard of--Jumanji--they are immediately drawn into the game's jungle setting, literally becoming the avatars they chose: gamer Spencer becomes a brawny adventurer (Dwayne Johnson); football jock Fridge loses (in his words) \"the top two feet of his body\" and becomes an Einstein (Kevin Hart); popular girl Bethany becomes a middle-aged male professor (Jack Black); and wallflower Martha becomes a badass warrior (Karen Gillan). What they discover is that you don't just play Jumanji--you must survive it. To beat the game and return to the real world, they'll have to go on the most dangerous adventure of their lives, discover what Alan Parrish left 20 years ago, and change the way they think about themselves--or they'll be stuck in the game forever...I liked this movie so much, it's unique and better than the first Jumanji, but Jumanji: Welcome to the Jungle isn't a sequel, it stands on it's own.Anyways, Jumanji: Welcome to the Jungle is full of action sequences which were very good, very talented performances in the world of Jumanji, but in the real life, the performances were bad, and it takes to another thing I hated about this movie, I didn't see so much of Jumanji or lots of animals as I expected to see. The CGI of the animals wasn't that good anyway. The story is really good, I loved every sequence of this movie, it's like video game but a movie, I loved it! The sense of humor of this movie is really funny, I liked that , but Kevin Hart with Dwayne Johnson scene was so Central Intelligence, I didn't that, but I laughed though.I liked Jumanji: Welcome to the Jungle very much and I'm gonna give it a B+.Thank you, guys as always for reading my review, I hope you liked it, and I welcome all of your comments."
    },
    {
      "rating": "7",
      "text": "A really fun time at the movies that's a lot better than the first. The four leads are funny and work very well together, and it's overall just a really good and funny time."
    },
    {
      "rating": "6",
      "text": "I was never a big fan of the 1995 film (only saw it once at a sleepover as a kid) so I went into this without any expectations (the trailers didn't sway me one way or another). It is a sequel to JUMANJI by title only, and the plot is pretty basic, but Johnson and Hart have solid chemistry and Jack Black playing the soul of a teenage girl is great. Is it art? No. But it is a fun time in a time where the world could use some."
    },
    {
      "rating": "8",
      "text": "I went into this movie with low expectations, and maybe that was the key to my really enjoying it. I found it to be a fun escape from daily life on a rainy afternoon. Over the top, tongue in cheek, unreality. I enjoyed the cast and their role plays. Would I recommend it? Yes. Would I watch it again when it hits DVD/TV? Likely. Would I buy it? Probably not. Am I glad I went today to spend some quality time with my son? Absolutely."
    },
    {
      "rating": "6",
      "text": "I went into the movie with (very) low expectations which perhaps helped me enjoy it quite a bit more. For the most part its just a silly silly comedy that spoofs itself and does genuinely have some decent laughs. Felt like the whole movie was shot in 1 day however. Decent family fun."
    },
    {
      "rating": "5",
      "text": "Relatively amusing but one thing brings this rating down and that is Kevin Hart, he is absolutely awful in this and one of the most unlikeable actors I've seen. Outside of that though there are a few genuine laughs to be had at this film, mostly curtesy of Jack Black though they are still cheap laughs but laughs all the same. I thought the video game aspects of this game were interesting such as the three lives and the non-playable characters. The villain was incredibly non-existent and it never really felt as though there was much threat to the characters. A decent enough action-comedy but I think the concept could have gone a lot further and produced much better results than it did. Also, ditch Kevin Hart."
    },
    {
      "rating": "6",
      "text": "Four high schoolers end up in the dangerous game, only this time it's in a jungle . They must solve a mystery and defeat bad guys (and wild animals) to save the game and their own lives. What makes this movie fun: watching 3 stars play against type: Dwayne Johnson (a nerd in a hunk's body), Jack Black (the hottest girl in school) and Kevin Hart (from a football hunk to a diminutive wise ass…almost everything he says is funny).  The action/adventure stuff is pretty standard with narrow escapes and noisy fights, but the overall energy and good-natured repartee make it sufficiently entertaining."
    },
    {
      "rating": "1",
      "text": "This movie is incredibly boring and generic.  The trailers made it look like it would be really funny, but instead its just a very generic predictable teen movie with no depth and a very thin plot.  Disappointing, as it has 3 brilliant comedy stars in it and a great comedy plot setup.  Unfortunately, the film doesn't do anything with it and instead its a quick cash grab using the reputation of the original Jumanji film."
    },
    {
      "rating": "6",
      "text": "Jumanji is a movie that knows what it is and succeeds. It's not going to amaze you with special effects or a suspenseful story. The movie is by the book in every way to make a fun, adventure family movie. Standard and basic in its story and in the way it was filmed. But even so, it is a fun movie."
    },
    {
      "rating": "6",
      "text": "The short review: This is a film that's targetted more at children and has many funny parts. It peaks around the middle and then loses some of both the momentum and the plot towards the end.Related media: I have seen the first film on TV, about ten years after it first came out. The plot device was ridiculous but the film was meaningful and interesting. I think Zathura was an unrelated sequel.What's it like?: Four people get sucked into a video game version of Jumanji, a board game, and they have to work together to complete the game before they use up all their lives so that they can return back to the real world.Pros: When these four people were first sucked into the game and they first discover their characters in the game, it was really funny. There a many other funny instances in the film too.Cons: 1) Other than these funny instances, some of both the momentum and the plot are lost towards the end.2) The plot of the game, not the film, is that the villain goes into the jungle of Jumanji to find a green jewel that is embedded into the eye of a giant jaguar statue.  He gets hold of the jewel and is now empowered with the ability to control the jaguars in the jungle. He now plans to use his goons to take control of the surrounding territory. However, the jewel is stolen from him and handed over to these four people so that it can be returned to the jaguar statue. Even so, the villain was still capable of controlling the jaguars after losing the jewel, which doesn't make sense.3) The flow of the film and thus the game felt linear, and that's never a sign of a good game.How would the the different age groups rate it?Children: GoodTeens: GoodYoung adults: GoodMedium age adults: AverageOld adults: AverageRating: 3/5 (no half scores). Save your money and watch it on TV."
    },
    {
      "rating": "8",
      "text": "I had a lot of fun with this movie.   It was a pleasant surprise as my expectations were low going in.  Both the kid and adult actor played their roles well.   The villain was one dimensional and shallow.   Kevin Hart was my favorite."
    },
    {
      "rating": "7",
      "text": "This movie had a great humor. The acting was very well, but the story was very predictable. Overall still a good movie to watch."
    },
    {
      "rating": "6",
      "text": "'Jumanji: Welcome to the Jungle' is very much a teenager flick for teens. That said, it has some considerable traits that make it a good film, from the action induced comedy to the easy and simple plot. What lacks particularly in this film is the bond between villain and protagonists. We are told very simply that the antagonist is after the protagonists and that was all. You could even say the wildlife of Jumanji were more threatening than the actual villain."
    },
    {
      "rating": "8",
      "text": "I was pleasantly surprised by Jumanji: Welcome to the Jungle.  It delivered the goods as an escapist fantasy holiday movie.   With solid special effects, an A-list cast, good action and effective use of humor, this movie flies by while you're in the theater.  Some of the humor is crude and misses the mark, but on the whole the dialogue is witty and the \"Jumanji\" universe created in this film is immersive and fun.  The Rock and Jack Black stand out as excellent \"avatars\" for their lesser known teenage selves.  Kevin Hart was also very funny in his role.   Don't expect Shakespeare, but worth seeing at least once in the theater."
    },
    {
      "rating": "7",
      "text": "What a fun story, joyful film, every character in this film was great. But I don't feel if this movie is a Jumanji."
    },
    {
      "rating": "8",
      "text": "One of the biggest surprises of the year. This film is very sharply written and directed and features 4 very strong central comedic performances. Far better than the lackluster trailers would have suggested. A fairly clever teenage comedy that wrings every gasp of comedy out of it's premise as possible."
    },
    {
      "rating": "6",
      "text": "A sequel/remake that has an equal number of hits to misses. While acknowledging that the original wasn't a great film it still has a nostalgic place in my heart. This film goes in a different direction which is fine, but it fails to inspire enough excitement to be fully satisfied with the result. The performances are all solid and they create good moments with their chemistry. These moments are what leads to a mild recommendation. B-"
    },
    {
      "rating": "6",
      "text": "Well, it was better than Last Jedi, if that means anything.  A typical popcorn flick that was surprisingly decent.  It had a good pace to it and the cast was actually very good.  Nick Jonas surprises me with his acting ability every time, seriously.  So how was it?  Well, if you've seen the trailer, you've seen all the really good jokes in the film.  There were a few jokes here and there that were mildly amusing but nothing as funny as what's in the trailer.  Kevin Hart does his typical \"I'm not Chris Tucker, but I act like him\" schtick, Jeff Black was what I imagine a teenage girl would be if she found out she were a guy.  Karen Gillian (sp?) was actually decent here and Dwayne Johnson always makes you love him when he's on screen.  It plays off like a game but after an hour or so, the time was just flying by.  Good enough to spend $14 on for a ticket but don't expect to be laughing too much if you've seen the trailer.  It's still a good movie though and I'm not sorry I went."
    },
    {
      "rating": "5",
      "text": "not even the comedy trio Dwayne \"The Rock\" Johnson-Kevin Hart-Jack Black can make this movie interesting to watch from beginning to end."
    },
    {
      "rating": "6",
      "text": "A film which neither exceeded expectations, nor fell beneath them, this is a fun adventure with some genuine laughs; an entertaining experience in general. The predictable script is saved by the excellent casting, and with fast pacing and some memorable action sequences, it's a perfectly acceptable genre film that is a solid update of the original. Whilst it tries to have its cake and eat it too with regard to some of the meta-commentary, which is irritating, overall it is sufficiently enjoyable to warrant watching, but is probably best suited to families on movie night. 6.37/10"
    },
    {
      "rating": "7",
      "text": "Джуманджи 2- это хорошое милое приключение. Сюжет в фильме в некоторых местах провисает, но держится стабильно. Главные персонажи очень понравились и их хорошо сыграли актеры. Вот, что провисает, так это главный злодей и иногда графика. Юмор очень крутой и забавный. Так, что можно сказать что этот фильм на один раз."
    },
    {
      "rating": "8",
      "text": "The jokes are witty enough, there's SOLID humor, and the ending is decent. The actors are actually very impressive, and there's good life lessons in here, which I did not expect at all. Go watch this instead of that overrated, over-hyped Star Wars cash-grab of a franchise."
    },
    {
      "rating": "7",
      "text": "A delightfully fun movie. By no means a great movie, but a very funny, good for the whole family kind of movie. I think that it can be greatly enjoyed by both kids and adults."
    },
    {
      "rating": "6",
      "text": "Plenty of laughs delivered by all the amazing actors in this new Jumanji video game-like world makes this soft reboot one for everyone who just wants a fun time at the movies."
    },
    {
      "rating": "7",
      "text": "Overall, this movie ranked about the same as most of The Rock's other movies. Not good enough to be something I'd want to watch twice, but not bad enough that I feel like I wasted my time watching it. If you've seen any of The Rock's other movies, you know exactly what you're getting in this movie. It didn't really feel or play like a sequel to Jumanji, it just kinda borrowed the name and could just as easily have been called \"Silly Fun Jungle Romp\", but that's what you get out of it. A silly, fun, jungle romp. I can't say I'd recommend it, but you also know exactly what you're getting out of this before you go see it. If you don't already know exactly what you're going to get, then you can skip it, it probably won't satisfy you in the end."
    },
    {
      "rating": "7",
      "text": "Not all of the jokes work and frankly several of the action scenes really bored me, but this movie has plenty of good stuff. For one, the video game world created is very clever and well-done. There are NPCs, cut scenes, multiple lives, and character stats in this movie and all of these things are well-done and entertaining. I would call this one of the only good video game movies from this alone.  It really feels like the characters are in a modern video game. The best thing about this movie, however, are the big-name actors. I have never enjoyed watching Dwayne Johnson or Kevin Hart as much as I did in this movie as I have in any of their other movies. Jack Black is really great, as usual. Watch it for the performances and good jokes, not the plot or action."
    },
    {
      "rating": "6",
      "text": "Yet another testament to the growing Hollywood trend of remakes, sequels, and reboots that only encapsulate a shell of what their predecessors represented. Instead of the tender musings on childhood, adulthood, time, and fear that the original possessed, we get some recycled thematics that you can find in any 80's high school flick. Instead of the smart and effective humor that made the original film so entertaining, we get dick jokes. It simply doesn't even flick a booger in the direction of the original. . .but it's still watchable. Yes, even I'll admit - though I wasn't looking forward to this flick at all (and although I still ended up not even liking it that much) it ended up containing a bit more competency than I was expecting. The video-game-isms are entertaining, the lead performances are definitely stimulating, and even though there are still some glaring, fundamental issues with it, \"Jumanji: Welcome To The Jungle\" is still somehow worth the watch."
    },
    {
      "rating": "8",
      "text": "Surprisingly funny and engaging. A worthy successor to the nostalgia-laden original. Lots of laughs and a great cast that was clearly enjoying playing their fish-out-of-water parts."
    },
    {
      "rating": "4",
      "text": "A standalone sequel to a movie released 22 years ago from now that behaves more like a modern remake for today's standards than what it's supposed to be, this Jumanji attempts to overthrow 1995's Jumanji with many things that the latter did not had at the time such as an ensemble cast and many CGI here and there. What's literally scratching my head is the fact that I'm searching for the exact reason why Jumanji: Welcome to the Jungle needs to even exist. It's just the same thing I have seen in 1995's Jumanji, only a lot more modernized for today's standards because even mentioning the standards of 1995 are no longer relevant as of today according to this movie. I would say that it was a slight improvement of its predecessor, but where in the film am I supposed to know it's a great time to say this is an improvement of the original film without thinking this is exactly like the original film only more modernized? Do I recommend it? I don't know, but all I can say is that if you have not watched 1995's Jumanji, you're safe to go."
    },
    {
      "rating": "10",
      "text": "Take a little adventure throw it in a blender, add some comedy, some romance, comedy, science fiction, and some action, put it on the pulse setting. Then switch to the blend setting. Seconds later you have Jumanji, a pleasant mix of all the popular genres of film. It even goes down easy during digestion. 10 out of 10 Stars. Jumanji is a fun romp in the jungle and no one gets hurt, most importantly, so it was brilliant. The jokes about not getting hurt because they play as avatars were stupendously delightful as well as the rest of the humor. The film is packed with non-stop laughs, but it does stop to remind you that a group of friends can work together and beat the system, a tricky video game system called Jumanji."
    },
    {
      "rating": "8",
      "text": "I have got to ask, what more could you possibly ask for from this movie? I went in with no expectations, very skeptical of the reboot of sorts. As soon as the movie starts it has a playful tone that never leaves. It adores it's own characters (probably more than we do), but does justice by each one. Nick Jonas is a welcome unexpected addition to the otherwise publicized cast. Great movie, hits every note it aims for, will be an awesome family outing for Christmas time. Do yourself a favor and go into it about as serious about filmmaking as the filmmakers and you will not be disappointed. It would be a sin to not add that Jack Black aced it!"
    },
    {
      "rating": "8",
      "text": "Doesn't want to be more, just a good 1 time film, which is funny, and is great fin in a cinema.It does its job good.Its not a great film, but it was great for a 1 night fun :)"
    },
    {
      "rating": "0",
      "text": "All wrong,Like its 1995 predecessor (which itself was based on the 1981 children's book of the same name), the new Jumanji movie will revolve a board game that sucks the players into its insane, action-packed world. However, this time around, the protagonists will be four students playing the game while in detention. Once within, they'll be represented by adult avatars, and their mission will be to find a jewel. The movie's main cast includes Dwayne Johnson as Dr. Smolder Bravestone, Kevin Hart as Moose Finbarr, Karen Gillan as Ruby Roundhouse, Jack Black as Professor Shelly Oberon, Ser'Darius Blane as Anthony \"Fridge\" Johnson, Nick Jonas and more."
    },
    {
      "rating": "10",
      "text": "This movie isn’t fun and funny Kevin Hart and Jack Black were awesome in this movie it’s better than the first one!"
    },
    {
      "rating": "7",
      "text": "A confectionery sugar rush with a charismatic cast. What impressed me the most is just how well the main cast captured the personalities of their younger costars. We don't get to spend much time with their high-school aged counterparts, but we see enough to know just who they are and understand just how well they nailed their portrayals of them. They seem to be having a lot of fun playing kids out of their depth. Particularly Jack Black who is the highlight of the movie. His character Bethany actually has a really touching character arc while everyone else gets the stereotypical feel good endings.While it never manages to capture the thrill and excitement of watching wild animals tear through a living room like in the original Jumanji, thanks to some impressive action sequences there is plenty of adventure and spectacle to be found inside. It's also very funny. I got plenty of laughs watching these kids freak out over their new bodies and whatever dangers came their way. The gender swap Black's character is going through is used to deliver at least two of the movie's funniest moments. The plot kind of keeps getting in the way though. It's bogged down in too much generic \"be brave and proud of who you are\" moralizing and has plenty of outright painful moments where it tries to explain gamer lingo and modern day teenage lifestyles in an effort to come off as hip and knowledgeable. It just needed to focus on the jokes. The rest of that stuff would have come along the way. While it doesn't hold a candle to our time with Robin Williams in the first Jumanji, \"Welcome to the Jungle\" does provide a good time. Ultimately it was a little more disposable than I was hoping for, but I can't complain too much about the final results as I still ended up having quite a bit of fun with it. I have to say I loved how they managed to make sense of how Jumanji could be a board game in one movie and a video game in the next. It was surprisingly smoothly done. I also appreciate how they managed to bring back and update the 1995 film for a new generation without going the reboot route. 7.7/10"
    },
    {
      "rating": "6",
      "text": "This movie is predictable, but fun. No one can apparently step in the shoes of Robin Williams, who made the original Jumanji a family classic. However, this movie is rife with too many sex and dick jokes which are not funny and not suitable for children. Why are they sexualizing our children?! It's disgusting."
    },
    {
      "rating": "7",
      "text": "Just a fun and light-hearted film. Had a lot of great laughs but also a nice message, \"YOLO!\" No one can replace Robin Williams so I'm glad they changed the story line completely from the original and made it modern."
    },
    {
      "rating": "7",
      "text": "Thoroughly enjoyable throughout its runtime, '\"Jumanji: Welcome to the Jungle\" is a welcome sequel to \"Jumanji\", and an entertaining, hilarious, and action-packed film in its own right."
    }
  ]
}