{"id": 2021, "title": "Jumper", "starring": ["Hayden Christensen", "Jamie Bell"], "runtime": 88, "genre": ["Action", "Adventure", "Science Fiction"], "description": "David Rice is a man who knows no boundaries, a Jumper, born with the uncanny ability to teleport instantly to anywhere on Earth. When he discovers others like himself, David is thrust into a dangerous and bloodthirsty war while being hunted by a sinister and determined group of zealots who have sworn to destroy all Jumpers. Now, David’s extraordinary gift may be his only hope for survival!", "releaseYear": "2008", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/3pPZ9JhNz3VMmASVir5SMHvTDUU.jpg", "categories": {"plot": 5.435897435897436, "acting": 4.354838709677419, "ending": 6.333333333333333, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.916666666666667, "funny": 5.0, "action": 6.133333333333334}, "reviews": [{"rating": "8", "text": "Jumper is a very underrated movie with an interesting plot. The nerd community hates on Hayden Christensen so, with this movie being more in the sci-fi/fantasy genre, it really didn't stand a chance. However, he's a capable actor and the support of Samuel Jackson, Rachel Bilson, Jamie Bell, and other cameos gave this movie a solid cast. As I said, the plot was pretty interesting and original as well. The only real problem I had with the film is that it was only 88 minutes, which didn't really give it time to fully develop the concept of \"jumping\" and the relationship because them and the Paladins, an organization that hunts down jumpers. With more development I think this would've been a great movie."}, {"rating": "8", "text": "Jumper is a good sci-fi/action movie.I agreed the acting is not that good and the scenario is bad but the CGI effects are good and there is a good cast (Hayden Christensen,Jamie Bell,Samuel L. Jackson)."}, {"rating": "8", "text": "Jumper is a really interesting movie with a cool plot and entertaining action sequences. It may not be the best movie of its genre, but I don't think it deserves the bad reviews it has gotten. Definitely give it a watch before you make a full judgement."}, {"rating": "8", "text": "Decent movie, kept my attention but somehow I felt like it could have been better.\r Watch it online for free: https://www.primewire.ag/watch-426-Jumper-online-free"}, {"rating": "8", "text": "Jumper is an enjoyable popcorn action/sci-fi by the numbers but what it delivers,  it does with aplomb. I had hoped for a sequel by now but I guess it bombed thanks to the lousy and poorly justified critic review average."}, {"rating": "8", "text": "It isn't bad, it's actually pretty good, one of my favorite movies.But it is a little...Saltless.Maybe a sequence with another director would work, i liked the plot and the idea a lot!"}, {"rating": "3", "text": "Jumper jumps to victory at the beginning to end up being blindfolded in the middle of nowhere. In short conclusion, Jumper jumps to get early start when you should know early starts make movies look bad."}, {"rating": "5", "text": "I thought this was fairly entertaining fare and I liked the special effects, they were about what you would expect in this modern age, so that didn't let me down, however I felt that the story did. I liked the character of Millie but the main character of David, ie the main character the movie is all about, well, it just seemed flawed to me. I didn't feel as if I had any particular interest in this person, somehow. When he stole from the bank, as much as I suppose a part of me would think it would be cool to be able to do such a thing, I can't say I felt that I was hoping he wouldn't be caught or that I was overly excited for his situation. I think he seemed a bit too cocky perhaps but there was definitely something missing which made the movie just not work as well as I think it could have.The special effects were good but I also feel that more of it could have been used and overall I was left feeling that it had better potential. The story itself seemed like one that had been done quite a number of times before and it just didn't really (get the joke) jump out at me. One tell tale sign is that this morning, after having watched it the night before, I couldn't remember exactly how it ended and I'd forgotten a fair bit about it which just proves that at least for me, it was quite unmemorable. I have to say though, the concept behind it is one that I liked, I always had a big imagination as a child and I like the thought of being able to teleport and go from one part of the world to another straight away, I think that perhaps if they changed the main character and if the story was just a bit more detailed or 'meatier' which is the word that comes to mind, if you know what I mean!, then it could have been alot better. I'm aware that this movie is based on a set of comic books and that in that respect, the story presumably had to stay true to the original comics, so it didn't have too much scope for change and I haven't read the original comics, I can only judge the movie on the movie alone.On the more positive side, I thought that Samuel L Jackson was a good choice of actor for playing the villain Roland, as formulaic as that was he does have a bit of an 'other worldly' type look about him, especially with his dyed white hair and I also liked some of the shots of Italy and of course of the Colosseum. There are some nice camera angles and lighting used and it would have looked good on the big screen I can imagine. Also I liked seeing Jamie Bell (who played the lead role in Billy Elliot) in this, he portrayed his character of Griffin quite well, I thought given the type of character he was (as this fast and energetic guy), he looked the part."}, {"rating": "10", "text": "I think the movie was quite enjoyable. What I sometimes do not understand are the casting choices. There was a chick he picked up in a bar in London, she should have played the main female character. A hundred times more attractive and hot than that small ugly chick they finally selected. Special effects were great, I did not feel the need to zap away or take a nap once, and that says a lot !"}, {"rating": "1", "text": "Jumper is by far one of the worst movies i've ever seen, the story is crap, and the characters are unlikable (but what did you expect when the main character is the guy who ruined Star Wars), it's ultimately a really unenjoyable movie."}, {"rating": "10", "text": "Jumper is the first film from a trilogy of books by Steven Gould, and while I loved this film, most critics panned it. The story centers around a young Davey (Hayden Christensen), who during a life-threatening event, come to realize he has the power to teleport wherever he wants. Unbeknownst to Davey, he is a member of a group of genetically superior humans known as Jumpers, who are currently at war with a religious organization, that believes their power is evil. What starts out as a simple kid having fun and trying to impress, becomes a fight for survival in this amazing action thriller. You can always tell when a story is adapted from a book, rather than an original screenplay, because the story tends to be more thought out. Not to say screenplays are bad, but when a story isn't made simply to be a movie, it tends to be much more focused on the story, where as screenplays have to worry about the story as well as the aesthetics. Nevertheless, Jumper isn't just another shoot 'em story, it's the perfect mix of action and drama with some outstanding performances. I love Hayden Christensen, who I think is made for roles like this, he has this cool demeanor to him, that's more clever than arrogant. Jamie Bell is also terrific as Griffin, a fellow jumper Davey meets along the way,  and he provides some much needed comic relief. ...and then there's Samuel L. Jackson. What is there to say about Jackson that hasn't already been said? The man is a legend. This film is interesting, unique, fast-paced, and even funny. I loved every minute of Jumper and if Sci-Fi is your thing, you will too!"}, {"rating": "2", "text": "''Jumper'' sets a very interesting premise and gives interest to public with its somewhat original story,  but all this is spoiled by its extremely tiny script and cheesy acting by all of its cast (unfortunately, Samuel L. Jackson too)."}, {"rating": "5", "text": "Jumper para nada es una película de 3 puntos como dice la prensa ignorante de siempre. Si bien no tiene grandes actores ni grandes pretenciones, es una película que logra su objetivo: entretener. Eso es lo que nos llevará a verla hasta el final. No tiene nada memorable pero es una película interesante y que, además de lograr entretener, logra tener unos muy buenos efectos.Calificación: 5. Recomendado cuando no hay nada que ver."}, {"rating": "6", "text": "Jumper is a average night out movie. Teleporting skills, chicks and a sissy character who plays the lead. There cannot be worse movies out their like Jumper which is a fast entertainer that is at least- understandable and enjoyable. I got my copy on Bluray, it looked cool from the cover so, I bought it for 4.99 and watched it. I was surprised why critics didn't pan The Sixth Sense because its a hell of a confusing film. Jumper, on the other hand was a exciting thriller and I did like it."}, {"rating": "7", "text": "Finally got a chance to watch this film, despite what the reviews may say Jumper is actually quite enjoyable. The story is very simple and to the point, the main character is an ass who uses his super powers to help himself live a life of leisure and travel, he then reconnects with the girl he liked as a child, takes her to Rome, discovers there is more people like him and people trying to kill people like him. Without giving too much away, this film ultimately sets out to do what its supposed to do with solid performances from \"captain stoneface\" Hayden Christensen, Rachel Bilson and Jamie Bell to carry it the rest of the way."}, {"rating": "4", "text": "One of the reasons superhero comics so often get held in contempt is because the shallowest (and commonest) ones are wish-fulfillment fantasies for adolescent boys, and adolescent boys tend to be pretty unnuanced, id-driven critters. For instance, they should be pretty pleased with Jumper, a naked power fantasy in which an ordinary kid abruptly gains a super-ability, quickly followed by wealth, ultimate freedom, no-strings sex, and the panting admiration of his hot dream-girl. What did he do to earn any of this? He was so very, very special and different from everybody else that he gets to do whatever he wants, and still get framed as the film's shining hero.\r First seen standing atop the Sphinx in Egypt and boasting to the audience about how he used to be \"a normal person, a chump, just like you,\" Hayden Christensen plays a mildly dorky kid who discovers he can teleport. So he runs away from home and starts robbing banks. Eight years later, he's a smug **** living in a swank high-rise full of stolen cash and shiny toys, and he's using his power for trivial things like approaching a random bar hottie a little faster, or getting the TV remote without having to lean forward. But then Samuel L. Jackson appears and opens up a case of Mace Windu-style whoop-ass on him. Shortly thereafter, Christensen learns that there are other teleporters—or at least one, played with rakish charm by Chumscrubber star Jamie Bell—and that they're being hunted by fanatics called paladins. Why? The paladins' supposed philosophical underpinnings come out in one tossed-off line about how only God should be everywhere at once, but basically, they're around as an excuse for a lot of big, explosive fight scenes, which director Doug Liman (The Bourne Identity) seems to have imported directly from an X-Men movie.\r Those scenes are easily the best part of Jumper: They're unlimited by logic or physics, which makes them dynamic and unpredictable, and Liman brings them off well, with a lot of literal flash and bang. But no exciting action can cover the film's profound shallowness and repulsive attitude toward everyone but Christensen. It isn't bad enough that he's a swaggering bastard who uses his powers exclusively to break laws and get whatever he wants—one scene even pointedly shows him ignoring a situation where he could save otherwise unsaveable lives. Another has him using a moving car as a weapon by jumping it to Chechnya, then leaving the startled driver to be crushed by a tank. And a good chunk of the film is devoted to him easily impressing his high-school crush object Rachel Bilson, who's less a character than a bright-eyed mirror for his awesomeness. Come to think of it, maybe adolescent boys won't like Jumper after all; its irritating protagonist is more school bully than underdog hero."}, {"rating": "0", "text": "Handicap lourd au démarrage, Jumper est réalisé par ce crevard de Doug Liman, ce crétin qui surdécoupe chaque scène d'action en très petites lamelles d'un tiers de seconde comme dans une réclame publicitaire pour ados : mal de crâne assuré. Autre souci très sévère également : la présence permanente d'Hayden Christensen, le branlo de la prélogie Starre Warzes, jeune acteur complètement naze qui devrait se limiter aux pubs pour gel coiffant.On ne sait pas trop ce que vient faire Samuel L. Jackson dans cette galère mais un vieux, faut que ça mange. Les cheveux teints en blanc pour faire bien méchant, il joue par conséquent un méchaaant empêcheur de se téléporter en rond. Et ce n'est pas tout : une petite pétasse fait la petite amie du branquignole, une brune aussi écervelée qu'une blonde avec la vulgarité en plus (cadeau bonus).Comme si cela ne suffisait pas, le scénario gribouillé sur les restes d'un rouleau de pet-cul a raison un peu trop vite de notre patience et tolérance à la stupidité galopante de cette imbécillité qui cumule à la fois le grotesque et le ridicule."}, {"rating": "2", "text": "Eu lembro de assistir esse filme quando criança, e é obvio que eu achava o máximo. Conceito no minimo intrigante, com um elenco bonitinho e um ou outro famoso. Isso já era o suficiente para me divertir. Mas hoje, tendo uma visão completamente diferente de cinema como arte, o que acho desse longa?Desde o principio, eu já sabia que se tratava de um blockbuster, então mesmo gostando bastante da obra, minhas expectativas não era altas. Mas isso não significa que o filme tem de ser vazio e ruim em tudo que faz, né?!A premissa do filme é muito convidativa, pois lida com uma \"habilidade\" que qualquer pessoa iria querer, mas o desenvolvimento a partir disso é muito ruim. Primeiro temos os personagens, que se agarram a arquétipos e se esforçam muito para não sair deles. O roteiro insiste em chicles e não para um segundo para desenvolver nem se quer o protagonista, não de forma efetiva. É como se os roteiristas tivessem medo de quitarmos durante o filme, por isso ele tenta forçar um clima onde sempre está acontecendo na tela, enquanto o background da trama é jogado no lixo. Temos diversas perguntas em mente, 95% delas não são respondidas e o filme não tem medo de fazer um furo atrás do outro, com contradições até mesmo no código de moral do antagonista. A personagem feminina é uma das mais mal escritas que tive o desprazer de acompanhar. O roteiro usa dela na cara dura pra motivar atitudes burras por parte do protagonista. O pior é que tudo que tudo que acontece no filme vem a partir de conveniências e condutas incompreensíveis, desde o assalto no banco a \"saltar\" em público, pra qualquer um ver. Tá me dizendo mesmo que o protagonista nunca se questionou sobre outros Jumpers ou \"puts, acho melhor não fazer isso em publico\"?As cenas de ação eram muito boas - na minha imaginação, mas só nela mesmo. A câmera é tremida e a cinematografia é confusa. É muito difícil entender o que está acontecendo quando tudo que você pode ver são planos fechados e atores fazendo expressões de raiva, surpresa e dançando. A falta de conteúdo no filme é tamanha que chega um momento que é necessário exibicionismo gratuito [na cena do carro teleportando no meio da cidade] só para satisfazer o desejo de espectadores burros  - é assim que os roteiristas nos enxergam.Enfim, como conclusão, acho que a melhor coisa a se fazer é deixar uns filmes no passado mesmo.Audio: English, with Portuguese subtitles. Q60T 50' TV Speakers [DTS 5.1]Quality: 1080p SDR [Bluray]"}, {"rating": "5", "text": "Hayden Christensen and Samuel L. Jackson are really good in this movie, it's just the movie's got quite a stupid plot."}, {"rating": "10", "text": "I liked this movie and plan on buying it when it comes out on DVD. Rachel Bilson is great. I like the action and romance. Plus the ending was nice. The story is left open for a second movie."}, {"rating": "1", "text": "Completely awful... treats it's viewers as if they would enjoy the special effects enough to where nothing else would matter. Characters do things no person would, say things no person would say, things happen that never would, and even if they asked you to sustain disbelief, there is nothing worth watching. I went into this movie expecting something bad, as I had heard it was, and they STILL managed to disappoint. Everyone would let this movie be made should be fired, and the screenplay writer should be SHOT. No kidding, it really is that bad."}, {"rating": "3", "text": "Though I must admit it is valuable as a thrill ride, Jumper doesn't even feel like a complete movie. Nothing is horribly wrong, but the combination of frustrating acting and a story that plodded along to an 'end' before any development could happen restricts this film from being worth the short time it takes to watch it."}, {"rating": "4", "text": "I couldn't sympathize with any of the characters. The protagonist was a horrible person. How am I supposed to care what happens to him? There were so many other things wrong with this, but I don't even know where to start. It was just awful. I left feeling terrible and not the slightest bit entertained, other than simply commenting that the effects were cool."}, {"rating": "0", "text": "Anyone who rated this movie higher than a 5 is a fricken idiot. You are the kind of people who allow big budget, special effects dependent movies that have no good acting or plot continue to be made. I sincerely would like to gang beat the people who thought it deserved awards. The special effects were cool, sure, but without a back story, without any good writing, it is pure trash. It saddened me to read the reviews of a couple people who could actually speak intelligently, yet posted a review of a 10 for this garbage. So you mean to tell me this is as good as all the best movies out there??? Keep giving hollywood your money people, and agree with them that americans are dumb sheep and only need \"shiny things\" in front of our eyes to be entertained."}, {"rating": "7", "text": "I liked this movie. It's a popcorn film, great as an escape. The movie starts out kind of slow, but the story takes off when Rice (Christensen) meets up with a fellow Jumper in Rome. Christenson's acting was very good IMHO; he is believable and convincingly portrays his character's emotions/situation. Hope there's a sequel."}, {"rating": "9", "text": "WHAT IS WRONG WITH YOU PEOPLE! Just finished watching this movie and I shake my head, honestly, trying to figure out what people giving Jumper under 5 are talking about. This was a decent movie! To give a sampling of my tastes, Juno 9, No country 1, There Will Be...6 (knocked down 2 JUST because of the \"are you kidding me?\") ending. This was an unpretentious movie with a great premise that, even tho it may have moved well past the original discovery phase, managed to push the limits of the concept. WHO CARES if the action scenes were a little confusing! These are people that have powers that we don't understand fully! Hayden, although still brooding, was under way better direction than the ALWAYS has-been George Lucus. He redeemed himself in this movie as far as I'm concerned, but I'm just a knowledgable movie-goer."}, {"rating": "3", "text": "I hate the fact that a majority of my friends liked this movie. Just the worst piece of crap ever. The jumping looked neat, but that is the only passable part."}, {"rating": "6", "text": "True this movie was lacking in quite a few things, including character development and an ending, but at least this was more fun than Push (oh god!)"}, {"rating": "6", "text": "Hayden Christensen is still an awful actor, but the effects and other actors make up for it. Pure thought-abandoning entertainment. I expected worse."}, {"rating": "5", "text": "It's a movie to like and enjoy with it's extraordinary design and brain-free fun. But it still falls real short on being a pathetically dumb movie."}, {"rating": "0", "text": "Awful awful awful awful. I WAS completely awestruck by Jumper, at how on earth this kind of junk gets made any more. The special-effects-only era is over, isn't it? We're in the dawn of a new era of a return to plot, character development, story as a basic requirement, aren't we? Hayden C has got to be one of the least charismatic actors around, he doesn't even LOOK the part. it's like he can't be bothered to even try acting half the time. This crud isn't worth the substance you excrete to coat your eyeballs so they don't dry out as you stare at this unbelievable heap of dreadfulness. As for the comments Oscars, irony surely? Hopefully? PLEASE?"}, {"rating": "2", "text": "So, you got a decent, pretty solid if you will idea of a science fiction tale. What to do with it? What to do? I know. Suck  all the energy and life out of it by casting bland leads, throw in some ludicrous special effects to cover up plot holes, and create the most emotionally false movie in the history of cinema. Viola, you got Jumper."}, {"rating": "7", "text": "Good show. Camera wasn't the best but pretty cool. However, storyline wasn't very good."}, {"rating": "9", "text": "Its not that bad enjoy the ride."}, {"rating": "5", "text": "Starts off good but kinda drags and too many loop holes left in the plot."}, {"rating": "0", "text": "This movie was horrible. Nothing was explained in the background to the two sides...Rachel Bilson magically just ignored the guy being gone for years and fell in love with the older version with no background in seconds...no idea why the other Jumper Griffin was so antagonistic to meeting/working with one of his kind...overall an abomination. I want my money back."}, {"rating": "10", "text": "Ambition people, this film is probably the most ambitious origin story to a superhero you have never heard of in film history. This is part 1 of a proposed trilogy, and the kind of cahones it takes to create a property with this kind of scope is huge. While I don't think it is a perfect 10, I'm giving it one to counteract all the closeminded reviews so far."}, {"rating": "1", "text": "this movie had no plot, terrible acting, incredibly boring dialogue, and just cruddy cinematography. However, I give it a one because of Samuel L. Jackson's \"This shit I don't need\" look in the end."}, {"rating": "6", "text": "Very mediocre action flick. Disjointed, but entertaining enough IF you go in with very modest expectations. Lotta potential here for a sequel."}, {"rating": "0", "text": "What a snoozer! Never before did I think I could fall asleep in a movie, but this one was just terrible! The effects, I must concede, were good, but it really didn't help the atrocious plot. Nothing was explained. How did he get the powers? Like, did they just appear? It made zero sense. Stay away"}, {"rating": "3", "text": "Christensen is just a horrible actor, I don't know why he is still chosen to star in movies. He disapointed many with his Starwars performance. He just seems like he has no personality, lifeless, and probably limp."}, {"rating": "2", "text": "The movie seemed rushed and hayden needs to have at least a speck of emotion in his acting. the movie was lame aside from its great action scenes (the only thing that kept me from giving this a 0)."}, {"rating": "6", "text": "Not as awful as the reviews lead me to believe. Apart from a fizzler ending, it does exactly what it says on the tin. And bonus point for including the brilliant \"Blackenned Blue Eyes\" by The Charlatans over the end credits."}, {"rating": "0", "text": "Predictable movie and confirmation that Hayden Christianson cannot act. Don't waste your time. I hate to see the category of sci-fi associated with crap like this."}, {"rating": "2", "text": "Probably the worst movie I have ever seen. The acting was crap, the main character actually showed no emotion, the fight scenes were crap, even with the good CG. I gave it a 2 cause Rachel Bilson is hot, maybe I would have stretched it to a 3 if she showed more skin. Dont watch this just make popcorn and stare at a blank tv screen, you'll be better off."}, {"rating": "0", "text": "Damn! Who would want to watch this movie?"}, {"rating": "9", "text": "In spite of the low reviews, I've found this movie really enjoyable. Instead of an adolescent with super powers saving the world (oh hum), he went out to have some fun. In so doing, he finds out that there are predators higher up on the food chain. For me the acting is good when I'm not thinking that he's acting, which never occurred to me in this movie. For me the special effects are good when I'm not thinking it's a special effect. Again, the jumping seemed natural to my way of thinking jumping would be. I wished more information bits were dropped about the war between the paladins and the jumpers, but it got me interested in the sequel! I am looking forward to Jumper 2!"}, {"rating": "2", "text": "The movie was a letdown for me. The trailers made the movie look very exciting. I'm a chick, and I do like these kinds of sci-fi/action flicks...especially when there will be some eye candy (Hayden Christensen and Jamie Bell). Yes, the visuals and effects were undeniably appealing. I can't say the same thing about the plot and acting. The story keeps...sorry for the pun...jumping around and doesn't lead to anywhere. The antagonists never mentioned HOW the jumpers are harmful. They only state that it's because the jumpers will abuse their power. Finally, I would give the acting a D. Rachel Bilson, no matter how adorable she is, should probably stick to sitcoms. It was irritating to see her ask \"what?!\" in every scene she appeared. Hayden and Jamie did seem to enjoy their roles. Perhaps that did keep the movie somewhat alive. If you're all for action, you may enjoy this movie."}, {"rating": "3", "text": "Initial concept was good. At first I thought this could be a good foundation for a sequel then I finished the movie. Nothing else needed to be said. Disappointed."}, {"rating": "1", "text": "I've watched it. I cannot unwatch it. What a shame. I wonder if Liman got the job by saying, \"The locations are all over the world. I've filmed all over the world (Bourne Identity). Give me the gig.\" What a hack."}], "recommendations": ["i_am_number_four", "the_twilight_saga_eclipse", "poseidon", "the_old_guard", "teenage_mutant_ninja_turtles", "next", "seventh_son", "hercules", "the_last_witch_hunter", "into_the_storm", "terminator_genisys", "gemini_man", "shazam_fury_of_the_gods", "the_tax_collector", "bloodshot", "i_am_legend", "suicide_squad", "national_treasure_book_of_secrets", "shadow_in_the_cloud", "infinite", "captain_marvel", "hancock", "gods_of_egypt", "project_power", "riddick"]}