{"id": 17, "title": "Jungle Cruise", "starring": ["Dwayne Johnson", "Emily Blunt"], "runtime": 127, "genre": ["Action", "Adventure", "Fantasy"], "description": "Dr. Lily Houghton enlists the aid of wisecracking skipper Frank Wolff to take her down the Amazon in his dilapidated boat. Together, they search for an ancient tree that holds the power to heal – a discovery that will change the future of medicine.", "releaseYear": "2021", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/9dKCd55IuTT5QRs989m9Qlb7d2B.jpg", "categories": {"plot": 5.953488372093023, "acting": 6.363636363636363, "ending": 2.25, "soundtrack": 4.8, "cinematography": 3.5, "familyFriendly": 6.0, "funny": 5.722222222222222, "action": 6.0}, "reviews": [{"rating": "4", "text": "Disney has tried over and over with the Pirates movies to copy that first movie and seem to always miss that the first movie had a actually good story.Its overly complicated story that is so illogical it hurts my brain and its much to long.    Its pretty and has some decent action and the actors are good so gave it a 4 but if id judge the script on a scale of 1-10 this is probably a 2 it really is that bad. And i like \"dumb fun\" movies this is ironically to clever"}, {"rating": "1", "text": "Really really bad.If this movie had been released in the 80's or 90's, when special effects and cliched writing was all you needed to get people into the cinema, it would've blended right in. But in this day and age it feels cheap and tacky.. complete with an evil German, a jaguar that understands complete sentences, and whatever was left on the cutting room floor of The Mummy, Pirates of the Caribbean, and Indiana Jones.. not in a good way.. but thrown together in the most random bucket of wtf. And while I support a little bit of wokeness, it was clearly tacked on for marketing points. Lastly, it was too violent for kids, but too purile for teens. Honestly, would have a been an enjoyably forgettable movie of the 80's."}, {"rating": "4", "text": "MetacriticOnur - You are not posting reviews.  Apparently reporting you to metacritic does nothing, so please start actually covering the material.  Just posting a dictionary description of the single word you are applying is both annoying and useless for people to evaluate the movie/show.  Also try to make sure the text of the review matches the score.  In this case your score of 4/10 is NOT average by any stretch of the imagination.  Average would be in the 5.5-6.0 range, as that encompasses most movies.Jungle Cruise is just small amount of better material loosely stitched together in the hopes that another formulaic Disney PG13 release will help fill the void that their previous streaming lackluster releases have left behind.  Unfortunately it does not.  The music and talent do a decent job, but with a patchwork script that does not know what it wants to be, a 4/10 is the best it can muster."}, {"rating": "10", "text": "excellent ;) we laughed a lot. 4k images of the forest were stunning in imax. kids loved it too. thanks disney"}, {"rating": "0", "text": "The film would probably have turned out well if 90% of the film had not been shot in the studio. To forego one or the other superfluous action scene would have been good. maybe the writer would have thought of a joke or two when she left the hollywood studios. overall boring result. hollywood produces whenever you think it can't get any wors"}, {"rating": "0", "text": "Woke AF. I wanted to spent a nice time with my kids, spoiler, as a father and a man I did not have a good time. I cannot recommend this to any father."}, {"rating": "3", "text": "Just incompetently directed. CGI looked absurdly fake. Dialogue was vaguely amusing at some points but otherwise some mix of forgettable and try-too-hard.The reviews that mention this movie trying to be the mummy are on point. That's all I could think of while watching this. It's trying the whole movie. It never does or is anything of its own."}, {"rating": "6", "text": "Jungle Cruise it's an adventure that feels like the old classic Disney, but that at the same time is positive and negative.Positive for the fantasy aura, negative because it doesn't feel like anything is at stake.It offers basically the same kind of entertainment you'd expect from the park ride."}, {"rating": "8", "text": "JUNGLE CRUISE is a big, loud, and wild ride of a film, a mix of Pirates of the Caribbean and Indiana Jones. Dwayne Johnson does all the heavy lifting here but the chemistry between his character and Emily Blunt's is electrifying. With Jesse Plemons and Jack Whitehall rounding out the cast, this is almost a must see. The plot is energetic with it's non stop barrage of ancient exposition and supernatural curses and German villains and boat chases. With a few actually good twists and outstanding performances from the entire cast, JUNGLE CRUISE is a fun family adventure."}, {"rating": "5", "text": "Okay, maybe I was tired going into the movie, but I found it difficult to stay awake. Not a clunker of a movie, but as good as the sets were it's not a must-see."}, {"rating": "4", "text": "Films based on theme psrk rides have worked before (Pirates of the Caribbean); and some haven't worked at all (PotC sequels). This one's somewhere in between. There are good things in this film. The leads are excellent, the sets and cgi are very good, and there are a good number of entertaining set pieces.  But it's incredibly uneven in tone. Tension is announced, rather than built, usually accompanied by an incredibly offputting Metallica based theme.  The fight scenes are rather graphic for the genre too, putting it up to a 12 certificate (that's correct imo) and outside the ideal demographic.  It would really have benefited from the touch of Speilberg or similar.  There's no grandeur or scale to the cinematography and it really suffers for it.  If it had decent photography, a Williams-esque soundtrack, and more child friendly action, then it could have been brilliant. Not everything can be Raiders, but this is doesn't come close."}, {"rating": "9", "text": "Things That I Liked Most In The Jungle Cruise Movie!!1) Perfect Casting Dwayne Johnson and Emily Blunt were electric together. They both bring so much fun to the movie. I love their chemistry. Besides the main hero and heroine, the character of Jack Whitehall was excellent. He played the role of Emily's brother & he rocked it with his performance. He brought so many comedic moments. 2) Great Comedy And Action The action & comedy were moving along at about the right pace, never dwelling too long on any of the plot points. 3) World-Building The sets, costumes, animals, vibrant colors, darker elements of Amazon, the intro of main characters, every single thing was beautiful enough to maintain the classic atmosphere."}, {"rating": "0", "text": "So boring. I had to stop myself from leaving many times. It drags and the jokes arent funny. Not even chuckle worthy."}, {"rating": "0", "text": "This movie was one of the worst movies I have ever seen. The CGI was terrible and over used. The cinematography was abysmal. Overused sweeping and swooping shots. Just too much to list and I dont feel like wasting any more of my precious life talking about this movie which was a total waste of resources and everyones time."}, {"rating": "0", "text": "Jungle Cruise is the latest movie to come out of Hollywood which falls into what I call the CG Social Justice Diarrhea-fest. These types of movies are heavy on fake-looking CG, and indignantly hit you over the head with social justice issues, and Jungle Cruise falls squarely into that category. From the beginning Emily Blunt is constantly told that she can't do things because she's a woman, but spoiler alert, she's better at everything then all the men! What a shocking twist! We've never seen that trope before have we? She's even better at fixing the engine of the steamboat than The Rock is, even though he's been using and repairing it for decades. Later on we find that her annoying brother is tagging along on the dangerous journey because he is a homosexual and society back then treated them poorly instead of throwing pride parades for them every day. Boo hoo! Keep your kids away from this one folks. Disney, how far you've fallen!"}, {"rating": "0", "text": "I watched this movie, not by choice, with very low expectations because of other reviews.  I found it to be far far worse.The cast, the only highlight, managed the best they could with the a poor script and terrible direction from Jaume Collet-Serra.  I suppose Disney spent all of its budget on cast and CG with nothing left for an experienced director of effects heavy summer blockbusters.  Warner Bros. needs to rethink 'Black Adam' in a hurry.The characters are uniformly unlikable for the first third of the film and weirdly inconsistent in motivations throughout.The story is okay, but predictable.  You'll probably see a lot of things coming ahead of time.  Generally, the movie seems scripted for kids, but scary moments and some extreme violence are definitely meant for adults.Action scenes, the main reason people will watch this movie, are badly edited.  The beginning or end of some action beats are over-trimmed or from poor camera angles. They leave you scratching your head over what just happened.  Considering the rest of the film, it's quite possible the director failed to shoot enough coverage for which the editor to work.The soundtrack is awful and frequently as inappropriate as the score to 'Ladyhawke'.Effects and CGI work are a mixed bag.  Some is so good, you won't even notice it.  Some is a rip-off of \"Dead Man's Chest\" and will take you out of the moment when you realize it.  The worst is the CG animals, which are shockingly poor and look like they came from a 10 year old video game.Ridiculously jarring is the modern idioms.  They are out of place in 1916 and even further out of place in the Amazon basin of 1916.I won't mention the stuffed in modern politics that don't serve any purpose to the plot or story, but it's 2020's Disney, so you probably already expect it.Of course there are the 'Jungle Cruise' style jokes.  Did I say style?  Nope, many of the jokes are ripped right from the ride.  So, if they were groaners before, they're painful now.Finally, many better movies were shamelessly ripped off. \"African Queen\", which the Disneyland ride was based on, makes up a big chunk of the style and period.  The beginning is largely \"Atlantis the Lost Empire\".  Brendan Fraser's \"Mummy\" is robbed for theming, characters and a ladder gag.  Sean Connery's \"Medicine Man\" is plundered for specifics of the Amazon and plot MacGuffin.  Some backstory is taken from \"Pirates of the Caribbean: Curse of the Black Pearl\", with monster design ripped straight from \"Pirates of the Caribbean: Dead Man's Chest\".  Gags were stolen from \"Indiana Jones and the Last Crusade\" and \"Despicable Me\".  Also copied is a tree from \"Avatar\".  There is nothing original.  I recommend watching any or all of those movies instead.There was a time Disney would have hit this out of the park (pardon the pun).  Disney is no longer that studio.  There is little good or entertaining.Do not waste your time.  Do not waste your money."}, {"rating": "4", "text": "Vilão generico, piadas infantis e sem graça e um cgi bem meh, so o carisma de the rock e emily blunt pra segurar esse fraco filme da disney"}, {"rating": "10", "text": "Every character has a character arc and storyline which way too many movies forget to do, it is a plot that is completely entrancing, and you spend time trying to figure out all these little details and there are still parts that take you by surprise. It was an absolutely enjoyable ride from beginning to end. Even more enjoyable than the actual ride"}, {"rating": "0", "text": "Just bad overall. Aiming it at children isn't an excuse for lazy writing and poor characters. Jack Whitehall can't act."}, {"rating": "3", "text": "The impressive cast in this movie could not make up for its boring dragged out plot, mediocre action scenes, and poor villains. Events just happened and that was it, the movie was simply boring."}, {"rating": "2", "text": "Another soulless big budget Disney film full of special effects, headline actors and shoehorned woke politics (  nothing about the Chinese concentration camps though.) The script is an afterthought and lazily takes from better films like Pirates of the Caribbean, Raiders of the Lost Ark and The African Queen. A special mention to the disturbing scene where the comedic sidekick feels compelled to share his sexuality with the Rock  - 2 stars for some nice scenery."}, {"rating": "5", "text": "Wow, that was not good. What a waste of the Emily Blunt, and to a lesser extend, The Rock. Disney, stop using these no name directors. Label me bad, but French people do not get humour. Any American director would've done a better job. The jokes' timing were poor, the editing during conversations were unimaginative, the action boring, and don't get me started on the CG. Compare this to the 1st Pirates movie, it's a million miles away."}, {"rating": "7", "text": "I had a good time watching Jungle Cruise because the thrills just keep on coming. As someone who likes adventures on reel, Jungle Cruise met all my lofty expectations: mythology and legend, a smart-aleck skipper, an Englishwoman and her sweet-faced brother, and the Amazon rainforest. Give it a go even if you are not familiar with the Disney link."}, {"rating": "9", "text": "Great narrative, thrilling action and great performances by lead actors. Finally a great adventure movie for adventure fans. If you are tired of superhero movies labelled as adventures, then Jungle Cruise is the deal for you."}, {"rating": "6", "text": "Jungle Cruise is partially satisfying. The story is simple. I though I was in a sequel of Jumanji at some points. At least I found the humour to be good, especially the dad jokes. The action was quite uneven. Some bits were great while others were just generic. Some CGI effects didn't work well, like Proxima and the Tree in the ends. Yet, you get some spectacular views and designs in the background. The acting was in tone and convincing. The soundtrack was pretty bad all along the movie. Way too present in some sequences. Not the best from Newton-Howard. I did like the modern music parts, it was a break from the rest of the soundtrack. I give it 58%. An acceptable action ride with some good actors in it, but the story, music, action aren't especially well though."}, {"rating": "8", "text": "Beautiful setting, fantastic CGI and a fun story that is actually worthy of Disney. The three 'main actors' do their roles justice and make the action-packed and funny adventure come to life. It's a shame the cursed antagonists don't get more screentime because of the fantastic way they're portrayed and animated. Nevertheless, again a highly recommended Disney movie!"}, {"rating": "8", "text": "I just watched Jungle Cruise. It was entertaining and funny enough to hold your interest. The acting from Emily Blunt and The Rock was good. Average Disney movie felt inspired by Pirates of the Caribbean. Was it as good as Pirates of the Caribbean, no, better than the last two, but still a decent and enjoyable movie. I'd give it an 8.0/10."}, {"rating": "10", "text": "Fantastic movie, love these two working together. I don't want to ruin the movie so I will leave it short and sweet."}, {"rating": "0", "text": "Most pathetic adventure once could experience?!The starting plot was a bit suspenseful, but within minutes you will realize that the director of the film was struggling to keep up with the suspense. Screenwriters have really tried hard to include some punch lines and stupid comedies, but as of today's film standards those comedies are far outdated and frankly speaking shouldn't be even considered funny by children. It wasn't an adventure movie at all by far as the name suggests, moreover just running the scripts to end the film. I suppose Disney have lost the charm. Total waste of 2 hours and the money that was spent for creating this pathetic cruise. Would recommend just to watch it once and never think about it again."}, {"rating": "10", "text": "This movie was realy  great I enjoy it alot won't mind watch it again  and and most all was great movie. And full of adventure great to watch let's get part 2"}, {"rating": "10", "text": "Great humor and action. The dad jokes are the best part of the movie though!"}, {"rating": "10", "text": "Great movie-must see full of adventure with the perfect amount of action and a plot that does not come to be too complicated. The rock and Emily blunt both do great jobs in their rolls, though some aspects of the movie are not great. It’s the new version of pirates of the Caribbean, just on the river."}, {"rating": "10", "text": "It is an excellent film that reminds you of what made Disney great: fun!Loved the humor, action, cinematography details, and moving soundtrack.  The acting was good, if not great for an action flick.Fun for the whole family.  Disney best attempt at getting it in years."}, {"rating": "10", "text": "Fun, vibrant and endlessly entertaining. There wasn't a moment of this film that I didn't enjoy."}, {"rating": "7", "text": "Jungle Cruise is a pretty fun ride from Disney, with its high budget and gloss. While it is derivative of its previous flicks, It is buoyed by the strong chemistry between the Rock and Emily Blunt.  Otherwise, it's business as usual from the House of Mouse."}, {"rating": "8", "text": "Jungle Cruise is a very fun, very enjoyable movie. It's not perfect, but it's a good enough adventure movie."}, {"rating": "8", "text": "It has been a while since we had such fun watching a family film together. Jungle cruise has 2 of my favourite actors - Dwayne Johnson and Emily Blunt - who deliver smashing performances. Their on-screen chemistry is brilliant, and they display their individual passions clearly and credibly. There's a sweet love story here. The villain of the movie hearkens back to the moustache-twirling days of yore, with a ruthlessly driven mind played brilliantly by Jesse Plemons. The dialogue of the film is witty and entertaining, and remarkably sophisticated, tackling sensitive issues with taste and class. The special effects and settings are authentic and really well done. Set pieces are magnificent and breathtaking. You can almost feel the steamy heat of the Amazon in each scene. The supernatural aspect is a nice welcome twist, always. Just like the Pirates franchise, Disney really knows how to spin off classic theme park rides into excellent movies. The jungle cruise within cruise was a funny meta twist. There's a massive twist half way through the movie that absolutely nobody saw coming, which really changes the perspective on a major character. Bravo script writers. The soundtrack by James Newton Howard is epic in scale, reminiscent of earlier classic adventure films. This is an excellent must watch film."}, {"rating": "6", "text": "Its Indiana Jones for kids and my kids liked it a lot. Jungle Cruise has its moments and both Emily Blunt and DJ does a good job. Effects are ok, jokes are ok, story is ok and overall it is well worth seeing especially if you include your teenagers."}, {"rating": "7", "text": "Bon voyage, Streamers! Another weekend, another option from that media conglomerate Disney! The latest adaptation of Disneyland ride into a big budget movie is Jungle Cruise, premiering in theaters and on Disney+ with Premier Access. Disney had great success with the Pirates of the Caribbean franchise, which was maybe the first film adaptation of a theme park ride; and it was buoyed by spectacular effects including the daffy, virtuosic performance from Johnny Depp. Why not try again, right? In a sense, it would seem like a movie based on a theme park ride would need an over-the-top hook like a Depp performance to make it work, but Jungle Cruise has The Rock and Mary Poppins 2.0, so... Anyway, here's how Jungle Cruise fared in its waters.I've never been on the Jungle Cruise ride, so I have no idea if there is a storyline there. I'm going to assume there is not, so the screenwriters had to develop a plot to get the characters on an boat in the jungle and stuff happening. The basics of the plot are that Dr. Lily Houghton (Blunt), a brilliant and adventurous scientist ignored in the science community because she is a woman in the early 20th century, sets out to find an elusive tree with healing powers in the heart of the Amazon. Reluctantly accompanied by her younger brother, McGregor (Jack Whitehall), Lily determined with her wits and an ancient artifact believes she can locate the tree and survive the foray into the jungle. Lily and McGregor engage the services of a riverboat man, Frank (Johnson), who has secrets of his own, to get them deep into the jungle. All the while, mysterious strangers and nefarious villain lurk in the recesses of the jungle threatening to derail Lily's quest. Hijinks, puns, and CGI ensue.Look, the story is ridiculous, but it's a Disney movie. It reminds me of the quest to harness Vibranium from Blank Panther. Everything is so broad and vaguely sketched. The villains are evil for evil-sake - there's no definable motivation or characteristic, except that they are bad guys. It does take too long for the Lily, McGregor and Frank to get on the river and on with their quest. I can see a viewer getting a little bored about 20 minutes in. The movie does pick up when some cool special effects show up and inject some energy into the story. Once you get to that point, it should be smooth sailing to the end.On the positive side, Johnson and Blunt are a good big screen pair. They have good chemistry, even if the relationship is ridiculous. Blunt has that easy charm she carries in every role. She's believable as a plucky and headstrong scientist. It's easy to root for her. Johnson has charisma for days. Even though he is saddled with some groan-inducing one-liners and puns, he sells them the best he can and maintains his cool. I'll also shout out Jack Whitehall. He does a great job of keeping up with his superstar co-stars and even steals a scene or two. While I think the CGI is great, it overpowers anything from Edgar Ramirez and what's worse is that is steals from Pirates of the Caribbean without adding anything special. Nevertheless, the production design and magnificent set pieces are a great reason to see this movie.Jungle Cruise is a fun, summer Disney popcorn flick. It has issues with its plot and pacing early on, but it gains steam as it sails along. Blunt and Johnson do a great job of keeping the movie light and entertaining. Even though the story is ridiculous, you at least root for the characters and can get lost in the special effects, sets and costumes. I wouldn't run out to see Jungle Cruise, but a Saturday matinee with a bowl of popcorn, especially with the family, could be fun."}, {"rating": "8", "text": "Fun and incredibly charming. Has some atrocious CGI but reminded me of the original pirates of the Caribbean. Good chemistry, fun villains, lots of laughs. One of the best Disney Live Actions."}, {"rating": "10", "text": "Truly one of the Best Action/Adventures Movies & TV Shows since India Jones & The Tales of the Golden Monkey came out..."}, {"rating": "7", "text": "Sometimes all you need is The Rock and Mrs. Jim Halpert to team up and soak you in all of their on-screen charisma."}, {"rating": "1", "text": "Finally got around to watching Jungle Cruise and I honestly wish I hadn't. This movie did something few other movies have ever done: It made me resent the time it was wasting WHILE I was still watching it. About a third of the way in, I was already checking out but we had spent the money so I decided to keep suffering through. By the end of the film I was angry at the film for wasting my time, angry at myself for falling victim to the sunk cost fallacy, and dumber for having sat through the entire thing.The plot is nonsensical even by \"Disney themepark rides turned movie\" standards, the runtime is far too long, there's zero feeling of tension or suspense thanks to the constantly bad CGI and cringe dialog. The movie is replete with direct ripoffs of Indiana Jones, The Mummy, the first Jumanji movie, and even Pirates of the Caribbean. The movie doesn't even establish a consistent villain opting, instead, to provide us with two-and-a-half of them: Jesse Plemons' \"Prince Joachim\", Edgar Ramirez's \"Aguirre\", and an utterly wasted Paul Giamatti as \"Nilo Nemolato\", a brief foil to Dwayne Johnson's \"Frank\".So many of the professional reviews say Johnson and Blunt saved this movie but I found them to be the two biggest annoyances in the entire thing. Dwayne Johnson doesn't know what role he's trying to play here -- is he playing the strong guy, the leading man guy, the comedic guy? He tries playing all of the above. His performance is so bad that if you compare it to his other work, films like San Andreas suddenly seem Oscar-worthy. And Emily Blunt's talents are completely and utterly wasted here. Blunt, who elevated lesser movies like Looper and Edge of Tomorrow, who played a fantastic Mary Poppins despite the doubters, and whose range was showcased in both A Quiet Place films was little more than a cheap knockoff of Rachael Wiesz's  \"Evie\" from the Mummy. These same reviews praise their on screen chemistry... What chemistry? All they had were bad jokes. There was no Indiana/Marion or Rick/Evie chemistry in this film compared to Indiana Jones or The Mummy, respectively. Hell, the romantic subplots of the made-for-TV \"The Librarian\" movies with Noah Wyle have more chemistry.1 out of 10, and I'm being generous here. A complete waste of time and space and not deserving of being associated with the word \"cinema\". Complete trash, avoid like the plague. There are literally dozens of better options within the same genre than this tripe."}, {"rating": "6", "text": "Disney’s movie version of the Pirates of the Caribbean ride made big money, so they’re going for gold with this classic attraction. Dwayne Johnson plays the wise cracking captain who’s hired by an intrepid researcher (Emily Blunt) to seek a magical tree with special healing powers deep in the Amazon. The supernatural forces and human heavies they encounter provide action beats. Unfortunately, (like so many current films) the staging and editing are so jumbled that much of it is a blur. Still, the pace never lags and there are sufficient scrapes to keep it rolling. Of course, the \"opposites attract\" chemistry between the leads is OK with Johnson landing numerous corny jokes and Blunt looking resplendent (even after going thru much grubby activity). To add comic fun is Jack Whitehall, as her prissy brother (not a stretch for the actor) and kudus to Disney for letting him be semi-subtly gay. Overall, this is about as much fun as the ride, only 2 hours longer, so families should find sufficient entertainment. Even so, this isn’t as big a score as the Pirates series."}, {"rating": "7", "text": "A decent family film with good performances by all the main cast. It reminds me of the first pirates of the caribbean film, which is a good thing. I would have given the film a higher score, however the second part of the film drags it down overall; there's a bonkers plot twist, too much cgi and the pace becomes too frenetic."}, {"rating": "8", "text": "It’s a lot of fun. The characters and chemistry are top notch and the vibe of being on the cruise with the 3 leads is wonderful. Great Dad jokes, jungle atmosphere, and a lot of charming moments. Certain cgi characters looked a little cartoony buts its not a big deal.  This film understands its not trying to make high art its trying to give you a nice family popcorn night and it succeeds. Hope they make a sequel."}, {"rating": "6", "text": "The moment, early in the film, that the filmmakers directly rip off an Indiana Jones gag (Indy breaking into the tomb in the library, striking the ground at the same time the clerk is stamping papers) tells you just how original Jungle Cruise will be. It's the shadow/rip-off of much better films, from the original Pirates, Raiders, the 90's Mummy and naturally The African Queen. Oh, and toss in a 101 Best Dad Jokes book. The leads have charm and charisma, but I'd rather spend a half hour with them chatting on, say the Graham Norton show, then two plus hours of this manufactured mess. It wants to be the model of the \"rousing\" adventure with that friendly family feeling from the 80's and 90's. Anytime you see four screenwriters, you're usually in for a bumpy ride. The jokes that don't know when to end. The beating a point over the head till it's flattened (if you had a drinking game every time Blunt' s characters pants are mentioned, you'd be dead by the first hour). And the score is such a CVS version of John Williams, he should get royalties. I am bumping this up a bit solely on the performance of Jesse Plemmons, God bless him, as the German officer. Seeing him get orders from some bees (yup), is something you don't see everyday."}, {"rating": "6", "text": "The impressive visual effects and decent cast weren't quite enough to distract from the weak screenplay and hyperactive editing and pacing. Sadly i never felt transported to the impressively detailed and colourful vistas. Jungle Cruise plays to the lowest common denominator and fails to enchant beyond its sheer spectacle. As far as action adventures go this was very watchable but sub par."}, {"rating": "6", "text": "Without the performance and good chemistry of the cast this would be a below average movie. It is a good popcorn movie but will be fast forgotten. I should mention that it is not a Jumanji rip off and based on a Disney amusement park attraction like Pirates of the Caribbean. However it is not as good as either of those two. I would say it is one of the movies where I see great potential and sparkles of awesomeness but it fails to reach the heights. This movie I would describe it as fantasy adventure set in the World War 1 era. It is the story of Dr. Lily Houghton and her brother MacGregor who want to find the legendary “Tears of the Moon” blossoms who could cure any injury and illness in existence to help Britain in the war. They want the help of the Royal Society to fiance an expedition to the Amazon River to proof that the tears are not a fairy tale. However the Royal Society do not support them while a stranger wants to buy an artifact from their collection and they will meet a river steamboat captain who is a cunning trickster and badass. This is the set up for the movie. On paper it is excellent and works more than it misses. It has some lengths and gets better when the 3 main actors start the journey on the river. The actors save this movie for me. Lets start with Emily Blunt as Dr. Lily Houghton. She is amazing and fully delivers. Such a great performance that I want to see more. Then we have Dwanye Johnson as Frank Wolff who is a steamboat captain. He is a scroundrel, trickster, equally great. The chemistry and enjoyable banter between him and Emily Blunts character are a strength of the movie. Jack Whitehall as Mac Gregor Houghton is another great asset and shines in his role. Jesse Plemons is a great antagonist and so enjoyable. Maybe a bit to cliche but this takes not away my enjoyment. The rest also delivers and we have a good performance here. The humor works but reaches never a level where I could truly praise the movie. The special effects are top notch and fully convincing. I think the nailed the atmosphere. Overall I repeat my statement. It is a good popcorn movie but fast forgotten except for the great performance of the characters / actors."}, {"rating": "1", "text": "Cringe. Packed so much of wo-man power and other SJW pandering that it kills any entertainment value it could have had."}], "recommendations": ["jack_the_giant_slayer", "indiana_jones_and_the_temple_of_doom", "guardians_of_the_galaxy", "thor_the_dark_world", "pan", "hercules", "fantastic_four_rise_of_the_silver_surfer", "shazam_fury_of_the_gods", "thor_ragnarok", "bumblebee", "hotel_transylvania_3_summer_vacation", "the_three_musketeers", "rampage", "oz_the_great_and_powerful", "skyscraper", "transformers", "avengers_age_of_ultron", "the_scorpion_king", "clash_of_the_titans", "the_last_witch_hunter", "san_andreas", "king_arthur_legend_of_the_sword", "thor", "brick_mansions", "bloodshot"]}