{
  "id": 4346,
  "title": "Juno",
  "starring": [
    "Elliot Page",
    "Michael Cera"
  ],
  "runtime": 96,
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "description": "Faced with an unplanned pregnancy, an offbeat young woman makes an unusual decision regarding her unborn child.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jNIn2tVhpvFD6P9IojldI3mNYcn.jpg",
  "categories": {
    "plot": 5.666666666666667,
    "acting": 5.821428571428571,
    "ending": 5.75,
    "soundtrack": 3.5,
    "cinematography": 5.0,
    "familyFriendly": 3.375,
    "funny": 6.1923076923076925,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is a great movie. Amazing performances by Ellen Page, Michael Cera, Allison Janney, J.K. Simmons & Jennifer Garner. I'm surprised to see some of the hate in the User Comments. Can you bitter schmucks actually gave this movie a 2? I'd love to see what Michael B., Sara E. & Aaron S. think is an 8. Or a 5. Those are three metacritic readers that rate good movies lower to get their twisted kicks..."
    },
    {
      "rating": "6",
      "text": "I don't think that the movie is so bad... you can sit there and just let everything go. but by no means is it the most brilliant show ever. and yes the script can get a little annoying!! however Genny T there is no need to call people who don't like it uneducated... i have a brilliant education and the movie only scored a 6 for me so."
    },
    {
      "rating": "6",
      "text": "Seriously overrated. I think overall that it was an ok film but I wasnt really into it as much as others may have been. The acting was fine and Ellen Page was a good lead but it was just so stupid to me."
    },
    {
      "rating": "10",
      "text": "This movie is funny, beautifully acted, and charming all at the same time. A great movie!"
    },
    {
      "rating": "10",
      "text": "I started watching this movie on my iPod as I was sitting on the toilet. I was releasing. One hour and thirty-six minutes later I was still on the toilet way passed being done. That was the longest time I've ever spent being on a toilet. I enjoyed every moment. I'm now immune to bad smells."
    },
    {
      "rating": "10",
      "text": "So funny. omg. what a great movie."
    },
    {
      "rating": "6",
      "text": "The movie was almost solid. It could've been better if the didn't **** up the dialogue by putting some of the worst things that I've ever heard in it. And Ellen Page was only good. Goddamn academy. And why is it that she only gets to be clever? **** you academy. This should've never been awarded best original screenplay."
    },
    {
      "rating": "6",
      "text": "Started well but ran out of steam about half way through. Page is excellent throughout but I expected more from the Bateman/Garmer couple and it did feel a little like an MTV show."
    },
    {
      "rating": "2",
      "text": "Juno is a mess. You know there is a problem when every character, especially Ellen page, is either extremely annoying or irritating. Like the characters the movie is uninteresting and frankly a waste of time."
    },
    {
      "rating": "0",
      "text": "waited for the movie to start getting good, and it just never did!, one of the worst movies I've seen, humour wasn't funnier at all, and the songs in the film when they sing  are just terrible!"
    },
    {
      "rating": "0",
      "text": "this movie successfully created the most unlikable main character ever. then they add hipster belle and Sebastian songs to make it seem so against the man. god it made me laugh...so bad..."
    },
    {
      "rating": "5",
      "text": "Honestly, it wasn't really funny, or really clever, or really anything. It was just a movie to watch, it didn't entice me or connect me to the characters; it was just O.K., nothing more. I can see the effort and the great acting, but the story just was not interesting to me."
    },
    {
      "rating": "3",
      "text": "Juno is a film full of extremely unappealing people which has been tailor-made to appeal to a teenage audience, who luckily for director Reitman, don't have a fully developed crap-detector yet.  Side note - Ellen Page wasn't playing Juno... she was playing Ellen Page as Juno.  Previous and subsequent performances are all Ellen Page clones. The whole sarcasm-dipped banter thing isn't fresh or funny anymore, my dear.  Broaden your horizons immediately, if you're even able, before the slow death of type-casting takes hold."
    },
    {
      "rating": "8",
      "text": "Juno is a charmer. I'm not only talking about Ellen Page as Juno MacGuff, but Juno as a whole. It's an intelligent comedy that only comes around every couple of years."
    },
    {
      "rating": "8",
      "text": "Juno was a good movie. I wasn't surprised but I was a little disappointed as I expected a little more from that movie as the reviews from the critics and the users are high. It has a great cast especially Ellen's Page performance which should have been awarded with an Oscar. The plot wasn't something really amazing but the whole film  was entertaining  It had some funny  moments and some quite a bit sad moments. It is entertaining and easily watched and if you like this kind of comedies you will like it. I liked it but I was expecting more.."
    },
    {
      "rating": "8",
      "text": "Juno is one of the best independent films ever. It really has a story that you really wouldn't expect to be that unique but it is so innovative. You don't have to be a hipster to love Juno but it may help. Ellen Page is outstanding in this film and its unfortunate that she didn't really get a real chance to be a comedy star like she was in this film. She is really funny and the character suits her so well.\r Beside Page you have several note worthy names like Michael Cera, Jennifer Garner, Jason Bateman and JK Simmons. The whole cast is great but Diablo Cody's script is as much the star as anyone in the film. The story avoids clichés and there are so many moments where the dialogue is exceptional which explains why this movie won an Oscar for its screenplay.\r The only issue that I have with Juno is Jason Bateman's absence in during the ending. I'm not always a big fan of Jason Bateman but he was so good in this movie and he avoided falling into the same character that he always plays but he was still super likeable despite deserting his wife right before they are going to adopt a baby. Bateman's character left pretty late in the film and I wasn't expecting him to kiss and make up but I think he should have at least been involved in the film's ending. Juno is still great though and I can't believe I waited so long to watch it."
    },
    {
      "rating": "0",
      "text": "Film pour ados neuneus et autres adulescents pas finis dans lequel une jeune gourdasse tente de refourguer le polichinelle qu'elle a dans le tiroir à l'insu de son plein gré. Sirupeux, niaiseux, neuneu (je l'ai déjà dit mais ça va mieux en le disant) et branchouille du genre \"mon film social sur la société des jeunes immatures trop cools\" mais en politiquement correct parce que, faut pas pas déconner, l'avortement c'est le mal et que la pillule du lendemain, c'est pas encore rentré dans les moeurs (on est aux Etats-Unis ouais ouais).Pour accompagner ce pseudo-film d'une lenteur d'escargot aux dialogues Marie-Claire et Podium mélangés pleins de béni-oui-oui jusqu'à chier des fleurs partout, la musique Flanby à deux de tension est à se liquéfier sur place et même si Ellen Page est toute mimi, on n'a qu'une envie : la baillonner et l'étouffer dans son sirop de grenadine avec son demeuré de petit copain attardé. Putain de purge chienémerdographique."
    },
    {
      "rating": "5",
      "text": "hmm this movie is probably only interesting to young-older teens. not funny at all! I could see that they tried to be funny but it was more of like a goofy/silly type thing that immature ppl would find funny.  the only part i found interesting was the drama between the adopting couple. other than that... eh. I HATE the sarcasm in the movie. I was like HELLO theres a 16 year old girl thats pregnant! does anybody care? its like they make it seem \"OK\"! the parents didnt seem to be too worried or shocked and the girl seemed like she could care less. If i was her parent i'd be PISSED at the fact that my daughter was having sex at that age knowing the consequences. these parents seem just as irresponsible as their kid. This is NOT the message that we should be sending to teens. and i actually believe the only smart thing this girl did was give the baby up for adoption. that comment the doc said when she was giving the ulrasound saying the teen mother shouldnt raise her baby cause she'd be in a poisonous environment was actually something i'd agree with. plus teens dont know how great it is to have their freedom until they r responsible for the life of a child."
    },
    {
      "rating": "9",
      "text": "Ellen Page shines as Juno MacGuff! She delivers a bright and shiny performance. I don't know if many audience members are aware of this, but Diablo Cody, who wrote the screenplay for this film was inspired by her life when she was 16 and pregnant in which it shows exactly what can happen during pregnancy and how it can guiltily affect your boyfriend that got you pregnant from sexual intercourse. Juno MacGuff acts like she doesn't care if she's pregnant, but she was smart about it and she does act like she is facing the challenges of being pregnant and she still does care about her boyfriend, Paul Bleeker (Michael Cera). Paul Bleeker still cared about her also. He felt guilty about getting her pregnant, but they still love each other and Page and Cera play cool characters. But what's great is the coming-of-age-type of love story between the two where they have great and intelligent chemistry with each other. And where the film's soul comes from is from the strong character development between the two from start to finish and where she faces a lot of hard decisions about being pregnant around her family and friends and between giving it up for adoption or the other. And strangely enough, it was romantically funny between the two. It's directed like a sitcom, but Jason Reitman makes a wonderful image out of it; especially the hilarious and moving performances of Michael Cera and Ellen Page and the impressive dialogue. Juno MacGuff (Ellen Page) is obnoxious as hell, but Ellen Page was great at her emotions and her obnoxious, yet very smart and intelligently written script. And hey, thanks to Diablo Cody's writing that was inspired by her 16 and pregnant life, it was well done with Juno MacGuff's smartitude, because her smartitude is what made her smart about her pregnancy. Diablo Cody's writing is also what made the script intelligently clever, smart, and not funny but beyond that: Hilarious! To give the audience an experience of being pregnant during high school, it gets the job done with impressive writing from Diablo Cody that made it so smart and intelligent. The love story between Juno and Paul was well-inspired. Especially due to the fact they played great characters. If you hate this wonderful movie, I would feel bad for you because where is your soul? Let me remind you haters this is a very touching movie that gives you clues of what being 16 and pregnant is like since it shows exactly what can happen when a some is pregnant - even when she gave birth and the guilt her boyfriend faced. Besides, wasn't it emotionally intense when she gave birth? Because this film shows how pregnancy can be in every way effective. Besides, It is romantically funny between Juno and Paul, so don't underestimate their character development and chemistry either, because hating this movie would be just soulless. Besides, like I said, she is obnoxious as hell, but she is cool like that, she's bright, sweet, charmingly and cleverly funny, smart, and intelligent. You would be an idiot to underestimate Juno MacGuff's awesome personality. Also, DO NOT underestimate Diablo Cody's superb writing and/or the romantic development between Juno and Paul either! Even if you hate the film considering Juno to be annoying, you are still an idiot, because she is very cool like Ellen Page. One of the coolest things about her is hamburger phone: that was clever as hell! I honestly think Juno was flawed, but thanks to Jason Reitman and Diablo Cody, writing and acting inspired from life of someone (yes, Diablo Cody) who was pregnant at age 16 gives it a coherent soul to captives your heart into a wonderfully explanatory experience of teenage pregnancy - especially since it shows how teenage pregnancy can be both personally and emotionally effective - even on your friends and family - well done by it's sweet and charming qualities - and Ellen Page, who helped made it sweet and charming due to her character and performance. Thank her and the rest of the cast also! And you know what, how can you hate this? You would be a disgrace to hate it. This movie has soul and it would be the perfect movie to watch in Health class in High School to give students clues of teenage pregnancy. Hating this movie, would be soulless. Shame on ANYONE who hates Juno! And yes, I mean you also! You haters would just make me sick! Although you haters may find Juno annoying: She is actually very sweet and clever! DON'T UNDERESTIMATE HER and/or Ellen Page. Especially Diablo Cody's writing. That would just make you haters inconsiderate with no soul. And haters, have you seen the show 16 and Pregnant on MTV? If so, that TV show ACTUALLY shows what I mentioned about teen pregnancy before and depicts it between Juno & Paul. I would also like to point out again that the screenplay of this film was inspired by Diablo Cody's life as a 16 year-old pregnant girl so think twice before you hate."
    },
    {
      "rating": "10",
      "text": "My favorite movie!  Ellen Page is the only person who could have done this part.  The movie shows how fun life can be, while blending that with the up and down rollercoaster of teenage life.  I cried when she had the baby because I knewthat even though the baby was not going to be brought up by Juno, that she was still eternally, and forever the baby's mother"
    },
    {
      "rating": "0",
      "text": "Such an annyoying movie. That one kid who acts like an alien in every movie is horrible. Ellen Page was a total you know what. Gross. Making teen pregnancy look like something fun."
    },
    {
      "rating": "3",
      "text": "A terrible, horrible, and COMPLETELY over rated comedy. It was an hour and a half of hipster bollocks being shoved down my throat. There was ONE part that made me laugh. The other 89 minutes or so I was looking for something to shove into my ear drums to stop the relentless hipster soundtrack. UGH."
    },
    {
      "rating": "3",
      "text": "Wholly implausible, overly written, hipster-wannabe Industry calling-card script flatly directed."
    },
    {
      "rating": "2",
      "text": "if you have a penis, do NOT see this movie. It will fall off. Also, worst soundtrack ever."
    },
    {
      "rating": "2",
      "text": "Juno - the bottomline\r Message to filmmakers: Don't put anything on screen that you don't have the slightest clue about! Do your homework and research first.\r Did you notice anything while watching this film?\r 1.: The film, as so many others, once more reinforces outdated mis-information about childbirth despite very contrary research findings, reaching a huge audience and in doing so contributing to bad birth decisions - which unfortunately too many parents make already these days on a routine basis.\r Take an hour and do a Google search to find out why - and don't only read the first two pages that come up - or just believe the nonsense this and other films dump into your brain, but don't say later you couldn't know any better. Your choice.\r \"Birth in hospital is normal and best.\" WRONG. Fact: For healthy mothers with normal pregnancies, birth in hospital is more dangerous than at home.\r \"An epidural is normal and necessary.\" WRONG. Fact: Epidurals routinely cause serious side effects on mother and baby with not uncommonly terrible health impacts that last for years or a lifetime. They also slow down the birth process, often making further medical interventions necessary that wouldn't have been necessary without an epidural.\r \"Birth is given lying on your back.\" WRONG. Fact: Lying on your back makes the whole birth process significantly slower, harder, and more painful, increases the risk of birth injuries and also the likeliness of further medical intervention like instrumental birth, medical induction / speed up, and caesarean section.\r Did you notice any of these things when you saw the film? No? That's how seriously you have already been manipulated throughout your life into thinking that all this is \"normal\" and \"right\".\r 2.: The only responsible solution for teenage pregnancy is giving the child up for adoption. Particularly in the film's setting, this is sheer nonsense. There is absolutely no reason why a sixteen year old mother can not responsibly raise her child if she has the intelligence of Juno as well as the sound financial AND moral support of her parents - be it with or without the father of the baby. Simply assuming that this is not possible is disregarding all those young mothers - and also fathers - who do a really great job raising their children, with the help of relatives and friends, and often provide a much better environment for their children to grow up than the typical neurotic hung-up and emotionally immature couples that seems to be the norm in many \"normal\" families these days.\r Bottomline: An interesting film concept, taken into an unreflected, outdated stone age direction, and in doing so, unfortunately ruined. Additionally the film sabotages the efforts of all those who work hard to make objective birth information a part of public knowledge, and adds to the misinformation and manipulation that parents-to-be are bombarded by already.\r Don't believe a single source of information - DO YOUR HOMEWORK and find out for yourself.\r Thanks for thinking. Your baby will love you for it!"
    },
    {
      "rating": "1",
      "text": "This movie has no conflict. It's a bunch of well adjusted people dealing maturely with a problem and then it ends. The hint of conflict that does arise with Bateman's character not wanting to play along never goes anywhere. That plot line is simply abandoned. The whole movie is just an excuse for Ellen Page to make mildly funny hipster wise cracks. The people raving about this movie are the type that look at a painting of a solid red square and claim to be deeply moved because someone labeled it modern art. It's a movie for posers, about posers."
    },
    {
      "rating": "0",
      "text": "There was no action. I never laughed once. The dialogue was just a bunch of wise mouth cracks. There was no flow. There was no climax. It was awful."
    },
    {
      "rating": "0",
      "text": "For the love of god. I felt like I was just watching MTV for and hour and a half. And I hate MTV. Here is Juno in a nutshell: Blast Unbearable Indie music , blast more terrible indie music , Crank more horrible indie music"
    },
    {
      "rating": "0",
      "text": "This movie sucks. It has a horrible plot!!!"
    },
    {
      "rating": "0",
      "text": "Sadly over-praised, and smugly over-pleased with itself. This isn't the fault of the actors, who were for the most part good, but of the writer and director. I didn't find it funny or within the realm of reaity or original. I found it utterly stupid and manipulative. The irony is that I went to see it and after 45 minutes, the projector broke. Had to go back and watch and listen to the same self-satisfied crud again. Very disappointed. Most over-estimated movie of the year."
    },
    {
      "rating": "5",
      "text": "It's fine. Just not great."
    },
    {
      "rating": "5",
      "text": "I agree with a lot of the lower scored voters who say that it was alright...but not great. It had the occasional moments of humor but nothing that i would class as \"laugh out loud.\" There#s a modern and decent plot which isn't overdone, but I'm not sure why its got a lot of the accolades that it appears to have. I felt occasionally it seemed like a made for tv movie and at the end of it i was a little bemused that id paid £5 to watch. If i had to give a recommendation in a sentence i would say that its alright to rent out if you have nothing else to do one Saturday night, a nice movie to watch with the girlfriend perhaps."
    },
    {
      "rating": "3",
      "text": "I think it's just childish to insult others for their opinion on a review site (LET ME TELL YOU WHY I'M RIGHT AND YOU'RE NOT). Everyone has different tastes, just give your output and don't insult. That doesn't help ANYONE. Those comments aside, I disliked Juno. The premise is untapped and fresh, the cast are all in their prime, and it's produced by fox searchlight. It had the makings of a fantastic flick, but failed miserably in the script writing. I actually think Diablo Cody masturbated to the script while writing it, in the way he blatantly force-feeds cool. The unlikeable character Juno alone ruined the movie for me, every scene where she was meant to \"stick it to the man\", she comes off looking like a snooty, self-serving, preggie bitch."
    },
    {
      "rating": "3",
      "text": "By no means Oscar worthy, Juno is a contrived attempt at recreating what made films like Little Miss Sunshine and The Royal Tenenbaums great."
    },
    {
      "rating": "0",
      "text": "This film is as unintelligent and trashy as the self-absorbed redneck charcters that feature in Juno. The music seems like it was picked by a deaf squirrel and the script written by a filthy arab goat. In fact, I would rather feed my genitals to ravenous vultures, eat my own feces and support the collingwood football club than watch this insufferable film again. Juno only appeals to dull-minded, dirty, inbred rednecks and people who take sick pleasure from watching lacklustre actors hack through a sub-par script with tacky, self-indulgent one-liners."
    },
    {
      "rating": "0",
      "text": "An awful movie. This is the kind of humor an elderly person might enjoy. The main character gets annoying and it is simply not funny. Don't waste your money."
    },
    {
      "rating": "0",
      "text": "All the hype around Diablo Cody and this movie had me dying to see it. First day - I'm there. Wow. What a disappointment. It is just dreadful. The characters all sound the same, none of it is the least bit convincing (not even as a funhouse mirror reflection of reality) and the humor has no snap. Terrible acting and soundtrack. It's just wall to wall bad. I can only assume all the glowing reviews are a byproduct of the feel-good-girl-power-breakout-screenwriter bandwagon. It happens sometimes. Remember how Nia Vardalos was going to take over Hollywood? Sorry... but the emperess has no clothes. Which kind of makes sense... Cody used to be a stripper. Maybe she shouldn't quit her night job."
    },
    {
      "rating": "2",
      "text": "Dialogue that is only heard in the heads of the insane. Bad acting. Bad direction."
    },
    {
      "rating": "1",
      "text": "Yikes, did this ever stink. Everyone I was in the theater with couldn't wait to leave. The critics must be itching for another Little Miss Sunshine. Sorry, but this ain't it."
    },
    {
      "rating": "2",
      "text": "Overrated. A smug and hipper than thou film that never rings true."
    },
    {
      "rating": "2",
      "text": "Nice try Nick. This movie blew and no matter how defensive you get, that simple fact will not change. Trystan M. pretty much summed up why this movie sucked with his comments. This year's Little Miss Sunshine. Trying to be too smart for its own good and just ends up failing miserably."
    },
    {
      "rating": "0",
      "text": "This film is absolute filth. i wish i could have ripped that foetus from Juno's belly with a pair of unsanitary tongs, scraping the insides of her vagina for added effect."
    },
    {
      "rating": "8",
      "text": "Juno is outstandingly scripted, wonderfully acted, and despite narrating a rather slow-paced story, it touches on appropriately compelling notes with the right yet subtle amount of poignance, passion and power."
    },
    {
      "rating": "8",
      "text": "Teenager gets accidentally pregnant, decides to give the baby to a middle class couple when it's born.Great film that's full of charm & very sweet.Ellen Page is fantastic as the quirky yet very dry Juno. Good supporting cast & a great soundtrack to go with it."
    },
    {
      "rating": "7",
      "text": "Coming-of-age story told with remarkable witt, adroitness, authenticity, and essence. The dialogue is thorough and adept without losing its younger viewers. \"Juno\" is a smart comedy/drama that, at times, comes across a bit brusque, but wins your heart through the 9 month journey of a teen-made-mom facing the astringent sociological and physiological effects of a \"fly-by-night\" decision. However, instances of quixotic support from parents and quirky relationships make \"Juno\" less believable, and more Hollywood than you would like to see, but manages to keep your attention long enough through Page's brilliant performance."
    },
    {
      "rating": "8",
      "text": "Reminds us that there are alternatives to abortion. Also helps during one's search for identity by encouraging to just be oneself. Suggests not to chase a fancy lover, but be with the one who cares - the best friend. Fast paced, very likable, and sometimes beautiful."
    },
    {
      "rating": "10",
      "text": "Very funny PG-13 movie and Ellen Page plays the greatest role on the movie. Also, the soundtrack is amazing and all of the jokes on the movie are hilarious."
    },
    {
      "rating": "7",
      "text": "For what it is...it passes. Not sure I agree with the subject matter or how it was handled by the characters , but Ellen Page came of as charming despite her offbeat personality and Michael Cera continues to slowly grow on me. It may not be a straight up comedy as some suggest but it does have its moments of laugh out loud dialogue and situations. Juno seems more fit for a selective audience but as an indie film I have to say that I rather enjoyed it."
    },
    {
      "rating": "8",
      "text": "Starring the actress we know from INCEPTION and WHIP IT and the actor we know from SCOTT PILGRIM VS. THE WORLD and SUPERBAD, JUNO is a ridiculously funny comedy about an unplanned teen pregnancy. When I rented it, even though it was nominated for a few Oscars and was highly praised review-wise, I feared that it would be an \"indie\" twist on the usual dumb-humor farce; but it's extremely simple to say that that's not at all what this was. It was an amazing blend of controversy and laughs that, quite surprisingly, weren't from raunchiness or crudeness, but rather from the cleverness of the plot and sub-plots altogether."
    },
    {
      "rating": "8",
      "text": "Juno is the sort of film that is hampered by aspects of its approach, yet surprisingly winning in its outcome. Ellen Page stars as the titular Juno MacGuff, who becomes pregnant after, well, having sex. She could be termed quirky and is a bit of a wiseass -- especially for someone who forgets basic biology -- but the performance makes her disarmingly likable. Juno of course decides to have the baby and to then give it up for adoption, and the film follows her through the remaining course of her pregnancy. Director Jason Reitman's previous Thank You for Smoking was justly praised, and here he has created an equally enjoyable experience. Diablo Cody's script is perhaps a little too self conscious -- would anyone ever use the phrase \"honest to blog\"? -- but she shows a knack for creating memorable characters with occasionally humorous dialogue. The proceedings are definitely aided by a talented cast. Michael Cera shines here with his unique meek charm as the, um, baby-daddy. J.K. Simmons and Allison Janney have excellent bit parts as Juno's father and stepmother. However the majority of the acting credit must go to both Jason Bateman and Jennifer Garner as the potential adoptive parents, and who provide valid dramatic counterpoints to the otherwise sweet comedy in the foreground. Though the self-congratulatory wittiness may grate some and the twee-filled soundtrack may prove taxing to others -- plenty may fall into both categories -- Juno ends up coming together nicely on just about every level."
    }
  ],
  "recommendations": [
    "17_again",
    "easy_a",
    "spanglish",
    "no_strings_attached",
    "you_again",
    "the_king_of_staten_island",
    "silver_linings_playbook",
    "life_as_we_know_it",
    "legally_blonde",
    "bad_teacher",
    "we_bought_a_zoo",
    "trainwreck",
    "chef",
    "greenberg",
    "good_on_paper",
    "the_dilemma",
    "life_of_the_party",
    "little_miss_sunshine",
    "midnight_sun",
    "booksmart",
    "a_bad_moms_christmas",
    "the_perfect_date",
    "a_walk_to_remember",
    "i_feel_pretty",
    "burn_after_reading"
  ]
}