{
  "id": 571,
  "title": "Jupiter Ascending",
  "starring": [
    "Channing Tatum",
    "Mila Kunis"
  ],
  "runtime": 127,
  "genre": [
    "Science Fiction",
    "Fantasy",
    "Action"
  ],
  "description": "In a universe where human genetic material is the most precious commodity, an impoverished young Earth woman becomes the key to strategic maneuvers and internal strife within a powerful dynasty…",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xzQ25m9vrdyvpLX74T3B3KB40Ou.jpg",
  "categories": {
    "plot": 6.290909090909091,
    "acting": 5.2592592592592595,
    "ending": 5.4,
    "soundtrack": 5.0,
    "cinematography": 3.0,
    "familyFriendly": 6.0,
    "funny": 4.0,
    "action": 7.454545454545454
  },
  "reviews": [
    {
      "rating": "4",
      "text": "As much as I wanted to love the movie as a chance for Mila Kunis to take center stage and as a Wachowski callback I simply did not find the movie engaging.  The plot was a bit muddled, the romance seemed extremely forced and there just weren't any really likable characters.  Mila Kunis' character, Jupiter Jones, is the protagonist but I never found myself rooting for her.  She was wishy washy at best and so lovestruck by the end that it seemed she had no character whatsoever but what was forced on her by the shoe horned romance.\rWhat I did enjoy:  The visual effects.  This movie does not disappoint on that level.  The CG is amazing and the detail is incredible, if it weren't for the great visuals I would rate this much lower.  The scene where they first come to the Planet Orus and show off the technology is quite breath taking."
    },
    {
      "rating": "4",
      "text": "I wanted to like this movie. I really did. It just kind of feels like a watered down, first draft of the first Matrix movie. Some of the acting and directing choices definitely stray into \"So bad it's good\" territory so if you are a fan of that (like me) it's not a complete lost cause. If you like cheesy sci-fi, you absolutely won't hate this one, especially if you watch it with friends for a laugh."
    },
    {
      "rating": "0",
      "text": "Completely unrealistic plot on the most base level: unappealing Mila Kunis discovers that she owns the earth and is given planetary powers. She was working as a poor maid cleaning toilets until that became known to her. After a lot of adventure and saving the earth, she decides to go back to scrubbing toilets (literally) for a living as a maid. The sci if stuff is fun, but the basic plot is ludicrously unbelievable. A similar plot would be: a maid wins a billion dollars in the powerball but decides to throw all the money away and scrub toilets for a living instead. Yeah right."
    },
    {
      "rating": "9",
      "text": "This movie was great fun. Lots of amazing visuals. Great stunts and action. Funny dialogue - I especially loved the Terry Gilliam \"Brazil\" scene. The plot is ridiculous which was extra entertaining. it has a real Fifth Element vibe - sort of camp and zany and over-the-top - but with a larger budget and much better visual effects. I'm looking forward to the sequel!"
    },
    {
      "rating": "10",
      "text": "To the Wachowski's - Don't let these reviews detract you from continuing your work.  This movie I believe is more of a a revelation masked in an action sci-fi film. This was the best movie since the Matrix.  Even my mother of 65 loved it,  my wife and friends.  As usual so many truths that are are currently hidden to us are meant to be revealed here in a way the general population can digest.  The problem is the population isn't ready for this material yet.   Therefore you see the negative ratings.  Everything from the symbolism of the bees down to the decadence of the ruling elite.  The underlying premise of this movie is closer to reality than most understand.\r As far as the movie and superficial material .. The fight scenes and action were the most exciting I've seen since the Matrix.  Very few movie makers can can bring chills down your spine like the Wachowski's.  The action and special effects already made this movie worth the price of admission.  I may even go back and see it again.  The architecture and style were unique and a pure joy to watch.  PLEASE Keep MAKING MOVIES!"
    },
    {
      "rating": "7",
      "text": "I enjoyed this film.  I felt that the storyline and universe was epic - reminiscent of Frank Herbert's Dune.    There was plenty of action, an interesting storyline and sneaky pop culture references that were amusing.  It felt as though it had been heavily cut, however, and could have easily filled another hour or so.\r I wanted to see more of the universe.  It felt as though we were just looking through at a small portion of what this universe had to offer and I had many questions I would have loved to explore further.\r I really hope that there will be a directors cut, expanding on this universe and filling in some of transient scenes that felt missing.  The acting was excellent and the dialogue between characters felt real and not forced.  It was artistic and beautiful without sacrificing the storyline, though I wish there had been more of it.\r Not as amazing and ground breaking as the matrix trilogy, but a great watch."
    },
    {
      "rating": "10",
      "text": "Like it so much I went twice, good sci fi film. Enjoyed the chemistry and humour. Eddy was good at being a bad boy for a change. The second viewing was able to understand more of the film that I missed the first time round. Worth a visit to a big screen to get the full effect."
    },
    {
      "rating": "8",
      "text": "This was a fun movie.  There has been a lot said about the movie itself, and they are right.  It is not cinema masterpiece.  What it is, is a fun, sci-fi action movie.  That is it.  Don't expect more.  I would love to see more of this world.  What we saw was very intriguing.  Though, this flopped so badly, I doubt we will see more of that world."
    },
    {
      "rating": "10",
      "text": "I love the movie, and I want to watch it again. It has a very interesting storyline and effective actor's play, the visual are very impressive. Some people just could not understand the idea of story, therefore just ignore these critics."
    },
    {
      "rating": "7",
      "text": "Not totally bad, but I was expecting for better. This is not very original movie, I reminded me of Thor, and some says it is similar to Guardians of the Galaxy (I didn't watch Guardians)."
    },
    {
      "rating": "10",
      "text": "I really don't understand all thats bad reviews, this movie, even if you are not a fan of a hardcore sci-fi, must be a A+ just for be PURE CINEMA; incredible landscapes, a great and original universe, incredible action scenes, What people are looking for a epic sci-fi opera? I just don't understand."
    },
    {
      "rating": "9",
      "text": "Finally saw Jupiter Ascending, and As usually, I wonder where the bad reviews come from. The movie is definitly not \"Good Will Hunting\" or \"Inception\", but it doesnt pretend to be either. In my opinion, it has some strong Luc Besson influences, and I would compare to \"The 5th element\". Its loud, its crazy, its fantasy, its wild. And it doesnt take itself too serious. After watching its grandeur with sets, spaceships and costumes, I knew I want the Wachowskis to do DUNE."
    },
    {
      "rating": "8",
      "text": "Few movies are visualy as spectacular as Jupiter Ascending. The action scenes are awesome, the universe is beautifuly crafted and the plot is simple, but effective. Ok, Mila Kunis is not the best choice for a protagonist and could use some more acting skills, but overall, the movie is great."
    },
    {
      "rating": "9",
      "text": "My girlfriend and I really loved this movie. We watched it last night and we were thoroughly entertained throughout the whole movie. Critics have once again proved that their opinions are worthless to me. The plot moved along well and held my attention completely. It wasn't difficult to follow. The movie is also a visual feast and contains some incredible action scenes. The acting was good. There was even some philosophic depth to the movie that I appreciated and enjoyed.\r I'll write a longer, more detailed review later if I have the time. For now, suffice it to say that we were very glad we went to see this movie."
    },
    {
      "rating": "9",
      "text": "A visually beautiful film that easily rivals any other space/sci-fi flick that I can think of. Those who claim the story is confusing didn't pay attention (I thought it was quite simple . . . ) and if you go into the film expecting anything but a fun and engaging action-packed gorgeous space opera then you probably will be disappointed, but honestly I very much enjoyed it. I can't point out any negative aspect of the film."
    },
    {
      "rating": "3",
      "text": "The headache inducing action sequences and their clumsiness rival anything Michael Bay has done. The movie made absolutely no sense and i can see their entire budget went to visuals and costumes and none to any professional writers. Channing Tatum looks stupid, Mila Kunis is a miscast and Eddie Redmayne is embarrassing"
    },
    {
      "rating": "9",
      "text": "Over the top to the extreme, an extended visual orgasm, complete with a Royal Wedding and giant flying lizard people. Yep, that sums up \"Jupiter Ascending\". This movie was not made for the masses.\r I went into \"Jupiter Ascending\", with low expectations after all of the horrible reviews but I was hopeful the Wachowski's would deliver something unique. On that note I was not disappointed. (Plus the movie gets bonus points for being original—not a remake or sequel—with a beginning, middle and end.)\r True, the film is dopey with characters named Jupiter Jones, Caine Wise, and Stinger (a guy who lives with bees). The dialog is flat and embarrassing, framed in a fairly simple story with a few twists and turns, And yes the story is completely unbelievable, nonsensical and disjointed with two-dimensional characters, and pacing/editing that exhibits a jumpy start and stop rhythm. But dammit, this movie was FUN and a feast for the eyes!\r With references to Alien, Blade Runner, Brazil, Cinderella, Dune, Men in Black, Planet of the Apes, Star Wars, Fellini's Satyricon, The Wizard of Oz, 20,000 Leagues Under the Seas, and more, \"Jupiter Ascending\" is a Science fiction/ Fantasy love letter to the genre. I'd say it's comparable to Pacific Rim from a few years back, another excellent, and rather silly science fiction/action film that under-preformed at the box office. Highfaluting, half-baked philosophical crap abounds, (there even seems to be a sub-text involving the virtues of cleaning toilets and maintaining regular bowel movements???) and I enjoyed the whole banquet.\r \"Jupiter Ascending\" is a deliciously layered candy bar full of nuts and honey and other weird things you probably shouldn't think too hard about. It's most likely bad for you but tastes so good! I want to go back and experience the film again and see how it holds up on second viewing. Probably too weird for mainstream audiences and too dumb for the art-house crowd, \"Jupiter Ascending\" has future cult film written all over it. Time will tell."
    },
    {
      "rating": "0",
      "text": "I don't usually review movies but I registered here just so I could review this. This is possibly the worst movie I have ever seen. Struggled through about two thirds of it but it's totally unengaging. The main character, Jupiter Jones appeared to be played by a cardboard cutout with no character or acting ability. This movie is visually cluttered and badly scripted. Reasonable basic premise and storyline, but then it's nicked from an old science fiction story, as most of these kind of movies are. I had my misgivings from the start when I saw it was by the creators of the Matrix, yet another reworking of an old science fiction idea padded out with yawn inducing visual and action sequences."
    },
    {
      "rating": "3",
      "text": "A visual feast for your eye but leaves your brain dead. The movie started promisingly but halfway through ends up in a mess. The story just does not hold up and the conclusion wasn't satisfying at all. It looks like none of the actors are really interested; just collecting the paycheck. Watching this movie is a complete waste of time."
    },
    {
      "rating": "3",
      "text": "This is a really bad one. The story does not engage you at any point, you know what is to happen since it is so predictable, and there is no special acting, score or unique special effects to save it. Nothing. There are a few moments when the characters interact with each other on Earth that are actually a little bit more interesting than all the crap displayed when the effects kick off. Slightly entertaining with some snacks or a few drinks."
    },
    {
      "rating": "7",
      "text": "Okay I enjoyed this movie, the actors did a good job in their assigned roles and the special effects were great, BUT if aliens started shooting up a city on earth there is no way aliens could cover it up, be real it would be on every news channel worldwide so writers you stuffed up on that point. ALso why would aliens 90,000 years ahead of us breed humans for the elixir of life, rubbish they would make it in a testtube. AND this supergalactic empire then turns to a hitchhikers guide segment about red tape admin...HUH. The subplot with his best mate was a wasted space he should have been commanding the starship not living on a bee farm. But I liked the small amount of tension between the leads however she is supposed to be a queen wheres her battle fleet, what she queen of a territory and no army, no sense but if you put aside logic and just have action and CGI then its pretty good."
    },
    {
      "rating": "0",
      "text": "Seriously worst film I have ever seen. Thought about giving it 1 star for the pretty effects but sorry the crappy story and acting actually makes it a minus 10."
    },
    {
      "rating": "6",
      "text": "The plot reaches the breaking point at an early stage of it's developments upon the curve of runtime which leaves the supposedly unknown coming scenes pretty much expected. Which takes the film quickly down the curve of 'runtime'.\r I wouldn't have criticized too hard if the director(s) was other than the Wachowski(s), The Matrix was (still is) an epic Trilogy which might be hard for it's impression to be re-created even by it's creators."
    },
    {
      "rating": "10",
      "text": "I usually get incredibly bored watching most movies. I am happy to say I really fell in love with the characters and I would watch this again in theaters. Its hard to believe all the negative reviews."
    },
    {
      "rating": "10",
      "text": "After all the bad reviews I was pleasantly surprised with one of the most visually dazzling films I can remember.  Best use of 3-D ever!  Derivative?  Maybe.  But everything they stole the did better than the source.  Except for Eddie Redmayne (who chewed, swallowed and regurgitated the scenery) the acting was quite solid.  The basic story was simple and familiar, making it fairly easy to follow.  The real star of the show was the world-building, turning something apparently heinous into morally ambiguous, which no doubt confused and frightened a lot of moviegoers, especially critics.  See it!  It's worth every penny of your IMAX 3-D premium ticket!"
    },
    {
      "rating": "3",
      "text": "Such wonderfully imagined concepts have never been so disappointingly unrealised. Some of the cinematography is sublime, but there are many moments which are poorly executed, and the same goes for the world building and costuming.  The performances are forced and clunky, the dialogue is awful, the storyline is full of lofty ideas that are barely explored, and the entire film lacks depth, with a resolution that is thoroughly unsatisfying. A terrible let down on almost every front. 2.31/10"
    },
    {
      "rating": "8",
      "text": "This was so much better than the critics are letting on.  Its not a perfect movie by any means,  but its a ton of fun and the visuals are amazing! It has a nice passing and actions sequences are fantastic!\r If this would have come out last June and gone head to head with Transformers 4 it would have crushed at the box office. Its absolutely worth seeing!"
    },
    {
      "rating": "9",
      "text": "I think if you go to theater open minded,There is potential that you will love the movie.Graphic effects were excellent.The story will really suck you in to the world which is really Interesting.I really loved it and would recommend you to watch it with an open mind and i Certainly hope you are going to love the movie"
    },
    {
      "rating": "3",
      "text": "All I can say is, after I watched the movie, I felt bad at all the money they must have spent in making this.  With all that money, they could have made a fantastic movie that could have been epic.\r Oh well.  One of those movies I'd probably forget.  So I'm writing a review to remind myself not to watch this again in the future."
    },
    {
      "rating": "8",
      "text": "Jupiter Ascending is intriguing, enriching and holds a world of it's own, amazingly detailed backdrops and eye candy visuals leave even the simplest of audiences excited. The interesting story comes together well, with the occasional plot hole. However the films biggest downfall is the main leads that never really feel like the fit the genre. Jupiter is a entertaining movie that cry's for a sequel that we may never see."
    },
    {
      "rating": "8",
      "text": "The visuals knocked my socks off.  Incredible!!  The plot was alittle weak but the visual effects were riveting.\rI am going to see it again! I want a sequel!"
    },
    {
      "rating": "7",
      "text": "Definitely not the clusterf--k so many people are claiming it is.  But certainly no masterpiece either.\r Visually stunning and thankfully the plot wasn't predictable (for the most part) like so many other sci-fi's.  Could have done without the tacked on romance scheme, and the main villain is typical fare.\r The movie strikes a nice balance of action and story, although action sequences run a little long.  The writing and dialogue could have been better, but it's passable.  Unfortunately the movie leaves a lot unexplained, which is sad considering the plot could have been a very interesting one.\r All in all, an entertaining, yet flawed flick."
    },
    {
      "rating": "9",
      "text": "I disagree with all the negative critic reviews this film seems to be attracting.  It thought it was a lot of fun with, visually spectacular set pieces, an interesting central idea, a universe that seems fully-realized and thought-out, a strong female lead, and good acting.  Only real complaint was that the chemistry could have been stronger between the leads."
    },
    {
      "rating": "10",
      "text": "Great Space based sci-fi movie, very dynamic and immerses you in a different -unique- universe... if you let yourself  to be \"taken\" by the story and avoid holding to some details, it is an exceptional movie, with great visuals, acting and effects.\r I do not understand why there is so much hate for this movie by the critics... I watched it and enjoyed it very much!!\r So, go to see it to enjoy it, not to judge it, you will not be deceived."
    },
    {
      "rating": "9",
      "text": "The first half hour boring but the end makes it. The idea for the base story was new und makes is interesting. Fantastic outfits and I was full flashed by the CGI and visual!"
    },
    {
      "rating": "8",
      "text": "Good flick, very entertaining. Quick pace, good acting, amazing visuals, will go see it again and will purchase when digitally released. Can't understand why it's getting blasted. It almost seems as though they're trying to persuade people not to see it in hopes it will fail. Wonder who the Wachowskis pissed off."
    },
    {
      "rating": "3",
      "text": "\"Jupiter Ascending\" 10 Scale Rating: 3.0 (Awful) ...\r The Good: Visually, it gets a 10 as the film is a sight to behold. The effects are top notch and the fighting scenes are well choreographed. The space battles and dog fights are also well done. Channing Tatum and Mila Kunis try really hard to make this work and neither were part of the problem.\r The Bad: The supporting cast was not up to the task and just about every one of them (save Sean Bean) was terrible. The villains (Eddie Redmayne, Douglas Booth, and Tuppence Middleton) were especially dreadful. Redmayne's performance was baffling as he's usually a very good actor. In this film, however, he was hammy and over-the-top ... and not in a good way. The story itself is weak at best, full of plot holes and infused with comedic elements that just don't work. Silly would probably describe the film's premise best. Lastly, for a regular Earth girl, Mila Kunis sure can survive a lot, making death-defying escapes, bending the laws of gravity, and ignoring simple science while doing so. With the exception of amazing effects, it was just a terrible offering all around."
    },
    {
      "rating": "3",
      "text": "Not that it would matter much: but possible spoilers about a real spoiler. I wanted to love this movie. I did not love this movie. In fact, my 3 rating is high, due to my love for the genre and the Wachowskis. I did love Speed Racer and the Matrix, and I've enjoyed the Wachowskis other movies if not loved. Jupiter Ascending let me down in so many ways. The first half of the movie I found great. Whenever we were on Earth I was pleased. Smiling in my seat. Wowed by the special effects. When we leave Earth it all fell apart. The acting was all very well done, even Tatums. I don't care how well the digital effects are, they just do not move me in anyway. While on earth the gravity boots, the makeup, the digital effects mixed in real-world areas or sets all fantastic. The planet Jupiter was good. The rest just felt so awkward and emotionless. Maybe because we have seen this before, for many years, starting with the oft besmirched star wars. Putting the search for realistic eyes in a digital world aside the story is a complete and utter failure after we leave earth. As if they ran out of story and decided to just repeat what they did on earth in space. More of Kunis character Jupiter falling and being saved by gravity boots. Lots more. This isn't the creative repetition as with the matrix that lets us see the computer world of the matrix is being created on the fly, no this is we have completely run out of time or ideas. Have these movie directors learned nothing from the past? we could have stayed on Earth and armed Jupiter's excellent Russian family and had them fighting with slapstick humor and it would have been a hit. they could have wrote in a story about humans that know of the plot but are helping it along for the love of money. Instead we get repeated extremely lifeless set pieces that we have already seen at the beginning of this movie. So instead, we have another grand missed opportunity. And that is a shame, because no one can do this like the Wachowskis, and every failure will stop more space operas from hitting the big screen. Tisk tisk Wachowski brothers. And tisk tisk to all of your friends who obviously know nothing, or are too afraid to say anything about the course of your creations to you. The moral of the story is you don't need to own galaxies and cleaning up poop ain't so bad as long as you have a wolf-man with flying boots? Did you know you were making such a bad movie so you tried to force feed us an ideal that would let us cope?  Signed: devoted but bewildered fan. I hope you make enough to get another chance. Only because you owe us fans now, you owe us big time."
    },
    {
      "rating": "9",
      "text": "Jupiter Ascending is one of the most entertaining movies I've seen for a long while.\rIt quickly hooks you into the plot with its great characters, fantastic photography with gorgeous scenes, loads of action and its interesting universe. Its plot might not be too deep, but I guarantee you'll have a good time with this one."
    },
    {
      "rating": "2",
      "text": "Move was just awful. I had really wanted to like this move but it was just BAD. It's a really shame because the visuals are amazing the possibility for a scfi epic are there., Mila Kunis looks amazing in it but acted like she was still Jackie from that 70s show. They tried so hard to get the teen crowd that they dumb ed it down so much nothing is there any longer. Channing Tatum is not my favorite actor by any means but he was decent in this and he wasn't the problem, but he looked more like a Elf then a Wolf."
    },
    {
      "rating": "1",
      "text": "While the movie gets an \"A\" for visual effects, the overall picture was bad. George Clooney once said that he felt the most important part of the movie is the dialogue. This movie is the posture child for the reason is why he is right. The villains all same the same old threats worded in exactly the same way. \"Don't fail me again.\" whispers Eddie Redmayne to his henchmen...ppplleeaasee. The acting is standard, but don't blame the acting on this one. This one dies because of bad dialogue, editing and the inability to connect with the characters. I wanted to walk out 3/4 of the way through because I honestly did not care what happened at the end. The only thing that kept me in my seat was I invested the money and time to see this stinker so I felt obligated to stick it through. I think congrats are in order the director for making  the latest version of Battlefield:Earth, only in 3D. Save your money."
    },
    {
      "rating": "8",
      "text": "This is a true space opera, in the same vein as Battlestar Galactica and the like. The CG makes the entire movie gorgeous. Mila Kunis shows that she really is a solid actress...and Channing Tatum isn't bad to look at :D The weirdest performance was that of Eddie Redmayne; it's haunting, even overly dramatic, but it's hard to forget. The story is predictable, but it's still a highly entertaining movie. The ending leaves room for some interesting sequels."
    },
    {
      "rating": "9",
      "text": "Final Fantasy, the Movie, this is it.  This has three times the filmmaking talent, skill and panache of Guardians of he Galaxy, three times as good.  The plots are very comparable in emotional affect, not in storyline.  If you liked the original Star Wars or Guardians... you'll find that style of moviemaking updated and done better here.\r It is indeed the sci-fi portion of Cloud Atlas made longer with much better writing and better acting.  The two male villains leads are wonderful and effective.  Mila Kunis is more than adequate.\r I read all the Metacritic review thumbnails before writing this.  I've re-read them again now.  I think we have again the Steven Spielberg critical backlash effect here that arises when directors make movies the public wants and loves but offer no red meat for film critics."
    },
    {
      "rating": "10",
      "text": "This is a revolutionary scenario and universe which is quite profound, rich, but didn't turn out on the screen because of too many cut scenes. There is an introductory aspect to the movie that feels rushed and confusing, which seems to the the reflection of the state of confusion that the main character is put through. More interesting is the fact that this movie explores the theme of the origin of our species as other movie did recently, such as Prometheus, the notion that we may not be the only intelligent society in the universe. The fundamentals themes remain those of the Wachowskis, very close to the Matrix and Cloud Atlas, a quest for freedom of choice, the fight for the release from slavery, exploitation of the body and mind of Mankind to keep them in an altered state which is the result of a manipulation scheme based on the power of lies and ignorance and the moral consequence that comes from the awakening from those lies. Requires intelligence and attention from viewers that can miss the point. This is not just an action movie with lots of CG..."
    },
    {
      "rating": "10",
      "text": "The Wachowski brothers are the most creative visual artist in Hollywood. And they are also great storytellers. Maybe they not excel in all of their casting choices, but still, Jupiter Ascending is one of those films that will keep go on to achieve cult status."
    },
    {
      "rating": "0",
      "text": "Battlefield Earth for a new generation!  Wanted to leave the cinema after the first five minutes.  **** overblown CGI  effects, unintentionally hilarious performances, camp costumes and dire dialogue make this film an absolute chore to get through.  More fantasy/kids movie than proper sci fi - avoid this one like the plague!"
    },
    {
      "rating": "7",
      "text": "Obviously awful reviews were the deterrent. I went in expecting poor pacing, a shallow story, & terrible writing yet a plethora of relevant characters, good world-building, and a landscape inviting future adventures had successfully been established; as well as the pluses eclipsing the negatives. I enjoyed some of the tech & templates coming straight out of the RPG Shadowrun w/ a less campy Flash Gordon but less serious than the Matrix execution. The identity of the movie made a bumpy ride, but it always recovered. I whole-heartedly recommend Jupiter Ascending & believe a lot of lazy or cowardly bloggers/reviewers passed on forgivable negatives like wildfire. Frame of mind is always crucial going into a movie. I think going in w/ a purpose, to enjoy a space opera, expecting the worst will allow you to enjoy Jupiter to the fullest. The mistakes made with this one should pave the way for an even better sequel, which I look forward to."
    },
    {
      "rating": "7",
      "text": "In these reviews, I notice two main groups of people - the ones who like a story, and the ones who like the eye candy. If you only like movies that tell a good story, you shouldn't even bother going - the story is pretty simplistic. The special effects, however, were spectacular. I also definitely liked some of the things they ended up doing with the Sci-Fi and how they introduced Jupiter to the greater universe. I also enjoyed how they explained a great deal of the 'aliens' being human while still including alien races. Despite the story being somewhat simplistic, the universe has great potential for expansion though I'm not sure another movie would be a good medium for it. I'd read the book though. In all fairness, despite the former, the movie and the action scenes got a bit tedious at times, but that's not hard to work around.\r Solid 3.5/5 in my book"
    },
    {
      "rating": "0",
      "text": "piece of **** acting...piece of garbage...piece of banana peel...piece of junk...piece of did i already say that it is a piece of ****................"
    },
    {
      "rating": "8",
      "text": "I am amazed at the negativity surrounding this movie.  Granted it is a sci-fi picture which turns off a lot of professional movie critics, but seriously, its a sci-fi space opera, and its not supposed to have enormous depth of character, or a profound story line.  Its for fun, entertainment.  I found Jupiter Ascending fun and entertaining.  As mentioned in other reviews, the visual is on overload...from the world building to the fashions.  The story is very fast moving, and in this, I wish they had spent a little more time crafting the plot and having more emotion in the acting, particularly concerning \"harvesting\" or how long should society extend life past a normal 90 years.  It would have been fun to explore more of the world, but maybe this would be better for a game, than a movie.  There's something elegant about the movie.  Maybe its the way the bees react to royalty and the elegantly crafted and thought out world building.  This is probably not a movie for everyone, but it is a fun, fun movie to watch....and then to wonder about the creative energies that went into thinking all that stuff up..."
    }
  ],
  "recommendations": [
    "valerian_and_the_city_of_a_thousand_planets",
    "oblivion",
    "9",
    "serenity",
    "independence_day_resurgence",
    "gravity",
    "pacific_rim_uprising",
    "mortal_engines",
    "blade_of_the_47_ronin",
    "gods_of_egypt",
    "poseidon",
    "sunshine",
    "the_last_witch_hunter",
    "tomorrowland",
    "the_tomorrow_war",
    "avengers_age_of_ultron",
    "clash_of_the_titans",
    "riddick",
    "moon",
    "guardians_of_the_galaxy",
    "monsters",
    "surrogates",
    "science_fiction_volume_one_the_osiris_child",
    "transformers_the_last_knight",
    "sucker_punch"
  ]
}