{
  "id": 592,
  "title": "Jurassic World",
  "starring": [
    "Chris Pratt",
    "Bryce Dallas Howard"
  ],
  "runtime": 124,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction",
    "Thriller"
  ],
  "description": "Twenty-two years after the events of Jurassic Park, Isla Nublar now features a fully functioning dinosaur theme park, Jurassic World, as originally envisioned by John Hammond.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/A0LZHXUzo5C60Oahvt7VxvwuzHw.jpg",
  "categories": {
    "plot": 2.183673469387755,
    "acting": 2.0,
    "ending": 3.0,
    "soundtrack": 3.0,
    "cinematography": 0.0,
    "familyFriendly": 3.7142857142857144,
    "funny": 4.0,
    "action": 3.2
  },
  "reviews": [
    {
      "rating": "1",
      "text": "An absolute shocker of a movie, an embarrassment.  Product placement everywhere, terrible dialogue, plot, acting, characters, CGI (the dinos in Jurassic Park look better).  The guy a few seats down from me in the cinema was fast asleep.  The amount of people saying that this is good goes to show how much expectation has dropped in the last 20 years.  We used to get summer blockbusters like Jurassic Park, Terminator 2, Braveheart, Gladiator, heck even Jaws that started the summer blockbuster.  Now we get this, lots of Transformers, lots of Pirates and Marvel movie after Marvel movie.  The standard today is a disaster."
    },
    {
      "rating": "9",
      "text": "Nothing can match the heights of the original, but Jurassic World cleverly realises that and diverts all of its attention into being a non-stop, exciting and most importantly FUN thrill ride."
    },
    {
      "rating": "10",
      "text": "This movie was incredible. If you're a fan of dinosaurs, Chris Pratt, or Jurassic Park, by all accounts you should love it. I spent the entire movie with a smile on my face and joy in my heart. I have never been so happy leaving a movie theater. It was hands down, my favorite movie-going experience. Without spoiling it, the movie has the right amount of everything. Pratt was fantastic. The kids weren't annoying. If you go to the movies to have fun and not pick things apart until you hate them, this movie is for you."
    },
    {
      "rating": "0",
      "text": "This movie is **** horrible and completely unnecessary. It is LITERALLY nothing but a cheap money grab, Every aspect of it is poorly written and horribly thought out, This movie should have never been made."
    },
    {
      "rating": "4",
      "text": "Its just so many hollywood cliches per minute. All the forced character development is really annoying.\r Start of movie: two brothers who dont get along (young, kids, main characters), two sisters who dont get a long, one doesnt spend any time with family (the main character one), a marriage about to fall apart. Oh and two people (chris prat and main woman, who is also that sister who doesnt spend time with family) who went on one date and didnt like each other.\r End of movie: Brothers are closer than ever, sisters are closer than ever, marriage crisis averted, and of course they fell in love somehow even though they pretty much hated each other the whole movie.\r Nothing in the events of the movie actually moved any of these relationships along. they just got written to change with no explanation or reasonable on screen motive.\r And just lots of really stupid \"bad horror movie\" stuff by people for no reasons. Its just hard to watch. I guess the dinosaur was cool."
    },
    {
      "rating": "4",
      "text": "I enjoyed the first part of the movie a lot, the kids were cute and their perspective was great at translating that same sense of wonderment the original Jurassic Park had.\r I enjoyed much less how the movie become a dumb monster movie along with a case of \"too many cooks\" with too many plot lines and too many characters competing for attention in the second half. They also could have done a much better job with Chris Pratt's and Bryce Dallas Howard's characters who are basically dumb caricatures, and I hated that cliched military bad guy.\r Last complaint : too much CG, everything looked fake, especially the Dinos, everything on screen was too clean, too bright, too crisp. The last action scenes was particularly ludicrous, defying all sense of realism."
    },
    {
      "rating": "2",
      "text": "I have never written a review on MC before, but I feel compelled to warn people away from this film.  Call it my patriotic duty, but, my fellow Americans, on the eve of our Independence Day, liberate your mind and stay far away from this film."
    },
    {
      "rating": "4",
      "text": "'Just show some bleeding dinosaurs' someone must have  shouted after the millionth rewrite of the script and so this movie is bucketful with cool looking cgi. I have no beef  with cgi and the critters, small and large, look impressive for this day and age. Give me some more.\r The MacGuffin is a mini Godzilla, a human created predator broken loose and on the prowl. Godzilla is a very smart cookie and  possessed with the mentality of a rabid dingo on a blood drive, always an ideal combination for a predator the size of a small hill. It wants braaaiins..eh blood.. lots and lots and mostly human at that.\r Godzilla is also blessed with various other advantages, such as being bullet proof and being  provided with a 10000 mega whack density field, which makes living things increasingly more dense the closer they get to the big meat eater. Humans tend to behave in remarkably stupid ways when near the monster. Like there is this guy handling a gatling machinegun who fails to make proper use of it even though it should not be too hard to hit a thirty feet tall creature with it.. Also whenever anyone has a gun that he or she might shoot the big creature with, he or she forgets to use it or just misses the giant monstrosity.. and even whey they finally manage to hit it by firing lots and lots of bullets, they just bounce off the armored hide..\r During the movie Godzilla realizes how pathetic the  screaming hairless monkeys really are and tasks itself to end their suffering by biting their heads off. Make the pain go away! It must have thought, after it consulted the Diagnostic and Statistical Manual of Mental Disorders (DSM) IV. It also manages to convince a bunch of raptors to assist it in its noble goal. And they even get assistance of a flock of flying dinosaurs who dutifully lift some of the hairless monkeys and toss them into a big basin where a huge whale like dinosaur has just finished eating a large white shark and appreciates the humans for afters.\r Meanwhile there is a red haired profit oriented control freak, who is the female lead, who convinces the free spirited motor bike enthusiast dinosaur whisperer male lead to forgo a potential shag in his rickety-rackety outhouse so as to help her save some kids from being eaten by the nasty big thunder lizard. We can then witness the embarrassing trite acting of these two as the stuck up biatch mellows into pools filled with tear eyed admiration when the biker drives into the jungle accompanied by his raptor buddies to stop that big brute.\r When the raptors betray his trust  he has to high tail it out of there, but somewhat later the lizard whisperer convinces the raptors to become suicidal and attack Godzilla again. Which works as expected: killing the little buggers, until biatch incites a T-rex to stop Godzilla from eating the last one. Everyone tries to follow this big fight on their handhelds and mobiles, only to discover that at random moments they fail. What a bummer, they must have thought, but they can always buy the movie and watch this all over again.(And they are welcome to it).\r Things get eaten and things get smashed to tiny bits as part of product placements. If you didn't already know it.: that car the biatch drives is a Mercedes and gets flattened in scene 3! And the shop that raptor Delta wrecks in scene 76 is Starbucks. And the undies lizard boy is stripping out of during the intimate scene with the red head, has a male name on the front, but that one is edited out because this movie is PG-13. The male lead does shag the female lead, but that is reserved for the producer's cut or the redux version that will hit Amazon in 2017. And the computer network that hampers communications is called SkyNet..oh wait.. that is from another movie.\r The story thus far:\r-something makes sense.. but let us call you when we find the right version of the script.\r- there are some actors in there doing something, but they might have walked in from another movie and we call you when we figured this one out..\r- we lost the very big lizard because it camouflaged itself, doesn't show up on our infrared sensors and it removed the transmitter from it's body so we can't pinpoint its exact position, but we inform you once we located it.\r- that our phones don't work really, so we just drop by to talk to you about having a shag in the deprecated bungalow at a beach in Costa Rica..\r And you don't think that is silly?"
    },
    {
      "rating": "4",
      "text": "Very basic entertainment. How can the original one, the real classic, almost look better than this one when it was created 20 years ago??? Too much CGI, too much of silly plot, too much of old-fashioned role for the woman character. Zero depth. And I don´t even think Chris Pratt is that charming (let alone a good actor, I have yet to see proof of that). Absolutely appalling that this movie ended being so successful at the box office, and like out of nowhere because nobody expected it. Transformers teas LOL Seriously, 2015 has ended being a way worse year for films than 2012, 2013 and 2015. When it comes to blockbusters, Mad Max has saved the year. Totally."
    },
    {
      "rating": "4",
      "text": "I have read many and many User Reviews about Jurassic World, that say, that if you are a Jurassic World Fan, you should see this movie. I actually agree about this one, but only because then you can see with your own eyes how bad this movie actually is.\rIt may look pretty and in 3D it is even better. but looks ain't everything. If you wanna see a real Jurassic Park movie again, then you have to wait. It may be better than the last movie, but it only is a step into the right direction. And I don't wanna say, that it is a bad movie. It's just a bad Jurassic Park Sequel (yet again).\rThe movie has it's moments but the whole time, I was sitting in the cinema, seeing this movie, I thought: \"Something does'nt feel right\". And soon I got it: It was the atmosphere. All in all the movie is full packed with action and less calm, darker scenes, which were used in the first Jurassic Park to build tension. It was used to give the consumer of the movie the right amount of fear, which let the Dinosaurs look more threatening. They completely (except for one scene) removed this kind of tension and put in lots and lots of boring senseless dialogues and shooting-scenes. But as I said before: The movie has it's moments and you could say it is kinda worth it, to see the movie because they have lots and lots of \"eastereggs\" in it, which lets you fall into nostalgia and lets you see some scenes from the first Jurassic Park but years later, which I actually found pretty cool.\rThe soundtrack is awesome, too. They've reused melodies from the first Jurassic Park. But I think, that's okay, because the Soundtrack was, and still is awesome.\rI am not going to write a quick story review in here, because I wanted to make this review spoilerfree. But I can tell you this: I have found some \"mistakes\" in the logic of the people who wrote the script for this movie. One of it is known in the internet pretty well: \"The whole High-Heels Story.\"\rAnd the other one is, that we all know raptors don't hunt or fight alone. They normally stay in a pack. Which they even thought about in the first Jurassic Parks. I don't think, that this alone makes the movie worse than it is. But all in all, this is more of a mediocre movie.\rThat is, why I only give it 4/10 (if they would've changed the title, so it doesn't mess up the Jurassic Park Series more, I would've given 5/10)"
    },
    {
      "rating": "4",
      "text": "While the movie plot has plenty of holes and the movie is over all just a meh . Super killing dinosaur raptor-Rex hybrid that can cloak and talk, plus some trained raptors cuz Duh we need to weaponize Raptors for the military cuz that makes sense.\rIf you think this mOvie is great you may be retarded however if you are bored and it's on tv for free probably could kill some time."
    },
    {
      "rating": "4",
      "text": "Not much good to say about this movie.\r Corny, mediocre, predictable and most of all terrible characters.\r Let's be honest, the plot was never a strong suit for the jurassic series, but wow this one will make the classics look like Shakespeare wrote it."
    },
    {
      "rating": "4",
      "text": "Background: I have watched the three previous Jurassic Park films, the first in the cinema, but I do not remember where I saw the other two. The first was great, the second, average and the third, good. This review is based on a TV viewing.\r Pros: None. (If you think I could at least have given a point for the dinosaurs, no. Go watch Jurassic Park. There's nothing new here!)\r Cons:\r(1)  The whole film takes implausibility to the extreme, including the:\r(a) Implausible dinosaur behaviour of a dino-cidal Indominous Rex and train-able raptors. Hah!;\r(b) Implausible human behaviour of the dislikable female lead, the bumbling CEO, the lecherous brother and the cliched war-profiteer; and\r(c) Implausibility of how a theme park like that could have been given the approval to operate, considering all the safety issues. You have a Mosasaurus in a giant pool/lake where people can fall into,  fields with giant dinosaur where visitors are allowed to drive themselves around, etc.\r (2) The film has this comical scene where our characters had to move left and right to avoid being killed by dinosaurs as the latter go about attacking other dinosaurs and the humans. This is in the tradition of the three previous films. It was already stale by the second film and it it had definitely gone bad by now!\r (3) If you hadn't gotten the drift by now, the writing is poor and lazy. The directing is not any better. What a missed opportunity to reboot the franchise.\r (4) Have I mentioned, how I hate House Prices Dallas in this film?\r Who would think the film is great? Children.\rWho would think the film is only so-so? Young adults.\rWho would think the film is lousy? Old adults.\r Rating: 2/5 (no half scores). Do not bother to even watch it on TV. It felt tedious to watch it on TV."
    },
    {
      "rating": "4",
      "text": "It's hard to judge it fairly, but it is fair to say that the premise of Jurassic World is highly similar to previous releases, and that being dinosaur chaos and human survival. Still better than JP3, though."
    },
    {
      "rating": "4",
      "text": "Jurassic World is too much like the original. The movie is too long. The ending is exactly like the first one, one dinosaur taking down another, and the whole movie was way too predictable."
    },
    {
      "rating": "2",
      "text": "Yet another movie where we get poor directing and lazy writing. Instead of watching Jurassic World watch  Jurassic Park it's basically the same thing only done far better. Hollywood is just going to keep making crap like this because people are paying to see this movie more than once. There are some really unlikable characters in this movie and they're the ones we're supposed to be cheering for.  Really Disappointing."
    },
    {
      "rating": "3",
      "text": "The dialogue was horrendous. but what can one expect to come out of the mouth of such highly contrived characters?  The humans in this movie were only the fleshy vehicles we were forced ride in order to get to the CGI money shot at the end.  Using mass amounts of crowded people as pterodactyl niblits was a nice touch.\r If it's loud. mildly frightening dinosaurs in 3D you want  while you suck down a family size pop corn and 64 oz cola to yourself, I highly recommend going to see this in the theater, if only for the last 15 minutes.\r If you enjoy character development, story, and a symbolic musical score, or any kind of metaphorical subtext, please continue to wait for Stephen Spielberg to come back to the franchise (which he won't)."
    },
    {
      "rating": "3",
      "text": "This really isn't a good movie, the best thing about it is Chris Pratt. Even CG on dinosaurs looks outdated.  It's like the director had a checklist of things he had to put in a movie, and put them together with little rime or reason."
    },
    {
      "rating": "2",
      "text": "looks like another franchise milked in 2015, some of the characters in this film are given scripts made by children. It was also repetitive withe the same plot of other Jurassic movies and the beginning doesnt really explain how they where able to make jurassic world maybe they did and I didnt listen,"
    },
    {
      "rating": "3",
      "text": "I thought it was ok. It didn't keep to standards. I'm a huge fan of the Jurassic series and anything dinosaur related. But this just didn't have the thrill, scare or heart stopper like the previous Jurassic park movies. You actually got to see gore, and death in the previous series so it was always a heart racer. But they made up excuses to cover it all up in Jurassic World. They took control of what was meant to be chaos. Raptors were always a huge fear factor in Jurassic movies, now they sort of just tell them to sit, stay, roll over. The scene of the pig escaping and the new guy falling into the raptor cage was a potential thrill, then the tamer came in and again, told the raptors to sit. Two or three people 'may' have died. The rest could walk it off. Had it been the first Jurassic movie in the series I've seen, then yeah it would have been amazing. But it wasn't so it isn't. Again, good movie, just didn't keep to it's own standards."
    },
    {
      "rating": "1",
      "text": "How the hell can you like this movie? Its a Dishonor for Jurassic Park....................................................................................."
    },
    {
      "rating": "3",
      "text": "This Review is written in GERMAN Language!\r Ich war ein grosser Fan der alten Jurassic-Park-Filme, weil es etwas neues, innovatives war vor allem mit den Computergenerierten Dinos.\r Allerdings ist Jurassic-World nur ein flacher Abklatsch mit fadenscheinigen Begründungen um die Story überhaupt erklären zu können.\r Der Film hat dermaßen viele Plot-Fehler und schlechte Erklärungen, dass man aus dem Augenrollen schon gar nicht mehr rauskommt... leider.\r Ich zähle einfach mal die Dinge auf, die mir am ehesten auf den Magen gestossen sind und mich fast dazu gebracht haben das schauen des Films vorzeitig abzubrechen und nach Hause zu gehen.\r 1. Die Begründung aus den Raptoren lebende Waffen zu machen die man im Feindgebiet aussetzt ist so dermaßen schlecht, dass am ehesten die Waffenverrückten Amerikaner am ehesten verstehen, warum die Bemerkungen in dieser Hinsicht absolut schwachsinnig sind. Natürlich gibt es Drohnen die Höhlen erforschen können, es gibt sogar Bomben die extra dafür gedacht sind Höhlensysteme zu zerstören. Ausserdem wurde bisher noch NIE eine Drohne gehackt, zumindest nicht nach dem was wir wissen und vor allem, wie Drohnen funktionieren. Also keine Ahnung wie die Filmemacher auf diesen Unsinn kamen. JEDE Armee der Welt würde Drohnen und automatische Systeme die SIE kontrollieren einer biologischen Bedrohung vorziehen, da diese auf Dauer einfach nicht kontrollierbar ist, weil es wilde Tiere sind.\r 2. Als die Protagonisten feststellen, dass der neu gezüchtete Saurier \"fehlt\"  , warten die Wildhüter nichtmal die 5 Minuten ab bis die Chefin im Kontrollzentrum prüfen konnte wo sich der Saurier tatsächlich befindet, mittels des Ortungs-chips. Nein, wir rennen in das Gehege in der Hoffnung, dass die Instrumente zur Anwesenheitsprüfung auch tatsächlich keine Fehlfunktion haben. Nur um ein bischen Spannung zu erzeugen und letztendlich eine Situation herbeizuführen in der der Saurier dann auch tatsächlich flüchten kann. Hätten sie \"WIE JEDER NORMALE MENSCH\" die paar Minuten gewartet dann wär der Film an dieser Stelle vorbei gewesen, aber das geht ja nicht...\r 3. Als die Schwester der Park-Chefin feststellt, dass sie ihre Jungs nicht beim Rundgang begleitet, fängt sie nach 2 Sekunden das flennen an... ich weiss dass es solche Frauen gibt, aber dieses Klischee hätte man wirklich sein lassen können und sie einfach etwas harscher reden lassen anstatt sie als emotionales Wrack darzustellen.\r 4. Dinosaurier sind immernoch gefährlich... trotzdem ist der Park so konzipiert, dass die Besucher mit ihrem seltsamen Glaskugelgefährt selbstständig den Weg bestimmen können. In keinem Park der Welt würde so etwas erlaubt werden, da Menschen, wie Dinosaurier, unberechenbar sind. Was ist wenn sich 2 Kumpels einen Spass erlauben und testen wie sich ein Dino verhält wenn man ihn mit dieser Kugel rammt, oder veranstalten ein rennen über den gesamten freien Park. So ein Quatsch.\r 5. Im Park gibt es durchschnittlich 15.000 Besucher. Allerdings gibt es nur 15-20 mit nicht tödlichen Waffen bestückte Aufseher um diese zu schützen... Mal davon abgesehen dass die Besucher auch unter kontrolle gehalten werden müssen durch Security und andere Aufsichtskräfte... zb. um Diebstähle und Gewalttätigkeiten zu verhindern, sind 20 Wildhüter für eine so riesige Fläche einfach absoluter schwachsinn. Unser Wildpark, mit Hirschen und Wildschweinen, hat mehr Aufseher mit RICHTIGEN WAFFEN, als dieser mit gefährlichen Tieren versehene Park... aus dem Augenrollen kommt man praktisch nicht mehr raus.\r 6. Die Park-Chefin (mit ihrer hässlichen Helmfrisur) lässt nur einen kleinen Teil des Parks durch absolut unfähiges Personal (zb. der Azubi ohne Plan von nix) räumen obwohl gerade ihr komplettes Wildhüterteam in kleine Teile zerrissen wurde.... und sie eigentlich weiss, dass NIEMAND mehr da ist um die Menschen vor der Bedrohung zu schützen. Wie wurde die denn Chefin von IRGENDWAS? Ja... hochgebummst, das kann man vielleicht anführen an dieser Stelle.\r Ich könnte noch weitere Dinge aufzählen, aber dieser Film enttäuscht alle 5 Minuten von neuem. Sehr schade, ich wollte ihn mögen."
    },
    {
      "rating": "3",
      "text": "Jurassic World presents a tug-of-war where expectations are hoping to be met but are continuously resisted by poor writing and acting in what otherwise should have been a decent experience. There is enough awe to help mask a few of the underlying weaknesses that are difficult to ignore, but this success is short-lived. Before the motorcycle scene there were glimmers of optimism that this might be the decent sequel. But it gets much worse in an attempt to tie up a pretty loose plot. Ultimately, there isn't much to believe about this movie, even at the character level. About halfway through it's fairly obvious where the plot is going and this only makes things worse. Admittedly, it's hard to hate Jurassic World but it's even harder to take it seriously."
    },
    {
      "rating": "1",
      "text": "Easily the worst film I have seen this year and the biggest disappointment at that. I cannot believe they made this crap out of such an iconic franchise, the writing was bad and the acting was extremely average. I wouldn't recommend wasting two hours of your life with this garbage."
    },
    {
      "rating": "3",
      "text": "There are some spoilers in this review!\rStupid movie. If you are in a critical situation where you nephews are in danger, you don't waste time seeing a dinosaur die, you want to save your family! The acting was awful, and the part of two different wild animals from the past join forces to defeat another is so dumb! I know it  is a movie for kids but come on, our children aren't stupid. The dialog and the plot are terrible also. Theres only one thing that I liked, the special effects, aren't the best but were decent. That's all, if you want to waste 3 hours of your life, go and see this movie."
    },
    {
      "rating": "3",
      "text": "No idea why this film was so popular at it's release, the film is mediocre at best. Trying to ride off both Chris Pratt hype and nostalgia, but failing on a logical stand point as well as enjoyment. It's a stupid film, not in the sense of a 10 year old throwing insults but in the sense of the literal definition. I wouldn't recommend anyone to watch this film."
    },
    {
      "rating": "1",
      "text": "Jurassic World is a copy and paste  film of Jurrasic Park. But Jurrasic Park had a original story . This train wreck takes place years after Jurassic Park and no one learned anything from the destruction or character traits from dinosaurs .Whenever anyone see a movie with dinosaurs , that are free to roam around on an island , and there are not any form of high tech military weaponry or machinery , you will witness one of the worst films ever made."
    },
    {
      "rating": "3",
      "text": "HOLY **** Can those idiot scientists ever learn. The first and second movie makes sense, but now the scientist just upgraded the **** dinosaurs. WHAT THE **** HELL were they trying to accomplish exactly???!!!. Its like those scientists are saying:\"Hey lets kill everyone\". No living creature on earth would ever even think about modify the dinosaur."
    },
    {
      "rating": "3",
      "text": "Jurassic World is worse for dinosaurs than extinction was. I'd rather watch all the Transformers movies back to back than watch this again. A complete disaster of soullessness."
    },
    {
      "rating": "10",
      "text": "great start to a new trilogy!!!!!!!!!!!!!!!!!!!!!!!awesome movie !!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "great comeback to the franchise!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "0",
      "text": "A pathetic money grab, cringy and embarrassing plot hole after plot hole.  This movie should not have been made, none of the characters have any redeeming qualities. I got to the point where I cheered on the dino's instead & wanted everyone to die, even the children (something I never thought I'd say)."
    },
    {
      "rating": "2",
      "text": "Why did they make this film? Perhaps Ian Malcom said it best:  \" You didn't earn the knowledge for yourselves, so you don't take any responsibility for it. You stood on the shoulders of geniuses to accomplish something as fast as you could, and before you even knew what you had, you patented it, and packaged it, and slapped it on a plastic lunchbox, and now...\"\r And now.\r Let me take you on a tour.  The first thing you'll notice in JW are cliche stock characters: the woman so obsessed with her job she just needs a good strong man to make an honest woman out of her, the good strong man, the eeeevil, spoooky scientists, the money grubbing CEO......\r Then you'll notice products.  Products products products.  Coke, Mercedes Benz, Samsung; at one point a child points out that a vine covered vehicle is a \"1992 Jeep Wrangler...\"  because if you can't SHOW the product, you sure can have a child who inexplicably knows a lot about vehicles SAY the product.\r Then, if you know anything about dinosaurs, you'll notice lots of mistakes.  Like the mosasaurus being about 10 times bigger than it was in real life (the original JP took some liberties to make the dinos darker in shade than they probably were, but this movie is off the rails.)\r Then you'll notice lots of logical inconsistencies.  Like, after the Indominus Rex escapes, Bryce Dallas Howard's character is concerned that if they alert the crowd a dino is on the loose, the park will get closed.   Are we supposed to believe that the resulting lawsuits from five peoples' deaths wouldn't shut the park down, anyway?  Are we also supposed to believe that an ancient predator with a reptilian brain will just listen to Chris Pratt, because, reasons?  Are we also supposed to believe that a military dude wants to steal raptors to use them in combat, even though they'd be unarmed and most wars are fought by drones, now, anyway?\r Look, I didn't go into this movie with a bad outlook.   I went into it hoping they might recapture some of the old magic.  But this movie is all about loose plots with no emotional weight, big logical leaps, overdone product placement to the point you feel like you're watching a commercial, and to be completely honest, action scenes that are all special-effect with no exciting tension."
    },
    {
      "rating": "0",
      "text": "This film is garbage: if you want real entertainment, go and spend 124 minutes rooting around in your trash can instead. Might find something usfeul and probably learn more too."
    },
    {
      "rating": "2",
      "text": "Has some fun moments but aside from the tamed raptors and experiment the movie is ultimately stroke for stroke a total rehash of JP with a larger crowd at the park.\r The cast do a passable job, there was some awkward moments between Owen and Claire that where cringe worthy and most of the comedy in my opinion just wasn't funny at all. Vincent D'Onofrio for what little screen time he had was the only stand out performance in the movie and did a great job of what he had to work with.\r Lingering question left from the movie, how does a US Navy seaman end up training Velociraptor in the first place???"
    },
    {
      "rating": "1",
      "text": "What the hell did I watch?\r Alright, first few good things:\rSome scenes look really well.\rA bunch of decent action scenes.\r That's it.\r The movie is basically a collection of plot holes mixed with bad writing and desperate attempts to appeal to broad audiences.\rIt's not even about the dinosaurs. We just have one super-pimped dino that kills everyone and then a final fight where it gets killed. It feels like watching Godzilla, but less enjoyable.\r It's just incredibly stupid. Chris Pratt, you better start appearing in some better movies. This is the second one, after Guardians of the Galaxy, that feels like only complete idiots could enjoy them.\r Don't waste your time and money on that one."
    },
    {
      "rating": "1",
      "text": "Too bad the dinosaurs didn't kill everybody... Unfortunately the writers set the movie up for a sequel... Please don't write another piece of crap like this!"
    },
    {
      "rating": "1",
      "text": "All this movie had going for it was the computer graphics.    Worthless, lacking and meaningless character development.   Disappointing and silly at times...a scene stolen from Hitchcock's \"the Birds\", with pterodactyls this time.  Then, there's the \"bloodhound\" scene, with macho man riding his motorcycle  alongside his on-again-off again friends, the raptors on the hunt.  Corny and a total formula flick---I wanted to like this movie, but  couldn't bring myself to do so.  wade"
    },
    {
      "rating": "2",
      "text": "I think I saw this movie back in 1993. It's a recycled movie. If you have seen the first one, you've seen all of them. They are all about Dinosaurs that break lose. I hope we don't get another..."
    },
    {
      "rating": "2",
      "text": "It was not a film I had expected. The excitement was very little; the screenplay was awful, the 3D effects were not so strong.\rThe music was just tolerable."
    },
    {
      "rating": "1",
      "text": "TL;DR: If you like youtube videos of dinosaurs punching other dinosaurs in the face, this film may entertain you - if you can switch of your logical thinking so you don't go: \"Wait, why ...?\" or \"Wait, what ?\"\rIf you prefer a good story arc, good characters or or at least decently portrayed dinosaurs, you may spend your money better somewhere else.\r After seeing it at XKCD, my expectations weren't high, but my friends wanted to go. Sadly, the film is quite good at expectation limbo.\r Strong points:\r- some good CGI, though often Jurassic Parc looked better and sometimes the movement didn't look like actual animals but more like gummisaurus\r- If you like to watch videos of people in theme parcs, then this is for you; in the first 60 minutes, you have this a lot\r- 1 characters I liked (Omar Sy alias Barry - why didn't he have more screen time than 5 minutes?)\r- I liked the idea of the raptor-whisperer, though it became ridiculous in the last 45 minutes - action feeding on plot, destroying the sense of all former exposition\r Weak points:\r- The musical score - just copy from the first one! Instead 2 min of the original, most of the time mediocre, and sometimes so bad you notice (\"And in the blue corner, Mr. T.S. Reeeeex *fanfare*)\r- The plot is like swiss cheese (admittingly, the original one had some problems too, but often it was at least try to provide a reason and the pathing was so well crafted that one didn't wondered about the actions all the time)\r- Dinosaurs are, literally, terrifying - they don't need to be concrete-breaking, camouflaging, suicidal gremlin-monsters. And though I can accept that a potentially social animal can learn how to use a door handle, but you get a headache when a giant turkey outsmarts 1 manager, 1 animal trainer and 15 security NPCs (ok, the latter nicely grouped together and used essentially pointy sticks = close combat weapons against a 10m dinosaur, I guess they weren't the problem)\r- too many unnecessary (=emotionless) deaths of NPCs and small characters\r- Spoiler: There is not 1, but 4 pathetic endings: one involving Mr Pratt having pink lip gloss, another one dino-dino-human-giant-water-saurier team work, with concluding imaginary hat tipping and fist bumping (it was only not in the movie because T-Rex forelimbs were too short).\r If you want to read other reasons why I consider this one of the worst films I've seen in a while, you may read shadowsfall444, Alan2306, jblac02, ...\r What could have done to make it a decent film even without better dialogue or characters:\r- cut out unnecessary characters (parents, assistant, pig-guy, control room girl...)\r- cut out unnecessary deaths\r- cut out unnecessary side plots\r- copy+paste original score\r- portray dinosaurs with state-of-the-art science (you may make them smarter than a chicken, but give them feathers and don't let a nude eagle lift a cow!)\r- 1 or max 2 endings should be enough (see the original)\r I personally prefer JP3, and if it is only for Sam Neill acting. Would have given it maybe a 3, but some reviews just smelled like payed reviews to me, and I think the 59 critics rating is more to the truth."
    },
    {
      "rating": "3",
      "text": "This movie is bad. It had so much potential, so many great actors, and a huge budget. The director was pretty much a nobody, and it really shows. This movie is lazily written, mostly because the director stepped in to write some of the plot, and it really is horrible. The movie is badly animated, cliche, and just stupid."
    },
    {
      "rating": "1",
      "text": "Imagine the writers of Scooby Doo at work on a Jurassic Park film...  Well imagine no longer, as this is exactly what Jurassic World feels like.  Stupid plots, awful characterisation, terrible humour and all finished off with the worst finale you will ever see.  If the T-Rex had high fived Chris Pratt, I wouldn't have been surprised.  Save your money and wait for the DVD and even then, put your brain in neutral."
    },
    {
      "rating": "0",
      "text": "Es mas divertido leer reviews de la película que verla.\rUn intento de repetir la primera que se quedo en intento.\r P.D: La de tonto que anda suelto...."
    },
    {
      "rating": "0",
      "text": "Worst, is the perfect word for this movie. There is not a single good thing about this movie. From characters, casting, storyline and even special effects, nothing was astonishing accept the earth shattering business it generated. I literally wanted to walk out of theatre 10 minutes from movie started because such lousy dialogues and cinematography made me bored already. There are dozens of loopholes where plot does not make any sense not to mention it hardly offers any thrill or discovery, which dinosaurs are all about. Since it could not develop the characters so it is easy to not expect a good depiction of the monsters. If I had a chance, i would hang the director for ruining this Series for me."
    },
    {
      "rating": "0",
      "text": "I really don't understand the hype with this film. The only reason this movie was half way decent was because the dinosaur action sequences were mildly entertaining and the overall message of the film was actually something interesting enough to think about. Everything else about this movie was terrible. The script was god-awful and full of flaws. The characters had no depth whatsoever and were completely static. There were so many unnecessary subplots that didn't add anything valuable to the story (e.g. the divorce of the parents, and the Pratt's character's romance with the Claire girl). Also, what was the purpose of the older brother constantly ogling at girls throughout the film? I know he's a teen and teens tend to do that but it didn't add ANYTHING to the film and is even more ridiculous considering the film shows at the beginning that he has a girlfriend.\r At least the acting was half way decent. The last 10 minutes was the only thing entertaining. \"Jurassic Park\" is 10x the movie that this will ever be."
    },
    {
      "rating": "0",
      "text": "questo flm è un insulto alla cinematografia io non ho MAI visto una merda del genere dioporc0 ma come cazzo si fa io gli metto 0 perche faceva schifissimo e in 3d è la peggiommerd quindi vedetelo solo se siete torturati"
    },
    {
      "rating": "0",
      "text": "The originals were not great and suffered from some of the worst acting of the 90s (Goldbloom is one of the worst of all time) but they were better than this. Every character in this movie behaved like a high schooler with penis envy. It was boring. Frankly if this were real and humans (especially scientists and such) were this stupid, Id rather we go extinct and let the dinosaurs rule again. Just avoid this movie, you are better off spinning yourself in a chair for entertainment."
    },
    {
      "rating": "5",
      "text": "I really wanted to like this movie....but there are just too many stupid things in the plot that make absolutely no sense.  I am sure you have read in the reviews some of the stupid nonsensical things that happen within this movie, so I will just list a few other things I noticed that I havn't seen other people critisize yet.\r 1.  After the boys are safe again... the aunt is like \"I will never let you into harms way again!  you will be safe!\" or something like that...then she proceeds to put them in the back of a truck and drive them directly into harms way!  She personally takes them into the most dangerous situation currently on the island with the military men to go battle the A-rex!  She could have taken them or had someone take them somewhere much safer on the island, instead she risks their lives by bringing them along to battle the A-rex with a bunch of raptors.  The only reason for this is so that the boys are around when **** continues to hit the fan....just such poor writing.\r 2.  When the flying dinosaurs escape...why the hell would every single one of them go directly to the populated part of the park and start attacking people?!  I am sure they were well fed...in reality they would scatter in all directions and definately would not dedicate their new freedom to hunting and killing humans for no apparant reason.\r 3.  The A-rex talks with the raptors and tells them to attack the humans?  Are you kidding me?!  In about 5 seconds time this A-rex is able to communicate and convince these raptors that he is the alpha male?!  Supposedly this works because the A-rex is like 1-10% raptor.....this is ridiculous.  This is like saying that I can speak to apes or chimpanzees.  Can the A-rex also talk to cuddlefish, snakes, and the other animals it was mad of?  This is so damn stupid...why doesnt the A-rex talk to the T-rex at the end?  It is obviously more part Trex than it is raptor.  Another stupid line in regards to this...PRatt says \"now we know why they didnt tell us what this thing is made of....because its part RAPTOR!\", yea its so secret not because its made of trex, snake, and tons of other dinosaurs....just because its part raptor.\r 4.  Militarizing raptors?  jesus christ.  There is seriously a line like \"Imagine if we had these things in Tora Bora!\".  I dont really need to go into depth on this one....you can already tell how stupid it is.\r 5.  At the end the gigantic aquatic dinosaur jumps out of its enclosure and eat the A-rex!  It lands on the ground where during normal hours guests would be walking!  The designers of the park didnt realize this?!  The one time this aquatic behemoth breaks out of it confined space it just happens to eat the Arex instead of a person?\r These are just a few of the things that popped into my head.  There are tons and tons of similarly retarded instances within this film.  So many plot holes and nonsensical story moments....it is just so stupid!  I mean I thought the part in Lost World where the T-rex was able to eat everyone on a cargo ship was bad....but this is actually worse and there are way more silly and dumb moments.  I really had higher hopes for this movie, especially after seeing the initial reviews.  It isnt horrible, there are some good parts.  But all the plot holes, cliches, and just stupid moments really took me out of the experience...I spent more time laughing at the nonsense in this movie than the actual few jokes."
    },
    {
      "rating": "4",
      "text": "Mediocre monster movie set in a world where military veterans can't hit a 50 ft long target with a minigun and rocket blasts to said 50 ft target don't instantly turn it into crimson jelly.\r While the (extensively used) CG is probably technically impressive and the film looks nice, there is no excuse for how stupid and creepy some of this film is.\r Let's start with the creepy - the pterodactyl torture porn scene where the office assistant lady is picked up off the ground, dropped, caught in mid air, and then dunked in the water some 4-5 times before being eaten by a giant aquatic dinosaur. Disgusting. There was no need for a drawn out death scene for a character who honestly didn't do anything wrong in the movie, this wasn't comeuppance for some evil act, this was just straight up torture fetish filth. Even the big bad guy died in a covered up and nearly off-scene raptor attack. No excuse for this.\r Okay let's get to the stupid, somehow supersaurus mega rex is able to cloak itself visually and from THERMAL cameras (how would it even know those existed come the hell on) and set a trap that fools a dinosaur trainer, it then gets stuck in the door of it's enclosure but rather than being choked out by the door closing mechanism, it manages to smash right through the reinforced concrete and metal gate that had been keeping it inside for how long with little to no effort?\r invinciblesaurus then plods through the park murdering dinosaurs not to eat but to kill kill kill, apparently someone spliced in some of the zodiac killer's genes or something because as far as I know none of the animals they claimed it had genes of were particularly serial-murdery.\r Somehow ultramegasaurus KNOWS WHAT A TRACKING DEVICE IS and RIPS IT OUT OF IT'S OWN FLESH.\r Trained dino-emergency trackers/hunters and their nine zillion tranquilizer rounds have no effect on big nasty megasaur, it shrugs it off and murders everyone in short order, even the guy blasting it in the face with a shotgun which somehow didn't even give it pause. I really don't care how many cuttlefish or frogs you splice something with it will STILL go down to the power of pharmaceuticals.\r When freed from sealed aviary, pterodactyls/pterosaurs or whatever somehow FLEW, not glided from a cliff like you know, they did in real life. They decided instead of scattering like idiot birds would normally do they would immediately head for the humans, how they instantly knew where they were (miles away) was uh, birdosaur magic radar I guess.\r Birdosaurs somehow flying AND lifting full grown adult humans into the air.\r Oh yeah, Birdosaurs seeking out and attacking a noisy helicopter firing a minigun full on, you cannot tell me those animals would not have fled from something making such scary noises.\r An island FULL of angry deadly dinosaurs and only one minigun and chopper, not even a combat chopper but a civilian chopper with a minigun mounted in the door. Clearly we can't afford those with all these dinosaur holograms and genetic disasters we made.\r The aforementioned torture porn scene with the office lady also qualifies for stupid.\r The entire ~trained raptors~ arc, and the evilbadman's stupid plan to use them as weapons, the supermegakillosaur being able to SPEAK RAPTOR and COMMUNICATE WITH THEM and then ORDER THEM TO TURN ON THEIR TRAINER AND ATTACK THE HUMANS. How many super powers does killosaurus drecks have so far? I lost count.\r The raptors put aside their betrayal and help their daddy human man to fight the big bad supersaurus, who beats all four into the dirt while being peppered with rifle rounds by their trainer.\r The T-rex and Raptor TAG TEAM DUO vs mega killosaur. COME ON THE RAPTOR RODE ON THE T-REX'S BACK FFS. Then after the giant crocodile thing eats the super killosaurus for the final blow, the T-rex and raptor exchange nods of approval and bugger off into the night.\r Keep in mind the original movie had a CASCADE OF FAILURES happen to even allow the dinosaurs to ESCAPE in the first place. The storm, Nedry's computer virus, ALL of the dinosaurs getting loose at the same time, the park wasn't even complete or open or fully staffed. In this movie the park has been successful for something like seven years, but this ONE dinosaur they somehow gave superpowers to through the magic of cuttlefish and frog genes totally ruins everything.\r FINAL VERDICT: Avoid this movie unless you can turn your brain off / you live with your brain turned off."
    }
  ]
}