{
  "id": 584,
  "title": "Jurassic World: Fallen Kingdom",
  "starring": [
    "Chris Pratt",
    "Bryce Dallas Howard"
  ],
  "runtime": 129,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction",
    "Thriller"
  ],
  "description": "When the island's dormant volcano begins roaring to life, Owen and Claire mount a campaign to rescue the remaining dinosaurs from this extinction-level event.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/x8cLgs0uXlb9rmpuVIxopoRGnCr.jpg",
  "categories": {
    "plot": 3.875,
    "acting": 4.056603773584905,
    "ending": 3.84,
    "soundtrack": 3.5,
    "cinematography": 3.75,
    "familyFriendly": 4.142857142857143,
    "funny": 3.0,
    "action": 4.470588235294118
  },
  "reviews": [
    {
      "rating": "4",
      "text": "a reign that sinks so deep that it never lifts up..Jurassic World: Fallen KingdomThe camera work is horrifyingly witty and is more appalling than the creatures, sound effects and the tense energy that is created in here and the credit goes to the director whose passion and keen sense of knowledge towards the horror genre that helps hold the audience to their seats through its overlong 2 hours of runtime. The writing is similar to its previous instalment, that is cheesy, sloppy and a bit chalky around the edges, addition to that the urge to create a dramatic or action sequence that is captured from a textbook cinematic formula, makes the whole process redundant especially when the audience sweats through it. One would assume that the format of the structure and the mind-numbing chase sequences would be distracted by the bigger picture and a smarter approach that would redefine the franchise; one is wrong. The upgrade or updated version of the sequel according to the makers in here, is to go big, loud and pure mayhem on as much as large scale possible and not develop the characters and sensibility that gives the gravitas to it. J.A. Bayona; the director, comes as a bit of a shock and disappointing considering the expectation he brought with him, he seems distracted and unsettled on the final vision. The technical aspects such as visual effects are appreciative along with d.o.p. but the editing could have been a lot better. Chris Pratt on hand-to-hand combat is believable and more convincing this time but there's nothing more than that and so is on Bryce Dallas Howard; despite of being such an acclaimed actress. Having said that, the primary reason would be the range and space given to the actors is lesser than usual which can be difficult to pull off. Jurassic World: Fallen Kingdom is a reign that sinks so deep that it never lifts up despite of its twists and turns, which is caused in here by uneven pacing and sloppy writing."
    },
    {
      "rating": "0",
      "text": "Gruesomely bad followup to Jurassic World, full of gaping plot holes, contrived and ridiculous character behavior, and implausible occurrences even within the story's own logic.It has the same problem as Lost World back in the day, that much of the fun of Jurassic Park was always getting a VIP tour of a sprawling corporate theme park, and then watching it get destroyed. Removing the park from the equation drains away a ton of the entertainment value.It's also dumb that this movie expects us to care deeply about the plight of the poor dinosaurs, since they have no lines, no real personalities, and spend a lot of the movie trying to eat the good guys. It's also VERY dumb that they just rehashed the old \"we're gonna make mutant super-dinosaurs and use them as weapons\" thing even though it was the worst part of the last movie. It just underlines that Jurassic Park/World can work well as a standalone movie, but there really isn't enough meat on the bone to justify a franchise.Chris Pratt and Bryce Dallas Howard are pretty decent leads, but the premise of the movie is just too contrived and stupid for them to redeem it. Watch later on Netflix, if at all."
    },
    {
      "rating": "3",
      "text": "Fallen Kingdom was TERRIBLE. One major character has 3 life-changing experiences in the spanse of about a couple of minutes. It takes no time to let the audience process anything that happens. It’s just immediately on to the next scene.OH YEAH! Did you see the trailer and get excited about the T-Rex vs Lion or the Megalodon eating the surfers? Those shots were in an OUTRO MONTAGE. What you saw in the trailer is what you get! There’s nothing more to those scenes. This was one long 2 hour advertisement for JW3, and it SUCKED."
    },
    {
      "rating": "3",
      "text": "They keep making both new mistakes, and old mistakes, and it keeps devolving into worse and worse situations, sequel should be entertaining. I am giving this film a 3 out of 10 for one very big reason... Progressive left has infected this film like a plague. Pro dinosaur rights, save them from extinction despite they would NEVER LIVE IN THE WILD, IN TODAYS CLIMATE/WORLD!!!!!!!!!! On top of that, there are two characters that SHOULD NOT come back for the sequel. The first is Zia, an overbearing, in your face, feminazi who wont let you forget it. The second is a scared, panzy IT guy named Franklin. Think Otacon from metal gear solid but twice the panzy. I am not OK with social political agendas in movies or tv, especially the progressive left pandering to their SJW/feminazi audience. It has no place in movies, outside of documentaries, instantly 5 points off for this element. This element takes up the first thirty to fourty minutes of the movie. Additionally, both Chris Pratts and Bryce Howards characters grew a bit, and learned a lot of lessons as the movie progressed... but the IT and feminazi learned nothing... at all... they were just annoying the entire damn way through.... allthough the IT guy did gave me a good chuckle here and there. I would have given the movie an 8 out of 10, if not for the progressive left infestation that plagues this movie."
    },
    {
      "rating": "6",
      "text": "They seem to always follow up a good entry in this franchise with a very ordinary one.Maybe they just thought they'd save money by re-using all the props and dino footage and cut down the cast to save money.The plot is really weak as most doesn't make any sense at all.The concept of using dinos as army weapons is ridiculous as they are really expensive and can be killed and tranq'ed without a lot of effort. Why Bryce's character all of a sudden is all weepy over them is a mystery as well to me. In the first film she thought they were just zoo animals.Pratt and Bryce Dallas Howard look like they're just slumming to get a paycheck with Howard looking strangely different from the first film but wearing exactly the same clothes. The villains are just bean counters except for the  guy who played the baddie in Silence of the Lambs who is pretty amusing  but none are very scary. The scooby doo gang girl and boy they took along to the island were lame.The boy especially was grating .The ending sets up any number of possibilities for the future episodes although i can't see Pratt and Howard being in it.Special effects were ok same as usual .The 3d was a waste of time as it was not noticeable .I give this a 6 because i love monster films in any version."
    },
    {
      "rating": "4",
      "text": "Pros:Did slightly better than the first Jurassic World,The first half was really good,it had better direction.Cons:Still being a mediocre film at best,the first 30-40 minutes of this movie was really solid,it was tbh quite good and then the film stopped,and was leading up to ...NOTHING.It was like the first half and second half of this movie felt like two completely different movies.Moreover,there was no character development in this film,there was one character which was supposed to be comic relief,but it is NOT Funny at all and so frustrating,this guy unfortunately showed up a lot,which killed all the tensions and the suspense of the film,he was essentially Jar Jar of this film.There are some exciting scenes but make no sense,the entire last half makes no sense.If this film was meant to be\"Turn off your brain\" kind of film,why did they need to make so many exposition scenes and subplots?.The Ending was facepalmOverall,this film was a bloated mess,there is nothing to really show here,bc the trailer showed basically 90% of this film.Tbh I like Jurassic World more than this,eventhough I didnt like that movie,but at least it was more coherent,it knew where it was going.But this film,beside a more superior direction,it felt like \"we really need to make Jurassic World 3\""
    },
    {
      "rating": "6",
      "text": "This gets a 6 from me purely because I like dinosaur movies. I'm a child. Leave me alone. As for the plot, look out for all those holes!! It's never explained why Claire went from viewing dinosaurs as things to becoming an activist for their protection. You would think she would end up hating them after she barely survived them getting loose in the first one. What was that weird moment between the little girl and Blue at the end? Who else kept calling that one villain \"Buffalo Bill\" in their heads?"
    },
    {
      "rating": "4",
      "text": "I think this movie is a joke, trying to impress but i'm not impressed, except by the cgi. Not much better than the first Jurassic World"
    },
    {
      "rating": "4",
      "text": "This movie suffers from the same symptoms all Universal Picture franchises suffer from: the focus turns not to creating a story that anyone will ever actually care about or relate to, but instead to try to crush as much action and epic SVFX shots into 2 hours as possible. It's honestly just disappointing, because for a movie that has made as much $$ as Jurassic World has, I really just wish the direction would have been focused on actually making the plot enjoyable and make sense. Everything that happens on the island was pretty great, but I wish the film would have only taken place on the island. I would have rather the volcanic eruption + dinosaur stampede + escape off the island would have been the act 3 climax. Instead, it happens within 10 minutes of being on the island. And, our third act climax is a stupid monster that's not really a monster, that honestly is not as scary or epic as a volcano. The acting, as always, was decent considering the material the actors were forced to work with. Then, to add, the film ends depicting a cloned human that releases dinosaurs into the public as, \"a hero.\" She's not though; this scene and action is so morally corrupt it's hilarious that the filmmakers are trying so hard to say she's a hero. Or that anyone should consider the dinosaurs to be, \"animals.\" Only person who has it right is Jeff Goldblum, who--right from the start--knew the best thing for everyone would just be to let the volcano kill all the dinosaurs. Nope! This is a corporate franchise money cow! So we HAVE to let the dinosaurs live on, because more movies! It's like watching someone continuously shoot themselves in the foot, and then try to get people to understand and continue to let them shoot themselves in the foot while also trying to get those people to feel bad for the bullets they're using. It doesn't make any sense!It's a hardcore money-grab film only. It sucks, in other words."
    },
    {
      "rating": "5",
      "text": "I went in with low expectations, and still came out disappointed. The movie is very mediocre. I was pretty bored throughout the movie, because I didn't feel any excitement and suspense from it. You have some really dumb characters making stupid decisions in this boring movie. Nothing really memorable with the soundtrack as well...Visually the movie looks pretty good, but it's not enough to give it a passing score."
    },
    {
      "rating": "4",
      "text": "Más de lo mismo. Buena para un momento hilarante si tu interés es burlarte de sus despropósitos."
    },
    {
      "rating": "5",
      "text": "Jurassic World: Fallen Kingdom is worthy of it's name, as all it does is fall incredibly short in comparison to the mighty dinosaur kingdom created by Spielberg. What was once a series built on the backdrop of powerful and intelligent themes and ideas, Jurassic Park is now nothing more than a 2 hour long complaint over animal rights. While its forced agenda is bad enough, every plot point and character decision is as predictable as it comes, not to mention the introduction of a few of the most annoying characters to be displayed on screen. While the effects, action sequences and sound design are worthy of the series' name, the true essence of what made Jurassic Park such a powerful piece of pop-culture is truly missing in this film."
    },
    {
      "rating": "3",
      "text": "Short story. It's not as entertaining as Jurassic World and a lot of the ideas that the film tries fall flat. If you're looking for a film that you can watch mindless that's just dumb fun, then I'd suggest it, but I'd avoid going to see it in theaters.The cinematography had a lot of going for it at multiple points during this film. Though through the overuse of some of the most effective techniques they end up creating a film that slowly becomes less and less visually astounding until I was happy to leave the theater at the end. It starts out at a solid 8/10 in the cinematography/animation area but slowly lowers to about a 4/10. That said, the animation for most of the larger dinosaurs is done with the proper weight.The music is pretty standard. Though when you compare modern-day composers to John Williams' score on the original film then you're going to find a fairly mediocre performance.The writing is probably the worst part of the film. I can't go too far into it without spoiling the film. But the film is so predictable that the 5-year-old sitting behind me felt proud of himself because he knew what was going to happen next. The villains are either corrupt mercenaries or corrupt businessmen and the writers didn't really seem to want to pay too much attention to them as characters, instead opting to create an expendable character whose sole purpose is to be hated by both the film viewers and the characters in the film. There's also a lot of forced emotion in a few scenes that would only really affect a young child or an overly emotional teenager. It's basically baby's first action film, but at the same time, the film is much too violent for any child under the age of 11. At that point, they've already consumed better fiction through Netflix with shows like Voltron: Legendary Defenders or, heck, the first Jurassic World film."
    },
    {
      "rating": "5",
      "text": "First half of the movie is fun & entertaining even though you know they get off the island. The disappointment comes in the second half. Everything that was important to the story line seemed rushed. For example, how do you gloss over the fact that girl is a clone. Also, pterodactyls in Vegas? If you really like dinosaurs, go see it. If you're expecting more substance, I would wait a little while."
    },
    {
      "rating": "6",
      "text": "From a person who grew up loving Dinosaurs and seeing all the Jurassic park movies, this movie felt average to me.  Maybe it is because it is the 6th installment, but it just felt lackluster and missing some of the magic of the other films.  I thought the movie was enjoyable, but a forgettable installment.    What worked very well in the original Jurassic park film was the feeling of helplessness that the human’s characters had compared to the dinosaurs. There was an overwhelming sense of dread when being hunted by the carnivores.  This movie did try to capture some of those tense moments, and some scenes did pay off.  The true issue is that the constant tonal shifts between action and thriller made diminished those scenes that were meant to be scary.    Overall if you are a fan of the films then it might benefit you to see it in theater with the big screen format and nice surround sound audio.  Personally if you are on the fence, I would wait until home video to rent."
    },
    {
      "rating": "6",
      "text": "Not a good movie at all. Ok at best. Definitely worse than Jurassic World. The storyline is also a bit bland and unexciting. Overall, a movie that seemed to show promise, but will disappoint."
    },
    {
      "rating": "5",
      "text": "“These creatures were here before us. And if we're not careful... they're going to be here after. Life cannot be contained. Life breaks free. Life... finds a way. Welcome... to Jurassic World.”Jurassic World: Fallen Kingdom takes place three years after the events of the first movie. The left remaining dinosaurs are left on the island as a volcano erupts. As the advertisements put it, “The park is gone”. All of this only raises one question: Why would you put a family theme park next to an active volcano with dinosaurs?Anywhere...After the monster success of “Jurassic World” a sequel was certain to happen and will find new ways to bring these extinct animals back onto the big screens. While I enjoyed the first movie a lot, but nowhere near as good compared to Jurassic Park. Had its moments overall, just not Spielberg level good.We have a new director J.A. Bayona, with Colin Trevorrow only writing this time. Bayona is best known for horror and supernatural tragics, so I was interested for what he will bring to this new franchise. He dose bring a lot those elements into scenes where tension actually worked this time around. You can see the influence to older movies like “Nosferatu” and the golden age of monster movies into play. I must admit, the cinematography is visually stunning and makes the dinosaurs look terrifying. Unfortunately, all of this gets watered down by a terrible script, convenient situations, and the final result is Hollywood fluff.The visual effects, (for the most part) looked really good and never takes you out of the movie when interacting around non-digital setting/people. I noticed some animatronics dinosaurs, but can easily get overshadowed by the heavy CGI. When I said “for the most part”, there are some shots were it looked a bit noticeable. Other than that, the visual effects are the strongest element to the film.Chris Pratt and Bryce Dallas Howard ain't brilliant in terms of acting, but at least have great chemistry. If look at any interviews or press event, the two get along so well it easily shows on screen. The biggest change in terms of character is Bryce Dallas Howard, who’s not as idiotic like the first. While both characters aren't great, as some questionable decisions are made, although slightly better compared to the first. Although their motivations for saving the dinosaurs only makes you agree with Ian Malcolm (Goldblum) even more.The film introduces new characters played by Justice Smith and Daniella Pineda, who tag along with are main characters. One of them can access and hack into anything, but he’s a afraid of pretty much everything - the drop of a penny can startle him, probably thinks it’s a T.Rex. Also his screaming can go right through you. The other takes care of Blue after being badly injured and that’s really it. Both of them didn't do much for me. Half way through the movie you forgot about them, because they literally disappear from the film and later come back in the third act.The movie is, at the very least, self aware of itself. Evidently by Chris Pratt’s character before agreeing to go on a mission ironically states “What could go wrong” when things go wrong. Giving small winks to the audiences when the obvious is gonna happen. With the endless amount of stupid decisions on top of more stupid decisions to push the plot along - Which I guess if every character had a brain, this movie wouldn't exist, then again it wouldn't be a great loss.Speaking of idiots, let's talk about the villains. I’m not gonna beat around the bush when I say this, but these are some of the most cartoonist villains I've seen in awhile. It’s pathetic how tedious they are. You wanna know they evil plan and goal? Guess, just guess:Yep it’s money - Easily one of the worst.If you’re looking forward for Jeff Goldblum’s return to the series and what role he will have on the story, just from the promotional material alone; well I got some bad news for you. He’s only in two scenes and the total screen time is one minute. All of it is courtroom debates. His character adds nothing to the film, just recycles dialogue from the previous films. What a waste of Goldblum.Overall rating: While coming off as negative towards the film, it’s not bad or painfully to watch. I mean, it’s stupid fun. The ideas are present in ‘Fallen Kingdom’ for what it’s trying to set up or be, just needs a sharper execution. For those wondering about the third movie, don’t worry...The studios will find a way."
    },
    {
      "rating": "5",
      "text": "Agree with the majority here. Mediocre, fine film. A bit boring there, a bit dumb here, fun overall and forgettable"
    },
    {
      "rating": "6",
      "text": "This movie is entertaining, but not great. The villains are generic, there's too many subplots to care about, some of the scenes drag on for a little too long, but I still found some enjoyment out of the dinosaurs as usual. I still stand by the original 1993 Jurassic Park being the only good film in the franchise."
    },
    {
      "rating": "5",
      "text": "Jurassic World Fallen Kingdom's biggest praise is that it rivals tension in its action scenes, almost as much as the first Jurassic Park.  The visual effects and use of animatronics is handled really well making you feel more connected and convinced that the dinosaurs seem real. Chris Pratt and Bryce Dallas Howard are good in the movie and it feels like their characters have more to do.  However basically every supporting character sucks.  Their even worse then they are in the first one.  Many will leave this film feeling very unsatisfied because it feels like a part one to a two part film.  Characters make some very dumb decisions making you lose any support for them.  The villains follow the very simple go to villain goal and that's to make money so they can become powerful. Several strong elements in this movie, particularly the opening act feel rushed and we soon enter a very boring second act that doesn't offer us anything to grab attention to.  The final act is fun and mildly entertaining, but it tries to take the movie into a different direction to set it up for a sequel in a very cliche way.  There are some surprising twists but they feel like their forced in their just for the sake of it as they dont better benefit or intrigue the plot.  This was a disappointing movie, its not bad but could have been a lot better."
    },
    {
      "rating": "0",
      "text": "How to destroy a legacy. The whole **** movie is just: \"Oh no something happened and i need to stare 2h now instead of act or run away\"I dont know what te **** the person smoked who wrote this but basically its Jurassic Park II in garbage. I literly can not think of a worse way to write it."
    },
    {
      "rating": "5",
      "text": "I definitely think that Jurassic World was a much better film than this. The first film was thrilling throughout with the Indominus Rex terrorizing from pretty much the beginning of the film. This film, however, does not do the same. The trailers make out the Indoraptor to be the most dangerous dinosaur on the planet, yet it appears in the film for about 5-10 minutes and only towards the end, where it fails to get one little girl and is defeated in a pretty underwhelming way by the velociraptor. Yep, it gets killed by Blue. You’d figure that would be the end of the movie, but nope, there was still another 10-15 minutes after that, with the dinosaur the being released out into the world by the humans. While it may seem touching that they let the most free, it was really a stupid choice as now they’ll wreak havoc. So having all of this after the whole indoraptor fiasco makes it very un memorable as you forget that it was even on screen. It’s a shame too. The first half of the film was terrific, with the people saving the dinosaurs as the volcano explodes behind them, and a very emotional dinosaur death scene that really get s to you. It makes you think the rest of the film will be the same, but that’s not the case. The second half is more or less a setup to the third film, rather than being it’s own original film. So yeah, I’m pretty disappointed in the film, but the first half atleast keeps me from giving the film a lower score."
    },
    {
      "rating": "6",
      "text": "i was in the movie theater watching this, and the movie was great and had a great cast. Chris Pratt was exceptionally fantastic in this movie. He should get a lot more praise in movies, looking at his role in this great movie, but there is always a downside. I't didn't make sense how the dinosaurs acted, they were too obedient and the scene where Blue would protect Chris Pratt's character didn't make a lot of sense to me. Most dinosaur's are supposed to the scary and hostile towards mostly everything, except vegetarian Dinosaurs. I would rate this movie an above average."
    },
    {
      "rating": "4",
      "text": "I made an account just to review this film. Its bland. The story is weak. Nothing to be amazed about. As watching the film you can tell what will happen next. Its like a cliche. Sure the fight scenes were fun and action packed. But the story really is a let down. There was a surpisd that caught me. And what was really disappointing was that in the trailer it made it set that the dinosaurs where gonna attack the public. But those scenes in the trailer were only snippets. I hope there isn't a third installment that it just ends here please. The film was a so-so."
    },
    {
      "rating": "6",
      "text": "5.9/10 ⚠️Easily the most dissapointing 2018 film, although, it is a solid follow up to 2015, Jurassic World. Dumb, fun movie, yet again… The first half was completely outstanding! The opening scene was incredible! And there is a very emotional scene, especially for the fans. On the dock, when they look back and see the original brachiosaur, standing there, crying out in pain. I got really emotional but other than that, the opening and just the first half overall, not a great film."
    },
    {
      "rating": "2",
      "text": "While this isn’t the worst movie I saw this year, it is by far the most disappointing. I’m not even comparing it to the original Jurassic Park, no Jurassic sequel could be as awesome as that! No, this movie absolutely pales in comparison to the last movie, Jurassic World! While that movie had a pretty weak story and characters, the action was absolutely thrilling and I regularly rewatch it for that alone. It’s tied with Star Wars: The Force Awakens for my favourite movie of 2015. Fallen Kingdom didn’t have any of that. What little character the first movie had was gone, replaced with cartoon characters with exaggerated and over-the-top personalities, and it was much tamer in comparison. Most of the movie is set in a house and there’s only one dinosaur on the loose! What kind of Jurassic movie is that? That’s like something someone would make up as a joke, making fun of movie series that have clearly run out of ideas! Also, out of all the subplots in Jurassic World to follow up on, why did they choose the weaponized dinosaurs? That was by far the weakest aspect of Jurassic World! It’s stupid and makes absolutely no sense! There’s a lot of that in this movie, it feels like a Saturday morning cartoon! I have to say though, the ending was pretty awesome. I wish I didn’t see literally all of it in the trailers. I’m looking forward to Jurassic World 3, it has a very interesting setup that really makes me wonder why they didn’t just make that movie instead. They could’ve easily skipped over this movie and made the next movie this movie! Anyway, as you can tell, I really didn’t like this one. I don’t recommend it, even if you do like the other Jurassic movies."
    },
    {
      "rating": "1",
      "text": "Please NO MORE, no more Jurassic sequels, please let this be the last......."
    },
    {
      "rating": "0",
      "text": "Terrible blockbuster movie that have you rooting for the dinosaurs and hoping the humans will die off."
    },
    {
      "rating": "6",
      "text": "Jurassic World Fallen Kingdom is a mediocre sequel with lackluster plot which goes nowhere with terrible pacing and bland characters. The movie is a well directed and visually stunning but apart from that the movie has nothing new to offer and the mixing of a disaster style and a horror claustrophobic style made things worse."
    },
    {
      "rating": "3",
      "text": "JW:FK is a disappointment on several levels. The second and third acts in particular feel more like a relentless aural and visual assault than cohesive story-telling. The script is barely there, so the performances are barely there, and all of it is in service of cramming in as much implausible dinosaur mayhem as possible in what feels like an interminable run time of two or three days.Like all of the JP sequels, to the extent JW:FK has a plot and characters, they're all plug-and-play versions of the original. The kids in danger, check. The Great White Hunter, check, the moral lesson (don't mess with Mother Nature), check, the spunky but terrified computer whiz, the secret plan to make military dinosaurs... I guess to replace the less lethal sharks, lions and bears that currently form a large part of our armed force...check. And in the end there's the obligatory T Rex roar signalling the accounting department at Universal to immediately begin funding another sequel, to be directed by a guy with a **** YouTube channel.And disregard the trailer entirely. That's not the film you're getting.Wait for this one on Amazon or Redbox. It'll be there fairly soon, and it's probably a fun toss-away and you can play around on your phone during the dumb parts. Tip: Charge the battery fully."
    },
    {
      "rating": "4",
      "text": "I loved JURASSIC WORLD but this was a major letdown. The direction is fine but script is awful, full of cringe attempt at humor and plot conviences. Just a waste of talent."
    },
    {
      "rating": "0",
      "text": "They finally jumped the megalodon with this franchise.  This movie assaulted you with moments that even with an elementary level knowledge of things like blood would make no sense. The first chunk of this movie was a play by play duplicate of The Lost World, had idiotic things happen like lava falling on a dinos head and he just shook it off like it was hot water.The ending of movie goes so far into la la land that by the end \"twist\" your eyes will roll so far in the back of your head you will be able to watch your brain rot.It will take one hell of a movie to be unleashed upon the Earth to take this movie's spot as my number one Worst movie of 2018."
    },
    {
      "rating": "3",
      "text": "The most dumbest movie this year. Whoever make this film probably think audiences are stupid and EZ to fool that why no need to invest in the plot. So many plot holes that made me cringe the whole film .  Yeah let use blood blood transfusion in 2 difference pieces it will work. There never a movie make me want to leave the theater entire show. Congratulation Jurassic 3 you not the worst Jurassic park any more"
    },
    {
      "rating": "6",
      "text": "Pretty much your standard big blockbuster film. It's the same relatively safe mix of humor, action, spectacle, and some cashing in on our nostalgia that's been popularized by modern superhero flicks. Unlike it's peers however, Fallen Kingdom lacks the lovable characters that make us sit on the edge of our seats during the bigger set pieces even though we know they aren't actually in any real danger. Pratt and Howard return in the lead roles and they are just as bland as ever. Justice Smith is nothing more than comic relief as all he's given to do is freak out and scream anytime something happens. Daniella Pineda is barely in the movie at all.The dinosaurs are the real stars. Not only is the velociraptor \"Blue\" better written than any of her human counterparts, but I was surprised to find that these prehistoric beasts are also capable of invoking an actual emotional response from the audience. I'm not lying when I say that there's a scene involving a Brachiosaurus at the end of the movie's explosive first act that almost killed me. Initially I supported the idea of leaving them on the island to die as they are dangerous animals that already went extinct once. Something changed in me upon actually seeing it happen. The movie could have used this to say something incredibly poignant, but just doesn't. Although I'm fairly certain it thinks it does.Director J.A. Bayona got his start with the well-received, Guillermo del Toro produced \"The Orphanage\" and that influence can definitely be felt here. There are times where he shot this like a straight up horror film. Particularly whenever the new hybrid dino is onscreen. It's probably my favorite aspect of the movie. I want to make it very clear that none of Fallen Kingdom's issues have anything to do with Bayona's directing. They all stem from Trevorrow and Connolly's script. The duo were able to come up with plenty of exciting scenarios. They just weren't able to fill them with interesting people.I absolutely love the way the movie ended. It sets the sequel up to go in an incredible new direction and I really hope they just go full dinosaur apocalypse on us. No matter what they choose to do though these characters will need to be reworked. They were able to get away with the underdevelopment of the protagonists last time thanks to the sheer excitement of the series being revived, but Fallen Kingdom has really suffered because of it. This is still a fun time at the theater, but it's also the Jurassic film with the least amount of substance thus far."
    },
    {
      "rating": "3",
      "text": "The amazing visuals don't distract anyone on the very poor story and weak script.Every character except for Owen, and maybe Claire are complete disaster, there was nothing i liked about any of them. And even so, Owen gets no development whatsoever, he is completely untouched from start to end of the movie. Claire gets some attention and changes, but nothing to big to make it great.The script was all over the place, decisions from characters that didn't make sense or are stupid.The villains are your basic, cartoonish, mustache twirling villains that are just doing it for the money. The \"using dinosaurs as weapons\" thing is touched once again, even though it was never a good idea from the start.The movie turns into a horror movie, but instead of a haunted house, or a \"monster\" there was a dinosaur.With all that being said, the visuals were outstanding.But Jurassic World: Fallen Kingdom falls flat on script, character development, poor villain and really didn't have a clear identity as a movie"
    },
    {
      "rating": "6",
      "text": "Sloppy. Not as entertaining as the 2015 one. The dinosaurs in this one are almost harmless."
    },
    {
      "rating": "2",
      "text": "Worst Jurassic movie i ever saw. . .action was good but story **** and suckz, they destroy  humanity for the Dinosaur?? are u kidding me!!! this is just a 1 point but so many point that make this movie worst. . .enough, no more talking about this ****. . ."
    },
    {
      "rating": "4",
      "text": "Who knew there would be a Jurassic Park/World movie that would sink lower than The Lost World. Jurassic Park or World or whatever we’re supposed to be calling it now is a franchise that has long since run out of ideas, overstayed its welcome and needs to stop. Follows the formula of the original Jurassic Park trilogy where the second movie sees the need to move the dinosaurs off the Island and to a much more populated area. Jurassic World was pretty much the first movie remade but with the new feature of the Indominus Rex. A genetically modified dinosaur that was better than all the other dinosaurs, the ultimate predator etc. This ridiculous addition showed that they had run out of ideas but most of us didn’t care. It was packed full of nostalgia, and was enjoyable in the moment. Unfortunately it made so much darn money they just had to make a follow-up, but not just a follow up, Jurassic World: Fallen Kingdom is just the second movie in a possible new trilogy. So whether you like it or not we’re getting even more dinosaurs, ooh goody I can’t wait to see what scary dinosaur they manage to cook up in that lab, again.Four years since the park was destroyed and now the dinosaurs are at risk of another extinction because that really expensive park was built on an Island that now has an active volcano and raises the ethical dilemma of whether these creatures should be saved at all. Owen (Chris Pratt) and Claire (Bryce Dallas Howard) are back on an expedition to rescue the dinosaurs. But they’re also competing with all those military guys who see the potential for using dinosaurs as weapons. This was hinted at in the first Jurassic World and is very much the tone of this film so get ready to be bored as more shots of DNA vials in briefcases and new genetically modified dinosaurs getting out of their enclosures happens again and again. We’ve seen this all before only now it just seems cheap. The attempts at humour was cringeworthy, the story so predictable if you’ve seen the trailer then you’ve seen the film. Despite the promising opening scene it all went downhill from there and just kept falling. I wasn’t expecting a masterpiece by any means but I really wanted this to be so much better. There’s no wow factor, no scene that will have you on the edge of your seat. It’s disheartening to see such a bad Jurassic World movie, please make it stop before it gets any worse. I wouldn’t recommend this to a die-hard Jurassic Park fan because it barely resembles it anymore but if you’re in desperate need of a mindless popcorn flick then lower the expectations and have fun."
    },
    {
      "rating": "4",
      "text": "Maybe I'm old and jaded, but I thought this film was pretty stupid. I mean I saw the reviews and knew it was more popcorn flick then masterpiece (like the first Jurassic Park, and about half of the second one was). My biggest complaint is the dinosaurs. I really liked when the carnivores got the horror movie villian treatment with the lighting. I didn't like how they acted like horror movie villians the rest of the time. They're supposed to be acting like animals. I can't think of a single animal that stops for a snack when it is running for its life. They way most of the animals acted screamed \"plot convenience\" rather than \"this is how any creature wih some sense of self preservation would act.\" Everything all the humans did in the film was catastrophically stupid and illogical. The only exception is the little girl, well except for that one scene where she attempted to hide from the dangerous predator in her bed. Until that point, she was pretty good. Most of the film I found to be a poorly thought out mess. The CG looked good at least. Fun bonus fact. If a human gets hit with a dart meant to take down something rhino sized and up, the next step should be getting stabbed with a needle of the antidote, before they OD and die. Not in this film though. Magic knockout darts for all!"
    },
    {
      "rating": "4",
      "text": "There are aspects of this film to really admire, but the second half and finally the ending sink this ship. I like the first Jurassic World and I like director J.A. Bayona who directed my favorite film of 2016 (A Monster Calls), and throughout parts of this film you can see his visual flare and talent shine. The problem comes from an absurd script and a pay off that will leave you dumb founded. Overall sadly this is more bad than good and that ending is a mess, a middle 4. C-"
    },
    {
      "rating": "6",
      "text": "The plot (as predictable as it is) really isn't important. When a massive volcano erupts, Chris Pratt and Bryce Dallas Howard set out to save the dinosaurs from extinction…again. Of course, nefarious forces are out to make a profit. This follows the typical formula: almost non-stop action with people in peril, rescues from unrealistic situations, a child in danger and Pratt's comic charm. There's plenty of outrunning trouble and plenty of PG-13 rated violence. Nothing new here, but the dizzying chases and ample dinos keep it from ever being boring (even though you may roll your eyes at some of the over the top moments)."
    },
    {
      "rating": "2",
      "text": "Imagine the worst Transformers movie. It's still better than this. They've torn the soul right out of the Jurassic Park franchise. It feels like a bad Michael Bay film with BAD ACTING and cliche characters and dialogue. If you like seeing explosions and CGI dino fights, this is for you. If you enjoyed Jurassic Park, you'll want to turn it off very quickly. Sad to see this happen to such a beloved franchise."
    },
    {
      "rating": "6",
      "text": "Jurassic World: Fallen Kingdom is the 5th Jurassic Park movie and the second in the Jurassic World line. The film is directed by J.A. Bayona best known for his work on A Monster Calls. This film is about the main characters from the first Jurassic World trying to save the dinosaurs from going back into extinction, but an evil business man has other ideas for these massive lizards including a plan to create another man made dino, because that turned out so well the first time. I thought the first Jurassic  World was fun and enjoyable so I wasn't shocked when it was announced that there was going to be another one. This movie isn't as fun as the first but it's still an all round good film. The scenes on the island are well done, they're brightly lit and full of that wonder that we have come to expect from these Jurassic movies. The third act is suspenseful and action pact. The film unfortunately does have it's fair share problems. The first one being that it focuses a little too much on the morality of concepts that the story presents. This wouldn't be a problem if the was as serious as the problems it presents, but since the film is the latest in line of film that are all supposed to fun action adventures it just comes off as out of place. I mean you do have to glance at the moral questions your concept provides  but you shouldn't be making them front and center for the majority of the film. Second the film as a twist in the third act that is unnecessary and barely ties in to the rest of the film. The third problem is that the big bad dino in this film isn't nearly terrifying as the one from first film, in the sense that first was designed to be the perfect killing machine one that could blend with an surroundings and out outwit most humans, but this one does none of those things which leads to a climax that feels lackluster at best. Making me fell like this film is a step back words from the first one. My final Problem is that it feels like no one learned anything from the last film. I mean why would think making another smart dino would be could idea after the first went berserk? Of course that's not to say that this film isn't bad by any meaning of the word. The characters in this film are all fantastic. Chris Pratt and Bryce Dallas Howard both return with there characters from the last film and enjoyable as always, and the new side characters are both fun. Plus the scenes on the island are amazing. In conclusion If your liked the first film then you like this one, just don't expect it to be as good as the first one."
    },
    {
      "rating": "2",
      "text": "Explosions and screeching interrupted by ham-fisted exposition and studio virtue signaling. also dinosaurs"
    },
    {
      "rating": "3",
      "text": "*Talks like a robot* Alright,here we are,Jurassic World Fallen Kingdom. *End of robot voice*Out of all the movies of 2018,this was one I was the least excited,not because of the franchise (I loved Jurassic Park,while the first Jurassic World was “Whatever”),but because of Universal’s horrible trackline of sequels that makes Disney’s trackline seem like something a kid really wants to see no matter what (wait a second…)But,hearing its direction by Juan Antonio Bayona made me a tiny little bit interested (if you have seen The Impossible, you'll get it),as well as the fact that 50% of the movie was practical effects.And coming out of it,it's a visually stunning movie filled with a great production….That ends up on one of the most laughable,angry (and lazy as hell) stories I've ever seen on screen. Maybe I'll add a Spoiler Warning here,but who knows…The movie starts out fine,on a road where it's like “Okay,maybe the dark imagery and scenes aren't really necessary (since in a JP movie,you only need it when it's necessary) ,but let's see where this goes”,then,after the 50/57 minute mark,after Isla Nublar exploded and bursted out in flames,the story takes a HARD turn (I mean it),full of stupid choices and the one scene that will always make me think “It's going to happen. These sons of TNTs are actually Creeping doing it!”.Before the big,boring 3rd Act/Chase Sequence thing starts, we're shown these new Dinosaur Hybrids,one being the Indoraptor,which is the Dino Villain of the movie,and these hybrids are being sent throughout the world. As the studio thinks “Oh,relax! They'll be excited for this new universe!” I was sitting there,thinking about my consumption of time with this “movie”,saying to myself in my head “Holy guacamole. Aside from maybe being harsh on Batman V Superman and TASM2,from now on,every studio will probably miss the point of 'just having fun and escaping reality for some hours’”.What I'm trying to say is that,by the time the 3rd act goes,it's basically a trailer for the third movie (or worse,a JURASSIC UNIVERSE),that has no meaning to the story aside from “give us the next sack of money” or “more Jurassic movies! Excited?”,it gives nothing to the plot. The movie clocks at 128 minutes and sometimes it feels like a snooze-fest with all of its exposition dump (more so than Geostorm). However,the saddest/most disappointing part of this juggled mess is the production involved with it. The Visual Effects are cool to look at (especially the Animatronic Dinos),the music by Michael Giacchino was fine for the most part since the soundtrack was just “Generic Horror Music” or “Generic Jurassic Park Action Music”,and some of the cinematography was interesting (like the shot of the T-Rex biting the helicopter's ladder where a man has to climb up) and only one Sound Effect was questionable to me only… Why the hell did they low down the T-Rex’s “Roar” from the first trailer? Whenever I heard it in the first trailer in an IMAX theatre,it was great to listen to because it had that ultimate Bass Effect that would usually rumble a theater,especially an IMAX one. In the final movie,it comes out as big (sure),but mostly noisy. All in all,Jurassic World Fallen Kingdom feels like an interesting idea that is production-wise dazzling,but story and screenplay-wise,it comes up as a tragically sad mess. Here's to a 1000 other of these movies in the next decade,amirite guys?!? :-D"
    },
    {
      "rating": "3",
      "text": "Just an utterly boring film where every scene is far longer than it needs to be, characters are 1-dimensional and uninteresting archetypes, and dialogue is poorly written. Only positives are that acting is passable and CGI is decent"
    },
    {
      "rating": "6",
      "text": "Jurassic World: Fallen Kingdom I felt did not have the best of story, in fact, I completely despised the beginning. Really, it is a meh movie. If you are Jurassic Park/World fan, I'd recommend, however, wouldn't really recommend. I really only had empathy for the Dinosaurs on the island as I felt pretty sad during that moment. SPOILER: IT'S WHEN THE ISLAND IS COVERED IN SMOKE"
    },
    {
      "rating": "1",
      "text": "This review contains spoilers.Fallen Kingdom, one of the worst movies of 2018. Jurassic World (2015) tied everything up and there was nothing left to answer, but since the movie made a lot of money here we are, with a sequel that nobody asked for.The plot is ridiculous. Basically, a group of activists want to save the Dinosaurs from extinction because the island's volcano is about to erupt. The thing is, throughout the movie it is clear that these activists only really care about the dinosaurs, and they have absolutely no problem with destroying entire ecosystems and innocent people's lives in order to save the dinos. Every single one of the \"heroes\" should be charged with murder, genocide and crimes against the balance of nature.The characters lack substance. Owen is the only character that attempts to try something, while the rest just sit and watch. Claire behaves like a high schooler and does absolutely nothing of impact. The black guy is in the comedy relief role, except that he's not funny at all and is a burden to the rest of the crew as they continually save him from danger. The woman with the glasses is just as cringy and irrelevant as the black guy.Regarding the villains, I'm sick and tired of them always meeting the same demise. Apparently there's no trial, no punishment other than being eaten alive for whatever sin they committed. There's also a group of wealthy people who participate in the auction of the dinos and are portrayed as evil, but why? These people would provide shelter and protection to whatever dino they bought, why is it so bad that they pay for them? It's apparently a better idea to set them loose so that they destabilize the ecosystems, not to mention the thousands of people that will die as a result of that decision. The main characters care a lot more about the dinos than they do about human beings and the animal species that WILL be replaced by the dinos.The director makes use of ridiculous events every time because he can't think of better ways to push the plot in a rational way. This can't be a Sci-Fi movie, it's borderline fantasy. I can't mention all of them, anyone watching the movie will be able to tell the lunacy going on. By the end of the movie, their conclusion is that humans will have to learn to coexist with the dinos...Excuse me? Those abominations will devour everything in their way, both herbivorous and carnivorous ones, they can't be allowed to roam free. Just put them back in cages or kill them. This movie is so dumb I can't really say what I'm thinking or this might not get approved.All in all, Fallen Kingdom cannot be taken seriously and shouldn't be. It is a cashgrab movie that should be left untouched and unseen."
    },
    {
      "rating": "3",
      "text": "Jurassic World: Fallen Kingdom is the dumbest film I have seen in a while. I'm not saying that it is a horrible film, I wouldn't even say that I hated it, but I feel as though that is only because I was laughing at how unbelievably stupid it is. For the first 50 minutes, (from the opening to the part when they jump that truck onto the boat) the movie was fairly OK. However, once they get onto the boat the movie crashes harder than the Titanic. For some reason, the filmmakers thought it would be a good idea to set the second half of their Jurassic Park movie in a big old rich man's mansion. Even though I enjoyed the first 50 minutes, they were far from perfect. They split Owen and Claire up in this movie just to have them come back together again. Ian Malcolm was completely wasted and contained no importance to the plot and was merely there for fan service. Two of the new characters are Zia, a doctor for dinosaurs who has actually never been in person with a dino, and Franklin, and annoying tech guy stereotype who screams annoyingly and is scarred of everything. The villains are complete and total cartoon characters. Toby Jones plays a Donald Trump lookalike who is nothing but a stereotypical jerk businessman who is a jerk who just wants to sell dinosaurs for money. Rafe Spall plays an idiot who is in charge of getting the dinosaurs off the island and to James Cromwell's mansion where he can sell them. And Buffalo Bill is just the worst. James Cromwell is good but he's wasted in the film as discount Hammond, Chris Pratt is Chris Pratt and as usual he is likable, and Brice Dallas Howard is actually much better this time. Even the kid who plays Maisie is pretty good, even though the big reveal of her being a clone is the stupidest thing ever. Actually second stupidest. The stupidest thing ever is the scene where Buffalo Bill can't stop his obsession of collecting teeth. In the chaos of everyone at the dinosaur auction being attacked, Buffalo Bill decided it’s a great time to go in the mansion and ask for his money while countless people are running from the building in terror. He sees the Indoraptor (the custom genetically altered dino in the movie) in a cage and decides he wants one of its teeth for his collection. So he shoots it with 2 tranquilizers and it falls over. He opens up the cage and walks in leaving the door of the cage open. It turns out the Indoraptor was pretending to be tranquilized, so it smiles and winks at the audience. Buffalo Bill then gets eaten and the dinosaur is now loose. And that's how the final Battle starts. Great name by the way, Indoraptor, such a different and more inventive name than the Indominous Rex, the genetically altered dino bad guy from the last movie. Though this movie had great visual effects, some solid performances, and an enjoyable 1st act; the film is a failure on every other front, though it is an entertaining failure. Oh how the Kingdom of the once great Jurassic Park series has fallen. To quote Dr. Ian Malcolm in the first Jurassic Park: \"I'll tell you the problem with the scientific power that you're using here, it didn't require any discipline to attain it. You read what others had done and you took the next step. You didn't earn the knowledge for yourselves, so you don't take any responsibility for it. You stood on the shoulders of geniuses to accomplish something as fast as you could, and before you even knew what you had, you patented it, and packaged it, and slapped it on a plastic lunchbox, and now, you’re selling it. You’re selling it. You’re selling it. Your scientists were so preoccupied with whether they could, they didn't stop to think if they should.\""
    },
    {
      "rating": "4",
      "text": "I hated Jurassic World (2015). It had a level of spite which made the film leave a terrible taste. But you know what -it was not boring.Imagine a filmic task: here is a few hundred million, pick of actors and big CGI budget. Now make a film about dinosaurs BUT make it boring. You would have thought that this was Sisyphean task, impossible even but then I give you Jurassic World: Fallen Kingdom.Instead of one film, Bayonara has made four: Aliens, The Impossible, The Orphanage and Jurassic Park. Like a victim of the Alien Queen, the progeny has fed till the host is just a husk.The acting is so average. There is no chemistry at all between Pratt and Howard and if I hadn't just seen Avengers, you would think Pratt had lost all his filmic charisma. The ensemble struggles along as best they can.Oh yeah, by the way who builds a billion dollar tourist park on a volcano? Just saying...."
    }
  ],
  "recommendations": [
    "jurassic_world_dominion",
    "war_of_the_worlds",
    "geostorm",
    "transformers_the_last_knight",
    "the_predator",
    "the_tomorrow_war",
    "transformers_age_of_extinction",
    "jurassic_world",
    "max_steel",
    "teenage_mutant_ninja_turtles",
    "infinite",
    "independence_day_resurgence",
    "bird_box",
    "skyline",
    "prometheus",
    "district_9",
    "doomsday",
    "battleship",
    "maze_runner_the_scorch_trials",
    "riddick",
    "the_shallows",
    "the_cloverfield_paradox",
    "2012",
    "shadow_in_the_cloud",
    "the_new_mutants"
  ]
}