{
  "id": 272,
  "title": "Jurassic Park",
  "starring": [
    "Sam Neill",
    "Laura Dern"
  ],
  "runtime": 127,
  "genre": [
    "Adventure",
    "Science Fiction"
  ],
  "description": "A wealthy entrepreneur secretly creates a theme park featuring living dinosaurs drawn from prehistoric DNA. Before opening day, he invites a team of experts and his two eager grandchildren to experience the park and help calm anxious investors. However, the park is anything but amusing as the security systems go off-line and the dinosaurs escape.",
  "releaseYear": "1993",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oU7Oq2kFAAlGqbU4VoAE36g4hoI.jpg",
  "categories": {
    "plot": 7.913043478260869,
    "acting": 8.0,
    "ending": 8.0,
    "soundtrack": 8.5,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.6,
    "action": 7.928571428571429
  },
  "reviews": [
    {
      "rating": "10",
      "text": "As a wide-eyed 13 yr old boy gripping the theater armrests with white knuckles, I remember this film rewiring my brain as I watched it.  I walked out a changed person, never to view movies the same way again.  The good ones... the truly special ones... aren't just something to watch.  They transport you to another world.  They take you away and cleanse you of the drudgery of reality.  They nestle into your memory and never leave.  Jurassic Park was the first film to affect me in this way and I'll never forget that feeling.  Much obliged, Mr. Spielberg!"
    },
    {
      "rating": "9",
      "text": "With a great cast, wonderful story, and unforgettably stunning soundtrack, \"Jurassic Park\" does not disappoint. Truly brilliant filmmaking here."
    },
    {
      "rating": "8",
      "text": "Jurassic Park holds up surprisingly well to this day.  It may not be the deepest or best written movie ever made, but it's one of the most thrilling.  Spielberg is a master of creating tension and incredible set-pieces.  Most of the visual effects are still adequate, which is incredible for a movie made in 1993.  If a visual effects film holds up like that after 20 years there's a good chance it may never be completely antiquated.  The script can be somewhat clunky at times however.  It's not a bad script, just somewhat lacking when compared to something like The Truman Show or Inception.  It's still more than functional for a monster movie, and the main characters are thankfully likeable if somewhat needing of more complex characterization.  It's not perfect, but it's an extremely memorable and sometimes exhilarating action film that has deservedly gone down as a benchmark in movie history."
    },
    {
      "rating": "8",
      "text": "Steven Spielberg's \"Jurassic Park\" is a simply astonishing masterpiece, with an excellent cast, plot, and moreover visuals that exceeds any other of its era."
    },
    {
      "rating": "10",
      "text": "I first saw this back when I was little. If I remember correctly, it was also a big thing when it came out...I am always going to love this movie...It was one of the amazing film ever made in Hollywood by the great director Steven Spielberg who is the only director who thinks in a different way..Many who dislike Jurassic Park just all have same reason finding out little faults but anyone didn't show where the fault is properly..and also love the background music..it was truly Awesome...Jurassic Park â"
    },
    {
      "rating": "8",
      "text": "Re-watched this movie again for the first time since 1993, typically I have a rule about watching movies from my childhood, as I want to remember them pristine in my rose colored glasses but I'm really surprised that CGI still holds up, the story, acting and frikkin Jeff Goldblum  and Samuel L Jackon!"
    },
    {
      "rating": "10",
      "text": "most inspirational and exciting movie in my childhood.One of the most iconic movies of all time.A flawless masterpiece of a very rare kind.The real life looking dinosaurs are the greatest triumph for Spielberg in his long impressive filming career.One of the most memorable movies of all time."
    },
    {
      "rating": "9",
      "text": "Jurassic Park is an epic adventure fantasy film. It has everything that the audience wants action, suspense,some humor and a little violence as there are dinosaurs. The dinosaurs are really amazing as the technology was not that developed when Jurassic Park came out. The actors are really good, especially the two kids and it has a lot of suspense. I thought it wouldn't have so much blood and violence as I thought it was a PG movie, but I don't have these kind of problems. Jurassic park is epic and haters gonna hate. I was hesitating at first because I don't like dinosaurs and stuff but Jurassic Park amazed me and it is a classic one. A must-watch. Best film with dinosaurs for sure!"
    },
    {
      "rating": "10",
      "text": "To this day, still remains one of my favourite movies of all time. That's saying something considering I usually regard movies poorly. It has everything and more, with the inclusions of dinosaurs. How in all honesty can one beat that? This was epic on the grandest of scales when it launched in 1993, and still amazes me to this day. Storyline is beautiful, all roles are excellently portrayed and for it's time, a true marvel that should still be respected today. 10/10"
    },
    {
      "rating": "10",
      "text": "Jurassic park is one one of Steven Spielbergs best movies. Jurassic park has some of the best special effects of all time and is better than some effects we see today. Jurassic park revolutionized dinosaurs and made them cool again."
    },
    {
      "rating": "8",
      "text": "On a small island off the coast of Costa Rica exists a most unusual animal preserve by the name of Jurassic Park. Operated by dinosaur lover John Hammond (Richard Attenborough), Jurassic Park is the first of its kind. Its population of creatures includes brachiosaurs, dilophosaurs, tricerotops, velociraptors, and a Tyrannosaurus Rex, each of which has been cloned using the latest technology that takes DNA from dinosaur-biting prehistoric insects preserved in amber, and uses that DNA for the re-creation. When the consortium funding Jurassic Park become concerned that all is not as it should be, Hammond is forced to call in three experts: paleontologist Dr. Alan Grant (Sam Neill), his partner, paleo-botanist Dr. Ellie Sattler (Laura Dern), and the brilliant-but-cynical mathematician Dr. Ian Malcolm (Jeff Goldblum). When the trio arrives at Jurassic Park, they are astonished by what it represents. It doesn't take long, however, for astonishment to turn to horror.\r First of all, for anyone who's wondering, given the current state of technology, the situation postulated in Jurassic Park cannot happen. Not only do the necessary cloning techniques not exist, but the likelihood of retrieving dinosaur DNA from an amber-encased prehistoric mosquito is extremely small. While insect specimens have been unearthed, for there to be dinosaur DNA, circumstances demand that the mosquito had bitten a dinosaur shortly before its fatal imprisonment, and the chance of that is slim, at best.\r Nevertheless, the enjoyment of any movie is hardly predicated by a factual premise. The apparent realism of some of Crichton's pseudo-science imbues Jurassic Park with a grounding that is acceptable in our high-tech world. After all, to weave a dinosaur fable in this day and age, it helps if science, not fantasy, is the driving force.\r Of course, the special effects help immensely. They are so good, in fact, and the dinosaurs look so real, that I half expected to see \"dinosaur trainer\" during the closing credits. Instead, however, plaudits go to the creators of Jurassic Park's primary screen presences (all apologies to the actors). Stan Winston, definitely no stranger to this sort of film (his recent credits include Aliens and Terminator 2), is credited with the live-action creatures. Dennis Muren gets his due for the full motion monsters. Phil Tippett is the \"dinosaur supervisor\" and Michael Lantieri presides over the creature effects. All-in-all, the wizards at ILM have done an outstanding job, giving us by far the most impressive and believable monster movie of all time. Nothing compares.\r Unfortunately, the story isn't the equal of its execution. To begin with, Crichton's book, while filled with fascinating ideas and entertaining moments, doesn't hold together as a top-of-the-line adventure story. The ending is especially problematic, resulting in a long-winded denouement that drags to an anticlimactic conclusion. Despite numerous small changes and omissions, the movie Jurassic Park is very much faithful to its printed inspiration. Perhaps Michael Crichton's involvement in the screenplay has something to do with this.\r The plot is little more than a cleverly jumbled-together batch of formulas. As I mentioned before, Jurassic Park is, reduced to its most basic level, a monster movie. Thrown in for good measure is the human interest story - the growing relationship between self-confessed child-hater Grant and his two youthful charges - but this part of the film works least successfully.\r Nevertheless, I doubt that there are many who will go to Jurassic Park for its characters or story. Rightly so, crowds will flock to the theaters screening this movie so they can ooh and aah, jump in their seats, and root for the overmatched humans against the big, bad dinosaurs. Even those familiar with the written work can't help being drawn in to the pulse-pounding exhilaration of the chase as the Tyrannosaurus menaces two powerless electric cars and the trapped humans inside. In the end, Jurassic Park succeeds because it's good entertainment."
    },
    {
      "rating": "8",
      "text": "Jurassic Park” will at least disabuse anyone of the idea that it would be fun to share the planet with dinosaurs. Steven Spielberg’s scary and horrific thriller may be one-dimensional and even clunky in story and characterization, but it definitely delivers where it counts, in excitement, suspense and the stupendous realization of giant prehistoric reptiles. Having finally found another set of “Jaws” worthy of the name, Spielberg and Universal have a monster hit on their hands.\r Very cleverly, the film positions itself both as a dark look at a theme park gone awry, and as a theme park itself. Merchandising, Universal tour attractions and sequels will extend the profits enormously. The only thing that will keep this properly PG-13-rated extravaganza from approaching rarefied “Star Wars” and “E.T.” B.O. heights is its inappropriateness for kids under 10 or 12 — it’s just too intense, although many preteens will no doubt go anyway.\r The $ 60 million production (a bargain at the cost) follows the general idea if not the letter of Michael Crichton’s 1990 bestseller, which was no doubt partly inspired by Conan Doyle’s “The Lost World,” the fanciful story of a remote land inhabited by otherwise extinct beasts.\r Basis of this hi-tech, scientifically based, up-to-date version lies in the notion that living, breathing and eating full-sized dinosaurs can be biologically engineered using fossilized dino DNA. Having accomplished this in secret on an island off Costa Rica, zillionaire entrepreneur/tycoon John Hammond (Richard Attenborough) brings in a small group of experts to view and, he hopes, endorse his miracle, which he intends to parlay into the world’s most expensive zoo-cum-amusement park.\r Arriving to inspect the menagerie are paleontologists Dr. Alan Grant (Sam Neill) and Ellie Sattler (Laura Dern), as well as oddball mathematician Ian Malcolm (Jeff Goldblum), advocate of the Chaos Theory, a sort of arithmetic equivalent of Murphy’s Law. Also along for the look-see are Donald Gennaro (Martin Ferrero), a hard-nosed attorney repping the park’s investors, and Hammond’s two fresh-faced grandchildren, Lex (Ariana Richards) and Tim (Joseph Mazzello). Early introductory scenes are surprisingly perfunctory and even sloppy. There are several bad cuts unworthy of a filmmaker of Spielberg’s skill, and the script wouldn’t pass muster in Screenwriting 101. Curiously, the suspenseful structuring of the novel’s opening chapters, in which characters are mysteriously bitten, is abandoned here in favor of some foreshadowing and cross-cutting a la “The Exorcist.”\r Equally surprisingly, Spielberg lets the cat out of the bag as far as the dinosaurs are concerned very early, showing some of them in full view after only 20 minutes, lessening the suspense that could have been cranked way up through the accumulation of sounds and partial sightings.\r Still, none of these problems matter once the film clicks into high gear. When a storm strands two carloads of Hammond’s guests in the middle of the park at night, a Tyrannosaurus Rex decides it’s dinnertime. In a terrifically suspenseful and sustained sequence, the ferocious monster attacks the vehicles and its inhabitants, chowing down on one and terrorizing the others, particularly the children. Suddenly, after a fitful first hour, Spielberg pulls off one of the most exciting set pieces of his career, highlighted by a stunning shot of a T-Rex in a rearview mirror and climaxed by a gag lifted from Buster Keaton’s “Steamboat Bill Jr.”\r Moving toward the climax, viewers will be reminded of “Aliens” as two mid-sized Velociraptors attack through industrial ceilings and floors, and play a suspenseful cat-and-mouse game with the kids in a huge kitchen. Final action scene is ironically played out as three monsters attack in a display room festooned with mounted dinosaur skeletons, which will give kids occasion to decide whether they prefer their dinosaurs alive or dead.\rIt was unimaginable that Spielberg would proceed with “Jurassic Park” if he wasn’t certain that his dinosaurs would be the best ever seen onscreen, and the result shows that assumption to be true.\r The monsters are far more convincing than the human characters. Just about everyone is defined by one trait only — Dr. Grant dislikes children, Ellie is good-natured, Ian is the sardonic skeptic, Dennis is the sweaty traitor and Samuel L. Jackson’s computer technician always has a cigarette in his mouth.\r Technically, the film is sometimes more than it needs to be. As in some of Spielberg’s previous outings, Dean Cundey’s lensing overdoes the back illumination and shafts of light at times, and John Williams’ score gets unnecessarily bombastic. But the dinosaurs rule here, and Spielberg and his team of special effects aces have put something on the screen that people have never seen before, which is the surest way to create a blockbuster."
    },
    {
      "rating": "9",
      "text": "Spielberg had created a truly special film here. The concept is so interesting and intriguing, the ideas, the way the characters act in these situations, and especially how the dinosaurs still look so real with the animatronic work is unreal. This film is a joy to watch and the moments and set-pieces flow effortlessly. The way the characters grow and change is amazing and the writing and humor works. There are some actors who aren't as fully utilized but This is one of those films that leave you mesmerized and always entertains you."
    },
    {
      "rating": "10",
      "text": "One of the greataest movies of all time !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "It makes sense, and I am on Ian Malcolm's side of opinion of the island creation. i am astonished by how amazing the movie was."
    },
    {
      "rating": "10",
      "text": "Its an amazing science fiction film. one of speilbers most spellbinding works."
    },
    {
      "rating": "10",
      "text": "This is truely my favorite movie of all time."
    },
    {
      "rating": "10",
      "text": "I used to watch this at the age of 3. Since then it has been my favourite movie always keeping me entertained. One of the best movies of all time in my own opinion. Definately one of Spielberg's best."
    },
    {
      "rating": "7",
      "text": "Jurassic Park is a fun dinosaur movie with good morals. Normally I’m not too big on action but it is well handled. The film creates likeable/relatable characters, builds up the threat of the dinosaurs, uses mostly practical effects, and while it may take a while for the film to get to the action when it gets there it is fun and well earned being intense along with wonderful to look at. While the film has some nice morals they do feel a little forced in as they are mainly delivered through exposition while the action is fun and entertaining. Jurassic Park is a fun movie that doesn’t need a sequel but it is getting a fourth one."
    },
    {
      "rating": "9",
      "text": "This movie was the ultimate theater experience when I was a kid. Jurassic Park really jarred audiences with the realism of the dinosaurs and how well the actors interacted with digital creatures, and how well written the movie was overall which lead it to be a long-lasting franchise. While the sequels weren't quite as good, all the Jurassic Park movies did a great job of capturing the survival/horror genre and pairing it with plenty of adventure and \"wow\" moments. I don't know anyone that didn't enjoy this movie. Spielberg really delivered with this film."
    },
    {
      "rating": "10",
      "text": "Dinosaurs are the coolest prehestoric animals in the whole world. thats why Steven Spielberg decided to make a science fiction movie about Dinosaurs and it kicked a**!"
    },
    {
      "rating": "10",
      "text": "This movie is awesome. I first saw Jurassic Park as a little kid and loved it. I've probably seen it fifty times. I just finished watching it again on television and it is just as good as I remembered. This is definitely one of my all-time favorite films"
    },
    {
      "rating": "9",
      "text": "This is a movie that offers something new and exciting, this was one of my favorite movies growing up, and the best in the series, if your a Dinosaur fanatic like myself you'll love this movie."
    },
    {
      "rating": "8",
      "text": "This movie is one of my favorites, I've watched this movie so many times since I was five years. This movie is a classic that more acclaimed standing right next to so many other Spielberg masterpieces."
    },
    {
      "rating": "10",
      "text": "Huge advancements in scientific technology have enabled a mogul to create an island full of living dinosaurs. John Hammond has invited four individuals, along with his two grandchildren, to join him at Jurassic Park. But will everything go according to plan? A park employee attempts to steal dinosaur embryos, critical security systems are shut down and it now becomes a race for survival with dinosaurs roaming freely over the island."
    },
    {
      "rating": "10",
      "text": "The games provides you with an amazing universe, if you love Jurassic Park you totally gonna enjoy the game. But certain parts like the technical problems and the fruststing quick time events may prevent you sometimes from having fun. However for that price its totally worth your effort in going out to buy this. Do it."
    },
    {
      "rating": "10",
      "text": "A masterpiece. The suspense and wonder Spielberg unleashed is only match by his previous works. It's very hard to believe the visuals are from 1993. This is what a dinosaur movie looks like."
    },
    {
      "rating": "9",
      "text": "I’m pretty sure everyone knows the plot so I’ll just say that, as far as I’m concerned, Jurassic Park remains one of the best movies ever made with more memorable scenes than virtually any other I can think off. At the time of release it was an awe inspiring feature and it is testament to the films quality that, not only is it just as watchable over twenty years later, but no other movie in the genre has ever bettered it."
    },
    {
      "rating": "9",
      "text": "For anyone who was fascinated by dinosaurs as a kid, Jurassic Park is a godsend. It's fun, engaging and a well-told story. Spielberg does sentimental family films like no other, and Michael Crichton's ideas from the book the film is based on add a little extra intrigue to the story. Most of the cast are serviceable rather than outstanding, and the characters aren't the most interesting or original ever committed to film, though Laura Dern still impresses. The real stars of the show (as they should be) are the dinosaurs, proof that a combination of CGI and animatronics result in effects that age the least noticeably over time (the film is nearly 20 years old and the special effects are only just starting to look out of date). The set pieces are also fantastic, particularly the T-Rex reveal and the now infamous Velociraptor kitchen scene. Jurassic Park benefits in a real way from the dream-team combination of Spielberg's expert direction, Stan Winston's creature effects and John Williams' masterful score (easily among the finest he has ever composed), consequently the film is finely crafted and truly memorable. Scored purely on its value as a film, Jurassic Park probably deserves an 8, but since it's the most important film of my childhood, I'm prepared to bump it up to a 9."
    },
    {
      "rating": "10",
      "text": "This movie inspired and awed me as a child. It's what dreams are made of. The incredible special effects and puppetry still hold up today. Great movie in my eyes."
    },
    {
      "rating": "10",
      "text": "A simply great movie, delivers all the thrills, laughs, and all in 2 hours. It gave CGI to the world, along with an unforgettable movie of Isle Nublar's tragedy. This is a must-have for anyone who is a fan of thrillers."
    },
    {
      "rating": "10",
      "text": "One of the greatest movies of all time - Spielberg is a genuis. I love everything about this movie, location, acting, characters, dinosaurs - such a stunning movie."
    },
    {
      "rating": "8",
      "text": "An absolute classic for good reason, a thrilling dinosaur film with great acting, writing and music."
    },
    {
      "rating": "7",
      "text": "In a generation where Jurassic Park was the pinnacle of CGI, its hard not to admire this thrilling and suspenseful adventure, but there are stumbling blocks which stopped this film from reaching its full potential.\rWhen a wealthy visionary (Richard Attenborough) needs expert approval before he can open is state of the art biological theme park, he turns to palaeontologist Alan Grant (Sam Neill) and paleobotonist Ellie Sattler (Laura Dern) for approval, due to the fact that there are living, breathing dinosaurs on the park, cloned from DNA of the creatures millions of years before.\rWhat ensues is greed, corruption, and the goal of wanting to be remembered as revolutionising how humans and dinosaurs can co-exist.\rWhen a power cut drops all security defences on the enclosures, its a fight for life against beautifully rendered prehistoric creatures.\rThe build and tension is here, but its when the dinosaurs actually make an appearance that the movie start to become a little bland and it almost seems rushed, even though this is 120min plus film.\rSpielberg has created mastery in telling an excellent story, but the chemistry between the characters feels to forced and unnecessary, and it seemed premature to put Jeff Goldblum's eccentric character out of use so early with a bad leg.\rSaying that, the performances of Neill and Dern are strong, but the device of using shock and awe/wait for amazement does tend to overpower these performances.\rIts excellent for its generation, certainly better than the second instalment, but could have reached heights had it not been for a more concerning promotion of the technology at work here, a milestone of its own behalf, but could easily have been better."
    },
    {
      "rating": "7",
      "text": "Jurassic Park is surprisingly good, and I say \"surprisingly,\" because I didn't know how much more I really wanted to watch after the first hour. Roughly the first 60 minutes is contaminated with utter boredom. In fact, most of this first hour wasn't even necessary. If I could crop out the 5-10 minutes of the first hour that were important, I imagine that the audience would still understand what was happening. Maybe it was just my inner-boy speaking, but I wanted to see some dinosaurs for cryin' out loud! But I digress. (To the film's credit, though, we do see some dinos before they begin their reign of terror, but most are in the background, one we only get a glimpse of his claw and eye. Only one dino is fully exposed, and it doesn't really do anything. And before the dinos start attacking, we see two more; a baby, as well as a sick triceratops). After you get past the first hour, the film quickly picks up. I won't say how many, but people do die (and we see two dismembered body parts before the film is over). To be honest, I've never seen a film that would truly qualify as \"scary,\" but this certainly \"freaked me out.\" I always thought dinos were terrifying creatures, but now that fear has been greatly multiplied. In addition to an excellent job on making the dinos appear so suddenly (you'll probably be startled by an un-expected reptile at least once), the dinos look incredibly real, despite the fact that this film is nearly 20 years old. The characters in the film weren't quite one-dimensional, but they weren't very fleshed out either. The plot was slightly outrageous, but if you can force yourself to believe it, the film is much more enjoyable. The score by legendary composer, John Williams, was something of a disappointment. This is by far the worst I've heard from him, though it's not that bad. It's serviceable, and sometimes, that's all one can ask for. Though there are times when the music is a little irritating and repetitive. The film is lots of fun, and it's truly scary. There are some comedy elements, but it's mostly for the fright and joy of seeing people chased by dinos. So, if that's what you came for, you won't be disappointed. That is, if you can get past that first hour."
    },
    {
      "rating": "10",
      "text": "I love this movie, one the greatest movies of all time, and a great adventure. It will never gets old.  Steven Spielberg gives you a realistic picture of dinosours. It has very good music too. See it."
    },
    {
      "rating": "9",
      "text": "Brilliant action-packed film by Spielberg. CGI, dramatic scenes, and blood-thirsty animals make it thrilling, and worth watching. Unforgettable score and hair raising effects will give you a scare you'll never forget."
    },
    {
      "rating": "8",
      "text": "Jurassic Park is Steven Spielberg's big-screen vision of Michael Crichton's famed novel about dinosaurs in the modern world. Stunning visuals and a killer plot, it's a classic and a classic of our time."
    },
    {
      "rating": "8",
      "text": "I wish the movie lived up to its classic score, but it doesn't. However, it is a groundbreaking picture that is filled with adventure and action. Entertaining and at times, epic."
    },
    {
      "rating": "8",
      "text": "It's got intensity, excitement, great visuals and humor - almost everything you expect from a Spielberg movie. The movie also has some great, effective, suspenseful scenes that you make you be on the edge-of-your-seat."
    },
    {
      "rating": "8",
      "text": "During this week at work, I decided to listen to the Jurassic Park audio book. I very much enjoyed the experience, but was also annoyed at how different the book was from the movie. Because of that, I decided to revisit this legenadry franchise that was a very prominent part of my childhood. Like I said, the book is very different from the movie, not only that, but also very violent. In the book, there was a handful of deaths before we are ever introduced to the park itself. With that being said, the movie manages to stand up on it's own merits and create a magical experience that most people can enjoy. After almost thirty years the dinosuars still look pretty good and I really appreciate the practical effects and puppetry within the film."
    },
    {
      "rating": "10",
      "text": "This is one of my favorite films of all time. It knows how to be scary, funny and fascinating, sometimes all in the same scene. The dinosaurs also look great, especially for the time period that it was made in."
    },
    {
      "rating": "7",
      "text": "This one is certainly a ton of fun. The special effects are killer (lul) and the excitement they help to build is truly why Jurassic Park has gone down as a classic. Now, a lot of that is also likely thanks to 90s nostalgia and kids overhyping the movies they saw when they were 10, but all the same, Jurassic Park's special effects are a sight to behold. The terror and thrills are also ever present and really add an extra level of excitement to this one as you watch these huge beasts attack these people with childlike wonder. However, once you get snapped out of that childlike wonder, there are some issues, namely the acting. Laura Dern sucks here. The kids are not stellar. Then Richard Attenborough (RIP) is nothing more than alright. Luckily, Jeff Goldblum, Sam Neill, and Wayne Knight, are all fine, which is a plus. However, the acting of Dern is the true cause of much of my distress, as she was just straight up bad. There are also some cheesy scenes that really detract from the overall product. However, as a whole, Jurassic Park is very exciting and the special effects are just too impressive to look away even when the acting sucks."
    },
    {
      "rating": "10",
      "text": "Classic movie. It's the undisputed all-time best Dinosaur movie to come out, and likely to be the best one to ever come out. It has an exciting plot, great performances, and action to support it. The effects were amazing; ahead of its time. The Dinosaurs looked incredibly, and terrifyingly realistic."
    },
    {
      "rating": "8",
      "text": "\"Jurassic Park\" is a wonderfully imagined film. It owes its greatness to digital wizardry, beautiful panoramas, and Michael Crichton's captivating novel."
    },
    {
      "rating": "8",
      "text": "For its time the effects are spectacular. Soon will draw the remastered in 3D and it will be great."
    },
    {
      "rating": "7",
      "text": "Props to Steven Spielberg for creating a great movie! It is not the best movie ever made, or one of them, but it is still a treat to watch! The visual effects are top-notch and I enjoyed the action. A little slow during the first 10 minutes, but it does pick up. Diagnosis: See it!"
    },
    {
      "rating": "9",
      "text": "This is a classic summer movie, and great experience that Spielberg has directed. Mixed of practical effects and CGI really works."
    },
    {
      "rating": "9",
      "text": "Few movies have ever managed to captivate me the way this one did. I watched it on opening night when it first came out in theatres. Then about a dozen more times after that. I bought the VHS, DVD, Blu Ray, book, sound track, trading cards, stickers, posters, even had a Jurassic Park tie at one point. So yeah, I'm a huge fan.\r When it first came out, it was a visual marvel. Today the CG sequences do show their age, but luckily most of the practical effects still hold up, a testimony to why animatronics is still valid.\r Great story, it does deviate a bit from the book but not too much. Interesting characters, but the dialogue now does feel a little hammy at time.\r Overall:\rJurassic Park is one of my favourite movies from my childhood. While it is a little dated now, it still holds up remarkably well, considering its age."
    },
    {
      "rating": "10",
      "text": "Classic. The movie of my childhood. As then, now produces incredible impression. Now I'll know what to do, if I meet a tyrannosaur. Thanks to Dr. Grant :D"
    }
  ]
}