{
  "id": 1802,
  "title": "Jurassic World Dominion",
  "starring": [
    "Chris Pratt",
    "Bryce Dallas Howard"
  ],
  "runtime": 147,
  "genre": [
    "Adventure",
    "Action",
    "Science Fiction"
  ],
  "description": "Four years after the destruction of Isla Nublar, Biosyn operatives attempt to track down Maisie Lockwood, while Dr Ellie Sattler investigates a genetically engineered swarm of giant insects.",
  "releaseYear": "2022",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kAVRgw7GgK1CfYEJq8ME6EvRIgU.jpg",
  "categories": {
    "plot": 3.116279069767442,
    "acting": 3.129032258064516,
    "ending": 2.769230769230769,
    "soundtrack": 2.0,
    "cinematography": 4.0,
    "familyFriendly": 3.6666666666666665,
    "funny": 3.0,
    "action": 2.8421052631578947
  },
  "reviews": [
    {
      "rating": "0",
      "text": "\"That's one big pile of ****This movie is SCAM, all the trailers and the summary are about \"the coesistence between humans and dinosaurs\"........WTF IS THAT??? All the movie is about damn inscets!!!!Then in the ending the director remember that he did a **** mess and end with \"ah yeah human and dinosaurs must cooperate to live together\"...**** idiot that was the premise of the movie and you do that BEFORE, not a the ending!!!!!A movie that can't be defined by the words good or bad, but with the word WRONG"
    },
    {
      "rating": "0",
      "text": "Désolé j'ai tenu que 30 minutes c'était encore plus mauvais que le film précédent, la prochaine fois au lieu de faire un film aussi mauvais donnez moi l'argent du film je saurais quoi en faire :)"
    },
    {
      "rating": "3",
      "text": "I really tried to like Dominion but it fell flat on its face. After 45 minutes I was already hoping it would be over soon. Dominion is a far cry from the Jurassic Parks that many of us grew up with. Owen and Claire’s relationship is awkward at best and Alan and Ellie’s relationship felt like fan service gone wrong. Dominion focuses on in-your-face action more than it’s predecessors which makes it feel more like a generic action movie. Unfortunately the subtle visuals and sounds used to create moments of dread in past films is missing completely. The massive dinosaur fights even felt identical to fights from the past 5 films.Also, what’s up with everyone being able to hold off dinosaurs by holding up their hand? Owen was only able to do this with the raptor he raised from birth. It makes no sense that any other characters can suddenly make the dinosaurs obey them. This choice removes any sense of risk and danger as we know the protagonists can use this magic hand trick to deal with most smaller dinos. At one point we see a Velociraptor show up (one of the most terrifying creatures from past film) and I didn’t even feel worried for our protagonist because they can all take dinosaurs now. The only reason I’m not rating this lower is because the short scenes showing mosques adapting to our world were really interesting.It’s truly disappointing to see so much wasted potential with the combination of the new and old cast."
    },
    {
      "rating": "3",
      "text": "\"Jurassic World Dominion\" (theatres, PG-13, 2.5 hrs) should've been an awesome adventure-drama and it had the outstanding VFX to get there but the director and writers just whiffed on this. Totally implausible get aways from situations and dino-attax just took all the suspense/realism from this. Our protags were never, ever in any danger when their threats are simply written to be cartoonishly impotent. I mean a plane crash at 200-mph into snow/ice and our protags have no broken bones, no concussions, no scrapes or scratches even! Totally written by and for 10 year olds. And the ridiculous amount of close-ups on Bryce D H, is the director in love with her or what?! Jeebus. Anyway, such a disappointingly wasted opportunity."
    },
    {
      "rating": "2",
      "text": "Look how they massacred my boy. Director and co-writer took jurassic park and tried to turn into a lazy marvel style movie. Cheesy and predictable plot with bad dialogue. No fear factor and non sense story line. The only reason this gets any benefit is the original Cady coming together to help save Pratt from his awful lines."
    },
    {
      "rating": "4",
      "text": "Oh my what a terrible movie. The world tries to be serious & grounded but we’re to believe humans & dinos can communicate. There’s just the slimmest plot & probably the worst is the teenage girl angst. She’s just unbearable & & & a CLONE. A clone “trying to find herself & who she is”. Read a synopsis if you need to know the story & hopefully the next is better."
    },
    {
      "rating": "4",
      "text": "The trashy pulp plot, lacklustre direction and cinematography fail to capture an iota of the same enthusiasm as prior outings. I suppose this really sprooves how much Jurassic world was an accidental success from this network executive made by committee corporate production nonsense with its overly inflated effects budget swollen around the edges of what could have been an interesting story. Massively missed opportunity.."
    },
    {
      "rating": "6",
      "text": "It borrows from every movie in the box, from Star Wars, to Alien to James Bond and by the end of it you are just relieved the rollercoaster ride is over. The film-making tools used in this film show a knowledge of the curriculum, but just using every trick in the text-book does not a great film make. Sometimes restraint is required, and that is exactly what I wish this movie would have done, to lay off for a second or two to late me catch my breath. There were some great moments with Bryce Dallas Howard swimming through a pond covered in duckweed and Chris Pratt being chased not by motorbikes but by velociraptors in Malta in Bond-esque fashion. The Dinosaurs spring up every chance they get which is exciting at first but the novelty quickly wears off. A new live-action dinosaur appears every two minutes and packed in back to back like sardines and characters stare at them stunned like they were still seeing them for the first time. I know if it was me all I would be thinking, 'it's just another animatronic dinosaur, nothing to see here'. If the dinosaurs were fewer and further between when they came on screen their presence would be impactful however what can you do when you've let them all out. At the end of the day less is more and that's no less true with Jurassic World Dominion. It might leave you motion sick and queasy but it is a rollercoaster ride nonetheless. They stretched the formula as far as it could possibly go (and sometimes further) and I for one am relieved its all over. Time for some long earned rest for the franchise."
    },
    {
      "rating": "6",
      "text": "Funny how the whole world broke out in Dinosaurs when only a couple were let free in the last movie. Plus a lot of the dinosaurs on the loose weren’t species that were let go in the last movie.It’s nice that there’s a raptor with feathers. Though, why ? A couple of dinosaurs were let loose and raptors suddenly look how they are supposed to ?There’s a little too many heroes and it never felt like any were in danger. The movie needed more villains with guns to be eaten.With that said it was nice to see the Jurassic Park characters team with the Jurassic World characters. Though all they really get to do is run away from dinosaurs together. While saying that they know each other’s work."
    },
    {
      "rating": "2",
      "text": "This movie has WAY too many plot lines going on. It's a confusing, over action packed, pointless adventure with dinosaurs thrown in."
    },
    {
      "rating": "3",
      "text": "I was looking forward to this film as it had a good idea but it was a snooze fest and very predictable. Not much to highlight most likely the worst sequel of the new Jurassic movies."
    },
    {
      "rating": "1",
      "text": "It’s an insult to even compare this steaming pile of dinosaur turd to the original movie. Every scene somehow got progressively more ridiculous than the next. The CGI looked sub par and the emotionless acting combined with the crap story made for a 1/10"
    },
    {
      "rating": "0",
      "text": "Mr Goggles had his beer goggles on when he watched this.So bad I nearly fell asleep in the middle of an action scene.  If any of the characters died, I wouldn't have cared less, as I wasn't attached to them.  The characters, like the film overall had no personality, or charm.There was literally nothing to like at all.  I was quite young when I watched the first one at the cinema and it was servicable, nothing special but alright.  Worth a watch.  This though, two hours that I will never be getting back."
    },
    {
      "rating": "2",
      "text": "After discovering a once-in-a-lifetime player with a rocky past abroad, a down on his luck basketball scout (Adam Sandler) takes it upon himself to bring the phenom to the States without his team's approval. Against the odds, they have one final shot to prove they have what it takes to make it in the NBA"
    },
    {
      "rating": "1",
      "text": "This movie, it's plot, it's visual and most importanly it's dinosaur is unremarkable."
    },
    {
      "rating": "4",
      "text": "I am so disappointed this is what they gave us for their self-proclaimed \"epic conclusion of the Jurassic era.\" Especially after Fallen Kingdom left us with such an exciting cliffhanger, the chaos that awaits the people of the world when dinosaurs are unleashed upon them. That's not at all what we get."
    },
    {
      "rating": "1",
      "text": "this movie doesn't look like Jurassic WORLD let alone that it was made by universal, I'm 100% disappointed with this crap that didn't exceed my expectations when I saw the end of JW 2018"
    },
    {
      "rating": "2",
      "text": "The ending to Jurassic World: Fallen Kingdomed us to believe that the next movie would explore the concept of dinosaurs co-existing with humans. But instead we got doomsday-bringing locusts…"
    },
    {
      "rating": "3",
      "text": "Easily the worst Jurassic Park movie. This movie had such potential and it was completely ruined by stupid storylines and too many storylines. The original cast returned and were completely wasted."
    },
    {
      "rating": "3",
      "text": "There are literally dinosaurs all over the earth and the entire movie takes place in some remote facility in the middle of ******* Italy. What the heck was the point of releasing all the dinosaurs into the wild if the entire plot is gonna be in a closed off area anyway?  The soundtrack is mediocre, the acting is **** and the characters are more one dimensional then ever. They should have ended the franchise at jw 1."
    },
    {
      "rating": "1",
      "text": "This movie was bad. I rented it with low expectations and still it was worse than I thought it could be. The worst part, it was sooo boring. Just watch Jurassic Park 1 if you want a cool movie with dinosaurs."
    },
    {
      "rating": "3",
      "text": "I don't hate this movie but it probably has one of the worst plots of any big budget movie I've seen. It's a dinosaur movies that's barely about dinosaurs. Most of the newer characters do nothing, and decent performances from the old cast are wasted. The action picks up in the second half, compared to the first half which is insanely boring for a Jurrasic Park movie. But even then, I would say most of the action scenes are forgettable. This and Fallen Kingdom are easily the worst Jurrasic Park movies."
    },
    {
      "rating": "0",
      "text": "Put simply, Jurassic World Dominion is the worst film in the ENTIRE series. It is awful."
    },
    {
      "rating": "0",
      "text": "A generic, lifeless adventure movie that happens to have dinosaurs. Zero charm, rather rewatch the original trilogy"
    },
    {
      "rating": "4",
      "text": "I went super high. I didn’t like a lot of it. But it held my attention. A new dinosaur would appear in the bushes every ten minutes and my brain would go, That’s not really there. The older actors look tired and bored. Everyone else is working way too hard, especially screenwriter. There’s not a funny or memorable line in the whole thing. A chase sequence in the tight streets with raptors and motorbikes was amusing. Everything else I can barely remember. Something about giant insects?"
    },
    {
      "rating": "3",
      "text": "What a garbage film. Didn't think they could get lower? Well, here comes Jurassic World Dominion. This is another shameless, poorly made and long cash grab and they should be ashamed of themselves."
    },
    {
      "rating": "1",
      "text": "Holy heck, This is the most ridiculous crap ever. Basically if you have Jedi powers you can control any Dinosaur you want. This movies writing is as bad as Kenobi tv show. Where do they get these writers from? The Jurassic park supporter in me is now officially dead :( RIP richard attenborough"
    },
    {
      "rating": "1",
      "text": "The writers and producers should be absolutely ashamed of themselves for the absolute garbage they call a plot and all the blatant false advertising for this movie, respectively. While bringing back the original cast was nice to see and the visual effects (namely the many practical ones) are some of the best of the series, everything else in Jurassic World: Dominion is an absolute slog. The story is a  snoozefest that's just so overstuffed yet boring at the same time. The whole Dinosaurs living with humans concept is NEVER truly explored either, which would've made for a unique tale. Furthermore, the acting is a total mixed bag, but the bad writing is doing the actors no favors. You know when the chief complaint of your previous movie (Fallen Kingdom) was the terrible script, you're supposed to find new scriptwriters right? Well, either the producers nor Universal seemed to understand this, as Dominion  sends the Jurassic series off with a big old pile of Dino dung."
    },
    {
      "rating": "5",
      "text": "Wasn't really sure things could get much worse than \"Fallen Kingdom,\" but here we are. \"Jurassic World: Dominion\" is as much of a soulless, disjointed and frustrating experience as you've been hearing it is, with some truly crushing mediocrity on display in the narrative department. This is a movie that hedges all of its promotional material — and its opening montage, to boot — on the central question posed by the conclusion of its predecessor; can dinosaurs and humans truly coexist? In that, you're expecting what? Probably a movie involving the characters at hand trying to grapple with dinosaurs in a civilized environment, right? Welp. What we do get is yet another movie featuring a cadre of characters traipsing around a failing wildlife sanctuary, followed by an ending montage that would have you believe the movie just answered the aforementioned question at hand, even though it really, truly hasn't in any way, shape or form. In fact, the central plot of this movie is split between two groups of characters — Chris Pratt's Owen Grady, Bryce Dallas Howard's Claire Dearing and Isabella Sermon's Maisie Lockwood, and then Sam Neill's Dr. Alan Grant, Laura Dern's Dr. Ellie Sattler and Jeff Goldblum's Dr. Ian Malcolm — leading to a wholly bifurcated feeling to things. These two narratives never really coalesce in a cohesive, natural or satisfying way. More importantly, the split time ends up betraying every character in the film with an ultimate lack of development. Add on some of the most confoundingly agitating retcons I've seen in a franchise film in quite some time and you get a real disappointment at the theater, dinosaur fights and legacy character appearances be damned."
    },
    {
      "rating": "2",
      "text": "If you can describe this film in 3 words it would be long, boring and generic. Go if you are passionate about this franchise otherwise don't waste your time and money."
    },
    {
      "rating": "2",
      "text": "I was bamboozled. Neither the drive-in scene nor the prehistoric scene made it into the movie. Instead, there is plenty of marvel-esque cringe one liners being delivered by a slew of good and bad actors who are all phoning it in. There are so many useless characters and pointless locations, it is genuinely confusing to wrap your head around. By the end, I was begging for something as dumb as Jurassic Park 3, or even Fallen Kingdom. This franchise is in dire need of a reboot."
    },
    {
      "rating": "3",
      "text": "convenience the movieI was expecting to see a scifi/soft horror movie and got a generic Fast and Furious with some dinos, yes some dinos, because I hope you are more afraid of grasshoppers than dinos lolThe times someone is saved at the last second it's way too much, boring, too long movie, CGI is good but thats it. Plot points leading nowhere and too many nostalgia pandering, references are nice, but this is way too much (even the shave spray can for hiding stolen DNA is here lol !? it was lost in mud in the first movie), you have to turn you brain off, disappointing. Was nice to see the original cast, but the story is just lacking...coincidence the movie"
    },
    {
      "rating": "0",
      "text": "What an absolute waste of time. The movie goes nowhere, does nothing and is a show case of CGI (poorly done) and an endless cast get together money grab that does nothing to progress, add or extend the life of what was once a legacy worth watching. So many missed opportunities and ability to make the story worth while, yet I'm left thinking i cant believe someone got paid to write this rubbish."
    },
    {
      "rating": "1",
      "text": "Story was hodge podge of junk. Nothing makes any remote sense and dinos seem to pop out like magic. Who wrote and directed this absolute crap, oh the same guy that help destroy Star Wars. Giving it a 1 for nostalgia bringing back the original characters, but yikes is this the guy to call when you want to destroy a franchise or something?"
    },
    {
      "rating": "1",
      "text": "The worst one by far I'd rather have watched JP3 again. Flat boring end to a fantastic genre..."
    },
    {
      "rating": "3",
      "text": "Too long, and wastes too much time focusing on filler characters, for a story that did evolve the formula nearly enough to justify another movie.  It was just a vehicle to bring back the original characters as jangling keys.  This scrip outright steals action sequences and dialogue from the first film.  Referencing is one thing, copy and pasting, well that is JJ Abrams patented, and his lawyers will probably be in touch.  The real downfall is with the poor CGI that had to be covered by CGI environmental effects.  This leaves you with a headache as you try to make out the dinos and makes you wonder what they were thinking? 5.5/10"
    },
    {
      "rating": "4",
      "text": "a movie about dinosaurs without any importance to dinosaurs... is really disapointed"
    },
    {
      "rating": "5",
      "text": "A film that is nowhere near the impact of its predecessors. It starts off slowly and the story feels flat. Outside of the CGI, it was a disappointment."
    },
    {
      "rating": "5",
      "text": "It was just a vehicle to bring back the original characters as jangling keys."
    },
    {
      "rating": "2",
      "text": "Pretty weak movie. I guess they wanted to end the franchise by closing fast all the open doors that were left behind. It is really not a JP movie, or at least what it should be, in my opinion. Although it's kinda entertaining, the villain is everything but charismatic, there's too much action scenes and the argument is very weak. Protagonists are so lucky everytime and there are too much conveniences. The final battle is short and not exciting anymore. Hope this is the last movie and the franchise is buried forever. Or, at least, until someone makes a new good movie."
    },
    {
      "rating": "3",
      "text": "It pains me to say it, but I was bored...I wanted it to be over and thats something I never thought I would feel watching a Jurassic Park/World movie. What happened here? I found this very sad because this is currently the only series that portrays Dinosaurs in a somewhat of a realistic manner and they have managed to screw it up.The original Jurassic Park was and still is, such a wonderful piece of entertainment because their creators understood that the hook of Dinosaurs is the fact that we know that they were real, they existed, they were animals on earth. And thus, they portrayed them as realistic as possible, like animals suddenly brought back from extinction. The fact that they looked and acted so real, made as all look at them in awe just like the characters in the movie were looking at them. That was the hook, and it was all tied up nicely with a simple story that would explain to us logically how it all came to be with characters that would complement all the questions with their own curiosity.But now, Dinosaurs are taken from granted, so much so, that they are not even the main threat of the plot. I will say this...Despite liking the first Jurassic World, the moment they started to portray the Dinosaurs as characters (Like Blue the raptor), the moment they started to screw everything up. Like I said, this were animals and the interesting thing about them is that they were huge and probably dangerous given all their teeth...but when they start to characterize them or portray them as monsters (God, I hated those laser beam focused raptors) the moment you take away the sense of awe and respect that such creatures emanate.This is a movie that is more focused on the action and the big set pieces than anything else and it looses all direction. Getting to see the old cast was fun and they do everything admirably well, but the fact that they are here and this turned out to be such a derailment from the original movie makes me feel kind of disgusted.We all know that making Jurassic sequels is not easy, and that capturing the magic of the original is nearly impossible given that, that was the first one to ever show us the creatures with such detail...but this was not the way to go.I could probably write more and more paragraphs detailing why the movie is such a miss, given how the story is incredibly contrived, some characters are awful stupid and basic (the main villain), some of the performances are not very good and the complete lack of tension within it despite being a movie where Dinosaurs try to eat people -  yet, the biggest point I wanted to make was the complete lack of understanding of what made the original so compelling. It was, because it made us think and question \"what if, what if this creatures really came back, what would that feel like?\"...this movie doesn't do that, in fact Jurassic movies have long gone from trying to do that, and this is the one movie where it finally hit me to a point where I was completely disconnected from it. A shame."
    },
    {
      "rating": "2",
      "text": "I am not a fan of the franchise. While the first Jurassic Park was amazing for visuals, revolutionary for the technical aspects of making the film, and a cult film for brining dinosaurs to the silver screen, the rest of the franchise looked more and more as soulless crash grabs. Jurassic World Dominion has one redeeming factor: It doesn't want to be anything more than entertainment with plenty of action and some plotholes. No matter how stupid the film is they managed to deliver what they wanted to delivery, what they promised to deliver. They recognized how the original novel behind the Jurassic Park franchise doesn't make sense, how the author is a technophobe, and some of his novels speak about how he fails to understand even everyday technology, well known practices and his fear comes from lack of understanding. But you can't build several stories on lack of understanding without revealing those holes in the story. When te Jurassic World franchise decidedly wanted to look less realistic, and present us a dystopic scifi world, it gave them some freedom to justify some of the silly things. Now with the last entry into the series they can't explain how dinosaurs would spread so fast, how they would adapt to everything, how noone would have time to prepare... This looks horribly bad for most of the viewers. But once you understand this piece never wanted to be more than a mildly interesting action flick because that is the best they can do with source material, and if they decide to always accept plot holes, unrealistic elements for more fun, then all of these issues are natural. For people who want to treat the whole franchise seriously, and want to think about any part of this action flick, it is horrible. For me, it is just pointless. If you can't make good films about an IP, because the IP is bad, you shouldn't make any film about it. But of course this stupid movie is still profitable..."
    },
    {
      "rating": "1",
      "text": "This movie was absurdly bad. Just completely unrealistic and over the top to the point where it was unnecessary."
    },
    {
      "rating": "1",
      "text": "This is called milking a franchise dry. The actors kept things moving (God love them!), but there were no new ideas, and frankly I wasn’t as keen as I thought I would be to see all my old dinosaur friends again. Even they seemed bored, and rather moth-eaten."
    },
    {
      "rating": "1",
      "text": "This was a painfully bad movie more about locusts than dinosaurs. Crammed full of nostalgic characters to attempt to keep you from noticing there's no laid out plot."
    },
    {
      "rating": "4",
      "text": "Traer de vuelta al elenco original funciona a medias, ya que el resultado final no deja de saber a lo mismo de siempre, hasta las películas de Godzilla son mas entretenidas que esta."
    },
    {
      "rating": "1",
      "text": "To quote the Godfather (while crying) : \"look what they've done to my boy!\""
    },
    {
      "rating": "2",
      "text": "I'd rather be dominated by a T-rex than have to watch this 'movie' again!!!"
    },
    {
      "rating": "0",
      "text": "Just when you think things couldn't get worst, Dominion comes out and takes the crown as the worst Jurassic Park film. It's an overly long, convoluted story that is honestly just brutal to sit through. I was checking my watch by the time I was 10 minutes into the film and ended up breaking this up into multiple viewings. Who came up with this nightmare and honestly thought it was a good idea?"
    },
    {
      "rating": "1",
      "text": "Astoundingly awful. Go in with the mentality that you are about to watch a B movie and you might not cringe throughout the entire film. Failure in almost every category. Plot, acting, dialogue, editing (editing!!!), cinematography, directing; all abjectly bad. Incessant schmaltzy or frantic background music playing throughout the whole movie! 1/10 for the one good scene when Claire is under water. Remarkably horrible movie."
    }
  ]
}