{
  "id": 3814,
  "title": "Just Mercy",
  "starring": [
    "Michael B. Jordan",
    "Brie Larson"
  ],
  "runtime": 137,
  "genre": [
    "Drama",
    "Crime",
    "History"
  ],
  "description": "The powerful true story of Harvard-educated lawyer Bryan Stevenson, who goes to Alabama to defend the disenfranchised and wrongly condemned — including Walter McMillian, a man sentenced to death despite evidence proving his innocence. Bryan fights tirelessly for Walter with the system stacked against them.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4YJNp1cquIkX8JxFwkKNEFQ9tgr.jpg",
  "categories": {
    "plot": 7.625,
    "acting": 7.5,
    "ending": 8.2,
    "soundtrack": 10.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Just Mercy has an important tale to tell, but muddies its message through emotional manipulation and an unsubstantiated hatred of capital punishment for actually guilty criminals."
    },
    {
      "rating": "10",
      "text": "This movie was excellent! It's unfortunate that so many out of touch, non-African American \"film critics\" chose to dismiss the current and real life experiences of Blacks through powerful performances and a well developed script. The reason that the film was predictable is because is a true store. This is how the absence of justice consistantly plays out in the American court room. So if you've seen it before , It's because that's how it is."
    },
    {
      "rating": "10",
      "text": "To think this film is based on true stories, it's one of the best films I've watched in my life. Michael B Jordan couldn't have produced a better performance than that."
    },
    {
      "rating": "10",
      "text": "No comment other than i was fully attentive the whole film and couldnt tale my eyes off the screen"
    },
    {
      "rating": "7",
      "text": "It's Oscar bait, plain and simple and the handling and direction are very usual and known. There's no surprises or something to make it stand aside from films of this kind, nevertheless it's a fine film.The emotional manipulation is there and I was expecting it but the reason why the movie ends up working better is because the story is good no matter what.The theme is completely relevant and devastatingly painful and real.The performances will undoubtedly also remove it from the immediate oblivion and to be honest is a good option.It's a safe bet for sure but that isn't really an issue.This is my last film for the year. It was another great year.Let's see what the new decade has in store for us."
    },
    {
      "rating": "6",
      "text": "Well-acted, but we’ve seen all of this before. Some nice heartfelt moments but also some heavy-handed ones. It’ll get an A+ on CinemaScore and win the People’s Choice though, I’m sure."
    },
    {
      "rating": "10",
      "text": "Awesome movie.  Best I have seen in the past year.  Michael B. Jordan is amazing as always and so were Jamie Foxx and Brie Larson. A powerful statement against racism, corruption and the death penalty at a time when our country sure needs every positive statement it can get.  A 10+ plus for me."
    },
    {
      "rating": "6",
      "text": "Criminal justice reform is a hot political topic these days and this movie lands squarely in the middle of the discussion. It's based on a true story about a young black lawyer (Michael B. Jordan), who travels to a small racist Alabama town to save a man who's been falsely accused of murder (Jamie Foxx). While there are some moving moments, this film spends more time trying to generate outrage than to create effective drama. The performances are effective and the story is certainly important, but the relentless messaging and a solemn pace inhibit the film's full potential."
    },
    {
      "rating": "10",
      "text": "It is a good movie, there are a lot of innocent people in jail, most of them are black. Of course we have seen a lot of these kind of movies. I hope that this movie makes people aware"
    },
    {
      "rating": "8",
      "text": "Before I say anything else, even though I am rooting for Antonio Banderas or Adam Driver for the Best Actor Oscar, Jamie Foxx deserved a nomination!!Of the previous 4 pictures I have seen, \"1917\", \"Uncut Gems\", \"Cats\" and \"A Hidden Life\", equaling over 10 hours of film putting them all together didn't move me as much as \"Just Mercy\" including a 10 minute combined scene of a courtroom and a prison cell that had tears running down my face and I didn't care who saw it if anyone could through their tears.A cliche is defined as \"something that has become overly familiar or common place\" and, sadly, this is a movie full of cliches because so much that is wrong in race relations has not changed in centuries. When a black man is pulled over by the police he will raise his hands above the wheel so they can see he has no weapons in his hands. Have you ever seen, even in a movie, a white man do this? When a white girl is raped and killed in Alabama can you guess what will be the color of the man arrested? The court scenes have been seen in many movies and in most of them you get what you expect in a deep south State in the U.S.A. but there area few differences there as in the rest of the movie mainly because of Foxx.\"Just Mercy\" is based on the true story of Bryan Stevenson, a black man, who, after graduating from Harvard, headed to Alabama to work for/with the Equal Justice Initiative which helps with the defense of those wrongly condemned and can't afford or get legal help . Part of the film takes place in Monroeville, Alabama, the home of Harper Lee who wrote \"To Kill A Mockingbird\". The book was published in 1960 taking place in the 1930s while the case of Walter \"Johnny D.\" McMillan takes place in the 1980s and 1990s and shows that not much has changed over the 60 years including a threat to a white woman who works with Stevenson.Bryan Stevenson is played by Michael B. Jordan, who, unfortunately, has to say a lot of the cliches written by Destin Daniel Cretton and Andrew Lanham and plays the lawyer/advocator adequately but is out-shined by Foxx  and Rob Morgan, as a Vietnam veteran living with PTSD, on death row in the cell next to Foxx. Brie Larson, as Stevenson's paralegal and colleague, really hasn't much to do while many other cast members, black and white, have cliched--there's that word again--roles you see in every movie about the South.\"Just Mercy\" should be seen and yet in today's showing there were 8 people! Maybe if people would understand that what happened in 1930, 1960, 1980 is still happening today as the following headline in today's news was:Detroit man exonerated after nearly 30 years in jail \"always had faith this day would come\""
    },
    {
      "rating": "9",
      "text": "A heartbreaking cultural phenomenon, Just Mercy concludes 2019 and kickstarts 2020 in an astute depiction of racism. By virtue of its proper pacing, raw emotion, and stellar performances among Jordan, Foxx, and Larson, the film is a hard-hitting homerun whose pure ingeniousness makes its digestion difficult yet necessary. The well-written script further aggrandizes the film's overall sentiment, which will leave audiences spellbound when leaving the cinemas."
    },
    {
      "rating": "8",
      "text": "Despite some occasional pacing issues and a storytelling approach that's fairly conventional for films of this type, \"Just Mercy\" nevertheless reaches out and grabs viewers with an intensity that earns the genuinely heartfelt emotions it evokes from audiences. With fine performances by Michael B. Jordan and Jamie Foxx, the picture touches in ways that movies of this stripe typically don't despite similarity in subject matter and narrative. One would think in this day and age that we shouldn't have to be shown films that embody stories such as this, but, given the prevailing conditions found in our ever-increasing polarized society, it's obvious the need is still there, and thankfully, we have pictures like this to step up and fill that void."
    },
    {
      "rating": "10",
      "text": "This movie needs to be in the Oscar. I’m shocked by the review score is so low. If you don’t watch it, you can’t to understand how powerful this movie means. It is base on true story and I love how bold and beautiful that the film tells the story as it is. Acting and music are amazing, I couldn’t take my eyes off the scene for a second. This is a meaningful film that it will exceed your expectation, worth every penny and your time to watch it in the theater. This film is the best gift for a true story lover.God Blessed."
    },
    {
      "rating": "8",
      "text": "Similar to this past year's \"Dark Waters,\" \"Just Mercy\" may not be blowing anybody's hair back in terms of technicality, but the thematic soul of this movie is as disarmingly pure as they come. Destin Daniel Cretton is no stranger to schmaltz. Though, what he seems to present behind all the treacly goodness is a real sense of stake, couched with a genuinely troubling issue in the American sociopolitical landscape. \"Mercy\" is no exception, laying out a richly nuanced and utterly infuriating case of undeniable injustice, elevated with terrific supporting turns and a third act that'll be sure to make you feel at least something. Whether it's Oscar-bait or not, it's hard to deny the importance of what's being communicated here. We're only as strong as our weakest link, and if our penal system is any indication of how weak things truly are, then we all have a lot of work to do."
    },
    {
      "rating": "10",
      "text": "Just Mercy is the best film of the year, all 10 days of it. I haven’t had a film punch me in the gut like that in forever. All the actors were amazing and I expect some oscar nominations. It was a very POWERFUL movie with a great message. It actually changed my stance on death row. Long after it’s over, you’ll be thinking about it. I could barely talk on the car ride home because I was so lost for words. This is what a good movie does. It feels real because it is real. This is a serious problem in our country. Its a great look in the mirror at the American justice system and I think everyone including politicians and law enforcement should see it. We see a mugshot on TV and no one sees the human side to them. We just see the picture and the media convinces us they’re guilty. Innocent until proven guilty is a lie and men have spent their lives locked away just because the justice department puts the importance of closing cases and getting convictions rather than punishing the person who actually did it. They don’t care, as long as someone takes the fall. And I don’t see how victims families sit with that when the real killer is still at large. If this movie doesn’t make your eyes water, then you’re not even human. On final note. the film was perfect - the writing, directing, and acting were all perfect."
    },
    {
      "rating": "8",
      "text": "\"Emotional Depth and Sense of Purpose\""
    },
    {
      "rating": "10",
      "text": "A super good movie and probably the best of 2020 so far. Or if you want to count this as a 2019 film your choice just a good film.Rating- 93%"
    },
    {
      "rating": "10",
      "text": "Extremely moving film about a great man and an important issue.  Could not be more timely or inspiring."
    },
    {
      "rating": "7",
      "text": "This is based on a true story about a young lawyer named Bryan Stevenson (Michael B. Jordan), who comes to the defense of a convicted death row inmate (Jamie Foxx) he strongly believes is innocent and has been wrongfully accused of a murder with the help of a young and resilient mother (Brie Larson). It's a standard courtroom drama, but it does contain a lot of heart and committed performances from all involved, even if it does follow a lot of familiar courtroom/biopic tropes. Furthermore, the film encourages thought and empathy above all else in a rather graceful yet effective manner, while there's also a fair share of tense moments and conflict. Overall, it's definitely a well-meaning true story, even if it does feel a little 'been there, done that' when it comes to courtroom and justice biopics."
    },
    {
      "rating": "8",
      "text": "Based on real events, Just Mercy leaves you speechless. It's a harrowing journey that will make your blood boil and stay with you long after you leave the cinema.World-renowned civil rights defence attorney Bryan Stevenson (Michael B. Jordan) moves to Alabama in the 1980s to defend wrongly condemned death row prisoners. With the help of Eva Ansley (Brie Larson) he works on his first case, Walter McMillian (Jamie Foxx). Although the case was built on very little evidence and some questionable testimony, McMillian was put on death row for the murder of an 18-year-old girl. Bryan delves into this case in a desperate attempt to free a man condemned to death for a horrific crime.Michael B. Jordan doesn't give an angry shouty storming around the courtroom type of performance you almost expect him to give. Instead giving a much more subtle but very powerful performance that dominates every scene. Foxx gives an equally moving performance as the tormented death row inmate. There's lots of opportunities to develop their characters and how both performances were completely overlooked for any awards is beyond me. There's a lot to dislike about awards season and this kind of blatant snubbing is one of them. Stevenson comes up against constant racism and bias during his time working with convicted dead row inmates. Just Mercy is definitely a movie to make you re-evaluate your stance on the death penalty.I was not familiar with any of the details of this story and the injustice and corruption is not only shocking in itself it's also shocking as to how recent this is. Just Mercy gives you a lot to think about, highly emotional and highly recommended."
    },
    {
      "rating": "8",
      "text": "Writer/Director Destin Daniel Cretton seems to specialize in crafting films that are stripped-down, direct and straightforward.  While his movies consistently are profoundly moving, it’s not because of action scenes, because of cute camera angles or jarring editing (I’m looking at you, Safdie brothers) or due to soaring exposition.  It’s because they offer unvarnished truth.  “Just Mercy” continues that trend.Cretton’s first major work was “Short Term 12,” a live-action short later developed into a feature film that chronicled Cretton’s experience working in a California care unit for at-risk teens.  In 2017, he co-wrote and directed “The Glass Castle,” a story of family dysfunction based on the first-person memoir of a surviving child.  “Just Mercy” is a true story based on the memoir of Bryan Stevenson (portrayed here by Michael B. Jordan), a Harvard-educated lawyer who moves to Montgomery, Alabama, in 1989 to work on appeals for death row inmates.In 1988, as the film begins, Walter McMillian (Jamie Foxx) is arrested on trumped-up charges for the death of a white woman in a dry cleaning store in Monroeville, Alabama.  The only “fact” tying McMillian to the crime is the testimony of a white convicted felon, who eventually recants his coerced testimony.  Despite a disintegrating case and a complete lack of evidence, the trial judge declines to grant a new trial.  The scales of blind justice start to look particularly wobbly.The acting here is consistently first-rate.  Jordan, who first came to prominence in “Fruitvale Station” and the Creed series of Rocky reboots, is outstanding.  Jamie Foxx is equally effective as McMillian, not necessarily a good man, but an innocent one.  Brie Larson is Eva Ansley, who helps Stevenson set up his law practice, despite the overwhelming indifference and occasional threats from a white majority who like things just the way they are.Ultimately, this is a story about restraint in the face of blatant injustice.  The scene depicting a prisoner execution in the middle of the film is an emotional high point, but it’s also a master class in reserve and restraint, not shocking sensationalism.  With real understatement, the audience is informed at the end of the film that “for every nine people who have been executed in the US, one person on death row has been exonerated and released, a shocking rate of error.”  By the end of “Just Mercy,” you’ll be feeling a slow burn of righteous indignation because you’ve been informed, not emotionally manipulated.Another virtue of “Just Mercy” is its own honesty.  It has the self-confidence to recognize that the truth of its story is self-sufficient.  The drama is kept real, but pared-down.  The exposition is minimal and understated, though occasionally elegant.After seeing this film, audience members should agree on three things:  Michael B. Jordan is not just a boxer.  Jamie Foxx is not just a former comedian.  And “Just Mercy” is not just a run-of the-mill story about injustice."
    },
    {
      "rating": "5",
      "text": "Wrongful conviction is a huge crime in this country and it would be disingenuous to claim race wasn't a major factor, but to suggest it is the only factor is as dangerous as ignoring it. Wrongful conviction is a problem with the legal and law enforcement communities, who have traded expediency for justice. Just Mercy barely touches on this, favoring a tired, melodramatic narrative that's been done to death. In that, though it has good performances and competent direction, makes it a failure as a film.. it fails because it is a vanity project posing as a noble cause movie. Unless all the proceeds went to legal aid for wrongful conviction cases, this is just pandering and marketing. It does more harm than good."
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)What do \"mercy\", piety, clemency have to do with justice? What does a film focused on a corrupt and unequal justice system to the poor and minorities have to do with the repudiation of the death penalty (\"Dead Man Walking\", Robbins 1995, and \"The Green Mile\", Darabont 1999)? If common law or Hollywood still makes such blunders, let the Yankees  go to buy Beccaria on Amazon."
    },
    {
      "rating": "9",
      "text": "Well written book material, with excellent acting. A timely movie about hope in the setting of injustice and corruption."
    },
    {
      "rating": "7",
      "text": "Just Mercy is a great story. The true story the film is based on is absolutely amazing, but the execution leaves something to be desired. Don’t get me wrong, it’s still a good film, Jamie Foxx is great, the writing is well done, but it lacks the punch a story like his should have. If you’re interested in the tale of a lawyer representing Death Row inmates in Alabama, then this film can serve as a conduit to convey the information, but it may fall a little short on the emotional level. However, this film is saved by the amazing complexity of the characters, no one is clear cut bad, and with the exception of the weakest characters (Michael B. Jordan and Brie Larson), no one is clear cut good. However, as with the emotional moments, it doesn’t feel like it takes it far enough."
    },
    {
      "rating": "9",
      "text": "Could not be more timely. Michael B Jordan and especially Jamie Foxx are incredible in this story about a man fighting for wrongly convicted death row inmates. Its a powerful piece of film against systematic racism and corruption and how far having just a bit of mercy and empathy can go in our justice system."
    },
    {
      "rating": "5",
      "text": "A tragic story that had been told many times on screen. The writer’s/directors did not deliver a new perspective. It’s the same movie you’ve seen a hundred times."
    },
    {
      "rating": "8",
      "text": "A movie for our times.  I'm a very stingy rater of movies.  This is a must see to gain some small insight on why we are in the streets."
    },
    {
      "rating": "7",
      "text": "Solid story about structural discrimination.  the acting stood out as really good; you care about all the characters (except for the ones you're not).  There were a couple surprisingly moving threads.  Good film to introduce Social Justice to your kids with.  My 14-yr old son, notoriously difficult, enjoyed it and probably learned some important realities."
    },
    {
      "rating": "5",
      "text": "JUST HAVE MERCY! THIS FILM IS SO EMOTIONALLY MANIPULATIVE! You know, just because it's based in real life events that are infurating and sad, that doesn't mean I should be crying in this film. Movies are other thing, you know. Unless it's a documentary, I should see characters and have the emotional moments be EARNED, but in this film there are characters that have absolutely no other purpose but to make the viewer feel sad for them. Not like them, not realte to them, just feel sad about them. And no, just because an actor cries doesn't mean it's a \"powerful performance\". You need to be the worst actor ever if you don't know how to cry in the appropriate moments. It's so cruel and manipulative and in terms of direction it isn't anything remarkable.Sure, because of the messages the film tried to have, it needed to be cruel, but at least have something else. I don't know, moments of levity or charm or getting to know the characters better, you know. Grave of the Fireflies (1988) is famous for being a raw, cruel, disturbing war film but it had its moments of levity and emotional character interactions, but no, in this film you shouldn't feel nothing other than misery and sadness."
    },
    {
      "rating": "8",
      "text": "Fantastic, important movie. Lovely understated performance all around. Truthful. Deserved to be recognised at Awards"
    },
    {
      "rating": "9",
      "text": "Just Mercy: An Inspiring Tale of JusticeThe Stream: A little long and the acting a little so-so at timesThe Big Screen: Inspirational and motivational story told very wellThe Final Bill: An emotional rollercoaster and civil rights advocate’s gem for 2020 and beyond.-Trip Fontaine and S2S: Movie ReviewsYOU CAN’T HANDLE THE TRUTH!!! Wrong movie…. Well this week we are able to review another surefire legal drama classic movie, Just Mercy. Based on a memoir by the real-life Bryan Stevenson, this film stars Michael B. Jordan as the young, justice-seeking, Stevenson, Brie Larson as Eva Ansley and Jamie Foxx as Walter McMillian. Just Mercy is a film that depicts part of how Bryan Stevenson became the widely respected and renown civil rights defense attorney, who has fought for wrongly convicted death row prisoners.Let’s get to it. As a person who dabbles in the legal arts myself, this movie is extremely inspirational and motivational. The social commentary of this movie is almost more important than the actual movie. This movie highlights the disparate treatment in the justice system that certain races and those in poverty have faced since probably the beginning of time but especially since the creation of this country. Just Mercy seeks to remind those who are more privileged, if they care, that those who are impoverished and disenfranchised deserve the same rights, dignity and access to just as they have easy access to. People cannot be summed up by simply their race, their income, where they are from or even one mistake they make. Compassion is a necessity and empathy is a must. Such idealism courses through this film and what led Bryan Stevenson to live this life.Michael B. Jordan, while making his typical face, was solid as the main character throughout the movie. Bryan Stevenson is kind of a thankless role. Jordan just has to be noble, steadfast and empathetic enough to portray the advocate for the inmates in need; and he does an admirable job playing that. The supporting actors really bring this film home. From Jamie Foxx, O’Shea Jackson Jr. and Rob Morgan to Karan Kendrick the supporting cast were heartfelt and convincing. In fact, they make the movie what it is. Without these strong supporting performances, this movie would have lack the soul needed to grab the audience.The only slight negatives of this movie are akin to many movies, too long and the acting is a little touch-and-go at times. On the time front, I do believe there were a few scenes that either lingered too long or could’ve been cut. Interestingly enough, I’m sure there are moments from real life that were left out of the movie that might have been just as fitting. Now, on the acting front, as much as the poignant moments hit hard the most basic moments a couple times were lame. I think they could’ve used Brie Larson a lot better. Of course, I’m not sure what her character did in real life, but I’m sure she was more pivotal to the story than displayed. The producers may have missed using her “Room” acting but at least she didn’t go full Capt. Marvel on us.Without a doubt, this movie needs to be watched in a theater. Focusing on prison reform, the death penalty and the justice system as a whole is very relevant to today even as the core of this film was set 30 years ago. In fact, I hope this movie could be someone’s inspiration like Philadelphia was for me. Hopefully, after watching this movie with a big box of popcorn, those in positions of power will view this movie and start being the solution to the historical injustices occurring in this country."
    },
    {
      "rating": "7",
      "text": "Strong performances, particularly from Jamie Foxx and Tim Blake Nelson, make for a worthwhile if predictable legal drama. The story drags at times, but the powerful moments far outweigh the lulls. Nothing here is groundbreaking, but Just Mercy works as a crowd-pleaser with a thoughtful message."
    },
    {
      "rating": "8",
      "text": "Overall a good movie. If you didn't know this actually happened you'd think the ending was just written up to give the audience a warm and fuzzy feeling. The fact that these events actually occurred (even if dramatized in the film) is a sobering reminder of how far we have yet to come."
    },
    {
      "rating": "10",
      "text": "Probably one of the best movies I ever watched. Almost made me cry in the end."
    },
    {
      "rating": "10",
      "text": "Despite what biased users and critics say to downplay or drag this movie down, we should know these themes are still revelant today. I believe the direction of this film was to open our eyes and see something meaningful,  since there haven't been many movies made of true value. Reviewers who discredit this film by saying that this film is another repeat of another racial or another moral story may not have a problem watching nothing but superhero movies throughout their life and they should because they clearly don't know what they are talking about."
    },
    {
      "rating": "10",
      "text": "Just Mercy is an abrupting scream of desperation against racism, injustice, capital punishment and corruption, and the audience can feel throughout the whole movie the struggle an afroamerican person could have lived in those years of discrimination. The movie provides no mince words in dealing with a fact of recent history, neither in depicting the arrogance and the clear dishonesty of Sheriff Tate and the hypocrisy of Mayor Chapman. The cast is just superb in performing their own roles, and the rapture is so strong that you are not able to hold the tears flooding on your cheeks. Definitely a masterpiece."
    },
    {
      "rating": "9",
      "text": "Amazing movie! It was incredibly thought provoking and heart wrenching. Imo it is a must watch for everyone"
    }
  ]
}