{"id": 362, "title": "Justice Society: World War II", "starring": ["Stana Katic", "Matt Bomer"], "runtime": 84, "genre": ["Animation", "War", "Science Fiction"], "description": "When the Flash finds himself dropped into the middle of World War II, he joins forces with Wonder Woman and her top-secret team known as the Justice Society of America.", "releaseYear": "2021", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/e4REOC6CZW8J6FslA4nRvdQXFXR.jpg", "categories": {"plot": 4.0, "acting": 4.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "This was such a letdown. It had a really strong start setting us up for potential super nazi's with mystical powers but halfway through the film we reach atlantis and find out Aquaman is brainwashed and from there its just brainwashed Aquaman and atlantis attacking new york, something thats already been done in the throne of atlantis film, which is much better btw. Really disappointed I didnt get super nazi's getting their butts kicked instead of a rehash from a previous film. this can be skipped."}, {"rating": "4", "text": "Some words and phrase come to mind to describe this movie in terms of Warner Bros. animation. Diminishing returns. Stale. Quality over quantity. Zzzzzzzz. The voice acting is praiseworthy. Combine their performances with better animation and maybe this movie could have been something. There was time when DC animated movies were something to see. That time has passed.The story itself is not bad but definitely well told. Modern age hero’s often travel to the past to visit the golden age and silver age versions of themselves. Seeing it before is not the issue. The problem is seeing it done better. Maybe this is a streaming service issue. Subscribers need content. Warners Bros. has to feed the beast. I’ve lost my appetite."}], "recommendations": ["smurfs_the_lost_village", "antz", "tinker_bell_and_the_legend_of_the_neverbeast", "ralph_breaks_the_internet", "avatar", "maya_the_bee_movie", "mulan", "ferdinand", "rock_dog_2_rock_around_the_park", "the_time_machine", "the_good_dinosaur", "beowulf", "godzilla_king_of_the_monsters", "raya_and_the_last_dragon", "monsters_university", "toy_story", "how_to_train_your_dragon_the_hidden_world", "my_little_pony_a_new_generation", "moana", "brave", "city_of_ember", "rocky_balboa", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "voyagers", "speed_racer"]}