{"id": 2895, "title": "Just Friends", "starring": ["Ryan Reynolds", "Amy Smart"], "runtime": 96, "genre": ["Comedy", "Romance"], "description": "While visiting his hometown during Christmas, a man comes face-to-face with his old high school crush whom he was best friends with – a woman whose rejection of him turned him into a ferocious womanizer.", "releaseYear": "2005", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/jgs2mdFlx8NJzbxXTHeQxvQbN6n.jpg", "categories": {"plot": 5.0, "acting": 6.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.76, "action": 5.0}, "reviews": [{"rating": "5", "text": "Anna Faris is the single thing that made this movie funny, other then that it was boring. I didn't really care about the characters and couldn't feel chemistry between them. It's nothing more than a rental."}, {"rating": "4", "text": "It's really hard to like this movie but impossible to totally write it off. My brother and I went to this late Sunday night hoping it would lift the intensity that Thanksgiving weekend brings. It did, but we left wanting much more. The plot is complete and the story is told well, however it does not flow right. You find yourself wanting more in some parts and feeling uncomfortable in others because you feel situations are forced. Serioulsy, continous slapping of the brothers could have been a hilarious ongoing joke but rather you felt it happened to try and get a quick laugh and nothing else, just a tad awkard at some points. Funniest parts came from the two side characters of Klein and Faris, who should be compliment characters not the main draw. I like Amy Smart and Ryan Reynolds but just not together, just didn't work. Anyways to wrap this up, the movie has some decent parts but you'll find yourself waiting for something, something better from these individually funny actors, but it just never comes."}, {"rating": "4", "text": "Just Friends is a very cookie-cutter, by the books, Hollywood Rom-Com from the mid 2000s. A dark time indeed. However, the cast is very entertaining to watch, and they do their absolute best with what they are given. If you can sit through the whole thing, you'll find a couple of honest, comedic moments."}, {"rating": "0", "text": "Very, very unfunny. Stupid, cliched movie. What an insulting movie to watch."}, {"rating": "10", "text": "2nd best movie of 2005."}, {"rating": "10", "text": "Just watched it, funniest movie I have seen in ages."}, {"rating": "8", "text": "An admitted guilty pleasure of mine, \"Just Friends\" is a charmingly and candidly honest comedy with some hilarious one liners and a gut-busting performance from Ryan Reynolds."}, {"rating": "10", "text": "The best comic movie i've ever seen in my life!\rEspecially for Anna Faris, I've laughed a lot and watched it a lot of time with my friends!\rIt's that kind of film that you can watch everytime you want and you still laugh a lot.\rI can't understand why people don't like it: it's a drug!"}, {"rating": "8", "text": "Funny movie!!! Its a well done film that never insults your smarts...its actually very witty. Does a great job playing on the whole best friend/boyfriend relationships with teens and 20 year olds. The whole Britney Spears character was too funny...go see it!"}, {"rating": "9", "text": "Definitely one of the funniest \"romantic comedies\" I can remember seeing in the past few years, but still not near as funny as \"Waiting\" (which also stars Ryan Reynolds and Anna Faris)."}, {"rating": "8", "text": "Such a quotable movie. Just watch it and have a good time, because you will!"}, {"rating": "6", "text": "Nicely cast, moderately amusing. If you"}, {"rating": "8", "text": "The slutty girl was the best part! she actually was teh ebst actor in the movie, she played a paris/lindsey wannabee better then anyone i've seen. Anna Faris has charm, looks and above all, a promising acting career( at least in comedies). i gave the movie a B+, aka an 8.3. there were some parts that seemed contrived and unfunny, but everytime the singer ( anna faris) would grace us with her hilarious presence, i knew it would be a funny movie. i wouldnt say this is a \" go out and see it now\" kind of movie, but it's definately worth at least one watch."}, {"rating": "10", "text": "Just Friends is the funniest movie I've seen in years. If you miss this movie you are definitely missing out. Don't listen to Roger Ebert, he obviously has no sense of humor. This movie is not only hilarious, it is touching and inspirational. My friend who's seen it twice went with 8 friends and they all \"laughed their a**es off.\" Don't wait until it's on DVD, see this one in the theater."}, {"rating": "9", "text": "One of the BEST movies I have ever seen! Anna Faris plays a hilarious character and Ryan Reynolds provides some light humor. I could watch it a million times and never ever get bored of it. HILARIOUS!"}, {"rating": "7", "text": "Anna Farris is fn hilarious. Nice to see her take control of her scenes."}, {"rating": "6", "text": "I laughed. 'Twas not an award winning super duper movie, but really what didja expect?"}, {"rating": "9", "text": "Great movie, especially if you like Ryan Reynolds. Should have scored higher - worth the rental!!"}, {"rating": "7", "text": "Funnier than you'd expect, with heart in the right places (but not too much). Deftly balances romance and comedy -- not as deftly as \"Wedding Crashers\" but in the same spirit."}, {"rating": "7", "text": "I think it was funny. I give it a seven because I think the slutty girl kind of ruined the movie. The rest was pretty good. I think that she shouldn't have been so slutty."}, {"rating": "4", "text": "It's kinda funny but also so ridiculously bad on a very basic plot and character arch level. Amy Smart's character literally just behaves exactly how each scene dictates and it's not influenced by any scenes before and after that have happened to her. She likes him, hates him, keeps going out with him, hates him, doesn't like the other guy inexplicably. None of it matters at all.I know it really isn't supposed to matter that much in a movie like this but if the filmmakers can't even gets something that basic right what does that say about the rest of it? Nothing good, that's for sure. Anna Faris is enjoyable crazy as usual."}, {"rating": "9", "text": "A hilarious comedy about being stuck in the friend zone which I think a lot of people can relate to. Ryan Reynolds is hilarious in probably one of his best roles (despite the fact he still plays a douche at times) but Anna Faris is also worth mentioning as she provides the most laughs (toothpaste anyone)! A little predictable perhaps but there is plenty here to keep you entertained and have you laughing the whole time :) Overall well worth a look if you're in need of a good laugh!"}, {"rating": "5", "text": "The comedy about a second chance.\r I'm reviewing a decade old film. This kind of themes is very much done for the current era, particularly in Hollywood. You can't believe this guy did a film like this back then. I'm obviously talking about Ryan Reynolds. It was just for fun, other than that there's nothing to expect from it. Clearly we know how the story begins and ends, but we're only going to see the middle parts, how they developed it, especially the comedies.\r All the actors were decent, particularly Amy Smart was much preferred actress than what she's now. Ryan Reynolds with those dual getups was not bad either and Anna Faris was excellent in the comedy parts. Maybe it is a chick film, or close to that category, but the perspective of the story was from a man.\r Being a geek in the high school, how he transformed into a handsome man is the film. When he visits his hometown, all the old memories comes back to the life, particularly after seeing his old close friend who he had a crush on her, but never revealed it. So it is like his second and probably final chance to express his feeling. How it all develops and ends was the remaining story.\r Being a comedy, it has not delivered anything big. It might have effected good way, if I had watched when it came out. So not everyone who watches it would end up happily. It is not easy to suggest this film for everybody, but if you're looking for a comedy, some comedy, it will work okay. And again, don't take it seriously, even some of the jokes are too ordinary, but tried its best. An average comedy, but a good time pass film.\r 5/10"}, {"rating": "5", "text": "Averagely funny romantic- comedy, with a lot of the comedy at the main character's expense, some of it for his chubby teen years. A few laughs here and there, including a spoilt pop-star, but left me with a guilty feeling for finding fat funny. Worth a look if you and yours are all slim."}, {"rating": "7", "text": "I'm giving this movie a 7 because of the nostalgia alone it's so relaxing to watch at any time of year and at any  of time of day there are a lot of things in the movie that dont make sense realistic wise but its.a 2005 cliche so that's expected. There are a lot of wholesome values that I think make it feel good movie and not to mention its classically funny  I'm only posting ngf"}], "recommendations": ["just_go_with_it", "blended", "forgetting_sarah_marshall", "the_wedding_ringer", "the_proposal", "grown_ups", "the_other_guys", "meet_the_parents", "what_happens_in_vegas", "dinner_for_schmucks", "zack_and_miri_make_a_porno", "50_first_dates", "the_break_up", "neighbors", "step_brothers", "trainwreck", "friends_with_benefits", "wedding_crashers", "ted", "old_school", "knocked_up", "bad_santa", "date_night", "sisters", "tammy"]}