{"id": 3860, "title": "Just Like Heaven", "starring": ["Reese Witherspoon", "Mark Ruffalo"], "runtime": 95, "genre": ["Drama", "Comedy", "Romance", "Fantasy"], "description": "Shortly after David Abbott moves into his new San Francisco digs, he has an unwelcome visitor on his hands: winsome Elizabeth Martinson, who asserts that the apartment is hers -- and promptly vanishes. When she starts appearing and disappearing at will, David thinks she's a ghost, while Elizabeth is convinced she's alive.", "releaseYear": "2005", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/aeEgEKS25GureCQRTNV5SywqvjN.jpg", "categories": {"plot": 6.75, "acting": 6.5, "ending": 8.0, "soundtrack": 6.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.636363636363637, "action": 5.0}, "reviews": [{"rating": "9", "text": "----------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"}, {"rating": "9", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\"\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\""}, {"rating": "9", "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¡¤¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"}, {"rating": "9", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■●■$$$$$$$$$$$$$$$$$$$$$$$$$$$+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷÷=="}, {"rating": "9", "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"}, {"rating": "9", "text": "Just like Heaven is hilarious, Reese & Mark are terrific together and the supernatural plot mixing with the comedy and romance is spot on."}, {"rating": "9", "text": "The perfect romantic comedy with a fantasy twist !!!I think this is an awesome romantic comedy! Mark Ruffalo, and sexy Reese Witherspoon were perfect together! Reese plays a workaholic doctor named Elizabeth Masterson, who is involved in a car accident. Months later, David Abbott rents her apartment. Soon after, Elizabeth appears and frightens David. After a while she keeps showing up asking him to leave, but he won't. Later they start to like each other and want to help each other. Elizabeth is still alive, but in a coma. Elizabeth's sister has to make the decision of taking her off life support. David tries to stop her from signing the papers, but he's too late. David must figure out a way to either stop it from happening, or bring her back. If you love romantic comedies, you'll love JUST LIKE HEAVEN !!!"}, {"rating": "9", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■"}, {"rating": "9", "text": "÷/÷=÷=÷=÷=÷=÷/÷/÷/÷/÷/÷/÷/÷=÷=÷=÷=÷=÷=÷=÷=÷=÷=÷=÷=÷=÷=÷=()()()()()()()()()()()()()()()**************************"}, {"rating": "9", "text": "+÷*:**:*:*:*:*:*:*:*:*:**:*:*:+÷+÷++÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆⊙☆⊙☆⊙☆"}, {"rating": "7", "text": "Not every movie ever made has to reinvent the wheel, redefine cinema as we know it, or be Citizen Kane on a stick. (And let's be honest...each and every one of us would be physically as well as intellectually exhausted if they all did!) Sometimes you just want a movie that skillfully and pleasurably replows very well-trod ground; a Cellular, or a Mr. 3000...or a Just Like Heaven. Not that there wasn't any real reason going in for me to expect it to be something more along the lines of Just Like Purgatory at best: the poster tagline 'It's a Wonderful Afterlife' rips off the title of my all-time favorite film; the success rate of supernatural romcoms is about as low as Enron's 2005 gross earnings (for every Ghost there seems to be a dozen Chances Ares, Hearts and Souls or Heavenly Kids); and quite frankly, Reese Witherspoon had pretty much worn her cutesy-princess act down to the nub. You've got to have a Babar-like memory to recall when Witherspoon was The Queen of Indie Edge; the final straw was broken last year when she torpedoed Mira Nair's Vanity Fair by playing Thackeray's unlikable, manipulative Becky Sharp as the great-grandmother of Legally Blonde's Elle Woods. But Leslie Dixon's and Peter Tolan's solid comedy writing wisely gives Witherspoon some prickly, bristly qualities not seen since Election as a ghostly being visiting her old domicile and irritating its current resident, a bereaved, semi-alcoholic couch potato played by Mark Ruffalo, until they...well, you know. (Hey, I didn't say it was original; I just said it was enjoyable.) As in 13 Going On 30, Ruffalo is your go-to guy when you want to cast an endearingly ordinary, down-to-earth shlub--in other words, someone representing 90% of your male audience--as your romantic lead, and he and Witherspoon create a lot of very funny Oscar Madison/Felix Unger vibes in the early sequences. If you wanted to make the claim that Mark Waters is the best commercial comedy director currently working in movies, I won't give you THAT much of an argument; he did possibly the best Disney comedy remake ever (Freaky Friday) and both the best SNL-vets-on-film film since, oh, let's say Tommy Boy, AND the best high school movie since the aforementioned Election with last year's Mean Girls. Waters' handling of Heaven's two scenes involving Witherspoon's sister (Dina Waters, the director's wife, who presents a rare argument in favor of casting nepotism) rather dazzlingly blends all kinds of conflicting moods including slapstick, comic misunderstandings, cute-kid humor, life-or-death suspense and much more; at his best, the man's an alchemist. But then, his expert pacing of every scene in Just Like Heaven makes it a surprisingly effective and entertaining blend of laughs, tears, drama and romance. Not that it's perfect or without flaws; the sexy neighbor subplot looks like outtakes from The 40-Year-Old Virgin that Judd Apatow wisely had removed, and the casting of Napoleon Dynamite himself, Jon Heder, as a psychic bookstore employee would've seemed slightly less opportunistic if Heder limited his use of the term \"dude\" to every sixth word rather than every fourth. And some viewers will find the hospital-based climax a little too disturbingly close to a certain controversial event that dominated the news earlier this year; a few social liberals may even take offense at certain plot twists. As someone who often fits into that political category myself, I can only give two responses to these folks: 1.) It's. Only. A. Movie.; and 2.) Consider it tit for tat for the conclusion of a certain actor-director's Oscar-winning film from last year that annoyed certain conservatives...and let's call it even."}, {"rating": "8", "text": "Way more than I was expecting out of a modern-day romantic comedy. I was laughing most of the way through because everyone thought Mark Ruffalo's character was talking to himself. Definitely an interesting twist on a love story."}, {"rating": "10", "text": "this movie was an awsome and inspiaring lovable and laghabull movie.i really love it and i even bought it."}, {"rating": "9", "text": "A truly enjoyable film. Yes, it pleases me to no end to see Reese WItherspoon comatose in her hospital bed after all the Blonde thing, or Mark Ruffalo clothed in bed after 'In The Cut', but forget chemistry, or believable sub plots or background, and chances are you'll be bawling your eyes out 90 minutes into the film. Both of them are wonderful actors and having seen all of Mark Ruffalo's films, this is probably one where he appears effortlessly hearbroken without having to crease his brow."}, {"rating": "9", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"}, {"rating": "9", "text": "nihihhigugibinnihihhiihhinoonononnoonohohihihihihihihihihihughiihihihhiihininonononinhihihiihihihinniohhiihihihi"}, {"rating": "9", "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》********************************************************"}, {"rating": "8", "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●"}, {"rating": "9", "text": "¡¿¡¿》¡¿¡¿》¿¡¿¡》¿¡¿¡》¡¿¡¿》¡¿¡¿》¿¡¿¡》¡¿¡¿》¿¡¿¡》¡¿¿¡》♤♡♤♡♡♤♡♤♡♤♡♤♡♤♡♡♡♡♡♡♡♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡"}, {"rating": "10", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.●》●》●》●》●》●》●》●》●》■》■》■》■》■》■》■》"}, {"rating": "6", "text": "For once, the trailer didn't reveal all of the film's secrets. When \"Just Like Heaven\" gets there, and you're a music fan who watched \"120 Minutes\" with Dave Kendall in the late-eighties, you'll smile, because the song it evokes came out the same year as The Cure classic. \"Just Like Heaven\" gets considerably better when the premise changes. Elizabeth(Reese Witherspoon) and David(Mark Ruffalo) become less irritating after she learns about her relationship with the world. Their bickering over who owns the apartment gets old real fast. When they open up to each other, it's not that painful to watch like your lesser romantic comedies, where the actors have little or no chemistry. A believable couple hides the contrivances of their inevitable coupling, typical of this genre. What's missing from \"Just Like Heaven\", however, is a romantic gesture that evokes the fatalistic whine in Robert Smith's voice."}, {"rating": "5", "text": "As bland as weak tea."}, {"rating": "1", "text": "Witherspoon and Ruffalo's magic on-screen caused me to leave the theater early. And not even stoner-like, but real life mormon, Jon Heder, could save the day."}, {"rating": "4", "text": "A little under mediocre. The cast's talents are wasted by a childish story that only young one's would get the comedy out of it, and the romantic part is not really up to par with current romantic films."}, {"rating": "5", "text": "The male lead was horribly miscast! The role cried out for either Jim Carrey or Steve Martin. I like Reese, but she is veering into Meg Ryan territory."}, {"rating": "3", "text": "One critic spoke of the \"chemistry\" between Reese Withersoon and Mark Ruffalo. I didn't experience any. Even the lame plot carries the thesis that each character is \"dead\" and wants to use the other to revive his or her interest in living Well, it didn't work. Bad casting of good actors kills another movie."}, {"rating": "6", "text": "Nodding to classics such as Ghost and Heaven Can Wait, Just Like Heaven is another formidable entry into romantic-comedies venturing beyond life and love."}, {"rating": "8", "text": "Very enjoyable story. Not perfect but very watchable"}, {"rating": "8", "text": "I got talked into seeing this; I had planned on skipping it after the tepid reviews. After seeing it, I'm a little mystified by the reviews. The acting was very good, the script was laugh-out-loud funny in places, and the whole thing was quite enjoyable."}, {"rating": "9", "text": "Light-hearted and FUN!!! Sure, you know where the story is going but there are a couple of twists which make it a fun ride. What movie did Jami Bernard watch? Not this one."}, {"rating": "8", "text": "Esse é um antigo e divertido filme dos anos 2000 estrelado por Reese Witherspoon e Mark Ruffalo.Viajando por um espiritismo selecionando, que aparece apenas para David a tal de Elizabeth, que não sabia que estava em coma, entre comédia e drama a ótima ideia do filme dá uma lição: será que estamos mais trabalhando do que vivendo?Claramente Elizabeth trabalhava como médica e fica até sem dormir para conseguir um cargo 'melhor' e no fim vê sua vida se acabando em um coma.Com a ajuda de David ela tenta voltar seu corpo em uma cena cômica, com muitas tentativas, finalmente ela volta a vida com ajuda de David porém acaba o esquecendo ao acordar.Por um lado ti faz rir e do outro ti faz pensar que a vida tem e deve ser uma festa!"}, {"rating": "8", "text": "It's a little heavy-footed and almost tries too hard, yet I quite enjoyed 'Just Like Heaven'.Reese Witherspoon and Mark Ruffalo are a strong pairing, with Jon Heder spearheading a good support cast ably. It's a well paced film at around 90 minutes, there are some decently amusing scenes in there alongside some more sombre ones - the majority of which come off rather well. Some parts are cliché, but not to the degree that it affected my enjoyment.One that is well worth a watch, in my opinion of course."}, {"rating": "9", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆⊙°••°⊙☆•°⊙☆•°⊙☆☆⊙°•☆⊙°•☆⊙°•☆"}, {"rating": "9", "text": "Starring: Donal Logue, Mark Ruffalo, Reese WitherspoonSummary: An architect believes his San Francisco apartment is inhabited by a ghost."}, {"rating": "9", "text": "A hilarious comedy with a supernatural twists. Reese and Mark are perfectly matched in the movie."}], "recommendations": ["friends_with_benefits", "leap_year", "life_as_we_know_it", "wanderlust", "last_vegas", "morning_glory", "little_miss_sunshine", "due_date", "10_things_i_hate_about_you", "the_holiday", "sisters", "17_again", "forgetting_sarah_marshall", "blockers", "silver_linings_playbook", "no_strings_attached", "the_dilemma", "the_break_up", "sleeping_with_other_people", "me_and_earl_and_the_dying_girl", "how_to_lose_a_guy_in_10_days", "chef", "you_again", "the_nice_guys", "groundhog_day"]}