{"id": 3761, "title": "Just Before I Go", "starring": ["Seann William Scott", "Olivia Thirlby"], "runtime": 95, "genre": ["Comedy", "Drama", "Romance"], "description": "Ted Morgan has been treading water for most of his life. After his wife leaves him, Ted realizes he has nothing left to live for.  Summoning the courage for one last act, Ted decides to go home and face the people he feels are responsible for creating the shell of a person he has become.  But life is tricky.  The more determined Ted is to confront his demons, to get closure, and to withdraw from his family, the more Ted is yanked into the chaos of their lives. So, when Ted Morgan decides to kill himself, he finds a reason to live.", "releaseYear": "2015", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/rEwXZIOh3CLVA5JJmxT5kaYY6ff.jpg", "categories": {"plot": 7.25, "acting": 6.5, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.714285714285714, "action": 5.0}, "reviews": [{"rating": "7", "text": "What a beautiful movie. This is indeed silly comedy but there are emotions and pain deeply embedded in it.\r I don't understand how can critics give movie like this 20 score while mind numbing movies are becoming blockbusters with 80-90 scores."}, {"rating": "8", "text": "Surprisingly good, funny with a nice mix of sentimentality. Surprising because the \"critics\" trashed it. The user scores are considerably higher (see Rotten Tomatoes) because it's fun and entertaining. Isn't that what we want in a movie?"}, {"rating": "8", "text": "This was a surprisingly good movie. It had it's funny moments, it's sad ones, the acting was really good, the story was touching and the movie was, overall very good. The ending was a little disappointing, but still, it was a very good movie."}, {"rating": "5", "text": "Courtney Cox steps into the director chair for Just Before I Go. This film boasts a pretty good cast headlined by the typecast breaking Sean William Scott. He seemed to be branching out a little bit in goon in order to break away from the Stifler persona he has become known for, but it is this movie where he shows that he is a legitimate actor with something to offer. The rest of the cast is pretty good as well. Oliva Thirlby was good in this movie as well and was sadly underused despite being fairly likeable. I thought the movie was surprisingly funny as well. The downfalls of this film are its overreliance on quirkiness at the first and then breaking off into an unnecessary drama in the third act which loses the tone. Its sadly pretty clichéd for a film that seems to be embracing being offbeat."}, {"rating": "8", "text": "Sometimes facing the past is the key for the future.Whoa! Why I did not see it before! Seems I totally underestimated it. Lots of good films were released in the 2015 and this is surely one of them. Among the small cost films, this is one of the top 5 films. There's no logic, just a simple storyline with a dark humour. Most of the scene seems deliberate, yet as a one film, very enjoyable.A man whose life has never been so colourful, was once saved by a woman who later married him. But now they are separating and he's now getting back to his old position. Instead, he decides to end his life. Before that, he makes a list of 'to do'. Hence returns his hometown to face his past. Begins his quest which will be accompanied by a young woman. The rest of the film focused on the final days of his life.I saw it, that's all matters. Because, being a cinephile, I should not miss such a nice film. It's common some films go unnoticed, thankfully I found it. Now I definitely suggest it to others. Awesome performances. I liked every one of them. Sean William was top of it. Olivia Thirby was cute as usual. I had some good laughs, a few of them were loud ones. I could not believe it was made by Coutney Cox. She did a fine job. It was screenplay she has got, but I hope she will be doing more such heartwarming drama films.8/10"}, {"rating": "6", "text": "This film has a 24 on metacritic so my expectations were incredibly low for this film but its not awful by means. Seann William Scott plays against type here and does well doing so and most of the cast here does well with their respective roles. Kate Walsh feels wasted here but thats about it. Its a film that obviously deals with suicide so it's a touchy subject for some but I would compare it to Seven Pounds as it carries a sweet message and offers up good performances and heavy moments to warrant a watch. Most of the issues to me where in the screenplay, some of the comedy doesnt hit and you see some things happen in the film and it just makes you go, \"but why?\" Like i said, its not a bad film. Its decent enough to warrant a watch and carries a good message to go home with."}, {"rating": "10", "text": "From knowing of Seann William Scott almost exclusively from his role in the American Pie films, I was expecting this to be filled with the same type of humour and craziness. To my surprise, this film was nothing like that.Just Before I Go is a beautiful film that tackles suicide and homosexuality among a few other things. It does this while still having an overlying tone of light comedy, which I think works perfectly together.All in all, it's a great film that deserves more than the critics have given it. I applaud the film makers and Seann William Scott for making this emotionally thought provoking film."}, {"rating": "10", "text": "This film take my feelings so deeply, not only about gays, about the life and such a big game of, William Scott! Maybe in soon time i will re-watch It. such great, funny and dramatically movie."}, {"rating": "9", "text": "Funny, surprisingly smart and deep.Goes into the complexity of life in all its ugliness and beauty in a light hearted way.The movie doesn't take itself seriously and its a good light flick to make you appreciate life."}, {"rating": "6", "text": "This... this really wasn't that bad... not great, but honestly, not horrible... you'll not hate watching."}], "recommendations": ["delivery_man", "the_break_up", "life_after_beth", "the_upside", "the_king_of_staten_island", "sleeping_with_other_people", "eddie_the_eagle", "friends_with_benefits", "the_ultimate_gift", "logan_lucky", "seven_psychopaths", "the_nice_guys", "chef", "i_feel_pretty", "the_five_year_engagement", "50_first_dates", "pitch_perfect_2", "the_dilemma", "passengers", "the_paperboy", "click", "in_bruges", "the_family", "hustlers", "hancock"]}