{
  "id": 1068,
  "title": "Justice League",
  "starring": [
    "Ben Affleck",
    "Henry Cavill"
  ],
  "runtime": 120,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "Fuelled by his restored faith in humanity and inspired by Superman's selfless act, Bruce Wayne and Diana Prince assemble a team of metahumans consisting of Barry Allen, Arthur Curry and Victor Stone to face the catastrophic threat of Steppenwolf and the Parademons who are on the hunt for three Mother Boxes on Earth.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eifGNCSDuxJeS1loAXil5bIGgvC.jpg",
  "categories": {
    "plot": 5.135135135135135,
    "acting": 5.04,
    "ending": 3.6666666666666665,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 6.0,
    "funny": 6.444444444444445,
    "action": 5.333333333333333
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Justice League has problems with its thin plot, inconsistent tone, cheesy dialogue, and mediocre CGI, but it works overall as a fun romp. It's characters, both new and old, are very likable, the humor is pretty good when present, and the action is fun. It's a perfectly serviceable movie, better than most of DC's recent efforts, but it still has a long ways to go."
    },
    {
      "rating": "6",
      "text": "Finally.. After so many efforts.. DC was able to collect more than 3 Superheroes in a movie. But did it create the magic Marvel’s Avengers was able to.? You’ll find out very soon.. here only.. :PSo, Justice League.. Hmmm.. Why DC.? WHY.? One good movie, all the critics around the world was Happy after you gave us Wonder Woman.. And next  WHY Snyder.? After watching his (this) 3rd debacle, I say “HE SHOULD RETIRE FROM DIRECTION.” Disappointed Direction as usual.. :D->>> Things I liked:-~ 2-3 Superb sequences with Flash.. As you all know, “SUPERMAN LIVES” Yippyyy.. :3 And Yes, I mentioned Superman.. In Flash’s column.!! Watch the surprise in theater ;)~ Villain was Powerful. I thought without Superman, others don’t stand a chance defeating him.. And what is Justice League w/o Superman.? Pfffff.. :D~ And WONDER WOMAN :* :3->>> Disappointed Things (there is global audience for Things I didn’t like so):-~ Aqua-man was Okay Man.. :D He didn’t do anything with “Aqua” as his name suggests, rather than swimming in ocean for trailer purposes.. :D~ Cyborg had some more scenes than Aquaman.. Just more scenes.. Nothing exciting there..~ Flash has sequences BUT other than that, his comic timing was FLAT. I did’t chuckle ‘much’ at his jokes. TV’s Flash Grant Gustin is Way Much Better..~ Batman’s butler Alfred, Superman’s Girl Miss Lane, His Mom Martha, Commissioner Gordon, Cyborg’s Dad, Amber Heard :D all of them had minor screen time..~ I was surprised to see Batman & WW also didn’t have much exciting screen presence.. You know, when you see a Superhero, it should Feel like Superhero.. Or at least a human being with their respective flaws.. But DC has this Special Ability to Overdramatize scenes.. Well done..Hufffff.. At last, want to say, Enjoyed fight sequences, Flash’s sequences & Wonder Woman ;) :3 :*Rating is.. No drum rolls this time.. Better if you’re drunk..Peace V"
    },
    {
      "rating": "7",
      "text": "This movie was indeed fun and actually satisfied the comic book nerd in me with its superhero bits. Although some of the CGI and the rapid pace of action scenes were a bit letting off towards the last act, the league stands out as a whole on whose shoulders the movie marches well forward. Every character shines and makes this movie worth investing your time at the cinemas whether regardless of being a comic book fan or mainstream. Ezra's Flash was a real charm and not to mention Superman's actual moment which was the biggest USP that satisfies hardcore fans like myself."
    },
    {
      "rating": "8",
      "text": "I give Justice League a solid B as a grade. As a comic book reader, I enjoyed the movie and I was thoroughly entertained. The movie is epic, maintains its' serious tone, and still manages to make you laugh with humor without it becoming a parody. You can definitely see Joss Whedon's additions to the movie which lightens Snyder's more serious tone. I read some of the reviews from critics and I had to wonder if we even saw the same movie."
    },
    {
      "rating": "5",
      "text": "The Justice League’s enemy wasn’t Steppenwolf but lackluster writing, haphazard directing and an incoherent narrative. Not even Wonder Woman could lasso this disaster out of harm’s way"
    },
    {
      "rating": "7",
      "text": "\"Justice League\" is a rather flawed movie. Its pacing often feels rushed (thanks to Warner Bros' insistence that the movie be under 2 hours), the CGI is painfully obvious (some of the post-production work on Clark's face is meme bait), and Steppenwolf isn't exactly a villain to write home about. That said, it's also got plenty of entertainment value. It's considerably lighter than Zack Snyder's other two DCEU films, the characters all have good chemistry with one another and are given their own moment to shine, and it's exciting in that \"superheroes coming together to save the world\" way, much like \"The Avengers\" was. If you've dreamed your whole life of seeing the Justice League come together on the big screen, you're unlikely to be disappointed, so long as you adjust your expectations."
    },
    {
      "rating": "4",
      "text": "I defended BATMAN V SUPERMAN. I’m a DC fanboy. But this film just isn’t good. Despite costing $300 million it’s hideous to look at. Despite Joss Whedon and Oscar-winner Chris Terrio behind the script the plot is practically incoherent. And because WB forced a 120 minute runtime, Snyder’s ambitious hands were tied. It’s a letdown of massive proportions."
    },
    {
      "rating": "7",
      "text": "Movie was really fun! Plot is nothing to write home about, but the heroes make the movie. I feel liie many of the critic's reviews are overly harsh. I was pleasantly surprised."
    },
    {
      "rating": "9",
      "text": "This was one of the most enjoyable movies I've seen in a very long time, and has to be my favorite super hero movie of the year. The atmosphere and cinematography were top notch. Reshoots and CGI could perhaps have been better in places, but in what movie in this decade isn't that the case? I also missed the Zimmer music in places it would have fit nicely, including the cornfield scene where one of the Man of Steel pieces was used. That's all that really bothered me, other than the film could have perhaps been longer. Batman was a pleasure to watch. Wonder Woman has several amazing moments. The Flash was funny and endearing. Aquaman managed to actually make me interested in his upcoming film, and that alone is a feat, as he was never a character that interested me. A certain someone was the 'S'tar of it all, as I believe was always intended, and more how people wished him. Steppenwolf served his purpose of being a menacing plot device to frame the formation of the League, also.Just seeing the League interact on screen, and mythical heroes duking it out in ways and on a scale you just don't see elsewhere, was a pleasure. I plan to see the movie several more times."
    },
    {
      "rating": "7",
      "text": "Justice League is a team movie, and the team in here works in a great way, every single one have his moments, the movie introduces the new characters quickly and well. This movie shows the hero in there more pure way, caring about the people and saving them. the action scenes, the league working together are just wonderful to watch. The story is simple, the villain is nothing new, although that i like it, it semmed like a semi-boss, felt threatening and you believed that he could destroy all members of the league, almost. The movie shows hope and optimism, a lot of jokes and light moments that worked well in the most. I really enjoyed watching this movie and when i get out of the movie theater i was just smilling around."
    },
    {
      "rating": "8",
      "text": "The beginning of the movie is a bit bumpy but when the movie starts to pick up, it really does shine. The chemistry between the members of the Justice League and how they work together is amazing to see on the big screen. The cgi for Steppenwolf looks straight from a video game. If you thought Ares in Wonder Woman was bad, this is even worst but seeing them beat the **** out of him makes it up. This is a lot more lighter in tone compared to the other DC movies and its definitely in the right direction. There is some hints of studio meddling by making them cut it down to around 2 hours which ruins the pacing of the film. The scene stealers have to be Jason Mamoa as Aquaman and Ezra Miller as The Flash and someone else which I cannot say to avoid spoilers. There is a particular scene where The Flash and this person interacts that had the whole theater roaring in laughter like how the Hulk interacted with Loki in The Avengers. The score is a really big treat for this film. Danny Elfman incorporates themes of the past that we are familiar with into this score like the original Superman theme and of course Tim Burtons Batman theme. This is a really fun movie and I highly recommend people to give it a try even if they thought the last couple movies were lame because this movie is getting a bunch of bad rep due to the critics score. Do not let bias pre meditated opinions dictate your choice of seeing this film just because you love Marvel more than DC. You can like both and it is possible. Thor Ragnorak was a fun ride and I enjoyed it and Justice League is also a really fun ride also. PS: There is 2 stinger after credit scenes at the end."
    },
    {
      "rating": "9",
      "text": "Its incredible how they take this seriously but without being dark.The animated series in movie form, every character has its time to shine and doesnt feel repetitive.It proves that it doesnt have to be dumb or full of jokes to be good."
    },
    {
      "rating": "3",
      "text": "Justice League is the culmination of a grand total of three movies (Discounting Suicide Squad), where our beloved DC characters band together and forms the eponymous league. It offers bite-sized bits of fun in its action and character dialogue, but ultimately proves to be a clumsy attempt at brightening up the atmosphere of Snyder's DC universe. It is unrewarding and shallow at anything it tries to explore.-THEME-The film opens with an amateur recording of Cavill's Superman, offering his cheerful wisdom (of which he had none in his previous two films) in a dialogue about hope and car keys, suggesting that the central theme of the movie is hope. And since his passing in BvS, the world was rocked into anxiety and distress.This theme, however, was never explored any further. The movie never shows the emotion of hope draining or rejuvenating our characters. In the end, the movie has no theme to revolve around, resorting instead into a mindless fight of good and evil, where our heroes race to stop Steppenwolf in his conquest to gather three loot boxes and destroy the earth... for no reason other than \"because I am Steppenwolf\".-CHARACTERS-Steppenwolf himself proved to be a very forgettable wet blanket of a villain, with one-note dialogue that revolves around the words \"box\" and \"destroy\". He does not provide the protagonists with moral or philosophical quandary.On the other hand, a few of our protagonists (specifically Miller’s Barry Allen, Gadot’s Wonder Woman, and Momoa’s Aquaman) provided the movie with its better parts. The movie is at its strongest points when it explores their characters, allowing us glimpses into the kinds of people each of the Leaguers are. This endeavour proved shallow because none of them were never really presented with a conflict that challenges their beliefs. Having spent much of their earlier screen time as friends who have nothing to challenge the others about, the culmination of the story fizzles unrewardingly as they “finally” unite against their common foe. There is no buildup, no lessons learned by anyone, that led to this point.Much like Wonder Woman in BvS, Superman felt like an item on a checklist. His resurrection was – say it with me – unrewarding. The impact of his death was not explored sufficiently. The impact and consequences of his resurrection seemed trivial. Justice League was an unrewarding experience, and if you don’t care enough for action blockbusters or superero films, you’re off not spending any time and money for this movie. Snyder/DC’s diehard fans will still find some things to enjoy in this movie."
    },
    {
      "rating": "8",
      "text": "wonder woman the flash show very good movie too fast intro is not memorable, bad villain is not bad Overall, a fun movie i love the batman very so much"
    },
    {
      "rating": "7",
      "text": "A beautiful adventure with good performances, especially of Flash and superman, there is still much of Snyder dingy, and scenes run needlessly, but holds the hope of a better future for Dc."
    },
    {
      "rating": "9",
      "text": "Movie it s not perfect but it s good. This is a proper super hero movie not that Thor ragnarok parody of comedy. Stepenwolf is good vilian. but this fiht OMG  hell yes."
    },
    {
      "rating": "10",
      "text": "Justice League is so awesome! You will love every character and Superman... I mean he is amazing and The Flash and Aquaman are scene stealers. It's a must watch"
    },
    {
      "rating": "8",
      "text": "i just want to see Superman and it is EPIC Superman is a badassSuperman is a badassSuperman is a badassSuperman is a badassSuperman is a badass--------------------------------------"
    },
    {
      "rating": "10",
      "text": "Don't listen to the Marvel fans. This movie is great, tons of fun and LOTS of action. The characters are great and the story is fast-paced. The Flash steals the show and Aquaman is no longer a joke. Batman and Wonder Woman are always great and Superman.... Well, you'll just have to see it for your self. You can't ask for a better time at the movies!"
    },
    {
      "rating": "10",
      "text": "Heart, dedication, flaw and even more heart. Justice League is brighter, bolder and simpler; but what it lacks in grandiose subtlety, it makes up with in tiny details. The compassion of Wonder Woman, Batman's courage, Flash's earnesty, Aquaman's raw power and Cyborg's determination. The leaguers all struggle with their own darkness but together, they're mighty. And that's how it is with this movie as well. Noticeable flaws, compensated by powerful moments and some touches of genius. Snyder's determination is evident, as he and the cast combine to produce a dedicated performance that shines even through Joss Whedon's honestly appalling reshoots and vulgar humour. Plagued by a meh villain, a rushed plot and some deus ex machina; Justice League is buoyed by five determined performances, great character interactions and one, VERY incredible Superman.A must watch for all."
    },
    {
      "rating": "10",
      "text": "It is the dream of every DC fan and does not deserve the low score that the critics are giving him.Yes, it has its flaws (poor CGI, many scenes cut and some reshoots are noticed) but it is not to be criticized so much.The movie is very enjoyable and fun thanks to the action and its characters.I emphasize more than anything 2 scenes of action that I loved that was SteppenWolf vs. The Amazons and the Final Fight.It has many incredible easter eggs.Comedy does not feel forced.Cyborg stands out a lot.The appearance of Superman is impressive.To see it in 3D."
    },
    {
      "rating": "10",
      "text": "Walking out of the movie theatre one can see two kinds of people, ones liked the Justice league and ones who dont want to. Am not saying that one is going to be dazzled by some cinematic brilliance, but not liking Justice league is improbable for an honest movie goer."
    },
    {
      "rating": "4",
      "text": "What Justice League tries to bring to the theatrical screen failed to execute all according to plan on its own. This is another example of how DC movies nowadays attempt to struggle a lot compared to Marvel movies nowadays. I hate to say it but the Justice League isn't a league without justice and a film that lacks such a thing in a movie named Justice League is humiliating at its own heart. I was expecting this movie to go over the hype just as expected from the Avengers but plot holes and inconsistencies makes this Justice League take very forgettable for a moviegoer to be the most."
    },
    {
      "rating": "1",
      "text": "Very bad CGI. Very bad plot and forgettable mashup of heroes with no chemistry between them. Terrible action even worst then in BatmanvSuperman. Very bad not interesting villian."
    },
    {
      "rating": "9",
      "text": "This is a great Justice League Movie.   If you love these characters and care about these characters you're going to love this movie.  If you never liked the Justice League this movie isn't going to change your mind.  I thought it was great. It has many of the strengths of Wonder Woman.  They're not trying to reimagine these characters, they're simply recreating them on the big screen.  I'm not really impressed with what the critics have said.  This is a big fancy comic book movie.  Enjoy it for what it is.  The character moments are great.  The actions scenes are fantastic.  Just go and enjoy it.  I did!"
    },
    {
      "rating": "6",
      "text": "Mediocrity at its finest. The ićonic Justice League teams up to face not only the worst villain to ever grace the screen but also an incoherent narrative that not even the use of pharmaceuticals could help smooth over. Elfman’s score is a joke and the CGI especially with Cavill’s moustache reminds me of Buzz Lightyear from Toy Story. Also I should mention the final fight was laughable beyond words"
    },
    {
      "rating": "3",
      "text": "Something's wrong when you have a production budget of $100M+ and you can't make a film that's all 9s and 10s. The VFX are great but you don't win on that alone. I think we've reached a point in film making where the storytelling and acting just cannot keep up with the amazing VFX and that's why you see all the disappointment with this movie experience, and why people are saying so much of it is laughable - there's an imbalance that's going to take a film genius to correct."
    },
    {
      "rating": "3",
      "text": "Justice League was a massive disappointment considering that it was DC's first team up film. The humor feels forced. The story is boring with an unmemorable villain. The characters are uninspiring. The CGI is bad (particularly in the final act). This was a massive letdown."
    },
    {
      "rating": "1",
      "text": "I lasted 15 minutes before turning it off. I’m actually amazed some people watched the entire film. I feel sorry for anyone who watched it. I’m incredulous as to how this movie was green lit."
    },
    {
      "rating": "0",
      "text": "I usually don’t give 0/10 reviews but here we are.This movie’s thin plot, awful CGI and horrible, vague characters makes this among one of if not the worst movies of 2017. Don’t watch for the sake of you’re general well being."
    },
    {
      "rating": "0",
      "text": "This was by far the worst superhero movie I've watched in my life..! Even those cartoons had better story..! And   the villain,he was the most unbearable character in the movie..!"
    },
    {
      "rating": "0",
      "text": "A DISGRACE! ABSOLUTE ****!Snyder's name shouldn't be this version of the movie because this is not his version!"
    },
    {
      "rating": "2",
      "text": "A crossover without proper build up. Unlike in Avengers, they dont have a proper goal. Villains are also forgettable. The connection between the DC movies are non existent (except Bat and Sup). Ugh. Terrible. Just plain awful."
    },
    {
      "rating": "0",
      "text": "This is the worst DCEU movie so farWhedon and Elfman **** up this movie so hard"
    },
    {
      "rating": "2",
      "text": "\"Justice League\" is everything a good superhero movie is not: broken character introductions, a lifeless script, terrible visuals, a confusing plot, joyless acting..."
    },
    {
      "rating": "1",
      "text": "The worst DCEU movie so far. I can't believe how the DCEU has the ability to ruin comic book cinematic events, with Batman v Superman, they ruined what should've been the most awaited moment for comic book fans, the comic book crossover of the century, and they turned it into a pretentious, boring, convoluted mess of a movie and now with Justice League they ruined what should've been THE comic book crossover of the century and turned it into a convoluted, unfunny, cheap-looking, boring movie.But it was kind of expected, the DCEU was already ruined and all the messes they made with previous movies would naturally make this movie turn out to be pretty bad.The pacing is just horrible, the plot is generic and cliché (Oh, the villain has to get an item that will make him destroy the universe how creative), there's no character development, the Justice League has zero chemistry and there's no conflict. Like, everyone is just okay with being a team now, they're all happy and good friends now and will destroy Steppenwolf together. Steppenwolf is one of the most generic and cliché villains I've ever seen since Apocalypse from X-Men Apocalypse, I swear 99% of his lines are cliché villain lines and even the way the actor portrays him is cliché and cartoonish.The CGI is TERRIBLE and makes Cyborg look awkward to watch, and you might say it's not that bad but it is considering the HUGE budget this movie was made with.Batman is wasted and that's one of the worst things in this movie, Batman was awesome in Batman v Superman and was one of the only goof things about that movie but here, he's just there, he doesn't do anything, he barely has any screentime when he's in the Batman suit.Nothing about this movie is good and it's one of the most disappointing movies I've ever seen, I expected so much from this movie and that just makes my feelings about this movie even worse. I don't give it a 0/10 because that's only reserved for movies that I seriously can't watch."
    },
    {
      "rating": "2",
      "text": "This movie is a mess. They made an abusive use of CGI. It is closer to ve a videogame than a movie."
    },
    {
      "rating": "1",
      "text": "Watching this movie is like watching TV static. There's movement, but it registers as nothing."
    },
    {
      "rating": "0",
      "text": "WB and Josh Whedon. This is Insulting. Be ashamed of yourselves. Whedon, your ego shows. No one liked Ultron. Don't try to make this DC Ultron"
    },
    {
      "rating": "0",
      "text": "An embarrassment after watching Synder's cut. Whedon should never be allowed to direct a film again."
    },
    {
      "rating": "2",
      "text": "Not the worst movie ever but definitely a huge pile of problems. The main problem with this movie is I don't think they ever figured out what movie they were making. It feels like every scene was borrowed from other movies and done worse. DCEU needs a reboot because there are some great stories but the current film makers are really bad at almost every aspect of film making it just needs to end before it gets worse. Wonder Woman will probably stay the only good DCEU film to date."
    },
    {
      "rating": "5",
      "text": "Liga da Justiça, um dos mais aguardados filmes de Super Heróis de 2017 e após ver tantas criticas não positivas ao filme fiquei preocupado. No entanto ao ver o filme fico surpreendido do porque de tantas criticas. É certo que o facto de nem todos os personagens terem os seus próprios filmes e de não termos acesso a filmes solo do Aquaman e de Cyborg por exemplo leva-mos a não compreender no todo os personagens. A junção do grupo em si tem de ser compreendida desde o inicio de Man of Steel e passando por Esquardão Suicida onde todos os pormenores contam. Apesar de tudo achei Justice League o melhor filme da DC no que toca á junção do grupo e desenvolvimento do inicio da história não sendo tão mau como a junção do Esquadrão Suicida que foi simplesmente péssimo. Voltando agora a cara para o vilão, eish o grande problema do filme. A liga da justiça merecia um vilão 10x melhor, mais forte, carismático e que metesse mais medo. Stepwolf não tem nada disso e bastou o superhomen chegar para levar uma tareia brutal. Simplesmente ridiculo. No entanto as cenas de luta melhoraram o que é bom e foram em ambiente um pouco mais claro que o costume. Para finalizar a mulher Maravilha de Gal Gadot continua sendo brilhante e o melhor deste filme."
    },
    {
      "rating": "0",
      "text": "As far as I'm concerned, this movie never happened. Shame on you Warner Bros. Shame on you Joss Whedon. #RestoreTheSnyderverse"
    },
    {
      "rating": "0",
      "text": "This movie is a beyond terrible. Joss Whedon ruined the script and apparently that wasn't enough because he also decided to use the cheapest VFX I have ever seen in my life."
    },
    {
      "rating": "0",
      "text": "F##K this movie, and f##k Joss Whedon. It's uninteresting, characters have no motivations, the characters are bland and there is literally no context."
    },
    {
      "rating": "0",
      "text": "The plot is good, but very crumpled. It is clear that the film does not have enough time. Half of the movie was going to revive Superman and win in 2 minutes. The horror! I'm waiting for the Director's version!"
    },
    {
      "rating": "5",
      "text": "Very close to garbage. Tempted to watch the Snyder cut though, just to see if it's any better."
    },
    {
      "rating": "0",
      "text": "damn this film really sucks. the 2nd worst dceu film right after suicide squad"
    },
    {
      "rating": "0",
      "text": "This movie was worse then Suicide Squad which is saying something. There’s zero plot, just the worse CGI it seems, and just bad acting. I’d highly suggest not watching this movie"
    },
    {
      "rating": "0",
      "text": "Very bad CGI. Very bad plot. Heroes don't have any chemistry between them. Terrible action sequences. Very bad not interesting villain. Worst DCEU movie."
    }
  ]
}