{
  "id": 4576,
  "title": "K-PAX",
  "starring": [
    "Jeff Bridges",
    "Kevin Spacey"
  ],
  "runtime": 120,
  "genre": [
    "Science Fiction",
    "Drama"
  ],
  "description": "Prot is a patient at a mental hospital who claims to be from a far away planet. His psychiatrist tries to help him, only to begin to doubt his own explanations.",
  "releaseYear": "2001",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/Ab4Gd2oQJsbVCRxG8fZdZ47Z77R.jpg",
  "categories": {
    "plot": 6.75,
    "acting": 6.705882352941177,
    "ending": 7.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "So, let it be a psychological flick or a sci-fi one I will just be in between that two-layer of confusing state. It is simply moving forward as a deep journey into an unknown person's life was he declared as an alien (not like the one who cut somebody's chest) but a non-human entity appeared as a human. He is like an artificial man in context and his strange behavior and approach gears Mr. Powell to engage in his work more seriously. He is with Prot all the time and want to know more about him. That's why he gone for a hypnotic process. But what we can find out through as a whole is the connection and the interchange between the doctor and the patient. A man, who knows nothing about family, nothing about missing someone advises another man to be with the family. When it comes to Prot's life, we are still confused about his character as a whole.  What we gained at the beginning about Prot suddenly marks a twist and another shape of him named Robert appears to us. That is the delusional structure created by both the director and the writer at the end. Anyway, I'm not going to list this film as a sci-fi product rather I want to see it as a pure dramatic, family, emotional one."
    },
    {
      "rating": "10",
      "text": "Amazing film. Just brilliant. Critics fools as always.... This film cannot be less than 70"
    },
    {
      "rating": "4",
      "text": "I watched this whole movie, right up to the end.  I was pretty sure I knew what it would be but it just dragged on so long I had to change the channel.  Who cared at that point."
    },
    {
      "rating": "10",
      "text": "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "7",
      "text": "Good movie overall about a man who thinks he is an alien. The entire movie is about trying to figure out if he is nuts or really an alien. I wont give anything away for people who have not seen it, but it is a good movie and the lingering question keeps you interested all the way to the end. Kevin Spacey did a great job and the movie was overall well above average to me (5 being average on sites with lots of reviews). Its not as good as The Man from Earth, which had a similar plot but better dialog, but it was still a fun movie to watch."
    },
    {
      "rating": "10",
      "text": "One of my favorite movies of all times. Great actors and story is just amazing and good music just completes this masterpiece. Just give this movie a chance it deserve it."
    },
    {
      "rating": "10",
      "text": "some of the lines spoken in this movie have such a deep core, mediocore magazines shown on this website just cant understand  it is a breathtaking and expanding movie to sit through, simply wonderful! theres nothing left but a 10"
    },
    {
      "rating": "5",
      "text": "A very well-thought out movie that unfortunately offers very little kick. Still, the saving grace here is Kevin Spacey, who as always churns out a performance worth remembering."
    },
    {
      "rating": "6",
      "text": "It's not a masterpiece, but its lighted subtle criticism over our nowadays frantic society based on consumption and production, giving pause and importance to humanitarianism by rolling the family as the Aristotelian representation of The nuclear cell of A social structure, makes worth the time spent watching it. If, the art of films represents the inner reflection of a positive potential changing of our own lives and attitude towards it: to live in community highlighting the paradigm person versus object. If not, just a neo-formula of spicing movies with philosophical powder as the new wave of profiting from the ideological needs of the audience like pills to evade from the modern urban depression reflecting a society hunger of rational values."
    },
    {
      "rating": "9",
      "text": "Sorry for the translation. Thank you. 42nd St. New York, Grand Central Station, ext. Freddy, paraplegic beggar frequent the place is seduced by a beam of light from the large side windows. They spend a few moments and a short distance, he finds himself in front of the figure of a man of singular. E 'Prot (Kevin Spacey) who, quietly and starts to move small steps going towards him. Simultaneously an 'old woman victim of assault, falls to the ground. \"The man came out of nothing\" comes to her to help her up, spoke to the police. Immediately cleared of the charge of assault victim who is scared by Freddy from 'However, little persuasive answers to the police officer who asks for information about its origin. Prot, is' not a clear understanding of the Earth. Thus begins the journey to its new home, the \"Psychiatric Institute of Manhattan\" motivation \"mentally disturbed person.\" After a month, Further in this institute asked the expert to be dot. Mark Powell (Jeff Bridges), why? Why all the investigations, have failed because of Thorazine 300 mg daily for 3 weeks did not elicit any reaction. How is this possible? Who is this man really, what is its mission, meaning that they take the notes, because since joining the institute in all other patients there is a positive evolution of their disease? And yet, Prot astronomical knowledge outside of the town, talk of energy efficient configurations, classifies the planet Earth a class BA-3 early stage of evolution, the future uncertain. The tests carried out was also sensitive to white light, can perceive up to a wavelength of 300/400 Armstrong, ultraviolet rays. Dr. Mark initially intrigued, then \"taken\" totally from this patient who claims to come from a planet called K-Pax belonging to the constellation of Lyra. Can that be true? Mark asks the brother of astrophysical interest in the case. The hopes that the psychotic is more convincing that ever happened. \" In the following days is accompanied by Mark Prot in a planetarium and the presence of four experts from astrophysicists' is not only a test of his knowledge, drawing ellipses, calculating time speed, speaking of energy existing in a beam of light, writing formulas and concludes the impromptu conference saying: \"I assume this will help to explain the disruption to you slaved in the rotation scheme of your binary stars, but you have not been able to understand ... until this moment.\" The dot. Mark is at a crossroads. Want to let go as the manager of the Dr. Claudia Villars (Alfre Voodard) transferring the patient to another department or speak with regressive hypnosis? And what are the risks to Prot? Film immersive thanks to the skill of the two main characters, the screenplay by Charles Leavitt and directed by Iain Softley noticed. Music by Edward Shearmur, gradually leads the viewer to enter a world, the human mind, as charming as a starry sky."
    },
    {
      "rating": "7",
      "text": "It was an okay movie. There is a lot of suspense definitely and you keep wondering about how things are gong to turn out. I always like movies that capture our sense of wonder and imagination. Overall a nice movie."
    },
    {
      "rating": "10",
      "text": "Wtf? Critics have gone mad again I guess. This is one of the better movies released in the last 5 years, egts you from the very first second till the very very last... Spacey's stellar acting is one of the better performances I've seen lately too!"
    },
    {
      "rating": "9",
      "text": "Very good apart from the ending. However you can not deny that he was from k-pax. Bridges stated that for one way to prove was to use the hypnosis. Prot, while under hypnosis, says when he was a young boy that he was from k-pax. Also at the observatory nobody on earth could have done what he did, I see that as proof."
    },
    {
      "rating": "10",
      "text": "This movie is the best I've seen in a while. It really made me THINK, instead of all those horrible action/car/romance movies that's just full of stereotypical bull crap. I loved this work of art, and no review can take that away from me."
    },
    {
      "rating": "2",
      "text": "Tiresome new-age sentimentalism. Director and scriptwriter should shot. Spacey eating a raw banana was about the only interesting thing in the whole movie."
    },
    {
      "rating": "10",
      "text": "So many little things that you can look back on and make a case for Spacey being from Kpax, while the overwhelming psychological evidence points squarely at multiple personality disorder. Anyone with an imagination will like it, acting is excellent to boot."
    },
    {
      "rating": "9",
      "text": "Kevin Spacey and Jeff Bridges - who portray the two main characters in the story - are two of the most skillful film actors now living.  Bridges plays Dr. Mark Preston, the chief psychiatrist at a Manhattan Psychiatric Institute where people exhibiting unusual behaviors are studied, diagnosed, and treated for mental illness if their behavior indicates that they may be suffering from one or another mental disorder. Spacey plays one of those people  The film follows the evolution of the relationship between the two men as it develops."
    },
    {
      "rating": "4",
      "text": "In \"K-Pax,\" Kevin Spacey plays a character — either a profoundly disturbed mental patient or a being from a distant galaxy — who regards the strivings of ordinary earth folk with an amused detachment that combines smug superiority and gentle pity. So what else, you may well ask, is new? Mr. Spacey's gift for irony, his attraction to roles that hide emotional distress behind a cloak of knowing composure, is starting to look like a vice.\r Here, as in last year's vile \"Pay It Forward,\" he lends his keen intelligence to a dubious therapeutic cause. \"K-Pax\" is a draggy, earnest exercise in pseudo-spiritual uplift, recycling romantic hokum about extraterrestrial life and mental illness with wide-eyed sincerity.\r Mr. Spacey, his eyes obscured by black sunglasses, materializes in the middle of Grand Central Terminal one morning. You know that he is no ordinary commuter because of the New Age music that heralds his arrival and because a panhandler intuits something special about him. \"Brother came from nowhere, you know what I'm saying?\" he tells the police officer who arrives to take the stranger to the bughouse.\r Once there, he explains to his doctor that he is a visitor from the planet K-Pax named Prot (rhymes with \"emote\") and that he traveled to earth on a beam of light. Although he could presumably leave the hospital at will (and does vanish for a few days on a tour of the Arctic), Prot elects to stay, and he promptly sets about curing the other patients. When Dr. Powell (Jeff Bridges) objects, Prot muses on the \"curious human distinction\" between doctor and patient and wonders why Powell hasn't cured his unhappy charges yet. In the movies, of course, the patients always cure each other. If Jack Nicholson and Winona Ryder can do it, why can't Mr. Spacey?\r As Prot goes about dispensing his good works, the movie's central conundrum begins to emerge. Dr. Powell's skepticism is rattled by his patient's peculiar metabolism and a grasp of celestial mechanics that astounds a panel of leading astrophysicists, who assemble in the Rose Center planetarium for an impromptu seminar. Meanwhile, the physician clearly needs to heal himself. Powell is a classic movie workaholic, neglecting his wife and daughters and estranged from his grown son.\r Needless to say, it takes a brother from a planet where family ties don't exist, a superior being with deep insights into the benighted state of humanity, to teach the good doctor some important lessons. Along the way, we pause for some excruciatingly predictable dialogue:\r \"You're too close to this patient,\" says Powell's supervisor (Alfre Woodard). \"Why choose this one to save?\"\r \"Maybe because I feel that he chose me,\" the doctor replies.\r The K-Paxian civilization has evolved far beyond our own, so what do these beings have to teach us? \"Get it right this time. This time is all you have.\" Can they send us some screenwriters, or are the ones we have aliens in human form?\r Of course, there is also the possibility that Prot is just a severely deluded, terribly traumatized earthling, and the one thing \"K-Pax\" does get right is its handling of this ambiguity. Though the individual scenes are atrociously written — and dragged out so that every possible emotional cliché can be ticked off the checklist — the story is cleverly structured and allows us to entertain two contradictory possibilities without seeming egregiously illogical.\r There are some lapses, though. Prot finds the expression \"take a seat\" incomprehensible and the New Jersey city of Hoboken difficult to pronounce, yet he seems well acquainted with American cinema. \"Don't worry, doctor,\" he says to Powell, \"I won't jump out of your chest.\"\r But his divided identity does allow Mr. Spacey to jump out of his skin, to break through his sly reserve in a moment of wailing, screaming anguish tailor-made for the video screens on Oscar night. Mr. Bridges looks on with evident concern, and it's hard to watch these two actors plow through the nonsense of \"K- Pax\" without feeling that a terrific opportunity has been squandered. Mr. Spacey uses his quick verbal intelligence and his easy smirk to deflect emotion and then, in unexpected and often untrustworthy ways, to reveal it. Mr. Bridges's cunning works in the opposite direction. His plain-spoken naturalism is often an especially effective form of guile. If Mr. Spacey's characters are often more sincere than they seem, those of Mr. Bridges are smarter than they let on.\r Unfortunately, the premise of \"K- Pax\" is so tired, and the direction so plodding and uninflected, that the actors rarely connect with each other. Iain Softley, the director, whose adaptation of \"The Wings of the Dove\" shook loose some of the novel's mannerisms and excavated its gothic psychosexual subtext, almost succeeds in giving some resonance to Charles Leavitt's relentlessly shallow script (from a novel by Gene Brewer)."
    },
    {
      "rating": "10",
      "text": "Prot's signature sunglasses are actually a favorite pair owned and worn by U2's frontman, Bono. The glasses are Brand DITA and style is discontinued. Kevin Spacey asked to borrow them for the film, which Bono agreed to under the condition that they were well cared for and were returned immediately upon completion of the film."
    },
    {
      "rating": "10",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》《《《《《《《《《《《《《《《《《《¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡"
    },
    {
      "rating": "10",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¡¤¡¤¡¤¡¤¡¤¡¤¡¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡¡•¡•¡•¡•¡•¡•¡•¡•¡¡•¡•¡•¡•¡•¡•¡¡•¡•¡•¡•¡•¡•¡¡•¡•¡•¡"
    },
    {
      "rating": "7",
      "text": "----------------------------------7.3/10-----------------------------------"
    }
  ]
}