{"id": 58, "title": "Kate", "starring": ["Mary Elizabeth Winstead", "Miku Martineau"], "runtime": 106, "genre": ["Action"], "description": "A ruthless criminal operative has less than 24 hours to exact revenge on her enemies and in the process forms an unexpected bond with the daughter of one of her past victims.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/uJgdT1boTSP0dDIjdTgGleg71l4.jpg", "categories": {"plot": 6.4, "acting": 7.416666666666667, "ending": 8.6, "soundtrack": 5.0, "cinematography": 6.0, "familyFriendly": 3.0, "funny": 6.0, "action": 6.585365853658536}, "reviews": [{"rating": "6", "text": "Mary Elizabeth Winstead plays the titular character, yet another pro assassin who’s trying to track down the person responsible her poisoning. The only new thing this adds is that she has 24 hours to live. She even teams up with a Japanese teen for some emotional weight. This is latest entry into the fast-growing kick-ass chicks genre, like the recent Amazon release Jolt. The action is what make them matter and there are some well-choreographed fights with plenty of breaking bones, flying bodies and endless bullets. Otherwise, it’s pretty much standard fare."}, {"rating": "8", "text": "I am the first one to hate when a strong female character is forced down your throat but here I expected an action movie with a strong female main character and I got an action movie with a strong female main character. Considering the title was \"Kate\" and not \"Paul\" or \"Frank\" or \"Bill\" and there is A LOT of action I don't have anything to complain about it."}, {"rating": "4", "text": "Another Netflix film in less than two months that deals with an assassin facing big odds while taking care of a young protegé.You can tell that those who approve the purchase of content on Netflix do not try too hard.Kate has a more raw style, and it's a lot more violent, but its entire narrative arch and structure are so predictable that it hurts."}, {"rating": "9", "text": "I really liked, tons of fun.And Mary Elizabeth Winstead is always a plus!!"}, {"rating": "5", "text": "It starts very well, everything was so much bold, the action scenes, the cinematography, the visual effects and last but not least the acting from Mary Elizabeth Winstead, she's on fire in this character. But the more advances, the more loses all the good stuffs."}, {"rating": "1", "text": "(Mauro Lanari)Why label an exploitation film as action, once again produced by Leitch with 10 or 20 stunt performers for each actor, gory, sanguinary and proud not to give a damn about the plot? Derivative of the Chinese Woo and the Japanese Miike, it is a choreographed butcher's shop for slaughterhouse lovers."}, {"rating": "3", "text": "I love Winstead, but was awful to watch her jump the bandwagon of the latest crappy feminist action movie that has been dumped to streaming platforms this year.A mixture of Crank and John Wick in a very unrealistic outcome.Winstead´s presentation as an assassin is awful. Who texts confirmation messages to her next hit the day before the hit? Her tactics is also very amateur, Taking a sniper shot from kneling position is way worse than a prone position when she has the opportunity to do so.The car chase scene in this movie is also dreadfully bad, totally sped up and fake AF. It is entirely CGI and a very bad rendered one at that.Woody Harrelson has a central, but not so present role. But he can not rescue this movie one bit.Overall, this movie left me with a bad taste metal in my mouth.."}, {"rating": "0", "text": "This movie is ridiculous. It tries to be cool but it is only boring and just way to far from reality. Watching it hurts physically. Don't waste your time with that trash."}, {"rating": "4", "text": "It's like a woke version of the movie crank, not worth your time unless you're desperate"}, {"rating": "6", "text": "Kept me entertained throughout it's slightly too long running time. It was harder and harder to believe her killing abilities in the action scenes as the poison took hold and was inching closer to death. Still, a relatively by the numbers revenge action flick kept me entertained."}, {"rating": "6", "text": "This movie might show Harrelson in all of the promos. But know that he is basically in the movie for 10 minutes tops.The lead does a great job, no doubt about that. But I love Harrelson, and was quite disappointed that he is basically only on there to attract attention to the movie.Now, about the movie itself. It's not bad, but it is quite boring. Halfway through I was looking at the time, and realized how much was left. That's when my mind started drifting. The movie simply couldn't keep my interest.There are some pretty well-choreographed fighting scenes in there. But the plot is a run-of-the-mill revenge story. And since non-stop action isn't all that interesting in itself, it has to rely on the between-fights interactions. And that's where it starts falling flat about halfway through. And it never seems to be able to pick itself back up."}, {"rating": "2", "text": "A shallow wannabe John Wick imitation, of course with Netflix-style obligatory dose of childish feminism and ham-fisted \"female empowerment\", painted with garish colors and inept strokes on the overused backdrop of modern Yakuza-riddled Japan. Cheap, ridiculous, whiny, utterly predictable and redundant."}, {"rating": "9", "text": "I will not judge this movie based on its predictable story because, to be honest, I enjoyed this movie and there were some best things about this movie which made it interesting.Mary Elizabeth is a perfect choice for the lead role. Her action sequences, fighting style, emotions, physical look indeed everything is superb. She makes the movie engaging till the end.Visually this movie is excellent. The Cinematography, fighting sequences and direction is superb. I loved this movie."}, {"rating": "5", "text": "It seems like they're churning out these John Wick style assassin revenge films in a factory somewhere. We've seen this a hundred times already. It's bland, generic, and cliched.  The action - the gunplay is passable, but the hand to hand combat doesn't work. The reactions of the stunt people are over-exaggerated in relation to how hard the hits look. I did like a lot of the Japanese aesthetic and style; and Mary Elizabeth-Winstead is really solid in this; she's not convincing as an action start to me."}, {"rating": "10", "text": "Ein sehr spannender Film.  Kate ist sehr Taff. Manche Szenen sind sehr brutal."}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "10", "text": "Kate is 2021 great surprise, with an amazing performance by all the cast especially Mary Elizabeth Winstead, fantastic cinematography, and Japan as always been a perfect place, Kate is gory, bloody, intense, fills with great action-packed, and interesting story, Kate is surprisingly a very solid movie."}, {"rating": "10", "text": "Considering the amount of junk on Netflix, this is a 5* film, so to balance the scoring I gave it a 10.  I'd say 8 is a fair score.  It's a really enjoyable popcorn movie that is done really well.  The girl is a really natural and good actor, would be interested to see what else she can do if given a meatier role.  Very entertaining."}, {"rating": "7", "text": "Not bad, it's a shame that there will be no sequels.Mary is not the best choice for an action hero as she does not have the training for much of the stunts, it is noticeable in this film but she does an alright job.Obviously this is a comparison to (Reeves & Theron) who are miles better and trained for the genre. The only thing I can find fault is Ani (Miku Martineau) just seems to instantly forgive Kate for the assassination of her father... being provided with a bombshell of an event should have more weight than it does here.Lastly, there seems to be a desire to recreate films that are the basis of inspiration. ie: La Femme Nikita, Léon the Professional, John Wick, and Atomic Blonde."}, {"rating": "7", "text": "KATE is a John Wick-lite with not a lot of meat on it's bones other than how much ass it kicks. At times the cinematography shines, at others a adrenaline fueled action set piece will drop in your lap out of nowhere, but in the end it runs maybe a tad too long. It's plot is simple but the action is great. Then last but most certainly not least, is the always amazing Mary Elizabeth Winstead. She is wicked and looked like she was having a blast. Woody Harrelson gives us the classic **** bag but, really, he is outshined but everything else going on. Outlandish but fun."}, {"rating": "7", "text": "Look, based on its limited ambitions, I would say that the ceiling on this movie was an 8, so I consider the 7 a pretty high mark.  This was a competently executed action flick with some very well done cinematography and acting from Winstead.  I felt compelled to write a review because now that I've seen I find the critical response totally baffling.  If you're looking for a grim, stark, satisfying action movie, you'll find it here."}, {"rating": "10", "text": "FU critics. I've almost skipped this gem because of low score reviews. The scenes are amazing, camera men did pro job, Tokyo is beautiful, acting is superb, gore makes john wick PG 13, script for an action movie is definitely not worse than \"they killed my  dog\". 10/10 can watch again."}, {"rating": "4", "text": "An unashamed John Wick action clone, but without the world building to make the story compelling. It is also peppered with certain camera framings you can tell the director insisted on only to clumsily recreate their anime inspirations. It is also painfully clear which scenes were filmed in another country due to the unrealistic emphasis on neon signage. The bright spot was the above average acting of the Japanese cast, despite some accent issues."}, {"rating": "10", "text": "For a simple action film I thought it was brilliant, beautiful pictures, beautiful scenes, lots of neon lights, good actors and would even put it on a par with John Wick. But tastes are just different, I do not know what others expect from an action movie?"}, {"rating": "7", "text": "Netflix action flicks are almost a staple on the streaming service, but Kate may have a cliched storyline, but it excels in two of its aspect: its setting in Japan and as a showcase for Mary Elizabeth Winstead. Having her hair cut short, you can see that she soo eerily resembling Sigourney Weaver, that many fans petitioned her to replace Weaver in the Aliens series or even to become her daughter.  Why not? She is a badass action star, and has been for most of her career, even starring in Die Hard as Bruce Willis' daughter! Anyhow, what else can I say about this flick and it shows Netflix dominance in these sort of films, genres that were once the pantheon for Direct to Video in your local Blockbuster."}, {"rating": "7", "text": "Predictable story but John Wick level action from Mary E. I hope I see more clean action like this from her!Very impressed with all acting. Including all Japanese performers. Miku Patricia Martineau was the stand-out. Bratty and endering at the same time."}, {"rating": "8", "text": "Solid and enjoyable. Appropriately badass. I don’t want to assume anything, but I’ve seen similar films with far worse acting, plot, and dialogue get way higher reviews -dare I say- because they have a virtually all male cast."}, {"rating": "10", "text": "I typically start movies to abandon them ten minutes in if they suck, which is what I expected for this one.To my surprise, it was almost the movie I expected - but captivating from beginning to end.The photography is fabulous, the acting top notch throughout (seriously, casting should get a no holds barred party thrown for this accomplishment), it avoids all the cliches and sustains a thoughtful pace throughout.Surprise of the year. The only downside is that the story is told from beginning to end, there's not going to be a Kate 2."}, {"rating": "6", "text": "In such an over saturated genre there are few suprises here. The production quality is superb though and the fight choreography is very good. Ultimately the near comic book style failed to build up any real tension when the stakes get higher as things defend into the mindless action with the overpowered Kate b-lining her way through every obstacle. A fun watch if you're a fan of the action genre."}, {"rating": "0", "text": "Another Netflix movie that exists for no other reason then to rob you of two hours of your life and keep you sitting in front of their platform so you're not doing something productive.Kate is a John Wick clone, its part Crank, part Ava, part Atomic Blond and could never have lived up to its aspirations (2 of those movies are just as bad as this). It brings nothing new to the table, you have seen all this before.Its watchable for about 30 minutes and then the story introduces one of the worst side-kicks of recent memory and its all downhill from there.The over-reliance on digital effects and gore added post-production makes it look like a video game, and a bad one at that.All this movie serves to do is add weight to the argument that streaming services are killing the \"art\" of cinema."}, {"rating": "5", "text": "Barely watchable, another attempt from crapflix to actually have good movies, which actually amazes me cause they really have a couple of good movies (just a few) Please rate this down, they should actually take more effort on doing movies and not just come up with a horrible copie/merge of John Wick + Kill bill. I cannot recommend this movie at all."}, {"rating": "5", "text": "This is such an overused concept these days - and I literally watched 2 movies in a row with main actress being badass woman shooting her way throughout the movie. I mean the idea is not bad, just that there are so many movies in such style lately (and most of them have the woman's name in the title). This movie just not add much to that genre and does not bring anything new or interesting plot wise."}, {"rating": "5", "text": "Un mélange de John Wick et de Nikita pour cette production américaine sous la direction d’un réalisateur français dont l’action se déroule au Japon… mais à dire vrai, on a surtout l’impression de regarder l’un de ces nanars avec Jason Statham sauf que c’est la jolie Mary Elizabeth Winstead qui s’y colle.Jolie à regarder certes mais athlétique et aussi mortelle qu’elle peut l’être, cette assassine professionelle ! car Kate Nikita Wick n’amuse certainement pas le terrain et aligne les macabés comme à la parade. L’actrice lui donne néanmoins une certaine épaisseur entre quelques dézinguages de vilains yakuzas : elle est bien plus convaincante qu’un Statham, cela va sans dire.Une pisseuse otacul bling-bling en vient à l’accompagner lors de son périple de vengeance furieuse alors qu’elle tente de retrouver le salopard qui l’a empoisonnée… L’ambiance survoltée du Tokyo nocturne se prête bien sûr fort bien à moult bastons et fusillades mais hélas, contrairement à un John Wick (ou même notre fameux ‘Nikita’ national) l’action reste un peu trop mal filmée pour convaincre : trop de zooms et de cuts malmènent les efforts de Miss Winstead.En outre, le scénar sent le nanar à des kilomètres et le fil blanc de ses coutures qui craquent rapidement se voit comme le nez au milieu de la figure. Heureusement que le rythme ne faiblit pas ou si peu, sinon on aurait commencé à pester, voire s’ennuyer un brin… mais c’est tout à fait regardable en définitive."}, {"rating": "5", "text": "Kate honestly started out okay for me. Seemed like a pretty, by the numbers techno thriller, but the fight scenes were excellent. Kudos to Mary Elizabeth Winstead, who seemed to have trained hard for this and it showed. Lot of kinetic energy and very colorful action made it visually appealing until that wore off, and I started paying attention to what was a pretty bland plot. I think they were going in the right direction, but about half to 3/4 into the movie, I felt myself reaching for my phone. By the end, I had no idea what was going on, and didn't really care. Wouldn't mind seeing Winstead in another action movie, though. She certainly showed her chops."}, {"rating": "6", "text": "This movie is competent for an action movie of the same category as John Wick and Atomic blonde. A tad bit more stylish than others but way to predictable in story. Mary does pull off the badass type but the plot doesn't do her favors."}, {"rating": "6", "text": "There is no doubt that how Quentin Tarantino influenced the modern film makers. There are a ton of films in the same formula as Kate. The Japanese hut combat scene reminds me of the famous action scene from Kill Bill, only this was pathetic. It should have been executed well. Even the speed of action, acting and coordination was so poor that it made the first impression wrong about the film. Villains revealing their identify keeping \"Ani\" in the room was the most stupidest plot reveal. Well, this twist is obvious from the beginning, almost all the films in this Genre had the same twist, it's kind of funny though. Apart from all these negatives, you can still enjoy a watchable action thriller, if you are dying to see one."}, {"rating": "10", "text": "i freaking love this movie Mary Elizabeth Winstead made me a fan of hers. i love the plot twist at the end when she realized that kate was working with the enemy the whole time and killing the girl family the movie jhad no hidden agenda just good old revenge action flick 24/7 and at the end Woody Harrelson was the actual antagonist. Miku Patricia Martineau add charm to thwe scenes its a very dark movie but every scene she was in she stole the show.if i had to compare it's like atomic blonde meets Anna (2019) damn i wish it had a post credit scene or something i really wanted kate to survive or something i just wanted more."}], "recommendations": ["haywire", "gunpowder_milkshake", "atomic_blonde", "miami_vice", "the_mechanic", "hanna", "desperado", "wrath_of_man", "safe", "transporter_3", "gemini_man", "run_all_night", "underworld", "john_wick_chapter_3_parabellum", "mission_impossible_ii", "the_equalizer", "bloodshot", "mechanic_resurrection", "the_ice_road", "immortals", "brick_mansions", "nobody", "a_walk_among_the_tombstones", "angel_has_fallen", "the_equalizer_2"]}