{
  "id": 4077,
  "title": "Keeping Up with the Joneses",
  "starring": [
    "Jon Hamm",
    "Isla Fisher"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Comedy"
  ],
  "description": "An ordinary suburban couple finds it’s not easy keeping up with the Joneses – their impossibly gorgeous and ultra-sophisticated new neighbors – especially when they discover that Mr. and Mrs. “Jones” are covert operatives.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yvWcTrRCzE4C2hkd2wV4erPuKCn.jpg",
  "categories": {
    "plot": 5.642857142857143,
    "acting": 5.571428571428571,
    "ending": 5.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.285714285714286,
    "funny": 5.2368421052631575,
    "action": 5.928571428571429
  },
  "reviews": [
    {
      "rating": "7",
      "text": "It's all about expectations - I had rock bottom expectations going in (given what the critics had been saying), and I was MORE than pleasantly surprised.  I had some very big laughs in this movie. All 4 leads are excellent.  Zack, in particular, has some really funny lines - his delivery is spot on.  There are some really bad comedies being pumped out of Hollywood these days, but The Joneses is not one of them.   (See \"Hot Tub Time Machine 2\" - or, DON'T)"
    },
    {
      "rating": "7",
      "text": "Some parts of the story were overused from other movies, but overall this was quite a funny movie with some action elements and enjoyable acting. Funny and sexy actresses and overall it was a good movie for having fun."
    },
    {
      "rating": "7",
      "text": "As far as comedic movies have gone this year, this isn’t bad neither is it good, it’s your average mediocre comedy movie with some memorable moments throughout the movie. The Script writing is the thing that just drags this movie down, it was just bad. All the jokes were out of place and sometimes not funny at all. The movie has a talented cast, a story not too difficult to understand and some funny moments here and there throughout the movie. It worth your time, but you’ll probably forget in like 1 day."
    },
    {
      "rating": "8",
      "text": "I don't know why the score is so low but this movie is better than any other comedies that release recently. I was craving for a comedy so I went to a theater nearby and watched this one. It didn't let me down."
    },
    {
      "rating": "7",
      "text": "This movie was a light-hearted comedy that was entertaining to watch.  It had some funny memorable lines and ended with a sincere theme - be appreciative of what you have.  A fun date movie to see."
    },
    {
      "rating": "7",
      "text": "A mixed bag. Cast gives it their all. Great chemistry with the main quartet. The plot is good, there is especially a lot of heart for the main character Jeff. Sadly, the big issue is the jokes as they are lacking. I ultimately liked this and may watch it again many years later, but I can't say it's a must-see."
    },
    {
      "rating": "7",
      "text": "It is not a solid Thriller neither an outstanding comedy but an almost good and more than interesting Thriller Action Comedy Spy. You will have a good experience with that one."
    },
    {
      "rating": "7",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;"
    },
    {
      "rating": "7",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"
    },
    {
      "rating": "7",
      "text": "{}{}{}{}{}{}{}{}{}[][][][][][][][][][][][]()()()()())()!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "7",
      "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"
    },
    {
      "rating": "7",
      "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"
    },
    {
      "rating": "7",
      "text": "Summary: An ordinary suburban couple (Zach Galifianakis, Isla Fisher) finds it’s not easy keeping up with the Joneses (Jon Hamm, Gal Gadot) – their impossibly gorgeous and ultra-sophisticated new neighbors – especially when they discover that Mr. and Mrs. “Jones” are covert operatives."
    },
    {
      "rating": "7",
      "text": "++++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "7",
      "text": "♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"
    },
    {
      "rating": "7",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》*****************************************************"
    },
    {
      "rating": "2",
      "text": "I found this film to be utterly unbearable. The attempts at humor are some of the most embarrassing and cringe worthy i have ever seen. The plot is ridden with cliches and gross out comedy tropes, the acting and comedic delivery were completely off. No energy or sense of character. In short this film is just another board executive approved piece of garbage that has nothing original or interesting to add to the genre."
    },
    {
      "rating": "2",
      "text": "This is the kind of film that you'd recommend to someone you hate. A genuine congratulations is in order if you found a single joke funny, because I and every other person in the cinema with an IQ higher than a piece of broccoli didn't laugh once.\r It's honestly the most lazily assembled film I've seen in 2016, and that's seriously saying something. The only reason that this isn't a straight up 0 is that Dirty Grandpa and Gods Of Egypt were somehow still worse."
    },
    {
      "rating": "4",
      "text": "You'd think, with so much talent on screen, that the year's \"perfect date-night comedy\" would be able to provide a little more, well...Comedy. It's kinda hard to laugh when what should be inspiring said laughter is the awkward interactions of the Gaffneys (Zach Galifianakis, Isla Fisher) and the Joneses (Jon Hamm, Gal Gadot).\r That's not to say I didn't laugh at this movie. There are indeed inspired moments of true comedy, but these are far too fleeting to sustain the entire film on the brief laughs they produce (the way I imagine it is somewhat like trying to light the entire Empire State Building by candlelight with one measly candle on the bottom floor). The problem is that either A.) this movie thinks it's a lot funnier than it actually is, B.) the creators think so lowly of their audience that they think they can put in as little effort as possible and simply coast on the charm of their lead stars, or both. I wonder if some sort of system could be implemented in which the average number of watch-checks by audience members equals the number of years the director and screenwriter of said movie must return to film school before being allowed to work on the silver screen again. To me, that seems like a good solution to a lot of problems within modern cinema, though poor Michael Bay and Friends would be there until they died.\r While I'm at it, let's hear it for the incredibly generic and overused \"spies in suburbia hiding in plain sight\" storyline, which in the days of \"Mr. and Mrs. Smith\" at least held the distinction of being fairly fresh and original. The execution wasn't exactly brilliant in those days either, but it was enough of a new idea to at least sell tickets. After a number of similar movies with varying degrees of success (\"The Spy Next Door\", \"Central Intelligence\", and \"Knight and Day\", to name a few) the dead horse is all but beaten to a bloody ruined pulp. Any movie these days that I actually want to see (Barry Jenkins's \"Moonlight\") or think at least looks interesting enough to check out (Rob Zombie's \"31\") is given a limited release, and thus I'm forced to settle for the generic wide-release cash cows that plague theaters across the country. I need to give Paul Thomas Anderson, Quentin Tarantino, Richard Linklater, and a few others a call soon...Maybe if I beg them hard enough, they'll start returning some of the artful magic to movies.\r Right, the storyline (what little of one there is)...I almost forgot. Jeff Gaffney (Galifianakis) and his wife Karen (Fisher) are looking forward to spending some quality time together over the summer after shipping off their sons to camp, but after a fantasy sequence that ends disastrously (one of the few truly funny moments) they mainly just settle back into their normal lives as an incredibly unhelpful HR representative and an interior decorator, respectively. Bored and not particularly fond of the neighbors they already have, they are ecstatic when a new handsome, worldly couple moves in down the street (Hamm and Gadot) and immediately try to befriend them. However, their perfection in everything they do and some odd behaviors arouse Karen's suspicion, and pretty soon both she and Jeff are wrapped up in the craze of finding out who's been using Jeff's computer to talk to an international arms dealer (Patton Oswalt, who decided to downgrade from voice work in Academy Award-winning animated films to this kind of junk) whose motives, history, and utterly unoriginal bad guy name are given an explanation for all of 30 seconds (the lattermost, not at all; it seems like it only existed for the point of throwing in a one-liner at some point). At about the 20-minute mark, you can more or less guess everything else that's going to happen in the movie.\r Casting Zach Galifianakis in a movie that so squanders his comedic talent is a sin in itself, but both he and Fisher, as Jeff and Karen, come off as merely a stereotypical dorky suburban couple that doesn't get out much and are repressed beyond belief in the bedroom (running the risk of sounding slightly misogynistic, I imagine the last thing a lot of people would be is repressed in the bedroom with a wife like Isla Fisher). The Joneses are far more interesting to watch, particularly Jon Hamm, who makes the best of a bad situation and manages to make some of his material somewhat enjoyable (compared to the other, ahem, \"jokes\" found within this movie). Oswalt's villain is perhaps best described as a terrible re-imagining of the Benjamin Chudnofsky character from 2011's \"The Green Hornet\", except whinier, more sloppily dressed (nothing conveys a rich, bitter nerd like wearing a video game/comic shirt under a suit jacket), and existing for the sole purpose of advancing the plot. Let me be clear, however: none of this is the fault of the actors and actresses. They try their best, but sometimes nothing can save a truly bad movie.\r In short, is it worth the price of admission? 'Fraid not. 4/10"
    },
    {
      "rating": "6",
      "text": "Light fluff for an excuse to go to the movies and eat horribly unhealthy food in the form of overpriced \"buttered\" (who really knows what it is) popcorn and cola. Its about Zach who looks like he's been smoking weed through the whole shooting of the film, and his wife. They find out their neighbors are Russian spies and lots o' laughs ensue.  Or perhaps not so much, but at least I wasn't working, either at home or at work. So at least there's that. Our theater upgraded to these mechanized lounge chairs seats. Perrty sweet way to eat popcorn."
    },
    {
      "rating": "4",
      "text": "Lacking any sort of humor or wittiness whatsoever, Keeping Up with the Joneses squanders all of its potential with outrageous action scenes and a poorly structured plot-line."
    },
    {
      "rating": "5",
      "text": "Keeping Up With The Joneses is a serviceable comedy that is well produced and acted, and will probably provide a few chuckles. It's ultimately bland and uninteresting, but at the very least it is a good time waster."
    },
    {
      "rating": "2",
      "text": "This comedy is nowhere near gold. It's the same to saying that Keeping Up with the Joneses does whatever it keeps trying to make the audience laugh but every single bit of it was left from all the poor attempts it tries. This is not a comedy, repeat, it's not an actual comedy. It's a threat."
    },
    {
      "rating": "3",
      "text": "With his unassuming ineptness and understated delivery, Zach Galifianakis is always amusing. In this movie, he provides the only laffs. He plays an earnest but boring HR manager who's married to a sweet, but mousy Isla Fisher. Their life is upended when a hot, cool new couple with a secret agenda (Jon Hamm, Gal Gadot) moves into the neighborhood. While the plot is completely predictable and the script is seldom funny, there's an upbeat energy that manages to keep it from boring and Galifianakis saves the day…or at least the movie."
    },
    {
      "rating": "6",
      "text": "This is more of a film you watch for the Talent than the story. You've got some of the top A- and B-listers here, so it's fun to see 'em do their thing with the derivative dramedy material they've got. It's not meant to be taken seriously so watch it with a forgiving eye :-)"
    },
    {
      "rating": "6",
      "text": "Curiosity led them to involve in a greater danger.It was the other Zack Galifianakis film that I watched back to back. 'Mastermind' was a fun crime film based on the true event, but this one was purely fictional action-comedy. Once again the casting looked so good. Particularly Gal Gadot, her involving in it after becoming Wonder Woman is a hype. So anyone to anticipating some great action sequences is normal, but it was average on that section.First of all, it is nothing to do with the 2009 film 'The Jonese'. The characters seem quite resembling, like between and about the neighbors, but totally different plot. When a new couple move into a vacant house, the one in the neighborhood suspect there's something going with them. After all the efforts, when they come to know the couple's true identity, they're already involved in their undertaking and now cooperating is the only way out. So how it ends with their entanglement takes the film to its final stage.Comedy scenes were good. Not that much clichéd, so one can have a decent fun watching it, especially with a low expectation. Both the lead women were hot, despite not much cleavage in the film. There are some unexpected parts too, but as a comedy, it was much better. And as an action & spy film, it doesn't do much to impress. Overall, a passable film, particularly comedy wise. So if you prefer it, then it should be on that merit.6/10"
    },
    {
      "rating": "4",
      "text": "Another stupid comedy movie. This one has a good cast and everyone seems to do fine but the script is weak and the story is generic. I can't say I didn't laugh a couple of times cause I did. It isn't bad but it's nothing to run out and see"
    },
    {
      "rating": "6",
      "text": "What I’m looking for in a good action comedy is very simple. Laughs, entertaining explosions and an engaging crime story. Unfortunately, Keeping Up With The Joneses has almost none of these. Save for the lead performances, there’s very little to keep you interested in this movie, taking a formulaic story and providing very little fun or excitement at any point.In general, I was very disappointed by this film, but there is one part of it that isn’t so bad: the performances. The A-list cast of Zach Galifianakis, Isla Fisher, Jon Hamm and Gal Gadot are their normal selves, and that allows for at least a little bit of quality to shine through.Whilst they have next to nothing to work with, Galifianakis shows off his typically enjoyable slapstick, Fisher is as likable as ever, Hamm is suave and cool when it comes to being a super-spy, and Gadot is as good in the action sequences as she is as Wonder Woman. Whilst the foursome don’t always have the best chemistry, their individual turns are enough to give you a little bit of joy in this film.Unfortunately, there’s very little else to praise about Keeping Up With The Joneses. Of all the issues, I suppose the biggest has to be its sense of humour. Action comedies aren’t the easiest to get right, particularly as they are more reliant on physical humour than witty dialogue, but that hasn’t stopped some classics like Beverly Hills Cop, Hot Fuzz and Spy in the past.However, this film is almost entirely reliant on the dumbest and most predictable sort of comedy. Its slapstick is repetitive to a tedious extent, the dialogue is bland and frail throughout, and it even reveals a complete lack of confidence in itself by numerous desperate attempts to get laughs and attention through numerous scenes designed for the newly-popular YouTube thumbnail phenomenon.In that, there’s definitely no reason to expect lots of laughs from this film, and what’s worse is that the action isn’t any better. A bit (or even a lot) of mindless action is fine by me in an action comedy, but what makes the action sequences so poor here is how they’re directed. The big budget explosions may look cool, but each pursuit and fight feels so formulaic, plodding along at a dull pace and going through the motions of any Hollywood action movie, providing no unpredictability, tension or excitement when necessary.And finally, there’s the story. Again, I don’t expect a gripping thriller from this sort of movie, but something a little unpredictable and different wouldn’t have done any harm. Unfortunately, it’s yet another lazy and formulaic thing about the movie, going through every single beat of a big-budget action comedy that you’ve seen a million times before, stupidly keeping the film’s more comedic elements largely separate from the action and crime, and creating an ultimately tedious and uninteresting watch.Overall, Keeping Up With The Joneses is as poor as its YouTube thumbnails suggest. Despite an A-list cast trying to make the best of a bad situation, it fails to provide any laughs, excitement or even anything slightly different from the generic Hollywood formula."
    },
    {
      "rating": "7",
      "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"
    },
    {
      "rating": "9",
      "text": "Entertaining & FunVery tongue in cheek, and a bit of a parody on espionage/spy thrillers that somehow we are supposed to take seriously. The four characters all bounce of one another well, and Jon Hamm is always worth watching (how I miss Mad Men!) For some reason I kept imagining Rhys Darby in the role of Jeff Gaffney and Jodie Comer in the role of Natalie Jones."
    }
  ]
}