{"id": 4335, "title": "Kickboxer", "starring": ["Jean-Claude Van Damme", "Dennis Alexio"], "runtime": 97, "genre": ["Action", "Thriller", "Drama"], "description": "If your enemy refuses to be humbled... Destroy him. Accompanied by his brother Kurt (Van Damme), American kickboxing champion Eric Sloane (Dennis Alexio), arrives in Thailand to defeat the Eastern warriors at their own sport. His opponent: ruthless fighter and Thai champion, Tong Po. Tong not only defeats Eric, he paralyzes him for life. Crazed with anger, Kurt vows revenge.", "releaseYear": "1989", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/aeZLJmWKfId3y0MEI5NarVThzN4.jpg", "categories": {"plot": 6.181818181818182, "acting": 4.0, "ending": 4.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 4.0, "action": 7.25}, "reviews": [{"rating": "10", "text": "To the jackass Dr Lowdown - As for the script being lifted from Rocky 5- that cant be true as R5 came out in November 90, a full two years after JCVD's KB. So suck a fat one sonny.\rLook, all martial arts movies should follow this formula. East meets west, transference of skills , mystical knowledge, self improvement empowerment awesome kicks. The teenage boy who saw this loved the athleticism, the editing the smash repeat cuts were all Van damme, he was hardwired into the teenage imagination , I loved the editing pow pow pow pow. Absolute benchmark in teenage action ."}, {"rating": "1", "text": "Kickboxer, this is an old film from the 80's. Storyline is there is no storyline, similar to Bloodsport but Bloodsport was a superior and better movie in comparison to this so won't talk about any storyline. The acting from Van Damme is tacky, cheesy and pathetic and the film fails to deliver any kind of real entertainment. Horrible film."}, {"rating": "1", "text": "Oh lord it's bad. However let's begin with the positive. Atmosphere is cool and accurate, landscapes are great, there are two or three angles and scenes that remain inspired. Van Damme gives the best he can and it is hard to blame him for that. Scenario is simple.Now tackle what's bad and I warmly reccomand you to hang on. Scenario is way too simple and predictable. We saw this schema over and over: the guy who don't know anything getting trained the old way to defeat a new school hardcore rookie making his own rules and laws. The training part is a huge sequence of stereotypes and uninspired exercises. Absolutely unoriginal.The movie was literally unable to make me worry about the characters. According to the logic of american movies, when you can't control a mad guy you are supposed to shoot him but when the bad guys are able to do so they don't. The plot then loses all its importance, eveything seems shallow and missed. Bad guys were in a good way when they captured Van Damme's relatives but the scenario just flips once again to let the hero win easily. The fact that this movie ends on Van Damme's victory is a huge sign that it has nothing more to do than to show us the final fight. World does not stop after a single win, wake up. Your brother Eric is far from being healed.Overall acting is really ineffective. I know Van Damme has a lot to do with this fact but the rest of the cast doesn't help. The only decent ones were V. Anderson (playing as Winston Taylor) and sometimes Alexio (Eric the brother). Jokes are not jokes because not even close to funny. This movie is all about exposing Van Damme's impressive body and flexibility.Romance is digusting. When there is only one significative woman in the hole movie she obviously has to be for the hero. Other women are a whore for Eric and the nurse getting her ass touched by Eric. Did I mention the plot used the heroin's rape to move forward? Was it even useful? Don't think so. But thank you so much for these disgusting and appalling stereotypes and behaviors, Mr. DiSalle, now go get some basic respect lessons. I suppose the ideas of free women were not that strong in 1989 (that I can concede) but the fact that today's people enjoy this movie is far from what I can understand."}, {"rating": "2", "text": "What a horrible, predictable and absolutely boring movie. It's pathetically bad. During the movie I asked myself: 'Is this an actual film or a stupid joke'. It's so dumb, that it  made me angry. In top of the waste-of-time movies. Unbelievable."}, {"rating": "10", "text": "A really fun and enjoyable martial arts B movie. It is the kind of movie that will be hated by critics but loved by a loyal fan base. Of cause it is no Godfather movie, Shakespearean play or Oscar material and it never tries to be. If you have a soft spot for B movies that are enjoyable and well made this is a must see (especially for martial arts fans). It follows the “No Retreat, No Surrender” formula where the underdog trains to become better than the unstoppable bad guy. As a side note: This and “No Retreat, No Surrender” were marketed as “Karate Tiger 1 and 3 in my country. As I see overlaps in the story structure and both have Jean Claude van Damme it makes a bit of sense even if this has nothing to do with Karate. In my childhood this was a must see in my age group and universally liked. Today we say it is a “Turn your brains of popcorn movie” and it is a good one. The story follows the brothers Eric and Kurt Sloane. Eric is the Kickboxing champion in the USA and Kurt his coach / cornerman. After Eric successfully defends his title with ease he wants a new challenge and want to compete against Thailand's champion as Kickboxing started there. He however never expected an opponent like Tong Po who crushes him in the fight with ease and left him with heavy injuries. Kurt wants revenge but knows he is absolutely under-prepared and has to train. This is the set up of the story. It is the martial arts underdog story we love in so many incarnations. It works and entertains well for genre standards. They do also more than needed and I like that too. The fights are well done and impactful. For its time it was really good. It is garnered with some humor. Another part of my enjoyment were the characters. Jean Claude van Damme was at the beginning of his career in this movie and I think his role as Kurt helped to establish him. He works well and delivers the fights. Michel Qissi as Tong Po is a menacing opponent. He is like a grim force of nature that crushes anything in his way. He just delivers with his look, posture and expression. Now to Eric Sloane who is played by legendary Kickboxer Dennis Alexio. He also delivers his role even if not being a professional actor. Dennis Chan as Xian Chow fully sells the role as wise and incredible martial arts master. I will also praise Ka Ting Lee as Freddy Lee, Hakell Anderson as Winston Taylor and Rochelle Ashana as Mylee. For genre standards we got a real good cast. Now to the elephant in the room. Today it is viewed by some as having racist stereotypes. To be fair I can see this but say if they want to go for full racism they failed. They would have done far more back then without troubles. It is just an entertainment movie and back then the standards were different. Overall this is a good martial arts movie of its time and really enjoyable. Just expect a popcorn movie and not an art film to avoid disappointment."}, {"rating": "6", "text": "Ah, the 80s..... When American martial arts films portrayed their heroes as being both invincible and without character flaw.\rOf all the 'names' who started their martial arts movie career in Hollywood in the 80's, Jean-Claude Van Damme is probably the most famous. His early successes crossed over into the mainstream (although this site doesn't list many of those that did), before he too slipped into the 'straight to VHS/DVD' fare that his contemporaries had never managed to crawl away from.\rKickboxer is Van Damme's third leading role, and the first film on which he got a writing credit. It's worth pointing out that, in a very 'Jackie Chan-esque' maneouvre, he had two of his earlier films (No Retreat, No Surrender... And Black Eagle.... In both of which he played the main fighting villain) re-released with his name and image used to promote them.... Despite his screen time being very limited.\r But this is a review of Kickboxer, JCVD's homage to the ancient Thai martial art.\rThe story is simple enough. Eric Sloane (Dennis Alexio) comfortably wins his heavyweight kickboxing match and remains undefeated. A reporter suggests he should go to Thailand, as that's where kickboxing is from (a concept Eric doesn't seem to understand), and prove his skills and abilities against them.\rHis younger brother Kurt (JCVD) travels with him, and Eric takes on the Thai champion Tong Po (Michel Qissi - although listed 'as himself' in the film's end credits). Tong Po destroys Eric, Eric again completely unaware of the Thai kickboxing rules, deeming it to be a 'street fight', resulting in Eric being paralysed from the waist down.\rWeirdly, there are no Americans in attendance (despite there still apparently being quite a sizeable contingent of Americans in Bangkok at the time), nor are there any American sports networks in attendance either (despite this being a marquee match-up that would have interested a fair few American viewers), nor are there any paramedics on stand-by (despite both Eric and Kurt being in a position to hire someone, or at the very least make sure the medical support at the arena was adequate).\r All this results in Kurt and Eric being driven to the hospital in Winston Taylor's (Haskell Anderson) blue, Mazda panel-van ('the fastest wheel's in Bangkok', apparently!), where the paralysis is diagnosed.\rKurt swears revenge, but Taylor warns him off. Not only because he is clearly a weaker fighter than Eric, but that Tong Po (and by extension many other local fighters) are all managed by local gang boss 'Freddy Li (Ka Ting Lee) who would have no qualms about shooting Kurt if he felt his livelihood threatened.\r Kurt isn't convinced, and heads around the city looking for a decent Kickboxing school to train at, but he's just laughed out of the door. Luckily (for some reason that's never actually explained) Taylor happens to be chums with a venerable Kickboxing Master, who lives up in the hills.\rKurt goes there, and after explaining his predicament is taken on. The Master, Xian Chow (Dennis Chan) then effectively passes on a lifetime of skills, as well having Kurt master the physical elements of Muay Thai, in less time than it takes for Eric to be released from hospital (and we never see Kurt go and visit him once!).\r Now a fully fledged Muay Thai master, he easily defeats (whilst inebriated) a motley crew of Freddy Li's up and coming fighters in a bar-room brawl. Chow convinces Li to match Kurt up against one of his established fighters and, in a very quick match, Kurt emerges as an easy victor.  Li is then approached by Chow again, who suggests a match against Tong Po, now that the locals have seen the 'brother' of Po's defeated adversary. Li agrees, but suggests they fight 'old school'. Old school involves them fighting in very few clothes (as you do) but, more importantly requires them to dip their bound knuckles in resin and then into broken glass.\r Li borrows a Million dollars from his 'boss', and bets on Po to win. He guarantees the victory by kidnapping Eric, and blackmailing Kurt to lose. The fight obviously doesn't go Kurt's way, until Eric arrives with Taylor and Chow. As soon as this happens, Po completely forgets everything he's ever learnt about Kickboxing, suddenly unable to punch, kick or block in any effective manner. Kurt defeats him (without being touched after Eric pops up), and the film comes to an end with Li being stopped from running away.\r Oh, and there's a love interest character 'My Lee', played by Rochelle Ashana. An actress so atrocious she makes JCVD come across like Marlon Brando.\r As an American martial arts film of the day, this is just distinctly average.\rThis is despite the obviously larger (than average) budget and pretty decent soundtrack. The fight scenes aren't great, but you can't really expect them to be. It's all about the spectacle."}, {"rating": "7", "text": "Classic 80-90's action motion picture ..but not one of the best.It has memorable scene here and there and has some dialogues that are often quoted by action films fans... but ,for a martial arts movie, it has few fights and not very memorable ones. It also has a lot of strage humor that is not aged very well....like the notorious \"JCVD dance\" scene.It do his job of entertaining the audiences and isn't too long ..but todays you'll probably watch it for the unintentionally campy effect"}, {"rating": "6", "text": "Still entertaining. You've seen this plot before. Still fun, not for the story."}, {"rating": "6", "text": "By all normal measures Kickboxer just isn't a very good film. The plot is lifted almost straight from Rocky V, the script and plot are about as subtle as a runaway freight train and far too much of the running time is taken up with, what are supposed to be, spiritual training sequences.\r Despite all this there is something about the Kickboxer, something that only these sort of 80's action films seem to have, that ensures they are still watchable and that by the end you'll be rooting for the good guy to win anyway."}, {"rating": "1", "text": "Un nanar qui a, je suppose, une valeur historique puisqu’il s’agit du tout premier film du père Jean-Claude qui était alors tout jeunot à l’époque ! et on a pour tout dire déjà tout l’univers « JCVD » dans ce bidule avec notamment les grands écarts et les fameux coups de pied retournés.Et d’ailleurs, je me rends compte d’une chose : s’il tape fort le gars Jean-Claude, il est incapable d’enchaîner plus… d’un mouvement d’affilée. Car après un coup de tatane, il faut couper et lui dire quel prochain coup de pied ou coup de latte donner et c’est comme ça dans tous ses films. C’est le problème avec le Jean-Claude : la mémoire-tampon est très limitée.Alors, tu te rends compte, si en plus, il doit ‘déclamer’ quelques lignes, c’est pas gagné… Cependant, il est intéressant de constater qu’à cet égard, son jeu a… légèrement progressé selon le film concerné bien sûr (c’est au cas par cas) depuis cette lointaine époque (1989 quand même !), d’autant plus qu’il débutait non pas de zéro mais de bien dessous de zéro.Quoi qu’il en soit, ce nanar en Thaïlande est bien ridicule de bout en bout… on ‘appréciera’ à sa juste valeur le maître qui entraîne le blaireau par exemple : on se demande si on est (toujours) dans le sketch des Inconnus ou pas (?!)… Le film reste par ailleurs très mollasson, d’une ringardise pitoyable et d’un stupidité de tous les instants, à peine digne d’un téléfilm à la petite semaine. A regarder en accéléré."}, {"rating": "10", "text": "I like the part where Jean-Claude Van Damme kicks people/big guy so a 10/10 from me"}], "recommendations": ["birth_of_the_dragon", "the_legend_of_zorro", "shanghai_noon", "white_house_down", "the_last_stand", "lethal_weapon_4", "the_rock", "shooter", "gangster_squad", "tomorrow_never_dies", "killer_elite", "true_lies", "xxx", "homefront", "safe_house", "die_another_day", "jack_ryan_shadow_recruit", "shanghai_knights", "creed_ii", "the_transporter_refueled", "jack_reacher_never_go_back", "broken_arrow", "demolition_man", "red", "from_paris_with_love"]}