{"id": 1577, "title": "Kick-Ass 2", "starring": ["Aaron Taylor-Johnson", "Chloë Grace Moretz"], "runtime": 103, "genre": ["Action", "Adventure", "Crime"], "description": "After Kick-Ass’ insane bravery inspires a new wave of self-made masked crusaders, he joins a patrol led by the Colonel Stars and Stripes. When these amateur superheroes are hunted down by Red Mist — reborn as The Mother Fucker — only the blade-wielding Hit-Girl can prevent their annihilation.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/4LUzG0blTn6JMhUwXSmjPqNFNXL.jpg", "categories": {"plot": 8.129032258064516, "acting": 8.0, "ending": 8.11111111111111, "soundtrack": 5.0, "cinematography": 4.0, "familyFriendly": 3.0, "funny": 7.052631578947368, "action": 6.85}, "reviews": [{"rating": "10", "text": "This movie is AMAZING!The story is great,the characters are funny and in some points very serious.If you want to have a movie that has  ll in one package,watch this movie."}, {"rating": "6", "text": "\"Kick Ass 2\" is a watered-down version of its original film, as the quality of both the script and choreography seems to have stepped down a notch; but for some reason it still manages to be a enjoyable action-comedy film to watch."}, {"rating": "4", "text": "I absolutely loved the first Kick-Ass, but this sequel fell so flat for me. The wonderful color grading, style, and edgy material are gone this time around, and replaced with bad pacing, a horrible script, and over the top acting. I'm not saying the first one had Academy award winning performances or anything like that, but it seemed so more cliche and superhero like this time around, and I wasn't really feeling it. Jim Carry shines every time he is on the screen, and makes an amazing follow up to Nicolas Cages best performance in decades, but he probably only has 30 minutes of screen-time total. Which is a shame. And while I love Chloe Grace in almost everything she has been in, this was her weakest performance, partly due to the horrible sub plot with a bunch of air-head blonde cheerleaders. To be honest, I don't want to see this ever again."}, {"rating": "5", "text": "Every aspect of the film is a bit more extreme than you expect it to be, but that's exactly what it's going for.  I simply don't think it's much better than the first film, which didn't particularly thrill me."}, {"rating": "4", "text": "I was disappointed in this movie. Maybe I had it coming, I let down my guard and thought that this might be one of the rare instances a sequel does a film good. This film shouldn't be called Kick-Ass 2, it should be called Hit Girl. The entire movie revolves around her and maybe that's not such a bad thing.\r I'll admit the movie was entertaining, but the first film was more than that. In a weird, satirical way, it was inspiring. This movie lacked that because the main theme was overacting and over-editing. It missed the genius realism that Kick Ass held and instead gave us characters that felt cartoonish, unrealistic, and overpowered. The scene that got to me most was that of Hit Girl fighting Mother Russia, it just reminded me over and over of Kung Fu Hustle, which was a great film, but it was BUILT to be funny violence. So watch it if you can get it on DVD, or free... But it's not worth paying for."}, {"rating": "9", "text": "Kick-Ass 2 may be disappointing to some, but it was never going to be as good as the first movie. Never at any point was I bored and even if some scenes were cheesy (and one disgusting) it's still a very good film. Mainly because of the brilliant cast especially Christopher Mintz Plasse as The Mother F*cker."}, {"rating": "10", "text": "Not even going to pretend the pretentious so-called 'critic reviews' are worth even a small particle of my attention. They suck huge monkey balls, and that's just that. This movie is by far one of the greatest movies I've seen the entire year, comes real close to the first. Which leads me to think, if you liked the first, you'll love the second. Go for it."}, {"rating": "7", "text": "Although it doesn't quite match up to the original Kick Ass, this sequel still keeps an excellent mix of action, bloody violence, and humour. What needs to be realised is that Kick Ass 2 is meant to be a fun movie more than a drama, although some of the lines are quite inexcusable..."}, {"rating": "8", "text": "While it was hard to ignore some of the cheesy lines, this movie managed to capture my attention the whole way. What a great cast. It was an all-round hilarious movie."}, {"rating": "9", "text": "Just as good as the first film to be honest. Although this film feels a little rushed with some characters being hard to get attached to, I personally really like this film."}, {"rating": "4", "text": "Kick-Ass 2 is a tasteless, forgettable, sub par superhero satire that just kind of hurts your eyes for two hours. Some things are enjoyable, the action is ok, and the first act is well-written, but between dick joke after dick joke and weird character development, you are just kind of left scratching your head. Still, you can definitely do worse."}, {"rating": "8", "text": "If you enjoyed the first film then don't hesitate to see this one. It is filled with the same profanity and hyper violence as the original. The humor is still there even if it's even darker than the original and there are a few scenes that can be seen to be in bad taste if you take the movie too seriously. Overall it's a worthy sequel that has fantastic performances from the majority of actors with Jim Carrey and Christopher Mintz-Plasse standing out in particular. If you liked the first film then there is no reason why you wouldn't enjoy this one to so give it a try!"}, {"rating": "10", "text": "Don't listen to the critics! The movie is very entertaining and all around just AWESOME! It had the whole theater laughing and every character is great in the story...... Oh and the fight scenes. THEY ARE KICK ASS"}, {"rating": "10", "text": "Kick Ass 2 is wonderful, the characters are fun and even the villains are fun  The story is beautiful and very edible, and the battles are very fabulous and enjoy more than 100% and the final battle  100% recommended"}, {"rating": "10", "text": "Kick-ass 2 is it good? yes it absolutely is one of the movies that i have been waiting for since the beginning of 2013 and if you are a fan of kick-ass 1 then you are going to enjoy this movie. The movie still keeps the cursing and bloody gore from the first one which is great and the story is equal level to being good as kick ass 1, i saw some earlier reviews from critics and i just didn't read them because i know they were wrong and i was correct the movie is great and if you are not planning to see it this summer then you are missing out. anyway do not listen to what the critics are saying my faith and trust in critics died when the hobbit got a low meta score rate and so did man of steel so 42 meta score at the moment is not right it does not deserve that in my opinion it deserves at least 61 meta score in all honesty and i would give it 9/10 i am taking off the 1 more point to make it 10/10 because i didn't like how they changed it from the novel but that is just me the movie was great and if you haven't seen it i advise paying your £7.50 and going to see a movie of the summer that is not one to miss, do not listen to what the critics are saying. so my final point if you like action and superheroes and blood and more action and a kick ass story then kick ass 2 is the movie for you."}, {"rating": "10", "text": "\"this is one of those movies with which you have to see it yourself to see why the critics are just being stupid.\"-adrenilinmatt\r an he have all the reason of the world, this movie is the best movie of heroes but no the best of \"super heroes\" because here don't exist :D"}, {"rating": "10", "text": "A darker, more serious story than that of the original but that is definately a good thing. While still retaining the comedic writing within the characters like the original, this film has brutal action scenes and shows a more mature kick-ass and hit girl. The acting is fantastic all around, even Jim Carrey actually acts in a unique role from anything he has done before! This movie is a work of art and after seeing reviews before I saw it at the premier showing, I was worried. Definately see this movie, it is a perfect follow up to the first one!"}, {"rating": "4", "text": "Kick Ass 2 is riddled with problems. The core of these problems is director Jeff Wadlow, who clearly does not know how to shoot an action sequence. All the action in this movie looks bad and is filmed with shaky cam, compared to the smooth originals of the first. Overall just an utter disappointment."}, {"rating": "9", "text": "(This review has very minor spoilers, and will notify you when such moments occur.) Please, do NOT listen to these snobby condescending critics, thinking they're hot s**t for ripping apart a fim that others loved. I know it's their opinions, but Jesus are they over criticising aspects of the movie. And don't say \"they're criticising the film because they're critics.\" I'm not talking about in general, I'm talking about aspects. Some critics say that \"You should do ANYTHING apart from seeing this film.\" Are you kidding me? I can see why some people might not like this film, but why the f**k would doing a puzzle beat watching this film? Are you seriously that brain dead? Anyway, onto what was good in this film. Every character worked superbly in Kick Ass 2. The big name actors  Jim Carrey, Christopher Mintz Plasse, Aaron Taylor- Johnson and Chloë Grace Moretz.) do an AMAZING job playing their characters, the score is as awesome as it was with the first one, the action is thrilling, and all scenes stand out as a significant, and memorable moment. Some things that have changed, are such as: the much more hilarious sections, the graphic and somewhat disturbing take on it's comic book counter part and the range of superheroes. (SPOILER WARNING AHEAD) Some things that I didn't like, were the: faceless emotions when a character was killed off, and the sad excuse of relationship endings, just so Dave could have dirty (maybe unprotected) sex with night  Probably my biggest hatred with the film was the climax with Mindy's conflict between the popular high school girls. This scene was very stupid, but it only lasted a few seconds, but man was it just flat out STUPID.\r(SPOILER WARNING OVER). All in all, if you liked the first one, see this film, if you like superheroes, see this film, if you like the kill count high, and the blood levels even higher, see this film. Thanks for reading, and I hope this has helped you make your mind up."}, {"rating": "10", "text": "After the movie, i went home and watched the first part for the 10-th time, so, it's a great sequel of a great film. Can't wait for Kick-Ass 3, hope to see it soon"}, {"rating": "9", "text": "Kick-Ass 2 was definitely a film for the fans, if you aren't familiar with the Kick-Ass series then this movie wouldn't be for you. Having said that I am a fan of the comics and this movie was awesome. The fight scenes were crazy and Hit-Girl always runs the show. I hate that the critic scores are low but I honestly kind of figured they would be and I see why they made it so low, to a film's core this film wouldn't be looked at as a masterpiece, and they couldn't exactly retain the same shock factor the first one had because Hit-Girl was only 11 or 12 years old in it. But all things aside this was a pretty entertaining film and I think most people would really enjoy it."}, {"rating": "10", "text": "This movie was spectacular. I had adrenaline pumping through me from the fights. The story itself was great too, this is without a doubt one of the best movies I have every seen. Its way better than its predecessor."}, {"rating": "5", "text": "Jeff Wadlow decided to take a different approach than the first Kick-Ass, and he made a terrible mistake. The dialog in this movie  an absolute disaster, plot is stupid, action & acting is alright. There are couple of funny joke, which isn't enough. Also unnecessary violance all over the place. So, it's a huge disappointment"}, {"rating": "3", "text": "I love Kick-Ass it was vulgar, violent, and original with a good director in Matthew Vaughn.  Unfortunately this is a bad sequel that is terribly paced with to much shaky cam and some really awful scenes involving vomit and the potential raping of a woman.  A big disappointment. D+"}, {"rating": "4", "text": "Kick-Ass 2...Sucked Ass. Kick-Ass 2 has a whole new creative team from the first film! And you can tell...The film tries to emulate what made the first movie so good but fails in almost every aspect. I can't say that I down right hate the movie. Of course there many things about the movie that I liked but a lot more that I hated. The thing that bothered me the most was the whole \"mean girls\" story arch with Hit-Girl, it just didn't work and didn't fit in. It's almost like the creative team glanced at the first movie and said that was Kick-Ass. From what I saw they just don't understand what made the first movie so good. But I will be optimistic and hope that they boot Jeff Wadlow from the directors chair and get somebody who can actually make a movie for Kick-Ass 3. Jeff Wadlow is a hack-fraud..."}, {"rating": "10", "text": "Guys, this is one of those movies with which you have to see it yourself to see why the critics are just being stupid. It happened with man of steel earlier in the year. The user scores where far better than the critic scores. This is because we seem to know more what to look for in a movie these days. My faith in critics has died. I only ever judge a movie after I see it for myself. And kick ass 2 is fantastic. Of course, it was never quite gunna be the movie the original kick ass was, but it left me with the same grin on my face and uplifted feeling in my gut. Go see this movie. It is better than you think. I guarantee it."}, {"rating": "10", "text": "I honestly have no idea what the critics are talking about. This movie was my favorite film of the year. I will never trust a critic again. All through the movie I was laughing and enjoying it. Aside from a few forced scenes, it was flawless and I liked it just as much as the first one. If you liked the first movie, SEE THIS. It was on par with the first if not better. SEE IT!"}, {"rating": "7", "text": "Overall, Kick-Ass 2 is a “good” but not “great” followup to Vaughn’s surprisingly smart, stylish and witty original. The sequel will be more enjoyable for those fans wanting to revisit the world and characters for another romp through a twisted version of the DC and Marvel comic book universes  but beyond that, all you’re getting is a standard action film with a B-movie feel. If it wasn’t Kick-Ass or Hit-Girl headlining, there would likely be little excitement and even less payoff from the Kick-Ass 2 experience."}, {"rating": "7", "text": "I enjoyed this movie, but I was also disappointed in it. It was good, acting was great, effects good, story okay, but it just didn't meet the magic of the first one. Where the first one was a completely unexpected anti-hero story, this actually turned out to be mostly cliche and lacking in originality. It felt like what the first Kick Ass would have been had a producer gotten hold of the script before it went to production. Unfortunately, I think that is what happened here.\r An enjoyable movie and one worth seeing in the theater, but nowhere near as good as the original."}, {"rating": "8", "text": "Ok, it's not Shakespeare. But who are we kidding? Did you see the first one? Did you like it? If yes, watch this movie, you'll like it too. No? Then don't watch it, because it has pretty much the same vibe as the first.  If you liked the first and not this one, I'd be fairly surprised."}, {"rating": "8", "text": "If you were a fan of the comicbook series, be aware of the fact that the violence is not as prevalent in the film translation, also there's a mildly awkward love story between two characters.\r If you were a fan of the first film SEE THIS ONE. I wasn't a fan of the first one, and all the issues I had with the first one were pretty much fixed in the second. My friends that liked the first one left being happy with the film."}, {"rating": "10", "text": "KICK ASS 2  Review. (spoilers)  by  megafish\r“try to have fun otherwise what’s the point.  wise word that fit with this movie,\rIm rating each character\rMusic  reused from previous movie  but some new songs  like I hate myself for lovin you! ,when the saints go marching,\rCharacters :same actors but have gotten older  so they feel different  but I still like them ,\rTeam Justice forever:\rKick ass  felt like he was saying lines directly from the comic, HE IS RIPPED!!  ***\rJim carry   great character  deranged  yeah there’s a dog on your balls!  “try to have fun otherwise what’s the point.”****\rEisenhower  the dog on your balls. I honestly wouldn’t have minded if they had of killed the dog  but maybe it would have changed everything,  I love when mofo says “im not that evil!” when some one asks him if he wants to kill the dog. !!***\rHit girl  very important and more deeper  still great acting  I saw worried about her character being a victim  but it was cool  I love how they had the moter bike scene from the prequel comic of hit girl when she and  Marcus race each other to the house  !!*****\rInsect man  no mask  open homosexual  reminded me of the blue power ranger because he was ridiculed for being gay  but insect man gets acceptance   ***\rAction guy  he was a nice edition and played out the same as in the comic  ****\rNight   I like how she had a fling with kick ass and that made more sense for mofo to kill her  she looks better in the movie, *****\rOther:\rKatie  protected from being attacked. But instantly breaks up with dave because of hitgirl ,**\rMarcus  was interesting considering  mindy’s mother was dead in the movie. ***\rDaves dad  also exactly taken from the comic\rVillains: toxic mega *****\rMother**er  great new costume  some funny lines  way darker  occasional voice change that reminds me of Eddie killbane prior  from saints row 3  I was dreading when he attacks night  (not Katie- like in the comic   but thankfully it was softer, ****\rMother Russia  I was hoping they’d cut her head off,  she looked cooler in the movie, ***\rScenes: hit girl on the van, expanded ,\rThe last battle felt a little messy and was premature  in the comic kick ass and hit girl go to the lair and fight goons  and later the big battle in the centre of the city blowing up comic shops ,\rThe comic  more violent and  sexual  ***\rThe movie  still violent  not sexually violent  ****\rNote: atomic commix wasn’t init ,\rthey put posters from comics made by the writer of the comic mark Millar like American Jesus and superior  ,\rIt wasn’t as fresh as the original  but I liked it   ****stars!!!!"}, {"rating": "10", "text": "This is a great movie, I like it so much, you people have to see this one. Is nothing wrong with this movie, is no the best movie of the year but is excting."}, {"rating": "10", "text": "This Movie is not Overrated its Underrated.. I mean how many movies do you get which have a perfect blend f humor, action, murder, superhero  I think you Get it.\r Some people here and not only here in every country go crazy over this movie (IN a negative way) even professional critics seem  by crazy opinion. Take my word for it, THE MOVIE ROCKS"}, {"rating": "5", "text": "As a fan of the first Kick Ass movie I have to say I was a bit disappointed with Kick Ass 2. It seemed more of a \"Teen Drama\" then the real superhero movie the first one was. Instead of most of the movie being spent on action it's spent dealing with Hit Girl trying to fit into High School. Its just not the sequel I hoped for, and a huge let down for me."}, {"rating": "8", "text": "Not a perfect movie by any means, but it was still good.  Pros: Kickass and Hit Girl were both just as good, if not better than the first movie; action was good, Christopher Mintz-Plasse was great as MF.  Cons: iffy script issues (like Taylor  suddenly knows who Kickass is and is then suiting up  only \"main villain\" to get any real screen time was Mother Russia (the other villains got next to no screen time, let alone any lines).  Despite the cons, the movie turned out much better than I feared. If you like the first Kickass, there is no doubt you will enjoy this one."}, {"rating": "7", "text": "This was a good squeal, not as good or hard hitting then the first one, and im kinda pissed about the ending of the movie with Mindy and Dave kissing, really didn't seem necessary because i believed that the relationship between Mindy and Dave seemed more like a brother sister thing, in fact that is what i kinda wanted it to be, also i didn't like the fact that they kept the Dog Decapitation out of the film for i believe that moment in the comic book was hard hitting, overall Kick Ass 2 is a great squeal not as good as the first yet still accomplices and has the same feel as the original movie."}, {"rating": "6", "text": "This movie was pretty good, but it showed unnecessary violence. A Russian she-male lawnmows a guys head off. That's pretty violent. Lots of cussing. It's not that funny, either."}, {"rating": "6", "text": "No where near as original as the first. This movie suffered from not knowing what it wanted to be. A mindless fun action movie? Or a meaningful movie with a cast that people cared about. It failed at the latter.\rBut  in saying that  I am not denying that I did enjoy seeing this movie. It was good as a mindless action movie."}, {"rating": "10", "text": "I think that they could have left out some of the parts dealing with Hit-Girl and trying to be normal but other than that, it was an excellent film. I absolutely loved it and I will probably watch it a million times more when it comes out on DVD/Blu Ray. I went and say it with a bunch of my friend and we all loved it."}, {"rating": "4", "text": "La primera entrega de Kick-Ass fue muy entretenida, uno de esos proyectos que se quedan contigo y te sientes identificado por su alta gama de personajes cómicos y además es muy divertida. A todas esas personas que han sentido lo mismo que yo les digo: Ni se les ocurra ver esta segunda parte porque quedarán muy decepcionados. Está bien; lo grotesco, la violencia intensa, los personajes graciosos, los diálogos que daban risa, directamente, todo a la basura, ésta vez Kick-Ass no pudo justificar su contenido, estoy consiente que, ni siquiera Hit Girl podría salvar esta película de su atroz destino. Una decepción"}, {"rating": "5", "text": "About midway through Kick-Ass 2, the sequel to 2010’s normal-guy-becomes-a-crime-fighter fantasy, a budding archrival corners the new girlfriend of his costumed nemesis. “You’re done banging superheroes, baby,” he sneers at the terrified teen. “It’s time to see what evil dick tastes like.” That line, pulled verbatim from Mark Millar’s Kick-Ass comic-book series, tells the uninitiated everything they need to know about the franchise’s controversy-courting mastermind. A savvy huckster provocateur, blessed with Jerry Bruckheimer’s blockbuster instincts and Bret Easton Ellis’ gift for pissing people off, Millar has conquered the cape-and-cowl industry by putting \"edgy,\" attention-grabbing spins on superhero mythos. This second adaptation of his flagship title pulls back a little on the showy repugnance of its source material; the unsavory scene described above, for example, ends with a performance-anxiety joke instead of a rape. Yet even with its edges sanded down, Kick-Ass 2 is unmistakably Millaresque—a juvenile comedy of excess, in which skewering adolescent power fantasies looks an awful lot like indulging in them.\r As before, the diamond in the rough is Chloë Grace Moretz, reprising the role of foul-mouthed, adolescent vigilante Hit Girl. Determined to honor her father’s dying wishes, the orphaned avenger hangs up her mask and blades, turning to face the equally daunting obstacles of high-school. (Her rivalry with the mean girls culminates in a quintessentially Millar money shot.) Left to clean up the streets alone, the titular everyhero (Aaron Taylor-Johnson, bland as ever) falls in with a motley crew of fellow costumed civilians, led by a born-again bruiser (Jim Carrey, on movie-star duty in Nicolas Cage’s absence.) On the other end of the good-to-evil divide is Christopher Mintz-Plasse, still hurt about the way Kick-Ass blew his mobster father up with a bazooka. Slipping into black-leather bondage gear, he reinvents himself as the world’s first supervillain **** and begins assembling an army of thugs. The film can’t seem to decide if his character is a joke or a genuine threat, and that’s a pity because there are hints of actual menace in Mintz-Plasse’s volcanic hissy fits.\r Like most second chapters in comic-book series, Kick-Ass 2 is better than its predecessor, though there was really no place to go but up. New writer-director Jeff Wadlow (Never Back Down) handles the jarring shifts from vulgar banter to Peter Parkerish hand-wringing to blood-spurting carnage no better than Matthew Vaughn did. The tonal schizophrenia extends to the film’s world, which is meant to be realistic—note the references to Twitter and viral videos, as well as a focus on the medical consequences of playing hero—but often feels as cartoonishly outsize as Joel Schumacher’s Gotham. Building to a deeply underwhelming battle royale, Kick-Ass 2 stumbles every once in a while, as if by accident, into a poignant moment. There’s something oddly endearing, for instance, about the scene in which every member of the amateur Justice League runs through his or her traumatic backstory. And then there’s Moretz, whose character is suddenly afflicted with the inconvenient emergence of hormonal desire. The actress once again makes the most of her part—though not even Hit Girl could overcome the awfulness of Millar-approved mouthfuls like “I’m gonna go Saudi Arabia on your ass.”"}, {"rating": "0", "text": "La suite du très perfectible Kick-Ass sombre dans les bas-fonds de la nullité... et se complaît avec une complaisance des plus douteuses dans la simple idiotie et la super débilité : un \"cocktail\" sans doute idéal pour les ados mongolos et autres adulescents restés bloqués à leurs 12 ans d'âge mental.Une suite qui sent mauvais l'opportunisme bassement mercantile et la cupidité de bas étage ; une suite incroyablement basse du front et basse de plafond, étonnamment mal filmée : un ensemble débectant qui file la migraine en une petite demi-heure et fait tomber dans le coma de la stupidité au-delà."}, {"rating": "3", "text": "Do you think it's funny if a guy is a silly costume who is about to start a gang rape of a woman can't get his dick hard, so they just beat the living  out of her instead? Then you might enjoy this movie. The director doesn't have what it takes to put the violence into proper context or to deliver it with a point. No, this is like a 13-year-old who has just discovered swear words and is now telling people on Xbox Live how he will rape them for headshotting him in Call of Duty."}, {"rating": "9", "text": "Kick-Ass 2, even though not as good as the original was still a thoroughly enjoyable experience. I was worried that perhaps without Mathew Vaughn in the directing chair it wouldn't feel like a Kick-Ass movie. I'm glad to say I was wrong, Jeff Waldow did a very good job in creating this highly anticipated sequel. I thoroughly enjoyed seeing the delicate side to Hit-Girl and her going through the vulnerable side at being a teenager. Moretz gives another fantastic performance, in this series just as she gives a great performance in all her movies. Aaron Taylor-Johnson slips back into his role easily as does Christopher Mintz-Plasse who is hilarious in this film as well. Carrey is almost unrecognizable in this production which is good because I feel he was no longer playing yet another version of himself as he has been doing lately but I real character who you actually feel for. All in all this was a great follow up to Kick-Ass, I wouldn't mind if they made enough, but then I'd be satisfied with this ending."}, {"rating": "10", "text": "For anyone who loved the first one, this a great follow up, filled with action, suspense, and drama. Kick ass is kicks even more ass than the first one, and even has friends to help out. This movie is amazing, the finale was incredible. It was the most fun I've has at a movie in quite some time. FULL PRICE!"}, {"rating": "7", "text": "This is a movie where I truly disagree with the critics. This movies is fun and exciting, it's not great but it's still a fun movie. Overall, it you're a fan of the first Kick-A** movie, then for sure you'll love this one. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies."}, {"rating": "3", "text": "Most movie goers are leery of sequels, and with good reason.    Hollywood tries to take the easy route when a movie becomes a hit especially these comic book hero types, and while it attempts to recreate the freshness and wit of the original, Kick Ass 2 just doesn't get it done.\rThe film's strong suit is Chloe Moretz, the adorable actress who plays Mindy McCready aka Hit Girl.    There are a few scenes of more normal teen age behavior where she can pull at your heart strings, especially at the hands of a particulary vicious popular girl.\rI predict good things for Moretz in the future.    The rest however is a mixed bag that has a very irritating super villain who calls himself  which is more pointless than offensive.    His lisp, whether intentional or not is very annoying.\rJim Carrey has a relatively small role as a former mob hit man who finds Jesus and trains the good guy bunch led by Kick Ass.    Even his presence is downplayed, and he doesn't have a huge role.\rWhile I didn't miss the message of superheroes being just regular brave folk doing what's right, Kick Ass falls on its ass due to cliche after cliche and gratuitous violence meant to give it an edge, but in this case is used to try to give the film some extra oomph if you will.    Sorry.    This is another clunker in a summer season full of unusually disappointing movies."}, {"rating": "5", "text": "It is always painful and disappointing inside to see something potent and original dissolve away into the Hollywood formula. Clearly there is that pressure on Kick-Ass in the sequel. The question is, how has the ‘something more’ in the original fared? Something more than entertainment through the standard sugar high. Remember how touching was big daddy’s love for little kick girl when he would say “Child, your inventiveness is so wonderful.” Remember that hilarious beginning scene with the superhero we thought was our protagonist turning out to be just someone else who was mentally ill? The sequel is starting to dissolve around the edges. Gory fight scenes are less and less realistic and actually begin to get boring (except for kick girl’s!). What is doing well in the sequel is the comedic quality of the dialogue, the funny lines, and most of all the mystique of kick girl. What is it with her costume anyway? It is such a perfect vision. Kick girl is such a wonderful vision of a classic archetype. She represents anima in an early developmental but extremely potent state. Given this, it is no wonder she has propelled to such stardom especially with boys and even men. But even as a child, she is not FOR children. It is unfortunate in a way that her potency is rooted so entirely in violence. Theoretically it could have been based on many things. In it’s current incarnation it defines the Kick-Ass brand however, and isolates away this potency into an unrealistic basis which only Kick Girl can really own. Quite a brilliant form of ‘copyright’ actually."}, {"rating": "10", "text": "This movie was fantastic! I was a huge fan of the first Kick-Ass movie and when I first heard the rumors of Kick-Ass 2 Balls To the Wall I was excited. The acting was great especially from The  Kick-Ass himself seems like a better hero than he ever was before and Hit Girl is still a bad ass. Jim Carreys performance was great but he wasn't in the movie enough. I'd say he had twenty minutes of screen time which was a big disappointment. A big problem with this movie is that they entered so many new characters but they never had any character progression. But even with that you don't even notice it.\r Just a quick message I would like to see the final Kick-Ass movie come out so please support the movie by buying it instead of pirating it online."}], "recommendations": ["kick_ass", "the_condemned", "venom_let_there_be_carnage", "the_green_hornet", "the_spy_next_door", "deadpool_2", "21_jump_street", "teenage_mutant_ninja_turtles", "the_a_team", "the_tax_collector", "this_means_war", "the_expendables_3", "the_expendables_2", "baywatch", "machete", "deadpool", "kingsman_the_golden_circle", "the_expendables", "xxx_return_of_xander_cage", "i_am_number_four", "rambo", "machete_kills", "the_twilight_saga_eclipse", "the_babysitter_killer_queen", "mission_impossible_iii"]}