{"id": 1027, "title": "Kick-Ass", "starring": ["Aaron Taylor-Johnson", "Chloë Grace Moretz"], "runtime": 117, "genre": ["Action", "Crime"], "description": "Dave Lizewski is an unnoticed high school student and comic book fan who one day decides to become a super-hero, even though he has no powers, training or meaningful reason to do so.", "releaseYear": "2010", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/8citjdBmjddZjlPsAHEyCKwGVvD.jpg", "categories": {"plot": 7.45, "acting": 8.291666666666666, "ending": 4.0, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.785714285714286, "action": 7.954545454545454}, "reviews": [{"rating": "8", "text": "Kick- Ass offers an unforgettable performance from Chloe Moretz, gore, action and humor and the whole movie just bathes in profanity I give this movie 86%."}, {"rating": "10", "text": "Kick-Ass is very funny and interesting movie ! I like it very much and I give to it 10 from 10 ! I am loking forward for second part!"}, {"rating": "8", "text": "Movie was awesome. A few great moments; Cage burning up for example. Hit Girl definitely stole the show though, she was too good. Her acting was solid."}, {"rating": "10", "text": "This film was fantastic and everything I hoped it would be. I had never read the comic but this film was amazing. The acting was great, the visuals, fight scenes, and gore were top of the line."}, {"rating": "8", "text": "Kick-Ass is without question the best of the recent trend of postmodern superhero films. It's not mercilessly bleak like Watchmen, not depraved like Super and it's certainly not for kids like Sky High. A lot of the film's quality hinges on a truly great cast. Aaron Johnson makes a great loveable loser Dave Lizewski who decides to become the titular, wet-suited hero, Mark Strong adds another great despicable villain, the powerful gangster Frank D'Amico to his repertoire and Christopher Mintz-Plasse is great as always playing Frank's lonely son and (disturbingly willing) heir to the D'Amico criminal empire, who masquerades as a new hero Red Mist to contact Kick-Ass under the pretence of friendship. The real highlights of the film are the dream pairing of a moustachioed Nicholas Cage doing his best Adam West impression and a hilariously filthy-mouthed Chloe Grace Moretz playing the vengeful father/daughter hero team of Big Daddy and Hit Girl. Let's be honest, Mr Cage has had some stinkers in his career, but when he gets it right, he really gets it right - he has the opportunity to show his undeniable talent for both comedy and pathos here, and the character arc of Damon and Mindy Macready is certainly the most rewarding and entertaining of the whole film. There are a few instances where the story runs out of steam, and Matthew Vaughn's Brit-dominated cast of villains do occasionally slip out of their American tough-guy accents, but a wealth of affectionate digs at comic book lore, Jane Goldman's delightfully sweary script, some gloriously violent action and Matthew Vaughn's accomplished direction more than make up for it. Kick-Ass is an immensely enjoyable viewing experience, that will please comic fans, comedy fans and fans of terrifying murderous tweens alike. I just hope the inevitable sequel doesn't lose any of its charm, inventiveness and especially its sense of fun."}, {"rating": "10", "text": "The Big Daddy warehouse shootout was epic."}, {"rating": "10", "text": "Loved it. The love reviews are comical. It was fun. Period."}, {"rating": "10", "text": "I went into this movie thinking it would be a comedy, but oh was I wrong. The movie keeps you on the edge of your seat with with violent action scenes and when the movie does slow down they hit you with a joke. I suggest going to see this movie while you still can."}, {"rating": "10", "text": "What is not to like about this movie? Brutal violence, great performances, a kick-ass soundtrack and overall one of the best film experiences to come along in a very long time. You will not be disappointed."}, {"rating": "9", "text": "Excellent movie. Was laughing throughout. Definitely recommended."}, {"rating": "10", "text": "Holy **** **** does this movie rule. The first time, it felt a little of the edge and all over the place. But as I rewatched it, I absolutely acknowledged its awesomeness. I knew what I was getting myself into, but holy **** It's better than any action movie from last year. Or any comedy. It's breath-taking. captivating, stunning, hilarious, beautifully perverse and all around fantastic. What Matthew Vaughn did to the superhero genre was take it, **** it and out plopped the greatest action movie of 2010. The acting is supreme - I'll never find a hitgirl beter than Chloe Grace Moretz -, the editing, jaw droppingly terrific, the directing and writing, pants-****tingly great. It's ****ing perfect. I can't really find any faults or problems with it. IT IS ****ING AMAZING!!!!!!!!!!!!!!!!!!!!!! I love you Matthew Vaughn. In a non gay/platonic way."}, {"rating": "4", "text": "Kick-Ass, despite all its grandiose, action, pop songs, violence, swearing, humor, and commentary, ends up to a film that simply wants to be cool and doesn't know when to stop. Eventually, all this effort and need to be important kills any sense of wonder, and the final product comes up as rather tame. The violence never has any punch because it is so forced (without the creative wit of some like Quentin Tarantino, it comes across as shock), and the comedy is too wink-and-a-nod to entertain."}, {"rating": "10", "text": "I'm just going to write a short review as I'm watching it at the moment for the third time today. This film is realistic as in it could happen. It is so funny. Everytime I watch it I laugh louder. The soundtrack is the best ever in the film and I listen to whilst playing MW3 multiplayer. Nicholas Cage and Chloe Moretz should have got an oscar for this spectacular performance."}, {"rating": "10", "text": "What can I say about this movies that was not already said ?It is simply awesome. I saw it 3 or 4 times and each time I discover new details that make me think that I will need to watch it again. What an entertainment !"}, {"rating": "10", "text": "Kick Ass is awesome. Period. No questions asked. This film brings life to people that love superheroes in a cool way, I mean look at the action scenes! They are damn good! Kick Ass is a really well done movie and I really can't wait for the next part. Kick ass has those Hollywood elements that director Matthew Vaughn has put together, with cool weapons and jetpacks! The story or plot about Dave Liwinzki has been put together real good and the characters like Mindy and Big Daddy are the major elements for the movie to thrive. The film has emotions, action and lots of it, gore and man a lot of gore, and superheroes saving the city from ruthless drug crime lords. If you haven't seen or finished the movie, watch the climax."}, {"rating": "10", "text": "Kick Ass is not a superhero, but just a normal college kid hoping to become a bad ass hero! He thinks he's a pretty big deal after his video went viral, but then he meets Hit Girl and Big Daddy, the real superheroes. The movie is very well filmed, with even yet colorful detail and an interesting story."}, {"rating": "10", "text": "Succeeds at everything it attempts to do and gives their target audience exactly what they're looking for. Chloe Grace Moretz steals the show but the performances are all around good. A very fun film that will probably go down as a cult classic."}, {"rating": "10", "text": "Like all good action films kick-ass contains strong gory violence and outrageous comedy. Kick ass explodes to life with amazing special effects and hilarious scenes that will keep you entertained for the 117  mins of run time. Kick-ass kicks spiderman and superman in the ass. literally. You will have never scene a superhero film like this. This movie is definitely worth watching, and if you like superheroes, action, strong violence and comedy moments that will surely make you laugh, It is about time you see a movie that kicks ass. Kick-ass is the film4u."}, {"rating": "10", "text": "Kick-Ass is my favorite movie of all time, tied with Donnie Darko. Kick-Ass is truly amazing, and I love every second of it. The idea is unique, and is executed beautifully. The movie is hilarious, serious, sad, action-packed, brilliant and mesmerizing. Kick-Ass truly kicked MY ass, and there's really nothing more to say. If you have not seen this movie, then you really f*cking need to. 10/10"}, {"rating": "8", "text": "Now, what \"Kick Ass\" presents to us is the new era of superheroes; it screws the old, classical heroes like \"Batman\", \"Spiderman\", and \"Superman\", and delivers addictive violence and superheroes that actually have a normal story with a normal goal. The movie is stunning and powerful. However, it is Chloe Moretz, the girl who was Hit Girl, that bloodied up the screen for the craving audience. This film certainly DOES kick ass!"}, {"rating": "10", "text": "\"Kick Ass , As far as Action films go , is amazing , stunning , and will keep you entertained for its 2hr run time , which sometimes maybe hard to do , Aaron Johnson leads a all star cast , with lots of action , fun and Excitement this is the one movie that lives up to its TITLE!.\" A"}, {"rating": "10", "text": "I'm not ashamed to admit this is one of my favorite movies of all time. The entire premise is ridiculous, but the movie takes itself so seriously that it feels like an actual attempt to make a super hero movie."}, {"rating": "5", "text": "Chloe Moretz delivers a wonderful performance, and all the buzz about a 12 year old actress engaging in the ultraviolence of her role is, I think, very overblown. But all this misses the point. In the end, when she and Nic Cage aren't on screen, the film is just a dull amalgam of superhero spoof and highschool comedy. And it's not very funny, either."}, {"rating": "9", "text": "Kick Ass is actually a great movie.  Many will love it, since it might be \"the goriest superhero movie\" I can understand that the whole base of it, is stupid, but refreshingly entertaining"}, {"rating": "10", "text": "I reward it a \"The Best Action Movie In 2010\""}, {"rating": "9", "text": "An imaginative reboot of the superhero story with some cool visuals. I hate superhero stories at this point but this ranks in the top four of all time on my list, behind The Dark Knight, Iron Man and Spiderman 2, although this may be better than S2. Chloe Moretz is a very cool young actress."}, {"rating": "9", "text": "I can't quite agree with most of the tut-tutting critics. I admit that several things in the film made me raise an eyebrow, and it did make me think, because I've never seen stuff like an 11-year old girl swearing like a truck driver and killing people in brutally violent ways in a film. Ultimately I think the ones crying \"for shame!\" are over-reacting  just a tad. The film does puts its toes to the line, but for me it doesn't quite cross it. And let's face it, it's a funny, clever idea, extremely well executed. It doesn't make the mistake of many such films by diving into the action immediately before we've gotten to know the characters. People are oblivious to the fact that it makes it more exciting if we care about what happens to them, if it's not just frenetic mindless action. Vaughn takes his time and his pacing is impeccable, just the right amount of build-up to the climactic scenes, and he deftly makes these scenes emotional as well as exciting. The cast is pretty much great, with the possible exception of Mark Strong, who is not quite loathesome enough to be the arch-villain. Every critic and every \"user\", however, has agreed on one thing: this film contains a star in the making. Chloe Grace Moretz is astoundingly assured and inspired at 11 years old. Never seen a child actor this compelling EVER, not Anna Paquin, not Natalie Portman, not Jodie Foster. She steals every scene she's in and steals the movie. See it just for her.  Also, great music."}, {"rating": "10", "text": "Holy **** this movie is **** amazing. It starts out kinda ****ty and mediocre and then it just suddenly cranks the awesomeness to 11. An amazing story that comes up with a truly unique answer to the question, why aren't their any superheroes?"}, {"rating": "9", "text": "Seriously, average review of 66? This film was funny, had some of the best action sequences I've ever seen, and was presented very well, some amazing song choices for the soundtrack. Its hard hitting in places too. I was genuinely surprised to see the fairly average score of 66 on here."}, {"rating": "9", "text": "The critics obviously need a lesson in whats good about a movie. No one cares about your moral outrage or your political correctness. Im just glad you lot werent in the focus greoup for this film. This film is fun and thats one of the most important things about main stream media. If this movie offends you, you need to take along hard look at what your life has become."}, {"rating": "9", "text": "wow this movie was just awsome . it was a unexpected suprise . i really didnt think it was gona be that good .i original wanted to see it because it had the guy who played Mclovin in super bad in it . i thought it would be funny with him as a super hero .after seeing it though i quikly relised that the star of the show was not him or even kick ass him self . it was the little girl mindy AKA Hit Girl . i mean i hate kids and despise them but this was one kid i liked her acting. her lines where even better and her action was fantasticaly enjoyable to wach . the plotof this film was really enjoyable as well . it pretty much asks the question what if super heroes where real in are world what would they be like . the film feels original and is well acted by all except nicholas cage who is spotty at best . seems like cage was only in this for the money and pretty much just phoned his performance in . all in all the this movie will probubly be the best movie of the year . i really dont think i'll see any thing better then this ."}, {"rating": "10", "text": "Both the favorable and unfavorable reviews miss the moral question at the center of Vaughn's film:  why are we bystanders?  Kick-Ass' world is riotous, self-deprecating, and awesome; but it is the exact opposite of irresponsible.  Rather, it unmasks an adult world in which police officers operate on both sides of crime, citizens are voyeurs into one another's suffering, and we all wonder who is going to change it.  By now, it is clear that neither adults nor teenagers are willing to risk their routines for their neighbors.  At least teenagers still fantasize about doing something.  So the obvious answer is a little girl who, with some sidekick mockery from Nic Cage, makes Batman look like a man dressed up like a bat.  To echo other reviewers, Hitgirl is the new standard of awesome.  But, until Kick-Ass' moment of transformation, she is also the last human willing to offer an embodied answer to injustice.  That Vaughn hides this seriousness in such absolutely brilliant awesomeness might confuse some, but it should not be misinterpreted as a statement of \"coolness\" or teenage hormonal self-gratification.  It's saying much more than that.  Why hold the fact that it's also cool against it?"}, {"rating": "10", "text": "Kick-Ass is possibly one of the best films so far this year. It's brilliant - funny, violent and just so damn cool. Matthew Vaughn took a risk making this film and I can guarantee it's paid off. The film is packed full of comic book references and homages to film like Batman, Kill Bill and Scarface. The title character is played Aaron Johnson, who justifies his place on the screen. I thought his American accent (he's British) was very natural and he brings this 'loser' character to life. But don't think he's the star, it's actually his smaller companion played by Chloe Grace Moretz - the merciless and skilled fighter Hit Girl. She was effective, outstanding and gives one of the best performances by a child actor that I've seen in a while. She'll be remembered for quite some time. Other standouts performances include Nicolas Cage's performance as Hit Girl's father Big Daddy who was reminiscent of Adam West's Batman and Mark Strong's drug lord mobster Frank D'Amico actually was pretty funny. Matthew Vaughn's third film is nothing short of a miracle because some superhero movies are pretty awful now, I definitely think this will be a cult film from now on."}, {"rating": "6", "text": "A good action movie, very meh in every other category. The gore is really all over the place, being ridiculous in some scenes (microwave scene, car crusher scene), and average in others. And for a movie that tries to act realistic most of the time, it pulls a lot of unbelievable twists. I mean, it's mainly just because it's being hypocritical. Overall, I enjoyed it, but it's definitely not for everyone."}, {"rating": "10", "text": "I give this a 10, i have watched this movie so many times now and i believe it is one of my favorites, as a huge fan of Chloe Grace Moretz, ill defend her on her behalf, People are saying this is terrible kid is cussing and killing people and got beat up from an older man, what people need to realize is that this is only a movie and its not actually happening, There were many great moment like when Cage was burning and Hit-Girl had to save him, and much more please go watch it and buy it on Blu-Ray"}, {"rating": "10", "text": "The most eye opening and attention demanding movie I've ever seen, it expertly combines Action, Comedy and even a bit of romance, a fantastic, fun movie"}, {"rating": "9", "text": "This movie was great on so many levels. Not only was the story intriguing and exciting. The acting was great. The character development was fantastic. The  use of comic pages to tell the story gave you a real feeling of fantasy in reality. Some other great things about the movie were the fight chreoography which was much better than one would expect for a movie like this. The amazing musical score and soundtrack. As well as a bunch of very comedic scenes. This movie hits you with all the tools and If could remake it I wouldn't change a thing. Would highly recommend this movie to anyone."}, {"rating": "8", "text": "Ok, let me start out by saying this was obviously a cult movie, but, according to the 270+ positive ratings for Metacritic, and the four- star ratings by the magazines that saw this movie. That being said, this is pretty fake at most action parts, which downed my happiness on how good the movie was to that first point. Now, that being said, this is a very good cult movie, even better than From Paris With Love, and that movie was **** sweet. This is a movie that is for sure, one of the movies in my top 20."}, {"rating": "10", "text": "first thing man up!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!if it disturbes u that a kid kills dudes than dont watch an r movie ok the movie shows tat wether ur a sicopah or a regular dude y can make a diff"}, {"rating": "5", "text": "This is a very trivial movie. An unhappy story with superheroes, where the main character is a fake hero, but a 11 years girl kills dozens of men. Nicolas Cage performance is bad, as in the most of his recent movies (too bad... he use to be a good actor). I don't have anything with the scenario, but the writers are very, very, very not inspired."}, {"rating": "0", "text": "The first half of this movie is great. It's very faithful to the comic, and sets everything up really well. The second half of the movie is an abomination. It completely ruins the point of the comic. It's supposed to be about what would happen if people dressed up as super heroes in the real world. Apparently the director got bored with this theme and decided he wanted to make an actual super hero movie, complete with magical jet packs with shoulder mounted chain-guns. If you've read the comic, stay far far away. If you haven't read the comic, you might enjoy this movie a little more. I suggest reading the comic instead though. It's much better."}, {"rating": "5", "text": "Kick-Ass is one of those films where either you like it or not. This movie really divides people. The movie got a lot of buzz around its release because an 11 year old girl cusses rather graphically and performs gratuitous violence in the movie.  Kick-Ass is a critic's wet dream it's the kind of movie you can bash or praise. Sadly I fall in the category of only liking it halfway so I will give it a mixed review and a mixed rating. The movie has at least three plots, the first consisting of Dave Lizewski (Aaron Johnson) a normal high school kid who likes to read comic books with his friends. One day he thinks to himself why a real person doesn't stands up and becomes a real superhero. He goes and buys a suit from eBay and decides to fight crime. The next one is involving Frank D'Amico (Mark Strong) a ruthless, psychotic gangster who son who is played by Christopher Mintz-Plasse, who blames Kick-Ass for stealing his drugs and killing his men. The last one which caused the buzz, is of Hit Girl played by Chloe Grace Moretz and her father Big Daddy played by Nicolas Cage. That's when the movie hits a down low. Hit Girl is an 11 year old girl who's been brain washed by her father to kill as much bad guys as possible. She cusses like an adult and has very cool ways to kill people.  This movie made a mistake that it should have made clear. Hit Girl's innocence as a little kid. It ignores it completely and just makes her an engine of violence. There is a scene where her birthday comes and she asks for a puppy and Big Daddy looks at her weird. She says she's joking and wants a butterfly knife. Instead of a birthday cake or decorations it's talk about weapons and killing people. No matter how ruthless or mean a young child is that kid still has innocence. The kid can cry and be happy ask for nice things. Kick-Ass ignores that and in the process offends people. There's an emotional scene in the movie that I could not enjoy because of all the ruthless violence. The movie exploits her innocence just to make more scenes of violence and action. I might be exaggerating but I wonder why the hell MPAA didn't give it NC-17 rating. (SPOLIER) Here's something to think about this girl gets brutally beaten by a grown man. I'm a father and don't think I'm crazy I imagined my daughter in that situation.  You're probably saying but just don't think it's your daughter. How I'm I suppose to do that when in this world there's enough sickos who actually like doing that to 11 year old girls. Here's food for your mind how de we know as movie goers that a pedophile likes what happens to Hit Girl in the movie. She's wearing a purple wing with a purple clothes to top all of she has a purple skirt. How do we know if a sick f@#k is sitting in the audience saying yeah that's what she gets? The worst part of it all it's a damn shame this movie fell to that because there all a lot of things that I was entertained with. I laughed at the jokes and liked Dave Lizewskie/Kick-Ass side of his story about wanting to help people. The movie was going to get three stars from me but I can't shake the feeling of seeing (SPOLIER) Red Mist shoot Hit Girl several times in the chest with no remorse, an 11 YEAR OLD GIRL. That's just my opinion though.  The movie had potential but fails. My favorite critic Roger Ebert called it morally reprehensible. I find it morally reprehensible half way. Maybe I'll rent the DVD and see it again, it might change my opinion.  NOTE: Quentin Tarantino use anime to express pedophilia in telling the story of O-Ren Ishii in Kill Bill Volume1 why couldn't director Matthew Vaughn did that for Hit Girl's action scenes."}, {"rating": "0", "text": "Wow, this movie really does not deliver on story or violence. I counted just a few minutes of action the rest was boring dialog. I don't know why this movie is rated so high, they seem to be scared of showing the violence. Every scene they cut the blood and limb's shown within a fraction of a second. Its like they want to be violent but don't at the same time. This movie is a terrible comic conversion and not only does it not make any sense it's attempts at being senseless come off as derivative and ultimately this movie is complete garbage."}, {"rating": "3", "text": "Is this a film about actual superheroes, like Batman and Daredevil, or ordinary mortals pretending to be superheroes? It's based on a Marvel Comic but it doesn't take place in the \"Marvel Universe\" where costumed superheroes are commonplace. No, it takes place in the actual world. That confusion aside, the worst part of this film (and what made it so unbelievable and tasteless) is that the most violent scenes are initiated by a foul-mouthed little girl. There's a scene where she enters an apartment full of drug dealers whom she impales with a sword, while dodging their advances with acrobatic stunts. Even worse than that, the audience learns that her father of all people trained her to do this. Towards the end of the film the little girl takes down dozens of armed men single-handedly, and you realize that it would be physically impossible for a little girl (let alone an adult) to do that. So do her impossible stunts prove that this is a superhero film, like Batman and Daredevil? If so, then it"}, {"rating": "3", "text": "What was Matthew Vaughn thinking???? Movie of the moment, which will be mocked and laughed about in the future."}, {"rating": "5", "text": "I must confess that I agree this film is extremely entertaining...a well made, well choreographed, fresh spin on the super hero genre. Moreover, I like the sly satirical spin of the film, taking two takes on what the \"reality\" of a superhero would look like, a wannabe who ultimately gets his ass kicked or psychotic vigilantes who are as messed up as the \"villains\" they kill. Having said all that -- and I know I'm in the minority here -- but I just had this nauseated feeling after the film was over; that is, I don't care about the graphic violence but having an 11 year old _be_ an adult with all that entails in the film was just a boundary that I personally can't cross. Why oh why couldn't they have at least made her a teenager! One other small grip: Too many penultimate final moments, e.g., too many last minute saves!"}, {"rating": "5", "text": "Very disappointing film. I went in really hyped up to see it, the comic was ok, Vaugn is a very talented director and i'd heard good things unfortunately I came out feeling it was just a bit well...average. The action is top notch mind you, although it does jar with the 'realism' of a superhero I still found myself being carried along for the ride. A lot of people put the violence as a particular high point but it was just violent, sometimes a bit too cartoonish, sometimes too realistic, it almost felt like the director wasn't sure what he wanted. The acting was all decent and the girl was very good, but here it felt like they where trying to be shocking by making her swear and kill people which didn't really work for me. Overall it was a good watch once and mildly entertain but not particularly better than your average superhero movie (which it slowly degenerated into."}, {"rating": "1", "text": "This movie is not good. It first suggests that a *real* person can become a *real* superhero, then plays absolutely against that with over the top cartoon violence. It doesn't make any sense, and the fact that it involves children is morally questionable at best."}, {"rating": "5", "text": "Too violent for kids, too dull and undeveloped for adults. This movie was intended for kids to sneak into, not for adults to see. Only redeeming value is its short action and subtle humor. Also it has Nicolas Cage, who is... for lack of a better term, Nicolas Cage."}, {"rating": "4", "text": "How on EARTH can anyone read Anthony Lane's review in the New Yorker and score it as a 50 out of 100 ? Read it again. It's a zero: he equates Kick Ass with pornography and pedophilia. Someone at metacritic is letting more than a little of their own bias into the scoring. I saw the same thing on wikipedia: the article says the film was well reviewed and goes on to list dozens of sharply negative reviews. There is a gap between internet buzz and the true critical response on this film, but that gap is being plastered over by the writers of online review aggregation sites -- who naturally tilt toward a younger person's perspective. I saw the film tonight and although it briefly flirts with cogent satire, ultimately the film-makers do not know what they want to say and settle for exploitation. I'm giving them the benefit of the doubt there."}], "recommendations": ["kick_ass_2", "machete", "the_condemned", "rambo", "real_steel", "crank", "four_brothers", "never_back_down", "the_green_hornet", "the_spy_next_door", "polar", "21_jump_street", "this_means_war", "i_am_number_four", "deadpool_2", "venom_let_there_be_carnage", "peppermint", "deadpool", "the_change_up", "kingsman_the_golden_circle", "the_a_team", "magic_mikes_last_dance", "machete_kills", "crank_high_voltage", "the_tax_collector"]}