{
  "id": 2313,
  "title": "Kidnap",
  "starring": [
    "Halle Berry",
    "Sage Correa"
  ],
  "runtime": 95,
  "genre": [
    "Drama",
    "Thriller"
  ],
  "description": "A mother (in her Minivan) stops at nothing to recover her kidnapped son.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fwdOX3PEZlOLXr9SMpgRnSmTVFp.jpg",
  "categories": {
    "plot": 6.181818181818182,
    "acting": 6.222222222222222,
    "ending": 7.4,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 6.166666666666667
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The plot does not add much, the places are boring, some of the scenes are known from other films. The scenario is poor, the acting is moderate. There are plenty of movies about abductions, this is definitely not the best, but not the worst."
    },
    {
      "rating": "3",
      "text": "I thought the movie started out quite promisingly but as it progressed it became more and more unbelievable. There are parts that are so unconvincing they're almost laughable. Definitely one to avoid."
    },
    {
      "rating": "7",
      "text": "Kidnap gets a \"7\" because IT IS an entertaining watch. Otherwise, well, let's just say, it could've turned out to be a really good movie. The first wrong call, I think, is Halle Berry's casting. She's a great actress no doubt, and I really dig her work, but coming off of 2013's \"The Call\" (which was a by-miles a far better kidnap thriller film), I think the production crew should've gone with someone else in the lead role.My major qualms with the overall effect of the movie is the way the abductors met their loo, particularly Margo's. Terry's death wasn't intentional, I wouldn't say deserved, but it was an accident; Karla was just trying to stop him there. The third guy however, the bearded one, he dies from a shovel blow to the face?! WTF! Like, that hit shouldn't have killed him, if his character could have lived. Now Margo's death I totally, absolutely, disagree with. Looking at her and Terry, you can easily see their lives: Terry's dumb and Margo's overweight. They're just too lazy and helpless to help themselves live the right way, so they resort to an easier way to make money. They just needed help. People must've picked on them, ridiculed them, belittled them, and their hate just emboldened them. I was really hurt when I saw Margo crying when she realized Terry was dead. I wish I could've comforted her. They should have just incapacitated her or something, not drown her in such a horrible way. That was sad to watch."
    },
    {
      "rating": "5",
      "text": "The plot is really simple. Halle Berry plays a single mother who’s going through a bad divorce. She takes her son to a park and the second she leaves him to take a phone call, he gets kidnapped. From there, the movie consists of car chases and fight scenes until the inevitable conclusion. It’s a simple premise and the best part about the movie is Halle Berry. She is what holds this movie together. Her character is one who is strong, protective, and will do anything to get her son back, though it can be said that some of the things she does in order to get her son back are reckless and dangerous. She isn’t great here, but does a good enough performance. The rest of the actors did an ok job.However, apart from Berry, the rest of the movie is a mess. The story had potential, but the execution of it is rather poor and predictable. This movie takes itself seriously, but some of the stuff that happens is way over-the-top and unrealistic. Berry also occasionally overacts, so at times, you’ll enjoy watching this for the wrong reasons. It’s more like a standard action movie than a dramatic thriller. Some scenes were well-done while others were more silly. The action scenes were decent for the most part, but the car chases were done in a mediocre way. After awhile, it becomes somewhat boring. The editing is the worst part of the movie. During key action scenes, the camera cuts between multiple shots, making the movie feel quite choppy. The visual effects and camerawork were just ok.Overall, Kidnap is a decent movie. It’s more of an action film than a drama. Hally Berry does a mostly good performance and some of the action scenes were exciting. However, what hurts this movie is somewhat poor directing, terrible editing, and a story that’s just average. I give it a 50%. It’s not worth watching in theaters, but because the run time is very short (under 90 minutes) and it was entertaining (in both good and bad ways), it’s worth watching on-demand if you have nothing else to do."
    },
    {
      "rating": "8",
      "text": "In 2013 Halle Berry starred in THE CALL, which wasn't generally well reviewed (except by me). I thought it was a gripping film. This new one is much the same thing: a well-crafted, sometimes riveting thrill ride. Basically, it's an extended chase as she frantically pursues the kidnappers of her 6-year-old son. Much of it takes place careening down a highway with nail-biting driving and quick crashes. The subsequent encounters may strain credibility but they're equally fraught with tension. If you can forgive the gaps in the logic and some trite setups, you'll be sitting on the edge of your seat or even screaming at the screen!"
    },
    {
      "rating": "7",
      "text": "It was a women’s week of movies starting last Friday with a fine performance by Florence Pugh in “Lady Macbeth” followed by a full out action movie with Charlize Theron, “Atomic Blonde”, then Catherine Deneuve and Catherine Frot in “The  Midwife” and the opening today of Halle Berry in “Kidnap”. (And let’s not forget the week before with the hilarious “Girls Trip”!)In “Kidnap” Halle Berry is a waitress, having a great line near the end of her shift, who is in the middle of nasty divorce proceedings for custody of her son who is her life. Spending a day in the park after her shift her son is kidnapped and the movie takes off! There is no fooling with Berry as an action star especially when she is a mother! Get out of the way cars because she is chasing the kidnappers after spotting one of them putting her child in the car.In a movie genre like this, you have to park your logic at the door and there are some silly moments along with illogical happenings. In any case, there are a few edge of the seats minutes and enough tension near the end to keep you hanging in there just as Berry holds you interest for long times when she is alone in the car, chasing the kidnappers, and having only a picture of her child to talk to. And just as she had that great waitress to a customer line near the beginning at the end she has a better line about not fooling around with mothers.“Kidnap” is a short, 81-83 minute action film, with plenty of action with Halle Berry doing a good job along with Sage Correa as her son, Chris McGinn and Lew Temple as the kidnappers, a few minor characters but let’s not forget the crook’s green 1980 Ford Mustang and Berry’s red Chrysler minivan as they are stars along with Berry.Along with director Luis Prieto, screenwriter, director of photography Flavio Labiano and a good score by Federico Jusid, Hally Berry stars in a fast paced, filled with tension popcorn summer movie aptly titled “Kidnap”."
    },
    {
      "rating": "0",
      "text": "Dull, poorly paced (the opening shot lasts 15 min and it´s useless), illogical. And, surprisingly, Halle Bery is terrible in this. The trailer is far more interesting."
    },
    {
      "rating": "6",
      "text": "A good, old-fashioned action picture that occasionally went off the rails of believability. It’s a shame that Halle Berry can’t get a more prestigious vehicle (no pun intended) since she was always believable and a pleasure to watch. The film was inventive enough to hold my interest and was a perfect summer movie getaway. I was amazed that the Metacritic audience gave the film such an overall bad rating (the critics did a better job – the film is what it is without pretensions). Are pretentious films like Atomic Blonde and Dunkirk really so much better? Or a lame stab at “art” like A Ghost Story?"
    },
    {
      "rating": "5",
      "text": "In terms of action, \"Kidnap\" is an intense thrill ride. However, the film is bogged down by a script that needs a re-do, as well as plenty of useless scenes."
    },
    {
      "rating": "4",
      "text": "Kidnap gets kidnapped... by itself. Alright, not really... but the concept of this film within a review makes it look like it. Stereotypes everywhere I agree, yes? Stereotypes or clichés, whatever you call it, make this film look ridiculously predictable from the start and are the huge reason why Kidnap kidnaps itself to a mediocre score."
    },
    {
      "rating": "6",
      "text": "A relatively short film that goes straight to the point. A single mother suffers the kidnapping of her son while in a park. The film revolves around a single actress, the mother Halle Berry who relentlessly fights to get her kid back. Some participation from the kidnapers, Chris McGinn and Lew Temple. The scenario is simple and has been said many times before. The film is highly attracting because of the restless cat chasing. You feel tired after the first half as if you are part of the chase. An entertaining movie without sophistication. You won't feel cheated. Appreciable acting and directing without much claims."
    },
    {
      "rating": "8",
      "text": "It's now or never! A mother's fight back!Truly shocking for people blindly following the words of critics. This is really a good film. I totally enjoyed it. Well, it was not like I never saw such film. In a century of motion picture history, hundreds of similar films were made. This is just another one, but there's nothing wrong with it. People wrongly judged it. The pace of the film was rocket speed. So basically, there's no time for one to keep looking for flaws. If they do, then they're not enjoying the show. They missed out everything, hence end up bashing it. Just like the clowns, aka film critics.It was another kidnap film that Halle Barry in it, that's similar to her previous film 'The Call'. It did not take long to get into the action. A hardworking mother, going through divorce, fighting for her son's custody. While engaging in a phone call, she loses her son in an amusement park. The alert mother quickly jumps into pursuing when he was seen forcefully taken in a stranger's car. The remaining events take place on the road, with car chases, with a twist before the conclusion.Nicely written screenplay and well performed actors, particularly Halle Berry. I have never seen she had played such an energetic role in the recent time. Whatever the storyline is, it's kind of an inspiring film. How a mother fought for her son. Totally a mother instinct. You can't simply expect like the film 'Taken'. It might not be realistic, but cinematically honest. The same thing happens in the animal world too. Sad that the film released after so many delays. Moreover, how people responded to it. Believe me, it is a nice film and I definitely suggest it to all.8/10"
    },
    {
      "rating": "6",
      "text": "A solid dose of desperate Halle Berry, who in the rescue of her son is better than Bruce Willis himself in rest of his best roles. There is a lot of panic, a lot of poor montage and pitiful supporting acting. Pleasant to watch but for a while I have enough of this actress."
    },
    {
      "rating": "7",
      "text": "not sure why anyone can give '0' rating for this movie. we happened to chance upon it and Halle berry definitely makes it worth a watch. and to our surprise we were really enthralled by it. although not as good as Prisoners by hugh jackman, this show is very real. this really can happen and it's happening. this show also highlighted the hillbilly society, putting it in a very negative light. Halle berry really went all out making the whole show believable. coz any mother would be in such desperation as her. the show is very intense and true dilemma that sometimes happened to good people. Lord Father have mercy and protect us. don't believe the score. Watch it"
    },
    {
      "rating": "10",
      "text": "good GOOD GOOD GOOD GOOD GOOD GOOD"
    },
    {
      "rating": "10",
      "text": "GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD good"
    }
  ]
}