{"id": 1034, "title": "Killer Elite", "starring": ["Jason Statham", "Clive Owen"], "runtime": 116, "genre": ["Action", "Adventure", "Thriller"], "description": "Based on a shocking true story, Killer Elite pits two of the world’s most elite operatives—Danny, an ex-special ops agent and Hunter, his longtime mentor—against the cunning leader of a secret military society. Covering the globe from Australia to Paris, London and the Middle East, Danny and Hunter are plunged into a highly dangerous game of cat and mouse—where the predators become the prey.", "releaseYear": "2011", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/7O2U0WPFPSvNSUYZlhbnV081lBF.jpg", "categories": {"plot": 5.9393939393939394, "acting": 5.857142857142857, "ending": 6.666666666666667, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.5, "action": 5.722222222222222}, "reviews": [{"rating": "5", "text": "\"Killer Elite\" is a movie with the \"Punch First Think Later\" action formula that we all know. It's fun to see action veterans De Niro, Staham, and Owen jumping into the screen shooting and fighting each other, but their all kinda....outdated. You would watch it with your friends or yourself for manliness. If it is neither reason, just rent it. R) 4.7"}, {"rating": "6", "text": "I've seen better action movies than '' Killer Elite '', but it's still kinda good. I didn't wanted it to be average, I was hoping for more. Jason Statham, with Clive Owen and Robert De Niro was an exacting trio to watch. The acting from all the actors was perfect. The problems is that the characters weren't developed at all. I mean sure, it's an action movie, but it would have been better to know at least something about them. Also, there was really a lot of things going one. The movie is 105 minutes long, but you feel like it's 125 minutes long, just because of the huge amount of scenes. I don't care when some people say that Jason Statham is always playing in these types of movies. He's perfect for these type of roles. I don't remember once being bored watching one of his movies (okay, expect for '' Blitz ''). Why do you think he's constantly winning these roles ? Because he can bring something cool out of an assassin, a spy, whatever. He can pull it off. Nobody can mess with him, and oh yeah, and he's a complete bad ass. Plus, I really liked the 80 's mustaches, they were cool. Anyway, it's an average movie, but enjoyable at the same time."}, {"rating": "4", "text": "Killer Elite is just another benign thriller that doesn't let us in on its reason for existence. What really perplexes me, is why big names like DeNiro, Statham, and Owen chose to participate in this swill."}, {"rating": "1", "text": "Jason Staham, lo crei, escuche el nombre de Clive Owen y pense solo es un error en la carrera de un actor en subida pero escuche el nombre de Robert de Niro, puede que sea de sus peores peliculas y esque Deniro ha tenido talento para que sus ultimas peliculas sean malas en todos los sentidos posibles. \"Killer Elite\" una farsa barata de una pelicula de espÃ"}, {"rating": "7", "text": "\"Killer Elite\" was fun and has a good cast, with very satisfying performances. Although it's not quite what you would call \"original\" in its story line area, (not that every movie we see has to be completely \"original\") Killer Elite keeps your attention."}, {"rating": "9", "text": "I do not know how anyone, and I really enjoyed the film.Of course, it is undeniable that all of the latest films from Statham out the same.But it does not mean that they're bad!For that I appreciate the kind of films - it's brutal!)Very cool and enough for me to put the film 7 points, 2 points but I'm adding to my favorite actor - Jason :-)"}, {"rating": "0", "text": "Good lord this was a terrible movie. The dialog was pointless and full of cliche lines, fight scenes were hard to follow (in particular, the hospital fight was very choppy and filmed too close), the love interest was worthless and just slowed things down, and the plot turns on a killer getting a conscience.Oh yeah, and it's way too long."}, {"rating": "8", "text": "very goooooooooooooooooooooooooooooooooooooooooooooooooooooooood one.................................. Owen Statham DeNiro are perfects here....................."}, {"rating": "4", "text": "\" Killer Elite \" was a very acceptable film but excel in the work of the division , failed to entertain us , but I have to give another opinion , let alone in his own defense."}, {"rating": "5", "text": "It's better that I thought it would be, but a criminal waste of DeNiro.  And the fact that it's supposedly based on a true story makes it overly complicated and overly long - at least it FEELS long.  Statham is Statham - nothing new to see here.  It's great seeing Yvonne Strahovsky (\"Chuck\") on the big screen, but she's also underutilized."}, {"rating": "4", "text": "Bottom line: Despite, Statham, Deniro and Clive Owen, movie is bland, tasteless and formulaic story with decent visuals and old fashioned action sequences. I give C"}, {"rating": "5", "text": "I felt it was a film that was trying to be too clever for its own good; what with bluffs and double bluffs going on left right and centre, you really didn"}, {"rating": "8", "text": "If your looking to scratch that action movie itch this is a great choice, it's got your gunfights, fight scenes, and explosions ready to entertain. Unlike others of it's kind it surprisingly great plot behind it that's only sweetened by the fact that it's based on a true story and has a main character who doesn't want to kill, but is forced into it by means out of his control, and honestly it's really refreshing to see a movie like this where the main character avoids pulling the trigger as much as possible. It's a great movie that has a few issues holding it back from being amazing like a romance that just feels unnecessary, and the occasional lackluster moment, but the lackluster moments are few and far between, and it's not the most unnecessary romance ever (Captain America still wins award in my opinion) but it still just seems like it's kinda just in the movie for the sake of having it. All in all if your looking for a great action flick with a great plot this is one of your best choices."}, {"rating": "5", "text": "Killer Elite is a fun action movie. It has some excellent 80's period detailing and sees Jason statham and Clive Owen go toe-to-toe in some brutal action sequences. It's not high art but it is good fun. The only real dull spot here is Robert DeNiro. The legendary actor seems out of place here and just seems... old."}, {"rating": "6", "text": "A good solid action flick. Paced well with an interesting sub plot the only thing it missed was a decent script to drive the relationships between Statham, Owen and De Niro. Shame - could have been a great."}, {"rating": "6", "text": "The Killer Elite is saddled with a vague and forgettable title but at least it sounds more lethal than the book it is based on by Sir Ranulph Fiennes, â"}, {"rating": "6", "text": "A+ for fight scenes and action.A+ for period/era correct items and setting (1980).B for dark, cunning plot.B for characters.C for obscurity.The plot was pretty obscure and a bit hard to follow.  A little intimidating to imagine stuff like that happens in real life.  I don't doubt it and I can totally appreciate that this was based on a non fiction book and a true story.  The dark sides of life that it covers is somewhat scary yet very intriguing.Jason Statham is one of my favorite actors.  Any movie can be a complete flop but if you put him in it there's still saving grace and I'll definitely watch it just because he's in it.  Not only that but he's hot :).  Clive Owen, Robert De Niro, Dominic Purcell, Aden Young, Yvonne Strahovski (chick from Chuck.  Yes she really is Australian, schweet accent) - very nice cast.Aside from the underdogs saving the day type of scenario, I really enjoyed that they were true to 1980.  The glasses, the hair, the cars, the big phones, no cells, no computers, people using pen and paper.  My how times have changed.http://iplaythecomputerkeyboard.blogspot.com/"}, {"rating": "7", "text": "Now this is a Jason Statham movie. Fun mindless action all throughout, and if you didnt go see this movie to see Mr. bada$$ Statham kick some Clive Owen a$$, and a whole lot of other unfortunate guys, well then no need to give your negativity, because thats what this movie was made for, to keep action fans happy. I loved this movie, definitely not the best action movie but towards the top of my list of Statham movies, but this movie was just pure mindless fun. A decent but pretty interesting story, which is apparently based upon real events. It keeps you entertained thats for sure, Robert Deniro was awesome and very funny at times. This is the most bada$$ ive ever seen Clive Owen, he was very good, and obviously Statham was Statham. If you love Jasons movies, or you just like a pure fun, action packed movie then go see this now. If your expecting to see the schindlers list, well then youre dumb (not to be mean but its true) Explosive from start to finish, must-see for all of my fellow action buffs. 7/10"}, {"rating": "5", "text": "Killer Elite is a tough guy movie with some decent action and violence, but disappointing once everything comes to an end. The premise seems interesting and is supposedly based on a true story, but the story comes off as jumbled and pointless on the big screen. Directing his first feature film, Gary McKendry seems to not be able to handle the material and has a hard time presenting it to the audience. The movie he has created lacks any form of emotion or depth. Also, it doesnâ"}, {"rating": "8", "text": "\"Show me a beautiful woman, and I'll show you a bloke who's sick of her s**t.\"    Davies, Killer EliteThis is just one of several nuggets of meat-headed wisdom you will pick up from this cast of \"blokes\".  Sure...this is a testosterone-driven guy flick, but there is enough regret, romance and moralizing to make it potentially palatable for the more adventurous members of the softer sex.  The movie does assume you know the background of the story.To enjoy this film in the proper context, you will need to know a little something about the Special Air Service (\"SAS\"), an elite British Army corp. Think of it as the equivalent of the American Navy Seals. According to my \"sources\" *, the SAS was originally commissioned in 1941, and since that time has been disbanded and then resurrected on numerous occasions, most recently for purposes of counter-terrorism. According to Michael Smith, author of the book Killer Elite, members of the SAS told him in confidence that the SAS did operate in Oman to protect British oil interests.  It is interesting to note that because this Oman mission was secret, it would be difficult to document the veracity of these accounts, leaving the author with great latitude to embellish the details. The film Killer Elite is based on Smith's book, and it makes for a tense and riveting action movie, true or not.With that background, the story opens on professional assassins Danny (Jason Statham) and his long-time mentor and partner Hunter (Robert De Niro) as they are making a hit in Mexico. After Danny blows the guy away in his limo, he sees there is also a child in the car.  As Danny looks at the boy's stunned, blood-spattered face, he loses focus, almost botching the getaway. Immediately following, Danny vows to get out of the business and lead a quiet, respectable life with his lady love near his childhood home in Australia.  Easier said than done.  Danny is everyone's cash cow, and partner Hunter has a family to support.  However, because it is Danny who is in demand, Hunter is suckered into becoming a decoy in Oman.  In order to save him, Danny is coerced into taking an assassination job in England worth 6 million dollars.And what a job.  Danny must find the SAS operatives who killed the three sons of Sheik Amr, first obtaining a videoed confession AND making it look like an accident.  Danny is more than capable, and with the assistance of Davies (Dominic Purcell), he makes it look easy.  However, Danny does not count on the Feathermen, a secret society of former SAS who continue to carry out government objectives with a \"light touch\", except for renegade Featherman Spike played by Clive Owen, who cannot detach from the intensity of his former life in the SAS. When the \"accidental deaths\" of two comrades who served in Oman come to his attention, Spike's loyalty sets him on the path to prevent the death of the third. In the end, Danny is pitted against Spike for the final face-off.  On top of this, the agent played by Adewale Akinnuoye-Agbaje is willing to compromise Danny for his cut of the $6 MM.The beauty of this film is not just the intrigue or the fight sequences, but how it ultimately elevates both a mercenary assassin and a renegade soldier to anti-hero status, ennobling their killing with higher purpose and redemption.  It's worth watching just to appreciate this  phenomenon alone.  Jason Statham (Crank, Revolver) is in fine form, his menacing face and hardened body serving once again as an unstoppable fighting machine.  Clive Owen (Duplicity, Children of Men), complete with damaged eye, looks and plays the part of Spike with grizzled passion. Robert De Niro (Limitless, Little Fockers) brings bumbling humor and good will to the role of Hunter, while Yvonne Strahovsky brings the sexy, girl-next-door sweetness to the woman waiting at home for Danny.  If you are unfamiliar with the background, Killer Elite will leave you behind for the first 15-20 minutes, but it is no less riveting as you begin to piece the story together.  I highly recommend this film for lovers of high octane action thrillers. * WikipediaThis review also appeared at www.filmdilettante.com"}, {"rating": "9", "text": "awesome movie, could be better and not original. (although they say its based on a true story).anyway, the acting was brilliant, its just the actors were very good and the sceme of a plot was overused, still makes it a great movie"}, {"rating": "3", "text": "Absurd, completely bollocks and boring. Those were the three things in my head when the credits rolled (BTW the best part of the movie, IMHO).The story, character decisions are completely senseless. Jason Statham \"acts\" and looks the same as in almost every previous movie he appeared in; De Niro has something of 45 seconds of screen time; as opposed to the previous two, Oven manages to defend his role; the characters are generally shallow; handguns tend to fire something around 30 rounds per clip... The list is long. There are that many pros for this movie to make it entertaining. That's too bad, because the round-up of actors was something of a good promise for this one. What we recieved is yet another moneymaker...for the actors."}, {"rating": "6", "text": "You would be foolish to go into a Jason Statham movie and expect more than..... well a Jason Statham movie but I think as far as his movies go this one was on the higher end of the scale. I found the plot interesting but it did feel long, with a running time of just under 2 hours, by the end it felt more like 3."}, {"rating": "8", "text": "Every Jason Statham movie is better than the last, as he continues to cement his reputation as the action star of Generation X. Since it's domination of the late 80s, Action movies have really suffered due to a lack of decent story lines and an infestation of stars, who landed these roles, simply due to their size, but Statham is changing all that, as evident by his latest film, Killer Elite. Based on the novel, The Feather Men by Ranulph Fiennes, Killer Elite covers the events, following a British covert op in the early 80s. The British Navy Seals (The S.A.S.) secretly forced out oil rich land owners in the Middle East, by whatever means necessary, in order to steal their land. Five years later, on his death bed, one sheik is seeking revenge for the death of 3 of his sons. To do this, the sheik has hired an elite team of underground hit men to take out the men suspected of killing his children, not an easy task when you consider that all the targets are highly trained former military operatives. Jason Statham stars as Danny Bryce, the team leader who is forced out of retirement, to take on the hardest job of his career. As has become common place, Statham is terrific and really carries the story on his back. Killer Elite is a someone complicated plot, with a first time director, but thanks to Statham's experience, you'll think these guys have been working together for year. As his reputation has continued to grow, bigger and bigger stars want to work with Statham, and any time you can add names like Robert De Niro and Clive Owen to a film, it only enhances it and boosts it's potential audience. Aside from just the amazing action sequences and covert maneuvers, the story adds real life drama to the film, by including shady government cover ups, double agents, and even police involvement in the events, making for the rarest of rare in the Action genre, a film with a deep and compelling plot. That's what really makes this film so good, it's not just about the chases, explosions, and killing, there is a real story here, that is unpredictable and very well written. Killer Elite may not top Parker as Statham's best movie, but it's pretty close. If you enjoy a fast-paced, edge of your seat movie, with a lot of interesting characters and a deep plot, than you won't want to miss this film."}, {"rating": "5", "text": "\"An all-star cast brings to life the true story of Billy Beane, a former jock turned general manager who uses unconventional methods to bring the best players to the Oakland A's, a major league baseball team struggling against financial hardship.\""}, {"rating": "7", "text": "Jason Statham delivers another outstanding performance as the top action star. Some of the stunts are fantastic. The story is deep enough to keep you hooked, but I was disapointed that Robert De Nero's involvement surroumnts to a cameo and his involvement in the film was very limited. A decent action film from top to bottom/"}, {"rating": "7", "text": "Jason Statham once again plays a noble assassin, a killer with a conscience. He (Danny) refuses to kill his nemesis Spike, played by Clive Owen, for no good reason, even though Spike make it's clear he'll pursue Danny. Heck, he even gives Spike millions of dollars to help him start over, weird. Danny has a demure, girl-next-door girlfriend which detracts more from the story than adds an element of vulnerability to it. DeNiro just phones in his performance, he's old, fat, and lazy but his name is still a draw apparently. Overall, it's a decent enough experience. I got this free via Dish's Blockbuster @Home program so the price was right. Don't spend more than 99Â¢ to rent though."}, {"rating": "6", "text": "Was looking forward to this film considering the cast, I mean how many Deniro films are not good. Well, I consider this one among his worst choices. The story is mundane but props itself up with good action. Although Stratham's role is the same one he plays in everyone of his films, viewing this once is quite enough."}, {"rating": "0", "text": "Killer Elite is a bad movie. It is a pulpy, cheesy, bloody action thriller, that bores rather than thrill. The story, set in the vivid streets of Oman and England, the movie switches places quickly. The spy suspense, is just people saying smart stuff, to make them look smart. The truth is, this film is not smart. It is a dumbed down version of Bourne meets The A Team. The story is even worse, a guy who hires Jason Statham to kill guys who killed his three sons, so Jason can get his friend- Robert De Niro. I didn't even get their names, because all the characters muttered swears and British slangs throuought. There is little action to cheer about, there is guns and blood, and sometimes it doesn't even make sense. Clive Owen looks worse than ever in his role about a guy who wants to chase down the guy who works with Jason Statham. It is confusing, it's a movie you should not watch or care about, it is on Netflix and DVD. But some stores have hidden it, so nobody even looks at this turd."}, {"rating": "3", "text": "I decided to watch this film because of Clive Owen and De Niro. I blocked Staham from the equation. Unfortunately I couldn't block his horrible performance. He plays the same role in every film. I've come to the realization that if its not an Expendables film he's no good. I've never been more bored in the theaters than i was while watching this film. It's horrible."}, {"rating": "4", "text": "Great acting,great action but very poor story. 4/10 is the real rating for \"Killer Elite\". The movie is unfinished and i hope they're going to make a second one, because... okay i won't use a spoiler. Just watch it"}, {"rating": "3", "text": "A typical statham actioner which outstays its welcome by a considerable margin. The plot becomes messier and more confused the longer the film runs and it is actually quite sad to see the type of film Robert DeNiro is now relegated to playing in. Clive Owen seems to be taking the whole thing seriously and it is left to Statham himself to provide any semblance of entertainment from the tiresome proceedings."}, {"rating": "1", "text": "In German:\r Mit Abstand der größte Müll der Statham jemals hervorgebracht hat.\rDer Beginn ist ein großes Feuerwerk aber dann verkommt der Film zu einem sinnlosen Actionspektakel. Handlungsstränge werden sinnlos aneinander gereiht und ergeben somit null Sinn. DeNiro muss dich nicht mal anstrengen und dementsprechend lustlos spult er seine Parts ab.\r Den Film kann man nach 20 Minuten getrost abschalten. Reine Zeitverschwendung."}, {"rating": "6", "text": "Good action scenes and good actors are not enough to make a good movie and the movie is only about this.The script is just a mess and the dialogues are just ****"}, {"rating": "4", "text": "According to the book and the marketing of this film it's all based on a true story, I honestly don’t really care because that was not a selling point for me, what attracted me to the film is the cast. I know Jason Statham doesn’t have the best track record when it comes to the quality of the movies he stars in but when add Dominic Purcell, Clive Owen, and the great Robert De Niro, to me it’s worth the shot.\r Killer Elite, did not live up to the expectation such a cast would inspire. They establish a quick connection between the men in the beginning then dive right into the story. It's kinda set up like a heist movie, for which you desperately want them to succeed, even though they're not stealing anything but are killing people. The film does have action sequences and a nice opening scene but then it falls flat and gets boring for a while.\r The story is weak and repetitive and the cast does nothing to elevate it. Statham barely shines in the action scenes, Owen is so bland in his portrayal of a trained killer, Dominic Purcell sporting an English accent is weird but if only he looked confident doing it he wouldn’t have made a joke of himself, and De Niro is hardly in the movie. The only redeeming quality Killer Elite has is the historical & geopolitical aspect behind the story.\r Killer Elite was a disappointment for me, it was barely entertaining and ran too long (120min). @wornoutspines"}, {"rating": "9", "text": "With a smart script... With great actors Statham,De Niro and Owen are impeccable,in this action,crime thriller of 80's... Good scenes of actions great fights between STatham and OWen."}, {"rating": "9", "text": "....................................................................................................................................................................................A close to perfect"}], "recommendations": ["jack_ryan_shadow_recruit", "jack_reacher_never_go_back", "the_mechanic", "the_equalizer", "shooter", "angel_has_fallen", "homefront", "jack_reacher", "safe_house", "the_commuter", "parker", "snitch", "run_all_night", "the_november_man", "the_frozen_ground", "21_bridges", "gangster_squad", "those_who_wish_me_dead", "3_days_to_kill", "2_guns", "mechanic_resurrection", "the_taking_of_pelham_1_2_3", "taken", "from_paris_with_love", "the_gunman"]}