{"id": 1608, "title": "Killers", "starring": ["Ashton Kutcher", "Katherine Heigl"], "runtime": 100, "genre": ["Action", "Comedy", "Thriller", "Romance"], "description": "When an elite assassin marries a beautiful computer whiz after a whirlwind romance, he gives up the gun and settles down with his new bride. That is, until he learns that someone from his past has put a contract out on his life.", "releaseYear": "2010", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/o3nIJ5n4Qx74msRkP0FVaK6dx5z.jpg", "categories": {"plot": 3.0833333333333335, "acting": 2.3076923076923075, "ending": 3.0, "soundtrack": 6.0, "cinematography": 5.0, "familyFriendly": 3.25, "funny": 3.8, "action": 4.0}, "reviews": [{"rating": "3", "text": "Absurd it is...the new summer action-romance movie \"Killers\" is just plain terrible. The script is crap as well as the action sequences (Its like parodying those Bourne or Bond films). Aston Kutcher also performed terribly (His worst one yet). Most of all, the movie just doesn't know where to point its gun at; action or comedy? Don't watch it, noobs."}, {"rating": "2", "text": "Kutcher and Heigl have the on screen chemistry comparable to a Hannah Montana episode. Heigl plays a familar role for her in the unassuming curious unintelligent brunette. The \"suave\" Kutcher totally fails at attempting ot play a vicious killer. After the meandering plot scatters around looking for some substance or direction you are left wondering  if this is a movie at all. Weak bland character development hits home like a game winning touchdown."}, {"rating": "0", "text": "The worst acting performance (in a movie) I've seen in my entire life. Kutcher is incredibly terrible in this one. His performance was the worst by an actor. The title does not fit to the whole (terribly bad) plot of the movie. One of the worst movies I've ever watched................."}, {"rating": "0", "text": "Mindnumbingly boring and unfunny, \"Killers\" doesn't know what it wants to be, so it just throws a bunch of things that wouldn't necessarily work together onto the screen hoping movie audiences are too dumb to care."}, {"rating": "3", "text": "The film's title is right \"Killers\" kills fun and the jokes are dead, it's cheesy and predictable, the action is mediocre and the pacing is defective, the dialogue is lousy, also the score is cheap. The screenplay by Ted Griffin, Bob DeRosa is gigantic predicament but somehow they make the film fun and suspenseful, definitely what the summer doesn't need. Comedy director Robert Luketic's bland style of directing the action sequences is bad, it's like the film was directed by McG. Three years since the vacation to the French Riviera, Jen  (Katherine Heigl) enjoys the good life in the suburbia with her handsome husband Spencer  (played by Ashton Kutcher who gets a producing credit). That comes crashing down, however, when gunfire rings out after his 30th birthday, he has to tell Jen the truth that he's a spy. Heigl yet again plays the same shrew women character who always nags like she always does in her rom-coms, but the chemistry is there between her and Kutcher. Ashton Kutcher does a good job as this spy character but doesn't make it believe able though. Tom Selleck and Catherine O'Hara are fine in this film but they can't save this terribly made lousy material. Grade D+"}, {"rating": "3", "text": "Ashton Kutcher plays a killer, but not the \"Psycho Killer\" that's promised in the trailer. Unwilling to put his screen image at risk, Kutcher doesn't kill with a gun, or knife, or even with his bare hands. The ex-\"That 70s Show\" star leaves the nail guns and chainsaws for Christian Bale to handle. Spencer is a nice psycho. The nicest psycho in Nice. The contract killer merely pushes a button, causing the helicopter he rigged with explosives to blow up. No arterial spray, not even a drop of the red stuff is spilled. Blood would remind the moviegoer that the American girl on vacation(played by Katherine Heigl) just had lunch with a sociopath. Modeled loosely after 007, the former star of \"Grey's Anatomy\"(and future Shelley Long), ends up looking like a Bond girl of a lesser god. Presuming that she's not a superlative lip reader, daddy's girl(daddy is played by Tom Selleck) should have heard the midair detonation of the chopper. Perhaps it's bad editing, the moviegoer thinks, since there's no reaction shot(on her, or anybody's part) to the earsplitting blast. \"Killers\" just proceeds on to the next scene. The editor, not the screenwriter, helps keep the secret of Spencer's nefarious trade from the unsuspecting tourist. For sure, bad editing confuses the moviegoer, back on American soil at the now-married couple's suburban home, where a near-death experience in their garage becomes a mystery, because it's unclear as to who's doing the shooting: the man in the kitchen(a knife-wielding man), or the woman at the front door(a woman, as it turns out, was the only neighbor not trying to kill the Aimes unit). So where does the itchy trigger finger come from? Personally speaking, the bullet-riddled attempt on Spencer's life is practically extra-diegetic, a transmogrifying assailment from the moviegoer who wants a simple shot/reverse shot for the sake of clarity. If my aim was true, the chemistry-free pair(Kutcher and Heigl are no Chris Franz and Tina Weymouth) would be stopped, dead in their tracks, from riffing on Quentin Tarantino's \"Kill Bill: Vol. 2\", in which a delicate domestic matter starts to encroach on the protagonist's wild, wild life. \"Killers\" has an edge all right, a dull one. \"Killers\" is no \"Grosse Point Blank\". John Cusack played a character that had the conviction of a cold-blooded killer. It's a trait that Spencer needs to make his transformation into a pillar of the community mean something."}, {"rating": "7", "text": "A comedy full of breathtaking action."}, {"rating": "0", "text": "Can we finally be done with Ashton Kutcher and his utter lack of talent for acting? I hear the Razzies calling Ashton - best run back to your Mommy - I mean wife!"}, {"rating": "9", "text": "Fun summer movie. I would like to have seen more of Tom Selleck."}, {"rating": "7", "text": "A great job branching out for Ashton Kutcher in this film playing a 'intelligent' spy rather than his 'hair in eyes dumb as a dog' role."}, {"rating": "4", "text": "There was good acting on the whole by lead actors. But the screenplay lacked depth and suprises. Its with an avoidable feeling one comes after watching it."}, {"rating": "1", "text": "Terrible movie and lousy acting. Kutcher is just a joke. Totally not believable. Two very annoying people in the leads. Don't waste a cent on this stinker."}, {"rating": "2", "text": "Ashton kutcher fails as an action star, the movie itself is really corny and moronic, the movie had its few funny moments and thats because of Rob riggle, nothing else is funny here."}, {"rating": "5", "text": "If you don't expect Citizen Kane going in, the movie can be somewhat enjoyable."}, {"rating": "10", "text": "All the critics are hating on this movie and I don't understand why yes it is not a FILM with EMOTION and ACTING (sarcasm) it is an enjoyable movie that is well acted and perfectly enjoyable to those people who can let go and just be entertained."}, {"rating": "8", "text": "What movie were the critics expecting?"}, {"rating": "1", "text": "Bad Movie, Bad, bad Movie. I didn't believe one second of this movie. That being said Cathrine O'Hara does her best to save her scenes and is very funny here. Kutcher, on the other hand should probably consider another profession."}, {"rating": "2", "text": "I went out on a date with this girl last night and I asked her what she wanted to see. I was hoping she would have chosen anything but this one. Hell, I would have rather sat through Sex and the City 2. But she chose this one. It was one of the most horrible films I have seen in years. And I've seen some pretty bad movies. I gave it a two simply because the girl from Grey's Anatomy is hot."}, {"rating": "0", "text": "Ashton Kutcher sucks and he was the best thing about this film. Heigl should have never given up her day job; she can't act her way out of a paper bag."}, {"rating": "6", "text": "I just watched it. It's really not that bad. It's a step up for Ashton \"Douche Face\" Kutcher's usual roles. It seems his acting has improved slightly over the years since Dude Where's My Car.If you must watch it, watch it for what it is... a **** movie. There is no greater message, there is no expert writing or masterful soundtrack.  No scene that invokes any kind of emotion. It's just a lame romantic comedy just like the 400 million other ones also in existence.So, if you just want to watch a movie that you can forget later because it doesn't really matter anyways. This one is for you."}, {"rating": "6", "text": "I honestly didn't know what to think of this when I was watching it. Parts of it I like and other parts made no sense and annoyed the hell out of me (like why no one could F'n kill the main characters??). The other thing I noticed is that it's very poorly scored, there's hardly any music throughout the film, and what little music there is sucks."}, {"rating": "5", "text": "I love Katherine Heigl and Ashton Kutcher but this movie was just boring. The plot was not great but the cast was good. To be honest I just enjoyed watching Ashton Kutcher because he is just dreamy."}, {"rating": "6", "text": "Almost didn't watch this movie due to the horrible metascores  but they are really unrepresentative. This tightly paced film was reminiscent of mr and mrs smith. It's got same levels of high octane action and amusing scenes. Aston is surprisingly good and Katherine is as lovely as ever. The South of France scenes are beautifully shot, although the roads are never that quiet. This was a fun action comedy  nothing amazing, but decent enough, and certainly better than the above metascores imply."}, {"rating": "0", "text": "Because I accidentally gave it a 10...a 0 should average it out. And just to affirm, a rubbish film with terrible acting and no excessively fun moments."}, {"rating": "2", "text": "Not very good, one of the worst films of 2010. What could have been a fun and charming action/comedy flick, Killers is nothing more than an awkward, careless, silly, and unbelievable film that fails miserably. Kutcher and Heigl are totally awkward, lacking chemistry, Tom Selleck and Catherine O'Hara are terribly annoying as the parents, and the entire supporting cast is strange. Skip!"}, {"rating": "3", "text": "So-so funny but stupid have a fun time bad ending felt like some how there might b an incest joke or to but i was just losing it from how campy and tired this movie made me."}, {"rating": "8", "text": "Great movie, I have no clue why the critics rate it so low. I think it was a great acting, at first, I admit it was a little so, but took a big turn in events. I think the plot was great, as the acting. Perfect roles for Kutcher, at first I didn't think it was the right role for Heigl but she played in well. This movie should have a sequel."}, {"rating": "3", "text": "I was disappointed. I love the Katherine Heigl movies, but in the end I was like: \"Okay, so it was just that?\". I did not like the concept of this movie. Ashton Kutcher and Katherine Heigl had a good chemistry, but the plot is weak even the movie is cool."}, {"rating": "6", "text": "I went in without any knowledge of the story or the horrible reviews, and I mostly liked it.  It starts to get absurd about two thirds in, ultimately pushing from comedic to tedious, but there were enough enjoyable moments along the way that I think it deserved a better rating than the critics gave it.  I think Krutcher does a creditable job, and that they give a believable performance as a couple.  This doesn't compare to Mr.  Mrs. Smith, but for undemanding folks who really enjoyed that movie, I think this movie is worth a weeknight's rental."}, {"rating": "1", "text": "What an awful film. How could anyone have read this script and thought it would be good? I really dislike Heigl's acting (she tried her best to ruin Knocked Up) and with a poor script she stood no chance. Ashton Kutcher was below his normal standards too meaning this film was doomed. Also, the whole spy story film has been worn out and only the best can really succeed in this genre."}, {"rating": "1", "text": "You're kidding right? Who the hell even thought up this mess?"}, {"rating": "2", "text": "Not sure what happened to Katherine Heigle, shes a charming actress and can do well in movies. Killers is a pretty bad film, Heigle and Kutcher lack chemistry and the jokes are few and far between."}, {"rating": "8", "text": "This was a surprising good movie. They tried to be like a little bit of Mr. & Mrs. Smith though. Still a pretty decent movie and funny."}, {"rating": "1", "text": "Killed 2 hours of mine, and many of my brain cells.Painful to watch.  It isn’t a real thriller, the plot line is foolish, and it isn’t funny.Wish I hadn’t wasted the time.If you love Ashton Kutcher and love slapstick stupid, you may like it."}], "recommendations": ["abduction", "the_bounty_hunter", "the_boy_next_door", "this_means_war", "basic_instinct_2", "suicide_squad", "parker", "the_dilemma", "jolt", "contraband", "sabotage", "the_tax_collector", "baywatch", "alex_cross", "ghost_rider", "catwoman", "bad_teacher", "baby_driver", "thunder_force", "ride_along", "the_green_hornet", "jumper", "no_strings_attached", "second_act", "peppermint"]}