{
  "id": 4825,
  "title": "Kill Switch",
  "starring": [
    "Steven Seagal",
    "Holly Dignard"
  ],
  "runtime": 96,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "A troubled detective travels to Memphis in order to track down a pair of serial killers.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rlM1reI1eqbB4T5goQKijXurAJu.jpg",
  "categories": {
    "plot": 2.0,
    "acting": 2.25,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 2.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 2.5
  },
  "reviews": [
    {
      "rating": "3",
      "text": "The saddest fall of a great actor. An attempt to create a first person cinema in a pure science fiction atmosphere about the alien invasion. Irrational action scenes with tragic CGI and terrible acting in every aspect. It is a pity that such a thing happened."
    },
    {
      "rating": "3",
      "text": "Ambitious. It's really ambitious. But what about responding with actual quality to that ambition?"
    },
    {
      "rating": "2",
      "text": "Writing is top-notch hot garbage and the delivery of it reflects that perfectly.The budget of the movie must be small, as the actors are... reflective of it, and evidently the writer wasn´t given food for more than a couple days while they locked ´im up in the basement, resulting in a script that is kinda like one from a first time novelist with no actual human contact in their life, or sense how anything works. Internal inconsistencies and nonsensicalities galore.You know that gag from Simpsons where anything toppling over bursts into flames? Made me think of that twice.Ok, so I took a glance at stuff and it turns out there´s no writer. There instead were two screenplay cartoonists and I suppose that explains some stuff.And yeah, the camerawork tries to imitate what \"Doom\" did in one scene. Here ´first-person´ is the dominant angle akin to \"Hardcore Henry\" which, unlike this one, managed to be entertaining. The first person gimmic doesn´t work as a drama platform very well as (in this movie) it looks as if the actors are (they are) staring at the cameraholders chest hair instead of their face, which affects performance. The movie is sci-fi only for the premise. It wanted to be an action film, but has barely any. And what little it does show is.. Improvised, looks like. Much like the dialogue.Some special effects and sound design are ok. +2 points."
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)This Tim Smit debut suffers from a physical law of balance/equilibrium similar to that of its story: the sci-fi film and the first person shooter game plunder each other."
    }
  ]
}