{
  "id": 4024,
  "title": "Killing Cabos",
  "starring": [
    "Tony Dalton",
    "Ana Claudia Talancón"
  ],
  "runtime": 94,
  "genre": [
    "Comedy",
    "Action",
    "Crime"
  ],
  "description": "Two young men get involved with some criminals while trying to free the tycoon they kidnapped.",
  "releaseYear": "2004",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/d6fY8CZH2UyFlFi8r8odbJR0YEt.jpg",
  "categories": {
    "plot": 9.5,
    "acting": 9.5,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 7.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Hilarious! But if you"
    },
    {
      "rating": "9",
      "text": "A Great Mexican produced movie, based in Mexico and deeply entrenched with Mexican views and ideas and with what we grew up seeing sadly given low marks by Mr. Malcolm, Mr. Rechtshaffen and Mr. Koehler. Those last names sure do sound Latin to me and I'm sure they have a full understanding of movies that don't star Tom Cruise. In a nutshell, go watch the movie and enjoy the visuals, the acting and the story line for what they are Great!"
    },
    {
      "rating": "10",
      "text": "so good, so funny, yes it does seem like a Tarantino movie, but that doesn't hurt it at all. I thought it was one of the most entertaining movies of 2005."
    },
    {
      "rating": "10",
      "text": "I come from Mexico, and every character shows different sides of Mexico just ass it is. I feel it had a little of everything and thats what made it so reat."
    },
    {
      "rating": "9",
      "text": "Hilarious all the way through! if these critics are going by the subtitles, then i must say i don't blame them; i was reading them as i watched and they lose all of the style and wit of the actual jokes! this movie is one of my favorites because it is so intricately weaved, and it takes on a topic that is heavily discussed in Mexico, especially in Mexico Cit."
    },
    {
      "rating": "6",
      "text": "If you like early Tarantino you are going to love it. I found it a little too long but overall I loved the black comedy in it."
    },
    {
      "rating": "3",
      "text": "What would happen if Quentin Tarantino vomited Pulp Fiction, nothing more than indifference to the film, the end must be explained in a YouTube video"
    }
  ]
}