{
  "id": 1859,
  "title": "Killing Season",
  "starring": [
    "Robert De Niro",
    "John Travolta"
  ],
  "runtime": 91,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "Two veterans of the Bosnian War, one American, one Serbian, clash in the remote Smoky Mountain wilderness.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/o55HXx21PqRcOgAaOWFz4tGMrZh.jpg",
  "categories": {
    "plot": 4.375,
    "acting": 3.4285714285714284,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 1.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "A battle of awful accents coupled with slapdash cat and mouse intrigue, \"Killing Season\" is a thriller whose approach grows increasingly mundane, and renders itself completely forgettable. \"Killing Season\" is directed by Mark Steven Johnson \"Ghost Rider\" (2007), and the movie stars two cinematic legends, Robert De Niro and John Travolta, who star together on-screen for the first time ever. What could be an ultimate showdown of two acting titans with a storyline that closely follows \"The Most Dangerous Game,\" unfolds into abysmal exercise of nonsense, and thoroughly disappoints given its potential.\r Benjamin Ford (Robert De Niro) is a former American soldier and a Bosnian war veteran who now lives in a secluded cabin hidden deep in the Rocky Mountains. Emil Kovac (John Travolta) is a former Serbian soldier from the same war, who cannot let go of a particular run in he had with Ford. Finally acting on his obsession years later, Kovac uncovers Ford's location, and decides it's time to settle the score. After finding Ford and concealing his identity and motives from him, Kovac eventually reveals his intentions while out hunting with Ford, setting the stage for a struggle for survival. Kovac hunts his most elusive prey ever, but can Ford turn the tables on his Serbian hunter and make it out alive?\r Quickly and to the point, the primary problem is the material, written by Evan Daugherty \"Snow White and the Huntsman\" (2012). The movie promises an exercise in these two soldiers stalking and hunting each other, but ultimately it is nothing more than a series of graphic torture scenes with long-winded monologues, a series of power reversals, in which one gains the upper hand, just long enough for the other to escape. These reversals eventually happens with such frequency that it becomes entirely comical and ridiculous.\r I was more than a little confused as to why a movie pitting Robert De Niro against John Travolta was getting such a limited release, but after watching \"Killing Season,\" I completely understand."
    },
    {
      "rating": "0",
      "text": "the plot summary goes like this\rafter some drinks and bonding two drunken males decide to bow hunt each other (wtf?!) in order to make each other \"confess\"  What kind of drugs do you have to be on to come up with this stuff?"
    },
    {
      "rating": "4",
      "text": "The Killing Season was one of those movies that you're not quite sure how it gets made. Who comes up with the idea of having John Travolta play a Serbian and have a battle with Robert De Niro? Honestly, it actually wasn't that bad of an idea but it was just such a slow movie that it made it difficult to watch at times. If this film was any longer I might've fallen asleep. Some of the plot points were a little weak also and Johnny T's accent, while not bad, isn't good enough to make you forget it's John Travolta. Overall, not a terrible movie but pretty mediocre in general."
    },
    {
      "rating": "5",
      "text": "I'm not sure how to put this in words but it felt like there were too many times when one of the characters managed to escape certain death only because of stupidity on the other guys part.  I was really hoping for a good game of cat mouse where they actually outsmart eachother, instead the cat just keeps releasing the mouse and tables are turned every time.  Definitely not going to get any Oscar nominations, but worth a watch if you are bored.  Just pirate it, even though I was disappointed I didn't feel like I was cheated out of 90 minutes."
    },
    {
      "rating": "2",
      "text": "I liked the story and felt it could have been great...except if it wasn't for how awful John Travolta was.  The bad Serbian accent and his phoned-in performance single-handedly makes the film an accidental comedy."
    },
    {
      "rating": "3",
      "text": "\"Killing Season\" 10 Scale Rating: 3.0 (Awful) ...\r The Good: On a basic level, the story isn't bad.\r The Bad: The execution, however, was terrible. Straight-forward and dull, the film feels way longer than it's 1:30 run time. The nail in the coffin was John Travolta's horrid accent."
    },
    {
      "rating": "2",
      "text": "John Travolta plays the role of Vengeful Ex-Soldier who was shot during the Bosnian War in a war crime by some bad Americans shooting bad Serbian war criminals.  Specifically it’s suggested he may have been shot by Robert De Niro who plays Colonel Benjamin Something.  Now 18 years later, Vengeful Ex-Soldier has bought some American military personnel files off a bloke in a pub.  One of the files is on Colonel Benjamin Something.  “I have been waiting 18 years to do a revenge film with De Niro” says Vengeful Ex-Soldier to the bloke in the pub, who seems to be losing interest.\r Imagine if you will, John Travolta attempting a Serbian accent.  Imagine what that would be like for 90 minutes.  Yep, it’s as bad as you just imagined.  Travolta’s awful accent competes for ridiculousness with his ‘hair’ which at times appears to be a specially designed swimming cap and at others a bald head that has been very neatly coloured in with very black permanent marker.\r This is so rubbish in so many ways, it seems so little effort has gone into the enterprise, that it has an active contempt for the viewer.  It openly defies you to bother summoning the will to dislike it.  Or sit all the way through it.  I managed it in three chunks.  Both actors seem to be putting in the bare minimum effort; the extended dialogue scene between the two in Colonel Something’s cabin looks like a half-arsed script read through/failed improvisation that got left in by mistake....The action is limp, the script is nothing, the performances are shambolic.\r I expect this kind of nonsense from Travolta, but the disappointing thing is I have come to expect it from De Niro.  It’s sad and perplexing to watch him drive nails into the coffin of a once brilliant career that already has more nails in it than it could ever possibly need.  Nothing is getting out of that coffin Bobby, why are you doing this?\r Full review at ponderflix on wordpress."
    },
    {
      "rating": "9",
      "text": "I came away with a different view of what was being said. Being a combat veteran (vietnam) I saw how the character isolated from family & friends espespecially at the end. Sadly I seen a lot of myself. The average person would have a hard time understanding that."
    },
    {
      "rating": "10",
      "text": "Killing Season is a movie that thrills and leaves you thinking. It is timely because the tension echoes many of the current situations going on in society. In their own right each of the two in the movie have their reasons (and justifications) for their points and places. In the end (sorry, no spoiler here) the stark realization of the view from the other side really brings home the powerful moral of this movie. De Niro is his usual amazing self and Travolta delivers a nearly convincing eastern bloc persona. Well worth seeing."
    }
  ]
}