{
  "id": 121,
  "title": "Kill Bill: Vol. 1",
  "starring": [
    "Uma Thurman",
    "Lucy Liu"
  ],
  "runtime": 111,
  "genre": [
    "Action",
    "Crime"
  ],
  "description": "An assassin is shot by her ruthless employer, Bill, and other members of their assassination circle – but she lives to plot her vengeance.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/v7TaX8kXMXs5yFFGR41guUDNcnB.jpg",
  "categories": {
    "plot": 9.434782608695652,
    "acting": 9.333333333333334,
    "ending": 9.5,
    "soundtrack": 9.25,
    "cinematography": 9.25,
    "familyFriendly": 9.0,
    "funny": 9.0,
    "action": 9.125
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I like volume 2 more then volume 1 but it is my favourite film!"
    },
    {
      "rating": "10",
      "text": "This movie rocks!! Tarantino brilliantly directs this tale of revenge, honor, blood, action, drama, and kung fu!! Its not for everyone, but I highly recommend it to fans of Tarantino and kung fu!!"
    },
    {
      "rating": "10",
      "text": "One of those films that you either love or hate. I personally love it and all its stylistic changes, switching back and forth from a spaghetti western to a samurai revenge film in the matter of minutes. The violence is terrific and most of the time completely hilarious, and the storytelling is brilliant throughout."
    },
    {
      "rating": "10",
      "text": "Two thumbs up for this movie ! Professor Tarantino is a genius ! I first noticed Tarantino's name in Nirvana's album \"In Utero\"..I love Kurt Cobain also...they are both awesome in art !"
    },
    {
      "rating": "8",
      "text": "With Kill Bill, Quentin Tarantino continues to do what he does best - elevating supposedly \"trashy\" film genres to credible cinematic fare. Kill Bill: Vol. 1 is packed full of energy and style, with Tarantino's trademark extreme violence and eloquent, machine-gun dialogue. It also has a plethora of film references for cinephiles, mostly from Spaghetti Westerns, Hong Kong martial arts and Samurai films. Tarantino is not afraid to affectionately poke a little fun at the films he is paying homage to, but he never takes it to the extent of parody. Before this film, I'd have never in a million years pictured Uma Thurman as an action heroine, but thankfully Tarantino saw her potential in this role - she is great as the vengeful Bride. It is Lucy Liu and particularly Daryl Hannah who really steal the show performance-wise however, with Liu playing O-Ren Ishii, an honourable assassin-turned-mob leader, and Hannah playing Elle Driver, a considerably less honourable, and far more malicious former assassin. The action is superb, the fight scenes creative, well-choreographed and bloody, notably The Bride's brutal fight with Ishii's schoolgirl bodyguard Gogo (a particularly menacing Chiaki Kuriyama) and the following rather serene and beautiful duel with Ishii herself. Unfortunately, the sequence that links these two truly exceptional one-on-ones, involving The Bride hacking her way through wave after wave of henchmen, is more than a little overblown and excessive - the first dismembered limb and fountain of blood is shocking, but a long succession of the same gets a bit dull. My favourite scene of the whole film was an unexpected Japanese Anime segment that explores O-Ren Ishii's origins, and is an emotionally charged refreshing change of pace from the rest of the film. The first volume of Kill Bill is not only a fine example of a revenge movie that effectively adopts the stylistic conventions of numerous other genres, but it's a brilliant example of exciting film storytelling on its own terms to boot. The extent of Quentin Tarantino's film knowledge is still staggering, and he remains a true auteur gifted in all aspects of filmmaking, from cinematography and editing to screenwriting and selecting tracks for the film's eclectic and brilliant soundtrack. Other than a slightly monotonous grisly extended fight scene, I have incredibly little about Kill Bill Volume 1 to criticise - it's a brilliant, blood-splattered love-letter to the less artistically admired, but no less cinematically important filmmakers, and perfectly sets you up for the stunning conclusion to The Bride's quest for revenge in Vol. 2."
    },
    {
      "rating": "9",
      "text": "Kill Bill is a film where director and writer Quentin Tarantino tries out various techniques, not to see if they work, but simply for his own enjoyment and to boast of his talent for detail, especially when so many of these techniques are used simultaneously, which has created an unforgettable opening of a two part tale.\rUma Thurman stars as a bruised and beaten woman known simply as ‘The Bride’, who is betrayed on her wedding day by her colleagues, a group of dangerous individuals known as the Deadly Viper Assassination Squad, led by Bill (David Carradine).\rWhen they underestimate The Brides will to live, she eventually awakens from a coma and seeks revenge on those who wronged her, and as the opening quote on the screen suggests, “Revenge is a dish best served cold”, and this woman has nothing but cold and calculated on her mind.\rTarantino has told the story in a non-linear fashion, using chapters to split up the story, and incorporating various flashbacks of how exactly the wedding scenario played out. But in regards to the bride, she sets off by making a list of those who portrayed her, and its clear from the beginning that this film was always going to be building to something bigger, does it take anything away from the film? Perhaps a little, it certainly stands on its own two feet, but the fact remains that we are introduced to these various characters but only get a handful of them. Saying that, however, the scenes with these particular members of the Deadly Viper group are fantastically gory, anime and exaggerated tone that only Tarantino is capable of pulling off with such gritty means.\rUma Thurman’s ‘Bride’ is typically cold and in a particular mindset for the film, she delivers her kills with little mercy, perfectly portrayed by Thurman herself, who shows her willingness to throw herself into any role, a junkie in Pulp Fiction and now a deadly assassin.\rThe final moments of the film, and the build up are quite remarkable. Tarantino utilises his devices including typical Japanese slashers and even Spagetti Westerns to culminate in a massively colourful fight scene, but the final confrontation between the Bride and O-Ren Ishii (Lucy Liu is a beautifully crafted scene, and a true powerhouse in filmmaking.\rFor what it lacks in finalising a story, Kill Bill Vol. 1 certainly makes up for in its unique ability to combine visually striking scenes of blood splattered marvel, and Tarantino is truly at his best."
    },
    {
      "rating": "9",
      "text": "Kill Bill Vol. 1, is a great movie! A movie about a mother looking for revenge on some guy and a couple of assassins. The story seems pretty bare bones, but I really like it. Cause on the surface it just seems like a revenge story for Uma Thurman's character. But it expands upon her journey hunting down these assassins in so many ways. Some of the assassins even get backstories. More in volume 2, but the Japanese assassin gets a beautifully animated backstory which perfectly everything we need to know about the character. One thing I love about the movie is the beautiful soundtrack, especially in the China portion of the film. The soundtrack sounds like it was composed by Nobuo Uematsu himself. It's magnificent. The acting is also good too. Uma Thurman absolutely nails her character as (like I said earlier) a mother trying to get revenge. She has the caring, charming mentality of a mother. But the cold blooded, bad ass nature of an assassin. everyone else is good too, but you don't really see much of any other characters. The characters get a lot more fleshed out in volume 2. But my absolute favorite film about this film, is the fights, and the fight choreography. It is **** brutal. Every single fight scene is fun to watch. Every time there was a fight I had a **** eating grin on my face. Hell! This movie opens on a fight, and its amazing. In the fights Uma Thurman will be doing 20 flips, spinning on the floor, swinging her sword around in loops like a god damn industrial fan. I absolutely love the fights. The scene in Tokyo where \"The Bride\" has to fight the Crazy 88 is splendid, just a magnificent scene. I love how the filter cuts to black and white, like its an old Japanese karate movie. I just love it. I honestly just really like Kill Bill Vol.1 and Vol.2 for completely different reasons. This movie for the breathtaking fight scenes, and Volume 2 for its brilliant dialogue. Kill Bill Volume 1 & 2 are some of Tarantino's best. Okay. Just go watch them ya **** idiot. They're really good. They make my dick rock hard! 9 outta 10."
    },
    {
      "rating": "10",
      "text": "Kill Bill isn't supposed to be believable. Kill Bill is: gory, ridiculous,  It's pure, unfiltered Tarantino. Kill Bill is: Cool. Brilliant, timeless classic, which is exactly what to expect from Quentin. Vol 1 and 2 are one of those kind of movies that I have to watch every time I see it on cable. It just never gets old."
    },
    {
      "rating": "10",
      "text": "Visually stunning and magnificently gory, KIll Bill Vol. 1 is one of  Tarintino's best films in my opinion. After The Bride, Uma Thurman, was betrayed by her boss, Bill, she is slapped in to a coma and left to wonder what happened to her baby. With an interesting story to complement beautiful violence, Kill Bill Vol. 1 is a true masterpiece."
    },
    {
      "rating": "10",
      "text": "Kill Bill Vol. 1 is a masterpiece. Vengeance, justice and kung fu are combined to create an entertaining action film. Uma Thurman plays the main female character who slices her way through bad guys."
    },
    {
      "rating": "10",
      "text": "as much as Robert Rodriguez  & Tarantino have  brought some crazy over ratted fun kick ass movies like\r( Dusk Til Dawn, Pulp Fiction), Kill Bill was one of the best movies of  Tarantino's career.  the writer/ director ( Tarantino) has created a heroic characters in his films and Uma Thurman is  clearly his best characters yet, thats what makes Kill Bill so special also his crazy work with effects also  his camera shots. Grade A"
    },
    {
      "rating": "8",
      "text": "The acting is very good, the soundtrack is amazing, the fight sequences were magnificent and there were tons of blood. Kill Bill is without a doubt one Tarantino's best movies."
    },
    {
      "rating": "10",
      "text": "This is by far my favorite film. It's bloody, highly entertaining, and it is just a fun revenge flick to watch. It is very over-the-top, like most grindhouse films were, which makes it all the more entertaining. I highly recommend this."
    },
    {
      "rating": "10",
      "text": "No tengo palabras para expresar lo que siento cada vez que veo esta obra maestra, Kill Bill Vol 1 es una joya, completamente divertida, brutal y única. Las secuencias de acción son un bello homenaje a las películas de Kung-Fu antiguas, mezcladas con una historia original y con un guion que solo Quentin Tarantino lo puede hacer. Esta primera parte es magnifica."
    },
    {
      "rating": "10",
      "text": "Kill Bill Vol. 1 is AWESOME! It has Way better action than the second one. Now, I'm not saying that Kill Bill Vol. 2 is a bad movie believe me it is awesome and I gave that a 10 also but this introduces the characters and explains why she wants to kill the people on her death list and of course, Bill. I truly love this movie and it deserves a 10 undoubtedly."
    },
    {
      "rating": "10",
      "text": "Kill Bill is a film where director and writer Quentin Tarantino tries out various techniques, not to see if they work, but simply for his own enjoyment and to boast of his talent for detail, especially when so many of these techniques are used simultaneously, which has created an unforgettable opening of a two part tale.\rUma Thurman stars as a bruised and beaten woman known simply as ‘The Bride’, who is betrayed on her wedding day by her colleagues, a group of dangerous individuals known as the Deadly Viper Assassination Squad, led by Bill (David Carradine).\rWhen they underestimate The Brides will to live, she eventually awakens from a coma and seeks revenge on those who wronged her, and as the opening quote on the screen suggests, “Revenge is a dish best served cold”, and this woman has nothing but cold and calculated on her mind.\rTarantino has told the story in a non-linear fashion, using chapters to split up the story, and incorporating various flashbacks of how exactly the wedding scenario played out. But in regards to the bride, she sets off by making a list of those who portrayed her, and its clear from the beginning that this film was always going to be building to something bigger, does it take anything away from the film? Perhaps a little, it certainly stands on its own two feet, but the fact remains that we are introduced to these various characters but only get a handful of them. Saying that, however, the scenes with these particular members of the Deadly Viper group are fantastically gory, anime and exaggerated tone that only Tarantino is capable of pulling off with such gritty means.\rUma Thurman’s ‘Bride’ is typically cold and in a particular mindset for the film, she delivers her kills with little mercy, perfectly portrayed by Thurman herself, who shows her willingness to throw herself into any role, a junkie in Pulp Fiction and now a deadly assassin.\rThe final moments of the film, and the build up are quite remarkable. Tarantino utilises his devices including typical Japanese slashers and even Spagetti Westerns to culminate in a massively colourful fight scene, but the final confrontation between the Bride and O-Ren Ishii (Lucy Liu is a beautifully crafted scene, and a true powerhouse in filmmaking.\rFor what it lacks in finalising a story, Kill Bill Vol. 1 certainly makes up for in its unique ability to combine visually striking scenes of blood splattered marvel, and Tarantino is truly at his best."
    },
    {
      "rating": "10",
      "text": "A successful thriller film that includes revenge, suspense, blood, and action from start to finish! Quentin Tarantino does an amazing job with his non-linear structure making the films more entertaining and offering backstories for his characters. The art of music throughout both films is phenomenal, giving the viewers chills and thrills. I highly recommend the film to martial arts fans, western fans, action fans, and of course Quentin Tarantino fans."
    },
    {
      "rating": "10",
      "text": "A ultraviolent exercise in pure visceral action and spectacle with a succession of increasingly incredible and insane setpieces culminating in one of the greatest fight scenes in film history."
    },
    {
      "rating": "10",
      "text": "His best movie, no doubt! Uma Thurman was terrific, Lucy Liu was absolutely great in there as a supporting role....the final battle between O-ren and The Bride is a powerhouse of filmmaking. And music is absolutely BRILLIANT! Cinematic gold! A masterpiece! 10/10!"
    },
    {
      "rating": "9",
      "text": "With plenty of style, violence and gallons and gallons of blood, the first volume of \"Kill Bill\" was an absolute pleasure to watch. This is one bad-ass movie."
    },
    {
      "rating": "9",
      "text": "kill bill vol.1 is a great appeal for fans of Quentin Tarantino.com memorable kun-fu scenes filled with gore. Kill bill vol.1 is undoubtedly one of the best revenge and kun-fu movies of all time."
    },
    {
      "rating": "10",
      "text": "I think it is my favorite film of all time. This movie makes you have chills and thrills and it's definately one of the best movies ever made. For me, it's Tarantino's best movie. I never understood why some people dislike this film... Performances, cinematography, choreography of the fights, action sequences, dialogue, music... all perfect! It even contains a manga anime sequence on it which I found very artistic. Also, I loved splatter and camera tricks. It is very impressive and the plot is really interesting and touching at some point. Last but not least, I can say Uma Thurman totally rocked on there! Her best role out of her career without a doubt! Lucy Liu was also very good as the main villain. My favorite scene was Uma Thurman vs Lucy Liu fight. Really breathtaking! Overall, a flawless perfect film that really deserves its good ratings and critics. It becomes even better along with Vol. 2 because it focuses more on the story and characters, but Vol. 2 is not as strong and badass as this one."
    },
    {
      "rating": "10",
      "text": "Ένα αιματηρό θρίλερ γεμάτο σασπένς, αγωνία, δράση, σπλάτερ, βία, εικαστικά όμορφο και άψογα σκηνοθετημένο. Οι ερμηνείες ήταν πολύ καλές και ειδικά της πρωταγωνίστριας Ούμα Θέρμαν αλλά και της Λούσι Λιου που μέχρι πρώτινος τη θεωρούσα κάτω του μετρίου ηθοποιό.. εδώ με εξέπληξε και της βγάζω το καπέλο.. οι χορογραφίες των μαχών καταπληκτικά σκηνοθετημένες, η φωτογραφία και οι εικόνες σε καθηλώνουν, λήψεις από διαφορετικές οπτικές γωνίες, πετυχημένος συνδυασμός διαφορετικών τρόπων κινηματογράφησης, έντονη επιρροή και αναφορές στο ασιατικό σινεμά (ένα μάλιστα από τα κεφάλαια είναι γυρισμένο με τη γιαπωνέζικη τεχνοτροπία του manga anime), αιχμηροί και πομπώδεις διάλογοι, ενδιαφέρουσα ιστορία, η μουσική επένδυση όμως είναι αυτή που ανεβάζει το έργο σε άλλο επίπεδο. Με εντυπωσίασε περισσότερο η samurai/manga αισθητική της ταινίας καθώς μου αρέσει ό,τι έχει σχέση με Ιαπωνία και τέτοιου είδους κουλτούρα.. είναι μια ταινία που σε συναρπάζει τόσο με τη δράση που έχει να προσφέρει όσο και με την αισθητική της. Πρόκειται για μια οπτικοακουστική όαση με εντυπωσιακές σκηνές μάχης, έντονους χρωματισμούς, πολύ σπλάτερ, τρελή ατμόσφαιρα και ένα μαγευτικό soundtrack. Είναι μια ταινία που βλέπεται πολύ άνετα και ευχάριστα και αξίζει σίγουρα πάνω από μία προβολές.. είναι μια ταινία με μπόλικο σασπένς που σε καθηλώνει και σου κόβει την ανάσα. Από την πρώτη φορά που είδα αυτή την ταινία την λάτρεψα, πραγματικά την ''ερωτεύτηκα''! Θεωρώ ότι είναι η καλύτερη ταινία του Ταραντίνο ή τουλάχιστον η πιο ενδιαφέρουσα σεναριακά. Για μένα αποτελεί αδιαμφισβήτητα μία από τις αγαπημένες μου ταινίες καθώς και μία από τις καλύτερες ταινίες όλων των εποχών. Βάζω 10/10!"
    },
    {
      "rating": "10",
      "text": "Wow. Amazing movie. Extremely violent, but extremely good. I was not expecting much going into this movie, but I absolutely loved it. Top 3 Tarantino work."
    },
    {
      "rating": "10",
      "text": "Quentin Tarantino's best film and my favorite movie of all time! The action and fight scenes are amazing and every time I watch this movie I can't get my eyes off the screen."
    },
    {
      "rating": "10",
      "text": "Amazing movie!! Best action movie ever. Quentin tarantino gives a blockbuster."
    },
    {
      "rating": "10",
      "text": "A truly beautiful and violent piece of filmwork from Quentin Tarantino."
    },
    {
      "rating": "10",
      "text": "My favourite movies of all time. Between the over-the-top violence, the brilliant score, and unique (yet firmly stereotypical) characters, you can't lose."
    },
    {
      "rating": "10",
      "text": "This movie was great! It was funny and action packed! From a blood hungry bride to a Japanese schoolgirl who can wield a ball and chain it was a great movie. Very good storyline too I believe."
    },
    {
      "rating": "10",
      "text": "This and the sequel to this movie are still my favorite movies of ALL TIME. Loved everything about it. yes it's rather gory, but it almost doesn't seem that gory given that's it's given in such a cartoon-ish way, which i Love. I'm utterly amazed that the critics for this movie are so low, i can't get enough of the movie. GREAT fight scenes, and i love how they add little funny tidbits throughout that story, as well as add quirky sounds throughout the movie, it really keep my attention every single time i watch it. Thumbs WAY up!!!"
    },
    {
      "rating": "9",
      "text": "I think this is my favorite Tarantino film. I've seen so many review saying \"it was so gory\" and the \"violence was cheap and fake looking.\" These comments always make me laugh. You don't get it. This is a homage to kung-fu flicks of the 60's and 70's; they WERE cheap and exaggerated. Most of all they were FUN! If you don't like kung-fu flicks then why on earth would you watch this movie? This is not a soul searching drama, this is KUNG-FU!"
    },
    {
      "rating": "9",
      "text": "My favourite movie ever. Tarantino has delivered a wonderful cult-style film with a fluent mixture of samurai and western style. The one thing I really noticed was how easily it was to sympathize with almost all of the charaters, especially The Bride and Bill"
    },
    {
      "rating": "10",
      "text": "What?? I watched the best fight scene on my whole life this morning. I couldnt stop and watched vol2 too on the same day. It was total blood bath and i loved it. It would be an insult to to give this movie anything but 10 :)"
    },
    {
      "rating": "8",
      "text": "The most violent, most sexy and most pure brawler action movie I've seen. The story, like Pulp Fiction, is as minimal as possible; only existing to explain the motives behind all the violence. Uma Thurman looks stunning in this film, and the combat scenes are not only directed with style and perfection, but they're also quite comical at points. It's almost like a Jackie Chan cartoon only with sharp-edged weapons and a lot of uncensored violence. In fact, the amount of blood and gore can seem a bit too much given the cartoony style of the film. But the scenes are top notch. Quentin Tarantino sure knows how to direct action scenes well. The only criticism I have is that there's no real story, so you're just watching a compilation of action scenes rather than a movie experience."
    },
    {
      "rating": "10",
      "text": "Smart, funny, very well performed and directed, a reference in the non-asiatic ninja film history. Like always with Tarantino, all the characters are awesome, and you can do a spin-off with every one of them. Really."
    },
    {
      "rating": "9",
      "text": "Damn, if you where to watch vol 2 before this one (like i did) you would LOVE kill bill vol 1. I can see why people wouldn't like it, seeing how its mostly shooty shooty bangy bangy and very little plot in between (most of this plot is later found in vol 2). But hey, i love it. What can i say, it was one of the first Tarantino movies i ever watched and i love it."
    },
    {
      "rating": "9",
      "text": "A wonderful film, by most metrics. Tarantino is an incredible filmmaker, but his prestige advanced beyond great screenwriting into great direction for this film. A stylized revenge flick is what it is, so to take it as more than that is ludicrous, and for what it is it is nearly perfect. I do not believe Tarantino intended to create the greatest film of all time, I believe that he intended to create an entertaining movie that combines his favorite genres, and it works. The acting, the screenplay, the direction, and the countless homages to kung fu, spaghetti western, and exploitation movies make it a massively entertaining watch."
    },
    {
      "rating": "8",
      "text": "8.0 for lots of people dying. The story isn't that bad either and it was kinda funny though the whole thing just came out funny for me. It's pretty entertaining to say the least."
    },
    {
      "rating": "10",
      "text": "For those unfamiliar to Tarantino's work this movie might be 'unrealistic'. Tarantino's films usually go for some kind of cartoon-ish funny-ish action style script which is nothing but the way he likes to direct. The user score and the meta-score seem way too low. Although I must say vol. 2 is much better than vol. 1. Yet again I consider Kill Bill Vol 1 and Vol 2 as one and only masterpiece."
    },
    {
      "rating": "10",
      "text": "This film is a combination of everything I love: Japanese cultural aspects, swordplay, a revenge plot, philosophy, and above all else, wit. Definitely one of the greatest films I've ever seen."
    },
    {
      "rating": "9",
      "text": "Quentin Tarantino, a formidable filmmaker in Hollywood, who has masterminded great pictures like RESERVOIR DOGS and PULP FICTION, is also hugely responsible for the greatness behind KILL BILL: VOLUME 1 (KB1). KILL BILL was at first being scheduled for a single movie, but that single movie exceeds a running time of over four hours. The decision to separate the source into two parts was favourable  KB1 was released in late 2003 while its sequel, KB2, was released in early 2004.\r To me, KB1 is a cinematic masterpiece. Everything in the movie was being meticulously orchestrated, right from the start of the movie to the end of it. I would say the movie is just tight. You would wish to imagine a tight, ripped body of a person, that's KB1. Editing of this movie is just sharp and great writing too. An element which caught my attention is the camera work itself  I would say they are highly artistic and imaginative. In one particular scene, Tarantino exploited a long impeccable tracking shot with no cuts, and it is brilliant.\r Beyond the near-perfect cinematic experience which Tarantino has given us, Uma Thurman's performance deserved a praise too. She manipulated her character extremely well which I think it is being overlooked, her performance is decent. Her character in the film is boiling with sadness and anger and for example, in one scene, you could witness that pain or anger through Thurman's expression on her face  that marks the work of a great actress.\r As a whole, this movie is daringly beautiful. The plot is simple, but Tarantino's clever navigation for this movie is excellent. Could I say it? Kill Bill Vol 1 is bloody, darkly comical, and unforgettable.\r [4.5/5]\r Facebook (http://facebook.com/alex.desmall) Twitter (@Alex_DeSmall) (http://www.rottentomatoes.com/member/AlexDesmall)"
    },
    {
      "rating": "10",
      "text": "when i saw this movie for first time i felt instant love. it's so strange, so crazy and well done. even when it's an action movie, it has feelings and such good actors. actually best movie ever."
    },
    {
      "rating": "8",
      "text": "I don't take this film seriously most of the time, which I think was Tarantino's purpose. Nevertheless, the allusions to this film are well done; western and martial arts can be a great combination, and Tarantino executes with a unique, Tarantino-esque style. The over-the-top aspect that covers the entire film is what makes it so fun to watch. It's Tarantino at his most fun."
    },
    {
      "rating": "8",
      "text": "I’ve seen all the action scenes in clips prior to seeing this movie and it was still loads of fun to watch. Tarantino makes the most fun movies."
    },
    {
      "rating": "8",
      "text": "Super violent, with great visual style and one heck of an ending. Tarantino delivers by blending genres perfectly, but jeez, he definitely has a thing for feet."
    },
    {
      "rating": "8",
      "text": "Kill Bill Volume 1 is very good, but it's the most bizarre Quentin Tarantino movie because of the stylized Japanese samurai moves, but besides that it's a very good film, way better than the second volume."
    },
    {
      "rating": "9",
      "text": "Tarantino classic and kung fu masterpiece. Everything about this movie is right - plot, casting, characters, music, fight scenes."
    },
    {
      "rating": "8",
      "text": "Kill Bill Volume 1 is an incredible film that mixes elements of Japanese Samurai films and American Westerns to tell and epic of honor, revenge, and bloodshed. Incredibly funny, extremely violent, and unforgettable, Kill Bill has truly earned it's spot in pop culture history. In my opinion, this is also the film where Tarantino perfected his ultra-violent signature style. This is a must-see for Tarantino fans, and for fans of great action movies."
    },
    {
      "rating": "8",
      "text": "Screaming-for-vengeance splatter homage for martial arts genre; the most notorius are for Bruce Lee (The green hornet, Enter the dragon, The game of death). The coreographies fulfills the expected action sequences. Maybe not the best episode but the effort of watch deserves a big bag of popcorn."
    },
    {
      "rating": "8",
      "text": "Отличный триллер. Музыка хороша. Снято отлично. Как обычно куча крови."
    }
  ]
}