{
  "id": 1774,
  "title": "King Kong",
  "starring": [
    "Naomi Watts",
    "Jack Black"
  ],
  "runtime": 187,
  "genre": [
    "Adventure",
    "Drama",
    "Action"
  ],
  "description": "In 1933 New York, an overly ambitious movie producer coerces his cast and hired ship crew to travel to mysterious Skull Island, where they encounter Kong, a giant ape who is immediately smitten with the leading lady.",
  "releaseYear": "2005",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4fNOp3itFBw7L28kAHxwRPqyZ2K.jpg",
  "categories": {
    "plot": 2.6052631578947367,
    "acting": 4.1923076923076925,
    "ending": 2.4444444444444446,
    "soundtrack": 7.0,
    "cinematography": 0.0,
    "familyFriendly": 3.0,
    "funny": 1.0,
    "action": 3.2222222222222223
  },
  "reviews": [
    {
      "rating": "10",
      "text": "King Kong is one of the most memorable and celebrated stories of all-time.  This remake or \"re-envisioned\" version of the original King Kongs is stunning, heartful, and simply unforgettable.  Peter Jackson creates a remarkable and haunting Skull Island.  King Kong is arguably the greatest CGI character of all-time.  Forget 'Avatar', this is CGI at its best.  Kong has emotion, cuts, etc.  You can practically believe he or any other creature of Skull Island are real, thanks to the superb visuals.  Despite the huge runtime, Kong never falters and does justice to its source material-and then some.  I truly believe that this version of Kong is the best ever released.  Everything is damn-right perfect, and you can't help but cry at the end, even though you already know what is going to happen to Kong.  This movie transcends all of its hype and truly engages us on all levels: visual, intellectual and emotional.  A true masterpiece.  Go see it-now."
    },
    {
      "rating": "8",
      "text": "While the ending wasn't really satisfying, overall, it was a fun ride. And I actually didn't mind the length of the movie, something I criticised Peter Kackson's LOTR trilogy for."
    },
    {
      "rating": "10",
      "text": "Peter Jackson has done it again. King Kong is majestic, beautifully executed and a stunning love story. The movie is  simple, but so effective,  just a tragic story that holds you emotionally and visually from beginning to end. King Kong proves that Jackson is one hell of a director."
    },
    {
      "rating": "9",
      "text": "A superb remake, and a thrilling adventure on its own terms, King Kong was one of 2005's most entertaining movies.  It starts out slow, with a very 1930's vibe.  I wouldn't consider the sections before the crew gets close to Skull Island great filmmaking exactly, but Jackson has made good choice not to rush the story.  Once they get to the island it proves that it was well worth the half hour wait.  Believable performances, for the most part incredible special effects, Jackson's expert direction, and real emotion make this a must own.  Granted, when I first saw the previews years ago I was hoping for a more surreal and out there vision of the story, but what we got was more than good enough.  Almost forgot to mention how great the movie's score was.  (That means the background music.)"
    },
    {
      "rating": "10",
      "text": "This is probably the most anticipated movie of 2005. It was very entertaining and very unpredictable. Naomi Watts and Jack Black were fantastic for their roles. It's so entertaining that the 3 hours of it feels like 1 hour."
    },
    {
      "rating": "7",
      "text": "Some people say Kong is a flawless masterpiece. Some say it is a boring, grueling crapfest. The truth: Neither; Kong falls somewhere in between. The CGI is nothing to complain about, because it's some of the best ever used. My main beef with the movie is that most of it plays out like a videogame. Naomi Watts swings back and forth and nearly gets eaten. Big bugs make the audience scream out, \"Eww!!!\" I would equate King Kong with one of those 3D movies at Disney World. Then the very next moment it is playing sad music and you are staring at the soulful eyes of a dying Kong. Also, I agree. 3 Hours is too long of a movie. I don't blame Jackson, because trying to entertain someone for 3 hours is an ambitious task. Bottome Line: Some of it is a marvel to look at, and some is really cool, but I never have much fun with Jackson's movies."
    },
    {
      "rating": "0",
      "text": "Lets call a spade a spade. If you are so fascinated by special effects there are plenty of video games you could buy that can entertain your ADD. But to give this crapola high marks when the acting is so awful and the story unoriginal is beyond all imagination. Jack Black and Adrian Brody sucked. Its that pure and simple. The movie dragged on forever. There was no dialogue, no chemistry between the two stars; unless of course you mean The Big Ape and the girl. As for Adrian Brody I think she wanted to puke. The story is dated and totally implausable with more holes than Carter has Little Liver Pills. Don't be blindsighted by the Hollywood Left Wing. This movie is awful and I wouldn't watch it again unless you placed bamboo shoots in both of my eyes. Come to think of it I think the racist natives had bamboo shoots coming out of their eyes and every other oraface in their face. Nestle should be very proud that they sponsored a racist scene. Didn't anyone look at how the natives were portrayed? Talk about sterotyping, oh my God. This movie was preposterous and about two hours too long. Avoid at all costs."
    },
    {
      "rating": "2",
      "text": "I didn't give it a 0 because I did enjoy the first 45 minutes, you know, the part with the dialog. The rest is just a loud obnoxious video game. There was no reason for this movie to get made, it is so boring, what a waste of $200 mil. and I'm sure peter jackson thinks he's a great director.... sad."
    },
    {
      "rating": "0",
      "text": "Dennis you said anyone who gives this film a rating lower than a 5 is not to be taken seriously? Likewise your rating is preposterous. There was no dialogue in this tedious film. The acting was inept and the directing even worse. I have seen better special effects on video games. As for the story it is not original as it is a remake of a remake. There was no suspense as everyone knows the ending. As for the storyline what Jackson did was a disgrace. He robbed other movies and tried to do one better. The Skull Island scene was preposterous. There were more plot holes than Carter has little liver pills. Basically what you are advocating is checking your brains in at the door. The audience I saw it with was booing and screaming Refund when they were not walking out. This terrible version of Kong was worse than the 1976 remake and I for one did not think that was possible. Jack Black is one dimensional and was awful as well as being miscast. The movie was about 2 hours too long and the boring first hour set up nothing. Can anyone tell us how the Big Ape was transported on the little broken down boat back to NYC. After all he couldn't fit down into the hull, was too big for the cages and how did they keep him locked up without destroying the boat? This is the same Kong who destroyed NY on cue without doing so at the rehersals for the big Broadway spectacular in 1933 Depression NY. By the way then how come everyone had a tuxedo on? And do people go out in the snow without a coat in a spring dress with high heels on? Please this movie is a disaster movie all right but for all the wrong reasons. A perfect 10? You're either dreaming or had a lobotomy?"
    },
    {
      "rating": "0",
      "text": "Gratuitous, soulless, shallow and stupid. This isn't a movie: it's a video game."
    },
    {
      "rating": "0",
      "text": "I just saw movie on dvd and its by far the worst movie I've ever seen. did Peter look at the movie before he gave it to the studio? did anyone notice when they tried to capture kong the first time the path they would of tried to carry him through? what about how did he get to new york? the boat was too small for the crew! what about when kong escaped in new york? it was a thousand cabs in the street then he sees the girl and everything and everyone dissapears at one time! and to top it off, he plays on the ice in new york city. WOW! PETER, WATCH THE MOVIE BEFORE YOU SEND IT IN!"
    },
    {
      "rating": "0",
      "text": "The \"King Kong\" with Faye Wray was a horrible, schlocky story that, quite frankly, demeaned everyone who worked on it, Wray included. The \"King Kong\" with Jeff Daniels suffered from its own epic delusions, finally crumbling under the weight of a horrible direction. But Peter Jackson's take on \"King Kong\" is the worst version of the most overrated story of all time. First of all, Jackson tries to approach this version with the same eye that Steven Spielberg used in the first hour or so of \"Jurassic Park.\" At this point, however, you can't do that, because \"Jurassic Park\" did that awe-inspiring animated-animals moment better than any movie before or since -- it still sends a shiver up my spine when I watch the brontosaur jump up to grab the top leaves on the trees. There is no \"wow\" moment in Jackson's \"King Kong\" because Jackson tries to cram \"wow\" moments in every five or six minutes, completely obliterating their impact. Now, I've heard from both critics and members of my own family that the ape was beautifully animated. I say now what I said to them: WHAT?!? Through the entire damned movie, all I could think was, \"Wow, that ape doesn't look real at all; it looks like a character from an XBOX-360 game.\" The world in which Kong lives is likewise hokey, looking like nothing but lame backdrops excised from \"Return of the King\" (easily the worst and most pretentious of the \"Lord of the Rings\" movies). Then there's the writing. The story of \"Kong\" is bad enough, but humanizing the animal only makes it worse. Let's make one thing clear: Kong is a giant ape who appears to have marked intelligence and emotion. But he is still an ape! A friend once told me that this is a stupid reason to dislike the film, but frankly, I don't know how anyone could put the obvious bestial implications out of his or her mind. To be fair, the movie never even comes close to touching the bestiality subject; but the fact that there's even a hint that Naomi Watts's character might be feeling something for the ape is a little bit nausea-inducing. If there bond between Watts and the ape had been more a mother-son kind of relationship, the film might've worked better; but as it stands, it straddles the love relationship without fully dedicating itself one way or the other whilst hinting at the obviously disturbing prospect of an affair between the two. Meanwhile, the script itself is horrendous. There is not one good piece of dialogue throughout the entire film. I'm not sure if Jackson allowed a herd of rabid, mentally-challenged Venusian cows to write it, or if he got so wrapped up in chase scenes and third-rate \"Jurassic Park\" tyrannosaur knock-offs that he forgot that what's being said is important, but either way, not even Jack Black can save some of the dumbest lines ever uttered in cinematic history. ...Which brings me to my next point: The acting was atrocious. I have to disagree with those who have been pseudo-apologists for Jack Black, Naomi Watts, and Andy Serkis. Each of the three has done brilliant work in the past, but \"Kong\" is not something they should put on their resumes. Black spends the entire movie looking lost, and Serkis, who deserved a million awards for the Gollum-schizophrenia scene in \"The Two Towers,\" does not make the big ape any more realistic. Even Watts, who at least attempts to bring something to the table, ends up crumbling under the weight of an overwrought, underdeveloped, underwritten script, and her performance suffers precisely because of it. Then there's Peter Jackson. After \"The Two Towers,\" which I still believe was his crowning achievement as a director, I was willing to forgive the tedious final hour of \"Return of the King,\" especially because the final two scenes were so emotionally powerful. \"King Kong,\" however, is a directorial mess. He switches camera angles at all the wrong times, and he doesn't focus on what he should when he should. For example, the penultimate scene, the famous one in which Kong is assaulted by mighty fighter jets, gets lost in its own action; rather than using the beautiful backdrop of New York City as its focal point, it uses Kong, and Watts gets lost. This is no good, especially when the skyline of New York is dolled up to look like something out of \"Sky Captain and the World of Tomorrow.\" And here's another problem: the scale of everything changes when Kong gets to New York City. Kong was easily the largest thing on Skull Island; yet he is all-of-a-sudden minuscule when he climbs up the Empire State Building. This scene actually worked in previous incarnations of \"Kong\" because the ape wasn't meant to look too real, giving the (admittedly dumb) story a kind of fairy-tale feel to it. Here, however, Jackson has made a lot of attempts to show Kong's fur waving in the wind, his eyes twitching and blinking like a human's, his mouth occasionally twisting up into a man-like smile. You can't have it both ways! The ape has more distinct mannerisms than any Kong before it, and yet the Empire State Building looks like it could reach the Cloud City from \"The Empire Strikes Back.\" Finally, as many have pointed out, there's the running time. Yes, about a good hour could've been trimmed off the movie and still gotten Jackson's point across, potentially better. But the first forty-five minutes are a snore, too, even though there's lots of plot happening; likewise, the return to New York City, before Kong shows up, is a snoozer, although it contains the entire setup for the Grand Finale. And that's not even counting the hour and a half (or so) Jackson spends on all the different weirdo Skull Island creatures. The point is, the movie plods along rather than meanders; and the action sequences, far from advancing the plot, make the story come to an absolute stand-still in favor of bang-bang-bang action. Honestly, I cannot fathom what possessed critics (or anyone else) to recommend this film. It is one of the most pretentious, boring, stupid movies ever made, and Jackson ought to issue a bigger apology for this than George Lucas needs to for \"The Phantom Menace.\" We live in a digital age, which could've given Jackson the chance to bring something new to the Kong mythos. Instead, he simply rehashes what's already done (and actually kind of dumbs it down), crafting a movie that might've looked good in 1933, but that now just makes me want to throw popcorn at the screen and sit there for another three hours demanding that Jackson compensate me for the time spent watching this awful mess."
    },
    {
      "rating": "1",
      "text": "I went to watch this despite my rule to avoid $100 million plus extravaganzas. I was seduced by the critics surprisingly gushing response and had to overcome my own tepid feelings for the subject matter of the movie. In retrospect I greatly regretted this experience. The movie is abysmal and does not function at any level that is expected to be deeper than a video game. Apart from writing a review of the movie, someone needs to write a critical review of the reviews. How has this film achieved universal acclaim from professional critics? Did Jackson release two prints, one for the critics that was decent and one for the rest of us, that was abysmal? Or for some inexplicable reason, did the critics feel like they had to write the reviews they did. Most great films get better the more one thinks about them. This movie just seems worse and worse when you rewind it in your mind. The ape effects and Sirkis are good but you can see these parts in the free previews on the web. These brief moments simply (and not frequently enough) punctuate vast swathes of tedium and idiocy. I recommend that you avoid this movie at all costs."
    },
    {
      "rating": "0",
      "text": "Why did they make ANOTHER King Kong? I mean it has been made about 8 times, and everyone knows how it ends. Kong dies at the end. So it's not like you changed it so much. It ends the same. So why don't the directors of today just stop taking other peoples ideas and be original."
    },
    {
      "rating": "1",
      "text": "I'm surprised about the great rating this movie has been given! It's painful to watch it! I couldn't finish the movie because it bored me so much! The only good aspects would be the special effects which you can always tell if they are computer graphics or miniatures. The first hour of the movie is alright but once the monkey appears it's just bullshit! The fight of Kong with the 3 T-rexes is so bad! The director forgot tha humans have bones. Kong kept throwing Ann into the air and grabbing her with his feet or hands. After the first grab a human would probably be dead! Maybe as a remake it's good, I don't know because I never saw the originall. As a movie it stinks!"
    },
    {
      "rating": "0",
      "text": "A disgrace to the original, which is one of the greatest films of all time."
    },
    {
      "rating": "1",
      "text": "This is simply a bad movie. Maybe the made the video game first, which is why it's all about dinosaurs and giant insects? The plot is jumpy and incoherent, and the characters are not developed at all. The so-called love story with Watts & Brody is a joke. Why are people saying this is a good movie? It's not!"
    },
    {
      "rating": "0",
      "text": "C'mon this is the best con job since the invention of the pet rock. There was no acting, no originality, and certainly nothing more than an expensive video game. The critics must have had a lobotomy to have liked this crap. Avoid."
    },
    {
      "rating": "4",
      "text": "I liked the acting except maybe for Jack Black. I couldn't get passed the fact that it was Jack Black in order to see the character played by him. It reminds me of Tom Cruise's syndrome. I thought the middle part of the film, the one on Skull Island dragged and was gratuitous. It was like Lord of the Rings, Jurassic Park, and a trailer for a video game. Peter Jackson indulged and really bored me. The action sequences with the dinasaurs and insects had little thematically to do with the King Kong story. It really detracted from the main story. It's amazing how brain numbing Jackson's films can be. I enjoyed the New York and ship scenes."
    },
    {
      "rating": "0",
      "text": "Absolutely brutal. No special effects can make up for bad acting, terrible directing, no orignality and plot holes you can drive a Mack truck through. And that first hour how boring get you get. As for the rest of it, if I want to be entertained with a video game that doesn't make any sense I can do that for a lot less than what I paid to see this crapola."
    },
    {
      "rating": "3",
      "text": "The most amazing thing about King Kong is its consistency. This film delivers something genuinely idiotic every 10-15 seconds. After 3 hours of horrible dialogue, flat stock characers, and implausible action scenes, my throat was sore from scoffing. Generally, I would not waste my time railing about a Hollywood action movie.. but the amount of MONEY dumped into this movie makes the result more profane than the typical big-budget drivel. Man, you could change the world with $300,000,000... or you could make a few bucks and lower the worlds collective IQ.. Great choice Peter."
    },
    {
      "rating": "5",
      "text": "Like watching over someone's shoulder as they played a videogame, KONG is perfect entertainment for 21st century's visually overloaded \"switch-yr-brain-off-and -enjoy-the-ride\" audiences. I'm getting far more entertainment out of the comments posted here and I hope Jackson hires some of the users on this forum to write his next brain-dead comedy. According to them if you don't rate this film a 10 you're 'pretensious\", or \"a snob\", who must \"hate movies' or didn't actually even watch it before posting a review(!!). Apparently a 3 hour duration is excusable because there are other movies that are 3 hrs long. It's hard to choose between the funniest comment between John B, who claims this remake would 'genius if it had not been done before\" (mind boggling!) or Daniel T who claims that this mega-budget remake of a classic (in itself an indication of the banal recycling endemic of current cinema) is somehow an \"...antidote to the banality of modern cinema'! Oh God, LOL!"
    },
    {
      "rating": "2",
      "text": "I love giant monsters. I grew up on them. I chanted \"giant monkey\" over and over again as I walked into the theatre. Man, was this a piece of boring crap. The effects looked terrible-everything had that CGI sheen. Acting was bored to bad. The beginning was drawn out but okay. The middle might has well have been cutscenes from a videogame. And the ending was very welcome. Shame on all involved for making me hate a fight between dinosaurs and a gargatuan ape. I should have been the easiest sell in the world, but instead I watched my shoes for the last hour of the movie."
    },
    {
      "rating": "3",
      "text": "This movie has some great moments but they are hidden in a 3 hour messy film."
    },
    {
      "rating": "3",
      "text": "Like the big ape himself, this movie was bloated and flabby. They could have at least cut 45 minutes out of it."
    },
    {
      "rating": "5",
      "text": "Special effects were out of this world awesome, and the storyline was pretty good...BUT...it was about an hour too long! It spends a good 40 minutes of the movie before it even gets to King Kong! then we still have to witness his capture/relationship with Naomi Watts' character, and his tirade in New York City! I have only been able to watch it all the way through in one sitting once. Also, Jack Black just drags the cast down. There are SOO many other great actors in the movie that he sticks out like a sore thumb. Great \"try\" but I expected better."
    },
    {
      "rating": "7",
      "text": "\"King Kong\" is a great summer blockbuster movie that will throw you out of your mind. However, that's as far as the movie can get to you."
    },
    {
      "rating": "0",
      "text": "Jackson goes wild with his $200M box of crayons and crapola is the result. He miscasts Jack Black and Adrian Brody. His first hour is boring and unncecessary. Then when we get to Jurassic Park the man loses all credibility with laughable writing, lack of editing, and poor directing. Half of this movie should have been omitted and perhaps with someone having some talent we could have had meaningful dialogue? But instead we get a mishmosh with Jackson playing with his CGI to his hearts content in producing a video game that only a ten year old with a lobotomized brain could love? In reading the reviews did some of you juvenile posters actually say this was the best movie ever? The fact that with all the PR Kong dropped from number one at the Box Office in less than 2 weeks says all that has to be said. This is a very poor effort by Jackson on the recent order of George Lucas. The only thing missing from this disaster was casting Tom Cruise. Jack Black and Tom Cruise in War of The Worlds. Two no-talents in blockbusters in the same year. Ugly!"
    },
    {
      "rating": "0",
      "text": "If this movie was on the Gong Show it would be booed off the stage. Just a total joke with bad directing by an otherwise overrated in love with himself Peter Jackson. Jack Black needs to find another career. Preposterous."
    },
    {
      "rating": "1",
      "text": "Gorilla animation fine, tho out of scale most of the time,.Way too long and needlessly gory - bad for kids."
    },
    {
      "rating": "3",
      "text": "A big disappointment, especially for a movie that did a great job of ratcheting up the tension in the first hour or so of the movie. Jackson also made 1932 NYC look spectacular, gave motivation to Black, Watts and the rest of the cast. Suddenly, the movie morphed into a B-picture, complete with action movie cliche after action movie cliche that just made the audience squirm and groan. The movie looks great, but it just felt long and ultimately boring. Why make this movie if all you're going to do is modernize the special effects? The story of man's inhumanity to beast is lost somewhere along the way here, resulting in nothing more than a technically spectacular director flexing his muscle. We all know Jackson can make a movie look great. Somehow, after his masterpiece \"Return of the King\", I was expecting so much more."
    },
    {
      "rating": "0",
      "text": "King Kong is truly remarkable in how horrific a production it is. I go to movies with mixed reviews generally with the hope that it may provice different meanings to different people, in other words, it is open to interpretation. No. There was nothing to this movie beyond action that suddenly and inexplicably grinds to a halt time and time again, followed endlessly by another dinosaur, spider, or any number of conveniently-placed CGI-disasters approaching silently and unnoticed from behind. But this movie saddens me the most simply because I have remained earnestly and reasonably unconvinced of the elitist notion that the public was completely diluted and that everyone is essentially an idiot beyond ourselves. Well, congrats, American public, you have lost the faith of yet another in your approval of this film, and thanks Peter Jackson, for making me realize I actualy am smarter and less dim-witted than 90% of movie-goers today. You scammed me good with this one, got my $6.25 and the rest of the good people's in my theater. I feel that the only reason that more viewers didn't walk out of this movie besides me and my best friend was because it is unfortunately slightly embarrassing and, yes, \"elitist\", to throw up your hands in disgust in the middle of a movie theater and promtly leave. I used to firmly believe that ALL people were more complex that they first seem. Statistical discrimination, I guess, is justified."
    },
    {
      "rating": "2",
      "text": "It would seem the only two reasons to retell this story would be to show-off improved visual effects (including a better looking fay wray) or to examine the story in a new intellectual light (i.e. kong as islam or some such), but except for the stunning scene atop the empire state building (i've never been more afraid of heights - praise to the background artists), there was no motivation to make this movie again. kong still moves like the stop-motion animated creature from the 30's (too sharply or too laboriously), naomi watts looks like a bucktoothed flatchested hillbilly, and kong is kong is kong - no new insights. why were all these non-elements worth three hours of my life? if for whatever reason i ever taught a class in editing at an elementary school i would assign students this movie and ask them to make a one hour and 50 minute version. it would undoubtedly take them all of a half hour to do so. what were the filmmaker$ thinking?"
    },
    {
      "rating": "1",
      "text": "Simply put, 'King Kong' is a really bad movie. It's too long, it's poorly written, the dialog is awkward, there is no chemistry between the stars (with the exception of Naomi Watts and Andy Serkis), and it's miscast (it's clear that Jack Black was cast solely for his box office appeal, because he is not at all believable as a high-powered movie producer). Many of the special effects looked no different to me than special effects in movies from the 70's -- or even the 30's for that matter -- so I'm not sure why we're supposed to be wowed by them. Many of the scenes were so drawn out and repetitive that I was actually bored. The subplots -- the romance and the coming of age story -- were listless and uninteresting. The only redeeming parts of the movie were the performances by the beautiful and talented Watts, who did a decent job making me think she actually cared about the ape, and by Serkis, who made the ape seem almost human at times. Other than that, I thought it was a complete waste of $9.75 and three hours. The ending is supposed to be sad, but instead I was mostly happy and relieved that it was over."
    },
    {
      "rating": "4",
      "text": "This was not what I expected. To add a cool effect to this movie, i would have made it in B&W. While the special effects to this movie were stellar, i found it annoying that Kong was first introduced nearly halfway into the movie. The first 45 minutes are just a waste of time to watch and not really that important to the real action and body of the story. (If you get the DVD, just skip to the Skull Island scene.) The fact that Naomi Watts had a dialogue of basically screaming for the entirety of the movie set me off as well because she is a fairly good actor in reality. Some of it was pretty gruesome which was not what i expected at all. (Such as the man getting eaten alive by the leeches before being brought down to a watery death... and the villagers.) Jack Black was totally out of character and I did not enjoy that at all. As soon as i found out that he was going to be doing the 2006 KCA's i knew that his career was going to be officially over after doing that and this. The animation and production quality are my only two plus sides to this movie. Get the DVD because while not the greatest on earth, it is still average and sort of worth buying."
    },
    {
      "rating": "0",
      "text": "How bad can a movie be? In two words: KING KONG."
    },
    {
      "rating": "0",
      "text": "This is my least favorite movie of all time.In his attempt to make King Kong more like Lord of the Rings, Jackson has made an epic exposition of unbelievable events and stupidity.  This movie is at least 1 hour too long and every action scene is less plausible than the last, removing all tension and immersion.  There are no likable protagonists, villains or heroes and the plot and character development are more childish than an episode of Sponge Bob.I truly hate this pile of crap that King Kong himself could not excrete from his massive anus."
    },
    {
      "rating": "3",
      "text": "The more I watch this movie, the crappier it gets. Why? Because half of it is just screaming.. The acting was crap for the most part, I hate to **** talk Peter Jackson, but sorry man, this one was good for its time, but it has died to me."
    },
    {
      "rating": "8",
      "text": "Extremely Great Movie."
    },
    {
      "rating": "10",
      "text": "This isn't your great grand daddy's Kong! Jackson has swung at his lifelong dream project, and he has clearly hit the game winning grand slam in the bottom of the ninth inning of the 7th game of the World Series. Jackson keeps reinventing the cinema. That ape had more personality and emotion than half the fluffy Hollywood actors working today! A couple of things concerned me going in: (A) The 3 hour length, (B) Jack Black as the lead character, and (C) Did this classic REALLY need to be remade once again? Well, all I can say is (A) never has 3 hours moved so swiftly, (B) Jack Black can be successfully directed in a non-comedic role, and (C) not only did it need to be remade, but this is the movie that had everything that was missing in the original: namely, an ape with enough heart, emotion, and character to make grown people cry at his demise, and special effects so dazzling that you'd swear that reality was happening before your very eyes! Enough will be written in the weeks to come about its various shortcomings (and ALL film can be critiqued to death if you stop and think about it!) but what can't be ignored is that this is one helluva masterpiece in design, flow, and character study that will go down as one of the greatest achievements in cinema history. Run, do not walk, to see and revel in this magical fantasy by this genius filmmaker!!!"
    },
    {
      "rating": "10",
      "text": "Best movie of the year... I wasn't sure how it would go, and fearing the worst... but I wasn't disappointed! Go see it today!"
    },
    {
      "rating": "0",
      "text": "This is just bad. Mr. Jackson has failed us again."
    },
    {
      "rating": "3",
      "text": "This film.... ...deserves some credit for the sheer amount of work put into the mostly pointless CGI... I cannot think of an appropriate metaphor to describe the torture I had gone through sitting in the cinema - with insulting action sequences and hollow, shallow attempts at immersing a sense of wonder which made me, I swear on this, feel ill and depressed when the nightmare finally ended.. I find it ridiculous how technology excuses much of what should not be allowed to be excused!! - Some vague attempt at emotion used in CGI DOES NOT WARRANT comments that say that this is an emotional film or that it has depth and character. For those who dont pick up on shallowness and allow TOTALLY ILLOGICAL scenarios to unfold without wanting to shriek out in disgust that any sense of reality has been utterly suspended, I challenge you all to give reasons for your satisfaction with this drawn out and melodramatic film. The pain of sitting through a transparent, cliched and sour script where every potential for emotion had to be spelt out and every action explained, killed any sense of mystery or identification with the characters, the time period or the anticipation for adventure.. argh yet again I cant stand writing my own review it gets me so angry!! why do these films have to be so safe and so freakin dumbed down?!?! its sad and perhaps its my fault and I should retreat back to my fantasy world where risk is a necessary means to allowing the imagination to evolve.."
    },
    {
      "rating": "9",
      "text": "esta es una entretenida  sofocante y excitante película llena de actuaciones espectaculares y ni que decir de sus efectos  esta es sin duda otra obra maestra de peter jackson"
    },
    {
      "rating": "4",
      "text": "Most of the movie is enjoyable.But the ending completely ruins the movie.I want a good ending.King Kong should not be killed.Thanks a lot universal you made the most overrated movie ever."
    },
    {
      "rating": "6",
      "text": "Generally an ok film, but i lost interest at certain points. I found the boat journey to the island the most enjoyable bit. Some fo the effects were very real, while others needed a bit more imagination and forgiveness, not that i'd ever rate a film on special effects anyway. We have no idea where all the natives disapeared to, i guess they just weren't required for the film. Overall it was enjoyable, but a tad long and in some places defying the laws of physics and chance in a lot of the action sequences to a point even the most openminded of people couldn't forgive."
    },
    {
      "rating": "10",
      "text": "Simply amazing. One of the best, if not the best film this year."
    },
    {
      "rating": "7",
      "text": ">Now if you want to explain any of these plot holes be my guest but you won't be able to. OK. Since you asked, I'll try to address a couple of point you have raised. >And sure a small bottle of chloroform will put that Big Ape to sleep. Well, it was an entire flagon of it, and it hit him right on the nose. Would that be enough to put a 25 foot gorilla to sleep? I don't know, but it's debatable, and therefore hardly a glaring plot hole. >Can anyone explain how he did not drown or how they lifted him on the damged little tug boat that could? When he fell unconscious, his was clearly shown resting on a rock, not in the water. Who knows how they got him to the boat. They may have been able to bring the ship closer and winch him aboard. Perhaps this is unlikely, but again, I wouldn't consider it to be a glaring plot hole. It's not a documentary, you know. >And if you want to believe that how did they feed him or contain him on his journey back to NYC? Do you want to tell me that they magically obtained steel chains that tied him to the damaged boat? Is it inconceivable that a boat and crew that specialises in capturing wild animals would have chains and sufficient food on board? I'd suggest they rigged up a cage and chains on the main cargo deck. >Well, if that's not bad enough when he arrives in NYC they had to have rehearsals before the native dance number with the blonde, not Ann Darrow, sacrifice right? How come he never reacted that entire time. I guess he waited for opening night to destroy NYC? The flashbulbs from the press clearly triggered his rage. The press would not have been there for rehearsals, only for opening night. > And if that wasn't enough, the ending in the winter with Ann without a coat in a light spring dress with high heels ascending up the ladder to the top of the tallest building in NYC was just the icing on the cake. So she was wearing the costume from that chorus girl show she was in, and didn't put on a cold because she ran outside in a rush after hearing the commotion. Is that such a big deal? >And by the way, where did the natives disappear to? Remember that they risked life and limb to kidnap Ann for Kong but somehow vanished when he got hit with a little teenie weenie bottle of chloroform. A) They cleared out when the sailors arrived with guns. B) I assume they would have cleared even further out when they heard Kong smashing the gate down. They weren't trying to feed Darrow to Kong because they love him, you know. It was a sacrifice. They were terrified of him. They wouldn't stick around to see what happened after he knocked the gate down. >You people raving about this trailer trash of a movie are totally insane. You are desparately in need of some professional help. I didn't think the movie was fantastic at all. I thought the compositing between CG and live action was often poor, and I loathe the jerky motion effect Jackson uses in the first encounter with the island natives, but most of the issues you have raised here are non-issues, given the fantastic premise of the film. If you want it to adhere stictly to the limits of reality, there would be NO 25 foot ape!"
    },
    {
      "rating": "10",
      "text": "I am very critical on movies and they need to really blow me away before I start saying good things. To describe this movie in words just does not make sense. It is a visual feast to say the least. It is filled with emotion and honesty. The depiction of Kong's personality is endearing. The movie frightens, humours, saddens, but most of all, entertains beyond belief. 3 hours never felt this short. A movie for people who will never grow up and who will never stop believing in incredible fantasy. Films like these are the reason I go to the movies."
    },
    {
      "rating": "5",
      "text": "At least an hour too long. Good performances from all actors, and special effects - but I was completely bored by this stage."
    }
  ]
}