{"id": 1023, "title": "Kingsman: The Secret Service", "starring": ["Taron Egerton", "Colin Firth"], "runtime": 129, "genre": ["Crime", "Comedy", "Action", "Adventure"], "description": "The story of a super-secret spy organization that recruits an unrefined but promising street kid into the agency's ultra-competitive training program just as a global threat emerges from a twisted tech genius.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/ay7xwXn1G9fzX9TUBlkGA584rGi.jpg", "categories": {"plot": 7.9523809523809526, "acting": 8.142857142857142, "ending": 7.0, "soundtrack": 8.5, "cinematography": 7.5, "familyFriendly": 3.0, "funny": 8.172413793103448, "action": 8.510204081632653}, "reviews": [{"rating": "10", "text": "Kingsman is the most lavishly violent, sleek and funny spy movie that I have ever seen. Colin Firth is brilliant and newcomer Taron Edgerton was great in the supporting as well. Samuel Jackson made the perfect villain. One of my favorite directors- Matthew Vaughn,  is at the top of his game. The fight scenes are perfectly choreographed, and the comic element is top notch. This is a movie that you will die to see again after walking out of the theater. Ignore the Fifty Shades that stop you from getting to the theatre, watch this movie."}, {"rating": "7", "text": "Although I enjoyed myself, I do think the film had some issues. The fast edited fight scenes go on way too long, it's really violent, and the film can't really decide if it's an all out comedy or drama. At times it has \"Airplane\" type of humor, like it's making fun of the spy genre, and other times heavy on the drama. At one point they even poke fun of product placement in movies with McDonalds, again showing the \"Airplane\" style of satirical humor.  Somehow it all worked for me mainly due to the spirited acting by everyone involved. Not really a film I would desire to see again but fun for an afternoon."}, {"rating": "7", "text": "Alright be careful when you watch this movie. Stay away from having that 007/hardcore secret agent mindset and loosen up because there's plenty of comedy peppered in. I first want to say that Colin Firth was a good choice and I expect alot of good work from him. Also, it almost seems like a gimmick that Samuel Jackson was portrayed but he DID NOT disappoint guys.  I didn't really pay attention to the music this time but like I mentioned earlier don't expect the trademark 007 stuff.\r Let's talk about the comedy real quick. I didn't laugh much at all and the movie really laid out a lot of forced humor. So them trying to impress me and sway me from focusing on the movie and its holes....Nooooo sir, I got my eye on you sneaky screenwriters.\r The action and choreography was solid, and I do think it could've been a lot better as it relied on technology alot to wow the audience. One thing I liked is the historical context and detail to current events and this movie did that so I appreciate that. I would like to write more about certain holes iin this movie maybe in the plot or the character development but I want people that have not watched this to read this first.\r You're going to have a good time watching this and I recommend watching it with a friend. The directing and camera is above average so if you're into that aspect of film, be prepared to be pleased."}, {"rating": "7", "text": "Tonally and thematically this film is more than a bit of a mess, but that doesn't keep it from being steadily entertaining. With its more hit than miss humor, hyper-stylized and choreographed violence and a solid performance by Colin Firth, it's got enough going for it to distract the viewer from its shortcomings."}, {"rating": "9", "text": "One of the most bonkers, stylish, and fun spy/comic book movies I've ever seen. The church scene is an all-timer, and this is all around just so much fun and very clever."}, {"rating": "8", "text": "It's Fun, a little heavy handed in comedic delivery, but it's action sequences are cool and very well shot. If you want to see a movie where you walk out and think... that was a good use of time and $$$ just for some action fun, then this movie won't disappoint."}, {"rating": "8", "text": "Stylish in more ways than one. The film is a ton of fun while being just unconventional enough to feel refreshing. Based on the awful lineup of trailers shown preceding this film, I'd wager this is best I'll see in 2015 until Avengers 2."}, {"rating": "8", "text": "A cross between Kick-Ass and Bond, which fans of the former will certainly enjoy, Kingsman maintains a great pace throughout with a number of excellent action sequences as well as a darkly humorous streak."}, {"rating": "8", "text": "An uproariously funny spoof of James Bond films, filled with lots of big laughs and plenty of tongue-in-cheek humor. While this film may not be for the squeamish, those with an offbeat sense of humor will appreciate the raucous nature of its over-the-top spoofs, many of which are set to perfectly chosen rock classics. Rock on, dudes."}, {"rating": "8", "text": "With Kingsman Matthew Vaughn does for the spy movie what he did for the superhero movie with Kick Ass. An over the top action film that will have you gasping and laughing in equal measure. Vaughn's masterstroke is casting Colin Firth as the hero spy and having him kick ass in a way that we have never seen before. There are amazing stand out sequences (the church, the pub, the Land Of Hope And Glory finale) but what makes the film work are the little touches and the clever references to spy films of the past. The one bum not is a final joke that seems woefully out of place, but up to that point the film got virtually everything right"}, {"rating": "8", "text": "While some of the humor isn't for everyone I thought that the blend of spy film and comedy worked very well.  One could poke holes in the plot however the acting was quite spot on, reminded me of a modern Snatch based around a spy instead of boxing promoters. For any fans of witty and sometimes vulgar humor and casual action fans this is a must see."}, {"rating": "8", "text": "The plot might not be the most original plot of the year, with the promising street kid as the underdog and the twisted tech genius as the baddy, but it's a Matthew Vaughn movie. Quantity wise Vaughn's films might not be much - even though directing five movies in 10 years is impressive in my book - but the quality of his films speak for themselves.\rKingsman: The Secret Service is no exception to the rule, it's thrilling, fun, and has that Matthew Vaughn touch written all over it. He made a movie using extremes and opposites. It's classy with a bit of filth in it, funny but also serious, a real treat. It's a well made, nicely paced adrenaline rush of an action film that has a James bond movies flair. They modernized the spy genre and mixed with a drop of comedy. The action scenes are amazing, beautiful to watch well choreographed and fun. As violent as it may be, Kingsman wasn't gruesome or tiresome despite the massive body count.\rThe actors did a great job, Colin Firth as an action star is badass and awesome, Mark Strong is surprising, Jackson is an interesting villain, and Taron Egerton is smooth in this role. But I am commanding Matthew Vaughn for his work, because this somewhat cliché plot feel original, it's done in such a unique way. Matthew Vaughn - and his team - took everything we've seen, again and again, but added a twist. So every time there was a cliché, something we expected, there was a little twist and that made it not quite what was anticipated. It kept us on our toes and made the movie a good roller coaster ride.\rFun fact, one of Colin Firth's aliases in the movie is DeVere Vaughn's real name.\r @wornoutspines"}, {"rating": "8", "text": "Fantastic, unexpected, jubilant and occasionally ridiculous fun. The performances are well executed yet a little odd, the dialogue is great and the storyline is absolutely compelling and thoroughly engaging. I wasn't sold until around twenty minutes in, when I found myself laughing with disbelief at the sheer joy with which the film treats the genre. Masterful choreography and cinematography mean the action sequeces are delightful, and whilst there are a few moments which fell flat, overall this is a really enjoyable experience and a lot of fun at the cinema. 8.02/10"}, {"rating": "7", "text": "\"Kingsman: The Secret Service\" sometimes wanders around too much with a excessive, light-hearted buoyancy that undermines the seriousness of the spy genre, but the choreography and action scenes does give the audience a decent worthwhile watch."}, {"rating": "7", "text": "Not bad overall. Unexpectedly lighthearted nature of the characters for the level of violence. Violence was over-the-top, fast-paced, almost cartoon style with everything sped up. I give it a 7 because the story was alright and the movie was fun to watch. Probably recommend a rent if you haven't seen it."}, {"rating": "7", "text": "It's not a movie to be taken seriously, but it is fun. It's also quite violent. It's a bit of a James Bond send-off, with even more over the top action, and occasionally funny gags. The sense of style imbued by Colin Firth and the movie's ubiquitous high fashion (the secret agents pose as high-end tailors) elevate it slightly from a typical popcorn movie.\r There are also some odd real-life parallels, from a murderous henchman with blades for legs who was at one point to be played by Oscar Pistorius, to a presumably unintentional Kim Kardashian reference at the end.\r Eyes may roll at the manufactured stakes, the racial dynamics, or the movie's lone child being conveniently spared from its climactic bloodbath, but it's all in good fun."}, {"rating": "10", "text": "I just loved it. Fast-paced, funny and extremely entertaining. Can't help but reading some of the critics's negative reviews and being: \"Like, what the f`? on which planet do they live on?\""}, {"rating": "10", "text": "What is wrong with these critics? The movie is fantastic. Firth kicks ass which I did not expect at all and the main villain played by Samuel L Jackson is genius. A comical, kick ass film that I would happily watch again and again and again."}, {"rating": "8", "text": "Director Matthew Vaughn continues his stylish and fun film making in the vein of Kick Ass.  There is not one bad performance here and to see Colin Firth out of his comfort zone was great.  This is just a real fun time at the movies.  A-"}, {"rating": "10", "text": "Vulgar, offensive, and the opposite of politically correct.\rIn other words, everything I like! I had a blast watching this film, and hopefully so will others.\r Kingsman: The Secret Service is totally upfront in it's lewd (yet strangely classy) style, and I think even one who found no enjoyment watching the film could respect this quality. Chances are you'll be able to tell whether or not this film is for you by simply taking a gander at one of the trailers. If you think it looks interesting, you'll like it. If you think it looks bad, then... Well, you get the idea."}, {"rating": "10", "text": "Awesome all out amazing fun, fast, smart, funny, everything an action movie should be. Critics clearly forgotten how to enjoy a film and not over think it."}, {"rating": "8", "text": "Well-shot, well-edited, and well-acted, Kingsman: The Secret Service is the first great movie of 2015. It parodies classic spy movies like James Bond, yet shows its appreciation for them at the same time. Some scenes seem unnecessary (the church scene was something out of a Tarantino movie on steroids), but overall the movie works."}, {"rating": "6", "text": "At first it is a fun twist and update to the Bond brand of spy genre.  But when the unexpected violent Tarantino church scene happens, the movie takes a sudden lurch into a completely different area altogether.  It tries to regain its light and fast paced momentum when the good guys decide a genocide of their own is the only option.  Suddenly we are in an Austin Powers movie with heads exploding into colorful fireworks and pretty clouds and musical anthems playing in the background.  The movie did not seem to know what genre it was in or how sensitive to be to death and gore.  This non commitment to a theme left the movie feeling somewhat schizophrenic.\rThe saving grace of the Kingsmen were its actors.  Firth is always on point and delivers an outstanding character.  Jackson, however, was the real surprise here.  Stepping out of his box for this role and giving us a goofy guy we could love to hate.  Boutella's character was worthy of any Bond villain/ henchmen in the history of the genre.  She made the film exciting!\rThe story was decent, it just could have done without the violent mass murder church and Austin Powers genocide tangents. They had a fun old school plot, that was well executed in a modern high tech way.  But in the end I'd say I've waved off more folks than I've encouraged to go see it.  The unexpected violence of the church scene  was just off putting!"}, {"rating": "10", "text": "okay i freaking loved this movie so much, i don't know why theres as much bad reviews as there is because it was so awesome okay. like literally, the action sequences were so well executed without shaky-cam, and for Taron and Sophie being an actors that are just starting out, I think they did amazing.  OKAY IT WAS AN AMAZING FREAKING MOVIE 10/10, WOULD RECOMMEND."}, {"rating": "10", "text": "Matthew Vaughn is one of the best film makers I've ever seen. This movie is all that kick ass was and more. The soundtrack was great, the grotesque fighting was like something straight out of a comic book, and the comedy was hilarious. Matthew does fighting in a way that doesn't make it gross or distasteful. I believe that every one should see this movie right away and decided for yourself."}, {"rating": "7", "text": "This snappy, somewhat satirical spin on the spy genre features Colin Firth as an elegant, but skilled agent of a secret international organization. He gets to be sophisticated, while kicking ass. He recruits a rough, but promising new kid (Taron Egerton) into the agency, just as the inevitable evil genius (Samuel L. Jackson with a lisp) threatens to save and ruin the world. In addition several flashy fights and some cool concepts, there's a spirited script that ramps up the fun. Through it all, director Matthew Vaughn keeps the attitude upbeat and the pacing brisk."}, {"rating": "10", "text": "Absolutely superb film, absolutely made up for the current run of staid and moronic Bond films and made me want to turn around and go back in for another viewing.\r Everyone played it spot on, well Mark Strong's accent excluded, note perfect. The action was smart and poetically choreographed and you could actually see what was going on for a change.\r The script was great, made plenty of sense, for once in a modern film I wasn't gritting my teeth at the illogic or plot holes.\r In short smashing job everyone."}, {"rating": "8", "text": "This was Kill Bill meets James Bond on steroids! I was shocked and impressed by Colin Firth action sequences because he's mainly in Oscar worthy type productions. It want be a hyped film except with cult audiences, due to the UK producing eccentric over the top action comedy, but still with class and Hollywood flavor. They always have Bond!"}, {"rating": "10", "text": "Simply put: movie critics can suck my dong; this film is amazing. Best action film I've seen in fifteen years, easily. And probably one of the best spy films ever!"}, {"rating": "10", "text": "Bumping this score up because once again Matthew Vaughn makes another great movie and the so called \"critics\" pretend they didn't like it to try and be hip. This is must see movie so go and do it"}, {"rating": "8", "text": "Like Vaughn's last Mark-Millar-based film \"Kick-Ass,\" \"Kingsman: The Secret Service\" acts as a potently raucous and gleefully subversive commentary on the subgenre it inhabits, without coming off as a straight parody. Also - it's freaking hilarious and a helluva lot of fun."}, {"rating": "10", "text": "Kingsman is the perfect blend of action and comedy.  The film has a very engaging plot with plenty of action scenes to keep any viewer entertained.  There are also a lot of great laugh out loud moments and one-liners in this movie.  I did not go into the movie with high expectations, but I left very satisfied.  Kingsman is an absolute must watch!"}, {"rating": "10", "text": "This movie is simply amazing, truly original, and  I can't think of anything else to say, I guess this isn't the typical commentary you usually see ;)\r10/10"}, {"rating": "7", "text": "This film's occasionally cheap looking CGI, juvenile humour and preposterous situations are all easily forgiven by quick witted dialogue and pitch perfect performances.  Kingsmen revels in its self aware humour, paying homage to the spy movies of old without descending into pastiche.  Like a James Bond film written by a 10 year old boy, it is far more engaging and entertaining than it has any right to be!"}, {"rating": "8", "text": "Less serious than James Bond, (mostly) more serious than Austin Powers. Fantastic as both of them, a refreshing and surprisingly good movie with likable characters."}, {"rating": "8", "text": "I had an absolute blast watching this film! It was funny, unique, and had a great cast. Colin Firth does a great job, as does Mark Strong and Michael Caine. Samuel L. Jackson made for a rather funny villain as well. Overall, the cast is great, the action is over-the-top and entertaining, and it's simply the most fun I've had with a film so far in 2015."}, {"rating": "8", "text": "Matthew Vaughn slams into the world of spy and espionage with Kingsman: The Secret Service, a marvelous 2 hour montage of high octane action, witty dialogue and gentlemen being gentlemen."}, {"rating": "10", "text": "Kingsman turned out to be one of the best well directed movie I've seen so far of this genre. Polishing the old way of British spy movies with li'l bit of comedy and mostly the surprising action with a fresh view. I went to the theater right away at the first show and I have to admit it worth it. Probably might become one of the classic iconic movie of all time of this genre."}, {"rating": "9", "text": "The movie was good. I dint expect it to be a good one but i think it was fun to whats and would recommend it to ppl that want a easy to watch and somewhat action packed movie to watch."}, {"rating": "8", "text": "This movie is just fun from start to finish.\rIt is funny and has the spirit of the old James Bond movies.\rSamuel Jackson is just a great villain.\rAnd the head exploding scene was and is just awesome I have never seen it done like it was all you can do is watch unable to look away and try not to laugh."}, {"rating": "8", "text": "I was shocked with how violent and vulgar Kingsman was after seeing the promo. The film has some great action scenes and you really felt for the characters. You could see that none of them were invincible throughout the movie. I really liked Colin Firth, I think he definitely the best character in the movie. Taron Egerton had a great breakout performance and I think we'll be seeing him in some blockbusters in the future. The one thing was I was a little disappointed by was Samuel L Jackson's performance as the villain. It was just kind of the same performance he always does only he was trying imitate Mike Tyson. Other than that I thought the movie was enjoyable and I hope we see another one."}, {"rating": "9", "text": "This movie takes your typical action movie troupes and twists them in fun and exciting ways. Mathew Vaughn was a great choice for the director, because he's known for over the top, but very fun and stylish action and this movie is no exception. Colin Firth is fantastic in the role and he did a lot of his own stunts, which is something I never thought I'd see from him. The cast also includes newcomer Taron Edgerton, who gives a fantastic performance and I can't wait to see where his career goes from here. And of course, Samuel L. Jackson kills it in the role of Richmond Valentine, a villain who just screams campy, over the top James Bond villain. Overall, the movie is fantastic, and it manages to do a lot of things most action movies just can't get right, giving characters a purpose."}, {"rating": "9", "text": "Director Matthew Vaughn rejuvenates the spy genre with the gleefully over the top Kingsman: The Secret Service, a comical adaptation of Mark Millar's graphic novel that never let's go of humour and still delivers fast paced thrills."}, {"rating": "8", "text": "I had an absolute blast.  Kingsman is witty, fun, explosive, loud, and unapologetic.  It definitely takes things too far in the best of ways.  It feels cheap, but it plays to that weakness and makes it an advantage.  I'm looking forward to the sequel."}, {"rating": "9", "text": "This comic adaptation is full of hyper-stylized action sequences, graphic violence and smart humors that thrill the audience to feel unstoppable for 130 minutes of mission insanity. Though with the predictable core story, it does surprise with some plot twists for the second half and director Matthew Vaughn manages to overcome the short with well constructed plot without any drags, exciting old school action cinematography, stylish commercials fun of Guinness and McDonald as well as great electronic mix of scores by Henry Jackman and Matthew Margeson. The performance of the cast is perhaps one of the major factor that the film is extremely entertaining, it gathers four Kingsmen - Colin Firth, Mark Strong, Michael Caine and Samuel L. Jackson, in which each of them represent the characters that they are not used to be in other recent films, while it is also undeniable that young potential actor Taron Egerton sparks in his character as Eggsy too. With a super villain, this young James Bond spy genre looks high standard, smart, exciting and definitely the only great film to opt for this Valentine Day."}, {"rating": "8", "text": "This is essentially a fun, modernized, homage to the 60s bond films. However, do not confuse this with the old bond films it's far crazier than any bond film i've ever seen. All in all Samuel L. Jackson and Colin Firth are great. So if you've ever wondered what that would be like this is your film."}, {"rating": "8", "text": "This is not bad,it's good! The really enjoy the film with it's cool action and a funny spy movie.The film has some issues and plot holes but still love the film.It is enjoyable action spy movie with Violence on top of it."}, {"rating": "8", "text": "Kingsmen: The Secret Service is an action packed thrill ride full of exciting fight scenes, some great characters, and a very smart script. It's funny, brutal, and just a great watch."}, {"rating": "8", "text": "The movie is great! Although violent at some parts, it still was awesome! Colin Firth and Taron Egerton we're terrific. The movie appeals to me a lot, I definitely recommend it!\r Luke S,\rRelationzReviews"}, {"rating": "9", "text": "Highly entertaining and loads of fun, 'Kingsman' is truly a refreshing parody of spy films and certainly a refreshing movie within the genre itself. In the years of bad to mediocre (at best) parodies, 'Kingsman' offers all of the classical elements of the genre but also add something new to the classical elements. Filled with effects, a surprisingly high quality of acting (Firth, Jackson and Strong are absolutely brilliant) and a vast amount of comedy, 'Kingsman' is a new James Bond version that surpasses all of the parodies that have used spy movies as a basis.\r Certainly something to be watched!"}], "recommendations": ["copshop", "last_action_hero", "american_ultra", "the_losers", "deadpool", "boss_level", "the_rundown", "the_suicide_squad", "the_fifth_element", "deadpool_2", "thor_the_dark_world", "sherlock_holmes_a_game_of_shadows", "indiana_jones_and_the_temple_of_doom", "snatch", "the_mummy", "true_lies", "the_a_team", "the_green_hornet", "the_nice_guys", "thor_ragnarok", "desperado", "kung_fu_panda_2", "gangster_squad", "red_2", "hercules"]}