{"id": 2142, "title": "Kingdom of Heaven", "starring": ["Orlando Bloom", "Eva Green"], "runtime": 144, "genre": ["Drama", "Action", "Adventure", "History", "War"], "description": "After his wife dies, a blacksmith named Balian is thrust into royalty, political intrigue and bloody holy wars during the Crusades.", "releaseYear": "2005", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/uk55nBEFIQFveIiy9jvLGiVtk4h.jpg", "categories": {"plot": 7.975, "acting": 7.837209302325581, "ending": 7.5, "soundtrack": 8.75, "cinematography": 8.666666666666666, "familyFriendly": 3.0, "funny": 5.0, "action": 8.285714285714286}, "reviews": [{"rating": "6", "text": "Jesus sooo bad!!! But the end of the movie is quite good just a little ... Spoiler: Without training, the blacksmith will be a professional swordsman and then a fearless warrior. It would have been at least a few years of training ... In the end, instead of a completely unambiguous solution, in the name of some imagined purity (holiness), he successfully - indirectly - successfully sends all the knights to their deaths. But no problem, then the commoners will become knights as he became and they will definitely become great warriors without training XXXDDD"}, {"rating": "10", "text": "I originally saw the Kingdom of Heaven theatrical release first, and my opinion of it was mixed, much like how I feel about Ridley Scott's Robin Hood.  The film seemed poorly edited and was missing something.  Then came the Directors Cut and it all made sense.  Americans were robbed of an excellent story once again due to low expectations on what the general public would like.  Whether or not his is true is another story all together.  What I feel is true is that the directors cut elevates the movie to something more than another action story.  It adds so much more to the dynamics of the characters, fleshing them out in much greater depth and detail, and providing more of a connection from one character to the next.  The stories protagonist, Balian (played by Orlando Bloom) is a mixture of several different personalities from the period, but his view of the world at the time could be considered very tolerant/progressive.  Bloom carries his role well, playing him as a reluctant \"hero\" who is more practical, preferring to rely on his mind as well as his fighting prowess.  He tends to fall in line more on how the ideal knight, sans the arrogance, would act if he actually defended his oaths.  He gets a lot of flack for this role for some reason, but I feel he fit very well.  The rest of the cast is very well thought out, with Eva Green skillfully playing the role of Sibylla as a strong, intelligent woman who understands all too well what must be done to maintain power.  Her character is probably one of the most tragic ones in the story, although the list of those is pretty long.  Jeremy Irons portrays the grizzled and cynical veteran Tiberias, who does some chewing of the scenery, but not in the bad way as far as I'm concerned.  His character is probably one of my favorites, as his expressions and manner of his delivery is perfect for his role.  There are very few characters that I did not appreciate in this one, but needless to say it would take up a lot more text.  Liam Neeson, Edward Norton, Marton Csokas all do excellent jobs in their roles as Balians father, King Baldwin IV, and the comic book villain that is Guy de Lusignan.  The three that stood out the most for me were Ghassan Massoud as a very honorable and respectful Salah'ad-din, Brendan Gleeson as the vicious but entertaining Raynald de Chatillon, and finally David Thewlis as the Zen-like Hospitaller.  Ridley Scott is one of my favorite directors of all time, and this movie definitely displays why.  This movie is awash in his trademark visual aesthetics (gorgeous color palettes, the ever present snow flakes fluttering about, etc), excellent writing, and some of the best music I have ever heard in a movie.  Any movie.  All in all he weaves together a very complex, but not entirely historically accurate, story between the second and third Crusades.  As much as the trailers would have you believe it, this is no action movie.  The pacing is good but sometimes on the slower side, and if you live for constant scenes of blood and violence, then you will be disappointed.  Kingdom of Heaven is a glimpse back in time through the eyes of Scott and Monahan and they did an amazing job."}, {"rating": "10", "text": "\"What man is a man if does not make the world better\"\r those signed words on the smithy touch my soul every time i watch this epic film.\ri regret i didnt go to watch it to the cinema, though in home still is a very good movie to watch.\rthe phography is beautiful, the cast is amazing, the dialogs are deep and well done. the action is intense in a very good way, you dont see favoritism for the muslims or the catholics.\rbalanced.\repic.\rAfter watching it i have learn what it takes to be a real knight."}, {"rating": "8", "text": "While Balian as a central character is under developed, Bloom did a fairly good job with what he had to work with. His rise to becoming a \"Perfect knight\" doesn't seem palpable enough, it would've been good to have seen him make a few mistakes, or perhaps take an action that has a consequence greater than he first anticipated. The themes running through the film are all good themes to work with, and the film definitely tries to analyse them, but it does take a couple of re-watches in order to figure them out completely, which I think is good. I gave The Dark Knight praise for doing that, so this gets praise too. The themes of Balian attempting to be an incorruptible knight seeking redemption for his sins (by committing none in the Holy Land) worked quite well, even though at times it seemed like he was sticking to his principles a bit too much. I think it was a good twist how Balian refuses to commit a little evil for the greater good by having Guy executed, however Seyblla, who is willing to commit a little evil for the greater good eventually dooms the kingdom by doing so. In a sense, they're two sides of the same coin.The film also highlights the other reasons why people went on Crusade. Its so universally believed now that the Crusades were just about religion and nothing else, as is the recent wars in the Middle East, that people forget about the commercial aspects of the Crusades. It's no secret that trade between Italy and the Crusader States helped to fester the Italian Renaissance by bringing massive wealth, and it was also no secret that Pope Urban who initiated the First Crusade, stated that the Holy Land was a land that \"floweth with milk and honey\". People were attracted to the Middle East because there was a great deal of riches there, and the film definitely brings out the fact that in the end, religion is just an overtone, while at the core, they're only fighting for betterment of themselves; something which Balian does not wish to do. In terms of cinematography, the movie is beautifully shot and edited, and highlights Ridley's signature big sweeping shots. The battle scenes are all well done and frighteningly realistic. The acting is also to be commended, mainly for Edward Norton, Jeremy Irons, the always great Liam Neeson, Alexander Siddig and Massoud (I really hope that's the right one), who portrayed Saladin. In all a good movie, that could've been helped here or there, but definitely worth a watch nonetheless."}, {"rating": "10", "text": "In my opinion, Kingdom of Heaven is one of the most underrated movies I have come across. It is one of my favorite movies of all time and receives very little attention compared to its bigger brother, Gladiator. The extra scenes in the Director's Cut explain the story considerably better. Although more loosely based than we'd care to admit, the time period of the Crusades is an awesome atmosphere that I am surprised is not utilized as much in film. I found Orlando Bloom actually a decent actor in this one and the film has one of the best soundtracks in a movie."}, {"rating": "7", "text": "Watch the Director's Cut. The theatrical release was a disjointed mess skewed by bad editing and money-hungry last-minute changes."}, {"rating": "8", "text": "I liked Kingdom of Heaven, but had a few things that I disliked.  I loved all of the fight scenes, they were beautifully done, also as a history buff I liked how to showed some intelligent knights are torn on if this is right or not.  What I disliked the most was the fact that they praised and criticized both Muslims and Christians.  It was like a roller coaster.  The producers were trying to please everyone which hurt the movie."}, {"rating": "1", "text": "Ridley Scott tries to rehash the same grandiose style that did him well in 'Gladiator' for the pitiful 'Kingdom of Heaven' but the terrible script/screenplay leaves no room for the viewer to have any interest in either the surplus battle scenes, the undeveloped characters, or the nonexistent plot. And as far as acting goes, Orlando Bloom is to Russell Crowe as Shia LaBeouf is to Harrison Ford."}, {"rating": "3", "text": "Lightweight plot, the absence of dialogue, and an emotionless protagonist made this one movie I had to turn off before finishing. Too bad - it's a subject I would have enjoyed seeing brought to life on the screen."}, {"rating": "5", "text": "Ridley Scott should take lessons in how to use action scenes to aid character development from Peter Jackson. 'Kingdom' drags to a crawl too often. The only effective scenes in 'Kingdom of Heaven' are the siege scenes you've already seen in L.O.R. Overall, a 'Kingdom' of a disappointment."}, {"rating": "2", "text": "Disjointed and incoherent. Their is not enough time devoted to develop the characters. Furthermore, some of the battle scenes seem intent on showing violence by have blood spew across the screen. The problem, it looks just plain silly. I really think this should have been two movies to give time to develop characters, or it just shouldn't have been made at all."}, {"rating": "2", "text": "Other than Saladdin and his army the rest of the movie is another Hollywood piece of crap. The History Channel did a much better job telling this story. It also has better actors."}, {"rating": "10", "text": "The director's cut of Kingdom of Heaven is an absolutely phenomenal film. Visually, Ridley Scott pushes the boat out past even his high standards. Kingdom of Heaven is one of the most beautiful looking historical epics ever made. It's also emotionally engaging, superbly acted and informative. Just make sure you're watching the director's cut and not the muddled theatrical version."}, {"rating": "4", "text": "Watch the directors cut. I saw kingdom of heavens when it was release in the cinemas and was very disappointed. Then I watched the directors cut and I was surprised how it turned out to be a good movie. Nevertheless when you judge the movie by its cinema release its average."}, {"rating": "10", "text": "Epic, again a Ridley Scott masterpiece with lots of depth and a message of knighthood, something clearly lost and not in the flavor nowadays. I strongly advise watching this movie and again critics must have been sleeping....they are wrong."}, {"rating": "7", "text": "I saw the director's cut while it was long, it is hard to imagine the theatrical version after seeing what they originally planned to release. Yes, it was slow at times, but everything included was definitely important for the story and having things make sense. Now, in terms of the film, it is gorgeous in many respects. First, the cinematography is great. The sets are also beautifully put together and they really chose a great location for filming this one, as it provided many beautiful images. In addition, the soundtrack was perfect. Often times, I do not notice a film's soundtrack, except when it was very good or very bad, and this one was great. Finally, the battle scenes were very well put together. They were certainly violent, but for the most part, beautifully filmed and choreographed.The acting was also solid, in particular from Edward Norton. He had a very small role, but had a really commanding presence here and killed it whenever he was speaking. Brendan Gleeson and Jeremy Irons were also very good here. Orlando Bloom and Eva Green were mostly good as well. Really, the only things holding this one back for me were the pace at times. While, for the most part, it was very interesting and moved at a steady pace, at times it slowed down to almost a crawl. If those could be picked up a bit, this one would be better. Another negative would be the script. At times, it was absolutely cringeworthy, at others it was serviceable, and at others it was pretty good. However, it certainly left a lot to be desired at times."}, {"rating": "9", "text": "The crusades are a fascinating historical event. This movie will give you a little peek of the history, the madness and som of the history that lies behind the conflict today. I've red a book about Saladin and why he let the christian leave Jerusalem. It was not because of Orlando Bloom, but because he thought it might create peace. He was mistaken, the knights reorganized and fought back. If you like this movie, check out the Swedish movie Arn"}, {"rating": "10", "text": "I don't know what it is with Ridley Scott films, but his director's cuts are vastly superior than theatrical versions. The director's cut is the only version of this film I acknowledge and it is one of the greatest movies of all time."}, {"rating": "9", "text": "It was a very good movie and the director tried at least to show a good picture of the two sides of the battle. But, it would be better to choose other actors for the Muslim side to be more impressive. The actor of Saladin was not very good for this role."}, {"rating": "8", "text": "Kingdom of Heaven is a really good movie. The plot is somewhat historically accurate and does a great job portraying what the crusades were like. I would highly recommend this movie."}, {"rating": "7", "text": "Pitifully great... while not as great as I wanted it to be, but it exactly works alright. Kingdom of Heaven uses those 144 minutes to remind me how much torture they had to go through in this film."}, {"rating": "8", "text": "“Kingdom of Heaven” navigates through the minefield of the Crusades and, by extension, the contentious background of Christian-Muslim relations in ways both shrewd and calculated. Genuinely spectacular and historically quite respectable, Ridley Scott’s latest epic is at its strongest in conveying the savagery spawned by fanaticism, as well as in creating a convincing view of a late 12th century when East and West co-existed, then came to blows for neither the first nor last time. Dramatically, however, there is a vaguely programmatic feel to the drastic upward mobility of a simple French blacksmith to the ruling echelon of the Latin Kingdom.\r The notion of basing a $140 million Hollywood production on the most calamitous episode in the joint history of the world’s most dominant religions — and at a time like this, no less — would run the gamut from unlikely to sheerest folly in the minds of cautious industry execs.\r But Scott and screenwriter William Monahan have craftily solved most of the thorny problems by beginning their tale toward the end of the nearly century-long truce that followed the Crusaders’ bloody conquest of Jerusalem in 1099; correctly pinning the lion’s share of the blame for reigniting hostilities on a couple of rash Christian belligerents; making the Muslims look good in comparison by more thoroughly detailing Frankish deviltry and, perhaps most importantly, bestowing the most sympathetic characters with an anachronistic post-French Enlightenment humanistic attitude that, while not denying God, at least suggests a desire on their part to take an extended vacation from doing His fighting.\r In this respect, pic may irritate traditionalist Christians more than it will Muslims, who can delight not only in the ending, but in the hugely noble, if one-dimensional, portrait of the legendary warrior Saladin, strikingly impersonated by Syrian actor Ghassan Massoud.\r But once all the intricate historical needle-threading is said and done, it’s the story that counts. First-time scribe Monahan has done quite an adroit job merging fact with fiction, shifting and adjusting certain elements to streamline and augment the drama but never betraying the subject matter in a way that remotely recalls the Hollywood approach epitomized by Cecil B. DeMille’s laughably inauthentic 1935 epic “The Crusades.”\r There really was a Balian who led the doomed defense of Jerusalem in 1187, but he was not the ordinary bloke vaulted to lofty rank played here by Orlando Bloom. Brooding over his wife’s suicide after the death of their son, this Balian is shaken from sullenness by the arrival in rural France of imposing knight Godfrey of Ibelin (Liam Neeson), who informs the youth he’s his father and beckons him eastward.\r Ruled by a wise Christian king, frail leper Baldwin IV (beautifully voiced by Edward Norton from behind a sculpted silver mask), the domain is further dominated by Baldwin’s comely sister, Princess Sibylla (Eva Green); her snaky husband Guy de Lusignan (Marton Csokas), and the latter’s warmongering cohort, Reynald of Chatillon (Brendan Gleeson).\r Balian finds more natural allies in Tiberias (Jeremy Irons), a peace-minded and pragmatic military expert, and the Hospitaler (David Thewlis), a court counselor who has also seen enough fighting for one lifetime.\r With all these colorful and intriguing characters circling around, the one in the center, Balian, looks bland by comparison. He seems uncomfortably like a reactor instead of an instigator, a consciously concocted Everyman designed for audience identification who has greatness thrust upon him.\r Narrative contains significant gaps, notably in the romance, Balian’s adoption of his new home and especially in his rapid assimilation of military savvy. (Indeed, Scott is on record as saying his definitive cut of the film runs 220 minutes, a version he claims will be released on DVD.) Suddenly, after Reynald has outrageously provoked Saladin by attacking a Saracen caravan for no reason, it is Balian who warns in vain against Reynald and Guy’s ludicrous decision to take on Saladin’s army at the broiling Horns of Hattin, a miscalculation that made Jerusalem’s fall inevitable.\r Scott is content with one-dimensional villains, and Gleeson and Csokas indulge him with bluster, glares and dismissive put-downs that are both delicious and far too easy.\r With CGI work improving all the time, the mix of live and computerized elements creates numerous extraordinary canvases of virtually seamless quality. Harry Gregson-Williams’ score emphasizes the uniformly solemn tone of the proceedings while mixing in such diverse sounds as traditional and liturgical songs, Arabic and world music and, most surprisingly, bits from “The Crow,” “Blade II” and a piece by Jerry Goldsmith called “Valhalla.”"}, {"rating": "8", "text": "Firstly, don't bother with the theatrical release, go straight for the director's cut. It's an hour longer, but so much more is explained, the characters are more fleshed out, and the pacing actually feels natural rather than jarring.There is gorgeous cinematography, well choreographed fight scenes, excellent acting, and detailed sets, which is all let down by several inexplicable historical inaccuracies. Not a perfect film, but a very good one that's worth multiple viewings."}, {"rating": "10", "text": "The movie is a fascinating look at at a fascinating historical period. It really focuses on both sides of the Crusade, and looks deep into the motives that caused it. An epic film."}, {"rating": "10", "text": "Excellent piece. Balanced and moving."}, {"rating": "5", "text": "I don't know why everybody likes this movie. The story line sucks, the acting is wood, and the action scenes are not up for the task. It is way over rated so I think 5 is very generous for it."}, {"rating": "10", "text": "Good movie."}, {"rating": "4", "text": "Literally put me to sleep. First hour plods along at snails pace - plot is disjointed and the scripting is bland."}, {"rating": "10", "text": "Great movie dont get what all those arses are talking about but who cares about them still orlando Bloom was amazing in this movie great movie suggest it to anyone cant wait for DVD."}, {"rating": "10", "text": "A spectacular canvas that outshines previous spectacles as Braveheart and Gladiator by a mile. The acting from the whole cast is marvelous especially by Edward Norton, Ghassan Massoud and Liam Neeson. Also, Orlando Bloom finally grows up in his acting and gives a very good performance. I give Kingdom of Heaven a strong 10."}, {"rating": "9", "text": "in years to come people will notice how detailed and well crafted this movie is. The love and effort put into making this film is unbelievable this will be remembered as another Blade Runer and i think it would become another cult classic Ridley Scott , pure genius just ignore the hollywood 'critics', this is Art, not a product!"}, {"rating": "10", "text": "An Epic and visual masterpiece. Authentic costumes for the period, breathtaking settings, great characters and actors. Those critics who gave low scores...just look at the names...I rest my case."}, {"rating": "4", "text": "This movie never really moved. It never climaxed or ended. The movie sequence and lack of acting skills(notwithstanding Liam) just kep this film at a monotone pace. Very disappointing!"}, {"rating": "5", "text": "Produced on a grand scale, Kingdom of Heaven is a lumbering sometimes confusing spectacle. Surely, the fortune spent on it could have been used to finance a dozen scripts more worthy of coming to the screen. Orlando Bloom, while giving a generally decent performance, is way out of his depth here and not capable of carrying the film."}, {"rating": "9", "text": "This movie was the definition of epic. It bored me, it was predictable, everything was big and the action was hard to follow, an effeminate man was cast as the lead... everything you could want. I honestly don't know why they made this movie after King Arthur, Troy, and Alexander all bombed."}, {"rating": "10", "text": "It is a perfect film ? have ever watched."}, {"rating": "5", "text": "It started off with a good balance, then it got confusing as well as boring. William Monahan's writing was the only good thing about it. Ans also, bad casting, Orlando Bloom fits as a charming romantic character. But in this he's just, bad."}, {"rating": "6", "text": "The best version of this film is the Directors Cut. Its adds 45 mins extra and is worth every second. Directors cut is a 10/10. This version misses too much and spoils the navative."}, {"rating": "9", "text": "Terrific movie. The acting was great by everyone, even Bloom who is unfairly getting criticized by some. Truly epic story-telling and filming."}, {"rating": "8", "text": "Quite an interesting piece of history, great cast, great photography."}, {"rating": "8", "text": "Starts off somewhat clunky, but once the main point gets moving, it's well on its way to greatness. There's just enough action, but the movie transcends that genre: it becomes an epic about fighting for what's REALLY right. Surprisingly, the movie's also even handed, not putting a bad face on either religion, just on the ones that abuse them. Wish there was one more battle scene in the middle, to even the pacing out a bit, and that camesra work and choreography in some fo the action were more engaging, but otherwise, a good unique movie about the issues of today."}, {"rating": "10", "text": "This is a great movie. Ridley creates an incredible world, and Orlando in habits it with understated finesse."}, {"rating": "8", "text": "This movie is an epic in every sense, especially the director's cut version (45 minutes longer). The is visually incredible with a a score to only make it more outstanding. The acting is very good too with Liam Neeson, Eva Green and Ghassan Massoud (Saladin) all being excellent. Edward Norton's King Baldwin IV carried a great weight in the film and was one of the best parts of it. And of course I should mention Orlando Bloom, who will probably pleasantly surprise many who watch the movie. His performance had many good things to it. A blacksmith who by way of his father's nobility and land can become a great knight in Jerusalem, Bloom was definitely solid. I understand many critical of the movie would have liked it to be a bit \"madder\" in terms of how it presented the crusades, but reading the Ridley Scott and William Moynahan (writer) wanted to retell this story by a fictionalized account with a bit of a exaggerated benefit of the doubt to peace. I think this movie had much of what an epic should be. Perhaps not quite a Braveheart, but compares to Gladiator and has a sense of purpose and epic story-telling that set it in a higher class than Troy and 300 when comparing \"sword-and-sandal\" epics."}, {"rating": "5", "text": "Fairly plodding and confused, visually impressive but dramatically unsatisfying."}, {"rating": "6", "text": "On the one side the setting of the movie is great, because  there are not many new epic movies about the middle age. Also the siege of Jerusalem was nicely done and there are popular actors. The effects are very good, many pictures are beautiful and the details are great thanks to a big budget.But I dont like Orlando Bloom, here, he is somehow not sympathetic. His character Balian was also a bit unrealistic, boring and annoying, because it is so one-sided shiny. In addition he was a blacksmith, then farmer, general and fighter...suddenly and without years of training, what a joke. Overall most of the characters were superficial and one-sided, only Saladin was interesting and grey. The story is just average and could have more details."}, {"rating": "9", "text": "Director's Cut - Excellent cast, great script, world-class cinematography - a real classic.  The theatrical version cuts too much out and doesn't allow enough character development, the director's cut adds 45 minutes that helps weave a complete and epic story.  Highly recommended."}, {"rating": "7", "text": "'Kingdom of Heaven' had an immensely talented cast going for it, despite being unsure about seeing Orlando Bloom in an especially substantial lead role. It also looked great from the trailer, and have liked a good deal of Harry Gregson-Williams' work which can be one of the better components of films. Ridley Scott is not the most consistent of directors, his best films like 'Alien' and 'Blade Runner' are brilliant but lesser films such as 'Robin Hood' are really not good (personal opinion of course).There are also films of his that are much better in the director's cut version. 'Legend' is one such example, but the biggest one for me is 'Kingdom of Heaven'. Found it a very mixed bag as the theatrical/ non-director's cut version and found a lot of issues with it (and this is actually forgetting the historical inaccuracies), such as choppy storytelling, erratic pacing and underwritten characters on top of Orlando Bloom and the dialogue. While it is still not a perfect film still in the director's cut version, it is a big improvement and some of what were major problems in the theatrical version are corrected.Not all though. Do still find Orlando Bloom charisma-void and out of his depth, have nothing against him but this role was a meaty one, even more so in the director's cut where he is more complex, and needed a lot of authority and a wide range of emotions and to me Bloom didn't have enough of either.Some of the middle of the film stalls a bit in the pace, the storytelling not always going very far. Although the characters are much more interesting in the director's cut edition, a few of them could still have gotten into more depth such as those with not much screen time still and the same goes with the themes, also did that the messaging at times could have been more subtle.Improvements are many though. The characters generally are far more interesting and better developed, Eva Green's went from one that one questioned the presence of and was hugely underwritten to a well fleshed out character. They interacted more convincingly and not in as stilted a fashion. Despite some aimlessness in the middle, the pace is less erratic and doesn't jump around as much. The story is uneven still, but there is generally more cohesion and less choppiness, more of a sense of resolution with the vast amount going on and for me the contemporary relevance was a good thing.Dialogue flows better and is less awkward, quite intelligent here too.Both editions cannot be faulted visually. It is gorgeously shot with lots of atmosphere and the costumes and sets are stunningly evocative, with the siege especially being quite breath-taking. In fact, the action was very tense and powerful in both versions as well but especially in the director's cut. Harry Gregson Williams' score rouses and also has emotional impact, the director's cut does it more justice and a better job is done complementing everything whereas in the theatrical version it was the case of a great score deserving a much better film. Scott directs everything skillfully which is remarkable considering there was a lot to balance. The messaging and everything regarding tolerance and the historical inaccuracies were much criticised and still are, they weren't as big an issue for me.With the exception of Bloom, the cast are very good. The standouts being an against type Edward Norton who gives a lot of complexity and intensity to his character and Gasshan Massoud showing how to do cool and menacing wonderfully. Eva Green's performance is deeply felt and Jeremy Irons shows a lot of dignity and restraint here.Overall, didn't care for the theatrical version, but this review is namely for the director's cut which is an infinitely better, if imperfect, version and is a fairer way to judge the film on. My thoughts though. 7/10"}, {"rating": "8", "text": "Liam Neeson, Brendan Gleeson, and Jeremy Irons are all wonderful in small, but rich supporting roles, but I have to give a special mention to the film's best character. The Leper King, King Baldwin, is the greatest thing to come out of Kingdom of Heaven."}, {"rating": "8", "text": "The story of how a young blacksmith found himself participating in the Holy Wars, for the defense of Jerusalem, may be questionable in its historical veracity, but its strengths are the battle sequences - already bloody - and the solid cast. Just in case, have a cup of coffee or a nap before watch."}, {"rating": "8", "text": "This film is based on real historical characters and addresses, fictionally, the loss of Jerusalem to Muslims in 1187, after the defeat of the Crusaders at the Battle of Hattin, against the forces of Saladin. Directed by Ridley Scott, the film has a screenplay by William Monahan and the cast is headed by Orlando Bloom, Eva Green, Liam Neeson and Jeremy Irons.The film deals with the crusades from a new point of view. In other movies we see Christian expeditions. In this film, we see a precise moment in history, where Jerusalem, captured in 1099, is lost again. Many of the characters is based, slightly, in real historical characters, as part of the script as well. Although I'm not an expert, it seems a film that seeks to portray things with some historical accuracy. Thus, costumes and scenery seem to have been designed with some care, in order to meet these standards. The script is interesting. Of course, the story is romanticized and not entirely correspond to the facts, but its quite entertaining and holds the audience until the end. The action scenes are excellent, particularly the battles and the final siege, where the fertile imagination of Hollywood left its mark in the original way the siege engines are being put out of action by the besieged. The scenarios are good, representing well what may have been Jerusalem during that historic period.The actors fulfilled their role on a regular basis. Orlando Bloom is equal to himself and Eva Green made some effort to look more oriental, surprising at the end by purposely overshadowing her character in maternal grief. One of the most emotive and memorable characters is King Baldwin IV, played by Edward Norton (who never shows his face in the film). He's the author of some of the most deep, philosophical and meaningful quotes. The soundtrack, written by Harry Gregson- Williams, is very good and merges harmonically sounds of medieval and Muslim inspiration with the traditional film music."}], "recommendations": ["the_last_of_the_mohicans", "troy", "the_assassination_of_jesse_james_by_the_coward_robert_ford", "master_and_commander_the_far_side_of_the_world", "the_man_in_the_iron_mask", "the_great_gatsby", "body_of_lies", "dune", "victor_frankenstein", "conan_the_barbarian", "the_monuments_men", "news_of_the_world", "murder_on_the_orient_express", "close_encounters_of_the_third_kind", "cold_mountain", "nocturnal_animals", "gladiator", "the_godfather_part_ii", "the_patriot", "the_devil_all_the_time", "centurion", "the_last_duel", "the_hurricane", "the_last_samurai", "motherless_brooklyn"]}