{"id": 1763, "title": "King Richard", "starring": ["Will Smith", "Aunjanue Ellis"], "runtime": 145, "genre": ["Drama", "History"], "description": "The story of how Richard Williams served as a coach to his daughters Venus and Serena, who will soon become two of the most legendary tennis players in history.", "releaseYear": "2021", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/2dfujXrxePtYJPiPHj1HkAFQvpu.jpg", "categories": {"plot": 8.222222222222221, "acting": 7.775, "ending": 7.0, "soundtrack": 10.0, "cinematography": 8.0, "familyFriendly": 6.0, "funny": 5.0, "action": 9.0}, "reviews": [{"rating": "6", "text": "At nearly 2.5 hours, the movie ends right at the beginning of Venus' professional career at age 14 -- to say nothing of Serena, of course. While the movie obviously focuses on the father, it felt oddly clipped to end right at the beginning of the career of two sports legends.Smith does an admirable job as Richard, though he occasionally overacts. But you definitely feel and learn about Richard's humanity (the good and bad).The standout in this film is Aunjanue Ellis who plays the Williams mom, Brandi. She is by far the most believable, nuanced character; each of her scenes ground the film in reality. The best scene of the movie is where she and Richard get into an argument about their respective roles in the relationship and their impact on the girls' lives. She drives the scene, and Smith is (wisely) the passenger.Most of the other actors are either too amateurish or too over-the-top. Bernthal's portrayal of coach Rick was disappointingly cartoonish.As a biopic, it suffices, yet I rarely felt an emotional connection to Richard. I realize he was the driving force in the incredible rise of the Williams sisters, but I can't help but wonder if the story would've been more compelling if it were told from Brandi's perspective."}, {"rating": "0", "text": "Will smith playing will smith..who has proved to be an overgrown toddler with serious issues."}, {"rating": "0", "text": "A trash boring oscar bait film, it was really disapoint. This doesnt deserve a oscar best picture nomination."}, {"rating": "5", "text": "Will Smith was unsurprisingly charismatic but surprisingly studied and down-to-Earth, though it’s certainly not the best performance of the year, or even Male Performance (Benedict Cumberbatch).Right off the bat, the score hits you over the head with its fast and subtle beat that constantly plays over the entire film. It can be overbearing, but it’s also nothing special.The movie starts with narration by Will Smith, but never is brought back. It could have just been a quote, but it probably would have been better and less distracting if it was just a written quote stated right before the film.The characters of the sisters of Venus and Serena pretty much had zero character. They were just supposed to be cute and supportive, and nothing else. It’s all ready too long, but they could have edited some parts out to give them some actual personalities.(Also the scene with the “fart joke” was just so stupid, and the “fart” was the most standard, stock fart sound ever)"}, {"rating": "0", "text": "If you love unctuous, sanitised films about stage dads who propel their children to greater things for self-aggrandisement, and that sweep over deeply problematic realities in order to propel a lead actor to Oscar glory, then this is the film for you. Otherwise wait for the film about Venus and Serena themselves, the true heroes"}, {"rating": "7", "text": "This biopic follows Richard Williams as he coaches his two daughters Venus and Serena to tennis superstardom. Through his stubbornness and determination, he shapes them into not just stars but pioneers and trailblazers for young girls everywhere. At first glance, it's a pretty standard biopic, but underneath, it has an unbelievable amount of charm and heart that make it both crowd-pleasing and inspiring. And on top of that, Will Smith gives one of his greatest and most touching performances to date, no doubt placing him as the Oscar frontrunner for best actor this year. At almost two and a half hours, it also takes its time and begins to drag at times, but should win most audiences over with its charm and performances. Overall, it's definitely worth a watch and you'd be hard-pressed to not find somebody who doesn't feel inspired by it by the end."}, {"rating": "0", "text": "One of the worst movies ever. Will smith should probably get kicked out of acting."}, {"rating": "8", "text": "\"King Richard\" encontra o exato equilíbrio que outros filmes do gênero, como \"Um Sonho Possível\" e \"O Vencedor\", falharam ao tentar. Você encontra de tudo aqui... drama, comédia, questões raciais, grandes lições. Tudo incrivelmente de forma coesa com a narrativa.Will Smith dispensa comentários. Quem já assistiu \"À Procura da Felicidade\" não poderia esperar menos do seu desempenho.E não há quem não se arrepie quando o personagem de Aunjanue Ellis caminha ou lança um olhar furioso em direção à alguém, ela está espetacular como a mãe das meninas. Ansioso para ver as milhares de páginas de filmes nas redes sociais usando os trechos e falas desse filme."}, {"rating": "0", "text": "Awful. I don't know what's the point of these movies. Beyonce's song for the movie is awful as well and a huge flop."}, {"rating": "0", "text": "Fiome de sessão da tarde aqui não!!! Gosto das interpretacões do Smith e da Ellie, mas o filme não funciona como um todo, e sim como una gravação sobre o protagonista e sua atriz suporte, sem contar o constante incomodo do filme estar sempre focando em coml um homen foi essencial para a vitória de duas mulheres, porque não dar um pouco mais de destaque para as filhas?"}, {"rating": "6", "text": "The title itself tells you specifically who this story will be centered around. It's not something I have a problem with, because after all, what Richard Williams did is completely inspirational. He aspired to greatness for his daughters, even as difficult and strict as it can be said that his upbringing was for them.It's more than clear that the person who created you, who molded you, is a fundamental part of who you are, and it's even more noticeable when you have become such a great, monumental figure in sports as Venus and Serena Williams are.Especially when that person is your own father. Your own blood. And King Richard is a film that is dedicated to demonstrating that for most of its running time thanks to that fictional idealism that cinema indulges in real stories like this one. But even in the face of how uplifting and moving its story can be, and even with the outstanding performance of a Will Smith who is clearly aiming for an academy award nomination, both Venus and Serena are the real figures here, and when their journey is just beginning, this overlong film comes to an end.It gives the feeling of a cliffhanger for a sequel that I want to believe will never happen. Don't get me wrong, I liked this film, even with all the emotional manipulation that goes with it, but personally, I think the ones who should have gotten all the attention are the two women who have already etched their names in the history of their sport, and sports in general, not necessarily the man who drove them to achieve for success.Not that he wasn't important, but the biopic that really should have been produced, should have been about them."}, {"rating": "0", "text": "Lost respect / oscar speech a joke / From now on I won't watch any movie with Will Smith. He is a narcissist and self centered and he has too much money that spoiled him and his family. His tears in his oscar speech made me sick - like a small boy who blames everybody but not himself. He should go to jail and they should give the oscar somebody else! This man is nothing but pathetic!"}, {"rating": "0", "text": "Beyonce's failed attempt to win an Oscar after 20 years of career destroys the magic of this film, everything seems calculated and inorganic."}, {"rating": "0", "text": "La actitud arrogante y despreciable de Will Smith junto al ridículo espectáculo y discurso que montó en los premios Oscar y el hecho de recibir dicho premio es un insulto imperdonable hacia Benedict Cumberbatch y Andrew Garfield que merecían ese premio muy, pero muy por encima de ese basurero. Lástima, me había gustado la película previamente."}, {"rating": "9", "text": "\"King Richard\" focuses on the unusual and controversial coaching methods of the father of Venus and Serena Williams, played by Will Smith.In what makes for a great case study for \"Nature vs. Nurture\" \"King Richard\" admits -- even in its title -- that Richard Williams literally ruled over his household; but it's tough to argue with his results. And Smith reminds us just how good he can be, too. But he's also surrounded by a great cast of relative newcomers in the girls who play his daughters (and so convincingly at various ages), as well as seasoned actors who play the many people who cross paths with -- or just plain crossed -- \"King Richard\", including John Bernthal wonderfully playing against his tough-guy type. And although it doesn't quite get into the weeds of every gory detail, the film also doesn't shy away from showing that the King wasn't all nobility. Still, \"King Richard\" is likely to inspire you as much as it surprises you, and may even moveyou to tears on occasion. And with both Venus and Serena as Executive Producers to keep it honest, \"King Richard\" is engrossing from beginning to end, including some cool home movies incorporated into its credit reel. Which makes it 2 hours and 18 minutes of PG-13 rated biographical sports-drama that is a well-made drama first, making it a great watch even if you're not into sports generally or tennis specifically.\"King Richard\" is also available through HBO Max."}, {"rating": "10", "text": "Can’t say enough how great of a movie this was! It truly is a masterpiece"}, {"rating": "8", "text": "Giving a career best performance, Will Smith abolutely shines in King Richard. Marvelously edited and fully enjoyable. King Richard is a must see."}, {"rating": "10", "text": "The genius of Green pushes Smith to deliver the best performance of his career by far! The cherry on top is the film containing one of the most marvellous editing work ever seen on cinema."}, {"rating": "10", "text": "A real crowd-pleaser feel-good sports movie! Had a blast and will be seeing it again."}, {"rating": "10", "text": "Great story, awesome soundtrack, great act and so inspirational for me. Easily one of the best movies in 2021"}, {"rating": "8", "text": "Richard Williams (Will Smith) was the father of Venus and Serena Williams. He pursued their extraordinary career with dogged determination, unconventional strategies and massive amounts of love and care for the well-being of his daughters. Smith effectively brings the man to life, which is a challenge because he was sometimes flawed and often frustrating. All of the performances are sterling, beautifully capturing the family’s affections for each other.  Since I’m not a fan of the game, it’s a positive that the tennis scenes never go on too long. Even at 2:18, the momentum of the story and the love-filled ensemble propels it to an ultimately uplifting experience."}, {"rating": "9", "text": "Great biopic of Richard Williams, the father of two of the best Tennis Players of all time, Serena and Venus Williams is an engaging, tour de force of acting by Smith. This is probably his career best performance, one that will land him his first acting Oscar. Of course, the film is no slouch either and stayed true to its original story, showing Williams at his best and also his worst.  A definite award contender."}, {"rating": "8", "text": "I was totally enthralled from the beginning. An American fairy tale off success agains strong odds. Wonderful story."}, {"rating": "8", "text": "Better title:  Venus, Serena and Richard.For me the best scene is where the wife calls Richard in his ego **** and his over-compensating for his childhood low-self-worth. It's honest and terrific. Supporting cast is AAAAA. NOT a bio of Venus and Serena; that would be a very different movie."}, {"rating": "7", "text": "Great performances, especially by Aunjanue Ellis, who plays Venus and Serena's mother.  They could have sharpened the story a little bit.  It runs long.  I wanted to see more of the Williams family inside the house.  I've already seen the sister play tennis."}, {"rating": "10", "text": "De longe um dos melhores filmes do ano. King Richard foge totalmente do clichê de filme de esportes, trás a melhor atuação de Will Smith e encerra perfeitamente com as cenas originais ao som da maravilhosa música original de Beyoncé. Não poderia ser mais poderoso."}, {"rating": "9", "text": "A clear example of how far you can go based on a strict but stimulating education. As a sports drama it feels like we've already seen something identical but, for the quality of the drama and the performances - Will Smith in particular - the ticket price is well justified; and something else."}, {"rating": "8", "text": "The movie is a mix of excellent writing and acting. The film seems realistic. Richard is shown as being a hero, but also not so good. The movie is highly inspiring. Highly Recommended."}, {"rating": "8", "text": "Wife and watched this one night, what a great movie. Will Smith does an amazing job once again. The two young actress (i will be looking up their names) knocked it out of the park as well. I hope WS gets his Oscar this year, i thought he should have gotten it for The Pursuit of Happiness.  I still cry during that movie and i know it's coming every time!"}, {"rating": "8", "text": "Maybe it's because I like underdog stories. Maybe I related Richard's journey to my own immigration story. I recall the main criticism of this film being giving the fathers too much credit and giving Venus and Serena too little credit. Serena will get her movie, but this is Richard's movie. Great people tend to come from great parenting. May I am just biased. But the cinematography is decent, the casting is solid, Will (even after all the red table talk bs JUST STOP DOING THAT SHOW AND RUINING MY CHILDHOOD) did such a decent job, I would put my foot down and say this is the beginning of his comeback."}, {"rating": "10", "text": "This is honest THE BEST work of Will Smith! I never knew that he Can act that good. Totally a performance that earn an Oscar. The soundtrack in also amazing. Beyoncé really did something special with \"Be alive\""}, {"rating": "8", "text": "Way better than most of the movies produced in the last two years.  Will Smith gives a good performance, and all of the acting is well done.  This movie makes the viewer feel proud to be an African American."}, {"rating": "10", "text": "A 10/10 movie. Watched it with my family on HBO Max. The story is interesting, emotional, thorough and informative + Will Smith's phenomenal acting. Definitely recommend it."}, {"rating": "9", "text": "Good sports drama. Great acting from Will Smith. He will get an award for this performance. Great supporting cast and kept my attention the whole movie. Need more sports dramas like this."}, {"rating": "9", "text": "Happy Thanksgiving, Streamers! Many celebrate this holiday by gathering with family over a sprawling meal and acknowledging the many blessings we've received throughout the year. Here's something I am thankful for: Will Smith's latest film, King Richard.Good segue, huh? Yes, I'm thankful for the movies - good and not as good. This season is chock full of family friendly entertainment, and King Richard provides an inspirational family/sports drama that can be enjoyed by the everyone around the dinner table. Here's how I see it.King Richard tells the remarkable story of how Richard Williams (Will Smith) created and executed a plan of turning his youngest daughters, Venus (Saniyya Sidney) and Serena Williams (Demi Singleton), into tennis superstars. The Williams family lives in Compton. They have limited financial resources to access the best coaching, equipment and courts needed to foster tennis talent; but Richard Williams is very resourceful and headstrong as he doggedly pursues his goal of making Venus and Serena tennis champions. Richard has the support of his wife, Oracene Williams (Aunjanue Ellis), as they struggle to raise 5 daughters in the hardscrabble and dangerous life of Compton all while navigating the roadblocks to tennis stardom. If you've paid attention to any tennis in the last 20 or so years, you know how it turns out.Will Smith does a great job of embodying Richard Williams. While the accent and posture are a little off-putting in the beginning, you quickly relax into the performance. Smith is able to portray this determined father, who suffers from tunnel vision, some self-centered arrogance with a touch of narcissism; but, he's also disarming in an oddly charming way. Smith gives a centered performance that highlights how effectively Williams is able to support and parent his daughters through their success. While Smith is the main character, the remainder of the cast is uniformly good. Please, somebody, give Aunjanue Ellis all of the awards and accolades she deserves. She is so good here as she matches Smith's performance beat for beat. Ellis is as fierce and warm as she needs to be. I'll also note that Saniyya Sidney is wonderful. She has some really winning moments throughout the movie.King Richard is almost 2 and a half hours long. That usually gives me pause because a good story can be told in less than 2 hours. Even though this movie's runtime is that long, it never drags. The editing of this film keeps it moving - never boring the audience and always maintaining the dramatic tension inherent in this true story. The tennis matches are infused with energy and show the talent of these powerhouse players. It all comes together to make 2 and a half hours breeze by.Side Note: Stay for the Beyonce end credit song and great footage of the real-life Venus, Serena and Richard Williams.Unabashedly, I'm a fan of King Richard. It tells a remarkable and inspirational story. Even though you know what kind of success this family achieves, it is still exciting to watch throughout. Richard Williams is a fascinating character that Will Smith plays well. The entire cast is aces. This is a film that the entire family can enjoy together over the weekend. Grab a big box of popcorn whether you are at the theater or streaming on HBO Max."}, {"rating": "9", "text": "Its a great Movie about a Man and a Father who works his Butt off to get his Kids away from the street. But not just that he wants the best possible Life for his Kids. Its a great Movie and a brilliant Will Smith. He deserved the Oscar!"}, {"rating": "7", "text": "75/100 the role fit Will Smith like a glove, nothing far removed from what he's done before."}, {"rating": "10", "text": "Wowzers! What an amazing movie. Will Smith brought this story to life. The girls that played Venus and Serena did an amazinh job. I cried, laughed, had deep thpughts, was informed, angry and cried again and laughed. King Richard was such a true character. Loved the movie and cannot wait to see it again."}, {"rating": "7", "text": "King Richard delivers satisfactorily as a biopic thanks to its good performances. Despite failing to emotionally touch me, something that this year's other \"feel-good\" movie as CODA did achieve, it still is a good movie in which Will Smith stands out above all."}, {"rating": "8", "text": "Ciekawy bo przedstawiający początki dwóch sportowych legend tenisa, jednak jednocześnie nic oryginalnego w przedstawieniu tej historii"}, {"rating": "9", "text": "perfect[ adjective, noun pur-fikt; verb per-fekt ]adjectiveconforming absolutely to the description or definition of an ideal type:a perfect sphere;a perfect gentleman."}, {"rating": "10", "text": "This is a great film that shows the importance of fathers in one's life, while respecting both the Williams sisters and their father. Sad that it'll flop while dumb unoriginal nostalgia flicks like Ghostbusters: Afterlife top the box office."}, {"rating": "8", "text": "I've played tennis my whole life so I enjoyed this film. Although the film feels overdramatised somewhat; its a film about universal themes like determination, hard work, and fulfilling your dreams; so you don't have to be a tennis fan to enjoy it. Will Smith is incredible (maybe Oscar worthy?), and the 2 actresses playing Venus & Serena are quite good. It's an all-round feel good movie worth checking out."}, {"rating": "9", "text": "I enjoyed this move a lot. The real life story behind Serena and Venus was amazing. Also, the acting performance from will smith was spectacular. I recommend this movie."}, {"rating": "9", "text": "Great and Smith is Excellent.....................................mmmmmmmm..."}, {"rating": "8", "text": "King RichardA sports biopic with so much heart and splendid storytelling. Will Smith does a very wonderful job, and it's very satisfying that he could shed off everything Will Smith and give a nuanced portrayal of Richard Williams."}, {"rating": "10", "text": "This movie tugged at my heart strings and kept me wanting more. The cast did an amazing job telling this incredible story"}, {"rating": "7", "text": "King Richard, the movie, is too cute and too nice. While that is certainly not a bad thing, it does make one feel as if it's only one side of the story. It seems to deliberately avoid the difficulties that surrounded the Williams household and particularly the man himself, only alluding to those challenges sparingly.Mr. Williams is at the least a colorful character and he's definitely something. I am unsure what exactly but he sure is something and sadly, there's a lot of him that's not in the movie. However, Will Smith's delicate portrayal of the man smoothens his rough edges and portrays his driven & emotional side in a way that many people can relate to.But, if all of Richard Williams is not in the movie, then it is lost what exactly is the focus. Is it just tennis? The Williams household? Venus? Serena? Both of them? A lot of the time it seems the movie is a mixture of the aforementioned; intermittently mixing and matching, never committing to one singular perspective. And this feels like the focus of the movie is constantly shifting.Notwithstanding, King Richard does offer up some deeply emotional and moving scenes that really put you right there with the family. It is in these scenes the movie shines and unsurprisingly all those scenes have Will Smith in them. Unfortunately, other times are not as committed and by the end the plot does seem a little unfinished."}, {"rating": "9", "text": "King Richard is an absolute triumph. A truly incredible sports drama on every front that is sure to please all audiences. A film that captures authenticity so well that I was completely enraptured within the story and this families life, which is a testament to the great writing, well helmed direction and the group of incredible performances on display. Will Smith is the best he has ever been. It's an inspirational and uplifting story that balances emotion, humour, drama and suspense perfectly. Undoubtedly one of my favourites of the year."}, {"rating": "9", "text": "Amazing film. The movie was so well cast and went into a solid amount of detail to tell what felt like a complete story."}], "recommendations": ["rain_man", "joy", "cinderella_man", "catch_me_if_you_can", "the_theory_of_everything", "good_will_hunting", "as_good_as_it_gets", "the_judge", "still_alice", "the_iceman", "gifted", "scent_of_a_woman", "the_fighter", "spencer", "steve_jobs", "a_beautiful_day_in_the_neighborhood", "respect", "black_mass", "ghost", "lincoln", "all_the_money_in_the_world", "hook", "brothers", "american_hustle", "fences"]}