{
  "id": 2337,
  "title": "King Arthur: Legend of the Sword",
  "starring": [
    "Charlie Hunnam",
    "Astrid Bergès-Frisbey"
  ],
  "runtime": 126,
  "genre": [
    "Action",
    "Drama",
    "Fantasy"
  ],
  "description": "When the child Arthur’s father is murdered, Vortigern, Arthur’s uncle, seizes the crown. Robbed of his birthright and with no idea who he truly is, Arthur comes up the hard way in the back alleys of the city. But once he pulls the sword Excalibur from the stone, his life is turned upside down and he is forced to acknowledge his true legacy... whether he likes it or not.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9kKXH6eJpzoFGhCbTN3FVwSQK3n.jpg",
  "categories": {
    "plot": 5.488095238095238,
    "acting": 5.916666666666667,
    "ending": 4.0,
    "soundtrack": 6.4,
    "cinematography": 5.0,
    "familyFriendly": 5.266666666666667,
    "funny": 6.0,
    "action": 5.333333333333333
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Looking at the mixed reviews, I was pleasantly surprised when seeing King Arthur. Even my anti history and fantasy movie girlfriend admitted that she liked it and can't wait till the sequel. For anyone that reads this, give the movie a chance. You may think it's not for you, but I'm telling you, you'll be pleasantly surprised and will enjoy some point of the ride that is King Arthur Legend of the Sword."
    },
    {
      "rating": "5",
      "text": "Loved and hated it at the same time. The elements of the film that I enjoyed I loved very much, but the ones I did not I absolutely hated. The producers and Guy Ritchie's attempt to mesh this age old fantasy tale with the style of Snatch really did not work for me. I was on board initially, the first act was fun and had some entertaining and unique world building, the middle was kinda boring, some of the fights were highlights, but it started to lose me, and the last act of the film is just horrendous, it's cheap and messy with boring CGI fights so bad they reminded me of the infamous scene from Matrix Reloaded. The writing is sloppy, the story is (obviously) predictable, it's your standard fantasy plot with a few original ideas, the jokes are flat and mainly unfunny with underwhelmingly uninteresting characters not fleshed out at all, but the thing I hated the most is the editing, it sucked so bad, this hectic cutting and confusing scene structure did not serve the plot in any way, it was just to show off the style (which at least was kinda inventive) and most importantly it did not fit the movie at all. Now the good, some of the actors were quite fun: Charlie Hunnam tried really hard and it showed, but the character was just not well written enough, Jude Law chewing the scenery was fun and I personally have a soft spot for Astrid Berges-Frisbey ever since the fourth Pirates so I liked her a lot here as well. The cast seemed like they were having fun and that helped the film's enjoyability. The music was a bit illfitting, but I actually liked it quite a lot. The fantasy part was quite strong in the beginning with some stunning visuals. What pains me the most is that it could have been an extremely enjoyable fantasy film, but the final product is not that much better than the In the Name of the King movies, which says a lot. Loved the first 40 minutes, it had good atmosphere and a sense of adventure exploring a new world, but I despised the last 40 minutes. During King Arthur all I could think about is Ritchie's smug face thinking what he made is the coolest film ever (which it isn't) and that thought along with the ending left a bad taste in my mouth. If I'd catch it on the telly I'd probably watch it, but that's as far as my recommendation goes."
    },
    {
      "rating": "3",
      "text": "I strongly agree with \"Billy\" and \"WhiskeyStories\" below. The film starts off with some cool action but gets bogged down in exposition, stupid British slang, and other 'tarded anachronisms. Wife fell asleep halfway through and I had enough at 2/3, what a travesty. This should've been an epic film. I usually like director Ritchie's efforts but this was a big miss."
    },
    {
      "rating": "6",
      "text": "While Ritchie's frenetic editing and more action focused plot might miss the mark for some, I believe their's a charm about King Arthur: Legend of the Sword that saves it from being another mindless re-hash of a classic tale, particularly in its production design, music, and enjoyable interpretations of *most* of the classic characters."
    },
    {
      "rating": "10",
      "text": "Recently I've seen Alien Covenant, Guardians of the Galaxy 2, John Wick 2, and Kong.I liked King Arthur more than all of those movies.   Not that I disliked the movies above, but out of all of them, if I had to watch one movie again, it would be this one.I've seen other Guy Richie movies, and I've seen other King Arthur movies(probably all of them).  I loved this movie.  I can't explain it, I feel like I shouldn't...but I do.  A lot of the the reviews here bring up some good points, but despite that, I really enjoyed the movie.  I felt the story was solid, the pacing was good, the cinematography was great, as was the soundtrack.I'm sure there are plenty of ways to pick this movie apart, but for my part, I had a great time."
    },
    {
      "rating": "5",
      "text": "What a silly mess. I've lost a few neurons watching this, but I had fun. Don't walk in late because the opening scene with the giant elephants is probably the most spectacular of the whole movie."
    },
    {
      "rating": "6",
      "text": "Director Guy Ritchie has taken a very dark approach to the classic tale and turned the king into a superhero. Charlie Hunnam holds the title role as an orphan raised by prostitutes who pulls the famous sword. After initial protests, he leads the fight against his uncle (Jude Law) in one of the numerous battles that's a blur of action, quick cuts and aggressive music. There are some grand visuals, excess all around and a frantic pace (much of the time), but it still feels noisy and empty. (Yes, that's David Beckham in a small role at the stone.)"
    },
    {
      "rating": "3",
      "text": "Better than 70's B films.  Insulting on every level.  Plays to racial stereotypes. Has Asian with Samurai sword named \"Kung Fu Joe.\"  Because it's never too early for Europeans to mix up Japanese and Chinese culture.  Has shoulder camera action.  Has horrible acting, overdone CGI, boring action, murders historic accuracy, copies LOTR castles, and is long.  Critics who are positive on this movie must go to the same Hollywood cocktail parties Guy does.  It's a total stinker."
    },
    {
      "rating": "6",
      "text": "Guy Ritchie's King Arthur gives you exactly what you should expect.  The style isn't changing and that can be good or bad.  I had a pretty fun time with this film but towards the middle of the film the story begins to weaken.  Charlie Hunnam is at his best here since Sons of Anarchy and I thought he made a fine King Arthur.  This is a film that falls flat in parts but is a fun watch nonetheless.  B-"
    },
    {
      "rating": "7",
      "text": "Pretty interesting story and good visuals, but sometimes the plot is hard to understand and there are too many plot-holes. Negroids, Mongoloids and Indians in England of X century??? A mage that could kill the main antagonist ALONE long time ago with that giant snake (as well as his army), but did nothing? That's a bit too much."
    },
    {
      "rating": "3",
      "text": "A steaming pile of incoherent ****Its watchable with the right amounts of alcohol.But thats about it."
    },
    {
      "rating": "4",
      "text": "I don't know if this is the perfect time to bring a King Arthur movie come back to life because  it should've been that exciting. The last time King Arthur came to theaters was in 2004 (Touchstone) and it was above average, but I was disappointed at Antoine Fuqoa's direction that led the film into a forgotten poorly executed movie despite a great cast with fairly solid performances including Clive Owen, Keira Knightley, and pre-Gift star Joel Edgerton. Boy, 2004 turn out to be a bad year for summer movies. but on the other hand, King Arthur: Legend of the Sword is less Reign of Fire and more Eragon. Try as Guy Richie's might, but this is probably one of his weakest movies in his career. No disrespect to Richie, he's a talented directed. But having Warner Bros. to call him up for another summer blockbuster is not very good. Charlie Dunham is not a proven Hollywood star (Pacific Rim flopped, but an underrated gem) and despite the awesome Djimon Hounsou, Annabelle Wallis, and Aiden Gillen showing what they can to deliver a solid performance, Eric Bana, on the other hand, is just so boring. He's not a great actor, I still didn't like him as The Incredible Hulk. But still Warner Bros. just completely forgets that this is another s**tty origins story that tries to wow its audience, but ended up getting flat on their faces. Jack The Giant Slayer, Pan, The Legend Of Tarzan (last year), and this. Another retelling of the folklore known as \"The Knights Of The Roundtable.\" Great, they just copied Disney's beloved animated film \"The Sword In The Stone\" and turned it into another pointless rip-off by Warner Bros. I'm also quite confused why Soccer legend David Beckham wanted to make a cameo in this movie. Man, this smells like box office bomb all over again. Really, if you really want a perfectly executed tale of King Arthur, then grab your couch, head on over to Netflix, and re-watch either \"Excalibur (1981)\" or I can't wait to watch this again \"Monty Phython And The Holy Grail (1975).\" In the meantime, King Arthur: Legend Of The Sword is just plain dumb. Like I said, the acting is confusing and the story is forgettable, but there's a nice touch to it. The visuals were beautiful and the CGI is pretty damn good. But if you wanted to succeed as an action blockbuster, make sure it doesn't ruin the benefactor of getting your audience hyped up to see this movie. But King Arthur: Legend of The Sword is one of my worst movies of 2017 (So Far). I'm sorry, but this is the biggest low point of Guy Richie's career."
    },
    {
      "rating": "5",
      "text": "Guy Ritchie… oh man. He used to be my hero. I loved his two first works – crime comedies „Lock, Stock and Two Smoking Barrels“ (1998) and „Snatch.“ (2000) which I still name as my favorite movie of all time.Number of (indie) filmmakers have tried to capture his approach ever since – colorful, funny and full of energy, partially thanks to inventive use of modern dance music and snappy editing – but no one has come quite close.Neither has Ritchie himself, actually. He lost his spark when his right hand man left to become a famous Hollywood director of his own. There’s an old rumor that producer Matthew Vaughn was actually the man behind most of the good **** in Ritchie’s early movies, and following their later careers, it’s actually easy to believe that.Anyway, since 2009 Ritchie has had luck to reinvent himself as the man who makes big-budget modern versions of loved old heroes, so we’ve had two „Sherlock Holmes’es“ with Robert Downey Jr., a spy story „The Man from U.N.C.L.E.“ and now, „King Arthur“.Ritchie has pitched „King Arthur“ as „Snatch.“ meets Tolkien but in reality we get something looking like „Game of Thrones“, only without interesting characters, story or even dialogue.The pathetic excuse for a story used here is mostly for stitching the action scenes together and for the last maybe 45 minutes, they just give up, going for the overdose of generic fantasy cliches instead.The result feels surprisingly similar to many recent superhero movies: looks good, is entertaining in short dosages, and gets progressively more tiresome during the last hour – except for the fanboys, maybe.\"King Arthur\" is actually the first of planned six movies. Here's hope that critics are proven right and this will tank at the box office, so we can get something new instead. IMDb hints that Ritchie is thinking about live-action \"Aladdin\" and \"Holmes 3\" next.So... \"King Arthur\" looks good visually and I wanted to like it. Sadly, there is just not enough movie here for 126 minutes.At least the actors did what they could with the shallow material and Charlie Hunnam as the future king is suitably rugged and furious – think Chris Hemsworth in the first „Thor“. But this is not enough for serious contender."
    },
    {
      "rating": "5",
      "text": "Even though it had an interesting premise for a King Arthur movie, it was ultimately kind of boring and was an overall skippable movie. It's worth a cheap rental, but I am glad I did not pay to see this in theaters."
    },
    {
      "rating": "3",
      "text": "For the first time in his career, Guy Ritchie is likely happy he directed Swept Away because without its existence, King Arthur: Legend of the Sword would have firmly established itself as Ritchie's worst effort in his career. Entering in the illustrious pantheon of bad films that bomb after being intended to start a franchise, King Arthur: Legend of the Sword is everything that is wrong about blockbusters today. Cliche and riding the hero's journey too closely, the film's special effects ridden action, frantic cutting (even beyond Ritchie's norm), and awkward injections of \"humor\" during tense or thrilling moments, the film is a hodge-podge of everything that studios believe audiences want. Unfortunately, as is often the case in these failed franchise starters, it turns out that audiences do not want to watch an incomprehensible, poorly edited, poorly acted, and exceedingly dull film.The tragic part about King Arthur: Legend of the Sword is that it starts off pretty well. With his castle under attack, King Uther Pendragon (Eric Bana) defends his people by using Excalibur to decisively cut through the invaders' forces and kill their leader. Unfortunately, he did not count on his brother Vortigern (Jude Law) having turned on him. Sacrificing his to become more powerful, Vortigern kills Uther and tries to take Excalibur, but Uther turns into a stone with the sword in his back. Setting up the legend of the sword with his son Arthur drifting off in a boat and being found by a group of women Moses-style, being destined to pull that sword out of  him and liberate England from Vortigern. Though he is unwilling and tries to throw away his destiny (the classic cut-and-paste scene of the Lady of the Lake rising with the sword to give it back to Arthur that is in every King Arthur movie apparently), this destiny is not one he can run from unless he is willing to see Britain descend into darkness. Becoming the man who will liberate his people (Moses again), this prophet who is persecuted by the King (Moses again, but also Jesus to some degree) must rise to the occasion via the Hero's Journey to save England. Though cliched to a fault, the story is nonetheless one that can become gripping with Ritchie's occasionally sharp script delivering the fantastical journey and thrills necessary for a King Arthur film.Unfortunately, shortly after the film's strong opening, things begin to go awry. In other words, Guy Ritchie takes over. Known for his rapid cutting, Ritchie seems to forget he has already cut 15,000 times before unleashing another round of 15,000 shots of Charlie Hunnam's face on the world. Immediately after the credits, he shows Arthur growing up from a young boy to a man with intensive training and odd encounters in his brothel home. Rapidly skimming through time, the headache-inducing sequence tragically sets the tone for a film that puts a premium on rapid cuts and slow-mo action instead of story. So brief, distracting, and inconsequential, this particular montage would have been better if replaced by a \"20 years later...\" bumper before just cutting to Arthur being a ripped Englishman set to encounter his destiny.Reliant upon these rapid cuts throughout, Ritchie - as expected - uses it frequently as characters tell a story to somebody who was not there - such as Arthur giving an account of his whereabouts to a police officer with Ritchie flipping through the flashback and the present day with the flashback often matching Charlie Hunnam's every it of dialogue - or to toss in flashbacks and foreshadowing about Arthur's destiny, but where the film truly lacks with this rapid cutting are in action scenes. Rendering them nonsensical and often incomprehensible, Ritchie tries desperately to cover up the poor special effects with this flashy editing style, but it unfortunately has the opposite impact. Instead, these flashy cuts only serve to highlight the often poor special effects that are found in this film, especially as Arthur duels with officers towards the end. Cutting, pausing, slowing things down, and spinning the camera in a circle around the action, Ritchie tries every trick in his arsenal to make the scene look good but does nothing more than confuse and nauseate. Furthermore, it is a clear attempt to manipulate the audience into feeling tension and thrills during the action - especially as Arthur and his friends run from the cops with Ritchie rapidly cutting, using an extreme close-up with a handheld camera, and sprinkling in shaky cam into the scene - as even Ritchie can see that the film is not all that original. Trying to inject originality and beat back claims of predictability with these drawn-out and \"stylish\" action scenes, Ritchie only manages to further highlight his film's hollow nature. This half-hearted attack at style over substance only serves to prove this as he relies upon it like a crutch to make up for the film's thin writing and run-of-the-mill approach to Arthurian legend."
    },
    {
      "rating": "5",
      "text": "Went to watch the movie expecting much more. The acting was not bad, it was actually quite good, the sound editing top notch as well, but that's pretty much it. The movie after a while gets exhausting with the exagerating CGI effects and crazy camera movements. Almost seems like they are pushing you through the whole movie without focusing on a good story. The script at times gets cheesy, with jokes or lines that looks like they tried to make it funny but failed (nobody laughed at the movies). This movie is similar to what happens in many modern day video games, focus too much on the graphics and sounds but not on a solid, interesting and intriguing story and experience."
    },
    {
      "rating": "3",
      "text": "If Ritchie had stuck to just a few styles, then perhaps this would not be such a mess.  It may be one of his usual movies where style is considered far more important than substance, but at least it could have been coherent.  By the mid-point the viewer will have seen everything from stunning HQ shots, to LQ self-cam chase scenes, as well as bargain basement CGI towards the end that will nauseate any viewer (barring the shill brigade giving this a 10). The result is a total schizophrenic mess, as if five film students all tried to randomly edit in their version of the story based on rolls of the dice."
    },
    {
      "rating": "3",
      "text": "As summer arrives, so do blockbuster summer movies. Usually simple and straightforward, often campy, and always flashy and action-packed. However, it seems like these movies are less able to leave their mark every year– the market is practically oversaturated with action movies and TV shows, with what would have once been tentpole features now seeming to come out every weekend. Many of these vying chunks of screen-time are now written more smartly than ever, making it difficult for the crowd-pleasing mediocrity of summer action flicks to justify taking two hours of the audience’s time. “King Arthur: Legend of the Sword” is one of 2017’s first summer blockbusters, and 2017’s first summer flop. This attempt at a gritty, dark fantasy retelling of the Arthurian legend strides confidently onto the stage, attempting to wow audiences without managing to stand out favorably from its competitors in the slightest. Taking place in ancient England, “Arthur” is essentially a prequel to the classic tales of the Round Table. It follows the rise to power of an amoral Arthur (Charlie Hunnam) raised on the streets after his uncle Vortigern (Jude Law) seized power and killed the sitting royals– which only happened after they had seized victory over the rebellion of the evil mage Mordred, who betrayed the previous mage kind and forced Merlin into forging Excalibur, etcetera, etcetera, etcetera. If you fail to see how that was necessary to my explanation of the plot, so did I as I was suffering through reams of exposition and flashback whose only place in the movie seems to be to remind you that the screenwriters read the source material. But to return to the story, “Arthur” moves frenetically from the title character’s life of crime, to his discovery of his magical destiny, to his joining of the rebellion against Vortigern; sprinkling in enough “refusal of the call” and “now it’s personal” tropes to grow an entire crop of B-list, testosterone-poisoned fantasy movies. Most actors are very serviceable, except for perhaps the only name-branded star on the cast– Jude Law, whose over-the-top and yet sort of bland delivery does not at all help the fact that he’s basically playing Magical Hitler with Extra Dark Souls. Come to think of it, Astrid Bergés-Frisbey I also could have done without, not because the script ever calls on her character “the Mage” to speak or emote like a normal human, but because her enunciation is like listening to a child who just broke into a veterinarian’s supply of ketamine. I’ll finish by saying that there’s nothing in the plot of the movie that’s actually that bad, except for what I would argue is the use of a poor man’s storytelling crutch- using magic to solve problems when the magic isn’t understood by the audience. What hobbles “Arthur” is the editing. Ritchie apparently couldn’t decide what style to cut the movie in, so he threw in every shot and angle used by mankind in the past three decades, usually with no actual reason for why this should be happening. There are some sequences I enjoyed- particularly when the camera moves with the tip of Excalibur. But most of the time the incessant montages, slow-motion, and everything in between makes the pacing utterly nonexistent and ruins the presentation of whatever good material there is. Narrative beats are replaced by constant motion which does nothing to justify itself, like Guy Ritchie wants to prevent the audience from being able to understand, much less appreciate, anything on screen. The cutting in this movie gave me a headache, and that isn’t an exaggeration.You may have gathered that I did not enjoy this movie. Perhaps that is due to the fact that the writing is so consistently uninteresting. Perhaps it’s due to the fact that the movie’s insistence on flashy set-pieces and erratic presentation makes it all feel empty of any real heart or anything to say, and makes the narrative stakes so irrelevant that when something actually interesting happens it’s too late to care. The only coherent theme I could draw from this movie is that those who possess power deserve to use it as they wish. And perhaps I don’t like “Arthur” because it squanders all of the potential in the Arthurian legend in favor of a movie that distinguishes itself in no discernable way. The best demographic I can think of for this movie would be middle schoolers, because they are the most likely to be adequately distracted and engaged by its bounty of fast movement and bright lights. From me, it earns a score of 3.5 out of 10. It lost a lot of points because there are few things more painful to me than being able to see exactly where the potential for something to be good was lost. Most of that 3.5 was earned back, grudgingly, because this movie had a very high level of snake inclusion, which I have to give points for. The very large size of some of the snakes was something of a salve for my weary eyes."
    },
    {
      "rating": "9",
      "text": "This is not the King Arthur you have ever see. No cute boy in the woods or sappy musical. This is the story of using the sword, controlling the sword within the action and good story line. The  graphics are outstanding and the acting is good. Some have complained that it is not historically accurate. What is historical about pulling a sword from stone. Yo will enjoy the settings, the types of characters and unpredictable endings. Great for dates, taking the grand-kids as well as mature audiences."
    },
    {
      "rating": "6",
      "text": "If you've ever wondered what would happen if Guy Ritchie directed a King Arthur movie, here's your answer. Other than that there's not much to recommend about this film. It's rarely boring, and Ritchie's style mixed with the near-sacred source material often leads to some novel, if incongruous, moments. Still, it's mostly forgettable B-movie fantasy hokum, like Game of Thrones goes Grindhouse. Fair warning for those who care... Every female character, save one, is literally sacrificed  to advance the story and the desires of men. The only female character with agency isn't even given her own name. For a movie set in the dark ages, this makes logical sense, except for the fact that Ritchie clearly doesn't care about anachronisms. It seems like the retrograde gender politics is less an essential part of the historical setting and more a signature feature of Ritchie's \"blokes only\" wheelhouse."
    },
    {
      "rating": "5",
      "text": "\"King Arthur: Legend of the Sword\" was a somewhat passable film, because if the essence of history, and history in general were respected, but the performances were acceptable, and the action scenes were more of the same, some Were good, and others were stuck with the camera moves of a \"Sucker Punch\" scene, but I think it's unfair to compare Sucker Punch with King Arthur, but the bottom line is that Guy Ritchie needs some scene management Of action that has always been handled, as in Sherlock Holmes, or The Man of UNCLE, and that the film is enjoyable, but very regular at times."
    },
    {
      "rating": "5",
      "text": "Guy Ritchie tries his best to grip and tug on the hilt of Arthurian legend in \"King Arthur: Legend Of The Sword,\" an undeniably flashy, semi-entertaining cgi-fest that, unfortunately, didn't make a lick of sense to me. True, the more general aspects of the story came across pretty clear. Jude Law is evil and needs to die. Charlie Hunnam is the one, true king and also in pretty good shape. Magic is complicated. Snakes are cool. But it's the intricacies of this narrative that really, truly, and tragically escaped me. A lot of the \"how's\" and \"why's\" are either completely disregarded or swept up in the fracas of a traditional Guy Ritchie montage sequence. Yes, the \"Excalibur\" sword fight sequences (all one-and-a-half of them) are super incredible from a visual standpoint, but without any of the emotional weight or stakes needed to make them more engaging, this film ultimately ends up wandering into the \"mindless\" end of the action film spectrum."
    },
    {
      "rating": "10",
      "text": "I loved this movie! I just created a Metacritic account to help do it justice, given that most critics gave it poor ratings and reviews. Critics please, take into consideration that there is a public that love this kind of movies. PLEASE, give them fair reviews accordingly!This movie is a MASTERPIECE. The story is relatively simple (given that it's inspired by a centuries-old tale), but the excecution is outstanding. It has almost every part of the King Arthur mythos, although there could have been more Merlin, but it wasn't necessary to complete the experience. The actors are incredible... All of them. The environments are spectacular and beautiful. There is a lot of fantasy elements that are wonderful as well.The action and adventure are executed perfectly, as expected of the amazing director Guy Ritchie... IT EXCEEDED my expectations BY FAR! It has you on the edge of your seat every second, and even a lot of the sequences are absolutely jaw-dropping.The story is conclusive but it has GREAT potential for follow ups, and I can't wait to see them. I hope this movie gets enough support from fans so there can be a sequel. I reccomend this movie to any fan of: Guy Ritchie, the King Arthur mythos, The Lord of the Rings, The Hobbit, Pirates of the Caribbean and the also ufairly reviewed but absolutely great Warcraft movie.EXCALIBUR!!"
    },
    {
      "rating": "8",
      "text": "Finally a movie about a legendary character that doesn't use too much time on the origin-story. Cool action, music, characters that are true to themselves and a exiting story that uses the film's playtime for what it's worth."
    },
    {
      "rating": "10",
      "text": "Honestly, throughout the whole film I was sitting and smiling like a child. I loved fantasy books of 80-s and this film gave me exact same feelings. Some people find it to be historically inaccurate, but it's an action movie, a fantasy move, one that entertains. I loved characters in it, I loved jokes (though, not many people were laughing in the cinema) and I can tell that that's the movie I would gladly rewatch and buy a blu-ray copy once it's out. It's ok that different people have different tastes, but it almost seems that nowadays hits are either Marvel movies or soon-to-become-mass-market author movies."
    },
    {
      "rating": "10",
      "text": "I have an obsession for sword-fighting and fantasy like Game of Thrones. This movie exceeded my expectations, it played with my emotions and the action in this movie was stunning!"
    },
    {
      "rating": "10",
      "text": "I was honestly shocked by all of the negative critic reviews for this movie after going to see it. Reading through a few blurbs of them, they seem to be upset that Guy Ritchie made a film that looks like a Guy Ritchie film. for one, I am glad that I decided to not listen to critics this time and just went and saw it. It delivered exactly what I was hoping it would. It was fast paced and fun, with a great cast and beyond incredible music. I think this movie is a perfect example of how flawed our system of rating and critiquing movies is these days. People look at a low number on metacritic or rotten tomatoes and then don't even bother with the movie or even reading the why of the low scores. This movie didn't earn its low score or low box office numbers. If you want an exciting, action packed Guy Ritchie film, this is one delivers."
    },
    {
      "rating": "10",
      "text": "Beautiful movie! Photography is exceptional, engaging music and well-characterized actors. Guy Richie is a great director. Can't understand the hate from critics. Go see it!"
    },
    {
      "rating": "10",
      "text": "The movie was great. I loved it. I actually made an account just to review because I'm so surprised about the rating. It's stupid that only the critics score displays on google when most of the profit come from the public.. I haven't enjoyed a movie like I did this one in ages."
    },
    {
      "rating": "10",
      "text": "This movie is EPIC!!  I had to go watch it again and REALLY want to see it a third time just in case I missed something.  Did the critics even watch this?  I read an article today an why this movie \"flopped\" and the writer even states that he never watched it.  If there is something to blame for the \"flop\" of this movie, it was the marketing it received.  After seeing the previews, I thought I might go see it but it wasn't at the top of my list.  In fact, we only watched it because there was nothing else out that we hadn't seen.  And now...this movie has topped my list of favorite movies of all time.  It has elements like 300 and Lord of the Rings.  I bought the soundtrack the minute I left the theater and have already pre-ordered this on VUDU.  If you believe the critics, you are cheating yourself out of seeing one AMAZING movie."
    },
    {
      "rating": "0",
      "text": "I love fantasy movie and I'm also fan of the story King Arthur. However there hasn't really been a good movie adaptation of this story and sadly this movie didn't change that opinion. The story is pretty generic and they fail to catch what is fantastical about the original tale. They turn the character of Arthur from someone you want to see succeed into someone that we really don't have reason to care about. Finally they change the story to be about stopping the evil Uncle which feels like a rip off Hamlet. In conclusion if your looking for a good King Arthur story then stick to the books."
    },
    {
      "rating": "7",
      "text": "King Arthur: Legend of the Sword is, you know… an interpretation of the story of King Arthur; as in Knights of the Round Table, Merlin the Magician, etc., King Arthur.  It’s one of those stories that has been told many, many times and in many ways on film, including animation, satire, fantasy/action/adventure/drama.  And I totally had to go see it after I heard Sandy Kenyon’s review, which was just too sad to even be funny.Where this film goes wrong lies with two crucial elements of this movie are just “off.”#1 – Director. Not that I don’t care for Guy’s work.  He’s okay with me.  But here he imposes his sleek, modern style of film making into this late 5th-early 6th century tale and the result is at times it works well and is charming, and at other times it’s a painfully bad fit.  I use the word “imposes” because during the course of the entire movie things just feel very forced; when had his style been “infused” into the film it might have flowed more effortlessly.  For example, in one scene Charlie Hunnam walks across the set with all the swag of Jax Teller and it is as if Jax Teller were playing King Arthur!  No!  No!  No!  Nobody in 5th century England was likely walking with a bop in their step; I mean it’s possible, but not probable.  Little things like this made the movie laughable at times (and I’m not talking about the good kind of laughable, or the moments that were intended to be funny – and there were a few), and with just a bit more care and effort, we all could have had a better movie.#2 – The screenplay. Guy helped co-write the screenplay, and the story felt as though it had more than a few hands on it – as if it had been a bit overwritten.  This story didn’t quite know if it wanted to be historical, mystical, beautiful, comical, dramatic, tragic, epic – it was just all over the place and it did not work as all of these things at once.  The balance in the story just wasn’t there.  The story itself is definitely stale, having been told many times over the years, but the attempt to “freshen” the material with Ritchie’s style was a mistake, unless he was going to modernize the setting or just make the characters straight-gangster and make an R-Rated version.  Now THAT would be a movie worth making and one I would be more likely to pay to see.  I must say that this is the most multicultural cast of characters I have ever seen in the telling of this particular story, and I appreciated that.  It is a beautiful thing to see people of color working on the big screen – BUT, it did absolutely nothing to modernized the story in any meaningful way (because the setting was still 5th century England), nor did it change the story in a way that made it more interesting or entertaining.  Someone else may feel differently about it.  Me personally, I don’t care if the entire cast is whatever nationality, ethnicity, sexual orientation, or whatever, as long as the movie is good.  And as far as the story itself, it may have worked on paper, and in theory I can even see where it might work, but the execution fails.While watching Mr. Kenyon’s review he made mention of the terrible acting by David Beckham (I believe he mentions another critic claimed it is some of the worst acting he’d ever seen on film or something to that effect). But let me just say, Becks (see how I refer to David Beckham as though we’ve met…) only had two lines and they were two terribly written lines.  The worst part of this movie by far for me was listening to Astrid Bergès-Frisbey as The Mage.  I thought she was absolutely and tragically, terrible.  This character has no presence, no energy (as she tried to be “ethereal” and came off as horror movie creepy), no emotion (yes, I understand she is The Mage, but give us something) and her accent was super-annoying.  I mean, to point out one character with such a small role, just because it’s Becks and exclude this horrible, large (she is billed second on IMDB) role from criticism, is unfathomable to me.  Now I’m critiquing the critic!  I’m done with this movie!What saves the movie from being a total wash out is the wardrobe (particularly the well tailored clothes on Hunnam), the cinematography/camera work, the choreography of the battle scenes, the effects, some of the acting, the jokes, and I gotta tell ya – looking at Charlie Hunnam for two hours will never a problem for me (unless something goes horribly, horribly wrong, heaven forbid, and God bless him)."
    },
    {
      "rating": "1",
      "text": "The morons giving this movie a 10 must be children or have never watched movies before. This movie is a reskinned guns and geezers flick for the 1st half of its running time. The latter half is like a direct to budget video fantasy flick. The dialog is a mumbling mess of Guy Ritchie's patented cockney blathering. It has no sense of wonder or adventure. Secondary characters lay down the plot for idiots in boring expo dumps at various points in the movie. Too many anachronisms infest this movie. It tries to hard to be witty and stylish but just comes across as smug and conceited. Jude Law is the only thing worth watching in this flick. I wish it was about him instead of that two-legged of bore Charlie Hunnam. There are no clever twists or turns. Even the final boss fight is crappy and lacks any novelty or imagination. Just rent or pirate this pig swill."
    },
    {
      "rating": "1",
      "text": "This was less a movie and more a series of scenes strung together; it barley informed the audience through its mishmash of of an introduction,  and continued with this garbage format for the rest of the film. I encourage all who decide to waste there money on this, to also watch the 1981 film Excaliber, a moderate budget film, with low end special effects."
    },
    {
      "rating": "9",
      "text": "I personally enjoyed the movie. I think it is comical, clever and imaginative.It gave me a sense of a magical world.I am aware the professional review dislike the film because of various reasons but I believe there is a reason I am giving a user review."
    },
    {
      "rating": "5",
      "text": "The story is too straightforward and naive, but the camera work and editing by Guy Ritchie, as always, are stunning. His imagination of visual effects is incomparable. The visual part of the film undoubtedly deserves the highest evaluation. In general, if for the semantic part put 0, and for the visual 10 then the average score is 5"
    },
    {
      "rating": "4",
      "text": "So this is supposed to be a movie set in the middle ages, yet it doesn't feel like that. The only good performance in this latest King Arthur movie is Eric Bana's. The lead actor doesn't impress me at all. The plot had a potential, but the delivery was all over the place. And the camera work was absolutely the worst part of this movie. This was only the second time I fell asleep in a movie cinema (The other one being 2014's Godzilla). After the epic opening part, the movie just went completely on a wrong direction. Don't waste your time and watch Guardians vol. 2 instead. And hopefully, there won't be a sequel or spin-off."
    },
    {
      "rating": "1",
      "text": "I'm a pretty big Guy Ritchie fan, but somehow I don't think he wanted to make this movie, which is one the worst I've seen in quite a while. It almost joined Secret Life of Pets as one of the only movies I've ever walked out of, but someone else was depending on me for a ride home so I just started online gambling, which was definitely a better investment of my time. I mean, there are many children and idiots out there, and if you are one of them, you certainly may love this hollow eye-puke. It seems to assume that I will care about it's shallow anti-heroes just because they are human beings but they're not - they're characters, and you need to give me a reason to give a damn about those. I'm someone with great reverence for the cinematic experience, but I laughed loudly and unashamedly at the film's several hamfisted attempts at conjuring pathos. It certainly was pathetic. This film is not worth dissecting because it's not even trying. For the love of God, avoid this steaming mass."
    },
    {
      "rating": "5",
      "text": "King Arthur: LotS was much better than I thought it would be. I liked what Guy Ritchie brought to this world, which was refreshing. However, in the midst of the entertainment, this movie isn't a great one; it's a mixed bag."
    },
    {
      "rating": "8",
      "text": "You know how sometimes you watch a movie, without reading any reviews or hearing very little about it, and after watching it you say, that was pretty good? That's exactly how I felt about King Arthur Legend of the Sword.Further to watching it, I read reviews and have to disagree with most of the critics out there, they didn't like it, and I disagree on the points they had made. I am not saying its the best movie in 2017 nor the best Arthur movie ever (Disneys The Sword in the Stone, and Excalibur are still the best) but it's got a fresh look on Arthurian Legend and much better than recent previous attempts.This is a Guy Ritchie movie, and the director has an announced way of how dialogue is done in his movies, as well as filming action scenes, and I really personally enjoy it. Who didn't like Lock Stock and Two Smoking Barrels? Witty colourful, large cast, street smart, and ultimately always ALWAYS cool, and all of that we can see in King Arthur.If people haven't realised it yet, the movie industry is going through what I like to call the continuity revolution - the one-off movie hit doesn't work anymore, especially not on fantasy or sci-fi. Everyone wants to like a character and see their development, and why should King Arthur be different? It's Legend, and there are many Arthurian stories which have never been portrayed on the big screen, so I am glad that it looks like a franchise."
    },
    {
      "rating": "7",
      "text": "Ritchie at his best, this has awesome action and visuals, cool music and all Ritchie's trademarks."
    },
    {
      "rating": "6",
      "text": "Good movie. Great cast. It feels more like an experiment in High fantasy than a retelling of the Arthurian Legend.The Arthurian legend is based on a leader in Britain that forged peace between the Romans, Celts (Britons), Anglo-Saxon-Jutes and the Vikings. He was a Romano-Celt. He turned the conflicts of the different peoples into a peaceful nation. A nation that rose and disappeared so fast leaving a memory that has lasted almost two thousand years.The different King Arthur renditions that I will compare this to are;1) Excalibur. The movie that is by far the best King Arthur retelling of them all. Every scene has your blood pumping your skin crawling your anger inflamed or a shock to your remaining senses.2) The Sean Connery retelling. Camelot. Not bad. It is too watered down made for an audience that includes date-night crowds. 3) Clive Owen. Arthur. Good conceptualization with Merlin as a Celt. Accurate armor and dress. Fighting the Saxons who are mercilessly attempting a forceful conquest of the Isle of Britain.4) Starz Camelot. Great moments good reimagining. We likely will never see the smiths daughter rise as the Lady of the Lake. Merlin was a fantastic reimagining of a young wizard without discipline. They blended the legend with sitcom episodic interactions. Turned down the intensity of the story. Morganna was fantastic too. The actress from Kingdom of Heaven. 5) Merlin the made for TV series. I saw this I can't remember much of it. Not memorable but well reviewed.The effects were called generic by one critic. The videogame sequences were one of the better parts of the movie. The weakness in it is it didn't make your blood pump (move you emotionally) until the Celtic Hymns kicked in at the end. The sequences of the partisan war were too brief. There was not enough character intensity showing Arthur forging his band of post story Round Table Knights. The Guy Ritchie modern underworld takes were good. Arthur being a rogue in his youth is a good concept (rather than being raised by merlin and his adopted Father from the legend).tldrI enjoyed the effects loved the cast. The story was flatlined. Jude Law's character was portrayed as disinterested. A little bit of Hollywood portrayal of Royalty. They had to mesh the most important moments better. Those are his upbringing. The revealing of his lineage and the sword in the stone. His rise as a leader. His victory over the bad guys.Guy Ritchie needed to make it more like Batman Dark Knight and the original Excalibur. He didn't concentrate on the main characters. There were a lot of characters. I never had any feel of bonding between the group. It could be a product of the times that when reviewed with terms like generic you tend to receive a review from me with generic imagery.Excalibur my favorite has the heavy armor of the High Middle Ages way past Arthur's time. Perhaps it works because the memory of his Kingdom and the Chivalry of his Knights was remembered at its peak in the high Middle Ages. The heart of the story is that England (Great Britain) love the character for defeating so many enemies and bringing peace. Only to see it disappear within a blink of the eye. Leaving only memory and song (poetry) that is cherished and loved by many today."
    },
    {
      "rating": "7",
      "text": "A different take on the sword in the stone!This one came with a little surprise. I know it was a Guy Ritchie film and I had enjoyed all his previous flicks. But for some reasons, I felt I'm not that interested in this. Even trailer looked okayish. Watching the film now I realised that I've totally misjudged it. Still not a masterpiece, but a much better entertainer. The graphics were awesome. The settings were totally encouraging to glue to it. The story, stunts, with some of the slow- motions, very detailed and muscularly enchanting.Everybody knows the basic storyline of King Arthur. In this, it opened with two brothers feud and following a young man grew up in a brothel. When the city slowly gripped with the myth that the legendary prince would return to the crown, now the king, Vortigern vows to find him first and end the threat. But what comes after him was beyond his expectation. He has to finish it off what he had failed years ago. On the other hand Arthur has all the support, particularly the legendary sword passed on to him by his father.I had liked the Disney animated film back when I was a kid. This was completely a different film. For the live-action, it stood and delivered what viewers had expected. The music was another advantage. All the actors were good. The rise of Charlie Hunnan. His recent films were pushing him to the next level. Surely a lookout star. Despite a poor box office, it is a much better film. Once again the film critics got it all wrong. Good for one time watch.7/10"
    },
    {
      "rating": "8",
      "text": "Looking at user ratings. And comparing this with the assessment of the administration of the site. METACRITIK's assessment is sucked. They are not reliable. Do not rely on their assessments. And the movie is great, they are not goodies and special effects straight from the mega. He gives him comfortably 8.0 It's a pity I watched him so badly."
    },
    {
      "rating": "8",
      "text": "Really good movie. Won't be too memorable but you'll enjoy every minute of it.It's believable, it has a fantastic and magic side really well done. The cast and the acting was great too. The storyline it's  not  the best in the world, but everything makes sense and it's well carried."
    },
    {
      "rating": "5",
      "text": "What a fun mess.This movie or more like a two hour music video starts immediately in the middle of a battle with huge elephants and loud music playing in the background. It's chaotic and expensive looking and admittedly kind of exciting. After this we get some weird dialogue with music still playing in the background because at the same time the movie keeps cutting to a battle. Ten minutes in we see Arthur for the first time and the movie becomes extremely fast-paced and it felt like the movie was constantly skipping over some important character moments so it could get back to the stylistic action. I guess Guy Ritchie just wanted to make a cool looking movie without really caring about character development, because I seriously didn't care about anyone in this film.The film just feels like a bunch of weirdly edited montages with music playing loudly in the background. Sometimes so loudly that I couldn't hear any of the dialogue even when the characters were yelling. Almost everything is done in slow motion and a lot of the camerawork was very over the top. King Arthur of course has to have perfect hair even after waking up or having mud all over him, but I didn't really even mind because the movie just kind of begs you to roll with it.There were a couple moments that had some actual tension with the characters and fun dialogue, but they're over pretty quickly and the movie gets back to the action.Overall King Arthur Legend Of The Sword is a very over the top film that doesn't really care to give actual characters to care about, just very entertaining action. Some of the acting is pretty bad and Jude Law isn't given enough to do, but I'd recommend this movie as some late night entertainment."
    },
    {
      "rating": "8",
      "text": "Guy Ritchie as usual provides, even though this is not the best of his movies. Still great movie and an even greater soundtrack. Has some funny moments throughout too."
    },
    {
      "rating": "7",
      "text": "Highly entertaining film with a great performance and a great lead character. The side characters are all boring though and the story isn't anything fresh or new. The visuals are crazy and different and so are the action sequences. Director Guy Ritchie adds a lot of fun, quippy dialog, and a lot of quick, funky editing to make the movie very enjoyable. The movie is a blast and nothing else."
    },
    {
      "rating": "7",
      "text": "It's good! I wish the slightly odd pace of narrative and writing could have taken a bigger part. Those segments were funny and gave it a unique and quirky sort of storytelling. Unfortunately some parts become very typical. Especially surrounding some old and well used story tropes etc. So not the most original story. Good characters though. Also might have overused special effects at some points. It just looks like a video game in some parts. Kinda breaks the spell. Very enjoyable though. Shame there won't be more."
    },
    {
      "rating": "5",
      "text": "The movie starts out very strong, and I LOVED the first montage that shows Arthur growing up.  It's well done, interesting and appropriate.  Almost every other subsequent montage is worse, until the movie degenerates into a cacophonic phantasmagoria.I've never seen a movie that displays such extremes, and it's a shame, because what IS good is *really* good.  The bizarre editing, poor casting (especially Aidan Gillen), mediocre acting, and inexplicable story ruin it, though."
    }
  ],
  "recommendations": [
    "bumblebee",
    "avengers_age_of_ultron",
    "hercules",
    "blade_of_the_47_ronin",
    "the_hobbit_the_desolation_of_smaug",
    "pan",
    "the_last_witch_hunter",
    "poseidon",
    "thor_the_dark_world",
    "the_magnificent_seven",
    "jupiter_ascending",
    "guardians_of_the_galaxy",
    "abraham_lincoln_vampire_hunter",
    "immortals",
    "dredd",
    "riddick",
    "black_panther_wakanda_forever",
    "max_steel",
    "the_13th_warrior",
    "clash_of_the_titans",
    "serenity",
    "transformers_the_last_knight",
    "seventh_son",
    "i_am_legend",
    "jonah_hex"
  ]
}