{"id": 4839, "title": "King of Thieves", "starring": ["Michael Caine", "Jim Broadbent"], "runtime": 108, "genre": ["Crime", "Drama"], "description": "London, England, April 2015. Brian Reader, a retired thief, gathers an unlikely gang of burglars to perpetrate the biggest and boldest heist in British history. The thieves assault the Hatton Garden Safe Deposit Company and escape with millions in goods and money. But soon the cracks between the gang members begin to appear when they discuss how to share the loot.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/rtfS7y2XQ0vjTrm6khq508N0Ehk.jpg", "categories": {"plot": 6.0, "acting": 8.0, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.571428571428571, "action": 5.0}, "reviews": [{"rating": "8", "text": "What do the stuck up critics expect from a movie like this?  It's a nostalgic, tongue-in-cheek look at an old school crime of epic proportions by an old school generation.  The result is a movie with a plenty of humour probably missed by them, it's subtle British humour embedded in the dialogue and the thieve's decript state, best shown by their recollections of driving around in high end performance car heists in the 60's and now turning up to a shed in a Vauxhall Astra estate.If you don't get that, you won't get and appreciate the humour of the movie.  Fine actors nearing the end of their career's mostly, a fascinating real life story that blew the minds of the world and especially a complacent London jewellery trade. I found the movie great fun, a laugh at age and how you can stick two fingers up at stereotypes relating to it and do something incredible (if also criminal). It's in some ways an inspiring movie in that sense, as well as hard to not root for them as anti-heroes because although you know you shouldn't, they're sympathetically portrayed.Overall it's a thumbs up as an proper London heist movie with fun characters.  Ignore the snobbish critics claiming it's \"boring\".. try listening to dialogue and watching character development and pay off, not expecting it all instantly. You're the same idiots that gave the dire \"The Last Jedi\" a near perfect score.  Recommended."}, {"rating": "3", "text": "This was quite crappy. And I actually thought it will be a funny movie. Maybe it is meant for also old people who will watch it too? Only gave it 3 because I managed to watch it all thinkin it will be get better or more interesting but it really felt just a bit weird. Like a local theatre play only in movie"}, {"rating": "2", "text": "Egad look what just broke into our screens!  A gang of over the hill jewel thieves plan and execute one of Britain’s biggest ever heists. This gang of misfit nasty ole robbers all seem to have been hauled out of their comfortable retirement homes, kicking and screaming, while constantly uttering an endless barrage of foul expletives - each trying to needlessly out swear the other. The only audiences likely to make it through this caper will be those hauled out of their graves, propped up in their seats with match sticks placed under their eyelids... much like this rusty ole gang. While supposedly based on fact, its mostly presented as a comedy caper (the scriptwriter even foolishly makes a reference to the classic ‘Lavender Hill Mob”) but then throws up sharp, jarring moments of hateful double-crosses, tipping this take of events off balance. One or two moments work but not nearly enough to keep us engaged till the somewhat cop out finale.  This looks like someone put the plots of multiple other heist movies on a table and invited a group of daft executive producers to pick the scenes they wanted to finance.  Perhaps only the performers got to laugh all the way to the bank  (or did they?)"}], "recommendations": ["21_jump_street", "free_fire", "guns_akimbo", "bad_trip", "baywatch", "the_men_who_stare_at_goats", "machete", "friday", "the_happytime_murders", "the_family", "superbad", "burn_after_reading", "paul_blart_mall_cop", "white_house_down", "the_hangover_part_ii", "keeping_up_with_the_joneses", "a_million_ways_to_die_in_the_west", "hall_pass", "the_spy_who_dumped_me", "barbershop_the_next_cut", "due_date", "dirty_grandpa", "pineapple_express", "jackass_presents_bad_grandpa", "rough_night"]}