{
  "id": 855,
  "title": "Kingsman: The Golden Circle",
  "starring": [
    "Taron Egerton",
    "Colin Firth"
  ],
  "runtime": 141,
  "genre": [
    "Action",
    "Adventure",
    "Comedy"
  ],
  "description": "When an attack on the Kingsman headquarters takes place and a new villain rises, Eggsy and Merlin are forced to work together with the American agency known as the Statesman to save the world.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/34xBL6BXNYFqtHO9zhcgoakS4aP.jpg",
  "categories": {
    "plot": 5.194805194805195,
    "acting": 5.277777777777778,
    "ending": 6.636363636363637,
    "soundtrack": 5.333333333333333,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.043478260869565,
    "action": 5.8478260869565215
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Can't understand any of the low scores.  If you saw the first Kingsman then you know what you're in for.  A fun ride with some never before seen stunts.  Funny, sad, poingant moments.  Unexpected twists here and there.  A new and very different villain.  Great tech and special effects.  All in all a fantastic movie.  Lots of laughs, over the top and very cool."
    },
    {
      "rating": "4",
      "text": "If you've seen the first instalment of this franchise and enjoyed it, then you'll be happy to know that this endeavour is much more of the same. However, in my opinion, the sequel is far inferior to the first outing and lacks that distinct sense of originality to fall back on. It boasts a superb cast including Colin Firth, Julieanne Moore and Halle Berry. In spite of the A-list actors involved; it never manages to use them to their full potential. As a huge fan of Julianne Moore, I was disappointed at how poorly she came across. I'd go so far as to say it's the worst performance of her career, and that's a crying shame for such a terrific actress. There's plenty of action, and the sets are all quite colourful though mostly tight spaced not giving us the illusion of a larger world even though the plot sets itself on a global stage.Overall, it's fast-paced and does have some semblance of a plot however rudimentary. I much preferred the first movie though and honestly doubt I'd see the third instalment should Vaughn decide to make one."
    },
    {
      "rating": "6",
      "text": "'Kingsman: The Golden Circle' is definitely more violent, more vulgar, more stylish, more sexually charged and more over the top than its 2014 predecessor (one of the biggest surprises in recent years), but all that unfortunately doesn't give us any of the good stuff in-between. Taron Egerton is back as Eggsy, still carrying the suave and stylish charisma that we saw from the end of the first movie, and he is attacked by a former Kingsman candidate, Charlie Hesketh (Edward Holcroft), it seems that he has some unfinished business with his former fellow candidate. It opens with a crazy and over-the-top car ride action scene, and Matthew Vaughn's directorial style is something we expect, and it does work well. The fast movements, the constant zooms and tracking shots, there is no denying that Vaughn can craft a well made and entertaining sequence. Eggsy still lives a quiet life, this time with his new girlfriend, Princess Tilde (Hanna Alstrom) and his pet dog, J.B. and he gets nervous as he has to meet Tilde's royal parents. The movie really grinds into gear as we meet our main villain, Poppy (Julianne Moore), who spends most of the movie's time alone and far away in a jungle somewhere that is populated by 1950s nostalgia, diners, theaters, salons etc. Her plan is to have every distributed drug in the world be containing an ingredient of her own, that lead to strange symptoms and slowly kill people. She attacks the Kingsman headquarters and only Eggsy and Merlin (Mark Strong) are the only ones left to find out who's up to this. They manage to find a Whisky bottle that leads them to Kentucky, where the company that makes the drinks turn out to be an American counterpart of the Kingsman service... otherwise known as the Statesman... headed by Champ (Jeff Bridges), and we meet his associates played by Channing Tatum and Halle Berry (both are wasted in their roles). But, the biggest surprise, though not a surprise because (for some reason) it was shown in the trailer, Harry Hart (Colin Firth) is back, but seems to have had amnesia since we last saw him. The movie brings us more of what we loved the first time around, except it feels like it drags a bit more... This is like a roller coaster ride that you want to hop on again, but with a few more things added in to make it more extreme, except is just isn't that fun. It's rather gimmicky. There's even a cameo by Elton John, but the novelty of his cameo wears off simply because he is in it for too long, and it doesn't feel as special as it should. The main villain played by Julianne Moore is too sadistic for this style of film. There is a scene where she punishes her victims by forcing them into a meat grinder, turn them into mince meat, which is then cooked into a burger, and makes her employees eat them. Are they cannibals? The reason why Samuel L. Jackson worked so well for the first movie is because he was so obnoxious, campy and flamboyantly over-the-top, that it suits. Moore's character belongs in those horror films that tend to get banned in some countries. Also, as I said before, she spends too much of the movie's time in her private sanctum. This is not a bad sequel, just a really over-charged one that is trying too hard to be violent and vulgar. Take another scene where Eggsy must track down Charlie's girlfriend at the Glastonbury festival, and they need to put a tracking device on her, only that the tracking device comes in the form of a condom that he must wrap onto his finger, and place his finger... well... you know where. Again, I feel that this was just a way to make the movie more hardcore and more adult, but ultimately, it was just trying too hard when it didn't need to. I'll give Vaughn credit for remaining as stylistic as ever, and the cast do a fantastic job, despite some underused actors. This is a movie I enjoyed for the most part, but it's too long, too hardcore, too over-the-top and just too... unnecessarily excessive. Keep some things subtle. Not every sequel needs to double on what made its predecessors so great."
    },
    {
      "rating": "6",
      "text": "While I wasn't too crazy for the first Kingsman film, I did enjoy the first movie. And I like this movie...to an extent. I wouldn't say it's as bad as what critics are making it out (even though the reception isn't terrible), it's passable more than watchable.Like many other sequels, this one falls under the pitfall of trying to match the first movie in terms of playing it safe recreating the memorable scenes and less of world building and continuing the story in an interesting way. Sure some of this movie's greatest strengths is what made the first movie great, balls out action sequences and a tongue-in-cheek take on Bond-esque spy movies, as well as it's major flaw in that the first movie was not as subversive as it thinks it is. However, like many sequels, the excitement is gone as we've seen what the first movie did as this movie tries to recreate the over-the-top bloodbath of the first. And unfortunately, unlike the first movie, the big bad is terrible! Julianne Moore, I will give her this, is trying with what she was given, but she wasn't given a lot. This movie tried to have a quirky villain like Samuel L. Jackson's character in the last movie, but instead of having the big bad be a threat to our heroes, like Samuel was, the big bad in the Golden Circle is about as threatening as a fly without it's wings. She's like a mom-type with a knack for 50s retro, but she's just too nice to be evil. Manic happiness can work as a threatening bad guy, but any menace for her character is completely gone. Again, the problem isn't Julianne Moore, she tries her best, but she was given little to work with. Also if you were looking forward to Channing Tatum in this movie, you'll be dissapointed as he's barely in it. He gets axed off (he didn't die, but was poisoned and put in a cryo chamber) and I guess were supposed to care for him but he gets little proper development. Hell the Statesmen in general feel like an afterthought than a fleshed out idea.Again this movie isn't bad. The action is still fun, there are some funny gags and scenes, and the returning cast (Firth, Egerton, and Strong) do a good job once again, and all the scenes with Elton John are pretty great, however there is little excitement to be had with this repeat of a movie. It's not bad, but there really isn't much to have me come back and watch it again. I can see some people enjoy this movie as it is watchable, but for me I think I'll just stick with the first movie."
    },
    {
      "rating": "8",
      "text": "I really enjoyed the first Kingsman and this one is every bit as good, regardless of the naysayers. Julianne Moore is delicious as the saccharin-sweet villain and Elton John throws F-bombs and a flying sidekick! Poppy's killer robot dogs are named Bennie and Jet, yes. There's another fun beat-on-bullies bar fight scene and the final fight scene is most excellent. Mixing in the Kentucky bourbon culture is also fun. But it's not all fun and games, the Kingsmen lose one of their own in a sacrifice to the mission. More fun, there's new tech introduced but if you're a Trump fan you won't like the not so subtle similarities and how he ends up - it's a leftwing looney toon dream, but that's all they've got. It pisses me off when idiot film-makers feel compelled to warp their films to make political statements but that idiocy reflects on them. Docked a point for that. In any case, still a bunch of fun."
    },
    {
      "rating": "8",
      "text": "A lot of people complain about how this film is more campy and less serious. But, that's why I like this one. I felt the previous film to be a bit atonal, unable to balance the seriousness with the comic campiness. This one I found to be more consistent.I accept this for what it is: a colorful thrill ride. There is good over the top action all around. Especially liked the villain's hideout being 1950's Americana-themed. Added a unique look.Digged Julianne Morre as the villain Poppy. She was the right balance of humorous and nuts. I feel credit should be give to Hanna Alström as Princess Hilde. They really evolved her role from her controversial bit part in the last film. Also, there is a celebrity in this who was very entertaining as he seemed to be totally game with what was going on screen. What I also liked about the film was its satirical look at the hypocrisy behind what substances should and shouldn't be illegal.I do admit there were a couple things that bugged me.  A lot of the female characters in this film were given short thrift and Channing Tatum was underutilized.Still I liked this overall. Just watch this if you want to have a fun time without thinking."
    },
    {
      "rating": "6",
      "text": "Too long -- the movie wears out its welcome around the 90-minute mark. Some of the set pieces don't work and why are Jeff Bridges and Channing Tatum even in this movie? Julianne Moore, however, is a delightful psychopath."
    },
    {
      "rating": "6",
      "text": "A definite step down as compared to the first one but while this one is more vulgar, over the top, and in your face when it comes to style. Its still a fun and wildly entertaining movie that is by no means bad, its just not that good to begin with. Channing Tatum and Halle Berry's character's are easily the most interesting new characters but theyre utterly wasted in their roles, Tatum moreso than Berry. The returning cast also does a good job but I liked Mark strong and Elton John's appearance the most out of all of them. My main problem with this movie is its excursiveness and desire to be bigger and badder than the first one, the pacing is also a huge letdown as the movie stands at almost 3 hours long when it didn't need to be that long to begin with. With that being said, its still by no means a bad movie, disappointing yes but not bad."
    },
    {
      "rating": "6",
      "text": "+Fun comic book style+Engaging cast+Excellent soundtrack+Fun action sequences-Suffers from a contrived plot-Hyperactive editing can distract at times-Irritatingly over-used familiar-ism 'bruv'Overall I enjoyed watching this movie. I liked that it wasn't afraid to embrace the silliness and so it plays out like a Saturday morning cartoon, with quick cuts between scenes and not much time to take in the scenery."
    },
    {
      "rating": "6",
      "text": "It's kinda entertaining with more actions than its predecessor. But they really went too ambitious to top the predecessor, the story just instead became messy and too complex. And they're really too focused on surprising the audience, the storyline itself became illogical. There are some unnecessary deaths that they showed just to surprise us. Also, the twist is cliche and not surprising. The good side here is that it's funnier than before and Julianne Moore really nailed the character."
    },
    {
      "rating": "6",
      "text": "As a huge fan of the first movie I went into this expecting a lot, sadly I was let down. The movie certainly has that great British humor that intelligent viewers love but the editing and perhaps directing of the film was piss poor. One can only assume that who ever was in charge had a serious case of ADD. Scenes would just end abruptly and jump somewhere else or casually change locations without rhyme or reason. Evil characters were never fully developed, lacking motivation and severely lacking energy. For crying out loud, the female lead villain barely leaves the damn kitchen where her only act of villainy is to make a damn sandwich! The whole cast of Statesman are grossly underutilized, and much like the villains never have their backstories developed. Even with a runtime of over 2 hours the director failed on so many basic levels. I am still giving this what I feel is a reasonable score as I did laugh out loud quite a bit at much of the humor and was happy to see the princess return. I hope that if a third movie is made they don't try to incorporate so many characters into the film which they have clearly shown they are incapable of handling."
    },
    {
      "rating": "6",
      "text": "The movie is an interesting experience to be had. But falls short of the  mark set by its predecessor. The action is an enjoyable spectacle,although the plot could have used some rewrites and more screen-time for characters whose motivations in the end are left unclear or do not make much sense."
    },
    {
      "rating": "5",
      "text": "I was very excited when trailers were released for this movie. I was actually enthusiastic for this sequel after liking the first so much. This movie looked over the top and action packed and I thought I was going to have a fun time. I was somewhat correct. While this movie had stellar action scenes, this movie lacks almost everything else. The story was basically a repeat of the first movie with new and returning characters. We are introduced to a new group of characters called the Statesman. With a nice collection of actors filling in the role you expect them to be a major part of the movie. Well... Not really. Elton John was a cameo for this film and was an extended joke that stayed too long in the movie. Even though his presence in the movie was appreciated, he had more screentime than a lot of the initial cast themselves. Some major complaints I have with this movie is that some of the characters were killed off unnecessarily and it's a shame some of them had to go just because the director thought it would add drama to the situation. Also, the Princess is back in this sequel after assuming it was a one-time ordeal but she's back, sadly. Another thing I despised with this movie is that they antagonized one of the newer characters that played a fantastic role in the movie but was sadly killed off in the end. Other than that, The humor in this movie was there and the soundtrack had some very nice selections. This sequel played it way too safe and was dumbed down and lacks the charm and style the first was known for. I can't say that I was happy by the time I left the movie theater but I can say that I was a little disappointed."
    },
    {
      "rating": "6",
      "text": "Kingsman - The Golden Circle is a huge bugget movie! It didn't have that spark that the first one had, but it was fun and intertaining! The most lovable person in the movie was Eggsy, but the most undeveloped person in the movie was agent Champagne (Jeff Bridges). I thought that he will be one of the most influencing characters of the movie! Kind of a dissapointment, but still... It was fun watching it!!"
    },
    {
      "rating": "6",
      "text": "Falls into the category of a poorly attempted sequel. Original was much better as this tried too hard to follow up. Raising the payroll to include bigger stars did not salvage the ho-hum story line. Sorry ...loved the original ...  tolerated this one"
    },
    {
      "rating": "4",
      "text": "The first Kingsman was a surprisingly fun movie that is highly enjoyable and entertaining. Kingsman two on the other hand is nothing like that. Similar to the first but ramped up to unbearable levels of stupid. The opening scene sets the bar for the rest of the film. I never knew you could fit that much CGI into one fight scene but wow you sure showed me. So were the stuntmen busy that day or what?Taron Egerton is back, doing the usual. Colin Firth is back (although he shouldn’t be for obvious reasons). Enter a new villain in the form of Julianne Moore doing her super smiley bad guy routine whilst wearing a pretty dress, apron and grinding people into burgers. Also enter the Statesmen. They’re like the Kingsmen minus the suits and permanently drunk. At least I hope they were drunk because I barely understood a word that came out of Channing Tatum’s mouth. In his first scene he swaggered in which resulted in an audible “whoo” from the two young ones in the row behind me. So while they were “whooing” I was wishing for subtitles.Take all the bad from every single James Bond movie, throw in some celebrity cameos, an unacceptable amount of robots and the word bruv every now and again and you have Kingsman The Golden Circle. It’s not totally without its moments, not every over the top fight scene is boring that’s for sure. Pedro Pascal slicing and dicing anyone he encounters using his electric lasso is not something you see every day. If you manage to ignore the storyline you might start to enjoy parts, particularly towards the later half of the film but honestly for me there was simply too much Elton John and robot dogs. Now there’s a sentence I never thought I’d say.No excitement, no danger, and without that it’s boring. The charm of the first one is long gone. I understand this is not a movie one should take too seriously but it’s insulting how mediocre and stupid it is. The first Kingsman set the standard and this sequel falls far below it. Disappointing and not recommended."
    },
    {
      "rating": "3",
      "text": "When people say they don't understand why other people hate/dislike this film, I think we are living on different planets. That is not to disrespect that people can have different preferences, but not being able to objectively see why a film is bad makes my head scratch. I like a lot of bad films (ie Transformers 2 - 3), but the difference is that I KNOW its a bad film. *see the subtle difference? With Kingsmen: The Golden Circle, this is objectively a bad film that you can enjoy, but any careful analysis would show that this is a film that is poorly written, poorly paced, unfunny and just not entertaining. The next question is why does it not work compared to the first film. As a disclaimer, I'm not the biggest Matthew Vaughn fan, but I genuinely liked the first Kingsmen, Stardust, Layer Cake and Kick-Ass which means I at least have some understanding what he goes for and the choices he make. The first Kingsmen was universally well liked, except for some who didnt like the vulgar humour which I can kind of understand. However, with Kingsmen the film had a heart and a very structured story that saw the development of a young lad to someone with responsbility and suave. It had interesting character dynamic, characters that were menancing yet hillarious, and mostly it subverted the typical spy genre with glaring over the top violence but done in a way that was original and realistic. Yet with Kingsmen:tHe golden circle (KTGC), this film lacks every one of those elements that made the first one worked.First, the script is a complete shambles. Without spoiling too much, this film felt exactly like Guardians of the Galaxy 2 where for almost 2/3 of the film there was little to not plot with random scenes justapoxed to create a barebone story. As from the trailer, we see the destruction of the Kingsmen (which is fine) and they go to America to find their counterpart, The Statesmen, for help. The start is okay because they at least set up the relationship between the characters and introduce us back the princess from the first film as the main lover which works at the start. However, once the get to America they basically spend a majority of that time talking and finding out that Colin Firth's character is alive and they spend pretty much half the movie trying to make him come back. This is half of the film. Then we get the traditional baddy fight and finding the McGuffin. A lot of what happens on screen doesn't make sense and there are some very poor choices in how characters die or appear in screen. For example, there is a certain rock start that just spends his entire time swearing, whilst funny at first, becomes very dry very soon before he randomly does a Cantona. Another character you think might be the main character, turns out to be just a cameo. The problem with this film is that it lacks heart and any sort of stakes as we quickly find out death is no longer an issue. Characters never explain their motivations and we actually spend more time with Eggsy and his princess than anybody else. The film also expects you to remember every minor callback from the first film with constant references to trivial things from the past whilst not developing them at all. Remember the amazing Church scene you saw, well how about every action scene in this film should be shot like that except its only 1 character versus 5-6 people? The script is so bad that it constantly relies on character exposition dumping what they are going to do next because they themselves don't know what is happening. Arguably what made the original Kingsmen good was that it was a subversion of the spy/action genre with good characters. You will not find any good characters in this film. They are all tedious, monotonous and dull. Some characters that almost have an arc become quickly reduced, whilst some having no arc are given one immediately by the end. Even as a squemish person of violence, I found this film had hardly any violence compared to the first film. Characters seem to appear and go whenever they choose and there is a lack of the 'real world' in this film. Sadly, Emma Thomson and Julianne Moore are reduced to nothingness, whilst other characters are built with shakey motivations and inconsistent actions that are never explained (Colin Firth shoots a character in the film but the film never explains why he does so except he believes so, and another character decides to their customer because they want to be known? but could easily just buy a legitimate company and be famous?) And the worst thing is that the world-building is non-existent.Overall, you can like KTGC, but don't say its better than the first film. Its not, you are just deluding yourself. If you are expecting an over the top film with silly gags, I would suggest something like XXX:Return of Xander Cage or Fast and Furious. At least those films are honest about what they are and you might be actually entertained. Don't let those fancy suits fool you."
    },
    {
      "rating": "2",
      "text": "The movie is nothing more than a cheap piece of crap-art, littered with F-bombs, gross-out violence, ridiculous special effects, a remarkably crude sex scene, and an asinine story line whose whole raison d'etre was to provide opportunities for the film makers to demonstrate their artistic vacuousness."
    },
    {
      "rating": "1",
      "text": "There are two films that I would give 100%, as in they do nothing wrong I can not fault them, and they are Terminator 2 and Kingsman: The Secret Service. So obviously I was pretty excited for the Kingsman sequel. But as an avid film goer, there is one film I've ever walked out of, and this is that film..."
    },
    {
      "rating": "7",
      "text": "So,Kingsman The Golden Circle... The sequel to one of the biggest surprises of 2014... Does it work at least? Ehh...Yeah,it has its pros and its cons,but i do feel like this is one of the most underrated movies of 2017. Going in i was literally worried about the movie but then i left the theater with a giant smile. Let's start with the pros: Going to a sequel like Kingsman The Golden Circle,you would expect some mind-blowing over-the top action,and so does this movie deliver,but (much like Atomic Blonde,another recent action flick) it suffers from a 50/50-like plot (50 with the action and another 50 where they were at least trying to sell a perfectly solid story,even if it kind of falls short). As i said,the action sequences were awesome to watch,but in some of the sequences you can easily notice the CGI randomness. Also,i do want to mention the soundtrack composed masterfully (as always) by Henry Jackman (the composer of X-Men First Class,another Vaughn movie). As for the acting,it seems that they TRULY want to make a good movie out of it,even if i didn't expect Channing Tatum to have a short screentime in every sequence he was in. Ok,now let's talk about the cons: This movie is 2 hours and 21 minutes long and overall it's enjoyable,but i do feel like some stuff could've been cut from the final 'theatrical' product (if they wanted to,maybe to make space for an Extended Cut of some sorts). Then there are the action sequences,where they did a good job with the cinematography,they almost did a 'headache-like' move on the Sound Effects (If you're an IMAX moviegoer to this movie,then i warned you). In the end,while it has it moments of rising and falling,overall,Kingsman The Golden Circle was good enough to entertain me from star to finish with some over-the top action,a good/weak plot and some solid acting."
    },
    {
      "rating": "0",
      "text": "I was so looking forward to this film and they killed it, dead. I left when Eggsy was having dinner with the princess and her parents. I just thought, this is not funny and if I leave now I can sneak into what-ever's playing next door. I am glad that I didn't pay full price to see 25ish minutes of this film. I do not recommend this film."
    },
    {
      "rating": "7",
      "text": "This movie is a fun film to just sit back and turn your brain off and enjoy.i personally am a big fan of the original Kingsmen movie, this film however does not improve or expand much upon the original , the story is very straight forward and cookie cutter; however it does have a twist i personally did not see coming with Whiskey working against the kingsmen.the film has a fair amount of star talent in it with: julianne moore, pedro pascal, halle berry, channing tatum, colin firth, mark strong and obviously the movies main man Taron Egerton. I believe some of these big names were not used as they should have as Channing tatum is in the film for all of 20 minutes. as well as Mark Strong being one of the main characters when he finally gets his out in the field start he is immediately ruined with a him going out with a bangit has a fair amount of comedy but also a lot of not so funny moments as the movie tries to use a semi serious topic as the main focus of the story arc, this paired with the cringe worthy and very awkward glastonbury festival scene  makes for some not so funny moments.As with the first film it has very well performed stunt and fight scenes and has a few moments which are nods to the original film.with this all said the film is good but not great and could have done with some more character development and a more expanded story."
    },
    {
      "rating": "9",
      "text": "I realy enjoy to see, it delivers the same quality than the first one , and it´s fun to watch with friends and family. it doen´t disappoints"
    },
    {
      "rating": "6",
      "text": "Better than the original as it doesn't wander off the path at the end.  The action sequences, and there are many of them, are all pretty well made.  Liked it more than I expected to."
    },
    {
      "rating": "4",
      "text": "For all of the people that are defending this movie for being \"meta\" and satirical of old, terrible spy movies, it's not satire if it succumbs to the same issues as those films. The action and Mark Strong's performance were its only saving graces and even those were ruined by crappy country music in the action scenes and Merlin's anticlimactic death while butchering a John Denver song. This is Matthew Vaughn's first sequel and it really shows, this movie is how to not make a sequel and I hope that Matthew Vaughn redeems himself with a good movie."
    },
    {
      "rating": "2",
      "text": "Bizarre movie with occasional fun sequences but includes galactic sized plot holes. I normally love this sort of movie but this thing was just embarrassing in many ways. Often you will find yourself completely puzzled in \"After Earth\" sorts of ways. The last hour I found myself wishing the movie would just end. Btw a fair amount of bathroom humor that is done in ways it hopes will shock you. Terrible stuff."
    },
    {
      "rating": "2",
      "text": "Unwatchable. Loved the first movie. Thought it was smart and wacky and a parody of classic spy movies. This one felt more like a poorly done super hero movie. The action sequences were mind numbing, the plot was completely unbelievable, and the violence was simply gratuitous. Walked out of the film when Halley Berry started explaining how magic gel saved Colin Firth's life. What a waste of a great cast."
    },
    {
      "rating": "0",
      "text": "Oh my god - this movie is a bloated, nonsensical monstrosity. This may be the worst movie I have ever seen in my entire life. The plot was laughable - a bizarre slow -speaking villain with a random (and unexplained) preference for 1950's themed decor. \"It's nostalgia\" she quips at one point - while speaking to robot-dogs with laser eyes who also have meat grinders in them (that's what you want in a robot-dog, obviously). The action is lousy and obviously green-screened - so badly that it's clear the creators had a \"we want to slap-you-in-the-face with our fondness for cheesy special-effects\" attitude. None of the characters make sense. I'm all for levity and non-sequiturs in film or TV -  but this is a movie is one giant non-sequitur masquerading as an action-movie starring Elton John..  no seriously. Elton John."
    },
    {
      "rating": "5",
      "text": "Kingsman: The Golden Circle attempts to shine like gold as the golden circle. Unfortunately, the result is nowhere near the shiny gold it should have deserved as the film tries to be a big improvement of Kingsman: The Secret Service. Kingsman: The Golden Circle deserves more than it gets."
    },
    {
      "rating": "5",
      "text": "Would it be fair to say that, even by a two-and-a-half-hour movie, that I walked out of the theater feeling a little cheated? After watching \"Kingsman: The Golden Circle\", I think I can say yes, it would.Picking up sometime after the events of \"Kingsman: The Secret Service\", \"Golden Circle\" finds Eggsy (Taron Egerton) and Merlin (Mark Strong) all alone after a hack into the Kingsman files by former recruit Charlie Hesketh (Edward Holcroft) enables a series of missile strikes that leaves the private intelligence service in ruins. With nowhere else to go they turn to their stateside counterparts, the Statesmen (Jeff Bridges, Pedro Pascal, and an underused Channing Tatum and Halle Berry), who assist them in bringing to justice the one responsible for the attack: Poppy (Julianne Moore), the leader of a mysterious drug cartel (the titular \"Golden Circle\") who plans to ransom the lives of hundreds of millions of people to the United States government in exchange for the legalization of all forms of narcotic substances. The thoughts of the President (Bruce Greenwood)? \"Pretend like we're going to give in, but we don't!\" In his mind, it's a win-win - no more drug users, no more War on Drugs. But if that's not enough for you, the movie desperately tries to find time to cram in \"relationship troubles\", \"I'm not given the respect I deserve\", and \"a traitor in our midst\" storylines that all feel half-baked at best due to the lackluster attention they receive, as well as a few GOTCHA! moments that aren't quite so and that the movie really could've done without (*cough cough* COLIN FIRTH... *cough cough*).I've never seen the first \"Kingsman\" (at least all the way through), so allow me to bring some objective criticisms against this film that in no way have to do with the original. First and foremost, nearly three hours' worth of movie is almost always too much, even in the best of cases (one of the main reasons I rarely watch my all-time personal favorite film, \"Pulp Fiction\"). One can't help but feel that had some of the fat been trimmed from this film it would have been better, but the bloated run time can't help making one wonder if screenwriters Matthew Vaughan and Jane Goldman simply threw every idea they had into the script and expected people to think that more is better. And speaking of both Vaughan and the idea that \"more is better\", cranking up the things people loved about the original - the high level of style, the humor and the kinetic action sequences - as far as they'll go and then breaking off the knob afterward has got to be a surefire route to sequel gold, right? Perhaps in terms of money-making opportunities, but it kinda sucks the soul out of the movie in the process (something mirrored in the \"Sin City\" series, with \"A Dame to Kill For\" trying to lay it on even thicker than its predecessor and failing) and doesn't leave you with much walking out of the theater. The large, unwieldy budget becomes much more noticeable here in the sense of several major action scenes (of which there are a whole gaggle) being largely CGI-based (and for such an impressive budget, you'd think they'd be a little more real-looking) and therefore losing the kinetic energy of the church scene from the previous film (one of the bits I have seen from the original). The heavy-handedness with which \"Golden Circle\"'s right-wing sensibilities are delivered also grow tiring at a certain point, having all of the misogyny, violence, drinking, and anti-drug preaching you'd expect from a Golden Age 007 movie. Some have pointed to the exaggerated caricature of the President as a critique of current POTUS Donald Trump, but when the visible symptoms caused by the toxins placed by Poppy into her product are introduced, you'd be hard-pressed to find a right-wing character affected, which suggests something of an opposite viewpoint.I must admit, however, I did have more fun at this movie than I anticipated I would for having been dragged into it - there are some good jokes in the film (When Eggsy and Merlin activate the doomsday protocol, they open a safe containing \"everything they need\" with just a bottle of whiskey inside; \"I suppose this is upper-class humor...\" Strong mutters bitterly); the soundtrack, while a little too on-the-nose at times, is well-suited to the film; some of the action scenes are, despite my previous railing, pretty fun; and the cast of fine actors make terrific company for three hours, particularly Moore, whose deliciously upbeat baddie is easily the best thing about the film. We also get, among other things, an Elton John cameo that figures largely into the plot's third act, so...There's that.If you want my honest advice? If you can't wait long enough for the next \"John Wick\" to get your stylized action fix, you'd be better off re-watching one of the first two and saving yourself the price of admission. Maybe check it out on Redbox if you just can't resist scratching that itch. 5/10"
    },
    {
      "rating": "8",
      "text": "Once again, they produced a really enjoyable film. These action scenes continue to be my favourite among any other film I've watched. There are a lot of 'because movie' moments but it's alright because of the way it's presented. But why did Elton John have more screentime than Jeff Bridges."
    },
    {
      "rating": "8",
      "text": "Fun movie and I liked it more than the first surprisingly also better than what I have seen all year and I did see all of the action movies this year (maybe John Wick being on about the same level) although it has not been a great year for movies. The action is over the top but it is what you should expect and it is well done. The plot is interesting and with enough touches not to make it too generic. The acting is good. The political undertones are annoying but they are there and should be expected from any movie in the near future thanks to Hollywood being anti-Trump; not realizing they are pissing off 60+ million people but the accountants will fix that eventually and maybe we can get real movies without politics."
    },
    {
      "rating": "0",
      "text": "In every way worse the original, pretty much garbage. If you liked it, that's fine. Just overindulgent, sequel set up, crap. Colin Firth tries to make it good but fails."
    },
    {
      "rating": "0",
      "text": "Просто ужас по сравнению с первой частью драки, шутки, злодей. По трейлеру всё спалили пошёл ток за первую часть"
    },
    {
      "rating": "7",
      "text": "A very fun movie. It is not a great movie, but the action is great, and it was hilarious. I would easily recommend it for any fan of the first Kingsman movie."
    },
    {
      "rating": "7",
      "text": "As with a lot of other cases of \"sequelitis,\" \"Kingsman: The Golden Circle\" doubles down on developing the plot and world at hand, in effect mishandling some of the more desirable elements that the 2014 predecessor possessed. Certain elements/characters from the first film are rightfully re-introduced, only to be immediately nixed from the plot five seconds later. Other, lesser elements/characters from the first film are re-introduced that I honestly could have done without. Certain seemingly important elements/characters are introduced in this film that immediately go away. Other seemingly less important elements/characters are introduced in this film and are given way too much screen time. Obviously, a lot of this can't be talked about without getting rather spoiler-y, so just know that there's a bit too much to be juggled this time around, and the narrative's integrity suffers because of it. However, while this is without a doubt a crystal clear case of \"sequelitis,\" I didn't say it wasn't an enjoyable one. Being a fan - but not necessarily a huge devotee of - Matthew Vaughn's \"The Secret Service,\" there was still a whole lot for me to enjoy here. From the always frenetic action sequences, to the charming lead performances, to the cheeky style of humor, there's enough here to get the job done. And while a few creative decisions here and there either left me scratching my head or feeling cold, the overall product is still wild, Matthew-Vauhgn-esque entertainment in its purest form."
    },
    {
      "rating": "7",
      "text": "Kingsman: The Golden Circle is a really great movie, with a good mix of action and humor, in my opinion. But still not better than the first one. The reason why is because they tried to hard to make it just as good and special as the first one by, for example, bringing back Colin Firths character Galahad, which they could have done a better job with in my opinion, and trying to recreate similar fight scenes from the first movie.Don't get me wrong, i still thinks it's a great movie and the fight scenes are still entertaining as **** to watch, but it really does not go all the way to be as good as the first one. One of the best movies this year and still better than Bond."
    },
    {
      "rating": "1",
      "text": "This movie is garbage. What it proposes as wit and fun action is nothing but dull dialog and overdone dumbed-down violence. It's the type of movie that appeals to a certain type of person. The loud talking, rude person being an ass in the theater, yeah, that's the type.And finally, it's anti drug message is outdated and another spit in the eye of any intelligent film viewer, or human being. \"Drugs are bad m'kay?\" Oh, wait, but alcohol is perfectly fine in any occasion! Yeah, you'll need a drink or two to suffer through this one."
    },
    {
      "rating": "5",
      "text": "Kingsman 2 is a step down from the first film with numerous elements that bog it down. Poppy was a weak villain, the lack of advertised Statesmen (Channing Tatum especially) the added subplots involving Eggsy's girlfriend and Harry's return/recovery added nothing in terms of emotion or weight to the story and the action scenes that rely on special effects are unfortunately very noticeable. Besides these issues, Kingsman: The Golden Circle is still a reasonable entertaining film in it's own right. It just doesn't come close to replicating the wild ride of the first film."
    },
    {
      "rating": "7",
      "text": "Good, to pass the moment. At the time I forget this movie that I do not happen the same with the first, this sequel is inferior. I liked the action, the comic moments and the performances (mostly Mark Strong and Elton John). The film was long and there are many characters that appear almost nothing (Channing Tatum, Haley Berry and Jeff Bridges totally wasted). Even so it is let enjoy and the 3D is of the best thing."
    },
    {
      "rating": "5",
      "text": "\"F**k you!\" - Quote by Academy Award Wining Elton JohnI remembered back on it's release of the first Kingsman and how refreshing it was. Nothing about it broke any ground and isn't flawless, but manages to have a unique quality by taking well known troops in spy movies, and putting it's own spin. The villain was threating, another underdog story and it following old spy tropes. Basically things that could've been bad if put in the wrong hands, turned into a surprise hit.\"The Golden Circle\" on the other hand is pretty much the adult version of Spy Kids. It focus more on jokes than brains. It dose what every sequel dose and that's try to be bigger and bolder. To be honest, it doesn't feel like Matthew Vaughn directed this and he normally avoids sequels, I now know why. Despite it not fully living up to the first, I still found enjoyment within the stupidity.Landing more into the guilty pleasure side of things.Taron Egerton, Mark Strong, and maybe Elton John were the highlights of the movie. Since Firth is absence for half of the movie, Egerton and Strong fill in that lovable chemistry that was in the first. Giving everything their got. And of course Elton John was great like always.Colin Firth and the character Harry Hart are what made the first film so great. Not the usual type casting for an actor like Firth and it surprised many of us. As I said before, he's mostly absence for half of the film until he finally comes back when the plot needs him. The whole thing with him being shot in the eye, however in the first movie you can clearly see the bullet going through his head and the idea of a evil twin brother doesn't sound too bad. Anywhere, none of it makes sense, but I'm glad to see him back even if he didn't do much.The actions scenes are once again top notch, especially the car chase at the beginning and final sentence. A little bit too quick to see things at times and I wish they was some build up behind it.While not as compelling as Samuel L. Jackson character, but Julianne Moore was pretty decent as the villain. Of course Moore puts it all into everything shes in. Playing the psychotic housewife stuck in the 50's and doing some graphic things to get her way. It's weird there's a point in the film where she completely disappears only to re-appear in the third act, and I forget she was in this at one point.The same goes with Halle Berry, Channing Tatum, and Jeff Bridges who are barley in the film. I heard there's a longer cut of the movie and I wonder if any of them had extra scenes, because who knows until actually get something. I mean, isn't Vinnie Jones suppose to be in this?The plot itself when reading it out doesn't sound like a real movie. Some have already said it's self aware and how it's spoofing old spy movie. I can see that, but the movie is becoming the thing it's mocking. Trying to be smart on the political side of things and failing hard. Force humor and call backs for no reason.But those are the problems I had which is quite a lot.Overall Rating: MANNERS MAKETH MAN. OR NOT."
    },
    {
      "rating": "8",
      "text": "Kingsman: The Golden Circle is a solid follow up to the original. It continues with good performances and fantastically executed action sequences. It's story has some cliched elements, but is still well written and concludes nicely overall."
    },
    {
      "rating": "5",
      "text": "Suffers from many of the same issues that its predecessor did, to a larger extent even, but manages to say afloat regardless due to reliably good performances and stylish direction. Nothing to rush out to see, but definitely watchable."
    },
    {
      "rating": "7",
      "text": "The Golden Circle is a great second part, but it is unfair to compare it to the first one, since they both have very different purposes. This second movie is very good, with great characters, a good villan, and moments of strong feelings. Hearing all of this bad reviews to the movie I feel it could be because they do not see it as a second part, when they expected another 1st movie. The problem maybe is that we were ready to see more Kingsman alone adventures, and expanding the universe do not gives us time to love the organization, but it is still fun, with the cousins. It is a great and fun movie, but do not see it as another like the first movie; see it as second part, with a more of everything."
    },
    {
      "rating": "7",
      "text": "По традиции сиквел всегда хуже оригинала, но все не так и плохо, очень хороший антагонист и красивая картинка, интересный сюжет, вызывающий двоякое чувство, на этом все плюсы заканчиваются. Из минусов только тупой юмор и проклятие трейлеров."
    },
    {
      "rating": "7",
      "text": "The movie is as over the top as the first one or even more. For a lot of people that may reach absurd levels but honestly, the folks who loved the first movie and it's satire essence, absurd fight scenes (however with way less gore than other movies with the same style) and it`s hundreds of jokes, will pretty much enjoy The Golden Circle.This film was a 7 out of 10 for me. I`ll start with the negative points. As shown in the trailer, Colin Firth's character is back, not a great fan of bringing a cool character back to life, as Valentine said after the church scene \"This ain't that kind of movie\" , for me, bringing Harry back takes back those words. However, his character works almost perfectly in the movie, a few things weren't as I would prefer, and with the exception of an issue that appears but then vanishes, his character works pretty fine. The Golden Circle has a LOT of sad moments but i believe the viewers weren't given the proper time to grief, the movie is big and that's understandable but still a point to mention. As seen in the trailer, this film has a huge list of famous names, but i get the feeling that 2 names were characters that had no time, the only statesman with a proper screentime is the one played by Pedro Pascal, I quite missed the presence of Tatum and Bridges. Finally and last thing to mention, the movie indeed repeats it`s predecessor formula. We have a bar scene, a water scene, a car scene, the villain's sidekick getting to fight a lot at the end. However, i must say that while watching most of this scenes felt fresh, when they star you get the feeling that it will be a repeated story but it has unexpected ends, i got myself multiple time shook during the movie, screaming at the characters \"please don't do this\" or \"omg i can't believe he is going to die\" so this is the point we get from the negative points to the good ones! Even tho people are saying that they weren't feeling for the characters, I personally got very worried about what was happening to them, the movie indeed falls for to many plot lines but this isn't as much bad as the rumors, maybe my final thought will be that they could have saved a few stuff for the 3rd movie, but okay. Besides those things i mentioned, the movie has a lot of humor, a lot of action, no church scene but that's fine. The discussion that the the villain brings up is very well fit for our society and I'm honestly looking forwards the 3rd Kingsman, I just hope they'll be fixing those problems but I'm not asking for another Secret Service cause to be fair, the greatest part of that first movie is that it came outta nowhere and people weren't expecting none of that, in other words, the element of surprise.PSIt has a very extreme scene related to jokes and sex, if u dislike the one at the end of the first movie you probably are going to hate this onePS 2Pedro Pascal is rocking his character herePS 3If you don't like over the top things then don't even bother to watch a Matthew Vaughn movie such as Kingsman, this one is more over the top than The Secret Service or Kick Ass, so come ready!"
    },
    {
      "rating": "9",
      "text": "Really do not understand the hate for this one. I loved the first Kingsman, and this is a worthy, funny, and incredibly fun follow-up, even if it's not quite as tight as it's predecessor. The new characters are awesome, the returning ones are still cool as well, the action is amazing, and for a 2 and a half hour movie this flies by. Bring on Kingsman 3!"
    },
    {
      "rating": "7",
      "text": "Not as good as the first, but still very entertainingRecreating the exact feeling of the original movie will never be possible. It was a new take on old things and that is what made it different. However, this movie was pretty darn good anyways.There were new characters introduced, and while I personally wasn't as enticed by the American brand of Kingsman, overdone cowboys with even worse names then the Kingsman. Even so I felt it was fairly funny. The storyline itself was similar to the first movie, but did have some interesting twists that included implying the horribleness of capitalism and a very pessimistic view of our government.There was a sex scene I was uncomfortable with, but I don't think it was rapey or as bad as others have talked about. The other item I disliked happened at the beginning of the movie and involved two close friends of Eggsy. I don't want to spoil things so I wont say anymore, but I was disappointed we didn't get to see more about them in this movie.While I said it isn't the same height of fun as the first one, it was a good, solid, funny spy movie. Not in the same class as Atomic Blonde, but they weren't trying for that anyways.The good: Funny, great fight scenes and I am fond of the Eggsy/Merlin interaction.The bad: The American stereotype was pretty basic, I wish they could have done more to either make the Statesmen from somewhere more traditionally Old West, or switch the character types out to something more Southern.I am definitely in for future movies for this series."
    },
    {
      "rating": "1",
      "text": "I think i fainted after maybe 20 minutes of watching. It's absolutely excessive and idiotic."
    },
    {
      "rating": "4",
      "text": "Kingsman: The Golden Circle is the sequel to the hugely successful Kingsman: The Secret Service (2015). This sequel is frankly not as good as the first movie, it didn’t even come close. Reasons; over-the-top action sequences, excessive and bothersome use of CGI, a disjointed plot line (unlike the coherently developed one from the first movie), and a crowded cast (there are movies that require or are enhanced by ensemble casts, this is not one of them). The whole movie seems like a rushed project."
    }
  ]
}