{"id": 3136, "title": "King Arthur", "starring": ["Clive Owen", "Ioan Gruffudd"], "runtime": 126, "genre": ["Adventure", "War", "History", "Action"], "description": "The story of the Arthurian legend, based on the 'Sarmatian hypothesis' which contends that the legend has a historical nucleus in the Sarmatian heavy cavalry troops stationed in Britain, and that the Roman-British military commander, Lucius Artorius Castus is the historical person behind the legend.", "releaseYear": "2004", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/5Mqmke8JKE7s8JeYNp7XtzxQXbL.jpg", "categories": {"plot": 6.037037037037037, "acting": 5.8, "ending": 6.142857142857143, "soundtrack": 4.0, "cinematography": 7.0, "familyFriendly": 6.0, "funny": 7.0, "action": 6.823529411764706}, "reviews": [{"rating": "8", "text": "This movie is full of fast paced action. It's a good one and the movie is fast going. The storyline is quite good, and it displays the brutality of war well. There are some sort of fantasy elements included in the film, hardly any though. The film is done well, and features lot's of action, and tell's the tale of King Arthur well, along with his knights. It's a very serious film but a very enjoyable one that can be watched many times over and over."}, {"rating": "8", "text": "This movie was an absolute travesty. Clive Owen did a horrible job of playing Arthur. Merlin looked like that homeless guy on bum fights. The fighting was excellent and realistic, and the storyline was believable, which is much more than can be said for typical Hollywood films. King Arthur was a completely enjoyable movie for educated men. It"}, {"rating": "6", "text": "its not my favorite action movie, but Keira Knightley is so frickin cute!!!!!"}, {"rating": "8", "text": "This was a great movie, no idea why It got such a low rating.The characters, and fight scenes made it fun to watch.I guess the complete story is nothing Original, but how many movies are?"}, {"rating": "10", "text": "This movie is VERY underrated. I believe it should be as remembered as the much as the movies Troy, Gladiator, LOTR, etc. Great soundtrack, great battles, fantastic storyline, and timeline with the Roman Empire is epic. Loved the acting, lived the actors/actress's, and loved how realistic it goes. Instead of being all about wizards and medieval magic swords, it's more into a realistic perspective. I found myself obsessed with this movie, still love it today and it think EVERYONE should watch it. Very historical as well. I don't like how it's so underrated and has so much hate towards it. Guess people are more into medieval King Arthur than this. This is a must see movie in my opinion. I LOVE this movie. Will always be one of my favorite movies of all time. I could watch it over and over again all day and night."}, {"rating": "0", "text": "This Movie was a disaster.It was completely anti-catholic.The catholic characters had completely ridiculous accents. Whereas Clive Owen sounded like a computer programmer from London on a 5 day work do to Scotland."}, {"rating": "0", "text": "Complete,abseloute rubbish.All i thought of this film was a complete anti catholic load of nonsense!Clive Owen (King Arthur) was a complete nerd who i wish died in the first battle scene.In all of Rome and Greece would fancy a gaul!!!"}, {"rating": "4", "text": "It was really cool to see King Arthur from a more historical viewpoint, rather than the mythological one that's been done and done. The movie had its moments, but overall it was pretty dull. I can't recommend something that put me to sleep."}, {"rating": "10", "text": "This movie was awesome-- I don't know how I missed it for 10 years. This is the only King Arthur movie that I've ever seen that was based in (arguably) textually substantiated history, actually mentioning the original record that Arthur was a Roman who became famous for fighting off the northlanders NOT for finding the holy grail. Lancelot was not added to the legend until much mater, so it was appropriate for them to relegate him to a supporting role like they did. The knights being pagans was awesome, as it is much more likely this was the case at that time in Britain. The portrayal of the vikings was very good. The fight scenes were good but not unnecessarily bloody.\r The people who rated this low obviously have no appreciation for a well written piece of historical fiction. The reason it \"doesn't follow the King Arthur story\" is most people have only heard the romanticized version. So they took out all the magic and made it more realistic. If that's all you have to complain about then go watch Sci-Fi/Fantasy."}, {"rating": "1", "text": "Waste of money.Waste of money.Waste of money.Waste of money.Waste of money.Waste of money.Waste of money.Waste of money.Waste of money.Waste of money.Waste of money.Waste of money.Waste of money.Waste of money.Waste of money.Waste of money.Waste of money.Waste of money."}, {"rating": "7", "text": "All in all, I liked this movie, although it got really dull and hard to understand at times. I know this movie puts down Roman Catholicism in a number of parts, but it's not offensive. I'm sorry you feel offended James, but face the truth: the Roman Catholic church did do a lot of things like that at the time."}, {"rating": "7", "text": "Now this movie was decent. It Offers a darker side of the tale as other reviewers have said and it has good action sequences as other reviewers have said. Now for everybody who things that this is anticatholic please shut up. During this time the catholics were on a rampage of rubbing out paganism so catholism would be the only recognized practice. I agree completely with guy. This is how the Catholics were in these times so get used to it. I think that some parts in the film seemed to have dragged on a bit and some parts to the myth weren't really addressed so i give this movie a 7. Not bad but could have done better."}, {"rating": "6", "text": "Despite some good battle scenes, King Arthur is ultimately a dull dissapointment. It doesn't really follow through on anything it presents, and none of the ideals were clear cut. Thus, there is little, if any, resonance, and when even the best battle are rolling, you don't care much. Kingdom of heaven, Gladiator, LOTR and even the underrated Troy are more clear cut, refined epics that do much better jobs."}, {"rating": "7", "text": "Confusing, and often a little hard to follow. There are some great fight scenes in this movie though, and I liked the new take on the story of King Arthur."}, {"rating": "6", "text": "It was ok but (and some huge buts) there is a lot of terrible acting through out the film. Clive Owen wasnt that good of a lead (which was rather suprising because I tend to like Clive Owen's films). The action sequences were too generic and slow placed. The script was terrible as well. Also it pretty much butchered the entire story of King Arthur.\r Suprisingly though it was still a somewhat likeable film for some unknown reason."}, {"rating": "7", "text": "Considering that I am entirely unfamiliar with Arthurian legend, the fact that this apparently has no resemblance to its source material is hardly a concern. Unfortunately, however, it seems as though the film has received quite the unfair shake because of its inaccuracy. Many reviews upon its release and to this day lament the fact that King Arthur (Clive Owen) was a Roman officer in the film stationed in Britain, though he was born a Brit. It is this historical inaccuracy that seems to have led many people to write it off and, unfortunately, it is not helped by the fact that it is directed by Antoine Fuqua and produced by Jerry Bruckheimer, who are certainly not names that inspire hope. Yet, somehow, King Arthur turns out alright in the end if you approach it will a clear mind. Featuring excellent cinematography, terrific battles, and good performances all around, the film may have an occasionally clunky script, but it remains a terrifically structured action film.The film's greatest weakness has to be its characters. As with many action films of this type, King Arthur suffers from not developing its characters nearly enough on an  individual level. Yet, it makes up for this with great group dynamics. The brotherhood between Arthur and his knights - Lancelot (Ioan Gruffuld), Tristan (Mads Mikkelsen), Gawain (Joel Edgerton), Galahad (Hugh Dancy), Bors (Ray Winstone), and Dagonet (Ray Stevenson) - is always top-notch. The friendship flows readily and any jokes play well due to the chemistry shared between the men. Yet, where this group development really works is in the action scenes as we see one of them engaging in battle. No matter who it is, we want to see them win or be rescued just before their certain demise due to the impact their death would have on their others. This film is much about the Knights of the Roundtable as it is about Arthur as there is no Arthur with his Knights and no Knights without Arthur. Together, they combine to form an excellent group of people that begin to falter when looked at on an individual level.The film's dialogue can also be quite clunky and its narrative is not always the best, particularly the awful narration at the beginning and end delivered by Lancelot that tries to communicate the legend of King Arthur because the rest of the film missed the mark on the topic. If there is any fault of the film it is the attempt to try and make it appear like a legend, even if the film itself is incredibly gritty and dirty. It tries to doll up a film not built to be dolled up and winds up missing the mark on the magical side of things entirely, while worsening the gritty side. This narration is the source of the issue and tries to tie the events we have and will witness into some overall legend that, during many sequences in the film, seems to be complete background noise compared to this gritty tale.That said, where this film truly soars is in the visuals. Fuqua's go to move here is to juxtapose the cold blues, greens, whites, and grays, of Britain with gorgeous bright orange fires or skies completely absorbed by a yellow ray of sunlight. Shots of Arthur and his men walking through the forest with snow falling and everything in the forest washed out in blue with just a hint of yellow peaking out from above is one such highlight. By the time they reach the camp, shots of the camp from a hill as it burns or of the Saxon army led by Cedric (Stellan Skarsgard) shown trampling around the green hills or entering the burning village with smoke billowing all around them, also create a sense of awe as we see not just beautiful images, but the size of the attacking army. Finally, shots of Woads, as led by Guinevere (Keira Knightley), shooting flaming arrows that, juxtaposed against the blue sky, seem to be falling from the sky itself, is incredibly striking. King Arthur's knack of stirring imagery, emphasized by an excellent blending of warm and cold colors, is what cements it is as a gorgeous film that really captures the eye.The film also greatly benefits from excellent action set pieces that make great use of Fuqua's astute eye for gorgeous images, while also crafting unique battles that entertain terrifically. Such scenes as the battle on the frozen lake show a keen sense of strategy and how to make a battle tense and well-staged. Taking its time to get everybody in position and not rushing through the scenes, the battles show a lot of attention to detail, even if they can get a bit absurd (breaking the ice with an axe). Where it gets silly, King Arthur manages to still entertain via excellent special effects and that aforementioned choreography, which simultaneous highlights the brutality of war, but also shows the grace and odd beauty of watching two armies clash."}, {"rating": "8", "text": "The movie is overall a great adventure centered around a group of warriors. The main character was not very interesting for me, kinda fell short and the supporting actors were much better. It has some nice battle scenes but it was a good guy always wins type movie. There are some casualties on Arthur's side but i didn't feel that deep sense of loss or revenge. The protagonist was pretty good and you got a sense of his overwhelming power but then it got disappointing in the battle scenes. the sword pulling scene was also very simple and to the point and not very dramatic. In the movie, about Arthur i still felt like i didn't know him that much to feel attached."}, {"rating": "7", "text": "King Arthur: 7 out of 10: If this movie was called Bob the Roman guy it would have been a lot better. Arthurian legend is often awkwardly forced into what is a decent dark ages romp.\r As a result you have Osama bin Merlin head of what I'm guessing is the Picts. (They are called the Woats but of course there is no such thing. They wear blue battle paint, which is historically accurate if you are doing a film about the Scottish. The Scottish watching a football match in the 1970's mind you.) Guinevere is now a leather bikini-wearing archer. And Arthur is a Roman commander fighting the Blue Meanies of the north. The Saxon's show up and try to kill everybody. So now in that timeworn movie cliché the two former enemies (Arthur and Merlin) have to combine forces.\r A lot of clichés are evident in King Arthur. The worst is the ahistorical screeching about freedom in what seems to be every fourth sentence of the screenplay. It's irritatingly repetitive, ridiculous (Arthur doesn't become President Arthur after all or as Monty Python put it \"How did you become king anyway I didn't vote for you\") and it leads to one of the unintentionally funniest scenes ever in a major motion picture release. (As King Arthur gives an almost word for word homage to Mel Gibson's stirring Braveheart battle speech the camera pans back and instead of revealing an army of thousands it has five lone guys. They might as well have been holding coconuts.)\r Yet despite all this and an ending that reminds one of Kevin Costner's Robin Hood I actually enjoyed myself. The battle scenes were well done, the acting okay and the story moved along nicely.\r Like Troy the flaws of the movie add a humorous dimension to the proceedings. Plus it has an incredible ice battle unmatched outside of Russian cinema. And don't forget we fight for FREEDOM from the unrepresentative Republic of which I am a commanding officer so we can create an absolute monarchy with a round table."}, {"rating": "7", "text": "A movie of the legend of King Arthur with the bold and interesting choice to tell a fictionalized story that could have happened behind the legends. It has no supernatural elements and does not use many of the tropes of the legend. It is set in the fifth century were the western Roman empire is declining and is withdrawing from Britain (The decline happened in real life too ending the western Roman empire and the withdraw has happened a few decades sooner). It is the story of the half British Roman commander Artorius Castus who is the leader of a group of Sarmatian knights. The Sarmatians were defeated by Rom but because their horsemanship impressed the Romans they were left alive and their children were drafted as auxiliaries into the Roman army (In real life for many foreigners this was the best way to get the valuable Roman citizenship). He and his man are persuaded by force into a last mission to safe a member of an influential Roman family from north of the Hadrians Wall (Defense wall against the barbarians and border to the uncivilized world in Roman viewpoint). However the Romans leaving Britain is watched by many as opportunity. There is no power vacuum that will not be filled sooner or later. Here the actual story starts and I wont spoil it. I think it is a refreshing take on the legend as the story itself delivers. I will however also point out that it is a mixed blessing as there are established expectations if you name something King Arthur. This could evenkill the movie for some people. The characters are likable and their heroes journey or character development is believable. Clive Owen as Artorius delivers a good performance. He is a humanly character and strong leader. The Samratian Knights with Ioan Gruffuldd as Lancelot, Joel Edgerton as Gawain, Hugh Dancy as Galahad, Mads Mikkelsen as Tristanand Ray Stevenson as Dagonet are good too but fail in comparison to the legend. Here the decision harmed the characters without a misstep by them. The legendary knights of the round-table are just bigger than real life;-). Keira Knightly as Guinevere fully won me over. She is a bad ass female warrior you never want to face against. Stephen Dillane is an interesting Merlin. He delivered without the supernatural elements and this deserves credit at least by me. In general it is a decent to good performance. There are a few weaknesses but they don't drag this movie down. The costumes, weapons and sets look good. Again they went against the established King Arthur tropes. It looks good but is not that much accurate which is completely O.K. for an entertainment movie. Could not hold this against it if it is no documentary. There was also the claim that this movie was a plagiarism of “The Last Legion” which is by the way another good movie (Have yet to read the book). I think there are some familiar themes but I am not qualified to judge it at least from a legal point of view. Overall this was an interesting experience. I will say it is a worthwhile movie with some good parts. It is also not great enough to leave an imprint. Worth watching but should not end on your top 10 lists."}, {"rating": "7", "text": "I found this film to be an interesting take on the King Arthur legend.  Although, it was lacking in some areas, the cast did a superb job of taking us into the Dark Ages."}, {"rating": "10", "text": "Guess most Users don't like a different take on history; I like that.  Who really knows what happened a thousand years ago?  I thought this was going to be Camelot but no.  We're talking a whole new ballgame here.  If you want to see familiar names in unfamiliar circumstances, this is for you.  I don't have a lot of DVDs but this one is in my collection."}, {"rating": "5", "text": "\"King Arthur\" claims to be \"the untold true story that inspired the legend.\" In the name of accuracy, apparently, some familiar legendary elements have been altered or dropped altogether. Merlin (Stephen Dillane), it turns out, was not a magician but the shadowy leader of the Woads, a guerrilla army of Pictish freedom fighters with stringy hair, blue faces and tattooed bodies. Since the knights of the Round Table are stubbornly pagan (and skeptical of their leader's Christianity, which is wobbly at best), they are not about to go off in search of the Holy Grail. And though Lancelot (Ioan Gruffudd) at one point casts a smoldering glance in the direction of Guinevere (Keira Knightley), nothing more comes of the mythic triangle of king, queen and knight. Lancelot, in any case, is more of a fighter than a lover, and so, in spite of an obligatory cuddle with Arthur on the night before the big battle, is Guinevere.\r Historians will debate the veracity of all this, assuming they have nothing better to do. But it will be clear to most moviegoers that this true story, far from being untold, was inspired by at least a half-dozen previous movies, from \"The Seven Samurai\" to \"Braveheart.\"\r David Franzoni, the screenwriter, also wrote \"Gladiator,\" and Clive Owen's Arthur, like Russell Crowe's Maximus, both faithfully serves the Roman empire and turns against its authoritarian abuses. He and his knights are sent on a rescue mission that recalls the one undertaken by Bruce Willis in \"Tears of the Sun,\" the previous movie directed by Antoine Fuqua, who directed \"King Arthur.\"\r Really, though, originality is not the point of this movie, any more than historical verisimilitude is. It is a blunt, glowering B picture, shot in murky fog and battlefield smoke, full of silly-sounding pomposity and swollen music (courtesy of the prolifically bombastic Hans Zimmer). The combat scenes, though boisterous and brutal, are no more coherent than the story, which requires almost as much exposition as the last \"Star Wars\" movie. Luckily there is an element of broad, brawny camp that prevents \"King Arthur\" from being a complete drag.\r In this version Arthur's knights are a ragged band of foreign conscripts stationed in the shadow of Hadrian's Wall, where they fight an occasional skirmish with the pesky Woads, who gyre and gimble in the wabe. Arthur's mixed parentage — he is half Roman and half British — results in an identity crisis as he simultaneously grows disillusioned with the corruption and cruelty of Rome and succumbs to Guinevere's Woady charms.\r Arthur's men, for reasons efficiently explained in the first 10 minutes of the movie, are required to serve the empire for 15 years. They complain about the English weather, which was even drearier back in the fifth century, but their devotion to Arthur is absolute. Although they have earned their freedom, the knights are sent off on one last mission, which acquaints them with both the evils committed in the name of Rome and its church, and with the threat of the Saxon invaders, who are waging a vicious war of conquest with armor-piercing arrows and the scariest blond hair extensions since \"White Chicks.\"\r Cerdic, the Saxon leader, is played by Stellan Skarsgard, whose halting, throaty delivery and gleefully hammy villainy confirm his stature as the Swedish Christopher Walken. Cerdic's lieutenant is his son Cynric (Til Schweiger), who sports a spiffy plaited soul patch and a slightly different accent, and who leads the Saxons into a battle on the ice that is the film's most original and satisfying set piece. The rest of it is mostly grunting, roaring and hacking, conducted by some fine, cheerfully slumming actors, notably Ray Winstone (as a lusty, cantankerous knight named Bors) and Mads Mikkelsen (as the enigmatic Tristan).\r Arthur, who will somehow establish freedom for England by being declared its king, is a worrier as well as a warrior, and Mr. Owen brings a certain wariness to the role, as if he were, like his character, reluctant to commit the full force of his charisma to a cause he doesn't quite understand. Ms. Knightley, on the other hand, throws herself bodily into every scene, sighing her way through the gauzy love-making montage and appearing at the climactic battle the next morning in face paint and a smashing leather combat brassiere, hurling herself at the Saxon invaders with full-throated Woad rage."}, {"rating": "5", "text": "The slew of character actors at the round table leave no impression, generating the kind of faceless non-specificity that often infects historical epics. Listening to a parade of well-meaning but sub-par actors drone on in generic British accents about a pointless territory dispute just doesn't get me going."}, {"rating": "4", "text": "This is one more of those films that, under the popular saying \"behind a lie there is always a true origin\", seeks to reinvent a classic story, giving it new surroundings and new characters seemingly more realistic and historically accurate. It is a high but calculated risk because if there is a myth about which many alleged historical origins have been pointed out is the King Artur legend. The film is set in the final centuries of the Roman Empire and depicts the abandonment of Great Britain and Hadrian's Wall. Artur is transformed into a hired knight who serves the Romans and that it has the duty to protect a pope's favorite (at that time Christianity was already the official religion of the empire, although Celtic paganism still prevails In the British Isles) from the Saxon incursions. Obviously there are historical errors, more or less obvious, but this is not as glaring as the absence of epic sentiment in a movie that tries to be epic and never succeeds. There are even some scenes that have been ruined by minor details such as incomprehensible battle cries or cries in Latin that are never properly translated or subtitled, and which end up appearing ridiculous.Clive Owen is good at action scenes but lacks the presence and charisma that his character demands. Arthur's knights are never developed individually except for Bors (Ray Winstone) and Dagonet (Ray Stevenson) although they are usually played by talented actors, eventually becoming highly secondary characters. Keira Knightley, an actress used to period films, played Guinevere, a character who does not suffer from the same lack of development but has been poorly thought out, overly masculinized, very stereotyped and sometimes sexualized, in a development line that ruins later attempts to make credible her wedding with Arthur, a character who spends the entire movie without any romantic chemistry with her. The film is slow and boring at times, but I dealt very well with it.In conclusion: it is a film with an interesting story, which entertains the audience, but that is far from good."}, {"rating": "3", "text": "Stagy and over-act, story developed unnatural , fight scenes were so-so and music was just fine."}], "recommendations": ["the_eagle", "hellboy_ii_the_golden_army", "centurion", "the_lord_of_the_rings_the_two_towers", "enemy_at_the_gates", "troy", "captain_america_civil_war", "the_monuments_men", "conan_the_barbarian", "the_last_duel", "the_lord_of_the_rings_the_fellowship_of_the_ring", "the_league_of_extraordinary_gentlemen", "captain_america_the_winter_soldier", "valkyrie", "red_tails", "pearl_harbor", "master_and_commander_the_far_side_of_the_world", "the_patriot", "lord_of_war", "the_magnificent_seven", "wonder_woman", "the_man_in_the_iron_mask", "12_strong", "exodus_gods_and_kings", "300_rise_of_an_empire"]}