{
  "id": 3791,
  "title": "Kiss of the Dragon",
  "starring": [
    "Jet Li",
    "Bridget Fonda"
  ],
  "runtime": 98,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "Liu Jian, an elite Chinese police officer, comes to Paris to arrest a Chinese drug lord. When Jian is betrayed by a French officer and framed for murder, he must go into hiding and find new allies.",
  "releaseYear": "2001",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/A1GrGdX4AgCRDweg9X3x8JsZrEc.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 7.666666666666667,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "8",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."
    },
    {
      "rating": "8",
      "text": "Action flick with sentiments emotion good film remarkable dont miss this one must look and must have DVD of this film.HATS OFF Jet li is outstanding his good reflexes quick moves are very unique."
    },
    {
      "rating": "10",
      "text": "Kiss of the dragon has plenty of action, the plot isn't original but it didn't have to be. The movie isn't his best\rmovie, but the movie comes close to Unleashed on the action level."
    },
    {
      "rating": "8",
      "text": "hihjihhugyguhiihjuytrreeedxxcvbnjjhhggffdsyguhihkhkhjgydtgugihimmkkoppohihubyftdrgdsseyyttrrffhjhjftdthinojjoojk"
    },
    {
      "rating": "5",
      "text": "If you're into action packed films with lots of fighting and a weak plot then this is the film for you.I wasn't to keen on this film but I know many men who like it so I'm thinking it might be something to do with it being full of fighting which I'm not too keen of. It's also something for 'Jet Li' fans as he is the main character in this film so appears in it throughout the whole film. I'm giving it a five due to my opinion of that type of film not the film itself. So others are bound to disagree with me."
    },
    {
      "rating": "0",
      "text": "Ceci est une production... euh une déjection de la boîte de Luc Besson, Europa Corp. Et là normalement on a tout dit et d'ailleurs tout est dit.On peut préciser néanmoins qu'il s'agit du sympathique Jet Li qui joue un Chinois invité en France et accessoirement un super flic ou agent -ou un super quelque chose tout du moins- venu distribuer des coups de tatane pour la gamelle.Peut-être qu'on ne l'avait pas prévenu qu'il ne s'agissait pas d'Hollywood et que cette infâme bessonnerie ne servirait à rien pour son image, bien au contraire... Le non moins sympathique Tchéky Karyo joue pour sa part le méchant de service, caricature ambulante et reflet de l'ensemble du film, lui-même caricature ambulante ou plutôt déambulant dans le ridicule permanent.La petite Gadget Fonda est de la partie mais ne reste qu'un gadget, elle aussi à l'image de ce film écrit avec le fion, un \"film\" qu'on oublie au fur et à mesure qu'on le regarde ou qu'on tente de le regarder parce que franchement, c'est trop dur de regarder \"ça\"."
    },
    {
      "rating": "10",
      "text": "My favorite Martial Arts movie. Became a big fan of Jet Li after this movie but I thought overall the story did a great job of creating tension, drama and overall Justice Porn."
    },
    {
      "rating": "7",
      "text": "A kick ass action movie that is one of Jet Li's better american movies. You should watch it if you like non stop action films."
    },
    {
      "rating": "10",
      "text": "Man I f....n loved this movie!!"
    },
    {
      "rating": "10",
      "text": "Man I f....n loved this movie!!"
    },
    {
      "rating": "10",
      "text": "Man I f....n loved this movie!!"
    },
    {
      "rating": "10",
      "text": "Denise, ur crazy.. this movie is awesome!!.. Jet Li is the BEST!"
    }
  ],
  "recommendations": [
    "the_forbidden_kingdom",
    "fearless",
    "shang_chi_and_the_legend_of_the_ten_rings",
    "the_scorpion_king",
    "the_foreigner",
    "predator",
    "dredd",
    "last_action_hero",
    "true_lies",
    "ninja_assassin",
    "hulk",
    "rambo_last_blood",
    "top_gun_maverick",
    "kung_fu_panda_2",
    "desperado",
    "gangster_squad",
    "hercules",
    "kingsman_the_secret_service",
    "the_expendables_2",
    "man_of_tai_chi",
    "the_one",
    "jiu_jitsu",
    "robocop",
    "the_expendables",
    "indiana_jones_and_the_temple_of_doom"
  ]
}