{
  "id": 531,
  "title": "Knight and Day",
  "starring": [
    "Tom Cruise",
    "Cameron Diaz"
  ],
  "runtime": 109,
  "genre": [
    "Action",
    "Comedy"
  ],
  "description": "A fugitive couple goes on a glamorous and sometimes deadly adventure where nothing and no one – even themselves – are what they seem. Amid shifting alliances and unexpected betrayals, they race across the globe, with their survival ultimately hinging on the battle of truth vs. trust.",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/a7JmOBMNj5erYTgt4u1mQgvHItu.jpg",
  "categories": {
    "plot": 6.2631578947368425,
    "acting": 5.466666666666667,
    "ending": 6.6,
    "soundtrack": 4.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.7272727272727275,
    "action": 6.513513513513513
  },
  "reviews": [
    {
      "rating": "5",
      "text": "\"Knight and Day\" is a mediocre movie at it's best. The dialogue is either very \"Charade\"ish or slick talk with feasible words. The stars also may appeal to you or not. Tom cruise and Cameron Diaz may be a sexy couple or just aging veterans having their last screentime. It's a movie where I can't really judge with optimism; it's one of those movies where you decide it."
    },
    {
      "rating": "7",
      "text": "Well done popcorn flick -- Tom Cruise makes it work. Fun movie for a date."
    },
    {
      "rating": "5",
      "text": "Cruise manages the scenes like an artist with smooth easy strokes that turn into dashing splashes of color. As his opposite Diaz is sunshine on top of dismay. I'm a guy so Diaz takes my breath away. Tom is trying to explain but keeps getting interrupted. After time she begins to get it and the progression is great fun and well timed. As others have pointed out the end feels rushed but after soaking up all that sunshine you feel it should go on much longer. If you enjoy Bond movie's or just about any bang up movie this is great. Ignore the comments about poor execution or poor CGI. The film is at it's best with bullets flying and Diaz."
    },
    {
      "rating": "6",
      "text": "Pretty short and has almost no story or anything, but still worth watching. It's so shallow and almost completely opposite of sophisticated and clever, which is good for some because it's simple to follow and easy to watch for everyone. But it's so un-serious that it has so very little content. Still, some good scenes throughout."
    },
    {
      "rating": "5",
      "text": "Kinght and Day is just you average action movie mixed with some stupid comedy. Again we have two big actors that gives us nothing new. My as well have put nobodys and save some money. Average to say the least."
    },
    {
      "rating": "10",
      "text": "Absolutely brilliant! funny as it is exciting!"
    },
    {
      "rating": "4",
      "text": "A bland, uninspired and unfunny attempt at an action-romcom in the vein of \"True Lies\". Watchable only if one is extremely bored and in a totally undemanding mood. A waste of almost everything."
    },
    {
      "rating": "7",
      "text": "Did he train you? Did he rehearse you? Did he tell you what to do and what to say? These questions, of course, are part of the famous speech that Jimmy Stewart delivers to Kim Novak in Alfred Hitchcock's \"Vertigo\", just before Scottie Ferguson loses Judy for a second time, this time for real, when Madeleine's ghost plunges from the mission tower to her death, the end result of Stewart's character's inability to deal with the intrigue between his obsession and Gavin Elster(Tom Helmore). She fell from a high place, and she fell hard, just like Tom Cruise, a man who knows a thing or two about vertigo. Cruise, fresh off his bravura comic performance in Ben Stiller's \"Tropic Thunder\", where the former mega-star didn't quite look like himself as a Hollywood producer, looks exactly like the actor we remember from the last century who danced in his underwear, as \"Day and Knight\" outfits the \"Risky Business\" star with the right hair, the right clothes. and most importantly, the right elan to ingratiate our Tom with the moviegoing public who finally grew tired of his public persona. From the first moment we see Cruise surveying the airport for a mule, it's as if he emerged from a puff of green smoke; it's as if he never jumped on Oprah's couch; it's as if he never lamblasted the mental health profession. But alas, moviegoers have long memories. Scottie's questions are our questions, as we receive each new Cruise performance; pointed questions in reference to his guru, the science fiction writer who founded The Church of Scientology. Playing a rogue FBI agent named Roy Miller, Cruise, who alienated so many people(starting with Brooke Shields) because of his disdain for anti-depressants, in \"Knight and Day\", on a subtextual level, loses the ideological war with the psychiatric profession, as its Roy's job to keep the Zephyr(a self-perpetuating battery) stable, a job that he's unable to perform. The Zephyr becomes unstable; it blows up. Roy has a manic quality about him. Most tellingly, Cruise comes close to performing a Nazi salute when he tells June(Cameron Diaz) about her odds for survival, both with or without his protection. It reminds the moviegoer that Scientologists believe psychiatry to be a \"Nazi science\". So how is \"Day and Knight\" most like \"Vertigo? It's the scene where June wakes up in a red bikini on Roy's secret island; he saw her naked, just like Scottie, who changed Madeleine's clothes after she had jumped in the San Francisco Bay. But then \"Day and Knight\" goes one step further, as June returns the favor, clothing Roy in shorts during his blackout. He's **** like a Hitchcock blonde, just like Kim Novak. June sees Roy, sees Cruise, at his most naked. Perhaps she cured Roy/Tom of his vertigo."
    },
    {
      "rating": "4",
      "text": "As an acting duo, Cameron Diaz and Tom Cruise are effortlessly fantastic, they make an elegant eloping couple but it is the storyline that is what lets this film down. The action is non-stop, with a hint of sexual tension here and there, but the action is just your standard bullet-in-chest violence, nothing will really make you think \"cor, I bet that hurt\". The comedy is tongue in cheek, all the best bits were in the trailers and Cruise's patronising tone just really didn't do it for me. This almost out-law couple film never really gives away why it is called 'Knight and Day' either, despite the use of a small knight figure to hold Miller's secret.So, I ask myself, are Diaz and Cruise just getting too old for this? Cruise's flash of flesh in the beach scenes could not hide the wrinkles that are starting to appear around Diaz's eyes. When it comes down to what the audience want, it's definitely not older generation actors trying to jump around when they clearly aren't made for the action any more. Not saying they've done their time, but there were plenty of younger actors and actresses that could have made this a sexier and must more aesthetically pleasing film. A bit of a downer on the plot was Diaz being constantly drugged because she couldn't 'cope' in the midst of the action. Alas, it felt like half the action was missing because she was passing out! The audience never saw Miller getting out of a violent situation completely, and just goes to show that Diaz never stopped being the damsel in distress since Shrek.At times the entire film felt a bit of a joke, almost like a mockery of the whole action genre itself, the way Cruise talked sarcastically in spy terms and the unsuitable soundtrack that meant every gunshot and explosion could be predicted. For a 12A, I expected nothing less, but for Cruise's comeback I expected more. I think James Mangold could have made this film a lot darker, particularly concerning Miller's family who we barely see any of. The plot overall is so simple you won't even need to pay attention half the time. There was far too much CGI and green screen noticeable, it was disappointing because a lot of the stunts on the motorbikes were impressive.If it was this or A-Team, I would have chosen A-Team. Knight and Day is too easy on the eyes and won't get you thinking like Inception, or even Toy Story 3! Just don't bother unless you really have to."
    },
    {
      "rating": "3",
      "text": "This movie would have been a hit 15 years ago. Diaz is no longer the beautiful innocent looking girl and Cruise has had his best time as well. The special effects are dated and the plot is very thin. Both actors will have to do a lot better if they want to return to the front row of the Hollywood class."
    },
    {
      "rating": "2",
      "text": "After the first five minutes, the movie loses all sense of its own reality and you're trapped in one sequence after the next. The movie never gets the audience involved (there's no suspense) nor is there ever any significant emotional connection with or between the characters. And should you be cheering for Tom Cruise? Cameron Diaz? Both? It just all seems absurd which is sad."
    },
    {
      "rating": "7",
      "text": "Remember Kate Capshaw in the second Raiders of the Lost Ark movie?  She constantly ran around screaming hysterically like a Banshee and ruined the movie?  Well, Cameron Diaz is channeling her in this movie.  She's a little too much BUT not to the extreme that Kate Capshaw was, and thankfully Tom Cruise is good as usual, and the two do have some chemistry.  Not a great film, but never boring and completely watchable."
    },
    {
      "rating": "8",
      "text": "funny with some very exciting fight scenes, one of the very few movies that i like cameron diaz in. Tom Cruise was great as usual. The only thing keeping it from a 10 is the Graphics some scenes i thinnk 1st grades could have done it better. in the end this movie is definaly worth watching."
    },
    {
      "rating": "9",
      "text": "An all around solid film. Funny and filled with good action. People need to stop hating on Tom b/c he had one or two awkward public moments and just accept the fact that he's a great actor."
    },
    {
      "rating": "3",
      "text": "Knight and Day is a film that follows a spy and a surburban woman through intense comical expeditions throughout the world. Tom Cruise plays the spy (which makes the film interesting already), and Diaz along his side for the ride, in which she seems like she doesn't care what her fellow does except shooting bad guys and \"re-enatcing grand theft auto on the I-94\" makes the film a complete trainwreck but at the same time, addictive. Director James Mangold makes the film into an ongoing compilation of barely comical scenes with a nice heaping of action to compensate. Bad scenes for 2 hours and 10 minutes, and a dose of Diaz and Tom Cruise makes the film a \"No\". Go see something else."
    },
    {
      "rating": "4",
      "text": "Just another action flick with a spy and a chick, but what stands out in this is the pair of irresistibly charming Tom Cruise and Cameron Diaz. Knight and Day was helped by the cast but too formulaic to be better."
    },
    {
      "rating": "10",
      "text": "This is a great movie!  I wasn't expecting much, but I was really pleased.  It's everything an action movie should be.  The characters are compelling and I was never bored once."
    },
    {
      "rating": "6",
      "text": "Yes, Tom Cruise is a knight in shining armor. Yes, Cameron Diaz is still looking fresh in daylight. If you are looking a movie to have fun with, thiz movie is definitely the one. It is a typical Hollywood popcorn movie. The storyline is predictable, the sequence is easy-watching, the comedy is corny, the action is absurd and they rely much on charisma of two main Casts, who in thiz case are Cruise and Diaz. Thiz is their second rendevouz. In VANILLA SKY (2001), the atmosphere was gloomy and serious, so people kept thinking how about to put them in another situation. We knew Cruise was an extreme adrenaline junkie in a real life with his motorcycle collection and extreme sports fan. Thiz movie is absolutely the perfect vessel for him to do what he always desires to do, for me thiz will be his trilogy extension of MISSION IMPOSSIBLE (1996-2006). Diaz is charming as always and could merge into any kind of character. The most important thing, she looks like to have fun with her character, for me thiz will be her dwilogy extension of CHARLIE ANGELS (2000-2003). I have to say, even without any addition, The Star-Power of these two main Casts were very powerful. The Director is James Mangold, a talented drama Director (GIRL, INTERRUPTED (1999), IDENTITY (2003), WALK THE LINE (2005), etc.), who tries his luck in action movie like thiz. In the other hand, some people say, movie is for fun. In that case, thiz movie was extremely effective and entertaining. The movie will make you forget how things happen, if you are one of the viewers that emphasizes fun factor as your needs. Well, just buy a ticket, buckle up, and enjoy the ride. At least, thiz one will be one-ride roller coaster fun and that is it!\r Visit My Blog on JONNY'S MOVEE : http://jonnyfendi.blogspot.com"
    },
    {
      "rating": "5",
      "text": "Besides being just okay, it has a good charisma of the actors, but with a narrative with more action than brain. Thus it was far away from their potential. If they had invested in the screenplay like invested in special effects, the movie would have been more inexpensive and way better."
    },
    {
      "rating": "5",
      "text": "You know what your getting with this film. Lets be honest, action-comedies dwell in the good to very bad range of cinematic quality. Never very good, great or very great, but they serve their purpose and I suppose that's precisely what Knight and Day has achieved. Yet you hope for so much more. you hope the comedy will be good and that the action is well staged, and for the most part the film is fun, without being too funny or too thrilling. What I really hope for, though, is that during the film I'm not compelled to look at the person next to me and say, \"this is a bit too stupid isn't it?\". Thankfully, I rarely say this because, like any guilty pleasure, I watch these sorts of films by my self. At least I always know what I'm going to get."
    },
    {
      "rating": "3",
      "text": "A for humorous misunderstandings.B for stunts.C for lame plot.F for Tom Cruise.In the spirit of Much Ado About Nothing and The Man Who Knew Too Little, we have Knight and Day. It's about a girl who gets caught up in this crazy weard investigation. The above mentioned movies were much better, though, and a lot funnier.  There were funny parts, it was more like one liners or certain scenes, but as a cohesive movie - meh.  Not so much.  Too trite.  Cool stunts, though.I like Cameron Diaz. She's cute, funny, and spunky.  Not a fan of Tom Cruise.  I'm sure he is a nice man, but he's just never been one of my favorites.  Bit over the top for me.Gleenobly's rating: 3/10"
    },
    {
      "rating": "2",
      "text": "A dreadful experience. There's guns, trains, planes, cars, and explosions and it's all quite boring and flat. I couldn't wait to leave the theater."
    },
    {
      "rating": "9",
      "text": "Great chemistry between Cruise and Diaz. Timely and funny humorous tension breakjs. Great action. Mangold made this movie fun to watch."
    },
    {
      "rating": "9",
      "text": "Awesome!! Action packed and hilarious! Cruise and Diaz are great together! Tom really gives this movie its zing."
    },
    {
      "rating": "10",
      "text": "This movie is one of the most enjoyable summer flicks of this year...Cruise&Diaz on-screen chemistry is great....and this movie is a rebirth of both stars."
    },
    {
      "rating": "10",
      "text": "Honestly this movie is like an 8.5, but some MORON gave it a 2 and i need to cancel that out. Its a great action/comedy that is a little cheesy at parts, but it fits in with the characters. The cast is lead by a suburb director (310 to Yuma, Identity) and i would recommend this to anyone who enjoys sitting back and munching on some popcorn."
    },
    {
      "rating": "7",
      "text": "An entertaining romance/action movie. Cruise and Diaz work well together and bring an added dimension to the action, which is reminiscent of the Transporter and Bourne movies. I laughed out loud numerous times as did many others in the theater. This was the most entertaining movie I've seen in months and I would like to see it again."
    },
    {
      "rating": "9",
      "text": "Very funny and lots of action a very fun movie"
    },
    {
      "rating": "6",
      "text": "Tom played a happy go lucky Mission impossible role that just didn't deliver. The most action of the entire movie was based on the trailers."
    },
    {
      "rating": "8",
      "text": "I'm giving the movie an eight because of the action films that have been released lately. I thought Cruise was funny and Diaz was a great match. Many of the scenes are way over the top, but the real fun is the interaction of Cruise and Diaz or really Diaz's reaction to Cruise."
    },
    {
      "rating": "2",
      "text": "We have seen this film before (the killers)this one has better locations.But everything on screen seems fake,fake actions( BAD CGI)fake romance,fake script !!!"
    },
    {
      "rating": "10",
      "text": "Fantastic, Funny, and truly Steller."
    },
    {
      "rating": "8",
      "text": "Good action. Would like to see more of the action scene which is cutoff when Cameron gets a \"rufee\"."
    },
    {
      "rating": "9",
      "text": "Surprisingly good, nice acting and the action was so blatingly badass it was funny; A must see film."
    },
    {
      "rating": "2",
      "text": "Truly a rotten flick. How did such a stellar cast get involved with this turkey? Besides the terrible script, the audience must put up with cheap looking 3rd-rate special effects. Really bad CGI and green-screen work make it look like a film school failure. Only the most rabid Tom Cruise or Cameron Diaz fans could put up with what is bound to be a major embarrassment for them. It get a \"2\" instead of \"0\" only for the cast. Would like to see more of the actor who played Rodney the fireman."
    },
    {
      "rating": "10",
      "text": "Love anything with gorgeous Tom! He and Cameron are perfect together."
    },
    {
      "rating": "9",
      "text": "Despite many preposterous premises that plague this film, it is nonetheless a whole lot of fun. Cruise and Diaz are both so very engaging and film-worthy that the film succeeds in spite of its many weaknesses. Most of the action was good, the bad guys were rightfully unlikable, although the mad scientist (not the mad scientologist) was weak. All-in-all a great summer escape film. Nothing new here, not great film-making, but fun enough to make one forget one's own problems while June and Roy deal with theirs."
    },
    {
      "rating": "7",
      "text": "Cruise and Diaz make it work. Some of the fading in-and-out scenes (if you see the movie you'll know what I mean) are overdone and slow the movie down and the ending is a bit rushed. However, the clever banter between the two stars and some good action are enough to make this movie worth seeing."
    },
    {
      "rating": "7",
      "text": "In this day and age  in this era  of films  spy movies  are literally a dime a dozen  they are one of the action genres   most common uses for  an action/ adventure  picture  and have spawned many franchises, T.V. series, video games. You name it the spy genre has left there mark somewhere to make sure that you never forget them   the spy game has had a very successful run in the films. Although never quite commanding the respect they deserve from moviegoers who are now a days more interested in seeing dull overdrawn teen romances than good spy thrillers with smart ideas and compelling stories but that is just the way things go theses days. James Mangold's  romantic  action/comedy  \"Knight & Day\" is the perfect example of a spy movie that has all the right ideas the right set ups  and a story good enough to make me want to actually sit through  the whole thing without checking my watch every ten minutes or so  asking myself when it will be over. \"Knight and Day\" is the first great film of the summer.   James Mangold's \"Knight and Day\" is one of those films that flew under my radar until almost two months before its initial release, which for a film with such a high-class director and stars I expected to hear more about this film. Instead I only heard that Tom Cruise and Cameron Diaz were working together again after almost 9 years. There last collaboration being Cameron Crowe's bizarre hit \"Vanilla Sky\"(2001)   truthfully that is the main reason went to see this movie. If there were anyone else in the lead roles, I would not have bothered with and gone to see something else instead now I am glad I did not decided to skip this one after all. \"Knight and Day\" is a pure  formula film right down to its story  and plot  even most  of its dialogue  is formula  the most formulaic parts are concerning Cameron Diaz when she is being briefed about Roy Miller(Tom Cruise)  and how he is dangerous and crazy and a traitor, moviegoers have all heard  it before. The  only thing that saves this film from being nothing more than just a run of the mill rehash of other better spy movies   is the breezy pace, snappy dialogue  and a pair of winning performances from Cameron Diaz and Tom Cruise  help bring this film out of its familiar territory saving it from a dark and dreary failure.   James Mangold is know for making high quality films  most notably being \"Walk the Line\"(2005), \"Cop Land\"(1997),\" Identity\"(2003), \"3:10  to Yuma\"(2007). \"Knight and Day\" may not be one of Mangold best it certainly is better than his other  comedy type film \"Kate and Leopold\"(2001) which wasn't bad but than again it was not quite that good either it is somewhere in between  \"Knight  and Day\" is far above \"Kate and Leopold\" but it is less imaginative than that film. What I found most impressive about this film and I think moviegoers will as well is the skill and design of this film it uses the clichÃ©s of its simple formula and story to turn what would have been a routine action/adventure/ spy thriller. Into an exceedingly enjoyable film far more enjoyable than could be imagined too enjoyable for its own, good \"Knight and Day\" works.What I wanted form this film  I did not get completely  I wanted to get Cruise and Diaz laughing it up and cracking jokes like it is going out of  style but instead I got rudimentary action, clichÃ© plot twist. After hearing all this you start asking yourself this question: is this film wroth seeing? Most definitely, I wish there would have been more to it than just action and a pair of good-looking leads falling for each other, running around trying to find a very valuable object it just all seemed too... Familiar and that is okay I like familiar and while \"Knight and Dayâ"
    },
    {
      "rating": "8",
      "text": "i loved the movie! who would have guessed that tom cruise and cameron diaz would be such a good combination! they're really funny and entertaining. the action was great."
    },
    {
      "rating": "7",
      "text": "A bright and breezy summer movie, Cruise and Diaz sizzle with chemistry and are clearly having a ball.  A film that can be equally enjoyed by men and women alike, switch off your brain and buckle up for a fun ride."
    },
    {
      "rating": "8",
      "text": "After watching Mission Impossible 4, and seeing Tom Cruise in action - this film had a similar vibe. Their was lots of action and his quirky personality involved. Although for some reason I have never been able to get myself to like him or Cameron Diaz. I decided to watch it anyway, and it was a fun action packed movie. I wouldn't say the plot or characters and all things else had any deep meaning I seek in movies though."
    },
    {
      "rating": "7",
      "text": "Quite a lot better than my very low expectations.  Quite funny and cute.  Tom and Cameron make quite a good pair.  The premise may have been ridiculous and some of the action ridiculously unbelievable, it wasn't meant to be taken seriously."
    },
    {
      "rating": "7",
      "text": "\"The Chemistry between Ton Cruise & Cameron Diaz is there , Knight and Day is remarkably funny and one of the many overlooked films of the year , its enjoyable , dumb & Satisfying. The action sequences are well done , and well i liked it!\" .. B"
    },
    {
      "rating": "8",
      "text": "I am big fan of romantic comedies and I have to say those one is very good. Lots of laughs, I really enjoyed the way how that whole spy business was presented. Duet Diaz-Cruise did the job perfectly!"
    },
    {
      "rating": "6",
      "text": "Could have been great if it was funnier, had better action, and a better plot, but it ends up being barely passable. It does have some funny moments and that's why it's passable instead of bad, and also the only reason you should even think of watching this, I personally recommend you skip this and watch something better. The trailers made it look much better than it actually is, all in all it's ok, but doesn't really need to be on your must watch list and if you skip it you wont be missing much."
    },
    {
      "rating": "6",
      "text": "Intentionally over the top and unrealistic action/rom com movie which is entertaining if you leave your brain behind and enjoy a seemingly invincible Tom Cruise drive, shoot and fight his way through situation after situation with Cameron Diaz in tow as the ditzy blonde (with a twist)"
    },
    {
      "rating": "4",
      "text": "For me, this is one of those movies that is not good by any means, but I still find generally watchable. Its the kind of movie I will \"watch\" while doing laundry or making dinner, or if I am just tired and don't feel like using my brain much but want to have something on the TV. Cameron Diaz and Tom Cruise play versions of themselves that they've played many times before. They are both nice-looking and show their straight, white teeth a lot. She screams and giggles a lot, he kicks ass and says a bunch of smart ass lines. They both annoy and charm in equal degree, mainly because I am annoyed I am so charmed by these marginally talented, overpaid actors. That being said, they are what makes the film barely work, along with some beautiful scenery and a few mildly thrilling scenes. Its lazy film making at its best, just coasting along and just coherent enough that it will probably become one of my defaults for when I want something on the TV to look at, but not necessarily be invested in."
    },
    {
      "rating": "8",
      "text": "Okay, boys and girls, suspend your disbelief, fasten your seat belt, and get ready for a wild Cruise and Diaz roller coaster ride. \"Who ARE you?\" Cameron's June asks Tom's, well, somebody or other. Roy? Matt? This is one zippy comedy caper from start to finish. Is he really the good guy in all of this?\" Oh, come on, he couldn't possibly be the baddy. Could he? Stick around. Who cares if the running of the bulls is in Pamploma, not Sevilla? Irrelevant. The point is, is Cruise going to have to wind up asking Diaz, \"Who are YOU?\""
    },
    {
      "rating": "8",
      "text": "I was hugely surprised by how much I enjoyed this.  At first I didn't like it, because I was expecting a more serious action movie.  Once I got used to what they were trying to do, it was hilarious.  It was like they took all the scenes in serious action movies that make you go, yeah right, and put them in this movie as a joke.  I really enjoyed it, and would watch it again.  The over all feel was more james bond meets indiana jones, rather than tom cruises usual action movies, that have more of a realistic feel."
    }
  ]
}