{
  "id": 875,
  "title": "Knock at the Cabin",
  "starring": [
    "Dave Bautista",
    "Jonathan Groff"
  ],
  "runtime": 100,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "While vacationing at a remote cabin, a young girl and her two fathers are taken hostage by four armed strangers who demand that the family make an unthinkable choice to avert the apocalypse. With limited access to the outside world, the family must decide what they believe before all is lost.",
  "releaseYear": "2023",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dm06L9pxDOL9jNSK4Cb6y139rrG.jpg",
  "categories": {
    "plot": 3.871794871794872,
    "acting": 3.423076923076923,
    "ending": 3.230769230769231,
    "soundtrack": 5.0,
    "cinematography": 5.666666666666667,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "0",
      "text": "I can't explain how frustrating and simply bad this movie is. It is bad because it's frustrating. Not in a way compared to other frustrating but good movies, it's just plain stupid... Feel bad for Keanu"
    },
    {
      "rating": "2",
      "text": "I really want to ask director of the movie: Man, why ? Movie has no point, and it's sick as hell."
    },
    {
      "rating": "0",
      "text": "How did this get any positive reviews at all? Gratuitous and gross. When is Hollywood going to start making human, soul redeeming movies again. This was just opportunistic, soul crushing crap. Same old poo from the backwardly \"enlightened\" current Hollywood crowd. Don't waste your time, it's vapid and plain bad."
    },
    {
      "rating": "1",
      "text": "The movie was a dumb but somewhat entertaining thriller and then just left the viewer hanging at the end. The whole plot of the two girls made no sense and no attempt was made to explain their behaviour. Reeves's character was unbelievably stupid the whole time. When he managed to escape from being tied to the bed, he could have tied up the one girl and then taken the other out. Neither one of them could have weighed more than 100 pounds. Don't waste your time with this."
    },
    {
      "rating": "1",
      "text": "I rewatched this movie because I thought I liked it, but after watching it again I remembered that I hated it. I haven't been seeing people explain why this is such a terrible movie, but here is my reasoning as to why this movie is one of the worst movies I have ever seen. I love Keanu Reeves, but why would he even accept to be in this utter trash pile? Not only is this movie unrealistic to the fullest, but it's actually supporting the toxic ideology that men cant be r*ped, or taken advantage of, by women. It's making the women seem like their actions are in the right when they're the ones that decided to spy on Evan, Keanu Reeves, and take advantage of him. They are not morally in the right and the fact Eli Roth makes it seem like they are is extremely dangerous. The predictability and acting are terrible, even Keanu was not good, and, as I mentioned before, it is very unrealistic. You will never ever convince me that a person who is Keanu's size can not physically dominate 2 people as small and weak as the girls in this movie. Even if a person Keanu's size was hit unexpectedly in the head by these girls and tied up, they would not, realistically, cry, plead and whine the entire time. It angered me that Keanu accepted to play such a pitiful character because realistically a person like Keanu would end up finding a way out and would end up killing these girls. That's why it's shocking that they ended the movie with these girls winning. There was absolutely no plot. All they did was relay a clear message that these girls were the \"good people\" in this movie. Also, the scene when Louis comes in, the guy picking up Evan's wife's sculpture, and finds Evan tied up, was stupid and it seemed to just downplay a man's intelligence. Because realistically no one would care about a sculpture being damage more than a literal person tied up and visibly cut. He left Evan still tied up because he was more concerned about an object... That would never happen. This movie would have been immensely better if Keanu actually escaped, even after being tortured quite a bit, and killed those 2 women. Instead, they clearly wanted to promote misandry and sexism. I am convinced whoever wrote this script is either unethical beyond belief or they're intellectually slow and don't know how to make a movie."
    },
    {
      "rating": "0",
      "text": "Knock Knock is a boring, try-hard thriller movie that instead of having you at the edge of your seat, your comfortable, relaxed, and in most cases, asleep. Do not pay to see this movie!"
    },
    {
      "rating": "0",
      "text": "I can't believe that there are people who like this film. It is bored and absurd. It was wasted time. From the start I was waiting for its end. At the end, just leave questions"
    },
    {
      "rating": "0",
      "text": "Booooo! I detested this movie from start to finish. The film glorified rape and tried to justify it throughout the movie. I had to wash my hands after watching this movie."
    },
    {
      "rating": "2",
      "text": "When a devoted husband and father is left home alone for the weekend, two stranded young women unexpectedly knock on his door for help. What starts out as a kind gesture results in a dangerous seduction and a deadly game of cat and mouse.\r More like Cat and Cat, the mouse had no role other than to prove what meat looks like. By the end of Knock Knock with Keanu reeves i wanted to rip my face off and throw it at the girls on screen.\r If that was the intention of Director Eli Roth, he did a great job. However, I also want the last hour and a half of my life back.\rSPOILERS\r Watching two girls come into a good mans home and basically rape him and then destroy everything he has worked so hard for, was not my idea of fun. I wanted so badly for the two little psychos to be destroyed towards the end and no. They get away and nothing is served and thus, the entire movie made no sense what so ever.\r END SPOILERS\r It Proved no purpose and probably did to Keanu Reeves what these girls did to his character in the film... Took almost everything that made him good again in John Wick and left him defenseless and me wondering if i should even bother with whatever he does next.\r Try to steer clear of this filth! No matter how great the marketing made it look. An extra point score only because Keanu Couldn't escape this mess."
    },
    {
      "rating": "1",
      "text": "Sex.\rThere, now that I've got your attention, let's be honest here- we all watch this for the sex. And the whole 2 minutes of sex was great! Tickled my tutu and I couldn't look away (Boobs).\rHowever, Reeves was so unsaturated this entire film! It was so awkward to watch the moment the kids entered the scene, I knew this was going to be horrible. I enjoy Keanu Reeves! Hello? Neo Anderson? John Constantine? John Wick? Kai? Klaatu? Alex Wyler? Those are all some good flicks. But this was just a couple of chicks (wicked as they come) making a mess out of someone's house, just because. Also, I honestly don't know why art was such a big part of the film... It went no where. Just a story filler I guess. The whole film is based on a 48 hour span of nothingness. Reeves' Character Evan is some kind of awkward. Kind of like he doesn't know how to use his manhood. (Who would after being deprived of sex for 3 weeks-poor guy, hah). And WHAT IS WITH HIS DOGS ALWAYS BEING SCREWED OVER.\rIs my review a little all over the place, null of story, and boring? And where the only part that catches your attention is the sex in the beginning?\rThaaaaats exactly how the flick is.\rPS- if you're gonna take the time to watch it, I suggest bringing your phone or iPad so your not bored wink emoticon"
    },
    {
      "rating": "2",
      "text": "Even after overlooking the spectacularly wooden performance of Keanu Reeves, the first twenty is genuinely quite suspenseful, as you've no idea where the plot is going to go. Unfortunately, it emerges, neither do the filmmakers. What follows is an inexplicably stupid parody of 2005's Hard Candy, rather than an a geuinenly scary gore-fest that Eli Roth is known for. Instead, we get an hour and a half of painful cackling, cringe-worthy dialogue, false moral dilemmas and a story so beyond laughable that I was genuinely rooting for the protagonist to die, simply so the film would finally end.Eli Roth seems to be bored of torturing the characters in his films, and has instead turned his sadistic streak onto his audiences, for all the wrong reasons. And trust me, by the end of it, you'll be begging it to stop."
    },
    {
      "rating": "3",
      "text": "Disappointed. Was expecting a lot more. Never would've thought Eli Roth would venture to explore family-themes to a point of casual facebook-chatting. This movie is everything you don't want it to be. Could've been a hit, a legend. But fell down to stupid-ass writing, bad acting and overall blandness."
    },
    {
      "rating": "8",
      "text": "Knock Knock is an impressive thriller with Keanu Reeves. I wish he'd be in more movies, you don't see him much anymore. The movie is tense and unpredictable. The two female actresses give engaging performances. This is the only Eli Roth movie I have enjoyed, I often dislike his movies. I find that\rthey lack substance and style. However with Knock Knock he has redeemed himself. He has proved that he can produce a movie with competent actors, an intriguing storyline and clever twists. I thought Keanu's performance was interesting and skilled. The only other thriller I have seen him in is The Devil's Advocate.\rThis movie is worth watching, and I can watch this movie more than once."
    },
    {
      "rating": "4",
      "text": "\"Knock Knock\" features some of the worst writing of any film I've seen this year. It's blandly predictable and is not clever at all. Extremely annoying, and horribly acted. The 3 leads are way over-the-top and grating.The whole movie tries to be smart, but it comes off as very stupid and in poor taste. It's fast-paced and easy to watch, and if you like over-the-top movies, then you'll probably enjoy it."
    },
    {
      "rating": "3",
      "text": "I was a fan of Eli Roth's Cabin Fever all those years ago, before Hostel and everything else, but haven't been impressed by his work since. My one complaint about Cabin is the cheap joke at the end, calling back an earlier scene (the \"my **** line). And he does the same here, with a cheap callback joke as the final line. Why Roth decided to reboot an old 30 plus year old C-movie that starred Colleen Camp, Sandra Locke (both producers here) and Seymour Cassell is anyone's guess. Unless he was intrigued by the standard universal theme of temptation and it's results. Knock Knock starts well, setting up the family dynamic, although Reeves just can't pull off warm and cuddly Daddy. Spending Father's Day alone working, while wife and kids are away, a couple of young, nubile, and wet (of course it's a dark and stormy night) ladies come knocking at his door. Reeves tries to be gentlemanly, moving to a single chair, everytime the ladies get too close. But little Keanu gets the best of him, and he beds both of them. This is where the movie becomes the \"from hell\" sub genre thriller. You know the \"from hell\" genre...the husband from hell, the roommate from hell, the TEMP from hell, etc.etc. The ladies, Lorenza Izzo and Ana de Armas, work on destroying Reeves from that point. And the movie goes completely off the rails. Game show parody, paper mached corpse, torture by volume...and a scene where Reeves loses it that has to be seen to be believed. I think Roth told him just to go bat shirt crazy...And the ladies, tho attractive as can be, are more annoying than menacing. I never thought or felt they were truly dangerous. And the acting. There are times that I thought I was watching a bad SNL skit. If this is the indication of Roth's career, no Taratino connection is going to keep him from a career of direct-to-DVD releases."
    },
    {
      "rating": "1",
      "text": "this movie is exactly what would have happened had neo had taken the blue pill.....that being said i think this film might help my overall goal -getting people to hate both women and sex...that being said i had to skip ahead while watching like the whole time because i was so bored with it.....also didn't he just hang out with two loser chicks in generation um that i couldn't finish because i was so bored>?"
    },
    {
      "rating": "1",
      "text": "basically an hour and a half of two women pressuring a man into consensual sex even though he refuses them multiple times then they come back, assault him and then rape him"
    },
    {
      "rating": "0",
      "text": "I was going to give the movie a 1 but I couldn't bring myself to do so. My only guess as to why this movie is rated as good as it is is due to the nudity of the young ladies and Keanu Reeves. Besides that, I can't imagine why this movie got such high ratings. The movie explains little to nothing as to why the characters are in the situation they are in, nor does it give much background behind the characters, not even the antagonists who are supposed to be OH so important. Considering the lengths at which they go to for, yet another, fairly unexplained reason. Besides the setting, the actions the character takes are simply convenient for the sake of plot development, and fairly inaccurate to the perception we are given from the character's various other actions up until the point they do something completely unexpected of their personality."
    },
    {
      "rating": "3",
      "text": "Babe chicklets infiltrate turf of repressed square family man whose family is off for wifey's exhibition of art bauble grotesqueries. Seduce and betray hilarity ensues but film falls between two stools: either it has to be a) genuinely terrifying but it isn't: critical lost beat there: the cutsey mutt Monster survives the invasion of the estrogen snatchers his adorable puppienss intact or b) genuinely comic: it has to be aware of its own ironic/subversive intentions and establish a comic rhythm and timing: but it can't. Reviewers have been unkind to the two lead actresses and their take on jail bait from hell--but they do what they can given Eli Roth's hand's off direction. Reeve's performance is the weak link. His wooden stolidity helps in setting himself up as the repressed pseudo-hip square stuck on his decades old self-image as a cool daddy hipster; but as the film drags on his stuck in neutral awkwardness offers nothing below the textual surface for the girls to play off of--there's no emotional subtext interaction behind the cliched motivations hard wired into the script. At the end the final line spoken fails as a comic payoff and echoes off as a receding non-sequittur into the credits.\r Nice cinematography and tracking given the one-set location."
    },
    {
      "rating": "3",
      "text": "This is genuinely the worst film of the year so far. Two underage girls that seem to hate men 'teach man a lesson' for forcing him to have sex and claiming rape. The remaining hour is said **** man complaining like a **** as he is 'tortured' with load music? And more sex? A good left hook would sort the situation and a call to the cops. but NO! It's garbage. And the acting is really bad."
    },
    {
      "rating": "0",
      "text": "This movie actually left me in shock and not in a good way.\rActing was very bad. Writing and directing even worse.\rI have no idea what was in Eli Roth's head when he thought this movie would be a good idea.\r At least this movie got in my mind. I've never gotten more shocked from a movie than after watching this.\rI probably can't watch Lorenza Izzo and Ana de Armas ever again."
    },
    {
      "rating": "7",
      "text": "Just finished Eli Roth's  Knock Knock​ and i have to say that it is a solid film i would see again, but only as a throw back to the old stalker films like \"Cape Fear\" or \"The Step Father\". Its not like the kind of thriller that you would think it would be, its the kind of movie that shows how deranged people can be and how a mans life and come to an end. It works as a cringe comp rather then a Thriller or Horror it advertises it to be. Keanu Reeves did an OK job il say, but i think the Props go to Lorenza Izzo as \"Genesis\". Ana De Armas did good too but i feel like this isn't the roll she was meant to play (i've seen some of her past work). Overall, this is the good movie to watch when its on On Demand and your friends are looking for a good film to watch."
    },
    {
      "rating": "3",
      "text": "Yea this film is as bad as its title, starring the not so wonderful Keanu Reeves in this lame excuse for a horror/thriller. I suppose the moral of the story is not to answer the door at 1 o clock in the morning unless you want bad things to happen. The biggest problem with this film is the lack of frights and/or shock value, makes no attempt at anything worthwhile or memorable. The only positive thing is its good for some surprising laughs although clearly not the original intention. Recommended if you've nothing else to do."
    },
    {
      "rating": "3",
      "text": "Either I'm missing something here or this is not good...AT ALL...  Well Keanu Reeves starts off like an innocent husband who is loyal to his wife and family, well this movie proves that men are easy to fantasize to sex. The only thing I found in this garbage is that it gives you that uncomfortable feeling that will haunt you forever, along with the grossness from these two lovely ladies that are shown, and also, Keanu Reeves acting is messy and it feels like he was trying way too hard. All I'm saying is that 'Knock Knock' will 'Knock' you out from how ridiculous the plot and the acting is."
    },
    {
      "rating": "2",
      "text": "(First of all, I rented the movie because Keanu is on it.)   \"Knock Knock\" seemed to have caught my interest at the beginning. The movie started by showing scenes of a happy family headed by  a devoted husband (Evan), so perfect that you can actually feel something untoward will happen next.  I  thought it was a good movie until I realized that I have stopped caring for the endless torture that Evan had continuously experienced with the two lunatics while the movie dragged on. It's an overkill! It's so ludicrous I had to hit fast forward x 4 to see how it ended and just get my rental movie's worth. It's BLAH!!!"
    },
    {
      "rating": "7",
      "text": "A really good thriller that serves as a throughback to classic thrillers, Knock Knock is a really enjoyable offering from director Eli Roth. Keanu Reeves does great, but the real stars of the show are unquestionably Lorenza Izzo and Ana de Armas. While the movie dips its toes in the \"social satire\" genre, this is an engaging thriller/horror through and through."
    },
    {
      "rating": "0",
      "text": "Is THIS the WORST movie of the decade or Cats!??? Honestly, as horrible as Cats look like I'll have to go with this."
    },
    {
      "rating": "7",
      "text": "A morbid psychosexual thriller that flirts with both silliness and cinematic greatness. It's hard to take Reeves seriously at times, but the female leads constantly impress as the sadistic strangers."
    },
    {
      "rating": "3",
      "text": "two women over power a full grown family man... thats very unrealistic. he escaped once they used a fork to get him back in bondage.. plz eli, be real. though its got lessons, but its not real."
    },
    {
      "rating": "10",
      "text": "I was trilled, had a goose bumps throughout the film . Quite unpredictable and scary.  Having settled life myself, I understand Evan's feeling and frustration to loose everything. I will watch again with my husband. I believe that film for those with  families and  anyone who has something to loose.  Great moral message."
    },
    {
      "rating": "6",
      "text": "This Keanu Reeves freak show has its moments but at face value, knock knock is a severely over-the-top horror/thriller that almost tries too hard to be smart."
    },
    {
      "rating": "5",
      "text": "Knock Knock is the first Eli Roth film that I have ever seen and its almost hard to explain it. This film is so over the top, the story is crazy and so are the performances. It is almost into its so bad its good territory. I don't think this is a role for Keanu Reeves, he seems so out of place here. I think the two girls in the film do a good job, but this film is just so ridiculous that instead of being scary its almost hilarious and I'm assuming that it is supposed to be that way. I don't think that this movie is for everyone but I'm sure that there are lots of people out there who will get a kick out of it."
    },
    {
      "rating": "6",
      "text": "I thought  the movie wasn't bad for a Netflix rental.    I was very uneasy thru most of the movie.  I can't recall seeing a movie before where female \"intruders\" were the psychos!!  I was disappointed Keanu never got a chance to exact his revenge.  It was a bit different for me and I would like to see him get those b*****s back BIG TIME!!!!   I know I would never forget their faces if I were him - maybe a Knock Knock 2?"
    },
    {
      "rating": "9",
      "text": "This makes me wish these male punishment porn movies would break away from the ol' rape-revenge trope more often. I can stomach graphic depictions of gore and mutilation, but not sexual assault. So the way this is centered around the far less heinous crime of cheating allowed me to enjoy the ensuing carnage without my mood having been soured by the main plot device.While tamer in the blood and guts department than one would typically expect an Eli Roth film to be, watching these women ruin the protagonist's life is nonetheless a blast. Their methods of torment are disturbing, darkly comedic, and on a surprising note even genuinely erotic at times. Plus, the torture never feels especially vile as it's easy to see the whole situation the guy finds himself in is his own darn fault. I'm not saying the punishment really fit the crime, that he wasn't rather aggressively cajoled into the threesome, or that a woman isn't capable of molesting a man. However, no one forced him to have sex with those girls in this case so he doesn't exactly have my sympathy here.In fact, the only thing that was suspect to me about the whole thing was the acting. Particularly that of Reeves himself. The John Wick star has always caught a lot of flack for perhaps not being the most talented leading man in Hollywood, which is a bit harsh in my opinion. For a low budget movie of this caliber though, he does a fine job. At least when his character isn't being subjected to physical pain that is. His reactions in these scenes are admittedly laughable at best.Knock Knock is simply a whole lot of fun, and when you consider that all Eli Roth has ever wanted to do is make a bunch of dumb, amusing grindhouse throwbacks there's an argument to be made that this is the best work of his career. For once his stupid sense of humor isn't a hindrance, but instead actually a boon to the movie! Allowing you to revel in the absurdity with greater glee. The director took a concept usually reserved for crummy, pseudo rom-coms and applied it to a genuinely effective horror-thriller format that brings every man's worst nightmare, having to pay for infidelity, to life in gruesome fashion and the results are pretty fantastic. You know, for a B-movie..."
    },
    {
      "rating": "7",
      "text": "Ok, let's get this out of the way first, Keanu is as a horrible actor as ever, still as wooden as Al Gore. However, that's all offset by the glory that is Ana De Armas and Lorenza Izzo who play nubile sirens that quickly turn every guys' fantasy into an insane nightmare in short order. Don't fall into the trap of overthinking plot details, just focus on the main theme and the generosity these two lovelies share with us, seriously."
    },
    {
      "rating": "5",
      "text": "Be cautious of the two slices of the free pizza delivered to your doorstep.\r Another flick that sets in an isolated place with the limited cast. A low budget film, which was a remake of the 'Death Game'. After playing a strong character in his previous film, Keanu Reeves is back exactly opposite to that one. Yep, remember what happened to the two men who break-in into his house in 'John Wick', but here it is like what if he's not able to handle them or to do anything about it kind of Circumstance.\r He played a normal family guy, a father of two children with a beautiful wife and a big house. The trailer itself revealed half of what the movie's. But the rest of the film is not bad at all, and that does not count as I'm praising it. The movie was average because of the writing was too loose. Not only predictable, but aimlessly moved and the motives were never explained. So the mystery remains mystery.\r It was one of those films that leaves behind us to suspect the possibilities. A broad open for a sequel, but likely there's very less chance for another film. The girls were so good looking and performed well. The theme aimed for erotic-crime-thriller, but did it achieved? I don't know, the original was released in the 70s, which might have been too sexy for that time, but in the present world, it is not that special or effective, just like 'I Spit on Your Grave'. You could watch it to enjoy your moment, but it would be a cinematically impressive with the great writings, actings, with twists and turns and all.\r 5/10"
    },
    {
      "rating": "5",
      "text": "Knock Knock is absurdly over the top though it has its fun moments.  Every character in this film dials the craziness up to ten. I realize this is what Eli Roth was going for but it is just to much to recommend.  C+"
    },
    {
      "rating": "8",
      "text": "The movie was silly, predictable, bad acted  and way too over the top but, it was obviously the point. It's obviously not meant to be taken seriously and the movie was definitely a lot of fun."
    },
    {
      "rating": "7",
      "text": "Eli Roth's \"Knock Knock\" Is A Psychological Thriller With Common Appearance, But With A Disturbing Potential\r Intervening moral issues of fidelity and sexual drives (usually, present in married men), Roth, Nicolás López and Guillermo Amoedo conceive a story with references - or possibly based - on \"Death Game\" film of 1997 with almost the same plot. With better performances, uses of technology, a story with appropriate plot twists and a better directing, this new version shows the multifaceted that could be the director, without the presence gore that characterizes him, OK, at least without so much blood.\r With a predictably moderate result at the box office, \"Knock Knock\" is a fresh and lush proposal to the commercial films and while it is not the masterpiece of the season, it is one of the independent films more entertaining of the year. Roth arrives with strength to the suspense genre, with one idea we've already seen, but with a view more modern and modified about itself, perhaps is a remake or maybe not.\r Keanu Reeves plays Evan, a happily married architect, father of two children, with fortune, love, DJ hobbies, a beautiful house, in summary an idealized life, what else can he ask for?. Then, his two children and his wife take a nice vacation to the beach - on the occasion of father's day, a big irony-, Evan and Monkey left alone at home working on his project. On a rainy and simply sinister night, two beautiful and stunning girls innocently knock on the Evan's door, under the pretext of help, since they have lost on the way to a party. This merciful man - though, after I watch this movie so many times, in the third time, I can see the desire of Evan, it is logical, he is a man - allows them to enter for one call or maximum one coffee cup. Bel (Ana de Armas) and Genesis (Lorenza Izzo, the wife and constant contributor to Roth) are male sexual fantasy. After asking a taxi and have a talk about faithfulness and sex, things become dangerous and Evan's love for his family is thrown into the toilet.\r Evan has sexual relations with the two girls - something relatively impossible considering the age of Evan, but relatively possible considering that morning his wife not wanted help him, affirming that he took  more than three months without having sexual relations -, naive and innocent of the hell that was to come. Once the guys begin to show their bad behavior, Evan feels in trouble and goes in a direction that will not help him. Things come up to the limit of gag to Evan, unintentionally killing a person and destroy all the house. The previous is made to give a lesson to all husband who believe to be faithful, but that \"fidelity\" word  is what less used inside their mind.\r Idea is completely brand-new, however, its end leaves the audience unsatisfied, thrilled and even disappointed. It feels like a failed experiment, feels like a work that had a stupid ending, it is illogical to which after a great development finishes with a finish so poor and cheap in order to show a consequence.\r Moral themes is most used in dramatic and thriller films, but the issues touched in this film are substantially used them and share a better connection with the audience due to everyday life and reminiscence of them in life any common man. It is not a feminist film, it is not a male chauvinist film, Roth manages to get that balance of genre in order to do not be wrong about taking his project where it should not go.\r Ana de Armas and Lorena Izzo are fabulous in their roles, however, momentarily, they get rid of the psychology and strange behavior that had. The classification R, they gave to the film is opportune, since, in addition to having strong sexual scenes, profanity and violence, these girls transmit horror, a genre that apparently are not visible, but after seeing the work these two women, the horror reincarnated in the beauty. Reeves also makes a great role here, different than what he has done so far, revealing its full potential with his monologue \"free pizza\".\r Technological contributions make much with little, recorded in one house with fascinating interior design, Roth knows how to slide his camera through the corridors and walls full of art and paintings, giving a modern twist to a house of a familiar aura.\r Last Roth's film- and hopefully it is not the last, really -  plays very well exposed moral issues, with photography and cinematography very well executed, but narratively falls short and not in its development, in its empty and simple end."
    },
    {
      "rating": "4",
      "text": "It's like Gremlins, but only not funny, not at all. Well, maybe just a little at the ending. Even Keanu Reeves wasn't enough humiliated for my taste, I am not his admirer and in my humble opinion he deserves worse than that. So, I am not much impressed, Hard Candy was way better than this."
    },
    {
      "rating": "7",
      "text": "Deutsche Review - Kritik\r Story: 17/25 Punkte\rSchauspieler: 21/25 Punkte\rTechnik/ Bildbearbeitung: 18/25 Punkte\rSound/ Voice: 14/25 Punkte\r Gesamtpunktzahl\r 70/100 Punkte"
    },
    {
      "rating": "7",
      "text": "I thought the Ideas running through this film, like how he is a D.J. but mostly just part time.  Most of his house isn't just awaiting for some person to take over.  But somehow I'm wondering, could their be some coincidence between having Keanu recently play these parts primary for the solo lead, and having suddenly going on these movies that deal out anger and revenge against \"Keanu\", by girls bent on getting exactly what they want weather or not they are actually seeking something that requires a goal. Even in a small part like the one in \"Neon Demon\".  Suddenly all women are out to get what they want going through, Evan Weber, and mostly feel sorry for the girls who don't think that they would \"really\" like to reach out and get something from this innocent guy.  Like he's inviting some fanatic fan to get vulgar and ignorant and then just turn the other cheek, nothings out of the ordinary!  As long as in the end the punishment sets out and finds it's purpose."
    },
    {
      "rating": "6",
      "text": "Eli Roth mag Filmverweise – liegt wohl an der engen Freundschaft zu Zitatkönig Quentin Tarantino. Nach der Menschenfresser-Hommage The Green Inferno wendet sich Roth in der Home-Invasion-Variante Knock Knock einem anderen bekannten Thema zu. Architekt Evan bleibt das Wochenende daheim, während sich die Familie am Strand sonnt. Zum Arbeiten kommt er jedoch nicht, denn plötzlich stehen zwei vom Regen durchnässte Mädels in der Tür – und bevor das rettende Taxi kommt, landet man sich windend in Bad und Bett. Der Morgen ist ein Schlag ins Gesicht: Die zu völligen Psychopathinnen mutierten Girls wollen nicht gehen und nehmen Evan die Designer-Butze auseinander – und bei Sachschäden bleibt es nicht. Ziemlich frech schnappt sich Eli Roth den Plot von Death Game und die Psychospielchen von Funny Games und Hard Candy, nutzt aber statt Subtilität stets den Holzhammer. Doch das holprige Drehbuch, hölzerne Dialoge und ein wirklich mieser Keanu Reeves ändern nichts daran, dass Knock Knock als trashiger Thriller einen Riesenspaß macht."
    },
    {
      "rating": "3",
      "text": "I honestly could not say that Knock Knock is a horror movie, it is more a psychological thriller smeared with violence, in the style of Funny Games, although of course it is unfair to compare them, Funny Games is much more visceral."
    },
    {
      "rating": "5",
      "text": "Pretty dark film that is unconventional in the way it approaches the erotic horror genre. The antagonists are very sinister and act well, minus a few hiccups. However, the protagonist and deuteragonist on the other hand convey poorly at times. The crisis the protagonist finds himself in is intriguing, but some of the plot devices against him are too convenient and severely contrived. As a result, this makes me struggle to sympathise with him. Overall, Knock Knock boasts impressive potential with its thought-provoking plot, demonstrating how powerful young girls can be to anyone. But their hard work becomes undone by irritating plot devices which exist merely to shift the plot forward. Should a sequel be in the works, the script must be further scrutinised to make things a bit more believable."
    },
    {
      "rating": "9",
      "text": "A lot of people don't take Keanu Reeves seriously in the role he has in this movie. This movie was scary, thrilling really enjoyed it."
    },
    {
      "rating": "5",
      "text": "It's middling fair, with the usual bad acting you expect whenever Keanu opens his mouth. Why this guy bothers with movies where he has to actually talk, I'll never know. Stick to action movies where you only speak with guns and karate kicks, and you'll continue to do just fine, Mr. Wick. Seriously, he's a great action star!That being said, I'd watch Ana de Armas fold socks... all day long."
    },
    {
      "rating": "1",
      "text": "This is possibly the worst Netflix movie I have ever seen.  I give it one point because the girls are sexy, especially Bell.  The rest is drek.  I lost count of the number of times Keanu Reeves could have overpowered these two skinny girly-girls and gotten out of his predicament.  At one point he is taken down by a dinner fork to his upper pectoral and subdued.  By a 115 pound chick.  Yes, you heard that right.  I won't even mention the other ridiculous moments where his character responds so pathetically when opportunity arises that you stop rooting for him.  The plot is so poorly written, they had to build plot armor around the two female sociopath antagonists by having Keanu's character repeatedly fail in the lamest of ways.  Add to that the horribly written dialogue, where Keanu is still trying to morally defend himself late in the story to a couple of giggling and deranged psychos, the fact that these girls convince Keanu that they're underage after sleeping with him, when they are clearly in their twenties, and scenes of them gleefully trashing the house like a couple of cheerleaders on crack, and you have a very bad comedy posing as a thriller.  The scene with a would-be rescuer had me watching dumbfounded at its stupidity at how they got the better of him, not to mention how he inexplicably stops untying Keanu halfway through to confront the girls alone.  Then we see the girls dig a professional-looking rectangular hole in the backyard nearly six feet deep using two shovels and their spindly arms.  They must really work out.  Of course we find out at the end that these girls do this home invasion to married men all over, and somehow manage to get away with it despite leaving a trail of destruction and even bodies in their wake, along with a weak jab at the male patriarchy that the guys have this coming for being such pervs that when naked twenty-somethings start groping them, the guy stops resisting.  We never learn what motivates these girls and why they feel the need to punish husbands and fathers, only that the blonde one has clear daddy issues.  To even suggest that this is a \"pyschological\" thriller when the psychological component is so poorly developed is an insult to psychological thrillers. This movie might have worked if it made fun of itself and was deliberately campy, like the entertaining Babysitter films, but it doesn't. From the bad writing, poorly scripted action, and sketchy moral message, Knock Knock fails on every level."
    },
    {
      "rating": "5",
      "text": "Eli Roth's 'Knock Knock' can be enjoyed on a \"so-bad-it's-good\" level. This is the kind of film that has an interesting premise, but it does get lost in its own ludicrous and obnoxious execution. The film centers around a man named Evan (Keanu Reeves), who is happily married and has two young children. He works as an architect and during a father's day weekend, his family decide to hit the beach while he has the house all to himself to focus on his work. During that first rainy night, he hears a knock on his door, he answers it to see two estranged young girls, soaking in the rain, Genesis (Lorenza Izzo) and Bell (Ana De Armas) who claim to be heading to some party and are lost along the way. Being the good guy that he is, Evan decides to welcome them into his home and help them out with their situation. The girls seem to really like Evan and he shows them around while they wait. Little does he know that things start to get somewhat suspicious as he finds them in the shower and they try to seduce him, he tries to resist, but ultimately gives in. The next morning, he finds the two girls disrupting his peaceful weekend alone. They mess around and even begin to act with over-the-top results. It becomes clear to him that they were not who they claim they were. He tries to get rid of them, but they soon come back to play some sadistic games with Evan as their victim. As I said before, the movie does tell an interesting story, even for one made by typical gore master, Eli Roth. The gender politics story does contain some commentary about the reactionary differences between our characters as well as the punishment for what our main character has to face, even though he did nothing wrong. It still has that sadistic edge that Roth is known for. The main problem with the movie does fall in the sense that its interesting message gets lost in a campy and sometimes horribly acted result, even the lines of dialogue can be ridiculous. Keanu Reeves - at times - was channeling Nicolas Cage's performance, specifically, from 'The Wicker Man' (2006), the over-the-top shouting, as well as becoming a victim to women. You'll enjoy this movie on the same level as 'The Wicker Man' (2006) or maybe 'The Room' (2003), other than that, it tells a very known message, but maybe, it could have been handled by a more dramatically capable director."
    },
    {
      "rating": "3",
      "text": "Keanu Reeves... Por que? por que? Esta pelicula es increiblemente irrealista que me hizo llevarme las manos  a la cabeza cada 10 minutos, por las tonterias que estaban pasando, no me la pude tomar en serio en ningun momento lo que hizo que las cosas buenas de esta pasaran desapercibidas."
    }
  ]
}