{
  "id": 4299,
  "title": "Knocked Up",
  "starring": [
    "Seth Rogen",
    "Katherine Heigl"
  ],
  "runtime": 129,
  "genre": [
    "Comedy",
    "Romance",
    "Drama"
  ],
  "description": "A slacker and a career-driven woman accidentally conceive a child after a one-night stand. As they try to make the relationship work, they must navigate the challenges of parenthood and their differences in lifestyle and maturity.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/b4OaXw2MW97VvIiZE0Sbn1NfxSh.jpg",
  "categories": {
    "plot": 7.777777777777778,
    "acting": 7.333333333333333,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.9714285714285715,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I have read a few very bad reviews, and apparently they were watching a different movie because this one is freaking hilarious! I have seen it over and over again, and still laugh just as hard every time. Seth and Katherine are so funny together and I think they make a cute couple. Yes, there were some gross funny parts and stupid funny parts, but I personally think that makes a comedy really funny, a variety of types of jokes. If you haven't seen it, give it a chance. And to those of you who gave it a zero or one, you must not have a sense of humor at all...I understand if you didn't love it, but it deserves more than that."
    },
    {
      "rating": "8",
      "text": "An immensely absurd and psychedelic gander into the long-term consequences of poor, irrational decision-making. \"Knocked-Up\" meshes as its plot takes on the real-world pandemic of unwanted pregnancies and the painstaking path of staying loyal to your partner and child despite the stigmas linked to the causes of one's attempt for seemingly harmless fun. Mission accomplished!"
    },
    {
      "rating": "8",
      "text": "A hilarious film packed full of great supporting characters that add so much flavor to this sincere story. Raunchy and sweet have never mixed so well together."
    },
    {
      "rating": "7",
      "text": "The movie was decent, but definitly a step down from the previous film The 40 year old Virgin. A little too long, sappy, and sentimental at times. But its was enjoyable to watch."
    },
    {
      "rating": "0",
      "text": "What a godawful movie! Knocked up tries to balance humour with sentimentality and fails on both accounts. This is such a typical P.C. hollywood movie - all the kiddies swearing left, right and centre (draining any power that a well-placed invective may have potentially had), an underlying message about how sinful abortion is and how bad men are, and of course, even though there is the odd boob or two flashed by some of the extras, during two sex scenes do you think the leading lady shows her boobies? Oh no - she's too virtuous for that - her bra stays firmly in place throughout. How coy!!! Just one example of how aggravatingly politically correct and completely insincere this movie is. Nothing new - except maybe the \"crowning\" during delivery, but any potential laughs there were squashed by the absolutely abysmal acting. Not one character tells it like it is, NOT ONCE! Completely insincere, predictable responses the whole way through. Given the potential in the story's premise, this movie was a HUGE disappointment. A total waste of time and money - worst movie of the year, easily."
    },
    {
      "rating": "0",
      "text": "It's a bad film, with flat characters, unbelievable situations, and a little too much faint Jew praise"
    },
    {
      "rating": "5",
      "text": "I'm down the middle. Yeah, there were some laughs, but they were all centered around the beard bet. The premise isn't totally unbelievable, but I just didn't buy that she'd both want to keep the baby and stay with him. And I thought the writing flagged around the second trimester. I guess what annoys me most about Apatow is he's obviously a really smart, clever guy who can't quite purge all the sophomoric impulses from his movies...the pot-smoking and potty mouth stuff seems geared to 12-year-olds, who clearly aren't equipped to handle the grown-up issues here. But maybe that's why it made a ton of money -- he's figured out a way to appeal to a pretty broad demo without actually satisfying them."
    },
    {
      "rating": "1",
      "text": "It is totally without any credibility that this smart and beautiful woman would fall in love with the charmless slob played by Seth Rogen. This is a male fantasy movie. He does NOTHING to win her, to justify that she would fall in love with him. The film does not even address the issue as to why she would even have the baby. The only good thing about the film was that at least the annoying boy-man grew up - though she still had to say that he was OK as he was. No, he wasn't! He and his mates were repulsive."
    },
    {
      "rating": "1",
      "text": "A complete waste of time. I hadn't realized it was a comedy until I read the reviews. I would have shut it off if it weren't for my girlfriend."
    },
    {
      "rating": "5",
      "text": "Misogynistic crap. A schlubby male fantasy."
    },
    {
      "rating": "9",
      "text": "This is Seth Rogen's/ Katherine Heigl's best movie ever. The storyline of an accidental pregnancy, and combined with the humor of the century, makes the perfect movie for people of a certain humor. I love Judd Apatow, because of his humorous mind, and his perfect choice of actors to play in his movies, such as Paul Rudd, Jason Segel, Martin Starr, Jonah Hill, and others."
    },
    {
      "rating": "9",
      "text": "I thank this movie, not only for giving Katherine Heigl, Seth Rogen, Paul Rudd, & Leslie Mann their movie start, I thank this movie for being ridicuolously funnt and clever. One of the funniest movies of the decade."
    },
    {
      "rating": "3",
      "text": "This movie is a corny chick-flick.  There's no dark humor in it at all.  If that's what you're into, have a blast.  If not, then try \"Observe and Report,\" or \"Pineapple Express.\""
    },
    {
      "rating": "4",
      "text": "Far too long imo and it could have been a lot shorter. Also it wasnt that funny and actually a bit depressing at times. The acting was below average and I expected far better. It just wasnt that good, Very overrated."
    },
    {
      "rating": "8",
      "text": "I'm not the biggest Rogan fan but \"Knocked Up\" is an incredibly honest and well-made comedy. Apatow has a way of taking challenging life situations such as being a virgin at 40 or getting pregnant with a guy who doesn't have a job and makes them funny while keeping the messages all the more endearing."
    },
    {
      "rating": "9",
      "text": "Extremely clever, genuine, and enjoyable movie. Very fulfilling. Similar in feel, quality, and style to 40-Year-Old-Virgin. It was also fun to see some of my \"Freaks and Geeks\" homeboys. I agree that the relationship between the main characters was a bit forced, but I didn't realize it at the time; I just loved every minute."
    },
    {
      "rating": "9",
      "text": "This is probably going to be on one of those \"Top 3 Comedies of 2007\" lists anytime now. It's a brilliant movie and the characters are developed so well that even the absurd moments seem everyday logical. It's hilarious and dragged only a minute bit but eventually dragged itself back up from not very far down and headed right back into hilarity. And the language thing will be a problem if you are particularly offended by certain words and cannot ignore them out of some excruciatingly persistent morality row."
    },
    {
      "rating": "9",
      "text": "As far as comedy goes this is a great one. Consistently making everyone in the room laugh. Movie can be crude at times. Katherine Heigl is trying really hard not to be a bitch and at times she is successful. Overall a very funny movie."
    },
    {
      "rating": "9",
      "text": "I'm giving this film a nine because despite a certain Hollywoodish ending it is fresh and rewrites the romantic comedy with a hell of a lot more honesty than I have yet to see. The beauty is that it does this like a good conman would, so that you feel good even after you know you've been ripped off a bit. The main cast is stellar. It's funny and celebrates life. There's maybe a few holes but overall it's worth ten bucks now and twenty later when it comes out on dvd."
    },
    {
      "rating": "0",
      "text": "It starts with a montage and only gets worse. The only real joke is people are actually paying to see this crap."
    },
    {
      "rating": "10",
      "text": "One of my favorite comedies of all time!!! Not quite as good as superbad, but it is so fun to watch a movie with characters that speak like real guys and real girls. Apatow is truly a genius for being able to present this style in such a hilarious movie.... 100% satisfied!!!"
    },
    {
      "rating": "6",
      "text": "I has a few great moments but the rest of it seems like a glorified American Pie."
    },
    {
      "rating": "10",
      "text": "Funny as hell. Better than 40 year old."
    },
    {
      "rating": "9",
      "text": "Of course there's lots of foul language, sex jokes, and drug use. The title of the movie is \"Knocked Up\". Why anyone would complain that this film contains TOO MUCH of this stuff when it clearly states in the preview that this is a result of a DRUNKEN ONE-NIGHT STAND is beyond me. R rating plus title Knocked Up equals DUH! They talk about sex. What else did you expect?"
    },
    {
      "rating": "10",
      "text": "HAs cracked my greatest comedies of all time list...way up there...its passed 40 year old Virgin..Into Grandma's Boy territory..haha."
    },
    {
      "rating": "10",
      "text": "Easily one of the best movies I have ever seen."
    },
    {
      "rating": "9",
      "text": "Excellent film, couldn't stop laughing quite frequently."
    },
    {
      "rating": "6",
      "text": "Pros: 1. If you like crude humor, this is great. 2. One liners that make you chuckle. Cons: 1. About 95% of the movie isn't funny at all, only a slow decline into a failed depressing save. 2. Not many comedies can pull of the 2 hour thing, and this movie is a clear sign that they shouldn't."
    },
    {
      "rating": "10",
      "text": "Solid laughs. good flick."
    },
    {
      "rating": "10",
      "text": "The best movie i've seen all year."
    },
    {
      "rating": "9",
      "text": "First off, if you love F&G/Undeclared then the cast here should pull you in and you will enjoy this THAT much more. After the funny but not all that poignant Judd Apatow, it seemed almost certain that he would go further into the hollywood comedy field with Will Farrel staring in his next film. Yet, here we are with one of the most moving, honest, hilarious, and visionary (not in a pompous way, just as in \"its a guy's vision\") films of 2007 (in fact, the only one). The dialogue is so sweet and charming that it takes a real soaring talent to write and the actors are so damn good (we loved them in F&G for a reason!) Judd Apatow really has pulled off the impossible since F&G went off air, he encapsulated a decade for us that seemed to be nothing more than a hodge podge of clever references to past decades. He is this generations John Hughes or Kevin Smith. Hype could kill this movie, so I hope you actually didn't read this."
    },
    {
      "rating": "9",
      "text": "It's not often that I say this but anybody who didn't enjoy the movie would only do so because they have a large stick implanted between their buttocks. As a 23 year old on the verge of marriage and parenthood, the movie spoke to me in a way no movie has since I was 16 and saw Almost Famous. Fantastic writing and beautiful characterization."
    },
    {
      "rating": "10",
      "text": "This movie was Hysterical! The funniest movie I have seen in years. It has been a long time since there has been a comedy out where you are actually laughing outloud in the movie theater. I would recommend this movie to everyone!"
    },
    {
      "rating": "10",
      "text": "After \"The 40-Year-Old Virgin\" there was a huge margin for disappointment. Judd Apatow and Seth Rogan lived up to every positive expectation I had about what this movie should be. This movie is non-stop laughter and like \"Virgin\", just as sweet and endearing. But I think that the each time it careened toward the precipice of over-sentimentality it's juvenile stoner antics and sharply realistic male behaviors put the breaks on. In my opinion this film is a perfect balance of the two. My only negative criticism is that like \"Virgin\" it might be just slightly too long, but I'd be hard pressed to say what should be cut. This is nearly a perfect comedy."
    },
    {
      "rating": "9",
      "text": "This movie was fantastic. Funny, dry, heartfelt and a lot more cohesive than The 40-year-old Virgin.\" The only small quibble I had was with the set-up for the romance between Ben and Alison. Not well established, even though by the end of the movie I bought it...but at 2 hours I'm not sure how much more set up I would be willing to endure. Still, funny as all get out, no doubt."
    },
    {
      "rating": "9",
      "text": "Really good movie. Although high on the raunchiness scale, not out of the realm of behavior I've seen from my husband's friends back at that age. Also covered situations very realistically, not the typical Hollywood treatment."
    },
    {
      "rating": "9",
      "text": "If you \"IMDB\" this movie, you'll see that the cast are no strangers . . . they have starred together in productions as far back as Freaks and Geeks. You could tell that there was massive chemistry between the castmates because this movie was HILARIOUS. I haven't had sidepain during a movie EVER from laughing so hard . . . until now."
    },
    {
      "rating": "4",
      "text": "Eh.. That's how this struck me. Meh. Not very funny, not especially well acted. Not much to say really, unlike the rabid defenders/detractors. Just kinda OK with shadings towards the stinky side. Seth Rogen certainly cannot carry a leading role, and Paul Rudd was poorly utilized."
    },
    {
      "rating": "5",
      "text": "There was nothing wrong with this movie, but there was nothing really right about it either. I didn't find it nearly as funny as the reviews are making it sound, but there were a few laughs. It would have been better if it was about 30 minutes shorter."
    },
    {
      "rating": "8",
      "text": "If this movie isn't appreciated by some, it's because they have confused, silly notions about \"morals\" that prove they have not actually seen \"Knocked Up\" or have been spoiled enough by all the dumb, cheap trick comedies to come out of Hollywood (\"Click,\" \"Wild Hogs\") that they can't appreciate something that truly is HUMOROUS. I won't say \"Knocked Up\" is a masterpeice, but it is one of the better comedies this year, and deserves to be seen. In fact, f*** what anyone says about it and just go see it!"
    },
    {
      "rating": "10",
      "text": "I thought \"Knocked up\" was hilarious. The whole thing just had a feel-good vibe to it, and just about every part of the movie kept me laughing!"
    },
    {
      "rating": "10",
      "text": "Hilarious. Instantly vaults itself into my top 5 movies of all time. Hard to imagine a movie funnier than this ever being made."
    },
    {
      "rating": "6",
      "text": "A comfy, reassurring promise for the underachieving, developmentally arrested nebbish whose worst nightmare results after a Cinderfella night with his wildest dreams. A man's version of \"having it all,\" leaves nothing for the woman. Humorous at times, but tragic overall."
    },
    {
      "rating": "9",
      "text": "Great movie. I was rolling around laughing my ass off practically the whole time. \"Dude, there are 5 different types of chairs in this hotel.... WHY ARE THEY ALL HERE??\" Haha definitely a must see. Anyone who doesn't see the humor in this movie is probably a stuck up christian, and probably also a virgin."
    },
    {
      "rating": "10",
      "text": "Balanced perfectly. Finally a chick flick that guys can appreciate."
    },
    {
      "rating": "8",
      "text": "Knocked up aims to be and succeeds at being one of the best comedies coming out this winter. The reason why this comedy works is because all the characters work. Ben's frat friends work well, the awkward moments between the married couple, Ben and Allison add some good moments while the conversations between Allison and her boss work well too. For all of those who are bemoaning the level of swearing, grow up. That's right, grow up. You sound like a bunch of kids going Did he say the p word? Oh! Jeez. People swear, and people especially swear in moments such as these. If you don't like comedies with a little spice on the side, stick to the cartoons, us normal people will be reveling in a great movie which aims to celebrate relationships and the trials and tribulations of them, and succeeds."
    },
    {
      "rating": "10",
      "text": "This movie is not a teen movie or a main stream comedy for me and it hurt close to home about the questions of love and the mistakes we take as we age."
    },
    {
      "rating": "9",
      "text": "Okay I loved it. I'll admit it wasn't quite a masterpiece but very real. Some of the other comments on here actually make me really mad because it is very similar to my own life story about my husband and my daughter. So its a shame that SOME people on here obviously know nothing about love and family. Its not that unreal because I really lived it-and she doesn't give up anything-remember-she still works at E!- very good movie and NOT THAT FAR FETCHED AFTERALL. (although I am from the midwest were people are a little less shallow than L.A.) And yah it wasnt a slapstick kind of movie-real life is funny, too!"
    },
    {
      "rating": "2",
      "text": "This movie is a complete rip-off of a book that came out 6 months before. Plagiarism at its best!"
    },
    {
      "rating": "9",
      "text": "Oh my god its so unbelievable! Jesus people its a movie, its not supposed to be believable and completely realistic. I thought this movie was absolutely hilarious, Ive watched it probably 10 times and it gets funnier every time. Lighten up."
    }
  ],
  "recommendations": [
    "the_40_year_old_virgin",
    "step_brothers",
    "hall_pass",
    "the_change_up",
    "funny_people",
    "the_ugly_truth",
    "superbad",
    "a_million_ways_to_die_in_the_west",
    "this_is_the_end",
    "neighbors_2_sorority_rising",
    "the_hangover",
    "good_boys",
    "ted_2",
    "ted",
    "neighbors",
    "jackass_presents_bad_grandpa",
    "rough_night",
    "jexi",
    "grown_ups",
    "trainwreck",
    "bridesmaids",
    "dinner_for_schmucks",
    "the_happytime_murders",
    "hot_tub_time_machine",
    "what_happens_in_vegas"
  ]
}