{
  "id": 49,
  "title": "Knowing",
  "starring": [
    "Nicolas Cage",
    "Rose Byrne"
  ],
  "runtime": 121,
  "genre": [
    "Action",
    "Mystery",
    "Science Fiction",
    "Thriller"
  ],
  "description": "A teacher opens a time capsule that has been dug up at his son's elementary school; in it are some chilling predictions -- some that have already occurred and others that are about to -- that lead him to believe his family plays a role in the events that are about to unfold.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nO9gTGDNdYnPr9ILKNQmk6EVTVR.jpg",
  "categories": {
    "plot": 2.6,
    "acting": 1.7,
    "ending": 3.75,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 4.666666666666667,
    "funny": 10.0,
    "action": 2.5
  },
  "reviews": [
    {
      "rating": "1",
      "text": "just...wow. Intelligence profoundly insulted, I'm even a Nick Cage fan."
    },
    {
      "rating": "1",
      "text": "Trite. Tomato-surprise ending. Fails to suspend disbelief. Plot holes you could drive an asteroid through. Characters you don't care about. And on and on."
    },
    {
      "rating": "1",
      "text": "This is one of the most boring and most predictable movies I've ever seen. In fact \"Knowing\" is the perfect title for it, because I _knew_ the whole story 10 seconds after the boy opened the envelope. So this whole thing was a waste of time. [THIS CONTAINS SPOLIERS!] It's a far below-average \"The world ends next Thursday\"-flick. And perhaps the plot-twist, that judgement day is upon Nicolas Cage, would have been surprising to someone, if they haven't already given it away in the movie-posters. You know that the world will end, that there is nothing Mr.Cage can do about it, you know that these guys are aliens and you know that they will take the kids with them and blahblahblah... the whole story seems to be assembled out of a \"screenplay-construction-kit\" or they just pulled cards with tags like \"aliens\", \"end of the world\" and \"foresight\" on it, and filled the gaps with special-effects. ...oh ok, well the special effects are good. So the movie feels like something M. Night Shyamalan and Roland Emmerich threw up on a tequila driven night."
    },
    {
      "rating": "2",
      "text": "Nice action sequences - That's all. Ridiculous plot. Ridiculous acting. So many cinematic mistakes. Don't watch it - It isn't worth any money to spent!"
    },
    {
      "rating": "0",
      "text": "This movie scared me straight! I now believe in Jesus and couldn't be happier!"
    },
    {
      "rating": "2",
      "text": "This is just another in a long line of poor Nicholas Cage films, he has apparently had so much botox as to render his facial muscles inoperable and he cannot now make any expression beyond constant mild suprise. Further to this the plot of this film is dire, the first 30 minutes are quite good, which is why this film gets 2 stars instead of 0, but after that the plot decends into madness and the director manages to get out of his own labyrinthine plot by using aliens/angels and explaining nothing very well at all. do not waste your money on this film."
    },
    {
      "rating": "3",
      "text": "Stupid is the best word to describe this movie. After viewing the ending, everything that happened prior to it is totally irrelevant and played NO part in the entire movie! Yes that's right the entire plot of this movie is 100% pointless once you see the ending, so why did I waste all of my time trying to understand the meaning of everything happening up to the ending, because I was stupid to rent it! I won't spoil the ending for you just in case you feel like wasting almost 2 hours of your life but the only highlight of the movie was a cgi plane crash somewhere in the middle of the movie (again, this was totally pointless to the ending). Even the critics were kind in their reviews!"
    },
    {
      "rating": "0",
      "text": "It felt like this movie was written by a group of brooding college students with too much time on their hands. While on one hand you have plot points so meticulously constructed that you forget there is an actual story unfoldidng, on the other you have gaping holes so big you'd think they were made by a Boeing 747. Not only is it stupid, but pretentious at the same time, talk about a real winning combination."
    },
    {
      "rating": "0",
      "text": "This was one of the worst movies I've ever seen. It didn't flow well and half way in, when you didn't think it could get any worse, It DID! I love Nicolas Cage but I couldn't in this. His acting along with everyone elses was horrible. the story was even strange & choppy, special effects looked so fake, and it feels like they were trying too hard.. I watched with with an 11year old who even said how horrible this movie was. It's too bad."
    },
    {
      "rating": "1",
      "text": "I give this a 1 for almost keeping me interested at the start, but it very quickly turns into one of the dumbest big budget films played with a straight face I've ever seen. SPOILER ALERT - if higher beings know the future, can travel through space, etc, then why choose all this weird ambiguous whispering and symbolic nonesense to get people to do as they're told. It makes less than no sense. Plot wise this is complete drivel, only some ok CGI saves about five minutes of this movie. Cage is terrible, mostly because his lines are so stupid, at times he actually explains plot points out loud as if the audience were as dim witted as the writers. Avoid."
    },
    {
      "rating": "3",
      "text": "Cage plays a MIT professor in possession of a secret code that seems to predict disasters with unerring accuracy. The setup to this is actually fairly well done and the movie works well but then it drifts into some sort of pseudo-religious, pseudo-alien mumbo jumbo and as Revelation 3:16 so eloquently states:"
    },
    {
      "rating": "0",
      "text": "This is quite possibly the worst film I've ever seen, patronising and confusing at the same time. Without giving away any spoilers the end just doesn't make sense and there's a nasty anti science subtext (He's a bad father because he's a scientist?). On top of this the effects and acting are seriously sub par. There is also the somewhat offensive use of real life disaster-esque footage for entertainment purposes with far too many essentially pointless shots of horrific daths. I can't even recommend this as a so-bad-its-good film. I honestly don't understand how anyone thought this was good. It's not entertaining, thought provoking or inspiring. It's just bad. I want my money, and worse, 2 hours of my life, back."
    },
    {
      "rating": "3",
      "text": "Given the presence of Nicholas Cage, who can go under the radar and succeed, as he did in last year's way-underrated \"Next\", and Alex Proyas, who has shown himself to be an innovative, often visionary director of action, \"Knowing\" has to be considered a major disappointment. Is Hollywood so clueless about real religious experience that it thinks it proceeds from depression to complete skepticism to fanatical certainty based on some numbers scrawled by a young girl and placed in a time capsule 50 years earlier. It;s enough to give credibility and substance to Bill Maher's adolescent view of religion in \"Religulous\". However, Proyas can still direct a great action sequence."
    },
    {
      "rating": "0",
      "text": "I KNOW never to let my idiot friends choose what movie to watch next time!!! black stones, albinos, aliens and spaceships, and nicolas cage (bad acting -same thing- ). seriously, why is nicolas cage acting when he can't act??? This movie was only half as bad as i had expected it to be up till the part where you find out that the albinos are actually aliens, who are actually god, and who are trying to save the human race from it's apparent doom according to whispers that only two children can hear, and a series of numbers only nicolas cage can interpret... don't watch this movie even if you are tied to a chair with your eyes held open and a gun pointed to your head with the threat that if you don't watch your head will be blown off... it's that bad. and i'm not saying that just because i don't like nicolas cage. ok maybe a little."
    },
    {
      "rating": "9",
      "text": "Full or flaws but a damn good movie. OMG, the effects of the accident scenes....blew my mind."
    },
    {
      "rating": "3",
      "text": "This is like your inside the mind of an elementary student daydreaming."
    },
    {
      "rating": "0",
      "text": "One thing's for sure, if Armageddon every actually does happen, it couldn't possibly be as bad as this movie."
    },
    {
      "rating": "1",
      "text": "This movie is confusing, illogical and rife with poor acting. Worst, it's slow moving and boring. This movie makes me sad for the state of Hollywood."
    },
    {
      "rating": "2",
      "text": "\"But it is Caleb's father, professor John Koestler, who makes the startling discovery that the encoded message predicts with pinpoint accuracy the dates, death tolls and coordinates of every major disaster of the past 50 years. As Ted further unravels the document's chilling secrets,\" In Metacritics synopsis, who the heck is Ted?"
    },
    {
      "rating": "1",
      "text": "Too many plots to develop one working story with disturbing high-budget disaster scenes you'd expect to see in a Final Destination flick."
    },
    {
      "rating": "2",
      "text": "This is seriously one of the worst movies I have seen. The plot was stupid, the acting was terrible, and the script was also bad. It might seem good to those children in the range of 10 to 13 years old simple because of the special effects and a few eerie scenes but other than that it is terrible."
    },
    {
      "rating": "1",
      "text": "Absolutely awful. Cage is a joke with his wide eyed wonderment. Plot made no sense, they couldn't figure out if they wanted aliens or angels. Gave it a 1 instead of 0 because, for some unknown reason, I didn't walk out."
    },
    {
      "rating": "1",
      "text": "Terrible film. I think at one point i caught a glimpse of the release date of the movie on that list of his."
    },
    {
      "rating": "0",
      "text": "God-awful. Just horrific. How can anybody like this?"
    },
    {
      "rating": "3",
      "text": "So, a genius mathematician uses a white board to track the number progression when he could throw it into the computer and get a quick answer? And a 10-year-old boy doesn't know enough not to approach a car with a stranger driving? And the ending is even worse! Not much here to recommend--bad writing, bad writing, and walk-through performances. Did I say bad writing?"
    },
    {
      "rating": "9",
      "text": "This movie is much better than the meta score given by the \"critics.\" I was going to blow the movie off, based on the OVERWHELMING poor reviews. But then I saw that Roger Ebert, one of the three critics whose reviews I value, rated it highly. I was pleasantly surprised. The story line was interesting, the CGI off the chain, and the ending somewhat surprising. In truth, I believe the conflict between the users overall score and the metacritic score turns on the anti-religious posturing of many media critics. I'm not making any value judgments for or against religion or spirtuality - merely commenting on most media critics response to movies with underlying spiritual themes (see the LA Weekly review)."
    },
    {
      "rating": "1",
      "text": "Pathetic! The start and the middle of the movie were ok. But, the ending is so stupid you would never want to even talk about the movie. Knowing is probably the worst movie of the year."
    },
    {
      "rating": "3",
      "text": "Good start . Epic failure ending."
    },
    {
      "rating": "3",
      "text": "Can not say that I enjoyed this movie to its fullest, or anywhere close to it. To be honest, it wasn't very good, and parts of the plot was ridiculous. However, not a terrible movie. Ill recommended for a buy, unless you really want to; So, renting it would be better."
    },
    {
      "rating": "1",
      "text": "Pathetic...this was one of the most stupid, predicted movie I have ever seen."
    },
    {
      "rating": "0",
      "text": "Seriously disappointing film. Slow and plodding, unnecessary profanity, poor graphics.. and who wants to see a herd of wildlife on fire? Then there is the whole spiritual mess that the film developed. This is, in my opinion, the worst Cage film I've seen and certainly isn't worth the time or dollars to see it."
    },
    {
      "rating": "1",
      "text": "Although interesting in the initial concept, this film ended as the worst movie I have ever seen. Poor acting on all parts, and an ending that never ends.... Although a sci-fi fan and open minded, this movie left me wishing I hadn't wasted 2 hours of my time."
    },
    {
      "rating": "1",
      "text": "This movie was TERRIBLE! After watching it my husband and I both wished we had gone to see Monsters v Aliens in place of this. Absolute crap."
    },
    {
      "rating": "1",
      "text": "Started off half-decent, but by half way through it started to drag on and I couldn't wait for it to be over."
    },
    {
      "rating": "7",
      "text": "Knowing's writer needs to have an IQ check. While the film was enjoyable, the logic was just horrible. if your going to make aliens come to preserve the human race, then they either shouldn't predict the future, except maybe the solar flare, or they just shouldn't be aliens. The aliens were a little bit unexpected after you see the pictures of God and the sun or the priest dad. Otherwise, great film."
    },
    {
      "rating": "0",
      "text": "The first half is enjoyable enough, except for Cage's acting, which is a shame since he's in every shot of the movie. However, as events unfold they become more and more ridiculous until the jaw-droppingly idiotic last ten minutes, which abandons any pretense of intellectualism and, rather than produce some explanatory rabbit out of its hat, plumps for hokey pseudo-religious imagery and an orgiastic bout of SFX. In the film's final moments, disbelief isn't just suspended, it's hung, drawn and quartered on the alter of stupid CGI."
    },
    {
      "rating": "0",
      "text": "What exactly was the purpose of this film? I could have found better uses for the millions spent on this horrible movie. I really can't believe any one gave this a high rating.\r This movie is completely hosed from the start and spends the entire time mixing myths and folklore with religious undertones, special effects and wishful thinking. The story has no believability and I find it very difficult to suspend my disbelief system in order to enjoy this movie.\r Don't get me wrong, I like Nicolas Cage, but Jesus dude, couldn't you pick a better script than this? Oh, yeah, tax issues, gotta pay the man.\r When I first saw this movie I thought it was from the same people who made The Happening, but I see that it was from another moron who knows every thing about the technical side of movies but nothing about good scripts and directing.\r I don't think a 1,000 writers with a 1,000 re-writes could have made this a good enough movie to waste money on and it is a good thing I got to see it for free."
    },
    {
      "rating": "2",
      "text": "It was pretty good at the beginning, I thought the storyline was really cool.  But then it involved Aliens.  The ending was horrible like what is Nicholas Cage supposed to tell the authorities.....\"Oh, I just let my son and my friends daughter go on an Alien spacecraft\" Overall a pretty stupid movie."
    },
    {
      "rating": "3",
      "text": "When I started watching this movie I was excited. Finally, a good sci-fi movie, with touches of suspense and horror, and a nice tension. In fact, the two major strengths of this film are the visual components (airplane disaster or scenes of looting crowds, closer to the end, are visually impressive, for example) and the central idea of ​​the plot: a numeric prophecy investigated by a skeptical mathematician. The problem is that the good things in the movie end here.From the middle, the film loses quality. With prophecies solved the plot thread ends. From there, the film extends because it has to close the story anyway, giving rise to plot holes the size of houses and inserting immense religious symbology for no reason. I read a comment that said the movie is full of subliminal propaganda to Church of Scientology... well, I actually detected symbols with religious connotations, but I'm not an expert in subliminal messages or in that sect to properly identify a connection to a specific cult. Another problem is the hammy and unnatural performance of Nicolas Cage, who ceases to be skeptical too suddenly and unbelievably. At the beginning of the film, he lectures at MIT in which he approaches determinism and coincidentality... even this could have been best used in the script! The film is loaded with CGI of fairly medium quality, but the end is more worthy of a computer game than a movie."
    },
    {
      "rating": "3",
      "text": "okay, the film was nicely made and the story worked for itself and it was quite simple but catching and tense. but there is one big problem. why on earth would the aliens play with people by giving them cryptic messages, being mysterious weirdos and throwing black stones around for fifty years, if they can simply come, take the kids and go away?! ah, i know, then there wouldn't be any movie..."
    },
    {
      "rating": "0",
      "text": "Possibly the worst movie ever made - although you might not hate sitting through it as much as some movies which may be better. That may sound like a contradiction but wait until you see it... which you really shouldn't!"
    },
    {
      "rating": "0",
      "text": "Why does nicolas cage keep getting acting jobs? he's dreadful! he displayed one facial expression throughout the entire movie, a movie which would have been terrible even with a decent main actor. albinos, aliens, black pebbles, spacecrafts, adam and eve, and still the most unbelievable part was nicolas cage's acting."
    },
    {
      "rating": "3",
      "text": "The plot errors and bad writing seem to be the least of this movie's worries, and considering the movie's flaws, that's saying a lot....  Nicolas Cage has never looked so ridiculous (ok, that's a lie, but I need to fill the 150 character count)"
    },
    {
      "rating": "8",
      "text": "KNOWING is a film which appeals to the innate curiosity of the filmgoer to find out, \"to know\" what will happen next as a result of the revelation of the meaning of mysterious numbers hidden long ago by a school child in a time capsule. In brief, the acting is solid; the mystery is continuous and well-sustained; the special effects are spectacular - likely the best I have ever seen - and so realistic, that they are a bit startling to see unveil themselves; the music throughout is excellent; and the plot is original, with an ending that will leave the reader thinking about the message of the move well into the night. Thumbs Up, and kudos to the Proyas for having made a very good, bold and even visionary movie."
    },
    {
      "rating": "10",
      "text": "I feel like I"
    },
    {
      "rating": "5",
      "text": "It's an excellent movie with decent acting, editing, and camera, with a good suspense buildup. What went wrong? The ending. It just threw EVERYTHING good about it into the rubbish bin. It came out of nowhere, made no sense, was over-dramatized, and turned the entire thing into a religious film."
    },
    {
      "rating": "8",
      "text": "UUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUHul a great disaster flick i didn't undestand so much negative reviews the film is spectacular in every sense of word less the final is very bad but deserves a 8 without doubt"
    },
    {
      "rating": "10",
      "text": "I thought this movie was amazing, the best I've seen in a while. The plotline was cool and the special effects were amazing. Nicolas cage and Rose Byrne were awesome in it. I can't believe how some people didn't like this movie."
    },
    {
      "rating": "4",
      "text": "I don't understand the high ratings some users have given this film. While this movie does have a great premise and I will agree that the FX are astounding, the ending is a complete let down and cop-out. This is a typical Hollywood effort, tons of potential and you leave feeling flat and cheated. If you thought the end of the last Indiana Jones movie was great, go see it, otherwise be prepared for a disappointment."
    },
    {
      "rating": "10",
      "text": "Comedy of the year! The final reel's dialogue is the stuff of comedic genius. Problem is someone should have told the scriptwriter that it wasn't a comedy in the first place."
    }
  ]
}