{
  "id": 1063,
  "title": "Kong: Skull Island",
  "starring": [
    "Tom Hiddleston",
    "Samuel L. Jackson"
  ],
  "runtime": 118,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "Explore the mysterious and dangerous home of the king of the apes as a team of explorers ventures deep inside the treacherous, primordial island.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/r2517Vz9EhDhj88qwbDVj8DCRZN.jpg",
  "categories": {
    "plot": 6.614035087719298,
    "acting": 6.080645161290323,
    "ending": 7.0,
    "soundtrack": 5.2,
    "cinematography": 7.5,
    "familyFriendly": 6.0,
    "funny": 5.090909090909091,
    "action": 7.548387096774194
  },
  "reviews": [
    {
      "rating": "9",
      "text": "One of the high points of the Legendary MonsterVerse, Kong: Skull Island does everything Godzilla 2014 does not. It is a colorful, visually stunning film with a sense of humor, a likable (if not much more developed) human cast, and not the slightest shred of fear in being what it is. The monsters are all on full display here, not just shown in broad daylight and allowed to do their thing uninterrupted, but given scenes to themselves that aren't just big battle set-pieces. Kong is given the chance to simply hang out and be a character, fleshing out both his personality and the fantastical world he explores around him. He shares the screen with a whole host of weird and interesting creatures that at times push the movie into borderline horror territory; creature feature fans who left the last Godzilla feeling shorted will have heaps to gush about here. Sam Jackson and John Goodman deliver solid performances, but the real standout isn't either of them, Tom Hiddleston, or Brie Larson- it's John C. Reilly. Movie-goers who might be going into this worried by his goofy antics in the trailers are sure to be surprised: his character is actually the emotional center of the movie, easily the best human character in the MonsterVerse and genuinely funny to boot. Ultimately Kong: Skull Island doesn't try to be anything more than a simple monster-driven action adventure movie, and that's okay: it's one of the best ones ever made."
    },
    {
      "rating": "8",
      "text": "An enjoyable monster flick, a new spin on the Kong lore. Excellent effects, cool creatures. Love the blatant Apocalypse Now references! A damn fun movie!"
    },
    {
      "rating": "10",
      "text": "A pretty cool and enojoyable monster-kaiju movie, nothing more and nothing less than that.this is not about imitating the Peter Jackson version, this is his own thing, and in that aspect it succeeds.it seems good to me that there are different versions and iterations of King Kong, in the same way that there are different Godzilla movies with different styles and forms"
    },
    {
      "rating": "8",
      "text": "I haven't seen any of the old King Kong movies or Peter Jackson's 2005 King Kong film, but Kong: Skull Island is easily the best movie in the so-called Monsterverse, the cinematic universe shared by King Kong and Godzilla. As is usual for these movies, the human factor is much lesser compared with the kaiju part. But at least in this movie the humans make much more sense than the recent Godzilla films, and there are actually fun moments. Also the kaiju fights are great. Kudos to Jordan Vogt-Roberts for directing this movie."
    },
    {
      "rating": "8",
      "text": "This version is closer to the 1976 version than the 1933 and 2005 version. As a roller coaster it works quite well and the special effects stand out and are at the service of the plot and not the other way around. This should be seen as a prelude to the clash of titans Godzilla vs. Kong. To see with a large bag of popcorn on hand."
    },
    {
      "rating": "7",
      "text": "Kong was overall a really good movie. The movie was best in its world building that occurred. Seeing the cool creatures, the geography and just the environment in general were a joy to watch and discover. The action scenes themselves were also impressive. They were well directed, exciting, looked fantastic and at times surprising. There is a specific scene where Jackson's group is walking through a forest and they are around bamboo trees. There was a giant spider who's legs look like the trees and it was unbelievably amazing.The only flaw in the movies are the characters. The actors are good and they are decent blank slates, but they could have used more personality.Overall, i would say it was a great film. I would definitely recommend it to anybody who is thinking about seeing it. At worst, it should be a decent film with some great moments that everybody should enjoy."
    },
    {
      "rating": "10",
      "text": "As a fan of the big monster films since I was a kid in the 70’s, I have to say this movie is EASILY the best King Kong movie ever made. It has a real story, great characters, amazing action, thrilling suspense and the best effects I’ve seen in this genre. I always loved Godzilla more than King Kong, but even after seeing the new Godzilla vs. Kong movie, I have to say Skull Island stands alone at the top still. The new Godzilla movies (including Godzilla vs Kong) spend too much time with dialogue between ultimately meaningless characters. Skull Island has characters that you care about, that you hate, that you can identify with. The story is really cool, set during the Vietnam war with iconic music, weapons and choppers. Imagine a King Kong movie with a backdrop of Black Sabbath, Hollies, and Creedance tunes. It just WORKS.I had hoped the Godzilla vs Kong movie would utilize this same type of formula, with authentic characters, weapons, fighter planes, and MUSIC from a time period. Instead the makers went with the same formula from the other Godzilla movies which is weird characters who say a whole lot but none of it really matters. If you see one movie from this Monster Series, see Skull Island."
    },
    {
      "rating": "8",
      "text": "Scientists, soldiers and adventurers unite to explore a mythical, uncharted island in the Pacific Ocean. Cut off from everything they know, they venture into the domain of the mighty Kong, igniting the ultimate battle between man and nature. As their mission of discovery soon becomes one of survival, they must fight to escape from a primal world where humanity does not belong. Offering exhilarating eye candy, solid acting, and a fast-paced story, Kong: Skull Island earns its spot in the movie monster's mythos without ever matching up to the classic original. Final Grade is a B+."
    },
    {
      "rating": "10",
      "text": "Estaba buscando una película para pasar un buen rato, sin embargo si estas buscando algo innovador y fresco probablemente no sea lo que buscas"
    },
    {
      "rating": "8",
      "text": "It aint easy making a monster movie, just take a look at Godzilla. But Kong: Skull Island manages to make the movie interesting both in terms of Kong and the humans. Samuel L. Jackson represents our old friend the US who just wants to kill everything that doesn't like americans or kills them, while Brie Larson runs around in a white tank top and thinks she understands a gorilla the size of the empire state building. And it is all very entertaining nonetheless.It is an excellent movie, 8/10."
    },
    {
      "rating": "7",
      "text": "A well done introduction of Kong to Waner's monsterverse. it has a good plot, with some flaws in the human characters, but that doesn't matter, it's a monster movie not a loved one. the human characters are better developed that Godzilla 2014, and also Kong has a good screen time."
    },
    {
      "rating": "7",
      "text": "Kong: Skull Island is not a perfect film, but it is a lot of fun. You will not really remember too many of the characters, but as a fun monster romp, it gets the job done."
    },
    {
      "rating": "8",
      "text": "The movie does have some flaws such as weak characters that don't have much to do and being way overcast however everyone is very good in it and the movie is very well directed with great cinematography and visuals and fun monster action."
    },
    {
      "rating": "9",
      "text": "Kong: Skull Island PvC Review (5/30/19)ProsPlaying the prequel to 2014’s Godzilla; Kong: Skull Island takes a brighter and more stylized approach to kaiju action while also giving the human characters actual interest. The movie takes all that was wrong with the 2014 film and works to improve it, while also expanding a bit on the lore of their created Monsterverse. The pacing keeps me engaged, the beautiful visuals and shots keep me in awe, the vietnam soundtrack proves that you can never go wrong with classic rock, and the monster action is leagues beyond the last film. But what I appreciate the absolute most is the development and lore given to the monsters in the film, especially that of Kong. You actually learn to feel for the monster and his history, so that when the final fight inevitably does hit, it hits hard. The final fight in itself is genuinely amazing, one that I could watch for days due to its style and its cutting to the humans never takes away from it as they are actively involved in the smack down. There is a lot of love and passion bleeding into this film for the B-movie spectacle of some of the classics, but most importantly the director just knows to have actual fun instead of trying to maintain a gritty realism. It rewards the viewer time and time again with a CGI spectacle not worth missing. Of course I am going to dive into cons now, but just know that these cons are small and that this film doesn’t suffer nearly as bad from them as its predecessor.+ CGI Spectacle+ Humans are entertaining and don’t take away from the film+ Monsters are developed and have emotion behind them+ The style is pure bliss+ The soundtrack of vietnam is always amazing+ Expands upon the lore of the Monsterverse especially with it’s after credits scene+ The action is fantastic with the final fight being just awesome+ Environment is beautiful+ Wonderfully shot+ RewardingConsKong: Skull Island does have some genuine problems, all of which never hold it back from being a good time or take away from being B-movie excellence. But first let us get the biggest problem of the whole film out of the way, the impact of death. While the humans in this film are entertaining, a lot of them feel like they are just there for the ride rather than contributing anything and most of these characters are what the movie chooses to be its victims. The deaths are quick and swift with no time to mourn which the film is quite self-aware about, but at the same time there is just no feeling of loss for any of the characters. There are only one or two characters that have a bit of an impact when they go, but the rest is very, “oh well that happened!” But while the impact of the deaths were lackluster, the deaths themselves genuinely are perfectly gruesome. That’s my biggest complaint overall honestly, the impact of the deaths. I do have smaller ones; such as some of the writing just not landing, wish there was even more Kong fights (just a me thing honestly) and just somethings just not making logical sense (ex. The amount of helicopters compared to the single ship). But those all are very small and again never take away from my enjoyment of the film. - Little to no impact from characters being killed off- Some characters didn’t contribute- Writing can be a miss at times- Somethings don’t make senseOverallKong: Skull Island is a B-movie through and through but I genuinely believe that is where these movies shine their absolute best, as it’s this B-movie style that give these movies their charm. They’re creature features, kaiju films, a genre that was once thought dead but thanks to Legendary Pictures and Warner Bros. we have a whole universe of them to look forward to. And this universe honestly has me feeling like a child again to when I found that old VHS in my house labeled “King Kong vs. Godzilla” and I looked past all the blatant flaws to find a world that I always wished to be apart of. Kong: Skull Island does the exact same thing for me and I wouldn’t have it any other way."
    },
    {
      "rating": "7",
      "text": "Honestly I hate King Kong. I can't stand seeing an ugly gorilla killing cool dinosaurs. Initially I had skipped this movie and directly watched Godzilla: King of the Monsters, but seeing how many references of this movie that movie had in the post credits and the fact that I needed to watch this to understand Godzilla vs Kong is why I watched this movie in the first place (I still haven't watched Godzilla vs Kong though lmao). This movie, however, wasn't that bad. In fact the CGI is pretty good.But that doesn't change the fact that an ugly gorilla is killing cool looking Skullcrawlers here, although I was satisfied that he could win only with the human help. Samuel Jackson plays the role of an annoying general who gets his comeuppance (which is the reason why I have given it such a good rating). He was so irritating. When he said he will kill all the Skullcrawlers after he kills Kong I felt like going in the screen and slapping him. Like, just one scene ago your entire squad got thrashed by only one Skullcrawler child and here you're dreaming of taking down every single one of them you zoophobe!?The movie takes place on an island in the 70's. Although Kong gets very less screen time and there is too much talking and exposition, it wasn't as bad as the Godzilla movies. The human characters were actually interesting. I liked the part where one of them dies when a giant spider steps on him and everyone thinks it's a tree. The professor who explains the entire context of the tribes worshipping Kong was also an interesting story. In the end they all manage to get away from the island and tell the world about what they saw. It was a good ending. If they had done something like saying why they were going to keep it a secret I'd have legit given it a 1 star rating.The CGI has been done very well. Although it features a number of cool creatures (the Skullcrawlers especially), it does not induce the same frantasy feeling that Godzilla movies do. It only makes it feel like giant creatures fighting in an island. It doesn't feel \"legendary\", like what you feel when you watch King of the Monsters' trailer. It just looks... Meh.Kong: Skull Island may not be some very extraordinary movie, but you do have to watch it if you want to watch Godzilla vs Kong. It's a bit annoying but makes it up with the colour palette. I really hope this is the last time I'm seeing the ugly gorilla. Because I am never going to re-watch this."
    },
    {
      "rating": "9",
      "text": "Esse filme do King Kong tem coisas que o do Godzilla (2014) não tem que é o conflito entre humanos e titã, é briga quase o tempo todo e é isso que a gente quer. Takes daora. Filme muito bom."
    },
    {
      "rating": "8",
      "text": ""
    },
    {
      "rating": "7",
      "text": "I really liked King Kong from 2005, so I tried Kong: Skull Island. That one wasn't as good in my opinion, but it was still good. I thought the story was worse, but the setting was great. It was a very nice show with good CGI. What might have been a problem for some people in 2005's King Kong was the pacing. It took quite a while before Kong the monkey himself showed up. For me, it was fitting and it got my attention and I was just waiting to see when he would show up. Here we see him just a few minutes into the film, which probably gets a lot of people's attention, but not so much for me because I had nothing to look forward to when the film introduced King Kong in the opening minutes. But the aforementioned CGI was awesome and the action scenes were also gorgeous. I enjoyed the eye candy in the form of action to the fullest and that is also in my opinion the biggest draw of this film. I would watch Kong: Skull Island not for the story but for the action and CGI. It's just a nice spectacle. That's all. For me, it's a good film that I can recommend."
    },
    {
      "rating": "7",
      "text": "Kong: Skull Island is one of those movies you watch when you don't want anything serious. Thankfully, this movie understands what it is, and doesn't try to be anything else, I just wish it tried a bit more in every aspect that wasn't Kong himself.Kong is a blast whenever he is on screen, his massive presence and sheer power are wonderful to watch unfold on screen. Watching the human characters get picked off gradually by the islands prehistoric and fantasy creatures will be sure to put a smile on your face. However, that's where my praise ends.Although succeeding in what it needs to, the human characters are insanely hollow and have no development or meaning for them to be personalized by the movies given titles such as \"Photographer\" or \"War Veteran\". The main hero characters could easily be killed off and at best I will raise an eyebrow or two, other than that, I could not care less about them.Their on screen enjoyment derives from the island's nature to kill as many of them as it can, and as for Kong, his character is portrayed through the visual storytelling it needs to, just enough to make him likeable and understandable as a Kaiju needs to be."
    },
    {
      "rating": "10",
      "text": "Big monke is pog? It sure is pog. Have no fear. Monke is also large. Large is good. Good big monke"
    },
    {
      "rating": "9",
      "text": "Another solid outing in the MonsterVerse, Skull Island lives up to the bar set 3 years earlier by Godzilla and is another exciting and engaging kaiju film. Skull Island does a lot of stuff right that Godzilla also did: it has a story, a human-centric perspective and a good amount of build up to the conflict of the movie. This time, we get to the fighting a lot sooner than we did in Godzilla, but not so soon that the movie feels like it’s entirely based on it, making this an improvement on Godzilla. The script and directing allow for the characters to be interesting and have some nice and funny dialogue, and also for the story of the movie to flow and develop nicely which helps to keep viewers invested in what’s happening. The movie has some twists and turns along the way that spice things up and keep the movie interesting for both the viewers and characters, and does a nice job of tying the opening scene into the plot of the movie without it feeling too disruptive. Skull Island also does a great job of not squandering it’s A-list cast, being actors such as Tom Hiddleston and John Goodman, by giving all the big characters plenty of dialogue and moments to shine a little bit. It also gives it’s lesser known actors the same opportunities, something I appreciated. The big-monster fighting action is great and is just as good as it was in Godzilla, which works immensely to this film’s benefit cause we get a bit more of it than we did in Godzilla. I like how Skull Island gives the humans more of an opportunity to fight and hurt the big monster antagonist of this film, since Godzilla did most of the work in the other movie, and it shows that humans aren’t completely useless against these creatures and they can lend a helping hand. All that said, SI suffers from the same predictability that Godzilla did, and it’s very easy to figure out, for the most part, what’s going to happen. There isn’t too much mystery in this movie and a lot of what goes on follows typical expectations. There’s really only one curveball that the movie throws in, but other than that it all goes according to formula. The other issue I have with this movie is character stupidity. A lot of what goes wrong for the characters in this movie is because of their own actions, so most of what they go through is because of their own doing. To put it in broader terms, they create their own demons and pay the price for that severely. The fates many of the characters suffer is avoidable, unnecessary and founded in decisions based on emotion. Many of them do their best to get out of the situation that they’re in, but are hampered by the actions of other characters. This is an area where this movie falters a bit from Godzilla. Despite these flaws, Skull Island is a great kaiju movie that hits the bar set by Godzilla in many ways and is another solid installment in the MonsterVerse."
    },
    {
      "rating": "1",
      "text": "This movie is a complete mess. The characters that \"live\" are easily identifiable at the beginning. They have no survival skills but get through on luck alone. This is what happens when a huge studio and franchise hires an \"indie\" director. They completely used and abused this director and forced him to do what they wanted. It is easy to influence someone with no experience because they never say no to corporate. I feel like I wasted my bandwidth even pirating this movie, poor bastards who actually spent money watching this trash."
    },
    {
      "rating": "3",
      "text": "To sum this movie up, if you've seen the trailers you've basically seen the movie, the trailers are basically a shorter version of the movie. This movie has no character development at all to the point where they are so bland and boring you really don't give a crap about them. Nearly four main characters die and you don't give a damn about them. Due to the trailers spoiling pretty much every interesting scene in the movie, you sit there bored out of your mind waiting for anything to happen. The only good thing about this movie are a couple of good action scenes with Kong destroying stuff (These scenes were also spoiled by the trailers)."
    },
    {
      "rating": "1",
      "text": "I simply HAVE to believe that positive user reviews on Metacritic are now mostly paid for. To give this utter tripe a glowing review is doing disservice to your own intellect. This film had no:- Characters- plotKong DID have:-Good looking CG (Kong had sick abs, he clearly does crunches while waiting for people to arrive)-John C Reilly (he had rare moments of humour)-forced universal building that is actually WORSE than the crap seen in Batman v Superman: dawn of something somethingI hated this film. It was utterly boring, predictable, tame nonsense. Please do not waste your money on it."
    },
    {
      "rating": "3",
      "text": "Fails in every aspect. The only thing I didn't laugh at were the jokes. Horribly cliche, horrible writing, horrible direction, some poor acting and fake accents here and there, mostly poor CGI (although Kong's CGI was fine).I'm baffled as to how this movie is being received so well. The only saving grace is that about 10 seconds of the movie had some interesting lighting. That's it.I don't recommend anyone even think about this movie, let alone pay money to see it."
    },
    {
      "rating": "5",
      "text": "Watching King Kong beat stuff up was awesome, Samuel L Jackson, as usual, is very likable and entertaining. The rest of the cast gave good performances, however the script gave no effort in showing who any of the characters were the movie was really boring in a lot of place were Kong was not present as the characters were poorly developed and we had no reason to care for theme. Also a lot of stupid concepts, like a man who lived on skull island whose character was badly introduced."
    },
    {
      "rating": "5",
      "text": "This film is very mediocre its entertaining enough but not interesting enough to rewatch. the action was great but the characters were so boring that i cant give it beyond a five."
    },
    {
      "rating": "0",
      "text": "This abortion of a movie should never have seen the light of day. With a credits list of OVER 1,300 people, you think someone would have put their hand up and said \"Umm... Wait a minute\"This is supposed to be 1974, but apparently no one bothered to check any actual history. Even the props are more modern, with an office full of DEC-VT100 display terminals from 1978 and later. Many other items in this movie are clearly more modern than they should be. Totally lazy for such an expensive project.I guess if you cast Samuel L. Jackson into anything these days, it must pass his \"cartoon silliness test\" to be produced. Tarantino can get away with this with great dialog and action. The clowns producing this hairball should hide their faces in public.You can tell from the very beginning that this is going to be bad. Even if you, as did I, go into it expecting very little. The setup of the movie is long and face-slapping cliché. The actors, whom we know to be quite skilled, are entirely wasted by bad bad bad dialogue and bad direction. The editing is not so good either.And when we get out onto the ocean (1974 remember), we are insulted by Hollywood physics and meteorology. A huge storm doesn’t even churn up the waves near the ship *facepalm*Of course, the dorks then fly their non-vintage helicopters into the hellstorm, with super-fake lightning all around, and get through to see the beautiful islands.Within a few minutes, ALL of them have been knocked down by insisting on flying close enough to Kong to get bashed *facepalm* holy crap.Things only get more clichéd from there, with the grizzly 28 year survivor (with the 20 year old son at the end), the demented Samuel Jackson staring and almost drooling as he chews the scenery.Vietnam veterans are insulted by their blind obedience to a ranting idiot. Civilians and military alike enter \"the valley of death\" in spite of the writers allowing some of the characters to suggest it's a bad idea.And then it gets really bad. \"OMG bad\".And in all of this, you feel incredibly bored. It's dull, and bad, and stupid.Oh, and the \"teaser for the idiots' sequel\" comes after the 1,300+ lines of credits, if you are not asleep or barfing in the toilet.The only thing that could save this movie would be cartoon music and a laugh track. Then it would rate a 4/10.Astoundingly bad."
    },
    {
      "rating": "1",
      "text": "There is no surprise all along the movie. the characters are a cliché. nice special effect, but not enough to make it a good movie. Plot is sometimes inconsistant."
    },
    {
      "rating": "7",
      "text": "With extravagant visuals and plenty of action & adventure, Jordan Vogt-Roberts’ popcorn flick, Kong: Skull Island, is a feverishly entertaining addition to Legendary’s new monster-verse, even if there are far too many underdeveloped and uninteresting human characters."
    },
    {
      "rating": "7",
      "text": "It's true the characters are not well developed, but Kong is awesome and the film is still a lot of fun.  Kong and the islands other monsters kept me intrigued throughout and the human characters were just good enough.  B+"
    },
    {
      "rating": "4",
      "text": "My gut instinct told me this would not be a good movie, however upon hearing the positive reviews I thought I should set aside my prejudgements and give it a try. And you know what? I should have listened to my gut. I’ve been told by multiple people that this is better than Peter Jackson’s version, and yes his version isn’t amazing and no it hasn’t aged well but it’s a hell of a lot better than this mess. Simply put, ‘Kong: Skull Island’ does not hold up against the motion capture by Andy Serkis in ‘King Kong’ 2005. There isn’t enough effort put into this remake so I was left disappointed.One dimensional characters embark on an adventure to an uncharted island blah, blah, blah. Enter Kong, John C. Reilly and skull crushers. Yeah I know stupid name to call them but don’t worry John C. Reilly takes a moment to acknowledge their ridiculous name and we all laugh… Don’t get me wrong, I did in fact laugh at times yet I don’t think I was supposed to laugh quite as much. Sometimes a script is so bad all you can do is laugh and cringe. Also featuring Tom Hiddleston, Brie Larson and Samuel L. Jackson. Now if I had known this was going to turn into Samuel Vs Kong then I honestly wouldn’t have bothered. The countless amount of other great movies referenced in this one was crazy, jumping on the shoulders of other monster movies in the desperate hope of creating something decent out of it was simply a giant fail. Considering King Kong is an iconic movie monster this does not do him any justice whatsoever. That just leaves one question. Was I entertained? Well yes and no. It had its moments were it reeled me in but moments later it lost me again. No I wouldn’t recommend it but all you monster movie fans will probably see it anyway so don’t say I didn’t warn you."
    },
    {
      "rating": "3",
      "text": "It's funny how the \"2005 version\" of Kong is better in every single aspect, even in special effects. The only thing that caught a little bit my attention was the weirdness or the direction and production, but it didn't even fit well in the movie. If you are looking for a movie with action scenes only, it might fit for you."
    },
    {
      "rating": "2",
      "text": "An uninspired and uninteresting film that could have been much better if the writing have been compelling enough to make me care what was happening. The majority of the deaths might as well have been spray painted on the actors faces as they were introduced, because that's how unsurprising they were. The only character who really managed to catch my interest for his off beat oddness, Cole, ended up souring my investment in his survival due to the idiotic pointlessness of his death. For the others, they are mostly anticlimactic, without any sort of narrative payoff or comeuppance or ANYTHING besides a number to add to the body count. Kong's portrayal was at least interesting, but the racist portrayal of the Natives of the island was not. Tom Hiddleston was quite handsome and British and in short sleeves during the movie, but if you want to see him act that badly I would suggest rewatching him in Thor, because at least that film is good."
    },
    {
      "rating": "0",
      "text": "The critical and public success this movie has had is a true indictment of the British-American school system.This movie does not have a plot, and if the CGI was taken out of it, we would observe a green screen for about 90 minutes.The acting is poor and the performances of Goodman and Jackson, both uninspiring, remind us once more that after all it is about money.I was tempted to give it a 1, but 1 is the mark a poor commercial would deserve. This is worse.p.s. Quoting great movies of the past (NO SPOILERS) does not improve anything...it just makes you realise how sxxx the film is a lot faster than it would do otherwise."
    },
    {
      "rating": "5",
      "text": "Movie started off great. Nice pacing, good background music and casting seemed good. The movie weakened after the helicopters went down. Turned \"we've seen this before\" about 1/2 way into the film. Stolen themes from other movies. Samuel Jackson as Captain Ahab. Brie Larson as the love interest in Mighty Joe Young. Killer animals from Jurassic Park. A moderately entertaining film on a winter's afternoon"
    },
    {
      "rating": "3",
      "text": "\"...Hellicopters flying through a giant hurricane an then only 20 mts off the ground to allow a giant beast to destroy them all..\" Brillant. There are clever movies, dumb movies, stupid movies and then comes \"Kong\"...  A continuous \"nonsense\" from beginning to the end."
    },
    {
      "rating": "3",
      "text": "I don't understand why this movie got positive reviews from critics.Sure,this movie has some good moments,but overall the cgi looks like cgi,the characters are bland as well as the cast,the plot is formulaic and the soundtrack didn't even match with film.This film is no where near as good as the Peter Jackson version(3/10)"
    },
    {
      "rating": "5",
      "text": "An embarrassing wet fart of a film.  Absolutely boring monster designs, seriously a bipedal lizard?  That's all you could come up with?  It ends up trying to connect itself to \"Pacific Rim\" or something with the whole \"Hollow Earth\" theory they introduce one quarter of the way into the plot.  Speaking of which, what is even happening in this movie?  Everything goes wrong because of the humans arriving, Kong is never captured, just yelled at by Samuel L. Jackson for the entire breadth of the movie.  Other acting talent is totally wasted here including Jon Goodman, who granted is a heck of a lot better than say, Jack Black, but isn't well developed.  I found Kong himself to be fairly boring, especially when compared to 2005's Peter Jackson's \"Kong\" film, he was just on the island as was John C. Reilly as I suppose comedic support in a movie that didn't need it.  I suppose I ought to chalk most of the lack-there-of  of charm was mostly due to the period, the 70's just doesn't work here, and it paints the military as these stereotypical grunts that are apparently all Vietnam vets too.  Everyone in this movie is a veteran too!  How about that?  How inclusive of Hollywood.  The only real highlight here, is some average performances, a bizarre giant spider battle, more-so with a focus on giant spider \"legs\" and a couple interesting entirely computer animated Kong fighting a lizard-thing battles.  I suppose if that's all you wanted, and don't care about any people in this movie, then you can join me in being utterly confused as to why we even spend so much time with once again, totally wooden, boring, poorly developed characters.  Its been done a billion times, we see this in every monster movie, why do they keep writing characters like this?  At least, the Peter Jackson contribution had a focus, not an amazing one, not a stupendous one, but it at least showed very human performances, especially between the big ape himself and his beautiful self-imposed damsel in distress, Naomi Watts.  You can argue that they're both not amazing films, but I could always go back and find something \"fun\" or engaging in 2005's rendition over this burning dog turd of a film.  As it stands, the very original King Kong is still a great film and I'd still watch that before going to see another terrible attempt at a re-boot or a remake or whatever Hollywood wants to call this poor excuse for a film."
    },
    {
      "rating": "5",
      "text": "\"Kong: Skull Island\" has it's moments of fun and being epic, but can somehow feel so small. Peter Jackson's \"King Kong\" was far superior than this and felt more grand in it's scale. The whole experience was kinda hollow.Besides the characters being really one note; John C. Reilly was the best part of this movie. A real show stealer. I rather see a movie with Reilly's character being stuck on the island with Kong. I mean, nothing against the other actors, as they did the best for what's been written for them. I just couldn't care less when characters bite the dust.The influences of \"Apocalypse Now\" and Spielberg movies, mostly \"Jurassic Park\", is an interesting mix. The director, Jordan Vogt-Roberts has a vision and when you hear him talk in interviews, he knows what he's talking about. To be fair, he handle the action scenes very well. The visual queues of classic cinema are there and can be harsh when it comes to criticism of his own work. Everything else was more of a miss than a hit."
    },
    {
      "rating": "8",
      "text": "Since Deep Blue Sea I didnt see director who would off his main lead in middle of movie in one second like its nothing.Anywho, to the film. Solid monster movie. CGIs are good, battles between Kong and humans or the lizardy thingy are pretty entertaining. Movie tried to pretend it has lore, although it doesnt, but threw all of that into trashbin very soon so cool. At the end of the day its monster movie with monsters killing humans like its nothing and monsters fighting in epic battles. Delivers that very well. So if you are one of those who cant stand any movie that is below level of Kubrick, stay away. If you want to have some fun seeing giant monsters kicking each other ass, with flavor of Vietnam war songs, flamethrowers, Heuys and so on, grab a popcorn and enjoy the ride.PS: If you saw 2014 Godzilla and liked it, you will like this too. If you didnt, you wont like this movie."
    },
    {
      "rating": "8",
      "text": "One of the best big monster movies yet,with impressive visuals ,good action and an enjoyable journey through a dangerous islandinteresting characters and it delivered even more then just monstersStill the story was mediocre and the movie had it's cliche moments I recommend it to almost everyone"
    },
    {
      "rating": "8",
      "text": "Loved the reference to Jurassic Park in this movie, and I thought the cast and CGI were good. Easily better then Godzilla, which was a good movie. Best King Kong movie period."
    },
    {
      "rating": "7",
      "text": "Really enjoyed this one. The music, the scenery... Kong looking badass.John C Reilly is one funny m******r seriously!Can't wait King Kong to take on Godzilla!"
    },
    {
      "rating": "8",
      "text": "Kong:Skull Island was a surprise to me. I had walked into the movie with my husband expecting a bad movie, or at the very least something like the most recent version of Godzilla. However, for what it was, it was a lot better. That would be a summer blockbusting creature feature.Don't get me wrong, Kong won't win any drama awards. It is a B grade monster movie filmed with a AAA budget. The budget was worth it though. The effects were believable and very enjoyable. The only issue I had with the filming was the transition from night scenes to day scenes left me blind for a few seconds.The acting was decent for what they had. The only really fleshed out character was John Reilly as a shot down American Pilot (if you have seen a preview or trailer you already know he who is, the funny older guy). John Goodman, Samuel L Jackson, and team are all good at what they do, but they just weren't fleshed out. Their characters were generic.Probably the most interesting part though was little Easter eggs laid around that indicated Mothra, Godzilla and I believe King Ghidorah. It even includes a monster hunting organization. I love the idea of a marvel level universe for the large monsters. This is a good idea, almost as good of an idea as Universal's monster universe started by the remake of the Mummy next month.The good: It hit all the right notes for a monster movie, action, adventure, no reliance on arbitrary romance. I didn't detect any racist stereotyping and I really liked that it was set in 1973.The bad: Some of the effects were filmed for 3D, I did not watch that version, but even the flat 2D screen was annoying when it tried to push those scenes into the movie. Also, I would have liked more monstrous creatures on the island."
    },
    {
      "rating": "4",
      "text": "Not exactly sure how did this movie get away with being ok or even good. Its bland pile of mediocrity. People were hating on Jackson´s King Kong but that movie blows this **** out of the water in every aspect. Whether its acting, action, characters, soundtrack, hell even the so called bad cgi in King Kong was more enjoyable to watch than this. The only reason this movie exists is to set up the duel with godzilla, but both movies were horrid so what can we expect from it... Some good actors wasted their time and good name on this ****e and some ****e actors got opportunity to show of their suckage like the lead female, quite possibly the most useless and generic \"character\" in a while."
    },
    {
      "rating": "2",
      "text": "One of the worst bigger budget films i've ever seen and i'm usually a fan of creature feature/monster movies. It's a hodgepodge of cliched dialogue and badly acted scenes with long periods of nothing happening.Kong goes missing for half an hour at a time .They rip off ideas from apocalypse now and moby dick and likely a dozen other films but in a cheesy way.It was like watching a bunch of bad low budget b-movies all strung together. Tom Hiddleston is so out of place in this film it's not even funny.He and the other actors just phone in their lines . The 3-d was practically non existent so i wish i hadn't paid extra.Sorry i even went to this junker."
    },
    {
      "rating": "5",
      "text": "CGI (or whatever techniques used to make beasts) & locations are great. Enjoyed the movie as I watched it, but later it left me flat. So much more could have been done with the characters' stories, the photographer & scientists got short shrift. The natives were especially meh, no cool rituals or any action vis a vis Kong there. Overall, way too glossy, never felt the fear. Would like to see a grittier treatment, I mean, Kong had his best parts airbrushed -- come on!"
    },
    {
      "rating": "7",
      "text": "It's different from the previous king kong. More action and more victims. Less character developments compared to the previous ones. Don't forget to stay back until the end of the credits for potential sequel."
    },
    {
      "rating": "7",
      "text": "Kong Skull Island is a dumb film, but it’s the sort of dumb film I like.  It never tries to over stretch it boundaries and gives you exactly what you expect but it is entertaining in that sense, so my predictions of it being a mediocre film feel unjustified.  I think this is a good film.  It could have used a bit more Kong and the plot doesn’t flow quite as well as it could have, but what it does well it does well.  The dialogue is pretty good some of the characters are relatively entertaining, though some of them are not as well written.  The acting is fairly decent and the effects hold up alright.  Anyone who saw 2014’s Godzilla should check this one out.  It’s a very similar film and it almost follows the plot beat for beat.  This unfortunately means that you probably won’t enjoy it as much if your problem with the Godzilla film was that they focused too much on the humans at the expense of the monsters.  You can probably tell from my brief descriptions whether you are going to like this film or not.  I would recommend seeing it at the cinema as I think you won’t get the same effect on the TV screen and it comes with my recommendation.  This is a pretty good film.  If you are going to see the film, stay until the end of the credits, there’s a post credit scene which sets up future movies and it’s really awesome."
    }
  ],
  "recommendations": [
    "godzilla_king_of_the_monsters",
    "underworld",
    "pacific_rim",
    "underworld_blood_wars",
    "transformers_the_last_knight",
    "riddick",
    "underworld_awakening",
    "transformers_dark_of_the_moon",
    "immortals",
    "clash_of_the_titans",
    "king_kong",
    "the_last_witch_hunter",
    "monster_hunter",
    "battle_los_angeles",
    "rampage",
    "bloodshot",
    "transformers",
    "300_rise_of_an_empire",
    "predators",
    "the_darkest_hour",
    "teenage_mutant_ninja_turtles",
    "world_war_z",
    "indiana_jones_and_the_kingdom_of_the_crystal_skull",
    "jurassic_world_fallen_kingdom",
    "van_helsing"
  ]
}