{
  "id": 2307,
  "title": "Krampus",
  "starring": [
    "Adam Scott",
    "Toni Collette"
  ],
  "runtime": 98,
  "genre": [
    "Horror",
    "Comedy",
    "Fantasy"
  ],
  "description": "When his dysfunctional family clashes over the holidays, young Max is disillusioned and turns his back on Christmas.  Little does he know, this lack of festive spirit has unleashed the wrath of Krampus: a demonic force of ancient evil intent on punishing non-believers.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bm0DzPPIR7mglpgDIxA3Y7AoEk4.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.68,
    "ending": 5.5625,
    "soundtrack": 5.0,
    "cinematography": 6.6,
    "familyFriendly": 6.0,
    "funny": 5.744186046511628,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Krampus was by no means a perfect movie; however, there isn't much done wrong here. For a comedy-horror, Krampus blends a nice mix of the two together throughout the film. There's plenty of laughs to be had along with some scary moments that push the limits of the PG-13 rating well. It's a wildly entertaining film that belongs in the annual Christmas movie re-watch list. The special and practical effects teams also did a superb job of crafting some truly nightmarish and unique monsters, and the cast is surprisingly endearing.\r My only complaints would be a couple lines of overused dialogue and a couple rushed sequences. However, I still thoroughly enjoyed the movie and would recommend it to anyone who likes movies that are a little more \"out there\" and aren't afraid to take risks."
    },
    {
      "rating": "7",
      "text": "Krampus is flawed in many sectors, it never truly embraces it's wacky concept to an extent of new locations and other hilariously silly monster minions (it is a home invasion movie, but it felt quite closed in), however Krampus has a very clever way of sneaking in a tangy Gremlins sort of vibe which rejuvenates the film and it's heartfelt message about family and hope (this film really had an inkling for a good ol tug at the heart strings!). Even if it does try and play it relatively safe, the candy coated nonsense tickled my ribs now and then which a gore-fest might not of done ( not a lot of blood for a horror comedy, despite one gross scene involving a jack in the box freak)"
    },
    {
      "rating": "7",
      "text": "What I want for Christmas is jolly scare and merry satire.\r Krampus opens up with nice ironic Christmas tradition of fighting random strangers to get discounted stuffs, it's a pleasant reminder of the annual Arnold's survival movie for Turbo Man. It already gets the holiday spirit right already, then it slowly adds some creepy version of fat man and toys. This is pretty far from legitimate haunting flick, but just like a decent enough present viewers would be content with its mix of comedy and horror.\r The first act is a jab towards silly tradition with overly unlikeable relatives, just like the jerks on Home Alone. Admittedly, they encapsulate this struggle very well with satire on visual and music, juvenile banter and even perverted mall Santa Claus who stares at the teenage girl's butt. I almost forgot this was meant to be partial horror and was quite absorbed in the comedy.\r They sure make the relatives characters unsympathetic with nasty manner, perhaps even a tad exaggerated. The main family, in contrast, is a better on-screen characters, especially the two cynical children. Max is the quintessential disappointed kid who audience would like to cheer due sheer innocence vibe and Beth, his sister who is caught in one of the most frightening scenes in the movie, and not the pervy Santa.\r Its other horror aspect is unfortunately could be better. There are a couple of chilling instances while the rest are utilized more for comedy. At some points the cinematography plays with color tone and lighting so well, even capturing the ominous sighting in grand fashion. It has ample of gore for horror fans, and its twisted designs for the creatures are quite fascinatingly appalling.\r However, it loses the magical steam about mid-way, it simply can’t keep the same level of wit or revulsion from early on. The movie might not be intended as full-fledged horror, but it feels like a missed opportunity since there are some highlights that could've been legitimate scary moments. On the side note, the caricature visual used to create the flashback scene is pretty amusing and it adds depth to the mythology.\r Krampus may not bring the ultimate gift for horror, but it delivers presentable delight with strangely compatible satire and a welcomed unconventional holiday atmosphere."
    },
    {
      "rating": "7",
      "text": "\"Krampus\" is a solid, well-made Christmas horror/comedy that is a joy to watch. It has strong performances from its leads, and uses phenomenal practical effects to spook its audience effectively."
    },
    {
      "rating": "7",
      "text": "While its tone can be all over the place at times, Krampus was a whole lot of fun.  I thought the way that practical effects were used to make this mythology come to life was great.  B+"
    },
    {
      "rating": "8",
      "text": "A spiritual successor to Gremlins and Are You Afraid of The Dark. The movie was great but the practical effects in this movie were PERFECT - everything from the monsters to the sets looked amazing.\r Me gusta."
    },
    {
      "rating": "9",
      "text": "Co-writer director Michael Dougherty (Trick 'r Treat) gives moviegoers the best Christmas gift also the best movie that's probably released during the holidays. Adam Scott and Toni Collete play a married couple, they have two kids. They host her sister Linda (Allison Tolman), gun-loving brother-in-law Howard (David Koechner) and their annoying kids and the complaining Aunt Dorthy (Conchata Ferell) for the Christmas Eve party. The family bashes head creates a lot of tension, which causes Tom and Sarah's son Max (Emjay Anthony \"Chef\") to tear apart his Christmas letter he wrote to Santa. Which makes the family's holiday a living hell when they have a snow blizzard and Krampus kidnaps Tom and Sarah's daughter Beth (Stefania LaVie Owen) and comes to get the family. I think Michael Dougherty and his screenwriters Todd Casey and Zach Shields are trying to teach us something here that we shouldn't give up our hope on Santa or on Christmas, it's trying to scare us and show us something it tries to teach us a lesson and it doesn't just try to scare people who haven't been good this year, it does a good job and has great messages but I don't think it might delivered. But I think it did what did and I think it'll teach the movie goers something. 4.5 out of 5 stars"
    },
    {
      "rating": "7",
      "text": "2015 has been a fairly good year for horror in my eyes, and Krampus does at least a decent job in ending the year. It's the first Christmas-themed horror film in a long time, so it does give some variety for horror fans. Krampus is based on Germanic folklore of Santa's horned little helper who punishes the bad children on Christmas day. One boy has given up hope on Christmas when their obnoxious in-laws come to town. A freak snowstorm knocks out the power and barricades the family in their house. They have evoked the wrath of Krampus, who sends demonic toys and elves to terrorize the family. Fans of silly horror movies like Gremlins or Slither should find a lot to like in Krampus, although those looking for a good scare might be slightly disappointed. The movie takes a long time to really get to the good stuff, not really building any suspense but just watching banter among the family. However, it does allow all of the characters to be memorable and fleshed out. When Krampus' Minions finally do show up, the movie goes nuts. Practical and digital effects are used for the toys, making them look more real and creepy. A giant jack-in-the-box toy in particular is the stuff of nightmares. Krampus never gets particularly scary, but that's made up for by its silliness, memorable characters and fun plot. It should make a good annual Christmas viewing if you're not into Frosty the Snowman."
    },
    {
      "rating": "7",
      "text": "I had no idea what to expect in this movie.  It starts out like Christmas Vacation and then gets really dark.  I really loved the setting and the early events in the movie that kind of set everything up.  it is a great beginning to a very scary movie.  But, I didn't think the movie lived up to the expectations.  There were a few good scares.  It certainly kept my interest.   But, it was a little hokey now and then.  And, the ending I feel I have seen before.  But, it might be worth seeing since there isn't much out there now in the scary movie genre."
    },
    {
      "rating": "7",
      "text": "It's almost global know that Saint Nicolas is the man who gives happiness to all the good children of the world . Santa Claus is synonymous with Christmas and the Christmas Season is love and warmth to some extent. Someone should be responsible for bad children, No?\r Undoubtedly, this film marks footprint , not only for its argument, marks footprint for its release date    ( Christmas). It is something entirely different. Tom (Adam Scott)  is the typical father who only have time for work and have to spend days trapped with his wife's family. Sarah  (Toni Collette) is an apathetic mother who wants to keep the spirit of Christmas in her broken family, forcibly. Her perfectionism and low tolerance to take her to strengthen family ties. Beth (Stefania LaVie Owen) is the popular Hollywood teen problem, ( cliche character ) not caring for your family and Max (Emjay Anthony) is a young child who still believes in Christmas, cookies and Santa Claus, defrauded of his family, he decided to forget his beliefs to make way for the evil spirit of Christmas.  Another cliche character is the uncle Howard (David Koechner)  who is only interested in criticizing, ruin Christmas dinner, love the weapons and be easy prey for the movie monster murderer, his wife (Conchata Ferrell) that oddly is not a cliche character, is one of the surprises of the plot points and their two daughters odious that only serve to fill.\r The development of the story is good but specific to a horror movie, Step One: We hate christmas, Step Two: A hellish storm was momentarily dismantled, Step Three: In rare circumstances, bad girl ventures out and get her deserved, Step Four:  From there on, the once-fractured family is forced to come together in order to fend off an extended siege from such nasty creatures as demonic dolls, hellacious harlequins and evil elves, all of which are mere opening acts to an appearance from the big bad himself.    Step Five: Frightened family, family death, Step Six: Lesson Learned.\r Michael Dougherty has become a master of horror , performing the cult classic \"Trick 'r Treat.\" Like the previous , Michael honors  past classic in his movies, \"Trick 'r Treat\" pays as homaje to \"Tales from the Crypt\" and \"Creepshow\" with its anthology format. Joe Dante's \"Gremlins\" serves as a reference for find the perfect blend of creepiness, subversive humor and genuinely earned sentiment, to make it a seasonal favorite for viewers who prefer their Christmas entertainment to have a little more bite to it. Krampus intention is to work on those same lines , but never makes it to the top. Although the opening is quite original ( recreating a Christmas comedy ) fun and effective but introducing pieces of a good horror movie, unfortunately , despite the decision to classify the movie family-friendly PG-13 rating (even though no sane parental units would deem it to be acceptable viewing for the wee ones) it can never achieve what you want to be, given that it would have worked quite well with R rating. It might have worked better if the first part would not have spread so much time to get your gear.\r \" Krampus \" has even more , is a box full of good surprises , and more notable point is that Michael used to perfection the mix humor - horror not turn his movie on a typical Christmas movie , going to cheesy and stupid . Also noteworthy performances serene Scott, Collette and even Koechner. Tom's mom  is in a word \"spectacular\" , portraying her past animatedly and terrorizing with her silent expression. The fearsome demons are truly horrific, showing us something not seen in a while , really terrifying monsters   (especially when they are in the circle praising their king \" Krampus \" that image is really classic). The bittersweet largest is the obliged end entertains us and confuses us, and sadly falling into the same end cliche. Shame \" Krampus \" had talent.\r But without a doubt \" Krampus \" is the best choice for this date , surpassing \"Love The Coopers\" or  \"Home Alone\". \" Krampus \" is not enough to be a classic , but it comes to renew the horror genre in 2015. It certainly has its charms, but the decision to bring Universal theaters without press conferences, leaving it in a very low ranking , but perhaps only wanted to surprise us.\r ¡Oh No1 Sorry, \"Krampus\" was not my intention to criticize your work, I'll be a good boy, I swear.\r \"Krampus\"  is fearful , funny , entertaining but can not get to scare others terrifying Christmas classics,\r ¡Horrifying Christmas!"
    },
    {
      "rating": "7",
      "text": "-Krampus is a 2015 American Christmas horror comedy film based upon the eponymous character from Germanic folklore, directed by Michael Dougherty and written by Dougherty, Todd Casey, and Zach Shields. The film stars Adam Scott, Toni Collette, David Koechner, Allison Tolman, Conchata Ferrell, Emjay Anthony, Stefania LaVie Owen, and Krista Stadler. It was released on December 4, 2015, by Universal Pictures.\r --Critical response:\r -Krampus received mixed to positive reviews. On Rotten Tomatoes, the film has a rating of 66%, based on 93 reviews, with an average rating of 5.9/10. The site's critical consensus reads, \"Krampus is gory good fun for fans of non-traditional holiday horror with a fondness for Joe Dante's B-movie classics, even if it doesn't have quite the savage bite its concept calls for.\" On Metacritic, the film has a score of 49 out of 100, based on 21 critics, indicating \"mixed to average reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B-\" on an A+ to F scale.\r -Scott Mendelson of Forbes felt the successful opening was attributed to the horror genre which was something of a new, unique and genuinely different offering at that time (the last time a Christmas horror movie opened was in 2006 with Black Christmas). However, he also stated that had Universal not embargoed the reviews two days prior to its release, a wave of mostly positive reviews dropping a few days before release would have boosted its opening accordingly."
    },
    {
      "rating": "8",
      "text": "People complain that this movie isn't scary, and, frankly, I don't really disagree with them. Just because it isn't scary, it doesn't mean that it isn't entertaining or enjoyable. I really enjoyed this movie the whole way through. The plot is very original, and the things that happen are consistently entertaining. The \"horror\" isn't horrifying, but it is pretty darn fun to watch. The characters are really likable and well-acted. All in all, \"Krampus\" is a really fun, enjoyable movie."
    },
    {
      "rating": "8",
      "text": "Tis the season for merriment, festivity and goodwill to all, or if you're already sick of all that get yourself to a cinema and watch this horror/comedy Christmas movie that will not disappoint. This year it's not Santa who comes to town but the demonic equivalent, Krampus. By no means an amazing movie but with all the other madness going on it really doesn't matter, you will laugh and you will be entertained. It is crazy, absolutely mad, and if you ever needed a reason to be afraid of ginger bread men now you can be. Is this a movie for you? Well you better ask yourself one question; if Frozen is your favourite Christmas movie then no, Krampus is not recommended, for everyone else, it’s a definite yes."
    },
    {
      "rating": "6",
      "text": "Krampus is a reasonably enjoyable little gem that keeps you laughing in an unconventional way. I must admit I was sad to see that the blend of horror/comedy is not very fluid, as it mainly just takes the shape of a comedy film with a few horror parts and doesn’t take enough of the horror and fully realises it.\rThe film does however have a great cast and does not take itself too seriously. They have created characters you can actually sympathise with, that come across with plausibility and ludicrousness in an awesome blend. The comedy in this film is fairly solid all the way through, but the changes from horror to comedy can seem like pretty sharp turns at times. Albeit this, you can see that the film does not take itself too seriously, with one particular gingerbread men scene being hysterically and obviously a prime example of it.\rImagery of the film is pretty damn nice too in the film, with a nice method of directing to keep a slight eerie sense over the film yet also a prominent comedy feeling. The use of practical effects really lends itself to the charm of the film also, with the CGI not over burdening the film.\rOverall this film is a nice little unique gem to watch. It may not get everything right in terms of horror and at times pacing (I found a lot of the times it slow for set-up/exposition to allow comedy to seep in before horror) but it brings its characters to life and ends nicely, unlike almost every horror film nowadays.\rA worthwhile watch, check Krampus out!\r6.4/10"
    },
    {
      "rating": "8",
      "text": "This is one of the most chaotically twisted comedies I've seen. It has some creepy moments throughout but it's mostly a dark comedy. It's like a mixture of Gremlins and Christmas Vacation and a shred of tremors rolled into one. It did take awhile to get going but when it does in the last half hour, it gets absolutely ridiculous and intense. The ending was very sinister and unconventional as well which surprised me. I enjoyed this quite a bit and recommend it. 3.8/5"
    },
    {
      "rating": "7",
      "text": "Krampus is yet another Christmas horror-comedy that satirizes the american family, and the merriest time of the year. Beneath all of it’s scary creatures, and comedy oriented cast is a message about family, and the christmas spirit. Krampus is a funny, and often scary Christmas horror movie, despite its weak and somewhat confusing ending. In an age when Christmas time means something different to everybody, this movie is especially impressive because it appeals to all of those people.\rKrampus’ humor is one of the film’s biggest strengths as it opens with a hilarious black friday scene. The humor came as no surprise, considering the cast, but what was slightly surprising was that the comedy was more black-comedy, which blended beautifully with the horror tones. The film in many ways is a satire on our society in general, poking fun at how divided we are and our overall apathy towards the things that matter. Although the film has a pretty biting take on the american family, it has a somewhat positive outlook on it.\rThe creatures in the film are a combination of gremlins, and a terrible holiday nightmare. The different types of creatives creatures the film uses is truly impressive and terrifying. The black comedy blends beautifully with the twisted variations on holiday toys and treats. Despite all of this the film does have it’s share of weaknesses. The most notable is the ending.\rThe film has a good narrative flow, and pushes through until the last 10 minutes of the film. In the last 10 minutes, one characters turns a 180 and the plot becomes confusing. Without giving anything away, the film has multiple endings and by the end it’s tough to tell what happened. On top of the weak ending, many times the film feels like a gremlins rip off. On top of that the satire on the family falls a little flat, as many characters remain stereotypes.\rKrampus does deliver on the humor and the horror that it promises, and if that’s all you’re expecting then you won’t be disappointed. The film even gives a funny look at the american society, even if it’s a little thin. In the end Krampus is a fun take on Christmas horror, and horror comedy, so if you like either of those genres, check it out."
    },
    {
      "rating": "10",
      "text": "One of the most scariest movies of the entire year among Unfriended, The Visit, Insidious Chapter 3, and Crimson Peak. The Practicality, the atmosphere, and the story is riveting."
    },
    {
      "rating": "0",
      "text": "This is quite possibly the worst movie I have ever seen (definitely not an understatement). The plot line was fairly scattered with little bits of information coming into play throughout the movie - in most cases, too late for them to be relevant. The overall genre of the movie was a bit confusing, seeming like a comedy at the beginning, and transitioning into a ridiculous form of thriller at the end. Not only is the plot predictable and poorly acted, most of the screen time was taken up by redundant scenes that lacked proper explanation beforehand. I am not usually one to criticize movies as harshly, but people in the theatres were leaving part way, and at the end (supposedly the most suspenseful part), people were laughing. This movie cannot be taken seriously as the killer gingerbread men and human-eating caterpillar/jack in the box hybrid confirm. I truly regret spending the money to see this movie and would not recommend it to ANYONE."
    },
    {
      "rating": "3",
      "text": "Krampus is a what the industry likes to call \"a dumb fun\" movie. This over-the-top and ridiculous movie is so idiotic, it's entertaining. It's terrible as a standard movie and most certainly isn't even a good film. However, there's more enjoyment in the last thirty minutes alone than most blockbusters this year. The movie Krampus is unrealstically dumb in all the right reasons.\r One family is traumatized as creatures from the dark start to pick them off one by one. Creatures that are being controlled by the entity Krampus. A horned like Santa Clause that grants one terrible wish, when a child starts to not believe in the Christmas spirit anymore. Its out for blood as it terrorizes a wealthy suburban in search for the person that summoned him.\r The movie Krampus isn't going to blow anyone's mind, scare anyone, etc. Krampus is here to simply be a tool of disgust. It's here to shock audiences while making them question what had just happened. The movie itself is a selfaware train wreck that's on a direct course to the darkest parts of your mind. It will completely engulf your attention with ludicrous creatures and funny moments spread out. Its like an ADD squirrel that's been trapped in a box for a month.\r The story itself is quite interesting and the premise is also interesting. Though the director seemed to love to always one up a crazy scene with a crazier scene. The rollercoaster ride is a fun one but it makes you sick after while. The story is overshadowed by unorthodox aspects and scenes. Though these moments are quite entertaining and make for some pretty great scenes.\r The comedy doesnt work a lot in the movie. At least the intentional jokes, that are sprinkled throughout the film, with a lot of unintentional comedy. For example, one puppet looking creature shollows a kid. He then unspeakably wipes his mouth off while he proceeds to growl at the camera, continuing the laughter throughout the scene. The movie plays off like a morbidly bad wedding joke that makes the audience laugh for easement of the person making the speech.\r The characters in the film are despicably hilarious and over-the-top representations of real life people. They make for a great catalyst for their own demises while making those scenes a wonderful treat. They don't allow feelings to be spared on them as they make their one linet's before disappearing. This leads to an ending that spits in the face of the audience; not caring what they think about it.\r Overall, Krampus is a mess of a film. It really doesn't succeed as a comedy, a thriller, or even a horror movie. Its a Netflix movie, if you're ever in the need to watch an over-the-top horror/comedy movie. Its worth watching on entertainment alone. Krampus is its own short bus with one stool, no benches, no steering wheel, and one man in a straight jacket. Is it worth getting that ride?\r 3/10\r Entertainment value\r 9/1"
    },
    {
      "rating": "3",
      "text": "Start with a dysfunctional family gathering for the holidays (nothing original there) and toss in a mythological malevolent Nordic creature (hoping for a horror twist). Some might argue that this is an over-the-top comedy, except that it's never funny (such lame gags as a crusty old lady, fat kids and rednecks) and the ultimate attack is more ridiculous than amusing (evil clowns, elves and gingerbread cookies). While it's paced well enough and has a decent cast (Adam Scott, Conchata Ferrell, Toni Collette), the ludicrous story and lame effects deserve a heaping bag full of coal."
    },
    {
      "rating": "7",
      "text": "An admittedly less than perfect combination of horror and comedy. While not an instant holiday classic, \"Krampus\" proves to be suitably fun. A Christmas movie that offers something different than the average film of the type.\r It's definitely more comedy than horror. As things begin to escalate you begin to realize that it's less concerned with building tension and fright, and more on being goofy and humorous. It achieves both well without ever being able to blow the audience away. This means that the movie can be really fun even if a tad stupid at times.\r There's a surprising amount of sentimentality to the movie. Never losing the Christmas spirit and the importance are noticeable themes (or warnings) here. The characters themselves aren't really fleshed out, but they still manage to have some decent moments of familial bonding in their tough situation.\r Those looking for some frights this Christmas are likely to be disappointed. Krampus approaches nearly everything in itself with a sense of glee. This allows for plenty of over-the-top humor and goofiness, but leaves little room for any actual horror outside of the monster designs. That's not to say it isn't worth watching though. It's got plenty of fun hidden under the Christmas tree and even has the holiday spirit. It offers a nice deviation from the standard Christmas flicks. It probably won't be one of those Christmas classics you revisit every year, but is still worth a watch one holiday season even with it's lack in scares and emphasis on laughs.\r 7.5/10"
    },
    {
      "rating": "6",
      "text": "Laughs? Check. Scares? Check. Story? Not so much.\rEntertaining to watch with friends, not too scary so it's available, but ridiculous enough so you can have a good time. They try to create a story, but it really never comes together."
    },
    {
      "rating": "4",
      "text": "more like crap-us    (get it?)"
    },
    {
      "rating": "5",
      "text": "Poor pacing and an inconsistent tone really hindered my enjoyment. The film starts off fantastic. Showing the deplorable behavior of Black Friday shoppers with pleasant Christmas music in the background. The jarring dissonance between the soothing music and aggressive actions shows how far we've strayed from the 'true' Christmas spirit.....God, I can't wait for Krampus to harshly judge these characters....except He takes his sweet demon time getting there. For approximately the first 45 minutes of the movie, barely anything scary or suspenseful happens. The movie leans heavily on its comedic elements at these points. It's hit or miss comedy inspired by the 'nightmare family relative' cliché. Unfortunately at several points, the movie isn't funny or scary. It's overly sentimental garbage. When the 'horror comedy' finally kicks in, 4 different characters are battling 4 different types of 'monsters' in 2 different locations in two separate locations with fast cuts back and forth. Really? Nothing happening to everything happening. It's more cartoonish than over the top violence like I was expecting. I'm a pretty jumpy guy, and I didn't even flinch. Would NOT recommend seeing while in theatres. Wait to rent or skip altogether."
    },
    {
      "rating": "6",
      "text": "I'm always looking for a Christmas movie to add to my collection.  This one started out like the Chevy Chase movie with the \"bad\" half of the family visiting for Christmas.  Then, scary things start happening and we realize this is turning into a horror movie.  How cool is that?  But here, the writer's got stuck and the movie drones on.  The ending was so cliché.  It coulda been a contenda."
    },
    {
      "rating": "2",
      "text": "No one was expected to be in his naughty list anyways. No one really wanted to be in his naughty list anyways. No one wanted to know how bad things happen when you're at his naughty list anyways."
    },
    {
      "rating": "3",
      "text": "Krumpas is nothing but a big mess of a horror/comedy set during the Holidays. All though the cast is good and a few jokes do hit the mark, The majority of the film is nothing but a joke. From unlikeable characters, to unscary villains, the film faces major problems in the character department. The script is nothing to wright home about and I felt the direction was just confused with what it wanted to be."
    },
    {
      "rating": "0",
      "text": "This is not a horror; it's a fantasy. It is also not funny at all.All in all, it's a typical christmas garbage family movie, with the only difference being having a monster."
    },
    {
      "rating": "7",
      "text": "A really fun and enjoyable movie even know it's kind of forgeable it's still a fun little movie to watch during the holidays. The acting is really good from the adults and children."
    },
    {
      "rating": "10",
      "text": "One of my top 5 favorite horror movies of all time. It had great acting performances and a great story. The visual effects and animatronics were spectacular."
    },
    {
      "rating": "1",
      "text": "No way to describe how this movie was awful. Whole movie i just wanted to end as soon as possible."
    },
    {
      "rating": "8",
      "text": "A creepy Christmas tale of a family.\r Probably no one would have anticipated it, this is a surprise movie, especially being an anti-Christmas theme. Possibly the one last time I enjoyed was a Finnish film called 'Rare Export', that's the name came in my mind after watching this. I also could not believe this rated PG13, well it differs in other countries. Of course, there are plenty of intensified frightening scenes, even for the adults, but no gores. The violence parts were well edited/shot, yet it makes sure they're still part of the story without showing them. I think it was a smart filmmaking keeping in mind the family audience. So in the end, I guess it paid off well.\r I did not know the plot, as well as a few words that referred in the movie. But while watching it, I was worried about the graphics, because this is not a big budget film. Even the cast was not from the top league. Overall, it achieved a good result, that's the point. There are no major flaws as well, and the small ones can be easily ignorable. Because on the other side the movie provides a good suspenseful entertainment that makes you not to move the body or the eyeballs. After I'm saying all these, you should at least consider giving it a shot. But remember there's no story in it, it was constructed on a panic situation during the heavy blizzard when one after another begin to disappear.\r 7/10"
    },
    {
      "rating": "6",
      "text": "Krampus is a wacky mashup of Halloween and Christmas that is creepy but not scary. The ending might throw off many viewers although everything leading up to it is effective. Decent."
    },
    {
      "rating": "6",
      "text": "It's like somebody took Christmas Vacation and smushed it together with a Stephen King novel. As you might imagine, it is an imperfect pairing.\r It's a sometimes funny, hardly scary but overall kinda fun holiday flick. It never goes too far into either of it's primary genres and is weaker for sitting on the fence."
    },
    {
      "rating": "6",
      "text": "You better watch outYou better not cryBetter not poutI'm telling you whyKrampus is comingFOR YOU‘Krampus’ is so beautifully shot that certain shots, even years later, have been stuck in my head. The colours perfectly fit the holiday despite the unfortunate terror that lies ahead for this family. One of the longest nights of Christmas eve. The sound work as well is really detailed and rich, which is something I didn’t expect.Still, it’s a goofy horror movie that doesn’t quite stand next to the greats, in terms of other Christmas movies, but am weirdly drawn to horror movies set around Christmas, because surely nothing bad can happen on Christmas."
    },
    {
      "rating": "9",
      "text": "This is a great annual movie that you should watch during the Christmas season. It is a quality film that delivers fun, action, thrills and genuinely garners your attention. There is a steady pacing throughout and I enjoy this film every year I put it on."
    },
    {
      "rating": "6",
      "text": "I can honestly see this movie being a cult classic. I can see people watching this movie every year on Christmas eve/day and I know that's what I'm going to do. What can I say? It's a fun “B” movie for the holidays. First off with the good, the movie is paced decently for the first half but then it gets absolutely claustrophobic in the last act. Everything goes down and it feels way too rushed. I liked Adam Scott's performance as well as the rest of his family. Although they are playing cliched characters they pull it off pretty nicely. As well as their back and forth. All in all. Adam Scott and his family are one of the best parts of the movie. Watching the minions attack the family (especially the gingerbread men and the jack in the box guy) was entertaining. I wouldn't say it's horrifying but it is entertaining enough to keep audiences entertained. And now for the bad. I just wanted the In-Laws to get eaten by Krampus and his minions. JeremyJahns said it best “It's like the other family from National Lampoon's Christmas Vacation but with all the likability taken out of them” and that is exactly what they are like because these people are **** They are **** to such an extreme degree that It just took me out of the movie a little bit. Also, Retarded white people are retarded! It felt like some people were suicidal and It just made me angry watching them (SPOILERS) one of the best examples is when they are running towards a snowplow to escape and find people. The mom goes to this son and is like “I love you, goodbye” and basically jumps into one of those five nights at Freddy's monsters. It becomes increasingly apparent that this all happens for a reason and It's because of an ending that I honestly have no feelings about. I thought it was going to be a ending that I could respect but know. Typical Hollywood “B.S”. (SPOILERS) The movie also relied strongly on the minions basically Krampus isn't really the main antagonist. It's more centered around his family just screwing things up. So, just call the movie “Minions.” Oh, wait. That might not be a good idea. In the end, “Minions” was a pretty enjoyable movie. It nails the claustrophobia element of being trapped in a house with the chance of dying at any moment but also can be a bit repetitive at parts. I'm giving this one a 6/10."
    },
    {
      "rating": "9",
      "text": "Thrilling. Fun. Humorous. Scary.\r 9/10\r ____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________    ______________________"
    },
    {
      "rating": "6",
      "text": "I am a big fan of horror-comedy movies. What We Do In The Shadows, Housebound, Cabin in the Woods, and Dale & Tucker Vs. Evil are some of my favourites. So when I heard about this movie a few years back, I got pretty excited.\r However, I found this movie didn't know how to implement that well.\r At times, they cranked up the horror elements and that was done well. Ominous snowmen appear on their lawn, no other signs of life are seen in their town, and we get to finally see Krampus. After Beth (stereotypical eye-rolling teenager) is taken, the movie begins to be goofy, featuring animated gingerbread men with power tools, a killer teddy bear, little masked elves, etc.\r Nothing got me more disgusted and frightened than the Jack-in-a-box demon worm. It's crowning moment was when it was swallowing one of the kids, let out a loud shriek, and then slithered away. You probably know this scene because it was featured heavily in the trailers.\r At this moment, they could have just stuck to making a horror movie and it would've been pretty good. Before this, the only funny parts were the conversations amongst the families.\r Some of the jump scares were pretty mediocre, too. The flying angel doll was a pretty cheap scare, and when Krampus took Omi, the shot inside his bag of goodies was a bunch of toys shaking around for a few frames. This looked really amateur and... I didn't know what to feel about it.\r Probably my least favourite scene is, actually, the last, when the camera slowly zooms away from the house and WOAH! A whole bunch of demonic toys jump out of nowhere and the movie cuts to black. This is exactly the kind of cheap scare you get from something like the video game Five Nights at Freddy's.\r In the end, it's decent. Not that bad, not that good."
    },
    {
      "rating": "6",
      "text": "Krampus.. Where do I begin, the premise of this movie interested me at first, something different, something that would catch the attention of any horror movie fanatic.\rKrampus was able to capture a good amount horror movie comedy mix, but fell short of being anything but a holiday cash grab."
    },
    {
      "rating": "9",
      "text": "This film has become a Xmas tradition now in my household and I happily watch it a few times each December.National Lampoons Christmas Vacation meets Gremlins levels of horror when the Xmas Spirit dies for one family...as do they!This is mild horror, with some great practical SFX on show.  We get demonic toys, evil gingerbread men, nighmarish elves and a creepy as heck Krampus squeezing down the chimney.No blood or gore. Not any jump scares from what I remember.  The horror of being trapped in a house with relatives you hate is enough to keep this going.  The cast are all great, giving you equal reason to hate them AND sympathise with them.  A fantastic addition to the \"Xmas Horror\" subgenre."
    },
    {
      "rating": "6",
      "text": "While it certainly has scares and laughs, nothing about this movie stands out (except the killer gingerbread cookies) or compels me to watch it again."
    },
    {
      "rating": "7",
      "text": "Finally a Christmas movie different from many others. No sluggishness, no happy ending, no real hero who saves Christmas. Only a powerful enemy, Krampus, who will terrorize the dreams of young and old."
    },
    {
      "rating": "7",
      "text": "I don't know what to say... it's weird, fun, creepy. Yeah... that's all...."
    },
    {
      "rating": "0",
      "text": "Merde alors!! Le film est ennuyeux à mourrir , il fait pas peur et la fin est débile . Voilà je vous ai raconté le film"
    },
    {
      "rating": "5",
      "text": "This is a Christmas set fantasy/horror film. Its not exactly extremely scary but its certainly atmospheric and tense. I thought that scenes with the gingerbread man was a bit cringey - I kept thinking of the Shrek films, a vilainous gingerbread man(!). Some of the effects were better than others but its certainly an entertaining film and I thought Toni Collette did well in her performance as the mother. The plot is a bit less substantial than I guess I was maybe hoping but its still worth a watch for a bit of entertainment and a bit of a laugh at times, I'd say. Some of the visual effects aren't bad, are pretty good but the ending was a bit of a disappointment. Not a really bad film and certainly not a stand out film, the sentimentality towards the start was predictable but overall this is a pretty ok film that may be worth a look if it really interests you, I'd say but maybe don't expect too much. Personally, in terms of dark-ish, partially horror based Christmas films, I prefer Gremlins and Rare Exports: A Christmas Tale so I'd recommend those films over this but its still ok none the less I guess. Oh and one example of a piece of dialogue I found amusing goes as follows:-'Mum:- look after the kidsAunt dorothy: why me? I never liked kids - even when I was one'"
    },
    {
      "rating": "8",
      "text": "Krampus is a great horror comedy that is also christmas themed. The acting and special effects deliver."
    },
    {
      "rating": "6",
      "text": "A mí me gustó, la verdad. La historia es una estupidez, pero como ejecución opino que está muy bien llevada. Gremlins vibes out of this."
    },
    {
      "rating": "8",
      "text": "8/10 Krampus blends comedy and horror with an absurd storyline and believe it or not, some heart. What feels at times like a late 80s horror-comedy cult classic, Krampus was such a bizarre thrill ride all the way until the end."
    },
    {
      "rating": "5",
      "text": "A história é mais ou menos e o resto é bem ruinzinho, atuação, áudio, e até mesmo o próprio design do Krampus que é bem tosco."
    }
  ],
  "recommendations": [
    "cooties",
    "gremlins",
    "goosebumps",
    "dark_skies",
    "ready_or_not",
    "the_house_with_a_clock_in_its_walls",
    "it",
    "the_babysitter",
    "insidious_chapter_2",
    "insidious",
    "the_possession",
    "happy_death_day_2u",
    "goosebumps_2_haunted_halloween",
    "the_boy",
    "monster_house",
    "the_haunting_in_connecticut",
    "happy_death_day",
    "ouija_origin_of_evil",
    "sinister_2",
    "wish_upon",
    "countdown",
    "cabin_fever",
    "the_curse_of_la_llorona",
    "insidious_chapter_3",
    "the_cabin_in_the_woods"
  ]
}