{
  "id": 782,
  "title": "Kubo and the Two Strings",
  "starring": [
    "Art Parkinson",
    "Charlize Theron"
  ],
  "runtime": 102,
  "genre": [
    "Animation",
    "Adventure",
    "Family"
  ],
  "description": "Kubo mesmerizes the people in his village with his magical gift for spinning wild tales with origami. When he accidentally summons an evil spirit seeking vengeance, Kubo is forced to go on a quest to solve the mystery of his fallen samurai father and his mystical weaponry, as well as discover his own magical powers.",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aZJ6KK1Wt7YB4dgZ0qlpaX3PwNV.jpg",
  "categories": {
    "plot": 7.576923076923077,
    "acting": 8.108108108108109,
    "ending": 5.666666666666667,
    "soundtrack": 8.75,
    "cinematography": 9.75,
    "familyFriendly": 7.2,
    "funny": 7.75,
    "action": 7.785714285714286
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The folks at Laika Studio (ParaNorman, Box Trolls, Coraline) excel in creating atypical animations:  Atypical because they use labor-intensive stop-motion and diverge from traditional subject matter. This film tells the story of a young Japanese boy with storytelling gifts and magical origami skills. He sets out with his friends Monkey & Beetle to discover his family's secrets. While the animation is lovely, the story moves with a humble pace and dramatic nuance that is often slowed by long scenes of gentle dialogue. There are a few modern-style quips tossed about, but this is not a comedy. There's a sweet appeal and a quiet charm, but it ultimately lacks much emotional punch and visual splendor. Do children enjoy art films? NOTE: Stay thru the credits to see how one of the creatures is animated."
    },
    {
      "rating": "5",
      "text": "Here what my Review about Kubo\r Art :    10/10\rPlot:    4/10\rTwist:    0/10\rFight scene: 6/10\rVisual effect: 8/10\rEnding    3/10 (Extremely anti climax)\rMusic    9/10\rClimax :    Don't count on it\rTotal   Point    C+ ( i almost sleep in middle of movie, my sister already sleep )"
    },
    {
      "rating": "10",
      "text": "After a summer of disappointing sequels and blockbusters, we finally got an outstanding original story. Kubo and The Two Strings is the best animated film of the year and one of the best films of 2016. It has a compelling story, stunning visuals, remarkable animation, and great voice acting, especially by Charlize Theron."
    },
    {
      "rating": "3",
      "text": "While Kubo is lovely to look at and I can't help but credit the time that was painstakingly put forth in making this film. Reminds me a lot of Fantastic Mr Fox, however unlike Mr Fox that I did find very enjoyable and funny! Kubo is a masterful dull movie! I've honestly yet to understand all the praise put forth. Are we at a point when visuals alone are \"art\" and take a backseat to good story telling?"
    },
    {
      "rating": "0",
      "text": "While studio Laika's latest offering contains brilliant detail and painstaking craftsmanship, someone forgot to polish the script and storyline; specifically, there were so many things left unexplained or never fully explained I was left feeling more aggravated than awed. Every time that monkey said \"no more questions,\" I felt like tying her up with unbreakable rope and yelling: \"No, PLEASE ask more questions so I could understand what these filmmakers are trying to say!\" Some specific queries:\rWhy was Beetle cursed as a bug in the first place? Bugs were never a part of the story, so why not just leave him a cursed samurai? Or, better idea: MAKE HIM A TINY ORIGAMI MAN (Just imagine how cool it would have been if a giant origami soldier could have bailed Kubo out of trouble with his paper-folding abilities? Doing so would have rendered Little Hanzo obsolete.) Kubo's mother sacrificed herself by saving Kubo by... I dunno... Blasting him to a far-off region of the snow and transforming herself into a monkey? How exactly does one do that??? Why didn't she come back as a wooden talking monkey as opposed to a real one? Why exactly did Kubo's grandfather want his other eye? (The grandfather gave his reasons, Kubo offered a logical rebuttal, but I'm still not sure who was right and who was wrong...) Most frustrating is the fact that grandfather, hyped up as the main baddie, didn't even show up till the end, so instead we were left with two boring witches who looked like they came from Jack Skellington's Halloween Town. The Grandfather, (aka, The Moon King Raiden,) had confusing intentions, and I'm still not sure why he didn't appear more often if he was supposedly after Kubo's eye. Why do some people use magic and others do not? Why was there a magical shamisen? If the shamisen was so powerful, why weren't all the bad guys after it instead of Kubo? Why was the armor split up and hidden into three video-game-like traps in the first place? (Coraline's hide-and-seek plot could get away with this stuff because it took place in an alternate slightly-Lewis-Carroll world, but it made no sense here.) The biggest question of them all that really annoyed me: if this story's theme centered around the importance of family and people remembering ancestral history.... why in the hell weren't the mom's two sisters ever mentioned again or seen as spirits during the lantern ceremony? The old grandfather who was set up as a cruel heartless individual was later humanized, as the townspeople called him \"a good man.\" Ummmm, didn't this guy commit crimes? Why weren't the two sisters humanized? Did they not have souls too? I'm not sure whether this was a plot hole or misogyny.\r The visuals were impressive, this much I will admit. With its slightly-exaggerated Japanese inspiration and slightly-jerky character movement, there is great charm to stop motion animation. Laika once again delivers masterful detail and believability with their meticulously-posed dolls and sets. I wish filmmakers would have beefed up the Asian flair, because many backgrounds looked too similar to the far-superior \"Coraline.\" Yet, this complaint is a minor one, as most scenes conveyed a feeling of simultaneous ancient and contemporary, such as the opening ocean wave sequence, (which looked like a devil to animate,) as well as every single dream and story-telling sequence. Occasionally, however, things fall flat: what was Kubo fighting at the end of the film? It looked like a giant leech, or those annoying levitating things destroying New York City at the end of \"Avengers.\" Kubo was, I will admit, the most carefully-planned and likable character in the film, and his actions and mannerisms made him very strong without going overboard in know-it-all attitudes (like Coraline in her film or Norman in \"Paranorman.\")\r The end credits was the final nail in the coffin; a nice original melody would have been much appreciated but noooooo, they settle for a George Harrison oldie. And seeing all that traditional 2D animation made me sick that the entire movie wasn't made in this medium. In the future, Laika should make it their goal to focus their attention, not on building detailed puppets and backgrounds, but script-writing. The studio has been on a downward creative spiral since their first feature \"Coraline.\" (Their last effort, \"Boxtrolls,\" was so story-lite I have a hard time remembering what it was about.) Wherever they locked up Henry Sellick, please let him go so he can go back to directing movies again."
    },
    {
      "rating": "10",
      "text": "I'm the kind of guy who leaves the cinema and starts bombarding the people I went with with questions. Still I left this movie without talking to anybody, because I had no words. This film was mind blowing.\r It would be very obvious to praise the gorgeous animation, being this one of the most incredible stop motion efforts I've ever seen. Still, it's the story that made this movie the masterpiece it is. I'm shocked at the amount of people who couldn't appreciate the depth of the plot and the symbols spread around the movie. I guess that's what happens when you try to criticise such a transcendent and original piece of fantasy from the point of view of cold dry logic, which happens to be the main antagonist of the film."
    },
    {
      "rating": "10",
      "text": "What a wonderful film! The animation was astonishing, and the voice acting was simply fantastic, especially Charlize Theron, Matthew McConaughey, Rooney Mara, and Ralph Fiennes. Too bad all these wonderful actors can’t get together in an adult film of similar quality. You had to pay attention (or maybe only adults had to since the audience was very quiet, and we had plenty of very small children among us). Well, maybe the script was occasionally a bit muddled, but the characters were so vivid and the animation was so delightful that I have to forgive any faults and give this film a 10, something I don’t do very often."
    },
    {
      "rating": "9",
      "text": "amazing movie, with all the right ingredients for a great recipe. perfect for the family too. inspiring messages, and the animation is superb. hope people reward it with massive attendance!!"
    },
    {
      "rating": "9",
      "text": "Kubo and the Two Strings is fantastic.  It's animated beautifully, the music score is fantastic, the characters are great, the narrative is really good and the script works well and manages to treat its audience with maturity and respect and gives us a very memorable plot.  It does suffer from a couple of plot conveniences and the villain’s motivations could have been explained a bit better but it wasn’t enough to diminish the film for me.  This one was such a joy to watch and I highly recommend you go out and see it.\rI saw the film in 3D and I think it’s a bit of a mixed bag in that format and I wouldn’t assume it is essential, apart from a couple of scenes that are clearly shot with the 3D in mind, but honestly you can take it or leave it.  If you have kids, take them to see it, it is an excellent film and judging by the trailers for the upcoming family films, this is the best one you will see for a while.  This honestly has the potential to go down as one of the best stop motion films ever, right up there with ParaNorman and The Nightmare Before Christmas and Coraline."
    },
    {
      "rating": "9",
      "text": "This is a stunning, sumptuous, sublime film that is a joy to watch. The storyline interweaves Shinto and Bhuddist ideals delicately throughout the film, with particular attention given to the philosophical underpinnings of the notions of death and perfection in an imperfect world. The cinematography and visual design is superb, and the villains are brilliantly terrifying (the best I've seen in some time) so I'd suggest that an older audience (ten and up?) might be more appropriate. This was a delight to watch, and a unique, exquisitely crafted film unlike any children's film in recent memory. 8.94/10"
    },
    {
      "rating": "9",
      "text": "Laika Dethrones Pixar with \"Kubo and The Two Strings\"\r Impeccable and majestic beauty; Laika is already a strengthened production studio of distinguished films that combine traditional animation with a reserved use of digital technology, obtaining an air more craft and realistic, technique present in feature films such as the gloomy \"Coraline\" or the terrifying \"ParaNorman\", Laika has established a great fortitude and prestige in a world in where Pixar prevails year after year; \"Kubo and The Two Strings\" consolidates the essence of prior all films of the studio while adding something extra courtesy of a timeless visual and narrative magnificence, an eloquent feat of 2016 and openly a direct nominated to The Academy Awards.\r It has been a dilated and tortuous summer full of sequels and reboots that are going nowhere, but generate money at the box office; Alright! there were some surprises which astonished and excited to the general public, however, they did it on a template already employed, with characters, settings and even already existing soundtracks; nevertheless, thanks to Focus Features lands with Japanese moves the salvation of animated movies of this year, an original and nutritious film that will entertain to adults and instruct in children solid and beneficial teachings, even if I fear that will not receive what merits, this should not go unnoticed because it does not deserve it.\r Visibly, based and influenced by Eastern traditions, Kubo is a Japanese boy who lives with his disturbed mother on a crag close to a small village, the threads of the film are constitute in a magical and chimerical atmosphere, for this reason, Kubo attends to his village in order to bring to life realistic characters made of origami papers, which build an amazing story, story with a significant particularity, it never ends. Kubo knows that his father was an acclaimed warrior, who died by saving the eye right of his beloved son of the clutches of his grandfather and therefore, freeze the threat that revolved around his family, nonetheless, the danger is omnipresent as soon as the sun descends. Kubo, Monkey, and Beetle will move on a wild journey in looking for the different parts of the armor of his warrior father to eliminate the ghosts that invade his life of sorrow and bitterness and finally, give a real end to his grim own story.\r If Kubo would like to make use of the charms of the silent film - there is certain initial part in the movie that takes advantage of the muteness - to capture the attention of the spectators would be equally ostentatious, since, it only gives narrative strength - and what solidity! -, it also conceives meticulousness and scrupulousness in each frame, the arduous challenge of photograph and recreate settings, which are recognizable from our idea of reality, makes that the visual inventiveness and the proposal to appreciate the intricate effort provided by each member of the crew intensify. The melancholic individual scenes assimilated the same prestige than an intense action sequence. When you attend to the movie theater, you will be willing to realize of the most intricate details of its production, in case you discover any inaccuracy, however, from the first minutes dazzles us into its blinding landscapes and we forget our purpose radically, because if you must blink, do it now.\r Travis Knight, CEO of Laika, marks his directorial debut (Travis paid attention to every simplicity in the making of the films in order to develop his own movie with the strengths of each production) with a work brought to life with the greatest possible devotion, standing out among other adaptations of Hayao Miyazaki, because it is the only one that has reached to equalize his genuine imagination; This does not make human beings, magicians do it. The hair of monkey, the difficulty to create water ripple, the fascinating origami figures and the invention of the giant skeleton - the largest construction ever made in stop-motion - (all, all is absolutely of flesh and blood!) are reflection of the experience of Knight and he must prepare for the storm of proposals coming for him considering that a talent of this magnitude will not go unnoticed.\r Wabi-sabi is the author of the fluidity in textures of time and movement within the film, the art of seeing the beauty of the imperfect, and I don't mean that aesthetics is imperfect, on the contrary, it is fabulous, but Kubo does not become obsessed in capture detail to detail of Japanese culture, it strives to conceive a tremendously humane story coordinated with the physical reality of the characters and atmospheres ( better appreciated in 3D) captured by the meticulous stop-motion, serving of perfect vehicle for progress in the fleeting story.\r Sincerity, the overcome of death, the value of parents, the acceptance of the maturity and, above all, naive love prevail in every eloquent teaching that the movie wishes to instill. \"Kubo and The Two Strings\" is the animated film of summer, of the year and of the studio; with so many strengths and so few errors, the debut of Knight ensures its place in something more valuable than a golden statuette, \"Kubo\" ensures one place in the mind of each child and in the heart of each adult, simply excellent."
    },
    {
      "rating": "9",
      "text": "Oh my god. Its all I can honestly say. Kubo is an absolute thrill to watch from start to finish. Beautiful and so jaw dropping in its visual sense, that at some points you just have to stop and thank Laika for all the hard work they put into this film. Not to mention all the vocal performances are extremely on point and all the characters feel nuanced and real. A simple yet well told story with an original twist, Kubo and the Two Strings is a take on an old story reinvigorated for the new generation. With a real feeling of genuine awe and wonder to it, it'd be a shame if you missed this movie."
    },
    {
      "rating": "7",
      "text": "A boy, a monkey and a giant beetle team up for a quest.This is not an old fashioned stop-motion animation. This is a very modern, a hybrid of multiple techniques that includes 3D printing and digital special effects. The directional debut for the producer of 'ParaNorman' and 'The Boxtrolls'. The tale is about a one eyed boy named Kubo, who has been hiding in a seaside mountain cave near a small village from his grandfather, the moon king, ever since his birth, protected by his mother. He grew up listening the stories of a legendary samurai warrior Hanzo. But one day after he himself exposed to the moonlight, the troubles follow. Now his only chance to survive is to find his father's armours and so the quest begins where he teams up with other two.This is a Japanese story, takes place somewhere in a fictional ancient Japan. Technically, this film was so good, very pleasant for viewing, especially the framerate was higher than normal stop-motion animation. The character models, music, the length of the film, the pace of the narration, all were so brilliant, but not the story. It was average, I mean very, very simple and familiar. Still, it is a very likable film, particularly the children would love it. I'm going to repeat again like I always say while reviewing stop-motion animation films that this kind of films are rare, so when they make one, that automatically goes to a must see list. Whether you're going to like it or not, I hope you won't miss it.7/10"
    },
    {
      "rating": "8",
      "text": "Really good animated movie here! The start is pretty slow and repetitive but once (like others have said) the talking monkey comes in, the flow of the plot smoothens and the plot itself thickens some more. The 'boss battles' seen in the movie are pretty intense and are great to watch.\r There are a number of good scenes where we see character development for all main characters and it's really refreshing and enjoyable. There are a few plot twists that happen towards the middle to the end of the movie, and while some are kind of predictable, others will throw you nearly off your seat (I bet!). Check out this movie if you like animated movies, beautiful pieces of art, JRPGs (my main initial reason), or samurai and cool things related to Japanese culture.\r One thing I noticed was that while the animation was beautiful, I kept noticing a twitching glitch of sorts that made the face of all animated/speaking characters jump a tiny bit (but insistently). It was extremely weird and maybe even a little irritating as it was there for a good majority of the beginning of the movie (felt like stop motion in a way though), but I got used to the twitching by the midpoint so it was alright."
    },
    {
      "rating": "10",
      "text": "Wasn't expecting to to be blown away by Kubo and the two strings. This is a perfect film. The animation, humour, and voice acting are outstanding. Everything A+++++++++++++"
    },
    {
      "rating": "9",
      "text": "Absolutely fantastic movie. The movie looks stunning and top notch cgi. All the main leads did a great job too. The movie is also extremely charming, funny, and has a fantastic never boring story. Can't say enough about this movie. This no doubt will be one of the best films of the year."
    },
    {
      "rating": "8",
      "text": "Un CUENTO con mayúsculas, pero uno de esos cuentos que ganan en la pantalla, aún con su agridulce final y un par de diálogos tópicos y previsibles es una de esas películas en las que no deberías comprar refresco, puede que luego tengas que ir al baño y arriesgarte a perderte una escena."
    },
    {
      "rating": "7",
      "text": "Movies like Kubo demonstrated the value of diversity in different forms of cinematic art, more importantly, Kubo and the Two Strings is such a pleasure to watch.The fantasies with an oriental charm and the stop-motion technique that goes so well the the vintage-looking whimsical world which Kubo's story happened, Kubo is quite a successful effort in the age when CGI animation dominates the screen, which is precious."
    },
    {
      "rating": "8",
      "text": "Kubo and the Two Strings is a breathtakingly profound adventure of love & life. Bolstering a beautiful story, excellent voice acting and a particularly heart-wrenching soundtrack, it is genuinely one of the best films I have seen for a while. The ending is a little emotionally incoherent but is still delivered with a touch of magic."
    },
    {
      "rating": "7",
      "text": "Okay, so Kubo is pretty weird – but in the best of ways. After all, what other movie have you seen that stars a magical boy, a monkey and a beetle samurai? The odds that you have come across this concept before is pretty unlikely.The movie is basically about a powerful young boy named Kubo (Art Parkinson) who embarks on a journey with his guardian, a.k.a. Monkey (Charlize Theron) and an amnesiac samurai-beetle (Matthew McConaughey) to find magic armour when his grandfather, the Moon King (Ralph Fiennes) comes after him to convert him to the ‘dark side’, so to speak. And if that wasn’t already enough of an all-star cast, Rooney Mara voices Kubo’s two aunts, who are powerful and scary witches, both of who are excellently animated and acted.A strong link in this movie is the beautiful animation, which blends origami and stop-motion animation, which works surprisingly well. Some out-of-place CGI sticks out like a sore thumb, but luckily it is scarcely used.Kubo and the Two Strings is easily Laika’s best movie to date, with stunning animation, excellent voiceover work and one of the most original stories in recent memory."
    },
    {
      "rating": "8",
      "text": "Kubo and the two Strings left my eyes with immense satisfaction with its masterful stop motion and tears with its mature theme. Kubo and the two strings went completely under my radar for films to watch. So finally I gave it watch on Netflix.Just from the very few first minutes my eyes were greeted with masterful crafted stop motion. Kubo and the two strings sense of Art direction is something I have ever seen before.Kubo and the two Strings kept my attention throughout the whole film. Never in a moment where I felt this film hit a low point. Every scene either has well choreographed action set pieces or meaningful scenes between our characters. Also how this film paces through its editing style keeps every next cut interestingI never thought I would get such a serious theme from a film like this. I feel it was handles very well as it was being told through the film. Basically I saw two themes here. The major one was that memories are the most powerful thing you could ever have and every story has a end. These two kind of entangle with each other as in the end of the film Kubo honors his parents as passing memory at the ending scene of this film, thus giving Kubo a end to his storyHowever, for the plot of the film I feel it was a little bit of a mashed up adventure with your typical encounters with baddies and with the epic final boss at the end. But for the most part it checks off everything on creating a compelling characters and conflicts.Kubo and the Two Strings is defiantly worth the watch and I encourage all of you to take a night with some popcorn and watch it."
    },
    {
      "rating": "9",
      "text": "Kubo and the Two Strings is the fourth feature film from Studio Laika, the animation studio responsible for some of the best stop motion films of the past couple of years. Their previous work includes Coraline, The Boxtrolls and ParaNorman, all of which have been consistently fantastic, mixing studio Laika's signature stop motion animation with heartfelt stories and memorable characters. And Kubo might just be their best film yet. It's the brilliant kind of family film that doesn't just try to distract kids for an hour and a half, but instead challenges them, whilst also taking us on an epic adventure not quite like any I've seen done through stop motion animation before.\r The films story feels as if it's been ripped right from the pages of a classic fairy-tale. Kubo (Art Parkinson) is a young boy gifted with magical powers that allow him to control paper using his shamisen. At day he uses his powers to tell stories in a nearby town, often telling tales of his father, who was a legendary samurai warrior. Then at night he must return to live with his mother in a cave, as if he wonders out at night Kubo's grandfather, the Moon King (Ralph Fiennes), will find him and steal his remaining eye to make him blind to the world.\r One night Kubo ventures out too long and his grandfather sends his mothers sisters (both played by Rooney Mara) to capture him. Now with the help of a strict and protective monkey (Charlize Theron) that has been bought to life from a wood carving to protect Kubo and Beetle (Matthew McConaghey) who is a samurai that was transformed in to a giant insect man, Kubo sets off on a quest to find his fathers armour and defeat the Moon King.\r They never really explore much what exactly the Moon King's powers are or why they need to find the armour to defeat him. But just like we never need to know where the fairy godmother comes from in Cinderella, we never need a backstory here. We're so caught up enjoying the adventure and are too invested in Kubo's journey to start questioning the logic of this world. Also whilst all the characters of the film play their typical roles, they all play them so well. Our trio of heroes are all hilarious and lovable whilst the villains are genuinely threatening, having an intimidating presence whenever they're on screen in a similar style to the Other Mother from Coraline.\r The story is the stuff of mythical legend, but Kubo's journey in the film is one that we can all relate to. He ends up facing a great deal of loss in the film, which is something that any viewer can relate to in some way. But the film tackles death in a very unique way. Instead of just showing death to be the end, this film serves to remind us that the ones we love will always be with us within the memories that we cherish. That they can live on through us and the stories that we tell. It's a message that might sound difficult and complex for a kids film, but it's told in such an elegant way that it's actually a very accessible message for audiences of all ages.\r Then there's the films breath taking imagery. It's always incredible to see what minds like Pixar are able to do with computer generated animation, but there's something truly special about seeing a film on this scale made using stop motion animation. It's the same reason to love a film like Fury Road over something else that favours CGI. It just looks all the more impressive when it's really there. Plus the epic scale that Laika's undertaken for this production is remarkable. Whilst there is some CGI used, the focus on all the action sequences remains on using real sets and stop motion characters to tell the story. For example, in one stunning sequence Kubo is fighting a giant skeleton to retrieve a sword, which the animators created by using a giant 18 foot puppet in order to capture the scale of the monster.\r Kubo is a rare family film that succeeds at just about everything that it sets out to do. It's both fun and adventurous, whilst also containing a very melancholy tone that's never afraid to take the film in to some dark places. Beyond this, the films ending, particularly its final shot, is something truly beautiful that really must be experienced to be completely understood."
    },
    {
      "rating": "10",
      "text": "For all that we associate bright colors and animation/stop-motion with kids, this isn't a children's movie.  The hero is an eleven-year-old boy, but the themes aren't childish.There are moments of silly humor, but nary a fart joke to be seen.  \"And that really is the least of it.\"  Ultimately, the movie is more about joy than happiness; if you don't get that, you won't like the ending.The visuals are gorgeous, with only one or two times during the whole movie where I felt something was off.Kubo and the Two Strings also has something else most movies lack for me: a kind of poetry. A good poem uses the fewest words necessary to achieve the desired result, packing meaning into every phrase.  This movie packs meaning into every scene, every line and every visual.  I almost never buy movies because I won't re-watch them, but as soon as I finished Kubo I wanted to restart it, to catch details I'd missed and to see how knowing more about the characters and story would shade my understanding.\"If you must blink, do it now.\"  Because once the movie starts, you won't want to."
    },
    {
      "rating": "10",
      "text": "No question this is the best animated film I've seen in years. Stunningly original, it's honestly in a league of its own. Starring Charlize Theron, Art Parkinson, Matthew McConaughey and Ralph Fiennes. And if you don't know who Art Parkinson is he's the guy who should have zigzagged in Game of Thrones. Incredible story, fabulous stop motion and beautiful music. Strongly recommended."
    },
    {
      "rating": "10",
      "text": "This film is a masterpiece. It ranks among the best animated films of all time. Gorgeous visuals, masterful story-telling, inventive, exciting, funny, touching. I came out of the theater in awe, and quite moved."
    },
    {
      "rating": "10",
      "text": "Kubo and the Two Strings has beautiful animation, an emotional story, and a great adventurous feel, making it not only the best animated movie of 2016, but the best movie of 2016."
    },
    {
      "rating": "9",
      "text": "This is the best movie that Laika has ever made\rFull of drama, action, charm, comedy, love, wisdom and an emotional movie with great characters, outstanding animation and a beautiful story that makes the film an instantaneous classic"
    },
    {
      "rating": "9",
      "text": "Kubo and the Two Strings offers not only brilliant animation and a wonderful story, but also amazing characters, gut-wrenching emotion, and just a little bit of magic."
    },
    {
      "rating": "9",
      "text": "Really loved this film, plenty of mystery throughout until the end, artistically beautiful, and very entertaining. Unexpected ending, which was very satisfying."
    },
    {
      "rating": "10",
      "text": "A marvel of stopmotion animation. The story captures the attention of viewer, altough lacks of elements of humor, these are spontaneous and almost invisible. Mandatory."
    },
    {
      "rating": "9",
      "text": "By far the best animated movie of 2016, and the second best movie of 2016 only behind La La Land. First off, the animation is the best animation in any animated movie ever made. Second,the story is an emotional masterpiece. Third, the acting is great. And the music is powerful. This is a great movie I recommend to everyone."
    },
    {
      "rating": "10",
      "text": "Laika's Kubo and the Two Strings is by far one of the best animated films ever. The animation is once again flawless and the story is perfect. There is absolutely nothing wrong with this film and I really,really love it. And my rating is 10/10"
    },
    {
      "rating": "10",
      "text": "Kubo and the Two Strings was absolutely robbed of the Best Animated Feature Oscar. This was even my favorite movie of 2016! Hell, this might even be one of the top five animated movies of all time in my opinion! This story is so gripping and emotional, with brilliant visual storytelling and facial expressions to show what the characters are thinking.And speaking of which, this rivals Aladdin and The Lion King as one of the most gorgeous animated films ever made. The tangibility of the stop-motion effects make it feel so real even though I'm looking at stop-motion. I fathom how some of these effects were done, like the water, mountains, this giant red skeleton, and even the combat sequences!Zootopia was good, but no where near as memorable or emotionally impacting as Kubo and the Two Strings."
    },
    {
      "rating": "10",
      "text": "Excellent and charming movie with great characters, character designs, and story."
    },
    {
      "rating": "10",
      "text": "An incredible picture that boasts both a beautiful and mature story as well as the gorgeous artwork that you'd expect from Laika, Kubo and the Two Strings is not only Laika's best work but simply one of the best films of the year. Don't allow yourself to go into the movie thinking it's just another animated children's movie - because it isn't, it is so much more and it's simply an adventure that you need to experience for yourselves."
    },
    {
      "rating": "10",
      "text": "I found myself thinking WOW this is a masterpiece many times during this movie, it grabs you right from the very start and the story progresses nicely with some really good humour. The plot is fairly straightforward and is not overly complex, its kept simple for the U audience but the film I think is appealing to all ages, particularly adults. The animation and cinematography is absolutely sumptuous, it reminded me of Mad Max Fury Road in the way that it cleverly uses rich colour in its visual design. The acting is well done and sound effects and music are all top notch. I would watch this film again for sure. The only thing that slightly lets it down (and what all the negative ratings are critisizing) is its straightforward hero story, but I think some are forgetting it is a U movie, and anything more complex may have reduced its audience to older children. As its a U it gets a full 10 from me."
    },
    {
      "rating": "9",
      "text": "You have not seen a movie like this before. It has a consistent pace, with a fun thorough adventure, vivid colours, and a great story. Good villains who were actually kind of frightening. It was a movie that is not typical. It is worth seeing."
    },
    {
      "rating": "8",
      "text": "Kubo and The Two Strings is not a typical kids movie. It talks of loss and inner strength and not since The Lion King has a film been able to encourage such a heart felt and beautiful message to children."
    },
    {
      "rating": "8",
      "text": "Fantastic movie. Visuals were amazing. Story was interesting and the characters were great. If I had one complaint it would be that the character development could have been better. Still, this is a fantastic movie, and one of the few movies I actually want to go back and watch again in the theater."
    },
    {
      "rating": "6",
      "text": "Kubo and the Two Strings is a mixed bag of amazing visual and terrible storytelling. The best thing about this movie is no doubt the visuals! It oozes charm, originality, and culture. Stop motion fans will be in awe of this movie's action scenes, paper craft at its finest! Also, the voice acting is top notch. Delivery of dialogue is so punctuated yet natural-sounding at the same time. But other than that, there's not much else to like about this movie. Kubo and the Two Strings is based on a folk tale and it really shows! Scenes either go on WAY to long or end WAY to quickly. The plot of this movie is sometimes really predictable and other times stupidly irrational. Also, despite its kiddy looks, Kubo and the Two Strings will scare your kids! It's by no means a horror film with gore and jump scares, but there are some moments that I personally think younger viewers couldn't handle. In conclusion, unless you REALLY want to see something with pretty visuals, then avoid Kubo and the Two Strings. It's by no means terrible, but there's definitely a lot of better options."
    },
    {
      "rating": "8",
      "text": "Kubo and the two strings was a magical adventure that made me both smile and tear up. With beautiful animation that makes this movie even more magical. Great story, somethimes little slow, but it keeps up the pace very good throughout the movie. All the effort by Laika Studios has been awarded in this masterpiece."
    },
    {
      "rating": "3",
      "text": "Warning spoiler\r After seeing Kubo i have a mix feeling between great artistic + great visual effect and childlish writing. Not to metion there a lot of loophole in the movie whick i will break down here.\r1. The plot is basically rip off from Coraline : old man  try to stole the little kids's eye so he can force the kid to living with him forever. To avoid losing the eye the kid must complete 3 task to defeat villain. Tell me that not the same plot  from Coraline\r2.  3 task is bull **** since he not using any of that to defeat the monster. In the end he use the guitar he have in the first time to defeat evil granpa\r3. Ending so anti climax it give me 0 feeling at all\rI don't understand what critic's point of view  but this movie even worst than Boxtroll"
    },
    {
      "rating": "9",
      "text": "The animation is just off the charts beautiful. Fun character design and points for an attempt at a sophisticated story that doesn't explain every single element to the world to the viewer.\r I already do have a God I want to talk to. I talk to God every day and he talks back to me. We usually just have a rap session about sports and ladies. God is a big fan of Denise Milani's. Me too of course, but God just goes on and on about her. Enough already! LOL.\r I am just kidding. God is a VERY down-to-earth god. He sees what you do when no one is looking and he does not judge. He understands because he gave you all those deviant thoughts and of course why would you not act on the urges and emotions that were God-given? But maybe you should take it easy on yourself before you get a blister from all the rubbing?\r I am a huge Patti LuPone fan and I think that she has the voice of an angel, but God's always like she's not that great."
    },
    {
      "rating": "4",
      "text": "While it is very reasonable to say that yes, Kubo is a delight to the eyes. I find it extremely unjust to give it a free pass on every single other point of film making. What about the story? The plot? A characters that has a southern accent even though this is Japan? And the ending! All these problems should be taken into account rather than just saying pretty = masterpiece."
    },
    {
      "rating": "6",
      "text": "Half the movie looks so beautiful it's amazing what medium it was created in. They are hampered by bad pacing, constant ambiguity, and a plethora of flat falling jokes though. Which is really a shame since the rest of the movie can be quite emotional."
    },
    {
      "rating": "6",
      "text": "It was a tolerable story. Unfortunately, it felt like a semi-flat American interpretation of Japaneseness. It had a couple redeeming qualities, like the animation was great... and I'm sure there are others too. Your kids will probably love it."
    },
    {
      "rating": "9",
      "text": "There's a heart and most importantly a soul to Kubo that you aren't going to find anywhere else. The tale is brimming with imagination. It's unique and powerful. Backed up by stunning stop motion animation. It's an emotional and adult story that's told in a way that's acceptable for all audiences. It's brimming with depth, humor, and emotion. There's also some impressive action and magic.Kubo is a family movie with enough maturity to be just as compelling to adults on a story level as it is to kids on an entertainment and humor level. A triumph in animation and storytelling, Kubo is not to be missed."
    },
    {
      "rating": "9",
      "text": "\"Kubo and the Two Strings\" was an exciting and touching story of adventure in which Laika Animation, stood out a lot in this film, I enter in the film, in its characters, and of history in general, is one of the Best animated films of the year."
    },
    {
      "rating": "7",
      "text": "This movie was nice. I loved it like a sibling whose health and well-being I have utmost concern about, and for whom I’d willingly overlook the need to run errands as a mild inconvenience that comes with siblinghood. For whom I’d loan a hundred dollars under the understanding that it IS a loan, then forget about it because that, too, comes with the territory. For whom I’d pick up from their home to drop off, wait for, and return home from the supermarket without asking for gas money (not to mention the unquantifiable compensation for time).\r But I wanted to love it more like a child whose needs I feel obliged to meet without question; whose well-being is not just important, but necessary; whose bright future shouldn’t just be a concern, but assured. I wanted to love it more than I did, but I couldn’t. Don’t get me wrong, it’s a good movie, but to me, it was one of those that was good enough to be better. It was ‘generalistic’ enough that it could fascinate younger audiences, it was deep enough that it could resonate with the more mature, and it was thought-provoking enough that it could appeal to the very cerebral. So why, in the end, wasn’t it even better than it was?\r Kubo himself took centre stage early on, with wails that brought his spent mother to his side. The story goes on to keep him in the spotlight, and throws in a few sidekicks that are as varied, capable, and witty as a light-hearted movie of this nature is intended to be. However, despite the occasional flash back or real-time dialogue, it never gets beyond superficial explanations of anything, leaving you to answer your own questions about everything - if you even bothered to ask. In my opinion, character development could have been deeper, and though I liked the art style, I couldn’t help but wonder if this wasn’t one of those that would have received more critical acclaim if only the sidekicks and the effects alone were CG.\r In the end, it’s a smooth ride at a casual pace with enjoyable music that could put the driver to sleep. Kubo and the Two Strings makes for a fun romp but not a must-see. It brings to an end a summer of non-blockbusters, causing me to postulate that depth is being traded for effects. It delivers an action animated movie with a nebulous storyline that makes me wonder why it wasn’t performed by real characters in the first place! The strumming of the guitar and the telling of the stories might have been a sight to behold if it were performed in person by Neel Sethi or the likes. But alas, it was nice, and in the absence of overwhelming choice, I’ll settle for nice."
    },
    {
      "rating": "1",
      "text": "What does The Junge Book and Kubo and the two stings have in common? They are both HIGHLY over rated films propped up by mostly younger viewers and hipster critics whom state these films are art in the most pure of forums! If you are the type of person who is dazzled by special effects you'll likely think this film is the second comming! If the pursuit of good story telling is what your after I advise you to look elsewhere! I could go in the detail here but a look though at other honest reviews posted here, have already done a pretty good job at explaining it."
    }
  ],
  "recommendations": [
    "your_name",
    "luca",
    "paprika",
    "alpha",
    "the_iron_giant",
    "how_to_train_your_dragon_2",
    "isle_of_dogs",
    "soul",
    "how_to_train_your_dragon_the_hidden_world",
    "the_bfg",
    "the_incredibles",
    "the_book_of_life",
    "raya_and_the_last_dragon",
    "the_good_dinosaur",
    "dinosaur",
    "wolfwalkers",
    "the_nutcracker_and_the_four_realms",
    "ratatouille",
    "the_little_prince",
    "okja",
    "finding_nemo",
    "song_of_the_sea",
    "toy_story_3",
    "9",
    "hugo"
  ]
}