{
  "id": 591,
  "title": "Kung Fu Panda",
  "starring": [
    "Jack Black",
    "Dustin Hoffman"
  ],
  "runtime": 90,
  "genre": [
    "Action",
    "Adventure",
    "Animation",
    "Family",
    "Comedy"
  ],
  "description": "When the Valley of Peace is threatened, lazy Po the panda discovers his destiny as the \"chosen one\" and trains to become a kung fu hero, but transforming the unsleek slacker into a brave warrior won't be easy. It's up to Master Shifu and the Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- to give it a try.",
  "releaseYear": "2008",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wWt4JYXTg5Wr3xBW2phBrMKgp3x.jpg",
  "categories": {
    "plot": 8.31578947368421,
    "acting": 8.25,
    "ending": 9.0,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 8.0,
    "funny": 8.333333333333334,
    "action": 8.909090909090908
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This is definitely a great movie. I love the story, it's very clear and interesting. The graphics were great so it has visual impact to viewers. Definitely, one of Dreamworks' best..........."
    },
    {
      "rating": "6",
      "text": "All I can say was that it was alright. Not bad, of course, but nothing special. It was short and had a very simply laid out beginning, middle, and end. Certain parts were dragged out a bit more than necessary and others were over quicker than they should have been, like the solution to the mystery of the Dragon Scroll. It was just completely unprompted and almost awkwardly shoved into a scene in the movie where it didn't really fit. Jack Black (beside the animation itself)is really the only phenomenal part of film. His personality really adds to the character and makes him likable, relatable, and ultimately enjoyable. I'd recommend it for viewers with younger children. Other than that, I'd rent when it comes out on video."
    },
    {
      "rating": "4",
      "text": "I really had high hopes for this movie, especially when I heard Jack Black and Jackie Chan were in it. Unfortunately, I was really disappointed with the movie. With the exception of Po and Shifu, all the characters, especially the furious five, were one-dimensional. Lame plot, and I barely got to hear Jackie Chan! And now they're making a sequel? DreamWorks, unless you make this sequel your \"Dark Knight\", you won't be seeing me watching Kung Fu Panda 2."
    },
    {
      "rating": "10",
      "text": "The greatest movie of all the time. And the best trinity of all the time. You definitely must watch Kung Fu Panda movies."
    },
    {
      "rating": "9",
      "text": "One of dreamwork's best. I got a karate kid feel from this. Jack Black was perfect for this role. I was laughing alot also. its a perfect family movie"
    },
    {
      "rating": "8",
      "text": "Recently, Dreamworks has been working hard to improve their story and dialogue, and they did use their time wisely. Their animation \"Kung Fu Panda\" blows it all, from comedy to action, like a boss."
    },
    {
      "rating": "10",
      "text": "Kung Fu Panda has great visuals, but the real reason for Kung Fu Panda being so awesome is that the story is great and Po the panda is among the best animated characters ever."
    },
    {
      "rating": "9",
      "text": "A very worthy addition to the animation world. Great voice acting and a unique cast of characters. Especially the female tiger, which I thought was a piece of art. Cartoonist yet highly stylized. The turtle was pretty cool too. Add in some humor, a lovable unorthodox underdog hero, and a some beautifully animated fight sequences featuring a worthy villain with some neon colored special effects and you got yourself a very eye popping and attention grabbing movie. I'll rate Wall-E as the deeper more insightful thought-provoking movie while Kung Fu Panda is the more playful/humorous 'sit back, turn off the brain, and enjoy' film."
    },
    {
      "rating": "8",
      "text": "Another solid movie from Dreamworks, the animation doesn't seem to age (at least not as much as Madagascar), the jokes are mostly great, the voice acting is fantastic and the story seems to work very well. It's better than Madagascar, but not quite as good as the likes of Shrek (the first 2) or How To Train Your Dragon. A very awesome film nonetheless."
    },
    {
      "rating": "9",
      "text": "After seeing the cutesy \"Over The Hedge\" and a beediocre disappointing \"Bee Movie\", I rolled my eyes when I met an action flick known as \"Kung Fu Panda\" and I enjoyed it.The storyline was well-paced and it had a creative atmosphere that lies in the very existence of kung fu and has done anything to get some things done. It had some very emotional moments with gave this movie a heart to the original story.The cinematography was magnificent when it comes to make a wonderful cast to play their rightful voices for the characters. Jack Black and Dustin Hoffman made an awesome mix of Po and Master Shifu because of their own personalities, different expositions, and their only chances of becoming friends to one another near the end of the movie. Ian Mcshane's performance as Tai Lung was amazing and his frightening presence gave me the shivers. James Hong as Po's father (who obviously played Chi Fu in Disney's Mulan) was very entertaining. The cast of the Furious Five were very good and they were given a little bit of screen time and were developed near the end of the movie which makes Angelina Jolie, David Cross, Seth Rogen, Lucy Liu, and Jackie Chan very memorable in this animated feature film.The CGI animation is very amazing and somehow beautiful in most animated feature films, The characters were very likable and memorable that even ex-Disney animators would find them entertaining, the comedy was hilarious with Po's moments and the sets stayed very true to the Chinese culture. The action scenes were very intense and very unique which makes this movie the first CGI cartoon to have action sequences.The music score by Hans Zimmer (The Lion King, The Road to El Dorado) and John Powell (in other Dreamworks Animation features) was very memorable and a lot of emotion to it to describe the characters feelings and the academy awards proved it.The only problem that I do have with this movie was the clunky plot/script and not only that. It was too predictable.Kung Fu Panda may not be a masterpiece, but it's a surprisingly good animated kung fu flick. It made $631 million dollars at the box office and it was as epic as Disney's The Lion King.9/10"
    },
    {
      "rating": "9",
      "text": "Warm, touching, and fruitful script, coupled with amazing animation technique, make this kung fu parody funny and entertaining. Excellent voice choices, in particular Jack Black, and, surprising, a lack of the common corny plot lines in regular animation. Loved it since it came out."
    },
    {
      "rating": "6",
      "text": "They're animals, not people; but \"Kung Fu Panda\" take place in China, and the animals are voiced by both, American and Asian-American actors. Viper(Lucy Liu) and Monkey(Jackie Chan) are Chinese, but Tigress(Angelina Jolie) and Mantis(David Cross) are pretending to be Chinese, like David Carradine in \"Kung Fu\". The panda bear, the animal most iconographical to Mainland China, is part of the covert yellow-face minstrel act, too, made even more intriguing by its black and white markings. Po(Jack Black) is a kung fu fan like Taimak in Berry Gordy's \"The Last Dragon\", who was black, and a kung fu master like Cane, in the aforementioned series that was originally planned to be a star vehicle for Bruce Lee; needless to say, Carradine was white. In a film with Jackie Chan, the closest thing we have to the late Lee, it's interesting to mention that the Anglo-American actor gets to read the ancient prophecy, and not somebody of actual Asian descent."
    },
    {
      "rating": "4",
      "text": "Mediocre. I was bored by this movie, really. So cliché!..."
    },
    {
      "rating": "5",
      "text": "Mediocre at best."
    },
    {
      "rating": "4",
      "text": "Typical Dreamworks animation fare - formulaic, unoriginal, uninspired. Don't waste your money."
    },
    {
      "rating": "5",
      "text": "The previews looked funny, but I initially hesitated to watch it because the last few Jack Black movies were disappointments. Well, you can add this one to the list. There are a few laughs, but most of the jokes aren't funny. And the drama is something we've already seen in better movies by Pixar (and probably by Dreamworks as well)."
    },
    {
      "rating": "10",
      "text": "Wonderful humor, Amazing creativity, Awesome movie."
    },
    {
      "rating": "8",
      "text": "A fun movie for the whole family (sounds cliche, but really applies for this flick). The animation is great, and it actually gets some good consistent laughs in throughout the duration. It seemed a little short to some, but I got a kick out of it. Take your kids and you won't have a bad time yourself."
    },
    {
      "rating": "9",
      "text": "I was pleasantly surprised by this movie.I was outvoted,so I went expecting over the topedness{sic} from the voice of Jack .B.He was, but in a good way.The nearly painted animation was done well very crisp,and fluid."
    },
    {
      "rating": "9",
      "text": "Very Funny! The main character had depth and was very entertaining. A must see!"
    },
    {
      "rating": "8",
      "text": "Solid flick for everyone of all ages."
    },
    {
      "rating": "8",
      "text": "Such an enjoyable film to watch with a great cast backing it up. Perfect film to watch with the family or if your just in the mood for a laugh."
    },
    {
      "rating": "8",
      "text": "This is a very good movie: it's funny and has a compelling plot. The characters are all very likable and I think kids would like it a lot. It definitely isn't just another cookie cutter animated movie about talking animals and does some fairly original things."
    },
    {
      "rating": "9",
      "text": "Hysterical, probably my favorite animation movie ever."
    },
    {
      "rating": "9",
      "text": "I was not going to even write anything about this but wow Chad S., get a life!! I have no clue what all that rambling was about. Needless to say, this was a fun movie to go to and watch."
    },
    {
      "rating": "10",
      "text": "It is simply one of those movies people should see if not to simply let go of the seriousness of modern-day plots. It is light-hearted, funny, and action-packed."
    },
    {
      "rating": "10",
      "text": "Shallow, silly and absolutely irresistibly funny!"
    },
    {
      "rating": "8",
      "text": "Very enjoyable movie for both kids and adults. A simply movie formula done extremely well. The fight scenes were surprisingly good as well, Wo Ping would be proud. The animation is excellent and brings the story of a likable Panda to life."
    },
    {
      "rating": "10",
      "text": "I thought this would be good fun but quite frankly I was awestruck to the point of tears at some of the staggeringly beautiful backdrops and scenes. Admittedly I am a sucker for visuals but I was not the only one in the theatre gasping and breathless with astonishment at times. For me then, the best computer animated film to date, even with the standard so high overall"
    },
    {
      "rating": "10",
      "text": "I loved Kung Fu Panda. I am an old school martial arts fanatic--used to watch the movies with my dad. This meets all of the criteria of a martial arts film like Lord of the Wu tang (unlikely hero becomes Kung Fu Master by chance), has the visuals of a \"Hero\" or \"Crouching Tiger\", and has the heart of Disney (yes, I said it). When I went to the theater to see it all of the children there loved it and my two reasons for living came out wanting to learn Kung Fu. I think the haters out there just don't like or \"get\" Jack Black, because really I see no other reason they could dislike this film."
    },
    {
      "rating": "7",
      "text": "This movie is really funny, with a lot of \"kung fu\" fighting and the voice acting is great too. I really recommend this movie."
    },
    {
      "rating": "7",
      "text": "Brilliant animation, great story and often laugh out loud funny. It's not up there with Finding Nemo, Toy Story or A Bug's Life, but it is still a fine film. Very entertaining."
    },
    {
      "rating": "8",
      "text": "Very funny -- a good family movie for older kids."
    },
    {
      "rating": "10",
      "text": "This movie is what I consider to be Dreamwork's best animted picture (Yeah that's right Shrek, I said it). The movie manages to have comedy that can not only appear to children, but also adults and teenagers. The story tells of a panda named Po that is a total Kung Fu nerd and is chosen to become the hero to save the land from the evil Tai Long. Everyone is shocked to see a fat panda picked, but Po refuses to give up. He shows that with perseverance and determination that anyone can come past their problems and become a hero. Kung Fu Panda features an incredible cast of voice actors including Jack Black, Dustin Hoffman, Agnelina Jolie, Lucy Lui, David Cross, Seth Rogen, and Jackie Chan. This movie is the most phenomenal animated film I've seen that is not from Pixar. I can't reccomend this movie enough to people of all ages."
    },
    {
      "rating": "9",
      "text": "Very fun movie. Great themes and nicely animated."
    },
    {
      "rating": "9",
      "text": "Frankly this movie was ridiculously good. The story was simple, but deep. The one huge question that seemed obvious was turned into a joke at the last minute, and the graphics were amazing. The blend of visual styles between traditional american cg movies and japanese anime made the movie lightning quick, to the point where it was near impossible to lose focus. The special effects were amazing, with the fire looking very lively while the dirt and dust merged perfectly with the environment it was put in, Dreamworks outdid themselves, and perhaps Pixar on this one, at least until Wall-E comes out next week."
    },
    {
      "rating": "7",
      "text": "Chad S......i think you need to even out your medication mate, seriously are you alright? How the hell have you managed to see that much intrigue and conspiracy in one film? My favorite line is \"the panda bear...made even more intriguing by its black and white markings\" ITS A FECKING PANDA BEAR...thats there markings not a massive attempt to undermine a race....oh and the film was...meh, wait for the dvd."
    },
    {
      "rating": "8",
      "text": "This was a really good movie to watch. It's really funny, so obviously lots of people would like. I'm one of those people. The story was quite interesting, and if you haven't seen it, it's good to watch with friends/family."
    },
    {
      "rating": "8",
      "text": "Adorable, delightful action-comedy with panache. Why didn't anyone think to do martial arts with Warner Bros.-style cartoons before? Jack Black is amusing enough, but the real treat is the artistry and animation. I did not expect to love this movie."
    },
    {
      "rating": "7",
      "text": "This was a good story for both adults and kids. I took my wife and 5 year old son to see this movie. We all enjoyed it. The movie started a little slow, but picked up pace once the Panda starting his training."
    },
    {
      "rating": "10",
      "text": "With the Jack Black style humor, fighting scenes and dreamworks FX, its hard not to like this movie. It gets a perfect 10 because I can't think of anything possibly wrong with it."
    },
    {
      "rating": "9",
      "text": "This movie was action packed and hilarious! The humor in the movies was great and kept laughing until the very end. A great movie for all ages!"
    },
    {
      "rating": "9",
      "text": "This movie was excellent. The only thing that prevents me from giving it a 10 is that I don't know if it connected with my kids as much as it could have. They laughed throughout and we all had a great time but at the end I don't know if they would list it among their all time favorites. I personally think that most of the 50-65 scores listed in the \"critics\" section show that these reviewers are either out of touch or have no sense of humor."
    },
    {
      "rating": "8",
      "text": "At 40 and with no kids (by choice!) my girlfriend and I don't tend to watch much of this sort of film. I remember enjoying the first Toy Story and one or two other animated features since, but I wasn't particularly expecting to get into this as much as I did. It's funny, charming, and genuinely gripping in places. The characterisation is first-rate (loved the Mantis in particular). I saw the film on Blu Ray and the visuals looked exceptional. All in all a really enjoyable film and not just for the kids. Recommended."
    },
    {
      "rating": "9",
      "text": "It is worth to see this funny movie. You can relax and watch it with your family."
    },
    {
      "rating": "10",
      "text": "WALL-E is at least a 9, and so is Kung Fu Panda. I don't know why the score is low right now. This is not to be missed. do yourself a favor and watch it at 1080p res bluray etc. I'm hoping that score will go up when it releases on dvd and bluray in a couple weeks. a must see. I rarely give out 10s, im very picky, but this animation is my personal flavor. they did an amazing job. very much appreciated."
    },
    {
      "rating": "9",
      "text": "It has been long since the first Shrek was released and dreamworks had a really innovative work, but finally things have changed... and the name is Kung Fu Panda! At first it doesn't seem any different from any other movies aimed at a younger audience, but after a closer look one can notice that this movie is more refined and have been morre cared for during production than the others. From the fur effects to the awesome matte paintings on the background everything is visually perfect and all of this is backed by an outstanding sound design that ranges from epic tracks to a beautiful and realistic lipsync to the voices of an \"A Rank\" cast. This is the Panda you have been looking to adopt, protect and have fun with!"
    },
    {
      "rating": "9",
      "text": "I saw a pre-screening of this film a week ago, and absolutely loved it! Not only are all of the voice actors perfectly matched with their cgi characters, but the script is great, the action is fast paced, and the graphics are extremely well done. I'd say it is at least on par with DreamWorks' best cgi film thus far (Shrek), and is near the lofty caliber of Pixar films. (For a reference point:"
    },
    {
      "rating": "6",
      "text": "The very definition of mediocrity."
    },
    {
      "rating": "10",
      "text": "Fantastic action scenes and Jack Black knocks the ball out of the park. Hilarious to boot."
    }
  ]
}