{
  "id": 758,
  "title": "Kung Fu Panda 2",
  "starring": [
    "Jack Black",
    "Angelina Jolie"
  ],
  "runtime": 91,
  "genre": [
    "Animation",
    "Family"
  ],
  "description": "Po is now living his dream as The Dragon Warrior, protecting the Valley of Peace alongside his friends and fellow kung fu masters, The Furious Five - Tigress, Crane, Mantis, Viper and Monkey. But Po’s new life of awesomeness is threatened by the emergence of a formidable villain, who plans to use a secret, unstoppable weapon to conquer China and destroy kung fu. It is up to Po and The Furious Five to journey across China to face this threat and vanquish it. But how can Po stop a weapon that can stop kung fu? He must look to his past and uncover the secrets of his mysterious origins; only then will he be able to unlock the strength he needs to succeed.",
  "releaseYear": "2011",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mtqqD00vB4PGRt20gWtGqFhrkd0.jpg",
  "categories": {
    "plot": 7.90625,
    "acting": 8.565217391304348,
    "ending": 8.0,
    "soundtrack": 9.333333333333334,
    "cinematography": 5.0,
    "familyFriendly": 6.666666666666667,
    "funny": 6.571428571428571,
    "action": 8.027777777777779
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is one of the few sequels that are better then the original. '' Kung Fu Panda 2 '' delivered a touching, brilliant and good story. I like the fact that it gets serious about Po's origins (without spoiling anything). There was a lot of fighting (even a little bit to violent) and the kung fu was bad-ass. The way the Furious five and our Dragon warrior fought was spectacular. I was looking forward to see if the villan (Shen)  would be as much as evil and hardcore, since Tai Lung (in the first movie) was the perfect bad guy. Again, he was a bad-ass villan, even better than Tai Lung. Also, this movie delivers a great message. Not only the kids will love this movie, the adults to. It's the perfect family movie."
    },
    {
      "rating": "10",
      "text": "This is my favorite one. The worldbuilding is great, the furious five shine as a group working with the Dragon Warrior, it hits me in the feels, and the climax is sensational, easily the best of any Dreamworks movie. It's awesome, you know it's awesome."
    },
    {
      "rating": "10",
      "text": "ITs definitely not the best kids movie ever made, but its somewhere up there. I mean even for an adult its quite funny to watch with kids. It's debatable if first one is better, but i say they are both good.quite worth the time"
    },
    {
      "rating": "10",
      "text": "Fun-to-watch action? Check. Funny jokes? Yes. Gorgeous visuals that still hold up even when modern 3-D animation is better than ever? Yes. Really good villain? Yes! (Lord Shen is easily the best antagonist of any Dreamworks movie) This movie is the total package of awesomeness."
    },
    {
      "rating": "10",
      "text": "best movie in current times. enjoyed a lot. neat narration and good direction. all together the best animated movie since 2 years. my vote for it 10/10. po rocks!!! all the best for the collections as it is going to be a blockbuster of the year"
    },
    {
      "rating": "9",
      "text": "WOW. The original Kung Fu Panda is the one standout Dreamworks animated movie in my mind. This expands on the original in a grand fashion. This film is a lot darker than the original, and stands out because of it.. This movie is this franchise's Empire Strikes Back. I can not wait to see where they take Po in the next installment."
    },
    {
      "rating": "10",
      "text": "Everything about this movie was wonderful, Dreamworks has been kicking some serious butt lately (disregard Shrek 4) This film was funny, action packed, and touching. I haven't been this impressed by a sequel in quite some time. The Oscars should create a voice acting category just for Gary Oldman's performance in this film."
    },
    {
      "rating": "8",
      "text": "Pretty much everything about this film is the same in quality as the first film. The action sequences (of which there are many) are very well made, the script is pretty funny and the voice acting is pretty good for the most part. The one gripe I have with the film is that the plot is maybe not quite up to the first film's plot. But it is funnier, prettier and more action orientated than the first, which probably makes it the best of the two (even though they are both pretty much the same). What I say to Dreamworks is please don't mess up the third film, learn from your mistakes with Shrek 3, keep the standard up!"
    },
    {
      "rating": "10",
      "text": "we all know that \"Kung Fu Panda\" was a smash hit once it came out in 2008. and how could it not be? it was a great movie, filled with amazing animation; fantastic fight choreography; lovable/memorable characters; hilarious comedy, all that together in a great movie with a perfect pace. so, normally when a movie's a smash hit, we all know it's sequel time. when i first about \"Kung Fu Panda 2\" i was really excited. so i sat down, watched it and let me tell ya this: \"Kung Fu Panda 2\" is ever better than the first movie! it ups the jokes, it ups the characters, it ups the animation and it even ups the drama. i swear, some scenes in this movie actually made me and everybody in the cinema cry. whenever a sequel makes you cry, that's a really impressive step-up from the original. the story's not really fresh, but everything else was done perfectly! the characters are fantastic; the animation's even better; the comedy's hilarious; the drama's powerful and affecting; the voice acting's top notch; the script was smart and strong and this movie has Shen, a.k.a 1 of the greatest bad guys ever put in any movie! and Gary Oldman owned that role! overall, \"Kung Fu Panda 2\" tops and outdoes the original in every way. if you haven't seen it by now, then definitely see this movie."
    },
    {
      "rating": "10",
      "text": "Kung Fu Panda 2 is one of those follow-ups that not only match the original, it exceeds it. Like some other follow-ups out there, this one is darker than the first, but that's a good thing."
    },
    {
      "rating": "7",
      "text": "A fun addition to the first, as well as something completely different. The first was more of a comedy with action scenes, while the second is more of an action movie with comedic scenes. It's visually gorgeous, the 3D is great, and it'll waste an hour and a half. Kids will love it."
    },
    {
      "rating": "9",
      "text": "Hard ot believe - but better than the first one imo. Enjoy! The nemesis is much more interesting. The animation is better. The action sequences are great. I am going to see it again."
    },
    {
      "rating": "9",
      "text": "A very good movie, excellent use of 3d and traditional style animation for flashbacks. The humour was more frequent and on par with the original. There seemed to be more depth to the characters than before and this made the movie much better. It was good to hear more from the characters as well, in the first movie some of the characters hardly had much dialouge now this one has given them chance to speak out as it were.I really hope that dreamworks decides to make one more sequel cos the first one was brilliant, the second has equealed it and a third to finish off would be fantastic. Jack black has really found a character that i love for a change"
    },
    {
      "rating": "8",
      "text": "Bueno pues la pelicula es buena , tiene momentos graciosos, que  sacaran una risa.\rLa trama es buena , es interesante, y matendra al espectador al filo de la butaca varias veces."
    },
    {
      "rating": "10",
      "text": "This is a sequel that is a lot better than the first. No other animated film has fit so much action into itself and still have a great story fit in. There is an even bigger lesson to be learned from Kung Fu Panda 2 compared to the original."
    },
    {
      "rating": "10",
      "text": "This has got to be one of my favourite films ever. This film is better, in my opinion, than the original which is saying something cosidering the original was one of the best animated films I had ever seen. And oh my goodness, this film is near perfect! The story may be quick to get into but the fighting scenes and comedic transitions overly make up for it. The story is very well built, very funny, heart warming and will make most people cry (if you have watched it you will know which parts I am talking about). You can tell a movie is good if it juggles your emotions harmoniously but also unexpectedly and this movie is no exception. This movie shows Po at his weakest and at his height and is portayed fluently and I mean WOW! it really hits you how this Panda has become so important! The music is stunning as expected with absolutly amazing pieces like \"Po Finds the Truth\" and \"Inner Peace\"(Which are definately worth looking for on Youtube). Visually the the setting is spectacular and every model has been very well detailed and is very impressive.You can tell Dreamworks have much so passion in this franchise and put so much love into making it.Overall I think this film is absolutely one of my favourites and I will defend that!"
    },
    {
      "rating": "7",
      "text": "Eh...There really isn't much to say about \"Kung Fu Panda 2\" compared to its prequel. I mean the action and comedies are great as well as the story, but everything sorta lacks of focus and consistency. Regardless of the cons, however, its still a great summer movie to watch with your kids."
    },
    {
      "rating": "9",
      "text": "Awesome Movie!.Touching history,with great action pieces and visuals over the top!.I saw this movie in 3D, and for the first time, I definitely recommend it. I haven't had many good experiences with live action 3D, but animation is much better suited for it. Kung Fu Panda 2 is a thrill ride, and the 3D was crisp and well done."
    },
    {
      "rating": "10",
      "text": "These Movies sum up my notable and favorites. I think every reviewer should have this in their â"
    },
    {
      "rating": "9",
      "text": "Well, it's been three months since I last saw this sequel in cinemas before I saw Pixar's Cars 2 (I'm one of the few people who liked that movie). Let's just say I enjoyed the predecessor that had groundbreaking animation, an amazing voice cast, spectacular action scenes, hilarious comedy, and Hans Zimmer's and John Powell's beautiful music score. So, I like when Dreamworks Animation makes very successful that captures the magic of the original. That's why we get Kung Fu Panda 2, a satisfying sequel to an amazing movie even though it's not a masterpiece. It captures the magic of the first movie that makes it very entertaining to watch.The voice acting was as amazing as the first movie's voice acting, the action scenes were intense as ever, the animation was lovely, and wouldn't you know it, and even the music score from Hans Zimmer and John Powell was emotional and epic. The story was actually darker than the first, but also emotional. The first reason was the Genocide theme. The second reason was an emotional scene where Po remembers his childhood and his parents by using Inner Peace, the kung fu technique. As for the rest of the story, I like the development of Po and Master Tigress's friendship. Tai Lung from the first movie was far more sinister and very frightening. In here, it was very hard to be terrified of a **** but the animators did their best to create an even more menacing villain as Lord Shen himself voiced by the magnificent Gary Oldman.The only problem that I do have with this movie was the script. It was too predictable, but not as clunky as the predecessor's script.Although, Kung Fu Panda 2 may not be a masterpiece, but it's an excellent follow up to a really great movie and it's worth checking out.I'd be excited if Kung Fu Panda 3 is gonna start production because this franchise is about as good as the Shrek series.9/10"
    },
    {
      "rating": "9",
      "text": "Luckily Kung Fu Panda 2 had some emotional depth so it wouldn't be just an okay film it actually ends up being a huge improvement. It adds to that with some great animation and fantastic action and a whole lot of humor.  I give this movie 93% of a good film."
    },
    {
      "rating": "3",
      "text": "The original Kung Fu Panda was one of the best. The cream of the crop, the best of the best. Does the sequel match it's predesessor? I went to see the movie in 2-d and was amazed. At the sheer dissapointment that is. The original was fun and funny. This wasn't. It attempts to be both funny and slightly more serious while targeting a younger audience. This completely ruins all the best aspects that it could have had. The plot is seriously underdeveloped from what it could have been. Plot: talk, fight, fight, fight, fight, fight, win. That is literally the entire plot. I give it a 3 out of 10"
    },
    {
      "rating": "4",
      "text": "Only half as much fun as the first one - dont expect anything like the humour in KFP1. So many of the characters barely have any dialogue in it, just a lot of fight scenes"
    },
    {
      "rating": "7",
      "text": "The original Kung Fu Panda was more sophisticated in its humor making it very enjoyable for adults as well as kids.  It was also funnier, and didn't have quite so many fight scenes.  The producers have fallen into the Hollywood trap of having as much action as possible.  It needed more quiet moments like in the first film.  Still, it was entertaining and looked great, although the 3D was not worth it.  The entire time I was wishing I was watching it in the bright 2D instead of the dull, dark 3D.  It will make the Blu-Ray all that more exciting to watch I suppose.  Overall good, but disappointing considering the first one was so great."
    },
    {
      "rating": "10",
      "text": ""
    },
    {
      "rating": "2",
      "text": "The problem with the film is that it isn't funny. Kung Fu Panda is meant to be funny, the first one had lose of jokes and great moments, where as in this one, there is a single good joke that made me laugh out loud, the story is serviceable and does its job to carry the film along. But it needed the funny jokes and good humor to hold the film up, but it just doesn't have them."
    },
    {
      "rating": "7",
      "text": "Absolutely heartwarming. Jack Black's enthusiasm and thirst for life permeates the film.  More than anything, it's a fun movie with some truly touching moments.  For me to say that about an animated film is saying a lot, as it's not my genre of choice. It's right up there with the best of them."
    },
    {
      "rating": "9",
      "text": "An absolutely spectacular sequel. Kung Fu Panda 2 improves on everything the first one accomplished. The animation is nothing short of amazing, and the action scenes are much more dazzling. Additionally, the film is downright funny, even more so than the first. All this is well and good, but I what I enjoyed most about this sequel was its emotional resonance. The film journeys down some dark places, and explores Po's mysterious origins. It handles it very maturely, and the story is much more involving than the first. This is further proof that Dreamworks is perfectly capable of competing with Pixar. Kung Fu Panda 2 is a hit."
    },
    {
      "rating": "7",
      "text": "Tigress looks away, out of embarrassment and understanding, when she sees a miniaturized replica of herself, an action figure that the goose mistakenly believes his son had left behind while packing for Gongmen City. Knowing chuckles from her teammates break out. Just because a stark-raving mad **** with a genocidal streak is threatening to blow up all of China to kingdom come, it doesn't mean that the Furious Five can't poke fun at their exceedingly uptight friend, for levity's sake. True enough, Lord Shen means serious business. The cannon that he developed could be curtains for kung fu, but how can they not laugh at the appearance of the Tigress doll, and what it signifies to a panda bear who is old enough to breed, yet can't do anything about it, since he's the last of his species, purportedly? The Viper is also female, but even though interspecies love can and does occur with relative frequency, the tigress, with her mammalian(as opposed to reptilian) charms, probably wins by default. Mr. Ping, just like any parent of a teenager, is worried about his son's sex drive, so maybe it's actually a calculated move on the father's part to infantilize Po, therefore making him less attractive as a potential mating partner. In \"Kung Fu Panda\", the goose seems well-aware of his son's fantasy life. Sounding more like a henpecking mother than a father, the bird asks loudly, \"What are you doing up there?\" from the kitchen in their humble abode, when he hears suspicious noises emanating from the bear's room. The sound that piques his imagination is that of a prostrated panda with major weight issues, struggling to get up from the floor. From this most humbling of beginnings, things turn around real fast for this morbidly obese bear. Other than being a tribute to the \"wuxia\" genre, \"Kung Fu Panda\" may be the most inspirational movie about big people since \"Angus\". Later on in the first film, the battle of the bulge, a losing battle, the result of a gluttonous appetite, greatly undermines Po's ability to fulfill his destiny as the Dragon Warrior, as he eats Shi Fu out of house and home while training at the vaunted academy under his tutelage. Unfairly, the Furious Five take issue with the fact that their savior, the chosen one who will lead them into battle with Tai Lung, can't fight, let alone, get an unobstructed view of his toes. So prejudicial are their feelings toward Po's perceived weight problem, this insular group talks freely about their leader while he's within earshot, not realizing that to another panda bear, or a pack, Po is the right size. \"Kung Fu Panda 2\", however, delves into the backstory as to how a goose ended up raising a bear, and in the process, shows us that Po's ungainly weight problem is a matter of nurture, not nature. When Ping discovers the panda cub mixed-up with the radish delivery outside his noodle shop, the restauranter overfeeds Po, because, in all likelihood, he was fattening the bear up. The iconography is straight out of \"Hansel & Gretel\". As he eats, Po sits in a pot, the prelude to a date with the oven. In \"Kung Fu Panda\"(starring Jack Black, the David Carradine of \"yellow-voice\"), when Ping tells his son that the secret ingredient is \"nothing\", he's lying. The secret ingredient is animals. \"Broth runs deep in our veins,\" he says, meaning blood. Unbeknownst to Po, the goose makes him complicit to the enterprise of meat. It's as if Orwell wrote the script for \"Soylent Green\". Upon hearing this startling revelation, Po, in return, cracks the riddle of the sacred scroll, which enigmatically, turns out to be blank. Likewise, nothing. That is how the evil snow leopard interprets the document, reflecting as it does his own image of himself, which also denotes the attitude of the goose towards the furry creatures who inhabit the Valley of Peace, panda included. The sequel reminds us that Po belongs to the ethnography of animals, not bears, so he is fat, as defined by mainstream cultural norms. Lucky for this lowland community, the dragon warrior misinterprets his father, and fulfills his destiny. In the sequel, Ping adds tofu to the menu, whereas in the original film, he dismisses the very idea. Now that the goose uses Po's celebrity to promote the noodle shop, he can afford to go vegetarian. Po is still fat by non-panda bear standards, but the cachet of being the dragon warrior more than offsets those extra unsightly pounds. On the boat, on the heels of being humiliated in front of the tigress, the fairer Bengal finds Po struggling with inner peace, as he bangs his head against the mast. She tells him, \"The mast is not a worthy opponent,\" then offers him her open palm. \"I'm ready,\" the tigress says(read: romantic love is better than self-love). But a scared Po replies, \"I think I prefer the mast.\" After he takes down the ****, however, it's the tigress's turn to be shy. During some kung fu hugging, her body stiffens."
    },
    {
      "rating": "7",
      "text": "Kung Fu Panda 2 was pretty good and it's a lot of fun to watch. It's very decent, but it would be more better if the sequel will be much more hardcore and awesome at the same time, just like the first one. The 3D scenes could be fun and sometimes it's a little bit too much that it gets irritating with the fight scenes and the story, so we could take off our glasses and see it in 2D at least. I like those characters and they bring back more fighting styles since the last movie, but they updated just more. The story is cool and it tells that Po must fight the villain who will take over the world and destroy kung fu fighting ever. The animation is great and the sentimental moments gets me crying in the last scene, and the fighting scenes is very awesome. I enjoy to watch once again with those guys and it's not that too much like the original, but it's good."
    },
    {
      "rating": "8",
      "text": "While it has some tone issues and the narrative could be a bit more tight I’m willing to overlook that. Often we get lame, half-assed sequels. However, this film despite its issues is a good sequel that may/probably surpasses the original. It raises the stakes, gives us a better villain, and an epic movie. This franchise has two good films and hopefully the third one does just that (the ending implies that there is going to be sequel). If you liked the first one and are concerned that the sequel will suck don’t worry it doesn’t and even if you don’t like it as much as the first its still a good and enjoyable movie. This is one of the most epic, cinematic, and engaging films to ever come out of Dreamworks."
    },
    {
      "rating": "7",
      "text": "Had lots of fun with the Panda and his posse this time around as well. It is funny, heartfelt and beautifully animated.  Already waiting for the next installment :-)"
    },
    {
      "rating": "9",
      "text": "I loved the first Kung Fu Panda movie and loved this one too. It was funny but also serious at times too. I'm probably not in the intended demographic for the movie but I loved it all the same. A great one for the kids but also a film adults could quite possibly enjoy too."
    },
    {
      "rating": "9",
      "text": "I admit to being jaded with Hollywood's tendency to pump out sequels that amount to a pile of garbage for profit but was pleasantly surprised to find this a worthy follow up to the first Kung Fu Panda.  My wife tends to be even more critical of movies than I and still called this one \"fun to watch\".  We saw it in 3D and it made the action scenes even more entertaining.  All the elements that you enjoyed in the first Kung Fu Panda are here again and put to a new engrossing story line.  So sit back and enjoy the show.  I know I did."
    },
    {
      "rating": "7",
      "text": "Kung Fu Panda 2 is a good movie but I wouldn't call it better than the first. It has a lot more fighting and the story of Po gets more deep. All of this is positive but the movie has less funny moments, monments that grown ups can laugh too not only kids."
    },
    {
      "rating": "8",
      "text": "I think i enjoyed this more than the first part. The humor is at least as good. The visuals and animations are as dazzling as ever. The action sequences are pure awesomeness. The story is interesting and heartfelt in many parts.\r I am very much looking forward to the third installment in this excellent franchise."
    },
    {
      "rating": "9",
      "text": "The movie was good. I think it was better than the first one. It was funny, full of action, and had Jack Black was perfect for it. It showed Po's childhood and the ending was realy good. I cant wait for Kung Fu 3!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1"
    },
    {
      "rating": "7",
      "text": "it's a fun, entertaining, feel good movie. not as great as classic pixar movies that pull at the heart strings, but i wouldn't hesitate  to recommend watching this movie to others."
    },
    {
      "rating": "6",
      "text": "I came out of the theater with just as mixed feelings as I went into it with. While it definately wasn't as good as the first, it definitely held its own. Some stuff didn't work, or just felt like it had already been done to death in the first. This being said, it did have its share of laugh out loud moments. Additionally I really disapprove of their choice to make a third, as the strongly hint at the end of the movie. Not a good move."
    },
    {
      "rating": "8",
      "text": "I can already feel your ire, dear reader, that I cast aside other film candy (GWTDT, Drive, The Help, War Horse) and instead give praise to a cartoon sequel. But I encourage you to withhold judgment until you see the film. Yes, the story may be a tad predictable, but such is the state of the modern kung-fu movie. And the delight of Kung-Fu Panda 2 (unlike its more cutesy,"
    },
    {
      "rating": "10",
      "text": "i think this movie was AWESOME...I can't say which part is better but what really surprised me was that this one wasn't a flop....like most sequels are these days...WELL DONE"
    },
    {
      "rating": "6",
      "text": "I got problem with the script. Not so awesome. Not so bad.  Not so funny. Eye-catching animation. Pretty good score. Darker. The only animation lives on this movie is Lord Shen, thanks to great Gary Oldman."
    },
    {
      "rating": "7",
      "text": "Dreamwork never fails to produce. Kung Fu panda 2 can be said to be an extremely succesful movie given its brilliantly written storyline. Throughout the film, the story flowed well accompanied by stunning action. One disappointment though is that the film lacks enough good comedy as many are eiter childish or cold."
    },
    {
      "rating": "7",
      "text": "No where near as good as the first. This animation is excellent however, and the action is entertaining. Unfortunately, a subdued musical score and a lame antagonist bogs this film down more than it should."
    },
    {
      "rating": "10",
      "text": "A+ for pandas.A+ for cute humor.This movie really needs no introduction.  I mean, the fact that it involves pandas automatically gives it an A+, then the plot, the cast, the fun adds to it.  ;)"
    },
    {
      "rating": "9",
      "text": "best movie in current times. enjoyed a lot. neat narration and good direction. all together the best animated movie since 2 years. my vote for it 9/10. po rocks!!! all the best for the collections as it is going to be a blockbuster of the year"
    },
    {
      "rating": "7",
      "text": "Kung Fu Panda 2 is big, hearty and incredibly funny animation sequel. There's more at stake this time round with Po (Jack Black) and the Furious Five not only fighting to save China from the tyrannical Lord Shen (Gary Oldman), but we also delve into Po's mysterious past, and shed some light on why his father is a goose. The animation is still superb, and has clearly stepped up a level to deal with the more complex action set-pieces and a huge variety of beautifully rendered environments. Black seems to have found his ideal role in Po the panda, and the character remains endearing on his second outing. Angelina Jolie again impresses as the introverted Tigress, as does Hoffman's stoic Master Shifu (though his role is sadly reduced this time around). The all-star cast voicing the other members of the Furious Five (Jackie Chan, Lucy Liu, Seth Rogen and David Cross) thankfully have a little more to do than in the first film, Gary Oldman adds another great villain to his repertoire as resentful, power-hungry **** Lord Shen, and Michelle Yeoh has fun as an elderly goat soothsayer. James Hong is once again the best thing in the film as Po's dad Mr. Ping - his relationship with Po is tender and believable, and Hong manages to perfectly balance the elements of comedy and tragedy in his character. Though there's more scope for genuine drama in this film than in the first, it has lost a little of its charm in this second outing, and though it's only a couple of minutes longer than the first installment, it feels considerably more so as the plot does drag a little in places. While the exploration of Po's history is good for character development, it does at times cause the main story to lose momentum, a problem the first film, with it's much more linear plot, never suffered. I also feel the film's finale takes the whole \"inner peace\" message behind the story's martial arts elements a little too far, and the very final shot of the film is simply a narrative cop-out designed purely to set up a sequel. Even so. Kung Fu Panda 2 is a thoroughly respectable sequel that often equals and sometimes even surpasses the successes of its predecessor. It looks gorgeous, is fun and action-packed, with some good jokes and nice emotional kicks."
    },
    {
      "rating": "9",
      "text": "Gags and antics aside, this is a film about self-actualization. It succeeds at being stand-alone and is fun, fast-paced and instantly enjoyable. Watch this with your daddy."
    },
    {
      "rating": "9",
      "text": "I was really surprised by this.  Everything was very well done, from the humor to the beautiful animation. I just wanted to mention two highlights.  One is the villain.  The villain can make or break an action film, and here, the white **** Shen, is truly inspired.  He is stylish, funny, and a thematic foil to the hero, Po.  The other point is the emotional heart of the film between Po and his father.  Their scenes together walk the line between humor and heartbreak perfectly.  Well done to Dreamworks."
    },
    {
      "rating": "10",
      "text": "This was a great addition to the original Kung Fu Panda. Many questions to the first filmed are answered by this one! Also, more diverse and interesting characters were in this one, without rehashing old characters that aren't needed."
    }
  ],
  "recommendations": [
    "kung_fu_panda_3",
    "kung_fu_panda",
    "thor_ragnarok",
    "indiana_jones_and_the_temple_of_doom",
    "the_forbidden_kingdom",
    "how_to_train_your_dragon_2",
    "rango",
    "thor_the_dark_world",
    "avengers_age_of_ultron",
    "guardians_of_the_galaxy",
    "the_adventures_of_tintin",
    "the_croods",
    "how_to_train_your_dragon",
    "incredibles_2",
    "the_lego_batman_movie",
    "bumblebee",
    "transformers",
    "jack_the_giant_slayer",
    "the_lego_ninjago_movie",
    "megamind",
    "shang_chi_and_the_legend_of_the_ten_rings",
    "the_suicide_squad",
    "puss_in_boots_the_last_wish",
    "hercules",
    "hotel_transylvania_3_summer_vacation"
  ]
}