{"id": 823, "title": "Kung Fu Panda 3", "starring": ["Jack Black", "Bryan Cranston"], "runtime": 95, "genre": ["Action", "Adventure", "Animation", "Comedy", "Family"], "description": "Continuing his \"legendary adventures of awesomeness\", Po must face two hugely epic, but different threats: one supernatural and the other a little closer to his home.", "releaseYear": "2016", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/oajNi4Su39WAByHI6EONu8G8HYn.jpg", "categories": {"plot": 7.9324324324324325, "acting": 7.96969696969697, "ending": 8.285714285714286, "soundtrack": 9.0, "cinematography": 10.0, "familyFriendly": 8.0, "funny": 8.027777777777779, "action": 7.84}, "reviews": [{"rating": "9", "text": "So much fun. Hilarious and beautiful at the same time. Better, tighter story than The Force Awakens by the way. Great voice acting from the entire cast, and the themes and messages of the story are beautiful, well written and well delivered."}, {"rating": "7", "text": "Definitely another visual spectacle but in terms of narrative arc and engagement with characters, I just didn't feel as if it had as much oomph as the first two films. Still enjoyable though."}, {"rating": "8", "text": "Kung fu panda 3 is not the best in the series, but it is still a conclusion that is to be remembered. It is not as good as the first 2, but like I said, its pretty good. Po is back, and still as funny as ever. Po finally meets his dad, who later takes him to a secret panda villiage. Meanwhile, a new villian named kai has returned to defeat po. The animation is still as good as ever. New characters such as po\"s father, are greatly acted as well as funny. I do admit there are some things that are repetitive to the other films, but they are few. The action is still awesome, bringing moments that you might find, surprising. Kung fu panda 3 is a great conclusion to the series, bringing action, humor, and most of all, heart. That is the secret ingredient."}, {"rating": "9", "text": "An excellent movie for all ages. Kung fu panda manages to be exciting, funny heartwarming and much better kid movie fare than what's being offered today. The vocal performances are top notch the score is beautiful and kai is a very intimidating and powerful villain. Right up there with lord shen. This was way better than I  expected because movies fail at number 3. Not this one. Give this movie a try. I don't think you will be disapponinted"}, {"rating": "8", "text": "I didn't go into this movie expecting a lot. I mean, who could be? It is the third movie in a franchise about a Panda who learns Kung Fu. In fact, the very idea that this film series would reach a third entry would be an unbelievable feat. But a funny thing happens in the movie and the series, and major props need to be given to lead character Jack Black. I don't think this series succeeds without him. He brings a heart yet goofiness that you can't help but feel as the movie progresses. And just like this series, which I didn't think would work, this film proves me wrong.\r Now that isn't to say that Black is the only reason this series works. The story is fresh in a world filled with reboots and overdone cliche stories. This film is a classic homage to the hallmark Kung Fu films of the 70s, where good triumphs over evil and the main character, never wavering and true to himself, comes out on top. And Po does just that. When an ancient villain comes back from the spirit realm, Po finds himself targeted in Kai's quest for ultimate power. During all of this, Po's birth father shows up to find and reconnect with his son, as well as take him to his hometown so he can meet all of the other Pandas. This arrival of the birth father leads to a confrontation with his adopted dad, who feels worry that he will lose his son to his birth father.\r This storyline hits a chord with me. I think a lot of us nowadays are either children of divorce or know someone who is. The idea of having a new extended family because of a stepfather or adopted father isn't a foreign one to children. Yet we don't get a lot of stories touching on that, or if they do it's sometimes horror stories about mean step families. This is a tale that teaches acceptance and the good things that can come from having a larger than usual extended family. A scene towards the end of both fathers holding out hope for Po and working together sends the message home that you can have more than the \"traditional\" family and gain something from it.\r If I had to find a negative for the movie, it would be the size of the cast list. The cast is good and they all do a good job, but it feels like there is too much going on at times for all of these characters and they become wasted in the story. I wish they would have simply had a few sit this one out instead of setting the table for all of them and then pushing so many to the fringes.\r The animation and story are crisp, and the voice acting is good and over the top without feeling fake. I don't know if the actors had much interaction with each other but it certainly felt as though they had a chemistry and didn't just record lines in a booth one rainy day and then move on, never to consider that job again. JK Simmons and Bryan Cranston were great, if not under noticed as usual. Jack Black was perfect for the character as previously mentioned, and the movie never lingers too long or wastes a moment. This movie is the perfect Sunday movie where you can take the family, laugh, learn something, and leave feeling good about yourself. I cannot wait to see what the filmmakers come up with next in this series, and hope it can maintain this level of storytelling and casting."}, {"rating": "8", "text": "I thought this movie was going to be a lousy sequel money grab but I was going to take my son anyway.  Turns out the movie was pretty good and I laughed through a lot of it.  It was worth the money."}, {"rating": "8", "text": "A brilliantly animated, heartfelt, exciting final chapter(?) to a great series. Jack Black leads an extremely talented voice cast bringing to life their colorful and well-realized characters. The animation is top-notch, balancing computer generated images with 2D backgrounds in stunning action scenes and other landscapes throughout the film.\r Kung Fu Panda 3 is a thoroughly entertaining film with breathtaking visuals, thrilling action scenes, and memorable, fun characters. See it."}, {"rating": "8", "text": "This time no Skadoosh, but Chi time.\r Three successful films in an animation franchise is a great achievement and according to the production house, yet another 3 films are going to hit the screens in a decade of time. So if you are an animation fan, especially 'Kung Fu Panda' and Po's fan, brace yourself for the future treats. This film was amazing. After two wonderful adventures, now this story has calmed down a bit with simplicity. Visually, it was spectacular with all those fight sequences, but the story was quite dramatised with enough comedies and then the final battle to conclude the 3rd installment on a high note.\r I think it was a well designed storyline in advance keeping in mind 5 to 6 films, that's why the flow was very smooth between all the three with those flashbacks placed at the right place. This particular part belongs to Pandas, the furious five were absent in most of the film, but good to see the return of Oogway. The master Oogway comes at the beginning and then during the end, though very happy for presence as he's my favourite character in this franchise. He's not a big player, but like Yoda, he's amazing and tell me who won't like him.\r This time no Skadoosh, but a new villain with a battle fought for a new powerful thing called Chi. Now Po got a promotion, so I'm very excited for the next film for how it will going to turn out. This is a beautiful family film and must not miss it. All the cast was returned from the previous two and a few more new were recruited and it is set in a new location for the most of the narration like the most of the animations has done in China. After all made in China is not so bad.\r 8/10"}, {"rating": "9", "text": "Good conclusion to previous series. This is a good example of what modern movies should be - light, dynamic, colorful, will good music and good plot. Me and my girlfriend really liked it. Recommended for family watching."}, {"rating": "8", "text": "Not my favorite one in trilogy, but it's definitely worth watching and clearly enjoyable animation) Loved new characters, jokes were quite fine, i even laughed a several times, but what my favorite part of all the Kung Fu Panda movies is the atmosphere of an old school martial arts adventure movie) And it is here, as always! But still, I think the villain could be better - the threat of that peacock guy and his army from the 2nd felt much more real, plus he was disclosured much better as a character, in my opinion.\rBut generally, Kung Fu Panda 3 is gonna bring a lotta joy to the fans of the series :)"}, {"rating": "10", "text": "Both kids and adults will love this, because Kung Fu Panda 3 is an amazing movie. With a wonderful cast (Bryan Cranston Angelina Jolie, Jack Black, and everyone is superb), beautifully animated scenes and amazingly sequenced fights, a villian who's not too serious but manages to make the movie very dark at points, plenty of goofy Panda action, and the superb use of \"I'm So Sorry\" by Imagine Dragons in said scenes, Kung Fu Panda 3 is the superb black-belt of the animated genre."}, {"rating": "10", "text": "it was okay i enjoyed it. like one of the other reviewers said the others ones where better.  it keep my attention to see what he messes on.  yea there was a lot of laughing on my part."}, {"rating": "8", "text": "Kung Fu Panda 3 is a good film, I genuinely enjoyed it and it was a good movie going experience.  It had good characters, a decent story and some really great animation fight scenes, plus there was some really good 3D in it.  It just doesn’t quite live up to it’s 2 predecessors and while the humour is pretty good it does feel like it is pandering more than usual, though that’s not to say there were some really good laughs in the film and in reality this is simply the weakest of a really good trilogy.  It’s well worth a watch especially if you have kids, and judging from my screening the adults will also get something out of it.  I would say, if you enjoy martial arts films, see all three and don’t be put of by all three of these films horrible advertising campaigns which don’t show off what the quality of the films are at all.  It’s probably worth picking up all the supplementary spin off material as well, including all of the secrets trilogy and the holiday special.\r Is Kung Fu Panda 3 as good as it’s previous two movies, not quite, but by no means is it a disappointment."}, {"rating": "8", "text": "Our beloved and adorable Po is most welcomed to return in this ridiculous, playful yet beautiful third installment. The entire animation has exactly the same formulaic plot as the previous two episodes - a villain comes out of no where, the journey in preparing to fight and at the end only the main character can take down the big bad fella; adding on a whole bunch of cheesy moments but it is hilarious and entertaining thanks to Jack Black's well commitment. The Kung Fu adventure is absolutely beautiful and impressive, thanks to the stunning visual effects which heavily covers the Chinese cultures, settings and backgrounds; also the scores by Hans Zimmer who perfectly composes by mixing every single Western tracks with Chinese musical instruments. This family-friendly adventure might be fun without any great moral values as in Disney and Pixar animations but the reunion of this chubby panda with his biological father and the conflict with the adapted parent does generate some important messages that is worth to learn."}, {"rating": "10", "text": "this was a total blast my entire family enjoyed it filled with fun and huge laughs from the start i would take my family to see this agin any day any time they asked me too proves u can still make a good clean comedy that will entertain the entire family go see it u wont be sorry u did trust me lovely movie"}, {"rating": "7", "text": "It doesn't have the emotional impact the first two movies had and it treads very familiar ground, but Kung Fu Panda 3 is a lot of fun with beautiful animation, great characters, exciting action, and a lot of enjoyment overall."}, {"rating": "8", "text": "Even as a fan of this franchise i was very surprised with this movie especially because of its date release. It's genuinely funny, dynamic and heartfelt with a wonderful animation. It's not as good as the other two instalments because its theme is almost a rehash from the other two and i think again some characters were a bit wasted. But overall it's a enjoyable and familiar one. Po never disappoints ;)"}, {"rating": "8", "text": "The dragon warrior finds his family and returns with more verve and visual dynamism than in the previous installments.\r Visual credulity begins from the moment of opening the film where Po Panda climbing endless stairs to make the logo of Dreamworks. The integration of new characters is accompanied eastern  aesthetic environment and good jokes of the panda to make a family film full of action and adventure for boys and big. There is an animation and beautiful photography. I have fixed me that animation films of \"Kung Fu Panda\" is not fully detailed in their funds, but a blue sky sea water or a simply pink sunset is most magical and deeper than a location details (\"Zootopia\"), this buoyant and sophisticated effect can be seen in the opening bout.\r This small and perhaps unenforceable detail is one of the great pleasures of Jack Black's films. Of the few successful projects of \"Dreamworks Animation\" \"Kung Fu Panda\", \"Shrek\" and \"Madagascar\" have been the face of the Studio, although these two latest already they have no chance, the bear panda still has more to give. Like its predecessors (2008-2011) this third entry is full of brilliance and visual warmth. The story doesn't feel loose and with its good development pervades easily with the audience.\r Kai (JK Simmons) has returned for revenge, then that teammate had apparently betrayed him. For this the ox with irritated eyes steals the essences of life of teachers more powerful of the Kung Fu and unfortunately in his list appears Po (Jack Black). Meanwhile on Earth, the master Shifu (Dustin Hoffman) headquarters his throne to the funny panda nothing more in order to find who is the panda. Po finds his lost father and embark on an expedition to a habitat full of mammals. There he will have to learn and teach his family martial arts to eventually fight with the furious animal.\r Directors Alessandro Carloni (DreamWorks Animation) and Jennifer Yuh (2 \"KFP\") create a fun and interesting story where the legacy made previously is not sacrificed, instead they emphasize more the possibilities that has the franchise for a fourth part. The history of parents is loaded with funny jokes, but its main function is to generate the dramatic counterpart in the film. Therefore the central story is well established and the moments of action and adventure are excellently executed, illustrated as a masterpiece of animation.\r \"Kung Fu Panda 3\" is clearly just fun. Perhaps it feel as a part that was unnecessary to do, since this franchise not weaves the story of its characters as Disney's sagas, Dreamworks recreates different stories in his films, a double-edged weapon. \"KFP 3\" has not the load dramatic that had \"Toy Story 3\"or \"Monsters, Inc\" but its brightness and comicality both visual and auditory create a nice film and that truly breaks expectations."}, {"rating": "10", "text": "it is the best movie in the kung fu panda franchise. it had it's jokes.but the highlight is were po basically turns into a freeeeeking deity. OMG that is awesome"}, {"rating": "8", "text": "Enjoyable and lovable, this Kung Fu Panda installment has captured the hearts from its previous installments and calls it a day. You have better not miss this, my pandas!"}, {"rating": "8", "text": "Kids will love the movie. There are pandas for everyone. And the story is good, but not as good as the first movie. I think they HAD to make the trilogy. Animation is good, too. This is a movie to watch on a lazy sunday."}, {"rating": "10", "text": "I was 13 years old when I watched Kung Fu Panda 1 for the very first time. 16 with Kung Fu Panda 2. Now, I'm 21 years old. Not a child anymore but it didn't stop me from wishing to see more!\r And now... after 5 long years of waiting, Kung Fu Panda's conclussion is finally here. Amazing story, amazing characters, soundtrack, action and humor... is simply beautiful. The ending is also great but it doesn't feel like there could be a fourth part, although I would love to watch it.\r The best third part Dreamworks has ever done.\rThank you so much Dreamworks Studios and its team for making this possible!!\r I really hope that's not all."}, {"rating": "8", "text": "This movie is very funny , very entertaining .\rIt has details I did not like .\rThe characters well done.\rAnimation very well done.\rEveryone will like this movie .\rGo and see it ."}, {"rating": "8", "text": "Kung fu panda 3 is the best film in the series. The film has a lot of humor like the previous titles. Also, it's a great animation with a understanding story."}, {"rating": "7", "text": "It's a good movie. It delivers in many of the same ways the first two movies did. Good comedy, good action sequences, good character development, a little bit of philosophy, soundtrack, animation, everything is good there, and it continues the story from the first and second movie.\r -It does seem to reuse a lot of plot elements and jokes from the first two movies though, and the plot is beginning to feel formulaic, enough to the point where it is noticeable. But it brings a few new ones to the table.\r -It seems one of the more light-hearted entries in the saga. If you liked the second one (I did) where it took itself a tad more seriously (while still having some comedy in it) you might be offset by the comical tone.\r +The spirit world is cool.\r +I really liked seeing both of Po's fathers. (Adopted and Biological and their development and interaction.) Was done very well in the movie. (That shouldn't be a spoiler, it was in the trailer.)\r To me it sort of feels like I'm watching The Legend of Korra KFP. You can tell they really tried to make this spectacular, and live up to what came before it, but it's just good. Not amazing, but good. If you liked the previous movies and want to see the next installment of the story, see it. If you don't really care for the franchise, then don't."}, {"rating": "10", "text": "This movie was a great flashback to my childhood! An 8 year old series that I first watched when I was 8 myself, and I'm now 16 has come down to this and it was a very enjoyable movie to watch.\r The animation was beautiful and the storyline was well created and funny. I'd highly recommend it to people of all ages! Great job Dreamworks! All the hype for number 4."}, {"rating": "6", "text": "For a fan of the series, this movie is quite awkward. The interactions between the characters, the fight scenes, the ending are all quite awkward. If you compare the fight scenes from Kung Fu Panda and Kung Fu Panda 2 to this movie, there is less humor and more drama. Po is in a state of bewilderment (I won't say what for) for most of the film. The movie does tie sections of Kung Fu Panda and Kung Fu Panda 2 together, but does so abruptly rather than cleanly. The villain character's personality and backstory is less sophisticated than the one in Kung Fu Panda and Kung Fu Panda 2 and their dialog doesn't tie in with Po's humor as well. Overall, Kung Fu Panda 3 can be your answer to questions from the first two films, but don't expect the answers to be sophisticated or fluent throughout the movie."}, {"rating": "8", "text": "Kung Fu Panda 3 proves to be a threequel that was worth the five-year wait. The heart-felt relationship Po has his family and his next Kung Fu lesson make this story feel like a continuation of the previous two films that was planned out. While some character beats and story beats feel familiar the relationship Poe shares with others, slower character driven pace, and unique message make the story feel fresh. The gorgeous animation with stunning backgrounds and a jaw dropping fight in the spirit world make this a visual spectacle that deserves to be seen in theaters in 3-d. Well realized characters, improved visuals, and a heartfelt story make for a satisfying conclusion to the Kung Fu Panda trilogy"}, {"rating": "10", "text": "1 and 2 were great. The art direction, computer graphics, shading and colors were top notch. Imo this was the best movie in the franchise. It was quite immersive for me.."}, {"rating": "7", "text": "Stylish, entertaining and with a positive message, Kung Fu Panda 3 is another great installment in the Kung Fu Panda franchise. The voice performances, visuals and plot are good as well."}, {"rating": "8", "text": "It's the weakest of the series, so far, but that doesn't mean it was bad. The film still stays true to its style. Frankly, I believe everyone should watch the Kung Fu Panda series. It will give everyone a chance to ask themselves who they really are and who they're meant to be on this earth, which is especially important for people training in martial arts like me. KFP3 is still a great addition to the series, and I'm praying that this will be the first multi-film series where all the movies are well-made."}, {"rating": "9", "text": "Kung Fu Panda 3 is directed by Jennifer Yuh Nelson and Alessandro Carloni. It is written by Jonathan Aibel and Glenn Berger, and features the voices of Jack Black, Angelina Jolie, Dustin Hoffman, J. K. Simmons, Jackie Chan, Lucy Liu, Seth Rogen, David Cross, Bryan Cranston, Kate Hudson, and James Hong.\rI really liked Kung Fu Panda 1 and 2 and I was super excited to see where they're going with the third one. If you've seen the the last two movies on this franchise, you pretty much know what you're getting into, very well animated action set pieces, character moments and a prophecy.\rIn this movie, Po, the legendary dragon warrior, reunites with his long lost biological father. When a new threat arises from the spiritual realms, he then has two challenges in front of him, one supernatural and another very different, but much closer to his heart.\rJust like the last two, I really liked this movie from start to finish. The animation is glorious but what makes these movies as good as they are, is the character moments that make us feel for them. When they're fighting, you get thrilled at the amazing sequences filled with epic moments and great fighters, when they're not fighting, you're usually either laughing a lot, or feeling a lot. It knows when to be funny and when to get serious, and this is very important in such a movie. Sure, all three Kung Fu Panda movies are pretty similar in themes and emotion, but they're all great and build upon one another nonetheless.\rThe villain Kai, voiced by the great J. K. Simmons, is truly a threat to the world of Kung Fu. He makes his presence known by doing great fights, and doing damage that no previous villain could do. Even though personally I like the second movie the most, and the villain Lord Shen (voiced by Gary Oldman) is still overall the best in my opinion, Kai is also very memorable and a strong villain in general. The score, composed by Hans Zimmer is unforgettable and really good, especially the Kai theme that helps him be even more mesmerizing and threatening.\rI loved this movie, not as much as the second one, but on par with the first one. Overall they're all just really entertaining and memorable animated movies, that are well directed and beautifully written."}, {"rating": "10", "text": "Kung fu panda 3 is 3rd and likely final from series and is one the best and one the 3rd film in a series and its one of the best animated movies j*jjjjjjjjjjjjjjjjjjjjjjjjjjj*jjjjjjjjjjj*jjjjjjjjjjjjjjjjjjjjjjjjjjjj"}, {"rating": "7", "text": "Kung Fu Panda 3 is definitely the weakest movie in this trilogy, but that shouldn't put you off from seeing it. The plot itself is eerily familiar to the first one, and I felt at times I was just watching a retelling of the first movie, right down to the villain who's motives are cliche and only has a few sentences of exposition to explain their back story. To be honest, some of the plot points used in this movie are quite lazy, to the point that it became predictable. Fortunately, the movie doesn't spend a lot of time focusing on those particular plot points. Some of the humor is pretty funny, but I felt as if this movie was trying to throw everything but the kitchen sink at the audience to milk every laugh they can get. While I found most of the jokes funny, when they miss the mark, they miss the mark big time and sometimes upset the pacing of the story. Needless to say that because the previous two set the bar so high, it was a little disappointing.\r However, by its own merit, this movie is still worth watching. The traditional Kung Fu Panda movie has excellent animation, a well composed soundtrack, and an excellent cast; and this movie is no exception. Although I said previously that some of the jokes miss the mark badly, there are plenty of jokes still that got a good laugh out of me, even the ones that they have used before. So overall, it's a decent movie, though could have done better."}, {"rating": "9", "text": "I ADORED this movie because I found that instead of watching the repetitive and often boring kung fu, I learned more ABOUT Po. The reason I gave it a 9 instead of a 10 is because the jokes are childish might only appeal to the 8 and under group, which I get it was made for, but consider the rest of the audience Dreamworks, thanks."}, {"rating": "10", "text": "Kung Fu Panda 3...an outstanding movie that has proven to become an AWESOME trilogy to the franchise! Recently, I have been seeing some pretty bad movies that weren't good standard. It was as if as time flies, the quality of films get worse and worse. By just when I thought that good movies had gone extinct, Kung Fu Panda 3 shows up! I absolutely loved the first two films; they just blew me away! Po seemed like the perfect hero and I thought that the storyline couldn't get any better. However, Kung Fu Panda 3 fulfilled its prophecy by providing an epic new adventurer for Po! All of the Kung Fu Panda movies are all awesome and none of them is enter than the other. That is why this film got a 10...and let's hope that Kung Fu Panda 4 amazes us even more!"}, {"rating": "10", "text": "This film is just great! One of the best movies that I've watched and the best of Kung Fu Panda movies!\rThe plot and the history..IT ALL! IT'S BEAUTIFUL TO WATCH! hope Kung Fu Panda 4 will be released!\rNice job mate!"}, {"rating": "8", "text": "I love it when an awesome film series develops into a well formed trilogy. Obviously not the best of the trilogy(the second one was my favorite), but still a pretty good one. I like how in every film they give Po a new challenge to overcome, all the while keeping his previous knowledge intact. And the villain was badass in this movie too, he just keeps on turning masters into zombie versions of themselves, and the scene where Po does the wooshu finger hold on himself to send Kai back to the spirit world, I mean you know he's going to be fine, but still, it had me worried for a bit. I loved watching J.K Simmons in Whiplash a couple years back, and I just love him more for giving us Kai."}, {"rating": "10", "text": "With an amazing cast, beautiful animation and jokes that make your stomach hurt from laughing,\rKung Fu Panda 3 enriches the legacy of it's predecessor's. Although I still prefer Kung Fu Panda, this 3rd part of the story about our favorite panda is nothing short of perfect."}, {"rating": "5", "text": "Es una película que no logra superar a las anteriores, espero no salga una nueva."}, {"rating": "10", "text": "when I saw the first trailer, not excited me so much, I was more waiting Ratchet & Clank and Zootopia. but in December through February, I gave more chance to this movie. when I went to see the movie, I loved the animation, it looked very real, the characters gave me laugh. MUSIC WAS EXCELLENT, especially the \"Dragon Warrior\" in the minute 1:21. the new villain, Kai, I liked, although I felt bad for him, because he failed to get the chi, lol. this film is excellent, much better than kung fu panda 1 & 2. undoubtedly is excellent film. hopefully kung fu panda 4 to be much better."}, {"rating": "9", "text": "I was amazed at the visual neat movie, great fight scenes, with his agile narrative, making fun for the whole family. It is difficult to say where the franchise will while maintaining quality."}, {"rating": "7", "text": "I'm a major Kung Fu Panda fan and personally believe it's the best Dreamworks franchise. The 1st film was surprisingly good and the 2nd was even better with a more emotional story and lush animation. This 3rd film is good, although not as good as the first two. The best aspect of Panda 3 is the animation. It's beautifully animated with great detail, fluid motion, colorful backgrounds, and has very well choreographed fight scenes. The 2D animated backstory was a nice touch as well. The story is a nice conclusion to what started in the second film as it perfectly balances the comedy and drama out. The world is expanded into new places that keeps everything fresh and new. However, there are a few issues. Considering that Po meets his real dad for the first time and now has two dads; this is handled in the safest way possible with little conflict. Since there are so many new characters; this means old ones like The Furious Five have little screen time. In addition, many of the new characters like Po's dad, Mei Mei, and the villain Kai are rather bland. Overall, Panda 3 is a fun and beautifully animated film that nicely expands the world of Kung Fu Panda and has a satisfying conclusion. Although it's rather forgettable and not as daring as the second film was, Panda 3 is a fine movie."}, {"rating": "10", "text": "With a great cast, an amazing score by Hans Zimmer, great new characters, beautifully animated, an overall sense of fun, and with the heart and humour of the previous films. Kung Fu Panda 3 is one of the best 3rd instalments in a series on films, and right up there with some of Dreamworks's best films like How To Train Your Dragon and the previous Kung Fu Pandas."}, {"rating": "8", "text": "Kung Fu Panda is yet another solid entry in the Kung Fu Panda film series. It should be noted that while it’s subjective, my opinion is that Kung Fu Panda 3 is ever so slightly the weakest of the franchise, but that’s not a knock on the film. Kung Fu Panda 3 is often funny, beautifully animated, and features great characters. This is another great animated film for the entire family, that will surely delight people of all ages.\rThe tone of Kung Fu Panda 3 is a somewhat silly one, much like the other Kung Fu Panda films, however it does a good job of balancing mature themes with silly humor. The film also does a good job of balancing both subtle and witty humor with more bombastic and silly humor. The humor is bolstered by the terrific voice acting of the entire cast, which is as per usual great. Many times throughout this film I found myself laughing hysterically.\rAnother impressive element of the film is the amazing animation in this film. It may seem like every animated film features beautiful animation, but the animation in this film is truly amazing. Another impressive element of the animation is the action, which in an animated film may not seem like something to watch for, but the action sequences in Kung Fu Panda 3 are amazing. Many times watching this film the animation is so good it looks real, which is in it’s own right an amazing accomplishment.\rThe film’s pacing is great, but what’s even better is the character development. With a story that isn’t the strongest, the characters keep the film entertaining. Besides the villain, a character who feels like a forced conflict thrown in just to give the film drama, all of the characters in this film have some kind of development. Many of the characters are relatable, which helps the audience care about them. With characters that the audience can relate to and root for, the consequences of the film feel even heavier.\rIn Conclusion Kung Fu Panda 3 is a great fun film for the entire film with a little bit of something for everyone. The film is gorgeously animated, features well developed characters, great action sequences, good voice acting, and a terrific sense of humor. Despite the weak villain, occasionally silly tone, and some cliches the film is still very enjoyable. If you have some young kids take them to this film you’ll all enjoy it."}, {"rating": "10", "text": "I don't give out 10s willy nilly. This film is simply incredible. Pitch perfect pacing, an amazing job by their vocal cast, better animation than the last 5 Disney/Pixar films combined. Above all a simply perfect story that not only manages to be interesting, funny, character driven and above all exciting, it manages to fix some clear problems with the first Kung Fu Panda. Kung Fu Panda is not on it's way to being the kind of film trilogy you see a handful of times in a generation, it's already there."}, {"rating": "6", "text": "The Kung Fu Panda film franchise is great overall, but with this one I felt they (producers/writers) were more preachy than before. Let's first examine the secret panda village, which was lazily modeled after the Shangri-La from James Hilton's \"Lost Horizon\". Not much diversity there, only pandas, but it was paradise so that's a cultural message of homogeneity being more advantageous - and that's, um, un-American. And then there's the bio-father and adoptive/step-father awkwardness which resolves with their teaming - so there's another preachy moment about how multiple parents should partner rather than compete. And then in the end, Po doesn't prevail due to his own inner strength but the strength derived from the combined spiritual (ugh) efforts of his family and friends. I didn't see a producer credit listed for Hillary Clinton but jeez, how \"It Takes a Village\" obvious can you get?!  And finally, Po does the Neo into Agent Smith possession thing from \"The Matrix Revolutions\" - no messaging there, just another example of cinematic plagiarism. I think we all would prefer more entertainment and less \"cultural messaging\" (and plagiarism) from the cretins in Hollywood."}, {"rating": "4", "text": "Kinda dumb and entertaining in fits and spurts, here and there, but none of the coherent story and satisfying plot of the original movie. Tries very hard to strike a sentimental, warm and fuzzy feel, but it comes off too much like a disjointed in-school cartoon to teach first graders self esteem by being themselves. Like a stereotypical Chinese meal, leaves you hungry for more substance and not very filling."}, {"rating": "10", "text": "When they told you Citizen Kane was the Citizen Kane of cinema they didn't know that Kung Fu Panda 3 was on its way to theaters THIS JANUARY. This movie is"}, {"rating": "4", "text": "Just mediocre.\rIt was a mediocre plot, mediocre fights, mediocre characters, although animated quite well, it was basically the installment nobody wanted, yet they did it anyways, it was just so predictable, the characters were bland and unintresting, extremely cheesy. I'm not panning it just because the animation was, as I said earlier, very well done, but I'd just rather watch the first movie (the only one that was actually decent, it's a 6/10)\rRecommended for fans of the series and maybe for parents that want to take their kids, but they won't enjoy it much."}], "recommendations": ["kung_fu_panda_2", "how_to_train_your_dragon_2", "how_to_train_your_dragon", "the_incredibles", "the_adventures_of_tintin", "shang_chi_and_the_legend_of_the_ten_rings", "kung_fu_panda", "atlantis_the_lost_empire", "spider_man_into_the_spider_verse", "the_croods", "big_hero_6", "indiana_jones_and_the_temple_of_doom", "my_little_pony_the_movie", "the_lego_batman_movie", "onward", "doctor_strange", "rango", "the_forbidden_kingdom", "toy_story_4", "rio_2", "avengers_age_of_ultron", "cars", "super_8", "bumblebee", "thor_ragnarok"]}