{
  "id": 3314,
  "title": "La La Land",
  "starring": [
    "Ryan Gosling",
    "Emma Stone"
  ],
  "runtime": 129,
  "genre": [
    "Comedy",
    "Drama",
    "Romance",
    "Music"
  ],
  "description": "Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in dingy bars, but as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uDO8zWDhfWwoFdKS4fzkUJt0Rf0.jpg",
  "categories": {
    "plot": 9.2,
    "acting": 9.166666666666666,
    "ending": 9.055555555555555,
    "soundtrack": 9.384615384615385,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 9.5,
    "action": 9.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "After watching this film at the Chicago International Film Festival, my original plan was to wait until closer to the film's actual release date to give my thoughts on it. However, after sitting with it for two days, with the images and sounds still sweeping through my mind, I cannot help myself. I will be as vague as possible, because I do not want to ruin the experience of seeing it for the first time, but I have to talk about it.La La Land, as it has been advertised, pays homage to classic movie musicals. Not only does it visually allude to films such as Singin' in the Rain and The Band Wagon, but it also preserves the upbeat, wondrous tone of those classics. There is something wonderful about seeing this tone and style recreated for a modern film. Cynicism and pretentiousness are completely absent from this film, and nostalgia and joy take their place.But calling La La Land a terrific recreation of the classic movie musical is selling it short. Like director Damien Chazelle's previous work, La La Land has much more going on narratively than the movie may lead people to believe. On the surface, this is a love story about two artists trying to make their ways in Los Angeles. However, this framework is deceptively simple.La La Land forces us to think about the realities of personal relationships and artistic endeavors. It explores the excitement of our dreams, the hardships of pursuing these dreams, and forces the audience to question the importance of both. Fortunately, Chazelle never looks down on the audience with these ideas. They are not presented in a heavy handed manner, and he never forces you to think a certain way.On top of its thematic richness, La La Land has one of the best understandings of film as a storytelling medium that I have seen in recent years. On the surface, it is the most technically astounding. The cinematography is stunning, and the soundtrack is beautiful. Even better is that both the visuals and soundtrack are never used in a way that is shallow or uninteresting. La La Land has an understanding of how to tell a story visually. It understands the power of sequencing, the power images can have on the emotional impact of a story, and the way in which these images simultaneously indulge our fantasies and remind us of our humanity.In other words, for me, it embodies everything that I love about movies.There are instances that everyone can recall in a cinema where we have felt what I like to call \"movie magic.\" These are evoked by the films that completely absorb us into its world, and movies that have a lasting, personal impact on us far beyond the theater. They are the films that we hold as the pinnacle of what makes watching movies so great.La La Land is one of those movies.During its 128 minute running time, the only time I wanted to look away from the screen was to turn to the people around me and check and see if they were experiencing the same kind of magic that I was. I can affirm that everyone I saw in my theater was.La La Land is a masterpiece. It is not only the best movie of 2016 so far, but also possibly one of the best of the decade. It's spectacular, stunning, moving, and absolutely magical."
    },
    {
      "rating": "3",
      "text": "I do like musicals, but I didn't like this one.  It's been a long time since I walked out of a movie, but I really wanted to today.  I stayed to the bitter bitter end.  I've never cared for Ryan Gosling or John Legend, and I still have no use for either. The whole movie fell flat. The opening scene was not entertaining. Fred Astaire and Gene Kelly and Donald O'Conner must be rolling in their graves and rolling their eyes at this one. Best movie of the year? You cannot be serious!"
    },
    {
      "rating": "2",
      "text": "Since we're over 60, my husband and I have seen a few movies. This is 2nd one we have ever left and the only one where he has ever fallen asleep. We thought it was like a tired, old, truly corny Hallmark Hall of Fame set to music. I was a bit more patient and got all the way to the hunt for the Prius...really?  Gee, I think I know the ending. ; By the way, Hallmark has become a bit more edgey"
    },
    {
      "rating": "0",
      "text": "my wife and i went to see this on my birthday. the best and most affecting emotional part of this movie was when it said THE END! i almost cried with overjoyeous relief of being rescued."
    },
    {
      "rating": "10",
      "text": "Perfect dream! The music, The camera work, The actors … oh wow. It should have won the Oscar for real."
    },
    {
      "rating": "7",
      "text": "this movie was another version of the 500 days of summer movie and there were some better songs and better end ,but i prefer the 500 days of summer because of better story"
    },
    {
      "rating": "10",
      "text": "Absolutely Loved ItLa La Land is by far one of the best movies of 2016 in so many ways."
    },
    {
      "rating": "10",
      "text": "This movie is the perfect mix between an homage to classic musicals and a modern take on film.  The 4-season metaphor was remarkably meaningful looking back at the movie.  The idea that life happens in seasons is powerful, and that sometimes great things come to an end.  The cute couple doesn't always end up together.The music was the best I've ever heard. As I watched the opening scene play before me, I was inspired by their choreography and musical complexity.  I was instantly entranced in the mood of the movie.  La La Land takes a well-paced approach to the idea of Hollywood and shows the biting realism of life.Overall, the movie mixes musical and instrumental prowess with skilled performances from Emma Stone and Ryan Gosling to make a film that felt more real than any I've watched before."
    },
    {
      "rating": "7",
      "text": "Fantastic dance scenes and I really enjoyed the song \"City of Stars\". Liked the ending choice. Everything else is boring and dull."
    },
    {
      "rating": "8",
      "text": "Gosling and Stone shines and as a result Chazelle marks his name on the wall.La La LandChazelle is on a strike. With successive jaw dropping projects coming out, his passion grows more intense and the cinema much larger. Coloring the 70mm screen with rich mesmeric visuals, the director, Damien Chazelle is boasting his love with proper understanding of the Hollywood culture that he so blindingly adores. Not an inch goes by in the film that looks pretentious, working over a year on editing along with Tom Cross, Chazelle wishes you to understand the \"if's\" and \"but's\" of this show business in one note. And boy what a note it is. I am sorry but that hooked theme of Justin Hurwitz, whispered in every line of the film always sobers me up.All hail the production team for carving out this desert as fresh as it looks, from clothes to designing and from locations to set pieces, the view gets better and better and so does the performance. And daunting as this task may sound, but Emma Stone and Ryan Gosling might be the new Woody Allen and Diane Keaton. But unlike them they aren't quirky but are goofy about the relationship and flirty about their first love. If Stone going over the montages of failed auditions is a threat, then Gosling on piano is her equal competitor.I have always preferred them alone, one is happy being stubborn and intuitive- something that she later on adapts from him- and other being mature and hard on herself. Together, they would fall apart, they are meant to be, no matter how in sync are they while dancing and how pitch perfect are they while singing, their rhythm is too vacuumed by the outer world to float in one room, maybe they should have just stayed in that cinema hall, but despite of claiming it to be a La La Land, this is the reality, they had to get out."
    },
    {
      "rating": "8",
      "text": "Mucho mejor de lo esperado. La escena final es demasiado buena, con mas detalles de los que aparentemente tiene."
    },
    {
      "rating": "10",
      "text": "É um filme simples, artístico, puro, talentoso e inteligente. As músicas são incríveis, bem como a história, as personagens, o drama, a fantasia e a teatrialidade envolventes. \"La La Land\" é muito emotivo, inspirador, romântico e diz-nos que nunca devemos desistir dos nossos sonhos."
    },
    {
      "rating": "10",
      "text": "despite of having praises by movie critics, la la land is that musical film, a film that leave marks to the movie industry. we are all sure this will go down to be a classics because of the amazing performances of emma stone and ryan gosling. The movie is perfect, truly rare to find, we might heard that this is overrated but remove that kind of point of view— this movie is an absolute gem"
    },
    {
      "rating": "10",
      "text": "the best musical comedy I had ever seensimply outstandingEmma, Ryan both had done great efforts to made mia and Sebastian alive"
    },
    {
      "rating": "8",
      "text": "I'm normally not a fan of musicals but I am a fan of this one. Gosling and Stone do a fantastic job and the journey their characters go through perfectly blends with the music. IMO, This should have won best picture over Moonlight."
    },
    {
      "rating": "7",
      "text": "Me sorprendió para ser un musical, muy buenas actuaciones de los protagonistas. Sin embargo, una historia muy predecible, es la típica historia de amor con un final distinto."
    },
    {
      "rating": "10",
      "text": "this movie is almost perfect, every scene is beautiful great direction and plot. best soundtrack i've ever heard, i love this movie"
    },
    {
      "rating": "10",
      "text": "\"La La Land\" talvez até não seria o mais adequado filme para ser indicado aos Óscares, mas foi um filme muito bom com uma história bem romântica.10/10"
    },
    {
      "rating": "10",
      "text": "\"La La Land\" is a colorful, stylish and nostalgic musical for the modern era with beautiful musical sequences, top-notch performances and a sympathetic plot."
    },
    {
      "rating": "10",
      "text": "From the talented director of Whiplash, comes another musical masterpiece: La La Land. This movie is about the romance of aspiring actress Mia (Emma Stone) and Sebastian (Ryan Gosling), they both have great chemistry and they're one of the best movie couples in recent cinema, director Damien Chazelle had the talent to write and develop their relationship really well. As this is a musical, it obviously has many musical numbers throughout the movie and they're all fantastic and serve a purpose to the plot.The Good:-The performances are amazing.-The script, dialogue and character development are great. The chemistry between the main characters is just wonderful.-The score and music is memorable and beautiful.-The ending scene is one of the best ending scenes I've seen in a long time and the message it tries to give is sad but true: That sometimes couples need to separate and both go in different ways to accomplish their dreams. It's a lighthearted, depressing yet satisfying ending and it's more tearjerking with the beautiful music, the last shot of the movie is Mia and Seb smiling to each other is an amazing ending, pretty refreshing to see a couple actually not ending together, it makes the ending unpredictable.-Obviously the rest of the movie is as amazing as that last scene. The musical numbers are memorable, catchy and well choreographed.The Bad:-I think the only \"bad\" or not so good thing is Ryan Gosling's acting as Sebastian. He did a good job but he didn't really shine as much as other actors, specially his in-movie couple Mia (Emma Stone).La La Land is a masterpiece of a movie, I could watch it over and over and nothing of it will ever get old at least for me."
    },
    {
      "rating": "7",
      "text": "Después de 5 meses, finalmente me pude ver La la land, y aunque mis expectativas no estaban tan altas con esta película, me impresiono a final de cuentas es sus mayores aspectos técnicos, y hasta argumentales, no tanto en estos últimos, porque quizás los personajes no sean los favoritos de muchas espectadores que se vean la pelicula. Pero hay una cosa que no se puede negar, la musica de esta obra, llego para quedarse, siendo mis favoritas Another Day Of Sun, Someone In The Crowd y City of Stars, son totalmente memorables y hasta uno le da una buenas energías al momento de escucharlas. Y pues claro, que se puede esperar del mismo que dirigió Whiplash, que ahora va a estar a boca de muchos en esta nueva era de cine como lo esta siendo como Iñárritu o Guillermo del Toro que esta volviendo a sacar relevancia en estos tiempos.Quizás no sea la película que va a cambiar la industria, pero es una que deben apreciar a los que les gusta de buen cine y de aprender a analizar las características que conforman una película para los estudiantes o críticos que estudian cine.Aunque mi favorita para los Oscares seguirá siendo Arrival."
    },
    {
      "rating": "9",
      "text": "Damien Chazelle's La La Land is a beautifully directed, terrifically acted romantic musical that elicits plenty of emotion ranging from heartbreak to joy."
    },
    {
      "rating": "10",
      "text": "Incredible. Stone shines in this masterpiece, with lovely scenes and a lot of dreams. Chazelle's direction is assured and makes the movie even better."
    },
    {
      "rating": "9",
      "text": "I'm a sucker for movies about music and art, so my rating's a bit higher than it probably should be. Ryan Gooooosling is great, and Emma Stone is even greater. Damien Gazelle has outdone himself again. It doesn't end happily (I was afraid it would), which I enjoyed. It made the movie feel more real, considering that it takes place in Hollywood."
    },
    {
      "rating": "10",
      "text": "There's not enough word to express how much feelings this movie can make you feel while you're watching it, if you love art as i do, you'll travel to a thausands of universes with every single note, every single scene and at the end of the movie you'll be flying to a sea full of colors.. Happiness, Sadness and love, pure love for art.If you don't loved this movie, let me tell you that you don't know the meaning of art."
    },
    {
      "rating": "8",
      "text": "Apart from being stupidly cliche, everything is beautifully seamless in La La Land. The emotions flicker through the seasons, the songs skip & drag with the characters mood, and both Gosling & Stone deliver the performance of a lifetime. Everything is a metaphor in this silly, soulful throwback to Hollywood's infatuation with hope & desire."
    },
    {
      "rating": "10",
      "text": "This year my love and I gathered a couple of dozen people on a warm summer night on the rooftop of a house in one of the beautiful Greek  islands and projected the film onto a neighbour's wall we spent all afternoon painting bright white.  Any film that makes you want to dance, sing and love out loud is a film worth many re-watches and this re-watch was my favourite one."
    },
    {
      "rating": "7",
      "text": "It's cute, not as good as everyone is making it out to be. Ryan Gosling and Emma Stone are good in their parts as mediocre musicians that have talent, but they would not shine in any limelight outside of this movie. The story was also very simple but nice to watch and follow. The music was also good, I certainly have \"City of Stars\" on my Spotify, but much of the music is forgettable. I would definitely watch it -- just to create your own opinion and enjoy this modern day musical."
    },
    {
      "rating": "10",
      "text": "La La Land has quickly become one of my favorite movies of all time, if not my favorite. It's full of hope and challenge that is equal and pure to life. It encapsulates real emotion and ambition that I believe many dreamers can really relate to. All of this is told through a bold story and spellbinding music, making for what I would consider to be a near perfect movie."
    },
    {
      "rating": "9",
      "text": "A fun, charming, romantic, old-fashioned musical with great songs and perfect direction. Damien Chazelle is on his way to becoming a great director. La La Land is a fantastic movie, the performances are so great, the chemistry between Emma Stone and Ryan Gosling is great, the dance scenes are some of the best I've ever seen. This is a really great movie, it will go down as a classic."
    },
    {
      "rating": "10",
      "text": "O melhor filme musical e um dos melhores filmes de todos os tempos, La La Land consegue fazer o que poucos filmes fazem, te prender e te colocar dentro do filme, e como quase nenhum faz, te faz olhar o quão é belo essa obra em todos os aspectos, atores atuando como se fossem apenas um, ambiente, roteiro, canção, trilha sonora, dança, filmagem tudo é simplismente espetacular, e esse filme mostra como realmente fazemos e pensamos, como poderia ser se é que me entende."
    },
    {
      "rating": "9",
      "text": "LLL works brilliantly on almost every level and deserves its status as the top movie of 2016.  It is not flawless, but it looks and sounds great.  Kudos to Damien Chazelle for taking a moribund genre (the Hollywood musical), updating it for the 2010s, and giving it new life.  Gosling and Stone, who are great together, play a couple of struggling artists (he, a disgruntled jazz musician, and she, an actress) who meet and fall in love.  Parts of Los Angeles become key features in the movie and serve as wonderful backdrops for musical numbers.  The ending for me is a little unsatisfying, and it left me scratching my head over what really happened between them, which isn't the best way to end a romantic musical - but this is still a lovely ride, and one with no peers that I know of."
    },
    {
      "rating": "10",
      "text": "An absolute masterpiece, grin inducing and tear jerking. Some of the most beautiful imagery ever seen in film and the stunning music that will stick in your head for days after watching. Instantly one of my favourite films and it'll be loved forever."
    },
    {
      "rating": "8",
      "text": "Class personified from beginning to end. This film is fantastically realized if a little formulaic. The performances, visuals and direction all come together to help this film rise above other romantic musicals. Great cinema."
    },
    {
      "rating": "9",
      "text": "A musical masterpiece. La La Land is the kind of musical that non-musical fans will fall for."
    },
    {
      "rating": "10",
      "text": "Must see this film! One of the greatest Musical films ever seen! Awesome performances by Ryan Gosling and Emma Stone!"
    },
    {
      "rating": "10",
      "text": "La La Land is a stunning, gorgeous masterpiece of cinema. It's triumphant from start to finish. With excellent and charismatic performances from Emma Stone and Ryan Gosling, and visionary directing from Damien Chazelle, La La Land is the best picture of 2016."
    },
    {
      "rating": "9",
      "text": "Um dos melhores musicais de todos os tempos. Roteiro guiado com ótimas músicas e ótimas interpretações, até quem não é fã de filmes desse gênero pode se encantar com La La Land"
    },
    {
      "rating": "10",
      "text": "i wish i could live in la la land my whole life.  I try to keep away from unpleasant reality to make my life feel like it could feel more bearable for me"
    },
    {
      "rating": "10",
      "text": "I have been a big fan of musical films for many years. I recently watched a movie called \"La La Land: California Dreams\" again. For the first time, I saw this movie in the cinema last year when we went to see it with classmates. The genre of the film is a musical romantic, comedy and drama film, and the film was released on August 31, 2016. The film employ and location is in California. In the same year, the film also nominated for the Oscars.Actress Mia tries to play a famous play where she wants to take part. She will work in the breakfast cafe otherwise there is a waitress. Because she has a sad mood the same evening, then she will have a restaurant in the evening and a muscian Sebastian, whom she will soon fall in love, will play the piano. The same night, Sebastian was fired from work, as the restaurant manager wanted to put his restaurant around for a band to listen to people. Sebastian goes to work on one of the record labels, and Mia begins to create her own play. The film employ is very fast-moving. At the end of the film, they admit to each other that while they care about each other, they will not be able to live together in the future.It seemed to me that the film is light-hearted and there were different twists and turns in the film. There were a lot of different details and effects in the film that changed the film´s environment. This film had a big-budget, but it is a world-famous piece of musical.My opinion about the film is very good, because people dance and sing a lot, and this make the movie a great one. I recommend this movie to people: first, who like musicals and secondly, dream far away from the world."
    },
    {
      "rating": "10",
      "text": "La La Land is one my favorite movies ever. It includes impeccably choreographed dancing, great songs and an excellent score, along with excellent performances from Ryan Gosling and Emma Stone. Chazelle's direction is very assured and the movie has excellent cinematography. It's visuals and excellent musical numbers allude to classic musicals with an upbeat, and dream-like tone. The movie can be interpreted in several ways, but for a less discerning viewer the subtle message of being willing to let go with each other to follow your dreams could be missed, if so i recommend a second viewing. Both Mia and Sebastian achieve their dreams but the movie shows a beautiful and heartbreaking montage of what could have been if their relationship was perfect. But the whimsical tone is contrasted with raw emotion and shows the reality of going to L.A. to achieve your dreams. La La Land was the best movie of 2016 and must be seen. I watched La La Land recently, my expectations weren't that high, I was expecting a good movie, but not a masterpiece on the level of this film. La La Land is an instant classic."
    },
    {
      "rating": "10",
      "text": "This is one of my favorite films of all time.  The music is catchy, the story is very sweet, and the acting/dancing/singing is great.  It isn't cliche at all and the the music is so amazing.  My favorite songs include Someone in the Crowd, City of Stars, and Another Day of Sun.  The ending is intense and unexpected.  I also like how they go through the four seasons and Ryan Gosling and Emma Stone's on screen chemistry is amazing.  Overall I would give this movie a 10/10!"
    },
    {
      "rating": "10",
      "text": "I freaking love this movie from beginning to end. It's such a feel-good movie. When i watched i for a second time, i could sing along with all the songs, which are great as well. Every song stands out. The story is maybe not that Original: girl meets guy, fall in love, be in a relationship, break up. But it was put in another 'jacket' as i would say, which made the movie a whole new experience. Acting is great. You'll be smiling from minute one with the Original intro with 'Another day of sun' sung by a whole bunch of dancers dancing on the freeway. It ends a bit more sad, with the broken up couple looking back to the movie with some happy and sad music.Great experience, if you didn't liked it the first time, be sure to give it a second try, changes your perspective and gives you a better look at the movie and its characters.On of my all time favorites for sure."
    },
    {
      "rating": "9",
      "text": "This movie will forever prevale as a timeless classic, which is utterly hard to achieve. Beautiful to look at, the production design is mesmerizing. Beautiful to listen to, the original music is perfect in every way. Beautiful to read to, the screenplay plays a huge part in this. Every bit is better than the last. La La Land achieves everything it once aspired to be and more. Congratulations Chazelle, only few people can make an iconic movie, and even more, form part of the iconic culture."
    },
    {
      "rating": "9",
      "text": "So many references to 1950s and 1960s America. I just couldn't help but crying dreaming of love."
    },
    {
      "rating": "10",
      "text": "The greatest masterpiece of this century so far, sustained by Emma Stone's perfect performance"
    },
    {
      "rating": "10",
      "text": "Sinceramente, a la hora de ver esta película, no tenía expectativas muy altas, pensé que sería un simple y tonto musical como otros, o incluso que sería una historia patética, pero logró convertirse en una de mis películas favoritas.Es perfecta por donde se la mire, una historia perfecta, actuaciones increíbles, gran dirección, fotografía, escenario, un guión de lujo, escenas divertidas, canciones muy deleitables, etc.Una mención especial a la maravillosa Emma Stone, que se luce con su mejor papel hasta la fecha y la verdad, tiene bien merecido el Oscar que ganóOtra mención especial a la creatividad del director y al cast de la dirección artística, también a los guionistas, quienes crearon una fiesta visual y auditiva.Sinceramente esta debió ser la ganadora del Oscar en lugar de Moonlight."
    },
    {
      "rating": "9",
      "text": "No me gustan los musicales, pero para hacer una critica no importan mis gustos personales. Para comenzar la banda sonora es increible las canciones nos cuentan puntos de la trama y no solo eso los colores son vivos y hacen que una escena se vea genial de verdad los diseños del escenario me gustaron mas que los de avatar. Esta forma de narrativa tambien tiene sus defectos porque si quieres transmitir emociones profundas o tristes no se lograra del todo puesto que el sonido ritmico y el escenario colorido de la pelicula te dira todo los contrario y aunque la iluminacion es bastante buena en otras escenas se pudo mejorar. En el resto de puntos la pelicula es muy simple la trama, el guion y movimiento de camara, se lleva un 11 de 10 en banda sonora y escenarios pero el resto es normal para una pelicula que toma mucha fuerza con lo ya antes mencionado. Es una gran pelicula pero soy de esos que esta de acuerdo con que Moonlight merecio el oscar, me hubiera gustado sentir sensaciones indescriptibles con la musica en La la lan pero falto muy poco ,de verdad casi lo consiguen."
    },
    {
      "rating": "10",
      "text": "Majestic! The setting is awesome, music is soulful and the story is so heart-warming. If you've always been skeptical about musicals, this movie is going to destroy all your doubt and principles about it. The Oscar's for best picture goes to..."
    },
    {
      "rating": "6",
      "text": "Totally average. Technically it's great, but it misses content. A lot of it. It's the kind of movie that it's like a dog. It will sit, lay and roll to gain a cookie (oscar)."
    }
  ]
}