{
  "id": 3364,
  "title": "Labyrinth",
  "starring": [
    "David Bowie",
    "Jennifer Connelly"
  ],
  "runtime": 102,
  "genre": [
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "description": "When teen Sarah is forced to babysit Toby, her baby stepbrother, she summons Jareth the Goblin King to take him away. When he is actually kidnapped, Sarah is given just thirteen hours to solve a labyrinth and rescue him.",
  "releaseYear": "1986",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/q2GimbyqxCeLkRfSMajtaHdwWg9.jpg",
  "categories": {
    "plot": 7.782608695652174,
    "acting": 7.181818181818182,
    "ending": 7.428571428571429,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 8.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "It has been over twenty years since this film was shown in theaters, but still manages to surprise, enchant and make people laugh. Sarah (Jennifer Connelly) is a fifteen-parents divorced and lives at home with his father and step-mother (stepmother is always trying to help the girl but Sarah refuses any contact with her). One day find yourself doing the babysitter to her little brother  newborn (played by the father's relationship with his stepmother and therefore hated by Sarah) and stove hear him crying invokes the Goblin King, Jareth (David Bowie) who kidnaps him. Sarah repented for what he did asks to Jareth to get back the child, but the latter told him if he does not recover within thirteen hours the child will turn into a gnome. This will force the girl to find her brother through the maze full of strange creatures and traps. Directed by Jim Henson, the film has a simple plot organized so great and full of genius found in inquiries concerning the creatures, the maze and pitfalls. Fine performance, that of David Bowie suitable for this movie and also good Coonelly Jennifer."
    },
    {
      "rating": "9",
      "text": "David Bowie and Jim Henson team up for a delightful fantasy."
    },
    {
      "rating": "6",
      "text": "\"Labyrinth\" is a movie that starts out as what looks like a fantasy equivalent to \"Peter Pan\" , but sizzles down  in the end only as a decent movie with a baffling story behind the great CGI."
    },
    {
      "rating": "8",
      "text": "George Lucas and Jim Henson had teamed up and they made an entertaining masterpiece."
    },
    {
      "rating": "9",
      "text": "I really really really really enjoyed this movie, The puppet The Script special effects I enjoyed all parts of this movie, David Bowie is amazing and sexy and cool and I want him please give him to me , This movie works the same as  Alice in Wonderland and the Wizard of Oz In Den is about girls that is in a crazy world And Property some themes about growing up and childhood, If you have kids please watch it with them If they get scared that's ok children likes to be scared"
    },
    {
      "rating": "9",
      "text": "The weirdness of this film turned me off as a young kid, but now it's addicting when you're older."
    },
    {
      "rating": "10",
      "text": "If you're looking for depth, no, Labyrinth is not a ten. Fun, imagination, and clever wordplay however make this film a treasured childhood memory, and a favourite to last a lifetime."
    },
    {
      "rating": "7",
      "text": "This fantasy gave me the creeps when I was young (way before I knew who David Bowie was), but looking back it was a great fantasy tale."
    },
    {
      "rating": "7",
      "text": "This isn't the deepest of films, it throws you right in at the deep end and you're off and rolling within the first few minutes, but it's good fun. David Bowie's tremendously theatrical and cartoony, which absolutely works considering the creatures he's ruling over, so he's ace throughout. Jennifer Connolly does a really good job considering her age, carrying things as the one constant throughout and interacting amusingly with the various animatronic characters and men-in-suits. The supporting cast is a fairly entertaining range of wacky characters, typical Jim Henson (very Fraggle Rock and Muppets, of course!), and some of the special effects are very impressive considering the time period, particularly on Hoggle, who would probably be acceptable in a modern day film. The film does start to drag after a bit but it's interesting enough to be worth a watch if you're curious!"
    },
    {
      "rating": "7",
      "text": "LABYRINTH is Jim Benson’s follow-up of the grotesquely eye-opening puppet enterprise THE DARK CRYSTAL (1982, 7/10), and also his final painstaking work, where he pairs a cherubic Jennifer Connelly and a trend-setting David Bowie (look at his 80s coiffure!) as human actors with all his accomplished puppets, to present a spellbinding fairytale in a labyrinth at the heart of a Goblin kingdom. It was a disastrous commercial failure upon its release, but time has been pretty generous to it and now it has achieved the cult status and even a possible sequel has been hatched for many years.\r keep reading my review on my blog, please google: cinema omnivore, thanks!"
    },
    {
      "rating": "6",
      "text": "Bowie definitely elevates the movie and is a true highlight for me. What I said about Dark Crystal also applies for Labyrinth. It's a beautiful, well-designed movie with a story that really just falls apart in the middle and kind of limps towards the end but is worth checking out because it is quite unique."
    },
    {
      "rating": "7",
      "text": "Often mirroring the weirdest acid trip imaginable, Jim Henson's Labyrinth is often cited by many as a childhood classic, especially for young girls. Considering it is one of the rare films to offer a teenage girl protagonist who embarks on a hero's journey that was once reserved for just men or even young boys. Thus, Labyrinth's success with young girls is hardly a surprise given that it is the rare film they can watch and actually see somebody like them take charge, instead of being treated like a damsel in distress. Featuring excellent puppetry alongside this story of a young girl going to rescue her little brother (talk about a gender swap) from the Goblin King (David Bowie), Labyrinth is raucous fun that is highly imaginative, nicely acted, and a great fairy tale for the modern age even if it can get a little too odd at times.The times in which it gets a little too odd are largely delivered via song. With David Bowie or various puppets breaking into spontaneous and decidedly random moments of song, the film halts too much. Not only do the songs contribute very little to nothing at all to the film, but the songs are very odd (one about removing a girl's head) and never really captures the imagination. Instead, it feels like stomping on the brake and brings the film to a screeching halt. Had the music been good, it would have been excusable, but the songs are just not interesting lyrically and go on for far too long. The end result is a film that can sometimes feel too broken up and disjointed to wind up matching its fantastical feeling. Instead, it feels like a childhood fantasy film interspersed with songs that got left on the cutting room floor of the latest David Bowie album.Fortunately, as a fairy tale, Labyrinth is nonetheless impressive thematically. Written by Terry Jones of Monty Python fame, it should be no surprise that he writes some similar morals to fellow Monty Python member Terry Gilliam. In his film Time Bandits, Gilliam went heavily anti-materialistic and with Labyrinth, Jones does the exact same. The highlight example of this theme comes as young Sarah (Jennifer Connelly) bumps into a woman in a trash heap. The woman has various pieces of garbage on her back and has been sent by the Goblin King to try and distract Sarah from her quest to rescue her brother. Tricking her into going into her room at home by enticing her with some her possessions, the woman begins placing various toys and clothes on Sarah's back while urging her to just stay and forget about Toby. With her possessions literally creating a weight on her back due to the value she places upon these material goods, Sarah is forced to decide between being crushed by the weight of this material greed or breaking free and relying upon human connection as a means to fill in her heart. This materialistic nature is what had gotten her into this mess in the first place as she asked the Goblin King to steal Toby after she found out he had taken one of her stuffed bears. It is thus only by renouncing this love of material goods in favor of loving her brother that she is able to solve the Labyrinth and find her brother. Jones adds a further thematic layer to this by introducing the materialistic temptation via a piece of fruit. Given to her by Hoggle (Shari Weiser/Brian Henson), her friend, the piece of fruit mirrors the apple bitten by Eve that introduces sin to the world. Biting the fruit without hesitation, Sarah is then forced to confront the sin that has held her back from happiness for so long.It is only natural then that the film proceeds to discuss themes regarding selfishness. Derived straight from Sarah's materialistic nature, she is incredibly selfish. She loves her toys for sure, but is annoyed that Toby would dare think that she would share those toys with him. Her parents ask her to babysit and, though she has nothing to do, she resents them and showers them with teenage angst for asking any action from her. As her stepmother says, she gets treated like an evil stepmother (hello Cinderella) despite asking her to babysit being the only demand she makes of her stepdaughter. Not only is she immature, but Sarah is selfish in how she wants to still be treated like a baby and resents Toby for stealing the spotlight from her after having it to herself all these years. Thus, Labyrinth forces her to put her life on the line by making her take the selfless and arduous journey through the Labyrinth to rescue Toby, which forces her to realize how much she loves the kid without the cloud of materialism and selfishness.In line with this, Labyrinth also explores themes of responsibility. Approaching the age at which she will be considered a woman, Sarah must learn a measure of responsibility. When her parents ask her to do something, she needs to know it is not because they hate her, but because they just need some assistance from her. Whether she wants it to be case or not, she must take care of Toby from time to time."
    },
    {
      "rating": "7",
      "text": "Nostalgia holds a magical power over people. It can warm souls, comfort sadness, project youth, and even cloud judgment. This makes films like Labyrinth particularly difficult to read critically. Much like Goonies, Henson’s Labyrinth’s, a mix of wry comedy and innovatively designed ideas, put a loving trance on swaths of 20-40 year olds who happened to see it at the right time. Much like many of its ilk, I’m not sure it completely deserves all the accolades it gets from its fanboys/girls. However, it’s still fantastical fun, even if its storytelling urgency is less than fully engulfing.\rIt’s a film more interested in incidents than plot (girl wishes brother would leave, goblins steal brother, sister has to get brother back). In that sense, and many others, it harkens Alice in Wonderland (my favorite Disney Animated film). It’s an intensely imaginative movie that follows a bored young girl (played by Connelly with the charisma of a mannequin) as she encounters an adventure full of odd characters, winding streets, and inexplicable magic. The characters within the maze are fun and distinct, and Bowie matches the dark mystery of the story while keeping a childish wonder right below the surface.\rThe difference between this and other kids-fantasy-adventures I REALLY love is hard to pinpoint. The design is outstanding, the humor is affable, the characters are surprising, and the scenes pop with surprise. Again, I can only assume my distance from this film during my early age keeps me at a slight distance. Nonetheless, this is an enjoyable piece of 80s pop-culture that I’m shocked Tim Burton and Johnny Depp haven’t ruined with a CG-covered remake. Give it time."
    },
    {
      "rating": "8",
      "text": "One of my favorite movie from my childhood. I still enjoy it to this day. Fun story, great effect (for the day) and some really memorable performances, particularly from David Bowie. But, I do find that the story does get a little too sidetracked from time to time and needlessly slows down. But, it doesn't happen too often. Overall: A treasure from my childhood and a classic fantasy movie."
    },
    {
      "rating": "9",
      "text": "“The Labyrinth” directed by Jim Henson in 1986 is a movie about a 15 year old girl named Sarah who wishes her half baby brother Toby away to the Goblin King. Sarah has to complete the labyrinth within fifteen hours or else the Goblin King will keep Toby forever and turn him into a goblin. In beginning of the labyrinth Sarah meets a goblin named Hoggle. Eventually Hoggle and Sarah become friends and try to get through the labyrinth together. Hoggle was given orders from the Goblin King to take Sarah back to the beginning but Hoggle had become fond of her. Throughout the labyrinth Jared the Goblin King sends obstacles her way to deter her from making it to the center of the labyrinth to save her brother. Along the way not only does she make friends with Hoggle but also a huge furry beast named Ludo, and a small fox knight named Sir Didymus. The four eventually get to the center of the labyrinth against all odds.\rWithin the center of the labyrinth is Goblin City, where they find themselves being attacked by hundreds of goblins. Eventually they make it through the city and Sarah faces the Goblin King on her own. The King takes Sarah around a room with stairs going every which way but she finally reaches her brother who has been out of reach this whole time. Once Sarah has Toby in her arms the labyrinth disappears and the Goblin King tells Sarah that he will make all her dreams come true, he even give her himself in return for giving him Toby. She refuses and wakes up in her room. She runs to find Toby sound asleep in his crib. She then goes to her room to put away all of the things she thinks are childish and have been holding her back from growing up but as she looks in the mirror she sees her friends Hoggle, Ludo, and Sir Didymus. They tell her they will always be there for her and she thanks them and tells them that she needs them after all. They appear in her room and have a huge party with all the goblins. Jared now an owl watches from outside the window.\rI saw this movie for the first time when I was ten and it has been my all time favorite movie ever since. If you are a David Bowie lover, like I am, you will enjoy this movie immensely. There is no mistaking that this is David Bowie in the movie. Not only is David Bowie is one of the stars in the movie which is a plus, but his outfits in the movie are amazing! The music in the movie is also done by Bowie which adds extra points to my review. For the time period this movie has great effects, from the goblin suits, to the set. It is really amazing what they did with it.\rThis is a classic 80s movie with all the sparkle, big dresses, and flashy hair. The puppeteers in this movie were astounding. Jennifer Connelly plays Sarah in the movie and in my opinion nails it. She started out as a child model and I think the modeling and this role play hand in hand. She was a great choice for this character. This movie plays at 101 minutes and only has one part where it seems a little drawn out; Sarah is in a trance from eating a peach the Goblin King had given to Hoggle for Sarah, she is in a junk yard and ends up in her room. This part in my opinion the movie could have done without, but other than that I would give this movie a big thumbs up.\rWhen the movie was released in 1986 it tanked in box offices but between 2006 and 2012 it came back and grew a following. Its budget was 25 million and in box offices only grossed 12,729,917. I’m glad people are recognizing it now and it is getting some well needed attention. This is and will always be my all time favorite movie and I urge you to take some time out of your day to rent this movie and let yourself be taken into the labyrinth with Sarah and all the other fascinating creatures."
    },
    {
      "rating": "10",
      "text": "I  think labyrinth is one of the greatest fantasy movies of all time despite its box office fail and mixed opinion from critics I can say the movie has some of its flaws and also alot of things not really explained but I have to praise it for it art style and also how developed and how lovable every charater is within the film. I think it's silly,scary and loving at times. And love or hate the movie it's a movie that you will never forget. But overall it's a timeless, charming classic that will always be rewatchable and more magical the more you watch it."
    },
    {
      "rating": "10",
      "text": "This movie was one of the first movies I can remember as a young child.  My face always lit up on my birthday because we'd always watch this as the first thing we did every year.  Somewhere around the age of 12 I lost this movie and we didn't watch it anymore.  I now am 15 and just got this for an early Easter gift.  I screamed and instantly put it in.  You know how normally you watch movies from your childhood and see how corny they are?  Well not this one.  I sang along with every song, laughed when they said the wrong names for Hoggle and even giggled at the awkward, Jareth please put on different pants moments.   This is my favorite movie of all time and trust me I've seen quiet a few movies.  I'm just sad they haven't made a second one."
    },
    {
      "rating": "10",
      "text": "One of the best 80s film ever created!!!  I love it and it’s a childhood masterpiece!  The music is amazing with David Bowie!  The costumes are phenomenal and the story telling is the best!   I still watch this movie after 30yrs and still absolutely love it!!!   Masterpiece writing, story telling, music, cast of characters!!  Everyone should watch this as a child to understand just how amazing it is when you are in your 40s and still LOVE IT!!"
    },
    {
      "rating": "10",
      "text": "I'm 35 and every time I put this on it brings me back to being 7 again watching it for the first time in the movie theaters. They sure don't make rockstars or movies like they used to."
    },
    {
      "rating": "10",
      "text": "Superb dark fantasy. Strage, twisted and original. Great music. Great costume. Great animatronic. Great also for cosplaying. It has moral and character development.  It's one of the rare classic movie that stand the passing of time setting nostalgia aside, because it can entertain all kinds of ages. Still good today."
    },
    {
      "rating": "10",
      "text": "After David Bowie died, some of the people recommending me to go and watch a film called Labyrinth by Jim Henson. Now let me get to the technicals here. I've just recently found out that the film is a box office disappointment which is crazy. I am so surprised about this after I've watched it. Aside from that, it gained a large cult following for fans of Jim Henson and The Muppets, I mean, who doesn't love The Muppets? it follows around a 15-year-old Sarah played by a really young Jennifer Connelly is on the quest to reach the center of an enormous otherworldly maze to rescue her baby brother, Toby after accidentally wished him away to the evil Goblin King, Jareth played by singer David Bowie in the world of Labyrinth. Yes, like I said, everybody recommending me to watch Labyrinth. Pam told me to watch it, Tina told me to watch it and I did. And get this, I heard Tina and my friend Sam Guy singing the Scooby Doo lyrics but after I've heart it I decided to look upon it and there I've had it. David Bowie singing \"Magic Dance\" and I was amazed. While I'm watching it when Sarah went into the maze I finally went through the \"Magic Dance\" song and I said \"Uh oh, we're heading for the Goblin song.\" I cannot believe what I've just heard from my friends singing that tune. Seriously? Listen.\"You remind me of the babe.\" \"What babe?\" \"The babe with the power.\" \"What power?\" \"The power of voodoo.\" \"Who do?\" \"You do.\" \"Do what?\" \"Remind me of the babe.\"Oh boy, it kinda reminds me of Teletubbies when they're singing and dancing and I think they can dance along to this song. So whenever I think of this song, the more I sing the other goblin song from Blackadder. \"See the little goblin, see his little feet, and his little nosy-wose, isn't the goblin sweet?\" \"YES!\" \"See the lit-\" \"Wait a minute!\" As the children who thought about this, they would think like it's the same thing as Alice in Wonderland and you know, they're right. The parents loved it too and I would say that if they're fans of David Bowie, then this IS a recommendation for everyone. The songs are unbelievably catchy however I would say that \"Magic Dance\" is the best song out of all of them. I know there are some that I really do like and I will humming along to them. The side characters are a lot of fun. It's kinda like The Muppets because it's Jim Henson. Hoggle, Ludo and Sir Didymus are funny. I'm actually surprised that I'm really getting into Sir Didymus, an anthropomorphic fox. His personality is hilarious just like any other personality. I hope many of you remembers the Bog of Eternal Stench? A swamp where it smells horrible and makes farting noises. As a musical or I don't know if it's a musical, David Bowie is the best thing about Labyrinth. He plays a brilliant part as Jareth, the Goblin King. I would recommend this film to anyone who hasn't seen it just like Pam and Tina did to me. As a fan of David Bowie, he will always be the role of Jareth, the Goblin King and this movie will always be a cult classic for many generations."
    },
    {
      "rating": "10",
      "text": "Labyrinth\rJareth: I ask for so little. Just fear me, love me, do as I say and I will be your slave.\r Jareth: You remind me of the babe.\rGoblin: What babe?\rJareth: The babe with the power.\rGoblin: What power?\rJareth: The power of voodoo.\rGoblin: Who do?\rJareth: You do.\rGoblin: Do what?\rJareth: Remind me of the babe.\r She's a girl who's mad at her mother's second marriage, and the child who took her place- her baby half brother. He's the Goblin King, the granter of wishes that are best forgotten. The setting is allegory and the journey, life.\r Sarah is young, impetuous and tired of the restrictions that society places on teenagers to keep them from growing up too fast. Her parents are happy, modern and determined to make a blended family within the new religious framework for the nineteen nineties- where the home is still paramount, but the tradition of Adam and Eve, until death do we part, has been replaced by the more Wiccan concept of handfasting. She's a product of this world and, ultimately, represents the generation that will finally bring it together.\r The story weaves like a Celtic trinity knot, ending where it begins as she puzzles and discovers her way through the Labyrinth of life, experiencing the promises of Jareth, the Goblin King and eventually seeing through the illusions around her and finding her way back to both reality and wonder. Does she keep the magic, lose her brother and allow Jareth a way into her life? Or does she grow up, learn to see through the walls around her and manage to find the strength to have it all?\r Tatianna Anne Jindra\rOn YouTube\rBadFantasyRx\r From water, flung into being.\rEmerging from no when, then, the Labyrinth.\rShaped from star dirt, all that matters.\rThe joy or sorrow of its wending Gordian Knot\rFlowing from what we see in the child’s mouth\rPushing an ever growing burden of memory before.\rAllusion, both ways.\rNo Hob to trick, instead a Swan\rA shower of rings and things,\rThe promises of a Goblin King,\rOf the devil, having stolen the unicorn’s horn."
    },
    {
      "rating": "8",
      "text": "The excitement of David Bowie in a world of fantasy, created by the father of The Muppets.  Maybe does'nt work as The neverending story but it's a formula with no waste for amuse children on a rainy evening. Long life for the man who sold the world."
    },
    {
      "rating": "6",
      "text": "you have no power over me..LabyrinthIt contains some intriguing tricks and riddles with some sketchy characters in its first half that ante's up the game which then makes it more disappointing later, as the second half is exhaustingly cliched with a typical agenda of quest seeking where one knows its predictable climax. Jim Henson needs to work on his execution skills especially when one is creating such a feature that attracts younger crowd that seeks for more drama and meddling with emotions. Jennifer Connelly is brilliant in her performance and unfortunately isn't supported well enough by David Bowie as he fails to strike essential fear onto the audience. Labyrinth; despite of its flaws, works like a charm as its screenplay is gripping and entertaining enough to hold the audience for its short runtime of 100 minutes and deliver the complete anticipated package."
    },
    {
      "rating": "10",
      "text": "this is my favorite movie of all time.the special effects are just amazing and is some of the best I have ever seen.the acting is alright but David Bowie as Jareth the goblin is one of the best villains ever.David Bowie also did the soundtrack to this movie and the songs he did were some fo his best such as dance magic dance, as the world falls down and within you are so good that I started listening to David Bowie after watching this and he is now my favorite singer.this the best movie ever made 10/10"
    },
    {
      "rating": "3",
      "text": "Oh dear heavens no. Back in the 80´s, this movie was probably a fantastic view i am sure together with many other fantasy classics.But it has aged horribly for today´s audience. I know that Jennifer Connelly who hot stuff in her young teens, but her acting skills was pretty naff back then.The practical effects are very much on level with Muppetshow, but poorly executed.Only David Bowie is the only one who could hold this movie just about together. But even the musical number are slightly flat from Bowies classics from the 70´s.This movie can easily be left alone to the glorious 80´s, but should not be the first movie you have in mind 40 years later."
    },
    {
      "rating": "10",
      "text": "Love it. Great music. Funny characters, great effects, and plenty of imaginative creatures."
    },
    {
      "rating": "4",
      "text": "This is a weird near-nonsensical movie which drives away from the story, meeting and friending random animals and it just drags on and on but it was probably alright for when it was made."
    },
    {
      "rating": "10",
      "text": "That this movie has a critic rating of 50 is testament that critics and reviews should always be taken with a sizable grain of salt. A classic."
    }
  ]
}