{
  "id": 4552,
  "title": "Ladder 49",
  "starring": [
    "Joaquin Phoenix",
    "John Travolta"
  ],
  "runtime": 115,
  "genre": [
    "Drama",
    "Action",
    "Thriller"
  ],
  "description": "Under the watchful eye of his mentor, Captain Mike Kennedy, probationary firefighter Jack Morrison matures into a seasoned veteran at a Baltimore fire station. However, Jack has reached a crossroads  as the sacrifices he's made have put him in harm's way innumerable times and significantly impacted his relationship with his wife and kids.",
  "releaseYear": "2004",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aJWQNUUHVcI7kvlVdUzPS9J8XHt.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 4.0,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Predictable and shallow as it goes through the motions of the Hollywood tearjerker. That said, it's still a lot of fun to watch--and might even knock some sense into the college kid who likes to pull his dorm's fire alarm."
    },
    {
      "rating": "6",
      "text": "Shamelessly hokey Hollywood Formula 49 piece. An homage to firefighters without the annoyance of allowing the viewer to experience an original thought. The content rings true, but the presentation does not. Despite an obtuse presentation its point is made. The fact that the movie is about those who charge into what others are fleeing is not negated by the techniques and motives of the filmmaker."
    },
    {
      "rating": "10",
      "text": "Although hardly publicised and fairly predictable, it is a film which you really get into. I'd never heard of it when I began watching it; but thoroughly enjoyable. But sad."
    },
    {
      "rating": "4",
      "text": "Firefighting is inherently admirable and worthy of the Hollywood treatment. In fact, we probably need more movies delineating just how difficult and courageous of a profession it is. But in the words of Switch from \"The Matrix,\" \"not like this. . .not like this.\" \"Ladder 49\" is as plain and bland it gets, just eking by with its competent look and feel, tricking you into following through with an experience that's so empty and hokey overall, you can't help but guess the year it came out correctly every time. Wadded together with characters, scenes and even lines you've seen before (there's a character that straight up says, \"I'm getting too old for this **** multiple times, as if no cinemagoer's heard the line from Lethal Weapon parodied a thousand times over already) it has to be one of the clearest examples of a movie I've seen in quite a while that I'd advise you put on if you just want to \"tune out.\" There's even a relatively ballsy -- considering the kinds of narratives that were popular at the time -- ending that's completely undone by one of the cheesiest songs I've ever heard written for and placed into a film. I wish I could give Joaquin a mulligan on this one, but it's just so cringe-inducing. Please, watch \"Backdraft\" instead of this."
    }
  ],
  "recommendations": [
    "project_almanac",
    "t2_trainspotting",
    "the_darkest_minds",
    "source_code",
    "v_for_vendetta",
    "gamer",
    "the_twilight_saga_breaking_dawn_part_1",
    "unfriended_dark_web",
    "ralph_breaks_the_internet",
    "nerve",
    "the_lobster",
    "the_hateful_eight",
    "midsommar",
    "old",
    "bird_box",
    "the_butterfly_effect",
    "antebellum",
    "the_hunger_games_mockingjay_part_1",
    "the_last_airbender",
    "unfriended",
    "the_matrix_resurrections",
    "doctor_strange_in_the_multiverse_of_madness",
    "the_power_of_the_dog",
    "the_counselor",
    "the_emoji_movie"
  ]
}