{
  "id": 4502,
  "title": "Lady Macbeth",
  "starring": [
    "Florence Pugh",
    "Cosmo Jarvis"
  ],
  "runtime": 86,
  "genre": [
    "Drama"
  ],
  "description": "Rural England, 1865. Katherine, suffocated by her loveless marriage to a bitter man and restrained by his father's tyranny, unleashes an irresistible force within her, so powerful that she will stop at nothing to get what she wants.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xWTJbhTwSTJmhLlX5xAOxPhdnXc.jpg",
  "categories": {
    "plot": 6.4,
    "acting": 6.166666666666667,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "6",
      "text": "“To the cross, to the prison, to the grave, to the sky”. Something wicked this way comes, yet, for a very large portion of the beginning of the film, that wickedness is never really fully defined. As the film opens up in 1865 rural England, we are quickly introduced to a stunning yet bleak beauty Katherine (Florence Pugh). Katherine is on the alter on her wedding day, but don’t get this twisted, this is not your typical Hollywood wedding. Katherine was purchased with the land, a land that is apparently “not fit enough for a cow to graze upon” according to her growly and aggressively harsh, and newly appointed husband Alexander Lester (Paul Hilton). As the events of Katherine’s marriage unfolds (and these events do not take long), we find her in the bedroom of her husband’s home, naked, ashamed and facing the wall, while her husband pleasures himself in the corner of a chair beside a fireplace.Lady Macbeth is an extremely erotic film with very impotent moments. First time feature director and veteran theatre director William Oldroyd fills each and every one of his scene with numerous cuts and various edits to allow the film to flow; almost as if, unlike theatre, being able to change pace, time, space and movement on screen is something he becomes overly excited with. Yet, with Oldroyd’s excitement with the film medium, he is able to show Katherine’s quick plight with her new husband.Upon Alexander’s departure from his family home, which is never revealed to Katherine, our protagonist is found bored, dumbfounded and lost in a home where she has barely any authority or purpose. With the exception of her very loyal maid Anna (Naomi Ackie), the land-hands, including one very undisciplined new farmhand Sebastian (Cosmo Jarvis), Katherine finds little motivation to get up in the mornings.After an extended period of time away, Katherine dreads the company of her husband’s father, Boris Lester (Christopher Fairbanks). Aggressive like his son, the elder Lester is a constant reminder of Katherine’s misery. Feeling claustrophobic in the home, tired with boredom and restless, without ever being able to leave the property, unless otherwise advised, Katherine must spend her pointless days inside the home, with her prayer book and inner thoughts lingering.It isn’t until one day, that Katherine, who hears a commotion in the workers lodge, that she finds Anna stripped naked and being taken advantage of by the workers. In a rousing display of power, Katherine orders the workers to stop, and demands Anna get back inside. It is in their quarrel where Katherine first takes notice of Sebastian, and the two share very intense and disarming looks. Days pass, yet Katherine and Sebastian cannot forget their gazes upon each other, a desire that, is more animalistic, and very empty of love. Coincidentally many days later, on a very abrupt stroll in the fresh air away from the property and by herself, Katherine runs into Sebastian in the countryside, where she runs off avoiding and tempting herself. It is not until later that night, in a very swift, almost intrusive and forceful display, Sebastian visits Katherine in her bedroom, and the two young and attractive individuals engage in a very taboo love affair.While the actions of Katherine and Sebastian lust begins to unfold, an abundance of mostly evil and murderous events unfold along with them. With each new day that passes, the two vow to always be loyal to one another, despite having the world against their every action and notion. Treading the fine line between beautiful, loyal, sickening and morbid, Sebastian and Katherine quickly start unveiling the true motives of each other’s love, allowing the audience to see that passion, physical lust and deep-rooted longing and desire are very well the driving force of a tainted love between two very inexperienced and uneducated people, especially when it comes to the subject of love. There is no point, at any moment in Lady Macbeth where the depictions of Katherine’s and Sebastian’s love affair are beautiful or attractive, actually, the opposite is easily said, where when each of these lovers are together, a truly grotesque display of affection can easily be felt.While Lady Macbeth is by no means an awful film, events and moments in the film are quite disturbing and awful indeed. The loss of innocence can be seen throughout each frame; the troubling interpretation of a protagonist in the film is quite unsettling and most of all, sometimes, the film seems to drive plot and its narrative, all too conveniently.While Oldrody’s first feature film will surely be discussed and studied in academic settings for many years to come, the film begs many questions of femininity that, while it may be understood before even watching the film, can be questioned once the film’s credit’s roll."
    },
    {
      "rating": "10",
      "text": "Cleverly written, well performed, and eerily shoot, Lady MacBeth provides the perfect modern prequel to the notorious murderer. The film inventively inserts all the theories of Lady M's past to make it consistent with Shakespeare's original. We see why Lady M becomes so ambitious; she must grow and be nondependent to remain truly herself, even if she needs to lie, or worse, to get there. One of the best movies of the year."
    },
    {
      "rating": "10",
      "text": "Lady Macbeth is a genius mix of sex,gore,Victorian England,bad peoples and kills."
    },
    {
      "rating": "6",
      "text": "Possibly because she has been in the news recently or the way the lead is dressed and the house is furnished, whatever, Florence Pugh in “Lady Macbeth” kept reminding me of Olivia DeHaviland in “The Heiress”, who plays Catherine, which isn’t a bad comparison for Pugh.Florence Pugh plays Katherine, (with a K),  a 17 year old virginal girl who has been basically ‘purchased’ with a plot of land, who is married to a sexually dysfunctional man, Alexander , played by Paul Hilton, more than twice her age. He pleasures himself while she is nude facing a wall and therefore unable to bear the children for which she is bought. Not only does she have a brutal non-caring husband who will not allow her to go outdoors she also has to put up with his father Boris (Christopher Fairbank) another unpleasant man.Alexander has to leave for a period of time allowing Katherine to go outside and walk in the nature she loves so much and has missed. At one point she comes across a group of men who work for her husband having ‘sport’ with her maid Anna ((Naomi Ackie) and becomes a witness to all that takes place when Katherine gets involved in a very heated love affair with Sebastian, ( Cosmo Jarvis) her husband’s servant.At this point forget any idea of Shakespeare you might get just from the title of the film as it turns into both a ‘bodice ripper’ and a melodrama that includes murder, deception, revenge, a major character going mute, a cold blooded killing and a major betrayal leading to an unanswered ending.Talking about unanswered questions there are many puzzles left just that as they are left like that such as why the husband is dysfunctional sexually.The main reason for seeing this movie is the possibilities of seeing a new star emerge in the beginning of her career. Florence Pugh goes from a naïve, shy young girl to a woman who takes control of her life and in many cases those around her and how it changes her.“Lady Macbeth” is a fairly short movie in these days with 2+ hour films in that it only runs 89 minutes, though it does seem longer at times."
    },
    {
      "rating": "7",
      "text": "A haunting and at times brutal psychological thriller, led by the brilliant Pugh."
    },
    {
      "rating": "5",
      "text": "After she killed her father-in-law, it became clear that the movie was just going to steer her towards the path of most evil. It was predictable, and we were never allowed a glimpse inside of her head, or inside of Anna's (easily the most interesting character). Nothing for nothing's sake."
    },
    {
      "rating": "6",
      "text": "Even though this isn't a female take on Shakespeare, the lead character does show tendencies of the titular character. Florence Pugh plays a young woman who's sold into a marriage with a strict husband and a downright mean father-in-law in rural 1860s England. Her spunky spirit and general boredom lead her to defy their commands and take up a lover. That's when her vicious determination reveals her true character. \"Stark\" is the word that comes to mind to describe this film: the period lifestyle, the austere visuals, the subdued performances, no music. They all contribute to a quiet, stern atmosphere that makes matters bleak. This translates into an interesting, if objective story, with an unusual leading character. It lacks much emotion to give the drama any subjective impact."
    },
    {
      "rating": "7",
      "text": "There's no one to stand against her!Based on the Russian novel of the same name. My first guess was it going to be a boring periodic drama. After knowing about the film plot, I anticipated a storyline just like 'Moliere', but what I saw was a dark and twisted tale. I was really surprised to see a film like this. Enjoyed it though. This is not a good film from the moral value aspect. But film is a film, sometimes it just depicts the real life, even it is a fictional, surely it would have had taken place without the world knowing it.Katherine, aka Lady Macbeth, a newly married young woman, but that's not an ideal life any couples want to live. Discarded by her husband, she finds a secret lover among the staffs of the house to satisfy her sexual urges. As expected, it does not go well when gossips comes out. Following the consequences, how the rest of the story unfolds was told with a series of twists.I liked simple settings. Maybe because it was a rural tale, but was so perfect. Florence Pugh has a potential to be a big star. The same goes to the director as well. This is her first film for me. She single handedly made this film look good. Not the year's most anticipated film, but definitely worth a watch. The Russian style British tale. One of the best films from such theme.7/10"
    },
    {
      "rating": "6",
      "text": "Not for the bloody faint of heart mate. Leskov's version quite different with this version as the director adds in elements of both Brit and racial themes that don't come through with the print work. Kat is great, so is Anna and Seb. Strong acting and beautiful scenery. Brutal as heck. At least that is same as novel."
    },
    {
      "rating": "7",
      "text": "First off this struck me as a very atmospheric and eery type watch from the start - it has a looming sense about it. There's noteably little in the way of dialogue, with a fair amount of scenes being set (if just at the start) in silence. This leaves the viewer wondering whats led to what is going on, the motives of people and what might happen etc.It appears very much a symbolic watch, being mostly about the perception of women by men at the time its set in (the 1800s), how worthy their deemed etc. Its decidedly unsettling, with violence present, if only now and again but there's a definite tension present throughout. Its not just the dialogue thats sparse but the rural setting also appears desolate and undoubtedly adds to the atmosphere present. I suppose it acts as a sort of metaphor for the female characters, who feel stuck in their various roles/situations.There are some relatively saucy scenes present, so it may not be an ideal watch to see with family but as an example of an atmospheric watch, its good, just be aware that its a slow moving film, so don't expect slick action scenes or a fast paced plot. Florence Pugh does well in the titular character role, I'd say. Her costumes look quite stunning at times and she comes across as a well thought out character. Overall I'd happily recommend this film."
    }
  ],
  "recommendations": [
    "greta",
    "the_secret_scripture",
    "the_way_back",
    "disobedience",
    "my_cousin_rachel",
    "leave_no_trace",
    "shame",
    "a_hidden_life",
    "stoker",
    "swallow",
    "the_bridges_of_madison_county",
    "personal_shopper",
    "land",
    "unforgettable",
    "frantz",
    "the_dreamers",
    "elle",
    "afternoon_delight",
    "incendies",
    "ingrid_goes_west",
    "the_age_of_adaline",
    "the_witches_of_eastwick",
    "the_lost_city_of_z",
    "melancholia",
    "lion"
  ]
}