{
  "id": 3029,
  "title": "Lady and the Tramp",
  "starring": [
    "Barbara Luddy",
    "Larry Roberts"
  ],
  "runtime": 76,
  "genre": [
    "Family",
    "Animation",
    "Romance"
  ],
  "description": "Lady, a golden cocker spaniel, meets up with a mongrel dog who calls himself the Tramp. He is obviously from the wrong side of town, but happenings at Lady's home make her decide to travel with him for a while.",
  "releaseYear": "1955",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/r9FiDSdBwNHdRwN0NMRrqfEHJGO.jpg",
  "categories": {
    "plot": 8.7,
    "acting": 10.0,
    "ending": 7.5,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 10.0,
    "funny": 10.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is a beautiful film, and one of Disney's finest. It isn't as heart-rending as Bambi, or as entertaining as the Jungle Book, but Lady and the Tramp is solid in both those departments. The animation is lovely, and so are the songs. The Bella Notte scene, is not only the highlight of the film, but it was one of the most romantic scenes in animation history. The only scene that surpasses this, is the Ballroom sequence in Beauty and the Beast, which is one of the finest pieces of artistry I have ever seen on film. The voice talents are a delight too, most notably Peggy Lee, who was the voice of Peggy, Darling, and those diabolical(in a good way) Siemese cats. Barbara Luddy was wonderful also as Lady, a highly convincing animal protagonist. Also worth noting are vocals by Bill Thompson and Verna Felton. And I mustn't forget the really sinister rat, who never speaks, but you really feel angry when it wants to kill the baby, so I felt a great deal of pleasure when Tramp kills it. The glowing eyes did it for me. All in all, a stunning film that is a must-see! 10/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "Lady and the Tramp is the first classic which is starring dogs. It also has nostalgia where man's best friend's are dogs. This is the first film that has widescreen, it's called Cinescope and cinescope has films in cinema's screen that does not move the camera where there's two black lines top to bottom. The scene where the tramp shouts at the beaver by saying ''I SAID A LOG PULLER!'' that made me laugh and the siamese song sang by the siamese cats. There's nothing thrilling about Lady and the Tramp, it's just about dogs who fell in love and all it has is bits of funny moments. The rat scene is vicious and climax and rescuing the tramp is really is something. Yeah, like I said there's nothing more thrilling about it."
    },
    {
      "rating": "10",
      "text": "SpaghettiLady And The Tramp has a lot of memorable characters and scenes (Especially that Spaghetti kiss)."
    },
    {
      "rating": "7",
      "text": "It's sooo cute (and racist)! An original story realized in Cinemascope for the first time. With its 76 minute runtime this is not a minute too long."
    },
    {
      "rating": "10",
      "text": "Two dogs in loveBut it's a lot more than that. For 66 years now, \"Lady and the Tramp\" has won a devoted following based on a love story that could have worked out just as well with live-action and a romance, but here we have it with two dogs - a pampered cocker spaniel and a street-wise mutt. \"Lady and the Tramp\" contains the kind of innocence and love story that is unfamiliar with our times today, and it is good to see a masterwork from a bygone era.I was only a kid when I first saw \"Lady and the Tramp\" but I still remember that famous kiss scene, you know the one where the two leads are having a beautifully romantic spaghetti dinner and they take hold of a single string of pasta and consume it, unknowingly bringing their faces together in an unwitting kiss. It's remained with me up until now.I'm a sucker for love stories and \"Lady and the Tramp\" works, despite its animal characters and Walt Disney family-friendly touch. Lady is the cocker spaniel, who is a gift to a woman from her husband. Lady adores her surroundings and receives the requited love of her owners and a nice home. Six months later, that love hasn't diminished and she is a newly licensed pet. But it's misplaced when she learns that her owners are expecting a child, and suddenly Lady has been unwittingly pushed aside to make room for a new bundle of joy.From the wrong side of the tracks, it's the street-wise Tramp, a known lady-killer who wins Lady's heart after saving her from other common street dogs. They really hit it off, climaxing with the aforementioned romantic dinner and a wonderful animated shot of the moon from a lover's point. Along for the ride are Trusty, a hound dog with a busted sniffer; Jock, a Scottish terrier; and Si and Am, the two sneaky Siamese cats belonging to the husband's snooty aunt.Directed by Clyde Geronimi and Wilfred Jackson and featuring the voices of Peggy Lee, Barbara Luddy and Larry Roberts, the newly restored DVD version with the Platinum Series is the one to get and cherish. I got mine at a Best Buy store today to take advantage of this limited release, and to win a free Tramp plush toy.I would guess that time has been good to \"Lady and the Tramp,\" if a love story of this pedigree is truly worth the praise due to it. I would recommend this Disney classic to any possible female romantic interest as part of our date... if I could land one."
    },
    {
      "rating": "5",
      "text": "quote me \"where 40 minutes in and its just  love story \"i know its the movie but its boring till the climax"
    },
    {
      "rating": "7",
      "text": "La animación es bellísima; la música es muy bonita y los personajes son carismáticos; una muy linda película."
    },
    {
      "rating": "5",
      "text": "I'm not into animation. It's a good romance story. I'm not really into watching dogs fall in love. Although it is cute,but not interested in ever watching this again."
    },
    {
      "rating": "10",
      "text": "One of my all-time favorite movies from my childhood. It is such a classic."
    }
  ],
  "recommendations": [
    "labyrinth",
    "the_aristocats",
    "the_hunchback_of_notre_dame",
    "the_little_mermaid",
    "enchanted",
    "aladdin",
    "snow_white_and_the_seven_dwarfs",
    "the_fox_and_the_hound",
    "tarzan",
    "finding_nemo",
    "tangled",
    "a_street_cat_named_bob",
    "letters_to_juliet",
    "sing",
    "dirty_dancing",
    "mary_poppins",
    "brother_bear",
    "the_princess_and_the_frog",
    "toy_story_2",
    "brave",
    "winnie_the_pooh_blood_and_honey",
    "mulan",
    "pocahontas",
    "the_many_adventures_of_winnie_the_pooh",
    "moana"
  ]
}