{"id": 1560, "title": "Lady Bird", "starring": ["Saoirse Ronan", "Laurie Metcalf"], "runtime": 94, "genre": ["Drama", "Comedy"], "description": "Lady Bird McPherson, a strong willed, deeply opinionated, artistic 17 year old comes of age in Sacramento. Her relationship with her mother and her upbringing are questioned and tested as she plans to head off to college.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/iySFtKLrWvVzXzlFj7x1zalxi5G.jpg", "categories": {"plot": 7.033898305084746, "acting": 7.418918918918919, "ending": 7.0, "soundtrack": 7.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 8.5, "action": 9.0}, "reviews": [{"rating": "10", "text": "As far as indie dramedies go, this is one of the best I've seen. Greta Gerwig's writing and direction are very natural, creating funny characters you actually care about and a unique point of view. Everything works in the movie and was clearly thought out, made with love and intelligence. Highly recommended."}, {"rating": "7", "text": "If I have to be honest, the movie was not particularly interesting. Personally, I appreciate, that it is related to real life, maybe not only related, but also it represents the picture of most people's lives - not knowing who you are, strange relationships and everyday struggle with family members and friends, problems in school and in finding university and intimate life. So, I appreciate the focus on that. It's teen drama though. It says the movie is drama and comedy, didn't rally feel the comedy there. \"Yes, I gave that name to myself. It is given to me by me\" - that was fun haha! Anyway, I am used to teen comedies and I didn't get that movie as comedy.  Somehow, soundtracks weren't enough and the script wasn't something special. Overall, it was a bit chaotic."}, {"rating": "7", "text": "Lady Bird probably isn't winning any Oscars but it's a great coming of age story. Written and directed by Greta Gerwig and starring Saoirse Ronan, Laurie Metcalf, Lucas Hedges and Timothée Chalamet. I've never been a massive Saoirse Ronan fan but she played this part perfectly. Timothée Chalamet is so insignificant I almost forgot he was in the movie, Lucas Hedges gives another great performance but for me it's Laurie Metcalf as Lady Birds' mother who stands out above the rest.Christine \"Lady Bird\" McPherson is in her final year of school in Sacramento, California. Longing to move away from her home and to where \"culture is\" the story follows her and the every day problems facing a seventeen year old girl. Lady Bird is a very emotional movie not only because it deals with issues many of us can relate to but it's one of those films were the acting gradually disappears and you feel like you're watching real people with real problems. Lady Bird's relationship with her mother played by Laurie Metcalf for example is perhaps the strongest element in the movie. An onscreen relationship that from the very opening scene feels remarkably genuine. Laurie Metcalf gives a brilliant performance, and will definitely hit you with all the feels. There were a couple of ideas brought into the story that were dropped and had no follow up and for me the ending was a little dissatisfying. I found this quite frustrating but Lady Bird is a great coming of age movie that you're sure to enjoy. Highly recommended."}, {"rating": "8", "text": "Lady Bird is a pretty good coming of age movie. I don't know that its worth all the praise its getting. Its got really good acting and performances, the story and themes are well written and presented, but it doesn't really do anything new with the coming of age genre."}, {"rating": "5", "text": "Greta Gerwig could be a very good director soon, but i doubt she will be a good screenwriter in the close future. The plot of the movie is full of cliches about teenagers badly executed. So we have the popular mean girl, the fatty loser, the gay dude with intrest in theater, the edgy anti capitalistic kid and so on. Everything seems fake."}, {"rating": "7", "text": "It was pretty good, but nowhere near as good as people were saying when it originally came out. I think it connects with a lot of people's personal experiences in adolescence, but in my opinion it lacks any really new perspectives that haven't been done before."}, {"rating": "7", "text": "The movie is so realistic. The dialogues are excelent, and the acting gives them a plus. Sometimes the characters are fighting and 5 seconds later they are laughing, just as real life.The direction is good. I had some issues with the script, making characters appear at the half and some sub-stories have not a end. Is not the most original movie i've ever seen but neither the less. I think that if it was a serie, it could have been better."}, {"rating": "9", "text": "This movie just kinda got teenage emotion in the bag, it made me feel nostalgic over anything and I would definitely watch it again."}, {"rating": "6", "text": "Lady Bird was just eh, good. It was okay. The actors were great and I was fully interested in what they were doing, until the movie decided to not be creative and in cliche. Sorry, I don't care for another high school story, where the main character ditches her best friend just because she wants to hangout with the cool kids (SNORE). The cinematography wasn't bad, but it was pretty repetitive and bland as the film progressed. The directing the pretty standard and the writing just felt mediocre. In the end the actors helped lead the story in a non destructive way, so it kept me interested. If you're looking for a simple and funny coming of age high school film, then I would recommend this to you. If you're looking for something more creative and visually pleasing to look at, then I don't think this movie is for you."}, {"rating": "10", "text": "Greta Gerwig manages to take cliches from a typical coming of age story, and turns it into so much more. Each character, no matter how insignificant, is well developed, and very relatable. Saoirse Ronan and Laurie Metcalf's performances will make you emotional and reminiscent of your teen years."}, {"rating": "8", "text": "Moving behind the lens this time around, Gerwig's vision of the indie drama-comedy is a fully realized sketch of 21st century coming-of-age narratives. Simultaneously courageous, witty, and frustrating, the performances and script make this a charming film bursting with talent every step of the way."}, {"rating": "8", "text": "Christine McPherson (Saoirse Ronan) está no último ano do ensino médio e o que mais deseja é ir fazer faculdade longe de Sacramento, Califórnia, ideia firmemente rejeitada por sua mãe (Laurie Metcalf). Lady Bird, como a garota de forte personalidade exige ser chamada, não se dá por vencida e leva o plano de ir embora adiante mesmo assim. Enquanto sua hora não chega, no entanto, ela se divide entre as obrigações estudantis no colégio católico, o primeiro namoro, típicos rituais de passagem para a vida adulta e inúmeros desentendimentos com a progenitora."}, {"rating": "9", "text": "A beautiful bildungsroman wonderfully performed by the lead actress Saoirse Ronan."}, {"rating": "9", "text": "I watched all the Academy nominees' films and I need to win this award for me. I enjoyed every minute of it was a wonderful film, a great screenplay, excellent acting all very good players in the future. The film was quite realistic and it should be in a movie as if it was a real life I felt like I was living in a young girl I was fully aware of the years of puberty. If I were a member who voted in the academy, I gave it to the best movie award for the lady bird. I would like to thank everyone who has passed the test in this film I enjoyed it very much"}, {"rating": "10", "text": "Hands down, one of the best films of the year. Lady bird is a fearless, original, bittersweet, and intricate coming of age story between a girl and her mother. Slammed to the brim with meaningful moments, heartfelt emotion, and absolutely breathtaking acting, \"Lady Bird\", is a flawless film, and absolutely astonishing first film from talented actor-director Greta Gerwig."}, {"rating": "10", "text": "Lady Bird is a funny witty and intelligent movie. I loved every minute of it. Greta Gerwig wrote a heartfelt and profound movie that describes this special mother-and-daughter relationship. It feels authentic. I loved it!Go and see Lady Bird! Way to go Greta Gerwig"}, {"rating": "10", "text": "Hollywood should be embarrassed when they see a lovely low budget movie like this with sincerity humor and purely entertaining characters from real life.This is called art. Its called heart. Its what is missing in so many movies now. A clear voice expertly directed and acted and presented to the viewer with ease. Bravo."}, {"rating": "8", "text": "This was without a doubt a charming and wonderfully acted, albeit a bit been there, done that, by the numbers coming-of-age dramedy from indie darling Greta Gerwig (an impressive directorial debut). Saoirse Ronan shines like usual as the titular nicknamed character, along with honest and often times heartfelt performances from her parents played by Laurie Metcalf and Tracy Letts. The writing and direction from Gerwig was witty and spot on quite often. However, like I said, it didn't really transcend or bring too much new to the table in terms of high school/coming-of-age comedies. Despite this however, the film contained a lot of heart and undeniable charm and humor throughout overall. Definitely worth seeking out."}, {"rating": "7", "text": "Lady Bird gives an admirably honest look at adolescence, family, relationships and the importance of being yourself, while managing to stay surprisingly grounded and authentic. The acting overall is pretty great with some real stand-out performances by Laurie Matcalf and Saoirse Ronan. Unfortunately the story lacks the originality to transcend its genre, but as a coming of age movie Lady Bird is really good, probably the best of its kind since Juno. Even though I absolutely loved Greta Gerwig's writing and humor, overall I kinda felt like Lady Bird was just not really for me. Still I'd wholeheartedly recommend it."}, {"rating": "6", "text": "One more case in which I must row against the current and discover something that a person who had already seen this movie told me, apparently you cannot give a negative opinion about this film and considering what I have seen now that I have finished it, I will undoubtedly be crucified by many, but being quite honest for everything they mentioned about it and the huge avalanche of positive reviews it received, in my personal opinion, Lady Bird is one of the biggest disappointments of the year and yes, is perhaps the most overrated movie of the year along with Get Out.Lady Bird tells the story of Christine \"Lady Bird\" McPherson, a young woman who lives in Sacramento in 2002, regardless of certain narrative resources that the movie does not need to use, like social networks and smartphones, the time frame in which the film takes place it couldn't have been more irrelevant.My biggest problem has to do with the main character and when something like that happens, you know it's serious, personally my adolescence flew away many years ago, but for me now as then it would be quite clear to expose Christine as a spoiled, selfish and narcissist brat that at all times and in all situations, she only thinks about herself. Everyone is wrong except her. She also lives complaining about the life she has while doing nothing to change her environment beyond the fact the she's trying to enter an out of state college just to leave the place where she feels locked up, not caring at all that her parents are facing financial problems and have made it clear that supporting her financially is not an option, but she doesn't care because like in many other coming of age films, the ''teenagers'' believe they are being repressed in their place of origin and so their talents are not properly exploited. Cliché and repetitive.The true strength of the film and the story in general lies in everything that surrounds her, that's the best reason to see Lady Bird because most of those characters have more serious problems and forge what she does regardless of whether she believes that's not the case, starting with her mother and her father, it's true that her mother presses too much, but come on, you have to be honest, it's not like Lady Bird leaves her with so many options with her childish tantrums.Her father is unemployed and struggling with depression trying to provide for her family and yet Lady Bird's concerns lie in what she will do, avoiding helping in any way.Her boyfriend, her best friend, the guy with whom she loses her virginity, her momentary and popular friend, her adopted brother and her girlfriend, all form a protective halo in a narrative mode because it's the conflicts of those characters what sustain this movie, otherwise Lady Bird wouldn't have been more than just a movie of another teenager incapable of deciding what she hopes to do with her life and that situation has is been seen already too many times in both cinema and real lifeThe film gets recomposed in its final section where the character absorbs a bit of maturity and enters a new stage of her life, the ending makes it clear but until that point we can only infer what will be of her in the future and perhaps she will become a better person and certainly then she could have been a better character, but it wasn't the case and for me that diminished my enjoyment and enthusiasm for the film in a big way.I admit that Saoirse Ronan does a good job, but on front of such script, unfortunately the character doesn't stop being annoying. She manages to give it a little more strength for being a great actress, otherwise I think that the character would have been lost miserably.Greta Gerwing delivers a film that looks good, that has an uneven but sustained rhythm. She manages to take her first film to a safe harbor but if she really wants to continue making films as a filmmaker, she needs stronger scripts."}, {"rating": "4", "text": "I don't quite understand the hype. I found the movie pretty boring, clichéd, and immature.The new boyfriend is gay... how original, how shocking. The fat, poor friend is kind and loyal, while the pretty, rich friend is a jerk...For about half an hour, I expected the movie to really 'start'; then I realized it would never 'start', and I just waited for it to end."}, {"rating": "9", "text": "Lady Bird is a compelling and very funny female coming of age story. Every joke hits and the performances by the actors are great. The film follow's \"lady bird's\" progression during her senior year of high school through the beginning of college. The acting is superb and the film does a great job broaching subjects such as poverty, friendships and even a small coming out story in the middle of it without being preachy in any way. The fact that this was a writing and directorial debut makes me very excited to see what Gerwig does next!"}, {"rating": "10", "text": "Absolutely loved LADY BIRD. It was refreshing to watch a film that has zero violence or CGI. Saoirse gives another fantastic performance along with Laurie. The supporting cast are all fantastic too. Gerwig wrote a robust script along with her solo debut as a director. I hope she directs & writes more because these are were her strengths are in my opinion. It was nice to see the working/middle classes depicted with such realness too. 10/10"}, {"rating": "10", "text": "Just about perfect. Will surely land Saoirse Ronan her third Oscar nomination, and better land Laurie Metcalf her first (how could that be correct?) and Greta Gerwig a directing nom for this stunning debut. Gerwig, a fine actress, somehow transcends the cliches of the coming-of-age story and makes Lady Bird feel like something entirely fresh. Hits every note perfectly."}, {"rating": "10", "text": "Lady Bird is a beautifully told coming-of-age drama filled with genuine comedic moments and emotional, thought-provoking conversations.Tightly edited, the movie feels balanced and honest; and at the end, it makes you want to linger a little longer with the characters after the credit rolls."}, {"rating": "10", "text": "One of the best films of the year for me! Gerwig's depiction of a mother-daughter relationship is so spot-on. Strong performances from Saoirse, Laurie & supporting cast. An enjoyable tale of family,friendship and home!"}, {"rating": "10", "text": "Lady Bird is an incredibly fresh coming of age story, a love letter to growing up in Sacramento and an incredible directorial debut by Greta Gerwig. The story of Lady Bird is so simple and ordinary, and yet the stakes are so high. We are given a small glimpse into a girl's life during her senior year of high school. The strengths of Lady Bird are a very strong script and very strong characters. The characters all felt like real people I had encountered in high school, and I found myself feeling very connected to Lady Bird's character and I strongly identified with her high school struggles. Millenials will really love this one! The silent scenes in the film almost speak louder than the dialogue heavy scenes, which is quite a feat as the dialogue is so natural! I will say that Lady Bird didn't quite hook me right away like some of the other Oscar offerings this year, but once the slow build finished, I was with the movie every step of the way. This is going to be one to remember."}, {"rating": "10", "text": "One of my favorites of the year! Greta Gerwig's direction felt very natural; she created amazing characters. The scenes are very fast-paced so no scene drags. Saoirse & Laurie are remarkable and definitely awards worthy. The supporting cast are fantastic too. Jon Brion's score is beautiful."}, {"rating": "10", "text": "I Know Why \"Lady Bird\" Sings.....Greta Gerwig's \"Lady Bird\" is a captivating tale of love, life and coming of age. Christine McPherson (Saoirse Ronan), a 17 year old self proclaimed 'lady bird' feels caged in her small community hometown of Sacramento, California.New York City street lights, glossy magazine inspired beauty, the illusive enchantment of fairy tale love and an irrepressible penchant for sophisticated affluence beckon Lady Bird to spread her wings and soar into horizons of no dreams deferred and the undisguised voyage of life.A beautiful, kaleidoscopic journey of chasing personal passions, conquering defeat and rising to the challenge, \"Lady Bird\" is a must see.#ILoveLadyBird"}, {"rating": "10", "text": "Finally a movie that is Really Real. America is giving a big Middle finger to all the predators and rapists pumping that the pipeline of brainwashing sewage out of Tinseltown. Burn Hollywood Burn."}, {"rating": "9", "text": "This is a great film.  The acting, writing and directing are superb.  This is a character and place study.  There is no real action or dramatic arc.  But, there are a number of really interesting and relevant experiences of the main character, her reaction to, and her growth from, those experiences is the narrative.  The relationship between Lady Bird and her mother is the most poignant part of this lovely film."}, {"rating": "9", "text": "Lady Bird is a smart satisfying treasure that puts Writer Director Greta Gerwig on the map. The film plays almost as a real life story between a mother played by Laurie Metcalf and her daughter played by Saoirse Ronan. Both are fabulous and there are even supporting performances by Lucas Hedges and Tracy Letts that create this feeling of a real life teenagers life. This is a dynamite film. A"}, {"rating": "3", "text": "Note that I am neither a Californian nor an American. Nor am I a female for that matter. I watched this movie expecting so much, especially after numerous critics named it as their favorite movie of the year. But I must say that I felt nothing from it. I didn't find it moving, funny nor insightful. The movie was competently made as I never felt it was the work of a first time director. But other than that, I found that there was nothing original about the movie. The acting was well done, but nothing that would blow me away. I even tried watching it for a second time in case I'm missing something, but even after the second try I still felt nothing. I'm guessing all the adoring reviews were written by people who can relate to the experience told in Lady Bird. If not that, I absolutely fail to understand how this movie could a 94 critic score on metacritic (or even the 6.9 user score for that matter)."}, {"rating": "3", "text": "Sincerely, what is this crap doing in the oscars? Not only because the films is REALLY bad (30 minutes through and I was begging it to end), but it doesn't have an \"oscar vibe\", it's just another stupid school movie + \"american family\" movie like so many others out there. It didn't deserve even ONE of the nominations, except maybe for best supporting actress (being nominated for best movie, best screenplay and best direction is absolutely bizarre)Full of empty, shallow dialogues, useless scenes, subplots that are immediately abandoned (it reminded me of The Room), and a lot of boring, stupid characters that are completely unlikable (except for the father). The screenplay and edit are TERRIBLE.I had already not liked Brooklyn, and didn't find Saoirse Ronan's acting so great then (that movie also sucks), but her nomination for best actress is another thing I can't understand. Not only her acting is just \"meh\", she is totally unconvincing as a teenager school girl."}, {"rating": "10", "text": "A coming to age story that seemed so familiar, felt so original in Greta Gerwig’s debut film as a solo screenwriter-director. This film has blown me away and might be the best film I have seen all year. It is full of sincerity and wit that kept me laughing the whole way. Greta Gerwig has created characters that have never felt more real on the screen. The film’s focus is on the struggle between its two lead female roles, effortlessly acted by Saorise rose, who plays a 17 year old adolescent eagerly trying to escape her hometown of Sacramento, which she referred to in the film as “the Midwest of California”, and her strong willed mother Marian Mcpherson, played by Laurie Metcalf, a psychiatric nurse struggling to make ends meet amid economic hardships of the early 2000’s and after her husband, Larry Mcpherson, played by Tracy Letts, loses his job. During her senior year at a private catholic high school, Soarise Rose’s character, Christine McPherson, who prefers to be called “Lady Bird”, yearns for new experiences as she continues to form new relationships and friendships throughout the film. Her venturesome personality has overcome Christine’s will to find common ground with her mother, who is more of a realist and wants Christine to understand the poor financial situation her family is in and the obstacles present that prevent Christine from traveling away for college. Her mother coldly pushes this mentality on her daughter, but fails to demoralize Christine from wanting more, and fighting, though not fully driven academically, to gain admission and financial aid to attend an east coast university, where she might “find more culture”, through the assistance of her clinically depressed father who is more sympathetic of Christine’s ambitions. Soarise Rose’s character is a great depiction of the compulsive and pleasure-chasing mind of an adolescent that will have you feeling nostalgic and emotionally attached. Nothing about these characters are cliche. Their dynamic personalities, perfectly portrayed on screen, will have you anxiously wanting to continue following the rest of their stories."}, {"rating": "6", "text": "Enjoyable but unoriginal. Lady Bird is a well made coming-of-age story, but it doesn't bring much new to the table. Set in 2002, it feels like a nostalgic teenage movie, as though it's 15 years to late for the Gen Xers, and it doesn't adapt the genre to deal with more modern teenage issues. There are no glaring weaknesses, except perhaps the father character who is played completely one-note throughout the film. It was never boring, but I don't expect Lady Bird will stick in my mind like other similar films."}, {"rating": "9", "text": "You've seen these 200X coming of age stories before.  This one is just done pretty f*in well.  Heart. Quirk. Slice of life dished out over time with characters that feel like they belong."}, {"rating": "9", "text": "This movie seemed very similar to last years \"Edge of 17\".  And to be honest it is VERY similar in the concept, but the execution is VERY different.  This film takes itself much more seriously than the aforementioned Edge of 17.  This movie follows Christine \"Lady Bird\" as she tries to navigate her last year of high school.  I would highly recommend this movie as it really portrays the \"Average\" high school experience for confused teens in our day.This movie will not be for everyone, BUT from a pure film aspect it is brilliantly shot, the acting is excellent, and the dialog is eloquent and keeps your attention well."}, {"rating": "7", "text": "A mildly amusing, sometimes-surprising, occasionally observant coming of age story that entertains for the most part but that actually seems more preoccupied with its own sense of rampant quirkiness than telling a cohesive, cogent story, as is the case with virtually every Greta Gerwig project (even though she's doing her work behind the camera this time). Enjoy the fine performances by Laurie Metcalf and Saorise Ronan (even though she seems a bit old to be playing a teenager), and laugh at the offbeat, unexpected humor, but don't expect groundbreaking cinema from this somewhat-overhyped offering. One can only watch these kinds of movies so many times before the formula really starts to get stale."}, {"rating": "8", "text": "This is a good movie, but for some reason, it left me a little cold.  I do not know if it is because I don’t have a daughter or if I just didn’t care enough for the characters.  It could also have been because my expectations were so high based upon all the reviews.  Anyway, I enjoyed it and wasn’t bored and that is good.  But, other than that, it was just okay for me."}, {"rating": "8", "text": "Nobody escapes adolescence unscathed.  For those who wish to re-live the experience, nobody does a better job at capturing those puerile years full of emotional yearning and social dread than America's indie princess, Greta Gerwig.Gerwig's writing is invariably grounded and concise--she's the Hemingway of film.  It complements the small yet densely textured worlds that she creates and explores, reminiscent of those artists who paint miniature landscapes that need to be admired through a magnifying glass.'Lady Bird' is more than just the continuation of Gerwig's impressive filmography.  It's her quintessential film.  The dialogue is crisp, Saoirse Ronan's performance is sublime, and the story hews to the inextricable mix of tedium and drama that encapsulate one's senior year of high school.  Even if the movie doesn't garner much attention come awards season, it'll at least serve to further elevate Gerwig's status as America's preeminent indie darling."}, {"rating": "4", "text": "All four stars go to Saiorse Ronan on this one. It's a great performance, but the story is lacking. Nothing really happens, which isn't always the worst thing that can happen. I'm all for atmosphere and light on story if it's done right, but this comes off as a knock-off piece of Boyhood to me."}, {"rating": "7", "text": "Saoirse Ronan gives one beautifully transparent performance after another -- whether playing a confused/conniving younger sister or a trained assassin. So I like what she brings to this, and there's a \"real\" feel to the other acting, as well. However, it brings nothing new to the coming-of-age genre. I also feel there's been too little mention of the downright abusive nature of the mother's (Laurie Metcalf) behavior. You HOPE the girl will get away!"}, {"rating": "6", "text": "I went into Lady Bird after all of the hype. The movie is interesting. I would say that all of the actors and actresses do a really nice job playing the roles they have been given. The hard part is that some of the characters are quite unlikeable. Lady Bird is just all over the place. She is self entitled, selfish, and just straight up weird. Saoirse Ronan is a great actress, but I often was taken out of scenes because she is clearly so much older than the role she is playing. I know 20 year olds routinely play high school kids, but something about her appearance makes her look even older. The movie also doesn't really have a plot. It is a good snapshot of what it is like to be Lady Bird. The movie just doesn't deserve the 9 and 10's critics have been giving it. I chalk that up to a couple factors. One is that Lady Bird is obsessed with New York and moving to where there is more \"culture.\" This feeds into the elitist mindset of many critics. The other is that the main character and the director are women. Again, most reviewers have a liberal bias and this will buy the movie a couple extra good will points."}, {"rating": "8", "text": "It is very reminiscent of the innumerable amount of \"coming of age tales\" that have been instrumental in the sphere of popular movies. It is dissimilar enough from the legions of others to the point where it becomes an exceptional film. It uses classic Oscar bait tactics like humor to build a strong relationship between that of the titular \"Christine\" and the viewer. Although a cheap way of doing, so the humor is never dry and most of the jokes hit as intended. The film is also a lovely diorama of the teenage experience; bringing up problems and insecurities that almost every teenager has experienced at some point. It is noticeably geared toward a female viewer, however; as a guy I could still draw parallels between shared experiences with the characters. Overall, this film is a sentimental and human journey through the senior year of a young girl. It may not have the exceptional grasp of realistic dialogue of a Baumbach film, and it may not have the cinematography of a Paul Thomas Anderson film, but it carries the same emotional punch as films such as the royal tanenbaums (without the sense of closure -- mild spoiler)"}, {"rating": "10", "text": "Brilliantly captures that beautiful bubble of transition between dramatic teenage years and adult maturity, combined with a realistic and wrenching portrayal of complicated familial love."}, {"rating": "2", "text": "Professionally made but not worth seeing. I don't understand all of the rave reviews, nothing about this story is either interesting or captivating. Or believable. The characters are not likable, the story isn't funny, nothing about the film makes you care what will happen next. Odd what critics like."}, {"rating": "7", "text": "“Lady Bird’ is the first writing/directing effort by actor Greta Gerwig as she casts and directs Saoirse Ronanas in the role of a young and rebellious Catholic teenager with Laurie Metcalf and Tracy Letts as her parents. This is a quality coming of age film with Ms. Ronan (who won an Oscar nomination for her role In “Brooklyn”)  portraying the daughter of a caring and sometimes dominating mother (Laurie Metcalf). The acting is outstanding and must in some way be attributable to the directing talents of Ms. Gerwig. The title of the film might make one tend to think it was about Mrs. LBJ but it’s simply the name this rebellious teenager wants to use in her quest for freedom and liberation from her Sacramento environment. Set in 2002 the movie delves into the relationships of teenagers with their peers, their parents and their teachers and, in its own charming way, helps us, as adults, to perhaps understand them better. I give the film an 8 and suggest that both young and old alike will enjoy it."}, {"rating": "9", "text": "I go back and forth between a 93% to a 97% but I'm feeling generous! If you know how Rotten Tomatoes works, then I think it completely makes sense that it has that 100% because  it's a very likable film with a lot of heart. I went with my mother, father, and one of my sisters and we all really enjoyed it which is certainly not always the case.I think that both the characterization and the acting were superb in making real characters. Nobody felt like a plot device and or straightforward. I can't even tell you who I think the best actor was because I truly think they all did a great job at capturing emotions in a realistic and captivating manner. The humor was not all that inventive, and most of the jokes have been done on sitcoms, but I laughed out loud. There are moments I will find something hilarious and I'll either try to make myself laugh or stay silent. That was not the case in Lady Bird. I was genuinely laughing and the rest of the audience was too.I think tonally, it's like The Way, Way Back but I admit I only saw a chunk of that movie on an airplane. So, if I'm totally off, I apologize. But, I found it to be a very realistic coming of age movie with very very real desires and actions of Lady Bird. I admit, this being marketed as Oscar Bait was what got me in the theatres but I do wonder if that is the way they should've gone with this movie because if more teens were exposed to this movie, I think they would love it. Then again, I genuinely think anyone would at least like this movie. Does it have Oscar potential? I think as of now it definitely deserves at least a screen play nomination if not the award but I think it might be too plain for a best picture. Even though I think the acting is spectacular, I'm not sure there were any roles that were unique enough to get the nomination."}, {"rating": "0", "text": "Why is this sort of behavior so pushed these days?Like we have to be astounded by idiotic renegade behavior.Like we need more fkups on this planet.Female character is represented as someone who will probably be a horrible person once she grows up (she is terrible now).I don't know how this is interesting to anyone,why is it cute or why would anyone perceive this girl as a great character.The story of no discipline could be an alternate title.."}], "recommendations": ["the_spectacular_now", "the_edge_of_seventeen", "the_perks_of_being_a_wallflower", "the_intern", "the_glass_castle", "me_before_you", "me_and_earl_and_the_dying_girl", "the_florida_project", "gifted", "the_fault_in_our_stars", "young_adult", "moonrise_kingdom", "blue_valentine", "captain_fantastic", "closer", "20th_century_women", "wonder", "the_age_of_adaline", "marriage_story", "the_descendants", "the_big_sick", "silver_linings_playbook", "the_help", "midnight_sun", "manchester_by_the_sea"]}