{
  "id": 3800,
  "title": "Lamb",
  "starring": [
    "Oona Laurence",
    "Ross Partridge"
  ],
  "runtime": 93,
  "genre": [
    "Drama"
  ],
  "description": "Lamb, based on the novel by Bonnie Nadzam, traces the self-discovery of David Lamb in the weeks following the disintegration of his marriage and the death of his father. Hoping to regain some faith in his own goodness, he turns his attention to Tommie, an awkward and unpopular eleven-year-old girl. Lamb is convinced that he can help her avoid a destiny of apathy and emptiness, and takes Tommie for a road trip from Chicago to the Rockies, planning to initiate her into the beauty of the mountain wilderness. The journey shakes them in ways neither expects.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aj0pgKR4dWlRRb1Q05JGQtwxHbj.jpg",
  "categories": {
    "plot": 8.5,
    "acting": 9.0,
    "ending": 9.0,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "A simple story about a man and a kid. Nothing really exciting happens but it keeps me engaged throughout, constantly wondering about the tense yet affectionate relationship between these two characters. Beautiful music and scenery helps convey the kind of mood in the film. I like it. I can't understand the motive of trip, but the strong bonding between them feels real; after a week travelling together. Ending was rather sad."
    },
    {
      "rating": "9",
      "text": "An amazing film, and a great way to be welcomed back to seeing serious movies again. The best way to describe it, I guess, is as a preternatural film – a thoroughly believable film which initially seems unnatural, until the very end where one final image explains everything."
    },
    {
      "rating": "8",
      "text": "Lamb's fun to watch and enjoy. Lamb exactly tell a simple story about a man and a girl. Eye-seeking moments should keep you from staying on your seat to enjoy this movie."
    },
    {
      "rating": "9",
      "text": "I found this a surprisingly moving and mysterious film. While it does sound like and kind of is a bit of a Lolita type tale, it's not entirely sexually provocative or explicitly graphic.tacky. I thought the young child actor, Oona Laurence, gave a very good performance, she's certainly very emotive and there's some good dialogue present definitely. There's also some pretty good cinematography present, with nice sweeping landscapes depicted. The context of what happens isn't clear for quite a while and it's all a bit strange but slowly we start to get an idea of why he's doing what he does. This is a quirky, intriguing watch - a somewhat random but a good watch certainly, yes, so I'd recommend it, yes, for Oona's performance if not for anything else. It may stay with you for a while."
    }
  ],
  "recommendations": [
    "the_rover",
    "thoroughbreds",
    "last_night_in_soho",
    "maleficent",
    "hugo",
    "the_illusionist",
    "blue_valentine",
    "walking_out",
    "five_feet_apart",
    "the_age_of_adaline",
    "a_simple_favor",
    "ammonite",
    "snow_white_and_the_huntsman",
    "split",
    "the_neon_demon",
    "black_swan",
    "soul",
    "20th_century_women",
    "the_killing_of_a_sacred_deer",
    "her",
    "the_ballad_of_buster_scruggs",
    "enemy",
    "unbreakable",
    "cashback",
    "the_fly"
  ]
}