{
  "id": 3005,
  "title": "Land",
  "starring": [
    "Robin Wright",
    "Demián Bichir"
  ],
  "runtime": 89,
  "genre": [
    "Drama"
  ],
  "description": "Edee, in the aftermath of an unfathomable event, finds herself unable to stay connected to the world she once knew and in the face of that uncertainty, retreats to the magnificent, but unforgiving, wilds of the Rockies. After a local hunter brings her back from the brink of death, she must find a way to live again.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6pYhDPzYPGKvDYpxdf0IUE3RDAS.jpg",
  "categories": {
    "plot": 4.833333333333333,
    "acting": 4.666666666666667,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "One of the more thoughtful films to grace the screen in 2021 ‘Land’ features a standout turn from Robin Wright as both performer and director. She’s given admirable support from Mexican-born co-star, Demian Bichir - with the rugged Wyoming locations lovingly captured by cinematographer Bobby Bukowski.  This is one for those who are not attempting to hide from reality but want to steep themselves in the everyday truths of life and in this case, life in the land at its wildest.No superficial love story here but a survival learning curve (suicidal even) chosen by a city woman to overcome a great loss and the unexpected alliances that develop on her journey.  Lovers of serious personal introspection will easily tune into this curiosity but it might not suit comic book action fans. Music is also well used, adding another dimension to the settings.An afterthought: Without the Animals of the forests, survival is never guaranteed; it would have been powerful if the script included some appreciation towards these marvelous creatures for the sacrifice of their lives.  Note: If not yet having seen this movie but intending to do so, skip the following last line to avoid a possible spoiler: This woman lost her family to the mindless actions of a random shooter, so her use of the gun for hunting would have had profound implications."
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)Robin Wright directs herself in her first work to tell how a woman of his type, belonging to the upper class, manages the mourning, renamed in the end credits PTSD, of her perfect family, husband and son: she retires to an isolated cabin in the wild nature of Wyoming Rockies trying to restart from the survival instinct, and recovers vitalism after meeting a sort of soul mate. Recommended only for those who share a similar social background."
    },
    {
      "rating": "1",
      "text": "Totally crappy hard to follow plot and wooden acting. Pass this one up?! Peeeee-you!"
    },
    {
      "rating": "6",
      "text": "Robin Wright plays a woman who’s haunted by a tragic incident. She determines to move to the Northwestern wilderness and live in a cabin with no electricity or water.  Of course, she encounters all manner of challenges from wild animals to inhospitable weather. In one of the film’s several unlikely moments, a hunter (Demián Bichir) discovers her close to death and teaches her how to survive (literally and figuratively). Wright keeps her portrayal subtle, which could be because she also directed the film. She also allows the pace to slow with at least 5 minutes of stunning scenery and nature shots. While some aspects of her situation push credibility, her character’s gradual improvement is evident and the final moments are rewarding."
    },
    {
      "rating": "7",
      "text": "When a woman's life falls apart, she's at a loss to repair it or to share her pain with others, circumstances that prompt her to emotionally and physically withdraw and, subsequently, to move to the Wyoming wilderness, a place where she can choose to live -- or not -- despite the intervention of Samaritans who want to help and give her hope. Actress Robin Wright's feature film directorial debut tells this heart-tugging story capably, even if somewhat conventionally and with character development that definitely could have benefitted from supplemental strengthening. Nevertheless, thanks to Wright's strong lead performance, stunning cinematography, nicely sustained pacing and a solid finish, this offering certainly shines in the areas where it matters most. This may not be earth-shattering filmmaking, but it's certainly an impressive start to a budding career."
    },
    {
      "rating": "5",
      "text": "Discreet behind-the-scenes feature film debut for Robin Wright.It's very clear that she learned and improved a lot in the episodes she directed on House of Cards, but let's just say she had better writers and better editors there, because even though her movie is emotionally genuine, in terms of pacing, the story falls off quite a bit, and even stagnates in several passages.For a 90-minute that's not something good.It wasn't bad, but it could have been better."
    },
    {
      "rating": "1",
      "text": "I'm sorry, but I couldn't make it past about a quarter of the movie. I get she's in pain and chooses solitude. She's not the first, but the main character goes into the wilderness without so much as a minute of training and refuses the advice of locals. Simple common sense would dictate that you can't survive in the wilderness in an uninsulated cabin without training. It would take literally no time to get her up to speed, properly provision her, and teach her some basics (like, yell at bears, don't hide while they go in your open cabin and eat all your food, duh!). Then she can't shoot the poor baby deer, even though she's starving. Nature has a term for things that can't manage the basics of survival; dinner."
    }
  ],
  "recommendations": [
    "the_way_back",
    "leave_no_trace",
    "greta",
    "the_card_counter",
    "a_hidden_life",
    "cast_away",
    "nine_days",
    "only_the_brave",
    "the_boy_who_harnessed_the_wind",
    "into_the_wild",
    "everest",
    "k_pax",
    "first_man",
    "lady_macbeth",
    "the_lost_city_of_z",
    "disobedience",
    "alpha",
    "lion",
    "the_road",
    "the_light_between_oceans",
    "the_rhythm_section",
    "the_impossible",
    "deep_impact",
    "the_white_tiger",
    "swallow"
  ]
}