{"id": 4799, "title": "Land of the Dead", "starring": ["Robin Ward", "Bryan Renfro"], "runtime": 93, "genre": ["Horror", "Thriller", "Science Fiction"], "description": "The world is full of zombies and the survivors have barricaded themselves inside a walled city to keep out the living dead. As the wealthy hide out in skyscrapers and chaos rules the streets, the rest of the survivors must find a way to stop the evolving zombies from breaking into the city.", "releaseYear": "2005", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/34rdmEgsFRDOm8LNDsNkkj0qVlL.jpg", "categories": {"plot": 5.666666666666667, "acting": 5.230769230769231, "ending": 7.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.0, "action": 8.2}, "reviews": [{"rating": "7", "text": "A very high budget, great acting, cool special effects and George A. Romero are four things this movie had that helped it shine. With a budget of about 20 million to make, the film was a great success grossing double that amount. All the actors in this movie put on great performances with better acting then you get in most zombie flicks. The story flowed very nicely with not too many boring scenes at all. They also went big with the special effects, with explosions, cool vehicles, grusome death scenes and a few hardcore gun fights as well. Definately a fun watch for any zombie or horror fan."}, {"rating": "7", "text": "$.$.$.$.$.$.$.$.$,$.$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》□》■》"}, {"rating": "7", "text": "---------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"}, {"rating": "10", "text": "Anonymous said: \"I'm sorry, but when did zombie movies have underlying political messages.\" I'm sorry, since Night of the Living Dead, Dawn of the Dead, and Day of the Dead. So... since the beginning."}, {"rating": "7", "text": "My 2nd ever HD-DVD enjoyed it then and enjoy it now give it a chance and it might grow on you."}, {"rating": "7", "text": "♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"}, {"rating": "7", "text": "¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡¡•¡•"}, {"rating": "7", "text": "{}{}{}}}{}{}{}{}{}{}[][][][][][][][]()()()()()()()()()()!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "0", "text": "Its s***. I guess they ran out of ideas so they came up with thinking zombies. What a load of c***. Story is horrible, actors are horrible and the entire movie is one giant waste of time."}, {"rating": "0", "text": "That´s the worst Zombie production I have ever seen. Brainless, boring script, cheap story. Please: WHO gives that production more than 1 point. I really don´t understand that."}, {"rating": "1", "text": "A brainless 95 minute poetry reading where a zombie movie should've been."}, {"rating": "9", "text": "A solid zombie film and one of my personal favourites, even though most say this is probably Romero's worst. I loved the concept and I thought it was clever having a few storylines worked in together, as well as being one of the first film to really focus on some of the zombies themselves. Simon Baker leads a talented cast that all play their parts well, as well as Dennis Hopper doing a great job as the head honcho. Overall a great film and zombie fans should be impressed!"}, {"rating": "7", "text": "In an ever-vigilante attempt to stay socially-relevant, George Romero creates a class struggle between the rich and the poor which is also personified in the battle between the living and the dead in LAND OF THE DEAD. Both human and zombie are only looking for the basic rights to life, liberty, and the pursuit of happiness, which have been stripped away from them by a tyrannical overlord that has seized control from his ivory tower, Fiddler's Green (perhaps in reference to SOYLENT GREEN, which seems to have heavily influenced the plot).\r Romero makes many poor decisions in LAND OF THE DEAD that fans are sure to disagree with, the first being the further humanization of the zombies. We saw in DAY OF THE DEAD that Romero's zombies had regained their basic motor skills. Here, they begin communicating, using tools, and strategizing, which is a huge stretch for creatures that are supposedly \"dead,' and very difficult for audience members to accept. What is worse, Romero, whose films served as the pinnacle of special effects makeup throughout the 70's and 80's, has begun the downward slide into computerized imagery, particularly for the gore sequences. While it is less apparent in LAND OF THE DEAD, his subsequent films would be ruled by these cost-saving (but visually abhorrent) techniques. Only the practical makeup effects handled brilliantly by Greg Nicotero and Howard Berger call back to the greatness of the past three films.\r LAND OF THE DEAD presents us with no compelling characters to carry the story, just a group of mismatched rogues for whom we care nothing. The closest that we have to a hero is Simon Baker playing Riley Denbo, but all of his whining and sniveling gets him nowhere. Instead, it seems that we are meant to align ourselves with the zombies, who are the only characters that are portrayed in a sympathetic light, but this group only serves to annoy as well. The lead zombie, aptly named \"Big Daddy,\" looks and acts nothing like the zombies we have come to expect in a Horror film, and even without the benefit of conditioning (as with Bub in DAY), he has rebuilt his intellect to near-human levels. This breaks continuity within the series, and would have worked better if overwhelming hordes of mindless zombies were left to overthrow Fiddler's Green.\r There seems to be an utter loss of direction in LAND OF THE DEAD that severely detracts from the film. The dead are left forgotten in the background as the living front their feeble uprising. Romero injects enough of his trademarked social commentary to credit the script with some intelligence, though LAND OF THE DEAD falls far behind NIGHT, DAWN, and DAY.\r -Carl Manes\rI Like Horror Movies"}, {"rating": "9", "text": "Tierra de los Muertos (2005)Sinopsis:Un líder mercenario se enfrenta a un camarada rebelde, mientras zombies devoradores de carne amenazan su ciudad.Opinión:Hasta el momento, mi favorita de la saga de Zombies de George A. Romero (me falta Diary y Survival of the Dead).Mejora en muchos aspectos a sus antecesoras, los zombies han evolucionado constantemente y son mas inteligentes. El gore y violencia son más explícitos y hay mucha acción, pero por sobretodo, toneladas de Zombies. Los personajes están ok, tenemos a Asia Argento como Co Protagonista y es la única película donde esta chica me cae bien, por otro lado está Denis Hooper como el antagonista quien a mi juicio hubiese deseado que muriera al principio de la película, no recuerdo el nombre del protagonista, el típico héroe que no impresiona a nadie y finalmente John Leguízamo haciendo de algo parecido a un anti héroe que pese a ser un completo idiota, logra caer bien.Una vez más se expone de manera implícita mensajes y sátiras sociales, en este caso de la elite de clase alta y la clase baja dejando en claro que ni todo el dinero del mundo ni tu estatus te librará de dejar este mundo, todos nacemos sin nada y nos iremos sin nada.Valoración:4.5 ⭐ de 5 ⭐"}, {"rating": "6", "text": "L'histoire ou plutôt le reste zombifié d'histoire est quelque peu décousu, téléphoné et sans grande originalité dans le genre post-apocalyptique mais Land of the Dead sait heureusement à la fois garder le rythme et garder le cap sur l'essentiel : exploser les têtes, démembrer les morts vivants et filmer les vivants se faire bouffer par les morts.Tant pis si on doit supporter le bellâtre Simon Baker qui nous joue le crétin de samaritain de service, tant pis si Dennis Hooper vieillard vieillissant a l'air sur le point de trépasser à chaque réplique, Asia Argento est là pour faire passer la pillule qu'on se dépêche de gober comme un crapaud au vol de la mouche dans un grand splatch sanguinolent.La mise en scène est fort correcte et en même temps s'avère toujours aussi dilettante ; elle permet au moins d'apprécier tout ce gore à disposition comme un gros paquet de pop-corn sans se poser de questions... même à propos de ce zomb' qui pense !"}, {"rating": "2", "text": "If you're looking for fun **** this is your zombie movie. If you want decent film-making, stay away. This movie is garbage to anyone expecting anything remotely serious."}, {"rating": "0", "text": "Terrible terrible terrible movie, don't watch it.  I know you are here because you love walking dead and you are looking for zombie movies to hold you over for the next season but DON\"T WATCH THIS MOVE.  Its stupid and not in a fun way."}, {"rating": "5", "text": "[***SPOILERS***] Let me start by saying how much I love zombie movies and Romeros in particular, so I was desperate to see this when I heard it was being made. This story of a walled city and internal power struggle has obviously been brewing inside Romero since Day of the Dead and he now had the means to go ahead with it. The basic plot is fine but the catalysts for the events which move the movie on are pretty weak and everythng seems rushed. The biggest most influential plot line which I really hate is the intelligence of the zombies and one zombie in particular, I've never liked the idea of the zombies becoming intelligent as I don't see how it makes the movies any more scary. Sure a few remembered skills like waving a hammer or rock but gathering zombies together into some sort of force is just stupid. They may as well have been a gang of thugs or hoodlums as apart from the flesh eating that's all they were. As I said the zombies are intelligent and boy are they, they've got more sense than some people I know (especially ones from Birkenhead), this on top of the fact that the living that seem to be incredibly dumb and put themselves at risk at any given opportunity. I'm sure Romero wanted to get across the idea that the zombies were the ones who were on the outside \"free\" whilst the living people were trapped inside a like animals in a cage. But so what havn't all the \"dead\" movies been the same, isn't that what would happen if a zombie invasion happened. As a whole this movie is just a mainstream zombie-a-thon for undemanding movie goers who want a few scares but Romero fans want more and definitely more depth and rounded characters. One small part in particular summed up the movie in a heart beat: Man enters room to pull lever, can't pull lever with one hand so puts down gun to get better grip, camera takes an extra look at discarded gun just too make sure we all saw it and are now ready for the inevitable jumpy / shocky / zombie moment in a few seconds. Why thanks George I really needed you to prompt me to get me ready for a little scare, pure Hollywood. Though not perfect 28 Days Later did a better job of convincing you that some sort of zombie appocalypse had taken place. And as much as I really hate to admit it I prefered the re-make of Dawn of the Dead, though completly dumb at least it wore it's heart on it's sleeve and had one of the best opening 20 minutes of any movie let alone zombie movies. There are some cool Romero touches I won't say what and ruin the only interesting parts of this movie but there is really nothing at all that stands out, ultimately there is nothing left for a serious (zombie) movie fan. Why George why?"}, {"rating": "1", "text": "This film sucks, very bad acting and dialog."}, {"rating": "2", "text": "One of the worst movies I've ever seen. The only reason this movie got good reviews is because of Romero's reputation and the so called \"satire\" of democracy, completely overlooking the fact that the acting and plot were terrible. Just because you can find a few parallels between society and a plot does not make it good. If this was not a Romero film and wasn't expected to have an underlying social commentary, this would've been seen as a stupid, chear horror movie. None of the actors had a real personality, and the dialogue was complete s... As for the people saying that it didn't rely on cliched scare tactics, I don't think zombies sneaking up on people in the dark is exactly the pinnacle of originality for the genre. If you think this movie is a smart horror film, you're an unintelligent personwho can only repeat ideas from other people without having a thought of your own. It probably makes you feel better about yourself, allowing you to forget for a short time that your IQ doesn't break 100."}, {"rating": "1", "text": "An outstanding acheivement of directorial ineptitude. Romero is a dried-up hack. I'm embarassed for him."}, {"rating": "5", "text": "Retarded. The zombies slowly stumbled forward, but they where still catching people that where running away. Needed to be fast pased, like the dawn of the dead remake or 28 days later. Romeros earlier movies where much better."}, {"rating": "6", "text": "I'm just going to come out and say it this is my least favorite Zombie movie so far, it never really got the Zombies were never really threatening in this movie, they tried to make them more scary by getting them to think but it never really worked as I just ended up laughing at how retarded they acted when trying to be smart, and the idea of society after the apocalypse never really takes off, and it almost seems like it's stuck between trying to be futuristic yet also during the current time period, but that didn't work at all, but there is one good thing that this movie has, fantastic characters, I've never cared more about the survivors fates before this movie and that's saying something, and it's still fun to watch Zombies eat people, but it's a mixed and matched group of ideas that just creates something incredibly mediocre."}, {"rating": "3", "text": "Poorly written, dubious acting, sets look to be cobbled together from garage sales and most of all... slow and unengaging. A quick bit of research reveals that George had involvement in over a half-dozen movies in this timeframe which might have something to do with the half-assed execution. So incredibly disappointed in this film.  I’ve seen zombie movies likely made on a tenth of the budget that blew this one out of the water."}, {"rating": "6", "text": "Not the best zombie movie I ever seen. It is ok. It takes a few times of watching it to really get the whole concept of the movie. Could have made the storyline a little better. Hey really all that matters is that theirs a lot of killing zombies and zombie killings happening."}, {"rating": "10", "text": "\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"••••••••••••••••••••••••••••••¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤_____________________________"}, {"rating": "10", "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,》●》●》●》●》●》●》●》●》●》■》■》■》■》■》■》■"}, {"rating": "10", "text": "One of the best movies of the year. Excellent."}, {"rating": "8", "text": "The movie was interesting, the twist on the view of zombies was a little upsetting at first but then you realize... Why make it like every other zombie movie out there? Romero changed up the formula for a zombie movie a little bit and I think it worked in my opinion. I think the acting was just fine, hell; even the zombies were showing emotion. The movie continues to get a bad reputation from people who were expecting another \"common\" zombie movie. Actually making offensive comments if you enjoyed the movie, I don't know about you but that seems a little biased; and childish. All and all, I'd say the movie is one to enjoy; regardless what others might say or even what I say."}, {"rating": "8", "text": "Very good zombie. not so tense but very gory and smart. Cool move by Romero to show that Zombies can think too. big Daddy is great."}, {"rating": "6", "text": "One of Romero's worest films. I respect him as a director fully because he has the ability to make a horror movie with an actual meaning behind it but this was just an overrated flick. He had a lot of well known actors yet they just couldn't act. He had an exciting plot but it just wasn't exciting. This movie sounded good on paper but I think I'll stick to liking his earlier works."}, {"rating": "6", "text": "I very much agree with chuck 76, movie had moments of genius tempered with a Hollywood type of gloss. I also agree that I think both 28 Days Later and the remake of Dawn of the Dead were in fact better movies, though nowhere as good as as Romero's previous efforts. Anyone who even compares this with the origional Night of the Living Dead or Dawn of the dead just does not understand the significance of those movies."}, {"rating": "10", "text": "A great zombie movie!"}, {"rating": "10", "text": "This is the best zombie flick i've ever seen."}, {"rating": "9", "text": "One of the best horror movie i've ever seen since 28 days later."}, {"rating": "9", "text": "Oh please \"Anonymous\", and anyone else out there so ignorantlycomplaining-- ever since 1968 with Romero's original, zombie movies OF COURSE have freaking political messages and commentary. Ever since Night of the Living Dead, political and social commentary and allegories have become a trademark of the better horror movies, and is certainly an expected tradition. Anyone who doesn't honestly know that must have little to no knowledge of horror whatsoever. And did you even watch this movie? The zombies **SPOILER** freaking evolved to be able to use guns and run, not to mention communicate, so how did were they \"the speed out a one legged Zebra\" (which doesn't even make sense, learn to check your reviews). This film, while not a hallmark like Romero's original trilogy, proves that the zombie master can still make relevant and exciting zombie films, all while blowing rip-off filmmakers out of the water. No matter how many 28 Days Later and Romero remakes people out there make, there is still only going to be one master."}, {"rating": "7", "text": "In his first movie, \"Night of the Living Dead\" (1968), Romero made an allusion to the imbecility of the war in Vietnam. In 1979, \"Dawn of the Dead\" showed the idiotic consumption society of the country. \"Land of the Dead\" now criticizes the diferences betwenn the social classes and the indifference that the human beigns show when dealing with the reality that surround them. But, above all this, the end of the movie can disappoint, it's a little empty and the character of the zombie lidder isn't well explored. About the cast, only the interpretation of the actors Dennis Hopper as the powerful Kauffman and John Leguizamo as the mercenary Cholo (with his sarcastic latin accent) impress in this movie. \"Land of the Dead\" brought back that old and good inteligente horror from George A. Romero. But it's still far away from being the best movie about living deads!"}, {"rating": "10", "text": "I'm glad it got good reviews i was reallt surprised that it got all good reviews its a horror movie. better than the boring day of the dead and definetly more action than day of the dead."}, {"rating": "1", "text": "Without exaggerating, this was the absolute worst movie I've seen in years. An inane commentary on how we, the living, have oppressed the poor, misunderstood zombies. That's not a joke. [***Spoiler***] The movie is about how the living need to stop being so hateful and judgemental... towards ZOMBIES! The underprivelaged humans make a necessary alliance with the brain-eating undead because the two have a common enemy, a much greater threat... CAPTALISM! I can't even make this stuff up! This is really Romero's movie: a treatise on fleah-eating bolshevism. Even as I type it I can barely even believe it. I gave it a \"1\" instead of a \"0\" only because it ended."}, {"rating": "9", "text": "An utterly breathtaking piece of film genius. Yes, it is indeed an awesome zombie flick, but you have to look beyond and see the political message that the director is trying to convey. Romero once again shows us why he's one of the greatest directors ever."}, {"rating": "8", "text": "This is overal a good movie. Good story, good charactors (loved Charlie), and nice to see the zombies arn't the bad guys. It deserves a 7 or higher. Not my favorite zombie movie, but still a good one."}], "recommendations": ["dawn_of_the_dead", "28_days_later", "night_of_the_living_dead", "house_of_1000_corpses", "the_green_inferno", "the_crazies", "world_war_z", "cabin_fever", "day_of_the_dead_bloodline", "army_of_the_dead", "the_texas_chainsaw_massacre_the_beginning", "daybreakers", "30_days_of_night", "doomsday", "legion", "texas_chainsaw_3d", "priest", "underworld_blood_wars", "the_curse_of_la_llorona", "jason_goes_to_hell_the_final_friday", "28_weeks_later", "the_girl_with_all_the_gifts", "chernobyl_diaries", "stay_alive", "war_of_the_worlds"]}