{"id": 3105, "title": "Lara Croft: Tomb Raider", "starring": ["Angelina Jolie", "Iain Glen"], "runtime": 100, "genre": ["Adventure", "Fantasy", "Action", "Thriller"], "description": "English aristocrat Lara Croft is skilled in hand-to-hand combat and in the middle of a battle with a secret society. The shapely archaeologist moonlights as a tomb raider to recover lost antiquities and meets her match in the evil Powell, who's in search of a powerful relic.", "releaseYear": "2001", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/7WyMvoqPYJe5g1ENsbLTv40pUrX.jpg", "categories": {"plot": 6.828571428571428, "acting": 7.0, "ending": 6.25, "soundtrack": 7.6, "cinematography": 5.0, "familyFriendly": 4.714285714285714, "funny": 6.2, "action": 5.583333333333333}, "reviews": [{"rating": "3", "text": "What's a sure fire way to make money off of the raging hormones of teenage boys? Sell them video games with bodacious big breasted babes. The Tomb Raider games are a hit and its no mystery why. For all those same reasons, it's just as likely that a movie based on the game will rake in the cash as well. Fortunately for the franchise, the film doesn't actually need to be any good to make tons of the gorgeous green. The real problem is that Tomb Raider doesn't even TRY to become more than its video game ancestor. Had there been some sort of attempt to break the bonds of videogamedome and elevate the film to the level of cinematic spectacle, Tomb Raider might have turned into a summer movie to get excited about. However, rather than make that attempt, its director appears more interested in making a Tomb Raider homage."}, {"rating": "6", "text": "Amongst other things to remind you the soundtrack quickly ages the movie....despite this tomb raider makes an excellent marriage of OG angelina jolie and OTT cool action set pieces. Pacing feels a little off at times but overall things play out much like a 90's pearce brosnan bond film if it were gender flipped sporting a vague tomb raiding twist. Not many tombs raided overall but certainly worth checking out if just for the sheer zany-ballsyness!Also daniel craig and angie swap accents for added fun!"}, {"rating": "8", "text": "It is a good video game adaptation and an enjoyable movie. Don't know what the critics expected or even criticized. The Tomb Raider video games are not Shakespearean tales or had a dialogue heavy deep story. They used the blue print of the video games and made an entertaining movie. We got Angelina Jolie as Lara Croft. She is really good and nails her role. Manfred Powell also improves this movie with his role that I cant spoil. The adversaries are as they should. Powerful and hiding in the shadows. The rest of the cast does the best they can in their respected roles. I think there is no miscast here. Bonus: There is Daniel Craig in a minor role. Unbelievable that he would be James Bond later. The story is really good video game inspired material. It is a chase around the world in sets like Hongkong, Angkor Wat and Island where the ultimate price awaits at the end. The characters stories and developments are well integrated into the story. The action sequences and fights are interesting and feel intense. The soundtrack is also really good but not high up enough to be in my top 30. Overall I must say again that I don't know the reason for many peoples criticism. The movie adapts what it can well and is enjoyable."}, {"rating": "7", "text": "The film is a guilty pleasure for someone like myself who enjoyed the games growing up. While the film is flawed it's still rather enjoyable and features beautiful scenery from Cambodia, Iceland, Venice, and England. Some of the set pieces are spectacular as well! At times some of the scenes feel ripped from Raiders of the Lost Ark, Die Hard or a 007 film, but the clichés work because the viewers eyes will always be on Angelina Jolie and her portrayal of Lara Croft. True fans will notice some similarities between the film & the games on Sony's PlayStation."}, {"rating": "10", "text": "This is one of the best video game movies that have watched so far. This gets us to know more about Lara than what we know already. I honestly have no complaints about this movie at all. 10/10"}, {"rating": "5", "text": "It is not as bad as it is usually said.I'm not exactly the type of person who likes movies based on computer games. There is always something that doesn't go very well. This film confirms that. It's not entirely bad, it has enough action to entertain us, but it's not the type of film I think is excellent.The script is based on the travels and adventures of Lara Croft, a trained and beautiful English noblewoman who travels around the world in search of the rarest historical and mystical artifacts. It is a kind of Indiana Jones with skirts, or rather, shorts. Of course, archeology has nothing to do with theft and violation of tombs or temples or whatever, but the film, like the game, doesn't care about that. In this film, she has to fight the Illuminati, which seeks a long-lost artifact but, when reconstituted, would allow it to control Time. Without knowing it, she had a part of the artifact all the time, because her late father, whose death was never clear, had taken that object. Then, the adventure comes to her.The plot is quite simple and not very credible, but those looking for these films usually don't care about that. It is all just a pretext to go to a jungle in a lost corner of the world and kick and shoot some bad guys. The fast pace of the film, associated with good action scenes where, as always, Lara Croft escapes danger by a hair, helps us to swallow and keeps us entertained. Without having to think too much (if we make the film it falls apart), the film goes on until the end, giving us a series of special effects that are not very interesting and clearly made on a computer.Angelina Jolie needed money and notoriety. After a career started from the bottom, in short films and on TV, she had looked good in \"Bone Collector\" but it was \"60 Seconds\" that allowed her to become a sex symbol if she wanted to. This film consolidated that, giving notoriety to the actress' big breasts and allowing her to rise in her career and solidify her stardom. The fact that she was the only actress with some dramatic talent in this film helped her. The support cast was practically demoted to extras with lines. In fact, although the film took advantage of Jolie's generous physical attributes, she showed that she was not just a woman with a desirable body. There was talent there and the ability to do more, if given the right role. This was a sure bet, as the future would show.The film is no wonder, but it is not as bad as it was said. If you look for a movie just to entertain without having to think hard and be watching it carefully, that kind of movie we see while talking to someone or doing something else, this will be a good bet."}, {"rating": "10", "text": "Me gusto en su día me sigue gustando la mejor lara croft que salió nunca."}, {"rating": "5", "text": "Over the top,cheesy action packed one time watch!the music was decent,cast was iconic and acting was good specially Angelina Jolie she was great in lead and Lain was great as villain,the visuals were good but the CGI was terrible.the story was weak and screenplay was bad not engaging at all from start although from the temple scene it was little watchable,the intro was cheesy and it felt like random things happening it wasn't that engaging,the fight scenes specially the guns fight was awesome the house shootout was amazing,the whole center of plot the main investigation of pieces and the Aligning planets thing with the Eye it wasn't that surprising or exciting from what we can except from ancient Mysteries although the Father backstory was little puzzle but not that impact-full.all the time Lara was like she knows everything it wasn't that great for building up the surprise like the ending bell thing it was like Yea i know everything.the whole ending was decent the time thing was amazing but the last fight wasn't that good then the end with serving of guns in plate it was awesome.the whole movie was one time watch over the top action packed cheesy flick!"}, {"rating": "4", "text": "I think the story in this was interesting and made for a decent enough adventure, but I did almost fall asleep halfway through and that is never a good sign for an action movie..."}, {"rating": "5", "text": "I really enjoyed the fight scenes but I sort of forgot what the plot for this movie was. Also, there's good moments throughout this movie but not loads to make it a brilliant one.Also, I've added an extra star for Angelina Jolie being in this movie"}, {"rating": "9", "text": "Tombraider das waren Zeiten. :-D Ich liebe es. 4/5 *  Schöner ,spannender Film."}, {"rating": "10", "text": "Lara Croft: Tomb Raider stars a spectacular performance from Angelina Jolie while showcasing an intriguing adventure story for the formidable and fearless titular character."}, {"rating": "8", "text": "This film is much better than the new one from 2018. The casting isn't perfect but Angelina Jolie make the perfect lara!"}, {"rating": "5", "text": "i really loved Angelina Jolie as lara i think she's a great actress but the writing and the direction they took it was slightly lazy , but it's a fun movie to watch from time to time"}, {"rating": "1", "text": "it's just bad. there's really not a lot to say about this one. It's just that bad. It has bad acting, a bad story, blah blah blah the end."}, {"rating": "8", "text": "Really good movie,with an absolute banger and beautiful;) Lara croft! Angelina rulez!"}, {"rating": "9", "text": "20 years later, this movie is based on core design's original tomb raider iconic classic game series 1996 - 2003this movie series loosely adapts from the games with zero returning characters, and unnecessary changes by removing zip and Alister fletcher by replacing them with brace and making winston smith - lara's butler young and dumb while in the games he's always been depicted as old and wised. the story is bland and super safe no real threat to the protagonist he's ur very average cookie cutter generic, basic villain, kinda funny that they cast this guy later for resident evil movies later but that's a whole another story for a different review. random ally characters that's made for this film version has no backstory and underdeveloped motivations and would just appear without not giving any type of reason to care at all on what's going on and about them. welp it was good enough for core design to stamp their approval by advertising this movie on Tomb Raider: Chronicles and then later on core's Lara Croft Tomb Raider: The Angel Of Darkness game for this movie sequel :\" TR: the cradle of lifecons: there's no mentioned of Lara's mentor: warner von Croy no references or anything and its disappointing, it just feel like alot of lost potential, including lara's origin story from tomb raider: the last revelations alot of her allies are just plot devices to get the story moving forward and everything is conviant. none of that ever happens in the games the story is super safe and basic as u can get for a action adventure story with a weak script and plot armor.pros: young Angelina Jolie embodies lara croft in every way: she's strong, independent, confident, and etc.the atmosphere perfectly recaptures the dark tone that it had in the games, the intro of the movie with the robot was good and the soundtrack is awesome. the locations was decent and rememberable and its not like current movies that were getting these days with sjw woke agenda driven storylines so i grew more appreciation but still disappointed with the story's direction and characters"}, {"rating": "6", "text": "----------------------------------5.8/10-----------------------------------"}, {"rating": "6", "text": "When Lara finally decides to leave her mansion you get a movie with beautiful scenery and exciting action. You just have to get past the first 40 minutes. The film's extended opening is so dull that not even the titillating shower and side boob scenes do all that much to hold your attention. It takes too long setting up it's story and almost killed my interest. When we get to Cambodia though, everything turns around and we get the entertaining ride we were expecting. The action is of that ridiculous early 2000-era style that we just don't see anymore. The kind where the hero flies around and pulls off ridiculous stunts while simultaneously having access to some absurd technology and other gizmos. There are some pretty impressive set pieces, such as a more acrobatic sequence involving an octopus carnival ride of death. Angelina Jolie proves to be a good fit for Lara Croft, and not just looks-wise. She shows a remarkably physicality and a cocky persona that are both well-suited for an action hero role. It's mix of action and sex appeal may be more suited for the teenage crowd out there, but every now and then it offers a little something else to do other than ogle the leading lady. You'll have to turn your brain off for the story, but there are some genuinely cool and memorable moments. There are times where everything just comes together and it works. Unfortunately, so much of Tomb Raider gets saddled with it's own inane plotting.6.5/10"}, {"rating": "10", "text": "Best movie game ever made. Lara is amazing, she's badass, she's rich, she's beautiful and most importantly, she's portrayed by Angelina Jolie, who fits the role perfectly. If you're a fan of classic movies, Indiana Jones and Tomb Raider, you'll definitely enjoy this ;) Away with them haters!"}, {"rating": "10", "text": "I love Lara Croft: Tomb Raider. Now that's what a good video game movie is all about. I know critics are still feeling the hatred of video game movies affecting Hollywood. Take a look at Tomb Raider: a good, successful, film franchise that's still holding on after all these years and now a reboot is in the works. Although the sequel look a little decent, but I gotta give it up to Ms. Angelina Jolie. She is a phenomenal action star in her own right, marries with Brad Pitt, and of course, she still has the look of a role model. Playing Lara Croft in the movie is just too easy for me to say, but she definitely nailed it. I played all of the Tomb Raider video games, and the original game on PS1 may sorta a lot different than the movie. I really don't trust movie critics and I don't even care what those metascores might say, but can't they get a good and positive reaction, already."}, {"rating": "10", "text": "This movie trueley represent what were the old Tomb Raider games about:A sexy and very confident protagonist wondering around the world and try being funny with her partners.It is obviously very underrated by \"chritics\" who are not even able to express why they gave low score for the movie.There should be really a bad plot, acting and quality in any other aspects for example music or photography.It's not a ten in my book but i am compelled to give it a 10 because of the unfair reviews."}, {"rating": "2", "text": "a boring piece of crap"}, {"rating": "4", "text": "I recommend playing the game rather than watching the movie. It's better."}, {"rating": "3", "text": "The problem with Tomb Raider, in my opinion, is that it isn't a movie- it's one long video game that plays itself. Don't get me wrong, the action is entertaining and the dialogue has some wit. But a movie can't rely on video game aesthetics and action to carry the day. It needs characters you can connect to, a story that keeps you involved, and it has to be careful around cliches. A video game is primarily about being immersed in the experience and controlling it, and that's why the Tomb Raider games worked. You had fun controlling an ass-kicking heroine. But the movie doesn't add anything to the video-game formula, and so you're just left with a movie where you wish you were holding a controller, shaping the action yourself. The plot is pure cheese, cliches abound, and Lara gives us nothing that makes us want to root for her besides looking sexy- and that's not enough for a movie to soar."}, {"rating": "4", "text": "Angelina Jolie running around in tight clothes and carrying a gun isn't enough entrainment for me, but, for some, it will be. I'm not saying that's a good quality for them; I'm just saying I think there's a method to the madness of this preposterous thing."}, {"rating": "6", "text": "I don't know if it was the silly young kid inside me, or my love for the particular video game franchise, but after watching this again almost 12 years after its release...I still love this film, but mainly only for Lara Croft herself, played by Angelina Jolie.\rLet's be honest, this was a bad film, the characters were far too fictitious and unbelievable, the special effects were unnecessarily muddled and at times senseless, and there were enough continuity errors to put the Carry On films to shame, but I still find the ridiculousness of it all quite intriguing and enjoyable.\rSo because back at the start of the millennium origin stories weren't in fashion, we kick off with Lara training in her massive mansion, she then begins to remember her father as it is coming up to the anniversary of his death, but there is also the matter of the planetary alignment which as it so happens is coming up a time when a clock Lara finds can be fitted into a certain lock that will reveal pieces of the Triangle of Light, an artefact with powers to control time, oh yeah and this only happens every 5000 years, so its quite a big deal.\rLara suits up in her tightly clad outfits and unexplained-as-to-where-her-gadgets-and-stuff-came-from accessories to challenge a man, Manfred Powell (yeah, really) who is a member of the Illuminati, a secret organisation intent on using the triangle of course to control time, but why they are doing this is anyones guess, but I could care less, its still a good movie to watch.\rThe plot is of course riddled with ridiculousness to the point that you need to realise that this is a video game adaption, and while that doesn't do the games any justice, it certainly covers the extensive action sequences, while impressive, used a slow motion technique which was just downright annoying.\rAngelina Jolie is on fine form as Lady Croft, she plays the part expertly with her toned physique and her little sexual grunts that make Lara famous. Iain Glen puts an erratic yet enjoyable performance as Powell, while Daniel Craig plays another Tomb Raider.\rIf you can put aside the baffling plot and flamboyant characters, and sit down to enjoy the movie for its worth, its a winner, it won't leave you gobsmacked or emotionally unstable, but it should certainly give you a few laughs for its light humour and decent lead performance."}, {"rating": "2", "text": "It was... painful to watch this. All there is that stands out about \"Lara Croft: Tomb Raider\" is Angelina herself, her overblown acting and meaningless combat scenes."}, {"rating": "0", "text": "Nothing like the games, poor casting for Lara and pretty much the whole movie."}, {"rating": "3", "text": "Style over substance, anyone?\r This could have been a great movie, based on a great game... but it's not! Making Angelina Jolie grunt and sigh like Lara Croft is not enough to make a good movie. It might be enough to make pubertal young boys get excited, but true Tomb Raider fans wont be pleased at all.\r The movie does not bring back the memories of the game. The game is all about adventure, exotic exploration... just like the movie Indiana Jones and the Raiders of the Lost Ark. But this movie doesn't deliver any tension or feeling of adventure.\r It seems the makers of this movie had no fantasy at all and only tried to deliver some nice images and not much of a story. It's like someone said: it doesn't feel like a movie but like a video game playing itself.\r The only good about this movie is Angelina Jolie in the shower, at least they didn't totally waste our time for 100 mins."}, {"rating": "7", "text": "Angelina Jolie is a perfect Lara Croft and the film is a lot of fun. as for it's sequel, skip it."}, {"rating": "5", "text": "Better than i expected, but seeing as i expected to be absolute rubbish that isn't saying much...so so i suppose if you like a bit of cambodia and running around shooting people."}, {"rating": "10", "text": "A fun-thrilled short flick, the ending is stylishly fantasized. The drama is engaging and explains enough character build-up to have an actual action-packed movie with cool stunts. And thats it, finally a movie worth it, only on rental though, its not a theatre movie."}, {"rating": "10", "text": "This movie was the best. I am the biggest Angelina Jolie fan. I give the movie two thumps up. Angelina Jolie rocks as Lara Croft. She shood make a second. I will certainly go see it."}, {"rating": "10", "text": "This is a very intersting movie. It is aprearant that much work was put into it and the results are phenomenal. Angelina Jolie fits the part for Lara Croft quite nicely. It is as if she was born to play the roll of Lara."}, {"rating": "0", "text": "Ahhhhh!!!!! One of the most disappointing movies that I've seen. I'm usually not so hard on any movies, but this is an exception in my book. The only time I was happy was when it was over."}, {"rating": "7", "text": "Hey, what were you expecting? Its got solid FX, action, and enough story to keep you engaged."}, {"rating": "3", "text": "An outrageously silly film that relies on shoddy special effects to carry it along. Angelina Jolie is the only good thing about the film. The plot is mind-numbingly awful. Overall, it's just another bad summer popcorn fest."}, {"rating": "9", "text": "I swear, most of the \"professional\" critics that watched this movie are completely messed up in the head and should be \"taken out back and shot,\" as one of the ignorant critics puts it. This movie was actually pretty good and probably the best game to movie production yet. You critics no NOTHING about movies. Get a life. Please."}, {"rating": "5", "text": "Somehow I think this is the worst movie I have ever seen, yet I don't hate it. Its likeable but it also sucks, royally. The cast are great but the story is, well there is none. The CGI statues are actually good too, it looks more realistic than movies today. Don't get it wrong this is absolute bottom of the barrel stuff, but it does have its charm."}, {"rating": "6", "text": "I thought this was a good movie to bring to life from a video game. Angelina Jolie was the perfect person for this role. It's pretty much like the video game."}, {"rating": "10", "text": "I know the sequel and the reboot received better reviews from critics. To me, this one is the best Tomb Raider movie."}], "recommendations": ["tomb_raider", "uncharted", "prince_of_persia_the_sands_of_time", "hitman", "the_last_witch_hunter", "rampage", "resident_evil_damnation", "hitman_agent_47", "bloodshot", "mortal_kombat", "hercules", "doom", "boss_level", "silent_hill_revelation_3d", "wild_card", "jumper", "xxx_return_of_xander_cage", "i_am_number_four", "monster_hunter", "avengers_age_of_ultron", "underworld_awakening", "quantum_of_solace", "brick_mansions", "spy_kids_3_d_game_over", "resident_evil_apocalypse"]}