{
  "id": 2577,
  "title": "Last Christmas",
  "starring": [
    "Emilia Clarke",
    "Henry Golding"
  ],
  "runtime": 102,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Kate is a young woman who has a habit of making bad decisions, and her last date with disaster occurs after she accepts work as Santa's elf for a department store. However, after she meets Tom there, her life takes a new turn.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kDEjffiKgjuGo2DRzsqfjvW0CQh.jpg",
  "categories": {
    "plot": 6.366666666666666,
    "acting": 7.045454545454546,
    "ending": 6.5,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.166666666666667,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Emilia Clarke and Henry Golding are great together (Clarke is a very talented comedic actress and Golding is as charming as ever) and the premise at the core of their characters’ story is genuinely interesting. But the film that surrounds them does them a great disservice — it’s a messy, tonally uneven patchwork of corniness and poor writing that has no direction. The film never seems to land on what it wants to be, throwing ideas and random, badly connected storylines onto the canvas. If it had merely focused on Clarke and Golding, it just might have executed the main premise that much better. It’s too bad - with the right editing and writing, this could have worked."
    },
    {
      "rating": "4",
      "text": "Clarke is charming, but this film is so awkwardly edited and has characters act in the most baffling of ways that it takes away from shy comedic impact she may have. Also the ending will blow your mind, in the worst of ways."
    },
    {
      "rating": "7",
      "text": "A solid date-night movie that my wife and I both enjoyed. It didn't blow either of us away by any means, but we weren't expecting that anyway. She wanted a tropey romance and I wanted to watch Emilia Clarke do that quirky/funny/charming thing that she does so well. Mission accomplished on both parts."
    },
    {
      "rating": "8",
      "text": "Lovely movie. The first half of the movie was a big smile on the face all along. Emilia Clarke is amazing, cute, beautiful and perfect for this part. Henry Goulding is good too. I didn't like the big twist at first, but after some thinking I think it can work. I'm not completely sure how I feel about it. Lovely movie with a great cast."
    },
    {
      "rating": "10",
      "text": "Last Christmas is so heartwarming, you leave the theater feeling all cozy and with tears! Loved the character's nuances especially Kate... I really wanted to hug her ♡"
    },
    {
      "rating": "9",
      "text": "Everyone, rush out and see Last Christmas. I don't usually watch Christmas movies this early, but I got an opportunity to watch this for free. I wasn't sure about the movie at first because it wasn't what I expected, but by the end of the film, it became one of my very favorites of the year. This movie made me want to be a better person and be happy that I'm alive. I can't recommend it enough."
    },
    {
      "rating": "0",
      "text": "the queen Danerys Targarian is precious but the movie:\"It’s not so much clever, toasty, and affectionate as it is the faux version of those things. It’s twee, it’s precious, it’s forced.\""
    },
    {
      "rating": "8",
      "text": "I can understand why some people don't like this movie but i personally really liked this movie. Let's get the negatives out of the way first: the first half of the movie is pretty dull and mediocre, the music doesn't always fit the scene, the comedy is more miss than hit and the movie is full of cliches. These didn't bother me that much but they are noticeable. The positives on the other hand are: Emilia Clarke is fantastic as always and she has an amazing singing voice, the acting is really good, the \"twist\" of the movie was unexpected and very sad and effective, the song \"last Christmas\" is beautiful and the ending is heartfelt, sorrow and satisfying. I really liked the twist and the final scenes of the movie. The movie is emotional and has great character moments, most of them are with Emilia's and Henry's characters. Yes it made me cry and i really like this movie. In conclusion the first half is not that great but the second is better. I will definitely make this movie my own Christmas tradition in that i will watch it every Christmas."
    },
    {
      "rating": "9",
      "text": "I found it to be quite a good movie overall. I think that it was very well done, as far as Romantic Comedies go. I laughed a fair bit more than I thought I would, and I loved the acting/pacing. It isn't going to break any new ground overall, but if you are looking for a movie with some tear jerking moments, some laughs, and an overall enjoyable time I don't think you would be disappointed here!"
    },
    {
      "rating": "0",
      "text": "This movie was not romantic in any way shape or form which is what going into it I thought it would be, I am extremely dissatisfied..."
    },
    {
      "rating": "0",
      "text": "La Reina de Dragones como siempre preciosa y punto nieve. Pero esto no es suficiente para esta pelicula. Quizas es la pareja mas dispar que he visto en la historia del cine. Por que no llamaron a Kid Kerrington para ser su pareja? sin duda hubieran roto la taquilla y la barrera de los 500 millones de dolares! ahora solo les queda 500 millones de pesares!"
    },
    {
      "rating": "6",
      "text": "Emilia Clarke enchants with her bright smile as a woman who's sweetly struggling with her life. She works in a Christmas store, auditions for parts and goes from friend to family for a place to sleep. One day she meets an appealing man (Henry Golding) who helps her find herself. What seems like a sweet, but not especially special romantic comedy does manage to turn things around before it's over. Screenwriter Emma Thompson has fashioned a mildly cute comedy, but none of the characters are especially memorable (except her own role as the Hungarian mother). Director Paul Feig has kept it seasonably bright, but doesn't add much comic charm. While not without appeal (and a soundtrack featuring the songs of George Michael), this might warm hearts seeking a holiday trifle."
    },
    {
      "rating": "8",
      "text": "So many haters! As a Christmas movie, this is definitely one of the top, with a sweet and powerful message about loving oneself, and learning to love what you have in the moment and share it with others. All about perspective, and a positive movie to watch with either a loved one or by yourself. It's nice to see that Christmas movies don't always have to involve romance, or the magic of Santa."
    },
    {
      "rating": "5",
      "text": "A cheap comedy, a bit funny, a little trivial. An interesting cast but the plot is bland and expressionless."
    },
    {
      "rating": "10",
      "text": "Last Christmas. Take a second chance. A stunning, gorgeous and magical Christmas comedy starring the charming and funny Emilia Clarke. First of all, I also want to highlight the music, and it is the real legacy of the great George Michael. The atmosphere of Christmas in the film is conveyed perfectly, and this is the scenery and landscape views of the city. The chemistry between the characters Kate and Tom is also excellent. This is one of those films where each character is remembered and if, for example, you remove him, then the movie loses a piece of itself. There will be no spoiler, but this film literally hits you at some point with its unexpected turn and you are left in a pleasant shock from this, but then you realize that this very turn throughout the entire film was practically on the surface."
    },
    {
      "rating": "4",
      "text": "A problem that I couldn't get out of my head is that Emilia Clarke shows few skills for change and her character here feels like an extension of Louisa Clark but a lot more cynical and less cheerful.And it's ironic that a film in which the main character is looking to recover the joy in life lacks of spirit.It helps a lot the chemistry between Clarke and Henry Golding but that's just the most salvageable element here. The rest is too generic and you can infer the narrative twist with astonishing speed.Even since the trailers you could see it and that was a fatal blow to the film.It was forgettable, even for the christmas season."
    },
    {
      "rating": "6",
      "text": "O filme tem muitos problemas de atuação, roteiro e também em aspectos mais técnicos. Porém, possui muito valor de entretenimento. A história apesar de genérica consegue cativar um pouco."
    },
    {
      "rating": "3",
      "text": "Amazing how many people still line up to see Christmas movies. This one is yet another of those so-called Christmas ‘holiday season ‘movies that are as much about Christmas as that Bonny Bouncing Bunny is to Easter. It’s somewhat of a ‘La La Land’ wanna-be, without the easygoing feel and charm that one at least offered. Some of the dialogue and situations are crass and the sleep-around, female ‘Christmas Elf’’, didn’t help whatsoever. This thankless girl is actually cared for – but does she deserve it? The sudden turn to being a supernatural feel good/bad fantasy surprise --was a bit of a difficult twist to take-- especially amongst all the rather superficial PC philosophising being shovelled around like the fake ‘santa’ snow in the gutters of ole London.  The cast tried but with the sour- treacle script reaching for heights it didn’t quite earn, it was mostly uphill.Maybe fine for the easily pleased or woke ‘idealists’. A movie based on a song, with other songs in the background that didn’t quite fit the subject."
    },
    {
      "rating": "7",
      "text": "Whilst those terribly familiar with the film’s initial trailer will undoubtedly guess the film’s predictable plot swerve, you can’t help but fall head over heels for its central pairing. Leaping from friend’s various sofas onto many an audience member’s Christmas party list, the awkward smiley demeanour of Emilia Clarke’s Kate works wonders as she lumbers from one questionable decision to the next, showing a willingness to be better. When not twirling around the streets, he’s giving us a cheeky impression of James Bond. It’s an endlessly charming turn from Henry Golding as Tom, with the initial mystery subsiding quickly as he strikes up a brilliant chemistry with Clarke. Arguably the film’s strongest performer however is Michelle Yeoh, who revels in the quirk of her character’s subplot, raising many hearty laughs in the process.Sure, it’s unashamedly soppy and it’s not quite Flawless. But Paul Feig’s ‘Last Christmas’ will make you want to Go To The City. A fantastically festive treat."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)\"If you don't like this kind of film, you're cynical.\" Maybe, but I consider it delusional to take Wham!'s \"Last Christmas\" (1984) as a basis for a screenplay, and I have found nothing at all in the story written by Thompson with her husband that makes it plausible. If anything, each twist is a relaunch towards more presumptuous and unjustified ambitions. A graceless though successful film."
    },
    {
      "rating": "6",
      "text": "A real Christmas film with an emotional twist.  The story was a little too far-fetched but it was unexpected."
    },
    {
      "rating": "2",
      "text": "Mindless and pointless banter guides this movie to its obvious \"startling\" conclusion. It's another socially relevant lecture at Christmas. The only way it got produced and made it to the big screen is due to the clout of the producer. The screenplay is the downfall. A waste of my time."
    },
    {
      "rating": "5",
      "text": "I enjoyed watching Emilia Clarke, but otherwise it's just the movie you expect, with some very cheesy dialogues. I didn't like the role of the supposed friend either, the conclusion was still quite okay."
    },
    {
      "rating": "7",
      "text": "A Christmas movie that doesn't have many Christmas features. The Christmas tree, Santa Claus and Christmas ornaments are all in the background in the story. Its normal to expect the same story in theaters at this time of year and that is what makes this film - not stand out - but different from the rest.The characters in the film are quite eccentric and none of them escapes this adjective. Michelle Yeoh and Emma Thompson have the strangest characters - in a good way - from the plot of the film. A Christmas store attendant with peculiar tastes and who has a romantic and secondary plot with the character of Peter Mygind, who can possibly get some laughs from the audience. And a mother from a broken family who is very protective of one of her daughters and is very afraid of being deported to her country of origin. Lydia Leonard's character has a small plot that I could call a dramatic and essential background, but it just stays there.Emilia Clarke and Henry Golding for being the protagonists, are the ones that stand out the most in the film. As stated before, none of the characters shy away from the adjective eccentric and strange. Emilia Clarke puts her essence of romantic comedy characters here and manages to be funny without being forced, possibly captivating the audience with the situations that surround her created by the script and is mentally messy. This all makes us want to follow its history and learn more about it. In the case of Henry Golding, they make up a very correct character and who possibly does not make many mistakes in his life. That's what makes the character weird.What may have surprised me in the entire film was its ending. It can be a little predictable if we think a little more outside the box and take the idea a little more than half of the film. In this case, it didn't happen to me. I was surprised and a little sad by the situation.The film is full of imperfections, such as the little importance they give to the dramatic background of some characters, but it is full of fun scenes that make your heart warm when you see them."
    },
    {
      "rating": "4",
      "text": "I don't know how my downloaded Rom-Com ended up being a sad, depressing movie. I really don't remember crying over a movie for the last time.This was it. I broke down,completely. Then got risenagain. Emilia, my girl! I oweyou a lot for this. Although,Henry broke my heart. These movies seem more real to me than the people I'm surrounded by. Cannot thank more. Sadness makes me happier, I suppose."
    },
    {
      "rating": "10",
      "text": "Don't listen to what the know-it-all critics have to say. This is one of the best movies I have seen in the past several years.  Extremely heart warming.  While I was never a fan of George Michael, I absolutely loved how the words and music was woven into the script. I have never seen an episode of Game of Thrones, and was totally unfamiliar with the actors in this movie - maybe that was a good thing, as I avoided any prejudices other reviewers might have. But the connection between the two main actors, Kate and Tom, was powerful. Overall, the movie was quite moving, and that's what I'm looking for - something that gives me hope and inspiration.I rented this movie on a whim - I did not watch the trailer, and I'm glad I didn't. I knew nothing about the plot, although now looking back after having watched this movie about 50 times (okay, actually I've only watched the last ten minutes probably 49 of those times!), I probably should have seen it coming.  But I didn't.  And it hit me harder than any other movie I've watched in recent memory.  And every time I watch it, it still does.This is not your typical Christmas movie.  I wouldn't even describe it as a comedy.  But it is true romance.  Watch it and decide for yourself."
    },
    {
      "rating": "0",
      "text": "Worst romantic movie ever. nothing to add... so boring and predictable. Waste of time."
    },
    {
      "rating": "9",
      "text": "I honestly don't understand the low scores. I am glad my family encouraged me to watch it anyway. A fun, refreshing Christmas film which stands far above all the expected Hallmark movies that are a dime a dozen."
    },
    {
      "rating": "10",
      "text": "This is a movie about a girl named (Kate) who is lost in the world and doesn't know what to do with her life. Until she meets Tom by surprise and further on in the movie Kate feels different being around Tom and she feels like she is alive. She shares a very emotional story where her heart stopped working and that she needed a transplant. She reveals a very personal story that has affected her very badly but it is almost like Tom has made her feel better.But further on in the movie she then finds out who is Tom. This is an extremely emotional film in the end but is funny and some parts of the movie may be a bit wierd at the start if watching with a family. Enjoy its a great movie to watch in Christmas."
    }
  ]
}