{
  "id": 2885,
  "title": "Last Vegas",
  "starring": [
    "Robert De Niro",
    "Morgan Freeman"
  ],
  "runtime": 105,
  "genre": [
    "Comedy"
  ],
  "description": "Aging pals Billy, Paddy, Archie, and Sam have been best friends since childhood. When Billy finally proposes to his much-younger girlfriend, all four friends go to Las Vegas to celebrate the end of Billy's longtime bachelorhood and relive their glory days. However, the four quickly realize that the intervening decades have changed Sin City and tested their friendship in ways they had not imagined.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1lG9hZaBie1yk3LEIu7OistHLGt.jpg",
  "categories": {
    "plot": 7.2631578947368425,
    "acting": 6.5,
    "ending": 6.285714285714286,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.333333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "“Last Vegas” stars Michael Douglas, Robert De Niro, Morgan Freeman and Kevin Kline in what can best be described as a senior citizen’s “Hangover” where, as in that film,  lifelong friends also experience a bachelor party in Vegas. That, however, is where the likeness ends for “lifelong” in this film means men who have been friends for over 60 years and have gone through many of life’s trials and tribulations together. This movie is geared for and will be enjoyed most by older movie goers who can identify with Cholesterol and PSA numbers versus baseball statistics and who can understand that phone calls from friends you haven’t heard from in many years don' always bring happy news. Well directed by Jon Turteltaub with a screenplay by Dan Fogelman, Messrs. Douglas, De Niro, Freeman and Kline get a chance to display their comedic and dramatic talents while ably abetted by a sparkling and charming Mary Steenburgen, all while in the venue of Las Vegas and, more specifically, Binion's Hotel and the Aria Resort complex. Though the jokes may be old, they are delivered well and make for a relaxed and nice viewing experience. This is not a great film nor will it win many awards but it does give the audience an opportunity to sit back and enjoy the exploits of these senior citizens as they seek new goals, heal old wounds and cement quality relationships. I give the film a 7 and recommend it to all who believe that life doesn’t necessarily end but can, in fact, begin over 70."
    },
    {
      "rating": "9",
      "text": "Pure fantasy for people who need to escape. This is a story of what happens when everything goes right in Vegas. It does not all have to make sense or be completely believable because it is all about having fun and solving a few issues in the process of having all that fun. That being said if you also want to have a great time in Vegas just see this movie. The real life stories usually don't end with you leaving the table with 120 grand, and you don't have to wait on your plane to arrive at the airport. Movie ticket much cheaper than real Vegas every time."
    },
    {
      "rating": "6",
      "text": "The cast are frivolously hilarious, while the story itself drags on like most comedy-dramas, into a very typical cheesy friendship story. But film has its moments, extremely funny moments, mostly contributed to the Oscar quartet. It is far from the hangover, but it's more mature and more meaningful. Cheesy, but in a good way."
    },
    {
      "rating": "8",
      "text": "Last Vegas might look a little incompetent and stupid at first glance, but give it a chance. There are truly hilarious moments (not just in the trailer), and a deep, relatable message about friendship and loyalty that went deeper on emotional levels than I thought it would. Also, it's funny to see these classic actors make fun of themselves like this. It's not every day you see Morgan Freeman drunk-dancing!"
    },
    {
      "rating": "8",
      "text": "A movie for the ages, meaning over 50.  Funny movie that keeps a smile on your face throughout and quite few burst of loud laughter.  I enjoyed it very much.  The young might have difficulty in relating."
    },
    {
      "rating": "5",
      "text": "Wasted talents for this movie. Predictable, bored, cliche, easy jokes. The names didn´t make any difference for the development of the movie. Everything solves really easy at the end."
    },
    {
      "rating": "0",
      "text": "Word for word, line for line, conversation for conversation the dumbest, most cliched, most boring movie of the last 5 years. Not much more can be said."
    },
    {
      "rating": "6",
      "text": "Michael Douglas is getting married, so his 3 childhood buddies (Robert De Niro, Morgan Freeman, Kevin Kline) travel to Vegas for the bachelor party. Those expecting the geriatric version of \"The Hangover\" will be disappointed…nothing remotely outrageous happens. Instead, there are basically 2 movies: Douglas & De Niro have a relationship drama, while Freeman & Kline provide the gentle humor. Almost all of the jokes rely on old age insults with lots of trite heartfelt hogwash to make it heartwarming. While it's fun to watch these stars poke fun at their age and there's energy in the filmmaking, this is a pretty tame comedy."
    },
    {
      "rating": "7",
      "text": "The most surprising thing about \"Last Vegas\" was that I laughed a few times and enjoyed it. You know going in that with a story about 4 old men who were childhood friends back in Brooklyn are now in Las Vegas where one of them is marrying a girl  Lisa (Bre Blair) more than half his age what the jokes will be about and they are. There are the Viagra, prostate and genital jokes. There will be very busty women all over the place, a lot of leers and plenty of old men jokes. The men are in Las Vegas to throw a bachelor party for Billy (Michael Douglas) the Peter Pan of the group.\r Giving him the party are Archie (Morgan Freeman), who has recently had a stroke and is living with his son Ezra (Michael Ealy), his daughter-in-law Karen Ceesay and his granddaughter, along with widower recluse Paddy (Robert De Niro) and Sam (Kevin Kline) whose wife gave him a condom and Viagra pill when letting him off at the airport and telling him that what happens in Vegas stays in Vegas.\r As can only happen in a Hollywood movie, Archie wins $102,000 at blackjack and the guys are given the huge luxurious penthouse suite and a host, Lonnie (Romany Malco) who is to see to all their needs. We also meet Dean (Jerry Ferrara) a mouthy kid who has to be taught a lesson, Maurice (Roger Bart) a straight cross dresser there with his wife and an assortment of female impersonator entertainers.\r Last, and most important, we meet Diane (Mary Steenburgen) who gave up her past life to become an aging lounge singer and changes the life of two of the men, probably the only 'spoiler' that can be in a film of this genre.\r The direction by Jon Turteltaub and the screenplay by Dan Fogelman. The four stars deliver with their charisma and professionalism while Las Vegas is shown at its glittery best.\r The main reason to see this movie is to catch Morgan Freeman when he shows his dance moves which are guarenteed to put a smile on your face!"
    },
    {
      "rating": "7",
      "text": "Taken as a dramedy for older folks, though, Last Vegas at least offers that demo enough relatable situations and moments to make for passable entertainment. We'll never know what it would it have been like to have seen the De Niro of the Deer Hunter and Raging Bull era opposite the Douglas of his China Syndrome and Wall Street years, but at least we'll always remember that sequence in Last Vegas when a guy in a thong shakes his junk in Robert De Niro's face. That's got to count for something in cinematic history, right?"
    },
    {
      "rating": "6",
      "text": "Take \"The Bucket List\" meets \"The Hangover\" and you have your surprisingly entertaining movie. While the movie is kind of stale, it's actors Michael Douglas, Robert DeNero, Kevin Kline and especially Morgan Freeman that make this movie worth the while. It has an interesting story base for old people and really just tries to give the audience a good time. And that's what makes this movie work. I give it a B-."
    },
    {
      "rating": "9",
      "text": "\"Last Vegas\" is based on a concept done to death, but for some reason, I loved it. Kevin Kline played my favourite character in the film, and although a lot of the plot is over-the-top, I felt it worked.  There are some great \"lessons\" in the film, and although some of the plot just works out \"too perfectly\", I dug it.  I wish movies trying to be like \"The Hangover\" would copy this instead."
    },
    {
      "rating": "5",
      "text": "The old folks jokes get old after awhile.  But the laughs supersede them and just for that, this film is worth the price of admission.  Hope there is a sequel somewhere down the line."
    },
    {
      "rating": "5",
      "text": "This is a fun movie. These guys have great chemistry. I've been describing it as your Grandparents version of The Hangover but it's a lot more than that. It's got a great message about friendship and all these actors are awesome. It's got a couple laughs but I think the target audience just isn't there and we could have done without it."
    },
    {
      "rating": "6",
      "text": "It's a funny enough movie with four great stars bringing the entertainment. I do feel like the film's more emotional moments do fall flat, and the romance is entirely predictable, but I had fun with it. There are plenty of laugh worthy moments and it does well playing off of it's star's ages. It might not be laugh-out-loud hilarious, but it's entertaining enough to be worth a rental and it won't feel like a waste of time. There's also a sweet core to it, although it does feel sort of artificial. Overall I give it a 6.8/10-Okay."
    },
    {
      "rating": "5",
      "text": "First question... why? Why did they have to do this?\rI will try to remember these really good actors for the great movies they've done and not for this one.\rOk it's not totally boring but it's predictable and not funny and it looks like a tons of other movies, I'll give it a 5 only because you can still see some (really short) good moments of acting."
    },
    {
      "rating": "8",
      "text": "When you take the plots of two successful movie franchises, and blend them into one, often the results are mixed, but this time, thanks to an all-star cast, The Hangover meets Grumpy Old Men in Last Vegas, and the results are hilarious. Billy (Michael Douglas) is 70 years old and about to marry a college student. While he seems content with his new life, he desires one last vacation with his three best friends from the old neighborhood. Reluctantly putting aside old quarrels, the men meet in Las Vegas for Billy's bachelor party, and once things get going, these guys prove that they are anything but over the hill. It's hard to go wrong with a cast of Academy Award winners that have literally hundreds of films under their belts, but a film like Last Vegas really does come down to the writing. If it's not hilarious, in the eyes of the audience, the cast will seem as over the hill as their characters. Thankfully, that wasn't the case, as simply the chemistry between these guys leads to some hilarious moments, that I'd be willing to bet were completely unscripted. Each actor brings their own unique style and brand of humor to the part and when they finally come together in Las Vegas, this film takes off. It isn't an exaggeration to say that this is one of the funniest films I've seen all year. Just the guys reaction to the things associated with modern day Las Vegas, like the technology, thugs, rap music, and strippers is absolutely priceless. The ancient cast and a PG-13 rating turned a lot of people off to this film, but the cast is a complete throw back trapped in a modern party town, leading to some epic scenes. Last Vegas is an absolute comedy gem, that somehow fell under most peoples radars, but it is every bit as good as the Hangover was, and maybe even more so, thanks to the experience of the cast and their tremendous chemistry."
    },
    {
      "rating": "3",
      "text": "Last Vegas isn't funny and carries with it some very lazy comedy. After 20 min the old jokes get old and the movie becomes boring in it's second half. The cast was a complete waste of talent."
    },
    {
      "rating": "6",
      "text": "Seeing prominent actors being reduced to a clichéd plot line makes the movie somewhat underwhelming, but it ultimately is a decent film that manages to have some funny moments."
    },
    {
      "rating": "7",
      "text": "This film was one of the best times I have had at the movies recently. I'm a 19 year old student filmmaker that's been studying film, analyzing it, making it, but through all of that I forgot what going to the movies is really about; having a good entertaining time. I believe movies should do several things; have a great story: this one's story was not AMAZING but the background the characters had with each other played a huge part in the film's story. A good film should have great messages; this one had some of the best messages I have seen in recent films, something that actually made me feel so much better and just all around happy; and the film should be entertaining. The jokes were laugh out loud funny (I won class clown and my father is a stand up comedian, it's not easy to make me laugh) but the humor in this movie was great. Although older audiences might get more from it, it made me so appreciative to have my whole life ahead of me, and know that I will never be too old to have a dumb good time with my buddies. The film also captured Vegas pretty well, maybe not every aspect, but enough to the point where it made you feel like you were there. I'm sick of critics only giving good scores to these long boring movies like Gravity, or Prisoners, because it's \"more intelligent\" or whatever. Screw that, I would take this film over films like that any day, because this is what going to the movies is about; laughs, cries, heartbreaks, in this case some awkward groaning and moaning sounds (I was the only non-grey haired person in the audience) but this film did it's job. The cast was hilarious together, I'd say this is one of the funniest films of the year, one of the funniest films about Vegas (yes, funnier than the Hangover) and a film for ALL ages."
    },
    {
      "rating": "7",
      "text": "Recently I have seen some good movies based on a gang of old people. 'Stand Up Guys', 'Quartet', 'Song for Marion', 'The Best Exotic Marigold Hotel' et cetera the list goes on where aged people rule. It's nice to see old guys are still capable to handle the responsibility in the entertainment business. Those movies I saw were really awesome including this movie.\r After the opening scene which lasted for a couple of minutes the next commencing portion of the story was very ordinary. Just like a copy and paste of todays movie theme based on young people who fancy LAs lifestyle. It was until the beginning of the last quarter of the movie. That is the segment I began to love it. The love triangle with strong emotions. In one word to describe, it was an ordinary opening, but ended in a style.\r It is hard to point out who had a greater role and who excelled their parts. In my view, all the four + one were equally performed good. The flaw was in the story which made no sense in many scenes regarding casino and their guest. Except those it was highly entertaining, especially the first half was fun and the rest were about heartbreaking love and friendship.\r It was kinda envious because someday I am gonna be an old and a similar kinda situation may occur to me. It might not be my story, but looks like those four are gonna be me and my friends someday. This movie might not be a reality, but stays closer to your heart in emotionally. It was not a great movie as well not rejectable."
    },
    {
      "rating": "2",
      "text": "Commercial film making at its lazy worst starring 4 has been leads who seem to have undertaken the enterprise purely to have a paid holiday. In truth they are probably having a lot more fun than any discerning audience member ever could from this farrago.  Morgan Freeman should have known better. Robert De Niro has just become a pathetic joke in the roles that he now plays. B actor Kevin Kline has ambitions to be included in the A list of actors, but instead finds himself in an E rated film, and Michael Douglas, after his brilliant turn as Liberace, sinks to his usual underwhelming level. Pity poor Mary Steenburgen saddled with a totally unconvincing role as a singer who can just drop everything to go aimlessly wandering around with this sad quartet.\rThe lame screenplay is embarrassingly unfunny and has a centre so soft that the whole thing can best be described as mush. It also has a rehearsed feel to it and even if it was funny is played in too knowing a manner signposting jokes and situations in neon scenes in advance.. The end result comes over like an old age pensioner's wish fulfilment fantasy and the whole dismal enterprise reeks of male chauvinistic fantasy. A predictably appalling waste of money in both concept and execution."
    },
    {
      "rating": "5",
      "text": "Much anticipated, it could have been an excellent ensemble but just pays off just average and forgettable. It has a few good laughs and nice chemistry."
    },
    {
      "rating": "5",
      "text": "I didn’t find “Last Vegas” to be absolutely horrible—far from it.  The jokes may be predictable and very formulaic but Douglas, De Niro, Freeman and Kline are all terrific together and really have a chemistry that works and makes them believable in their roles as old friends.  However, the story gets really corny towards the end and takes away from the little humor the film gives you at the beginning."
    },
    {
      "rating": "7",
      "text": "To see this movie more than once  bad choice.\rIf you have enough time and would like to spend it that film is good for it and that abundant.\rDialogs logical and simple at same time. You will see some great episodes, but only a few.\rSort of kind movies with awesome start as Douglas, De Niro, Freeman and Kline and only one minus, they are playing in a boring movie and on average, it makes an average movie with a great ending.\rParadox is, one of the best moments in this movie you will see in the end, that isn't happy ending or etc., it is vitally ending.\rOf course everyone need to make their own decision to see or not to see this movie\rI only suggest, not to see. See it only for vitally ending is not rational."
    },
    {
      "rating": "7",
      "text": "Although the movie lacks many things a good comedy should be, our four musketeers make a satisfying appearance. Recommended for  anyone that enjoys old fashioned comedy movies"
    },
    {
      "rating": "7",
      "text": "Last Vegas is about a group of long-time childhood friends who meet in Vegas for a weekend because one of them is getting married. This film was great with cameos by LMFAO and 50 cent. Michael Douglas, Robert De Niro, Morgan Freeman, and Kevin Kline did a great job acting and it's hard to believe these 4 great actors have never worked with each other before and they should definatly work together again on future films."
    },
    {
      "rating": "10",
      "text": "its cool rembering what you did as a child back in the day i love this movie it is funny and great . it is just like  grown ups movie expect its about old people ."
    },
    {
      "rating": "9",
      "text": "Anybody who doesn't find this movie marginally short of excellent has no sense of humour whatever their age. I feel sorry for csw12 and more so for Proteus who must be sad and boring soles. Take my advice and see this movie, it is well worth the entrance money."
    },
    {
      "rating": "10",
      "text": "Fantastic funny film - it's for more of an older audience, which is  why it has some low reviews, as the youngsters today .... Blah blah lol.   but I couldn't stop laughing - although my 22 yr old son watched it too and he was collapsed with some of the one liners.  It was brilliant - really was"
    },
    {
      "rating": "8",
      "text": "I wasn't expecting to enjoy this film because I thought I was a bit too young for it, but I was surprised. All four of the main characters were hilarious and they all worked so well off of each other. It seems like they like they know each other pretty well behind the camera. Last Vegas is just a great buddy comedy. It doesn't matter how old you are."
    },
    {
      "rating": "6",
      "text": "Some have said that this movie is nothing but a geriatric remake of The Hangover, but that just sort of cheapens the hangover. This is very pedestrian and while the performances of the actors are great, there isn’t much happening here. It’s not very edgy and kind of falls flat. One thing I do know, my mother, god rest her soul, would have loved this film."
    },
    {
      "rating": "5",
      "text": "When an older man wants to marry a very young girl in Las Vegas, and invites his friends, all the same age as he is, things can get crazy, and they certainly do in 'Last Vegas'.\r The movie stars Michael Douglas as Billy Gherson, a successful businessman who lives in Malibu, California with his very young girlfriend, Lisa (Bre Blair) who he asks to marry her, and she says \"Yes\" without hesitating. Billy then decides that Vegas is where he wants to get married, and he calls his long time childhood friends; Sam (Kevin Kline), Archie (Morgan Freeman) and Paddy (Robert De Niro) who is angry at Billy for reasons of his own.\r When the four men arrive at Las Vegas, they start to take things into their own hands and party like they're not even old men. There are many scenes where we see young women throwing themselves at these characters, and the men seem to be having a good time... all except for Paddy.\r I admired 'Last Vegas' for its use of these characters, Douglas is good at being the leader of the group and De Niro works as the constantly fused and sometimes reluctant odd one out. Freeman and Kline do well in their more comedic roles which does keep the movie going for the most part.\r The problem is; this is almost like any other comedy of this particular setting you've seen before... it's almost as if 'The Hangover' (2009) was pushed ahead of time and this is the result of the comedy you get. Sometimes, the comedy tries too hard to make it seems limitless, and more often than not, the plot is put to a dead standstill from time to time, making you think that the movie's run time, which is only 105 minutes, can feel a little stretched out.\r This is okay for any senior to watch and have mindless fun, but for the most part, it could have had better potential."
    },
    {
      "rating": "6",
      "text": "Una comedia entretenida y hasta con un buen mensaje pero no es algo que supere las expectativas y sea memorable."
    },
    {
      "rating": "8",
      "text": "The movie, yes, is like The Hangover of the old mans, but it's lighter and in a way more touching, but still fun. The production is simple, with a light and loose script, right music and correct cinematography. I think the director did not have to have had so much work with the cast, with a very strong quintet, each with his Academy Awards. Perhaps most surprising is Mary Steenburgen, great on the scene, but the leading quartet does not leave to be desired, even Morgan Freeman superior sense in several moments."
    }
  ],
  "recommendations": [
    "sisters",
    "17_again",
    "friends_with_benefits",
    "wanderlust",
    "going_in_style",
    "my_spy",
    "just_go_with_it",
    "easy_a",
    "no_strings_attached",
    "life_as_we_know_it",
    "tammy",
    "the_dilemma",
    "dirty_grandpa",
    "chef",
    "the_boss",
    "neighbors",
    "forgetting_sarah_marshall",
    "just_friends",
    "central_intelligence",
    "10_things_i_hate_about_you",
    "blended",
    "the_break_up",
    "trainwreck",
    "book_club",
    "due_date"
  ]
}