{
  "id": 3521,
  "title": "Last Action Hero",
  "starring": [
    "Arnold Schwarzenegger",
    "Austin O'Brien"
  ],
  "runtime": 131,
  "genre": [
    "Adventure",
    "Fantasy",
    "Action",
    "Comedy",
    "Family"
  ],
  "description": "Following the death of his father, young Danny Madigan takes comfort in watching action movies featuring the indestructible Los Angeles cop Jack Slater. After being given a magic ticket by theater manager Nick, Danny is sucked into the screen and bonds with Slater. When evil fictional villain Benedict gets his hands on the ticket and enters the real world, Danny and Jack must follow and stop him.",
  "releaseYear": "1993",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yTfjHPqh7C7bkfMtEKx2mPdorQw.jpg",
  "categories": {
    "plot": 6.888888888888889,
    "acting": 7.125,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.125,
    "action": 8.454545454545455
  },
  "reviews": [
    {
      "rating": "7",
      "text": "First Arnie movie I ever saw. This movie is good, but definitely not the best movie that stars Arnold Schwarzenegger."
    },
    {
      "rating": "6",
      "text": "There were many funny scenes, especially when they made jokes about movies with Schwarzenegger and the story is also interesting. But the young boy sucks so much."
    },
    {
      "rating": "9",
      "text": "Great fun story that spoofs action films, while playing a good action story.  Some bits are a bit too depressing, but overall the tone is fun,and tight comic take with a some gentle and not-so-gentle ribbing of the genre.  The casting is uniformly excellent in this."
    },
    {
      "rating": "10",
      "text": "Excellent and very fun movie with action !! It s well like a 2010 movie :o)i like it and scharzy is on top  !!! A story so original...Please come back Arnold and make the 2"
    },
    {
      "rating": "10",
      "text": "Love this movie, Benedict is the best villain ever. Ripper is the second best villain ever (well, it's a tie between him and the wet bandits). This movie is so much fun, \"Who Framed Roger Rabbit\" and Last Action Hero and \"Hook\" are my magical childhood movies."
    },
    {
      "rating": "7",
      "text": "Last Action Hero is a colorful, fun romp through self-aware parody. There are a lot of funny in-jokes and riffing on action movie cliches to be had here. The film also features a highly memorable performance from Charles Dance as the main villain. Lat Action Hero is a much underrated movie."
    },
    {
      "rating": "5",
      "text": "Last Action Hero is basically a film about Arnold Schwarzenegger doing what he does best in the world of Arnold Schwarzenegger- ducking from explosions, and using brute force to save the day. Nothing new."
    },
    {
      "rating": "8",
      "text": "When this first came out, I believe it received a lot of criticism. I think the criticisms have been unfair, for this is a very smart and funny send up of the action genre. I also think this is underrated, of course the plot is a little complicated, about a young boy getting sucked into the celluloid world of his hero, in places and it is slow to begin with. But there is a lot of fun to be had; including the spectacular set pieces and the expert direction of Hunt For Red October director John McTiernon. The scenery is lovely, the sets are colourful and the costumes are very nice. Plus the action is exhilarating. Arnold Schwarznegger I think is talented, and he gives a great performance here. Austin O'Brien is appealing as Danny, Charles Dance is terrific as Benedict and Ian McKellan is literally unrecognisable as Death. Other excitements to be had in this film are the many cameos from the likes of James Belushi, Sharon Stone, Joan Cartwright and Jean Claude Van Damme. All in all, a fun and smart take on the action genre, on par with Loaded Weapon 1 and High Anxiety and better than the disgusting trash of Disaster Movie, Epic Movie etc. 8/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "Imaginative, witty, funny, scary, action-packed and cool. Used to love playing with my Last Action Hero action figures"
    },
    {
      "rating": "7",
      "text": "All time classic although a bit rough on the edge at times in terms of script."
    },
    {
      "rating": "8",
      "text": "After watching this movie with my brother, he explained it to our mother as a form of fan fuel made just for me."
    },
    {
      "rating": "9",
      "text": "This film is far, far, far better than it deserves to be considering how many cooks the studio tossed into the mix in terms of the script. It is delightfully entertaining and (as it is a satire) doesn't take itself seriously at any point. But I think other than all of the cameos, amazing locations and legendary soundtrack, the true standout here is the performance turned in by Charles Dance. He was wonderfully evil but oddly not cartoonish in this one. His character was by far my favorite in the film and he truly nailed it."
    },
    {
      "rating": "9",
      "text": "20 years after its release this movie is still funnier, smarter, and more self-aware than 99% of films released in the time passed since.This film is an underrated classic. It's Adaptation, made well before Adaptation - as an action movie.The best I can tell is, you have to watch it with your thinking cap on. It is slower than a 'full-blown action movie' but is also much, much more rewarding. Mr. Benedict, written with excellent lines and an impeccable performance from Charles Dance, is among the all-time biggest movie villains along with the Emperor from Star Wars, Judge Doom from Who Framed Roger Rabbit, and Hans Gruber from Die Hard. Swarzenegger was at the prime of his career when he made this film but the self-critical nature of it shows a certain level-headed quality about the actor, where, at the top of his game he was able to step out of his trademark 'macho' screen personality and make a fool of himself.The film could have been edited a bit tighter - but hell, it's still a masterpiece. Any person wanting to make movies must watch this.I mean, it has effing Sir Ian McKellen. As Death! What more do you want?"
    },
    {
      "rating": "6",
      "text": "I liked the idea and it was interesting to watch, but some parts were just too cheesy (and I do not mean the parts where they did it on purpose, that was good) - like whole weird shooting effects and all that. Maybe in 90s would have appreciated it more, but watching now can feel them being a bit whacky."
    },
    {
      "rating": "7",
      "text": "So it seems after a quarter of a century has passed Last Action Hero is finally getting the recognition It deserves. The film when released in 1993 was a failure. Certainly, for Arnold who was the undisputed box office champ on Earth. To make things worse this film released alongside the once in a lifetime juggernaut Jurassic Park. Even the variety newspaper's headline around the time was \"Spielberg's lizards steal Arnie's lunch!\" So on its own what is the consensus? I feel that the film is a joy ride and brimming with nostalgic feelings of happy feel good. Nothing Is meant to be taken seriously, and yet there are some underlying themes. Arnold as Jack Slater fits the role incredibly well as the larger than life mega star- which is a play on his stardom, one of the clever things nobody got at the time. Last Action Hero is getting recognized all over the internet and rightly so- this is a great film.(Misunderstood cult)."
    },
    {
      "rating": "5",
      "text": "The original idea was awesome. The first forty minutes of the movie are amazing: the pace is excellent, we (as spectators) must use our intelligence to truly understand the its location and atmosphere and the relations between characters. The balance between 'reality' and 'movie' (movie-ception) is great. At the beginning it is really hard to see where the plot is leading us. And that makes it original. But as soon as the plot define itself the movie get bogged down in facilities and effortless work.Schwarzenegger is epic. He doesn't hesitate to caricature himself. But Danny (Austin O'Brien) is horrible. He can't stop defending his thesis while just using the ticket to prove its abilities is far more intelligent. He only becomes useful and interesting at the very end of the movie. All along he is just that shallow normal annoying kiddo. I just can't stand his face. Charles Dance as the villain is incredible. Really solid performance. Costumed are great excepting the fact that all cops women wear latex and indecent clothes.The overall universe is terrific. There are so many jokes and easter eggs that some mathematically have to make you laugh. Many of them happen thanks to Schwarzenegger. And that is what happened to me. The movie made me laugh hard some times, and that's rare and priceless. There are many impressive meta-jokes. Some scenes are amazingly quotables thanks to all this action-style.I found it marvelous that such a movie had such balls to criticize Hollywood, its actors and system. But the film ends sadly by entering into these clichés that he brilliantly denounced. Ending is terrible. It seems like a happy ending but wait... Did the protagonists just let some movie characters live in their reality? Did they seriously let the character of Death personally live on Earth? It is like nothing had changed between beginning and the end! No morality, just dumb action!"
    },
    {
      "rating": "7",
      "text": "An underrated classic that spoofs all Schwarzenegger movies! The kid may be too much but the action is entertaining."
    },
    {
      "rating": "10",
      "text": "\"Последний киногерой боевика\", как и многие из моих любимых фильмов, почему то оказался провальным и в прокате, и у жопоголовых американских критиков. Честно говоря не знаю кто эти критики, но они передохнут, а вот фильмы которые они так яростно засерали останутся и станут классикой. Что уже доказано временем, взять хотя бы фильм \"Нечто\".И так, \"Последний киногерой боевика\" на мой взгляд один из лучших фильмов Шварценеггера. Это, если что, не боевик а комедия или даже пародия на боевик. И обыграна эта пародия великолепно, с проломом четвёртой стены, с шутками над своими же хитами.В фильме задействовано множество звезд того времени, загримированных под их же звёздные роли. Один Т-1000 в исполнении Роберта Патрика чего стоит. Я не знаю, как удалось заманить столько дорогостоящих актёров на секундные роли, но я слышал, что сам Арни договаривался.Фильм вообще снят очень красиво для своего времени. Красиво и дорого.Сюжет нарочито отмороженный. Когда повествование проходит по ту сторону экрана, авторы следуют по всем тупым канонам боевиков 80-90х годов. Это и бессмертный протагонист, и его тупой босс, и киборг-злодей мечтающий захватить мир, и прочее, прочее, прочее. А вот когда действие переносится в наш мир, то всё становится на место. Нельзя впитать 20 пуль и не заметить этого, нельзя врезаться в стену и не пострадать. Зло в нашем мире может победить. А Моцарт это не гангстер из киношного мира Джека Слейтера, а композитор написавший прекрасную музыку. И вообще в нашем мире людям просто бывает больно.Вообще сюжет вертится вокруг зарождающейся дружбы супергероя Джека Слейтера и его самого большого поклонника 12ти летнего Дэнни Мадигана. Кто бы мог подумать, что волшебный билет Гудини окажется взаправду волшебным, и поможет пацану-неудачнику, не только встретиться, но и подружиться с кумиром всей его жизни.В фильме есть мораль, она заключается в том, что если верить в чудо, то оно может действительно случиться.Когда я смотрю этот фильм, то снова возвращаюсь в детство. Разве это не главное в хорошем кино?А критики? Да пошли они в задницу."
    },
    {
      "rating": "10",
      "text": "Спасибо Сокол,  что напомнил мне про этот замечательный фильм из детства. Пересмотрел с огромным удовольствием"
    }
  ],
  "recommendations": [
    "kingsman_the_secret_service",
    "indiana_jones_and_the_temple_of_doom",
    "the_losers",
    "thor_the_dark_world",
    "thor_ragnarok",
    "the_fifth_element",
    "hercules",
    "boss_level",
    "the_scorpion_king",
    "american_ultra",
    "the_suicide_squad",
    "true_lies",
    "the_terminator",
    "kung_fu_panda_2",
    "deadpool",
    "deadpool_2",
    "the_a_team",
    "sherlock_holmes_a_game_of_shadows",
    "die_hard",
    "hulk",
    "jungle_cruise",
    "django_unchained",
    "demolition_man",
    "avengers_age_of_ultron",
    "desperado"
  ]
}