{
  "id": 502,
  "title": "Last Night in Soho",
  "starring": [
    "Thomasin McKenzie",
    "Anya Taylor-Joy"
  ],
  "runtime": 117,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "A young girl, passionate about fashion design, is mysteriously able to enter the 1960s where she encounters her idol, a dazzling wannabe singer. But 1960s London is not what it seems, and time seems to be falling apart with shady consequences.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ahbwIJl7T0D34m3sPKlBaCqs2xH.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.2368421052631575,
    "ending": 6.380952380952381,
    "soundtrack": 7.05,
    "cinematography": 6.9,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 7.4
  },
  "reviews": [
    {
      "rating": "4",
      "text": "I mean, seriously? SPOILER: When we find out Diana Rigg was actually Anya Taylor-Joy, and that she had murdered dozens of her johns back in the day, Diana Rigg says \"They deserved it.\" And Thomasin McKenzie just agrees. ... Really? Every man who ever paid for sex deserves to get their throat slit? Sex workers, do you agree with this?The bigger problem was that we were (sort of) told that Thomasin McKenzie could do something about Anya Taylor-Joy's dreams getting flushed down the toilet. But she never could. So her trying to get Taylor-Joy's attention in all those dream sequences was straight up pointless.  The movie started out super strong. Outstanding writing for the first half. Which made the second half feel extra long and meaningless."
    },
    {
      "rating": "5",
      "text": "Ok, this is kind of a letdown, because it looked a lot better in the trailers.'Last Night in Soho' is about letting the past die, killing it if you have to (Kylo Ren approves), but the redundancy of its plot is tiring, especially when the cheap jump scares and clichés begin to pop here and there.A film about a young woman from today reliving the mysterious life of another one in 60's London sounded promising; however, Edgar Wright has some trouble finding the balance between the two timelines, so he finds refugee in what he's known for: music and style.Some unexpected but welcome themes question an idealized age, and I can go with that, but the plot ends to be deceiving, and not in a good way.Oh, and the last act is just terrible. It's so cringing to hear a \"villain\" explain the whole movie at the end, and that's exactly what happens here.But hey, at least there's some good music in here, and it's great to listen to these songs nonstop, even during the horror scenes."
    },
    {
      "rating": "6",
      "text": "Edgar Wright has raised the bars so high with his previous movies that this one seems somehow a letdown. it's still a good horror movie and at least it comes from someone who actually knows something about cinema but I hoped for something closer to the mood of its first trailer, and something way more unique."
    },
    {
      "rating": "0",
      "text": "Knew nothing about the film coming in and although it started fine, and the costume design was clearly well thought through, the rest of the film didn’t feel like it had been thought through at all. You feel no connection to any of the characters or any of the plot points as they’re all so fleeting and half developed. The horror and CGI unfortunately comes across as very cheesy, and I don’t think the writer even knows who we’re supposed to be sympathising with as characters flip from villain to hero back to villain without any real rhyme or reason (at one point the lead almost kills one of her classmates and then this seems to be forgotten by the writer and all characters afterwards) The relationship between the lead and her only friend is incredibly forced and feels ham-fisted, again you feel no connection to either character or their relationship. There's clear intent for you to believe that this creepy old guy is the killer, followed by an apparent plot twist that he isn’t the killer but is actually a copper (and then the lead essentially gets him killed which helps develop the plot in no way whatsoever.) Yet you are still wondering why this copper was so weird and creepy the whole film and whether you’re supposed to feel sorry for him. The “subtle” hints at plot-reveals are again all incredibly ham-fisted (the envelopes at the end) and although I went into the film with no expectations at all I still somehow left feeling incredibly let down. Surprised to see so many good reviews"
    },
    {
      "rating": "0",
      "text": "Due to overflowing amount of social commentary that piece of propaganda is not an art at all. And that's my answer to the propoganda."
    },
    {
      "rating": "5",
      "text": "Not my taste. It was nicely made, with all the mirror shots and scenery, but the story felt a bit dumb in some parts. It was ok, but nothing more for me"
    },
    {
      "rating": "1",
      "text": "Так и не понял для кого это было снято, красивый антураж портит видение режиссёра и тупая история"
    },
    {
      "rating": "5",
      "text": "Starts off charming but descends into repetition - it’s fast paced in the most important storytelling parts and drawn out in the meaningless bits. Overall a mish mash of nothing too exciting. The art direction is good.The music that’s not pop songs from the 60’s seems really out of place."
    },
    {
      "rating": "6",
      "text": "I love Edgar Wright, he's one of my favourite contemporary creatives and some of his works rank amongst my top favourites such as Hot Fuzz and Spaced. Naturally, I was eager to check out his latest offering, something that's different from his normal body of work. Last Night in Soho (2021) is a Horror, Mystery, Drama about an enthusiastic aspiring designer from the countryside going to a prestigious London college of arts where she encounters the ability to visit the city in the 60s that starts wreaking havoc in her life after the glam and glimmer subsides. The film shines when it comes to the cinematography, editing, set designs, soundtrack, and costumes, where even with the restraint shown, justified for the story and tone, you still get that Edgar Wright style that makes his movies stand out. It can be gorgeous with some amazing camera work and long takes. I enjoyed the performances too. Thomasin McKenzie as the lead was able to carry the film on her shoulders quite well, for the most part. Accompanying her was the gorgeous Anya Taylor-Joy who, as in pretty much everything else I've seen her in, was great. The supporting cast does a good enough job.For the first half or so, you aren't exactly sure where the story is going and the mystery was enticing although, the themes weren't original nor were the social commentary and a lot of it was only superficially deep. Still, the horror elements intertwined with the tale plus the execution made it entertaining albeit not nearly as hard-hitting as I'd hoped it would be. However, when everything starts panning out around the final act, the story just fumbled and got all floompy. You can surely understand the tragic tale the film is going for but the writing leaves a lot to be desired. The entire finale was unsatisfactory which sadly brought down the whole experience for me.I always appreciate it when an artist tries to branch out into different genres from what they're known for and I do applaud Edgar Wright for doing that but this is, without a doubt, the weakest of his works I've experienced. I'd still recommend it giving it a try, you might enjoy it a lot more than me. But as it stands, this was a disappointing watch for me but there were still elements I appreciated and was also entertained for a lot of the runtime. And if I were to rate it, I'd give it a 6.5/10."
    },
    {
      "rating": "5",
      "text": "Last Night in Soho is a genre-bending thriller, that sprinkles horror, sci-fi, Muscial and period-piece onto an incredibly bland \"small town girl in big city\" plot. Its supernatural elements are exclusively connected to the protagonist, who can see the dead, travel through time, possess certain people (or not?) and do other unexplained things when it serves the plot. Soho is a classic case of style over substance. The movie tries hard to evoke the dread inducing feeling of much better entries like Black Swan or Suspiria. It fails utterly. A disappointing effort from Edgar Wright, who usually turns in better work."
    },
    {
      "rating": "5",
      "text": "Last Night in soho is a great movie. The camera work was amazing and it makes you feeel like you are traveling with it. The plot was okay. It wad entertaining but nonetheless I feel very confused with the ending. Everything was great from the movie except the ending. After giving us alot of what happened to sandie I widh they wouldve given us a good ending for her instead of what they gave us. Nonetheless it was a great effort and great job to everyone who participated in it."
    },
    {
      "rating": "6",
      "text": "Though stylish to a fault, this paranormal crime drama about a present-day London fashion design student who has ghostly visions of the alleged murder of an aspiring 1960s nightclub singer who's crassly pimped out by her manager unfortunately can't make up its mind if it wants to be a De Palma-esque thriller or a campy romp. Granted, it does both well, but, regrettably, it fails to mesh them successfully. The film also has a tendency to become repetitive, cinematically going over the same ground time and again, teasing viewers about a twist that's obviously coming but is perpetually delayed. Director Edgar Wright's latest could thus benefit from some judicious editing, as well as a tighter focus in terms of what it's actually trying to be. Thankfully, this offering is blessed by the fine performances of Anya Taylor-Joy, Matt Smith, and, especially, Diana Rigg in her final screen appearance, though Thomasin McKenzie's lead portrayal becomes cloyingly whiny and annoying over time. \"Last Night in Soho\" is by no means an awful picture, but it's too bad that its substance doesn't match its style."
    },
    {
      "rating": "6",
      "text": "For a while after I finished watching it, I was a bit conflicted. It slipped through my mind after some minutes.I'm not disappointed, but neither am I delighted or excited. Just meditative.Last Night in Soho is pretty much a film about nothing.Certainly a mystery that looks great, but its concept of dreams that come true and dreams that died in a big city is not original.Of course, Wright puts it in another perspective, but it's a perspective that's completely controlled by him to be able to mold it to his liking in order that the situations that give life to his film continue to occur.At first, the lead character seems to be able to see ghosts.I'm not really sure if I can call them that, but you can intuit it, even though at first we only see that she can see her dead mother.She arrives in London to start studying to become a fashion designer. And being a country girl she is completely out of place.After a quick change of her living place, she gets involved in dreams that feel to real, and that also begin to consume her.But why? And more importantly. Does it matter?Edgar Wright does not give much with which to defend himself in that regard.The problem here is not that whatever happened to the character of Anya Taylor-Joy, is only important for Thomasin McKenzie's character, but that it raises other questions that this story does not even bother to address, with the exception from the little mention about schizophrenia at the police station. Which leaves you with two options. Either she's mentally ill, or she can genuinely see, ghosts?And neither of them really answers the question of what happens to McKenzie's character. That's what history gives us and that's pretty much it. Her own mental breakdown is also quite rushed.Two beautiful and romantic dreams and everything is going very well. One goes wrong and McKenzie starts to freak out. What's up with that?And I must say it. Thomasin McKenzie was not up to the task. Even though she appears much less on screen, Anya Taylor-Joy totally consumes her. In each and every one of the scenes in which she appears.If you're going to get an impression of this movie, it's because of Anya Taylor-Joy.The climax is predictable because if you're paying attention, you quickly sense who is who.And going from murderous rage to conclusive acceptance of the crimes to then die and obtain some sort of redemption and closure had no impact on me. But at that point there was nowhere else to go.It's an entertaining film for this weekend. But mark my words. This in the future will not be recognized as one of the best works of Edgar Wright."
    },
    {
      "rating": "9",
      "text": "Went in hoping the movie wasn't going to be medicore based off the last few trailers. But left with an amazing cinematic experience with a compelling story that pulled me in with every new twist. Movie also does a good job of showing the nostalgia of older years and the real sides of the story that are usually missing."
    },
    {
      "rating": "0",
      "text": "This movie left me shaking my head. I will say I enjoyed the movie although it was very biased and deceptively pushed clear cultural narratives. Because the movie was biased, I believe it is only fitting to leave a biased review. This is a movie that depicts all white men as evil, all the while heroizing a beautiful serial killer making her out as a hero. I thought the acting was great I was infatuated with the two main stars who performed there rolls with obvious talent. However the premise and plot of the film and those responsible should go sit in the corner and think about what they have done."
    },
    {
      "rating": "7",
      "text": "Director Edgar Wright continues to expand his repertoire with this unique thriller. An innocent, aspiring fashion designer (Thomasin McKenzie) moves to London, where she’s somehow able to follow the life of another woman from the ‘60s (Anya Taylor-Joy). The excitement of the period and place slowly gives way to creepy moments with a climax that’s dramatic but not especially powerful. The performances are enjoyable and the music adds fun. Wright keeps it interesting and adds masterful directorial touches. It’s hard to create a surprise ending anymore and this one doesn’t really astonish or shock. Still, it’s an enjoyable experiment in stylistic suspense"
    },
    {
      "rating": "7",
      "text": "I'm between a 6 and a 7 on this after one viewing.  It seems like a movie that will improve upon re-viewings (as all Edgar Wright's films do).  Then we will not rely on story twists for enjoyment, but enjoy the film on a scene by scene basis for what it accomplishes.  The points I subtract are mainly due to flimsy plotting.  I think it needed one more twist, or one more....something... to deliver that second act.  2/3 into the movie I didn't know where I was in the story, which is both a good and a bad thing;  on one hand that means I was immersed and uncertain of where things would go; on the other hand it means that I felt a de-synchronized from the flow of the story.There is a lot of cruelty in the film which caught me off guard and left me not feeling that great walking out.  It's more of a straight ahead genre picture than i expected from Edgar Wright who is one of the great comic directors.  I missed his satirical touch here in the writing and film.  But what he does deliver is an entertaining movie, which I would still recommend to fans and non fans alike.  I hope this film does well, because we want to keep encouraging Edgar to do whatever he wants to do; and I want to see more original, standalone, genre pictures like this in theaters!"
    },
    {
      "rating": "5",
      "text": "I had high hopes given Edgar Wright's previous works. The performances and cinematography are the highlight of the film. The first three quarters is suspenseful and atmospheric, and keeps you guessing. The climax and resolution ruined it for me. The twist was haphazard, and the moral message at the end. Diana Rigg turns out to have been Anya Taylor-Joy, and that she as a prostitute murdered scores of men just to deflect from her own poor choices in life. The fact that Thomasin McKenzie's character accepts the justification for serial killing, leaves me wondering who Wright is pandering to. I feel like giving him the finger for that ending."
    },
    {
      "rating": "1",
      "text": "An absolute piece of garbage. Speechless. If you find yourself endorsing this film, you might want to question if you’re actually human. Nothing here. A low point for film."
    },
    {
      "rating": "7",
      "text": "Visually stunning. Busby Berkley on steroids. Fantastic soundtrack. Incredible set pieces. Scenes that make you go \"Whoa\". I'm not a big fan of the horror genre, but this movie goes a bit deeper than your typical slasher film.  You can't change your past, but if try to understand it, you might just learn something from it.  But what you learn may hurt you the most.  A dark, decadent shocking thrill ride."
    },
    {
      "rating": "9",
      "text": "i wish i would’ve watched this high, i might go see it again because WOW this was so good"
    },
    {
      "rating": "8",
      "text": "Loved the 60’s aesthetic juxtaposed with modern London. The film is shot beautifully, the characters are likable, and the screenplay is thrilling. Only weak performance was John for me. The movie is unpredictable at times, and it keeps you guessing. Would highly recommend for fans of horror/thrillers."
    },
    {
      "rating": "9",
      "text": "A flim unfairly criticised, like most of Wrights films I fear that this one again will go down as a so called ‘cult classic’. Perfectly portrayed is the whimsical glamour of the 60’s; juxtaposed with the nightmareish realities of human behaviour."
    },
    {
      "rating": "10",
      "text": "Para mi, la mejor película del año, te atrapa de manera alarmante desde el principio, te agarra con mayor fuerza con cada minuto transcurrido y cuando todo parece haberse solucionado te extrangula con sutileza y brutalidad a la vez.Magníficas actuaciones, deslumbrante puesta en escena y una historia intrigante en todo momento."
    },
    {
      "rating": "0",
      "text": "We walked out 30 minutes in. The film was trying to mimic the work of David Lynch with its surrealness but was very unengaging with no direction or discernable plot. The Director is so obsessed with aesthetics and recreating an era, especially in terms of music, that many scenes just drag on while you watch people singing or dancing. It's all about spectacle. It's supposed to be a horror but the music is mostly upbeat with the occasional jump scares just shoe horned in there.Nothing is explained, the lead actress is sappy and irritating. The film tries to create a sense of nostalgia for a time period that was only 50 years ago and you're supposed to believe its somehow better than the London of today. They just drive slower cars, dress differently and have different hair cuts. But the music was soooooo much better.... yawn"
    },
    {
      "rating": "10",
      "text": "A movie that stealthily creeps up on you as unpretentiously as the female lead and then turns out to be fantastic. It reminded me, about halfway through, of that timeless horror classic that also creeps up on you – Carnival of Souls. Excellent cast, superb script, great direction. A classic."
    },
    {
      "rating": "7",
      "text": "I was reminded of James Wan's Malignant (which was released about the same time) after watching Edgar Wright's Last Night In Soho. Both concern female leads who suffer from violent visions of death, involving stabbings, and each director seemed to have an Argento giallo itch that had to be scratched. While not my favorite Wright film, it shows the director evolving as a director, moving away from his trademark smash cut edited montages while maintaining his love of music and image ala Baby Driver. It may be guilty of style over substance, but oh, what style. Anya Taylor Joy embodies the saucer-eyed Twiggy swinging '60s Britain, while Matt Smith embodies the dark underbelly. Thomasin McKenzie is the new fashion designer student haunted/entranced by visions of the past, with Terence Stamp and the late Dame Diana Rigg (a '60s icon of her own via The Avengers) as characters who may not be who they seem. If they ever decide to correct the Ralph Fiennes/Uma Thurman version of The Avengers, cast Tom Huddleston and Anya Taylor Joy and set it in the '60s, give Wright a call."
    },
    {
      "rating": "6",
      "text": "An aspiring young fashion designer student (Thomasin McKenzie) travels to London to pursue her dreams of breaking big into the fashion industry. However, when she rents an old room in Soho, she soon finds herself seemingly transported back to the 60s and seeing visions of a young model and singer/dancer (Anya Taylor-Joy). What starts off as glitzy and glamorous flashbacks of this starlet quickly turn into nightmares as images of her being seemingly murdered begin to haunt her, and she must uncover the truth about what happened all those years ago before she loses her sanity. First off, Edgar Wright as the director of this film was what really piqued my interest. He's one of the most brilliant, creative, and all-around fun visionaries working within film today, what with films like 'Shawn of the Dead', 'Scott Pilgrim vs. the World', and 'Baby Driver' to name a few to his name. And after having almost no idea what to expect going into this after watching the couple of very vague trailers that we got for this, I gotta say that this film was quite a lot to unpack. It's heavy on the lights, glamor, and 60s aesthetic, while also being unexpectedly trippy as hell. Flashbacks scenes become distorted with reality quite a bit, almost a bit too much for my liking to the point where it was overly noticeable and somewhat irritating and distracting at times. The color palette and schemes throughout however were very clever and added a nice touch to many of the scenes. All involved in the cast are brilliant, especially McKenzie and Taylor-Joy, who each stun and deliver at every turn, and Matt Smith also plays his mysterious part well. Storywise, no film has done a better job keeping me guessing or on my toes in a long time than this one does, and this is largely thanks in part to the many flashback scenes and hallucinations that distort and blend with reality, but like I said, it also was slightly overused to the point of becoming distracting and slightly redundant. But overall, it's undoubtedly a unique blend of horror and neo-noir, albeit a somewhat crazily-edited and tad too trippy of one as well. Still, it's got its fair share of memorable, tense, and hair-raising moments."
    },
    {
      "rating": "8",
      "text": "Loved it! Outstanding visuals and performances from both of the leading ladies. The soundtrack is phenomenal but the main attraction is the atmosphere the director sets. The story is fine and there aren't a lot of horror elements, but it's still a truly enjoyable film."
    },
    {
      "rating": "7",
      "text": "The movie has great music, is a bit too long but has a great ending, which i do not want to spoil! Edgar Wright has done better movies, but the design of the movie, including the music, is top notch als always! 7/10"
    },
    {
      "rating": "8",
      "text": "Director Edgar Wright gives us something a little different to his usual with a psychological thriller/horror. I had high expectations after seeing the trailer and Last Night in Soho did not disappoint.Eloise (Thomasin McKenzie) is an aspiring fashion designer about to commence her studies in London. The culture shock hits Eloise hard quickly changing from a small town to a busy London city. She mysteriously begins to enter into the 1960s where she encounters the seductive Sandie (Anya Taylor-Joy). Much like Eloise she is also hoping to start out a new and glamourous career and make a name for herself in London. Eloise is enchanted by these glimpses into another time but soon the dreams of the past start to take a dark and sinister turn.I've already been impressed by Thomasin McKenzie in a couple of her previous roles and now as a lead in an Edgar Wright movie she gives a brilliant performance. Also starring Anya Taylor-Joy as the wannabe singer and honestly she's great in everything. Last Night in Soho captures the glitz and glamour of 1960s London while also diving into the darker side of show business. It's very impressive visually with the use of smooth transitions and mirrors. I couldn't help but sit there wondering how they managed to film some of the scenes. Starting very strong and very much in the psychological thriller genre but as it progresses it drifts more into a horror. I'd argue that the third act is not as good as the first two but that didn't hinder my enjoyment too much. It's still immensely entertaining with a great story full of twists and turns, accompanied by an epic soundtrack and a terrific cast.I love the use of music in Wright's movies, Baby Driver particularly used the song selection to its advantage and Last Night in Soho has an equally brilliant soundtrack that perfectly throws the audience back in time to the lavish London night scene. It's the type of film once you finish you immediately want to go and listen back to the music. Highly recommended."
    },
    {
      "rating": "10",
      "text": "Only just seen this but great little film that takes you on a nostalgic trip into the 1960s London underbelly! Shades of Hitchcock, Twilight Zone and Tales of the Unexpected, lots of twists and turns, plus a killer soundtrack."
    },
    {
      "rating": "9",
      "text": "Edger Wright is one of my favorite Director movie like Three Flavours Cornetto aka Shane of the dead , Hot Fuzz and World's. And baby driver are great movie . I think last night is my favorite movie . Since 1960 London what you expected the time era with Bond movie came out If the fix a few things than I can easily give it the 10/10"
    },
    {
      "rating": "9",
      "text": "I'm biased regarding Edgar Wright seeing how I do love the Cornetto Trilogy and did enjoy Scott Pilgrim VS the World. However, hear me when I say that this film is absolutely fantastic.  A very masterful and professional feature by Edgar Wright, even considering how the horror/drama genre is outside of his usual element.   The sound design, music, editing and cinematography were all fantastic. All the acting were executed greatly, with Thomasin McKenzie giving off an amazing performance.   There are however a few flukes that can be distracting: there are a couple of jump scares, with one in particular being specifically lame. The character of John is quite underdeveloped over all, while Jocasta's character is a bit cliché. One could also point out how personel within an emergency department probably wouldn't be able to arrive in just 2–3 minutes, especially since the main characters didn't even call the emergency number themselves.   But I personally didn't see these points as too damaging to an over all amazing feature. Do yourself a favor and watch this in theatres. The experience is one of the best since Avatar.  I'm giving this film a solid 9/10!"
    },
    {
      "rating": "7",
      "text": "Edgar Wright is one of my favourite directors working right now. His work on the Cornetto trilogy, Scott Pilgrim and Baby Driver was amazing. When he revealed his next work to be a horror movie, I was super interested. The premise is \"An aspiring fashion designer is mysteriously able to enter the 1960s, where she encounters a dazzling wannabe singer. However, the glamour is not all it appears to be, and the dreams of the past start to crack and splinter into something far darker\". So is this another home run by Edgar or a truly forgettable night in Soho?One thing I appreciate about this movie is just how unique Last Night in Soho is. Edgar Wright conjured a horror movie like no other. Edgar blends a mix of mystery and psychological horror in a wonderful way that just works. The mystery aspect is the most central element in the plot. Trying to figure out what is going on with our main character and what happened in the 1960s is what keeps the story interesting. Throughout the film, I was trying to piece everything just like our main lead and I love that! Psychological horror is the second element and it is handled fascinatingly. There is the ghost stuff which is typical horror movie stuff but the real horror is the things that happened underneath the surface, which I won't spoil. It's not a topic that I would expect Edgar to explore but he handled it in a tasteful way that works for the movie. What he explored feels believable, in that you could see it happening in the real life. It's quite scary to believe that but that is what makes the film great. Additionally, I love the contrast in production design and cinematography between the modern-day and the 1960s. The cinematography and sets are very grey, brown and slightly washed out in colour in the modern-day. When it changes to the 1960s, it then becomes incredibly vibrant and colourful even during the darker stuff. The costume designs are also wonderful in showing this contrast as well with the wonderfully elegant 1960s clothes feeling very authentic. Edgar Wright is also still able to give some great camera shots. One memorable sequence is a dance scene where the girl keeps changing between Eloise of present-day and Sandie of the 1960s. On that note, all the actors do a great job, even those with small screen time such as Terence Stamp and Diana Rigg (who sadly passed away). Anna Taylor Joy gives a performance, unlike anything she has done before as Sandie. However, she ain't the main lead as that responsibility goes to Thomasin McKenzie who does a phenomenal job. She is able to convey the fact that her character, Eloise, was losing her mind and it was a sight to see her go from sweet and loving to an almost full-on panic attack.    I mentioned it before but the film utilises Ghost in the plot as a way to give scares but it doesn't really work. It is very clear this is Edgar's first attempt at the horror as the Ghost just kind of appear in the full body which reduces any impact of a scare from them. He also starts to use them a bit too much that it gets to the point that I just kind of felt numb to their appearance. It gets especially noticeable in the second half where build-up and tension just get tossed out for another event of \"ghost appearing time!\". On that note, in terms of writing the second half becomes a very B movie and campy. It's not as strong as the first half and gets to a point where it feels very silly. There are also some cool reveals but they don't get executed in a very satisfying manner.Overall, this is a great first attempt at horror from Edgar Wright. Although, some would argue that this is more of a mystery than horror as it ain't downright scary. Nevertheless, I had an enjoyable experience watching this film and I'm glad that Edgar did something more original in a genre that is losing a lot of steam. Edgar film is one memorable night in Soho and I can't wait to see what Edgar does next."
    },
    {
      "rating": "8",
      "text": "Filme muito bom, que mostra muito bem tanto o passado quanto o presente, um suspense bem gostoso de se assistir"
    },
    {
      "rating": "8",
      "text": "For Edgar Wright’s weakest film, it’s still pretty great. I know I said that after I saw it that it was my favorite film of the year but I have changed my mind. It’s still pretty great but the longer I thought about it, some cracks started to show mostly within some of the actions the characters make. Thomasin Mackenzie almost stabs someone in the eye and she doesn’t get in any trouble for it? Just little nitpicks like that but it does pull you out. It was also really easy to call out the big twists of the film long before they actually happen. The twists were great but easy to see coming. The ending also felt a little too cliched. It should have ended at a certain scene but it didn’t and gave us an ending that feels like it’s ripped straight from other films. All of the performances were great. Anya Taylor-Joy was pretty great here. Her character was constantly engaging and the way she transforms throughout the film was great to watch. Thomasin McKenzie gives a career best so far and I think her performance very effectively shows the main theme of the film. There’s nothing wrong with wanting to reminisce about the past but it isn’t as perfect as you want to imagine it is. Easily my favorite performance of the entire film came from Matt Smith. That may be my Doctor Who bias talking but I thought Smith’s performance was phenomenal and one of my favorites of the year. He is able to distinguish himself from his other performances and it was amazing to see him play a compelling and screwed up character. The writing is great but doesn’t really compare to Wright’s other films. His direction however is as good as always. His style is still very distinct here along with the editing. Even though this is a completely different genre for Edgar Wright, he still knocked it out of the park with the horror elements. There is a clear homage to other horror films like Rosemary’s Baby but they only serve as homages up until the ending. Wright’s editing style is still present but feels very toned down compared to his other films. It’ll be exciting to see if Wright continues to work in this genre. I would definitely recommend checking this out. It’s not Wright’s best but a worthy film in his filmography."
    },
    {
      "rating": "7",
      "text": "(Mauro Lanari)Eros and Thanatos of importation, at least for those who are not Japanese or British. Lolithism (if not even worse) has landed among us young Westerners through manga and anime: even today, when some site requires me to disable the adblock, advertising for a porn movie of that category can pop up; instead the late adolescent malaise, anguish, disturbance reached us through the English music that we called dark while it was correct to define it goth rock, a contamination with the occultism of Ossianic mythology. 21-year-old Thomasin McKenzie is simply perfect in her provocative Japanese comic book role: oval face, big eyes, lips, chin and breathtaking breasts. For the dance at the Halloween party, the choice of \"Happy House\" (1980) of Siouxsie and the Banshees is equally perfect in evoking unhealthy and spiritic atmospheres. Furthermore: the film states several times to be set in swinging London, in the beat generation of the second half of the 60s, yet it begins with \"A World Without Love\", a song written by McCartney and left to be recorded in February '64 by the duo Peter and Gordon precisely because The Beatles were about to make the big leap from beat to rock / brit pop (December 1965: \"Rubber Soul\"); the same for \"(Love Is Like A) Heat Wave\" in the beat version of The Who of '65. A remarkable temporal and cultural phase shift, as much as the mother-daughter doubling (Jocasta?), the multiple doppelgangers (Lynch) and mirror games (Welles), as well as the entire first half of the film that enjoys confusing dream and reality as in the video, shot by Michel Gondry, of \"Let Forever Be\" by the Chemical Brothers (1999). Did the eye in the cocktail glass remind you of Someone's Korova milk bar? If this work by Wright poses a problem, it is on how to judge quotationism: an added value or a lack of originality?"
    },
    {
      "rating": "8",
      "text": "I genuinely love Edgar Wright's filmmaking, but really everyone here delivers a stunning performance, painting a dream-like picture of London in the 1960s. It's captivating seeing all the different cogs gripping into eachother, leaving you almost always at the edge of your seat. The latter third of the movie is a bit too drawn-out in my opinion and the movie doesn't really know howw to end properly, but it's still a fun, heart-wrenching, and engaging ride."
    },
    {
      "rating": "9",
      "text": "The starting was slow although the fashion stuff and the music and old london recreation was great, The soundtracks were awesome, The story was good and the pacing was amazing, The twists were surprising and the ghost sequences were intense, The 2nd half was awesome and the ending was mind-blowing. Overall it was a entertaining and thrilling and a good movie!"
    },
    {
      "rating": "10",
      "text": "Last night in Soho surprises in its style. It breathes the 60s and it is phenomenally portrayed. You will be enchanted by the atmosphere, colours, music and the slowly converting tension. The main character carries the plot along with some strong side characters.  Together it was a fantastic experience that you will not soon forget."
    },
    {
      "rating": "8",
      "text": "Edgar Wright's most recent film is... very good!I don't love (but still like) the ending as much as the rest of it, though 'Last Night in Soho' is an extremely enjoyable psychological horror flick. The film's aesthetic is top notch, while the performances of Thomasin McKenzie and Anya Taylor-Joy are brilliant; the way their story is portrayed is real nice. Diana Rigg, Matt Smith and Terence Stamp are involved too.I do have a few lesser things to mention. The fashion college classmates being hella cartoony is one, though the only main one is the end reveal... it kinda underwhelmed me, even if there's nothing inherently wrong with it. As it happened I was just like \"well, OK...\". I think I expected greater based on what precedes. It's a 'good' conclusion, still.All in all, it just falls short of being something I'd consider as 'great' but I still had a positive time with it and would happily revisit it. As for its standing in my Edgar Wright ranking, it's top three... though, to be honest, all of his movies - 'A Fistful of Fingers' aside - are good."
    },
    {
      "rating": "8",
      "text": "This is a new experience for me, to see an Edgar Wright film in the thriller genre. Overall, I really enjoyed this movie, the story was interesting, the main characters are lovable, and I did care what will happen to them next. The style and music of this film was on top, one of key points why I love Edgar Wright movies. My personal score is solid 8, there're a few questions regarding traveling back to 60s and how it all work and because of this, I can't put a higher score for it."
    },
    {
      "rating": "8",
      "text": "Edgar Wright did a great job on the visual level, but not much on the narrative. Still, Last Night in Soho is worth watching, especially by the duo of Thomasin McKenzie and Anya Taylor-Joy."
    },
    {
      "rating": "7",
      "text": "Acting/Cast: Superb cast of actors. Surprised but happy to see Thomassin McKenzie as the lead and equally surprised to see Anta Taylor Joy screen time quite as low as it is. That's not a bad thing, but it was surprising. Was expecting Matt Smith character to be more charming and the fact he wasn't was also surprisingly good..Music: wow. I mean you know it's Edgar Wrigjt and it's gonna be top notch. His choices are very good. Typically unexpected choices that capture the vibe without drawing on the obvious classics.Plot: the first hour is tremendous but it loses its way when it turns more old school horror and away from the psychosis story that embraces the first half. If this had stuck to the psychosis and away from monsters then it could have been an 8 or 9. But it confuses by trying to add a bug ending that it doesn't quite stick. It's just not scary enough to pull it off whereas whereas strength of the actors could have made this pyscologically scary if the story had stuck to its original guns.In summary: it's good but it's not great. I would watch it again though for that first hour and for thommasin and any who are the finest young actors around"
    },
    {
      "rating": "9",
      "text": "Muy difícil ponerle una pega a tremenda película, todas sus partes estás maravillosamente pensadas y creadas, desde el montaje con ese tono musical, basándose en el ritmo, hasta el guion, la premisa tan bien construida...Las actuaciones son una locura, Thomasin McKenzie lo borda, Matt Smith hace que te creas su personaje, y luego Anya Taylor-Joy se come la pantalla, brutal.La construcción de la trama, lo visual que es con esa gran puesta en escena, la dirección arriesgada, con muchas referencias, es genial.· Cosas buenas: La música, el montaje basado en ella, todo tiene su ritmo. La puesta en escena hace que visualmente sea una locura, aunque la fotografía tampoco me maravilla. Las actuaciones principales, las dos lo bordan, Londres está muy bien construido, como que tiene su propia personalidad, y por último, esas miradas con tanto significado.· Cosas malas: Ciertas partes que les falta un poco de desarrollo, quizás hacen que sea un poco apabullante y confuso. Al final le cuesta acabar, parece que va a pecar pero lo remonta bien, además, el argumento no es nada que no hayamos visto.· Conclusión: De lo mejorcito de este año hasta el momento, según yo, te recomiendo que no veas el tráiler ni sepas de lo que va, así te va a sorprender el doble, porque aun viéndolo, te sorprende, y sales del cine con una gran sonrisa, muy recomendada."
    },
    {
      "rating": "10",
      "text": "Absolute F**** 10. this movie was astonishing. Visuals, soundtrack, cast, story, twists, writing, pacing. It makes you think which is a much-needed break in the horror genre from the ones that go BOO! I really suggest you watch this movie, as it's one of the best horror movies I've seen in a long time. Pretty much The Shining level for me."
    },
    {
      "rating": "6",
      "text": "admirable[ ad-mer-uh-buhl ]adjectiveworthy of admiration; inspiring approval, reverence, or affection."
    },
    {
      "rating": "10",
      "text": "Sorry \"Malignant\" and \"Conjuring Devil Made Me Do It\" but Last Night In Soho is simply the best horror movie of the year, not only it's a way terrifying movie, it's a way better movie too, the movie have a style and a real fantastic performance, Edgar Wright did a fantastic job making an illlusion on the movie from the cinematography and the color, so the audience is not bored seeing the same usual horror movie technique, the movie also helped by the theme, the 60s, the music from the 60s that completely replacing a usual horror sound to build a momentum, overall Last Night In Soho is not only one of the best movie of the year, it's the best horror movie of the year, highly recommended."
    },
    {
      "rating": "9",
      "text": "I love Edgar Wright's slick direction style and his infusion of music to set an atmosphere. He has such a unique directing style. This film is indeed unique, I absolutely loved it. The cinematography, production design, and costumes are excellent and really invoke the 60s vibe. The soundtrack and choice is music makes every scene pop. Both Thomasin McKenzie and Anya Taylor-Joy are phenomenal. The script is original and unpredictable. It really was a shame that my theatre was empty for this. Everyone needs to go out and support original film."
    }
  ]
}