{"id": 3880, "title": "Last Days in the Desert", "starring": ["Ewan McGregor", "Ciarán Hinds"], "runtime": 98, "genre": ["Adventure", "Drama", "History"], "description": "On his way out of the wilderness, Jesus struggles with the Devil over the fate of a family in crisis, setting himself up for a dramatic test.", "releaseYear": "2016", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/7vbP28axycrpchnGSIydUseNkh6.jpg", "categories": {"plot": 8.0, "acting": 8.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 5.0, "funny": 5.0, "action": 8.0}, "reviews": [{"rating": "8", "text": "Slow-paced and quite odd in some parts, this original tale that takes place during Jesus' 40 days in the desert succeeds thanks to a complex little drama and a very human depiction of Jesus. We get to see as a person genuinely looking for answers and trying to find out who he is. It's really quite powerful to think of Jesus as looking for answers from God just like any normal person would do.\r Ewan McGregor gets a double role as both Jesus and the devil. While he brings depth to both characters, it's his performance as satan where he really shines. Admittedly that's because he isn't given too much to do as Jesus. He really does a fantastic job in the role of jealous little trickster who's angry at God. The conversations between the two characters show a remarkable dynamic, especially given that they are both being portrayed by the same person. The best moments of the movie are when McGregor onscreen twice at the same time.\r The story itself is rather small and slow. The rest of the cast is just as fantastic as McGregor, even if Tye Sheridan's odd character leads to a more confusing performance. I can't exactly say he was bad here. Just that there was something a little off with his acting.\r The hardest part of this movie to enjoy is it's pacing. It can be incredibly slow at times, particularly in the very beginning. The movie starts off with nothing more than Jesus walking through the desert for an extended period of time. That is something that could very well turn off people before things even come close to getting started. Even then the plot moves very slowly.\r However it's the complex human emotions that can keep one engaged in what is happening. Particularly where Jesus is concerned. Yes, McGregor may get to do more as the devil, but his and the writer and director Rodrigo Garcia's ability to make Jesus incredibly relatable to the average person is incredible. Particularly if the person has ever struggled with their faith in any way.\r It's a slow drama for sure and definitely not for everyone. The only thing to keep you going early on outside of the beautiful cinematography is the potential for the story to go somewhere powerful. It does, but not on the surface. It's the underlying themes of temptation and humanity that keep things strong. top-notch performances and an excellent Jesus, devil dynamic keep things compelling even if the plot takes forever to get started and then go somewhere. All in all it's a pretty great drama for anyone that is okay with digging beneath a perhaps mundane setup. Religious belief of any form is not required to receive enjoyment from what is on display. Just a knowledge of who/what Jesus is supposed to be."}, {"rating": "5", "text": "Has some mildly profound moments but otherwise paints Jesus as a wandering semi-enlightened individual. Pointless."}], "recommendations": ["the_rover", "21_grams", "her", "melancholia", "ex_machina", "the_good_shepherd", "the_road", "closer", "thoroughbreds", "leave_no_trace", "20th_century_women", "a_monster_calls", "the_card_counter", "the_hunt", "manchester_by_the_sea", "a_prayer_before_dawn", "bicentennial_man", "blue_valentine", "the_killing_of_a_sacred_deer", "first_man", "the_boy_who_harnessed_the_wind", "the_starling", "swallow", "the_impossible", "crash"]}