{"id": 1375, "title": "Lawless", "starring": ["Shia LaBeouf", "Tom Hardy"], "runtime": 115, "genre": ["Crime", "Drama", "Western"], "description": "In 1931, the Bondurant brothers of Franklin County, Virginia, run a multipurpose backwoods establishment that hides their true business — bootlegging. Middle brother Forrest is the brain of the operation; older Howard is the brawn, and younger Jack, the lookout. Though the local police have taken bribes and left the brothers alone, a violent war erupts when a sadistic lawman from Chicago arrives and tries to shut down the Bondurants operation.", "releaseYear": "2012", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/Ahtzwts22ayviD3LEVslfL4nRWB.jpg", "categories": {"plot": 6.39622641509434, "acting": 6.797297297297297, "ending": 6.333333333333333, "soundtrack": 7.555555555555555, "cinematography": 6.428571428571429, "familyFriendly": 3.0, "funny": 8.25, "action": 6.111111111111111}, "reviews": [{"rating": "7", "text": "Enjoyed much more than the critics average would of suggested. It tries to bill itself as a realistic account of prohibition but plays out like a Clint Eastwood spaghetti western. It has a somewhat unique view that kept me entertained for the time in the theater but do not expect to be making any DVD purchases of this film any time soon. Decent acting though. The bad guy was a little to much over to top for this movie if you ask me and did not fit in well with the theme or other characters. He fit in like putting Buggs Bunny in Star Wars. Other than that pretty good but not greatness."}, {"rating": "6", "text": "A trio of unruly brothers (Shia LaBeouf, Tom Hardy, Jason Clarke) sells moonshine in Virginia during Prohibition. The story may be true, but the script's a mess. It takes too long to develop a plot and when it does, it's dull and predictable. There are some painfully violent scenes, but most of the action is tedious. Performances range from over-the-top to outrageous, none creating much empathy. One of the most bizarre touches, musician Nick Cave's two country versions of Velvet Underground's  \"White Light/White Heat.\" Other than that, the film lacks originality or emotion."}, {"rating": "8", "text": "While trying its hardest to be gritty, realistic and perhaps accurate, Lawless tends to come off too 'Hollywood'  a few times throughout the film, but with superb performances and a very graphic tale, it is ultimately one of the best films of 2012.\rTom Hardy is the undeniable and deserved star of the show, his quiet, focused and very powerful performance as successful moonshine business runner Forrest Bondurant lifted the film to new heights it wouldn't have reached without his and Guy Pearce's performances. Based on the true story of the Bondurant brothers, also consisting of Jack (Shia LaBeouf) and Howard (Jason Clarke). Jack tries desperately to be a part of the business his older brothers run in Franklin County.\rBut trouble is not far around the corner, and when the big gangsters from the city are becoming more consistent, Special Deputy Charley Rakes (Guy Pearce) is drafted in to bring sort of order to this lawless county, with his own methods in hand.\rWhen Forrest refuses a deal to be in the pocket of the law, its a battle of survival and honour from there on in, bloodshed to bloodshed.\rThe beautiful cinematography, Prohibition era setting and the landscape add up to an excellent looking film, but it often it seems to get lost in itself, Gary Oldman makes an appearance as notorious gangster Floyd Banner, but disappears quite quickly without much warning. The characters jump in and out of importance but ultimately do have their own burdens and troubles, Forrest is reluctant to let Jack join the business, and he has also to try and encourage the other 'bootleggers' to stand up against the new law in the town.\rShia LaBeouf's Jack is touted as the driving force of the film, how he tries to finally step out of his brothers shadows, but Forrest is just too good a character to paint over, his calm and collective attitude, but his protection of his family when necessary are shown through Tom Hardy, while Guy Pearce is frightening and often deluded as Charley Rakes, his perfect hair and menacing eyes tell a story that you wouldn't want to hear.\rGraphic in its content, there is plenty here to be entertained, humour, horror, but most of all, performance. Not without it's cons, but Lawless certainly hits all the right notes and has some of the best performances of last year."}, {"rating": "7", "text": "What a stellar cast we have in Lawless, (Gary Oldman) as the gangster, (Guy Pearce) as the violent deputy from Chicago, (Tom Hardy) as the oldest bondurent brother, (Jessica Chastain) as the head waitress at the Bondurants restaurant, then finally (Shia LeBeouf) as the lead actor and most developed character in the film. Can Shia carry with movie on his shoulders? Can he fulfill his western ascent throughout the 1hr and 55min runtime? I believe the biggest query that I want answered from LeBeouf is, âcan he grow up in this film?â? Will Lawless be the movie where he grows up, and get the Even Stevens tag off of him? Or will he still be considered the kid from Disney channel, and all those Transformers movies? Set in the depression era, where the prohibition law took place. A band of bootlegging brothers (LeBeouf, Hardy and Howard) made huge profits of selling liquor, âwhich in the movie was moonshine.â? After successful years of selling moonshine, a deputy from Chicago (Guy Pearce) comes into town to stop the Bondurent brothers from proceeding in their very profitable business, which I mean (LeBeouf buying new cars and nice suits every week.) can the bootlegging smugglers continue to rule their business? Or does the deputy have enough force and will to stop them? The acting in this film was outstanding and was the main reason why I enjoyed the film. (Guy Pearce), who is very unrecognizable in this movie, gives me the finest performance I have ever seen from him. One of the best performances I seen this year so far, heâ(TM)s absolutely violent to the max, and wonâ(TM)t let a thug embarrass him for nothing. One particular scene that Iâ(TM)m very fond of is when (Guy Pearce) and (Tom Hardy) first meet in the movie. That scene is so intense that youâ(TM)re waiting for an all out brawl to happen between those two characters. (Tom Hardy) also plays a very good part as well, he plays another badass role that when pisses him off, you better run. Iâ(TM)ll just say that (Tom Hardyâ(TM)s) character is invincible, literally. Finally we have (Shia LeBeouf) as the youngest and more stupid brother. Jack, which is LeBeoufâ(TM)s character, is the most developed out of them all. He plays the younger brother that just wants to be like his older brothers and make them proud, which leads to some very gruesome and violent scenes. Both (Tom Hardy and Guy Pearce) carry two acts of the film alone. As the third act reels in, itâ(TM)s (Shia LeBeouf) who carriers this film all the way to the end, with a very impressive performance from him. The bone chilling violence, with the great acting and the good script leaves this movie at a high entertaining level, even with the 2nd half of the film being weaker then the first. Lawless is a film that youâ(TM)re either going to relish about, or going to completely shut out. I say this because, the movie is not fast paced, nor does it have a lot of action, and in todayâ(TM)s society that is what most people want when they see films on the big screen. If you like action packed movies, this is not down your ally, and should probably check out Expendables 2, âwhich I have not seen yet.â? I enjoyed the hell out of this film and defiantly will see this movie again some time in the near future. I was atonished by how the movie looked, the set pieces were right on point with the western feel. Good make-up effects for the bloody and beaten faces that most all characters went through in the film. With amazing acting, and great character development, Lawless ends up being worth the full price admission. Back to the question, does Shia LeBeouf finally grow up in this film? \"Yes, he certainly becomes a man in Lawless,\" which i'm very glad to see."}, {"rating": "6", "text": "It was alright. It's slow at times, but reels you in with the action scenes. It can be quite gory at times and unrealistic, but that's the way many movies are nowadays. Good acting as predictable, but the plot struggled at times."}, {"rating": "7", "text": "American mythos lives on in Lawless"}, {"rating": "7", "text": "Overall lawless was... Pretty good no real big complaint I guess. This movie will definitely not win or even get close to being nominated for best picture or anything but I can almost promise you that you will have fun with this film"}, {"rating": "7", "text": "Beautifully shot, masterfully acted, and fun to watch, Lawless tells the sordid tale of moonshining brothers during the American Prohibition. Shia LaBeouf, Tom Hardy, and Jason Clarke are fantastic as the three brothers. The supporting cast and soundtrack are great as well.The problem with Lawless is the script. The script is a meandering hackjob that tries to say a lot more than it actually does. Still, the performances and cinematography were enough to keep me invested in the characters and interested in what happens to them. A fun action movie and historical drama if nothing more."}, {"rating": "5", "text": "Violent drama. A backwoods bootlegging outfit struggle against city gangsters and corrupt cops. Guy Pearce sneers his way through nastily, but there's no-one to cheer for or pin your hopes on, leaving this a pretty miserable experience."}, {"rating": "9", "text": "What a rollicking good ol' time at the movies! Think \"Breaking Bad\", circa 1930, and you have a taste of what \"Lawless\" is like. Stellar ensemble cast, beautiful cinematography, tremendous production design, one of the best soundtracks of the year (reminiscent of \"O Brother, Where Art Thou?), and a LOT of action! Dunno if its gonna cause any Oscar buzz, but I sure liked it!\r This one is NOT for the squeamish though! TONS o' graphic violence and very bloody, but all of it fits within the realm of the story, so I won't call it gratuitous. Definitely not for everyone because of this factor, Those that see it and have a discriminating eye may catch some editing, continuity,  & make-up gaffs, but you know what? Heck, even \"Terry Malloy\" (Brando) even gets outta the wrong side of the cab in On the Waterfront, so you'll find little \"oopsah-daisies\" in the very best films of all time. Downloading the soundtrack from iTunes tonight. Grade = A-"}, {"rating": "8", "text": "Nick Cave and John Hillcoat are back and they offer us another sophisticated historical film \"de genre\". Lawless is obviously less original, violent and - let's admit it - interesting than its predecessor (The Proposition), it is nonetheless a powerful and striking effort focusing on the destiny of a brotherhood of local gangsters during the prohibition. The actors are convincing, especially supporting actors such as the gorgeous Jessica Chastain and aweful Guy Pearce. Quite classical, but with a modern and exquisite presentation."}, {"rating": "10", "text": "Ran across this movie last week.   I have watched it at least 25 times now, read the book and did a little ancestry research.  Phenomenal casting, soundtrack carries you to the period and the emotion of the time.  Compelling cinematography captures the essences of the hard times people managed to thrive and survive. The movie captures the genuineness of the family bond and speaks to the nature and character of the men and women of the era. My Grandfather and his brother were bootleg drivers in Oklahoma/Arkansas/Louisiana.  My Grandfather survived, his brother did not, killed while hall white-lighting, in a high speed chase. Have pictures of them, the stills they operated and their stories.   This movie brought back a lot of memories, Love the movie, the acting, location, book, history."}, {"rating": "9", "text": "One of the best movies of the year.  While it doesn't quite reach Hillcoat's masterpiece The Proposition, it's still a beautifully shot, though brutally violent period piece that is expertly acted by the entire cast.  While it's ultimately Tom Hardy who steals the show, Guy Pearce looks to be having the time of his life playing the cartoonish (in a good way) and sleazy villain, and Nick Cave and Warren Ellis' soundtrack stays with you long after the credits roll."}, {"rating": "0", "text": "It was a horrible movie!The worst one I have seen so far. An absolutely meaningless plot with a tremendous amount of a brutal violence. I honestly have no idea why there is a film about a bunch of criminals who were selling the moonshine. What is so special about it? In those days it was very popular in Russia. Almost in every village there were people who were involved in such activities as producing the moonshine why do we need to spend two hours of our life just to stare at this disaster?"}, {"rating": "9", "text": "Not a film for the squeamish or faint-hearted.  Casting very good, music was tremendous and the cinematography was superb.  I especially thought the casting of women was tops."}, {"rating": "8", "text": "Really enjoyed this movie, but also felt it could have been so much better! Cinematography was great, and loved the way it showcased absolutely everything."}, {"rating": "1", "text": "The pacing was too slow and much of the cast (e.g. Jessica Chastain) is wasted.  But the most fatal of the mistakes is cast Shia LaBeouf in such a central role.  Admittedly, it's not his fault that he's surrounded but vastly superior actors."}, {"rating": "3", "text": "The movie was pretty subpar. The plot was very slow moving and not suspenseful at all. Furthermore the story of 3 unknown hill-dwelling bootlegger brothers really isn't very interesting and I'm not sure it necessitates a movie being made. Regarding the shots, I never understood why in the world they had so many closeups. There was also a very bizarre church scene that I did not know the point of. It simply was a movie I could not get into. The acting was good but that's about it."}, {"rating": "5", "text": "A rather simple story with simple folk, must be the reason they cast LaBeouf in it. The Brits (Hardy, Oldman, Taylor) are exellent as always, Aussie Pearce makes a great creepy bad guy and Shia is used as a punching bag most of the time...finally he has found the role he was made for. Let's hope type casting ensues. I was mostly entertained, didn't cry though, laughed when Shia got punched, but it won't be remembered as one of the great films of our time..."}, {"rating": "5", "text": "Lawless is an enjoyable enough film but it lacks depth. It also suffers from varying shifts in tone from being a serious and grizzly look at country men adapting to changing times to an almost eighties type romp when some of those same men come into money. There's some good performances, notably Guy Pearce and Tom Hardy but Shia Lebeouf feels very out of place. Theres also a nice cameo from Gary Oldman (why they have him build so strongly in the advertising, I'm not sure). Credit also to the design crew as its quite lovely in parts as a recreation of the 1930s America.\rThere's worse ways to spend your time at the cinema, just dont expect anything as epic as you may like."}, {"rating": "9", "text": "This film has many aspects that make a movie great. There are amazing and fun characters, there is an interesting story, great acting, tension, ect. This movie had something that is missing from movies today and it was made as a money-grabber but it was made to be a great movie. The audience liked this movie, it had scenes that were funny and sad. It had scenes that were made you laugh out loud and sit on the edge of your seat. Everything is great about this movie. Only downside was a little bit too much blood at the very beginning (just a little bit too much) and there wasn't enough Garry Oldman but  Tom Hardy and Shia Labeouf  played outstandingly."}, {"rating": "1", "text": "Story was weak and violence was gratuitous.  Not worth the price of a ticket.  I would be willing to see Guy Pierce get a best supporting nod, in spite of the fact that the movie was not good."}, {"rating": "10", "text": "Brilliant film, wonderful cast. Good to see Tom Hardy playing more American roles. Guy Pearce's character is a total shocker and well acted. I can't praise this film enough. Everybody has their own tastes with regards to what makes a good film and for people to go on this site and slate it is just sad and wrong!!! Good film and if you are the sort to slate this film, get out of your dark little cave and live a little."}, {"rating": "8", "text": "The best film of the year so far, Lawless is as gritty and grisly as they come, as well has having one of my new favourite characters of all time. Hillcoat has refined his style to a little less of the overly long panning landscape shots and a little more action, and it works a treat. All the characters are characters you care about, the story is paced perfectly and the cinematography, though not as inspiring and bold as Hillcoats previous films, is still well above average. Tom Hardy gives a fantastic performance as the grunting, awkward mass bulk that is Forrest Bondurant. Guy Pearce plays the villain, and though it is a little over played, his overall performance is pure sleaze and lends its hand to the underlying humour throughout as well as providing a much needed hate figure (though Shia LeBoeufs character is easily disliked).\r A great film that, if you enjoy a high level of script, acting, direction and cinematography, is a must see."}, {"rating": "9", "text": "Highly underrated - very strong narrative, impressive mise en scène and (f)lawless (see what I did there) acting. The ending could be better, but \"Lawless\" remains a somewhat important movie in my opinion. The quartet's (Hardy, LaBoeuf, Clarke and Pearce) acting alone should make you wanna see this, it's really a masterclass."}, {"rating": "8", "text": "John Hillcoat delivers another magnificent drama chock-full of thrilling action, brilliant imagery, and lasting performances from Tom Hardy, Guy Pearce, and - most surprisingly - Shia LaBeouf."}, {"rating": "3", "text": "An action that takes the levels of action way to high."}, {"rating": "6", "text": "Lawless isn't much of a standout film, as it trades most of its dramatic moments for period movie clichés, sex, and cinematic shortcuts until it finally reaches a standard, predictable ending. The one high point is the acting, and maybe even surprisingly better-than-average script."}, {"rating": "7", "text": "A really good movie with some great performances. Tom Hardy delivers like he always does."}, {"rating": "6", "text": "A very good story and authentic filming location. I gave the lower score of 6 because the director should have had more care in the control of analyzing his scenes for a professional portrayal. I can definitely see Tom Hardy nominated for best supporting actor, he was that good of a character actor  (think of Heath Ledger quality of acting and more of his Broke Back Mountain character minus the gay and you'll have the character Forrest in this film).  Guy Pierce once again shows he's maybe just a slight step up on acting skills than Van Damme (why do they keep recasting this guy?).  I could think of several B movie actors that would have done a better job than him.  Jason Clarke did very well and Dane Deehan did a really good job as the character Cricket, but Tom Hardy is the one that made this film shine.  SPOILER:  My biggest qualm is the scenes where Jack is beaten REALLY badly by Charlie Rakes.  Jack is thrown off the porch and lands on a hidden \"fall pad\" under the dirt and then Charlie follows after him stepping on the same pad; wow talk about amateur scene direction!  You can actually see the ground bounce twice of what looks like a buried mattress.  Then this scene is followed up with Jack sitting at the family station after he cleaned himself up and Forrest sees him. Jack looks almost no worse for wear and like he's been on the mend for 2 or more weeks.  Hello MAKEUP, your fired.  Story and acting (minus Guy) I give an 8. Directing I give a 5."}, {"rating": "9", "text": "An excellently cast and written movie that manages to be extremely brutal without coming across as over excessive with it's violence. It might not get all the facts right but it still provides an excellent look into the lives of these characters. It might even make you want to look further into the history of the events yourself. I really enjoyed Lawless and highly recommend watching it."}, {"rating": "6", "text": "Lawless"}, {"rating": "5", "text": "Such a disappointing movie and nothing even remotely close to what the previews made it out to be. For one, this might've been the slowest movie I've seen in years. And while the acting was great, the character development was not and the plot dragged and jumped throughout. Tom Hardy being a BA and Jessica Chastain just being in it were about the only good things in the movie. And after 2 dragging hours, the ending sucked to boot. I'm probably being overly harsh but I expected so much more."}, {"rating": "7", "text": "Lawless is a powerful film that showcases the acting talents of its cast. Shia delivers a wonderful performance as the foolish and proud but timid youngest brother, while Hardy excels as the grisly silent elder brother, but it is Guy Pearce who delivers the films stand out performance as the deranged Officer of the law with a quick wit and an even quicker bullet  a must watch!"}, {"rating": "5", "text": "The only thing this film was missing was Burt Reynolds who did a number of these Southern Fried drive in films that made him the number one box office star of the mid-70's: Deliverance, White Lightning, The Longest Yard, Gator and Smokey and the Bandit 1&2&3. Lawless is missing the snap of Roger Corman, Jonathan Demme, and Robert Aldrich. It could have lost 25 minutes and nothing would be missed. The great music is a savior and the use of landscape is coming from an Australian tradition brought to the states by Peter Weir. But it is still an import and has nothing of the feel of place that it tries to create."}, {"rating": "6", "text": "If you like the shoot-em-up genre, this one should keep your attention.  A decent cast is dragged down by another failed attempt to make a leading man out of Shia LeBeouf.  I simply do not understand how this actor gets some of the choice parts that seem to fall into his lap.  This is also a weak 6/10 in part due to some scenes that simply are beyond belief.  That aside, this is a fairly entertaining rental."}, {"rating": "6", "text": "Tom Hardy and Shia LaBeouf are invincible as bootlegging brothers Forrest and Jack Bondurant in John Hillcoat's Depression-era drama. Involving cinematography and an apt soundtrack ensure Hillcoat's vision of 1920s Virginia is both aesthetically and atmospherically gorgeous, whilst Nick Cave's adapted screenplay offers an entertaining catalogue of bloody brawls, fluttering romances and sprightly moments of comic relief. Raw, energetic and loaded with great performances, Hillcoat's period piece is a real blast."}, {"rating": "4", "text": "One would expect all these no doubt fantastic actors to select their projects with concise precision. Their craft is beyond imitation, and their portrayal of characters uniquely defined. It is in fact the dramatic deliverance in this piece that was particularly enjoyable.\rUnfortunately, the screenplay didn't keep up with this bargain. The characters followed a path that was cliché at best. There might have been a token surprise here and there, but, let's face it, we've seen this one before.\rI read in a review somewhere that this was a Bonnie and Clide for modern times...wow... Go have a look for yourselves.\rI can't chalk this up as a bad film, though. As I said, the acting was flawless enough to keep me interested, and the cinematography and music was perfectly orchestrated. Perhaps the screenwriters felt it was enough to stamp the \"based on a true story\" at the opening and just let it coast.\rIf you have the patience, wait for the last forty-five minutes of the film. This is when the thing actually becomes semi interesting. And, yes, it all ends as you predicted in the first ten minutes of the movie."}, {"rating": "5", "text": "Lawless was truly a mixed bag of beans. Taking place in prohibition period, this film boasts some fantastic performances from the cast, despite the fact that they were playing largely formulaic characters. My main problem with this movie is Nick Cave"}, {"rating": "7", "text": "Having seen The Road a while back and The Proposition prior to this I was expecting the equal amount of dramatic, incredibly tense scenes back to back I was expecting so much but it didn't quite fulfill my expectations. I felt ,compared to Hillcoat's last two films, this one to be a little watered down. I did enjoy this film though, the entire cast was great even Shia LaBeof. If he does more roles like this he will prove his acting talent. Tom Hardy is great as always, although his consistent grunting seemed a little silly. I would always like a little more Gary Oldman, he had the best performance in my opinion and he was only in it for three or four scenes. Guy Pearce is just so evil in this role he is the one that stood out from the entire main cast. What I found really annoying was the amount of times one particular character gets shot stabbed, and still lives. They make the idea of them being indestructible too over the top and ridiculously unrealistic, I felt as if the characters should have been dead the first time. I thought the ending was too cliche it could have ended in the same idea but done differently. Overall I did like the movie, I love these grim, gangster, prohibition-era type of movies. The environment looks great. It's worth a watch."}, {"rating": "5", "text": "Un regista australiano emergente, un cast di tutto rispetto, una storia di moonshiners (i distillatori clandestini di whiskey durante il Proibizionismo) ambientata in un"}, {"rating": "6", "text": "\"Lawless\" is well done, has excellent all around performances and is a fine addition to the genre. It's worth checking out, but be forewarned, you've seen this all before. The film boasts a stellar cast, but it fails to elevate the film to it's potential under the direction of Australian director John Hillcoat (The Proposition). The film does however offer beautiful technical aspects and production values--the costumes, production sets, and yes, the vehicles are first rate.\r\"Lawless\" (adapted from the book \"The Wettest County in the World\"), in which real-life bootlegging brothers the Bondurants are known as the toughest and most successful bootleggers in the business. Oldest brother Forrest (Tom Hardy) runs the family business with quiet brute strength, while his brother Howard (Jason Clarke) is the \"crazy one,\" and then there is the runt of the litter, young Jack (Shia LaBeouf), who doesn't take to violence like his older brothers, but he still wants into the family business. The lucrative business turns bloody, however, when the Bondurants refuse to allow a corrupt politician and his cronies to wedge themselves in to their racket. This leads to a violent stand-off between the county's bootleggers and the corrupt police, lead by Chicago-based federal agent Special Deputy Rakes (Guy Pearce), and it quickly becomes personal, violent, and fueled by revenge. Rounding out the cast is ex-dancer Maggie (Jessica Chastain), who moves to the countryside to escape the violent ways of the city of Chicago, only to find herself surrounded by similar violence.\rThe storyline feels run-of-mill despite being based on real people and real events. There really aren't any moments of surprise and shock, as everything unfolds pretty much as expected, all the way up to the very end. So while entertaining and kind of memorable, it's also something that doesn't really rise up it's own trappings and contrivances. Impressive cinematography with outstanding production values don't make up for the fact that their are no real insights into the characters of the \"true story\"--just leaving us with endless carnage. The final showdown and conclusion is less than satisfying and wraps itself up a little to neatly. It's a respectable film and well-made, but hovers just above mediocrity."}, {"rating": "8", "text": "I am always interested in watching movies made from true stories. This one is about the Bondurant Brothers who survived World War 1, Spanish Flu....& selling Moonshine. Probably the best stellar show by Tom Hardy as far his performance is considered after \"Warrior\". Even though LaBeouf was the main lead in the movie, his character was over shadowed by Tom. Never expected LaBeouf to do justice to the role, however he tried to give his best and it was average. The other character which will mesmerize you is 'Rakes'. Because Guy Pearce never disappoints as a baddie. Jason Clarke was decent as a supporting brother to Tom.\rIf you are expecting violence, guns blazing, drama & powerful performances, go for it. You will not be disappointed."}, {"rating": "6", "text": "If Atlantic City showed us the Broadway of prohibition violence, Lawless takes us through the back alleys in the world bootleggers and moonshiners. Tom Hardy stands tall as usual and the rest of the well put together cast bring a solid punch. If your looking for good ol country boys with nothing to lose and principle then your in the right town. Lawless pours you drink of violence and bad ass while not spilling a drop."}, {"rating": "9", "text": "Lawless may not entirely live up to the sum of all its celebrated parts but it succeeds in telling a riveting “true life” historical drama with plenty of entertaining and memorable characters coupled with smart filmmaking choices. A few core story beats aren’t fully realized and there are some awkward moments of truth and fiction balancing but, nevertheless, the movie delivers a brutal and exceptionally honest look at the Bondurant Boys and their fascinating (not to mention dangerous) bootlegging days."}, {"rating": "9", "text": "An all star cast makes this one of my favorite films of 2012.  Tom Hardy, Jessica Chastain, Guy Pearce, Jason Clarke, Dane Deehan, and even Shia LaBeouf give top notch performances.  Making Lawless a must see."}, {"rating": "7", "text": "Not a bad movie. But watching it after you hear it involves John Hillcoat, Nick Cave, Tom Hardy, Guy Pearce, Jessica Chastain and Gary Oldman, you can't help but be disappointed."}, {"rating": "8", "text": "So intense and interesting! For those of you who liked this movie, i recommend also \"Black Mass\"! I enjoyed it and probably will watch it again! Great acting and directing!"}, {"rating": "5", "text": "I had a lot of expectations on this movie. Let alone some very good actors, but the story and the era leaves loads of compelling stories to tell. Sadly Lawless transcended into clichés and sadly not just one but many which interupts an otherwise promising movie. Just when you started to get a feeling for the main characters it got spoiled. The biggest cliché of all is sadly Guy Pierce. Don't know whether I should blame the directing or the editing but his villain character feels so overacted that it is not even laughable. It's just bad.  Other great actors such as Gary Oldman hardly gets to make a lasting impact. All in all it makes Lawless a pretty mediocre film. Tom Hardy though makes a resounding performance and the film has very nice cinematography. But that does not save a film that could have been so much better."}, {"rating": "3", "text": "If it weren't for the wonderful cinematography and brilliant acting from Guy Pearce this movie would be a complete flop. Bootlegging prohibition movies usually excite me, but the plot in this movie has no meaningful plot whatsoever, it's completely pointless, which does not warrant the excessive brutal gore violence included in this movie. It makes me sick thinking about the brutality that is so unwarranted in this movie. One of the worst movies I've seen in awhile."}], "recommendations": ["true_grit", "black_mass", "legend", "casino", "daredevil", "american_hustle", "gangster_squad", "widows", "the_untouchables", "backdraft", "hell_or_high_water", "body_of_lies", "american_gangster", "the_nice_guys", "inside_man", "street_kings", "all_the_money_in_the_world", "the_town", "blood_ties", "trouble_with_the_curve", "triple_9", "rush", "homefront", "the_paperboy", "the_italian_job"]}