{
  "id": 1382,
  "title": "Leap Year",
  "starring": [
    "Amy Adams",
    "Matthew Goode"
  ],
  "runtime": 100,
  "genre": [
    "Romance",
    "Comedy"
  ],
  "description": "When yet another anniversary passes without a marriage proposal from her boyfriend, Anna decides to take action. Aware of a Celtic tradition that allows women to pop the question on Feb. 29, she plans to follow her lover to Dublin and ask him to marry her. Fate has other plans, however, and Anna winds up on the other side of the Emerald Isle with handsome, but surly, Declan -- an Irishman who may just lead Anna down the road to true love.",
  "releaseYear": "2010",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/i86hMi5iEF3WnYLCaGHdT5FPdYg.jpg",
  "categories": {
    "plot": 5.142857142857143,
    "acting": 5.8,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 8.0,
    "funny": 7.333333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "You know what Leap Year is another generic entry into the romantic comedy genre and you know what I must confess that I enjoyed it. As we all know about in romantic comedies is that woman are very successful and they are hungry to get married and finding the right one. As well as trying to desperately doing some antics to achieve that goal. Leap Year follows that routine and you might be wondering why I haven't thrown it away yet. It's that damn Amy Adams she makes everything watch able. She can make a turd look good. Go ahead and photograph her with a turd next to it. I swear you'll say \"Oh that turd isn't that bad.\" The film opens up that Anna (Adams) is in a relationship with Jeremy (Adam Scott) who hasn't asked her to get married yet. Anna feeling disappointed abandons all hopes, but her father tells her about an old Irish tradition that once every leap year the woman proposes to the man. Of courses pack up the suitcases and get yourself into funny situations and you got yourself a movie. Then he meet the rough all around the edges-but charming-a#$hole Irish guy. I think I don't have to explain the plot anymore you kind of got the idea of where it's going.  The movie succeeds because of Adams and there's not much chemistry between Matthew Goode and her. It's a rehash of every other romantic comedy out there but it was funny, it wasn't offensive either. An other thing I liked was that the guy was just a plain looking guy not dreamboats, which they usually cast. Finally the girl chases after the guy at least it's something different.  It's tolerable if your girl wants to see it."
    },
    {
      "rating": "4",
      "text": "Although predictable and a little dry, it does display Ireland's beautiful countryside and Adams and Goode are charming in their roles but deserve better."
    },
    {
      "rating": "7",
      "text": "This movie's premise has holes large enough to push an Irish pub through, but there are three elements that make it worthwhile: 1) Matthew Goode never overplays the part he's been dealt 2) The cliffs and countryside of Ireland make for magnificent viewing, and 3) Amy Adams' spirit has enough fizz to energize this tired chick flick and  render it quite enjoyable."
    },
    {
      "rating": "4",
      "text": "While I'm okay with this film and Amy Adams is my favorite actress, I must admit that this is not one of her best films. It's okay at best, typical rom-com."
    },
    {
      "rating": "9",
      "text": "Amy Adams is great as the hilarious 'con artist' Anna! She really made the movie lively and fun.  Slightly clichéd here and there, but with a striking message and the gorgeous backdrop of Ireland.  A very well-done romantic comedy!"
    },
    {
      "rating": "4",
      "text": "Just to stay off the red zone, ill give this movie a four...The reason? The amazing view Irland has to offer..Has to the movie, more of the same, equal to all out there, predictable as it came out"
    },
    {
      "rating": "6",
      "text": "Just saw Leap Year. While it was pretty predictable, I love Amy Adams and Matthew Goode was a fresh face. Now I want to visit Ireland!"
    },
    {
      "rating": "8",
      "text": "A solid romantic comedy with good actors and great scenery. If you are a fan of romantic comedies you will like this movie. Amy Adams and Matthew Goode have great chemistry and really sell the rather lame script. Once again, the critics are way off base. I always skip what the \"professionals\" think of any movie and read user reviews. I would give this movie a solid B+."
    },
    {
      "rating": "7",
      "text": "I enjoyed it much more than I expected I would. Of course, it's a bit formulaic but it is still an entertaining romantic comedy, and the performances of the leads really elevate the material. I'd like to see more of Matthew Goode. (You may remember him from Woody Allen's \"Match Point.\") If you like Ireland and romantic comedies, then this one is worth seeing."
    },
    {
      "rating": "5",
      "text": "Boy gets girl, it's the rule of thumb in romantic comedy, which is why Marc Webb's \"(500) Days of Summer\" stands out: boy doesn't get girl, and boy, did this genre abberation hurt so good. Hollywood should take note of this absolutely winning indie, and consider incorporating the unhappy ending, every so often, to help revive this ailing genre, made moribund by its utter predictability. Far from being the nadir of the bunch(that honor goes to \"The Ugly Truth\"), the worst label you could slap on \"Leap Year\" is that it's \"bland\". As Anna(Amy Adams) and Declan(Matthew Goode) go through the motions of courtship in the same dramatic setting(Ireland) that Hillary Swank and Gerard Butler managed in \"P.S. I Love You\", the moviegoer may wonder: \"Haven't I seen 500, or at least, 55 versions of this same film?\" Conditioned by countless rom-coms where the inevitable uniting of star-crossed lovers send droves of moviegoers home, theoretically, happy; for the jaded, those obstacles which delay the simultaneous epiphany of love among lovers just before that clinching kiss, doesn't necessarily build drama, it builds tedium. To make a routine rom-com like \"Leap Year\" watchable again, some degree of doubt has to encroach on the moviegoer's expectations, in regard to the major studio-sanctioned screenplay. Does boy always have to get girl? In \"(500) Days of Summer\", The Smiths fan's life turned back into \"There Is A Light That Never Goes Out\" after 500 days of \"You Make My Dreams\", because the screenwriter gives Summer(Zooey Deschanel) the freedom to be more than a girlfriend sentenced to impending matrimony; she gets to be the boy's antagonist. In \"Leap Year\", Declan blows it, but Anna gives him a second chance, since genre requirements dictate that she do so."
    },
    {
      "rating": "6",
      "text": "300 is a cinematic piece of artistry, focusing more on cinematography than story. Surprisingly, it works very well. The basic story line serves as the spine of the film; merely there to support the glorified action. It's this visceral beauty that makes it watchable, more so than a film that focuses on the fundamental story. 300 applies to males; those of you who don't appreciate slaughter and gore will not find it appealing. It's a movie that you have to watch without criticising, because you will surely find a fallacy within its simplicity and emphasis on visuals."
    },
    {
      "rating": "6",
      "text": "Unlike most guys, I like a good romantic comedy and this is ALMOST a good one. What downgrades it for me are the the many \"sit-com\" moments (all by the Amy Adams character). On the plus side, Amy Adams and Matthew Goode are very good in this movie and have a good chemistry, and the movie is shot in the beautiful Ireland countryside. If only there weren't all those eye-rolling sitcom moments! Still, not horrible."
    },
    {
      "rating": "8",
      "text": "We just saw this movie today and it was a great romantic comedy. Sadly, the \"high brow\" movie reviewers who fawn over movies like \"Milk\" can't seem to fathom why the regular movie patron enjoys a movie like Leap Year. Certainly the basic Rom Com format is there but so what. The characters were great, the scenery was great and the story was entertaining. It was well worth my money for a day at the flicks. These \"experts\" really need to come down to the real world and get a grip on what the everyday person enjoys."
    },
    {
      "rating": "2",
      "text": "Really boring, what a waste of money, the only thing I enjoyed was the popcorn."
    },
    {
      "rating": "8",
      "text": "Critics must be very jaded not to like this movie. Amy Adams and Matthew Goode do a great job in their roles. Perfect romantic movie!!"
    },
    {
      "rating": "5",
      "text": "No big highs, no low lows, not very original, average acting without much chemistry between the principles. The photography in Ireland was gorgeous, so we didn't walk out."
    },
    {
      "rating": "1",
      "text": "My girlfriend made me see this with her, and it was awful. Extremely predictable, and just plain dumb. I'm tired of the movies with the two characters hate each other and within a few days are madly in love. STOP IT!!"
    },
    {
      "rating": "1",
      "text": "Think of the dumbest Jennifer Aniston \"romantic comedy\" you've seen. This one is dumber. What a waste of the lovely Amy Adams -- with unfunny slapstick, a senseless plot and no chemistry at all between the leads. I wasn't expecting much, but thought that a little Irish scenery might at least make it somewhat enjoyable. I was wrong."
    },
    {
      "rating": "9",
      "text": "Well in 'these difficult times' this is the kind of film you need to watch.No violence, bad language or gratuitous sex scenes meant to sell movies to men and boys.  This is a sweet, feel good movie with beautiful Ireland as the backdrop.  Oh and a really good musical score to boot. Dare to watch this and say you don't feel better."
    }
  ],
  "recommendations": [
    "friends_with_benefits",
    "10_things_i_hate_about_you",
    "27_dresses",
    "no_strings_attached",
    "the_proposal",
    "17_again",
    "50_first_dates",
    "the_break_up",
    "clueless",
    "just_go_with_it",
    "easy_a",
    "the_holiday",
    "sleeping_with_other_people",
    "just_like_heaven",
    "how_to_lose_a_guy_in_10_days",
    "last_vegas",
    "sisters",
    "zack_and_miri_make_a_porno",
    "no_reservations",
    "that_awkward_moment",
    "life_as_we_know_it",
    "forgetting_sarah_marshall",
    "blended",
    "hitch",
    "how_to_be_single"
  ]
}