{"id": 2533, "title": "Leatherface", "starring": ["Stephen Dorff", "Vanessa Grasse"], "runtime": 88, "genre": ["Horror", "Thriller", "Mystery"], "description": "A young nurse is kidnapped by a group of violent teens who escape from a mental hospital and take her on the road trip from hell. Pursued by an equally deranged lawman out for revenge, one of the teens is destined for tragedy and horrors that will destroy his mind, moulding him into a monster named Leatherface.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/nV7LPlyhUxKn5y0nuItCr8D1OSu.jpg", "categories": {"plot": 4.7368421052631575, "acting": 5.055555555555555, "ending": 4.25, "soundtrack": 5.0, "cinematography": 6.333333333333333, "familyFriendly": 3.0, "funny": 9.0, "action": 5.0}, "reviews": [{"rating": "2", "text": "A slight upgrade from the last film in the franchise still leaves it without a pulse. Why continue to make such terrible choices with this character? I get the idea that the character of Leather Face could be an interesting horror villain but nobody ever does anything interesting with him. This is just another wasted effort. D"}, {"rating": "5", "text": "It stars out semi interesting as we see a young Jedidiah Sawyer and his decrepitly twisted family trying to sway him into their evil ways. Then it takes the story in a completely opposite direction for about an hour with a whole different feel and initiative. This is where it runs into some dragged on problems of scattered plotting and pointless gratuitous violence without substantial connection to the overall story. There's a character named Bud that has an overwhelmingly distinct look to that of Leatherface with a heavy stature and messy brown hair and you're constantly thinking that will end up being the iconic character until they throw their massive attempt at a clever twist at you and kill him off only to have the very unsuspected Jackson character turn out to be the main character. This ridiculous move alone destroyed this film's potential. I get wanting to be clever and unsuspecting with the plot in this day and age of endless twists and turns, but it would've been so uttlery fitting to have had Bud turn out to be Leatherface. I don't think it would've made the overall mediocre story and pacing much better but it would've added a familiarity element to have that outcome. Maybe I'm just being biased but overall this origin story didn't amount to much other than some well shot cinematography and a few throwbacks to the franchise. I'd stick to the original, extremely underrated 2003 remake, and even the ok origin story to that \"the Beginning\"."}, {"rating": "6", "text": "The acting was average at best, the movie made no sense, it was quite unbelievable most of the times and most importantly, it didn't feel like a Texas Chainsaw Massacre movie. While the gore effects and the violence was well made and quite fun to watch, the movie was a little bit too uneven to be qualified a good movie."}, {"rating": "5", "text": "Interested in seeing this movie? Well then you must ask your self if you are willing to disregard everything you know about reality and human interaction. The plot, dialogue, and emotions of the actors make no sense in this movie. For example, early in the movie a character discovers the death of some one he loves deeply and responds by being sad for only a short few seconds and then immediately gets up with no tears at all and spouts a couple one liners at a bad guy. They even broke the laws of physics in one scene by having 3 full-sized adults (one of them being 400+lbs) hide inside the stomach of a dead cow to escape the cops. Not to mention the cops were only about 30-40 yards behind them when they found the cow and they had to completely hollow out the inside of it and figure out how to fit inside of it in a matter of minutes. These are just a small sample of the things that are wrong with this movie. So many parts of this movie had me staring blankly at the screen and just thinking \"Why was this not cut?\". For example, (this is the last one I am going to spoil for you) there is a scene near the beginning with an actor being badly dubbed over by a fake Matthew McConaughey voice. Who thought that was a good idea?! So to finish up there is a dumb twist near the end. I won't ruin it for you but lets just say that it makes no logical sense and it just rips apart any semblance of plot continuity that this movie had left. The only good things I can say about this movie is that the camera work was good and the gory kills were on point every time. I give this movie a 5/10. Summary: Not even copious amounts of gore and violence can save Leatherface (2017) from its bizarre disconnect with reality."}, {"rating": "1", "text": "It was gross! One of the worst movies l have ever seen! Too much violent sex, necrophilia, blood-splattered scenes.. l wanted to vomit! If it was a b-movie, like The Evil Dead, l would find it ok but that was just annoyingly disgusting. The only positive thing was the acting of these young actors, especially Madsen. It needs guts to screw with a dead body or take a blow job to a stinky, abnormal motherf***ker like Ike."}, {"rating": "2", "text": "This prequel was shot in Bulgaria, which is stupid. But that's not the dumbest thing.This film is a generic road trip film with crappy Bonnie and Clyde wannabes, an extremely stupid twist on who is Leatherface, and it's an unneeded prequel with a kind of complicated plot."}, {"rating": "2", "text": "\"Leatherface\" is complete **** It stains the name of Tobe Hooper's original classic. Blood, guts and body parts are flying everywhere, but it still didn't stop me from checking the time once in awhile, even with the Natural Born Killer rejects chewing up the scene time.I hated the characters as well. I know your suppose to, because they awful human beings, I get that. However, what's worse is when these dirty inbreds get what they deserve, the movie tries to make you feel bad for them with the deaths scenes coming off as sad moments. This feels a like a straight to DVD or a **** Netflix movie.Alright I'm done talking about this. My boredom and lack of interest questions why this exist in the first place. Please don't watch it. End of review."}, {"rating": "7", "text": "Το σκηνοθετικό δίδυμο Alexandre Bustillo και Julien Maury έχει την εμπειρία στο συγκεκριμένο είδος ταινιών ώστε να αναλάβει και να συνεχίσει το μύθο του δολοφόνου με το πριόνι, αλλά το αποτέλεσμα δεν τους δικαιώνει και τόσο..."}, {"rating": "7", "text": "A excepción de los últimos quince minutos de película, el título Leatherface sale sobrando, la historia de origen que quisieron darle al legendario personaje es bastante errática y dispersa en donde el susodicho es presentado como un chico desamparado que es alejado de su desquiciada familia y enviado a un hospital mental donde junto a su enfermera y otros chicos treinta mil veces más trastornados que el se fugan y comienza un recorrido que no los lleva a ningún lado y donde Cara de Cuero es mas un antihéroe que otra cosa, pese a todas esas inconsistencia, es un filme bastante decente y entretenido, mejor que la versión del 2013 y que las secuelas de 1986, 1990 y por poco mejor que la de 1994."}, {"rating": "5", "text": "While it is not unwatchable Leatherface fails to build enough suspense or tension to truly realize its horror potential. The filmmakers instead chose to glorify the gory kill fantasies and play sequences to a more thriller-action-esque rythmn. The screenplay is poor and the pacing is far too quick to allow any of the drama to take effect. A real missed opportunity to achieve anymore more than just cash in on the original TCSM"}, {"rating": "9", "text": "Photography was really good, just an excellent looking movie.  It was well lit, the audio mix is very well done, the performances are solid. The makeup was good, the cars were very nice and accurate.  Lilly Taylor has been an excellent actress for a long time, the first movie i saw her in was Dogfight (1991), an excellent romantic comedy with River Phoenix at his pinnacle-she stole the movie from him by the way.  I am not too crazy about unnecessary gore in a movie and this one didn't linger on gore too much. The original Texas Chainsaw Massacre is an excellent example of a movie with a reputation for gore while having very little actually present.  The Original TCM was extremely well made from an editing and camerawork perspective.  I bet the cinematographer for this movie could be hired pretty cheap.  The only thing lacking i would say, more psychology in use for some character development, otherwise this movie was very watchable."}, {"rating": "4", "text": "Leatherface unfortunately a complete disrespect to his own name or character, who ever wrote the story is a complete disrespect to this iconic character, he or she or they don't realise that this is a thing that should be wrote seriously and with the this result they simply don't, it's literally the worst, the weirdest, the stupidest, the most non-sense origin story of a not only a character but an iconic character, the Leatherface itself, all the perfomances including Lili Taylor which i think the biggest actress in the film, they all act like \"i'm cool and i'm scary because i kill a lot of people\", they're not, they're annoying especially James Bloor and Jessica Madsen character, they're simply one of the worst couple in movie i've ever seen, one of the few thing that i like is the look of the film throughout the film, despite having all of the horrible stuff the movie still look serious, and i think they're brave enough with the violence though i'm not completely a fan of the violence itself, i appreciate the bravery, but still overall Leatherface is what you get when the original creator didn't care anymore about his own creation, just sit back being the executive producer or whatever and give it all to a random people that really didn't have a heart of the character, this movie is just horrible."}, {"rating": "5", "text": "Like in the new sequel (Texas Chainsaw 3D (2013)) to the original (The Texas Chain Saw Massacre (1974)) this tries to make you feel sorry for the evil character Leatherface and empathise with him. I don’t like this. I preferred it when they were total psychopaths. My favourite film in this franchise is still the original sequel (The Texas Chainsaw Massacre 2 (1986)). This 2017 entry is really gory and quite gross but it is not as violent as other entries. The violence felt like it was for the audience and not for the story, it seemed forced. My biggest problem is that I feel the family acted so out of character, instead of mindless killing machines they come across as intelligent and calculating. I miss it when they were opportunistic psychopaths. Not the worst film but also not the best, I'm on the fence, not as entertaining as it should have been but had some originality and value."}, {"rating": "1", "text": "After a lot of horror slashers I believe we have definitely found the bottom."}, {"rating": "8", "text": "I'll **** on everyone who ****s on this Leatherface Movie this was one of the best Leatherface Movies"}], "recommendations": ["hellbound_hellraiser_ii", "army_of_the_dead", "the_possession_of_hannah_grace", "hostel_part_ii", "i_spit_on_your_grave_2", "the_last_house_on_the_left", "annabelle", "ghost_rider_spirit_of_vengeance", "the_curse_of_la_llorona", "final_destination_2", "chernobyl_diaries", "malignant", "scream_2", "sinister_2", "the_grudge_2", "crawl", "the_mist", "final_destination", "eli", "the_strangers_prey_at_night", "mirrors", "priest", "insidious_the_last_key", "death_note_relight_1_visions_of_a_god", "the_eye"]}