{"id": 4561, "title": "Leaving Las Vegas", "starring": ["Nicolas Cage", "Elisabeth Shue"], "runtime": 111, "genre": ["Drama", "Romance"], "description": "Ben Sanderson, an alcoholic Hollywood screenwriter who lost everything because of his drinking, arrives in Las Vegas to drink himself to death. There, he meets and forms an uneasy friendship and non-interference pact with prostitute Sera.", "releaseYear": "1995", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/nqc2LaUWB4ePf6IqpJ6D8apBDvn.jpg", "categories": {"plot": 7.666666666666667, "acting": 7.611111111111111, "ending": 9.0, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 3.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "This movie cannot be taken at face value otherwise you will entirely miss the point. This move DOES have phenomenal philosophical value and depth. I can see how watching this movie without any guidance will lead you to believe it is possibly the most terrible movie ever made but I was asked to watch this for a Philosophy course called The Meaning of Life and looking at the film through that lens made all the difference. Watch this movie, pretend to be super philosophical and deep, and see what you can get out of it."}, {"rating": "9", "text": "The book was by John O Brien, who wrote it then killed himself, always a badge of honor.  in the Nicolas Cage marathon, his oscar winning performance.  Probably the closest to himself, desperate for attention.  Elizabeth Shue gave the best performance i have seen of her.  Watching it today, she owns the movie.  Her character has more range and depth than Cage's.  I like the hopelessness of it, there is sincerity in hopelessness."}, {"rating": "10", "text": "It's deep, surreal, and offers a kind of operatic ecstasy that is both wonderful and heartbreaking at the same time. Nicholas Cage and Elisabeth Shue also deliver flawless performances."}, {"rating": "9", "text": "Self-indulgently tragic, the one thing that elevates Leaving Las Vegas are the signs that it understands the neurosis behind its romantic vision. \"You can never ask me to stop drinking,\" the drunk tells the whore as they proclaim that they love that they won't try to change each other; early on she buys him a flask for a gift and he laughs, \"you understand me\"; later on she pleads for him to move in with her, let her take care of him, because she does want to save him after all. After all, she came to Las Vegas hanging off of a man who mistreated her and now her loneliness brings her here. And the drunk, with a self-sabotaging nature that brought him here, brings that same nature to the final act. It is indulgent tragedy and Greek tragedy in one. It's heady. It works."}, {"rating": "10", "text": "L'histoire d'un poivrot qui veut se suicider à l'alcool et qui se bourre donc la gueule à en crever à Las Vegas en compagnie d'une pute esseulée... Lui ne veut pas arrêter de picoler, elle ne veut point cesser de faire le tapin : c'est là tout le drame de cette idylle naissante, de cette Bouteille Story, entre deux êtres qui auraient pu être heureux ensemble s'ils étaient restés \"normaux\" mais qui ne se seraient jamais rencontrés s'ils n'étaient pas déjà tous les deux des épaves...Nicolas Cage est impérial, la musique jazz est superbe, Elisabeth Shue est radieuse de maturité, la photographie est belle et l'ambiance est extraordinaire : ce n'est donc pas le chiantissime Mort à Venise mais le formidable Glou-glou à Vegas, ville aussi brillante que décadente, où tout n'est qu'illusion et désenchantement..."}, {"rating": "3", "text": "Dreadfully-written story with one-note characters who aren't performed well. The script is written as a romantic drama but feels like a dark comedy. As far as unintentionally funny Nicolas Cage performances go, this one is pretty decent. Don't expect a nuanced portrayal of alcoholism here, it's just belligerent behavior that would be best suited for a comedy.All of the hype comes from the director using 16mm film which gave it an arthouse look at a time when that wasn't commonplace. This movie has nothing else going for it. The moments without Cage are vapid, boring, and/or unnecessarily depressing. Overall, I'd say this film is what The Room could've been with a bigger budget. It makes about as much sense and has just as much artistic merit."}, {"rating": "5", "text": "This is the first movie that has positive reviews and I give it a mixed review. I think the movie is well acted (Nicolas Cage nails it) but the rest of movie is entirely depressing, with no compelling characters or storytelling"}, {"rating": "8", "text": "Nicolas Cage is rocking himself in Las Vegas in Leaving Las Vegas. With it, it shows how much Nicolas Cage can enter his great side in movies and shows how much he's willing to leave that place forever."}, {"rating": "10", "text": "This is a pretty dark movie, of course, it offers an insight into alcoholism and the way that such people can view things.As the movies goes on, it becomes clear that both Ben and Sera have their own issues, obviously and their own reasons to stay with each other.Ben is an interesting character, its true that at times you can see his misery from his drunken state, while at other points he appears very happy, almost euphoric in a temporary 'out of this world' kind of drunken state and as the movie goes on, things intensify and Bens desperation increases.I would have to say that Nic Cages portrayal of this character is very good, it seemed very believable, the disaffected look he gives being pretty convincing, im not overly surprised that he won an Oscar for this role.The music played also helps set the scene, there are quite a few mainly old jazz type songs used, with lyrics that relate to the story in at least one instance (\"Angel Eyes\" by Sting, I believe that was).In some respects, it is fairly disturbing viewing, how he goes from having what appears to be violent shaking attacks (some sign/form of alcoholic overdose? I wouldn't really know!), to being a pretty presentable man, with fewer signs of problems.In the end, though, both of the characters' problems are shown in pretty unflinching ways, for what they are. Sera's desperation, in her loneliness, to stay with and help Ben and Ben, with little left in his life, except his dependency on drink to keep him in a constant state of drunkenness, in a vicious cycle of discontentment.It certainly makes you think, what your choices and path in life may lead to, I suppose.This is a haunting tale of two people who feel they have little to themselves, I suppose. The performances are very good and it may make you more aware of the desperation such people have (alcoholics and prostitutes), as well as how fragile such people can be inside.The story is quite interesting and the soundtrack adds to the fairly haunting atmosphere of it.For an 18 rated movie, it wasn't as explicit as I thought it may be, just be prepared for strong language and sex scenes/references mainly, though I did watch this taped from TV, so it may have been edited,though it was shown late at night, I can't say for sure.An interesting and sad movie, that is worth watching. Recommended."}, {"rating": "9", "text": "Es abrasadora y desoladora  especialmente entre más se adentra en su desarrollo llegando a estándares de plenitud, sin duda, un drama realista que derrama bellas gotas de cariño mientras se camina por el borde del abismo."}, {"rating": "9", "text": "Cage was amazing, yes he is weird and sometimes cringy but he was an alcoholic, he was drunk, and if his performance is bad i wouldn't get pretty emotional at his character, Leaving Las Vegas was personal, what i really like the most is that the movie completely focus on the couples, the girl have worked with her boss in the beginning and it could be a story and a problem but they just leave that fastly, the struggle that they show in the movie is so real that somehow you will care so much to a hooker and an alcoholic, the movie is pretty slow paced but it feels fast because the characterisation is done so well by Cage and Elisabeth Shue, overall, Leaving Las Vegas is amazing."}, {"rating": "9", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"}, {"rating": "8", "text": "Cage's performance is mesmerizing. This movie will resonate with anyone who has struggled with alcoholism. It can be a downer but the film--and Cage in particular--is so memorable that it's worth watching."}, {"rating": "10", "text": "Won't say it's the finest movie ever made, but it's my favorite ever. This film haunts me days after I watch it. Elisabeth Shue's tragic beauty is almost too much to bear. If you've ever loved and lost you understand what I mean.... This is Nicolas Cage's best performance, it's clear he knows his way around the bottle. Depressing, yes, ultimately uplifting...no. Just a small window into the lives of two hurt souls who finally find a lover and friend, even if they both know it's much too late...awesome."}, {"rating": "10", "text": "I've seen this movie probably 30 times.The acting by cage is really unbelievable.Who ever doesn't like this movie never really paid attention to the amazing story and acting.A work of art."}, {"rating": "7", "text": "Dark, depressing, and extremely raw, Leaving Las Vegas is an exquisitely made film that showcases Nicolas Cage and Elisabeth Shue in one of the best roles of their careers. Featuring two very troubled individuals who fall in love, Leaving Las Vegas is one that certainly hits you hard and really makes you feel attached and feel a lot of empathy for the characters. Though these people may not be the best human beings ever (in particular Cage's character), you get a sense that there is more to both of them and that they absolutely need one another. A very interesting character study and an interesting look at the seedier parts of Las Vegas, this one does have its negatives. Namely the fact that it can drag a bit. While riveting and a very interesting example of how a film just needs characters, not necessarily a plot to make it successful, this one does slow down at times, which is what made me not enjoy it as much as others. However, overall, it stands tall as a great example of two people on the downslide of life who find each other."}, {"rating": "10", "text": "Great character movie with a top actor in a perfect performance. Elisabeth Shue was also great. Also they fit together well, so it is a pleasure to see them. The story doesnt explain everything, but you dont need to know everything because the relationship is the focus of the movie."}, {"rating": "9", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;"}], "recommendations": ["blue_valentine", "revolutionary_road", "manchester_by_the_sea", "marriage_story", "the_descendants", "hustlers", "scent_of_a_woman", "me_before_you", "up_in_the_air", "her", "the_intern", "collateral_beauty", "meet_joe_black", "uncut_gems", "closer", "silver_linings_playbook", "the_rover", "midnight_sun", "the_fault_in_our_stars", "the_spectacular_now", "the_florida_project", "the_king_of_staten_island", "chef", "black_snake_moan", "the_place_beyond_the_pines"]}