{
  "id": 2004,
  "title": "Legally Blonde",
  "starring": [
    "Reese Witherspoon",
    "Luke Wilson"
  ],
  "runtime": 96,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Elle Woods, a fashionable sorority queen, is dumped by her boyfriend. She decides to follow him to law school, but while there, she figures out that there is more to herself than just looks.",
  "releaseYear": "2001",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4ABNnmkVpzplrEVQWt1piITT0Ey.jpg",
  "categories": {
    "plot": 5.333333333333333,
    "acting": 6.5,
    "ending": 5.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 5.9,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Legally Blonde is a sweet movie with a soft center and a likable protagonist. Reese Witherspoon is perfect as Elle Woods, the naïve, determined gal who wants to prove she can do what she sets her mind to."
    },
    {
      "rating": "5",
      "text": "Far away from interesting and funny, but you could say at least it was motivational."
    },
    {
      "rating": "1",
      "text": "Forgettable."
    },
    {
      "rating": "6",
      "text": "Don't ignore the laughability of Legally Blonde. This is not just a cutesy chick flick that it helps to mock. It's a film about woman and a strong one at that. Reese Witherspoon gives us quite the showcase too."
    },
    {
      "rating": "4",
      "text": "Legally Blonde is simply forgettable.\rWith a concept of defying stereotypes, Legally Blonde succeeds to have moments of laughter but overall, out runs its very small window of opportunity."
    },
    {
      "rating": "10",
      "text": "Un clásico de los 2000 y en lo personal forma parte de mi infancia, tiene un potente mensaje sobre la autosuperación y creer en uno mismo mientras juega de manera muy acertada con la guerra de sexos o como quieran llamarle, hay machismo y feminismo a partes iguales, pero nunca tocando los extremos."
    },
    {
      "rating": "8",
      "text": "Much better than you'd expect. A great time."
    },
    {
      "rating": "10",
      "text": "This is one of the smartest, funniest comedies I have ever seen. Reese Witherspoon was absolutely hilarious. Even as a straight male, I found myself wanting to kill Victor Garber's character near the end. This movie rocked."
    },
    {
      "rating": "10",
      "text": "I love this movie. It's a great feel good about yourself film."
    },
    {
      "rating": "10",
      "text": "Awesome movie, blew my mind away."
    },
    {
      "rating": "3",
      "text": "Any early potential this film has as a comedy gets drowned out quickly by the self-indulgent, preachy whine of \"See? Girls can do smart stuff too!\""
    },
    {
      "rating": "8",
      "text": "Legally Blonde might look stupid but it isn't a stupid movie. Reese gives a hilarious performance and there many laughs thoughout. It was much better than i expected."
    },
    {
      "rating": "9",
      "text": "Wonderfully entertaining. Even though it was unbelievably unrealistic, that is what just made it great. It is just fun to watch and puts you in a good mood. Decent performances all around."
    },
    {
      "rating": "7",
      "text": "This is one of those movies that I absolutely hate to admit that I find funny. It has several absolutely hilarious moments. Sure the main character makes you facepalm almost every time she speaks and the story is completely and utterly ridiculous, but that's part of the movie's charm. It is stupid, it isn't the perfect film but if you want a good laugh (and many of them) and aren't looking to watch Oscar gold this is the movie for you!"
    },
    {
      "rating": "4",
      "text": "This movie is dull. I am a 16 year old girl, and I actually love chick flicks (it is a guilty pleasure of mine) I knew going in it was going to bad mediocre at best. If you're bored, this is the movie for you. It's not horrible, but it is forgotten after a viewer has watched it. The script: Eh. Acting: Nothing special. Effects; None. Story: Predictable. Diagnosis: Expect a cute movie that does inspire a greater respect, but ultimately, a film we could do without."
    },
    {
      "rating": "6",
      "text": "The script was good, but it could've been even better. This had potential to be one of those subtle, intelligent social comedies that really sneaks up on you. It isn't that, but it's a good time nevertheless."
    },
    {
      "rating": "10",
      "text": "I love this movie. It is a perfectly comedic chick flick that Reese Witherspoon has put her stamp all over. She is perfect in her role as Elle Woods and I couldn't imagine anyone else taking that part. It is very light hearted and the script is really funny. It is one of my all-time favourite movies. Plus it shows everyone that us blondes aren't always as stupid as everyone thinks! \"Whoever said orange was the new pink, was seriously disturbed!\""
    },
    {
      "rating": "10",
      "text": "This is such an adorable movie!  It makes every girl remember why pink was thier favorite color in elementary school.  Elle Woods is a great role model, she takes in the best and worst moments of life with a cheerful laugh. I wish my dorm room would look like hers :).  I am so excited to see the sequel!"
    },
    {
      "rating": "8",
      "text": "I remember when first seeing this I loved it but didn't think it would be a hit. Boy was I wrong. Watching it now it still holds up perfectly. Reese Witherspoon (Cruel Intentions) is still so charming as Elle a  bubbly fashionista whose marital dreams are crushed when her secy but smarmy boyfriend breaks up with her Played by a hunky Matthew Davis (Blue Crush). So she decides to follow him to Harvard Law and unlocks her real potential while working on a case with a super charismatic Ali Larter (Final Destination) and Linda Fiorentino (Curse of La Llorona). Selma Blair (Cruel Intentions) also stars as the perfectly **** Vivienne. The movie is fun, smart and just happy.Budget: $18mDomestic Box Office: $97mWorldwide Box Office: $1424.25/5"
    },
    {
      "rating": "4",
      "text": "Legally Blonde is a mixed bag. To start off, this movie is really funny. A lot of the jokes, especially in the first half land pretty well. Reese Witherspoon as Elle Woods is also great, she's funny but also gives a somewhat nuanced performance, which is impressive considering the material she was given. The concept is also rather creative and overall a strong idea. And that's about as far as my affections for this movie goes. The plot is generic and every story beat you see coming ten miles away, which isn't a horrible thing, I could still enjoy it with this being the case. But what really sinks this movie is the awful writing. Every character is what the writers need them to be for their next generic cliché plot point, characters flip flop for apparently no reason throughout the film. And the dialogue is mostly painfully horrible. All of these problems are exacerbated in the demonstrably bad second half of the movie. If it wasn't for the second half of this film I probably would have given it a positive review, but the jokes almost immediately stops being funny, and all sense of stakes in the story are lost. Elle's character is meant to grow, but at no point does it seem like she really understands anything she's learning, and proves herself to be a bad lawyer, and even when she does learn something, it's a montage. A montage. Of course. Because the only way to convey growth is a montage. But the worst part of this final act is the contrivances. Stupid things are everywhere, and they're not funny enough to be jokes, at least good ones, so they're just frustratingly stupid. Although I did enjoy the Blair Witch Project reference."
    },
    {
      "rating": "6",
      "text": "Legally blonde had us rooting for the main character. The first ten minutes encompassed the central theme: subversion of stereotypes. This primed the audience for the final conflict resoltion.While love was the initial motivator, Elle recognised the way her peers viewed her which led to unfair circumstances and events.After earning the confidence of her peers, she managed to prove herself in court, earn the just verdict her client deserved, and found true love. While minor details were not fully explored, such as her rocky relationship with Vivian, the overall plot summarised above flows beautifully for the initial viewing.After the second watch, I found myself wanting the movie to have more in-depth in character relationship.Finally, the conflict resolution was great. It's worth rewatching for the fun of it."
    },
    {
      "rating": "6",
      "text": "----------------------------------6.0/10-----------------------------------"
    },
    {
      "rating": "1",
      "text": "i aht ethe blonde people ion the movie very ugly  dig bucj teeth ugly french hat my grandmother is better directory"
    }
  ]
}