{
  "id": 4893,
  "title": "Legend",
  "starring": [
    "Tom Hardy",
    "Emily Browning"
  ],
  "runtime": 132,
  "genre": [
    "Crime",
    "Thriller"
  ],
  "description": "Suave, charming and volatile, Reggie Kray and his unstable twin brother Ronnie start to leave their mark on the London underworld in the 1960s. Using violence to get what they want, the siblings orchestrate robberies and murders while running nightclubs and protection rackets. With police Detective Leonard \"Nipper\" Read hot on their heels, the brothers continue their rapid rise to power and achieve tabloid notoriety.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4shf5Alq4KWCKqrAAQe0JGJHYp5.jpg",
  "categories": {
    "plot": 5.84375,
    "acting": 6.590909090909091,
    "ending": 3.5,
    "soundtrack": 8.333333333333334,
    "cinematography": 8.2,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Tom Hardy is on point, the comedy is on point, the acting from everyone in this film is on **** point. The violence is on point as well. I sat with people talking behind me and I was still sucked into this movie. Simply, a revelation in film-making. I adore this movie to **** even with a thorough running time."
    },
    {
      "rating": "9",
      "text": "Well the results are in and we're voting YES!  It's too bad the \"professional\" critics have been crapping the bed so bad lately.  This is just another example.  Tom Hardy x 2, can't go wrong.  The subject matter doesn't hurt either :)"
    },
    {
      "rating": "7",
      "text": "Tom Hardy is an absolute powerhouse in Legend and definitely shows an Oscar worthy role. But the film is not without its flaws.\rThe film for the most part more just seems like a continuous amalgamation of instances for Hardy to show off his chops and to focus on him and him only rather than giving an insight into the actual Kray twins. The film doesn’t fully go into any real depth about what they were doing around that time and how they got away with so much, it is more just little mentions here and there as to what is happening and then back to Hardy being a badass in two roles at once. The film felt more like a chronicle of Tom Hardy rather than Kray twins.\rDoes this make the film bad though? NOT AT ALL. The film is fantastic to watch and Tom Hardy alone (and again) makes the viewing captivating, showing he is one of the greatest actors around right now. The realisation that he has chemistry with himself on screen where other actors in other films struggle to have any chemistry at all is truly jaw dropping. You can almost believe you are watching two different actors.\rHardy plays Reggie with such charisma and charm that you can’t help but be encapsulated by him as a person and watch him unfold on screen whereas Hardy playing Ronald is a whole other level. Volatile and explosive, with no clue of what is going on and an outrageous sense of unintentional humour you can’t help but love (and fear) Ronald.\rAnd that is the other thing that makes Legend great. The dark humour is so lovingly layered throughout the film that you find yourself laughing non-stop at some scenes. This, added in with some great symbolism, great dialogue and superb direction (with some brilliant tracking shots) make for a brilliant Hardy piece.\rSo all in all, Legend shows an exceptional Tom Hardy at his best, but doesn’t offer enough material on The Krays as it should. Well worth the watch.\r6.5/10"
    },
    {
      "rating": "8",
      "text": "Solid movie and a very interesting biographical story.  Acting and cinematography are superb.  The music is barely there and if a few things scene-wise were changed a bit this movie would be one of the best ever."
    },
    {
      "rating": "9",
      "text": "[9/10]\rGood classic movie based on the true events. Nice screenplay, double role acting was very good. Good humor, action, drama, violence ,romance etc."
    },
    {
      "rating": "6",
      "text": "\"Legend\" was an almost interesting movie , but fully on the life of the Kray brothers, exciting, and surprising, Tom Hardy playing these two characters, so Tom Hardy was one of the actors in the new era, more complete they have been."
    },
    {
      "rating": "7",
      "text": "Proof that you can't have too much of Tom Hardy.\r It is true that glasses and change of hairdo can actually produce a different personality. This movie is mostly dedicated to Tom Hardy delivering his excellent, albeit slightly and funnily schizophrenic, acting prowess. As far as biopic goes, other films such as Black Mass delivers a more in depth-look of the mafia life style, but Legend opts for a direct personal view of the brothers and takes full advantage of the lead actor.\r Tom Hardy plays as both Ron and Reggie Kray, performed with a tweak of facial expression and mild change on make-up. Reggie is the more levelheaded one while Ron can be described as batcrap insane. They are both capable of violence and living a shared gangster life. The events are told by narration from Frances (Emily Browning), Reggie's love interest and a silent witness to the horrible dealings.\r The movie's strongest point is undoubtedly the lead, it is not often that this \"one actor two roles\" is used in cinema recently. Tom Hardy delivers everything expected from him, from the subtle or strong expression, change of speech and mannerism to intricate body language of different characters. Viewers know the twin scene is done by effect, yet they often look like two different persons interacting with each other.\r It dabbles in less criminal activities and more in private life, evident by using Frances a key point for developments even though she is mostly there as spectator, especially when mafia dealings are concerned. Emily Browning is a good addition, she handles her own well, but it's not the level of outlandish on-screen presence like the Krays.\r While there is a definite involvement of crime thriller aspect, it doesn't portray the shady indulgent in its entirety. It’s not the intricate inside view like that of American Heist. There are few violent scenes, although the movie is not a noir gritty musing and some of the events could be done more thoroughly.\r Tom Hardy has done some interesting roles, but none arguably had this level of complexity. Legend further cemented his acting signature on the silver screen, it may not be an in-depth take of criminal enterprise, but he alone, or two of him, is enough to carry the movie."
    },
    {
      "rating": "6",
      "text": "Tom Hardy is excellent as both the Kray Brothers in the mediocre film ‘Legend’.\r ‘Legend’ is mediocre because in the way the story is told. It is narrated by Frances Shea, the dead wife of Reginald ‘Reggie’ Kray. She committed suicide at the age of 24, too young to die but it’s a plot device that doesn’t quite work as she’s telling the story from beyond the grave.\r Tom Hardy does indeed play both Kray Brothers. He’s Reggie, confident, goodlooking, extreme extrovert, who always gets the girl. He’s also Ronald ‘Ronnie’ Kray, the not-so-goodlooking, introvert, schizophrenic brother, who was also gay. It’s Reggie who seems to hold all the cards and makes most of the most decisions for the brothers, and Hardy goes all out in playing both of these characters. When tough, he’s Reggie, when a bit soft, he’s Ronnie, and when he’s playing either one he’s excellent.\r ‘Legend’ is based on the book ‘The Profession of Violence: The Rise and Fall of the Kray Twins’ by John Pearson. The brothers sure did rise, ruling over East London during the 1960’s, ordering killings during the day and then going over to mum’s house for dinner the same evening. They also ran clubs and protection rackets.\r ‘Legend’ is a slick retelling of the brothers story. Written by Brian Helgeland (L.A. Confidential and Mystic River), the film primarily focuses on Reggie Kray’s relationship with Shea (played a bit overdramatically by Emily Browning), yet downplays any real relationship that Ronnie was involved in. Sure, he had male hangers-on who were presumably with him for his money and power (definitely not for his looks), but it’s all about Reggie and Shea. Their relationship was true love, and while Shea was very young when she started dating Reggie, at age 16, and then they got married when she was 22, and as played by Browning, not everything was right with her mind. Hardy is excellent as both brothers (Hardy has yet to give a bad performance, just this past year he was in ‘Mad Max: Fury Road’ and ‘Child 44’ and last year was his best performance to date, as the only character in the film ‘Locke,’ – it’s a must see). But it’s also a bit distracting watching him play both roles, especially when in scenes together. I kept on looking for irregularities, yet it was a bit obvious that doubles were used, especially in the fight scenes. Anyway, the brothers were imprisoned in 1969 for their long laundry list of murders, which is when their reign of terror ended. Legend was supposed to have been released on October 2 but the film studio felt that that weekend was ‘bulked up’ with too many guy pics; 20th Century Fox’s ‘The Martian’ and Sony’s Imax-fueled ‘The Walk’. So ‘Legend is now available on DVD."
    },
    {
      "rating": "5",
      "text": "Disappointing but not a disaster. Hardy is good, but we expected that. Girlfriend is boring and the whole shebang feels curiously inert. I'm noticing an odd trend, where period films of the 60s and 70s (e.g., Fargo, second season) portray the period as extremely distant. I happen to remember those periods so the extreme distancing seems dishonest. Anyway, Hardy kept me watching Legend but I was conscious of time elapsing too. It's hard to pinpoint why but the film never fully engaged."
    },
    {
      "rating": "5",
      "text": "I don't know, I don't consider this movie as great as most of others here did. Yes, I liked the premise, the way it shows gangster life, the trailer was good, Tom Brady was promising and did provide his acting chops at highest level as usual, but the whole story itself was quite boring - I wanted something more interesting or more comic, as it felt it might be a good comedic gangster movie. But really, this movie is quite forgetabble, I watched it 2 months ago and barely remember what happened in the middle, besides the bar fight and the ending. I think it could've been a lot better. Only thing I really did enjoy was Tom Hardy's performance"
    },
    {
      "rating": "6",
      "text": "While Tom Hardy is excellent playing double duty as two criminal twin brothers, I felt a little let down by Legend. The movie really doesn't deviate from the established \"gangster story.\" While this is not necessarily a bad thing, the film meanders and does not build or establish characters in any interesting way. This is a real shame, as Hardy gives a great performance. There is really nothing remarkable at all about Legend, other than Tom Hardy elevating the movie to slightly above average for me. It plays everything way too safe, which is unfortunately Legend's biggest flaw."
    },
    {
      "rating": "2",
      "text": "london in the 1960..LegendAt the end, it's all repetitive gangsta rap that we have encountered earlier too with some minor changes which quite frankly is pointless till then."
    },
    {
      "rating": "9",
      "text": "There are two very good reasons to see and appreciate ‘Legend’ and they are both Tom Hardy. His dual performances as the Kray twins is nothing short of sensational and he is magnetic in both roles. Aided by some seamless camera trickery he often appears as both brothers in the same frame. Unlike Director Peter Medak’s ‘The Krays’, which came out in the early 90’s, this film concentrates first and foremost on the brothers themselves rather than building the story around their mother Violet. Here this is well and truly Hardy’s show and Violet is relegated to a very minor role in the story. Even the fine supporting cast are generally over shadowed by Hardy’s tour de force performance although Emily Browning, as Ronnie Kray’s mentally unstable wife Frances, impresses by effectively communicating her character’s fragility via understatement. She also serves as the movie’s narrator.\rThe film looks great with outstanding production design depicting the East End of London during the 60’s. Many hits of the period pep up the soundtrack sharing musical duties with a surprisingly melodic original score. Only the sound seems a tad off in the early stages, but this probably has more to do with the cockney accents of its cast rather than bad mixing by the sound department. As if to confirm this, after about half an hour one’s ears begin to attune to the dialect being spouted. There in after one is able to totally surrender to the film’s vice like grip."
    },
    {
      "rating": "5",
      "text": "Great job by the cast, The movie is truly well acted and Tom Hardy does a wonderful job. That being said, It's one of the most shallow films I've seen. There's no depth to the plot, It's time jump after time jump. There never feels to be any real story or narrative to it and I think that's what stops it from being anything other than average."
    },
    {
      "rating": "6",
      "text": "Legend is carried solely by its cast. The writing and plot progressions have their moments, but after about half an hour I found the pacing of Legend to be a little too slow.  The life of the Kray brothers might have been worthy of recreation via film, but this result doesn't quite do the story justice.  It doesn't help that half of the dialogue is near-impossible to understand.  I had to put on subtitles to understand most of the movie.  I understand being true to source material, but that aspect really hurt the experience in my book."
    },
    {
      "rating": "6",
      "text": "Tom Hardy solidifies his sheer star power in Brian Helgeland's \"Legend,\" an entertaining, yet decidedly off-kilter portrait of London's most fearsome criminal duo."
    },
    {
      "rating": "8",
      "text": "It's hard to make the perfect crime film. After Goodfellas, The Departed and The Godfather Part II It's extremely hard to make a perfect mob movie. But legend did an exceptional job. It's not perfect but I can easily say that it's one of the better films in theaters right now. The acting was amazing! Tom Hardy did an amazing job getting into both of his roles as Ron and Reggie Kray. I haven't seen an actor fulfill both his roles so well and with both characters personality's being almost completely different. It's quite an achievement on Tom Hardy's part. Ron Kray's romance side plot felt like it was used only to fill up time. It could have been done better but I can't complain about it that much because it's a true story and I would probably criticize it more if it wasn't included in the movie but It just felt so forced and unneeded. This movie is very dialogue driven and there aren't explosions going on all the time but the dialogue is so captivating that you just get lost in the movie ear/eye candy. I say ear/eye because not only is the screenplay phenomenal but the cinematography even more so. You always feel like you are in 1960's London and never in present day. In the end, legend was pretty awesome. The Writing, chemistry, directing, cinematography and acting are spot on. Some parts did drag on and it was a bit longer then it should've been but besides that. Awesome! I'm giving this one an 8.5/10"
    },
    {
      "rating": "7",
      "text": "Tom Hardy and Tom Hardy star in this \"biopic\" crime, thriller depicting the story of the Kray twins. The opening narration pretty much sets up the kind of movie you're going to get here, absolutely laugh out loud funny for all the wrong reasons but entertaining nonetheless. Largely due to Hardy's performance who seems to cross the thin line between a menacing and intimidating presence to an over the top, cartoonish, bloody psychopath. Not trying to take away from his performance which is without a doubt the only reason anyone should watch this movie. Recommended."
    },
    {
      "rating": "8",
      "text": "It's an actually really well made biography.The cinematography was superb,the acting performances were on point and the movie was interesting and entertaining.Just don't see it while thinking it's an action movie, because, it's not."
    },
    {
      "rating": "3",
      "text": "Unfortunately, for all the bravado that Tom Hardy offers in the dual role of the Kray twins, all his hard work is undone by a mediocre script, terrible pacing, and not enough actual story to carry the running time of 132 minutes.\rAnd it's a real shame, as the director clearly understands how to portray the time, and places, in the East end of London in the mid-late 60s. What could have been a proper delve into the mindset of the two men just turns into a slow-paced, mini-crescendo offering, empty piece of cinema."
    },
    {
      "rating": "5",
      "text": "It’s a shame this movie wasn’t better. Tom Hardy’s dual performance was brilliant, and the film was not badly directed. Unfortunately, the script was a clunker – things happened, but there was no drama or suspense or building to anything much. Mom, who was a real force, was barely there at all. In real life, the Krays did “evolve” (for the worst, of course), but the incidents in this film went nowhere. So sadly I can’t recommend this film, unless you are a die hard Tom Hardy fan."
    },
    {
      "rating": "6",
      "text": "I thought Tom Hardy was really good in this. The movie portrays one of England's most notorious gangs the Kray twins. Although a good movie, i felt it could have gone a whole lot deeper in to their psyche. The makers of this movie should have watched Chopper a few times before filming."
    },
    {
      "rating": "4",
      "text": "I bet that you, like me, walked into the theatre expecting to see a gangster movie about the Kray twins only the film is not about them at all. Instead the central character is Frances and the entire story is told from her point of view. You don't get a picture of the criminal world just long love scenes between Reggie and Frances.\r To illustrate it there is a scene where Frances asks Reggie to leave the gangster world and he answers that it's not that simple. And I was sitting there asking - why? If the film had actually shown the Kray's criminal life I could have understood his reasons for saying that. But as it is Reggie and Ron remain a mystery, their stories are never really told.\r Also, and this seems to be a pet peeve of mine lately, the movie is over-narrated. It doesn't just stop at things that need to be explained for people to understand the story it is actively telling and not showing and expecting that to make up for the lacking plot.\r Around 2/3 of the way in I was getting bored with Legend as it didn't deliver in any way. Perhaps it doesn't deserve a score as low as 2/5, perhaps some people will enjoy it a bit more than I did, but what got me the most was that at the end the film actually had gall the to preach their \"morality\" at the viewer. That's what really got me the most.\r Overall the Legend is a mediocre film that's not really as good as the trailers make it out to be."
    },
    {
      "rating": "5",
      "text": "In Legend, Tom Hardy gives an admirably committed performance in a dual role, unfortunately, the movie he's in can't match the greatness of his performance."
    },
    {
      "rating": "7",
      "text": "Great scenes overall, acting is superb. Yet i should say pace is really slow at some points and i don't know if i'd recommend this movie to anyone for a mafia or drama lover, feels like movie falls short at both points."
    },
    {
      "rating": "5",
      "text": "I'm as big of a Tom Hardy fan as anyone but I couldn't help but be a little disappointed by Legend. Legend was one of the most anticipated movies of the Oscar season because it had Tom Hardy playing a set of twins and the performance really doesn't disappoint although it didn't pick up an nominations. Hardy completely carries Legend, its a film that is fairly dull, repetitive and overlong without his performance. Emily Browning is pretty strong as the love interest as well and Taron Edgeron from Kingsmen is in this film but he really doesn't have much of a role which was disappointing. Legend seems almost style over substance. The film looks really great but a film that relies so much on the twins storyline the twins really don't have that many good scenes together and their relationship is underdeveloped in favor of an on again off again love story. I can still recommend Legend if you are a Tom Hardy fan but outside of that there isn't much to be had here."
    },
    {
      "rating": "7",
      "text": "As a movie for movie fans goes, this more than works. However, how hard as you might try, you cannot get away from the hugely dominant fact that these two scumbags were neither charming nor misunderstood.Just Eastend muscle, whose legend has long outlived their liberty and long surpassed reality. That's the Kray's. Tom Hardy is as he is, born for these roles."
    },
    {
      "rating": "4",
      "text": "In a nutshell – very boring film, the story is very banal. The most dull character in the film is a Frances – her motivation is very foolish from the beginning till the fight scene."
    },
    {
      "rating": "5",
      "text": "The usual movie about gansters of the average level. The plot is simple and naive. Everything is executed at the average level, acting wishes the best. All movie is dragged on the shoulders by Tom Hardy. Also he does it perfectly. To win back two absolutely different persons on takoy level it is laudable."
    },
    {
      "rating": "8",
      "text": "Отличный криминальный фильм о двух братьев ганкстеров."
    },
    {
      "rating": "8",
      "text": "legend. History of one decade of London. Before watching the movie, I had never known or heard of the Kray brothers. But after that it became interesting, and I read a great article about their life. The film itself is shot perfectly, and Tom Hardy perfectly portrayed the characters of Ronnie and Reggie."
    },
    {
      "rating": "5",
      "text": "Frankly the history of the Kray twins is not so fascinating as to have been adapted, but ultimately Legend is not a bad movie,is just that the story and the script are not up to par. What rescues and becomes almost the only reason to see it, is the spectacular double performance of its star, Tom Hardy."
    },
    {
      "rating": "7",
      "text": "Based on the true story of the gangsters the Kray brothers the film should have been a perfect showcase for hunky Tom Hardys creative range and talent. Instead it's a half realized piece of Hollywood entertainment that never goes deep enough to be anything spectacular. Tracing the events of the rise of their criminal empire it also shows the abuse one of their wives endures. Props to the makers for keeping the gay element intact but for the most part it's kept off screen. Still for gangster movie fans especially it's a fun, engaging flick that's sadly forgettable. And as for Hardy, he's great but there's not such a huge difference  between the characters that it's as impressive as it could have been.Budget: $25MBox Office: $43M7/10"
    },
    {
      "rating": "6",
      "text": "The acting by Tom hardy playing both Ronald and Reggie Kray is superb. You can really see the different personalities that Hardy portrays in the 2 Kray twins. The story shows the rise and fall of the Krays but fell a bit short in terms of the depth it went into."
    },
    {
      "rating": "7",
      "text": "Tom Hardy gives a truly fantastic performance, portraying two twin characters. The film, however, does have some sloppy pacing and unnecessary scenes that seemed out of place."
    },
    {
      "rating": "8",
      "text": "Legend is a brilliant movie. The movie's got a very good plot, it's about these two identical twins who are called Reggie and Ronnie they're both played by (Tom Hardy).They both pretty much go through higher ranks of the criminal underworld, the reason being is so they'll both turn into London's scariest gangsters.Also, the acting from all the cast is actually brilliant, especially from Tom Hardy, Teddy (Taron Egerton) and Nipper Read (Christopher Eccleston) those three were honestly amazing.The movie's got some really strong dialogue from the main characters throughout this movie and it works very well.The action sequences throughout this movie are very graphic, gory and very clever and they're all honestly well done.Finally, the soundtrack which this movie's got is honestly amazing, it's got lots of brilliant songs from such artists as Martin Gaye, The Who, Booker T. & The M. G.'s and many more.Overall, Legend is honestly a brilliant movie. The movie's got a very good plot, brilliant acting, strong dialogue, some very graphic action sequences and an amazing soundtrack."
    },
    {
      "rating": "10",
      "text": "Фильм хороший есть и юмор и моменты где переживаешь за героев"
    }
  ]
}