{
  "id": 103,
  "title": "Legion",
  "starring": [
    "Paul Bettany",
    "Dennis Quaid"
  ],
  "runtime": 100,
  "genre": [
    "Horror",
    "Action",
    "Fantasy"
  ],
  "description": "When God loses faith in humankind, he sends his legion of angels to bring on the Apocalypse. Humanity's only hope for survival lies in a group of strangers trapped in an out-of-the-way, desert diner with the Archangel Michael.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ykocDqwg5PRUopnBVb1x1DWnEJF.jpg",
  "categories": {
    "plot": 3.225806451612903,
    "acting": 4.157894736842105,
    "ending": 2.2222222222222223,
    "soundtrack": 5.0,
    "cinematography": 0.5,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 5.076923076923077
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Something tells me I shouldn't like that movie. But I did. I found it entertaining, and Paul Bettany's character very good. Why God's angels cannot deal with machine gun fire, well, maybe he should have checked Earth out himself before sending down his executioners.\rGood fun !"
    },
    {
      "rating": "10",
      "text": "this film is not well-written, artful, or subtle, but it is completely ridiculous, and violent, and that's why i like it, sometimes, you just need to turn off your brain and enjoy something simple, this is it."
    },
    {
      "rating": "10",
      "text": "legion is incredibly entertaining, sure, it doesn't have much in the way of plot, character development, contemporary relevance, or incite into the universe, but as a crazy, simple supernatural shoot em up, it works absolutely fine - samarathenymph xoxo"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "2",
      "text": "The movie is indisputably terrible. From the story plot line to the performances, \"Legion\" is very messed up. That's all I can say for this cinematic mess. Nothing good."
    },
    {
      "rating": "4",
      "text": "I really want to say this I'm a geek for movies that has to do with sci-fi and horror and action, as well as the genre of fantasy. When a film gets released with these very good qualities, I'm your number one man at the movies ready to see it. So when I saw Legion's preview I was very giddy, but there's a problem. What I don't appreciate is that Hollywood thinks I'm a nerd and a geek so I'm going to watch a mediocre movie no matter what. Just because it has a glossy packaging doesn't mean it's good.  What's better to attract a sixteen year old boy to the movies? Oooo I know let's put a poster with the main character and lets have him have really big guns. Wait I have a better idea let's put angel wings behind him that should do the trick. Then the trailer will have cool explosions and really exciting one-liners. Damn this movie got me hooked I'm watching this. They pay $10.50 ticket, $21.00 if they have a date then another $20.00 for food; watching a bad movie not priceless. Well I'm 23 years old and I have seen my share of movies to uncover studios bulls@#t. Legion is a movie that tries to capture fan boys because of the cool images but the serving is really distasteful. It's another stupid attempt to make a franchise.  Legion's plot is a weird one with several holes in it but I'll get to that later. God has lost faith in mankind; he's basically tired of us. So in the bible he sent a flood like much of us has learned, so he decides to send mindless zombies who are possessed by angels. Yeah I said that I didn't stutter. You heard me say mindless zombies right because they're going to end up as target practice like we didn't know that was going to happen. So back to the plot, Michael who is an angel does not agree with God's descion. So he decides to come to earth and sacrifices his angel status and becomes human. You see I put \"angel status\" the movie never explains why he does that. He goes to diner full of misfits to protect a pregnant woman who bears the child to end the war. I have a number of questions on this, where is the father of the child no explanation and nobody bothers to ask. Why does God wants zombies to end the world, is he a big studio executive who wants to see action or God's a big George Romero fan wanted to use zombies.  I'm sorry but Legion being directed by a former special effects director I wasn't really convinced with the special effects. Now I know why George Romero and Danny Boyle can really make zombie movies there zombies transforms in the most disgusting and scariest ways. In Legion they transform like this. Their head shakes really rapidly like a bobble head and black contact lens and fake shark teeth. It looks pretty ridiculous. The acting, don't get me started on the acting Paul Bettany was the only shine of light in this movie and it's a pretty dark movie. Most of all the dialogue was dull as well. I do give credit where credits do. Gabriel and Michael in angel form looks pretty cool. Their action sequence was somewhat entertaining. There is good writing here as well the speech that Michael gives to Jeep and a very cool quote that Michael says in the end. \"You gave him what he wanted but I gave him what he needed\" That was pretty cool, as well as the grandma scene was pretty good too. That's four good things out of so many wrong things can't recommend this even to the low IQs."
    },
    {
      "rating": "7",
      "text": "Don't know why everyone is bagging on this movie. I enjoyed it. I don't need an Oscar worthy plot to be entertain. I guess this movie is too low brow for the critic snobs. But an FYI the mole on the leading lady's face was pretty distracting."
    },
    {
      "rating": "8",
      "text": "I thought it had a strong cast I thought Dennis Quaid was great in it, I didn't think I would like Paul Bettany as the leading star as the angel but I was wrong and liked him to. I didn't think this movie was to slow at all like most people do for some reason. It has a lot of action and a lot of horror all and all the only thing is I think the director could've found a better leading angel but all and all I enjoyed it as well he comes in and saves the baby while the other angel wanted it dead pretty easy to follow. It had the right amount of action and horror and I'm saying I liked it."
    },
    {
      "rating": "8",
      "text": "I agree of the well-cast lead of their roll in this movie, but we also learned the message that gives this movie, that humanity is coming to a point of losing their moral values, love to God and believing of God"
    },
    {
      "rating": "4",
      "text": "Not the greatest film ever then again what can anyone expect from a movie with Dennis Quaid in it... Oh and anybody who hasn't actually watched the movie, SASHA, should keep their useless opinions about the movie to themselves... quit clogging up the internet with your miserable assumptions."
    },
    {
      "rating": "10",
      "text": "Great movie! Angels! Evil grandmas! Wooo!"
    },
    {
      "rating": "7",
      "text": "I was pleasantly surprised. i was expecting a dumb horror movie,but i was wrong. the acting isnt the best in the world. but i enjoyed the movie for what it was. so if your looking for a fun movie this film is a go."
    },
    {
      "rating": "7",
      "text": "Over all the movie is well done. The actors and the acting is the strongest asset of this movie. The plot does make sense. At certain points it slows down too much. The action scenes is also well done."
    },
    {
      "rating": "8",
      "text": "This was just an all around good-action and well-acted movie."
    },
    {
      "rating": "4",
      "text": "This Movie Sucks... God Hates Us So He Sends Angels To Kill Us? And We (Mere Humans) Have The Power To Fight Off Angels? Really? Get Real!!!"
    },
    {
      "rating": "10",
      "text": "My children, You laugh now"
    },
    {
      "rating": "8",
      "text": "I thought it was a very good movie. THe characters were interesting and the old testament treatment of God was interesting. Go into the movie with an open mind."
    },
    {
      "rating": "10",
      "text": "I just want to say that I for one am absolutely tired of the same old remakes and comic book movies! I love the majority of them, but would occasionally like to see a new concept born and unleashed on the world. With movies such as Legion and The Book of Eli we can now experience a few new and relatively entertaining movies for the action lovers to enjoy. I want to start the revolution starting today. Lets say enough with the old and in with the new. Not every movie I see needs an oscar worthy performance Christian Bell, calm the heck down and just put one out for the masses. I dont need Terminator 33 directed by McG, dude you suck give it up on the Terminator series and go back to Charlies Angels. Even the likes of Avatar, and original yet seldomly overdone story with amazing visuals and a compeling cast with BA fight scenes. Seriously when Hollywood remakes the Ateam into a movie you know the ideas are running thin. I enjoy brainless action as much as the next but come ON! Whos with me, the movie may not be great but lets get some fresh new movies into the mix SAY I !!!!"
    },
    {
      "rating": "7",
      "text": "It was entertaining."
    },
    {
      "rating": "8",
      "text": "Not sure what you folks were expecting, but I really enjoyed this film!"
    },
    {
      "rating": "3",
      "text": "my god what a bad movie. Even though I liked Paul Bettany, and the teenage girl (she was hot), and Tyrese everyone else I hated. This movie was trying too hard. It had good parts, they were in the trailer. I admired the concept and the vision, just the execution was soo, bleh. It's overdramatic, not fun, boring, and it tries too hard. The two people i Hated survived. They dont leave the diner, its boring."
    },
    {
      "rating": "3",
      "text": "This film had potential with its profound themes of religion and redemption but wasted it with cheesy predictable dialogue and a muddled yet basic plot. Some bits made me smile from the sheer absurdity though: evil granny, zombie kid and machine gunning the Angel Gabriel while he swings a mace that rotates like a melon on a drill (no joke). Watch this movie only if you're with friends, drunk, and with another dvd on hand..."
    },
    {
      "rating": "3",
      "text": "I saw bettany in the reent movie Priest and thought he fit with the dark roles. This movie wasn't horror or thriller - it failed in both. The movie was a waste of time to sit through."
    },
    {
      "rating": "0",
      "text": "The opening words of Legion were \"God is sick of all of the â"
    },
    {
      "rating": "0",
      "text": "Substandard mishmash of disjointed fragments of religious imagery and pseudo-apocalyptic gibberish. The shots themselves seemed amateurish, the characters were stock types, the dialogue trite, and the acting piss-poor. Even the special effects left much to be desired. The pace of the film was horrible, it simply dragged on, and on. Cardboard cut-outs of Paul Bettany and Dennis Quaid would have done a better job and cost director Scott Stewart less money that the real --yet paradoxically more cardboard-like-- actors."
    },
    {
      "rating": "0",
      "text": "I wanted to like this film, I really did but its just so awful. The acting ,even though done by an experianed cast, is pretty terrible. The story seems interesting at first until you relize just how stupid it really is. Its just plain awful."
    },
    {
      "rating": "5",
      "text": "The reason I give this a 5 is strictly because of certain scare moments that make you quiver. The graphics I thought were decent for this kind of movie but the storyline again is where it makes a difference. Every movie that doesn't do well in the ratings is because the movie either drags or moves to fast to understand anything. This movie didn't start to move until the middle and then it was just information thrown at you. In the end it was confusing to understand what Michael (Paul Bettany) was saying but it made sense after you think hard about it."
    },
    {
      "rating": "5",
      "text": "With this and the woeful \"Priest\" in the bag I have to wonder why Paul Bettany has bothered. This is a predictable, spot the plot religious horror. I didn't set my expectations too high but unfortunately this movie still came up short. I thought with Dennis Quaid and Charles S.Dutton there may be hope but unfortunately not although at least Duttons character had some purpose unlike the other cannon fodder."
    },
    {
      "rating": "0",
      "text": "Quite literally the worst movie I have ever seen. I'd end there, but I'm required to use one hundred fifty characters. To elaborate: even as a comicbook movie; even as a made-for-tv sci-fi channel movie made with 1990's made-for-tv movie inferior cinematic standards; this movie was so bad I was personally insulted by its very existence. I gagged in horror and dismay. I would have left the theater, but my outrage caused all the muscles in my body to contract at once leaving me paralyzed in the hell that was this one hundred minute migraine. Everyone who has ever seen this movie is the worse for it."
    },
    {
      "rating": "2",
      "text": "Boring as, slow paced, uninteresting movie with 1-dimensional steretype characters. This film has so many plot holes and unexplained segments its impossible to concentrate on the plot without getting a headache. 1st of all, if god wanted the human race to be nullified why didn't he just, you know cause a massive catastrophic earthquake I mean that sounds pretty easy for god if you ask me. Boring boring borin only reason I rate it a 2/10 is because of Paul Bethany"
    },
    {
      "rating": "1",
      "text": "The action sequences were entertaining but everything else sucked. The entire plot didnt make any sense what so ever. The acting was terrible, Even though it was done by a rather experianced cast. There are a few (and I mean very few) actual enjoyable moments, Such as the arrival of Gabriel (which I really enjoyed). Still its rather trashy."
    },
    {
      "rating": "0",
      "text": "What a waste of Paul Bettany's talent and Dennis Quaid's experience.  A stupid, stupid movie that insults anyone unfortunate enough to see it. That's all I can say!"
    },
    {
      "rating": "2",
      "text": "Poorly done. Bad special effects (that old woman in the diner was comical), a silly story, and a typical horror film trying to be atypical. How anyone could make it through this movie is miracle to me. Avoid this movie. There are worse films than this for sure but unless you just really want to waste time to waste time you should just watch something else."
    },
    {
      "rating": "1",
      "text": "A cool premise turned embarrassing failure.  The story and the script are just so bad it makes this film unwatchable.  Paul Bettany is the loan bright spot, but the light is very dim."
    },
    {
      "rating": "0",
      "text": "what the  *bleep*? This film was awful! Dreadful! The script? My 7 year-old niece has more innovative lines in her 2nd grade essays! The characters? I could care less for any one of these people, and I use the term \"people\" loosely, since zombies seem to have more depth of character then them.  Let the demons get them! What? Not demons? Those ugly mutated zombies (no, not the main cast; the other ones that were actually suppose to be playing something like weird, ninja-zombies) where being possessed by angels? *facepalm*\rThe cgi effects? I laughed almost every time one of the \"possessed\" was on screen. Note that they were suppose to make me \"terrified\".\rAnd to top it all off, we get the final angel-vs-angel fight scene ruined by shaky camera work. Thanks!\rWanna see a good Apocalypse plot? Go watch season 5 of Supernatural. No, really, Supernatural ftw!"
    },
    {
      "rating": "3",
      "text": "\"Legion\" was not a film that caused an impression, but neither did it. The story was originally based, but as far as performances and effects were concerned, they did not help much to save the film, they saved the world, but their film did not."
    },
    {
      "rating": "0",
      "text": "If that girl they're with lived till the end of the movie, I would have given at least a 1, but they didn't they actually had to kill everyone off except the main guy and the heroine, which makes the plot armor really obvious. the granny scene already made me want to just walk out of the cinema, I don't know what was going through the writers mind when he thought of this scene! It was really sick, just sick... and if this movie is specifically made against Atheists and people of other religions, they should try harder"
    },
    {
      "rating": "3",
      "text": "Not a good movie. It is a weak mash-up of apocalyptic prophecy and a cost-cutting slow moving zombie movie. There is an insult to a greater intelligence existing here, and that is not the Bible - but the audience itself."
    },
    {
      "rating": "1",
      "text": "It was a bad movie, extremely poor plot development and I felt more attached to the characters that actually died then the survivors of the movie. The movie spent half the time establishing plot it never needed and did not spend enough time establishing plot it did need. Thumbs down. I give this movie a 1 because it had 1 meritable innovation, a Spinning Bladed Mace."
    },
    {
      "rating": "0",
      "text": "The writers did not bother to read the scriptures God bless Cecil B."
    },
    {
      "rating": "1",
      "text": "The plot made little to no sense. It seems to have been made so that two angels can have an \"angel fight\". The ending was predicable and left me wondering why I shelled out $10 to see this filth."
    },
    {
      "rating": "3",
      "text": "I went in expecting a mediocre film but, instead i got a worse result. I love horror and Action but, this film was just bad. Even though there were good actors like Dennis Quaid and Tyrese Gibson, the film gave them corny lines. The Plot was like Terminator except instead of robots it's angels. the effects were cheesy and the film was just a mess. the bottom line is that Legion sucked."
    },
    {
      "rating": "1",
      "text": "Religion is a controversial topic. Legion never seems to illicit so much as a 'meh'. The entire show is bogged down by ridiculously wooden and predictable dialogue with stock characters which could be ripped straight out of any other film in the vampire/zombie/apocalypse genre. You never get an explaination why the woman's baby is important and frankly, you just don't care. For a show about angels wiping humans off the face of the earth, you get very little in the way of actual angels appearing on screen. The promise of an entertaining effects fest is wasted by poor lighting and more of that Bay-ultra-closeup nonsense which ensures you have no clue as to whether you're looking at a wing or someone's poorly knit sweater. The only saving grace is a solid turn by Paul Bettany. Chaucer does a good tormented archangel. Too bad he can't save this show's soul from eternal damnation."
    },
    {
      "rating": "1",
      "text": "Horrible movie. anyone who watches movies could direct a better movie"
    },
    {
      "rating": "2",
      "text": "My friends dragged me to this one, because they thought it was going to be, \"It's so awful, it's actually good.\" Well...it's just awful."
    },
    {
      "rating": "0",
      "text": "The movie was a complete letdown. Almost entirely takes place in the diner. Trailers tend to point towards a brainless action movie, but it is not even that, because all the action in the movie barely fills the trailer. A lot of dull, pointless talking. The reviews for this movie are more entertaining than the movie itself."
    },
    {
      "rating": "2",
      "text": "God created the earth in seven days... but, despite sending angels and dozens of possessed humans, he can't kill a small group of people holed up in a rundown diner. It is not only unbelievable how the people survived as long as they did it is even more unbelievable a studio would actually spend money producing this film. This was $6.50 and 110 minutes I will never get back."
    },
    {
      "rating": "2",
      "text": "It's funny because in the trailer the ice cream guy is made out to look like some scary, hard-to-defeat monster. But then he just kinda dies with a few bullets. So many theological/philosophical plot holes that will leave anybody, regardless of religion wondering why 'God' had to send angels down to do work he could have done by snapping his omnipotent fingers. Or for that matter why humans can even be a match for angels. Or the fact that bullets can kill angels. Plus the hot chick dies, especially since you want her to survive by the end of the movie. Bleh."
    },
    {
      "rating": "3",
      "text": "This movie is just sad to the point of being pathetic. The writing is so poor. I struggled to finish this movie and failed. I suggest you watch Supernatural instead, pretty much the same story but a whole lot more entertaining!"
    }
  ]
}