{
  "id": 2623,
  "title": "Let Me In",
  "starring": [
    "Kodi Smit-McPhee",
    "Chloë Grace Moretz"
  ],
  "runtime": 116,
  "genre": [
    "Drama",
    "Horror",
    "Mystery"
  ],
  "description": "A bullied young boy befriends a young female vampire who lives in secrecy with her guardian.  A remake of the movie “Let The Right One In” which was an adaptation of a book.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rgNb9nwPKwV45c5PTvFqFmpzGt0.jpg",
  "categories": {
    "plot": 8.75609756097561,
    "acting": 8.882352941176471,
    "ending": 9.2,
    "soundtrack": 9.0,
    "cinematography": 8.5,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I've seen the Let The Right One In and I have to admit that it was more artistic but Let Me In was an improvement from the original one. Matt Reeves did a really good job, the pacing of Let Me In is definitely way better than LTROI. It's practically a shot-to-shot remake, it follows the LTROI very closely and the scenes that was replaced only serves to improve the movie (the \"father\" getting caught scene). Chloe Grace Moretz handles Abby very well, she's very mature compared to girls far older than her, Miley Cyrus in The Last Song comes to mind. She might not be as creepy as Eli but when she turns, my God she turns. She's going to have a bright future and her casting was a brilliant one. Another important point, Let Me In sheds light on what was very unclear in the Swedish version, which was \"the father\" character, it was finally revealed to us that he was actually Abby's \"former Owen\", it really adds some weight to the ending. It was satisfying to know Owen and Abby's fate after all they've been through, (pity Owen in a couple of decades). Matt Reeves didn't really hold back on the gore, lots of blood, added suspense, it was Americanized in a good way. I love it that Abby and Owen were attracted to each other because both are really outsiders and how they built a world of their own in the midst of everything that's going on around them, though to be fair most of the commotion was caused by Abby in the first place. An excellent movie which takes it's own time, and great things do take time."
    },
    {
      "rating": "10",
      "text": "I love this film. The story revolves around the things people do for the ones they love. That statement makes the film sound cheesy, but believe me, Let Me In will creep you out in the best way possible. Go see this movie!"
    },
    {
      "rating": "10",
      "text": "A terrifically good movie about loneliness, friendship, and first love.  It had some truly touching and terrifying moments throughout it's running time.  It also had a great way of building both remorse and tension simultaneously.  The acting was great across the board (especially the two young leads).  Does not disappoint if you've already seen the original.  Both are very good films with the same story told in different ways."
    },
    {
      "rating": "10",
      "text": "I didn't see the original Swedish version, so this will NOT be a comparison. What I did see was not what I expected. This is NOT a classic vampire flick, but a classy tale about loneliness and isolation. A 12-year-old boy is bullied at school and desolate at home, until he meets the new girl next door. Their relationship forms the story's emotional center, but the fact that she's a vampire complicates matters. There are haunting images and moments of intense, bloody attack (and one amazing car wreck), but the tender core of the film elevates it to well-crafted cinema. Never really scary, but powerful just the same."
    },
    {
      "rating": "9",
      "text": "I loved the original Swedish film and was so disappointed to hear they were going to remake it. But the American version is almost as good as the original. Moretz is excellent in the role, and Elias Koteas brings something sympathetic to the role of the investigator. Also, Jack's son from Lost is a perfect bully. It's too bad nobody saw this film on opening weekend, but I recommend it highly."
    },
    {
      "rating": "8",
      "text": "In my opinion the themes the film makers choose to change/leave out of drastically diluted the story. It was a good film in itself but could have been much, much better. A refreshing break from the Twilight/True Blood vamp schlock."
    },
    {
      "rating": "10",
      "text": "I've seen both movies and I have to say that \"Let me in\" is some what better then the original \"let the right on in\". I know a lot of people have said the this movie is unnecessary but the acting and event time line in \"let me in\" is a major improvement of the original. If you haven't seen either of the two movies, I would recommend seeing \"let me in\" before \"let the right one in\" because the original really spoils the remake."
    },
    {
      "rating": "7",
      "text": "I am not sure if i liked this better than the original. The original was a  darker movie. This remake developed the pre-adolescence angle more. Ultimately, for me, i did not need to rush out and see this. If you have not seen the original; then by all means, go see this now."
    },
    {
      "rating": "7",
      "text": "Excellent film...I wasn't sure how it was going to be since the 'vampire' plots have been ramped lately and exhausting, but LET ME IN was put together very well, the sound design and the mood and the cinematography went great with the story. I personally liked the part when he finds out that Abby's dad wasn't really her dad after he saw the old photograph of the man at a young age next to her. It was a nice combination of fantasy and real life, the bullies were a key role for the movie, and during the scene when the main bully's older brother is picking on him in front of everyone, it brings a certain human feeling to the overall characters. I recommend watching!"
    },
    {
      "rating": "7",
      "text": "Would you call me sick If I told you the love story in this movie is quite cute and adorable? Of course I still do feel sorry for the chap by the end of the film having to live the rest of his life like the miserable S.O.B. who fell in love with her first, or second, How old is she exactly? What a Great Film.....I loved it......And that's saying a lot considering I utterly hate horror films."
    },
    {
      "rating": "8",
      "text": "First off, NO ONE I mean NO ONE should even mention this is like Twilight, it is NOT, this is written well, plot is solid. NO sappy manwolfes, over acting. It has nice dark scenery, very well done movie I thought, well worth a watch for anyone into horror/vampire movies."
    },
    {
      "rating": "10",
      "text": "An excellent film that goes beyond your typical horror film in so many ways. The acting, directing, score, and cinematography were all spot-on in this film. I admired how much attention was paid to the connection between the pre-teen leads and their bond with each other. I never thought I would ever see a \"horror\" film that would make me look at it as a beautiful romance hidden within....yet also, keep me on the edge of my seat wondering what would happen next.The picture and audio quality for the Blu-ray were both flawless and I also appreciated the abundant special-features presented on the disc. It is rare that I give repeat viewings for films in such close proximity but with this film I discover something new every time that I didn't catch in the previous viewing. Exhilarating, yet very touching from start to finish and worthy of anyone's collection.Note: I still to this day have not seen the Swedish version from which this was inspired from, so that may have eliminated any critical bias going into this film. My opinion is based on \"this\" film, and this film alone."
    },
    {
      "rating": "10",
      "text": "The Best vampire movie that i have ever seen. Deep and cruel the story grabs hold and won't let go. The heart felt moments the kids share and the ending while not a surprise was a great one. i just wish more movies would take this lead... 10/10 Wish i could give it more! After this i also went and watched the original movie."
    },
    {
      "rating": "10",
      "text": "Let Me In was probably my favorite movie of last year. I thought it is so much better than the recent reign of bad vampire movies i.e. Twilight sage! It was brilliantly done, atmospheric, the cast was amazing and it was just beautiful.The ending was amazing and all together i thought it was an amazing masterpiece and a reassurance that vampires wont have their name stomped into the ground!!!"
    },
    {
      "rating": "9",
      "text": "Sweet, scary, beautifully filmed. Let me in is a beautiful movie that combines love, heart and thrills. Chloe Moretz offers just a mesmerizing performance and is just stunning. I give this movie 88%."
    },
    {
      "rating": "10",
      "text": "i think it is better than the original, this one was darker and it was more focused on the main characters. everything was perfect except the CGI, but that doesn't really matter."
    },
    {
      "rating": "9",
      "text": "The best vampire movie i seen since Interview with the Vampire. This is a really good story along with very good acting and directing. This version is more darker than Let the Right One in. This movie is full with a lot of chill. Full with drama and thriller. This is one of the year's finest horror films. One of my favorite. If you a fan of horror movies you will love this movie. There's a lot to love about this movie. A must see movie for vampire fan's and horror flicks watcher"
    },
    {
      "rating": "10",
      "text": "This one actually was more powerful than the original version for me.  Let Me In is slower-paced, but that worked for me.   I enjoyed the darker elements and the moral questions it asked of the characters in the movie...and of me.  Like **** Reeves tricks me into rooting for things I should not be rooting for.    That acting from all involved was superb.    This was my favorite movie of 2010 and one of my very favorite movies period."
    },
    {
      "rating": "8",
      "text": "I'm happy with that remake. Logically, the original is perfect and irreplaceable. However, the american version could produce a great movie. Bringing the same elements with some modifications, we have the new lonely and persecuted Owen by fellow high school. By the way those scenes were great. And the new Abby, interpreted by adorable Chloe Moretz, who I adore, could fulfill the role and show us the reclusive vampire trapped forever in the body of a child under 12. I loved their scenes, but couldn't how not to remembering the original, more quaint and charming. I think the scenes with special effects weren't very pleasing, but it comes as a differential for those who like. Had something like that in Swedish version? I don't remember. So that's it. As much as remakes are made for the sole purpose of making money on something that was successful. \"Let Me In\", stands out as a film well done, and it deserves to be seen and appreciated. Enjoy the new version, it is great."
    },
    {
      "rating": "8",
      "text": "It's a truly rare thing indeed when a remake not only equals, but very nearly betters its original. Matt Reeves manages to preserve the atmosphere and tone of Let The Right One In but also puts his own creative stamp on proceedings, yet again proving his great sense for maintaining tension and momentum so ably demonstrated in Cloverfield. All performances are top notch, with Smit-McPhee and Moretz taking the two pre-teen leads of the original film in a new direction. While Moretz's Abby may not be quite as creepy as Eli in the original, her chemistry with Smit-McPhee lights up the screen. The real acting highlight though, is Jenkins, who gives the character of Abby's guardian real emotion and understandable motivations for his killing spree - you are almost willing him not to be caught in the scene where he is hiding in a potential victim's car. The story is more fluid and engaging than Let the Right One In, and the effects more polished, which will Let Me In a more appealing prospect to some. Others, however, may miss the originality and rawness of LTROI. Whatever your view on whether it needed to be remade merely 2 years later, Let Me In has both respect for the achievements of  its predecessor, but also manages to take the tale in a new direction, an extreme rarity with film remakes."
    },
    {
      "rating": "8",
      "text": "SO MANY VAMPIRE MOVIES - but this one does a good job, has solid characters and had a story that I cared about. I enjoyed the more tradition approach to the folk lore of vampires the film took and its child actors were more convincing than adult actors in most movies. The movie didnt work as well when the special effects kicked in (something that was not necessary). Let Me In was a solid character movie. Recommended.â"
    },
    {
      "rating": "10",
      "text": "This is actually one of my favorite movies I have ever seen. It may not be the typical horror film, but it is very entertaining to watch. Chloe Grace Moretz is definitely the bomb in this film. She plays a strange role that fits perfectly with her. Dylan Minette is also pretty good in this movie. I'm pretty young, so it was nice to see a very pretty face in this horror film. The romance and chemistry between the two main characters is flawless. It adds a lot of depth to the film. The intense scenes are also very nice to watch. The make-up and effects are superb. I love this movie. It is a must see. Best thing in the film: Chloe Grace Moretz"
    },
    {
      "rating": "10",
      "text": "Too often these days, at the conclusion of a horror film, we find ourselves wondering why we just wasted 2 hours of our lives. Allow me to give a standing ovation for Let Me In. I was captivated during the entire movie, not just the horror but the story-line itself. The blood and gore actually has a meaning in this story and is used discreetly yet masterfully. This one is must see!"
    },
    {
      "rating": "8",
      "text": "Not as good as let the right one in, but very close. Probably the best American remake in years. In fact the only other really good remake I've seen in years is Gore Verbinski's The Ring"
    },
    {
      "rating": "10",
      "text": "If you are considering watching this film, (which you definitely should!) I would recommend reading the book first, it makes watching the film a lot more satisfying as you fully understand the what the characters are going through as the film doesn't do the best job at that though importantly doesn't take anything away from it if you haven't read the book."
    },
    {
      "rating": "10",
      "text": "children... story of first love... vampires ... had everything to be bad. the film is breathtaking, exciting surprises and unimagined as closer to the end, but sad I felt I wanted more ... Chloe Moretz, Kodi Smit-McPhee (are even human?) + Freur-doot doot, will never forget this movie."
    },
    {
      "rating": "10",
      "text": "Enchanting, thrilling, and wonderfully plotted. I think the most terrific part is the plot twist wherein the former kind of lover disguised as Moretz's character's father. I honestly had no idea in the beginning that this was about vampires, so I was really curious why she was odd (like, walking barefooted on snow). The events connected together and I was like, \"Whoa!\" all the time."
    },
    {
      "rating": "8",
      "text": "This is an incredibly touching story more of young love, than vampires. Although there are some frightening moments ( enough to satisfy fans of the vampire genre ), it is essentially about the bond between a 12 year old girl and a lonely pre-adolescent boy who is bullied. They need each other. She for him to help her as her 'familiar', and he needs her to protect him. Their individual needs do not, however, lessen the impact of their legitimate feelings for each other. It is a splendid movie well worth the remake of the original.\rBoth young actors are terrific. Displaying deep sensitive portrayals of their characters. The direction is spot on and the staging of the scenes are virtually characters themselves."
    },
    {
      "rating": "7",
      "text": "i have seen my share of horror films there not my favorite genre but i watch them for a thrill. with let me in i liked the story it was well written and the cast all performed there roles very well especially the 2 main characters. but the reason am going down to 7 is that i got more of depressing attitude from it rather then horrific. what am saying is there were no instances that gave me any suspense are shocks which is what i have come to expect from a good horror film."
    },
    {
      "rating": "9",
      "text": "One of the best horror films of recent years was the brooding, bloody, and surprisingly moving 2008 Swedish vampire movie, Let the Right One In.  So naturally when I heard that an American remake was in the works, I was worried.  Just think of the way Hollywood has butchered great foreign films in the past; The Vanishing anyone?  Not to mention the fact that the American version was being helmed by Matt Reeves, the director of 2008â"
    },
    {
      "rating": "8",
      "text": "A movie I enjoyed. Props for the atmosphere and really nice acting. The story was pretty intriguing with a couple of tense moments as well as sweet moments wrapped around in everything that's wrong. Great actingAmazing atmosphereA few drops of horrorAn interesting story overallWorth giving it a shot for something different"
    },
    {
      "rating": "8",
      "text": "The american reply of swedish version has some subtle differences but that´s not a weakness. The story, with the distinctive style of Hammer films, is faithful to original, with endearing characters. Maybe not so mighty as swedidh production but much more tasty than naive and shallow Twilight."
    },
    {
      "rating": "8",
      "text": "I find it hard to talk about this film without drawing comparisons with the original. I guess if I hadn"
    },
    {
      "rating": "7",
      "text": "After the exceptional success of CLOVERFIELD (2008), Matt Reevesâ"
    },
    {
      "rating": "8",
      "text": "Interesting movie. At first I was quite hesitant about watching it but I was greatly surprised. It was at times a bit slow, but the argument was well developed so I never got bored. It is not just plain horror, but the story itself is touching and powerful. It is not just a 'vampire' movie, but it is also about human relationships. Desolation, trust, disappointment. Love and frienship are tested. It is by no means a cheesy film, nor it is corney. It is a movie that is nto afraid to look into the world of human emotions...a world that sometimes we are afraid to see. I would highly recommend it. Great performances too!"
    },
    {
      "rating": "9",
      "text": "While not truly original (as it is a remake of a Swedish film), it is VERY good in its own right. I have seen both movies (actually, I own both movies) but I think this version does a better job with the story. The two stars are much more talented and the overall supporting cast of this version is a little stronger. This claim has not been made lightly nor am I bigoted against foreign language films (I own many). Here are a few specific examples of why I think Matt Reeve's version is better:-The \"police detective\" storyline made more sense than the \"drinking buddy\" storyline and you have more empathy for the cop than the abusive drunk. -The final apartment scenes are written much better in this version. You know how the boy got there, how she is found, and what brought \"the outsider\" in made more sense. -While the emotional connection with the \"father\" was not written quite as well (but still very good) in the apartment scenes, this version does a better job conveying the mutual love and sacrifice through the hospital scene. -The way the \"father's role\" was conveyed in this version was much better. Showing the planning and success of the first hunt was critical in the acceptance of this character.To each his own I suppose but I do not casually dismiss a film because the idea has been done before, especially if it is done better."
    },
    {
      "rating": "9",
      "text": "One of the only remakes I have ever seen that adequately replicates all of the good from the original and adds just enough changes to make it stand out. \"Let Me In\" is an inspired film boasting haunting visuals and beautiful performances."
    },
    {
      "rating": "9",
      "text": "Just plain brilliance. Definitely the best movie about vampires ever. This is all about the atmosphere the director created  great acting, soundtrack and decorations really do their job."
    },
    {
      "rating": "9",
      "text": "Let Me In presents us a mature and elaborated relationship where both of the actors (and characters) that are involved in it go up to scratch on their performance. It is worth the 9, and Moretz does not stands back when acting as an \"evil\", but at last cute and lovely vampire."
    },
    {
      "rating": "9",
      "text": "It's easy for any fan of the original film to be hesitant about his movie.  After all, the old saying is that if it's not broken, don't fix it, and Tomas Aldredson's \"Let The Right One In\" is as far from broken as it gets.  However, in this particular case, everything turned out just fine. Matt Reeves(Cloverfield) has really done an excellent job of staying true to the original while putting his own little spin on the story.  The setting is slightly different, going from a Swedish town to a New Mexican suburb but it all still feels very familiar to fans of the first one.  The mood is excellent as it manages to convey a wide range of emotions from sympathy to fear and everything in between.  This mood is accompanied perfectly by the outstanding orchestral score that again, feels very familiar.\r But at it's heart, Let Me In is about the characters.  When we first introduced to Eli and Oskar in the original we fell in love with them and the idea of duplicating those characters seemed frightening.  I'm here to tell you that Owen and Abby do their Swedish counterparts proud.  This is, in large part, due to the fantastic acting jobs done by Kodi Smit-Mcphee(The Road) and Chloe Grace Moretz(Kick Ass).  They manage hold true to the character but both add a level of charm that perhaps had not been seen before.  Elias Koteas and Richard Jenkins round out what turned out to be a very strong cast with seemingly no week links.\r No matter what title you go by or what language you speak this is a story that everyone should experience.  Unlike the fanboy(girl) driven vampire films of late this is one that can really affect you.  These are characters that you will care about and a story that you will want to see to the end.  And if you're a die hard fan of the original like myself, who can't stomach the idea of this remake I urge you to give Let Me In a chance.  It is easily one of the best films of 2010."
    },
    {
      "rating": "9",
      "text": "The two principals each offer Oscar-worthy performances that the Academy bigotedly ignored because neither of them is a day over 13 years old and the movie is a \"horror\" movie. Too bad, but typical. This is a beautiful character-driven story that excels on many levels."
    },
    {
      "rating": "9",
      "text": "The rare remake that exceeds expectations, \"Let Me In\" might even be better than the Swedish film it is based on. Chloe Moretz and Kodi Smit-McPhee give great performances that show a maturity far beyond their ages, and Michael Giacchino's score is magnificently creepy."
    },
    {
      "rating": "9",
      "text": "The chances of remaking a beloved Swedish import such as Tomas Alfredson's \"Lat den ratte komma in\" into an equally good, if not, superior film and entertainment, didn't bode well from the outset, and there's more than adequate historical precedence to back these well-heeded doubts up. Not with our track record, not after what America had done(almost thirty-five years ago, around the time of the Bicentennial) with the vaunted Abba sound, as mad record producers and engineers in a recording studio, reconStructed the Nordic husband and wives' soaring harmonies and propulsive rhythms into the limpest simulation imaginable, reducing the Scandinavian Beatles' musical genius(\"S.O.S.\", anybody?) into something called The Starland Vocal Band. But \"Let Me In\", far from being the vampire genre's \"Waterloo\", is actually an \"After[-dark] Delight\". Not only does \"Lat den ratte komma in\" survive its Americanization, the coming-of-age story about a monster, actually benefits from its alchemization. To the filmmaker's credit, his application of a little American major studio know-how is not the least bit detrimental to the art house approach to the narrative's pacing. It's still methodical; it's just not meanderingly so. \"Let Me In\" shorns up the story by sending the boy's father to the periphery, relegating his role to an unheard voice during the boy's mother's phonecalls. In \"Lat den ratte komma in\", Oskar's visits to the countryside brings the movie to a halt. Like Sean Parker(Justin Timberlake) in David Fincher's \"The Social Network\", the filmmaker knows that the [movie] is here,\" not there, wherever there may be in relationship to Los Alamos, New Mexico. Pueblo, perhaps? When Oskar(Kare Hedebrant) meets Eli(LIna Leandersson) in the original, the boy appears to be not especially well-versed in adult matters, so when the girl, fully nude, crawls into bed with him, following the loss of her Protector(sex partner?), there's very little erotic charge, because the moviegoer assumes that the pre-pubescent child hasn't developed an eye for the female anatomy, as of yet. His American counterpart, on the other hand, is a peeping Tom, who spies on his neighbors with a telescope, and gets more than an eyeful from a couple in the midst of foreplay. He sees breasts; he likes them. Unlike Oskar, who was barely cognizant of sex, Owen(Kodi Smit-McPhee) just isn't ready. While \"Let Me In\" doesn't get into details about the angst involved with being forever twelve like Neil Jordan's \"Interview with the Vampire\" did(the child vampire Claudia, played by Kirsten Dunst, whose hair always reverts back to its doll-like curls after she cuts it), the moviegoer speculates that the woman whom Abby(Chloe Moretz) attacks and nearly kills, was chosen so because of her womanly breasts; breasts that Owen would admire; breasts that she'll never have. \"Let Me In\" feels more like a love story than the Swedish original. The relationship between Oskar and Eli in \"Lat den ratte komma in\" seems platonic, more like brother and sister, because of the boy's sexual naivety. Recognizing that American kids are faster, the filmmaker added that scene of voyeurism to make it feel contemporary, even though, technically, \"Let Me In\" is a period piece. The best improvement to \"Lat den ratte komma in\", the presence of a gun, is quintessentially American, since the gun has no place in the Swedish landscape, in which the gun, of course, belongs to law enforcement, conspicuously missing from the source film. Hypnotized by all that lyrical snow, perhaps, distracted the moviegoer, so enamored with the taut atmospherics of the apartment complex courtyard, from wondering as to why nobody ever called the cops. It's a story contrivance similar to the \"Friday the 13th\" movies, where none of the surviving campers ever thinks to report the homicidal maniac in the hockey mask that's picking them off one by one. Saying The Starland Vocal Band is better than Abba; now that's blasphemy. But saying that \"Let Me In\" is better than \"Lat den ratte komma in\"; now that's just the truth."
    },
    {
      "rating": "10",
      "text": "I have to be honest, I wasn't looking forward to watching this film because, yes of course, it has to do with vampires, but boy was i wrong. Yes, it is about a vampire, but this vampire played by Chloe Moretz, truly gives you the chills. One of the most disturbing, yet greatest movies of all time. I really enjoyed watching this movie with friends because everyone thought it was as disturbing as I did. Both performances by Kodi Smit-McPhee and Chloe Moretz should not go unnoticed because they put on really great performances."
    },
    {
      "rating": "8",
      "text": "Matt Reeves, who is most famous for his monster film \"Cloverfieldâ"
    },
    {
      "rating": "10",
      "text": "when i first heard about this movie i thought about not watching it but after i saw the trailer i changed my mind right away im glad i did its a good movie and you should see it."
    },
    {
      "rating": "7",
      "text": "Moretz proves her talent in Let Me In, an unusual vampire flick with a beautiful, soulful story. Although the pace Reeves takes can get frankly tiring, it was, in general, a special kind of horror, honestly tackling teenage bullying in a whole new sense of direction. Vampires no longer sparkle in daylight."
    },
    {
      "rating": "9",
      "text": "Every bit as wonderful and atmospheric as the Swedish original.  The lead performances are remarkable and Matt Reeves once again shows real skill and style.  Occasionally the CGI is weak, but this doesn't detract from this creepy and disturbing gem."
    },
    {
      "rating": "10",
      "text": "I went in to this movie expecting to be disappointed. To my surprise this movie is now among one of my top favorites. I did not get to see the original, but it is now on my watch list."
    },
    {
      "rating": "8",
      "text": "A sick, twisted, unusual love story with a dash of horror."
    }
  ]
}