{
  "id": 3087,
  "title": "Let There Be Light",
  "starring": [
    "Kevin Sorbo",
    "Sam Sorbo"
  ],
  "runtime": 100,
  "genre": [
    "Drama"
  ],
  "description": "An atheist goes through a near-death experience in an auto accident before converting to Christianity.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/a1lCoSdAEYEs4ezvm5PcufEUVti.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 6.0,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Very badly acted and written. Sorbo was more enjoyable running around as the son of Zeus. Shameless plug for Sean Hannity and Fox News. If you want to watch a movie about God, watch Thor instead!"
    },
    {
      "rating": "0",
      "text": "Where do I even begin?  This wasn't even truely recognizable as a professional movie.  It struck me as a sunday school class's improv project.  (My apologies to children's improv for the comparison). It was clumsy and ham fisted in its message of \"Christians good, Others bad, Join us or else!\" message.  The acting by 3rd rate has-beens played as if it was their 2nd time reading through the script.  It was clearly slapped together for a specific audience that would automatically shell out their money for a movie that supported thei message."
    },
    {
      "rating": "0",
      "text": "one of the worst films i've ever has the displeasure of sitting through.Avoid this like the plague because the plague would actually be more enjoyable."
    },
    {
      "rating": "10",
      "text": "This movie has a wonderful message that deviates from the Hollywood norms. Three times during this film I negotiated that \"golf ball in the throat\" feeling, and in the end it prevailed. Tears might be your result too, but the heartwarming message of hope, love, and even redemption can bring a calming strength and resolve to any turbulent thoughts one might have.Faith is not a prerequisite to enjoy this film. The Sorbo Family is convincing and the delivery of their message is a refreshing change from the typical fabric of entertainment today."
    },
    {
      "rating": "8",
      "text": "As usual there will be no middle ground critiques. Love or Hate will be the general themes. As for my wife & I we found the film to deliver a very powerful message by illustrating the struggles of inner faith when confronted with horrible circumstances in one's life. You could feel the emotional outbursts from within the theater. Congrats to Sean Hannity on his 1st venture into the movie industry"
    },
    {
      "rating": "10",
      "text": "I loved Let There Be Light! It was a very inspirational film. The movie from start to finish was great. This movie made my faith in God stronger. I saw it twice. I suggest that everyone should see this movie!"
    },
    {
      "rating": "10",
      "text": "Fantastic Christian movie with excellent performances and a moving story. Kevin Sorbo does it again. Also not afraid to engage both Atheism and the Islamic State in showing the despair and emptiness they offer vs the love and eternal life offered by Jesus. What a blessing to have Christians like Sorbo and Hanity standing in the storm against the deluge of emptiness offered by the mainstream."
    },
    {
      "rating": "10",
      "text": "A wonderful movie with a powerful message of hope, redemption, and trusting in God's sovereignty."
    }
  ]
}