{
  "id": 2369,
  "title": "Lethal Weapon 4",
  "starring": [
    "Mel Gibson",
    "Danny Glover"
  ],
  "runtime": 127,
  "genre": [
    "Action",
    "Adventure",
    "Comedy",
    "Crime",
    "Thriller"
  ],
  "description": "In the combustible action franchise's final installment, maverick detectives Martin Riggs and Roger Murtaugh square off against Asian mobster Wah Sing Ku, who's up to his neck in slave trading and counterfeit currency. With help from gumshoe Leo Getz and smart-aleck rookie cop Lee Butters, Riggs and Murtaugh aim to take down Ku and his gang.",
  "releaseYear": "1998",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cRm7ro9tfiHagQb8i3wO4F1CiuB.jpg",
  "categories": {
    "plot": 4.2727272727272725,
    "acting": 4.625,
    "ending": 6.625,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.2,
    "action": 5.714285714285714
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Critics got this movie dead wrong. Lethal Weapon 4 is my close second favourite film of the franchise. The cast is fantastic, the action is spot on. It's entertaining from start to finish and criminally underrated."
    },
    {
      "rating": "2",
      "text": "Lethal Weapon made in 1987 was great, however my best Lethal Weapon film is Lethal Weapon 2 as it's just as good if not better than the original. The third installment was okayish but not great and then in 1998 we were in for a shockwave as Lethal Weapon 4 dropped on our heads like bird droppings from a great height lol.... LETHAL WEAPON 4 is directed by the same director who made the other Lethal Weapon films. Danny Glover and Mel Gibson are back to stop some Chinese dude in the form of Jet Li who's the villain, joined once again by Rene Russo and Joe Pesci. .. Mel Gibson, Danny Glover, Rene Russo and Joe Pesci battle hard to stop Jet Li who's a terrible villain but the fight scenes in this movie are impressive. The car chase scenes however  are not impressive and Chris Rock joins Lethal Weapon 4 as some black, loud mouthed and annoying dude. Lethal Weapon 4 is poor in terms of storyline and most of the characters are unlikeable apart from Danny Glover and Mel Gibson and the profanity and swearing is way over the top. Bad action scenes and bland characters make Lethal Weapon 4 a stinker of a bad movie and a stinker of a sequel. Bad in every way."
    },
    {
      "rating": "1",
      "text": "Please, Warner Brothers, let's not have any more of this claptrap, and if you must make #5, knock off the Joe Pesci character while the credits are rolling. He is absolutely horrible."
    },
    {
      "rating": "10",
      "text": "Infelizmente é o definitivo último capítulo da quadrilogia épica Lethal Weapon \"Máquina Mortífera\".\rPorém a saga acabou em perfeita nota,Mel Gibson E Danny Glover no auge do química parceria,Jet Li é um ótimo vilão. Rene Russo,Joe Pesci e Chris Rock estão ótimo também."
    },
    {
      "rating": "6",
      "text": "Another So-So SequelLethal Weapon 4 has some charm to it, But that isn’t quite enough to mask it’s problems."
    },
    {
      "rating": "9",
      "text": "Detective Riggs (Mel Gibson) tries to settle down with his pregnant girlfriend, Lorna (Rene Russo), while his partner, Murtaugh (Danny Glover), comes to grips with the marriage of his pregnant daughter, Rianne (Traci Wolfe), to fellow cop Butters (Chris Rock). But they find themselves and their families targeted by Chinese mobsters, led by Wah Sing Ku (Jet Li). Riggs, Murtaugh, Butters and private eye Getz (Joe Pesci) decide to go on the offensive before the gangsters get to their loved ones. Jet Li's arrival breathes fresh life into a tired franchise formula -- but yet, still enough to put Lethal Weapon 4 on equal footing with its predecessors. I'll give Lethal Weapon 4 an A."
    },
    {
      "rating": "3",
      "text": "every bit of a misguided mishap..Lethal Weapon 41 And A Half Out Of 5Lethal Weapon 4 is another advancement on the partner-in-crime's chapter, that neither helps evolve the characters nor the makers from its rigid bubble. The rudimentary process and the urge to leave the scene or cut to next scene with either a bang or a punch line that defies logic and practicality, pretty much gives it away within its first few minutes where the feature may lie. The franchise still hasn't solved its antagonist problem, for it never oozes threat as it should nor does it projects the stake at risk; it's all possible, it's all easy with a tougher sacrificial routine. It is again low on its technical aspects like choreography, sound department and editing. The screenplay by Channing Gibson is actually a mixology of all the spicy ingredients extracted from the commercially successful feature, adding it up and waiting for the outcome which too in here isn't handled well by Richard Donner; the director, as usual is short on executing the script addition to that it also failed to project the brotherhood that was present in the previous installments. The performance by Mel Gibson seems a bit derailed whilst Donald Glover seems to be focused with a humorous supporting cast like Joe Pesci and Chris Rock. Lethal Weapon 4 is every bit of a misguided mishap as its predecessor and more for it sucks out the soul from it."
    },
    {
      "rating": "6",
      "text": "It definitely felt rushed at times and the acting was cobbles together. But the action was still entertaining."
    },
    {
      "rating": "7",
      "text": "It was good but far too much like the other films and really had no originality to it what so ever. Still good though and I enjoyed it from start to finish."
    },
    {
      "rating": "8",
      "text": "Lethal Weapon 4 bucks the trend of diminishing sequels and ends up being the most satisfying entry in the franchise. Whilst it doesn't hurt that the movie has some spectacular action scenes (table surfing!) and a superior villain in Jet Li, the real quality of LW4 is it's heart. The characters are well defined and the chemistry between them is absolutely perfect. Lethal Weapon 4 makes for a heartwarming finish to a nostalgic, much loved franchise."
    },
    {
      "rating": "3",
      "text": "Besides being a springboard for Jet Li's Hollywood career (for good or ill, depending on your view), this film is just a forgettable, uneventful money-grab.  The cuts between Gibson and his bad-wig-wearing stunt-double are some of the most unconvincing I've ever seen in a big-budget picture.  But that stands as a great analogy for the entire film... slap shod, sloppy and unconvincing malarkey."
    },
    {
      "rating": "5",
      "text": "An honorable end.This movie is the fourth and final in the \"Lethal Weapon\" franchise. This time, Detectives Murtaugh and Riggs are promoted to prevent them from doing fieldwork and causing more damage that Police insurance does not want to pay. But nothing will get them off the ground, especially if there is a human trafficking ring bringing illegal immigrants from the East to the US, and if Murtaugh's daughter is pregnant and engaged to another policeman against her father's will.I think the film makes good use of the mistakes of previous productions: there is greater care in writing an engaging, solid and coherent story that can sustain the film until the end and give us more than just tons of action. However, the two leading actors are no longer as young as in the two initial films, and this is especially noticeable in the case of Danny Glover, it being predictable that this would have to be the last film with the two actors to embody the main characters. More recently I know that there was a television series and I've heard of an eventual movie “reboot”. If a project like that goes ahead, I think it's not bad that the two actors will be entitled to an honorable “cameo”, but the new film will have to be something totally new and different from what we've seen here.What can we say about the cast? Mel Gibson and Danny Glover return to their usual roles and provide them with a satisfactory effort and work, but that does not hide that age has passed for them (as it does for everyone). I felt that Gibson's character was the target of a huge understatement: he is no longer the suicidal freak of the early films, he is a much wiser agent, and the film shows that he has learned to moderate himself. Joe Pesci seems to have been underutilized in this film, but his scenes with the two friends give us some of the most emotional moments in the film. His character also evolved, going from a bore that we had to put up with to a true unconditional friend, willing to face everything to be useful and help. I also liked the work of Jet Li, an actor that I have never seen or valued very much until now. Rene Russo shows up little and just does what he needs to do.Technically, it's a regular movie. The bet goes to the special effects, visuals and sound, which are really good. The sets, as well as the costumes, fulfill their role well, particularly towards the end, where there are indeed some interesting sets. Cinematography doesn't stand out, but it doesn't look bad either. The soundtrack, I confess, didn't particularly catch my attention."
    },
    {
      "rating": "7",
      "text": "Why!the Chinese involvement was literally like a break to fun!the whole series is a masterpiece it will never get old but this one was little degrading and little disappointment,the music was amazing,acting was great every character was amazing,the story was decent but not that convincing,the action,chasing and stunts were awesome,the starting shootout and the naked thing was hilarious,the whole son-in-law butter thing was hilarious and Roger think butter as gay it was another level fun,the jokes in this movie was less compare to last ones but it was hilarious,the Chinese gang's every aspect was painful and ignore-able it wasn't that great.the Chinese family at Roger's house was amazing although apart from that and action's of Chinese every other thing was like a joke it was disappointment,the chasing sequences were intense,the apartment fire and fight was insane and it was too much it felt like WTF,serious respect for everyone but whole movie sucked because of the sub-plot of Chinese,the family side of the thing was beautiful and amazing,the whole marriage thing between Riggs and Lorna was amazing and then the ending hospital marriage was awesome,the promotion thing and the office jokes were damn hilarious,the end fight was over the top but awesome but the water thing was way too much and then the ending Joe pesci scene it was literally the sweet and emotional conversation then the hospital thing with babies of both Lorna and Rianne that scene was beautiful and the last photo scene \"we're family\" it was literally great and sweet,awesome end to the series by that ending the extra ratings other than that whole movie was 4/10,apart from Chinese things the family and duo's thing it's an hilarious and amazing movie!"
    }
  ]
}