{
  "id": 3042,
  "title": "Lethal Weapon 2",
  "starring": [
    "Mel Gibson",
    "Danny Glover"
  ],
  "runtime": 114,
  "genre": [
    "Action",
    "Adventure",
    "Comedy",
    "Crime",
    "Thriller"
  ],
  "description": "In the opening chase, Martin Riggs and Roger Murtaugh stumble across a trunk full of Krugerrands. They follow the trail to a South African diplomat who's using his immunity to conceal a smuggling operation. When he plants a bomb under Murtaugh's toilet, the action explodes!",
  "releaseYear": "1989",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1EEIUw0tkX7AJZ1ikZrtKZZKlC6.jpg",
  "categories": {
    "plot": 6.428571428571429,
    "acting": 6.142857142857143,
    "ending": 8.6,
    "soundtrack": 6.5,
    "cinematography": 3.0,
    "familyFriendly": 3.0,
    "funny": 8.428571428571429,
    "action": 8.157894736842104
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Lethal Weapon 2 is a marginally superior sequel. The chemistry between the leads is dynamite as usual and Joe Pesci brings new comedic elements to the mix. Lethal Weapon 2 makes for a memorable slice of 80's action."
    },
    {
      "rating": "9",
      "text": "Lethal Weapon 2 represents the rarest of rare Hollywood enigmas: the superior sequel.  It's tighter, funnier and more memorable, which is impressive given that the original was already well paced, funny and full of memorable moments.  Take a trip back to the 80's and watch these two excellent action flicks but skip the later two sequels/money grabs."
    },
    {
      "rating": "10",
      "text": "Uma sequência arrasadora.\rMel Gibson E Danny Glover voltam estão ainda melhor a história fica perfeita adicionando Joe Pesci como o irritante mas fiel amigo do sargento riggs e murtaugh. Muita comédia,muitas cenas de ação incríveis. Show de filme..."
    },
    {
      "rating": "9",
      "text": "South African smugglers find themselves being hounded and harassed by Riggs and Murtaugh, two mismatched Los Angeles police officers. However, the South Africans are protected by diplomatic immunity, and so the two are assigned to witness-protection duty in an attempt by their captain to keep his job. It is only when this witness reveals to them that he has already dealt with the smugglers that the trouble really starts. Lethal Weapon 2 may sport a thin plot typical of action fare, but its combination of humor and adrenaline, along with the chemistry between its leads, make this a playful, entertaining sequel. I'll give Lethal Weapon 2 an A."
    },
    {
      "rating": "3",
      "text": "I really liked the first movie of the franchise and was very curious to see the rest. So I had some expectations about this film, as is natural and understandable. But what I found is so much weaker that I couldn't avoid feeling disillusioned. Even so, it was a huge success and represented a huge financial income for everyone involved, from the studio to the actors. Mission accomplished!The problem starts where almost all problems start in cinema: the script, written in a fanciful and absurd way. Again, we'll see Murtaugh and Riggs in a new investigation, betting on eliminating an organized crime group that's strongly associated with South Africa, an ostracized country at this time due to the \"apartheid\". In the midst of all this, without even being immediately understood by the public, the detectives are removed from this case and are going to babysit an important witness. Understood? Not? In fact, it's hard to understand.In addition to a confusing script based on an absurd premise (the police cannot act against someone protected by diplomatic immunity... they can, but this requires contact with the diplomat's country, in order for immunity to be suspended), the film totally sacrifices the script for tons of unbelievable action filled with explosions, gunfire and destruction. The opening scene is pretty clear on what we're going to find, and the film's climax includes the destruction of an entire house by a single man. The movie is fun, entertains the audience, gives them a lot of action... but it doesn't make much sense.Again, Mel Gibson and Danny Glover showed up to the characters they had and give us a happy performance. Is it better than the first movie? No, I felt the two actors were lazier here, but the truth is that you only get to feel that once in a while. Joss Ackland was a more irritating villain than a threatening one, but he gives the franchise the first villain worth noting. Joe Pesci, unfortunately, was left with the painful and arduous task of bringing the movie moron to life, and his performance resented that.Technically, it's a movie where the bet goes completely back to special, visuals and sound effects. It is completely packed with action scenes, each one louder and more spectacular than the last, with explosions, gunfire, destruction and stunts doing a truly well-done and commendable job. The cinematography is regular, it is within what we would expect from a nineties film, and the sets and costumes fulfill their role with dignity. The soundtrack does not deserve any mention."
    },
    {
      "rating": "10",
      "text": "One of the greatest Cop thriller/comedy movie ever if not its A Masterpiece!its the perfect sequel it really extend's every aspect into 2X literally in every department it was one step improved the whole movie was full of fun,emotions and amazing intense situations and action packed entertainment.the music was phenomenal,the acting was iconic the duo was legendary and there small fights were hilarious apart from that addition to Joe Pesci the trio was literally legendary fun it was another level hilarious ride with them,the story was amazing and screenplay was great right from the starting chase till the last it was exciting and entertaining ride,the actions scenes were awesome and the greatest thing in this movie the Comedy it was literally Pure art,the starting chase was hilarious and intense and then the whole office intro and technique of untying lase by Martin was amazing.the Advertisement of Roger's Daughter was awkwardly hilarious,the all Joe pesci scenes were legendary and fun,the drug thing and the antagonist's 1st meet at house with the shootout was impact-full and amazing,the love angle of Martin was good and the aftermath at end was dark and sad,the small fights between the gang and whole police's were engaging.the Roger's warned from Gang at start and then the toilet bomb thing was insane and awkward it was unusual and hilarious,then the office showdown and the things getting heat it was great,the whole deaths of police and revenge type thing was dark and brutal the near miss deaths for duo were shocking and amazing.the Dating of Martin resulted in fight and then the escape with the death of lover at last it was dark and shocking then the whole rage mode of Martin and the whole building cracked it was amazing and then the last fight the container escape and the gun fight it was awesome and brutal,the martin's injury or kind-of serious with death or not sure and the conversation of duo at last was emotionally amazing,the ending was mind-blowing,surprising and amazing,the whole movie the duo's friendship was amazingly developed and literally every aspects were enhanced from original it was emotional,dark,sad,too much hilarious,action packed and literally the best cop thriller/comedy ever it's a Masterpiece!"
    },
    {
      "rating": "10",
      "text": "Lethal Weapon 2 made in 1989 by Richard Dinner who's made all four Lethal Weapon movies. Lethal Weapon 2 is by far much better than the original which was good but Lethal Weapon 2 has more magic in it, more action, more style and substance and is genuinely more entertaining than the original. Riggs (Mel Gibson) and Danny Glover (Murtaugh) are back as buddy cops and team up with Leo Getz (Joe Pesci) to bring down a crimeboss and his freaks who are hiding behind diplomatic immunity.  The villains are Lethal Weapon 2's weak spot but besides that Lethal Weapon 2 is a great film and Joss Ackland who's the main villain does okay his role. Patsy Kensit gives a sizzling performance but sadly she's killed off later in the film and the action scenes towards the end of the film are simply just fantastic and a beautiful song near the end when the credits are rolling! I give Lethal Weapon 2 a 10/10 rating for being better than the original and by far the best sequel in the series."
    },
    {
      "rating": "6",
      "text": "Lethal Weapon 2 offers enough to keep fans interested and is a solid sequel but there's too much of a reliance on the action and not a good split of action/drama like the first film. I think there were too overly long car chase scenes in the first hour of the movie and it kind of kills the pacing a bit. And the plot was a bit farfetched for my taste.The addition of Pesci was also a major plus. He really helped add to the dynamic duo of Gibson/Glover."
    },
    {
      "rating": "9",
      "text": "Just As Fun As The OriginalThis sequel has all of the humor, action, and characters that made the first one so good."
    },
    {
      "rating": "5",
      "text": "effective for a definite amount of time..Lethal Weapon 22 And A Half Out Of 5Lethal Weapon 2 is not a fresh take on its previous installment and instead goes old book and somehow manages to charms its way out of it. It is very rare of a feature to deliver a better or similar sequel as the expectations always grows bigger than potential, and in here it does deliver unflinchingly but unfortunately it still doesn't suggest that it's a good feature as the bar was set low from earlier. It is short on technical aspects like sound department and editing, but its action packed choreography is something to look forward to. The script is bolder and stronger than its predecessor; despite of not being fresh, as it isn't afraid to visit places which would be least expected by the audience, especially in its last act where things go down pretty fast.The screenplay by Jeffrey Boam is gripping as it enfolds in each phase of the act and holds the audience on the seat with a decent support from Richard Donner; the director, whose execution isn't something that stands alone but is surely effective whilst creating the anticipated impact. Mel Gibson and Donald Glover's amazing chemistry is what fuels the franchise along with a new additional character of Joe Pesci who is equally good in his portrayal.Lethal Weapon 2 is effective for a definite amount of time when it is showing off its tricks and turns, but beyond that, it fumbles to offer anything."
    },
    {
      "rating": "9",
      "text": "Lethal Weapon 2 is a movie that out bests its prequel and was more action wised than the first one."
    }
  ],
  "recommendations": [
    "lethal_weapon_3",
    "mission_impossible_ghost_protocol",
    "mission_impossible",
    "mission_impossible_rogue_nation",
    "the_rock",
    "lethal_weapon_4",
    "demolition_man",
    "lethal_weapon",
    "tomorrow_never_dies",
    "the_bourne_identity",
    "speed",
    "mad_max",
    "true_lies",
    "john_wick_chapter_3_parabellum",
    "the_bourne_supremacy",
    "shooter",
    "mission_impossible_ii",
    "the_foreigner",
    "patriot_games",
    "angel_has_fallen",
    "the_mechanic",
    "john_wick_chapter_2",
    "heat",
    "air_force_one",
    "predator_2"
  ]
}