{
  "id": 2833,
  "title": "Lethal Weapon 3",
  "starring": [
    "Mel Gibson",
    "Danny Glover"
  ],
  "runtime": 118,
  "genre": [
    "Adventure",
    "Action",
    "Comedy",
    "Thriller",
    "Crime"
  ],
  "description": "Archetypal buddy cops Riggs and Murtaugh are back for another round of high-stakes action, this time setting their collective sights on bringing down a former Los Angeles police lieutenant turned black market weapons dealer. Lorna Cole joins as the beautiful yet hardnosed internal affairs sergeant who catches Riggs's eye.",
  "releaseYear": "1992",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8FnOudDHPOY7MFJnvQMR1qpuyek.jpg",
  "categories": {
    "plot": 4.625,
    "acting": 5.4,
    "ending": 7.2,
    "soundtrack": 8.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 6.666666666666667,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Look, this movie is not a 10, but it's certainly better than the critic or user reviews would have you believe.  My 10 rating is simply to offset some of that BS. It's around a 7, fun and enjoyable buddy flick from one of the most memorable buddy-flick franchises.  Action, laughs, and all around good times.  What kind of movie did people expect?"
    },
    {
      "rating": "10",
      "text": "............................................................................................................................................................great"
    },
    {
      "rating": "10",
      "text": "...............................................................................................................................................................................Great chapter for franchise...."
    },
    {
      "rating": "10",
      "text": "...........................................................................................................................................................Very Good Flick"
    },
    {
      "rating": "9",
      "text": "Veteran police detective Roger Murtaugh (Danny Glover) is only days away from retiring when he and his tough partner, Martin Riggs (Mel Gibson), are roped into an important internal affairs case. Working with the beautiful, no-nonsense Sergeant Lorna Cole (Rene Russo) and aided by the shifty informant Leo Getz (Joe Pesci), Murtaugh and Riggs begin to close in on a black-market weapons operation involving corrupt cop and arms dealer Jack Travis (Stuart Wilson). Even though this is my least favorite of the series, it;s still a very fun and awesome. I'll give Lethal Weapon 3 an A-."
    },
    {
      "rating": "3",
      "text": "either non-working or all out of ammo..Lethal Weapon 31 And A Half Out Of 5Lethal Weapon 3 seems an unnecessary installment in the franchise; a decision taken carelessly with nothing but box office in mind but frankly that audience is much smarter that \"good cop bad cop\" routine. The humor is added in here to lighten things up but it is added forcibly with an amateur editing on its side, directing the whole franchise towards the commercial cinema where the big explosives brings big bucks at the cost quality. There isn't a single piece of art to explore in here for there is too much of everything and no amount of nothing; it is lighter on material no matter how crispy. It falls flat on face in its technical aspects like sound department, choreography and editing. One of the main reason it doesn't work is because it lacks a better threat (the antagonist is undercooked in here) to project the appropriate stake to the audience. The screenplay by Jeffrey Boam is hefty on the failed attempts, for it never actually reaches to that scale and addition to that, Richard Donner; the director, seems to be losing its touch with the execution of it. The performance is still up to the mark by the duo Mel Gibson and Donald Glover in their parallel role and Joe Pesci as a supportive cast.Lethal Weapon 3 is either non-working or all out of ammo as it sweats behind the screen to hold the audience for its runtime let along bedazzle them."
    },
    {
      "rating": "8",
      "text": "Entertaining and fun!it was little degrading compare to prequels but it was amazing movie!the music was amazing,the jokes and punchlines were hilarious it wasn't that much like 2nd movie but it was awesomely fun!the acting was again iconic the new agent Lorna and her relation with Martin was amazing there Scratches and Marks comparison was heated sexy moment and her fighting was surprisingly awesome,the starting bomb scene was hilarious,the retirement thing was striking to martin from start,the chase at start was amazing and the another character hitting on Roger was hilarious,the Leo scenes were hilarious the stadium action and hospital thing was fun,the vest proof bullet was amazing end to action although the antagonist didn't have that impact to the Duo he wasn't that menacing and fun but the shootout and actions were awesome,the kid shootout and death was dark and disturbing the impact on Roger and the later emotional conversation with Riggs was amazing,the both starting and later headquarter's break-in of former cop was intense and the shootout resulting in the death of young police was disturbing and the chase with bike was amazing,the ending fight and the Riggs getting insane burning everything was awesome the Lorna's taking bullets was literally shocking and heart-breaking it was like no not this time but then the ending with sweet moment by Riggs and Lorna it was amazing,the retirement postponed scene was great,the ending was amazing and love the post credit scene the bombing and \"i am too old for this Sh!t\"by both it was hilarious end!Overall it was entertaining and fun movie not great as prequels but it's amazing movie!"
    },
    {
      "rating": "5",
      "text": "Lethal Weapon 3 is easily the weakest in the franchise. It's not a terrible movie; there are some decent laughs to be had and some passable action but nothing to match the highs of the first two films. Ultimately, Lethal Weapon 3 is a bit disappointing."
    },
    {
      "rating": "5",
      "text": "Strong performances by the cast despite a disappointing lack of Pesci but the plot is very forgettable and it lacks the spark that made the first film so good."
    },
    {
      "rating": "10",
      "text": "Infelizmente esse terceiro capítulo que é excelente foi muito subestimado pela crítica.\rNovamente Riggs e Murtaugh estão na área,Mel Gibson E Danny Glover novamente arrasam na atuação,Excelente Filme Joe Pesci está ótimo e Rene Russo arrasa!!!"
    },
    {
      "rating": "10",
      "text": "............................Extraodinária................................... parte ........................................ da Excelente..................... Máquina Mortífera"
    },
    {
      "rating": "6",
      "text": "DisappointingIt still has strong performances and fun action, But Lethal Weapon has caught sequelitis."
    },
    {
      "rating": "4",
      "text": "This film is the third in the \"Lethal Weapon\" franchise and takes us on a new adventure of the two most unorthodox police officers: Sergeants Roger Murtaugh and Martin Riggs will investigate a crime that leads them to discover that there is someone inside the police force who it is diverting seized weapons and ammunition destined for destruction in order to sell them on the streets.Personally, I think this film has managed to stand up to the two predecessors. There's a lot of good material here and the film seeks to innovate and keep the audience's interest: there are new characters and the film doesn't seem like an excuse for impressive and endless scenes of action, fights and shootouts. Still, it sins for not having a story as convincing, interesting and well written as it should. Confused, at times disjointed and illogical, the plot does not sustain the film and only with great generosity do we give the film the indulgences it needs to function.The cast counts, of course, with the collaborations of Mel Gibson, Joe Pesci and Danny Glover, among other actors. Glover is very good, and the character receives, for this film, an additional dose of dramatic charge. Murtaugh never looked so tired and worn out. Gibson gives his character a less explosive tone: if in previous films Riggs seemed to be on the verge of a nervous breakdown, here he manages to have a rational, coherent train of thought, a capacity for strategic action. Pesci stops being the franchise's goofball and starts to collaborate, actively and even usefully, with the cops he's become friends with. The film also features Rene Russo, an actress of great ability who gives life to an agent of Internal Affairs, in charge of an investigation that will end up collaborating with Riggs.Technically, it's a regular movie. The bet goes to the special effects, visuals and sound, which are really good. The sets, as well as the costumes, fulfill their role well and the cinematography doesn't stand out, but it doesn't look bad either. The soundtrack, I confess, didn't particularly catch my attention."
    }
  ]
}