{
  "id": 3626,
  "title": "Letters from Iwo Jima",
  "starring": [
    "Ken Watanabe",
    "Kazunari Ninomiya"
  ],
  "runtime": 141,
  "genre": [
    "Action",
    "Drama",
    "War"
  ],
  "description": "The story of the battle of Iwo Jima between the United States and Imperial Japan during World War II, as told from the perspective of the Japanese who fought it.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kZokxQtzMPURvijWYFuvh1fAvnv.jpg",
  "categories": {
    "plot": 7.761904761904762,
    "acting": 8.272727272727273,
    "ending": 6.833333333333333,
    "soundtrack": 10.0,
    "cinematography": 6.666666666666667,
    "familyFriendly": 3.0,
    "funny": 0.0,
    "action": 7.875
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A great message, and a lesson to be learned about the human condition, a truly masterpiece."
    },
    {
      "rating": "8",
      "text": "Not everyones cup of tea.. I don't mind subtitles, and the story was fantastic from a Japanese point of view. Great action scenes, directing was to perfection. It is the best film I have seen so far in the last year."
    },
    {
      "rating": "10",
      "text": "Flags of our Fathers gave us the first, if expected view of Iwo Jima in the 21st century. Letters from Iwo Jima totally rewrites Flags of our Fathers and helps us to truly understand our enemies better. Two of the main characters actually understand their enemy, but it is a shame that the same could not be said about a few of the American troops in the film. The haunting scene with Sam and Baron-Nishi is utterly heartbreaking; especially with the revelation of the letter. That scene alone deserves best picture, but the twist into Japanese culture will undoubtedly change many peoples' minds about the Pacific Theater. They faught for the same reasons we all do; for their country, leader, land, religion, people, children, wives, each other, and the protection of their culture. 'If you don't see at least two sides of a story, you may as well be blind' as I always say, and Letters from Iwo Jima delivers what I've been dreaming for in that regard."
    },
    {
      "rating": "9",
      "text": "I was surprised at the fact that an Americal took this film. This movie was not able to be taken without the ability of seeing its own country from a third person. Probably such an ability should have been forming a strength of the U.S. The fact that Eastwood took the film cannot but eliminate Japanese streotype againt the U.S. even though Steve keeps his stereotype throughout a lifetime."
    },
    {
      "rating": "8",
      "text": "The Gut wrenching companion piece to Flags of our father succeeds at showcasing the misery of war, and a few unique twists into reluctant sacrifice and hardcore nationalism. I hardly think it's anti-american, but I'm a little surprised none of our WWII veterans have raised their hands in protest of this film yet."
    },
    {
      "rating": "9",
      "text": "This is a great movie that flawlessly communicates the helpless situation of the Japanese in the battle. Clint Eastwood does a wonderful job once again, fearlessly and fantastically portraying the \"enemies\" side. Although not quite as heartbreaking as Million Dollar Baby, Clint Eastwood pulls through with a great movie."
    },
    {
      "rating": "10",
      "text": "Absolutely amazing film, I cannot find a single flaw! For once we get to see war from the enemy perspective, and that is what made this film great. There is nothing more to say, amazing movie without doubt.\r To the people who gave it a 0/10? Get over yourselves, imbeciles, review the movie itself, and don't base it on your opinions on the Japanese. Your reviews are invalid."
    },
    {
      "rating": "9",
      "text": "Shows the true brutality of war. Most of this idiots act like they know a thing or to about war. They weren't the only one to commit war crimes. Even America committed some. And to act like that Japanese soldiers have no emotion is just sad.  Just like it's sister movie Flags of our Father, the movie is very close to reality and shows the true colors of war."
    },
    {
      "rating": "10",
      "text": "Never wait, but really loved it, there is no film more beautiful and exciting than this masterpiece, Eatswood amazed me every minute of this epic work. The film works perfectly alone, without having seen 'Flags of Our Fathers', but obviously you can see its parallels. The fact that these characters fill us more, and connect more with them, do we show more interest in them and their stories. We can even say that some stand out above the rest, as for example happens to the character named Saigo, who gives life to a young Kazunari Ninomiya, and that is simply superb Internet, serving as a link between the other characters, including that of Watanabe  Ninomiya protgoniza one of the most emotional moments of the film, near the end, and one of the few in which sounds wonderful music by Kyle Eastwood and Michael Stevens, who is close to what Clint Eastwood composed for some of his films, but perfecting it and making a score easily recalled and full of emotion. Yes, it sounds very occasionally, as the film seeks at all times not to fall into sentimentality, and shun all emotion, but it is telling us is terrible and emotional. But emotion is contained, that is breath, and as only the masters know show.\rEastwood (or Alejandro Gonzalez Inarritu for Babel) should have won the Oscar for best director. Scorssese maybe gave us the best movie of the year for The Departed, but the way this work Clint work is far superior to that of Martin, seeing it well I think that's clear but we can not fix that.\rWell this is one of the most beautiful and amazing movies of the decade 2000, if you have not seen, you have to see it.\rNot to be missed."
    },
    {
      "rating": "10",
      "text": "One of the best war movies ever. This movie is so inspiring and sucks you in emotionally. I highly recommend it. I absolutely loved this film. The character development is great and so is the acting and directing."
    },
    {
      "rating": "10",
      "text": "This movie is lovely. It's not conventionally nice and fun to watch as escapist entertainment (duhhhrrr - it's a war movie, guys), but its message is original and not at all biased to either side. It simply seeks to tell the war from another perspective. The emotional punch that Eastwood brings to all of his films is most carefully channeled here, as the characters are well-drawn and their various fates are believable.I guess Eastwood's and the screenwriter's best idea was to make the Japanese human. Not angels, not demons, just people. The Japanese and the Americans both still have skewed ideas about this war, and the movie avoids this cloud of romanticism and brings a breath of fresh air to those who like thoughtful movies, and prefer reality overt romanticism about war. There are very few movies like it. No I don't think it's exactly how it happened, but it takes the war movie genre and injects some well-needed humanity into the side that is most often demonized."
    },
    {
      "rating": "10",
      "text": "Great movie.  I am a huge fan of Clint Eastwood, and he did not fail to impress.  This easily ranks as one of my top favorite movies.  This movie has fantastic screen-play, great characters, and not to mention, a very emotional storyline.  And watch the movie with English subtitles (original Japanese voices), it adds much more to the movie."
    },
    {
      "rating": "9",
      "text": "I swerved this movie for a long while after watching the appalling cliched sentimental mess that was Flags of Our Fathers. I am pleasantly surprised that Letters From Iwo Jima is among the best WW2 movies I have  seen,  combining an authenticity, attention to detail and even-handedness that is highly unusual. Provided that its accuracy is verifiable, it is virtually faultless."
    },
    {
      "rating": "10",
      "text": "Letters from Iwo Jima is a realistic portrayal of the Japanese in WWII. It also shows how in war, there is no definite \"good guy\" or \"bad guy.\" It's all about perspective and Clint Eastwood directs such in a way that is almost immaculate. It's a film that makes you think, but it is very violent, disturbing, and sad. Although what else would you expect from a war movie in which you know the overall outcome?"
    },
    {
      "rating": "8",
      "text": "A truly emotional and gripping movie, with an interesting plot perspective not typical of most American movies. With Letters from Iwo Jima Clint Eastwood does something special, he captures the emotional side of our enemy."
    },
    {
      "rating": "10",
      "text": "Mesmerizing. With Letters from Iwo Jima Clint Eastwood has something special. But you know, only if you're into awesome story telling, awesome directing, awesome acting and awesome writing."
    },
    {
      "rating": "9",
      "text": "Clint Eastwood's 2006 film \"Letter From Iwo Jima\" is a companion piece to his earlier film \"Flags Of Our Fathers\". It centers around the exact same events in \"Flags\", but the perspective is switched towards the Japanese army this time. One of the questions I had going into \"Letters\" was - is it better than \"Flags\". In short, yes. I found \"Letters From Iwo Jima\" to be an unbelievable piece of film that, I feel, every American should get a chance to watch. One of the greatest aspects of the film itself is the film's screenplay, which is written almost entirely in Japanese. When I initially found this movie to be almost entirely in a different language, I worried that this quality would impair my ability to sympathize with its characters. I was wrong. I found this film's characters perfectly written and easy to sympathize and care for. The acting also helps with character development in this film. Ken Watanabe plays General Tadamichi Kuribayashi, probably the greatest character in the film. Watanabe's portrayal of the General is so well-crafted that you just can't help but have an immense amount of compassion for him. In a visual sense, \"Letters\" utilizes the same sort of bleak and grainy style that was present in \"Flags\", and this (once again) really helps add to the underlying realistic and grim tone. Eastwood's expert directorial work also shines throughout this film. Overall, I found \"Letters From Iwo Jima\" to be an incredibly well-made and poignant war drama."
    },
    {
      "rating": "5",
      "text": "I was loving this movie. It was truly refreshing to see a crucial WWII battle from the Japanese point of view. In this film we see Japanese soldiers behaving both honorably and horribly. We see Japanese soldiers with a love for both honor and life. We also understand that so many suicides happened out of fear of their peers and officers. But then we see two American soldiers murder a pair of the few Japanese soldiers who actually surrendered on Iwo Jima. This is a such a complete lie that it instantly ruined the film's and Eastwood's credibility for me. Read any accurate history about this conflict and you'll discover that Japanese soldiers who actually did surrender were astounded by the compassion of the Americans. They had been taught to expect the worse. Yes that was the Japanese propaganda given to their soldiers. But our very own filmmakers feel compelled to propagandize the brutality of America. It's sadly ironic that a country that provides a director the freedom to combat propaganda chooses his medium to propagandize himself. This was and should have been a great film. It dies, like so many of those who committed suicide on that island, in a lie."
    },
    {
      "rating": "10",
      "text": "My first reaction to this movie was I loved it.In fact I think it may go into my list of the 5 all time best movies ever made.That is if,its as the title infers, that it is truthful. I like any good audience member come to a film as though I were a jury member and were to look at something, as much as we can as though it were a blank slate.So as the title and opening scene suggests I am seeing a film based on letters from the Japanese home based on their real experiences fighting at Iwo, not a Hollywood writers construct. I am always looking for authenticity at least in the human experience. At that level I bought the film hook line and sinker.This goes to how extraordinarily well the film is acted directed and cut.(Spoiler) I balked at the American GIs killing the two POWS, and the moments when the General asks his fellow officer to lop off his head and at the last moment the young officer is shot and killed. The final scenes however come back and save the picture from Hollywoods almost constant insistence for going over the top.As a man born just after WWII and an American and a fellow who met and talked with our soldiers who went through and lived the Batan Death March horror , my view of the Japanese military borders on real hate and when you throw in the hell of Nanking, moves into loathing..I understand the ancient codes of the Samurai, much of which is too be admired and emulated.When that code looses all humanity or compassion and it turns into mass suicide it is totally corrupt.The general fights to win at all cost as though leading his men to certain death by delaying the end of the battle or conclusion of the war has any real chance when he knows it does not.The story I have heard of the last days of the battle for Iwo were a relentless artillery bombardment and then the ghastly business of US Marines having to go in with flame throwers cave by cave.While there were some Bonsai charges thats not the way the battle ended. To the larger issue ,is it a revisionist propaganda film? It is when you realize that all human beings for the most part are not devoid of human decency and we need to be reminded of that.The charge may have some validity when it shows Gis killing two POWS and Japanese lending comfort to an American GI. Japanese barbarity across all fronts without exception is notorious.On the other hand I think it can be said most Germans and Japanese were not clamoring for war or desirous of genocide or the barbarity which became the status quo. It was created by some very twisted and sick leaders.Its not like we US citizens are by birth immune from it.My God we are beginning to accept war under false pretense and torture as acceptable. This film challenged me to think about the Japanese side more compassionately. It moved me and it is incredibly good on many levels and I think its a good counter point to a lot of our sides propaganda.I am however still uncomfortable with the implied lie that it is based on documentary evidence .That will take some further research on my part.As an artistic and fictional film made to get over a point I think it has all the markings of a great film.As an actor I can say the acting work in all cases is stellar.From a film makers point of view the script is good in relation to pace and action but a little lacking in quality of dialogue,cinematography excellent,The incredible use of color which almost fades into black and white is Iwo Jima.The sound is great dialog is crisp and center,surround is effective and well balanced. The editing is compelling without any ham handed smash cutting.The acting and direction superb,the officer with the death of his horse,the reveal of the of the labeled zealot,the confession of the general who wants to live,the perfectness of the custom radio broadcast song, all delicate and deep with great power. Costumes effects and stunts real without hokey cliche,the bombing runs about as good as it gets.Overall maybe its the power of the Japanese culture or the theme maybe the superb work of all the craftsman , the best thing I can say about this film is, I felt honored to watch it. Whether it is a documentary or a artwork it moved me.That after all is the job of the great film maker.Congratulations Master Clint Eastwood."
    },
    {
      "rating": "0",
      "text": "Clint Eastwood somehow over looked the fact that From the invasion of China in 1937 to the end of World War II, the Japanese military regime murdered near 3,000,000 to over 10,000,000 people, most probably almost 6,000,000 Chinese, Indonesians, Koreans, Filipinos, and Indochinese, among others, including Western prisoners of war. This democide was due to a morally bankrupt political and military strategy, military expediency and custom, and national culture (such as the view that those enemy soldiers who surrender while still able to resist were criminals). How ridiculous to even make such a movie."
    },
    {
      "rating": "1",
      "text": "Fantastic yarn by Clint Eastwood about Japanese compassion at Iwo Jima as he rewrites history.  These are the historical facts in that we created the monster.  In 1894 we forcibly make Japan enter into an alliance to open their ports to the U.S. and Great Britain after a 200 year absense of visiting Japanese soil.  Humiliated they agree as they do not have the technology to match up with the West.  Japan then sends their best 150 young minds to the U.S. and Great Britain to learn modern technology.  Among these is a young Samarui name Lt. Toga.  He studies in Great Britain and adopts the ruthless agenda of Admiral Nelson in show no mercy to your enemies.  Japan then becomes an industrial power as we teach them our technology.  In 1905 Japan intends to invade China and Korea who are defenseless.  To do so they must defeat Russia.  Admiral Toga in 1905 springs a SNEAK ATTACK against the Russians in the Battle of Port Arthur without announcing WAR on Russia.  The American press lauds Japan and calls it a stroke of genius as Japan is our ally.  The Japanese are ruthless as they crush their enemy.  35 years later the U.S. doesn't find it so amusing when they SNEAK ATTACK Pearl Harbor where again they show no mercy.  But I guess Clint feels they discover God and change their stripes at Iwo Jima.  Nice story if you want to believe it???"
    },
    {
      "rating": "0",
      "text": "Wonderful movie if you love rewriting history. Unbelievable and insult to our brave men and women who died during WW II. Japan has a history of sneak attacks long before Pearl Harbor in 1941 as they did the same thing in Port Arthur to the Russians in 1905. And 36 years later they pull this stunt again. But leave it to Clint to portray how honorable this nation of Japan truly is. I guess according to the left wing liberal Eastwood America is the bad guys. What a joke!"
    },
    {
      "rating": "0",
      "text": "Just amazing how Japan, a Sneak Attack nation, 65 years later can be reinvented with honor in that they were the good guys.  Too bad we can't ask the surviving parents or the spouses of those who were killed by their infamy on December 7, 1941 or the other Asians who suffered a similar fate in Japan's March of Infamy.  Why does Hollywood insist on revisionist history.  These were bad people who had no regard for any other life other than their own.  They were slightly above today's terrorists who have no regard even for their own lives.  This is a travesty to the brave men who died because of this sneak attack that plunged us into war on a day that will live in infamy forever.  What's next Hitler for the Puliizer Prize for humanitarism?  Revolitng."
    },
    {
      "rating": "0",
      "text": "It amazes me how the American public can buy into propaganda.  I saw the movie and as a work of art it is pretty good.  But the story it tells is more fiction than fact having a loved one who participated in the event.  But why should that stop a liberal Clint Eastwood from rewriting history?  Time heals all wounds and it is nearly 70 years since the event took place.  Most of our brave American men are now presumbably dead and have no way to respond to this attrocity portraying the Japaneese as the good guys fighting with honor.  What is so bothersome is that Japan has a history of Sneak Attacks long before Pearl Harbor.  In 1905 it is true that the sandbagged the Russians at Port Arthur and then planned to destroy their Navy again after the initial Sneak Attack which they were very successful in doing.  This led us into WW I.  HIstory repeated itself on Dec. 7, 1941 a day that used to live in Infamy, that is before Clint Eastwood decided to change things up?  If you don't learn from history we are bound to repeat it.  I have to laugh as we now commence wars (i.e. Iraq) by asking we are going to bomb you on Monday is that good for you?  Can you imagine the world's outcry if America ever Sneak Attacked anyone?  But I am only someone who is aware of the terrible things that the Japanese did to our boys at Iwo Jim;  but who am I to argue with Clint Eastwood how honorable the ENEMY was?  If you want to buy into this propaganda then by all means enjoy the movie.  As I said it was a good movie from an artistic point of view and on that there can be no mistake.  But to rewrite history and have people feeling sorry for the truly bad guys is just a bit too much."
    },
    {
      "rating": "0",
      "text": "I served as the Commanding Officer of the U.S. Miliatry base on Iwo Jima in 1971-72. I have been in the caves throughout the island and I have the original translations of Gen Kuribayshi's letters to his wife and children. I can tell you that the only historically correct fact in this movie is General Kuribayashi's name. This was a very disappointing film. It did not accurately portray the magnitude of suffering of the 21,000 Japanese who died on the island, nor the extreme difficulty encountered by the Marines in crossing the beach. Anyone who has been to the \"Black Pearl\" and walked the soft sand on the beaches will know the difficulty of moving any type of vehicle out of the clear line of fire from Mt. Suribachi. The scene wherein a horse was galloping across the black sand was laughable."
    },
    {
      "rating": "2",
      "text": "I saw both Flags and Iwo Jima. Boy do you liberals automatically buy into Clint's revisionist history. From an artistic point of view the movies are both quite good. But when the subject matter is twisted and manipulated to serve left wing purposes then take it with a grain of salt which is exactly what I did."
    },
    {
      "rating": "2",
      "text": "Chade you're right in that Iwo Jima helped us understand our enemy better. They had nothing but love for our G I's. What nice people Clint showed us with their kindness and humiltiy. Hell, we should have lost the war because we would have better off. Imagine us Sneak Attacking those nice Japanese at Pearl Harbor. And shame on us in that we actually thought they started the war? I guess the tens of millions they murdered along the way in reality must have committed hari kari. I just love how Clint rewrites history, don't you?"
    },
    {
      "rating": "3",
      "text": "The movie glorfies the Japanese Imperial Army, one of history's greatest evils.\r Ask the 1.3 billion Chinese what they think of 'Japanese Valor' - Specifically the 320,000 killed and 30,000 women raped in Nanking (today's Nanjing)...Or the Koreans and their feeling about the annexation of Korea for nearly 100 years. To produce a movie like this regarding Nazi Germany would be unthinkable; but then again, Americans have little thought for non-whites. - they are not really human anyway and their tragedies at the hand of Imperial Japan is acceptable..Hollywood makes a movie about the enemy killing Americans (the enemy's point of view)- Its just like watching CNN International but with more blood and gore.\r Maybe the Japanese will find this inetersting; but the rest of Asia who suffered under Japanese atrocities will not - and if we did watch, we'd cheer on every Japanese death."
    },
    {
      "rating": "1",
      "text": "Either this is one of the all time overrated turkeys or somebody screwed up the subtitle translation on the print I saw. The final jaw dropper for me was \"I have to think it was a shame we lost our fleet\", and I had to walk... and I almost never walk. Not only was the color miserably bleached, so were the performances, the drama, and everything else a movie is suppose to be. I can only hope this films mindbogglingly positive reception doesn't encourage Clint to use his cliched, aw shucks approach to make nice the Japanese rape of Nanking."
    },
    {
      "rating": "0",
      "text": "Nothing but lies. The Japanese never acted honorably or with integrity. The saddest thing is that people (mostly the younger generation) will watch this movie and think it is true and like a documentary. Nonsense! This movie is nothing but dramatic license liberally and grotesquely utilized in order to sell movie tickets. Hopefully people will be smart enough to do their own research so that they can learn what true barbarians the Japanese were and still are! Somehow, I seriously doubt that."
    },
    {
      "rating": "3",
      "text": "Boring script, flat characters and an ungracefully superimposed message. what a disappointment."
    },
    {
      "rating": "4",
      "text": "I"
    },
    {
      "rating": "9",
      "text": "One of the best war movies that has come along for a long time. It truly shows the despair and sorrow in the Japanese soldiers that didn't want to participate in the war; ordinary people with ordinary jobs. Superb acting, superb directing, superb cinematography: Clint Eastwood has made another masterpiece. Those out there that get scared away by the fact that they're talking Japanese are really missing something."
    },
    {
      "rating": "9",
      "text": "Clint Eastwood Sinemasının muhteşem filmlerinden biri daha. 2.Dünya savaşına Japonya gözünden bakmak gerekirse muhteşem bir yapım olmuş. Puanım: 10/9.2"
    },
    {
      "rating": "4",
      "text": "As a piece of fiction this movie is just ok, but to try and interpret the enemy 60 years later is a stretch. I am a veteran and no matter what side you are on you are only thinking two things. 1) what are my orders and how do I achieve them? There is no time for contemplation because there is only time for action. If you take time you die. On December 7th the Japanese made a decision to attack us, it was not the other way around. I am sure thousands of innocent fathers, husbands and lovers died because of the bad decision of a few but that was not our fault. We were attacked and 60 years ago this country was not scared to do what it takes to win. The mindset has changed over the decades and now 3,000 people in five years is cause for failure. How many people died at Iwo Jima? Guess . . . . of the 22,000 Japanese troops entrenched on the island, only 1,083 survived. The United States lost a total of 6,825 personnel in the battle for the island."
    },
    {
      "rating": "10",
      "text": "Clint Eastwood released two movies this year about the World War II Battle of Iwo Jima. The first ("
    },
    {
      "rating": "10",
      "text": "The film is amazing and helped us understand our enemy better."
    },
    {
      "rating": "5",
      "text": "I must admit to being more than a little apprehensive about seeing this movie as my family has emotional ties to that piece of volcanic rock in the Pacific Ocean. My uncle, a United States Marine, died in March of 1945 at the tender age of 22 of wounds sustained on that island. Although not expecting the intensity that is the first 15 minutes of \"Saving Private Ryan,\" I must admit to being more than a little taken aback at the lack of horror and pathos that that invasion engendered in the DVD I saw last weekend. Instead, the entire movie seemed to focus around Native American Marine Ira Hayes and his experience on and after Iwo as a flag raiser in that historic second photograph, which ultimately led to his alcoholism and untimely demise. While that flag raising was important, and its politcal ramifications are undeniable, entire movies have been structured around the premise of our invasions of foreign soil. Witness \"The Longest Day.\" Iwo Jima, Tarawa, Guam, Guadalcanal, etc. set the stages for some of the most vicious fighting of World War II, and news photography of those battles horrified our nation, yet they seem to have been relegated to being historical footnotes to the political ramifications of jingoistic symbolism of which some of these battles gave rise to. My uncle died far before his time for much more than that, I trust. If you really want to spare the easy political statement of \"Flags...\" in this time of true heroism, and make a stirring war movie in the process, Clint, how about a take on William Manchester's \"Goodbye Darkness?\""
    },
    {
      "rating": "6",
      "text": "this movie was all right, but the first 15-30 mins. were really boring."
    },
    {
      "rating": "8",
      "text": "Strong movie with near perfect cinematography, but a bit too long-winded. It didn't really need 144 minutes [Unkto humanize the Japanese soldiers and make their little point about the Japanese cultural shift from Chinese neo-Confucianism to American individualism. The script could have been a little tighter."
    },
    {
      "rating": "10",
      "text": "A fantastic film. It feels like a vintage Akira Kurosawa film, with a slightly slow pace which takes time to allow its characters to reflect, while also not neglecting sporadic, chaotic action scenes throughout the film. To those that say it is revisionist, I disagree. The film does an admirable job of showing the militaristic fascism of the japanese while also not demonizing them. There were only a few hundred japanese left alive out of 22,000. Franklly, I do not believe that THAT many of them were suicidal fanatics. Instead I do believe that many Americans killed prisoners out of fear, anger or whatever. It does not make America bad, only those soldiers. Those soldiers are the same in any war, which is Eastwood's entire point. There are slight tweaks to history, for example, where the officer brings his horse to the island, it was actually left in Japan, but in my opinion that enhances the story. A great film."
    },
    {
      "rating": "8",
      "text": "The best movie about the fighting. Great to get a perspective of the other side."
    },
    {
      "rating": "10",
      "text": "This is the one of the finest anti war film I've ever seen, I don't care what those narrow minded people like Steve said, I personaly enjoy it very much ."
    },
    {
      "rating": "10",
      "text": "This is simply one of the most moving and effective war movies ever made. Everything from the script, the cinematography, and Eastwood's masterfull direction makes this a war film not to be miss."
    },
    {
      "rating": "10",
      "text": "Believe me - this is one of the best war films of all time. It fully captures the anxiety of war in a way that few films have been able to achieve. The script, direction, acting and pacing are all flawless."
    },
    {
      "rating": "10",
      "text": "I am rarely sucked into a movie so emotionally as this. It is supreme in its message as a war film, and you cannot help but feel for the characters as if they were real people. I felt a knot in my throat by the end of the movie. Extremely well done and highly recommended to anyone who is even slightly interested. You really get a feel for the Japanese culture at the time and the struggles and dilemmas these people had to endure."
    },
    {
      "rating": "10",
      "text": "So true. for one time, the story not from the north American side where they always have to save the world. A big farce indeed that historic moment for the American where everyone had been long forgotten now. Tragic Japan ! A very very good movie, directed by a very good Clint Eastwood. Not to be missed."
    },
    {
      "rating": "6",
      "text": "It's OK, I guess, but so much of the characters and dialogue are stilted that were the film in English I doubt it would be getting so much praise. And do we really need another film about WWII even if it is from the point of view to humanize the \"enemy\"? Why in the midst of a very questionable invasion/occupation of Iraq are we still seeing so many films about the only \"just\" war of the 20th Century?"
    },
    {
      "rating": "9",
      "text": "Somewhat disjointed at times but thoroughly enjoyable and thought-provoking. This film is all the more appreciable if you come from a Japanese background, or possess enough knowledge of the language to get past the sometimes contrived subtitles. Masterfully directed, and a very fitting film to show the human side of war."
    },
    {
      "rating": "9",
      "text": "To Asian P.-Japanese annexation of Korea lasted from 1910 to 1945. Maybe he is confusing Korea with Taiwan (but he would still be wrong). China, Korea, Taiwan are three entirely distinct, separate nations-they in no way present a united perspective on a given topic. As for the movie itself, it's not as good as either Saving Private Ryan or The Thin Red Line, but still pretty good."
    }
  ]
}