{"id": 2760, "title": "Liar Liar", "starring": ["Jim Carrey", "Maura Tierney"], "runtime": 86, "genre": ["Comedy"], "description": "Fletcher Reede is a fast-talking attorney and habitual liar. When his son Max blows out the candles on his fifth birthday he has just one wish - that his dad will stop lying for 24 hours. When Max's wish comes true, Fletcher discovers that his mouth has suddenly become his biggest liability.", "releaseYear": "1997", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/p1habYSdC7oD3WygQ5lynU5G5rV.jpg", "categories": {"plot": 7.166666666666667, "acting": 7.909090909090909, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 8.076923076923077, "action": 8.0}, "reviews": [{"rating": "10", "text": "Great Movie Love Jim Carry Jim Carrey's Best performances ever made. Liar Liar is a whacky and fun movie.  but when you put a comedic actor like Jim Carrey, it's something else.. It somehow manages to work with the movie, it's a slapstick funny comedy."}, {"rating": "9", "text": "Liar Liar is an outstanding comedy. Jim Carey gives one of his best performances of his career. A movie that you won't stop laughing from start to finish with a story you will cherish."}, {"rating": "10", "text": "According to an interview with Jim Carrey, he says that the gag of Fletcher chasing his son as \"The Claw\" was something Carrey's father did to him and his siblings"}, {"rating": "10", "text": "Fletcher: You had sex with her every time you met, didn't you? DIDN'T YOU? LIAR!Dana: He's badgering the witness!Judge: It's his witness.Fletcher: You slammed her! You dunked her donut! You gave her dog a Snausage! YOU STUFFED HER LIKE A THANKSGIVING TURKEY![Makes gobbling noises while pushing himself against the table]Kenneth Falk: Alright! Alright, it's true, okay? I humped her brains out! There, now ya happy?[awkward silence]Fletcher: No further questions"}, {"rating": "10", "text": "&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;$$$$$$$$$$$$$$$$$$$$$$$$$$$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\"$\""}, {"rating": "9", "text": "I always have had the opinion, that the British have an awful, dry sense of humor tainted by their inherent depression from living in one of the worst places on Earth. Carry is a comedic genius, in that he sees and creates humor in any context, taking life lightly and laughing in the faces of those who are burdened by their serious, depressive, british lives, farting in their very faces. And this is certainly his best movie."}, {"rating": "10", "text": "This is Jim's funniest movie. The screenplay is brilliant as is Jim's acting. There is plenty of physical comedy & the actor that plays Jim's son is adoreable."}, {"rating": "10", "text": "Ihihihhiihihhiihhihiihinin,,,,,,,,.......$$$$$$$$$$$$$$$+×÷=:::::::::♤♡◇◇♧{}[]¿¡》《 •°⊙⊙☆▪○●□••●○●●●■"}, {"rating": "9", "text": "++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"}, {"rating": "9", "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》********************************************************"}, {"rating": "10", "text": "Jim Carrey is one of the funniest men alive, and this movie displays his talent for all to see! Carrey just goes all out... anyone whose brain is not in a jar will laugh til it hurts watching Liar Liar. COMIC GENIUS!"}, {"rating": "10", "text": "Jim Carreys' best work, no matter how many times I see it, it never ceases to make me laugh."}, {"rating": "10", "text": "▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆▪☆"}, {"rating": "9", "text": "This is one of those movies that are perfect for their protagonist. Jim Carrey is the one for it, being able to show his full potential in comedy."}, {"rating": "9", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》●》●》●》●》●》●》●》●》■》■》■》■》■》■》■》■"}, {"rating": "9", "text": "*\"*\"*\"*:**:*\"*\"*\"*\"**\"*\"*\"*\"*\"*¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"}, {"rating": "8", "text": "As star Jim Carrey fights with a blue pen in his office, we realise the comedy gold that only Carrey can bring to any scene, no matter how trivial it may appear or how ridiculous the premise is, his energy and combination of appealing to all audiences is unmatched, his role in the simply premised Liar Liar just solidifies this opinion. He plays a hotshot lawyer Fletcher who lets his young son down time after time, Fletcher is recently divorced as well, but can never spend quality time with young Max (Justin Cooper), but on the young boys birthday, he makes the wish of all wishes that no human could live without, the ability to lie. This naturally gives him a very bad day in court, where lying is second nature, but the better instances in the film come from the various situations that Fletcher runs into in his day of telling the truth, his above mentioned fight with a blue pen to convince himself it is red, beating himself in a bathroom for no reason whatsoever, they are some of the best laughs of the film, Carrey's unique ability to control each scene with endless amounts of laughter is truly admirable, he shows maniacal behaviour as he prances and shouts his way around a courtroom, trying his best to sabotage his own case. He beats himself up, gets in trouble with the law and continues to try and mend his relationship with his son, telling the truth all along the way.\rThe premise is interesting in the sense that it ushers towards a supernatural element, yet of doesn't necessarily promote this, what it really tries to do is test the relationship that a person holds with various important people in their lives, their boss, family, associates etc, just how much of that friendship is built on trust or more so, lies.\rThis is Carrey's film from start to finish, but Jennifer Tilly gives an appropriate amount of lustful and villainous behaviour as the temptress type mother of Fletchers struggling case in court, while Cary Elwes plays the trying to hard boyfriend of Fletchers ex-wife Audrey (Maura Tierney).\rWhile the deliberate paces creates a predictable finish, Carrey's ability to have diverse expressions and put himself out there into any role truly shows his talent onscreen, especially in such a comical capacity like he is here."}, {"rating": "8", "text": "This movie was very touching. It was very funny and family friendly. I enjoyed the movie especially with the fact that pointed to the profession of lawyers having to lie to get their win and money or allow unjust situations to take place."}, {"rating": "7", "text": "This is probably one of Jim Carrey's whackiest performances ever made. Liar Liar is a whacky and fun movie. It may seem unoriginal, but when you put a comedic actor like Jim Carrey, it's something else. It does get a little too extreme as far as storytelling near the end. Plus, for a movie like this, it's a bit too sexual. Then again, the court scenes in the movie are about a woman committing adultery. It somehow manages to work with the movie, but is too ridiculous. (Which is what the movie is). As far as characters go, I thought they were really good, except for Jerry (Cary Elwes). He was just a bad character to throw into the movie. Overall, it's a slapstick funny and ridiculous comedy."}, {"rating": "4", "text": "Bottom Line: Jim Carrey disappoints as a lawyer/liar in a comedy that throws out much of its potential.\r In most of his films, Jim Carrey makes a show of hyperactivity, and in most cases, itâ"}, {"rating": "7", "text": "Absolutely hilarious film. Jim Carrey is top notch here as the laughs keep coming. Liar Liar is most certainly a hilarious, feel good story. In addition, the bloopers at the end of film ensure that the laughs truly go from beginning to end."}, {"rating": "6", "text": "This lighthearted comedy could've been so much more. It was painfully cliché, the acting wasn't that good except for Carrey and the movie was way too predictable. It wasn't a ad movie, it was just a disappointing one."}, {"rating": "7", "text": "Liar Liar is enjoyable for Jim Carrey fans. For the rest of us, I don't know. The point is... wouldn't you love a liar to at least tell the truth for just one day? Yeah, me too."}, {"rating": "7", "text": "Truth is the best doctrine. The lie has short legs. Or not? Jim Carrey in the role of a lawyer who, because of a birthday wish, cannot tell lies for a whole day, is more over-acting than in his previous jobs (Dumb and dumber, Batman forever). It is one of those cases where you want to lock yourself in a dark room to try to find out why some people consider him funny. You will say."}, {"rating": "8", "text": "this is a..Liar LiarA typical drama theatre script that works on all levels and for everyone; Liar Liar is that rare comedy masterpiece that instead of exaggerating keeps it real and smart."}, {"rating": "6", "text": "Fletcher Reede is a competent lawyer who has learned that lying is easier and more rewarding than telling the truth. This will change when his son decides to ask as a birthday wish that Dad spend at least a full day without being able to lie. A day that will change Reede's life. Or at least that was the intention of Jim Carrey in this deeply beautiful and touching film, where the laughter mingles with the beauty of the love shown by a father who truly wants to regain his family. The script, by telling a morally edifying story in an effective way, can therefore be considered as one of the strongest points of this film.Jim Carrey has achieved here one of his most important successes. With it, he became a consecrated comedian. His performance is truly colossal, there isn't a moment where he doesn't shine, completely overshadowing the rest of the cast, with the honorable exception of Justin Cooper, who gives life to the sweet and innocent son of the lawyer. Some of the scenes involving Reede and Max are worthy of humorous anthologies.Personally, I consider this film as the consecration of Jim Carrey, rather than the most famous and popular \"Bruce Allmighty\", who came a little after. The story is very simple but beautiful, the cast work was very competent, the direction of Tom Shadyac worked well... basically everything was up to the project. It's not an exceptional film, it's not a timeless work of art. It's a film for familiar entertainment, to see and to laugh. If viewed in this light, it's an excellent film."}, {"rating": "7", "text": "It's a good movie, pretty funny, and a good concept. I don't think it is Jim Carrey's best movie but still worth watching if you're bored"}, {"rating": "10", "text": "Probably the funniest movie I've ever seen. Jim Carrey's completely unleashed antics border on insanity. Everyone I know raves about Liar, Liar. Our family owns the video, most have seen it 20 times and we still get a big kick out of it. In fact I think I'll go watch it now!"}, {"rating": "9", "text": "After crap like Napoleon Dynamite and Mail-Order bride, it's good that there are movies like this where you can leave a movie theater or living room with a grin on your face saying \"Damn, that was funny!\""}, {"rating": "10", "text": "Another one of my all time favorites. He should have made a part two to this. I crack up still watching this movie. It's forever funny."}, {"rating": "9", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:(*;*;*;*;*:*:*;\"*\"*\"*\"*\"*\"*\"☆°•☆°•☆°•☆°•☆°•☆°•⊙°•⊙°•⊙°•☆°•☆°•☆"}, {"rating": "10", "text": "Liar Liar is a perfect movie that fit's Jim Carrey in his typically goofy roles and this one is **** good."}, {"rating": "9", "text": "This is a PERFECT Jim Carrey movie. It has a ton of laughs; the premise especially makes hilarious jokes in this movie! It is also touching as well, I love John Debney's scores as well, it's just perfect."}, {"rating": "10", "text": "We can always count on Jim Carrey to give us a classic. Absolutely hilarious and also has a good moral message to it."}], "recommendations": ["bruce_almighty", "the_boss", "yes_man", "dodgeball_a_true_underdog_story", "ace_ventura_pet_detective", "life_as_we_know_it", "along_came_polly", "wanderlust", "anger_management", "ace_ventura_when_nature_calls", "step_brothers", "meet_the_parents", "due_date", "zack_and_miri_make_a_porno", "little_miss_sunshine", "get_hard", "click", "masterminds", "sandy_wexler", "arthur", "little_nicky", "forgetting_sarah_marshall", "the_wedding_ringer", "zoolander", "ted"]}