{"id": 4281, "title": "Life of the Party", "starring": ["Melissa McCarthy", "Molly Gordon"], "runtime": 105, "genre": ["Comedy"], "description": "When her husband suddenly dumps her, longtime dedicated housewife Deanna turns regret into re-set by going back to college... landing in the same class and school as her daughter, who's not entirely sold on the idea. Plunging headlong into the campus experience, the increasingly outspoken Deanna – now Dee Rock – embraces freedom, fun and frat boys on her own terms, finding her true self in a senior year no one ever expected.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/749iUAWQWeutQuTd9excjmigecw.jpg", "categories": {"plot": 2.888888888888889, "acting": 2.7777777777777777, "ending": 4.0, "soundtrack": 5.0, "cinematography": 2.0, "familyFriendly": 3.8, "funny": 3.642857142857143, "action": 5.0}, "reviews": [{"rating": "2", "text": "Ben Falcone directs and co-writes 'Life of the Party' alongside his partner Melissa Mccarthy who stars as a naive housewife suddenly dumped by her husband for a newer model in the form of actress Julie Bowen. McCarthy decides the only remedy for her unfortunate situation is to return to college with her daughter and finish the degree she initially sacrificed to support her family. Melissa McCarthy is a very gifted comedic actress, and I've been a fan for many years now. This movie, unfortunately, does her no favours whatsoever. It is absolutely dire from beginning to end, and I say that with a great degree of sadness and reluctance. It's over the top, saccharin sweet, unoriginal with every cliche in the book shoved down the audience's throat in a vain attempt at garnering some humour. The story seems like a slightly reworked version of the 80's film \"Back to School\" with Rodney Dangerfield which was a lot funnier. Some of the scenes looked like McCarthy adlibbing to save her life, and the camera kept rolling to capture anything remotely interesting. The acting from the younger actresses was quite wooden and seemed forced at times. Julie Bowen is wonderful in Modern Family but was so awful in this I felt utterly embarrassed for her. Perhaps it was the editing or directing, but her role was cringeworthy. Overall, I wouldn't recommend this to anyone but the hardcore McCarthy fans who could basically watch her doing her laundry and be satisfied. I'm truly sorry to say, it's pure drivel, and as one of the best female comedians out there she deserves a better vehicle for her talents."}, {"rating": "5", "text": "By default, this is the best film of the Falcone-McCarthy series (TAMMY is still one of the worst comedies I’ve ever seen). It’s perfectly watchable, well-intentioned and has some heart. The issue is it isn’t very funny, and edited in a way that there’s no beat to allow the audience to laugh. Some members in my audience were dying throughout, others silent. This will be a “depends on your mood” film..."}, {"rating": "3", "text": "Melissa McCarthy keeps teaming up with hubby Ben Falcone as writer/director. Every time the movie's get more self-indulgent and bland. This time she plays a sweet middle-aged mom, who ends up back in college with her daughter. Of course, her character's spunk charms the students (unrealistic), while her positive messages bring heart and hope (painful). McCarthy barrels thru every scene with her typical manic delivery, but it's seldom funny (and there's not much of the broad physical comedy that she does so well). The attempts at making the supporting characters interesting simply falls flat. If you're a middle-aged female McCarthy fan you might respond to the empowerment theme, but if you're looking for laffs…enroll somewhere else."}, {"rating": "3", "text": "Unfortunately for Ben Falcone -- director of films such as \"Tammy\" and \"The Boss\" -- the third time is most definitely not the charm in the case of this third collaboration between the director and his real life wife, Melissa McCarthy. \"Life Of The Party\" is a profoundly unentertaining, tired, and unfocused film that overstays its welcome in way too many ways. With all of the subjectivity of comedy films considered, this movie still just didn't do anything for me on a comedic level, with many of its already unfunny jokes being beaten into oblivion by improvisation and over-explanation. Even as a story, there's not necessarily anything at the center of things here. Is this about Melissa McCarthy and her daughter coming at odds with one another as they both happen to go to the same college? Maybe for the first fifteen minutes before the daughter's suddenly okay with it all too quickly. Is the movie about Melissa McCarthy struggling to keep herself afloat financially in the wake of her divorce? Kind of at the end, but only for about another ten minutes. Is this about her dealing with bullies making fun of her because she's old? Here and there. Stress from school? Two scenes tops. There's not a central conflict here. This has the plot of a bad indie comedy, the look and feel of a bad studio comedy. . .but without any successful comedy of any kind. Ugh."}, {"rating": "4", "text": "The movie is pretty much what you would expect. It's not funny, the acting is average at best, it's predictable and the characters are all very clichés. If you're looking for a fun, mindless, feel good party movie you may like it, if you're looking for an intelligent comedy, you're better off watching something else."}, {"rating": "3", "text": "Life of the Party is the most painful film I have sat through in many years. It’s story lacks any focus or insight and it’s characters are maddeningly inconsistent. It’s direction is practically nonexistent as scenes are never sure of when to end or what they are culminating to. While Maya Rudolph and others are sometimes refreshing, much of this cast provided limited performances. All around, Life of the Party feels like a mess slapped together by people who couldn’t be bothered with ideas of craft.Melissa McCarthy does provide good energy with her positive confidence but it is not enough to carry such a half-baked project. Improvisation can be a wonderful technique for comedy but when a film seems to have improvised its entire production, it comes across as unprofessional and lazy. Ideas, characters and plot points enter and exit this movie with such carelessness that everything ends up feelings like nothing. Sporadic funny moments are nice but do not offset how insulting this whole experience is. Life of the Party is a dump of a film and a waste of time.Writing: 1/10Direction: 1/10Cinematography: 3/10Acting: 3/10Editing: 1/10Sound: 5/10Score/Soundtrack: 5/10Production Design: 3/10Casting: 3/10Effects: 4/10Overall Score: 2.9/10Original Article: https://thefilmguys.blog/reviews/augusts-reviews/life-of-the-party-2018/"}, {"rating": "4", "text": "This is a sophomoric cringe-worthy college comedy you've seen a dozen times before. Written and directed by Melissa McCarthy wife/husband team, so it's hardcoded to be adoring/favorable to Melissa. I'm a mature dude - not the demographic for this \"awkward mom/daughter at college together\" gimmick. The niche demographic will prolly like/love it, but not the mainstream and that's why you see poor ratings. But I have to rate based on me, not others."}, {"rating": "4", "text": "Personally I don't find Melissa McCarthy really funny, especially because her comedy is based on exploiting the stereotype of the fat quirky woman and that's why I always find it frustrating to watch her films because I cannot make any kind of connection with the material and obviously this film is another case in which she limits herself to doing the same thing that she has been doing in the last years.They say that the worst crime of a comedy is when it can not make you laugh. Here is an excellent example."}, {"rating": "2", "text": "Lets just agree that Melissa McCarthy is a new female Adam Sandler and move on. The wholesome friends in this movie are the only thing that really stands out as potentially enjoyable, and even they encourage the obviously emotionally unstable main character into doing stupid things with horrible consequences. I'm sure I laughed at least a couple of times, but most of the \"funny\" moments just made me cringe.Viewed 11/07/2018"}, {"rating": "4", "text": "Almost everyone in my family agrees with this rating. It was bad. Not bad enough though"}, {"rating": "7", "text": "\"Life of the Party\" apresenta-nos momentos engraçados e uma reviravolta maluca que faz os espectadores gritarem.7/10"}, {"rating": "7", "text": "Melissa is a genius. If you don't believe me watch Identity Theft and look for the diner scene. Now, would you go see Einstein speak after he invented the Theory of Relativity? Yes you would. So go see this movie."}, {"rating": "7", "text": "Melissa McCarthy provides laughs, but its not one of her best and tends to miss the mark."}, {"rating": "7", "text": "I saw this with a bunch of ladies and we all really enjoyed it.  A sweet look at being a mother, giving up your dreams and then finding them again after your jerk of a husband dumps you.  Lots of fun along the way as McCarthy and her daughter become college Seniors together.  Everybody learns a different truth from others.  Many funny moments and one crazy twist that had the audience screaming.  Very enjoyable without all the over the top silly/stupid/raunchy stuff that is often throughout McCarthy’s movies."}, {"rating": "8", "text": "I enjoyed the movie overall. Especially the accidental cannabis consumption from the Glaucoma recipient. The entourage with Christina Aguilera was particularly inspiring."}, {"rating": "10", "text": "A unica parte boa do filme é a Xtina, porq o resto é uma bomba, então minha nota é só pra ela."}, {"rating": "7", "text": "O filme fala de uma mãe que segue os seus sonhos e decide se aventurar nos estudos. Apresenta-nos momentos engraçados e uma reviravolta maluca que fez os espectadores gritarem. \"Life of The Party\" é muito agradável e não tem aquele conteúdo estúpido que muitas vezes vemos nos filmes de Melissa McCarthy."}, {"rating": "6", "text": "Seemed quite average, but still it had some decent jokes and it was watchable, basically a movie for just relaxing."}], "recommendations": ["sisters", "booksmart", "blockers", "the_dilemma", "neighbors", "life_as_we_know_it", "that_awkward_moment", "juno", "a_bad_moms_christmas", "easy_a", "the_five_year_engagement", "palm_springs", "i_feel_pretty", "tammy", "hall_pass", "i_give_it_a_year", "no_strings_attached", "little_miss_sunshine", "spanglish", "bad_teacher", "wanderlust", "you_again", "silver_linings_playbook", "friends_with_benefits", "trainwreck"]}