{
  "id": 1884,
  "title": "Life After Beth",
  "starring": [
    "Aubrey Plaza",
    "Dane DeHaan"
  ],
  "runtime": 90,
  "genre": [
    "Romance",
    "Comedy",
    "Horror"
  ],
  "description": "Zach is devastated by the unexpected death of his girlfriend, Beth. When she mysteriously returns, he gets a second chance at love. Soon his whole world turns upside down...",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4ZQ8LoU9SwSxSrmc3aOtHmruk26.jpg",
  "categories": {
    "plot": 6.75,
    "acting": 8.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.636363636363637,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "An enjoyable zombie movie that while some may say it's tone is inconsistent I felt it worked for the the most part.  Though you never know what caused the zombie outbreak you can live with it.  B"
    },
    {
      "rating": "7",
      "text": "Life After Beth combines two of the most overused and dull movie types nowadays, in romantic comedies and zombie movies, and makes a hilarious and heartfelt zombie rom-com. Its not a perfect movie but the fun it has with its premise will allow you to overlook its problems and enjoy your viewing."
    },
    {
      "rating": "6",
      "text": "Aubrey Plaza is hilarious in this movie, as always. Dane DeHaan can never disappoint me either. I especially loved the Parks and Recreation references."
    },
    {
      "rating": "4",
      "text": "In an extremely crowded genre, this movie tries to step out from the crowd but stumbles not too far into proceedings despite Plaza's best efforts."
    },
    {
      "rating": "9",
      "text": "Life After Beth is not your typical romance movie nor it is your typical zombie movie, because in this film there is no build up to the relationship, nor there is a reason for the resurrection. It is caught up between both ideas and executed into this Gothic dark comedy that works and is actually really funny despite some of its flaws."
    },
    {
      "rating": "5",
      "text": "Life After Beth is strange, freaky, and oddly compelling. It's outlandishness is often a turn-off, but I can't help but smile for Aubrey Plaza & Dane DeHaan."
    },
    {
      "rating": "4",
      "text": "If this movie was supposed to be funny - it isn't. I think they were aiming for dry humor, which is unintentionally funny, and this film isn't funny at all. It's not unwatchable but don't expect a comedy."
    },
    {
      "rating": "6",
      "text": "Back to normal is sometimes not good.\r The movie did not reach my expectation, but still I enjoyed watching it. A story like this I never thought would do fairly, a better movie from the average section. I think not without the Aubrey Plaza, she as a Beth was excellent. Not a career defining performance, but funny enough. The story looks only faintly different from other similar films, but a few good scenes saved it. If it had a couple more good jokes and maybe a twist, surely would have been done greatly at the box office.\r There's no surprise material in it, I thinks that's negative about it. Easy to read the situation and predict the story within the first 15 minutes, but the second half was drastically changed its pace as well as the atmosphere in the story. If you've not seen many zombie films, especially comedy ones, then you may find it better than average.\r Definitely a decent direction for a first timer, got a good support from the cast. For a small budget, this is a wonderful production quality. It surely upset you if you expect like 'Warm Bodies' or 'Shaun of the Dead', but if you know all about it before giving a try, the disappointment will be lessened and you may have a decent time pass with it.\r 6/10"
    },
    {
      "rating": "7",
      "text": "Combines 2 overused movies tropes with good performances from a great cast and its actually really funny despite some of its flaws."
    },
    {
      "rating": "9",
      "text": "It's just hilarious.  Lots of situation comedy and great music.  I don't know why but Aubrey Plaza is in a lot of the few great modern comedies."
    },
    {
      "rating": "9",
      "text": "Life after beth is a somewhat re-enacted story but it is very entertaining and has very committed performances by the two protagonists."
    },
    {
      "rating": "5",
      "text": "Aubrey Plaza and John C. Reilly feel quite natural here. Unfortunately the script rarely does, and the quirky premise deserves better than its lacklustre visual component.5/10 [C-]"
    }
  ],
  "recommendations": [
    "delivery_man",
    "the_wolf_of_snow_hollow",
    "keeping_up_with_the_joneses",
    "vamps",
    "the_five_year_engagement",
    "just_before_i_go",
    "the_cobbler",
    "american_ultra",
    "ready_or_not",
    "zombieland_double_tap",
    "the_family",
    "the_babysitter",
    "peter_rabbit",
    "murder_mystery",
    "seven_psychopaths",
    "pitch_perfect_2",
    "sleeping_with_other_people",
    "logan_lucky",
    "tag",
    "deadpool",
    "hancock",
    "barbershop_the_next_cut",
    "palm_springs",
    "mortdecai",
    "dark_shadows"
  ]
}