{
  "id": 4818,
  "title": "Life Itself",
  "starring": [
    "Oscar Isaac",
    "Olivia Wilde"
  ],
  "runtime": 118,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "As a young New York couple goes from college romance to marriage and the birth of their first child, the unexpected twists of their journey create reverberations that echo over continents and through lifetimes.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pE2hxC8bPbIi9tGyhFg5xiFW6dA.jpg",
  "categories": {
    "plot": 9.25,
    "acting": 8.0,
    "ending": 8.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "An uplifting and mesmerizing experience that should change your view of life. You can take Roger Ebert's life for an example, he lived his life enjoying every second of it and fought up to his last day where he had to let go and not because sickness took over him, but because he felt it is the right time. Two thumbs up, and may God bless your soul."
    },
    {
      "rating": "9",
      "text": "If all you like are loud, special effects driven films, you should probably avoid \"Life Itself.\" For the rest of us, this film is well worth seeing. It is a balanced, yet loving tribute of one of the 20th Century's most influential film critic. Hagiography the film is not, highlighting Ebert's many faults along with his achievements. The film includes interviews with his critics along with his many fans."
    },
    {
      "rating": "10",
      "text": "An uplifting and inspirational movie about Ebert's colorful life up to his last day, where sickness did not take over him instead, he thought it was the right moment to let go."
    },
    {
      "rating": "10",
      "text": "Roger Ebert was the first columnist I read as a kid. I read him from 1967 until his death. While in college, in the mid 70s, I created the Film Society at UIC. I wanted to start out with a bang, so I called Ebert to see if he would honor our inaugural screening by introducing \"Citizen Kane\". I was expecting to get the receptionist, but to my surprise Ebert answered the phone. I was a little nervous, but before long he and I were engaged in a pleasant conversation. He took me up on my offer. And though we disagreed completely on \"Citizen Kane\", he came back the following year and introduced \"Nashville\". There is a little part of me that still holds dearly to Ebert's influence. I was always impressed by his passion for the cinema, and his passion for life itself. This is a good, heartwarming documentary. It is a love story of the highest order. It is a shame that it wasn't nominated for Best Documentary. I still miss him."
    },
    {
      "rating": "9",
      "text": "I loved Roger Ebert's writing ... sometimes I still find myself seeing a movie and wishing I could know what he thought of it. The film version of \"Life Itself\" might be even better than the memoir, which often got bogged down in details like what brand of cigarettes were smoked by everyone he knew back in the day. His spirit comes across in the film -- some of his less positive characteristics as well as the ones for which people loved & admired him. The film is almost as much about his wife as about him ... but it's hard to begrudge that since Chaz is a heroic person in her own right."
    },
    {
      "rating": "7",
      "text": "Although I was moved and had a tear in my eye, I could have done with less of the hospital scenes. I don't need to see the feeding hole cleaned repeatedly to get the message of the horrors of cancer and his bravery. That was overdone. Still, I learned so much that I did not know and consider this am essential film for film goers. I do question why Richard Roepert was left out of the film. I recommend the film but I don't think most people are aware how much time the film concentrates\r on his dying days."
    },
    {
      "rating": "8",
      "text": "A touching tribute to probably the most famous film critic in the world, Life Itself takes us through the life of Roger Ebert with contributions from the people important in his life. It's a moving film, especially as it was being filmed during the last months of his life, and covers the ground you'd expect, where it suffers in comparison to a lot of biopics is the lack of much drama in the story. All in all you feel Ebert had an amazing life."
    },
    {
      "rating": "9",
      "text": "Director Steve James has created a haunting documentary of a brilliant, warmhearted, courageous man of letters who lived his life to the last particle and died in bed surrounded by friends. If you want to feel good, stop there.\r Great art should haunt its audience, and I found this film especially disturbing because of its unflinching portrait of the American way of death. However much I admire the protagonist's courage and his family's devotion and the commitment of his caregivers, there is an undeniable grotesquerie to Ebert's protracted ending which is visible from the beginning of this film. It is not for those who believe that virtue should be rewarded in this life, or that celebrity confers immunity.\r Along the way, you will get to know Ebert's stellar colleague and artistic foil, Gene Siskal. Though given less room, Siskal was more than Ebert's sidekick and seems to have lived equally broadly and to have encountered a brisker though no less tragic fate. Also prominent are Ebert's loving family and several of those who helped promote his career or simply stood by and wondered.\r To make a film about one of filmdom's preeminent critics takes a courage all its own. I would say Steve James has succeeded admirably. To criticize a film about Roger Ebert takes almost more hubris than even I can summon, but the only bad thing I can say is that James succeeded unexpectedly in haunting me with his powerful images."
    },
    {
      "rating": "9",
      "text": "My stomach sinks a little when I don't see Ebert's film reviews in newspapers and magazines anymore. As I watched the film, I couldn't help but wonder how he would critique this immaculate eulogy. Pretentious and bloated? Down-to-earth and ravishing? Or stylish and rich in character? The film did not shy away from exposing the big picture. His faults. His mistakes. His strengths. His victories. All are shown and illustrated tastefully, on a fresh canvas dotted with over-arching messages about, appropriately titled, life itself, and many other over-arching themes that transcend the impermanence of human consciousness."
    },
    {
      "rating": "10",
      "text": "Documentary film maker Steve James' story of Roger Ebert's life in a documentary form is the best cinematic experience  for fans and critics to enjoy. Reading his reviews inspired me to explain my feelings and elegant details toward a film in writing; his life is interesting and so Siskels. Grade A"
    },
    {
      "rating": "5",
      "text": "Life Itself is a documentary about the life the legendary film critic, Roger Ebert. The movie is based on his autobiography, which is also titled \"Life itself\". The movie is full of intriguing and personal moments in the life of Ebert and events that led to his death.\r Growing up outside USA, I never watched Ebert's TV shows (\"Sneak Previews\" and  \"At the Movies\") and I never read his critics (on Chicago Sun-Times). This movie shed some light on Ebert's life and showed me why he was such an influential figure.  But at the same time, I could not care about Ebert more than any other successful professional person I know. The movie shows what an exceptional critic Ebert was, and at the same time, shows he was not very different from any other ordinary man.\r If you like cinema and history of it or if you like movies about movies, Life Itself is the right movie for you. Otherwise, Life Itself can be boring and you will leave the theater asking your self \"Why should I care about Ebert?\""
    },
    {
      "rating": "8",
      "text": "A heartwarming, sometimes-heartbreaking, but always-truthful portrait of someone whose considerable influence changed the way we see movies forever. Through interviews with friends, family and colleagues, along with archival shots and exclusive footage of his final days, we learn the about the public and very private sides of Roger Ebert, an inspiring figure whose impact still hasn't been fully measured -- or appreciated -- and not just in the cinematic arena."
    },
    {
      "rating": "9",
      "text": "Siskel and Ebert are in heaven right now still reviewing movies. Life Itself. I like it when Documentary's show you something you didn't really know about, I didn't know Roger was a alcoholic until I watched the Documentary and they is one part in the Documentary when there talked about Gene Siskel death and it was truly upsetting and really powerful that I almost cried and you will too if you get a chance to watch it. The score was so classy and so nostalgic that I loved it."
    },
    {
      "rating": "9",
      "text": "I was wondering what happened to the well-known critic, Roger Ebert, whenever it comes to 2013 and ahead movies. Not seemed to know he was dead in the first place, I decided to watch Life Itself. Wow, even critics have spirits as well."
    },
    {
      "rating": "10",
      "text": "Wonderfully rich in detail and absolutely engaging from start to finish, this is a documentary that does what it can to talk about an individual's life and make it so we totally understand both their 'ins' and their 'outs'. Like the title says, it's just Life Itself. In this case, it's an individual who has inspired multitudes of filmmakers, film lovers, analysts, and writers. My two thumbs are raised up high, one for Mr. Ebert, and one for this movie. Very well done Steve James and company, very well done."
    }
  ]
}