{"id": 1029, "title": "Life As We Know It", "starring": ["Josh Duhamel", "Katherine Heigl"], "runtime": 114, "genre": ["Comedy", "Romance", "Drama"], "description": "After a distastrous first date for caterer Holly and network sports director Messer, all they have is common is a dislike for each other and their love for their goddaughter Sophie. But when they suddenly become all Sophie has in this world, Holly and Messer must set their differences aside. Juggling careers and social calendars, they'll have to find common ground while living under the same roof.", "releaseYear": "2010", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/zLzS2aOqKsS0QvEaY6SfBw4VBqh.jpg", "categories": {"plot": 5.5, "acting": 5.833333333333333, "ending": 4.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 5.6, "action": 5.0}, "reviews": [{"rating": "6", "text": "Better than average. Worse than I thought it would be.Two polar opposites stuck to raise a child. Together. After their mutual friends are killed in a car accident, they're the only option. What else happens is not only predictable, but almost inevitable. I hate to say this, because I love Katherine Heigl and Josh Duhamel, but the script is pretty run of the mill. While the relationship with the child is well-thought out, and though unoriginal, fun to watch, the relationship between Messer and Holly was too quick. You don't go on a date and fall in love. This isn't a Nicholas Sparks novel. Their relationship was too rushed. I'm not sure who to blame here - the writers or the director, for editing out good moments between the pairing. This is aimed at for hopeless romantics (myself included) so maybe it would've been smarter to focus a little more on the couple."}, {"rating": "5", "text": "Life as We Know it means well and it features surprisingly good performances from Katherine Heigl and Josh Duhamel who have excellent chemistry. The film does generate some laughs but falls for the basic Romantic Comedy formula instead of the hopeful premise we had in mind. I give this film 58%."}, {"rating": "2", "text": "The rich are different, but not this different, not this cheeky. We can only hope that life doesn't imitate art, since romantic comedies as we know it, are growing more bizarre with each new entry in a dying genre whose modern-day practitioners have butchered so many hearts on celluloid, we stopped counting, and this latest entry, \"Life as We Know It\", is just one more rom-com that seems less concerned with the mysteries of love than the plot machinations which tears love apart before it even has a chance to coalesce. The rich can't be this twisted, can they? With friends like the Novaks(Hayes McArthur and Christina Hendricks), who needs any enemies? Messer(Josh Duchamel) and Holly(Katherine Heigl) have the worst friends ever, friends that on some level, must resent their single lives and the liberties that goes along with it, especially the liberty which retains them the right to pursue dreams, unencumbered by baggage. He wants to direct NBA basketball telecasts; she wants to expand her bakery into a restaurant, but after Peter and Alison, all too conveniently, die on cue, their baby, the baby of discontent, seemingly, throws a monkey wrench into the career trajectories of Sophie's legal guardians, who are probably the least qualified people for the job: two emotional idiots, too self-centered for child rearing, and too stupid to realize they've been \"punk'd\" from beyond the graves. Why don't they object more fervently to the conditions? Strangest of all, the Novaks have a stipulation in the will that Holly and Messer should live in their house with Sophie, like an arranged marriage, complete with child, which makes \"Life as We Know It\", a rom-com with accidental Indian undertones. If Heigl sang(as she performed \"Bennie and the Jets\" in Anne Fletcher's \"27 Dresses\"), then the film would have the makings of an accidental Bollywood musical. Doomed from the outset, the set-up, singles being so gung ho about moving in together with somebody else's baby, is so hard to accept, since their first date went so horribly wrong. It's not emotional blackmail, the need to fulfill dead friends' wishes, that keeps them together, it's the contrivances set forth by a narrative which isn't altogether different from John Landis' \"Trading Places\". Like Mortimer(Don Ameche) and Randolph Duke(Ralph Bellamy), who both allow somebody equally unqualified(a con-man named Billy Ray Valentine(Eddie Murphy), a financial naif) to take care of their business, their \"baby\", a wager must also have been the inspiration for Peter and Alison's idea to bestow full custody of Sophie to such incompetent parental candidates like Holly and Messer. Life, as \"we\" know it, real life, that is, not the diegetical life which sometimes breed convincing human simulacrum, but more often than not, plays as a backdrop for conceptual \"people\", would entail that some family member from the deceased pair step forward and claim the Novak baby. But \"Life as We Know It\" doesn't want anything to infringe on the supposed hilarious domestic hijinks of first-time parents, or the supposed heartbreak of first-time parents breaking up, and then the poignant reconciliation, again, at an airport, of first-time parents kissing."}, {"rating": "10", "text": "I think the critics got it wrong.  This movie is really charming, funny, entertaining, and surprisingly not overly sentimental for its tearjerker moments.  Heigl and Duhamel are perfectly cast with no false notes.  I think it's the best thing Heigl's done in film.  The script is great, the direction is solid and even all the minor characters do a fantastic job.  But the biggest surprise is Duhamel who is pitch perfect in the role.  This is a pretty darn good film."}, {"rating": "10", "text": "â"}, {"rating": "8", "text": "i watched the film yesterday, its hilarious and good enough romance. and the lead actors performance is very good, but katherine heigl needs more training too, but josh duhamel is perfect. i like the plot very much...nice rom-com overall"}, {"rating": "2", "text": "The movie can be summed up in one sentence: Moments of fun surrounded by great gaps of boredom. Oftentimes, one wished the story would just move along."}, {"rating": "5", "text": "While it begins charming and fairly clever, it quickly devolves into a messy bitter sweet wallow through the ilk of parenting. Sometimes it still retains some comic fun, but the rest is a frankly uninteresting hour long argument. At least there's a cute baby."}, {"rating": "7", "text": "What can  I say? I did enjoy it. This is just a simple, comedy...it is not in the category of 'smart comedy' and the situation is not very credible, but it is still fun! It is definitely a movie made to 'entertain you', so don't try to find any moral lessons or 'depth' on it .It is merely a movie to watch if you want to relax, lie back, and just forget about things. Over criticism is never good because it is easy to find flaws in something if one really wants to do it. My advice: go and watch it expecting fun...if you don't enjoy it, then is okey, but at least start from a fresh perspective...you may be surprised.."}, {"rating": "3", "text": "Life as We Know It is a cute, predictable romp that you'll forget five minutes after walking out of the theater. There's maybe one scene that'll stick with you."}, {"rating": "8", "text": "Step into the world of sudden parents Messer & Holly who are now taking care of their friends daughter after their sudden death. It's your fairly average rom-com but a creative concept that I haven't seen tackled before. The cast is likable, both Heigl & Duhamel work well together, and while its a tad predictable there are enough shining moments here to make it a solid film. Overall if you like the genre and the stars then give it a go because there's enough here for an enjoyable viewing."}, {"rating": "4", "text": "This movie was lame like a usual comedy from Hollywood. It was watchable but still not such a good movie. Kathrine Heigl was funny and the plot was nice and charming. However, the result is a happy ending which came out sadly bad"}, {"rating": "7", "text": "Katherine Heigl does have talent but her rom-coms are 'tedious' and uneven, she needs to get new material that does not have romantic comedy cliche's or a better script that actually has funny jokes.  Remember when Heigl was like able and had hilarious material in \"Knocked Up\"? Or had sparkling chemistry with Seth Rogen? That's the material that she should be doing in her comedies. But her romantic comedies are old, she should find other memorizing roles. Positives: Heigl and Duhamel definitely have chemistry it's charming to watch. Some of the gags did work for me, but I like too see Heigl take on a more challenging role not doing the same thing with her rom-com's. The direction is stale and un funny. Grade C+"}, {"rating": "8", "text": "One of the my favorite movies I've watched over and over again,the story is a bit of a classic story but I like it.I've always been interested in movies about disagreeable people falling in love with each other.People often have made bad comments on this movie and the score also came quite low and didn't understand why I took so low scores,on me why this movie is giving me pleasure every time I watch I don't think he deserves such a bad comment.The film makes me laugh and also touches some scenes and my point is 7.8"}], "recommendations": ["the_holiday", "friends_with_benefits", "17_again", "silver_linings_playbook", "we_bought_a_zoo", "little_miss_sunshine", "juno", "palm_springs", "last_vegas", "sisters", "instant_family", "no_strings_attached", "life_of_the_party", "last_christmas", "seeking_a_friend_for_the_end_of_the_world", "chef", "spanglish", "sleeping_with_other_people", "how_to_be_single", "you_again", "blockers", "wanderlust", "the_intern", "just_like_heaven", "the_big_sick"]}