{
  "id": 2619,
  "title": "Life",
  "starring": [
    "Jake Gyllenhaal",
    "Ryan Reynolds"
  ],
  "runtime": 104,
  "genre": [
    "Horror",
    "Science Fiction",
    "Mystery",
    "Thriller"
  ],
  "description": "The six-member crew of the International Space Station is tasked with studying a sample from Mars that may be the first proof of extra-terrestrial life, which proves more intelligent than ever expected.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wztfli5NgYDgurVgShNflvnyA3Z.jpg",
  "categories": {
    "plot": 8.833333333333334,
    "acting": 8.6,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The thing I love about the movie Life is that it’s not completely a comedy. It’s what you would expect with a cast of comedians including, Eddie Murphy, Martin Lawrence, Bernie Mac and more. There are definitely funny parts but it also has a lot of sweet elements to it and a good plot. It’s a typical story of two strangers in completely different lives that are forced together, except, these two are forced together for life in a prison. The movie spans almost 60 years but it never feels slow. It’s a very enjoyable movie that is easy to see multiple times. Eddie Murphy and martin Lawrence give great performances and they work well together. I recommend it for anyone who wants a laugh and a good story."
    },
    {
      "rating": "8",
      "text": "Eddie & Martin act perfectly together in Life, a comedy drama about getting framed, making friends, doing some hustling and escaping from your problems to enjoy life like everyone else is. You'll see what I mean, if you haven't seen the movie yet."
    },
    {
      "rating": "8",
      "text": "When Ray and Claude are standing on a box of bottles, Claude mentions that a one of his toes has slipped into one of them. This actually happened during the take, but Martin Lawrence kept going, despite Eddie Murphy's laughing, which is genuine."
    },
    {
      "rating": "8",
      "text": "Factual Errors Sylvia wants a engagement ring in the opening scene in 1932. Engagement rings wasn't traditional for wedding engagements until De Beers started an ad campaign in 1938."
    },
    {
      "rating": "8",
      "text": "ohgyftgihufyguhijjokpkpjihutwwtguguhihihiopppjohohojhihi--------------------------"
    },
    {
      "rating": "8",
      "text": "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$°°°°°°°°°°°°°°°°°°°°°°°°°°°°°》》》》》》》》》》》》》》》》》"
    },
    {
      "rating": "8",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "8",
      "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"
    },
    {
      "rating": "10",
      "text": "I was surprised when I found out it was a comedy. Although it includes comic elements, I found it fairly moving. The viewer is taken on a real journey with the characters."
    },
    {
      "rating": "10",
      "text": "One of Eddie Murphys and Martin lawrences best films....perhaps theyre stongest it goes to show that life is a mother fu**er"
    },
    {
      "rating": "7",
      "text": "With a movie like Life we expect comedy and drama with it's cast, but Life comes pretty dark and comedic for a comedy."
    },
    {
      "rating": "10",
      "text": "This movie is simply amazing. It is one of the most epic comedies I have ever seen, with vivid and diverse characters and many comedy greats. I am surprised that this is not better known for the amazing movie it is. It contains many deep themes one would not expect in a movie with Eddie Murphy and Martin Lawrence especially (considering some of his career moves). It also has many emotional and dramatic moments that supercede its purpose as a comedy. Robert Ramsey and Matthew Stone have crafted one of the greatest surprises of the 1990's by making this movie encompassing and memorable. Sure, its slow. But it is also tender, and has a great ending. It doesn't deserve a 3.5 so I'm giving it a ten to restore confidence in what should be a classic."
    },
    {
      "rating": "8",
      "text": ",,,,,,,,,,,,,,,,,,,,,...........@#$%^&*()€£_=÷×+-\":;!?▪☆⊙°•¤■□●○▪●●♤♡◇♧¡¿《》》{}[]~`●■•⊙°•●■●□▪•°"
    },
    {
      "rating": "8",
      "text": "Really funny, messed up and kind of sad. Back in like the 1930's getting charged for a murder they didn't commit. They get life, and spend life trying to figure out how to get out."
    },
    {
      "rating": "8",
      "text": "niubuguggugiihhihiihugugugug.............................,?!;;:\"\"'-@#$%^&*())₩¥¥£€__/=÷×+▪○●□■☆⊙°•¤《》♡◇♧¤"
    },
    {
      "rating": "8",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    }
  ]
}